{
  "url": "https://www.latimes.com/california/story/2025-08-14/relentless-train-horn-torments-l-a-neighborhood-man-behind-it-says-its-a-cry-for-help",
  "authorsByline": "By Nathan SolisStaff Writer  Follow",
  "articleId": "77438df921bb41a6a0717dbf5a5847ba",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/fff5ab3/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F75%2F65%2F210a26724608a1f26b6924ba0f79%2F1518287-me-van-nuys-train-horn-04-mjc.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T01:16:08.171000+00:00",
  "addDate": "2025-08-15T01:20:48.675165+00:00",
  "refreshDate": "2025-08-15T01:20:48.675166+00:00",
  "score": 1.0,
  "title": "A man blaring a train alarm torments L.A. neighborhood. Then he was arrested",
  "description": "Neighbors and police said they were concerned about the man's well-being, but he refused to stop setting off the loud horn.",
  "content": "Law enforcement officials removed 10 horns from this house on Peach Avenue in Van Nuys on Thursday. Three horns as loud as train horns were attached to a backyard tree that was blowing at all hours of the day disrupting the neighborhood.\n\nA quiet Van Nuys neighborhood of manicured lawns, palm trees and single-family homes has been embroiled in a noisy squabble over a train horn that one homeowner has affixed to a tree and used to set off drawn-out blares at irregular intervals.\n\nWhile the window-rattling blasts over the last two months have drawn complaints and calls to police, they have also garnered concern from Peach Avenue neighbors over the well-being of the homeowner.\n\nThe latest chapter in the train horn saga took place Wednesday when Los Angeles police arrested Gary Boyadzhyan, 50, an unemployed car technician, who set off the horn after previously promising to keep it silent. In an interview with The Times, he described the drama as a “cry for help” and alluded to being “wronged” by someone, without elaborating.\n\n“He’s a nice guy who is just going through something,” a neighbor said about Boyadzhyan, echoing the sentiment of most neighbors.\n\nBoyadzhyan attached his setup, similar to a big-rig or train horn, to a palm tree in his backyard. The horn hangs over his one-story home.\n\nSince June, Boyadzhyan has set off the horn in long belches in the late afternoon or at night, according to neighbors on Peach Avenue, an otherwise quiet residential area.\n\n“I didn’t know where it was coming from all this time,” neighbor Clara Espinoza said about the horn as she walked by Boyadzhyan’s home. She watched as three officers marched up to his door.\n\n“Oh, it’s Gary’s house,” Espinoza said with a note of surprise. She’s lived in the neighborhood for 24 years and couldn’t pinpoint the source the horn blasts. She had planned to call police and noted that the frequency of the horn had increased in the last few weeks.\n\n“He’s a nice enough man and I say hello to him whenever I walk by,” she said. “You know this is in the Book of Revelations. The horns. Well, trumpets. But it’s like the same thing. It’s alarming.”\n\nThe officers knocked on his door for several minutes.\n\n“We just want to talk,” one of the officers said as a Times reporter watched from the sidewalk.\n\nBoyadzhyan appeared at his door in shorts and a T-shirt. He spoke to the officers for several minutes. After the conversation, Officer Chase Lambert said the call to the residence was over a neighborly dispute. He and other officers declined to elaborate on the dispute.\n\n“We are aware,” Lambert said motioning to the property and the horn. “There are things that are being worked on to alleviate the horn issue.”\n\nBoyadzhyan answered his door and spoke to a Times reporter about his visit with the LAPD.\n\n“I have an issue with LAPD Van Nuys,” he said, referring to the Police Department’s local bureau. “I also have a legal case that’s ... it’s over a person who wronged me and it cost me everything. It cost me my job. Everything.”\n\nHe did not elaborate about the situation and why he is setting off his horn and other alarms from his property. He added that he’s an out-of-work car technician and that the whole situation with the horn is a “cry for help.”\n\n“If they were concerned, they could have come over to talk with me,” he said about his neighbors. “Instead, I have strangers knocking here, police, reporters.”\n\nWhen asked whether he planned to keep the horn off, he said, “I didn’t have any plans to turn it on right now.”\n\nA few hours later, the horn sounded again, according to his neighbors. LAPD officers arrived at the home, handcuffed Boyadzhyan while he was standing on his front lawn and led him to a police vehicle. The LAPD said he was arrested on suspicion of interfering with a peace officer and disturbing the peace, which are both misdemeanors.\n\nBoyadzhyan was booked into a county jail shortly after 9 p.m. and released on his own recognizance about 5:30 a.m. Thursday, according to jail records. He did not respond to requests for comment.\n\nNews station ABC7 first reported about the train horn on Peach Avenue.\n\nEspinoza, who lives around the corner from Boyadzhyan, said the horn was loud enough to rattle her windows. Another neighbor, who declined to give their name out of privacy concerns, said Boyadzhyan would set off the horn for 20 to 40 intervals at a time. While they acknowledged that the horn was annoying, they’re more worried about Boyadzhyan’s well-being.\n\nBoyadzhyan is often seen walking around his property late at night, sometimes using power tools to garden or working on vehicles in his driveway, according to neighbors.\n\nBefore his arrest, a spokesperson for City Councilmember Imelda Padilla’s office said it had not received any complaints about the horn.\n\n“Our office will be coordinating with appropriate authorities to address these concerns and bring order back to the neighbors on Peach [Avenue] and ensure the individual is offered help,” Padilla said in a statement. “This neighborhood deserves peace and quiet in its homes, and the current situation is unacceptable.”",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/california/story/2025-08-14/border-patrol-conducts-immigration-operation-outside-gov-newsom-event",
    "https://www.latimes.com/california/story/2025-08-14/pro-redistricting-campaign-launch-newsom",
    "https://www.latimes.com/california",
    "https://abc7.com/post/van-nuys-man-continues-blare-horn-neighborhood-lapd-vows-silence-noise/17528231/",
    "https://www.latimes.com/california/story/2025-05-20/l-a-commercial-landlord-ends-baby-shark-tune-to-ward-off-homeless-amid-meeting-with-officials",
    "https://www.latimes.com/california/story/2025-08-14/man-running-from-ice-raid-hit-killed-by-car-on-210-freeway",
    "https://www.latimes.com/california/story/2025-05-29/west-hollywood-shopping-center-unveils-new-device-to-discourage-homeless-from-camping-out-will-it-work"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "train horns",
      "weight": 0.10966751
    },
    {
      "name": "Peach Avenue neighbors",
      "weight": 0.08382231
    },
    {
      "name": "Gary Boyadzhyan",
      "weight": 0.07557032
    },
    {
      "name": "Boyadzhyan",
      "weight": 0.07287129
    },
    {
      "name": "neighbor Clara Espinoza",
      "weight": 0.06939104
    },
    {
      "name": "Peach Avenue",
      "weight": 0.06859639
    },
    {
      "name": "most neighbors",
      "weight": 0.06408696
    },
    {
      "name": "neighbors",
      "weight": 0.06383253
    },
    {
      "name": "LAPD officers",
      "weight": 0.063237906
    },
    {
      "name": "the train horn saga",
      "weight": 0.06115345
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.947265625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.916015625
    }
  ],
  "sentiment": {
    "positive": 0.05372833,
    "negative": 0.733772,
    "neutral": 0.2124997
  },
  "summary": "Law enforcement officials removed 10 horns from a house on Peach Avenue in Van Nuys, California, after a man, Gary Boyadzhyan, an unemployed car technician, set off the train horn after previously promising to keep it silent. The loud, frequent blares have been causing complaints and causing concern among neighbors over the homeowner's well-being. Boyadzyan was arrested on suspicion of interfering with a peace officer and disturbing conduct. He was booked into jail shortly after 9:30am and released on his own recognizance. Neighbors have been concerned about the safety of the homeowner, who has been using the horn since June.",
  "shortSummary": "A quiet Van Nuys neighborhood is gripped by a train horn dispute involving homeowner Gary Boyadzhyan, who attached it to a tree and repeatedly blares its loudest blasts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1243e7e360e44be28bba1c3de5cd4c4c",
  "places": [
    {
      "osmId": "13331887",
      "road": "Peach Avenue",
      "suburb": "Van Nuys Neighborhood Council District",
      "city": "Los Angeles",
      "state": "California",
      "postcode": "91411",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 34.1846561,
        "lon": -118.4674898
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-05-20/l-a-commercial-landlord-ends-baby-shark-tune-to-ward-off-homeless-amid-meeting-with-officials",
      "text": "L.A. landlord stops blasting ‘Baby Shark’ tune to drive off homeless following complaints\n- Share via\nAn otherwise ordinary commercial building at the corner of 11th and Main streets in downtown Los Angeles captured the attention of Los Angeles officials recently for blasting “Baby Shark” to deter homeless people.\nShalom Styles, owner of Styles Barber Lounge and one of the building’s tenants, said the landlord began playing the song on Thursday over a speaker on Main Street just a few feet from a homeless encampment that’s been in place on the sidewalk for more than a year. The situation marks the latest attempt by property owners to keep homeless individuals from loitering or sleeping in commercial zones, an issue they say threatens business.\n“These are thriving businesses, we don’t need to have that stuff over here,” he said of the homeless encampment.\nBut by Monday, the children’s song — a frequent earworm — was no more. Styles said the landlord told him that police had received complaints about the music and he was at risk of being cited for disturbing the peace. He said the landlord wanted to meet with city officials before agreeing to turn the music off.\nThe landlord could not immediately be reached for comment. The Los Angeles Police Department did not immediately respond to a request for comment.\nA spokesperson for Councilwoman Ysabel Jurado, whose district includes the area in question, said a meeting with the landlord and LAPD had taken place but provided no further details.\n“Our housing and homelessness crises impact everyone in this city — as we navigate this, I implore everyone to lead with care and compassion,” Jurado said in a written statement. “My team and I are focused on looking at tackling these issues holistically and plan to create long-lasting solutions to support our unhoused population, but it’s important that as we move through this we don’t lose sight of each other’s humanity.”\nIt was a sentiment echoed by Dennis Oleesky, chief executive of the Los Angeles Mission, who on Monday announced that it planned to team up with Styles to host an event providing free haircuts and grooming services to unhoused people downtown.\n“We know the homelessness crisis has created strain on all sides — for individuals living on the street and for the business owners trying to operate in challenging conditions,” Oleesky said. “We commend Shalom for turning a moment of frustration into an opportunity to serve.”\nOleesky said outreach workers will be at the event to help people who want to get off the street.\n“We all see what’s happening downtown and sometimes it feels overwhelming,” Styles said. “This is our way of helping, not just talking.”\nTensions between business owners and the homeless population have grown over the last few years. In 2019, 7-Eleven made headlines when it began playing loud classical music to chase homeless people from its stores. Other businesses have deployed planters and fences.\nAlthough the unsheltered population in the city of L.A. decreased last year from 32,680 to 29,275, and is projected to decline again this year, residents and business owners continue to express frustration with the city’s handling of the homelessness crisis.\nThose frustrations reached new levels recently with the findings from a court-ordered audit of Los Angeles homeless services that found the city and the Los Angeles Homeless Services Authority lacked adequate data systems and financial controls to monitor contracts for compliance and performance.\nThen there are the recent investigations by The Times into Skid Row Housing Trust and AIDS Healthcare Foundation, which revealed that the properties managed by the two nonprofits were plagued by heating, elevator and electricity failures as well as vermin infestations.\nMore than a week ago, tenants from a building providing permanent supportive housing in Westlake filed a lawsuit against the current and former landlords and property managers for creating what they described as “abysmal living conditions.”\nStill, city officials maintain progress is being made.\nWhen Styles arrived in L.A. to open his barbershop in 2020, the pandemic stymied his plans. A year later, he said he was able to start cutting hair, but by 2022 he and other barbers at his shop began to have issues with homeless people in the area.\nHe said the children’s song that the landlord had been playing was an attempt to bring the city’s attention to the homelessness problem in the area.\nNearby, at Rage Ground, where people pay to vent their anger by breaking dishes and smashing cars, at least one homeless man has defecated and urinated outside the business.\nEmployee Karla Maldonado, 25, said the man also tried to start fires using trash during January’s Palisades and Eaton fires.\n“We tried to call 911 but they just hung up on us,” she claimed.\nMaldonado said she used buckets of water to douse the flames. She said other homeless people in the alley along the warehouse have stolen brooms and coveralls that she said cost up to $100 each. She estimates at least 20 have been stolen.\nAround the corner from Styles’ barbershop was a small encampment where about half a dozen people have been living. Bicycle parts lay in a pile on the sidewalk.\nKenneth Moore, 68, expressed anger and frustration that the business was casting blame on him and others at the encampment for problems that he says have nothing to do with the group.\n“If it’s about the break-ins, that’s not us,” Kenneth Moore, 68, said. “We don’t tolerate that over here, we fix bikes to survive.”\nPassing through the area with his dog, Billy Copeland, 55, became interested in the group’s conversation over homeless services.\nCopeland said a few months ago he was sleeping on a street between Pico Boulevard and 15th Street when cleaning crews came by his block. Fed up, he refused to move.\n“All they do is come by and clean up and document where people are,” he said.\nCopeland said he didn’t budge until workers could help him access a shelter. He said he’s now at a tiny home in Eagle Rock, awaiting permanent housing.\n“That was the only way I could get help,” Copeland said. “I was out here forever, giving my information and all that happened was them coming out to take my stuff.”\nMoore and others say they have been waiting to be placed into permanent housing in some cases for more than two years.\nA spokesman for LAHSA said an outreach team was at the encampment a month ago. He said some people were placed in interim housing but left. It was unclear where they had gone. LAHSA is expected to return to the encampment on Tuesday.\nMoore has grown tired of sitting on a wait list and being shuffled around by the city.\n“You think we like living like this?” Moore said. “We don’t.”"
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-14/border-patrol-conducts-immigration-operation-outside-gov-newsom-event",
      "text": "Border Patrol agents stage show of force at Newsom’s ‘big beautiful press conference’\n- Share via\n- Newsom was announcing California’s response to President Trump’s efforts to take control of the U.S. House of Representatives\n- Mayor Karen Bass asks why border patrol ‘thumbed their nose’ at the governor’s event\n- “WE WILL NOT BE INTIMIDATED,” Newsom’s office posts on X\nAs Gov. Gavin Newsom prepared to announce that he would take on President Trump’s redistricting plans on behalf of California, scores of federal immigration agents massed outside the venue Thursday.\nNewsom was set to speak at the Japanese American National Museum in downtown Los Angeles, when Border Patrol Sector Chief Gregory Bovino, who has been leading the immigration operations in California, arrived in Little Tokyo, flanked by agents in helmets, camouflage, masks and holding guns.\n“We’re here making Los Angeles a safer place since we won’t have politicians that’ll do that, we do that ourselves,” Bovino told a Fox 11 reporter in Little Tokyo. “We’re glad to be here, we’re not going anywhere.”\nWhen the reporter noted that Newsom was nearby, Bovino responded, “I don’t know where he’s at.”\nNewsom’s office took to X to share that agents were outside, posting: “BORDER PATROL HAS SHOWED UP AT OUR BIG BEAUTIFUL PRESS CONFERENCE! WE WILL NOT BE INTIMIDATED!”\nThe apparent raid Thursday, during which one person was detained, comes amid calls from elected officials for an end to renewed immigration operations across the L.A. area. Federal agents have carried out a string of raids over the past week, arresting several people at car washes and Home Depot stores.\nImmigrant advocates and city leaders had hoped such sweeps had stopped with a federal judge’s July order, affirmed by a U.S. 9th Circuit Court of Appeals panel on Aug. 1. The courts ruled that immigration officials cannot racially profile people or use roving patrols to target immigrants.\nIn a press conference outside of the museum following the operation, Mayor Karen Bass said, “there’s no way this was a coincidence.”\n“This was widely publicized that the governor and many of our other elected officials were having a press conference to talk about redistricting, and they decided they were going to come and thumb their nose in front of the governor’s face. Why would you do that? That is unbelievably disrespectful, it’s a provocative act,” Bass said.\n“They’re talking about disorder in Los Angeles,” the mayor said, “and they are the source of the disorder in Los Angeles right now.”\nIn an emailed response, Department of Homeland Security spokesperson Tricia McLaughlin said Bass “must be misinformed.”\n“Our law enforcement operations are about enforcing the law — not about Gavin Newsom,” she said. McLaughlin added that U.S. Customs and Border Protection “patrols all areas of Los Angeles every day with over 40 teams on the ground to make LA safe.”\nNewsom and Democratic allies, including organized labor, were at the Democracy Center at the Japanese American National Museum to announce the launch of a campaign for a ballot measure which, if approved by voters, would redraw the state’s congressional maps to favor Democrats before the 2026 midterms.\nWilliam T. Fujioka, chair of the Board of Trustees of the Japanese American National Museum, was attending the Newsom press conference when federal agents jumped out of SUVs just feet away from him in front of the museum.\nVideo captured of the scene showed federal agents on either side of a man, in a red shirt and jeans, whose hands were cuffed behind his back. As a passerby shouted that they were “cowards,” Bovino said, “well done.”\nCarlos Franco said he works with Angel, the man who was arrested by federal agents, and said Angel was in Little Tokyo delivering strawberries. His delivery van was still parked outside the museum more than an hour after he was arrested, Franco said. Franco came straight to the scene after he received calls that his coworker had been arrested.\n“He was just doing his normal delivery to the courthouse,” Franco said. “It’s pretty sad, because I’ve got to go to work tomorrow, and Angel isn’t going to be there.”\nSaying he was shaken by his friend’s apprehension, Franco advised everyone to “be careful in general, whether you’re undocumented or not.”\nBovino told reporters in Little Tokyo that agents were out conducting “roving patrol duties.” He acknowledged that agents had detained one person and said, “we will patrol anywhere in Los Angeles.” Asked if their presence just happened to coincide with Newsom’s press conference, Bovino said, “breaking the law is not coincidental.”\n“When they break the law, you can expect you’re probably going to get arrested,” he said.\nDHS did not immediately respond to questions about the arrest.\nFujioka said the agents’ appearance in Little Tokyo “is a parallel of what happened in 1942,” and noting that the museum was built on the location where L.A. residents of Japanese descent “were told to come here and put on buses and sent to camps.”\nAt 73, Fujioka is a third-generation Japanese American. He said about 20 people were arrested during Immigration and Customs Enforcement raids two weeks ago at restaurants and businesses in and near Little Tokyo Village Plaza.\n“What’s happening right now is reprehensible,” he said. “One of the fallacies is that this is only targeting Latinos. If you look at the Vietnamese, Cambodian, Hmong, Chinese, even Japanese communities, they’re being picked up right in court.”\nSpeaking with community leaders on L.A.’s Westside early Thursday morning, Bass condemned the continued raids and said she believed they violated the temporary restraining order upheld by the 9th U.S. Circuit Court of Appeals earlier this month.\n“Even though we’ve had two successful court decisions, the administration continues with their unconstitutional behavior. Coming and going to Home Depot stores, continuing to chase people through parking lots, detaining them for no particular reason under the auspices that they could be criminals, [it] comes down to one thing — and that is racial profiling,” Bass said.\nThe Trump administration last week petitioned the Supreme Court to allow mass deportation efforts across Southern California, seeking to lift a ban on “roving patrols” implemented after a lower court found such tactics likely violate the 4th Amendment.\n“We know the next step is to go to the Supreme Court, and we are hoping that we will have a good decision there,” Bass said. “But the question looms before us, even if we do have a positive court decision: ‘Will the administration follow the rule of law?’”\nTimes staff writer Laura J. Nelson contributed to this report."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-14/man-running-from-ice-raid-hit-killed-by-car-on-210-freeway",
      "text": "Man fleeing Home Depot immigration raid is struck, killed by car on the 210 Freeway\n- Share via\nA man was hit and killed on the 210 Freeway on Thursday as he tried to flee federal agents raiding a Home Depot in Monrovia.\nHis death at an area hospital was confirmed Thursday afternoon by Monrovia City Manager Dylan Feik. Monrovia police received reports at 9:43 a.m. of immigration agents approaching the Home Depot, according to Feik, who said an officer observed possible Immigration and Customs Enforcement agents at the site.\nA day laborer who spoke to The Times and asked that his name not be used, citing safety concerns, said he goes to the Monrovia Home Depot every day around 8 a.m. in search of work.\nThis morning started like any other, he said, until he heard people start to yell, “La migra, corre.” (“Immigration, run!”)\nThat’s when the day laborer took out his phone and started to record.\nAlthough he avoided detention, he said he “felt powerless” that he couldn’t help his friends. “It feels horrible — I couldn’t do anything for them other than record what was happening.”\nAs workers scrambled away from the agents, one person fled the hardware store on foot, jumped a concrete wall and entered the eastbound 210 Freeway.\nJust a few minutes later, Monrovia Fire & Rescue responded to a call of a vehicle collision with a pedestrian.\nA motorist, Vincent Enriquez, said he saw the man soon after he was struck and he was still alive.\n“By the time I was passing by ... he must’ve been struck no more than a few minutes prior,” said the driver. “He was still moving.”\nThe person was transported by ambulance to a hospital but did not survive his injuries.\nFeik said in a statement that the city of Monrovia did not have any information on the federal immigration operation.\n“There is no ongoing ICE activity reported in Monrovia at this time, and the City has not received any communication or information from ICE,” he said in a statement.\nPalmira Figueroa, director of communications for the National Day Laborer Organizing Network, said 13 people were detained in the raid.\nImmigration and Customs Enforcement did not immediately respond to The Times’ request for comment.\nThe farmworker who suffered fatal injuries while fleeing an immigration raid in Ventura County was buried in his Mexican hometown.\nImmigrant rights advocates voiced their anger following the fatality.\n“We hold the Trump administration, the Department of Homeland Security and the Home Depot responsible for his death, and they must be held accountable,” said Ron Gochez, a member of Unión del Barrio, an immigrant rights group that patrols neighborhoods to alert residents of immigration sweeps.\n“This is a painful reminder for us that we must continue to boycott the Home Depot due to their complicity to the ICE raids at their stores,” he said. “The Home Depot and the agents that chased the man have blood on their hands.”\nIn July, Jaime Alanís Garcia, 57, was killed during an immigration raid at a farm in Ventura County. The circumstances of his death are still not fully clear, but it sparked concern among immigration advocates.\nAlanís’ family said he was fleeing immigration agents at the Glass House Farms cannabis operation in Camarillo when he climbed atop a greenhouse and accidentally fell 30 feet, suffering catastrophic injury.\nBut the Department of Homeland Security said that Alanís was not among those being pursued and that federal agents called in a medevac for him.\nHome Depots, where immigrant laborers gather in search of work, have been the scene of numerous immigration raids across the region beginning this year."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-05-29/west-hollywood-shopping-center-unveils-new-device-to-discourage-homeless-from-camping-out-will-it-work",
      "text": "West Hollywood shopping center installs chirping device to discourage homeless from camping out. Will it work?\n- Share via\n- A West Hollywood shopping center has installed a device known as the BlueChirper to deter homeless people from hanging out in a stairwell.\n- The device emits a loud chirping sound and flashing blue lights when anyone walks past.\nSome customers walking out of the West Hollywood Trader Joe’s wear annoyed looks on their faces, and it has nothing to do with rising grocery prices.\nThe source of the irritation is a small blue box installed in a stairwell leading to the market, the latest tactic used by property owners to deter homeless people from camping out in the area.\nThe motion-activated device chatters like a loud, anxious cricket as people pass by the shopping center.\n“It’s so annoying,” Jeffrey Howard said as he left the market with his groceries. “It’s like an alarm from a smoke detector that you’re just waiting for somebody to turn off.”\nAnother shopper, Travis Adam Wright, said the device was a poor response to the homelessness problem — and a bad look for West Hollywood — saying it felt like “a jerk’s first response to people living on the street.”\nThe blue box joins a growing list of deterrents deployed by Southern California business owners and property managers who have taken matters into their own hands to address the homelessness crisis.\nIn downtown Los Angeles, a property owner blasted the monotonous children’s song “Baby Shark” to deter camping last month. In 2023, L.A. Metro began blaring loud classical music as part of a pilot program to drive away homeless people from subway stations.\nUsing such novel tactics to push people away from properties has become a topic of controversy.\nSome frustrated merchants seem willing to do anything they can, within the law, to persuade people who they say are bad for business to move along.\nAdvocates for the unhoused call such measures inhuman and say they do nothing to solve the larger homelessness problem.\nMetro’s classical music experiment — which included piano sonatas, symphony orchestra pieces and concertos as well as floodlights — sparked concerns as well as praise. Metro officials defended the tactics, saying the music was not overly loud or unpleasant. It’s unclear whether it reduced the number of homeless people camping near the station.\nCity officials often end up having to undo the unique deterrence measures that violate local rules.\nLast year, Los Angeles officials ordered the removal of more than a dozen steel planters that had been illegally bolted to the ground in a Playa Vista neighborhood to prevent RV parking , and cited those responsible. A few years ago, there was debate after a property owner installed huge planters on a public sidewalk where homeless people congregated.\nAs for the box dubbed the BlueChirper, a spokesperson for the city of West Hollywood said a code enforcement officer is scheduled to visit the stairwell to see if the device complies with the local noise ordinance. If there is a violation, the city will recommend alternatives.\nWest Hollywood spokesperson Joshua Schare said the chirping device is not in line with the city’s response to the homeless population, which includes having nonprofit organizations provide outreach services.\nThe box emits a racket that is devoid of rhythm. The chirping sound is triggered when anyone or anything passes under the motion-sensing device.\nThe property management company at the shopping center learned about the device through news stories and installed it several weeks ago. The company said it is testing out the device, but so far the results seem positive.\n“We are all cognizant of and concerned about the care of our homeless population,” Investors’ Property Services President Robert Warren III said via email. “On the other hand, we have a responsibility to work to provide clean and safe access to and throughout this shopping center.”\nDon’t we all want better for all people who are this impoverished? Los Angeles cannot thrive if there is one community of people safely in homes and another forced onto the sidewalks.\nThe chirper represents one of the not-so-subtle ways property owners and others are making public places feel unwelcome to the unhoused.\nArmrests protruding from the middle of a bus bench or park bench are an understated way of keeping people from lying down, said Esther Margulies, a professor at the USC School of Architecture and Dornsife Spatial Sciences Institute.\nMargulies said she understands the frustration property owners feel when people are trying to seek shelter around their buildings. But she said devices like the chirper represent the private sector trying to solve the problems that should be addressed by local government.\n“By creating these kinds of hostile elements that take people away from shelter or just move them around, we’re not treating the root cause,” Margulies said. “We are diminishing and demeaning the quality of our public environment, because we’re responding to this social and economic problem without treating the cause.”\nThe latest data show there were 75,312 homeless people in Los Angeles County in January 2024, roughly 200 fewer than in the previous year, but about 6,100 more than in 2023.\nIn March, Los Angeles County supervisors approved a $908-million budget for homeless services, including the first rollout of funding under the Measure A sales tax intended to address the city’s homelessness problem.\nSome Santa Monica residents are protesting two new Waymo charging stations using unconventional means, including ‘Stacking the Waymos.’\nThe BlueChirper retails for $400 and was devised out of frustration.\nInventor Stephen McMahon first deployed it outside his Santa Monica condominium complex storage area after a break-in and a neighbor with her infant daughter was assaulted by two men.\nMcMahon initially proposed the solution to his homeowners association board to deter trespassers. Now the retired director of photography is fielding orders for the BlueChirper after teaching himself how to make a circuit board that can emit the annoying sound and flash a blue light.\nHe says the device works as intended at his condo complex.\nThe majority of sales are from women younger than 40 who like the “non-aggressive aspect” of the device, McMahon said.\nHe wishes he didn’t have to resort to this tactic, but feels there has been little done to address the homelessness crisis in Los Angeles County.\n“I don’t want to punish anybody,” McMahon said. “I just want them to go somewhere else, like into the lavishly funded shelters, education and rehab programs that we funded with Proposition 1.”\nHe said he would like to see more people get the help they need through government programs and shelters.\nIn West Hollywood, merchants say the device has managed to deter people from camping in the stairwell that leads to Santa Monica Boulevard and several eateries.\nThe chirping is hardly noticeable at a nearby pizza restaurant with the doors closed. But four businesses away at Waxology Weho, employee Roxanne Moreno said she can hear the sound and finds it embarrassing that this is the solution used to address the homelessness problem in the area.\n“These people are patrons too and this comes across as another step to criminalize homelessness,” Moreno said. “What is the end goal for all of this?”"
    },
    {
      "url": "https://abc7.com/post/van-nuys-man-continues-blare-horn-neighborhood-lapd-vows-silence-noise/17528231/",
      "text": "VAN NUYS, LOS ANGELES (KABC) -- After countless complaints from fed up neighbors, Los Angeles police Wednesday evening arrested a Van Nuys man who has been blasting horns and alarms from his home for months.\nNeighbors along the 6600 block of Peach Avenue say Gary Boyadzhayan has been blasting the sirens intermittently since June.\n\"It's irritating,\" said Bernarda Phipps, who lives right across the street from Boyadzhayan. \"He needs help, but what kind of help does he need?\"\nVideo of the arrest shows Boyadzhayan yelling loudly as he was led away in handcuffs by officers.\nHowever, he was released early Thursday morning on his own recognizance.\nPrior to the arrest, LAPD said it had reached out to other city departments to not only get the noise makers shut down, but to get Boyadzhayan whatever help he needs.\nOn Wednesday morning, hours before the arrest, officers gave Boyadzhayan an administrative citation.\n\"They advised him that if he is using the horn, to stop using the horn because of the disturbance it is causing in the community, advising him not to do that,\" LAPD Capt. Chris Zine said.\nBut that advice only lasted about two hours. By noon, Boyadzhayan was back blaring his horns.\n\"(LAPD) told me they're sending me a ticket for the horn for disturbance in the mail, and I told them I would stop,\" Boyadzhayan told Eyewitness News earlier in the day. \"But I just went back and left them a message... I'm not stopping until justice is served.\"\nWATCH: Neighbors fed up with Van Nuys man who blares horns almost daily\nExactly what that justice is, only Boyadzhayan seems to know. When Eyewitness News asked why he sounds off the alarms, he floated an unsubstantiated story about the mafia trying to kill him and LAPD assisting in the plot.\n\"I need help,\" Boyadzhayan said Tuesday. \"I don't know how else to cry out for it.\"\nThe problem LAPD had in arresting Boyadzhayan is that an officer needed to hear the noise in person. By the time officers arrive, Boyadzhayan turns the alarms off.\n\"That horn's being used intermittently,\" Zine said. \"It's not being used when the officers are present, so the officers can't take enforcement action.\"\nBoyadzhayan apparently left for several hours and when he returned, police were nearby.\n\"He came out and thought everything was over, so he went out and watered his lawn,\" neighbor Bob Donovan said. \"A couple of plainclothes vehicles just pulled up real quick and snatched him on the lawn. He was yelling and screaming and resisting arrest.\"\nThe horns placed high on a tree in Boyadzhayan's backyard haven't been taken down yet.\nLAPD hasn't announced what charges Boyadzhayan is facing.\nFor residents in the neighborhood, silence never sounded so good.\n\"Finally,\" neighbor Jim Phipps said. \"Now we can relax and just live our lives the best way we can.\""
    },
    {
      "url": "https://www.latimes.com/california/story/2025-08-14/pro-redistricting-campaign-launch-newsom",
      "text": "Newsom calls for special November election to block Trump from ‘rigging’ 2026 midterms\n- Share via\n- Gov. Gavin Newsom said California voters will be asked in a Nov. 4 special election to temporarily suspend the congressional maps drawn by the state’s independent redistricting commission.\n- If the effort by Democrats is successful, it could blunt changes in GOP states to boost the number of Republicans in Congress.\nGov. Gavin Newsom, Democratic lawmakers and their allies on Thursday launched a special election campaign urging California voters to approve new congressional districts to shrink the state’s Republican delegation, a move that could determine control of Congress next year and stymie President Trump’s agenda.\nThe special election effort is a response to Republican-led states, notably Texas, pushing at Trump’s behest to redraw their congressional maps to favor Republicans and reduce the number of Democrats in the narrowly divided U.S. House of Representatives.\n- Share via\nSpeaking to a fired-up partisan crowd at the Japanese American National Museum in downtown Los Angeles, Newsom described the effort by Republicans as a desperate effort by a failed president to hold on to power by keeping Congress under his control.\n“He doesn’t play by a different set of rules — he doesn’t believe in the rules,” Newsom said. “And as a consequence, we need to disabuse ourselves of the way things have been done. It’s not good enough to just hold hands, have a candlelight vigil and talk about the way the world should be. We have got to recognize the cards that have been dealt, and we have got to meet fire with fire.”\nThe governor was joined by California’s U.S. senators, Alex Padilla and Adam Schiff; Southern California’s Democrats in Congress, and union leaders who would provide the funding and volunteers for the campaign.\nThe ballot measure, the “Election Rigging Response Act,” would temporarily scrap the congressional districts enacted by the state’s voter-approved independent redistricting commission.\n“We are ready to do whatever it takes to stop this power grab and fight back against any and all attacks on our democracy, on our students and on public education,” said Erika Jones, secretary-treasurer of the California Teachers Assn., which represents 310,000 public school teachers.\nThe gerrymandering plan in California could increase the Democratic Party’s dominance in the state by making five House districts more favorable to Democrats, according to a draft map reviewed by The Times. Those changes could reduce by more than half the number of Republicans representing California in Congress.\nOutside the rally, which took place on a historic site where Japanese American families boarded buses to incarceration camps during World War II, Border Patrol agents gathered and arrested at least one person. Newsom told the crowd inside that he doubted it was a coincidence.\nRepublicans criticized Newsom’s effort as antidemocratic and a thinly veiled attempt to boost a future presidential campaign.\nThe ballot measure, said Christian Martinez, spokesperson for the National Republican Congressional Committee, the campaign arm of House Republicans, is about “consolidating radical Democrat power, silencing California voters and propping up his pathetic 2028 presidential pipe dream.”\nFor Newsom’s plan to work, the Democratic-led state Legislature must vote to place the measure on the Nov. 4 ballot. The final decision would be up to California voters.\nCalifornia should not “stoop to the same tactics as Texas,” said Amy Thoma, spokesperson for the Voters First Coalition, which includes Charles Munger Jr., the son of a billionaire who bankrolled the ballot measure that created the independent commission.\n“Two wrongs do not make a right, and California shouldn’t stoop to the same tactics as Texas. Instead, We should push other states to adopt our independent, nonpartisan commission model across the country,” Thoma said. She said Munger will vigorously oppose any proposal to circumvent the independent commission.\nFormer Gov. Arnold Schwarzenegger, who championed independent redistricting in California and around the country, “believes that the politicians in Texas are ripping off the people with their gerrymander and that California’s best way to respond is by standing with the people, not by stooping to their level and rigging our system against the voters,” said his spokesperson, Daniel Ketchell.\nSince voters approved independent congressional redistricting in 2010, California’s districts have been drawn once per decade, after the U.S. census, by a panel split between registered Democrats, registered Republicans and voters without a party preference.\nThe commission is not allowed to consider the partisan makeup of the districts, nor protecting incumbents, but instead looks at “communities of interest,” logical geographical boundaries and the Voting Rights Act.\nThe current map was drawn in 2021 and went into effect for the 2022 election.\nNewsom is pushing to suspend those district lines and put a new map tailored to favor Democrats in front of voters on Nov. 4. That plan, he has said, would have a “trigger,” meaning a redrawn map would not take effect unless Texas or another GOP-led state moved forward with its own.\nSara Sadhwani, who served on the redistricting commission that approved the current congressional boundaries, said that while she is deeply proud of the work she and her colleagues completed, she approved of Newsom’s effort because of unprecedented threats to democracy.\n“Extraordinary times call for extraordinary measures,” Sadhwani said, citing the immigration raids, the encouragement of political violence and the use of National Guard troops in American cities. “And if that wasn’t enough, we are watching executive overreach that no doubt is making our Founding Fathers turn in their graves. ... These are the hallmarks of a democracy in peril.”\nIf voters approved the ballot measure, the new maps would be in effect for the 2026, 2028 and 2030 elections, until the independent commission redraws the congressional boundaries in 2031.\nTo meet Newsom’s ambitious deadline, the Legislature would need to pass the ballot language by a two-thirds majority and send it to Newsom’s desk by Aug. 22. The governor’s office and legislative leaders are confident in their ability to meet this threshold in the state Assembly and Senate, where Democrats have a supermajority.\nNewsom first mentioned the idea in mid-July, meaning the whole process could be done in about five weeks. Generally, redrawing the state’s electoral lines and certifying a measure to appear before voters on the ballot are processes that take months, if not more than a year.\nIn California, the gerrymandering plan taking shape behind closed doors would increase the Democratic Party’s dominance in the state by making five House districts more favorable to Democrats, according to a draft map reviewed by The Times.\nThose changes could reduce by more than half the number of Republicans representing California in Congress. California has the nation’s largest congressional delegation, with 52 members. Nine are Republicans.\nIn the plans under discussion, a Northern California district represented by Rep. Doug LaMalfa (R-Richvale) could shift to the south, shedding rural, conservative voters near the Oregon border and picking up left-leaning cities in Sonoma County. Sacramento-area Rep. Kevin Kiley (R-Rocklin) would see his district shift toward the bluer center of the city.\nThe plan would also add more Democrats to the Central Valley district represented by Rep. David Valadao (R-Hanford), who has been a perennial target for Democrats.\nSouthern California would see some of the biggest changes: Rep. Darrell Issa (R-Bonsall) would see his safely Republican district in San Diego County become more purple through the addition of liberal Palm Springs. And Reps. Young Kim (R-Anaheim Hills) and Ken Calvert (R-Corona) would be drawn into the same district, which could force the lawmakers to run against each other.\nThe plan would also shore up Democrats who represent swing districts, such as Reps. Dave Min (D-Irvine) and Derek Tran (D-Orange).\nIt could also add another district in southeast Los Angeles County, in the area that elected the first Latino member of Congress from California in modern history. A similar seat was eliminated during the 2021 redistricting.\nTrump’s prodding of Texas Republicans to redraw their maps has kicked off redistricting battles across the nation. That includes Florida, Ohio, Indiana and Missouri, where Republicans control the statehouse, and New York, Maryland, Illinois, New Jersey, Oregon and Washington, where Democrats are in power.\nDemocratic lawmakers in Texas fled the state to block the Republican-led Legislature from approving a new map, preventing it from reaching the quorum necessary to approve the measure.\nA second special session is expected to begin Friday. The absent lawmakers are facing threats of fines, civil arrest warrants and calls for being removed from office.\nTimes staff writer Taryn Luna in Sacramento contributed to this report."
    }
  ],
  "argos_summary": "In Van Nuys, Los Angeles, police arrested Gary Boyadzhayan, a man who had been disturbing his neighborhood with loud train horns attached to a tree in his backyard. Neighbors expressed concern for his well-being, describing the situation as a 'cry for help' amid ongoing complaints about the noise. Boyadzhayan was taken into custody for disturbing the peace and interfering with a peace officer, but was released shortly after. The LAPD is working to address the noise issue while also seeking to provide assistance to Boyadzhayan.",
  "argos_id": "R4I4J0MPK"
}