{
  "url": "https://apnews.com/article/phillies-nationals-score-5a93d8e9ad5644a84f349fb90a73c178",
  "authorsByline": "",
  "articleId": "59f2bcf6435c405494a0cfa1526fb9c4",
  "source": {
    "domain": "apnews.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://dims.apnews.com/dims4/default/67cde43/2147483647/strip/true/crop/4854x2730+0+253/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F29%2Fab%2F7d11df96fa3bb2731d9dba85e82b%2Fdea2cd3895084a61b0e1c65699b09e8f",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T01:16:49+00:00",
  "addDate": "2025-08-15T01:22:27.746516+00:00",
  "refreshDate": "2025-08-15T01:22:27.746518+00:00",
  "score": 1.0,
  "title": "Jose Tena's 2-run single helps Nationals rally for 3-2 win over Phillies",
  "description": "Jose Tena hit a go-ahead, two-run single in the seventh inning, Paul DeJong homered for the third time in five games and the Washington Nationals rallied past the Philadelphia Phillies 3-2.",
  "content": "WASHINGTON (AP) — Jose Tena hit a go-ahead, two-run single in the seventh inning, Paul DeJong homered for the third time in five games and the Washington Nationals rallied past the Philadelphia Phillies 3-2 on Thursday night.\n\nDeJong walked leading off the seventh against Jesus Luzardo (11-6). Riley Adams doubled, Daylen Lile walked and, with one out, Tena singled past the drawn-in infield against Orion Kerkering to put Washington ahead 3-2.\n\nShinnosuke Ogasawara (1-1) struck out Kyle Schwarber with a runner on to end the seventh and got his first major league win. Rookie Cole Henry worked the ninth and fanned Trea Turner with a runner on third to secure his first career save.\n\nTurner had three infield hits for the National League East-leading Phillies, who have lost three straight while scoring three runs. Philadelphia left eight men on base.\n\nLuzardo allowed three runs on four hits in six-plus innings.\n\nThe Phillies didn’t arrive in Washington until early Thursday afternoon after maintenance issues necessitated a change in planes and an overnight stay in Cincinnati after Wednesday night’s game.\n\nDeJong homered on the first pitch he saw from Luzardo in the fourth to tie it at 1-all.\n\nTurner singled with two outs in the fifth and scored on Schwarber’s double off the wall in center.\n\nWashington starter Brad Lord allowed two runs on seven hits over six innings. Since returning to the rotation on July 22, Lord has a 2.77 ERA and Washington is 4-1 in his starts.\n\nTena hit a hard grounder the opposite way on a 3-1 fastball and got it past the diving Turner at shortstop.\n\nDeJong has hit safely in five straight, going 9 for 21 (.429) with three homers and seven RBIs.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/phillies-nola-a6cc879d6afda51f41345b9ff3a5a2d2",
    "https://apnews.com/article/mariners-orioles-score-cb9f2961c6c91391f1d3c8c9dc752828",
    "https://apnews.com/hub/mlb",
    "https://apnews.com/article/cubs-blue-jays-score-78464ab305ed566c7cff450ed1289b71"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Washington starter Brad Lord",
      "weight": 0.08581174
    },
    {
      "name": "Trea Turner",
      "weight": 0.076560974
    },
    {
      "name": "Jose Tena",
      "weight": 0.07587993
    },
    {
      "name": "Washington",
      "weight": 0.07529258
    },
    {
      "name": "Paul DeJong",
      "weight": 0.07205538
    },
    {
      "name": "Kyle Schwarber",
      "weight": 0.07102239
    },
    {
      "name": "early Thursday afternoon",
      "weight": 0.07016513
    },
    {
      "name": "Tena",
      "weight": 0.070011586
    },
    {
      "name": "Turner",
      "weight": 0.06844044
    },
    {
      "name": "Thursday night",
      "weight": 0.066683926
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Philadelphia Phillies"
    },
    {
      "name": "Baseball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98291015625
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9453125
    }
  ],
  "sentiment": {
    "positive": 0.29836535,
    "negative": 0.25835854,
    "neutral": 0.44327608
  },
  "summary": "The Washington Nationals defeated the Philadelphia Phillies 3-2. Jose Tena's two-run single and Paul DeJong's third consecutive home run helped the win. Shinnosuke Ogasawara secured his first major league win by fending out Trea Turner for the Nationals. The Phillies had to delay their arrival in Washington due to maintenance issues.",
  "shortSummary": "Jose Tena's 2-run single led the Washington Nationals to a 3-2 win over the Philadelphia Phillies, with Paul DeJong homered for the third time in five games.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d841751e9deb49c9b73b5ab134a9ea79",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/cubs-blue-jays-score-78464ab305ed566c7cff450ed1289b71",
      "text": "Vladimir Guerrero Jr. homers as Max Scherzer and the Blue Jays beat the Cubs 2-1\nVladimir Guerrero Jr. homers as Max Scherzer and the Blue Jays beat the Cubs 2-1\nTORONTO (AP) — Vladimir Guerrero Jr. hit a two-run homer in the seventh inning, helping Max Scherzer and the Toronto Blue Jays beat the Chicago Cubs 2-1 on Thursday.\nGuerrero’s big hit off Matthew Boyd lifted AL East-leading Toronto to the series victory. It was the 20th homer of the season for the All-Star slugger.\nScherzer (3-2) pitched seven-plus innings while improving to 6-2 in 12 career starts against the Cubs. He permitted one run and five hits.\nJeff Hoffman handled the ninth for his 27th save in 32 chances. Toronto improved to 40-20 at home.\nBoyd (11-6) allowed two hits in seven innings. He struck out five and walked one.\nBoyd walked Davis Schneider to begin the seventh. Ernie Clement followed with a sacrifice bunt before Guerrero lined an 0-2 pitch 402 feet to left-center.\nThe Cubs had just one hit off Scherzer before Michael Busch went deep with one out in the sixth for his 24th homer.\nPromoted from Triple-A Iowa before the game, Cubs prospect Owen Caissie made his major league debut about 30 miles east of his birthplace in Burlington, Ontario. He went 0 for 4 with a strikeout.\nKey moment\nScherzer exited after Matt Shaw’s leadoff double in the eighth. Brendon Little came on and walked pinch-hitter Seiya Suzuki before both runners advanced on a wild pitch. Little departed after striking out Ian Happ and Kyle Tucker. Seranthony Domínguez fanned Carson Kelly to end the threat.\nKey stat\nThe Blue Jays are a major league-best 24-12 in interleague play.\nUp next\nCubs: RHP Colin Rea (9-5, 4.09 ERA) is scheduled to start Friday against Pirates RHP Braxton Ashcraft (3-2, 3.19 ERA).\nBlue Jays: RHP Chris Bassitt (11-6, 4.18 ERA) is expected to start Friday against Rangers RHP Jacob deGrom (10-5, 2.86 ERA).\n___\nAP MLB: https://apnews.com/MLB"
    },
    {
      "url": "https://apnews.com/article/phillies-nola-a6cc879d6afda51f41345b9ff3a5a2d2",
      "text": "NL East-leading Phillies going with a 6-man rotation when Aaron Nola returns on Sunday\nWASHINGTON (AP) — Phillies manager Rob Thomson said Thursday that he will utilize a six-man rotation beginning this weekend when Aaron Nola returns from the injured list.\nNola is lined up for the series finale Sunday at Washington. The 32-year-old right-hander is coming back from a right ankle sprain.\nLeft-hander Ranger Suárez takes the mound on Monday against the Mariners. The NL East leaders also have ace right-hander Zack Wheeler, lefties Cristopher Sánchez and Jesús Luzardo, and right-hander Taijuan Walker.\nThomson said he isn’t sure how long he is going to use the six-man rotation.\n“Once for sure and then we’ve got some other ideas how to attack this thing as we move forward,” he said.\nPhiladelphia starters lead the majors with 687 1/3 innings pitched. Sánchez is up to 150 2/3 innings, and Wheeler is at 144 2/3.\n“Just getting some of these guys some extra rest cause we’ve been grinding on them pretty hard all year,” Thomson said before the opener of a four-game set against the Nationals. “The one downside to it is you’ve got to take somebody out of your bullpen, so you’re a little short there but we’ll just have to figure it out.”\nNola hasn’t pitched in the majors since May 14. He posted a 2.19 ERA in three rehab starts with Triple-A Lehigh Valley while striking out 17 batters in 12 1/3 innings.\n___\nAP MLB: https://apnews.com/MLB"
    },
    {
      "url": "https://apnews.com/article/mariners-orioles-score-cb9f2961c6c91391f1d3c8c9dc752828",
      "text": "Tomoyuki Sugano earns 10th victory as Orioles outlast Mariners 5-3 after long rain delay\nTomoyuki Sugano earns 10th victory as Orioles outlast Mariners 5-3 after long rain delay\nBALTIMORE (AP) — Rookie Tomoyuki Sugano earned his 10th victory by working 5 1/3 sharp innings before a lengthy rain delay, and the Baltimore Orioles defeated the Seattle Mariners 5-3 on Thursday.\nJulio Rodríguez homered for Seattle, which has dropped consecutive games since winning eight in a row. The Mariners (67-55) fell 1 1/2 games behind AL West-leading Houston.\nCatcher Cal Raleigh, who leads the majors with 45 home runs, was out of Seattle’s starting lineup for only the fifth time this season. He walked as pinch-hitter in the ninth.\nSugano (10-5) won back-to-back starts for the first time. The 35-year-old from Japan threw 81 pitches and was pulled after the 2-hour, 18-minute delay.\nRodriguez hit reliever Rico Garcia’s fourth pitch after play resumed into the bleachers in right-center, a two-run shot to bring the Mariners within 5-2.\nDietrich Enns allowed Randy Arozarena’s one-out RBI grounder in the ninth, but retired Josh Naylor on one pitch to earn his first save since Sept. 20, 2021.\nThe Orioles took the lead against Logan Evans (6-5) in the fourth inning. Jordan Westburg scored on Evans’ two-out wild pitch, and Ryan Mountcastle moved from first to third on the same play when Evans couldn’t field catcher Mitch Garver’s throw. After Daniel Johnson walked, Mountcastle scored when he and Johnson executed a double steal. Johnson came around on Jeremiah Jackson’s RBI single.\nBaltimore added Gunnar Henderson’s RBI double and Mountcastle’s sacrifice fly in the fifth.\nEvans allowed three runs --- two earned --- in four innings and matched the shortest outing of his 15-start career.\nKey moment\nOrioles reliever Keegan Akin got Naylor to ground out to second to end the seventh, stranding two runners and preserving a 5-2 lead.\nKey stat\nSugano is 3-0 with a 2.31 ERA in his last four starts.\nUp next\nMariners RHP Luis Castillo (8-6, 3.19 ERA) starts the opener of a three-game series against the host New York Mets. Baltimore has not announced its pitching plans for Friday’s game at Houston.\n___\nAP MLB: https://www.apnews.com/hub/MLB"
    }
  ],
  "argos_summary": "The Washington Nationals defeated the Philadelphia Phillies 3-2, with Jose Tena hitting a go-ahead two-run single in the seventh inning and Paul DeJong contributing a home run. The Phillies, who have lost three consecutive games, left eight men on base despite Trea Turner achieving three infield hits. In another game, the Toronto Blue Jays triumphed over the Chicago Cubs 2-1, thanks to Vladimir Guerrero Jr.'s two-run homer and Max Scherzer's strong pitching performance.",
  "argos_id": "RPDOCYUOI"
}