{
  "url": "https://www.nytimes.com/athletic/6554464/2025/08/14/patriots-defense-mike-vrabel-struggles-vikings/",
  "authorsByline": "Chad Graff",
  "articleId": "d4361e46c3a845d59ae368b389ad5bd3",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/14181053/GettyImages-2226797261-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:21:31+00:00",
  "addDate": "2025-08-14T22:31:37.723494+00:00",
  "refreshDate": "2025-08-14T22:31:37.723496+00:00",
  "score": 1.0,
  "title": "Red flags abound for Mike Vrabel, Patriots defense after struggles in Minnesota",
  "description": "The Patriots are going to have to rely on their defense to keep them in games this season. The unit did not look good Thursday in Minnesota.",
  "content": "EAGAN, Minn. — Mike Vrabel came out of the New England Patriots’ first joint practice in Minnesota mostly optimistic.\n\nSure, the offense struggled as the O-line got worked and receivers struggled to get open, but second-year quarterback Drake Maye kept his cool against the league’s most complex defense and put his team in the right spots while leaning on rookie TreVeyon Henderson for big plays.\n\n“It’s easy to go into a blender when you’re seeing a bunch of this stuff and scrambling and turning one less-than-favorable play into a real s–t storm,” Vrabel said. “I didn’t see that (from Maye).”\n\nBesides, despite the offensive struggles, Vrabel could walk away from Wednesday’s practice in a decent mood because the other side of the ball was so good.\n\nBased on the first three weeks of practice, the Patriots will have to lean on their defense. That’s where they spent the most money this offseason to revamp the roster. That’s where more talent resides. That’s supposed to be their strength, buying time for the offense to sort things out with two rookies on the left side of the line and a young quarterback learning a new scheme.\n\nBut the second joint practice this week threatened to strip the confidence that came from the defense’s recent momentum. In short, the second of two sessions with the Vikings yielded the Patriots’ worst practice of the summer.\n\nYes, the offense struggled again. Maye was pressured so often, it might’ve been easier to chart the few dropbacks that came with a clean pocket. The unit was mostly forced to dink and dunk its way around since the O-line didn’t block well and the receivers struggled to get open — and, in DeMario Douglas’ case, dropped passes.\n\nBut that’s not the real concern coming out of the last two days. The offense was expected to struggle against the complex and talented Vikings group that Brian Flores oversees.\n\nInstead, the real worry is the way the defense played Thursday. J.J. McCarthy, Minnesota’s young quarterback who had struggled against his own defense, suddenly looked like a star against New England. In full team drills, he completed 17 of 20 passes for six touchdowns.\n\nAnd that wasn’t all. Vikings coach Kevin O’Connell shouted out his team’s success in the running game, too.\n\nAs we’ve said multiple times in recent days, it’s unwise to put too much stock into any one practice. But since the league-wide trend began of de-emphasizing preseason games, these joint practices have become the best checkpoint for how a team is faring as the season approaches.\n\nOn Wednesday, the Patriots put pressure on McCarthy and disrupted him to the point that it mostly shut down the Vikings offense. On Thursday, however, McCarthy had plenty of time in the pocket.\n\nThat might be what we get from the New England pass rush this season: some solid days where things click, but not enough talent across the board to be consistently good.\n\nIn the secondary, the Pats were beaten all over the field. Tight end T.J. Hockenson was a matchup nightmare and frequently beat cornerback Marcus Jones. Receiver Jordan Addison gave them fits. The Vikings even hit their running backs for some nice gains. Sure, the Pats were without Christian Gonzalez, but the Vikings were without Justin Jefferson.\n\nBeyond that, it’ll be interesting to see what New England does at safety. Jabrill Peppers was absent from Thursday’s practice, but even then, Kyle Dugger didn’t crack the starting lineup. The 29-year-old safety who could once make a case as being the best player on the team is now buried on the depth chart. Jaylinn Hawkins and fourth-round pick Craig Woodson seem to be ahead of Dugger for playing time. Peppers is too.\n\nSixteen months after the Patriots signed Dugger to a four-year extension, that contract has already aged poorly. And there’s not a lot that the Pats can do to get out of it this year. If they cut him, they’d incur more than $14 million in dead money with just $1 million in cap savings. And it’s not like they need additional cap space right now.\n\nWhat does Dugger need to do better? “I think just making sure that he’s where he needs to be and understanding the coverage concepts and everything we do,” Vrabel said.\n\nIf the Patriots coaches don’t think he’s one of their best options, fine. But the defense can’t play like it did on Thursday.\n\nAfter ranking last in the NFL in sacks a year ago, the franchise’s decision-makers understood they couldn’t completely fix the pass rush in one offseason. So their plan was to get better on the interior. Let Milton Williams and Christian Barmore go to work there and hope to get something out of the patchwork of edge rushers.\n\nThis offseason, though, the Vikings invested in the interior of their O-line (they got rid of Garrett Bradbury, now the Patriots’ starting center), and that unit showed up on Thursday against New England’s interior rush.\n\nWith little pressure, McCarthy had plenty of time to pick apart the defense. And in fairness to him, some of his throws were impressive. But the Patriots also made it way too easy on him.\n\nThis isn’t the end of the world for the Patriots defense. O’Connell runs one of the best offensive schemes in the NFL. Their O-line is good. Their running backs are good. Their pass catchers are good, even without Jefferson. So this was always going to be a tough challenge, even if McCarthy hadn’t looked great entering these practices.\n\nBut with an offense that is probably going to be up and down, the Patriots need to rely on their defense. And to do that, they need a lot more than what they put on the field Thursday.",
  "medium": "Article",
  "links": [
    "https://twitter.com/ChadGraff/status/1956068889059844560?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6552056/2025/08/13/patriots-vikings-drake-maye-offensive-line/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Patriots defense",
      "weight": 0.084659636
    },
    {
      "name": "Patriots",
      "weight": 0.06664594
    },
    {
      "name": "practice",
      "weight": 0.06194871
    },
    {
      "name": "New England",
      "weight": 0.061273128
    },
    {
      "name": "Vikings coach Kevin O’Connell",
      "weight": 0.059032794
    },
    {
      "name": "Vikings",
      "weight": 0.05563383
    },
    {
      "name": "full team drills",
      "weight": 0.05369267
    },
    {
      "name": "Mike Vrabel",
      "weight": 0.051334526
    },
    {
      "name": "-line",
      "weight": 0.050757345
    },
    {
      "name": "playing time",
      "weight": 0.049010534
    }
  ],
  "topics": [
    {
      "name": "NFL"
    },
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97265625
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9482421875
    }
  ],
  "sentiment": {
    "positive": 0.05734749,
    "negative": 0.74769884,
    "neutral": 0.19495368
  },
  "summary": "The New England Patriots' first joint practice in Minnesota was held down by the O-line and receivers struggled. However, second-year quarterback Drake Maye remained calm and led his team in the right positions against the league's most complex defense. Despite the offensive struggles, the defense performed well, with J.J. McCarthy completing 17 of 20 passes for six touchdowns in full team drills. The Patriots' defense, which they spent most in the offseason to add talent, struggled well against the Vikings. The team's defensive performance also raised concerns, particularly as it was expected to struggle against a strong Vikings group. In the secondary, the Patriots were beaten all over the field by tight end T.J.-Hockenson, receiver Jordan Addison, and defensive player Jabrill Peppers. The defense's performance has raised concerns for the future of the team.",
  "shortSummary": "Despite a mixed bag of performances from the New England Patriots in Minnesota, questions arise about their defensive stability and offensive struggles, particularly from Drake Maye and J.J.Hockenson.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7dd27e96c9104998b5237efbcd592af9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6552056/2025/08/13/patriots-vikings-drake-maye-offensive-line/",
      "text": "EAGAN, Minn. — New England Patriots quarterback Drake Maye took the snap and quickly faced pressure from his left, where rookie linemen Will Campbell and Jared Wilson had their hands full against Jonathan Greenard and Brian Flores’ Minnesota Vikings defense on Wednesday.\nGreenard split the two youngsters and forced Maye to roll to his right, where another Vikings defender was there for the would-be sack. Play over. A loss of 6 yards.\nAdvertisement\nExcept in these joint practices, tackling to the ground isn’t allowed (especially with quarterbacks) and plays aren’t blown dead just because of a would-be sack. So while Vikings defenders celebrated in the backfield, Maye continued to roll out and delicately flicked a pass 30 yards downfield into the arms of Kayshon Boutte for what would’ve been a big gain, sack notwithstanding.\nAt the risk of making too much of one play, these are some of the problems this improved Patriots offense still could face this season. And this is why, despite so much that has changed for the better, it might take some time for this group to jell into one of the NFL’s better units.\nAt practices like Wednesday’s on the sun-soaked fields in Minnesota, Maye’s ability is obvious. He throws the ball downfield with ease, and his mobility will help when he is inevitably rushed. Give him time, and he can carve up a defense.\nOn the money 💰 @DrakeMaye2 | #NEPats pic.twitter.com/oRphUcxeOY\n— New England Patriots (@Patriots) August 13, 2025\nBut even with four new expected starters up front following last year’s debacle, Wednesday suggested that there will likely be some bumps ahead for this offensive line.\nSure, going up against the Vikings was always going to be a difficult task. Greenard has been wrecking his own team’s practices in training camp, and everyone in New England knows how good Flores’ scheme can be. But the domination was so thorough by the Vikings’ front seven that three straight plays at one point would’ve resulted in a sack.\nThat likely means the Patriots won’t have much time to work the ball downfield. Yes, Maye’s arm strength is a weapon, but it might have to be put on ice a bit until Josh McDaniels can trust the O-line to give his quarterback (and receivers) enough time.\n“Some good, some bad,” new Patriots center Garrett Bradbury said, summing up the day. “It was a good test.”\nAdvertisement\nThis isn’t to say all hope is lost for the Patriots this season. Their defense similarly dominated the Minnesota offense on Wednesday, routinely disrupting young quarterback J.J. McCarthy’s rhythm.\nAnd even if it wasn’t the offensive outbreak New England wanted, there’s still reason for hope. Rookie running back TreVeyon Henderson is the big-play threat the Patriots have lacked for years. He has the game-breaking ability to overshadow a lot of the hiccups that could come for this offense.\nAfter New England struggled in 11-on-11 drills to start practice, the two teams wrapped up with a two-minute drill. Down three points, 70 yards to go. It seemed a daunting task for a Patriots offense that struggled to move the ball for most of the day.\nBut the Patriots hit a swing pass to Henderson, who had no one around him, and he turned what looked like a simple throw into a 70-yard touchdown. Earlier, Henderson had an impressive downfield catch in seven-on-seven drills.\n“When we blocked it up, there were some big home runs,” Bradbury said.\nFor now, that might have to be the Patriots offense in a nutshell. Stay on schedule with short and intermediate passes, mostly to Stefon Diggs and DeMario Douglas. Use Rhamondre Stevenson to pick up 4 or 5 yards on inside carries. But when it’s time to take a shot, the Patriots offense might have to lean on a rookie running back.\n“It keeps the defense honest — it’s hard for them,” Maye said of using Henderson as a pass catcher.\nPerhaps it should be expected that the offense starts a bit slow. Maye is still just 22 years old, a second-year quarterback in a new scheme with a new coordinator. The receiving corps, while improved, still doesn’t inspire much fear in defensive coaches. And the offensive scheme under McDaniels, while presumably better than what they had a year ago, will take time for players to master.\nAdvertisement\nPlus, unlike a year ago, there’s hope that the offensive line will get better and mesh as the season goes along. Wilson and Campbell are getting their first tastes of a pro scheme. Putting them against a Flores defense in August is akin to drinking from a fire hose. But their athletic profile and upside offer hope that they’ll improve as they grow more accustomed to NFL pass rushes.\nStill, that could leave the Patriots in a tough spot early in the season. They’re going to need Maye to be mobile and scramble at times without taking too many hits. And they’re going to need Henderson to provide explosiveness while the passing game centers on shorter, over-the-middle throws. That goes against one of Maye’s biggest strengths: pushing the ball downfield.\nA rebuild doesn’t happen overnight. The early signs from camp and Wednesday’s joint practice are that it may take some time for the Patriots offense to truly start humming. Still, Maye sees it as part of the growth process.\n“I think it was good for us to see a defense that does a lot of things,” Maye said. “They got us a few times, but we got them (at times). … It’s great for us to learn from.”\n(Photo: David Berding / Getty Images)"
    }
  ],
  "argos_summary": "Mike Vrabel expressed optimism after the New England Patriots' first joint practice with the Minnesota Vikings, despite offensive struggles highlighted by quarterback Drake Maye facing pressure and receivers having difficulty getting open. However, the second practice revealed significant concerns as the defense faltered, allowing Vikings quarterback J.J. McCarthy to excel, raising doubts about the Patriots' defensive consistency. With a young offensive line and a rookie quarterback, the Patriots may face challenges early in the season, relying on big plays from rookie running back TreVeyon Henderson while the offense develops.",
  "argos_id": "RS8X5RPCQ"
}