{
  "url": "https://www.cnet.com/tech/mobile/see-what-happens-when-you-fold-and-unfold-the-samsung-galaxy-z-fold-7-200000-times/",
  "authorsByline": "Imad Khan",
  "articleId": "9c1eddcc76cf4a9f867284a34e02c805",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/7bd854e792ea6b64a3df4cb05b7b5e37b1993052/hub/2025/07/11/74a33fdc-b881-41f8-b92a-8d98e4cedd91/samsung-unpacked-2025-day-2-22.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:45:00+00:00",
  "addDate": "2025-08-14T23:52:29.499094+00:00",
  "refreshDate": "2025-08-14T23:52:29.499095+00:00",
  "score": 1.0,
  "title": "Here's What Happens When You Fold the Samsung Galaxy Z Fold 7 200,000 Times",
  "description": "We're a little concerned about the \"unknown black liquid\" that leaked out of the phone's hinge when a YouTuber tested it.",
  "content": "After folding and unfolding the Samsung Galaxy Z Fold 7 200,000 times by hand, Korean YouTube channel Tech-it found that the folding phone's redesigned hinge and thinner design couldn't withstand repeated handling.\n\nThe stunt, which was livestreamed over the course of a few days, found that the phone would reboot every 6,000 to 10,000 folds. At 46,000 folds, the phone started to creak. At 75,000 folds, an unknown black liquid started to leak out of the hinge. At 175,000 folds, all speakers, including the earpiece, stopped working. At the end of the experiment, the folding mechanism did become smoother, and the ability to hold its shape at any angle still worked. The findings were uploaded to a publicly available Google Doc.\n\n\"Although it would have been possible to build a machine to do the folding, we chose not to,\" said Tech-it host Hyeonseo Chae, who goes by ITchelin, in a statement. \"Machines apply consistent force, which doesn't reflect how people actually use foldable phones in their daily lives. To better simulate real-world conditions, I decided to fold it entirely by hand.\"\n\nIt seems that ITchelin has a point. Samsung advertises that the Z Fold 7 can withstand 500,000 folds. But that was likely done in a simulated environment.\n\nPhones from companies such as Samsung, Apple, Motorola and Google undergo simulated durability testing. For folding phones, machines open and close phones thousands of times to see how they might hold up in the real world.\n\n\"One thing I learned from this project is that there can be a clear difference between lab test results and results from real-world scenarios,\" said ITchelin. \"I also realized that in any durability test, it's important to assess not only the hardware but also how the internal software behaves over time.\"\n\nGiven that foldable phones have complex hinge designs and flexible displays, they are more prone to damage or failure than regular slab-style phones. Durability, along with battery life, is actually one major reason some consumers aren't jumping into the folding phone world.",
  "medium": "Article",
  "links": [
    "https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern",
    "https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern#link={%22role%22:%22standard%22,%22href%22:%22https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Durability is actually one major reason%22}",
    "https://docs.google.com/document/d/1Qj0_QdaE55-dhwwiJCIGPsWwSGJPevkYnKlxMo7cP_E/edit?tab=t.0",
    "https://www.cnet.com/tech/mobile/i-tested-the-galaxy-z-fold-7-its-slim-powerful-and-surprisingly-practical/",
    "https://www.cnet.com/tech/mobile/samsung-galaxy-z-fold-7-display-can-be-folded-500000-times-according-to-testing/",
    "https://www.cnet.com/tech/mobile/best-foldable-phones/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "folding phones",
      "weight": 0.11386508
    },
    {
      "name": "foldable phones",
      "weight": 0.10283453
    },
    {
      "name": "Phones",
      "weight": 0.09637411
    },
    {
      "name": "phones",
      "weight": 0.09637411
    },
    {
      "name": "complex hinge designs",
      "weight": 0.07838595
    },
    {
      "name": "lab test results",
      "weight": 0.07329391
    },
    {
      "name": "simulated durability testing",
      "weight": 0.071716554
    },
    {
      "name": "the folding phone world",
      "weight": 0.07046586
    },
    {
      "name": "Samsung",
      "weight": 0.06520274
    },
    {
      "name": "time",
      "weight": 0.06387688
    }
  ],
  "topics": [
    {
      "name": "Android"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.89453125
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.87353515625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7529296875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.5751953125
    }
  ],
  "sentiment": {
    "positive": 0.08115727,
    "negative": 0.5638935,
    "neutral": 0.3549492
  },
  "summary": "Korean YouTube channel Tech-it has demonstrated that folding the Samsung Galaxy Z Fold 7 can't withstand repeated handling. The stunt was carried out over a few days and found that the phone would reboot every 6,000 to 10,000 folds, with an unknown black liquid leaking out of the hinge at 75,000. At the end of the experiment, the folding mechanism became smoother and the ability to hold its shape at any angle still worked. The findings were uploaded to a publicly available Google Doc.",
  "shortSummary": "A YouTube experiment reveals that the Samsung Galaxy Z Fold 7's redesigned hinge and thinner design can't withstand repeated handling, highlighting real-world durability concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a62389d999ed4ea885b55f6e2dc3e0c4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern#link={%22role%22:%22standard%22,%22href%22:%22https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Durability is actually one major reason%22}",
      "text": "Foldable phones – High interest among young adults, durability a major concern\nYouGov Surveys: Self-serve recently surveyed 1,002 US adults who own a smartphone, exploring interest in foldable smartphones. The survey results highlight the potential appeal and concerns surrounding these devices, providing insights for brands and manufacturers.\nOverall, three in five smartphone-owning adults are interested in purchasing a foldable smartphone for their next device (59%). Interest is higher among men (63%) than women (55%). Younger adults show significantly more interest: 83% of 18-29 aged Americans and 76% of those aged 30-44 express interest. In contrast, interest drops among older demographics, with 52% of 45-64 aged adults and 52% of those 65 and older showing interest. The proportion of Americans not interested stands at 37%, with a higher percentage among older age groups, particularly those aged 45 and above.\nAmong adults interested in foldable smartphones, several key features drive their preferences. Long battery life is the most critical factor, cited by 75% of interested Americans. Price follows closely, with 69% listing affordability as a significant consideration. Durability, an essential feature given the nature of foldable screens, is important to 67%. High-quality displays appeal to 66%, while trust in the brand is crucial for 56%. Advanced camera features and multitasking capabilities, such as split-screen functionality, are priorities for 41% and 34%, respectively. Availability of accessories (26%) and artificial intelligence features (23%) are important to one-fifth of smartphone owners.\nFor those not interested in foldable smartphones, concerns center on practical drawbacks and uncertainties. The most significant issue is durability, with 56% worried about potential screen damage. Cost is another major barrier, cited by 53% as a concern.\nAdditionally, 40% do not see a substantial advantage over traditional smartphones. Design factors, such as bulkiness, are noted by 29%, while 27% express concerns about limited battery life. Model variety (20%) and software optimization (13%) also influence opinions although less significantly.\nMethodology: YouGov polled 1002 US adults online on November 8, 2024. The survey was carried out through YouGov Surveys: Self-serve. Data is weighted by age, gender, race, political affiliation, education level and region. The margin of error is 3% for the overall sample. Learn more about YouGov Surveys: Self-serve."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/i-tested-the-galaxy-z-fold-7-its-slim-powerful-and-surprisingly-practical/",
      "text": "Pros\n- Thin 4.2mm design\n- 200-megapixel main camera\n- Powerful Snapdragon 8 Elite processor\n- Durable build\nCons\n- Steep $2,000 price tag\n- Same 4,400 mAh battery as last year's Fold\n- 25-watt wired charging\nSamsung has achieved quite a feat with the Galaxy Z Fold 7. Yes, it's a spectacularly thin phone, but an even greater accomplishment is that using both the cover and main display on this book-style foldable finally feels like an almost perfect experience. Almost.\nI spent a week scrolling, snapping photos and texting on Samsung's new premium foldable, and it really was a \"feeling is believing\" experience. Because the Z Fold 7 is only 8.9mm thick when closed and 4.2mm when open, it's not clunky in either configuration. (For comparison, last year's Z Fold 6 was 12.1mm thick when closed and 5.6mm when open. That makes the new foldable phone just a bit thicker than the 7.2mm Galaxy S25 when closed.)\nThe generous 6.5-inch cover screen means I hardly feel the need to pry the phone open and use the more sprawling internal display – even though that's kind of the whole point. And snapping photos on this foldable doesn't feel like a compromise, thanks to an impressive triple camera system that includes a 200-megapixel sensor.\nBut there are still moments where the Z Fold 7 comes off as a work in progress. Formatting issues on the internal display occasionally persist, and the 4,400-mAh battery pales in comparison to what you'll find in other slim foldables, like the Oppo Find N5's 5,600-mAh capacity and the Huawei Mate X6's 5,110-mAh battery (not to mention the Z Fold 7's meager 25-watt charging). Samsung also dropped S Pen support with this device. Overall, though, the downsides are minimal.\nWhat's not so minimal is the Z Fold 7's $2,000 price tag, up $100 from the starting price for last year's Z Fold 6. But Samsung's slim book-style offering strikes that sweet spot between a novel experience and a wonderfully ordinary one, at least most of the time.\nHow the Galaxy Z Fold 7 feels\nIn addition to being thin, the Z Fold 7 is also lightweight, especially for a foldable, at 215 grams. That's 3 grams lighter than the S25 Ultra, 12 grams lighter than the iPhone 16 Pro Max and 14 grams lighter than the Oppo Find N5. In my hand or pocket, the Z Fold 7 feels better than most flagship slate phones, which in itself is pretty extraordinary.\nI've tested a handful of phones that serve as great conversation starters, but the Z Fold 7 has definitely received the most attention. Pulling the phone out at a birthday party, I was met with gasps of, \"Woah, that's so thin,\" and my colleagues were in awe of how ordinary the phone looks when folded shut. I can comfortably use it while closed if I don't want to draw attention or cause a bit of commotion around me and pop it open.\nI ended up using the Z Fold 7's cover display about 70% of the time, and primarily for tasks like messaging, taking photos and scrolling through Instagram and TikTok. That 6.5-inch screen is one of the phone's most pleasing features because of how practical it is, and it is long overdue. Because the cover screen isn't awkwardly narrow, using the inside display is now less of a necessity and more of a choice. Switching from the cover display to the main one when opening the phone is seamless, and apps transfer without any hiccups.\nI opted for that wider 8-inch real estate when watching videos and multitasking, like texting while online shopping. It's neat that you can have up to three apps on screen at the same time, so I can have YouTube, my texts and my photo gallery pulled up simultaneously, because my brain isn't already overstimulated enough. The 2,600-nit peak brightness helps with viewing such a big screen outdoors, and Samsung's new tech also makes it easier to see the display while wearing polarized sunglasses. The crease is hardly visible when looking at the screen straight on, and there's not too much of a glare apart from when I'm under direct sunlight.\nThere were a handful of instances in which posts on Instagram and TikTok were weirdly cropped on that main screen, which was disappointing. But the majority of the content showed up the way it was supposed to. And while I appreciate that the inside display is 11% larger than the Z Fold 6's, typing can be a bit tricky on such a wide expanse, even with bigger hands and the split keyboard.\nA funny side effect of the Z Fold 7's sleekness is it can be a little tricky to, well, unfold. I kind of have to wedge my nail within the crevice to pry it open, and it's game over if you're wearing acrylics, as my colleague Alexandra Able confirmed (she did eventually get it open with some extra effort). But snapping the phone shut is so satisfying that it kind of makes up for it, at least in my book.\nA thin yet durable design\nThe Z Fold 7 helps to explain the existence of its skinny sibling, the Galaxy S25 Edge, which came out in May. The latter phone was a way for Samsung to show what it's capable of, even if the $1,100 device comes off as a bit frivolous. (I personally found the lighter phone to be a game changer, but it comes at a high price.) The Z Fold 7 gives that slim profile a purpose, turning a formerly bulky foldable into one that feels wonderfully ordinary where it counts.\nDespite how thin the Z Fold 7 is, it's nice and sturdy, with a Corning Gorilla Glass Ceramic 2 cover and a Victus 2 backing. That makes me feel better about refusing to slap on a case and add even a millimeter of thickness. I toted the Fold around New York City with the peace of mind that hopefully all would be well if it took a tumble (it didn't), and it made it through the chaos of JFK Airport unscathed (though I'm not sure I did). Back at home in San Francisco, I've been throwing it into my bag and carrying it while out and about without worrying too much about anything happening to it. So far, it hasn't sustained any scuffs or scratches.\nThe Fold 7's hinge has also gotten a makeover; it's thinner and lighter, according to Samsung, and the aluminum design makes it 10% stronger. I can't bend the phone, open or closed, even when applying considerable force. So you should be able to put it in your back pocket without folding it even further.\nGalaxy Z Fold 7 camera\nWhat's not so thin is the Z Fold 7's camera bump. I like that it doesn't take up the expanse of the phone and is instead relegated to the left side of the device, but that definitely results in some wobbling when the phone is placed on a table, though there are some cases to help with that.\nThe triple camera system, headlined by the 200-megapixel main camera, delivers crisp, vibrant shots, defying the hardware compromises so many foldables have had to make over the years. There's also a 12-megapixel ultrawide and 10-megapixel telephoto camera, as well as a 10-megapixel selfie camera in the cover and main displays.\nPhotos on the Z Fold 7 are comparable to what you'll get shooting on the Galaxy S series, including the top-of-the-line S25 Ultra.\nGenerative Edit isn't new, but Samsung says it's gotten better at seamlessly filling in the gaps after you remove people and objects from your photos. This is one of my favorite Galaxy features for making photobombers or anything cluttering your photo disappear. (Yes, I am ruthless with this tool.)\nAudio Eraser, which also isn't new, gets a designated button under videos in your gallery, so you can quickly tap to launch the feature. It uses AI to clean up background noises so you can focus on what you actually want to hear.\nAudio Eraser can now automatically detect what to tune out, like the crowd or the wind. I used the feature on a video of me talking to camera during Samsung's Unpacked evening event as the DJ was spinning and folks were chattering, and it did a good job reducing the sound of voices in the background, but it did warp my voice a bit. I'm sure it'll only get better with time, but it's neat to have even its current rudimentary capability.\nBattery life and performance\nI was worried Samsung would scale back the Z Fold 7's battery with a slimmer design, as it did with the S25 Edge. But the Fold 7 maintains the 4,400 mAh of last year's Z Fold 6. That's still notably less than the capacity on similar phones from Chinese companies like Huawei, Honor and Oppo, but I'm just glad the Fold's battery didn't take a hit. It also only features 25-watt wired charging (and 15-watt wireless charging), which is significantly less than its competitors.\nThe Z Fold 7 lasted me about a day and a half with my usual routine of scrolling through social media, checking emails, watching YouTube videos, texting, using Google Maps and taking photos. (You know, just your healthy daily dose of screen time.)\nIn CNET's 45-minute endurance test, which includes a combination of streaming, scrolling through social media, joining a video call and playing games on the inside screen, the Galaxy Z Fold 7's battery went from full to 93%. For comparison, in the same test, the Oppo Find N5 dropped to 95%, and Google's Pixel 9 Pro Fold hit 96%.\nAnd in a 3-hour streaming test over Wi-Fi, in which I watched a YouTube video in full-screen mode at full brightness using the main screen, the Z Fold 7's battery dropped from 100% to 84%. Last year's Z Fold 6 reached 82% in the same test, so it's a welcome, if modest, improvement.\nWhen it was time to charge, the Z Fold 7 went from 0% to 42% in 30 minutes and reached full battery in about an hour and a half.\nThe Z Fold 7 comes with 12GB RAM and either 256GB or 512GB of storage, as well as 16GB of RAM with 1TB of storage. I tested the 256GB version.\nThe phone packs a Snapdragon 8 Elite chip, powering the many Galaxy AI and Gemini features Samsung has been touting. It comes out of the box with Android 16 and One UI 8, and you'll get seven years of OS and security updates to help stretch your many, many dollars spent.\nBenchmark tests for the CPU in Geekbench 6 place the Z Fold 7 well above the full Galaxy S24 lineup. In a graphics test using 3DMark's Wild Life Extreme, the Z Fold 7 exceeded the performance of the iPhone 15 Pro, Galaxy S24 Ultra and Pixel 9 Pro Fold.\nCheck out the graphs below for more specifics.\nFinal thoughts: Should you buy the Galaxy Z Fold 7?\nIt's a good sign when you become so used to a phone's design that you forget how extraordinary it really is. That's certainly been the case with the Z Fold 7.\nThis phone's thinness, paired with its wider cover screen, makes it feel wonderfully normal when closed, and the inside display has become my go-to way to watch movies and multitask. It's great that the camera and battery didn't end up being the trade-offs I was bracing myself for with that slimmer build, and the phone feels surprisingly durable. I'm sure it's only a matter of time before more companies take a page out of Samsung's book and slim down their phones, too. (Looking at you, Apple.)\nThe price of being fairly early to a trend comes at a high cost; $2,000 is tough to stomach. This continues Samsung's practice of raising prices on its Fold devices by $100 over the last few years. So it can be a difficult purchase to justify. But there are a handful of carrier deals that can help soften the blow.\nIf you're all about having a sleek device with the option of a bigger screen, and a solid camera is one of your top priorities, the Z Fold 7 could be the right fit for you. It has many of the same AI features you'll get on last year's Z Fold 6, along with some new additions and updates. And while battery life isn't as great as on some competitors' phones, it certainly gets the job done.\nBut make no mistake: the Z Fold 7's fresh, slim form factor steals the spotlight here, and makes using this book-style foldable truly feel like a novel experience.\nGalaxy Z Fold 7 vs. Z Fold 6 vs. Pixel 9 Pro Fold vs. Opp Find N5\n| Samsung Galaxy Z Fold 7 | Samsung Galaxy Z Fold 6 | Google Pixel 9 Pro Fold | Oppo Find N5 | |\n| Cover display size, tech, resolution, refresh rate | 6.5-inch AMOLED, 2,520x1,080p, 1-120Hz refresh rate | 6.3-inch AMOLED; 2,376x968 pixels; 1-120Hz variable refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.62-inch OLED; 2,616 x 1,140 pixels; 1-120Hz variable refresh rate |\n| Internal display size, tech, resolution, refresh rate | 8-inch AMOLED, 2,184x1,968p, 1-120Hz refresh rate | 7.6-inch AMOLED; 2,160x1,856 pixels;1-120Hz variable refresh rate | 8-inch OLED; 2,152x2,076 pixels, 1-120 Hz variable refresh rate (LTPO) | 8.12-inch OLED; 2,480 x 2,248 pixels; 1-120Hz variable refresh rate |\n| Pixel density | Cover: 422ppi; Internal display: 368ppi | Cover: 410 ppi; Internal: 374 ppi | Cover: 422 ppi; Internal: 373 ppi | Cover: 431 ppi; Internal: 412 ppi |\n| Dimensions (inches) | Open: 5.63 x 6.24 x 0.17 inches; Closed: 2.87 x 6.24 x 0.35 inches | Open: 6.04x5.21 x0.22 in; Closed: 6.04x2.68x0.48 in | Open: 6.1x5.9x0.2 in; Closed: 6.1x3x0.4 in | Open: 6.3x5.77x0.16 in; Closed: 6.3x2.93x0.35 in |\n| Dimensions (millimeters) | Open: 143.2 x 158.4 x 4.2mm; Closed: 72.8 x 158.4 x 8.9mm | Open: 153.5x132.5x5.6mm; Closed: 153.5x68.1x12.1mm | Open: 155.2x150.2x5.1 mm; Closed: 155.2x77.1x10.5 mm | Open: 160.87x146.58x4.21mm; Closed: 160.87x74.42x8.93mm |\n| Weight (grams, ounces) | 215g (7.58 oz.) | 239g (8.43 oz) | 257g (9.1 oz) | 229g (8.08 oz) |\n| Mobile software | Android 16 | Android 14 | Android 14 | Android 15 |\n| Cameras | 200-megapixel (main), 12-megapixel (ultrawide), 10-megapixel (telephoto), 10-megapixel (cover screen, selfie) | 50-megapixel (wide), 12-megapixel (ultrawide), 10-megapixel (3x telephoto) | 48-megapixel (wide), 10.5-megapixel (ultrawide), 10.8-megapixel (5x telephoto) | 50-megapixel (main), 8-megapixel (ultrawide), 50-megapixel (periscope telephoto) |\n| Internal screen camera | 10-megapixel | 4-megapixel (inner screen under-display); 10-megapixel (cover screen) | 10-megapixel (inner screen); 10-megapixel (cover screen) | 8-megapixel (inner screen); 8-megapixel (cover screen) |\n| Video capture | 8K at 30fps | 8K | 4K | 4K |\n| Processor | Qualcomm Snapdragon 8 Elite for Galaxy | Snapdragon 8 Gen 3 | Tensor G4 | Snapdragon 8 Elite |\n| RAM/storage | 12GB + 256GB, 12GB + 512GB, 16GB + 1TB | 12GB + 256GB, 512GB, 1TB | 16GB + 256GB, 512GB | 16GB + 512GB |\n| Expandable storage | No | None | None | None |\n| Battery | 4,400 mAh | 4,400 mAh | 4,650 mAh | 5,600-mAh |\n| Fingerprint sensor | Yes | Side | Side | Side |\n| Connector | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | No | None | None | None |\n| Special features | One UI 8, 25W wired charging speed, Qi wireless charging, 2,600-nit peak brightness, Galaxy AI, NFC, Wi-Fi 7, Bluetooth 5.4, IP48 water resistance | IP48 rating, 25W wired charging, wireless charging + powershare, 3x optical zoom (up to 10x digital and 30x Space Zoom with AI Super Resolution tech) | IPX8 rating, 7 years of OS, security and Pixel Drop updates, Satellite SOS, Wi-Fi 7, ultra wideband chip, Gorilla Glass Victus 2 cover and back glass, cover screen peek brightness 2,700 nits, internal screen peek brightness 2,700 nits, 45W wired fast charging (Charger not included), Qi-certified, free Google VPN, Super Res Zoom, Add Me, Face Unblur, Made You Look, Magic Editor, Magic Eraser, Best Take, Video Boost, | IPX9 rating, 80W fast wired charging, 50W wireless charging, nanocrystal glass cover display, anti-reflective film on inner display, cover screen peek brightness 2,450 nits, internal screen peek brightness 2,100 nits, LTPO OLED display |\n| US price starts at | $2,000 | $1,900 (256GB) | $1,799 (256GB) | $1,870 |\n| UK price starts at | £1,799 | £1,799 (256GB) | Converts to £1,410 (256GB) | £1,482 |\n| Australia price starts at | AU$2,899 | AU$2,749 (256GB) | Converts to AU$2,770 (256GB) | AU$2,930 |\nHow we test phones\nEvery phone CNET's reviews team tests is used in the real world. We test a phone's features, play games and take photos. We examine the display to see if it's bright, sharp and vibrant. We analyze the design and build to see how it is to hold and whether it has an IP rating for water resistance. We push the processor's performance to the extremes using standardized benchmark tools like GeekBench and 3DMark, along with our own anecdotal observations navigating the interface, recording high-resolution videos and playing graphically intense games at high refresh rates.\nAll the cameras are tested in a variety of conditions, from bright sunlight to dark indoor scenes. We try out special features like night mode and portrait mode, and compare our findings against similarly priced competing phones. We also check out the battery life by using it daily, as well as running a series of battery drain tests.\nWe take into account additional features like support for 5G, satellite connectivity, fingerprint and face sensors, stylus support, fast charging speeds and foldable displays, among others that can be useful. We balance all of this against the price to give you the verdict on whether that phone, whatever price it is, actually represents good value. While these tests may not always be reflected in CNET's initial review, we conduct follow-up and long-term testing in most circumstances."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-foldable-phones/",
      "text": "The foldables 'fad' may have come and gone, but folding phones have more than proven their worth as reliable and adaptable devices. They can change the way we interact with our all-important smartphones, such as using a flip phone's cover screen instead of opening it every time or multi-window productivity on large-screen foldables. Samsung and Motorola still dominate the foldable space here in the U.S. with years of Samsung's hardware refinements and Motorola's price-shaving. Even relative newcomer Google has made enormous leaps between its first Pixel Fold and the Pixel 9 Pro Fold.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nFolding phones come in two main varieties for now: candy bar, book-style phones, which open up like a book to become larger, tablet-size devices (like the Samsung Galaxy Z Fold 5) and flip-style phones, which fold in half to become smaller and more pocketable (like the Galaxy Z Flip 5 and Moto Razr series). Because of the still-recent technology, all foldables are more expensive than their regular smartphone equivalents, making them a luxury option. But if you're looking to turn heads when you whip out your foldable display and bend your phone in half, they're worth looking into. Here are our picks for the best foldable phones available now.\nMost models on this list have newer models, but with the higher prices of foldables, newer isn't always the best value. If you are looking for a clamshell or 'hamburger' style foldable, I also highly recommend checking out our guide to the best flip phones, which showcases the current and previous-generation Motorola Razr and Samsung Z Flip lineups. You can also read our reviews for the Samsung Galaxy Z Fold 6 and the Google Pixel 9 Pro Fold if you're looking for the latest phone-to-tablet or 'hot dog' style folding phones. Oppo has also just released the new Oppo Find N5, but that phone won't be coming to the United States.\nWhat's the best foldable phone?\nSo far, Samsung's Galaxy Z line has the lead with the most iterations of folding phones with its two foldable designs -- the book-style folding tablet Galaxy Z Fold series and flip-phone-like Z Flip series -- but it's no longer the only company with skin in the game.\nThe Samsung Galaxy Z Flip 5 sits at the top of our list of best foldable phones, largely because it has an approachable price for a foldable. At $1,000, it is still expensive, but we believe it packs a lot for that price. The design and build quality feel sturdy, the software is polished, and the Z Flip gets four years of Android version support. On top of it all, the clamshell form factor and large cover screen make it one of the most portable and fun phones you can own.\nBest foldable phones\nPros\n- Better battery life\n- New hinge\n- Brighter screen\nCons\n- S Pen doesn't work on cover screen\n- Cameras are still just OK\n- The $1,800 price\nThe Samsung Galaxy Z Fold 5 is an incremental improvement that further refines Samsung's large-screened foldable. If you're looking for a phone that can double as a tablet for viewing work-related documents, running multiple apps on screen at once or watching movies, the Galaxy Z Fold 5 is our top choice. The Google Pixel Fold may have better cameras, but the Galaxy Z Fold 5's bright screen makes Samsung's phone better at its intended purpose: providing a big display that fits in your pocket.\nThe Galaxy Z Fold 5's $1,800 price is still hard to swallow and puts the phone out of range for most people. But if you can afford it, this large folding phone is the best iteration of Samsung's phone-tablet hybrid yet. Read our Samsung Galaxy Z Fold 5 review.\nPros\n- Large cover screen is great\n- Thin design for a foldable\n- There's no gap when the device is shut\nCons\n- Expensive\n- Thick bezels on the inner screen\n- Some apps are not optimized for the internal display\n- Drag and drop functionality can be finicky\nGoogle got a lot of things right with its first attempt at building a folding phone. The Pixel Fold's large outer screen is great for using when closed, and its slim design means it doesn't bulk out your pockets too much. It closes totally flat, too, which makes it very usable as a regular phone when snapped shut, while still letting you take advantage of the 7.6-inch internal screen when you need it.\nIts overall performance is solid and the cameras are good too, making it a great all-round option if you're wanting to dive into the exciting world of foldables, though for the same $1,799 starting price, you can get the new Google Pixel 9 Pro Fold with larger screens, a much-improved hinge and a longer support life.\nPros\n- Big cover screen is fun to use\n- New hinge eliminates the gap when closed\n- Solid battery life\n- More storage in base model\nCons\n- Expensive\n- Not all apps work on the cover screen natively\n- Apps don't transition from main screen to cover screen\n- Minimal camera updates\nThe Galaxy Z Flip 5 was the biggest leap forward Samsung's flip phone had seen when it launched in 2023. Samsung significantly expanded the size of the cover screen located on the outside of the device, meaning you can look up directions, take photos and send messages without opening the phone. It's this, combined with the Z Flip's solid battery life and sturdy design, that makes it a top pick.\nThe Z Flip 5 was our favorite flip phone in 2023, but there are still some drawbacks to be aware of. Not all apps work natively on the front screen as they do on the Motorola Razr Plus. At $1,000, it's still expensive for a phone without a telephoto camera. The newer Z Flip 6 costs even more. Though the Z Flip 5 can often be found on discount. Read our Galaxy Z Flip 5 review.\nThe newer Samsung Galaxy Z Flip 6 sports an improved hinge mechanism, IP48 dust resistance -- the first Flip to feature any protection against dust -- a slightly larger battery and a brighter screen, but it also has a $1,100 price tag and few discounts outside carrier promotions. When on sale, the Flip 5 can be a much better deal, but it's getting harder to find in stock.\nPros\n- Large, useful cover screen\n- Crease is barely visible\n- Thin design\n- Good battery life\n- Fun photography features like photo previews\nCons\n- Not as many Android updates as Samsung\n- Flex View feels limited\n- Front screen gathers fingerprint smudges easily\n- $1,000 is still expensive\nThe Motorola Razr Plus raised the bar for what a flip phone should be in 2025. Its 3.6-inch cover screen allows you to use almost any app without opening the phone, plus battery life is long enough to get you through a busy day. It's also thinner than the Galaxy Z Flip 5, which could make it the ideal choice for those who prioritize portability in a phone.\nWhile I recommend the Galaxy Z Flip 5 as the best flip phone overall, the Razr Plus is worth considering if you prefer a thinner design and want to use more apps on the phone's outer display without much extra fuss. The Razr Plus felt more fragile than the Galaxy Z Flip 5 during testing, but it's certainly thinner, making it a great choice for those who care about compactness above all else. Read our Motorola Razr Plus 2023 review.\nThe Razr Plus 2023 can be found on sale for $400 at Amazon, so make sure you're not paying $1,000 for a year-and-a-half-old phone, especially when the Motorola Razr Plus 2024 can be found for as little as $580 on the same Amazon listing. The 2024 model boasts slightly better cameras and a 3,000-nit max brightness screen compared to the 1,400 nits on the 2023 version, but the savings of the 2023 model are hard to deny.\nPros\n- Solid and svelte build quality\n- Great main camera\n- Fun foldable functionality\n- Good price\nCons\n- 128GB onboard storage is limited\n- Outer screen is very small\n- 3 years of OS updates is less than competitors offer\nThe Motorola Razr 2023 is the most affordable and widely released foldable phone, with a $700 price tag that's well below the $1,000 starting price of clamshell foldables like the Razr Plus and Samsung Galaxy Z Flip 5. Motorola made some obvious compromises for affordability, like losing its competitors' full-front screen for a 1.5-inch thumbnail-size external display.\nLess obvious are the more painful shortfalls: only three years of Android OS updates and 128GB of non-expandable storage (you'll have to rely on cloud storage if you go over). If you can stomach those compromises, the Razr 2023 is a great phone, with a svelte design, a large 6.9-inch main display and a sharp 64-megapixel main camera (the less said about its other ultra-wide lens, the better). It's a phone that suits a specific niche: folks who want to try out foldables for a few years but don't want to shell out a lot of money if they're still iffy on whether this \"flexible display\" thing will take off. Read our Motorola Razr 2023 review.\nOppo's Find N3 Flip phone is unique for two reasons: It has a telephoto camera and a vertical cover screen, unlike the Samsung Galaxy Z Flip 5 and Motorola Razr Plus. That could make the Find N3 Flip an ideal choice for people who want closer zoom shots, though this phone also shines for its fast performance, stylish design and speedy charging. The crease on the interior screen is also impressively subtle. That said, there are some downsides. The Find N3 Flip lacks wireless charging, and you'll be able to buy it from authorized retailers only in certain markets -- and that doesn't include the US (although resellers are an option you can consider). Read our Oppo Find N3 Flip review.\nWe have not seen a flip-style foldable out of Oppo since the Find N3 Flip in fall 2023, though they recently released the Oppo Find N5 in markets -- which will sadly be skipping the United States again.\nPros\n- Good battery life\n- Excellent hardware\n- Fast wired charging\nCons\n- Cameras are just OK\n- Software not optimized for larger display\n- No wireless charging\nThe Open is the first foldable from phone-maker OnePlus. It's not a bad first effort, with great-looking hardware that feels premium to hold and that helps the Open stand out from its competitors. In our review, we liked the good battery life and the fast wired charging. Its generous 6.3-inch outer display unfolds to reveal a 7.82-inch inner display that's great for watching videos on the go.\nBut it feels rough around the edges compared to Samsung's Z Fold 5, with the camera performance and some software optimizations leaving us feeling a touch underwhelmed. At $1,700, it's tough to recommend the Open over Samsung's foldable, but if you want to feel like you've got a device that few others out there have, it's certainly not a bad phone to consider. Read our OnePlus Open review.\nFactors to consider when buying an Android phone\nLook for sales: Look for sales and deals close to major shopping holidays like Presidents Day, Amazon's Prime Day and Black Friday.\nConsider last year's models: When a new phone gets launched, stores and carriers discount their older phones to sell off existing stock. Samsung's new foldables tend to launch around the beginning of August and new Razrs tend to arrive in June. Google traditionally launched new phones in October, but the Pixel 9 Pro Fold launched in September 2024.\nSee the phone in person: It's worth going to a store and trying out a potential phone. You may love or hate the way it looks and feels.\nBudget for a case: Foldable phones sold today are more durable than phones from even a few years ago, but it still might be a good idea to protect your phone with a case to keep it in tip-top shape. A screen protector for the outer screen is also well worth considering.\nHow we test phones\nWe test every phone in real-world scenarios, focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new software updates, or to compare it against new phones from competitors such as Apple, Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for most phones these days, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as ProRes Log video that debuted with the iPhone 15 Pro and 15 Pro Max or the Magic Editor photo tool that launched with the Google Pixel 8 series.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long a phone lasts during a typical day of use and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test, as a simple, replicable measure of pure battery life, which isn't always included in the initial review but sometimes added later in an update.\nPerformance measuring\nWe use benchmarking apps to measure each phone's performance, alongside our own anecdotal experiences using the phone for our review. Most noteworthy is how graphics and animations look. Are they smooth? Do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations, and how fast the camera app opens and is ready to take a photo."
    },
    {
      "url": "https://business.yougov.com/content/50945-foldable-phones-high-interest-among-young-adults-durability-a-major-concern",
      "text": "Foldable phones – High interest among young adults, durability a major concern\nYouGov Surveys: Self-serve recently surveyed 1,002 US adults who own a smartphone, exploring interest in foldable smartphones. The survey results highlight the potential appeal and concerns surrounding these devices, providing insights for brands and manufacturers.\nOverall, three in five smartphone-owning adults are interested in purchasing a foldable smartphone for their next device (59%). Interest is higher among men (63%) than women (55%). Younger adults show significantly more interest: 83% of 18-29 aged Americans and 76% of those aged 30-44 express interest. In contrast, interest drops among older demographics, with 52% of 45-64 aged adults and 52% of those 65 and older showing interest. The proportion of Americans not interested stands at 37%, with a higher percentage among older age groups, particularly those aged 45 and above.\nAmong adults interested in foldable smartphones, several key features drive their preferences. Long battery life is the most critical factor, cited by 75% of interested Americans. Price follows closely, with 69% listing affordability as a significant consideration. Durability, an essential feature given the nature of foldable screens, is important to 67%. High-quality displays appeal to 66%, while trust in the brand is crucial for 56%. Advanced camera features and multitasking capabilities, such as split-screen functionality, are priorities for 41% and 34%, respectively. Availability of accessories (26%) and artificial intelligence features (23%) are important to one-fifth of smartphone owners.\nFor those not interested in foldable smartphones, concerns center on practical drawbacks and uncertainties. The most significant issue is durability, with 56% worried about potential screen damage. Cost is another major barrier, cited by 53% as a concern.\nAdditionally, 40% do not see a substantial advantage over traditional smartphones. Design factors, such as bulkiness, are noted by 29%, while 27% express concerns about limited battery life. Model variety (20%) and software optimization (13%) also influence opinions although less significantly.\nMethodology: YouGov polled 1002 US adults online on November 8, 2024. The survey was carried out through YouGov Surveys: Self-serve. Data is weighted by age, gender, race, political affiliation, education level and region. The margin of error is 3% for the overall sample. Learn more about YouGov Surveys: Self-serve."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/samsung-galaxy-z-fold-7-display-can-be-folded-500000-times-according-to-testing/",
      "text": "Fold, fold and fold again. It doesn't matter how many times you open and close the Galaxy Z Fold 7 phone -- it's highly unlikely to give out on you. Samsung Display (SDC) announced Tuesday that its latest foldable OLED panel \"remained fully functional after a 500,000-fold durability test,\" more than doubling its previous benchmark of 200,000 folds.\nBureau Veritas, a French leader in testing, inspection and certification, tested the screen with 500,000 folds over a 13-day period at a temperature of 25°C (77°F).\nFor those of you trying to wrap your head around the math, half a million folds translates to the average user folding their phone 100 times a day for 10 years, or prolific users doing 200 folds a day for 6 years. Samsung Display -- a separate company from Samsung -- says the durability results prove that \"durability is no longer a limiting factor in the lifespan of foldable smartphones.\"\n\"As foldable OLED enters its seventh year of commercialization, we've achieved another meaningful breakthrough in both durability and design,\" Hojung Lee, EVP at Samsung Display, said in a press release. \"This new panel ... builds consumer confidence in foldable OLED durability.\"\nBulletproof glass technology has helped Samsung Display develop its creaseless screens. SDC borrowed from the concept and increased the thickness of its Ultra Thin Glass, the outermost glass on the screen, by 50%. SDC also added high-elastic adhesive to each screen layer, thereby enhancing fold recovery performance by four times the previous design.\nCNET reported last week that Apple has tapped Samsung Display to manufacture screens for Apple's first foldable iPhone, set to launch in summer 2026.\nDespite the hype around foldable phones, a CNET survey published on Tuesday showed 64% of people have no interest in buying one of these smartphones in the next year. 20% weren't sure if they want one, 13% say they do want one and just 3% said they already own one."
    }
  ],
  "argos_summary": "A recent durability test conducted by the Korean YouTube channel Tech-it revealed that the Samsung Galaxy Z Fold 7 could not withstand extensive folding, rebooting after 6,000 to 10,000 folds and showing signs of wear, such as creaking and leaking liquid, after 75,000 folds. Despite Samsung's claim that the device can endure 500,000 folds, the test highlighted discrepancies between lab conditions and real-world usage. Additionally, a YouGov survey indicated a significant interest in foldable smartphones among younger adults, with durability being a major concern for potential buyers.",
  "argos_id": "S1Q1770Z7"
}