{
  "url": "https://www.zdnet.com/home-and-office/my-favorite-personal-safety-alarm-is-as-loud-as-a-jackhammer-and-it-just-got-an-upgrade/",
  "authorsByline": "Kayla Solino",
  "articleId": "5d4476336b554ccf8c5074a6aff849f6",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/f98548d32754e48c6a6bcb8f1d3df3899b6b2854/2023/03/16/db386c71-7cf1-4422-8620-ecbb442c164b/ba0abb02-8129-4588-a58b-6e330b457fc6-1-201-a.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:00:14+00:00",
  "addDate": "2025-08-15T00:08:05.752636+00:00",
  "refreshDate": "2025-08-15T00:08:05.752637+00:00",
  "score": 1.0,
  "title": "My favorite personal safety alarm is as loud as a jackhammer, and it just got an upgrade",
  "description": "The She's Birdie personal safety alarm is now rechargeable, and I recommend everyone get one. Here's why.",
  "content": "A safety alarm may not be on everyone's radar, but as a 20-something woman who's traveled alone in and out of the busiest metropolitan areas in the nation, it's a must -- and it's for anyone of any age.\n\nI carried the She's Birdie personal alarm throughout college, and have continued to do so since. While I hope to never have to use it, every dollar I spent on it is worth it for the peace of mind it brings me. When the top pin of the Birdie is pulled out, a 130db siren sounds and a strobe light flashes for up to 40 minutes. To put that in perspective, a 130db sound is equivalent to a jackhammer and nearly equal to the sound of a jet engine in the distance, according to the Hearing Health Foundation.\n\nAlso: This tiny keychain is a mighty tool for your personal safety\n\nBirdie just upgraded its original alarm, adding new features like a flashlight, an on/off switch, and the ability to recharge via USB-C. The version I use runs on a CR2032 battery, which is equally functional. I've only had to replace the battery a handful of times in the 6-plus years I've owned mine.\n\nEither model you choose, old or new, is a wise investment. While an alarm may not protect me from danger, I like knowing that at any moment I have the option to draw attention to myself and hopefully thwart any nefarious activity.\n\nAlso: This AirTag key organizer has survived the ultimate torture test - and I'd repurchase it any time\n\nI carry this on my keychain and hold it while walking anywhere. It's a great investment for college students, parents with small children, older adults, and more, but for $30, I recommend everyone scoop one up.\n\nI don't recommend this product out of fear or to scare anyone, but I'd rather have a Birdie alarm and not need it than have nothing at all.\n\nOf course, you can carry many other gadgets for personal safety. I recommend the She's Birdie alarm for its semi-discreet design, loud siren, strobe lights, and upgraded features like reachability. It also comes in several bright colors and includes a keyring so it can be easily carried around.\n\nIt's an affordable, practical way to ensure anyone has an easy-to-use gadget to potentially fend off danger -- or to draw attention to themselves in an emergency. I've been using my Birdie alarm for over half a decade, and it's made me feel safer when I'm out walking alone. It also makes a great gift for anyone you care about.\n\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends.",
  "medium": "Article",
  "links": [
    "https://hearinghealthfoundation.org/keeplistening/decibels",
    "https://www.amazon.com/dp/B0F9QHPD9Y?tag=zdnet-buy-button-20",
    "https://www.zdnet.com/article/this-tiny-keychain-is-a-mighty-tool-for-your-personal-safety/",
    "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
    "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
    "https://www.amazon.com/dp/B08TTJSPD9?tag=zdnet-buy-button-20",
    "https://www.zdnet.com/home-and-office/this-airtag-key-organizer-has-survived-the-ultimate-torture-test-and-id-buy-it-again-any-time/",
    "https://www.zdnet.com/article/why-i-recommend-this-200-android-phone-with-a-paper-like-display-over-competing-models/",
    "https://www.zdnet.com/newsletters/",
    "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "personal safety",
      "weight": 0.079679236
    },
    {
      "name": "Birdie",
      "weight": 0.07512723
    },
    {
      "name": "loud siren",
      "weight": 0.066984
    },
    {
      "name": "strobe lights",
      "weight": 0.06643204
    },
    {
      "name": "new features",
      "weight": 0.065827206
    },
    {
      "name": "My favorite personal safety alarm",
      "weight": 0.06449977
    },
    {
      "name": "upgraded features",
      "weight": 0.063680954
    },
    {
      "name": "older adults",
      "weight": 0.06148531
    },
    {
      "name": "several bright colors",
      "weight": 0.059688352
    },
    {
      "name": "a Birdie alarm",
      "weight": 0.05855245
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.398681640625
    }
  ],
  "sentiment": {
    "positive": 0.35794154,
    "negative": 0.17378788,
    "neutral": 0.46827066
  },
  "summary": "The She's Birdie personal safety alarm, which alerts users of traveling alone, has been upgraded with new features like a flashlight, an on/off switch, and the ability to recharge via USB-C. The alarm's 130db siren sounds and a strobe light flashes for up to 40 minutes, making it feel safer for the individual. The Birdie can be purchased for $30 and is a great investment for college students, parents with small children, and older adults. While an alarm may not protect me from danger, I like knowing that at any moment I have the option to draw attention to myself and thwart any nefarious activity.",
  "shortSummary": "The She's Birdie personal alarm, featuring a loud siren and multifunctional components, is a crucial investment for anyone seeking personal safety.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f0b43bc7fd4946df840c4e238a483cf3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://hearinghealthfoundation.org/keeplistening/decibels",
      "text": "Ver pagina en: English | Español\nIf It Sounds Too Loud, It Is Too Loud\nDecibels are the unit of measurement for sound, abbreviated dB. Sounds at or below 70 dB are considered safe for our hearing. That’s the sound of a normal conversation between two people.\nSounds above 70 dB can damage hearing over time.\nLike the Richter scale for measuring earthquakes, the decibel scale is logarithmic. This means that loudness is not directly proportional to sound intensity. Instead, the intensity of a sound grows very fast. A sound at 20 dB is 10 times more intense than a sound at 10 dB, and would be perceived as twice as loud.\nGet Updates in Your Inbox\nIf we need to shout at a friend who is an arm’s length away, or we can hear music coming out of another person’s headphones, the volume is at least 85 dB, which is the maximum “safe level” for workplace noise exposure over the course of an eight-hour day.\nThe issue is that it’s not just the workplace that we experience loud sounds—it’s also during our commute or while out to dinner or the movies—as well as our use of personal listening devices.\nThis workplace limit is also not safe for children, whose auditory system is still developing, and their ears have to last a lifetime. We recommend following the National Institute on Deafness and Other Communication Disorders guidelines to limit exposure to an average 70 dB: “Sounds at or below 70 A-weighted decibels (dBA), even after long exposure, are unlikely to cause hearing loss.” (A-weighted decibels, or dBA, emphasize the frequencies heard in human speech.)\nHeadphones and earbuds can reach as loud as 100 dB or more, so a safe level is 50 to 60 percent of the maximum volume. This helps protect our hearing and allows us to listen to our favorite music for longer. When using Bluetooth-enabled earbuds, limit the volume using the phone’s settings.\nFor venues and events where amplified music is being played, the World Health Organization issued recommendations to monitor the sound levels, optimize acoustics to ensure safe listening, and provide ear protection as well as access to quiet zones so attendees can rest their ears.\nThe National Institute on Deafness and Other Communication Disorders has an interactive infographic on decibel levels.\nMeasure Decibels Using Your Phone\nBoth Apple and Android phones support sound level meter apps that measure decibels. In fact, on the Apple iPhone and Apple Watch, the embedded Health app measures decibels and can send alerts when it is too loud. Here are other sound level meter apps:\nNoiSee (iOS)\nSLPnFFT Noise Meter (iOS)\nSound Meter X (iOS)\nSound Meter (Android)\nSoundPrint (iOS and Android)\nWhile these guidelines and comparison are helpful, a basic rule of thumb is common sense: If it sounds too loud, it IS too loud.\nJust as we are aware of how much sun we get or steps we’ve walked, let’s be aware of our daily sound dose. A ballpark understanding of how much volume our ears are exposed to can help us take steps to protect them, by carrying and wearing earplugs, turning it down when we can, and taking quiet breaks to rest our ears.\nA Simple Hearing Protection Toolkit\nCarry earplugs: Think of earplugs like sunscreen for our ears—let’s keep them on hand wherever we go.\nTurn it down: Reducing the volume by just 3 decibels cuts the risk of hearing damage in half.\nTake quiet breaks: Let’s rest our ears in quiet after excess noise.\nKnow the signs: Tinnitus or muffled hearing are early signs of damage. Earplugs at concerts protect our ears.\n30-35dB\nSleep disruption, especially if noise is not continuous.\n45dB\nDisturbance of concentration and interference with learning.\n55dB\nNon-auditory negative health effects.\n60dB\nInterference with speech comprehension for those with hearing loss.\n70-75dB\nInterference with speech comprehension for those with typical hearing."
    },
    {
      "url": "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nFinally, an ultraportable Windows laptop I'd use at the office (even though it's for gamers)\nMSI Stealth 16 AI\nZDNET's key takeaways\n- The MSI Stealth 16 AI is on sale at Best Buy for $2,030.\n- It's a gaming laptop with powerful hardware and a vibrant OLED display that's ideal for both gaming and graphic design.\n- However, like its predecessor, it has a hungry battery and runs hot.\nThe 2025 MSI Stealth 16 is the latest entry in the tech company's sleek gaming laptop series. I'm pretty familiar with the Stealth line, having reviewed several models in the past. This version doesn't reinvent the wheel. In fact, it shares many similarities with its predecessor, the Stealth A16 AI+, to its benefit and to a fault.\nAlso: The best laptops for graphic designers: Expert tested\nFirst off: on the surface, I genuinely can't tell the difference between this model and the previous generation. The Stealth 16 measures 14\"x 10.22\"x 0.85\" inches -- the exact same dimensions as the A16. It even weighs the same at 4.63 pounds.\nWhat's funny is I used to think that was really heavy, but after carrying around chunky laptops, MSI's device feels lightweight. Even with the power adapter, I didn't mind carrying it around town. By the way, I factor that adapter into the overall weight because you will need it on hand. More on that later.\nBringing back the classics\nA few other great design elements make their triumphant return. Going down the list, you have a full-size gaming keyboard. Each button has a 1.5mm travel distance, ensuring a comfortable typing feel. Six surround sound speakers are located at either end below the keyboard for immersive audio.\nOne of my favorite moments testing this laptop came from listening to \"Doomsday\" by MF Doom. The lyrical flow from Doom sounded crystal clear and powerful through the laptop's speakers, filling my entire room with his supervillainy.\nAbove the keyboard is the 16-inch OLED display. At QuadHD+ (2,560 x 1,600 pixels) resolution, it's not quite 4K, but it's close enough -- the screen still delivers impressive visual output. Colors are vibrant, the high resolution delivers detailed images, and the 240Hz refresh rate ensures smooth on-screen motion.\nPower boost\nOne of my favorite things about MSI laptops is how easy it is to tweak their performance. On many Windows 11 laptops, all you can really do is change the Power mode in the Settings, but MSI Center, its internal settings program is actually pretty robust. Here, you can adjust the computer's output on the fly. For example, enabling Extreme Performance and Discrete Graphics Mode delivers the best hardware results.\nAlso: I tested Dell's XPS successor, and it beat my $3,000 Windows laptop in almost every way\nInside my review unit was an Intel Core Ultra 9 285H, an Nvidia GeForce RTX 5070 graphics card, and 32GB of RAM. It's a pretty good configuration, if I say so myself, and it shows in the performance numbers.\nBelow is a list comparing MSI's Stealth 16 with its predecessor, the Stealth A16 AI Plus, and the Dell Premium 16. You'll notice that the newer model has better raw processing and rendering power than the others, indicating it excels at handling heavy workloads and rendering complex 3D graphics.\nThere is a bit of a gap between the Stealth 16 and the A16 on PCMark 10, suggesting that the older model has better general performance; it's able to hop between web pages and apps without much issue. However, I didn't experience any slowdown. This laptop ran great everywhere.\nPCMark 10 | Geekbench 6 | Cinebench 2024 | Cinebench R23 | |\nMSI Stealth 16 AI | 7,693 | 15,883 | 1,129 | 21,656 |\nMSI Stealth A16 AI+ | 7,913 | 14,196 | N/A | 18,336 |\nDell Premium 16 | 6,865 | 14,763 | 726 | 17,522 |\nHaving Dell's machine may seem random, but you need to understand that the Stealth 16 isn't just a solid gaming computer. It's also a powerful graphic design laptop, too. For testing, I installed Blender, a free 3D creation app, and edited images on Pixlr. I'm not much of an artist, but I did manage to create and render simple scenes starring Blender's complex monkey model.\nI had a similar experience with Pixlr, as I was able to edit 4K photographs without any major hiccups. The entire process went smoothly. MSI's laptop is a powerhouse in almost every sense of the word.\nAlso: I switched to the Dell 14 Premium for a week, and it makes even the XPS feel outdated\nAs powerful as the laptop may be, it has its limits. I ran multiple 4K YouTube livestreams as part of my usual 50-tab Chrome browser test. Everything ran fine when there were only three livestreams, although once I hit six, I noticed a slowdown. Livestreams were slow to load. It took a few seconds before the Stealth 16 could play the video as normal.\nStaying cool\nHeavy workloads do cause the Stealth 16 to heat up a bit, but high temperatures were never an issue. Heat vents are strategically placed above the keyboard, on the side of the laptop, and on the bottom, so your hands are never at risk of touching a hot keyboard. In fact, the keys stayed nice and cool the entire time. Unfortunately, this means you can't place the computer on your lap; otherwise, your legs will be blasted by hot air.\nThis ability to stay cool under duress is thanks to the Cooler Boost 5 cooling system, which consists of two large fans and five heat pipes directing hot air out through the vents. This system is also on the vastly more powerful MSI Raider 18 HX.\nUnsurprisingly, MSI's Stealth 16 is not designed to be away from its charger for long. You can push its endurance by enabling ECO-Silent and Integrated Graphics Mode in the MSI Center app, and Best Power Efficiency in Windows, but even then, it will last around six hours on a single charge, depending on what you're doing.\nLike many gaming laptops with this kind of hardware, it may have power, but it lacks in stamina. For that reason, I'd suggest this for users who don't need an all-day battery kind of laptop, but are fine with a few hour stints throughout the day.\nZDNET's buying advice\nThe MSI Stealth 16 AI is on sale at Best Buy for $2,030, which is a good price for a laptop with this kind of hardware. I recommend this device to anyone looking for an affordable gaming laptop that can also be used as a work machine. If you like this laptop but want to save some cash, its predecessor, the Stealth A16 AI+, is very similar and still relevant in 2025, retailing for $1,800.\nIf you want a more powerful graphic design computer, I suggest the Alienware 18 Area-51. It is a much more powerful gaming laptop that leaves every laptop I mentioned so far in the dust. I think it's one of the best for the year. It is, however, very expensive; my review unit cost $3,200."
    },
    {
      "url": "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI replaced my Samsung OLED TV with this Sony Mini LED model for a week - and didn't regret it\nSony Bravia 5 TV (98-inch)\nZDNET's key takeaways\n- Enhanced color, contrast, and clarity make this TV live up to its hype.\n- It handily delivers upscaled HDR content and high-speed footage.\n- A soundbar will complement its size, and its off-angle viewing can be less than perfect.\nSony recently sent us the 2025 Bravia 5 TV, this one with a 98-inch screen and weighing in at 158 pounds. It goes without saying that this TV is a beast -- an expensive one. And the Bravia 5 is not even considered the company's flagship model (you can look to the Bravia 8 II and Bravia 9 for that). But this TV is impressive, and after testing it for a week, I'll explain why.\nAlso: You should turn off this default TV setting ASAP - and why even experts recommend it\nThe Bravia 5 is a Google TV, so setting up the UI was fairly easy using the remote and the Google Home app on my phone. But be prepared for a series of screens requiring you to check boxes for privacy disclaimers. The era of streaming content has become very complicated.\nOtherwise, the interface is intuitive, offering quick access to a vast selection of streaming services, apps, and voice control capabilities via Google Assistant. The personalization features are also a plus for helping you discover new content.\nThis behemoth of a display comes with a relatively small remote control. It's slender and lightweight, and if you have fat fingers like me, you might accidentally press enter when you meant to press a navigation button.\nAlso: Your TV's USB port has an underrated feature that can revitalize an old system for free\nI appreciate the downsizing of remotes across most brands these days. Yet despite all the streamlining, Sony (and most others) insist on including dedicated app buttons. You know, for Netflix, YouTube, Disney+, and whatever other platforms the manufacturer contracts with. These buttons take up a lot of real estate and make the remote seem almost \"disposable\" because brands get bought, sold, and sometimes change names.\nFor example, I have a Roku TV with a Vudu button. Who or what is Vudu? That platform still exists, but it's now known as Fandango Media (a joint venture between NBC Universal and Warner Bros.).\nI don't mean to make an example of Sony; its engineers are simply abiding by the current trend. Yet, I haven't met anyone who says they use these dedicated app buttons. When you have a smartly designed home screen, you don't need them.\nThat is one of my two peevish critiques of the Sony Bravia 5. Second is the fact that this remote is not backlit. Come on, Sony. If I'm buying a $6,000 TV, I envision a home cinema experience in the dark (just like in a movie theatre). This means I don't want to turn on my phone to aim a light source at the \"magic wand\" just so I can pause the thing when my DoorDash order arrives. To me, backlighting on remotes seems like a simple ask for anything above a budget model television.\nApologies for my digressionary rant on remote control design. Despite these minor gripes, it became clear to me that the Bravia 5 has plenty to shout about.\nAlso: The next big HDMI leap has arrived - how the 2.2 standard is shaking things up\nFor one thing, Sony's prowess in display technology is impressive. Its proprietary Cognitive Processor XR upscales images beautifully, ensuring motion is slippery smooth with minimal blur. From fast-paced action scenes in the 2023 Mission: Impossible rendition to 2025 NBA highlights, the Bravia 5 delivered 4K resolution with exceptional clarity, vibrant colors, and impressive contrast. HDR content truly pops, showcasing deep blacks and brilliant highlights.\nWhile 4K content looks phenomenal, lower-resolution content (like older cable broadcasts) tends to reveal imperfections more noticeably on such a large screen, even with the XR processor's excellent upscaling.\nThe Sony Bravia 5 can display up to a 120Hz refresh rate with VRR and ALLM enabled, which means the TV dynamically adjusts to match the frame rate of the content being displayed. This is especially good news for gamers. With those kinds of specs, playing Fortnite on a display of this size is an electrifying experience. The Bravia 5 showed no sign of screen tearing, with exquisitely responsive gameplay.\nAlso: The best Sony TVs of 2025: Expert tested and reviewed\nAlready impressed by the images on this behemoth TV, I ran a few tests at the lab for dirty screen effect, burn-in, and blooming. I clocked no degradation, even close to the edges. The color test was consistent; the subtitle test yielded no visible blooming, and the scrolling text motion was liquid.\nHaving said that, viewing the Bravia 5 from side angles was not the best. It's fair to assume that, with the same build and technology in a smaller Bravia 5, this would also be the case. With a 98-inch screen, though, you probably won't get many complaints from someone sitting on the far edge of your couch. And while Sony TVs generally handle reflections well, a screen this large can still be susceptible to glare in brightly lit rooms, so strategic placement and light control are important factors. (You might consider getting some blackout curtains.)\nAlso: I changed 12 settings on my Apple TV to instantly improve the performance\nThis Mini LED TV bears a peak brightness of around 800 nits. That isn't eye-popping OLED-level brightness, but in a dark room, you might want to lower the brightness on a Bravia 5 to prevent eye strain. Trust me, the TV is plenty bright, and it can accommodate seating from any conceivable home theater.\nWhat about sound? The Sony Bravia 5 uses Sony's Acoustic Multi-Audio system, and it's worth some praise. It combines two down-firing X-Balanced speakers for bass and midrange with a pair of Sound Positioning tweeters on the top corners of the back panel to handle mids and highs. The result is a well-balanced listening experience, with clear dialogue and vocals complemented by ambient effects that fill the space nicely.\nFor the ultimate audio experience, though, the Sony Bravia 5 could use a companion soundbar to round things out. Again, if you're investing this much in a giant screen, then your budget might not be too far stretched to install a comprehensive surround sound system as well.\nAlso: This is the soundbar I recommend for deeply immersive audio - and now it's $300 off\nThe Bravia 5 has an impressive array of connectivity options, including Wi-Fi 6E and Bluetooth 5.3 on the wireless side, and several physical ports. I really like how Sony included an infographic panel (of sorts) right next to each port to make it clear which cables go where. It comes with four HDMI ports -- one of them eARC (for that soundbar you should buy), another being 4K at 120Hz (for your online gaming needs).\nZDNET's buying advice\nThe 98-inch Sony Bravia 5 is a formidable piece of home entertainment technology. Its stunning picture quality, immersive scale, and excellent smart features make it a dream display for any cinephile or gaming enthusiast.\nGrand proportions notwithstanding, Sony's quality will shine through on any smaller-sized Bravia 5 screen. This one runs for about $5,999, whereas you can get an 85-inch Bravia 5 for less than half that price or a 75-inch for one-third the cost.\nEven if it's not about the money, not every home can accommodate a colossal 98-inch panel. So, if your home's parameters aren't suitable for something this big, you'll arguably be getting a better value by downsizing a step or two on screen size.\nIf you have the budget and space, the Bravia 5 delivers on its promise of a magnificent viewing experience. And if you're seeking the ultimate home cinema experience, pair this TV with a high-end soundbar to match the visual grandeur with equally powerful and nuanced audio.\nHow we test TVs\nWhile testing and researching the TVs featured on this list, I and other ZDNET experts kept these criteria in mind:\n- Price: Not all budgets are created equal. And if you're working with a limited budget, that shouldn't mean you have to settle for a sub-par TV.\n- Screen size: The most important factor to consider, after price, when shopping for a new TV is whether or not it will fit into your space.\n- Picture and audio quality: A new TV doesn't mean much, even if it costs an arm and a leg, if it doesn't provide a great picture and clear audio. The best TVs we test have often been ensured to support various HDR codecs, including HDR10+ and Dolby Vision, as well as enhanced audio software like Dolby Atmos, Dolby Digital Plus, and object-tracking sound.\nFor a more detailed look, check out our extensive TV testing methodology."
    },
    {
      "url": "https://www.zdnet.com/article/this-tiny-keychain-is-a-mighty-tool-for-your-personal-safety/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis tiny keychain is a mighty tool for your personal safety\nAs a young woman living in New York City, it's an unfortunate reality that I have to always be aware of my surroundings when stepping out of my apartment. Carrying around pepper spray or even a small pocket knife has proven effective for some, but my natural clumsiness, lack of training, and the possibility of those tools being turned against me have always been unsettling.\nAlso: 7 ways AirTags can simplify your life (beyond tracking keys)\nThat's where the She's Birdie Safety Alarm comes into play. When left untouched, the alarm is just an ordinary keychain that can be hung on your bag or keys. When its two-piece body is tugged apart, the 130-decibel alarm sounds, with a strobe light beaming brightly.\nThis $30 accessory was a graduation gift from my mom, who is just as, if not more, concerned about my health and safety. Today, it's a must-have wherever I go, whenever.\nIdeally, you'd use the Birdie alarm when you're in a situation of danger and seeking assistance. When you're out of harm's way or the situation is resolved, you can deactivate the alarm by sliding the looped pin back into place. The company says the keychain battery lasts up to 40 minutes after you pull out the pin, giving you a good amount of time to get to safety.\nThe Birdie alarm has a compact and sleek build and comes in fashionable colors like black, light blue, and purple. When looped through the included brass carabiner, it looks more like you've added a purse charm or luggage tag as opposed to toting a safety device. The subtlety is a feat in and of itself.\nAlso: How to GPS-track a phone\nSpeaking of luggage, the Birdie is TSA approved and the twist-off carabiner makes transferring the alarm from my work tote to my going-out bag quick and simple. I can even latch it onto my wallet when I'm just stepping out for a walk. Still, the twist-to-open design makes it difficult for the alarm to fall or be pulled off.\nWhile subtle-looking, the Birdie has become popular enough to make most perpetrators think twice when they see one. My friend who recently graduated from the University of Texas at Austin claims that the Birdie has become so widely known that just having it on the outside of your purse alone acts as a deterrent.\nLuckily, I haven't had to put the Birdie to a real-life test. And while I'd like to keep it that way, I have tested the alarm mechanism to exactly see how loud it was. To put it in words, the alarm is bright and loud and would have me running away in seconds. If you do end up purchasing the Birdie, I also recommend familiarizing yourself with the sound. As a tip, cover the speaker with your fingers to muffle the sound and, most importantly, warn your roommates.\nAlso: How to find out if an AirTag is tracking you\nThe Birdie is by no means foolproof, but it does grant me (and my mom) peace of mind for only $30. I should also mention that since I received the Birdie, the company has rolled out a smarter, more compact successor, the Birdie+. Aside from the original alarm features, the Birdie+ uses Bluetooth and the Birdie+ app to implement even more safety features. With the Birdie+ app, you have 24/7 instant access to a live support rep, can share your location with emergency contacts, and, my personal favorite, receive a fake \"excuse-to-leave\" call when you're in an uncomfortable situation.\nThe Birdie+ keychain alarm starts at $39 but requires an additional $90 annual subscription fee after the initial six-month free trial. Regardless of which model, I can't recommend the Birdie alarm enough as it continually acts as a simple, non-violent solution to making me feel safe."
    },
    {
      "url": "https://www.zdnet.com/article/why-i-recommend-this-200-android-phone-with-a-paper-like-display-over-competing-models/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhy I recommend this $200 Android phone with a paper-like display over competing models\nTCL 60 XE Nxtpaper 5G\nZDNET's key takeaways\n- TCL's 60 XE Nxtpaper 5G is on sale on Amazon for $222.\n- It has a unique display, and a feature set that promotes minimalism and digital well-being.\n- I just wish the camera system and general performance were better.\nBeing glued to your smartphone's screen all day can do a number on your eyes, and I definitely can feel it. TCL's Nxtpaper technology offers a paper-like screen that's made for tired eyes like mine. The TCL 60 XE Nxtpaper 5G is the company's affordable attempt at relieving some of the stress that comes from modern smartphone screens.\nAlso: Changing this Android setting instantly doubled my phone speed (Samsung and Google models included)\nIt's a unique trick for a very inexpensive smartphone that needs to be seen to be understood. While far from perfect, and definitely a device built to a price, it brings a differentiator that will matter for some users looking to give their eyes a rest while they scroll or read.\nA unique multi-faceted display\nThe display is what immediately sets the 60XE apart. TCL's Nxtpaper 3.0 matte coating gives the glass an undeniably unique finish that I quite like. On-screen content looks a bit like E-ink depending on the mode the phone is in, but underneath that hazy layer is a standard 1080p, 120Hz LCD panel.\nThe coating addresses a slew of common downsides of modern displays. It reduces blue light, cuts reflections to nearly nothing, and even eliminates most fingerprints. There's also a nice texture that feels a bit like paper, which is a nice departure from a sea of glossy, reflective displays.\nBeneath the power and volume buttons is a physical Nxtpaper Key, a plastic switch that feels a bit cheaper than I'd like. Flipping the switch offers up a menu of distinct modes that change how the display operates.\nTCL clearly wants users to notice and appreciate this feature because every toggle results in a five-second full-screen animation complete with an obnoxious serenade. I made sure to set my volume to mute so I could avoid the theatrical effect.\nEach mode provides its own twist on usability and comfort. Color Paper Mode, my favorite, mutes the colors while retaining a standard Android interface that's easier on the eyes for all-day use. I even enjoyed watching YouTube videos in this mode, though everything feels a bit flatter than my eyes are used to.\nInk Paper Mode goes one step further, stripping color from icons and text for a no-frills grayscale approach, while still delivering the full unencumbered Android experience. Max Ink Mode is the most dramatic change, stripping all color while also limiting apps to a small subset of essentials and suspending certain background processes.\nAlso: iOS 26 envy? 5 iPhone features you can already use on your Android (Samsung included)\nThe result is an ultra-minimal, battery-saving mode that can last more than a week on a single charge. I enjoyed this mode for reading ebooks and could see it as a great solution for users looking to cut back on smartphone use entirely.\nThe display does come with a major caveat. On the brightest days, the matte finish would all but wash out on-screen content, often making it unusable in direct sunlight. If you spend time outside reading or working, you'll be looking for shade like I was.\nPerformance and battery\nPerformance is modest but serviceable, with a MediaTek Dimensity 6100+ processor inside paired with 8GB of RAM. In use, this is not a phone for hardcore users who push their devices to the limit. I noticed many actions have a slight delay attached to them. Launching the camera often takes a few seconds to negotiate.\nGeneral tasks like web browsing, email, and messaging are responsive enough to keep me happy, but things never felt snappy.\nOn the software front, the 60 XE runs Android 15, with a promise from TCL of just one upgrade to Android 16 and two years of security patches. As someone who always decries the poor state of Android OS update promises, this is a weak point, and TCL needs to step up its game. Anyone hoping to get long-term value should consider other options.\nAlso: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nI found battery life to be a highlight, which isn't that surprising given the 5,010mAh battery hidden inside. I routinely made it through the day with around 20-30% capacity to spare at bedtime. Wired charging tops out at a slow 18 watts, so quick daytime top-ups will take some time, but it's fine for plugging in overnight.\nFor the truly battery paranoid, there's the Max Ink Mode that considerably jumps battery life to more than a week if you are willing to cut down on much of what the phone is capable of.\nStay for the display, but not the camera\nThe plastic marble-like backplate surrounds a large circular camera array that's hard to miss and perhaps even more premium-looking than its price point. One pet peeve of mine is an off-center camera module, and this phone has a notable wobble when placed on a tabletop as a result.\nThe camera system itself is one area where the low-end cutbacks really show. The main sensor does its best outdoors in very bright conditions and needs a lot of light to help shots taken indoors. The camera performance is mediocre with soft output that lacks punch and definition most of the time.\nLow-light conditions easily demonstrate the camera system's baseline capability, and the ultrawide lens often results in grainy images. The 32MP front camera works, but that's about it. Let's just say that this is not the phone for the discerning camera buff.\nZDNET's buying advice\nWhat the TCL 60 XE Nxtpaper 5G offers is a key standout feature: a unique matte display. At $250, the 60XE offers something that you really can't find anywhere else, in this price category and beyond, and the benefits of that might matter a lot for certain users. For everyone else, consider phones like the CMF Phone 2 Pro, which offers better imaging, better speed, and its signature modular design approach.\nFollow my latest tech reviews and projects across social media. You'll find me on YouTube at YouTube.com/@JasonHowell, on X (formerly Twitter) at @JasonHowell, and on Instagram at Instagram.com/thatjasonhowell."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/this-airtag-key-organizer-has-survived-the-ultimate-torture-test-and-id-buy-it-again-any-time/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis AirTag key organizer has survived the ultimate torture test - and I'd buy it again any time\nIn November of 2022, I decided I needed to organize my pocket EDC (everyday carry) gear. As part of that reorganization, I picked up a KeySmart Air key organizer as a way to both keep my keys sorted and also attach an AirTag to them.\nAlso: 10 tiny tools I carry with me everywhere - how they work\nSo, here we are, almost three years on, and I'm still using the KeySmart Air, and while it's looking a little battered, it's still going strong.\nThe KeySmart Air comes in three versions -- faux leather, leather, and a polymer variant called Flex (I'm sure only the leather and faux leather were available when I bought mine -- and I went for the faux SmartShield leather version because KeySmart said it had a \"rugged leather feel\" yet lasted \"10x longer than traditional leather.\" That sounded good to me.\nAlso: My new favorite keychain holder can carry up to 14 keys (and is trackable by phone)\nThe idea behind the KeySmart Air is simple -- it's a loop of material where the keys fit onto a screw fastener, and the AirTag fits into a molded loop. Fitting your keys into the holder is quite easy: All you need is a flat-headed screwdriver (or a thin coin).\nSimple, but it's super effective.\nWhat I like about the KeySmart line is that they make a ton of cool accessory tools that fit into the Air or their other key organizers, such as a mini knife (not TSA friendly, so be aware of that), a tiny 5-in-1 multitool, a magnetic breakaway connector, and a range of other small but useful multitools. I have quite a few of these accessories; they're all good quality and worth the money.\nSo, how has the KeySmart Air held up to almost three years of use?\nVery well. Sure, it looks rougher than when I got it out of the box, but it's still perfectly functional and serviceable. The material is still perfectly intact, and the screw fastener that holds the keys is like new. And for $30, I can't complain.\nAlso: I never leave home without this viral USB-C key ring accessory\nOne modification that I did to my KeySmart Air was to replace the supplied metal split ring with a KeyUnity titanium D-ring shackle because that was both more convenient and a more robust choice for my setup. It was an easy upgrade to personalize an already valuable tool for my lifestyle.\nWhy I recommend this product\nThings that are part of my EDC get quite a hard life, and when I picked up the KeySmart Air I was curious to see how well it would hold up. And now several years on, I'm happy to report that it's been fantastic. It's securely held my keys, tools, and AirTag, and has lasted through daily use without a hitch.\nIt's one of the nicest AirTag holders I've used, far nicer and more compact than the pendant-style holders. I'm not a fan of the silicone AirTag holders because I've had some where the tag has fallen out. There's no chance of that with the KeySmart Air.\nThe faux leather has held up surprisingly well, but I am curious how well the genuine leather and polymer would hold up. I might get some to test!\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends."
    },
    {
      "url": "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI fell in love with a $2,000 mirrorless camera that puts design and simplicity over everything else\nSigma BF\nZDNET's key takeaways\n- Sigma's BF is a $2,200, 35mm full-frame, mirrorless digital camera that radically changes the mode of operation by replacing the gaggle of buttons with an elegant click-wheel.\n- It's a great first camera but also has tons of pro features\n- A future upgrade to a higher-resolution 60-megapixel sensor would be a welcome enhancement.\nTaking pictures with a digital camera hasn't changed much in thirty years. The electronics have improved, but the basic act of operating a digital camera has remained mostly the same. Cameras are a gaggle of buttons that are a cryptic arrangement to anyone but the initiated.\nThe real innovation in the picture-taking experience has been the smartphone, which has made picture-taking an always-available tool for documenting everything with relative ease.\nThere is still an audience, however, for innovation beyond what smartphones offer. Young consumers keep buying digital cameras, and a new generation is always interested to learn more about photography as an art.\nAlso: The best vlogging cameras of 2025: Expert tested and reviewed\nInto the void steps lens and camera maker Sigma Corp., based in Kanagawa, Japan, just outside Tokyo. The company this spring introduced a radical redesign of the digital camera's basic mode of use.\nThe Sigma BF, as it's called, reduces the mass of buttons to a small set of touch-sensitive controls. All the functions of digital photography are still there to be experimented with and exploited -- shutter speed, lens aperture, or \"f-stop,\" and \"ISO,\" the level of light that can be recovered from a scene -- but they are under your command in a radically simplified user interface.\nI've been testing the BF for some weeks now, and I'm smitten with the changes. The hardware's design is beautiful, and the new user interface is very thoughtful. The name \"BF\" stands for \"beautiful foolishness,\" and you could say this kind of redesign is crazy, but I love it.\nA camera for a new age of photographers\nSigma, a sixty-three-year-old company, makes most of its money from lenses for all camera brands. As a result, its cameras have tended to be somewhat experimental, never selling in the same volume as Sony, Canon, or Nikon. That means that the company takes chances. Often, the results are wild and beautiful.\nThe BF is really meant for a new age of prosumers who want to up their game in photography. At a retail price of $2,199, the price is not insignificant, but it is on the low end for what you'd pay for a very good 35mm digital camera these days. Lenses, which have to be bought separately, run from about $600 for a fixed focal length \"prime\" lens to $1,300 or more for zoom lenses. The BF uses what's called an \"L-mount,\" which means you're not limited to Sigma's lenses; it's also compatible with lenses from Leica, Panasonic, Samyang, and Sirui.\nAlso: Eufy's latest security camera has AI-powered color night vision - and no monthly fees\nThe premise of stepping up your game from the smartphone camera is pretty simple, to my mind: You will never, ever, get as good a picture with any smartphone camera as you will with a camera that has a real lens. The lens is the key. The optics are just so superior to the optics on a smartphone.\nI tested the BF with a 50mm prime lens from Sigma, the same kind I already use for most of my photography.\nNo matter what you are photographing, there are immediate benefits to using a real camera versus a smartphone camera.\nOne benefit is the detail you get. Here's a picture of a butterfly landing on some vegetation in a vivarium. When cropping the image to see the butterfly up close, you'll get a level of detail that is clean rather than the murky detail you get even with a smartphone's optical zoom:\n(None of these photos have been edited. They are all straight out of the camera. In some cases, the file size has been compressed to accommodate the publishing system.)\nNot only detail but also control of the depth of field via the aperture dial on the lens provides control over the selective blurring of objects, the \"bokeh.\"\nSmartphones will give you fake bokeh that is generated in software rather than the actual bending of the light via the lens elements. Rarely will fake bokeh give you a really complex, thrilling effect where both foreground and background elements are selectively blurred, leading to a more sophisticated image, such as this cypress I snapped in New York's Central Park:\nAnd even when fake bokeh works, I don't think you'll achieve the almost holographic, floating beauty you get with a real lens while preserving all the detail of the foreground subject, as with this thistle:\nThe second advantage is that a real lens will give you more real proportions than a smartphone lens that has a lot of barrel distortion. Like a building architectural shot or this bank vault:\nYou can get a nice, crisp skyline shot at twilight as the light changes:\nA swing to simplicity\nWhere the BF departs from other cameras is in the simplicity of design and user interface.\nThe hardware is, very simply, a solid shell milled from a block of aluminum and then filled with electronics. It's a gorgeous manufactured object with a super solid feel. (Sigma cameras always feel super solid, but this is on a new level.)\nThe BF's body is one of the lightest full-frame mirrorless cameras on the market, at just under a pound, compared to devices such as the Sony a7 IV, which weighs nearly a pound and a half.\nFor non-camera users, the weight of any real camera is something of a surprise compared to a smartphone such as an Apple iPhone Pro, which weighs half a pound. Holding 15 ounces worth of an unfamiliar object prompted some people to whom I handed the BF to remark, \"It's so heavy!\"\nAlso: First look at iPhone 17 Pro? Public images seemingly confirm big design and camera changes\nThe total weight of the camera is the combination of the 15 ounces and the 12 ounces of the 50mm Sigma lens. That kind of heft is typical of full-frame lenses because they have a lot of glass inside them. (And this particular Sigma lens is not very heavy as 50-millimeter lenses go.)\nThe real adjustment for a novice photographer is getting used to the balance of weight between camera and lens versus carrying a slab of a smartphone with uniform weight distribution.\nThe camera comes in two finishes, a striking silver color and a deep black. I chose to try the black as I like to use the camera often in discreet settings such as a jazz club, so I wanted something less flashy than the silver.\nThe sensor is a full-frame, 35mm Sony chip with just under 25 megapixels, less than the 60 megapixels in some 35mm cameras. Despite a lower pixel count, I found the sensor produced rich detail, certainly enough for Instagram pictures and possibly good enough for wall-sized prints depending on the exposure. Sony is a very reliable name for sensors, so it makes sense for Sigma to go with the market leader.\nImages are stored in the internal 230-gigabyte flash memory, which I found to be more than enough for my purposes. I usually offloaded the pictures onto my iPad or MacBook after each photo-taking session via USB-C and then cleared the BF's memory.\nAlso: Why the best fix for headless server frustration might be a little box named Comet\nOn the software side, the radical simplification of the user interface is striking -- it's even something of a revelation.\nI've been a user of Sigma cameras for over a decade, my main camera these days being the Sigma fp-L, a 60-megapixel model introduced a couple of years ago. I love that camera, but I would be very happy to see the changes in the BF user interface become standard on Sigma cameras going forward.\nThe main innovation is removing a lot of shooting information from the LCD screen. Instead of seeing the aperture or shutter speed and other settings constantly on the display, each setting on the BF occupies a separate, tiny LCD -- it's called a \"status monitor\" though I tend to think of it as simply a \"mini-LCD\" -- to the right of the main display.\nA click wheel just below the mini-LCD, formally called the \"dial pad,\" reminiscent of the first Apple iPod's click wheel, lets you rotate through the values of shutter speed, etc. The changing values are displayed on the mini-LCD as you do so, and you click the center button of the click wheel to select the setting you want.\nThere's also a touch-sensitive playback button, so you can peek at what you just snapped with a soft touch, and a touch-sensitive menu button, which is a quick way to peek at the camera's settings. And a power button at the bottom of all this, of course.\nThe effect is that the main display screen is a pristine window into what you're capturing in the real world, while the mini-LCD and the click-wheel are your controls. It's a nice division that elegantly separates the gaze from the adjustments.\nThe main LCD is a 2.1 megapixel model and is terrifically responsive for things such as selecting the focus area by tapping with your finger, or using pinch and swipe when looking through the photos you've taken.\nAlso: Stanford's holographic AI glasses are coming for your clunky VR headset\nIf you half-press the shutter button, the display momentarily shows the key settings before you fully commit to the shutter release. If you press on the center button of the click-wheel, or dial pad, extra settings come up for the function that's in focus, such as shutter speed.\nStreet photography delight\nThe BF's light weight and simplified user interface made for nice street photography, one of my favorite pastimes.\nI tended to carry the camera at my waist in one hand, holding onto the lens, sometimes with the camera body flipped upside-down, with my pinky finger on the shutter button. That way, I achieved a kind of nonchalant pose that did not draw attention to my picture-taking.\nAlso: I used Google's photo-to-video AI tool on my selfie - and it made me do the tango\nSometimes, I looked at the LCD to see what I was snapping, but oftentimes, I just took a picture in the general direction to see what chance would produce.\nThe autofocus function of the BF was super fast, notably faster than the response time of the fp-L, probably because of the BF's lower-megapixel-count sensor. That made for excellent motion capture, such as this basketball game:\nOne of the BF's shortcomings is having an electronic shutter: Instead of mechanical blades opening and closing, the sensor chip controls in software when the exposure happens. The common knock against an electronic shutter is that it can lead to blurring of fast motion. In the case of the basketball game, in late afternoon daylight, I saw no issue.\nAnother potential drawback is that indoors, in artificial light, the electronic shutter can produce dark bands across the image if the shutter speed is too fast. That can require you to take the picture at a slower shutter speed. In practice, I found it not to be much of a problem.\nImproved electronics\nIn addition to autofocus speed, Sigma has done a very good job with the BF's low-light support, which was already quite good on the fp-L.\nOne of my favorite low-light picture tests is a diorama in the North American mammals hall of the American Museum of Natural History in Manhattan. This is one of the darkest exhibits in the museum, and it's challenging to photograph if you don't have the camera resting on a tripod to allow for a long exposure.\nAlso: Why ads are coming to your favorite AI bots and you've only got yourself to blame\nTwo taxidermy wolves run on a painted landscape of the Michigan countryside. To the naked eye, the diorama is very, very dark because it is meant to suggest nighttime on the prairie. Here's what it typically looks like, taken with minimal low-light support by the BF:\nMost museum visitors who view the diorama turn on their smartphone camera's flash to take a souvenir shot. But, to my mind, flooding the scene with flash spoils the effect.\nInstead, I cranked up the BF to its highest ISO setting, 102,400 -- fairly high up there for any digital camera. The result is that the wolves emerge in beautiful detail from the darkness -- not as sharp or clean as if the scene were well-lighted, but that's the point:\nIn practice, the BF does a very nice job in darkly lit spaces where you might actually want a picture, such as a jazz club.\nWhen set on a tripod with professional lighting and a backdrop, the BF is also excellent for formal portraits, far better than what you'll get using a smartphone camera for your headshots.\nEven without using a macro lens, the 50mm will allow you to get pretty good closeup shots of something like your favorite toy, from a minimum distance of 18 inches, which you can then crop and still have lots of vivid detail.\nOf course, you could also add a macro lens to the BF and get even closer.\nA gentle introduction to pro features\nSigma has simplified some of the functions for newbies so that the same technical effects are present but in a more inviting fashion. For example, on the Sigma fp-L, a separate button is for \"tone control\" that lets you adjust the light across the scene by degrees for shadows and highlights to make a scene have more or less contrast.\nOn the BF, there's no button for tone control, but when selecting colors with the click-wheel, you can bump up or down values of \"highlight,\" \"shadow,\" and \"fade,\" to alter the degrees of lights and darks. That works in both still images and videos.\nAlso: What Zuckerberg's 'personal superintelligence' sales pitch leaves out\nThere's also an option called \"look effect,\" where you can dial up or down how vivid or how flat a given color filter is, which is a nice, obvious way to understand making your pictures or videos more striking or more sedate.\nIn practice, the BF does a great job with tone and exposure on automatic. A street scene at sunset, for example, nicely balances the vivid highlights of the sky with the street detail without blown highlights or detail lost in the shadows.\nWhen you review photos, the main LCD display gives you all the information on the tone adjustments you made, which is helpful for determining what works and what doesn't.\nSome things that are typically buried in sub-menus on digital cameras are brought forward in the BF's UI.\nSo, for example, when filming a movie, you have the option to turn on \"constant AF,\" which does a better job of grabbing hold of a new subject entering the frame. That is now an option from the click-wheel rather than being buried as a sub-menu option.\nOf course, there are trade-offs to simplicity. Other functions that were accessed directly via dedicated buttons on digital cameras become things you have to hunt for.\nFor example, auto-exposure lock forces the camera to keep the amount of light in the scene the same as you move it, rather than altering the exposure. This allows you to find the right balance of light and dark and hold onto it while you shift your focus.\nAlso: The 10 apps I can't live or work without - on Windows, Mac, and mobile\nOn the fp-L, auto-exposure lock has its own button. In the BF, you have to move the click wheel to the exposure section of the menus and then turn on auto-exposure lock by tapping on the icon. This extra step is fine if you don't use auto-exposure lock much.\nAnother example is a feature of most digital cameras called fill light, the ability to lighten up dark parts of a picture. On most cameras, you have an option to turn on the fill light while you're taking pictures. On the BF, fill light is something you adjust after the fact by editing the DNG, \"digital negative,\" or \"RAW,\" image in the camera.\nSigma's suggestion overall is to use color and filter adjustments to achieve a similar effect to fill light. In other words, the user interface consolidates traditional operations such as fill light and auto-exposure lock into a simpler set of choices that can be more centrally manipulated.\nAnd some things are just different. On the fp-L, and most cameras, when recording a video, you can take a still image as you're recording. On the BF, if you want a still image as well, you do it when replaying the video, by selecting \"save as JPEG.\"\nHow it performs with video\nSpeaking of video, I found the results were very satisfying. You can take 6K video (6,016 x 3,384) that looks great even without electronic stabilization turned on.\nI took this shot of a woman having her personal photo shoot in front of the Plaza Hotel. Although it's jerky and not cinematic, it was a wonderful spontaneous moment in great quality:\nWhen you turn on the electronic stabilization feature, video is reduced from 6K to \"ultra-high-def\" (3,840 x 2,160) because the camera needs to crop each frame to line up frames and make the shakiness disappear.\nIn a low-light setting, such as this video at Small's jazz club in Greenwich Village, I thought it produced a wonderful-looking film without a tripod.\nHere's where we see an example of the click-wheel at its best. I had the fun of rotating through the different color filters to change up the color from moment to moment while filming, something I would never do when color choices are a single button.\nAlthough my use of the feature is rather gimmicky here, I can see all kinds of possibilities with the click wheel, enabling new ways of controlling the camera during filming.\nLike all cameras, the sound you record with the built-in microphone video is never as good as if you had a dedicated mic attached, especially for something like music. But I thought the result here was very good in a space with challenging acoustics.\nAlso: This hidden Pixel camera setting gave my photos the pop they've been missing\nEven in low light, using the camera hand-held, you can get a nice video like this one taken in a darkened tango hall. In a dark place like a dance hall, with swaying bodies moving to and fro, with the camera in your hand and no stabilization turned on, it can be challenging to capture motion in a way that's satisfying. I love what the BF did with the color and the lights in this scene while managing to shift autofocus from one couple to the next:\nBattery life\nBattery life was fine for my purposes. I got as much as six hours of shooting on a single charge, including intermittent shooting and periods of intense activity. That meant in some cases over 500 exposures in DNG+JPEG format. That's better than the official specification by Sigma for approximately 260 images on a charge. Of course, your results may vary.\nIn my experience, plugging the BF into an iPad via USB-C for forty minutes will charge the camera from zero back to a third of its battery life. You can also bring along a spare battery and swap it in via the latched compartment on the bottom of the BF.\nZDNET's buying advice\nThe complaints I've seen about the Sigma BF from seasoned photographers seem to be mostly about the reduction of controls to the click wheel and the mini-LCD. Consolidating controls in that way, they argue, robs the pro photographer of their muscle memory. Some pros also wish the touch screen did more to control the functions rather than just serving as a very good display.\nAlso: I tried Google's new agentic IDE, and it blows away the popular VS Code - here's how\nIn essence, pros have a hard time adjusting to a radically simplified UI. It's a fair point of view, but this is something of a Steve Jobs moment. You have to break a few eggs to make an omelette, and you may have to break habits to reinvent how photography is done.\nI think the BF is a terrific option for a beginning photographer or even an experienced pro. The touch-screen display is intuitive in a smartphone age, the electronics are just as fast as you'd expect based on smartphone picture-taking, and the output is very Instagram-worthy.\nAnd your envious friends will immediately want to know, What is that wild-looking camera you've got?"
    }
  ],
  "argos_summary": "The She's Birdie personal alarm is a compact safety device designed for personal security, emitting a loud 130db siren and flashing strobe light when activated. It has been upgraded with features like a flashlight and USB-C charging, making it a practical choice for anyone seeking peace of mind while out alone. The alarm is recommended for its discreet design and effectiveness in drawing attention during emergencies, appealing to a wide range of users including college students and parents.",
  "argos_id": "SPENBQZHS"
}