{
  "url": "https://www.morningstar.com/news/business-wire/20250814305554/vyome-closes-merger-transaction-will-trade-on-nasdaq-as-hind-tomorrow",
  "authorsByline": "",
  "articleId": "8cd42e55c2f14e3995e73a899d0ffc38",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T18:18:00-05:00",
  "addDate": "2025-08-14T23:47:33.197548+00:00",
  "refreshDate": "2025-08-14T23:47:33.197551+00:00",
  "score": 1.0,
  "title": "Vyome closes Merger Transaction, Will Trade on Nasdaq as HIND Tomorrow",
  "description": "",
  "content": "Vyome closes Merger Transaction, Will Trade on Nasdaq as HIND Tomorrow\n\nVyome Therapeutics, Inc. (“Vyome”), a clinical-stage healthcare company targeting immuno-inflammatory and rare diseases in the US and global markets with large market potential, today announced that it has closed the previously disclosed transaction with ReShape Lifesciences Inc. (Nasdaq: RSLS). The post-merger company will trade at the open of trading on Friday, August 15, 2025 under the name Vyome Holdings, Inc. and the trading symbol “HIND.”\n\nVyome is building a healthcare platform spanning the US-India innovation corridor. Based in Cambridge, MA, Vyome’s immediate focus is leveraging its clinical-stage assets to transform the lives of patients with immuno-inflammatory conditions. By applying groundbreaking science and its unique positioning across the US-India innovation corridor, Vyome seeks to deliver lasting value to shareholders in a hyper cost-efficient manner while upholding global standards of quality and safety. To learn more, please visit www.vyometx.com.\n\nCertain statements made in this press release are “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “target,” “believe,” “expect,” “will,” “shall,” “may,” “anticipate,” “estimate,” “would,” “positioned,” “future,” “forecast,” “intend,” “plan,” “project,” “outlook”, and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. Examples of forward-looking statements include, among others, statements made in this report regarding the merger, including the benefits of the merger, revenue opportunities, anticipated future financial and operating performance, and results, including estimates for growth. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on management’s current beliefs, expectations, and assumptions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict and many of which are outside of Vyome’s control. Actual results and outcomes may differ materially from those indicated in the forward-looking statements. Therefore, you should not rely on any of these forward-looking statements. Important factors that could cause actual results and outcomes to differ materially from those indicated in the forward-looking statements include, among others, the following: (a) the occurrence of any event, change, or other circumstances relating to the combined company; (b) failure to obtain the necessary consents and approvals; (c) the risk that the merger disrupts current plans and operations as a result of the announcement and consummation of the merger; (e) costs related to the merger; and (f) changes in applicable laws or regulations. Vyome cautions that the foregoing list of factors is not exhaustive. Vyome cautions readers not to place undue reliance upon any forward-looking statements, which speak only as of the date made. Vyome does not undertake or accept any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements to reflect any change in its expectations or any change in events, conditions, or circumstances on which any such statement is based, whether as a result of new information, future events, or otherwise, except as may be required by applicable law.",
  "medium": "Article",
  "links": [
    "https://www.businesswire.com/news/home/20250814305554/en/",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fcompany%2Fvyome-therapeutics%2Fposts%2F%3FfeedView%3Dall&esheet=54308877&newsitemid=20250814305554&lan=en-US&anchor=LinkedIn&index=4&md5=741cf8a8909b9357e6ec2b9c512e8029",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.vyometx.com&esheet=54308877&newsitemid=20250814305554&lan=en-US&anchor=www.vyometx.com&index=1&md5=2b22831ab5f5fb61b888f0a67c5060e8",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fx.com%2FVyomeInc&esheet=54308877&newsitemid=20250814305554&lan=en-US&anchor=X&index=3&md5=3dd911f3d9c6637925ca3cde67c7b4e3",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.facebook.com%2Fvyometx%2F&esheet=54308877&newsitemid=20250814305554&lan=en-US&anchor=Facebook&index=2&md5=36e427a97f15492b398943273b9b4aa3"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "statements",
      "weight": 0.089060456
    },
    {
      "name": "Certain statements",
      "weight": 0.08683666
    },
    {
      "name": "Vyome",
      "weight": 0.08218169
    },
    {
      "name": "Vyome Therapeutics",
      "weight": 0.081924915
    },
    {
      "name": "Merger Transaction",
      "weight": 0.07708505
    },
    {
      "name": "future events",
      "weight": 0.07202163
    },
    {
      "name": "Actual results",
      "weight": 0.0668499
    },
    {
      "name": "actual results",
      "weight": 0.0668499
    },
    {
      "name": "immuno-inflammatory conditions",
      "weight": 0.06451104
    },
    {
      "name": "future performance",
      "weight": 0.061285596
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98291015625
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.9375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.90380859375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.90283203125
    },
    {
      "name": "/News/Health News",
      "score": 0.32861328125
    }
  ],
  "sentiment": {
    "positive": 0.20533924,
    "negative": 0.09811778,
    "neutral": 0.696543
  },
  "summary": "Vyome Therapeutics, Inc. has closed a transaction with ReShape Lifesciences Inc. (Nasdaq: RSLS) and will trade on Nasdaq as Vyome Holdings, Inc., post-merger, on August 15, 2025 under the trading symbol \"HIND\". The clinical-stage healthcare company is targeting immuno-inflammatory and rare diseases in the US and global markets with significant market potential. Vyom is building a healthcare platform spanning the US-India innovation corridor. The company's immediate focus is to transform the lives of patients with immunositable conditions by applying groundbreaking science and positioning across the US.",
  "shortSummary": "Vyome Therapeutics closes its merger with ReShape Lifesciences, plans to trade on Nasdaq as HIND, emphasizing potential for future growth and profitability.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "cb9ab92eb7b54483bcfe29f694b2f711",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Vyome Therapeutics, Inc. has completed its merger with ReShape Lifesciences Inc. and will begin trading on Nasdaq as Vyome Holdings, Inc. under the symbol \"HIND\" starting August 15, 2025. The company aims to leverage its clinical-stage assets to address immuno-inflammatory conditions and enhance shareholder value while maintaining high standards of quality and safety. The announcement includes forward-looking statements regarding the merger's potential benefits and associated risks.",
  "argos_id": "SUNK4E191"
}