{
  "url": "https://finance.yahoo.com/news/malibu-boats-inc-announces-earnings-231600304.html?_guc_consent_skip=1755214182",
  "authorsByline": "Malibu Boats, Inc.",
  "articleId": "f7384cfcb787412298313f718ce8a70b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/6ffd3fe70387269d15112e92b4199c8a",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:16:00+00:00",
  "addDate": "2025-08-14T23:31:48.107214+00:00",
  "refreshDate": "2025-08-14T23:31:48.107215+00:00",
  "score": 1.0,
  "title": "Malibu Boats, Inc. Announces Earnings Release Date and Conference Call Information for Fourth Quarter and Full-Year Fiscal 2025 Financial Results",
  "description": "LOUDON, Tenn., Aug. 14, 2025 (GLOBE NEWSWIRE) -- Malibu Boats, Inc. (Nasdaq: MBUU) announced today that it will release its fourth quarter and full-year fiscal 2025 financial results on Thursday, August 28, 2025, before the market opens. Following the release, the company’s management will host a conference call to discuss the results at 8:30 a.m. Eastern Time on the same day. The call will be hosted by Malibu’s Chief Executive Officer, Steve Menneto, and Chief Financial Officer, Bruce Beckman.",
  "content": "LOUDON, Tenn., Aug. 14, 2025 (GLOBE NEWSWIRE) -- Malibu Boats, Inc. (Nasdaq: MBUU) announced today that it will release its fourth quarter and full-year fiscal 2025 financial results on Thursday, August 28, 2025, before the market opens. Following the release, the company’s management will host a conference call to discuss the results at 8:30 a.m. Eastern Time on the same day.\n\nThe call will be hosted by Malibu’s Chief Executive Officer, Steve Menneto, and Chief Financial Officer, Bruce Beckman.\n\nInvestors and analysts are invited to listen to the conference call by dialing (844) 695-5523 or (412) 317-0699. Alternatively, interested parties can listen to a live webcast of the conference call by logging on to the Investor Relations section on the Company’s website at https://malibuboatsinc.com/investor-information/events-presentations. A replay of the webcast will also be archived on the Company’s website for twelve months.\n\nBased in Loudon, Tennessee, Malibu Boats, Inc. (MBUU) is a leading designer, manufacturer and marketer of a diverse range of recreational powerboats, including performance sport, sterndrive and outboard boats. Malibu Boats, Inc. is the market leader in the performance sport boat category through its Malibu and Axis boat brands, the leader in the 20’ - 40’ segment of the sterndrive boat category through its Cobalt brand, and in a leading position in the saltwater fishing boat market with its Pursuit and Cobia offshore boats and Pathfinder, Maverick, and Hewes flats and bay boat brands. A pre-eminent innovator in the powerboat industry, Malibu Boats, Inc. designs products that appeal to an expanding range of recreational boaters, fisherman and water sports enthusiasts whose passion for boating is a key component of their active lifestyles. For more information, visit www.malibuboats.com, www.axiswake.com, www.cobaltboats.com, www.pursuitboats.com, or www.maverickboatgroup.com.",
  "medium": "Article",
  "links": [
    "http://www.pursuitboats.com",
    "http://www.cobaltboats.com",
    "http://www.malibuboats.com",
    "https://malibuboatsinc.com/investor-information/events-presentations.",
    "http://www.maverickboatgroup.com",
    "http://www.axiswake.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Malibu Boats",
      "weight": 0.102242485
    },
    {
      "name": "Conference Call Information",
      "weight": 0.10202239
    },
    {
      "name": "Malibu",
      "weight": 0.08190074
    },
    {
      "name": "water sports enthusiasts",
      "weight": 0.07624526
    },
    {
      "name": "recreational powerboats",
      "weight": 0.07256334
    },
    {
      "name": "Chief Financial Officer",
      "weight": 0.07213814
    },
    {
      "name": "Malibu Boats, Inc.",
      "weight": 0.06742133
    },
    {
      "name": "Earnings Release Date",
      "weight": 0.06489181
    },
    {
      "name": "recreational boaters",
      "weight": 0.06384583
    },
    {
      "name": "the performance sport boat category",
      "weight": 0.06382577
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97802734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9560546875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95361328125
    }
  ],
  "sentiment": {
    "positive": 0.7210293,
    "negative": 0.019863479,
    "neutral": 0.2591073
  },
  "summary": "Malibu Boats, Inc. will release its fourth quarter and full-year fiscal 2025 financial results on August 28, 2025, before the market opens. Following the release, management will host a conference call to discuss the results at 8:30 a.m. Eastern Time. The call will be hosted by Malibu’s Chief Executive Officer, Steve Menneto, and Chief Financial Officer Bruce Beckman. Interest parties can listen to the conference call via a live webcast on the company's website.",
  "shortSummary": "Malibu Boats will release its fourth quarter and full-year financial results on August 28, 2025, with management hosting a conference call.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "fd84fce91856417b82c2c3a89b562a2f",
  "places": [],
  "scraped_sources": [
    {
      "url": "http://www.axiswake.com",
      "text": "A-Series\nFrom the Axis A20 to the champion A245, each model in the A-Series is built for crews looking to catch the perfect wave with our patented Wake Plus™ Hull\nT-Series\nAxis Wake T-Series models are uniquely designed with all the features your crew needs for epic summer adventures for a value you can't find anywhere else.\nAxis A-Series\nThe A-Series includes three world-class pickle-fork wakesurf & wakeboard boats that each deliver a unique on-the-water experience. From the compact A20 to the champion A245, each model in the A-Series is built for crews looking to catch the perfect wave. Let your jaw drop as you surf endless waves all summer long.\nMost Agressive Axis EVER\nAxis A245\nLeveled Up Mid-Size Wake Boat\nAxis A225\nAmazingly Agile\nAxis A20\nAxis T-Series\nWith three models ranging from 22’ to 25’, each T-Series model is uniquely designed for world-class wake and wave performance. Equipped with all the features your crew needs for epic summer adventures, the T-Series gives your crew plenty of room to play and delivers a premium on-the-water experience for a value you can't find anywhere else.\nMade to Go BIG\nAll-New Axis T250\nA Technical Knockout\nAxis T235\nMid-Sized Powerhouse\nAxis T220\nThe Axis Wake experience is something you need to see to believe. Contact your local dealer to dip your toes into our world-class wakes – you won’t be disappointed.\nAll-New Axis T250 is HERE\nReady to GO BIG? Meet the all-new Axis T250—the biggest, boldest wake boat Axis has ever built. With standout style, smart tech, and performance that delivers clean, dialed wakes every time, this is the boat to beat for 2026.\nA storm is coming.\nGet ready to experience power, torque, efficiency and performance unlike anything else you have seen before. Get ready for Monsoon Season.\nPulled by Axis\nLiquid Force announces the long-anticipated return of BROstock — pulled by Axis Wake in 2025. As the official wakeboat of Liquid Force, Axis is honored to continue its long-standing relationship with Liquid Force to reignite the watersports world in the greatest double-up competition of all-time.\nAll New Malibu Monsoon™️\nAxis Surf Gate®\nAxis Athletes & Ambassadors\nAxis Gear Store\nThis wake boat isn’t just the biggest Axis ever built—it’s a statement. Standout style. Serious performance. Pure hype. The T250 was built for riders who Go BIG—and crews that Go All Out.\nPart 1 - How To Trailer Your Boat\nFrom your driveway to the boat ramp, here are several safety tips on how to tow your boat like a pro and kick-start your day on the lake.\nRead More\nPart 2 - How To Launch Your Boat\nThe perfect start to an action-packed day on the water is a seamless launch. Follow along to become a boat ramp champ in no time.\nPart 3 - Driving Like A Pro\nYou’re the captain and you hold the keys to the perfect summer. These tips and Axis tricks will have you up and running before you know it.\nPart 4 - Docking Your Boat\nWe’re taking the nerves out of docking. Start slow, and in no time you’ll be able to dock your Axis in the sun, wind, or rain.\nContact your local dealer to schedule your on-the-water demo & join the Axis Wake Movement. You’ll be glad you did."
    },
    {
      "url": "http://www.maverickboatgroup.com",
      "text": "The World’s Most Advanced Technical Poling Skiffs.\nSkiffs designed for anglers that fish on the edge and push the limits of their skills and equipment, including their boats. Maverick has been responsible for every significant breakthrough in flat boat technology. Sit back, buckle up and enjoy the ride.\nEverything Else Is Just A Bay Boat.\nWhen you think bay boat, you think Pathfinder. Whether you’re a serious tournament angler, a weekend warrior, or a family who wants to experience everything the water has to offer, there’s a Pathfinder model designed especially for you. Come inside and see the Pathfinder difference.\nThe Boat That Invented The Sport.\nThere’s no higher bar than the test of time. If you want a solid, stable, and bulletproof shallow water fishing tool with the versatility to also fish inlets, passes and bays, you’ve come to the right place. Hewes has been doing it longer than anybody.\nHave It All.\nCobia boats deliver the perfect balance of fishing smarts and comfort, built with best-in-class quality and performance. Thanks to our superior hull design, intelligent deck layouts and more user-friendly helms, no other boat blends family-friendly functionality and tournament-grade performance into a single package the way Cobia does."
    }
  ],
  "argos_summary": "Malibu Boats, Inc. will announce its fourth quarter and full-year fiscal 2025 financial results on August 28, 2025, before market opening, followed by a conference call at 8:30 a.m. ET. The call will be led by CEO Steve Menneto and CFO Bruce Beckman, with options for investors to listen via phone or a live webcast. Malibu Boats is a leading manufacturer of recreational powerboats, known for its innovative designs and diverse product range.",
  "argos_id": "SZ6M7DIEE"
}