{
  "url": "https://www.cnet.com/tech/mobile/the-iphone-17-will-be-here-soon-but-when-possible-release-dates-coming-into-focus/",
  "authorsByline": "Tiffany Connors, Jeff Carlson",
  "articleId": "f01e29ca401f4169b472c0879ed05dc3",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/3d29eeeaa3e0fadf8999b85a5807fbc3959a8abe/hub/2025/06/18/efcc498a-d738-4252-b330-8f11c36cce90/iphone-17-rumors-vt-v04-00000.png?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:06:05+00:00",
  "addDate": "2025-08-14T19:08:52.021572+00:00",
  "refreshDate": "2025-08-14T19:08:52.021575+00:00",
  "score": 1.0,
  "title": "iPhone 17 Release Date: Announcement, Pre-order, Launch Day Timing",
  "description": "We're likely less than a month away from when new iPhones will be announced, so what does that mean for getting them into people's hands?",
  "content": "If you're looking at your current iPhone and pondering whether to upgrade to a new model, now is a fraught time. Do you stick with it for another year? Or do the rumors include features you're itching to try? But most important is the question: When will iPhone 17 models be released?\n\nOnce the rumored iPhone 17, iPhone 17 Air, Pro and Pro Max are revealed, we'll be able to confirm speculation about colors, display, cameras and more. We'll also learn how much the new iPhone will cost, which is also still up in the air, thanks in part to looming tariffs.\n\nBased on previous releases, the new iPhone will be announced in September, but the exact dates for the announcement, preorder and release are still the subject of speculation.\n\nA representative for Apple did not immediately respond to a request for comment.\n\nDon't miss any of CNET's unbiased tech content and lab-based reviews. Add us as a preferred Google source on Chrome.\n\nOne recent leak points to Apple holding the iPhone 17 event on Sept. 9. German site iPhone-Ticker claims that it gained access to internal documents from a local carrier, and even though the sourcing cannot be confirmed, that release date lines up with existing rumors and expert opinion.\n\nWe've sifted through the whispers, analysis and guesses so you can make a date to get your hands on the new iPhone.\n\nRead more: Should You Buy an iPhone 16 or Wait for the iPhone 17?\n\nWhen will the iPhone 17 be released?\n\nFor nearly a decade, Apple has announced its new iPhone lineup in early September. The only exception was in 2020 during the COVID-19 pandemic when the release was pushed back to Oct. 23 for the iPhone 12 and 12 Pro, and Nov. 13 for the iPhone 12 Mini and 12 Pro Max.\n\nIn his Power On newsletter on July 13, Bloomberg's Mark Gurman said that the announcement should come on Sept. 9 or 10.\n\nThe supposed leak reported on by iPhone-Ticker lines up with expert opinion, so you might want to mark your calendar for Sept. 9 if you want to catch the new iPhone event.\n\nWe cannot verify these dates because we don't have access to the internal documents iPhone-Ticker is sourcing. But if these leaks are true, they suggest that preorders for the iPhone 17 will begin on Sept. 12, with a Sept. 19 release.\n\nHere's a chart for the release dates of previous iPhone models:\n\n\n\nHere's a chart for the potential dates based on past schedules. These are not official dates from Apple:\n\nWill all of the new iPhones be released in the fall?\n\nBased on last year's release, Apple may release everything in the fall except its least expensive option -- this year, the iPhone 16E. The iPhone 16E was released in February, and Apple is widely expected to follow the same format for the rumored iPhone 17.\n\nThat would mean the iPhone 17 Pro Max, iPhone 17 Pro, iPhone 17 Air and the iPhone 17 base model -- if that's the lineup -- would be released in September. The iPhone 17E -- if it exists -- would be released in February.\n\nApple is expected to change its release format with the rumored iPhone 18. Reports suggest that Apple will only release higher-end models in fall 2026 -- iPhone 18 Pro, Pro Max, Air and a rumored new foldable iPhone -- and release the rest of the line in winter 2027.\n\nBy pushing its top-of-the-line Pro and Pro Max models in September, Apple can capture much of the holiday shopping season. Releasing the more basic models in the winter allows a second crest of excitement, but diehard fans and holiday shoppers will have already spent their money on the pricier models in the fall.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/tech/mobile/best-phone/",
    "https://www.cnet.com/tech/mobile/the-iphone-16e-announcement-here-are-the-release-date-price-features-and-specs/",
    "https://www.cnet.com/tech/as-inflation-from-trumps-tariffs-looms-large-im-watching-11-key-products-for-inflation/",
    "https://www.cnet.com/tech/mobile/the-folding-iphone-is-getting-real-and-might-use-samsung-parts/",
    "https://www.iphone-ticker.de/iphone-17-vorstellung-wohl-am-9-verkaufsstart-am-19-september-261445/",
    "https://www.cnet.com/tech/mobile/how-much-will-the-iphone-17-cost/",
    "https://www.cnet.com/tech/mobile/apple-is-moving-away-from-its-fall-only-iphone-launch-schedule-report-says/",
    "https://www.cnet.com/tech/mobile/i-want-apple-to-steal-these-android-camera-features-for-the-iphone-17/",
    "https://www.cnet.com/tech/mobile/ugh-too-bad-we-have-to-wait-2-months-for-the-iphone-17-and-this-rumored-feature/",
    "https://www.cnet.com/tech/mobile/every-iphone-17-air-rumor-what-to-know-about-a-slim-new-iphone/",
    "https://www.cnet.com/tech/mobile/iphone-17-colors-a-surprising-hue-could-be-coming-for-pro-models/",
    "https://www.google.com/preferences/source?q=cnet.com",
    "https://www.cnet.com/tech/prime-day-2025-grab-deals-now-before-tariffs-hike-prices-for-the-holidays-expert-says/",
    "https://www.cnet.com/deals/best-iphone-16e-deals/",
    "https://www.bloomberg.com/news/newsletters/2025-07-13/is-apple-going-to-replace-ceo-tim-cook-who-is-the-next-ceo-of-apple-ternus-md1mhrj4",
    "https://www.cnet.com/tech/mobile/should-you-buy-an-iphone-16-or-wait-for-the-iphone-17/",
    "https://www.cnet.com/tech/mobile/iphone-17-rumors-everything-to-know-from-a-slim-air-model-to-fresh-colors/",
    "https://www.cnet.com/tech/mobile/is-the-iphone-17-pro-going-to-be-big-and-orange-we-rounded-up-the-rumors/",
    "https://www.cnet.com/tech/mobile/i-may-upgrade-to-the-iphone-17-pro-max-if-these-6-rumors-are-true/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "previous iPhone models",
      "weight": 0.13047686
    },
    {
      "name": "iPhone",
      "weight": 0.1292285
    },
    {
      "name": "a rumored new foldable iPhone",
      "weight": 0.08189715
    },
    {
      "name": "its new iPhone lineup",
      "weight": 0.07929327
    },
    {
      "name": "the new iPhone event",
      "weight": 0.078720614
    },
    {
      "name": "Apple",
      "weight": 0.078342594
    },
    {
      "name": "previous releases",
      "weight": 0.0772267
    },
    {
      "name": "Pro Max",
      "weight": 0.07522013
    },
    {
      "name": "the new iPhone",
      "weight": 0.07520409
    },
    {
      "name": "official dates",
      "weight": 0.07476001
    }
  ],
  "topics": [
    {
      "name": "iPhone"
    },
    {
      "name": "Electronics"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.849609375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8251953125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7421875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.51220703125
    }
  ],
  "sentiment": {
    "positive": 0.13149936,
    "negative": 0.33058938,
    "neutral": 0.5379112
  },
  "summary": "Apple is rumoured to announce the iPhone 17, iPhone 17 Air, Pro and Pro Max models, but the exact release dates for these models are still uncertain due to ongoing speculation. The new iPhone will likely be announced in September, with preorders set to begin on Sept. 12, with a Sept. 19 release. However, the release date and price of the new iPhone is still uncertain, due to looming tariffs. A recent leak suggests that Apple will hold an iPhone 17 event on September 9 or 10, which aligns with existing rumors and expert opinion. All new iPhones are expected to be released in the fall, with all except the least expensive option, the iPhone 16E.",
  "shortSummary": "Apple's upcoming iPhone 17 will be announced in September, with potential release dates still uncertain, and the price still up in the air.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ee4b2c8c4b243c6b76cbe23a4c0473a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/mobile/ugh-too-bad-we-have-to-wait-2-months-for-the-iphone-17-and-this-rumored-feature/",
      "text": "Leaks about the iPhone 17 have been pouring in for more than a year. We've seen reports of a new selfie camera, faster MagSafe charging and a new purple (or green) color. We've even heard rumors that Apple might change how frequently it launches new iPhone models, from once a year to twice.\nBut when the iPhone 16 debuted, there was criticism aimed at its screen. The phone starts at $829 and still has a 60Hz display, despite most phones from competitors having high-refresh-rate screens topping off at 90Hz or 120Hz, which gives a smoother scrolling effect that just looks premium. Given that Pro models have had higher screen refresh rates for years, it's been frustrating to see Apple not bring the feature to lower-end models.\nAt a time when Apple is under pressure from a US Department of Justice antitrust lawsuit; facing criticism from shareholders and media about being \"behind in the AI race\" with Apple Intelligence; and dealing with threats from President Donald Trump about adding a tariff to the iPhone if manufacturing isn't relocated to the US, the company's next iPhone launch will be a pivotal moment.\nThe burden is on Apple to deliver an exciting iPhone 17 lineup that includes big changes to the iPhone Pro models as well as a new iPhone Air version. But the \"regular\" base iPhone is due for some TLC, especially its display. Fortunately, there are three rumors circulating that point to the iPhone 17's screen coming with a sizable update. Taken together, they suggest the screen on the iPhone 17 could be one of the largest updates to a base iPhone display in a long time.\nApple hasn't announced anything yet or confirmed any of these rumors. And we won't know what's what for certain until the next iPhone is officially released. For more leaks, check out CNET's iPhone 17 rumor roundup.\nThe iPhone 17's 6.3-inch display\nThe regular iPhone, dating back to the iPhone 12, has had a 6.1-inch screen. The iPhone 16 has one despite the iPhone 16 Pro rocking a 6.3-inch display. But the iPhone 17 will get a similar 6.3-inch display, according to a post on X from supply-chain analyst Ross Young. This is bad news for small-phone fans, though 6.1 inches was already well beyond the 5.4-inch screen found on the iPhone 12 Mini and 13 Mini.\nIf the increased screen real estate comes from shrinking the bezels around the display, like Apple did with the iPhone 16 Pro, it should mean that the iPhone 17 itself will be relatively the same size as the iPhone 16.\nThe iPhone 17's high-refresh-rate display (120Hz)\nIn 2018, the Razer Phone debuted with the first-ever high-refresh-rate display. Other phones at the time had screens locked at a static 60Hz. The Razer Phone was aimed at gamers, and having a screen with a high refresh rate made gameplay look more immersive. It also made mundane things, like system animations or scrolling a social or news feed, look smooth and dynamic.\nIn 2025, nearly every major phone, including cheap ones costing less than $300, has a 90Hz or 120Hz screen -- well, except the iPhone. Apple first added Pro Motion displays (its name for a high-refresh-rate screen) in 2021, to the iPhone 13 Pro and 13 Pro Max. But non-Pro models still have a static 60Hz display to this day. That should change soon.\nThe iPhone 17 will have a high-refresh-rate screen, according to a report from 9to5Mac. The story cites an X post from Young that's since been taken down. It's unclear if the screen will be identical to the one on the iPhone 16 Pro or if it'll be something different. But if the iPhone 17 gets an LTPO screen with an adaptive refresh rate (with 1 to 120Hz), that could also mean the \"regular\" base iPhone 17 will get support for an always-on display. That latter feature debuted on the iPhone 14 Pro and Pro Max, and is absent from the base iPhone 15 and iPhone 16.\nThe iPhone 17's new Ceramic Shield\nOne of the sleeper additions on the iPhone 16 Pro was that it got an updated Ceramic Shield (the 16 and 16 Plus didn't). Just as a reminder, Ceramic Shield isn't just glass in that it's composed of nano ceramic crystals embedded in a glass matrix. In my long-term review for the 16 Pro, I found that the updated Ceramic Shield was nearly unscathed after seven months of use, especially compared with my iPhone 15 Pro Max, which had the original version of Ceramic Shield and was covered in scratches after the same amount of time.\nThe iPhone 17 could get a more scratch resistant display, according to a post from Weibo user Instant Digital. It sounds like this might be different from Ceramic Shield in that it could also have an antireflective coating, similar to the one on the Galaxy S25 Ultra. MacRumors first reported on the rumor and also hedged it, saying the new coating may've been scrapped because it proved too complicated to apply at scale.\nI doubt the iPhone 17 will get an antireflective screen, but I'd love if it did. I can still hope, though, that its screen comes with a more durable display."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/how-much-will-the-iphone-17-cost/",
      "text": "With President Donald Trump threatening a higher 25% tariff rate for items produced in South Korea and Japan -- two major US tech suppliers -- you might be wondering if the rumored iPhone 17 or other Apple devices like MacBooks or AirPods will cost more soon.\nThe answer is... maybe. But tariffs aren't the only culprit.\nAfter Apple's initial attempts to avoid the tariffs on iPhones, which have been primarily produced in China, Trump threatened Apple and other manufacturers with a 25% tariff for all smartphones produced outside the US. But he's also delayed his self-imposed deadline for \"reciprocal tariffs,\" which could mean more time to make deals and lower tariffs before the new iPhone is introduced. However, there's still plenty about tariffs up in the air.\nIf a new iPhone does get hit with a tariff, you should expect Apple -- and other phone manufacturers -- to pass along most of that cost to you, say experts.\n\"The president's tariff would really basically just be a sales tax that would be tacked on to the cost of a new smartphone,\" said Timothy Meyer, Richard Allen/Cravath distinguished professor in international business law, Duke University School of Law. \"And the companies will probably be able to pass through most of that cost to consumers.\"\nBut even if tariffs don't affect the price, there are other reasons you'll likely pay more for the new iPhone, including the health of the US economy and the fact that a new iPhone is due for a price hike. If rumors about the iPhone 17 Air and the rest of the lineup are true, Apple could potentially say that additional features justify a higher price.\nApple did not respond to a request for comment for an earlier version of this story.\nYou likely won't find out the exact price until the new iPhone's likely September release date, but we're following all the latest leaks, rumors and speculation until then.\nRead more: Want to Buy a New iPhone? Here's Why You Should Wait\nHow tariffs could affect the cost of the rumored iPhone 17\nThere are a few tariffs that could raise iPhone prices -- tariffs on imports from other countries (a 55% tariff on imports from China and a potential 26% hike on those from India) and the 25% tariff on imported smartphones that Trump announced in May.\nIf your iPhone is made in China, that doesn't mean it will cost 80% more, though (55% plus 25%). Trump's 55% tariff on China includes a 25% tariff that has been in place since his first administration. That tax is already baked into the iPhone's price. So you'd be looking at up to a 30% increase to buy a phone imported from China. If 25% smartphone tariffs are enacted, then it could bring the price up by a total of 55%. If your phone is made in India, you could see a 26% increase in the iPhone price if a trade deal isn't reached and a 51% increase if smartphone tariffs are enacted.\nUsing the iPhone 16 as a reference, this means a base iPhone 17 model subject to import tariffs on China or India could start at just over $1,000 without a smartphone tariff, and could go up to more than $2,400 for a high-end Pro Max with a broad smartphone tariff.\nHowever, a broad iPhone tariff is unlikely to happen, according to many experts. \"My prediction would be that it's unlikely that we ever see a global smartphone tariff,\" Meyer said.\nMeyer explained that a product-specific tariff is less likely to stand up in court if Trump tries to justify it under the International Emergency Economic Powers Act.\nMost experts say moving iPhone production to the US is an unrealistic demand anyway, especially in the short term, because of higher labor and production costs in the US. Estimates have suggested that a US-made iPhone would cost as much as $3,500. The Trump phone, announced in June, originally boasted being made in the USA but has since dropped that language from its website.\nAnd where the new phones are assembled is only part of the tariff equation. Apple sources components for the iPhone from dozens of other countries, which could also potentially affect the price.\nRead more: Are Tariffs Hiking Prices Yet? What I've Seen Watching 11 Key Products for Changes\nHere's how much the iPhone 17 could cost\nBased on what tariffs could look like in the fall, here's how much you could pay for the next iPhone based on current iPhone 16 prices. These are our estimates and not official pricing from Apple:\nPotential iPhone price with tariffs\n| Current price | With India's 26% tariff | India tariff + 25% smartphone tariff | With China's 30% tariff | China tariff + 25% smartphone tariff | |\n|---|---|---|---|---|---|\n| iPhone 16 (128GB) | $829 | $1,045 | $1,252 | $1,078 | $1,285 |\n| iPhone 16 Plus (128GB) | $929 | $1,171 | $1,403 | $1,208 | $1,440 |\n| iPhone 16 Pro (128GB) | $999 | $1,259 | $1,508 | $1,299 | $1,548 |\n| iPhone 16 Pro Max (256GB) | $1,199 | $1,511 | $1,810 | $1,559 | $1,858 |\n| iPhone 16 Pro Max (1TB) | $1,599 | $2,015 | $2,414 | $2,079 | $2,478 |\nWhat else could cause the new iPhone's price to increase?\nTrump immediately criticized retailers like Amazon and Walmart when they suggested that tariffs could result in higher prices, so it stands to reason that Apple won't directly blame tariffs for potential price hikes that could provoke a Trump tirade.\nRather, Apple could attribute the price increase to new features and design costs. Regardless of tariffs, Apple has plans to raise iPhone prices this year, The Wall Street Journal reported.\nMy colleague Patrick Holland, who's been reviewing phones for CNET since 2016, says the new iPhone is due for a price hike anyway. It's been five years since the basic iPhone model increased in price, and each iteration generally improves on features from the previous version.\nAmong the rumored iPhone 17 Pro features is improved battery life and increased RAM, which Apple could use to justify a price increase. In a post on X, Majin Bu showed a video of what looks like a thicker iPhone 17 Pro model, likely based on rumored dimensions:\nHolland notes that the base iPhone model hasn't increased in price since 2020. His research points to the standard iPhone model's price increasing approximately every five years, between $50 and $130. Based on this evidence and the iPhone 16's current price of $829, we could expect the new phones to cost between $879 and $959.\nWhat will the iPhone 17 Air cost?\nEarly rumors had the iPhone 17 Air topping the iPhone Pro in price. However, a March Bloomberg report suggested the new phone could cost about $900, similar to the current iPhone 16 Plus's price tag. Those estimates are based on the current costs and may not include the potential impact tariffs could have on an ultrathin iPhone's price.\nIn a post to X on June 23, Majin Bu showed Air dummy model in a color described as Pro Black:\nHow the economy could affect iPhone prices\nUncertainty in the US economy -- in part because of the aforementioned tariff turmoil -- has left many wary about what's to come.\nConcerns about the risks of higher unemployment and higher inflation have left the Federal Reserve in a wait-and-see mode for lowering interest rates. Higher interest rates can cause companies like Apple to pull back on spending and investment. Combined with higher tariffs, that pullback could lead to global supply chain disruptions. Fewer iPhones available in the market could lead to higher prices.\nIf inflation resurges, rising costs could force Apple to increase the next iPhone's price.\nOne tiny bright side, in theory, is that a weakening economy could force Apple to hold off on raising prices so it can stay competitive. But that may not offer much consolation if you're worried about spending money because of a potential recession.\nWill older iPhones cost more too?\nOne way to save on Apple products is to buy last year's model instead of the newest release. However, if the new iPhone is dramatically more expensive without enough new features to justify the hike, demand could increase for the older models. That could lead to price hikes on older models too.\nThe flip side of this is that if the new iPhone's prices rise and you have an older iPhone, your old iPhone would also likely increase in value, Holland said.\nTrading or selling a used iPhone can help offset the cost if you do decide to buy the new iPhone.\nOther ways Apple could raise prices\nEven if Apple decides to keep the price of the next iPhone steady, the tech giant can recoup increased costs in other ways.\nApple could potentially offset the impact of tariffs by raising the price of its services, including its music, news and data plans, according to supply chain expert Joe Hudicka.\n\"We'll see those markups in the subscription services first because they'll appear smaller,\" he said. \"Consumers will still pay, just not all at once.\"\nShould we believe rumors and speculation about iPhone prices?\nSo seriously, how much is a new iPhone going to cost? The truth is, we can't say with any certainty what the final numbers will be. Our assessments are based on ever-changing tariff policies, past pricing trends, rumors and leaks that are sometimes based on insider knowledge. But until Apple releases the rumored iPhone 17, we can only offer our best estimates for the final price tag."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/every-iphone-17-air-rumor-what-to-know-about-a-slim-new-iphone/",
      "text": "Key takeaways\n- The iPhone \"Air\" will reportedly replace the iPhone Plus model. It could measure 5.5mm thick and have a 6.6-inch display.\n- iOS 26's Adaptive Power feature could help mitigate battery compromises with a skinnier iPhone.\n- The iPhone 17 Air could cost $900, but may be impacted by tariffs.\n- It could come in four color options, including a buzzed-about sky blue hue.\nAs September approaches, we're getting closer to learning whether Apple will unveil a super-thin iPhone with the rest of its upcoming lineup.\nApple hasn't confirmed any details about the iPhone 17, but that hasn't stopped the rumor mill from churning -- especially as it relates to this supposedly thin new model, which has been dubbed the \"iPhone 17 Air\" in the meantime. It could serve as a successor to the iPhone 16 Plus, with a 6.6-inch display, making it smaller than the iPhone 16 Pro Max but bigger than the baseline and Pro models. It could also include higher RAM, new colors and a battery boost -- thanks in part to iOS 26's Adaptive Power feature.\nApple's ultra-thin phone could be the latest to join a slew of skinny phones, including the Samsung Galaxy S25 Edge. But in its effort to slim down the device, Apple would likely need to make hardware trade-offs, which might include a single rear camera. Plus, there's the possibility of a high price tag, which could also be impacted by tariffs.\nThe wait is almost over, but for now, we're rounding up all the latest rumors, leaks and speculation about the new iPhone. Let's dig in.\nRead more: Should You Buy an iPhone 16 or Wait for the iPhone 17?\niPhone 17 Air size: How thin will it be?\nIf the rumored iPhone 17 Air lives up to its name, then the biggest potential advantage it could offer over the rest of the lineup is its size and weight. A Bloomberg report from March notes that the iPhone Air could measure 5.5mm thick, compared to the iPhone 16 Pro at 8.25mm. The iPhone 17 Pro Max could get as thick as 8.725mm to make room for a bigger battery, according to a report by 9to5Mac.\nMatt Talks Tech posted a YouTube video on July 19 comparing the thickness of an iPhone 17 Air model with an iPhone 6, the last thinnest iPhone:\nMac Rumors reported in May that a leaker on the Korean-language Naver blog, going by yeux1122, said that the rumored iPhone 17 Air weighs approximately 145 grams (5.11 ounces). Compare that with the iPhone 16 Pro, which weighs 199 grams (7.03 ounces). If this rumor proves true, the Air would be just slightly heavier than the iPhone 13 mini, which weighs 141 grams (4.97 ounces).\niPhone 17 Air camera: Potential downgrade?\nTo slim down the iPhone, Apple may have to make some camera compromises.\nIn July, analyst Ming-Chi Kuo reiterated the long-standing rumor that the iPhone 17 Air will only feature one rear camera for wide-angle shots. That would place it in the same camp as the $599 iPhone 16E, which has a single rear camera with a 48-megapixel sensor -- though it's not clear if the iPhone 17 Air will have the same sensor. Bloomberg also noted earlier this year that the rumored Air may not have the ultrawide and 5x telephoto lenses that have become staples of Apple's premium iPhones.\nIn a bit of good news, it's also rumored that the front-facing \"selfie\" camera on all iPhone 17 models, including the Air, will be upgraded to 24 megapixels, according to analyst Jeff Pu.\nIn February, Front Page Tech shared a re-created render of the iPhone 17 Air, which supposedly includes a glimpse of the camera, in this video on YouTube:\nDisplay: Smaller than a Plus, bigger than a Pro?\nRumor has it that the Air will have a 6.6-inch display, according to analysts Pu and Kuo, who also said the display resolution would be around 1260x2740 pixels. That aligns with the wallpaper resolution Macworld found in the second iOS 26 developer beta -- a resolution that no existing iPhone currently has.\nIf rumors are accurate, the iPhone 17 Air's display will be slightly smaller than the iPhone 16 Plus, which has a 6.7-inch display, but larger than the iPhone 16 Pro, which features a 6.3-inch display. The iPhone 16 Pro Max leads with a 6.9-inch display. It's unclear if the iPhone 17 Air's screen would be a Pro Motion display like the one found on iPhone Pro models.\nPerformance: Could an Air get the A19 Pro chip?\nThe iPhone 17 Air could benefit from some performance boosts.\nBloomberg reported back in March that the rumored phone will have a standard A19 chip, instead of the A19 Pro landing on the Pro versions. Kuo shared the same prediction as recently as July 24.\nBut a Weibo account known as Fixed Focus Digital said the iPhone 17 Air will come with an A19 Pro chip, MacRumors reported on July 9. But the Air would have a 5-core GPU, according to the rumor, whereas the iPhone 17 Pro and Pro Max would get a 6-core GPU.\nApple is also reportedly bringing more design in-house to improve connectivity across all devices. In February, Kuo said Apple will swap out Broadcom's Wi-Fi chips for in-house chips across the iPhone 17 lineup.\niPhone 17 Air battery life expectations\nOne of the key challenges of slimming down a phone is figuring out how to not compromise battery life.\nInitially, it was assumed that a skinnier iPhone would simply have reduced battery life, since there would be less space to house a battery. But more recently, AppleInsider reported that a skinnier iPhone might use a silicon-anode battery to help extend battery life.\nLeaker Yeux1122 said the iPhone 17 Air's battery capacity is 2,800mAh, based on details from a \"mass production confirmed sample,\" according to MacRumors. The leaker adds that a high-density battery in the Air could increase its \"actual capacity\" by 15% to 20%. Kuo also noted back in March that the phone could have that \"high-density\" battery.\nIf the rumored iPhone 17 Air does use the silicon battery technology, it would be the first iPhone to do so.\nOne feature that could help avoid battery drain is Adaptive Power in iOS 26. This can help conserve battery by automatically adjusting your iPhone's performance based on how you're using the it at that moment, according to Apple.\nAnd while the appeal of a skinnier iPhone may be its sleekness, Apple could still release a battery case as an iPhone 17 Air accessory, according to a May report from Wayne Ma with The Information.\nMemory upgrade\nIn April, Kuo noted the iPhone 17 Air will sport 12GB of RAM, just like the upcoming Pro models. (The baseline iPhone 17 is expected to stay at 8GB, according to both Kuo and Pu.) Tipster Digital Chat Station noted that the boost is largely thanks to the \"large scale\" use of Apple Intelligence and AI on the devices.\nColors for the iPhone 17 Air\nCurrent rumors suggest the iPhone 17 Air come come in these shades:\n- Black\n- Blue gray\n- Light gold\n- Silver\nOn Aug. 3, Majin Bu posted photos on X of the predicted color lineup across the iPhone 17 series:\nDynamic Island: Front camera could move\nBloomberg's report also notes that the iPhone 17 Air is expected to have superslim bezels compared to the rest of the line, along with a Camera Control button and a Dynamic Island cutout in the display.\nPu predicted in May that all the iPhone 17 models will use a new metalens technology for the proximity sensor, according to 9to5Mac. That technology could allow Apple to reduce the size of the Face ID sensor and its Dynamic Island. However, Pu's report contradicts Kuo, who previously said that the Dynamic Island would remain \"largely unchanged\" in the iPhone 17 lineup compared to the iPhone 16.\nIn a post to X on June 26, Bu said the front camera might be placed on the left of the Dynamic Island, based on leaked screen protector designs. Other iPhone 17 models appear to retain the camera on the right side:\nAir or Slim? What we know about the name\nThe title for the rumored skinny iPhone is still unclear -- in fact, we still don't know if Apple's new lineup will even be called the iPhone 17, as it's been known to switch up its naming conventions. (Take, for example, its decision to follow iOS 18 with iOS 26, instead of the expected moniker iOS 19, to coincide with the upcoming year.)\nWe likely won't find out the phone's official name until Apple announces its new iPhone lineup. But most rumors and leaks -- including this video Bu shared of a dummy model on X on July 9 -- refer to the skinnier iPhone as \"Air\":\niPhone 17 Air release date: Is the slimmer iPhone coming this year?\nFor nearly a decade, Apple has held an event on the first Tuesday of September after Labor Day to announce its new phones. We expect Apple to follow a similar schedule this year for the release of its iPhone 17 line, including the rumored iPhone 17 Air.\nHowever, the first Tuesday is the day after Labor Day in 2025, so Apple may push the dates for its iPhone event to Wednesday, Sept. 3, or Tuesday, Sept. 9. That would mean a release date of Sept. 12 or 19. Most rumors point to Sept. 9 as the expected date for Apple's iPhone reveal event.\nThe iPhone 17 lineup may be the last to follow this fall-release model, according to Kuo and a report from The Information. Starting with the iPhone 18, Apple will reportedly split its phone releases so that lower-cost iPhones launch in the first half of the year (previously reserved for iPhone SE models) and higher-end Pro models are announced in the latter half. That would likely mean a rumored iPhone 18 Pro, Pro Max, Air and new foldable iPhone model could debut in fall 2026. Keep in mind that an iPhone Flip or Fold has been rumored for years.\nYou'll likely be able to preorder a new iPhone the Friday after the announcement, with the phone shipping a week later. Based on the expected announcement on Sept. 3 or 9, the preorder date could be either Sept. 5 or 12, respectively.\nSee also: The iPhone 17 Air Could Hint at Apple's Foldable Future\nWhat will the iPhone 17 Air cost?\nEarly rumors about the iPhone 17 Air's price tag hinted it could cost even more than the iPhone 17 Pro. But a Bloomberg report from March suggested the phone could cost about $900. That price tag would align with the rumor that the Air could replace the Plus, which currently costs $929. For comparison, Samsung's Galaxy S25 Edge starts at $1,100.\nHowever, there's also the question of how tariffs could affect the price of an iPhone. Amid President Donald Trump's ongoing tariff drama, he's threatened Apple with a 25% tariff if the company doesn't move iPhone manufacturing to the US.\nHow much all of this could affect iPhone prices is yet to be determined, but an extra 25% could push an iPhone 17 Air to more than $1,100. That's based on the price of an iPhone 16 Plus, which the iPhone 17 Air is rumored to be replacing. None of the pricing rumors has been confirmed by Apple.\nRegardless of how tariffs play out, Apple is expected to raise the price of the iPhone. These price hikes are rumored to start with the iPhone 17 line, so prepare now to pay more for Air.\nAre iPhone Air rumors and leaks to be trusted?\nRumors are just that. The speculation leading up to the iPhone's release is often based on insider knowledge or leaked information from the teams working on the iPhone's design, but those plans can evolve and are not necessarily reflected in the final product. We'll only be able to confirm these rumors with certainty when Apple officially releases the next iPhone."
    },
    {
      "url": "https://www.cnet.com/tech/as-inflation-from-trumps-tariffs-looms-large-im-watching-11-key-products-for-inflation/",
      "text": "The question of how new tariffs will affect prices is more relevant than ever, with President Donald Trump's new reciprocal tariff deadline only days away and a new Consumer Price Index summary showing that the inflation rate was 2.7% in June, the biggest jump since February. It's enough to get anyone concerned about affordability in the US -- as if we all weren't worrying about it already -- and the worst of it still might not have arrived yet.\nAmid those worries, I've been tracking prices every day for 11 key products likely to be hit by price increases from tariffs and the picture I've painted so far is this: Not much has changed, at least not yet. The winding road of tariff inflation still stretches before us into an uncertain future and the threat of price hikes continues to cloud the horizon. As some economists recently told Vox, the upward trend in inflation is almost certain to continue if Trump's tariffs remain at the levels being discussed.\nTo date, I've seen two noteworthy price increases, one for the Xbox Series X and the other for a popular budget-friendly 4K TV. Some other products have gone on sale for brief periods. Notably, other outlets have caught a number of major retailers hiking prices across the board, with CNBC finding some substantial inflation at Walmart specifically.\nCNET Tariff Tracker Index\nAbove, you can check out a chart with the average price of the 11 products included in this piece over the course of 2025. This will help give you a sense of the overall price changes and fluctuations going on. Further down, you'll be able to check out charts for each individual product being tracked. Based on the numbers so far, the average has gone up noticeably since the start of the year but this has been driven mostly by big shifts for a few products, as most price are still stable.\nWe'll be updating this article regularly as prices change. It's all in the name of helping you make sense of things so be sure to check back every so often. For more, check out CNET's guide to whether you should wait to make big purchases or buy them now and get expert tips about how to prepare for a recession.\nMethodology\nWe're checking prices daily and will update the article and the relevant charts right away to reflect any changes. The following charts show a single bullet point for each month, with the most recent one labeled \"Now\" and showing the current price. For the past months, we've gone with what was the most common price for each item in the given month.\nIn most cases, the price stats used in these graphs were pulled from Amazon using the historical price-tracker tool Keepa. For the iPhones, the prices come from Apple's official materials and are based on the 128-gigabyte base model of the latest offering of the iPhone 16. For the Xbox Series X, the prices were sourced from Best Buy using the tool PriceTracker. If any of these products happen to be on sale at a given time, we'll be sure to let you know and explain how those price drops differ from longer-term pricing trends that tariffs can cause.\nThe 11 products we're tracking\nMostly what we're tracking in this article are electronic devices and digital items that CNET covers in depth, like iPhones and affordable 4K TVs -- along with a typical bag of coffee, a more humble product that isn't produced in the US to any significant degree.\nThe products featured were chosen for a few reasons: Some of them are popular and/or affordable representatives for major consumer tech categories, like smartphones, TVs and game consoles. Others are meant to represent things that consumers might buy more frequently, like printer ink or coffee beans. Some products were chosen over others because they are likely more susceptible to tariffs. Some of these products have been reviewed by CNET or have been featured in some of our best lists.\n- iPhone 16, 128GB\n- Duracell AA batteries, 24-pack\n- Samsung DU7200 65-inch TV\n- Xbox Series X\n- Apple AirPods Pro 2 with USB-C case\n- HP 962 CMY Printer Ink\n- Anker 10,000-mAh, 30-watt power bank\n- Bose TV speaker\n- Oral-B Pro 1000 electric toothbrush\n- Lenovo IdeaPad Flex 5i Chromebook, 256GB\n- Starbucks 28-ounce ground dark roast coffee\nBelow, we'll get into more about each individual product, and stick around till the end for a rundown of some other products worth noting.\niPhone 16\nThe iPhone is the most popular smartphone brand in the US, so this was a clear priority for price tracking. The iPhone has also emerged as a major focal point for conversations about tariffs, given its popularity and its susceptibility to import taxes because of its overseas production, largely in China. Trump has reportedly been fixated on the idea that the iPhone can and should be manufactured in the US, an idea that experts have dismissed as a fantasy. Estimates have also suggested that a US-made iPhone would cost as much as $3,500.\nSomething to note about this graph: The price listed is the one you'll see if you buy your phone through a major carrier. If you, say, buy direct from Apple or Best Buy without a carrier involved, you'll be charged an extra $30, so in some places, you might see the list price of the standard iPhone 16 listed as $830.\nApple's been taking a few steps to protect its prices in the face of these tariffs, flying in bulk shipments of product before they took effect and planning to move production for the US market from China to India. A new Reuters report found that a staggering 97% of iPhones imported from the latter country, March through May, were bound for the US. This latter move drew the anger of Trump again, threatening the company with a 25% tariff if they didn't move production to the US, an idea CEO Tim Cook has repeatedly shot down in the past. This came after Trump gave a tariff exemption to electronic devices including smartphones, so the future of that move seems in doubt now.\nDuracell AA batteries\nA lot of the tech products in your home might boast a rechargeable energy source but individual batteries are still an everyday essential and I can tell you from experience that as soon as you forget about them, you'll be needing to restock. The Duracell AAs we're tracking are some of the bestselling batteries on Amazon.\nSamsung DU7200 TV\nAlongside smartphones, televisions are some of the most popular tech products out there, even if they're an infrequent purchase. This particular product is a popular entry-level 4K TV and was CNET's pick for best overall budget TV for 2025. Unlike a lot of tech products that have key supply lines in China, Samsung is a South Korean company, so it might have some measure of tariff resistance.\nAfter spending most of 2025 hovering around $400, this item has now seen some notable upticks on Amazon, most recently sitting around $450, a change that has stuck around long enough to seem permanent. This could potentially be in reaction to Trump's announcement of 25% tariffs against South Korea.\nXbox Series X\nVideo game software and hardware are a market segment expected to be hit hard by the Trump tariffs. Microsoft's Xbox is the first console brand to see price hikes -- the company cited \"market conditions\" along with the rising cost of development. Most notably, this included an increase in the price of the flagship Xbox Series X, up from $500 to $600. Numerous Xbox accessories also were affected and the company also said that \"certain\" games will eventually see a price hike from $70 to $80.\nInitially, we were tracking the price of the much more popular Nintendo Switch as a representative of the gaming market. Nintendo has not yet hiked the price of its handheld-console hybrid and stressed that the $450 price tag of the upcoming Switch 2 has not yet been inflated because of tariffs. Sony, meanwhile, has so far only increased prices on its PlayStation hardware in markets outside the US.\nAirPods Pro 2\nThe latest iteration of Apple's wildly popular true-wireless earbuds are here to represent the headphone market. Much to the chagrin of the audiophiles out there, a quick look at sales charts on Amazon shows you just how much the brand dominates all headphone sales.\nHP 962 CMY printer ink\nThis HP printer ink includes cyan, magenta and yellow all in one product and recently saw its price jump from around $72 -- where it stayed for most of 2025 -- to $80, which is around its highest price over the last five years. We will be keeping tabs to see if this is a long-term change or a brief uptick.\nThis product replaced Overture PLA Filament for 3D printers in this piece, but we're still tracking that item.\nAnker 10,000-mAh, 30-watt power bank\nAnker's accessories are perennially popular in the tech space and the company has already announced that some of its products will get more expensive as a direct result of tariffs. This specific product has also been featured in some of CNET's lists of the best portable chargers.\nBose TV speaker\nSoundbars have become important purchases, given the often iffy quality of the speakers built into TVs. While not the biggest or the best offering in the space, the Bose TV Speaker is one of the more affordable soundbar options out there, especially hailing from a brand as popular as Bose.\nOral-B Pro 1000 electric toothbrush\nThey might be a lot more expensive than their traditional counterparts but electric toothbrushes remain a popular choice for consumers because of how well they get the job done. I know my dentist won't let up on how much I need one. This particular Oral-B offering was CNET's overall choice for the best electric toothbrush for 2025.\nLenovo IdeaPad Flex 5i Chromebook\nLenovo is notable among the big laptop manufacturers for being a Chinese company making its products especially susceptible to Trump's tariffs. For now, its price on Amazon has remained pretty much static, aside from some brief dips down to $480.\nStarbucks Ground Coffee (28-ounce bag)\nCoffee is included in this tracker because of its ubiquity -- I'm certainly drinking too much of it these days -- and because it's uniquely susceptible to Trump's tariff agenda. Famously, coffee beans can only be grown within a certain distance from Earth's equator, a tropical span largely outside the US and known as the \"Coffee Belt.\"\nHawaii is the only part of the US that can produce coffee beans, with data from USAFacts showing that 11.5 million pounds were harvested there in the 2022-23 season -- little more than a drop in the mug, as the US consumed 282 times that amount of coffee during that period. Making matters worse, Hawaiian coffee production has declined in the past few years.\nAll that to say: Americans get almost all of their coffee from overseas, making it one of the most likely products to see price hikes from tariffs. While this particular bag of beans from Starbucks hasn't seen its price budge for most of the year, in recent days it ticked up by less than a dollar on Amazon, which could be a sign of further increases to come.\nOther products\nAs mentioned, we occasionally swap out products with different ones that undergo notable price shifts. Here are some things no longer featured above, but that we're still keeping an eye on:\n- Nintendo Switch: The baseline handheld-console hybrid has held steady around $299 most places -- including Amazon -- since it released in 2017. Whether that price will be affected by tariffs or the release of the Switch 2 remains to be seen. This product was replaced above with the Xbox Series X.\n- Overture PLA 3D printer filament: This is a popular choice on Amazon for the material needed to run 3D printers. It has held steady around $15 on Amazon all year. This product was replaced above by the HP 962 printer ink.\nHere are some products we also wanted to single out that haven't been featured with a graph yet:\n- Razer Blade 18 (2025), 5070 Ti edition: The latest revision of Razer's largest gaming laptop saw a $300 price bump recently, with the base model featured an RTX 5070 Ti graphics card now priced at $3,500 ahead of launch, compared to the $3,200 price announced in February. While Razer has stayed mum about the reasoning, it did previously suspend direct sales to the US as Trump's tariff plans were ramping up in April.\n- Asus ROG Ally X: The premium version of Asus's Steam Deck competitor handheld gaming PC recently saw a price hike from $799 to $899, coinciding with the announcement of the company's upcoming Xbox-branded Ally handhelds."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/i-may-upgrade-to-the-iphone-17-pro-max-if-these-6-rumors-are-true/",
      "text": "Because photography is important to me, I've always picked the iPhone Pro with its telephoto camera over the regular iPhone models. But each year I'm pulled in two directions: Pick the standard-size iPhone Pro or the larger iPhone Pro Max? Some years the latter includes photo features not found on the regular iPhone Pro, such as the 5x zoom that was exclusive to the iPhone 15 Pro Max. And as we approach the reveal of the next iPhone 17 lineup, I'm once again waffling between sizes. And based on I'm hearing, this might be the year to go to the Max. (And this also reinforces that now is not the time to buy a new iPhone.)\nHere's a rundown of some of the features rumored for the iPhone 17 Pro Max that I'm most curious about.\nMaking the case to go larger\nThe iPhone Pro Max models are tanks compared with the rest of the line -- well, they're not on the toughness level of the Samsung Galaxy XCover 7 Pro, so maybe they're more like solid midsize SUVs. But they're notable for their larger screens, bigger bodies and especially for having room for more of everything in an iPhone.\nAnd that includes a larger battery. The Max models already have more battery space than other models, but the iPhone 17 Pro Max could end up being almost half a millimeter thicker, at 8.725mm, according to a May post by 9to5Mac. Has anyone ever asked for a more bulky iPhone? Actually, yes, yes and yes.\nAdd the new Adaptive Power feature in iOS 26, which uses AI to distribute power more efficiently when demand is high, and we could see a boost in daily use before reaching for a charger. (Then again, Adaptive Power could be a software workaround that could mean longer life using the same physical battery size.)\nIf you're already committed to carrying a larger iPhone, a tad more thickness and heft isn't too much more to shoulder.\nThe back of the iPhone 17 Pro case is also rumored to shift the Apple logo down from its current perch. That doesn't seem like a big functional change, but it should help soothe folks who choose to add a clear MagSafe case, since the logo will be centered within the MagSafe area. You can't say Apple doesn't sweat the design details.\nA leak on X from Majin Bu purports to show an iPhone 17 Pro case, though it's not clear whether that's something assembled by hand to match rumored specs or is some iPhone knockoff.\nBring on all the camera upgrades\nWe can't talk about the case without mentioning the camera bump, which could become a more expansive camera island (or maybe on the larger iPhone 17 Pro Max, it will be more like a camera continent) that stretches across the width of the iPhone back, according to CAD renders by Majin Bu. We even got a glimpse of a possible test iPhone 17 Pro in the wild when someone snapped a picture of what looks to be an Apple employee using a phone with a design that matches many rumors (via Foxy Pupy on X).\nThat expanse may include an upgraded 48-megapixel telephoto camera, which feels overdue for a top-tier camera system. Granted, it will probably take extra steps to capture photos in the full 48-megapixel resolution, as is the case with the current main Fusion camera in the iPhone 16 Pro models, where images are \"pixel-binned\" with multiple pixels grouped together to enhance light gathering ability. But given the great results we've seen from the 48-megapixel camera in the current models -- the iPhone 16E leans heavily on that resolution using its sole rear-facing camera -- extending it to the telephoto camera would definitely be a win for photographers.\nSpeaking of resolution, a 24-megapixel front-facing camera is expected, up from 12 megapixels, so perhaps my selfies will look better. More likely, it's to boost the next rumored feature.\nA movable camera lens\nI'm breaking out this camera rumor separately because it would mark a huge change in the iPhone camera system. According to a post at MacRumors, the iPhone 17 Pro could have an 8x optical zoom. Not only that, it's said to be able to move, so perhaps there could be a range of zoom between 5x and 8x that is all optical (versus relying on digital zoom to crop and enlarge the image to fit the same field of view). The 5x zoom in the current iPhone 15 Pro Max, iPhone 16 and iPhone 16 Pro Max uses a \"tetraprism\" design to achieve its telephoto range while still keeping the camera bump modest.\nVideo recording makes a leap\nCameras on both sides will reportedly work together with dual video recording using the built-in Camera app, a boon for conducting interviews or making reaction videos where you want to see both sides of a conversation. Third-party apps have been able to tap into this capability for some time, but haven't been available as a default option.\nNot as important for everyday use, but interesting in terms of advancing the state of the art, the iPhone 17 Pro Max could support 8K video recording, as speculated by MacRumors after reports that 8K was tested for the iPhone 16 Pro. The iPhone is swiftly turning into a production video camera, from features such as 28 Years Later to custom cameras built from iPhone tech in the F1 movie.\nAn improved cooling system\nRecording video in 4K resolution, much less 8K, is a demanding, power-hungry task that leads to heat build up. In already warm environments, it can even overheat the iPhone and temporarily shut it down. So the prospect of a new internal cooling architecture, while being invisible to iPhone owners, has me nerding out just a little.\nAccording to Majin Bu and others, the iPhone 17 Pro models will feature a \"vapor chamber\" cooling system. As the processor heats up, a small amount of liquid in the chamber evaporates and condenses in cooler areas and is then passed back to the hot areas.\nWi-Fi 7 and fast cellular via a new Apple modem\nThis is more geeky and less obvious to everyday phone owners, but that's also kind of the point. The iPhone 16E shipped with Apple's C1 cellular modem, Apple's first homebrew cellular hardware it has been trying to build in order to wean its dependence on Qualcomm, which has provided the modem hardware in previous iPhone models.\nHowever, the C1 lacks a faster millimeter wave cellular network and doesn't support Wi-Fi 7, even though it's more conservative about power usage (and still performs well), an acceptable trade-off for the budget phone in Apple's lineup.\nBut for the iPhone 17 Pro Max, we're talking about the next professional models, and an iPhone Pro in 2025 can't ship without the latest, fastest wireless technology. It would be more realistic to see Apple stick with Qualcomm for the Pro line than include the C1 -- but I suspect a C2 is coming.\nAccording to MacRumors, the Wi-Fi 7 compatibility could be provided by a separate dedicated chip designed by Apple.\nAn orange iPhone 17 Pro Max\nYou don't have to be an ardent fan of the Netherlands national football team to appreciate the color orange. Leaker Majin Bu posted renders of the new color lineup for iPhone 17 Pro models, and one of them is gloriously ginger. Not only is this interesting because orange is orange, but because it would be a departure from Apple's recent line of cool, muted colors for the pro lineup. (There are also rumors that the iPhone lineup will include a new sky blue color, about which I have opinions.) I don't hide my iPhone in a case, so being able to show off a bold color sounds like a fun idea.\nThese aren't the only iPhone 17 Pro rumors we're tracking, but right now they're the ones that have me looking at my calendar and wishing September could arrive just a little faster."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/the-iphone-16e-announcement-here-are-the-release-date-price-features-and-specs/",
      "text": "A new iPhone in February?! Apple launched the iPhone 16E on its site Wednesday, expanding the iPhone 16 line while also bringing a much-needed overhaul to the 2022 iPhone SE with an all-new name, design, processor and Apple Intelligence features.\nThe iPhone 16E starts at $599 (£599, AU$999), which is $170 more than the previous SE's $429 starting price. By contrast, the regular iPhone 16 starts at $799. The price puts the phone towards the higher end of the affordable phone market, between rivals like the $499 Google Pixel 8A and Samsung's Galaxy S24 FE, which starts at $650.\nAt a time when phone-makers have bet their success on implementing custom artificial intelligence features into their devices faster than their rivals, Apple makes it clear that its AI isn't limited to its expensive flagship devices. Powering the iPhone 16E is Apple's A18 chip (the same one found in the iPhone 16 and 16 Plus) so it can run Apple Intelligence. This makes the new Apple phone a rarity: a sub-$600 device that can run the same AI features as its more expensive siblings.\nOtherwise, the iPhone 16E has a curious value proposition. On paper it seems like an upgrade in nearly every way to the iPhone SE. But it lacks the iPhone SE's main appeals: a low price and a small design. That's not to say that the iPhone 16E isn't worth its $600 starting price, which will no doubt be lower with carrier deals and discounts at launch. But like the old iPhone SE, you have to wonder how long will this phone be relevant for?\niPhone 16E release date\nThe iPhone 16E will be available to preorder starting Friday, Feb. 21, and will go on sale on Friday, Feb. 28. Apple announced the new phone on Wednesday, Feb. 19 and these release dates follow Apple's usual iPhone release timeline.\niPhone 16E design\nThe iPhone 16E's design seems to have been inspired in part by the iPhone 14's aluminum body. The back glass is matte, which should help keep fingerprints from accumulating. In lieu of a mute switch, there's an Action button for activating a shortcut. Since the iPhone 16E lacks a Camera Control button, you'll be able to trigger Visual Intelligence searches with the Action button. The phone has a USB-C port for charging (instead of the iPhone 14's Lightning port).\nThe iPhone 16E marks the end of Apple selling a phone with a home button, which defined the first decade of iPhone designs, dating back to the original one. The iPhone 16E also has a 6.1-inch screen, which means that Apple no longer sells a truly small iPhone option. But the screen, locked at a 60Hz refresh rate, seems like a miss by Apple when the majority of budget Android handsets sport high refresh-rate displays starting at 90Hz. Also, note that the iPhone 16E has a screen notch and lacks a Dynamic Island cutout.\nOddly the iPhone 16E doesn't come in a color: only black or white.\nThe original iPhone SE launched in 2016 and its design was based on the iPhone 5S. SE stood for \"special edition,\" though over the years some of us have referred to it as \"small edition.\" In 2020, Apple launched the second-generation iPhone SE with a design based on the iPhone 8 but with the A13 Bionic processor from the iPhone 11 series. In 2022, the third-generation iPhone SE launched. Its design was largely similar to the 2020 version but had the A15 Bionic chip from the iPhone 13 series.\nThe iPhone 16E's C1 modem and battery\nThe iPhone 16E also has something no other iPhone has: an Apple-designed 5G modem. It's called the C1 chip, and in a launch video on Apple's site, the company claims that it is the \"most power-efficient modem ever in an iPhone.\"\nThe C1 modem supports 5G, but not the fast millimeter-wave 5G found in places like stadiums. It will be interesting testing phone calls and data speeds once we get our hands on the iPhone 16E.\nApple also says that the combination of the A18 and C1 chip raises the efficiency and adds up to a longer battery life. There are two ways for a phone-maker to gain customers: lower a phone's price and lengthen its battery life. While Apple didn't give us a lower price than the SE, its battery life might be the best feature. Again, I look forward to testing the 16E.\nThe new iPhone also lacks support for MagSafe charging and accessories. No MagSafe is a bit of a bummer, since that means you can't use magnetic accessories and can only wirelessly charge the phone at a slow 7.5-watt speed. (It can charge wired at 20 watts, though.)\niPhone 16E cameras\nThe iPhone 16E sports a single rear camera with a 48-megapixel sensor. While you don't get even an ultrawide option, the main camera has a high enough resolution to do sensor cropping to offer a 2x magnification – not quite the same as having a second camera, but possibly close.\nAround the front is a 12-megapixel camera that supports Face ID and has autofocus for selfies.\niPhone 16E final thoughts for now\nIn one sense the iPhone 16E carries the mantle of the SE series and how Apple uses parts of old iPhones to create an affordable one. But that name change also represents a symbolic change from Apple having a cheap phone to Apple having an affordable iPhone 16 -- much like how Samsung has its Galaxy FE models.\nWith the name change to iPhone 16E, it will be curious to see how Apple handles upgrades. As opposed to the multiple years between iPhone SE releases, will this be a phone that Apple updates yearly? Will there be an iPhone 17E? All this remains to be seen. I am excited to test the iPhone 16E, so keep an eye out for more coverage on the phone at CNET and our review coming soon.\nApple iPhone 16E Specs vs. Apple iPhone 16, iPhone SE (2022), iPhone 15\n| Apple iPhone 16E | Apple iPhone 16 | Apple iPhone SE (2022) | Apple iPhone 15 | |\n|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED display; 2,532x1,170 pixels; 60Hz refresh rate | 6.1-inch OLED display; 2,556 x 1,179 pixels; 60Hz refresh rate | 4.7-inch LCD; 1,334 x 750 pixels; 60 Hz refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixels; 60hz refresh rate |\n| Pixel density | 460ppi | 460ppi | 326ppi | 460ppi |\n| Dimensions (inches) | 5.78 x 2.82 x 0.31 in. | 5.81 x 2.82 x 0.31 in. | 5.45 x 2.65 x 0.29 in | 2.82 x 5.81 x 0.31 in. |\n| Dimensions (millimeters) | 146.7 x 71.5 x 7.8 mm | 147.6 x 71.6 x 7.8mm | 138.4 x 67.3 x 7.3 mm | 71.6 x 147.6 x 7.8 mm |\n| Weight (grams, ounces) | 167g (5.88 oz.) | 170g (6 oz.) | 144g (5.09 oz.) | 171g (6.02 oz.) |\n| Mobile software | iOS 18 | iOS 18 | iOS 15 | iOS 17 |\n| Camera | 48-megapixel (wide) | 48-megapixel (wide), 12-megapixel (ultrawide) | 12-megapixel (wide) | 48-megapixel (wide), 12-megapixel (ultrawide) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 7-megapixel | 12-megapixel |\n| Video capture | 4K | 4K | 4K | 4K |\n| Processor | Apple A18 | Apple A18 | Apple A15 Bionic | Apple A16 Bionic |\n| RAM/storage | 128GB, 256GB, 512GB | 128GB, 256GB, 512GB | 64GB, 128GB, 256GB | 128GB, 256GB, 512GB |\n| Expandable storage | None | None | None | None |\n| Battery | Up to 26 hours video playback, 21 hours streamed video playback, 90 hours of audio playback. 20W wired charging, 7.5W Qi wireless charging | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Battery sized not disclosed (charger not included; supports wireless charging) | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | Home button | None (Face ID) |\n| Connector | USB-C | USB-C | Lightning | USB-C |\n| Headphone jack | None | None | None | None |\n| Special features | Action button, Apple C1 5G modem, Apple Intelligence, Ceramic Shield, Emergency SOS, satellite connectivity, IP68 resistance | Apple Intelligence, Action button, Camera Control button, Dynamic Island, 1 to 2,000 nits display brightness range, IP68 resistance. Colors: black, white, pink, teal, ultramarine. | 5G-enabled; supports 25W wired fast charging; Water resistant (IP67); dual-SIM capabilities (nano-SIM and e-SIM); wireless charging | Dynamic Island; 5G (mmw/Sub6); MagSafe; water resistant (IP68); wireless charging; eSIM; satellite connectivity |\n| US price starts at | $599 (128GB), $699 (256GB), $899 (512GB) | $799 (128GB), $899 (256GB), $1,099 (512GB) | $399 (64GB), $449 (128GB), $549 (256GB) | $799 (128GB), $899 (256GB), $1,099 (512GB) |\n| UK price starts at | £599 (128GB), £699 (256GB), £899 (512GB) | £799 (128GB), £899 (256GB), £1,099 (512GB) | £419 (64GB), £469 (128GB), £569 (256GB) | £799 (128GB), £899 (256GB), £1,099 (512GB) |\n| Australia price starts at | AU$999 (128GB), AU$1,199 (256GB), AU$1,549 (512GB) | AU$1,399 (128GB), AU$1,599 (256GB), AU$1,949 (512GB) | AU$749 (64GB), AU$829 (128GB), AU$999 (256GB) | AU$1,499 (128GB), AU$1,699 (256GB), AU$2,049 (512GB) |"
    },
    {
      "url": "https://www.cnet.com/tech/prime-day-2025-grab-deals-now-before-tariffs-hike-prices-for-the-holidays-expert-says/",
      "text": "You may want to get a jumpstart on holiday shopping with Amazon Prime Day, the mega retailer's summer shopping event. Exclusive to Prime members, the event doubled in size to four days this year, offering some of the best Amazon deals of the year. But one expert says the effects of current and looming tariffs could mean prices will begin rising soon.\nPresident Donald Trump's \"reciprocal tariffs\" have plenty of us feeling antsy about prices. According to a recent CNET survey, 64% of shoppers said they've bought or plan to buy a tech product soon to avoid price increases or shortages. Prime Day could be a good opportunity to scoop up deals before prices go up any further.\nExperts don't expect new higher \"reciprocal tariffs\" to suddenly raise prices during Prime Day since most imported products for the event are likely already in the US. But Trump imposed a 10% baseline tariff in April, plus additional tariffs on Chinese goods and a 50% tariff on all steel and aluminum imports. That means you'll likely see higher prices on many things soon.\n\"The general expectation is that [current tariffs] will push prices up in the second half of the year even if the additional 'reciprocal' tariffs never come into effect,\" said Timothy Meyer, Richard Allen/Cravath distinguished professor in international business law at Duke University School of Law. \"Price increases due to tariffs are very likely for the holiday season.\"\nAmazon launched Prime Day back in 2015, and savvy shoppers have eagerly anticipated this annual event ever since. Our CNET Deals team will track all the best deals throughout the event so you can score the lowest prices. This will help you navigate the sale and stay ahead of any tariff-based price rises.\nRead more: Don't Wait: Score an Instant $200 Amazon Gift Card Ahead of Prime Day With This Card\nHow could tariffs affect Prime Day deals?\nPrices on everything, including appliances, are expected to rise as a result of Trump's sweeping tariffs, and some already have. Trump announced the tariffs in April, quickly putting them on a 90-day pause but leaving a 10% baseline tax on all countries. He announced earlier this week that he's extending his original July 9 deadline to Aug. 1 for some countries. In a social media post on Tuesday, Trump insisted that the Aug. 1 deadline is final.\nHowever, Trump has abruptly raised, lowered and paused tariffs since he originally announced them April 2, so there are no guarantees for Prime Day or going forward. Countries could face double-digit tariff hikes if they don't reach an agreement, and companies would likely pass through additional costs associated with tariffs to consumers. That means we could pay more for everything, including electronics.\nHowever, if you don't have the money earmarked to shop for Prime Day purchases, don't go into debt just to grab a deal. It's better to wait, even if prices are higher later this year. Otherwise, any savings you get from the deals could be wiped out by sky-high credit card interest rates.\nAfter launching the original Prime Day in 2015, the retailer has expanded the number of its sales events, including a Big Spring Sale in March and Prime Big Deal Days in October. Last year's Prime Day sale took place July 16-17."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/i-want-apple-to-steal-these-android-camera-features-for-the-iphone-17/",
      "text": "The iPhone 16 Pro already has a great camera system capable of taking photos so good you'd think they were taken on pro-level mirrorless cameras. I love the quality of all three rear lenses, and while I like recent features, such as the Photographic Styles and Apple's ProRaw image format, I think there's more the company can do to help photographers take their best ever photos.\nI've spent 14 years reviewing iPhones and Android phones from all brands for CNET, and as a professional photographer I've always had an eye toward testing the cameras of top models like the Galaxy S25 Ultra and Pixel 9 Pro. In that time, I've found a variety of features that I'd love to see Apple incorporate into its upcoming iPhone 17.\nSo let's get started.\nSamsung's My Filters color filter clone\nMy Filters, as Samsung sometimes calls it, is a tool hidden inside recent Galaxy camera phones. It essentially lets you steal the color tones from one image and apply them to another. Say you found a lovely photo online with dreamy pastel tones and warm highlights. You can save that image to your phone (even a screenshot of it will do), load it into the filter creation tool within the camera app and it will then create a new filter that aims to replicate the tones of that image. That filter will then be saved to your phone for you to apply to all your images later on.\nWhile the filters it creates are not always especially accurate to the source image (sometimes the effects can be quite subtle), I do like the results you can get from it. I've been able to create some lovely filmic looks that I've customized to try and give the impression of old Kodak film stocks.\nApple's Photographic Styles is the nearest thing the iPhone has, and while some of the looks are nice enough, there's not a lot of scope for getting truly creative with colors, film grain and other effects. I'd love to see Apple expand on its Photographic Styles tool to give the sort of filmic looks Fujifilm has achieved so well with its customizable \"recipes\" on its ever-popular cameras like the X100VI.\nNothing Phone 3's Macro Mode\nI wasn't all that impressed with the Nothing Phone 3 in my recent review and a large part of that was down to the overall disappointing camera performance. But it does have one saving grace in its macro mode. As someone who runs a photography YouTube channel specializing in macro photography, I feel I have a high bar for what looks good when it comes to close-up photos of tiny things like insects or flowers. But even I have to admit that this phone takes superb close-up photos.\nThe iPhone 16 Pro also has a macro function which uses the ultrawide lens to achieve close-up focusing. And while it certainly succeeds in getting up close and personal with whatever insect you happen to find, images don't always look great from it. I've found colors to look a little drab, though. And while it can focus close to the lens, it results in a wide-angle view. This means you'll need to get your phone right up close to an insect, likely scaring it off.\nI found Nothing's macro mode to look much more natural in its image processing, with vibrant colors. As it doesn't appear to rely on the ultrawide lens, it gives a closer view on your subject without the wide angle distortion. Fine, macro photography might be a niche use, but it's also something that anyone with a phone can do (versus having dedicated macro equipment). I'd still love to see Apple work on its close-up skills.\nXiaomi's 15 Ultra camera grip\nI loved Xiaomi's 14 Ultra and 15 Ultra phones, finding them capable of taking some of the best photos I've ever seen from phone cameras. There's a lot of reasons why these phones are great for photographers, but one of my favorite things about shooting with them are the Xiaomi-made accessories, including the camera grip and filter mount.\nThe grip in particular is super helpful as it allows you to hold the phone just like a regular compact camera, while the built-in shutter button makes it easier to snap away without having to tap the screen. The filter mount meanwhile allows me to use the same professional screw-in filters (like pro-mist, circular polarizers or neutral density filters) that I use with my professional camera kit.\nApple doesn't make a camera grip for the iPhone and while there are various third party ones, I haven't found many I really love to use. The Leica Lux grip is as well-built as you'd expect from the iconic photography brand, but it relies on MagSafe which feels risky trusting your phone to hold in place only with magnets and it will only work with the Leica app, not with the default iPhone camera app. (Oh, and it's a nearly $400 accessory.)\nXiaomi's kit, being made by the company itself and for the specific phone, works seamlessly, connecting securely to the phone and working as expected with the default camera app. The iPhone is amazing as an everyday carry camera, but it could be elevated dramatically if Apple created hardware accessories specifically for photographers.\nXiaomi 14 Ultra's variable aperture\nWhile I'm on the topic of Xiaomi, the company's 14 Ultra is definitely worth stealing from. In particular, the variable aperture in its main camera can go from wide open at f/1.7 and close down to f/4. Most phones have a fixed aperture and while you'd rarely notice the difference, when it comes to night-time photography, the Xiaomi 14 Ultra was amazing.\nBy closing down the aperture, I was able to create authentic starburst effects around points of light like streetlights in exactly the same way that you would by using a narrow aperture with a mirrorless camera and lens on a tripod. I loved the images I captured with the phone as they looked so much more professional than the weird amorphous blobs seen around light sources in night photos from other phones.\nI won't hold my breath on this one as even Xiaomi didn't stick with the technology for long. While the company made a big deal about it on the 14 Ultra, when it launched the 15 Ultra a year later, the variable aperture was nowhere to be seen. Perhaps the mechanics make the phone too expensive to produce or maybe there just wasn't enough benefit -- or demand -- for starbursts in night photos.\nEither way, it was a real highlight for me and it's something I'd love to see Apple implement in the iPhone 17's camera.\nXiaomi and Sony's external lens cameras\nYes, I'm talking about Xiaomi again. But also Sony, so simmer down. At MWC earlier this year Xiaomi showed off a concept for a camera and lens unit that attaches to your phone but contains its own large image sensor and larger, higher-quality optics. It harnesses the computing power, image processing and larger display of your phone, but offers much better overall image quality than the tiny cameras in your phone are able to achieve.\nSony actually had a similar idea itself all the way back in 2013, packing its QX100 and QX10 cameras with a large image sensor and full zoom lens, but no screen. Like the Xiaomi concept, it connected to a phone to act as the display. While Sony's product did go on sale, it never really took off and the company didn't return to the format, while Xiaomi's is firmly still in \"concept\" territory.\nI certainly won't be alone in having daydreamed about what an Apple camera would be like. Pairing the top-end image processing Apple is able to achieve with its iPhones with a significantly larger image sensor and pro-standard lens optics could result in an absolute photography powerhouse for both casual snappers and pros alike.\nAnd while I don't ever foresee the company launching an actual stand-alone camera, I'd love to see it create a camera unit like Sony's and Xiaomi's that's designed to work in tandem with an iPhone. Do I expect to see this at the iPhone 17 launch? Absolutely not. Will I dream about it anyway? Damn right."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/should-you-buy-an-iphone-16-or-wait-for-the-iphone-17/",
      "text": "I popped into the Verizon store the other day and saw a startling number of people buying a new iPhone 16. It took everything in me not to chime in with, \"Are you sure you don't want to wait and see what Apple has planned for the iPhone 17?\"\nWith the anticipated launch of the iPhone 17 in September, it could be a good idea to hang tight and either buy the new phone or get the iPhone 16 at a discounted price. Apple still hasn't confirmed the existence of the iPhone 17, and we don't have any official specs or features, but here's how it could compare to the iPhone 16, according to rumors and speculation.\niPhone 16 vs. iPhone 17: Key rumored specs compared\nWe still don't have any confirmed details about the iPhone 17 but that hasn't stopped the rumor mill from churning and purported leaks from making the rounds. Speculation extends across the entire iPhone 17 lineup, from the Pro models to what could be a thinner \"Air\" version (which may be Apple's answer to the Samsung Galaxy S25 Edge). But I'm going to focus on the baseline iPhone 17.\nScreen differences\nOne of the most highly anticipated changes could be that the iPhone 17 adds a 120Hz display, which would be very welcome. Currently, only the iPhone Pro models have that higher refresh rate, while the baseline and Plus models are stuck with a 60Hz display. Bumping that refresh rate could also prompt Apple to bring the always-on display to the baseline model, making it easier to quickly glance at the time and your notifications without waking your display.\nThere's been some back-and-forth on whether the iPhone 17 will have a scratch-resistant, antireflective display. But the most recent reports suggest that feature will only be available on the iPhone 17 Pro and Pro Max, not the baseline iPhone 17 (or the Air). So there may not be major discrepancies between the iPhone 16 and 17 on that front.\nCamera differences\nIt's possible the iPhone 17's selfie camera will get a bump to 24 megapixels, instead of the current 12 megapixels found in the iPhone 16's front-facing shooter. Megapixels aren't the only determining factor for good-quality photos but if it is an upgrade, that could make taking selfies or shooting videos for social media on the front-facing camera less of a compromise.\nThere's also been some conversation about the camera bump on Apple's upcoming iPhone lineup. It's likely that only the Pro models' cameras will be nestled in a new, larger panel that stretches horizontally across the back of the phone (perhaps evoking the \"Geordi Visor\" on the Google Pixel 9) and that the baseline will maintain a similar camera arrangement to the iPhone 16. Only time will tell.\nDesign differences\nRumors suggest that like the iPhone 16, the iPhone 17 will have an aluminum frame. (In fact, it's possible that'll be the case for the entire lineup, apart from the iPhone 17 Air, which could have a titanium frame to make it lighter.)\nThere have also been reports that the iPhone 17 will use a new compact \"metalens\" technology for the proximity sensor, which could reduce the size of the Face ID sensor and the Dynamic Island. That could give slightly more real estate to the top of the 17's display.\nProcessor and RAM\nOne key element that could remain unchanged across both phones is the processor. The iPhone 17 is rumored to pack an A18 chip, just like the iPhone 16.\nWith Apple's plans to expand its Apple Intelligence suite of AI capabilities, it's possible the iPhone 17 lineup could come with 12GB of RAM instead of the current 8GB -- or at least part of it could.\nIn April, analyst Ming-Chi Kuo said the iPhone 17 Air and Pro models would sport 12GB of RAM but that Apple was still deciding whether to equip the baseline model with that higher amount too. In May, analyst Jeff Pu noted the baseline would remain at 8GB. We'll have to wait to see what Apple ultimately decides.\nSpeaking of Apple Intelligence, a new AI-powered Adaptive Power feature arriving with iOS 26 can help conserve the battery by making \"small performance adjustments,\" like \"allowing some activities to take a little longer,\" according to Apple. The next iPhone is expected to arrive with the upcoming operating system onboard but you'll also be able to download iOS 26 on the iPhone 16, as well as some older iPhones, once it becomes available publicly. That should help to stretch your battery life on either device.\nColor options\nWhat's on the inside may be most important but people also want to know what fun colors the iPhone 17 could sport. Rumors suggest the upcoming device could come in black, blue, silver, purple and green.\nFor comparison, the iPhone 16 is available in black, white, pink, teal and ultramarine.\nEverything we think we know about the iPhone 17 is still just speculation so we'll have to see what Apple unveils this fall.\nShould you buy an iPhone 16 now or wait for the iPhone 17?\nIf you're in desperate need of a new phone and can't wait any longer, who am I to stop you? But if you can hang tight until September, when Apple is expected to announce the iPhone 17, you can either score the flashy new device or get a discount on the iPhone 16. (In previous years, the company dropped the price on older models by about $100.)\nIt's likely the changes between the iPhone 16 and 17 will be relatively modest. Apple tends to debut newer features on its Pro models before eventually rolling them out across the full lineup, like it did with the Dynamic Island on the iPhone 14 Pro and Pro Max and the Action button on the iPhone 15 Pro and Pro Max. So any shiny new capabilities will likely land on its more premium phones first, such as the rumored antireflective display and redesigned cameras on the iPhone 17 Pro models.\nBut perhaps the biggest changes could arrive next year with the 20th anniversary of the iPhone, for which Apple is reportedly \"preparing a major shake-up\" of the phone's design, according to Bloomberg. That includes a (long-rumored) foldable version and a \"bold new Pro model that makes more extensive use of glass.\" The iPhone 17 may not even be announced yet but it's never too early to be looking even further ahead."
    },
    {
      "url": "https://www.cnet.com/deals/best-iphone-16e-deals/",
      "text": "Apple makes some of the most powerful yet sleek phones on the market, but they often come with a steep price. If you're looking to get into the Apple ecosystem but are on a tight budget, the new iPhone 16E is an excellent alternative to consider, compared with the pricier standard iPhone 16. Prices start at $599, but you can grab it for even less with some offers we uncovered.\nHere's what you need to know. The new iPhone 16E has a four-core A18 processor and a new C1 5G modem -- the most power-efficient modem we've seen on any iPhone model to date. The 16E has a 6.1-inch Super Retina XDR display, a 48-megapixel rear camera with 2x telephoto zoom and a 12-megapixel front camera for selfies. Like other phones in the flagship iPhone 16 lineup, it's designed for Apple Intelligence and has a dedicated action button to launch Visual Intelligence. And CNET reviewer Patrick Holland says it also boasts impressive battery life. \"The iPhone 16E can definitely make it through a day on a single charge and, depending on how you use it, it'll likely make it through a day and a half before needing to be plugged in,\" he wrote in his review. The basic model comes with 128GB of storage.\nBest iPhone 16E deals\nThe 16E is now available at Apple and several other retailers and carriers, with multiple ways to save some cash. Some offer discounts with a new line of service and if you have an older phone you don't mind parting with you can score substantial savings with a trade-in offer. We'll keep a close eye on offers as they come and go and update this page accordingly, so be sure to check back often.\nWhen you trade in an eligible device, Apple offers savings on the new iPhone 16E. Trading in an old phone could save you up to $600, which can potentially score you the basic 128GB model free. However, that discount is available only if you're trading in the iPhone 15 Pro Max, which would be a bit of a downgrade. For the iPhone 14 series, the most you'll save is $470, which is still a solid deal for this affordable model. Note that the older your phone is, the less you'll potentially receive for a trade-in device.\nIf you order the iPhone 16E at Best Buy and sign up with a carrier, there are ways to save. A qualified activation with Verizon and a trade-in of your old or damaged phone will save you up to $600. If you're an AT&T customer, a qualified activation on an eligible unlimited installment plan can save you up to $384, which drops the starting price to just $6 per month -- no trade-in required. Discounts will be delivered via bill credits over 36 months.\nCustomers can order the new iPhone 16E at T-Mobile and there are a few ways to save. If you're trading in an old phone, you can get it free if you're on an Experience More, Experience Beyond, Go5G Plus or Go5G Next plan, while those on most other plans will save up to $300. You can also get it free with a new line and a trade-in or when you switch your number from another carrier. There are also several special offers for military members, first responders and people 55 and older.\nIf you'll be trading in an old phone with the activation of a select Unlimited Plan, you can save up to $600, which scores you the 128GB model free. Even without a trade-in, you can save $600 when you purchase an iPhone 16E with the Unlimited Plus or Unlimited Ultimate plan.\nAT&T is offering up to $384 off the iPhone 16E when you purchase it on an installment plan, as long as you have (or switch to) an eligible unlimited plan. That reduces the starting price to just $6 per month with no trade-in required. You'll receive the discount via 36 monthly bill credits.\nUS Cellular is offering many ways to save on the iPhone 16E. Activating a line or account on a qualifying line will save you up to $830, which scores you the 128GB or 256GB model free. You can also get the 512GB model free with a new line and an eligible trade-in.\nUS Cellular is also offering up to $350 off with a new prepaid line and the port-in of an existing number.\nOrder your iPhone 16E at Boost Mobile and sign up for the Unlimited Premium plan ($60 a month), and you can snag a new iPhone for as little as $100. You can also pay full price for the phone up front, which will get you a free year of service.\nVisible isn't offering any direct deals at the moment, but trading in your old phone can save you as much as $660.\nYou can order the iPhone 16E from Walmart for $549 or just a little more than $15 per month for 36 months with an eligible activation through AT&T. Verizon customers will get it for about $17 per month, which is $50 off.\nHow much does the iPhone 16E cost?\nThere are three storage configurations for the new iPhone 16E. The pricing for each model is as follows:\n- 128GB: $599\n- 256GB: $699\n- 512GB: $899\nWhat colors does the iPhone 16E come in?\nThe iPhone 16E is only available in two colors -- white or black. Apple also has a silicone case that retails for $39 and comes in five colors -- winter blue, fuchsia, lake green, black and white.\nWhen was the iPhone 16E released?\nThe iPhone 16E is the first budget-friendly Apple phone since the third-gen iPhone SE hit shelves in 2022. Preorders started on Feb. 21, and the phone started shipping on Feb. 28."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/best-phone/",
      "text": "We test dozens of phones each year, but we only consider a few to be truly great. The best phones in 2025 have a battery life that lasts a day or more, cameras that take stunning photos and vibrant displays, perfect for TikTok or watching The Gilded Age. 2025 has been an incredible year for smartphones. From Google's Pixel 9 series and Apple's iPhone 16 family to Samsung's Galaxy S25 series and foldable phones including the Motorola Razr Ultra and Galaxy Z Fold 7, these are the best phones you can buy. While tariffs and economic uncertainty have caused people to consider upgrading their phones sooner rather than later, companies like Apple, Samsung and Google have not raised their prices.\nOur Picks\nMOBILE DEALS OF THE WEEK\n- $449 (save $50)\n- $550 (save $50)\n- $300 (save $100)\nWhat is the best phone for most people?\nThe best phone for most people is the $799 iPhone 16. It comes in two sizes: a 6.1-inch regular iPhone 16 model or a larger 6.7-inch iPhone 16 Plus model that starts at $899. The phones have a new 12-megapixel ultrawide camera that performs better in low light and can now take macro photos, meaning you'll be able to focus close to take amazing food snaps. The iPhone 16 and 16 Plus have a handful of Apple Intelligence tools for writing, removing distractions from photos and doing summaries of messages and webpages. There's also adds a ChatGPT integration to Siri.\nThe phones also have an Action button that can be programed for different functions like turning on the flashlight, recording a voice memo, changing the focus mode and more. There's also a new Camera Control button that not only lets you take photos and quickly change things like zoom, Portrait mode aperture and Photographic Styles, but can also trigger a new feature called Visual Intelligence, which will add context to whatever the camera is pointed at, a bit like Google Lens. We think the iPhone 16 and 16 Plus are ideal for most people looking for a great phone that will last for years.\nBest phones of 2025\nPros\n- Camera Control is useful for switching camera settings\n- Photographic Styles makes photos pop\n- Ultrawide camera is better in low light\nCons\n- Apple Intelligence isn’t out yet\n- No always on display\n- No changes to wired charging speeds\n- No upgrades to the Action button\nWhen I tested the iPhone 16 and 16 Plus I was definitely impressed by the new photography features, the convenient Action button and the elegant build. I consider these phones to be top-notch choices for Apple fans. Parts of the iPhone 16’s key feature, Apple Intelligence, are now out, and the fact that these phones will support it means they’ll likely feel future-proofed for years to come. Aside from screen size (6.1 inches on the regular, 6.7 inches on the Plus), battery size and price, the iPhone 16 and 16 Plus are identical in every way.\nThe iPhone 16 isn’t perfect -- it’s missing an always-on display, and it feels like it’s been ages since Apple improved its wired charging speeds. But it checks all the important boxes and then some.\nWhy we like it\nThe iPhone 16 and 16 Plus rank so high in our testing because the phones appeal to both novice users and power players a like. They offer about 90% of the experience of Apple's Pro models but cost hundreds of dollars less. Not only is the iPhone 16 a wonderful phone out of the box, Apple has a long track record of updating its software and security patches for years.\nWho it's best for\nWhen you think about how the Camera Control key, the Action button and the Dynamic Island come together, along with the camera and battery improvements Apple has made over the last several years, the iPhone 16 is a compelling upgrade for someone coming from an older iPhone, especially if that person is on an iPhone 13 or older. For those who don’t need the Pro’s extra photography prowess and battery life, the iPhone 16 won’t disappoint.\nWho shouldn’t get it\nI wouldn't recommend buying the iPhone 16 just for the Camera Control button or the better ultrawide camera.\nPros\n- Camera consistently delivers good images\n- Impressive battery life\n- More AI features feel practical\nCons\n- Several gimmicky AI features\n- Not many changes over the S24\nThe Galaxy S25's biggest flex that I noticed while testing is it shares many of the same attributes as its pricier counterparts, the S25 Plus and S25 Ultra – but it does so for several hundred dollars less. You'll find features like the AI Select tool, Audio Eraser and deeper Gemini integration across all of Samsung's S25 devices, as well as a custom Snapdragon 8 Elite processor and 12GB RAM – making the smaller phone of the bunch still seem pretty mighty.\nAnd while the Galaxy S25 might look incredibly similar to the S24 and share many of the same specs, consistency isn't so bad when it means there's a consistently good camera and great battery life. Read our full Samsung Galaxy S25 review.\nWhy we like it\nHaving a baseline phone, like the Galaxy S25, that delivers many of the same perks as more expensive models, is a huge plus in my book. And given the remarkable processing power, standout camera and seamless AI integration in the Galaxy S25 lineup, it's great that I can get all those premium features for $800.\nWho it's best for\nIf you're someone who insists on buying a flagship device, the Galaxy S25 won't let you down. but if you have a device that's two years old or more, you might be enticed to tap into all the latest Galaxy AI and integrated Gemini features. Now, $800 isn't pocket change, and there are definitely other options for those who want to be more budget conscious, but if you're willing to spend a bit more, the baseline S25 can be a great all-around choice.\nWho shouldn’t get it\nYou probably don't need to upgrade if you're using last year's S24.\nPros\n- Robust design\n- Bright high resolution inner screen\n- Battery life should last you a day or more\n- It's so damn fun to use\nCons\n- Cameras take decent photos but suffer from motion blur\n- Only three years of major OS updates\n- Gets warm playing games and using the camera frequently\nThe Motorola Razr Ultra is a beefed-up version of last year's Razr Plus, which won a CNET Editor's Choice Award. It's as if the Razr Plus hired a trainer and nutritionist and then got absolutely ripped -- warranting its name: Ultra. After testing, I've come to adore the Razr Ultra. It does all the \"normal\" non-folding phone things I want, and offers me a truly unique experience thanks to its cover screen. I feel like the coolest kid in the coffee shop when Google Pay-ing for my cortado with my Razr Ultra closed.\nBut in taking nearly every aspect of the phone to the extreme, Motorola lost one of the most important parts of recent Razrs: the amazing value. The catch for all this ultra-ness: the Motorola Razr Ultra costs $1,300.\nWhy we like it\nThis is the best built foldable flip phone I've ever used. Motorola took the best parts of the Razr Plus and improved nearly everything else. The battery life is outstanding and easily lasts a day on a single charge and can get you mostly through a second day even. The displays are brighter. The main 7-inch foldable display is larger and has more resolution than the Razr Plus and the cameras are improved. The fabric backing is delightful.\nWho's it best for\nSomeone who wants a fun, unique an robust foldable phone. You're willing to pay top-dollar to get the best processor, battery, design and cameras Motorola has ever made.\nWho shouldn't get it\nIf you're unsure of foldables, this might not be the best fit. If you find yourself in places with sand, dirt and other fine particles, the Razr Ultra (like all foldable phones) isn't worth the risk. The Razr Ultra has the same class-leading IP-rating for dust and water resistance, but the dust resistance is only for particles 1-mm or larger.\nPros\n- Larger screens/thinner bezels\n- 4K slo-mo OMG\n- Audio Mix is brilliant\n- iOS 18\nCons\n- No Apple Intelligence out of the box\n- Camera Control placement not optimal for one-handed shooting\n- Elegant finishes aren't very colorful\n- Only 128GB of storage for $1,000\nThe iPhone 16 Pro and 16 Pro Max have everything I've come to expect in a year-over-year upgrade. The 6.3-inch iPhone 16 Pro and 6.9-inch iPhone 16 Pro Max have a slew of upgrades including one of the best batteries on any phone I've tested as well as. In our testing it will easily last a day on a single charge.\nThe phones also have larger displays, outstanding photo and video chops, high-resolution slo-mo, a new Camera Control button, iOS 18 goodies and a handful of Apple Intelligence tools. The negatives are as thin as the borders around the new screens: You only get 128GB of storage for $1,000; there are only drab color options, and a the new camera button is easy to tap accidentally. Read our full iPhone 16 Pro and 16 Pro Max review.\nWhy we like it\nThis year the 16 Pro and 16 Pro Max have the exact same cameras -- unlike the 15 Pro and 15 Pro Max, which had different telephoto options. Screen size, battery life and price should be the deciding factors when you're choosing between the two. The iPhone 16 Pro and Pro Max are excellent phones worthy of a spot in your pocket (and mine) if you can afford them.\nWho it's best for\nIf you have an iPhone 12 Pro or older, upgrading to the 16 Pro makes a lot of sense. If you're on a 13 Pro and still have a decent battery capacity, I'd say save your money. And if you're on a 14 Pro or 15 Pro, there's no need to upgrade. Also, I should note that the entry-level $999 iPhone 16 Pro only has 128GB of storage.\nWho shouldn't get it\nIf you are looking for a budget phone or don't need a phone with the latest features or tech.\nPros\n- Thin 4.2mm design\n- 200-megapixel main camera\n- Powerful Snapdragon 8 Elite processor\n- Durable build\nCons\n- Steep $2,000 price tag\n- Same 4,400-mAh battery as last year's Fold\n- 25-watt wired charging\nWith the Galaxy Z Fold 7, Samsung has finally addressed some of the key issues with its previous book-style foldables. The impressively thin build and wider, 6.5-inch cover screen makes this feel like a standard phone when closed, and that wider 8-inch inside display is great for multitasking, with the ability to run up to three apps simultaneously. Perhaps most notably, the camera gets a major upgrade with the addition of a 200-megapixel main camera, which takes shots on par with the top-of-the-line S25 Ultra.\nAltogether, it’s a great choice if you want a bigger, tablet-like display without the bulk or a compromise on camera quality.\nWhy we like it\nThe Z Fold 7 does a solid job combining what's great about standard slate phones and what's great about foldables. It feels wonderfully normal to hold when closed, thanks to its sleek design and lightweight build. It also packs great cameras and has an expansive main display that's 11 percent bigger than last year's Z Fold 6.\nThankfully, a slimmer build doesn't force the battery to take a hit; the Z Fold 7 maintains that same 4,400-mAh battery as last year's foldable. That pales in comparison to batteries from Chinese competitors, but at least it's not a downgrade. The Z Fold 7 also packs a Snapdragon 8 Elite processor to power the many AI features you'll get onboard, from Galaxy AI photo and audio editing tools to Google's Gemini Live and Circle to Search. The phone also supports seven years of software and security updates.\nWho it's best for\nIf you're bored of standard slate phones and want something that feels a little more exciting, the Galaxy Z Fold 7 is a great choice. The slim design and wider cover screen helps it to feel as normal as possible when closed, with the added perk of an expansive main display that's great for multitasking and watching videos. The cameras are also impressive for a foldable that's so thin.\nWho shouldn't get it\nThe Z Fold 7's $2,000 price tag is perhaps its biggest caveat. Also, if you don't need a bigger display, it may not be worth the splurge. Ironically, the cover screen is so practical that you’ll rarely need to open the phone -- unless you’re watching movies or multitasking, in which case a phone like the Galaxy S25 Ultra might be a better fit.\nPros\n- Best screen on any phone\n- Versatile cameras\n- Most powerful phone I've tested\n- Good battery life\nCons\n- $1,300 price\n- Design is almost too minimal\n- AI features are hit-or-miss\n- S25/S25 Plus have similar features and cost less\nSamsung's Galaxy S25 Ultra which has a lot of AI features, the best of which are interesting and the worst of which unreliable. Luckily, Samsung gets a lot of other things right on the S25 Ultra, which has a new Snapdragon 8 Elite processor, high-resolution ultrawide camera, and some sweet pro video tools that rival the iPhone 16 Pro. Samsung wisely kept all the best parts of last year's Galaxy S24 Ultra (basically the entire phone including that antireflective display) but some of its worst parts, too, like the $1,300 price tag.\nIf you want the best screen you can find on any phone, get the S25 Ultra. If you want the most versatile phone cameras, get the S25 Ultra. If you want a stylus, get the S25 Ultra. But if your needs scale back on any of those fronts, the more affordable S25 options, or even last year's S24 Ultra, may be worth considering. Read our full Samsung Galaxy S25 Ultra review.\nWhy we like it\nThe reason to get the Ultra over its S25 siblings is its screen, which is truly the best I've seen on any phone, and the cameras, which are a step above what the S25 and S25 Plus have. Added video features like ability to record in Log format gets the Ultra as close as it's ever been to the iPhone in terms of professional video capture.\nWho's it best for\nIf you have a Galaxy S22 Ultra or older, the S25 Ultra will seem like a significant upgrade. It's harder to make that case for S23 Ultra owners, who, unless their phone's battery is ailing or they can score an incredible discount, should otherwise sit this one out. And for you S24 Ultra owners, you don't need this phone. Save your money and treat yourself to a nice steak dinner and a movie.\nWho shouldn’t get it\nThe Galaxy S25 Ultra's appeal is muddied by its $1,300 price. The regular Galaxy S25 has the same functionality, power and longevity, and it costs $500 less. Want a bigger screen? Consider the Galaxy S25 Plus. For the majority of people, the regular Galaxy S25 and S25 Plus will be a better fit.\nPros\n- The screen is delightfully bright\n- Cameras are good for $499\n- Gemini Live Video AI has potential to be useful\n- Solid build\n- The under-$500 price\nCons\n- Battery life is just OK, will get through a day\n- Processor is serviceable (curious about longevity)\n- Lacks emergency SOS satellite texting\nFor $499, Google's Pixel 9A truly feels like you're getting more bang for your buck. It comes with several significant upgrades from last year's Pixel 8A: a fresh design, new display, larger battery, slightly more powerful chip, increased durability and upgraded software features.\nBut don't get me wrong -- it's not a perfect phone. There are places where Google had to compromise to keep the price under $500, like the lack of satellite connectivity for emergencies available on the $799 Pixel 9. Overall, though, I think the compromises Google made were smart and that the Pixel 9A is worth every penny. Read our Google Pixel 9A review.\nWhy we like it\nThe Pixel 9A is proof that you don't need to spend more than $500 to get a great phone. It can handle all you daily tasks from scrolling social media and news feeds and swiping through TikTok videos to taking a beautiful photo and lasting a day on a single charge.\nWho's it best for?\nIn theory: anybody. The Pixel 9A is for anyone who wants 95% of what a $1,000 phone can do at half the price.\nWho shouldn't get it\nAnyone who wants the absolute fastest processor or the most cutting edge cameras.\nPros\n- USB-C port is more convenient charging\n- Colorful matte design\n- Improved camera that can automatically take people and pet portraits\n- Dynamic Island brings better multitasking\nCons\n- No always-on display\n- Find My Friends feature only works with other iPhone 15 phones\n- Discounted iPhone 14 Pro may be a better value\n- Galaxy S24 offers a longer optical zoom\nWith the launch of the iPhone 16, the regular iPhone 15 is being sold at a discount -- $100 off. That means that the iPhone 15 now starts at $699. And you might be able to find steeper discounts throughout the coming weeks and months. With the Dynamic Island, a USB-C port for more convenient charging and a high resolution camera and a sharper digital zoom, I found the iPhone 15 to be a significant upgrade for those with older iPhones.\nThe iPhone 15 is available in two size options: the 6.1-inch iPhone 15 and the 6.7-inch iPhone 15 Plus. They run on the same chip as iPhone 14 Pro, the A16 Bionic, which should bring notable performance upgrades to those with an iPhone that's several years old. These phones also have Apple's second-generation ultra wideband chip, enabling a new feature that makes it easier to find friends or family members in a crowd which I found handy. Read our full iPhone 15 review.\nWhy we like it\nThe iPhone 15 and 15 Plus are heavily influenced by the iPhone 14 Pro. That includes the Dynamic Island, a dedicated area near the top of the screen for viewing time-sensitive data like your Uber's ETA, and the A16 Bionic processor. Overall, these changes come together to make the iPhone 15 feel like a big step forward for those upgrading from an aging iPhone.\nWho it's best for\nThe iPhone 15 is for someone coming from an iPhone 12 or older. In 2025, Apple sells it for $699. But I recommend looking for one that's discounted. If you're contemplating the iPhone 16E but really want an ultrawide camera (remember the 16E only has a single rear camera) and MagSafe charging, then grab an iPhone 15.\nWho shouldn't get it\nApple sells the $599 iPhone 16E which makes the iPhone 15 a curious value. If you can score a discounted iPhone 15 I'd go that way. But otherwise, the iPhone 16E might be a better buy.\nPros\n- Genuinely fun new AI skills\n- Sleek new design\n- Seven years of software updates\n- Cameras can take great daytime shots\nCons\n- Camera hardware hasn't improved much over Pixel 8 Pro\n- Gemini AI will eventually require a paid subscription\nThe Pixel 9 Pro and 9 Pro XL have a lot going for them, from their shiny new designs and long software support period. But it's the AI skills that really stand out, from the deep integration of the conversational Gemini Live, to the new Pixel Studio that creates weird and wonderful images from your text prompts.\nThe phones aren't perfect. While the cameras are good and can take excellent photos in bright light, they're just okay in low-light and in night mode. The best AI features will require a monthly subscription (though you get the first year for free) But if you're keen to experiment with AI on your phone then the new Pixel 9 Pro range is a superb way to experience it. Read our Google Pixel 9 Pro and 9 Pro XL review.\nWhy we like it\nGoogle's Pixel line of phones has gone from strength to strength and its latest model is unquestionably the best phone the company has ever made. It's not just the slick-looking design; the Pixel 9 Pro offers a superb camera system, a generous support period and a host of new AI skills making it one of the most accomplished Android phones around. The 9 Pro XL takes that further by accommodating a bright and vibrant 6.8-inch display.\nWho it's best for\nIt's a great phone for those of you looking for an elegant everyday Android phone. The interface is easy to navigate and the camera takes great photos with almost no effort on your part. If you feel overwhelmed by the plethora of settings and menus on other Android flagships, Google's Pixel 9 Pro is the way to go. If playing mobile games or watching videos on the go is a priority, opt for the larger Pixel 9 Pro XL.\nWho shouldn't get it\nIf you don't need the best cameras Google makes, consider the regular Pixel 9. I do like the fit and finish better on the 9 Pro, but it starts at $999.\nPros\n- The 6.9-inch screen is immersive, with lovely colors and contrast\n- The 4.1-inch screen looks incredible\n- It's durable and survived a drop onto concrete\n- One UI 8 (Android 16) runs wonderfully\n- $1,100 is still a lot, but Samsung gives the phone more value than the Flip 6\nCons\n- Gets warm when recording videos and playing games\n- Battery life is the same as the Flip 6 despite a bigger battery\n- Cover screen software has room to grow\nWhen I first got my hands on Samsung's new Galaxy Z Flip 7, I was delighted to discover that it has a smaller crease, larger cover screen, thinner design and bigger battery compared to last year's Galaxy Z Flip 6. But as I tested the new clamshell phone, I became enthralled by its inner screen. At 6.9 inches, this is the biggest screen on any Samsung phone aside from the Galaxy Z Fold 7, which has an 8-inch foldable display.\nThe Z Flip 7's large screen size makes content feel more immersive and colors look lovely and vivid. This led to epic TikTok and Instagram sessions, watching widescreen films such as A Working Man and Back to the Future, as well as jumping back and forth between two apps stacked vertically on the screen thanks to One UI 8's 90:10 split tool.\nEvery time I open the Flip 7, I'm consistently dumbfounded by how such a large display can unfurl from something about the size of a makeup compact. And when it's closed, there's a 4.1-inch cover screen that's fantastic in its own ways, with new clever animations for when you're recording a video, charging the phone or taking a selfie, all efficiently using the extra display real estate. In terms of functionality, though, the cover screen's software is about the same as the 3.4-inch one on the Flip 6.\nThe Flip 7 impressed me in nearly every way but one: its battery life. It has a larger battery than the Flip 6, but it doesn't last any longer in daily use. It did consistently get me through a day on a single charge, often having 15 to 20% left, but there were also a few days where it needed an early evening top-off.\nWhy we like it\nThe Galaxy Z Flip 7 is the most fully realized version of Samsung's ideal of a flip phone since the launch of the original Galaxy Z Flip in 2020. The Flip 7's appeal is simple: It's a thin phone with a big, bold screen that folds in half into a coaster-sized square. The larger cover screen and inner screen make content more immersive. It's design is thin (for a clamshell foldable) and comfortable to hold. Plus you get twice the storage this year compared to last.\nWho is it best for\nIf you've been tempted by a clamshell-style foldable, you should definitely consider the Flip 7. If you have a Galaxy Z Flip 4 or older, the Flip 7 will be an upgrade in every way. It's harder to make that same recommendation for Flip 5 owners unless your phone is showing its age. And if you have a Galaxy Z Flip 6, you can sit this one out unless you really want those larger screens.\nWho shouldn’t get it\nIf you spend a ton of time around dirt or sand, this phone isn't for you.\nPros\n- Lightning fast charging\n- Nice big screen\n- 7 years of OS and security upgrades\n- Great performance with games, movies and animations\nCons\n- Battery life is a day, similar to baseline S25\n- Similar specs as the S25 at a higher price\n- Rival phones at the same price have better cameras\nIf the baseline Galaxy S25 appeals to you but you'd rather have a bigger screen and higher battery capacity – without upgrading all the way to the Ultra – the S25 Plus may be the phone for you. The entire S25 lineup shares many features, from AI capabilities to processing power to memory, so the Plus may be a viable choice if you're looking for something right in the middle.\nThat said, the Plus' minimal upgrades over the baseline S25 may not justify the $200 price difference. But if a bigger phone just feels better to hold and you'd rather have a 4,900 mAh battery (over the S25's 4,000mAh one), then that $1,000 starting price might ultimately be worth every penny. Read CNET's full Samsung Galaxy S25 Plus review.\nWhy we like it\nWhile the baseline S25 checks all the key boxes, the S25 Plus can simply feel like a more comfortable device to use, especially if you're a fellow member of the bigger hands club. In addition to sharing many of the same features as the pricier S25 Ultra, the S25 Plus has a higher battery capacity than the baseline model -- though in CNET's tests, there weren't any major discrepancies in how the two batteries actually performed. Still, sometimes you just want to live a little larger, and this phone can be the perfect fit.\nWho it's best for\nIf you like having a larger screen to watch movies or play games on, the S25 Plus can be a great choice. While the S25 Ultra might be a top pick for someone who wants both a bigger phone and the most premium features, the S25 Plus can be that goldilocks device that meets you right in the middle -- without you having to spend $1,300 on the Ultra.\nWho shouldn’t get it\nIf you want the absolute best in terms of cameras, don't get the S25 Plus. For $1,000 phones like the Pixel 9 Pro or iPhone 16 Pro have better cameras. Or if you can afford to buy a $1,300 phone, check out the Galaxy S25 Ultra which has an amazing set of lenses\nPros\n- Beautiful design that feels durable\n- Fun and somewhat useful AI features\n- New ultrawide camera takes good photos\n- 7 years of software updates for longevity\nCons\n- More expensive that previous Pixels and competitors\n- Doesn't feel that different from Pixel 8\nThere’s a lot to like about the Pixel 9, from its respectable camera to its classy new design and lengthy 7-year timeline for software updates. But Google’s phones have always shined for their clean, slick software, and that once again applies to the Pixel 9 series. Pixels are also among the first to get new software updates, making them an ideal choice for those who want to get their hands on the latest version of Android first. Aside from Android updates, Google also brings new features to Pixel phones throughout the year through updates it calls Feature Drops.\nThe Pixel 9 comes with a few new AI tricks that you may find useful, like the ability to search for content in screenshots, generate images from scratch in the Pixel Studio app and add new objects in photos. These features aren’t must-haves, and they’re not without flaws. Plus, at a starting price of $799, the Pixel 9 has a higher bar to live up to. But the Pixel 9 feels like it belongs in that class of device. Read our full review for the Google Pixel 9.\nWhy we like it\nThe Pixel 9 and Google's Gemini assistant still feel like a first step toward what the company is hoping to achieve: Making phone software more intelligent so that we can spend less time swiping, tapping, scrolling and digging. In the meantime, the Pixel 9 shines for its great camera, elegant design and clean software, just like the less AI-centric Pixels of years past.\nWho it's best for\nIf you're a Pixel fan upgrading from an older phone, like the Pixel 6 or earlier, you'll find a lot to love about the Pixel 9. But keep in mind that for the same price, Samsung's Galaxy S25 has a brighter screen and a dedicated telephoto lens for taking zoomed photos.\nWho shouldn't get it\nIf you want the absolute best cameras that Google makes, including having a dedicated telephoto lens, I'd recommend the Pixel 9 Pro.\nBest phones compared\n| Product | Apple iPhone 16 | Apple iPhone 16 Pro | Apple iPhone 15 | Google Pixel 9 | Google Pixel 9 Pro | Google Pixel 9 Pro XL | Samsung Galaxy S25 | Samsung Galaxy S25 Plus | Samsung Galaxy S25 Ultra | Moto G Power 5G (2024) | Motorola Razr Plus (2024) |\n|---|---|---|---|---|---|---|---|---|---|---|---|\n| Display size, tech, resolution, refresh rate | 6.1-inch OLED; 2,556 x 1,179 pixel resolution; 60Hz refresh rate | 6.3-inch OLED; 2,622 x 1,206 pixel resolution; 1-120Hz adapative refresh rate | 6.1-inch OLED; 2,556x1,179 pixels; 60Hz refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.3-inch LTPO OLED; 2,856x1,280 pixels; 1-120Hz variable refresh rate | 6.8-inch LTPO OLED; 2,992x1,344 pixels; 1-120Hz variable refresh rate | 6.2-inch AMOLED; 2,340x1,080 pixels; 1-120Hz adaptive refresh rate | 6.7-inch AMOLED; 3,120x1,440 pixels; 1-120Hz adaptive refresh rate | 6.8-inch AMOLED; 3,120x1,440 pixels; 1-120Hz adaptive refresh rate | 6.7-inch LCD; 2,400 x 1,080 pixels, 60-120Hz refresh rate | 4-inch pOLED; 1,272 x 1,080 pixels; 1-165Hz variable refresh rate; 6.9-inch pOLED; 2,640 x 1,080 pixels, 1-165Hz variable refresh rate |\n| Pixel density | 460 ppi | 460 ppi | 460 ppi | 422 ppi | 495 ppi | 486 ppi | 416 ppi | 509 ppi | 501 ppi | 391 ppi | Cover: 417 ppi; Internal: 413 ppi |\n| Dimensions (inches) | 5.81 x 2.82 x 0.31 inches | 5.89 x 2.81 x 0.32 inches | 2.82x5.81x0.31 inches | 6x2.8x0.3 inches | 6x2.8x0.3 inches | 6.4x3x0.3 inches | 5.78 x 2.78 x 0.28 in. | 6.24 x 2.98 x 0.29 in. | 6.41 x 3.06 x 0.32 in. | 6.6 x 3 x 0.3 in. | Open: 6.75 x 2.91 x 0.28 in Closed: 3.47 x 2.91 x 0.6 in |\n| Dimensions (millimeters) | 147.6 x 71.6 x 7.8mm | 149.6 x 71.5 x 8.25mm | 71.6x147.6x7.8 mm | 152.8x72x8.5 mm | 152.8x72x8.5 mm | 162.8x76.6x8.5 mm | 146.9 x 70.5 x 7.2 mm | 158.4 x 75.8 x 7.3 mm | 162.8 x 77.6 x 8.2 mm | 167.2 x 76.4 x 8.5mm | Open: 171.42 x 74 x 7.09mm Closed: 88.09 x 74 x 15.32mm |\n| Weight (grams, ounces) | 170 g (6 oz.) | 199 g (7.03 oz.) | 171g (6.02 oz.) | 198g (7 oz.) | 199g (7 oz.) | 221g (7.8 oz) | 162g (5.71 oz.) | 190g (6.70 oz.) | 218g (7.69 oz.) | 201g (7.09 oz.) | 189g (6.67 oz) |\n| Mobile software | iOS 18 | iOS 18 | iOS 17 | Android 14 | Android 14 | Android 14 | Android 15 | Android 15 | Android 15 | Android 14 | Android 14 |\n| Camera | 48-megapixel (wide), 12-megapixel (ultrawide) | 48-megapixel (wide), 48-megapixel (ultrawide) 5x telephoto | 48-megapixel (wide), 12-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide), 48-megapixel (5x telephoto) | 50-megapixel (wide), 48-megapixel (ultrawide), 48-megapixel (5x telephoto) | 50-megapixel (wide), 12-megapixel (ultrawide), 10-megapixel (3x telephoto) | 50-megapixel (wide), 12-megapixel (ultrawide), 10-megapixel (3x telephoto) | 200-megapixel (wide), 50-megapixel (ultrawide), 10-megapixel (3x telephoto), 50-megapixel (5x telephoto) | 50-megapixel (wide), 8-megapixel (ultrawide) | 50-megapixel (wide) 50-megapixel (2x telephoto) |\n| Front-facing camera | 12-megapixel | 12-megapixel | 12-megapixel | 10.5-megapixel | 42-megapixel | 42-megapixel | 12-megapixel | 12-megapixel | 12-megapixel | 16-megapixel | 32-megapixel |\n| Video capture | 4K | 4K | 4K | 4K | 4K | 4K | 8K | 8K | 8K | 1,080p | 4K |\n| Processor | Apple A18 | Apple A18 Pro | Apple A16 Bionic | Google Tensor G4 | Google Tensor G4 | Google Tensor G4 | Qualcomm Snapdragon 8 Elite for Galaxy | Qualcomm Snapdragon 8 Elite for Galaxy | Qualcomm Snapdragon 8 Elite for Galaxy | Mediatek Dimensity 7020 | Snapdragon 8S Gen 3 |\n| RAM + storage | RAM N/A + 128GB, 256GB, 512GB | RAM N/A + 128GB, 256GB, 512GB, 1TB | RAM N/A + 128GB, 256GB, 512GB | 12GB RAM + 128GB, 256GB | 16GB + 128GB, 256GB, 512GB, 1TB | 16GB + 128GB, 256GB, 512GB, 1TB | 12GB RAM + 128GB, 256GB | 12GB RAM + 256GB, 512GB | 12GB RAM + 256GB, 512GB, 1TB | 8GB RAM + 128GB | 12GB + 256GB |\n| Expandable storage | None (Face ID) | None (Face ID) | None (Face ID) | None | None | None | None | None | None | Up to 1TB | None |\n| Battery | Up to 22 hours video playback; up to 18 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Up to 27 hours video playback; up to 22 hours video playback (streamed). 20W wired charging. MagSafe wireless charging up to 25W with 30W adapter or higher; Qi2 up to 15W | Undisclosed; Apple claims up to 20 hours of video playback (16 hours streamed) | 4,700 mAh | 4,700 mAh | 5,060 mAh | 4,000 mAh | 4,900 mAh | 5,000 mAh | 5,000 mAh | 4,000 mAh |\n| Fingerprint sensor | None (Face ID) | None (Face ID) | Face ID | Under display | Under display | Under display | Under display | Under display | Under display | Side | Side |\n| Connector | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None | None | None | None | None | None | Yes | None |\n| US starting price | $799 (128GB) | $999 (128GB) | $799 (128GB) | $799 (128GB) | $999 (128GB) | $1,099 (128GB) | $800 (128GB) | $1,000 (256GB) | $1,300 (256GB) | $300 (128GB) | $1,000 (256GB) |\n| UK starting price | £799 (128GB) | £999 (128GB) | £799 (128GB) | Converts to £640 (128GB) | Converts to £780 (128GB) | Converts to £860 (128GB) | £799 (128GB) | £999 (256GB) | £1,249 (256GB) | Converts to £234 (128GB) | Converts to £779 (256GB) |\n| Australia starting price | AU$1,399 (128GB) | AU$1,799 (128GB) | AU$1,499 (128GB) | Converts to AU$1,210 (128GB) | Converts to AU$1,510 (128GB) | Converts to AU$1,670 (128GB) | AU$1,399 (256GB) | AU$1,699 (256GB) | AU$2,149 (256GB) | Converts to AU$453 (128GB) | Converts to AU$1,483 (256GB) |\nRecent updates\nIn July 2025, we added the Samsung Galaxy Z Fold 7 and Galaxy Z Flip 7 to our list. The Fold 7 replaces last year's Fold 6 and comes with a completely new design that makes it thinner, lighter and feel more like a \"regular phone.\" The Flip 7 is the best-built foldable flip phone we tested from Samsung. The thinner design and bigger displays are the headline features.\nFactors to consider when buying a new phone\nPick the most important feature: Is it screen size? Camera quality? Battery life? This will help narrow down your choices. Phones like the iPhone 16 Pro Max or Galaxy S25 Ultra cost well over $1,000, for example, but pack large batteries that will last most people a day and a half to two days on a single charge.\nDon't dismiss $500 to $800 phones: You can get a great phone that does almost everything that a more expensive flagship model can do for a fraction of the price. Google's Pixel 9 (which starts at $799) packs a great camera, a bright screen and unique AI features, but the $499 Pixel 8A has most of the same key specs and comes at a lower price.\nShop Cyber Monday: Look for sales and deals close to holidays, especially Amazon's Prime Day and Cyber Monday.\nConsider last year's models: When a new phone gets launched, stores and carriers discount their older phones to sell off existing stock.\nSee the phone in person: It's worth going to a store and trying out a potential phone. You may love or hate the way it looks and feels.\nDecide on Android or iPhone: Do you have a lot of iPhone apps and Apple subscriptions? Stick with an iPhone. If you've invested in loads of Android apps, you may want to stay on that side of the fence. Otherwise, it's simple enough to switch platforms.\nBudget for a case and screen protector: Phones sold today are more durable than phones from even a few years ago, but it still might be a good idea to protect your phone with a case to keep it in tip-top shape.\nHow we test phones\nWe test every phone in real-world scenarios, focusing on its features, design, performance, cameras, battery life and overall value. We document our findings in an initial review that is periodically updated when there are new software updates, or to compare it against new phones from competitors such as Apple, Samsung, Google and OnePlus.\nPhotography\nPhotography is a major focus for most phones these days, so we take pictures and videos of various subjects in a variety of settings and lighting scenarios. We try out any new camera modes, such as 4K slow motion video that debuted with the iPhone 16 Pro and 16 Pro Max, or the new Magic Editor photo tools that launched with the Google Pixel 9 series.\nBattery life\nBattery testing is conducted in a variety of ways. We assess how long a phone lasts during a typical day of use and note how it performs during more focused sessions of video calls, media streaming and gaming. We also conduct a video playback test, as a simple, replicable measure of pure battery life, which isn't always included in the initial review but sometimes added later in an update.\nWe use benchmarking apps to measure each phone's performance, alongside our own anecdotal experiences using the phone for our review. Most noteworthy is how graphics and animations look. Are they smooth? Do they lag or stutter? We also look at how quickly the phone switches between horizontal and vertical orientations, and how fast the camera app opens and is ready to take a photo.\nWe perform processor-heavy tasks like editing photos, exporting videos and playing games. We evaluate whether a newer version of a particular phone includes enough features to make it worth upgrading from older models.\nPerformance measuring\nRead more: How We Test Phones\nOther phones we tested\nWhile Apple doesn't sell the iPhone 15 Pro, you can still find it at carriers and third-party retailers. The 15 Pro has a 6.1-inch adaptive-refresh rate screen that adjusts between 1-120Hz depending on what's on the screen. It has excellent cameras, a fast processor, an always-on display, supports iOS 18 and safety features like Crash Detection and Emergency SOS via Satellite. Driving all these upgrades is Apple's A17 Pro chip which in use feels peppy. The iPhone 15 Pro is still an excellent phone in 2025. Check out our iPhone 15 Pro review.\nPhone FAQs\nWhat is the best time to buy a phone?\nHow long should a phone battery last?\nHow much storage should I get on a phone?\nWhat are the best phone brands currently?\nWhat to look forward to in 2025\nGoogle is expected to launch the Pixel 10 series in August. There's also buzz for the next iPhone, likely called the iPhone 17 -- from a slimmer version of the upcoming device to a new screen with a higher refresh rate on baseline models. We've rounded up rumors, leaks and analysis on the iPhone 17 Air (one of several nicknames for Apple's next iPhone). Read CNET's iPhone 17 rumor roundup for more info."
    },
    {
      "url": "https://www.iphone-ticker.de/iphone-17-vorstellung-wohl-am-9-verkaufsstart-am-19-september-261445/",
      "text": "Nur noch 35 Tage Wartezeit\niPhone 17: Vorstellung wohl am 9., Verkaufsstart am 19. September\nApple bleibt seiner September-Tradition offenbar treu. Auch in diesem Jahr soll die Vorstellung der neuen iPhone-Generation in der zweiten vollen Septemberwoche stattfinden. Internen Informationen aus dem Umfeld deutscher Mobilfunkanbieter zufolge fällt die Wahl in diesem Jahr auf Dienstag, den 9. September. Damit würde das nächste große Apple-Event in genau 35 Tagen über die Bühne gehen.\nNur noch 35 Tage Wartezeit\nDer Ablauf folgt dem üblichen Muster: Direkt im Anschluss an die Präsentation startet Apple am darauffolgenden Freitag die Vorbestellphase. Eine Woche später, am 19. September, beginnt dann die Auslieferung an Kunden sowie der Verkauf in Apple Stores und bei autorisierten Partnern, zunächst in den wichtigsten Märkten weltweit. Also in den USA, in China, Europa und Japan.\nMit dem iPhone 17 soll in diesem Jahr nicht nur eine neue Gerätegeneration, sondern auch ein überarbeitetes Line-up vorgestellt werden. Gerüchten zufolge verzichtet Apple auf das bisher angebotene Plus-Modell und führt stattdessen ein besonders dünnes Modell unter dem Namen iPhone 17 Air ein. Dieses soll neben dem regulären iPhone 17 und den beiden Pro-Varianten als viertes Modell erscheinen.\nSo hier? Das iPhone 17, das 17 Air, das 17 Pro und das 17 Pro Max\nOptisch wird eine überarbeitete Rückseite erwartet, ebenso wie eine neu angeordnete Kameraeinheit. Technische Details sind bislang noch nicht offiziell bestätigt, erste Leaks deuten jedoch auf subtile Designänderungen und mögliche Verbesserungen bei Display und Kamera hin.\nBegleitet von Watch und neuen AirPods Pro\nNeben den neuen iPhones dürften auch weitere Produktneuheiten präsentiert werden. Erwartet wird unter anderem die dritte Generation der AirPods Pro sowie neue Modelle der Apple Watch. In Summe dürfte Apple das Event nutzen, um mehrere Gerätefamilien gleichzeitig zu aktualisieren, allerdings werden wir uns auf die neue Generation des HomePods wohl noch bis zum kommenden Jahr gedulden müssen.\nMit den HomePods nicht so schlimm. Hauptsache das iPad Pro M5 kommt noch dieses Jahr\nWarum? Reicht dir das M4 nicht?!\nWozu die Frage? Wenn er sowieso eine Neuanschaffung plant, ist es doch vollkommen richtig, dass er dann noch die paar Tage wartet, um dann auch den neuen Chip zu bekommen anstatt jetzt für eventuell fast das gleiche Geld den alten zu kaufen.\nNein ich brauche eines mit M8 damit der 13er schlüssel passt\n;-)\nChris1982 und wenn er ein IPad M4 hat, ist die Frage nicht berechtigt?!\nIch habe kein iPad Pro. Daher meine Hoffnung.\nSehr gut! Du wirst es lieben!\nIch liebe auch meinen M5 :)\nAlso, ich glaube nicht, dass der Balken an der Kamera so breit bleibt, ohne irgendwas. Da kommt bestimmt ein kleines Display hin, wie bei anderen Smartphones (falthandys ect.)\nJa genau, träum weiter\nIch vermute, der Platz wird für die 8-fach Zoom Mechanik benötigt.\nTräum mal schön weiter\nIch glaub, nur das große „Pro Max“ bekommt die Farbe orange.\niPhone Ultra in International Orange (so haben sie damals die Akzente an der Apple Watch Ultra genannt)\nBlödsinn. Das ist nicht mal n Orange, sondern wird wie Kupfer aussehen. Das Gerücht gab es damals schon. Orange ist es nur weil es einer gesehen hat, die Farbe beschrieben hat und so weiter.\nDu kannst ja mal nachsehen, in welcher Farbe die Golden Gate Bridge gestrichen ist.\nIch hoffe echt auf neue HomePods. Will dieses Jahr einige Zimmer mit denen ausstatten, aber nicht nächstes Jahr neue kaufen müssen für Apple Intelligence\nDu willst dir basierend auf einem Versprechen (Apple Intelligence…) neue, überteuerte Apple Lautsprecher kaufen, solche, die sie in der Vergangenheit schon mal halbherzig hingefrickelt haben? Dann macht ja Apple alles richtig…zumindest aus Sicht ihrer Aktionäre.\n+1\nKlar machen die alles richtig. Schaut ihr nicht auf die Quartalszahlen? Oder könnt ihr diese nicht lesen? Warum wird das immer hier festgestellt. So langsam wie ihr seid.\nHoffe auf ein neues Apple TV ist dann mein erstes.\nWarte auch schon drauf mir einen zu zulegen. Möchte aber jetzt nicht mehr in den Alten investieren, wo doch so langsam mal nen neues Modell kommen müsste\nWas soll ein neues Modell denn mehr können?\nBessere Performance heißt längere Updates und Funktionen = auf Dauer eine bessere Investition, als in günstigere Lösungen.\nNeuer Chip bedeutet auch bessere Spiele möglicherweise\nIhr werdet auf Macrumors erwähnt :-)\nGlückwunsch zum MacRumors Shout Out!\nWir freuen uns auf das gleiche Gerät wie letztes Jahr und das Jahr zuvor :)\nAber mit noch mehr Versprechungen! Naja zumindestens bald… in Zukunft. Vielleicht. Aber erstmal nur USA. Als Beta.\nSo sieht’s aus\niPhone Spiegeln gibt’s noch immer nicht in Germany … Ich glaube an die Vorstellungsmärchen nicht mehr. Wer mehrmals in Folge nicht abliefert, verliert das Vertrauen.\nLiegt aber nicht an Apple sondern der EU.\nNa klar…..\nApple sagt es liegt an der EU – dann liegt es an der EU…..\nVielleicht mal mit dem Thema beschäftigen, dann weisst Du auch das es keinesfalls an der EU liegt.\nEs liegt nicht an der EU, erst nachlesen und nicht den Lemming machen.\nWie wär’s denn mit einem Mini\nDer Markt ist auf jeden Fall da.\nDatum kann stimmen. Aber mir fehlt so ein bisschen die Quellenangabe. „Aus dem Umfeld Mobilfunkanbieter“ ist so ähnlich wie die Cousine von der Tante und deren Mutter.\nHoffentlich ne neue Applewatch Ultra die ihrem Namen gerecht wird und nicht nur ne neue Farbe….\nUnd eigentlich kann man das nächste iPhone (abgesehen von den Farben) genauso ankündigen, wie das Letzte.\nVielleicht schafft man es ja nächstes Jahr alle Versprechen nachzuliefern.\nWenn ich zufällig zu der Zeit im Urlaub wäre, könnte ich dann trotzdem über die App das iPhone zur Abholung in Deutschland vorbestellen? Oder zieht sich die App dafür meinen Standort?\nWeiß das zufällig jemand?\nWarum sollte das nicht gehen? Du kannst in Berlin sein und es in Hamburg bestellen und abholen.\nauch dieses Jahr bleibt’s bei meinem iPhone 14 Max Pro…ich spendiere ihm mal ne neue Batterie und weiter gehts. Allen Anderen „viel Spass beim Geldausgeben“.\nstark! Schicke das am besten direkt an die Apple Distribution Mailadresse, evtl. wird dadurch nochmal alles überdacht.\n+1\nWeiß jemand wofür der optisch hervorgehobene Bereich unter den Kameras ist?\nDer ist aus Galus und geht leichter kaput als der Rest?\nDer ist aus Glas und geht leichter kaput als der Rest?\nSoll ich mir das iPhone 17 oder lieber das 16er zum günstigeren Preis kaufen, wenn es dann wieder möglichst lange halten soll (>= 8 Jahre)?\nIch habe zur Zeit noch das XS und werde mir dieses Jahr wohl das Siebziger gönnen. Dann hab ich die acht Jahre erreicht.\nWie geht das, wenn das XS im September 2018 veröffentlicht wurde?\n@Sandro: soll tatsächlich Leute geben, die iPhones gebraucht kaufen und reichlich Geld sparen ;-)\n@khw Wenn ich mir die Preise so anschaue, scheint sich das fürs iPhone 16 aktuell nicht zu lohnen. Und nach dem iPhone 8 möchte ich mal wieder ein aktuelles Gerät.\nRechne mal khw, dann kommst Du drauf\n@khw, gebraucht soll er das auch noch gekauft haben? Hat also vor 8 Jahren ein iPhone gekauft, das erst 7 Jahre auf dem Markt ist und selbst das war gebraucht? Da hat wohl jemand sehr gute Kontakte zu Apple.\nTja, früher habe ich jedes Jahr zugeschlagen, dann auf alle 2Jahre gewechselt und von 14er auf 15er wieder zum Jahrestakt zurückgekehrt, zumindest geplant gehabt. Nach dem Motto: ich gönne mir das, solange ich neu Features noch versteh und ausnutzen kann (man wird ja nicht jünger ;-) ).\nDas 16er hat mich dann aber völlig enttäuscht und bis jetzt sehe ich bei den 17er Gerüchten auch noch nichts wirklich dolles.\nIch sehe mich schon irgendwann im Altersheim sitzen, mit meinem 15er in der wackligen Hand ;-)\nMan macht halt auch nicht mehr alles mit und ob das jetzt alles ein wirklich benötigtes Feature ist i dont know. Selbst bei Apple Intelligence also das kann ja auch alles ChatGPT. Ich bin immer noch beim 12 Pro.\nChat GPT kann also Notifications zusammenfassen? Lokal auf dem Gerät? LOL\nEyh ist bisschen OT vielleicht aber gestern Leute ist meine Maus vom MacBook auf dem iPad gelandet und ich habe sie nicht mehr zurück bekommen auf mein MacBook lol\nNaja wlan und bluetooth aus aufm iPad und dann war die Maus wieder da\nSuper Story :)"
    },
    {
      "url": "https://www.cnet.com/tech/mobile/iphone-17-rumors-everything-to-know-from-a-slim-air-model-to-fresh-colors/",
      "text": "Key takeaways:\n- The iPhone 17 could feature a redesigned camera bump, though it may not be as drastic a difference as the Pro models.\n- A higher refresh rate could be coming to the full lineup, potentially enabling the baseline iPhone to have an always-on display.\n- Prices remain uncertain with tariffs, but they'll likely go up, given it's been years since Apple raised the price of the iPhone.\nThe anticipated reveal of Apple's newest iPhone is just around the corner. For months now, rumors have been swirling about what the upcoming device, likely called the iPhone 17, could look like, from a redesigned camera module to fresh colors and a higher refresh rate. The phone is expected to debut in early September, although Apple hasn't confirmed anything yet. You can also check out our rumors on the iPhone 17 Pro and the thinner iPhone 17 Air.\nPerhaps the biggest looming question is whether iPhones could get pricier, especially with tariffs. President Donald Trump has said Apple will have to pay a 25% tariff on iPhones made outside the US. This would almost certainly lead to a price hike for consumers. We'll have to wait to see how Apple responds and if shoppers really do end up shouldering that extra cost. But even without tariffs, the iPhone may be due for a markup, as it's been years since Apple raised prices on its handsets.\nHere's everything analysts and leakers predict about the baseline iPhone 17.\nSee also: Thinking About Buying a New iPhone? Here's Why You Should Wait\nCamera bump redesign\nIt's not an iPhone release without a camera upgrade, and there have been plenty of rumors about what the camera module could look like on Apple's upcoming phones. In January, a leaked image from Majin Bu on X suggested the phone could feature a pill-shaped camera bar, essentially resembling what you'd find on Google's Pixel 9 phone. In February, Bu followed up with CAD renders of what's said to be the iPhone 17 lineup, featuring horizontal camera bars, as well as larger rectangular bars on the iPhone 17 Pro models.\nIn April, Bloomberg reported the \"iPhone 17 Pro will look a lot more like the 16 Pro than anticipated,\" adding, \"From the front, the 17 Pro will appear quite similar to the 16 Pro. It's the back camera that will look meaningfully different.\" The latest rumors suggest the iPhone 17 Pro's three-lens camera arrangement will be maintained but will sit on a new panel that stretches across the phone's width and is the same color as the rest of the phone.\nLater in April, Bu again posted an image of the purported iPhone 17 lineup, showing those wider camera bars with the stacked lenses still configured to the left.\nNot until next year, for the 20th anniversary of the iPhone, will Apple be \"preparing a major shake-up\" for the phone's design, Bloomberg says. That includes a (long-rumored) foldable version and a \"bold new Pro model that makes more extensive use of glass.\"\nAnother camera-related rumor is that the selfie camera on all iPhone 17 models will be upgraded to 24 megapixels, according to analyst Jeff Pu. That's a decent bump from the current 12-megapixel front-facing camera on the iPhone 16 lineup, although it's important to remember that more megapixels don't automatically mean better photos. Still, given how much people increasingly rely on their front cameras to snap selfies and record videos for TikTok and Instagram, this surely will be a welcome advancement.\niPhone 17 display upgrade\nRumor has it that all models of the iPhone 17 will feature a 120Hz display, bumping the non-Pro models up from their current 60Hz refresh rate. That could be a welcome change, as the discrepancy between the Pro and non-Pro refresh rate is surprising; when Apple debuted the iPhone 16 and 16 Plus with a 60Hz display, there was a bit of an outcry from folks who expected more in 2024. This rumored update could remedy that -- and possibly bring the always-on display to the baseline model.\nThere's been a lot of back-and-forth about whether the latest iPhones will have a scratch-resistant, anti-reflective display. A July report from MacRumors suggests that feature will in fact be arriving on the iPhone 17 Pro and Pro Max, just not the baseline iPhone 17 or the Air. This would make the Pro models the first iPhones with an anti-reflective screen, giving them a feature that CNET's Patrick Holland deemed one of the best attributes of the Samsung Galaxy S25 Ultra.\nThere also have been contradictory reports on whether the Dynamic Island on the iPhone 17 lineup will look any different. In May, Pu said all iPhone 17 models will use a new metalens technology for the proximity sensor, which could allow Apple to reduce the size of the Face ID sensor and the Dynamic Island, according to 9to5Mac. Analyst Ming-Chi Kuo, on the other hand, said in January that the Dynamic Island would remain \"largely unchanged\" in the iPhone 17 lineup compared to the iPhone 16. We'll have to see what ends up being true.\nRumors on what frames the iPhone 17 lineup will feature have gone back and forth. In February, Pu suggested the iPhone 17, iPhone 17 Pro and iPhone 17 Pro Max will all have aluminum frames. He noted that the iPhone 17 Air could be the outlier with a titanium frame.\nNew chipset\nIn May, Pu noted the iPhone 17 would have the same A18 chip used in the iPhone 16, while the iPhone 17 Air and Pro models will feature an A19 chip. It's possible the phones could also include the Apple-developed 5G modem, called the C1 chip, which debuted on the iPhone 16E.\nIn February, Kuo noted Apple will swap out Broadcom's Wi-Fi chips for in-house chips across the iPhone 17 lineup, stating this would \"enhance connectivity across Apple devices.\" It's not yet clear what exactly this would mean, but it would be interesting if Apple's C1 chip was also accompanied by its own Wi-Fi chip.\niPhone 17 battery\nSo far, rumors suggest only the pricer iPhone 17 Pro Max could get a bigger battery, according to Ice Universe. The leaker says the top-of-the-line phone could go from 8.25mm on the iPhone 16 Pro Max to 8.725mm on the iPhone 17 Pro Max as a result. In addition, leaker Instant Digital suggests the high-end phone could have about a 5,000 mAh battery, a notable increase over the 4,685 mAh on the iPhone 16 Pro Max, according to third-party tests.\nBut that doesn't mean the baseline version won't get any boost. Even if battery capacity stays the same (which it may not), the AI-powered Adaptive Power feature arriving with iOS 26 can help extend battery life. The feature automatically adjusts your iPhone's performance based on how you're using it at the moment, according to Apple. This could especially be helpful with the slimmer iPhone 17 Air, which will likely also have a thinner battery.\niOS 26 brings a fresh look\nApple has revamped its mobile operating system with iOS 26 (not iOS 19), which is named after the last two digits of the upcoming year. And with iPadOS, MacOS, WatchOS, TVOS and VisionOS following the same naming convention, the move is designed to bring more uniformity -- naming-wise and appearance-wise -- across the operating systems.\nThe new Liquid Glass interface brings a more transparent, lens-like look to the iPhone and other Apple devices. With iOS 26, the Camera app also adopts a more minimalistic design and Photos once again makes it easier to find your albums by adding separate tabs for your Library and Collections, instead of forcing you to scroll through a single cluttered screen. Updates to Messages include being able to add backgrounds to chat windows and create polls in group chats, and a new screening tool can better detect spam texts and move messages from unknown senders to a dedicated folder. You can read more about iOS 26 features here.\nIn April, tipster Digital Chat Station noted that given the use of Apple Intelligence and AI on a \"large scale,\" the iPhone 17 lineup will come with 12GB of RAM, instead of the current 8GB. Kuo noted the iPhone 17 Air and Pro models would sport that increased 12GB of RAM, but that Apple was still deciding whether to equip the baseline model with 8GB or 12GB of RAM. In May, Pu noted the baseline would remain at 8GB.\nPrice and release date\nWe expect the iPhone 17 to become available in September although it's not yet clear exactly when, as Apple hasn't confirmed anything.\nHistorically, Apple has unveiled its new iPhones on the first Tuesday of September after Labor Day. However, the first Tuesday in 2025 is the day after Labor Day so it's possible Apple could either push its iPhone event to Wednesday, Sept. 3, or hold it the following week on Tuesday, Sept. 9.\nThat would mean the phones could then become available on either Sept. 12 or 19. Preorders would kick off a week before general availability, on either Sept. 5 or 12.\nBloomberg's Mark Gurman has said that the new iPhone announcement should come Sept. 9 or 10.\nPrice is also a big unknown. Jefferies analyst Edison Lee has said the iPhone 17 Air, 17 Pro and 17 Pro Max will get a $50 price increase to offset tariffs and the higher cost of components, but didn't mention the baseline iPhone 17. If that's true, the starting prices for the full lineup could be:\n- iPhone 17: $829\n- iPhone 17 Air: $979\n- iPhone 17 Pro: $1,049\n- iPhone 17 Pro Max: $1,249\nRegardless of higher component costs or tariffs, the iPhone is overdue for a price increase, because the last price hike was five years ago.\nThe latest rumors suggest the iPhone 17 could be available in black, blue, silver, purple and green.\nWe'll continue to update this piece as more rumors surface so be sure to follow along."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/iphone-17-colors-a-surprising-hue-could-be-coming-for-pro-models/",
      "text": "The rumored iPhone 17 color lineup includes a shocking twist for the iPhone 17 Pro models.\nLast week, a Korean blogger named yeux1122 published two images of camera covers that could be the full lineup from iPhone 17 base model and the rumored iPhone 17 Air, and leaker Majin Bu posted that the rumored Sky Blue color would be scrapped for the Pro models. And now, another leaker has posted this week the possible color lineup for the iPhone 17 Pro and Pro Max. We'll get to the surprise in that photo below.\nWe've already heard plenty of rumors that the iPhone 17 base model could come in purple, green and blue. Two to three other familiar colors are now said to be included in the options -- totaling five (or maybe six) possibilities for the base model. The rumored iPhone 17 Air could come in four, while the Pro and Pro Max are expected to have five.\nThe rumored iPhone 17 is likely to drop in September. As the month draws closer, we're hearing plenty of rumors and leaks, but we're still playing the guessing game. Here's what we're hearing about possible iPhone 17 colors.\nThe rumored full color lineup\nHere's the full lineup for the rumored iPhone 17 base and Air models, according to Sonny Dickson, a consumer tech reviewer, who shared an image on X on Monday:\nThe iPhone 17 base model could come in these colors:\n- Black\n- Gray\n- Silver\n- Light blue\n- Light green\n- Light purple\nThe iPhone 17 Air could be released in these colors:\n- Black\n- Blue gray\n- Light gold\n- Silver\nThe iPhone 17 Pro and Pro Max could come in these colors:\n- Black\n- Gray\n- Silver\n- Dark blue\n- Orange\nYeux1122 has a similar lineup in their post, but the base options don't include gray.\nBlack and silver aren't surprising since we've seen both neutral colors in earlier iPhone models and generations. However, if you use a colored phone cover instead, like I do, this possibility could be welcome.\nThe iPhone color I didn't see coming\nPurple, blue and green are all part of the same color palette. The neutral colors don't quite surprise me since they're standard for iPhones at this point. But the color orange is shocking. Dickson expects that the color will only be for the Pro and Pro Max models.\nDickson also noted the orange shade may end up being a dark gold or copper.\nSky blue could be old to Apple, but a new iPhone hue\nThe early rumored color for the iPhone 17 was sky blue.\nWell-known leaker Majin Bu posted the rumor of the new color on their blog, calling it \"a refined, bright, and modern shade.\" But why sky blue?\nPerhaps because the latest M4 MacBook Air currently comes in sky blue, an iPhone in the same color could be an aesthetic win for sky blue MacBook owners.\nBu initially wrote that the sky blue color could be for the iPhone 17 Pro, but recently scrapped that rumor to say sky blue would be for the iPhone 17 Air.\nIt seems like there's a possibility for different shades of blue, as we see in the lineup above. Rumor has it that there could be a blue option for the iPhone 17 base model and a dark blue for the iPhone 17 Pro. But based on Bu's post, there's a possibility of the iPhone 17 Air getting a sky blue hue. We'll have to wait and see which -- if any -- blues will be available for iPhone 17.\nThe possibility of purple\nBu posted on X and their blog on June 20 that Apple is testing purple and green, but that purple could be another new color for the iPhone 17's base models.\nBu said that purple could meet Apple's rumored demand for more personalization while blending into Apple's ecosystem for its other products.\nIf green is added to the iPhone 17 lineup, Bu says it could be a \"fresh and natural tone, ideal for a minimalist yet striking aesthetic.\" Yeux1122 and Dickinson included both purple and green in their rumored lineups this month.\nCould an aluminum iPhone design bring more colors?\nThe iPhone 16 Pro and Pro Max have a titanium frame, but analyst Jeff Pu predicted that the iPhone 17 could usher in the return of the aluminum frame for both the Pro and baseline models, as we've seen with earlier versions like the iPhone 14 lineup. Considering the iPhone 16 Pro and Pro Max's colors are based on titanium, it raises the question: Will an aluminum frame mean new colors?\nThe one phone in the iPhone 17 lineup that could have a titanium frame is the rumored slimmer iPhone 17 Air, according to Pu. We'll have to wait and see what Apple decides.\nRead more: WWDC Bored Me. I Need Apple's iPhone 17 Launch to Make a Splash\nA look at past iPhone colors\nApple likes to release both new and familiar colors for every new iPhone release.\nUsually, we see more color variations for the basic models, and more neutral colors for the Pro and Pro Max iPhone models. For instance:\nThe iPhone 14 came in six colors: midnight, starlight, red, blue, purple and yellow. However, the iPhone 14 Pro and Pro Max models only came in black, silver gold and deep purple. The same is true for the 15 model phones, but Apple offered one fewer color for its base model.\niPhone 15 models were available in pink, yellow, green, blue and black, while Pro and Pro Max models arrived in more neutral tones like white, blue, black and natural titanium.\nThe iPhone 16 Pro and Pro Max colors didn't change from the iPhone 15 Pro and Pro Max. However, the other iPhone 16 models were available in ultramarine, teal, pink, white and black.\nHow many new colors we may see from the rumored iPhone 17 is still unclear, but as of now, a sky blue option could well be in your future."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/is-the-iphone-17-pro-going-to-be-big-and-orange-we-rounded-up-the-rumors/",
      "text": "Key takeaways:\n- New iPhone 17 Pro rumors include camera upgrades, including an additional control button and a telephoto lens with up to 8x optical zoom.\n- The Pro is rumored to be getting a scratch-resistant antireflective display.\n- The new iPhone is expected to be released in early September.\nWe're about six weeks away from seeing the new iPhone, and the latest whispers about the iPhone 17 Pro have the rumor mill working overtime.\nIn fact, there was a whole slew of rumors about the iPhone 17 Pro camera leaked over the weekend -- including a possible movable telephoto lens -- by an anonymous tipster who reached out to MacRumors. While we can't confirm any of the rumors independently, MacRumors has a good track record. We'll zoom in on the details in a bit.\nAlthough speculation about an ultrathin iPhone 17 Air has hogged the spotlight, the Pro models tend to include more upgraded features. In addition to the camera, the Pro could get a surprising new color and the much-coveted scratch-resistant, antireflective display. But with looming tariffs still threatening to hike the price, there's a lot to watch for with the rumored iPhone 17.\nThere's even a rumored video of the iPhone 17 Pro posted from the X account @skyfops, although there's no confirmation this was in fact the actual iPhone 17 Pro or perhaps a dummy model:\nApple hasn't announced anything or confirmed any rumors, and we likely won't find out for sure until the next iPhone officially comes out. Until then, we're tracking all the biggest leaks and rumors about the iPhone 17 Pro and sharing what we've heard so far.\nRead more: I May Upgrade to the iPhone 17 Pro Max If These 6 Rumors Are True\niPhone 17 Pro's rumored camera bump redesign and movable telephoto lens\nThe iPhone 17 Pro's camera has been the subject of multiple rumored changes, but recent ones come from an anonymous tipster.\nMacRumors says a tipster who claimed to be familiar with an iPhone Pro commercial revealed features that included a telephoto lens -- upgraded to 8x optical zoom from 5x on the iPhone 16 Pro -- that can apparently move. A moving lens could allow continuous optical zoom at various focal lengths, according to MacRumors.\nCNET Managing Editor Patrick Holland, who's been reviewing phones for CNET since 2016, noted that Sony, which for years made the sensors for the iPhone, had a couple of phones with a variable zoom lens that worked like an actual camera zoom lens. While Apple may not use the exact same technology as Sony's, Holland notes, it could adapt some of it for the iPhone 17 Pro.\nMacRumors also reported the iPhone 17 Pro could have an additional Camera Control button, which would be in addition to the bottom-right edge camera button the iPhone 16 models sport, as well as a new camera and video app.\nIn January, Bu posted a leaked image on X suggesting that the phone could feature a pill-shaped camera bar that looks a lot like the camera bar on Google's Pixel 9 phone.\nThat raised the question of whether the iPhone 17 Pro would align the three camera lenses in a single row or leave them stacked in a pyramid design, as it did with the iPhone 16 Pro.\nIn February, Bu posted CAD renders of what could be the iPhone 17 lineup, and Front Page Tech also shared iPhone 17 Pro renders in this video on YouTube (Apple filed a lawsuit against YouTuber Jon Prosser, featured in this video, over leaks about the iOS26):\nBoth showed horizontal camera bars for the iPhone 17 Pro models that keep the stacked lens layout.\nPu wrote in March that the iPhone 17 Pro and Pro Max will feature a 48-megapixel telephoto rear camera, up from 12 megapixels on the iPhone 16 Pro models. That would mean all three cameras on the iPhone 17 Pro models -- wide-angle, ultrawide and telephoto -- would be 48 megapixels.\nAnd as for your selfies, analyst Jeff Pu reports that the front-facing camera will be upgraded from 12 megapixels on the iPhone 16 to 24 megapixels on all iPhone 17 models.\nFront Page Tech reported in April that the iPhone 17 Pro and iPhone 17 Pro Max may also add a built-in video feature that allows you to record with the front and rear cameras simultaneously. The feature would let you overlay a shot of your face over an outward-facing video. A video upgrade from the already stellar iPhone 16 Pro could add some serious value for video creators considering the iPhone 17 Pro.\nRead more: Apple, Please Don't Let AI Ruin the iPhone 17's Camera\nPro displays could get an antireflective upgrade\nOn July 16, MacRumors cited a \"reliable source\" in reporting that the Pro and Pro Max could get a scratch-resistant antireflective display, reversing itself on previous reports that Apple had to scrap plans due to scaling issues. If the latest rumor proves true, the upgrade from Apple's Ceramic Shield display could prove an enticing feature for the Pro and Pro Max.\nHolland called the antireflective display one of the best attributes of the Samsung Galaxy S25 Ultra.\nApple Insider reported in May that the iPhone 17 could get a larger display than the iPhone 16. DSCC founder and Counterpoint Research VP Ross Young posted on X that the base iPhone 17 will be 6.3 inches, an upgrade from the iPhone 16's 6.1-inch display. In theory, that means the iPhone 17 would have the same screen size as the iPhone 17 Pro.\nThe iPhone 17 Pro and Pro Max are rumored to continue with a 6.3-inch and 6.9-inch display, respectively, similar to the iPhone 16 Pro Max.\nRumored design changes for the iPhone 17 Pro and Pro Max\nThe latest rumors about the iPhone 17 Pro and Pro Max design include colorful developments and a new frame composition.\nOrange among the Pro color lineup\nRumors of a new color for the iPhone started in April, when Twitter user and leaker Majin Bu (not the Dragon Ball Z character) posted that the iPhone 17 Pro and Pro Max could get a sky blue option.\nBut on July 14, Bu posted that Apple is ditching sky blue for the Pro Models, with only the rumored iPhone Air claiming the hue. Then on July 29, Bu posted a video on X of Pro mockups in four colors:\n- black\n- silver\n- dark blue\n- orange\nDigital blogger Weibo said that one of the colors is \"related to the liquid glass design of iOS 26,\" saying it would be white but with different visual effects depending on which light it was in.\nFor reference, the iPhone 16 and Plus made a splash last year when they debuted pink, teal and ultramarine color options, alongside the standard white and black. The iPhone 16 Pro and Pro Max introduced a new color, desert titanium -- a restrained shade of peach -- alongside the classic natural titanium, white titanium and black titanium options.\nThe Pro models have traditionally featured more muted colors, so the prospect of an orange or glass-inspired color could offer an exciting new look for the Pro.\nApple logo moving lower\nThe Apple logo on the back of the phone may be moving lower on the Pro models, as shown in a Bu post on X of an iPhone 17 mockup:\nThe change in location is reportedly coming to make room for the larger camera bump design.\nImproved audio quality\nOn June 2, wccftech, said the iPhone 17 Pro and Pro Max would get longer earpieces, citing a post on X from @duanrui1205. In theory, that could signal improved audio clarity. At the Worldwide Developers Conference later in June, Apple said audio quality will improve with software updates in AirPods with H2 chipsets. CNET got to learn firsthand how Apple tests, calibrates and tunes the audio (and video) on an iPhone. Additional improvements in audio quality could potentially elevate an already impressive feature.\nMore RAM for iPhone 17 lineup\nApple Intelligence and AI are likely to play more prominent roles with the iPhone 17. To support the new features, all the iPhone 17 models will step up to 12GB of RAM, tipster Digital Chat Station reported in April. Kuo said the iPhone 17 Air and Pro models would get that increased 12GB of RAM, but not the base model.\nConsidering that the iPhone 16 lineup had 8GB of RAM across all models, this could be a big upgrade for the iPhone 17.\nAluminum frames for all, except Air\nThere's been plenty of discussion about whether the iPhone 17 Pro will ditch its titanium alloy frame for an aluminum one. In February, MacRumors said Pu predicted that the iPhone 17, iPhone 17 Pro and iPhone 17 Pro Max will have all-aluminum frames or potentially part glass, part aluminum for better durability. The iPhone 17 Air would stick with Apple's current titanium frame -- or possibly a mix of titanium and aluminum.\nDynamic Island size in question\nPu predicted in May that all iPhone 17 models will use a new metalens technology for the proximity sensor, which could result in a smaller Face ID sensor and Dynamic Island, according to a report by 9to5Mac. However, Pu's report contradicts Kuo, who said that the iPhone 17's Dynamic Island would remain \"largely unchanged\" compared with the iPhone 16.\nDimensions\nAccording to a report by 9to5Mac in May, the iPhone 17 Pro line may be thicker, 8.725mm, compared with the iPhone 16 Pro, which clocks in at 8.25mm thick. That larger size could potentially make room for more battery.\nIn a post on X on July 11, Majin Bu showed a video of a case for a thicker iPhone 17 Pro model, with the design likely based on the iPhone 17 Pro's rumored dimensions:\nNew A19 Pro chip could improve performance\nThere's been some back and forth about the chip for the rest of the iPhone 17 lineup, but rumors have consistently given the iPhone 17 Pro and Pro Max the A19 Pro chip.\nMore recently, MacRumors reported that a Weibo account known as Fixed Focus Digital said the iPhone 17 Air will also come with an A19 Pro chip, like the Pro models. But the Air would have a 5-core GPU, according to the rumor, whereas the iPhone 17 Pro and Pro Max would get a 6-core GPU. An upgraded GPU could improve graphics and video rendering.\nBattery life could get a big boost\nWhat good is a new phone if it doesn't last all day, right? The iPhone 17 Pro Max will get the biggest ever battery in an iPhone, the Weibo leaker known as Instant Digital said in a post on X, as reported by MacRumors. However, the site noted Instant Digital's spotty record with Apple rumors. If the Pro's dimensions are identical to the Pro Max's, as they're rumored to be, it stands to reason that the Pro could get the bigger battery, too.\nAnd Majin Bu posted on July 3 that the iPhone 17 Pro and Pro Max will feature a vapor chamber cooling system, which could help prevent the bigger battery from overheating.\niPhone 17 Pro release date expected in September\nIn the past several years, Apple has consistently announced its new phones on the first Tuesday of September after Labor Day. However, the first Tuesday is the day after Labor Day in 2025, so that could push the date for the iPhone event to Wednesday, Sept. 3 or Tuesday, Sept. 9. That would mean a release date of Sept. 12 or 19.\nThis likely will be the case with the full iPhone 17 lineup, with the exception of the iPhone 17E, which could arrive in early 2026, according to Apple analyst Ming-Chi Kuo and a report from The Information.\nThe iPhone 17 lineup may be the last to follow this fall-release model. Starting with the iPhone 18, Apple will reportedly split its phone releases so that lower-cost iPhones launch in the first half of the year and the higher-end Pro models become available later in the year. But that isn't expected to happen until 2026 so you can likely still expect the iPhone 17 Pro to become available this fall.\nPreorders for a new iPhone typically begin the Friday after the announcement, with the phone shipping a week later. Based on the expected announcement on Sept. 3 or 9, the preorder date could be either Sept. 5 or 12.\nTariffs could raise the price, but there are other factors\nTrump has raised, lowered and paused tariffs a dizzying number of times since February, all of which could affect the cost of the iPhone 17 Pro.\nApple, which says it could move much of US iPhone production from China to India, has escaped many of the tariff hikes thanks to a reciprocal tariff exemption list that includes many phones, laptops and other electronics that Apple produces.\nHowever, all the reprieves appear to be temporary so reciprocal tariffs could still affect prices by the time the iPhone 17 is released.\nTrump threatened Apple with a 25% tariff on all iPhones made outside the country in a social media post on May 23. Later that day, he said that all smartphones -- not just iPhones -- would be hit with the 25% tariff by the end of June if they don't move operations to the US.\nRegardless of how tariffs play out, Apple plans to raise iPhone prices later this year, The Wall Street Journal reported. Apple apparently plans to ascribe the price increase to better features and design costs so it can avoid pointing the finger at tariffs and incurring the wrath of Trump (like Amazon temporarily did).\nHolland points out that the iPhone is overdue for a price bump. He noted that Apple has never increased the price for an iPhone Pro ($999) since the iPhone X was first introduced in 2017.\nSo yes, you should expect to pay more for the iPhone 17, regardless of tariffs.\nRead more: Thinking About Buying a New iPhone? Here's Why You Should Wait\nAre new iPhone rumors and leaks to be trusted?\nHere's the part where I come in and say: Everything's a rumor until Apple officially releases the next iPhone. Rumors and speculation leading up to the iPhone's release are often based on insider knowledge or leaked information from teams working on the iPhone's designs, but those designs are works in progress -- not necessarily the final product."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/the-folding-iphone-is-getting-real-and-might-use-samsung-parts/",
      "text": "This may be the final year without a folding iPhone. New reports this week suggest that Apple will launch the long-rumored folding iPhone in 2026. The latest buzz suggests that Apple is working with Samsung Display to help make the crease-free screen for the folding iPhone.\nIt's no secret that Apple has been tinkering with bendable screen designs for years. The company has filed various patents about screens that fold, scroll and even self-heal from scratches. Last year, Bloomberg reported that Apple was exploring a folding iPad, and analysts have been predicting Apple would make a folding iPhone since 2021.\nBut the rumors are looking more likely now as the buzz picks up, this time from a Korean news outlet and a forecast from an often-accurate Apple analyst, both pointing to Samsung Display as the company working with Apple to produce the screen tech for the folding iPhone.\nFor this week's episode of One More Thing, which you can watch embedded above, I go through some of the latest rumors to paint a picture of what this fabled phone could look like -- and don't expect it to come cheap. It is predicted to cost between $2,000 and $2,500.\nSome of the work to make the folding iPhone may be coming from another new design: the rumored ultra-thin iPhone 17 and its thin battery is the kind of tech that helps make a thin book-style folding iPhone a reality.\nIf you're looking for more One More Thing, subscribe to our YouTube page to catch Bridget Carey breaking down the latest Apple news and issues every Friday."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/apple-is-moving-away-from-its-fall-only-iphone-launch-schedule-report-says/",
      "text": "Apple has consistently released a new iPhone each fall since the launch of the iPhone 4S a decade and a half ago. But it appears the company may be shifting its release strategy in the coming years.\nAccording to Apple analyst Ming-Chi Kuo, along with a report from The Information, Apple plans to launch its lower-cost iPhones in the first half of the year and reserve its higher-end Pro models for later in the year. Kuo noted online that the next iPhone 17 lineup will launch as expected this fall, but future iterations, including the iPhone 18 and iPhone 19, will debut in two waves through 2027.\nApple will launch its more affordable iPhones in the early months of the year, likely in March or April, with Pro models arriving in the fall. This means you'll see different versions of the iPhone 18 and iPhone 19 released in both halves of the same year, Kuo said.\nFor example, the base-level iPhone 18 and iPhone 18E will likely hit in the spring, while the iPhone 18 Pro, Pro Max, iPhone 18 \"Air\" (or \"Slim\") and Apple's first foldable model would launch in the fall. Apple did not immediately respond to a request for comment.\nThe iPhone maker has announced new phones outside its typical September window. The lower-end iPhone 16E, for instance, debuted in February. But it was following on from the main iPhone 16 launch five months earlier with the higher-end models. The change that Kuo describes would rejigger that order, putting all of a new lineups releases in the same calendar year.\nThe speculation is that this change in strategy would allow Apple to optimize manufacturing and marketing efforts, particularly in China, a key market for the company. Also, leading rival Samsung announces its new Galaxy phones in January.\n\"Competitors typically release new models in [the first half of the year],\" Kuo wrote. \"By launching new iPhones in [the first half, Apple could close the marketing gap.\" He added: \"Due to intense competition, Apple needs to offer more iPhone models. Launching them all in (the second half) risks diluting marketing efforts.\" Kuo also said the growing shipment ratio of the Pro series is overshadowing budget models.\nIn the near term, Apple is expected to launch a much thinner iPhone this year, potentially named the iPhone 17 Air or iPhone 17 Slim. The 6.6-inch device is rumored to be just 5.5 millimeters thin and priced between $900 and $1,000. At the same time, Kuo noted that Apple is also developing a next-generation version with a larger screen, expected to arrive in the latter half of 2027."
    }
  ],
  "argos_summary": "The upcoming iPhone 17 lineup is expected to be announced on September 9, 2025, with preorders starting on September 12 and a release date of September 19. Rumors suggest significant upgrades, including a 120Hz display for all models, a redesigned camera system with improved optical zoom capabilities, and potential price increases due to tariffs and component costs. The lineup may include the standard iPhone 17, a new iPhone 17 Air, and Pro models, with various color options and features aimed at enhancing user experience.",
  "argos_id": "TZ5DRD5TK"
}