{
  "url": "https://www.barrons.com/market-data/stocks/pfe/interactive-chart?amp%253Bmod=stock_picks_lp&amp%25253Biso=xnys&amp%2525253Biso=xnys&amp%252525253Biso=xnys&amp%25252525253Biso=xnys&amp%25253Bmod=stock_picks_lp&amp%2525252525253Biso=xnys&mod=quotes&amp%2525253Bmod=stock_picks_lp&amp%252525252525253Biso=xnys",
  "authorsByline": "",
  "articleId": "fe8e55132f47449e81afbba422969fff",
  "source": {
    "domain": "barrons.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.barrons.com/asset/barrons/images/Barrons-Logo-Block-Color.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:19:21+00:00",
  "addDate": "2025-08-15T00:17:40.851682+00:00",
  "refreshDate": "2025-08-15T00:17:40.851685+00:00",
  "score": 1.0,
  "title": "Pfizer Inc. Advanced Charts",
  "description": "Pfizer Inc. advanced stock charts by Barron's. View PFE historical stock data and compare to other stocks, and exchanges.",
  "content": "Stocks: Real-time U.S. stock quotes reflect trades reported through Nasdaq only; comprehensive quotes and volume reflect trading in all markets and are delayed at least 15 minutes. International stock quotes are delayed as per exchange requirements. Fundamental company data and analyst estimates provided by FactSet. Copyright 2019© FactSet Research Systems Inc. All rights reserved. Source: FactSet\n\nIndexes: Index quotes may be real-time or delayed as per exchange requirements; refer to time stamps for information on any delays. Source: FactSet\n\nMarkets Diary: Data on U.S. Overview page represent trading in all U.S. markets and updates until 8 p.m. See Closing Diaries table for 4 p.m. closing data. Sources: FactSet, Dow Jones\n\nStock Movers: Gainers, decliners and most actives market activity tables are a combination of NYSE, Nasdaq, NYSE American and NYSE Arca listings. Sources: FactSet, Dow Jones\n\nETF Movers: Includes ETFs & ETNs with volume of at least 50,000. Sources: FactSet, Dow Jones\n\nCommodities & Futures: Futures prices are delayed at least 10 minutes as per exchange requirements. Change value during the period between open outcry settle and the commencement of the next day's trading is calculated as the difference between the last trade and the prior day's settle. Change value during other periods is calculated as the difference between the last trade and the most recent settle. Source: FactSet\n\nData are provided 'as is' for informational purposes only and are not intended for trading purposes. FactSet (a) does not make any express or implied warranties of any kind regarding the data, including, without limitation, any warranty of merchantability or fitness for a particular purpose or use; and (b) shall not be liable for any errors, incompleteness, interruption or delay, action taken in reliance on any data, or for any damages resulting therefrom. Data may be intentionally delayed pursuant to supplier requirements.\n\nMutual Funds & ETFs: All of the mutual fund and ETF information contained in this display, with the exception of the current price and price history, was supplied by Lipper, A Refinitiv Company, subject to the following: Copyright 2019© Refinitiv. All rights reserved. Any copying, republication or redistribution of Lipper content, including by caching, framing or similar means, is expressly prohibited without the prior written consent of Lipper. Lipper shall not be liable for any errors or delays in the content, or for any actions taken in reliance thereon.\n\nCryptocurrencies: Cryptocurrency quotes are updated in real-time. Sources: CoinDesk (Bitcoin), Kraken (all other cryptocurrencies)\n\nCalendars and Economy: 'Actual' numbers are added to the table after economic reports are released. Source: Kantar Media",
  "medium": "Article",
  "links": [
    "http://online.barrons.com/mdc/public/page/2_3021-tradingdiary2.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "most actives market activity tables",
      "weight": 0.0797416
    },
    {
      "name": "Dow Jones",
      "weight": 0.07461604
    },
    {
      "name": "Data",
      "weight": 0.07430112
    },
    {
      "name": "Fundamental company data",
      "weight": 0.074257165
    },
    {
      "name": "trading purposes",
      "weight": 0.072868615
    },
    {
      "name": "Lipper content",
      "weight": 0.07227666
    },
    {
      "name": "FactSet",
      "weight": 0.071058095
    },
    {
      "name": "Closing Diaries table",
      "weight": 0.07009854
    },
    {
      "name": "International stock quotes",
      "weight": 0.06848623
    },
    {
      "name": "Pfizer Inc. Advanced Charts",
      "weight": 0.06730454
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.98095703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.966796875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.8203125
    }
  ],
  "sentiment": {
    "positive": 0.08123538,
    "negative": 0.3344174,
    "neutral": 0.5843472
  },
  "summary": "Real-time U.S. stock quotes are based on trades reported through Nasdaq and are delayed at least 15 minutes for international stock quotes. Index quotes may be real-time or delayed as per exchange requirements. Stocks, indices, and currencies are included in the Markets Diary, which represents all U.N. markets and updates until 8 p.m. The data is provided for informational purposes only, not intended for trading purposes. All mutual fund andETF information provided by FactSet was provided without the prior written consent of Lipper, a Refinitiv Company, subject to various restrictions.",
  "shortSummary": "The following in-depth analysis of real-time U.S stock quotes and volume from Nasdaq, with delays and uncertainties affecting trading conditions across markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "97e90163a30949f8a251df1bea07d4d5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article provides information on U.S. stock quotes, indexes, market activity, commodities, futures, mutual funds, ETFs, and cryptocurrencies, highlighting that data may be delayed and is intended for informational purposes only. It notes that stock and index quotes may reflect trades from various exchanges and are subject to specific delays. Additionally, it emphasizes that FactSet and Lipper do not guarantee the accuracy of the data and are not liable for any errors or reliance on the information.",
  "argos_id": "U5LGQ7RF2"
}