{
  "url": "https://www.usatoday.com/story/nletter/2025/08/14/taylor-swift-trump-putin-summit-forever-chemicals-thursdays-news/85665228007/",
  "authorsByline": "Rebecca Morin",
  "articleId": "d699b4861daf41ed8680ad4caeb5e437",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/13/USAT/85651322007-1-front-image-only.jpg?crop=5993,3373,x0,y248&width=3200&height=1802&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:02:03+00:00",
  "addDate": "2025-08-14T22:26:04.994146+00:00",
  "refreshDate": "2025-08-14T22:26:04.994149+00:00",
  "score": 1.0,
  "title": "The podcast that broke the internet",
  "description": "What to know about Taylor Swift’s new era, \"The Life of a Showgirl.\" It's Thursday's news.",
  "content": "What to know about Taylor Swift’s new era. President Donald Trump raises the stakes in his meeting with Russia’s leader. And more towns are finding cancer-causing chemicals in their water systems.\n\n👋 Hello!Rebecca Morin here. The vibes for Thursday: sunny, warm and newsy.\n\nBut first: A centuries-old helmet on another planet? 🌎 Nope, it’s just a rock on the surface of Mars that looks to have a pointed peak and a flared \"brim.\"\n\nFrom a broken heart to one fully restored, Taylor Swift’s upcoming era, \"The Life of a Showgirl,” will be fun, pop and upbeat − at least according to Travis Kelce, the mega-popstar’s boyfriend. Swift made her highly anticipated debut as a guest on Kelce's \"New Heights\" podcast Wednesday. As the episode began, the singer's website updated with an album cover of her submerged in bathwater in a bedazzled corset, along with an Oct. 3 release date for her new 12-track album.\n\nWhen was the album made? Swift wrote, sang and produced \"Showgirl\" during the European leg of the Eras Tour, flying to Sweden to record. The album was produced by Swedish producers Max Martin and Shellback, along with Swift. The artwork represents the end of her nights on tour. 🎶 Highlights from Swift’s interview.\n• Taylor Swift's 'Life of a Showgirl' showcases new era with provocative album art\n• What is a showgirl? Explaining Taylor Swift's new album aesthetic\n• Taylor Swift announces track list for 'The Life of a Showgirl'\n\nIt’s like a game of chess. At least that’s how President Donald Trump is describing his high-stakes, one-on-one meeting Friday with Russian President Vladimir Putin in Alaska. In an interview with Fox News Radio on Thursday, Trump said he hopes the meeting with Russia’s leader will lead to a second meeting with Putin and Ukrainian President Volodymyr Zelenskyy where the two sides can hammer out details for a peace deal. Trump will meet with Putin at Joint Base Elmendorf-Richardson in Anchorage. 👉 Trump said there’s a “25% chance” the meeting could fail to advance peace talks.\n\nUkraine's defense: Zelenskyy visited London on Thursday – one day before the Trump-Putin summit – to shore up European support for efforts to prevent any agreement that would carve up Ukraine. 👉 Trump has said a deal could include what he called a land swap.\n• Can Trump get a Ukraine peace deal with Putin? Here's what's at stake.\n• How many American presidents has Putin met with? What to know.\n• How a 'Shark Tank' star landed a role in Timothée Chalamet's new movie.\n• 25-cent wine samples at Olive Garden? Yes, the rumors are true.\n• Walmart employees now get 10% off most items after a discount expansion.\n• 50-year-old Leonardo DiCaprio says he feels like he's 32. Then he was mocked online.\n\nJust not the Biden and Trump you might be thinking of. First lady Melania Trump threatened Aug. 6 to sue Hunter Biden, the son of former President Joe Biden, for more than $1 billion if he doesn’t retract the claim that she was introduced to her husband by convicted sex offender Jeffrey Epstein. Hunter Biden said Thursday that he had read the account in newspaper articles dating back to 2019. When asked during an interview whether he would like to apologize to the first lady for his comments, he said: “F--- that. That’s not going to happen.” 👉 What to know about Melania Trump’s proposed legal action.\n• Ivanka Trump could return to the White House for an unusual reason\n\nMore towns have “forever chemicals” in their water systems, according to new data from the Environmental Protection Agency. A USA TODAY analysis of new test results the EPA released last week shows 839 water systems had yearly averages exceeding EPA limits for two types of forever chemicals. The latest data release showed some smaller communities had reported the most eye-popping concentrations in their drinking water. For example, in Nashville, North Carolina, a town of 6,000 east of Raleigh, the average of two samples taken last fall and this March was 86 times over the limit.\n\n‘Forever chemicals’ risks: The chemicals, PFAS, or per- and polyfluoroalkyl substances, increase the risk of certain types of cancer and other health problems. 👉 See which cities have “forever chemicals.”\n• 📺 Get a new TV before football season. Shop early Labor Day sales.\n• 📱 How to mark your texts as unread.\n\nRebecca Morin is a newsletter writer at USA TODAY. Got thoughts or feedback? Reach out to her atrdmorin@usatoday.com.",
  "medium": "Article",
  "links": [
    "https://click.e.usatoday.com/?qs=102d1e984ba8c8d67f3aad849e2da7c1202a33a7505407d02bc8008e7458ae30dc928f4643ccae4a372b0fbe2c2ea6946697d4f1f6fc353ed60e68b2d759f228",
    "https://www.usatoday.com/story/news/world/2025/08/14/volodymyr-zelenskyy-london-trump-putin/85654438007/",
    "https://www.usatoday.com/story/news/politics/2025/08/13/how-many-times-has-putin-met-with-us-presidents/85648253007/",
    "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swifts-showgirl-era-bangers-new-heights-podcast-takeaways/85648816007/",
    "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swift-life-showgirl-track-list/85642201007/",
    "https://www.usatoday.com/story/news/politics/2025/08/14/ivanka-trump-ufc/85614567007/",
    "https://www.usatoday.com/story/entertainment/music/2025/08/14/taylor-swift-life-of-a-showgirl-album-cover/85655662007/",
    "https://www.usatoday.com/story/tech/problemsolved/2025/08/14/how-to-mark-text-unread/85628560007/",
    "https://www.usatoday.com/story/news/nation/2025/08/14/pfas-epa-forever-chemicals-drinking-water-pollution/85639307007/",
    "https://www.usatoday.com/story/news/politics/2025/08/14/trump-putin-high-stakes-summit-ukraine-russia-peace/85647448007/",
    "https://www.usatoday.com/story/news/nation/2025/08/13/nasa-perseverance-rock-helmet-photo/85649312007/",
    "https://www.usatoday.com/story/news/politics/2025/08/14/trump-putin-alaska-summit-chess-game-russia-failure/85656200007/",
    "https://www.usatoday.com/story/shopping/2025/08/14/best-early-labor-day-tv-deals-television-sales-samsung-lg-tcl-hisense/85630605007/",
    "https://www.usatoday.com/story/money/restaurants/2025/08/13/olive-garden-25-cent-wine-samples/85647295007/",
    "https://www.usatoday.com/videos/life/humankind/2025/08/14/clever-surprise-proposal-involves-orchestra-and-photographer/85660607007/",
    "https://www.usatoday.com/story/entertainment/celebrities/2025/08/14/leonardo-dicaprio-esquire-younger-32/85656031007/",
    "https://www.usatoday.com/story/news/politics/2025/08/14/hunter-biden-melania-trump-threat-lawsuit-epstein/85655745007/",
    "https://www.usatoday.com/story/entertainment/movies/2025/08/14/marty-supreme-movie-kevin-oleary-shark-tank-timothee-chalamet-trailer/85654943007/",
    "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swift-life-of-a-showgirl-aesthetic/85648790007/",
    "https://www.usatoday.com/story/money/shopping/2025/08/14/walmart-employee-discount-groceries-expanded/85656732007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Donald Trump",
      "weight": 0.079941384
    },
    {
      "name": "Melania Trump",
      "weight": 0.0740974
    },
    {
      "name": "Donald Trump",
      "weight": 0.07399455
    },
    {
      "name": "Trump",
      "weight": 0.071771525
    },
    {
      "name": "Ivanka Trump",
      "weight": 0.07040352
    },
    {
      "name": "First lady Melania Trump",
      "weight": 0.069982566
    },
    {
      "name": "new era",
      "weight": 0.06940071
    },
    {
      "name": "Taylor Swift",
      "weight": 0.06921153
    },
    {
      "name": "new data",
      "weight": 0.06772627
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.06396401
    }
  ],
  "topics": [
    {
      "name": "Podcasts"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.49609375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.46044921875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.427734375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.326904296875
    }
  ],
  "sentiment": {
    "positive": 0.2701534,
    "negative": 0.24405396,
    "neutral": 0.4857927
  },
  "summary": "Taylor Swift's new album, \"The Life of a Showgirl,\" is set to debut on Travis Kelce's \"New Heights\" podcast. The album was produced by Swedish producers Max Martin and Shellback and will be released on Oct. 3. Meanwhile, President Donald Trump's meeting with Russian President Vladimir Putin raises the stakes in his meeting with Russia's leader, and more towns are finding cancer-causing chemicals in their water systems. In an interview with Fox News Radio, Trump expressed hopes that the meeting could lead to a second meeting with Putin and Ukrainian President Volodymyr Zelenskyy, where the two sides can negotiate a peace deal. The EPA has released a new new new data showing 8 yearly averages exceeding annual water limits for two types of forever chemicals.",
  "shortSummary": "Taylor Swift’s new album \"The Life of a Showgirl\" premieres on BBC One, while President Donald Trump's meeting with Russia's leader raises the stakes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1a52549280f046d18e9b033c0ece6119",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/entertainment/movies/2025/08/14/marty-supreme-movie-kevin-oleary-shark-tank-timothee-chalamet-trailer/85654943007/",
      "text": "How Kevin O'Leary landed a role in the Timothée Chalamet movie 'Marty Supreme'\nKevin O'Leary's casting in Timothée Chalamet's new movie may have come as a surprise, but he's playing a familiar role.\nThe \"Shark Tank\" alum is set to star in \"Marty Supreme\" as Milton Rockwell, \"one of the wealthiest men\" in 1950s America, who is married to Gwyneth Paltrow's character, he explained to TMZ.\nO'Leary joked that director Josh Safdie and writer Ronald Bronstein came to him for the role because they were looking for quite the jerk (though the businessman's language was more explicit).\n\"They're huge 'Shark Tank' fans, and this story is really about the American dream anyway,\" said O'Leary, 71.\nO'Leary said it was \"a remarkable experience working with Timmy\" and said the actor, 29, was \"just full of electricity.\"\n\"Timmy's all over the place. He's out of his mind in this movie,\" he said. \"I think he'll get nominated for an Oscar in this one. This is his movie.\"\nIs 'Marty Supreme' based on a true story? Watch the trailer\nWhile \"Marty Supreme\" is not a biopic, it is a fictionalized story loosely based on the life of professional table tennis player Marty Reisman, who died in 2012.\nWatch O'Leary in the trailer below.\nThe film also stars Odessa A'zion, Fran Drescher and rapper Tyler, the Creator in his big screen debut, credited as Tyler Okonma.\nO'Leary said he didn't take any acting lessons and was just encouraged to \"be yourself, and let's see what happens.\"\n\"I've always said, if you want to keep yourself sharp, you've got to spend 30% of your day outside of your comfort zone.\"\nO'Leary has made some television appearances over the years, each time as himself. The businessman has starred in episodes of \"The Neighbors,\" \"Dr. Ken,\" \"Grace and Frankie\" and \"Trailer Park Boys: The Animated Series.\"\n\"Marty Supreme\" is set for a Christmas Day 2025 release."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/13/nasa-perseverance-rock-helmet-photo/85649312007/",
      "text": "Object resembling a helmet spotted on Mars surface by rover: See photo\nNASA's Perseverance rover has added to its trove of curious finds, as the space agency published a photo of a rock on the surface of Mars that looks like a centuries-old helmet.\nThe rock has a pointed peak, a flared \"brim,\" and textures that could lead reasonable observers to compare it to a witch's hat or a tent.\nThe texture is formed by spherules on the rock. Similar formations found on Earth are created through chemical weathering, mineral precipitation or volcanic processes, according to Space.com.\nThe image, taken Aug. 5 by the rover's Left Mastcam-Z camera, was chosen as the photo of the week for week 234 of its mission on Mars.\n\"This rock's target name is Horneflya and it's distinctive less because of its hat shape (which looks to me to be generally consistent with the pyramid shape we often see in of wind-eroded float blocks on the surface of Mars) and more because it's made almost entirely of spherules,\" David Agle, a spokesperson for the Perseverance team at NASA's Jet Propulsion Laboratory, told the space news outlet.\nIt is not the first time the rover has found a spherule-covered rock, having sent back a photo of a studded rock in March.\nCamera key to Mars discoveries\nThe Left Mastcam-Z camera on the Perseverance can capture panoramic color and 3D images of the planet's surface, according to NASA, allowing scientists and observers to see Martian features more clearly.\nThe rover is searching for signs of ancient microbial life as a part of a larger undertaking to understand the habitability of Mars.\nThe helmet rock provides scientist a clue on what Mar's environmental history, according to Space.com.\nPerseverance was sent to survey Jezero Crater to study the \"wet history\" of the Red Planet. The rover completed the climb to the summit of the crater in December 2024, three years after landing.\n\"Conceivably, microbial life could have lived in Jezero during one or more of these wet times,\" NASA says on the home page for the mission. \"If so, signs of their remains might be found in lakebed or shoreline sediments.\"\nPerseverance’s research is intended to pave the way for humans to reach Mars in the years ahead under NASA's Artemis program, which will begin with astronauts returning to the moon to establish a base of operations. SpaceX founder and CEO Elon Musk has also expressed his vision of launching uncrewed trips to the Red Planet before humans reach it ‒ perhaps as early as 2028.\nContributing: Eric Lagatta – USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/14/ivanka-trump-ufc/85614567007/",
      "text": "Is Ivanka Trump returning to the White House? Dana White says she will help plan UFC event\n- Ivanka Trump may be involved in planning a UFC fight at the White House next year.\n- UFC CEO Dana White says he spoke with Donald Trump about the event, and Trump suggested Ivanka's involvement.\n- Ivanka Trump served as a senior adviser during her father's first term but said she would step back from politics during his re-election campaign.\nPresident Donald Trump's daughter Ivanka Trump said she was stepping back from politics after her father's first term, but now she may be back to help plan a potential UFC fight at the White House next year.\nUFC CEO Dana White told \"CBS Mornings\" he discussed the event in an Aug. 11 call with the president, who said he wanted Ivanka involved in the planning.\n\"So Ivanka reached out to me, and her and I started talking about the possibilities, where it would be and, you know, I put together all the renderings,\" he said on CBS.\nThe White House did not comment on Ivanka Trump's role in the event, and her representatives did not immediately respond to a request for comment.\nIvanka Trump was heavily involved in Donald Trump's first term as an adviser. But when the now-president announced his third campaign, she said she was stepping back from politics. Since Donald Trump has returned to office, sports has become part of his politics with appearances at several sporting events, professional athletes on a presidential council and, of course, his love for golf.\nIvanka Trump was a senior adviser under 45th president\nIvanka Trump was a senior adviser to the president during his first term, frequently appearing at his side. By the end of his term, she was under attack for taking on something of an unofficial diplomat role in key foreign trips. Her husband Jared Kushner was also a senior adviser to the president.\nIvanka Trump is the eldest of the president's two daughters. Her mother was Donald Trump's first wife Ivana, who passed away in 2022. Her two brothers also by Ivana are Donald Trump Jr. and Eric Trump, who are managing the Trump Organization. Before her father went to the White House for the first time, Ivanka Trump was also an executive vice president at the Trump Organization.\nWhen her father announced his re-election campaign in 2022, she posted on Instagram to say that, while she loved her father, she was prioritizing her three young children this time around. In those years when the 45th president was somewhat of a political pariah, Ivanka Trump was called to testify before the House committe investigating the Jan. 6, 2021, attack on the U.S. Capitol and in the New York civil fraud case.\n“Politics is – it’s a pretty dark world. There’s a lot of darkness, a lot of negativity, and it’s just really at odds with what feels good for me as a human being,” she said on the \"Lex Fridman Podcast” in July 2022, according to CNN. \"And, you know, it’s a really rough business. So for me and my family, it feels right to not participate.\"\nIvanka has still made some appearances during second term\nWhile she may be out of the spotlight in Donald Trump's second term, Ivanka Trump has not been completely absent from her father's return to power. In fact, she attended a UFC fight with her father in Newark in June and one in Miami this summer, and photographs show her talking with White alongside the president at the Jersey match. Here are some other appearances Ivanka Trump has made since her father returned to the White House:\n- Ivanka Trump and her husband Jared Kushner attended the Inauguration along with the other Trump siblings.\n- Her father-in-law, Charles Kushner, was the president's pick for the U.S. Ambassador to France and Monaco, and Ivanka Trump attended his swearing-in at the Oval Office in June.\n- The same day as Charles Kushner's swearing-in, Ivanka Trump attended a ceremony for the 88-foot flagpoles Trump had installed at the White House.\n- She was also at Trump's address to a joint session of Congress in March, along with her husband, sister Tiffany Trump and brothers Eric Trump and Donald Trump Jr.\n- In another sports outing, Ivanka Trump also joined the president as he made history as the first sitting president to attend the Super Bowl in February 2025.\nContributing: Jennifer Sangalang, Michael Collins, Saman Shafiq, Gabe Hauari, USA TODAY Network\nKinsey Crowley is the Trump Connect reporter for the USA TODAY Network. Reach her at kcrowley@gannett.com. Follow her on X and TikTok @kinseycrowley or Bluesky at @kinseycrowley.bsky.social."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swifts-showgirl-era-bangers-new-heights-podcast-takeaways/85648816007/",
      "text": "Taylor Swift 'New Heights' podcast: All the biggest moments about her 'Showgirl' era\nIf she could do \"The Tortured Poets Department\" with a broken heart, Taylor Swift is planning to show what she can do with a fully restored one.\nThe pop superstar made her highly anticipated debut as a guest on her boyfriend Travis Kelce's \"New Heights\" podcast on Aug. 13. As the episode began, the singer's website updated with an album cover of her submerged in bathwater in a bedazzled corset and a release date of Oct. 3 for her upcoming era, \"The Life of a Showgirl.\"\nFans who wanted a physical copy of her 12th era waited in a virtual line to order one of four variants: \"Sweat and Vanilla Perfume,\" \"It's Frightening,\" \"It's Rapturous\" and \"It's Beautiful.\"\n\"I am so grateful for the ability to create,\" Swift said on the podcast, acknowledging she's never taken it easy despite her astronomical success. \"With the altitude I was reaching, there was more pressure every step of life. I was getting more creative control and freedom at times, and that is why it felt so much more special to keep working harder.\"\nShe wrote, sang and produced \"Showgirl\" during the European leg of the Eras Tour. The artwork represents the end of her nights on tour.\n\"My day ends with me in a bathtub, not usually in a bedazzled dress,\" she said. \"I wanted to glamorize all the different aspects of how that tour felt.\"\nBetween stops, the singer with blistered heels and unrelenting stamina would fly in and out of Sweden to work with producers Max Martin and Shellback. The three of them collaborated on \"Red\" bops and the albums \"1989\" and \"Reputation.\"\nThere are 12 tracks on \"Showgirl,\" including the title track featuring Sabrina Carpenter. Another song is called \"Cancelled!\"\n\"That's a banger,\" Kelce said as her No. 1 fan. He later clarified that there are 12 bangers on the album including: \"The Fate of Ophelia\" (a nod to Hamlet), \"Elizabeth Taylor,\" \"Opalite,\" \"Father Figure,\" \"Eldest Daughter,\" \"Ruin the Friendship,\" \"Actually Romantic,\" \"Wi$h Li$T,\" \"Wood\" and \"Honey.\"\nKelce's review: Fun, pop and upbeat.\n\"This album is going to make you dance,\" Kelce said, grinning ear to ear.\n\"He's like a human exclamation point,\" Swift told Jason Kelce.\nTravis Kelce said she's \"the best songwriter in the world.\"\nSwift countered with \"says my boyfriend.\"\nWhy 'New Heights'?\nTravis Kelce and his brother, Jason Kelce, have hosted the \"New Heights\" podcast since 2022, but this was the first time Swift has been a guest on the show since she and Travis began their highly publicized romance in 2023.\nSwift chose Kelce's podcast as a platform to reveal her next album and usher in a new era, rather than do so on her own social media channels or at a live event, because it's where their love story began.\nFans had been eagerly anticipating the start of her next era after the singer wrapped her wildly popular Eras Tour in December. Her previous album, \"The Tortured Poets Department,\" dropped in April 2024 to critical acclaim and a Grammy nomination for album of the year.\nTaylor Swift's album comes after music catalog ownership announcement\n\"The Life of a Showgirl\" will be Swift's first time releasing new music since she became the owner of her entire catalog. In May, she revealed that she had gained ownership of all her old albums following a dispute with former music manager, Scooter Braun.\n\"All of the music I've ever made now belongs to me,\" she said at the time.\nBefore this, Swift had been in the process of rerecording her first six albums so that she would own all of her music. Swift's self-titled 2006 debut album and her 2017 album \"Reputation\" were the only ones that had not yet been rereleased.\nIn her May announcement, she told fans that she had already rerecorded \"Taylor Swift\" and may still put it out. She also said she had not yet finished rerecording \"Reputation\" but planned to eventually release previously unheard \"vault\" tracks.\nHer family assists in running a slew of companies she operates in Tennessee. A few months after the Super Bowl, her brother, Austin, and mother, Andrea, flew to Los Angeles to meet with Shamrock Capital executives and discuss buying back her masters, a goal since Big Machine Records sold her work in 2019.\nSwift fought back tears, explaining the moment her mom called to tell her Shamrock agreed to sell.\n\"This changed my life,\" she said.\nPeeling back the curtain\nThe back-and-forth cadence between Swift and Kelce is reminiscent of Swift's Myspace days when she would vlog about life as a teenager with her best friend, Abigail Anderson. Yes, she misses the Eras Tour crowds and seeing the fans, but she also loves the downtime and spending time with loved ones.\nSwift met Kelce after he used the podcast as a \"personal dating app,\" prompting people in his circle to talk to people in her circle, including Chiefs Coach Andy Reid.\n\"This dude didn't get a meet and greet, and it's everyone's problem,\" she joked about Kelce.\nAs for hearing unwanted opinions on the internet or negative comments, she doesn't read them. Swift turned off her Instagram comments 10 years ago and offered advice to people who live online.\n\"Think of your energy as if it's expensive, as if it's like a luxury item,\" she said. \"Not everyone can afford it.\"\nHolding Kelce's hand, her vulnerability and willingness to be open shone in stark contrast to previous relationships. The transparency may be the biggest takeaway, even though her fandom will be pausing the video and dissecting every pixel, hoping to find \"Easter egg\" clues in the bookshelves behind the couple.\nShe spoke about her dad Scott's recovery from a quintuple bypass and her mom Andrea's knee replacement surgery. Both are doing well. Her dad is still handing out guitar picks, this time to hospital staff. \"But he didn't have his pants on,\" she added.\nHer favorite hobby is sourdough bread.\n\"I'm talking about bread 60% of the time,\" she joked before listing the varieties of bread she \"kneads\": blueberry lemon (Kelce's favorite), cinnamon raisin and rainbow funfetti. And a woman after a punster's heart, her favorite post-baking tradition is to come up with a witty reference to one of her hit songs: \"Are you bready for it?\" \"Flour song is the slamming screen door.\" \"It's a loaf story, baby, just say yeast.\" \"Should've said dough.\" \"Loafing him was bread.\"\nContributing: Brendan Morrow"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swift-life-showgirl-track-list/85642201007/",
      "text": "Taylor Swift announces track list for 'The Life of a Showgirl.' Here's everything to know\nThe track list includes the songs \"Elizabeth Taylor,\" \"Father Figure\" and \"The Life of a Showgirl\" with Sabrina Carpenter.\nIt seems as if Taylor Swift is swan-diving into the world of rhinestones, diamonds, velvet and cabaret for her newest era, \"The Life of a Showgirl.\"\nThe singer broke the news on the Aug. 13 podcast episode of \"New Heights.\" Seated next to Travis Kelce, she lifted up a mint green and bright orange briefcase.\n\"This is my brand-new album,\" Swift says as Jason Kelce screams with excitement.\nThe \"Showgirl\" track list reads like a sequins sequence:\n- The Fate of Ophelia\n- Elizabeth Taylor\n- Opalite\n- Father Figure\n- Eldest Daughter\n- Ruin the Friendship\n- Actually Romantic\n- Wi$h Li$t\n- Wood\n- Cancelled!\n- Honey\n- The Life of a Showgirl (featuring Sabrina Carpenter)\n\"The Life of a Showgirl\" cover shows Swift underwater in a bedazzled top. Four variants are available for preorder. They are \"Sweat and Vanilla Perfume,\" \"It's Frightening,\" \"It's Rapturous\" and \"It's Beautiful.\"\nSwift said she started recording the album when she was touring in Europe. She would fly to Sweden to record. The album is produced by Swedish producers Max Martin and Shellback, along with Swift.\nSwift said she hadn't worked with Martin in about eight years.\n\"It felt like catching lightning in a bottle,\" Swift said about working with the producer again.\nTaylor admitted no one else worked with the three of them. Swift said she talked to Martin the same weekend she dedicated an Eras Tour medley to him in Stolkholm, Sweden.\n\"I was talking to him and I was like, 'I just feel like we could just knock it out of the park if we went back in and we did this all in Sweden and it was just us three.\"\nDon't miss any Taylor Swift news; sign up for the free, weekly newsletter This Swift Beat.\nFollow Taylor Swift reporter Bryan West on Instagram, TikTok and X as @BryanWestTV."
    },
    {
      "url": "https://www.usatoday.com/story/tech/problemsolved/2025/08/14/how-to-mark-text-unread/85628560007/",
      "text": "Stop leaving your friends on read by marking the text as unread: Video\nWe’ve all been there. Someone sends us a text while we’re in the middle of something else. We glance at it and tell ourselves we’ll respond later. The next thing we know, it’s been days and we never replied. Oops!\nA visual cue is one of the best ways to remind us when we unlock our devices. So the next time you need to remember to reply to someone, take a couple of seconds and mark the text as unread. Or type a text now and schedule it to send later!\nWatch this video to see how to mark a text as unread.\nHow to mark a text message as unread\nThere are two ways to mark a text unread on your iPhone:\n- Hard press on message in the inbox and tap on Mark as Unread.\n- Swipe the message in your inbox to the right and tap the blue message bubble.\nThe red notification bubble will appear on the Messages app but will not appear as a notification on your lock screen.\nIf the person you’re texting has read receipts turned on, it will still show that you've read the message, even if you mark it as unread on your phone.\nThese steps also work if you’re trying to mark a message as unread in WhatsApp.\nIf you have an Android, you can turn on reply reminders. The feature will prompt you to respond to the messages you haven’t replied to or show you outgoing messages you haven’t followed up on.\nThe feature is part of the Nudges setting and is turned on by default. To turn it off or check your setting:\n- Tap your profile photo in the top right.\n- Tap Messages settings.\n- Tap Suggestions.\n- Tap Nudges.\nThe nudge will appear in the message thread and your inbox.\nShop top-rated related products:\n- Helpful device tracker: Apple AirTag 4-Pack\n- A rugged iPhone case: Casekoo Crystal Clear Protective Case\n- A popular wireless charger: Yootech Wireless Charger\n- Top-selling screen protector: Ailun Glass Screen Protector\n- The best portable battery pack: Portable Charger with Built-In Charging Cables\n- Durable phone car holders: Beam Electronics Phone Holder\n- An iPhone tripod we love: Aureday Phone Tripod\n- The best USB-C cable: Anker 6 Foot USB-C Cable, Pack of 2\n- Simplified home automation: Remote Control Outlet\nHow to pin a text message thread\nYou can also pin messages to the top of your inbox as a reminder to respond or to quickly access the people you text most often.\nJust hard-press on the conversation and tap Pin. Those people will then appear as larger circles at the top of your messages inbox."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/14/leonardo-dicaprio-esquire-younger-32/85656031007/",
      "text": "Leonardo DiCaprio, 50, mocked after revealing he feels like he's 32\nLeonardo DiCaprio doesn't know about you, but he's feeling 32.\nThe Oscar-winning \"Titanic\" star, who turned 50 last year, drew mockery on social media after revealing in an Aug. 13 Esquire interview that he feels like he's 32.\nThe quote came out of a discussion between DiCaprio and his \"One Battle After Another\" director, Paul Thomas Anderson. Addressing DiCaprio, the filmmaker said, \"I'm going to ask you a question, and you're going to answer as quickly as you can. If you didn't know how old you are, how old are you right now?\"\nDiCaprio responded, \"32.\"\nAnderson suggested that DiCaprio should \"investigate what happened when you were 32,\" which would reveal why this is his answer. Later, the \"Boogie Nights\" director asked the actor a question that Esquire had prepared for him: \"You turned 50 last year. Does it feel like a natural time for reflection?\" But DiCaprio rephrased this as, \"You turned emotionally 35 last year.\"\nDiCaprio's quote quickly drew ridicule on social media, with some fans reading it as an effort to justify the fact that he is known to date women much younger than himself. The film star has most recently been romantically linked to supermodel Vittoria Ceretti, 27. The couple attended the Met Gala together in May, when Ceretti was 26.\n\"More like it's the only way he could try and justify chasing after girls under the age of 25,\" one X user said, while another joked, \"He has a problematic age gap with himself.\"\n\"Straight man is emotionally immature. Groundbreaking stuff,\" comedian Julia Claire also quipped.\nBut some came to DiCaprio's defense and said they could relate to the sentiment.\n\"People will make fun of this because of his lifestyle and dating roster, but honestly most people who are close to 50 will tell you the same exact thing,\" X user Danny Manus posted. \"(I'm) almost 45 and I feel emotionally 30. Who the hell wants to feel their age?\"\nAnderson also seemed to relate to the idea. After posing the age question to DiCaprio, the 55-year-old filmmaker noted, \"By the way, my answer was 27.\"\nStriking a more serious tone, DiCaprio also opened up during the Esquire chat about turning 50, which he said creates a desire to \"be more honest and not waste\" time.\n\"I can only imagine how the next few decades are going to progress,\" he reflected. \"I look at my mother, for example, and she just says exactly what she thinks and wastes no time. She spends no time trying to fake it.\"\nDiCaprio continued, \"Being more upfront and risking having things fall apart or risk the disagreements or risk going your separate ways from any type of relationship in life — the personal, professional — it's that you just don't want to waste your time anymore. You have to just be much more upfront. It's almost a responsibility because much more of your life is behind you than it is ahead of you.\""
    },
    {
      "url": "https://www.usatoday.com/story/money/restaurants/2025/08/13/olive-garden-25-cent-wine-samples/85647295007/",
      "text": "Does Olive Garden offer 25-cent wine samples? Yes, the rumors are true\nWhat's better than free breadsticks? Breadsticks with free (or heavily discounted) wine, of course.\nOver the past week, rumors have circulated online that Olive Garden offers 25-cent wine samples to guests ages 21 and older. Some content creators have shared their experiences at their local Olive Garden locations, but understandably, some are skeptical.\n\"I haven’t been inside of Olive Garden for years because I don’t like the quality of their food, but okay, Olive Garden did something with this 25-cent wine tasting. I was able to taste all the wine I was interested in,\" a content creator who goes by Kay's KK said in a recent TikTok video. In her video, she shows that she tried six wine samples for a total of about $1.60.\nSo what's the deal – does Olive Garden offer wine for just a quarter?\nDoes Olive Garden offer 25-cent wine samples?\nIt's complicated.\nOlive Garden does offer complimentary 1-ounce samples of wine to guests 21 and up with their meal. In some states, this sample is free. But in other states, where free alcohol samples are not permitted, these start at 25 cents, Jaime Bunker, Olive Garden senior vice president of marketing, told USA TODAY.\nThe samples aren't a full glass, though. In comparison to the 1-ounce sample, a traditional glass of wine is 5 ounces, according to New York-based wine retailer Millesima.\nHow many 25-cent wine samples is one guest limited to?\nGuests are welcome to a \"few\" wine samples with their meal, Bunker said. She did not specify the exact number of samples a guest is limited to.\nGreta Cross is a national trending reporter at USA TODAY. Story idea? Email her at gcross@usatoday.com."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/08/13/taylor-swift-life-of-a-showgirl-aesthetic/85648790007/",
      "text": "What is a showgirl? Explaining Taylor Swift's new album aesthetic\nFrom the reptilian imagery of “Reputation” to the cottagecore landscape of “Folklore,” Swifties know that each Taylor Swift album is its own era filled with cohesive themes and illustrative visuals.\nWith the reveal of her upcoming album “The Life of a Showgirl” (out Oct. 3), fans are already relishing in the flaunted color orange and embracing the “showgirl” aesthetic.\nOn the Aug. 13 episode of the “New Heights” podcast, Swift revealed the album cover showcasing the Grammy-winner wearing a bejeweled swimsuit and bracelets in a pool of green water. She also shared the album track list with artwork showcasing her dressed in orange-colored burlesque attire, including a feathered headpiece.\nSwift confirmed she wrote the album during the Eras Tour, which concluded on Dec. 8 and encompassed 149 shows across 21 countries.\n\"This album is about what was going on behind the scenes in my inner life during this tour, which was so exuberant and electric and vibrant,\" Swift said right besides podcast co-host, boyfriend and NFL star Travis Kelce.\nAs Swift enters her “Showgirl” era, here’s what to know about the term and the aesthetic.\nWhat does being a showgirl mean?\nAccording to Merriam-Webster, a showgirl is defined as a chorus girl in a musical comedy or nightclub show.\nThe role of a showgirl is commonly associated with Las Vegas performers, who, unlike traditional dancers, were known more for their flamboyant costumes than choreography, The Las Vegas Sun reported. Grant Philipo, founder of the Las Vegas Showgirl Museum, told the outlet in 2016 that classic showgirl productions were known for the hefty amount of money spent on extravagant yet topless wardrobes.\nThe concept of showgirls resurfaced following the release of last year's Golden Globe-nominated film “The Last Showgirl” starring Pamela Anderson, who plays an aging Vegas showgirl grappling with the closure of the revue she performed at for decades.\nWhile traditional showgirl productions may be a thing of the past, the imagery still exists predominantly in Vegas, where street performers dress as showgirls to pose with tourists.\nWhat is the showgirl aesthetic?\nThe showgirl aesthetic is typically associated with the burlesque scene, where female performers adorned themselves with rhinestones, sequins and feathers at various clubs, theaters and lounges.\nBurlesque shows emerged in the late 1860s and slowly evolved to feature ribald comedy, according to Jane Merrill’s 2018 book “The Showgirl Costume: An Illustrated History.” From Las Vegas casinos to Chicago nightclubs, glamoured performers donned eccentric high heels, makeup and headdresses at these shows, though nudity was also common.\n“This was a particular entertainment genre that the folks that came to visit Las Vegas really were attracted to,” Karan Feder, president of Entertainment Exhibitions, an advisory firm specializing in entertainment and performance costumes, previously told USA TODAY. “That visual legacy (from showgirls) has really stuck and come to define Vegas.”\nWhat could Taylor Swift be saying about fame, womanhood?\nIn true Swiftie nature, fans have already begun theorizing that the album will delve into the burdens of fame and womanhood, discussing her experiences as a beloved yet scrutinized pop star.\nOne X user suggested songs would open up about the struggles of “undressing and decompressing” behind the curtain, while another said Swift could speak to how the entertainment industry demands more from women.\nSwift has previously tackled the anxieties of living in the public eye through tracks like “Castles Crumbling” and double standards projected against women through tracks like “The Man.”\n“A showgirl is dazzling, sexy, misunderstood, projected upon, an entertainer, ‘just a girl’, a romantic, a hardened professional, on display, exploiting and being exploited. I can’t wait to see where this takes us,” another user wrote on Aug. 12.\nIs Taylor Swift a showgirl?\nWhile not a traditional showgirl, Swift is most certainly a performer known for using rigorous stamina and artistic vision to create grand, high-energy shows. The new album comes after last year’s record-breaking Eras Tour, which became the highest-grossing concert tour in history, having sold over $2 billion in tickets.\nOn the “New Heights” podcast, Swift discussed the daunting nature of regularly delivering three-and-a-half-hour shows at arenas across the world.\n“I wanted to put elements of musical theater, Broadway ballet, scenery that you would see in an opera,” she said when discussing the Eras Tour. “I wanted it to be references that I thought were really high concept and really high value for fans and for them to see things they hadn’t necessarily seen before, all in one concept, but I wanted to do it at the highest intensity, rapid fire.”"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/14/pfas-epa-forever-chemicals-drinking-water-pollution/85639307007/",
      "text": "New EPA data show more towns have PFAS in their water. Is yours one?\nShane Pepe knows exactly how his town's drinking water came to be polluted with the \"forever chemicals\" it recently reported to the U.S. Environmental Protection Agency.\nThe borough manager in Emmaus, Pennsylvania, points to a firefighter training facility as the source of contamination that averaged 32 times the federal limit over the past year. For decades, fire-extinguishing foams containing PFAS seeped into the local aquifer during training exercises.\n\"While our firefighters are practicing to save your life, they had no idea that at the same time the water system was getting poisoned,\" he said.\nEmmaus was among 839 water systems whose yearly average exceeded EPA limits for two types of forever chemicals, according to a USA TODAY analysis of new test results the EPA released last week. Together, these utilities serve 46 million Americans.\nThese PFAS, or per- and polyfluoroalkyl substances, are part of a family of chemicals engineered to repel liquids and heat, making them nearly indestructible. They can build up in nature and in human bodies, increasing the risk of certain types of cancer and other health problems.\nThe EPA is nearing the end of the largest PFAS testing initiative it’s undertaken – a three-year effort that requires most public drinking water systems serving at least 3,300 customers to sample and report measurements for several types of forever chemicals.\nPlaces that have found contamination now need to find other sources of drinking water or install filtration systems that can remove the PFAS within the next few years. That deadline was originally set for 2029, but in May, the EPA announced plans for an extension. The agency also rescinded limits on four other types of PFAS set under the Biden administration in 2024.\nMAP: Where water systems reported PFAS contamination\nClick on a system in the map below to review its PFAS measurements. You may also enter an address in the search box to locate the nearest water systems. Don't see a map? Click here.\nUSA TODAY’s analysis shows larger water utilities more frequently fail to meet the EPA’s standards for the two chemicals it still plans to limit: PFOA and PFOS. Nearly a quarter of systems serving over 100,000 people had average results exceeding the limit, compared to about 8% of those with fewer than 10,000 customers.\nBut in the latest data release, it’s some of the smaller communities that have reported the most eye-popping concentrations of forever chemicals in their drinking water.\nNashville, North Carolina, a town of 6,000 east of Raleigh, reported one well that measured PFOS at 490 parts per trillion (ppt) last fall and then at 200 ppt in March. The EPA limit is 4 ppt, which puts the average of those samples 86 times over the limit.\nThe city’s director of public works did not return USA TODAY’s calls requesting comment.\nThe borough of Emmaus, which is home to about 12,000 people just outside Allentown, Pennsylvania, reported several wells over EPA limits – most notably at its waterworks building, where PFOS averaged 32 times over the limit. PFOA also measured high, averaging about five times above the limit.\n“These firefighting foam companies knew what was in the water and never notified anybody,” Pepe said. He added that Emmaus declined a $4 million settlement from a class-action lawsuit against PFAS manufacturers and is instead pursuing its own lawsuit to recover damages.\nA spokesperson from the 3M Co. didn't respond directly to Pepe's allegation, but said they've committed $12 billion to public water suppliers as part of the settlement Emmaus declined. The company plans to stop manufacturing PFAS by the end of 2025. Spokesman Dan Turner of the DuPont Co., another manufacturer that Emmaus named in its lawsuit, declined to comment since the litigation is ongoing.\nEmmaus discovered the contamination through state-mandated testing in late-2021, Pepe said. The utility immediately shut down one well and studied how to remedy another well. Residents of Emmaus made it clear they wanted to fix Emmaus’ water, Pepe said, rather than becoming dependent by buying water from elsewhere.\nEarlier this year, the town won over $9 million in grant funding and a nearly $2-million loan from the state to install four enormous treatment tanks filled with granular-activated carbon able to filter out PFAS. Pepe said construction should finish by June 2026.\nEmmaus will need to raise water rates slightly to pay for ongoing maintenance to the new tanks, Pepe said, since it costs about $100,000 per year to replace the carbon filters. But, he’s thankful the Pennsylvania Infrastructure Investment Authority’s grant will bear the brunt of costs.\n“Had we not gotten the grant,” Pepe said, “instantly our folks would have been paying four times what they pay today. Instantly. And that would have been for the next 20 to 30 years.”\nHundreds of other small water systems face Emmaus’ predicament, where local budgets may not suffice to cover the cost to remove PFAS without raising water rates. Several water utility officials have told USA TODAY it’s not fair to pass these costs on their customers rather than the manufacturers and processors that created the PFAS contamination.\nBecause of this, industry groups representing water utilities sued the EPA last year, claiming the agency did not follow proper procedures when approving the new PFAS limits.\nThe lawsuit has been on hold since shortly after President Donald Trump took office, to allow the new administration time to review the limits.\nAfter the EPA announced plans to rescind some PFAS limits in May, a federal judge said the agency now has until Sept. 10 to clarify its position in the lawsuit, according to the latest court filing.\nRegardless of the lawsuit’s outcome, Pepe said his customers’ lives and safety must come first.\n“We are being told by environmental agencies that these chemicals in the water are bad and have the potential to cause cancer and other illnesses,” Pepe said. “We have a duty to mitigate this as quickly as possible, and so that's exactly what we're doing.”"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/14/trump-putin-alaska-summit-chess-game-russia-failure/85656200007/",
      "text": "A 'chess game' that could fail: What Trump thinks could happen at Putin meeting\nWASHINGTON ― President Donald Trump likened his upcoming high-stakes Alaska summit with Russian President Vladimir Putin to a \"chess game\" while predicting there's a \"25% chance\" the meeting could fail to advance peace talks between Russia and Ukraine.\nTrump, in an Aug. 14 interview with conservative talk show host Brian Kilmeade on Fox News Radio, said he hopes his one-on-one meeting with Putin will lead to a second meeting between himself, Putin and Ukrainian President Volodymyr Zelenskyy, where the two sides can hammer out details for a peace deal.\n\"It’s like a chess game,\" Trump said. \"This meeting sets up the second meeting, but there is a 25% chance that this meeting will not be a successful meeting.\"\nTrump suggested that Russia and Ukraine could \"divvy things up\" ‒ including land and boundaries ‒ during a second meeting, which has yet to be scheduled or agreed upon. Zelenskyy and Ukraine's European allies have stood firmly against Ukraine ceding significant territory seized by Russia in its three-year war on Ukraine.\n\"The second meeting is going to be very, very important because that’s going to be a meeting where they make a deal,\" Trump said. \"And – I don’t want to use the word 'divvy' things up – but, you know, to a certain extent it’s not a bad term, OK? But there will be a give-and-take as to boundaries, land, etcetera, etcetera.\"\nAddressing reporters later in the Oval Office, Trump said: \"We're going to see what happens. And I think President Putin will make peace. I think President Zelenskyy will make peace.\"\nTrump's meeting with Putin to include 'bilateral lunch,' possible joint news conference\nWhite House press secretary Karoline Leavitt, appearing Aug. 14 on Fox News' Fox and Friends, said Trump's meeting with Putin will be followed by a \"bilateral lunch\" between the two leaders and their respective delegations followed by a news conference.\nTrump suggested the two leaders could hold a joint press conference if the meeting is productive, but he said it will be a solo press conference if not.\n\"I think it might be nice to have a joint and then separates, so something like that will happen,\" Trump said to Kilmeade. \"Or if the meeting doesn't end well, I'll just have a press conference and head out. I'll head back to Washington.\"\nTrump is scheduled to leave Washington DC early in the morning on Aug. 15, flying across the continental United States on Air Force One, before landing in Anchorage. The meeting is set for Joint Base Elmendorf-Richardson in Anchorage, Alaska. The base, established in the lead-up to World War II, is spread over 13,000 square acres.\nTrump, speaking to reporters on Aug.13 at the Kennedy Center in Washington, D.C., warned there would be “very severe consequences” if Putin does not agree to end the Ukraine war when they meet. He has previously threatened to hit Russia with sanctions and tariffs if Putin does not end the fighting.\nAhead of his meeting with Putin, Trump met on Aug. 13 virtually with Zelenskyy and leaders of European countries who have urged Trump not to capitulate to Putin's demands during his solo meeting.\nLeavitt said Trump wants to \"sit down and look the president in the eye\" during his meeting with Putin \"and see what progress can be made to move the ball forward to end this brutal war and to restore peace.\"\nContributing: Francesca Chambers and Bart Jansen of USA TODAY\nReach Joey Garrison on X @joeygarrison."
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/14/trump-putin-high-stakes-summit-ukraine-russia-peace/85647448007/",
      "text": "What's at stake in Trump's Alaska meeting with Putin\nTrump is betting a face-to-face meeting with Putin on Aug. 15 can help generate the breakthrough that has proven elusive in the peace talks.\nOne of the biggest diplomatic events of Donald Trump’s second term will unfold in Alaska as the president meets with his Russian counterpart in a bid to end the war in Ukraine.\nTrump is betting a face-to-face meeting with Russian President Vladimir Putin on Aug. 15 can generate a breakthrough that has so far proved elusive, even as the White House says it’s just a “listening exercise.”\n“At the end of that meeting, probably the first two minutes, I’ll know exactly whether or not a deal can be made,” Trump said Aug. 11.\nThe trip is Putin’s first to the United States in a decade, and his first meeting with an American president since a chilly sit-down with President Joe Biden in 2021. The next year Putin invaded Ukraine, initiating the largest conflict in Europe since World War II, one that has killed more than 250,000 Russian and 100,000 Ukrainian soldiers, according to a study by the Center for Strategic and International Studies.\nThe summit is being closely watched by Ukrainian and European leaders, who are worried that any peace terms discussed could be unfavorable to Kyiv.\nHere’s what to know about Trump's Alaska meeting with Putin.\nUkraine has been largely left out\nMuch of the discussion leading up to the summit has been about who won’t be there.\nUkrainian President Volodoymyr Zelenskyy isn’t attending, which raises questions about how much can be achieved when one of the sides pivotal to any peace deal won’t be present.\nZelenskyy and European leaders said no decisions about a peace agreement can be made without Ukraine. Zelenskyy spoke with Trump twice ahead of the summit, the second time on a call that included European leaders.\n\"I'm not going to make a deal. It's not up to me to make a deal,\" Trump declared Aug. 11.\nJockeying over territorial concessions\nTrump is trying to push Moscow into an accord that Kyiv and its allies fear will include the loss of significant territory seized by Russia in its 3-year-old war.\nSpeculating about an eventual deal on Aug. 8, Trump said it would involve “some swapping of territories.\"\nThat drew a sharp response from Zelenskyy, who said, “Ukrainians will not gift their land to the occupier.”\nBut Trump has continued to push, saying on Aug. 11 that he was a “little bothered” by the Ukrainian leader’s assertion that a land swap would violate the country’s constitution.\n\"There will be some swapping,” Trump insisted Aug. 11. “There will be some changes in land.”\nThe debate over territorial concessions hangs over the summit. Putin claims four Ukrainian regions – Luhansk, Donetsk, Zaporizhzhia and Kherson – as well as the Black Sea peninsula of Crimea, which he annexed in 2014.\nTrump’s relationship with Putin in the spotlight\nTrump has had a famously warm relationship with Putin over the years, often praising the Russian autocrat. Trump reportedly shared classified intelligence with Russian officials during his first term and tried to soften U.S. opposition to Russia's past aggression against Ukraine and its human rights violations.\nMeanwhile, Ukraine and Zelenskyy featured in one of the lowest points of Trump's first term. He was impeached over allegations that he pressured Zelenskyy to dig up dirt on political rival Joe Biden.\nTrump's friendly approach to Putin has largely continued as he worked to get a peace deal and focused his ire on Zelenskyy, most notably during an explosive Oval Office meeting when the two clashed publicly. Trump told the Ukrainian leader he didn’t “have the cards” when it came to resolving the conflict in the country’s favor.\nLately, though, Trump has repeatedly slammed Putin and complained about his unwillingness to stop the fighting.\nPutin escalated his attacks on Ukraine ahead of the summit, which former GOP House speaker and Trump ally Newt Gingrich called “a sign of very bad faith.” Trump said Aug. 13 that there would be “very severe consequences” if Putin does not agree to end the war.\nEconomic sanctions in play\nTrump’s tougher approach to Russia is exemplified by his announcement July 14 that he would levy stiff secondary tariffs on countries that do business with Moscow.\nThe administration took a step toward punishing Russia’s oil customers on Aug. 6, imposing an additional 25% tariff on goods from India over its imports of Russian oil. It marked the first financial penalty aimed at Russia in Trump's second term.\nThe broader sanctions Trump had said he'd place on Putin if a ceasefire was not reached by Aug. 8 appear to be on hold.\nThe summit could help determine whether Trump follows through on the sanctions.\nTrump plays down expectations\nThough meeting with Putin is a big step, Trump and the White House are downplaying the chances for a breakthrough.\n\"This is really a feel-out meeting, a little bit,” Trump said Aug. 11.\nWhite House Press Secretary Karoline Leavitt called the summit a “listening exercise for the president.”\n“Look, only one party that’s involved in this war is going to be present,” Leavitt said Aug. 12.\nA Trump-Putin reunion\nTrump and Putin will meet in Anchorage, Alaska, at Joint Base Elmendorf-Richardson, home to about 30,000 service members, their families and civilian employees.\nAlaska was once part of Russia – the U.S. bought it for $7.2 million in 1867 − and is separated by the Bering Strait from the Russian mainland by just 55 miles at the narrowest point.\nTrump met with Putin multiple times during his first term, including in Helsinki, Finland, in 2018. Putin denied interfering in the 2016 election, comments that Trump embraced, saying Putin “was extremely strong and powerful in his denial\" despite U.S. intelligence assessments pointing to interference by Moscow on Trump's behalf.\nContributing: Reuters; Michael James, Francesca Chambers, Joey Garrison, Tom Vanden Brook, Swapna Venugopal Ramaswamy and Lauren Villagran, USA TODAY"
    },
    {
      "url": "https://www.usatoday.com/story/news/world/2025/08/14/volodymyr-zelenskyy-london-trump-putin/85654438007/",
      "text": "Zelenskyy visits London as Ukraine braces for Trump-Putin meeting\nLONDON/KYIV, Aug 14 (Reuters) - With just one day to go until a U.S.-Russian summit on ending the war in Ukraine, its president, Volodymyr Zelenskyy, visited London on Thursday to shore up European support for efforts to prevent any agreement that would carve up Ukrainian land.\nFriday's Alaska summit comes at one of the toughest moments for Ukraine in a war, the largest in Europe since World War Two, that has killed tens of thousands and displaced millions since Russia's full-scale invasion in February 2022.\nOn the backfoot on the battlefield against Russian forces, Zelenskyy and his allies are keen to avoid any deal between U.S. President Donald Trump and Russian President Vladimir Putin that leaves Ukraine more vulnerable to Russian attacks.\nZelenskyy met British Prime Minister Keir Starmer to build on momentum from virtual talks on Wednesday with European leaders and Trump to try to set red lines for the talks between Trump and Putin in Anchorage, Alaska. Zelenskiy and Starmer embraced before heading in to their meeting in Downing Street.\nOn Wednesday, Trump threatened \"severe consequences\" if Putin does not agree to peace in Ukraine and while he did not specify what the consequences could be, he has warned of economic sanctions if his meeting on Friday proves fruitless.\n\"Yesterday was a pivotal moment for reinforcing European and transatlantic unity,\" Ukraine's Foreign Minister Andrii Sybiha said on X. \"We need peace through strength as a foundation for the future of global security and stability.\"\nZelenskyy said he warned Trump that Putin was \"bluffing\" about his desire to end the war.\nThe Ukrainian leader also said Trump had supported the idea of security guarantees in a post-war settlement. Politico cited people familiar with the situation as saying that Trump had said the U.S. could provide guarantees with some conditions.\nRUSSIAN MILITARY ADVANCES\nZelenskyy confirmed this week that Russian forces had advanced by about 9-10 km (6 miles) near the town of Dobropillia in the Donetsk region. Ukraine, suffering manpower challenges, was forced to move in reserves to stabilise the situation.\nTrump's comments and the outcome of the virtual conference on Wednesday could provide encouragement for Kyiv.\nTrump described the aim of his talks with Putin in Alaska as \"setting the table\" for a quick follow-up that would include Zelenskyy.\nHowever, Russia is likely to resist Ukraine and Europe's demands strongly and previously has said its stance had not changed since it was first detailed by Putin in June 2024.\nTrump has said a deal could include what he called a land swap. Russia controls around a fifth of Ukraine and a land swap within Ukraine could cement Moscow's gains.\nZelenskyy and the Europeans worry that would reward Putin for nearly 11 years of efforts to seize Ukrainian land and embolden him to expand further west in Europe.\nDmitriev, who heads up Russia's RDIF sovereign wealth fund, has previously held talks with Steve Witkoff, Trump's special envoy, and has spoken of possible business cooperation between Moscow and Washington.\nTrump's agreement last week to the summit was an abrupt shift after weeks of voicing frustration with Putin for resisting the U.S. peace initiative.\nA Gallup poll released last week found that 69% of Ukrainians favour a negotiated end to the war as soon as possible. But polls also indicate Ukrainians do not want peace at any cost if that means significant concessions.\nAs conditions for a ceasefire and the start of talks, Putin has demanded Ukraine withdraw its forces from four regions that Russia has claimed as its own but does not fully control, and formally renounce plans to join NATO.\nKyiv swiftly rejected the conditions as tantamount to surrender.\n(Reporting by Catarina Demony, Olena Harmash, Andrew Osborn; Writing by Matthias Williams; Editing by Philippa Fletcher)"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/music/2025/08/14/taylor-swift-life-of-a-showgirl-album-cover/85655662007/",
      "text": "Taylor Swift's 'Life of a Showgirl' showcases new era with provocative album art\nTaylor Swift's latest era? Reclaiming her body.\nThe pop superstar released on Aug. 13 the album cover for her 12th studio album, \"The Life of a Showgirl,\" out Oct. 3, that is expected to explore her decadeslong – and sometimes fraught – relationship with fame.\nThe cover and album rollout illustrate Swift's metamorphosis as one of the music industry's most powerful people. Once careful when exposing her fans to explicit parts of adult life, the 35-year-old now embraces more risqué thematic exploration.\nThe album's cover art features the \"Cruel Summer\" hitmaker sinking into water as her body is shown in a revealing burlesque-inspired outfit and alluring pose, while other cover images showcase the songstress exposing her navel and bare skin.\nIn one buzzy photo from her album art, Swift is biting her finger in a leaned back position as she gazes into the camera, wearing diamond-encrusted burlesque beads that expose parts of her chest and midriff. In another shot wearing the same outfit, she poses with one leg up and both arms out as the photo shows part of her backside.\nSwift unveiled details about \"Showgirl\" during an appearance on the \"New Heights\" podcast cohosted by her NFL boyfriend Travis Kelce and his brother, retired Philadelphia Eagles star Jason Kelce.\nTaylor Swift avoided showing belly button\nSwift hails from the relatively conservative world of country music and later transitioned to pop stardom – but she never chose to play by the same rules as her genre counterparts. She's often rejected the standards many female pop stars face, especially when it comes to nudity.\nSwift shared that she didn't like exposing herself in a 2014 cover story for Lucky magazine.\n\"I don't like showing my belly button. When you start showing your belly button then you're really committing to the midriff thing,\" Swift told Lucky. \"I only partially commit to the midriff thing – you're only seeing lower rib cage.\"\n\"I don't want people to know if I have one or not. I want that to be a mystery,\" she added, telling Lucky that \"as far as anyone knows based on my public appearances, they haven't seen evidence of a belly button.\"\nAnd, like many women, Swift has been vocal about the pressure to conform to beauty standards. In her 2020 Netflix documentary \"Miss Americana,\" Swift detailed her struggles with body image and an eating disorder: \"There's always some standard of beauty that you're not meeting because if you're thin enough then you don't have that '(butt)' that everyone wants.\n\"But if you have enough weight on you to have (a butt), then your stomach isn't flat enough,\" Swift continued.\nShowing her body on her own terms is important to Swift. In 2016, Swift foe Ye (formerly known as Kanye West) released a music video for his song \"Famous\" that featured a nude replica of the music superstar. In the song's lyrics, Ye raps that \"I feel like me and Taylor might still have sex\" and says that he \"made\" her \"famous.\"\nShe's also experienced AI deepfakes circulating sexually explicit images of herself without her consent.\nCriticism surrounding Swift's appearance has even come from the White House.\nEarlier this year, President Donald Trump took aim at the pop star on right-leaning social platform Truth Social by asking his followers: \"Has anyone noticed that, since I said 'I HATE TAYLOR SWIFT,' she's no longer 'HOT?'\"\n'Bejewled': Taylor Swift is a burlesque fan\nSwift has already forayed into the glitzy world of burlesque, known for its showgirls. According to Merriam-Webster, a showgirl is defined as a chorus girl in a musical comedy or nightclub show.\nThe role of a showgirl is commonly associated with Las Vegas performers, who, unlike traditional dancers, were known more for their flamboyant costumes than choreography.\nSwift featured famed burlesque dancer Dita Von Teese, known as the \"Queen of Burlesque, in her \"Bejeweled\" music video in 2022 following the release of her 10th studio album \"Midnights.\"Von Teese told USA TODAY in March that \"(Swift's) assistant called and started talking to me about this project, and then Taylor suddenly got on. It was really an amazing conversation. She knew everything about what I'd done.\"\nThe behind-the-scenes video of the \"Bejeweled\" set was played at each of the Eras Tour stops before Swift took the stage, bringing the art of burlesque to Swifties. On the Eras Tour and throughout her career, Swift has covered up in semi-conservative dress like bodysuits and tights to cover bare areas.\nSwift most recently explored girlhood and nostalgia with her record-breaking Eras Tour that ended in December and spanned each of her albums. Then, in May, she reclaimed total ownership of her music catalog or \"masters.\" Now, as fall nears, Swift is reclaiming ownership over her body from the public.\nNo surprise for a superstar that has always known when – and what – to show.\nContributing: Anthony Robledo, USA TODAY; Bryan West, The Nashville Tennessean"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/14/hunter-biden-melania-trump-threat-lawsuit-epstein/85655745007/",
      "text": "Hunter Biden drops F-bomb on Melania Trump's Jeffrey Epstein lawsuit threat\nPresident Trump’s friendship with Epstein has dogged him since his first term in office.\n- \"Jeffrey Epstein had nothing to do with Melania,\" President Trump told Fox Radio's Brian Kilmeade.\n- The president said he encouraged Melania's legal threat against Hunter Biden.\n- Hunter Biden had repeated a reported claim by Jeffrey Epstein that he introduced Donald and Melania Trump.\nFirst lady Melania Trump has put former first son Hunter Biden on notice − but he’s not flinching.\nOn Aug. 6, the first lady threatened to sue the son of former President Joe Biden for more than $1 billion if he doesn’t retract the claim that she was introduced to her husband by convicted sex offender Jeffrey Epstein.\nBut that hasn’t stopped the scandal-ridden younger Biden, who was pardoned by his father after pleading guilty to tax violations and was convicted on firearms-related charges.\nOn Aug. 14, Hunter Biden hit back with an expletive-laden response, saying he had read the account in newspaper articles dating back to 2019.\nMelania Trump, who married President Donald Trump in 2005, described the claim as \"false, disparaging, defamatory and inflammatory.\" Trump's legal notice was first reported by Fox News.\nThe legal notice by Alejandro Brito, the first lady’s lawyer, demands that Biden \"immediately retract the false, defamatory, disparaging and inflammatory statements made about Mrs. Trump,” which were made during an interview earlier in the month on the YouTube show Channel 5 with Andrew Callaghan.\n“They spent an enormous amount of time together,\" Biden said of the president and Epstein in his interview with Callaghan. \"That's how Melania, and the first lady and the president met. Yeah, according to Michael Wolff,\" he said referring to the author of several Trump books.\nWhen Callaghan asked Biden if he would like to apologize to the first lady, he offered a colorful response.\n“F--- that. That’s not going to happen,” he said, citing news reports dating back to 2019 that \"reported that sources said that Jeffrey Epstein claimed to be the person to introduce Donald Trump to Melania at that time.”\nTrump’s association with Epstein, whom he knew socially, has dogged him since his first term in office. In 2019, Trump said he’d had a “falling out” with Epstein, whom he described as a “Palm Beach fixture,” in the mid-2000s. Their connection was back in the spotlight when Tesla CEO Elon Musk linked Trump to Epstein during the height of their feud.\nTrump said he encouraged his wife's legal action against Hunter Biden.\n\"Jeffrey Epstein had nothing to do with Melania,\" Trump said August. 14, during an interview with Fox Radio's Brian Kilmeade. \"But they do that to demean. I told her to go ahead and do it. She was very upset about it.\"\nLast month, the Daily Beast took down an article alleging a modeling agent connected to Epstein had introduced the first lady to her husabnd.\nIt included an editor's note saying the publication had \"received a letter from First Lady Melania Trump’s attorney challenging the headline and framing of the article. After reviewing the matter, the Beast has taken down the article and apologizes for any confusion or misunderstanding.\"\nEarlier this month, Democratic strategist and podcaster James Carville issued an apology for accusing her of being introduced to Trump by Epstein. He also removed comments about the subject from the episode.\nThe first lady shared the apology on her X account with a red X over it.\nTrump’s MAGA base has long floated conspiracy theories about Epstein’s jailhouse suicide and demanded the “Epstein files” to be released. Trump’s own Vice President JD Vance used to be one of them.\nHowever, after Trump’s Justice Department and the FBI released a memo in early July declaring the disgraced financier died by suicide and asserted there was no evidence Epstein kept a \"client list,” the MAGA world became sharply divided, with many being critical of Trump.\nHunter Biden called Melania Trump’s notice a “designed distraction.”\n“I don't think that these threats of a lawsuit add up to anything other than a designed distraction, because it's not about who introduced whom to who,” he said. “I don't know how that in any way rises to the level of defamation to begin with.”\nTrump's connections to Epstein, Hunter Biden said, have become “so glaringly obvious that I think they're trying to use other things to distract − and I also think they're bullies.”\nBiden said he’d be “happy” to provide the president and first lady with a “platform” if they want to sit down for a deposition and clarify the nature of their relationship with Epstein.\n“I think the entire world would love to finally get to the bottom of the true nature of their relationship,” he said.\nSwapna Venugopal Ramaswamy is a White House correspondent for USA TODAY. You can follow her on X @SwapnaVenugopal"
    },
    {
      "url": "https://www.usatoday.com/story/money/shopping/2025/08/14/walmart-employee-discount-groceries-expanded/85656732007/",
      "text": "Walmart gives employees extra savings on groceries with expanded discount\nWalmart has expanded its discount program for employees, offering employees discounts on all groceries year-round versus discounts on specific items during the holiday season.\nIn a memo the company sent out to associates on Aug. 13, the company said the change means employees get 10% off all food categories, including dairy, frozen, dry grocery, meat, seafood, general merchandise, and fashion.\n“With this update, the associate discount now covers 95% of regularly priced items across the store,” the company said in the memo obtained by USA TODAY via email.\nWalmart’s Executive Vice President and Chief Operating Officer Kieran Shanahan said in a video shared to LinkedIn that the company has listened to employees.\n“We know the impact this discount has for so many associates and their families,” he said. “You shared your thoughts and we’ve listened … Please keep the feedback coming on how we can make the benefits we offer even better.”\nExpanding the discount was one of their most requested changes, the company said in the memo.\nWhat’s different about this expansion?\nWalmart employees receive Walmart Discount Cards after their first 90 days with the company, and if individuals work for the company for more than 20 years, they get an indefinite discount, the company said in the memo.\nAccording to the company, the discount card was first launched more than 50 years ago.\nThe discount previously included a 10% discount on all fresh produce, most general merchandise, and a discount on items during the holiday season. Now, they'll pay lower prices for nearly all food sold at Walmart stores, including milk, bread, and meat, the company told USA TODAY on Aug. 14. The company also says the discount goes into effect immediately.\nOther retailers that offer employee discounts\nAccording to the human resources consulting company Human Capital Hub, other retailers that offer employee discounts include:\n- Home Depot – Employees get a 10% discount on all regular-priced merchandise. The discount applies to employees and their immediate family members.\n- Lowes – Employees get a 10% discount on items, including clearance items.\n- Target – Employees can combine discounts with other sales and coupons. They can save up to 10% on purchases, as well as an additional 20% off on wellness items.\n- Amazon – Employee discounts vary, but they can get up to 10% off on Amazon purchases. Employees can get a maximum discount of 10% off all purchases up to $1,000.\nUSA TODAY has reached out to Walmart for comment on how the employee benefits program has changed since it was first introduced decades ago.\nAccording to Investopedia, an increase of this sort could cost Walmart, the nation's largest private employer, almost half a billion dollars more per year.\nWalmart employees made up large number of SNAP and Medicaid benefits in February 2020, study found\nThe expanded discount could be particularly helpful for Walmart workers who experience food insecurity.\nIn 2020, the U.S. Government Accountability Office conducted a study among 11 states to find out more about Medicaid and Supplemental Nutrition Assistance Program (SNAP) recipients, including where they worked in February 2020. The office found that more than 10,000 Walmart employees received Medicaid benefits, and more than 14,000 Walmart employees received SNAP benefits.\nWalmart was one of the top four employers of SNAP and Medicaid beneficiaries in every state, according to the federal study.\nOf the states that responded, most of the Walmart employees on Medicaid were reported in six states:\n- Georgia – 3,959 Walmart employees\n- Indiana – 2,396 Walmart employees\n- Massachusetts – 1,833 Walmart employees\n- Oklahoma – 1,059 Walmart employees\n- Maine – 557 Walmart employees\n- Rhode Island – 546 Walmart employees\nAnd of the states that responded, most of the Walmart workers who received SNAP benefits lived in:\n- Georgia – 4,023 Walmart employees\n- North Carolina – 3,511 Walmart employees\n- Tennessee – 1,469 Walmart employees\n- Arkansas – 1,318 Walmart employees\n- Indiana – 1,313 Walmart employees\n- Washington – 1,101 Walmart employees\n- Massachusetts – 797 Walmart employees\n- Maine – 468 Walmart employees\n- Nebraska – 361 Walmart employees\nSaleen Martin is a reporter on USA TODAY's NOW team. She is from Norfolk, Virginia – the 757. Email her at sdmartin@usatoday.com."
    }
  ],
  "argos_summary": "Taylor Swift has announced her new album, 'The Life of a Showgirl,' set to release on October 3, featuring provocative artwork and a pop-centric sound. In political news, President Donald Trump is preparing for a high-stakes meeting with Russian President Vladimir Putin in Alaska, aiming to discuss peace in Ukraine, while concerns grow over potential territorial concessions. Additionally, new EPA data reveals that many towns are grappling with contamination from 'forever chemicals' in their water systems, raising health concerns for millions.",
  "argos_id": "UFQH3TO10"
}