{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/north-korean-defector-details-culinary-culture-starving-nation/",
  "authorsByline": "The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/andrew-salmon/, Andrew Salmon",
  "articleId": "af0605e1ae0f4af7921ef9b3c77a4004",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2023/02/24/North_Korea_Food_Crisis_60350_c0-58-6000-3558_s1200x700.jpg?09159ad095c1cae7b61aa3e9d773d0a31de4d08c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:58:24+00:00",
  "addDate": "2025-08-14T21:11:13.585885+00:00",
  "refreshDate": "2025-08-14T21:11:13.585886+00:00",
  "score": 1.0,
  "title": "North Korean defector-turned-restaurateur paints bitter portrait of 1990s famines",
  "description": "Few Koreans would turn down freshwater eel: Deboned, dipped in flour and deep fried, it is a special treat. Lee Ae-ran, however, won’t touch the dish. “When I see it, my heart grows heavy,” she says.",
  "content": "SEOUL, South Korea — Few Koreans would turn down freshwater eel: Deboned, dipped in flour and deep fried, it is a special treat. Lee Ae-ran, however, won’t touch the dish. “When I see it, my heart grows heavy,” she says.\n\nIt reminds her too much of the fateful autumn evening in 1974, when a loud rap on her family’s apartment door in Pyongyang, North Korea, came as they sat down to a dinner of eel. It was an officer of the feared State Security Bureau.\n\nHe gruffly told the family that Ms. Lee’s father, a bureaucrat, was needed for a “great socialist construction project” in remote, rugged Ryanggang Province in the north. Several men barged in and began roughly packing the family’s possessions.\n\nOnly later would Ms. Lee learn what had happened.\n\nIn the late 1960s and early ‘70s, authorities began investigating people whose documents had been lost amid the 1950-53 Korean War. They discovered that Ms. Lee’s paternal grandparents had escaped to the South.\n\nThat thrust the Lees out of the comfortable “loyal” class and into the despised “hostile” class.\n\nBanished from the relative comforts of Pyongyang into rural exile in an austere mountain hamlet, the Lees would suffer the murderous famines of the 1990s – euphemistically known in today’s North Korea as “The Arduous March.”\n\nShe remembers washing mold off rice crackers, meals of potato skin scraps, rice soaked in kerosene and bean stalks “that even cattle would not eat.”\n\nToday, Ms. Lee runs a restaurant on a quiet hillside perched just minutes from Seoul’s downtown, and in May published her memoir, “One Meal, One Memory: The Taste of Survival in North Korean Cuisine.”\n\nFor Ms. Lee, culinary phrasing takes on new meanings. Complaints lead to people disappearing, “like evaporating steam.”\n\nBeyond food, she recalls conditions inside the world’s most insulated state.\n\nPersons with “greasy hands” – party elite – abused their privileges, from demanding bribes to sexually assaulting individuals. Victims who resisted suffered crippling imprisonment — some were forced to kneel in cells, year after year — under false pretenses.\n\nAn “Assault Corps” was not a military unit, but a forced labor mobilization. Tasks were battles: “bracken battles” to gather ferns; “production battles” to build a rail line.\n\nChildhood was no defense against the state.\n\nLessons were canceled and school children were driven into mountains to gather ingredients for bibimbap on overgrown trails infested with snakes.\n\nA group of runaways, imprisoned in a crowded, underground cell, were thrashed with leather belts until their skin split. Only bribes from family members could secure release.\n\nMs. Lee was humiliated in front of her class by her teacher when she expressed hopes of attending college. She was told her parents’ “lowly life” made her ineligible – a realization that drove her to attempt suicide.\n\nTobacco resin and match heads were applied to disinfect wounds. Poppy seeds boiled in water became opiate anesthetics. Raw starch was used to stem diarrhea.\n\nRural banishment was tough enough. The situation became dramatically worse in the 1990s.\n\nAfter the Soviet Union imploded, North Korea lost privileged trade and suffered failed harvests and floods. Resultant famines may have killed more than 10% of the populace.\n\nFeral orphans massed outside rail stations. She watched a group fighting over a boiled rat – valuable nutrition — and observed people trying to feed a starving boy. He died in front of her.\n\nShe was offered an 18-month-old baby by a desperate old woman, and she witnessed a malnourished family eating fruit rinds thrown into the Yalu River. She learned the bodies of the starved were trucked out of towns and dumped, without funerals, in the mountains.\n\nShe relates the story of a starving, hallucinating man who murdered, butchered and stewed his 9-year-old son, thinking he was a piglet.\n\nThese horrors, Ms. Lee recalls, took place as dictator Kim Jong Il was constructing a massive, ornate mausoleum for his deceased father, Kim Il Sung, while TV broadcasts hailed a “socialist paradise.”\n\nAs black markets, selling goods ranging from smuggled Chinese food to firewood, took over from the collapsed state distribution system, a new phrase was intoned: “To preserve socialism, we must practice capitalism.”\n\nStreet snacks that conveniently combined protein and carbohydrates – chunks of fried tofu, stuffed with rice – were invented.\n\nEven in showpiece capital Pyongyang, apartment elevators and plumbing failed. Unwilling to use basement toilets, exhausted residents of upper floors defecated into paper and dropped the waste off balconies onto streets.\n\nMs. Lee recalls a 19-year-old who did not know what an egg was and laments that famine wiped classic dishes off menus.\n\n“In the past, beef dishes like bulgogi were really famous in the North,” she says. “Now, most people have not even smelled it.”\n\nShe defected to the South in 1997.\n\nThere, she was stunned by the amounts of food served and by the culinary diversity. In Pyongyang, the only non-native eateries were Chinese, as well as one Russian and one “Western” restaurant.\n\nIn Seoul, she could not eat her first steak. “It was rare and bloody, and I was not used to beef,” she recalls.\n\nShe leveraged past experiences – her mother had been a chef in Pyongyang, and in her “Assault Corps,” she had cooked for the laborers – to open her restaurant “Nong Rae Bab Sang,” named after a willowed island in Pyongyang’s Daedong River.\n\nDiners have included former U.N. Secretary General Ban Ki-moon and ex-U.K. Premier Theresa May.\n\nHer book published this year aimed, from the outset, to differ from other defector accounts.\n\n“They write about political prisons and defections, which is hard for ordinary South Koreans to accept,” she says. “I thought food was a more natural way to talk about human rights.”\n\nIn addition to her culinary career, her activities have included being the first defector to run for political office – unsuccessfully – and berating North Korean cheerleaders who attended the 2018 Pyongchang Winter Olympics in South Korea. (They ignored her.)\n\nIt is widely believed that North Korean food security has improved since the 1990s. The United Nations estimates that 10.7 million of North Korea’s 25.9 million people are malnourished, and 18% of children are stunted — but it does not mention starvation.\n\nAnd, as of this year, Moscow has been exporting food to Pyongyang.\n\nMs. Lee, the first North Korean female to earn a doctorate from a South Korean University – in food and nutrition at Ewha Womans University — is unconvinced.\n\n“They don’t have the food resources to improve,” she said, referring to North Korea’s geographical unsuitability for agriculture.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ms. Lee",
      "weight": 0.06737075
    },
    {
      "name": "North Korea",
      "weight": 0.06327913
    },
    {
      "name": "North Korean food security",
      "weight": 0.05964675
    },
    {
      "name": "South Korea",
      "weight": 0.055615623
    },
    {
      "name": "Lee",
      "weight": 0.05355079
    },
    {
      "name": "smuggled Chinese food",
      "weight": 0.053453688
    },
    {
      "name": "North Korean defector",
      "weight": 0.053135347
    },
    {
      "name": "food",
      "weight": 0.04992876
    },
    {
      "name": "North Korean",
      "weight": 0.049587734
    },
    {
      "name": "North Korean cheerleaders",
      "weight": 0.0489592
    }
  ],
  "topics": [
    {
      "name": "Korean"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.79736328125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.79248046875
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.650390625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.515625
    },
    {
      "name": "/News/World News",
      "score": 0.392578125
    }
  ],
  "sentiment": {
    "positive": 0.060187142,
    "negative": 0.72115725,
    "neutral": 0.21865557
  },
  "summary": "North Korean defector-turned-restaurateur Lee Ae-ran has written a memoir about the 1990s famine conditions in North Korea, known as \"The Arduous March,\" which led to mass hunger and disease. She was brought into the \"hostile\" class when her father, a bureaucrat, was needed for a \"great socialist construction project\" in Ryanggang Province in the north. The Lees were relocated from the comfort of Pyongyang into rural exile during the famine, which was also known as “The Argruous March’s March” during which food was scarce. Despite these hardships, Lee describes the horrors of childhood, including being forced to leave school and being driven into mountains to collect ingredients for bibimbap. She also describes how people with “greasy hands” (party elite) abused their privileges, demanding bribes and sexually assaulting individuals. After the Soviet Union collapsed, North Korea lost privileged trade and experienced failed harvests and floods, leading to massive famine conditions.",
  "shortSummary": "Lee Ae-ran, a former North Korean defector, describes the horrific famines of the 1990s, highlighting the state’s institutionalized food and economic struggles.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d47fd11f11174199ad339a184af9ce48",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Lee Ae-ran, a North Korean defector, shares her harrowing experiences of famine and oppression in her memoir, \"One Meal, One Memory: The Taste of Survival in North Korean Cuisine.\" After being exiled from Pyongyang due to her family's background, she endured severe hardships, including starvation and abuse, during the 1990s famine. Now running a restaurant in South Korea, she uses food as a lens to discuss human rights issues in North Korea, while expressing skepticism about claims of improved food security in her homeland.",
  "argos_id": "UXYG71L2T"
}