{
  "url": "https://finance.yahoo.com/news/montage-gold-reports-fatal-accident-230200678.html",
  "authorsByline": "Montage Gold Corp",
  "articleId": "6932e39d162049dca6ebb2407ceac744",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/bd85004672f53210a4a9d9d9779ea443",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:02:00+00:00",
  "addDate": "2025-08-14T23:12:05.192027+00:00",
  "refreshDate": "2025-08-14T23:12:05.192030+00:00",
  "score": 1.0,
  "title": "Montage Gold Reports Fatal Accident at Its Koné Project in Côte d’Ivoire",
  "description": "ABIDJAN, Côte d’Ivoire, Aug. 14, 2025 (GLOBE NEWSWIRE) -- Montage Gold Corp. (“Montage” or the “Company”) (TSX: MAU, OTCQX: MAUTF) is saddened to report that a Montage colleague passed away yesterday as a result of injuries sustained in an incident that occurred during earthworks activities at the Company’s Koné project in Côte d’Ivoire. The health, safety and welfare of our colleagues is our top priority and we are deeply saddened by this news. We extend our sincere sympathies and support to hi",
  "content": "ABIDJAN, Côte d’Ivoire, Aug. 14, 2025 (GLOBE NEWSWIRE) -- Montage Gold Corp. (“Montage” or the “Company”) (TSX: MAU, OTCQX: MAUTF) is saddened to report that a Montage colleague passed away yesterday as a result of injuries sustained in an incident that occurred during earthworks activities at the Company’s Koné project in Côte d’Ivoire.\n\nThe health, safety and welfare of our colleagues is our top priority and we are deeply saddened by this news. We extend our sincere sympathies and support to his family, colleagues and friends.\n\nA comprehensive internal investigation into the incident is underway, specifically as it occurred over a kilometre away from the employee’s assigned work location. Montage will work closely with the relevant local authorities.\n\nConstruction activities were paused on August 14, 2025, and are scheduled to resume on August 15, 2025.\n\nABOUT MONTAGE GOLD \n\nMontage Gold Corp. (TSX: MAU) is a Canadian-listed company focused on becoming a premier multi-asset African gold producer, with its flagship Koné project, located in Côte d’Ivoire, at the forefront. Based on the Updated Feasibility Study published in 2024 (the “UFS”), the Koné project has an estimated 16-year mine life and sizeable annual production of +300koz of gold over the first 8 years and is expected to enter production in Q2-2027.\n\nQUALIFIED PERSONS STATEMENT\n\nThe scientific and technical contents of this press release have been verified and approved by Mr. Peder Olsen, a Qualified Person pursuant to NI 43-101. Mr. Olsen, President and Chief Development Officer of Montage, is a registered Fellow of the Australasian Institute of Mining and Metallurgy (AusIMM).\n\n\n\nFORWARD-LOOKING STATEMENTS \n\nThis press release contains certain forward-looking information and forward-looking statements within the meaning of Canadian securities legislation (collectively, “Forward-looking Statements”). All statements, other than statements of historical fact, constitute Forward-looking Statements. Words such as “will”, “intends”, “proposed” and “expects” or similar expressions are intended to identify Forward-looking Statements. Forward-looking Statements in this press release include statements related to the Company’s objectives of achieving first gold pour in the second quarter of 2027; the Company’s mineral reserve and resource estimates; the timing and amount of future production from the Koné Gold Project; anticipated mining and processing methods of the Koné Gold Project; anticipated mine life of the Koné Gold Project.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Montage Gold Corp.",
      "weight": 0.09125876
    },
    {
      "name": "Montage Gold",
      "weight": 0.09085326
    },
    {
      "name": "Koné",
      "weight": 0.0793043
    },
    {
      "name": "Montage",
      "weight": 0.071295604
    },
    {
      "name": "Côte d’Ivoire",
      "weight": 0.07093506
    },
    {
      "name": "statements",
      "weight": 0.06934379
    },
    {
      "name": "first gold pour",
      "weight": 0.06876603
    },
    {
      "name": "Mr. Peder Olsen",
      "weight": 0.066478804
    },
    {
      "name": "Company",
      "weight": 0.06486891
    },
    {
      "name": "anticipated mine life",
      "weight": 0.06340633
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.8720703125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.86181640625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.83544921875
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.80908203125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.576171875
    },
    {
      "name": "/News/Local News",
      "score": 0.484375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.459716796875
    },
    {
      "name": "/News/Other",
      "score": 0.376708984375
    }
  ],
  "sentiment": {
    "positive": 0.15891609,
    "negative": 0.24016835,
    "neutral": 0.60091555
  },
  "summary": "Montage Gold Corp. (TSX: MAU, OTCQX: M.\n) has reported a fatal accident at its Koné project in Côte d’Ivoire. The incident occurred during earthworks activities and has led to an internal investigation into the incident. Construction activities have been halted and resumed on August 15, 2025. The scientific and technical contents of this press release have been approved by Peder Olsen, a Qualified Person pursuant to NI 43-101.",
  "shortSummary": "Montage Gold Corp. reports a colleague's death from injuries sustained in a construction incident at its Koné project in Côte d’Ivoire.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "94496e71aab24c1fbe32cbce9709d0dd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Montage Gold Corp. reported the tragic death of a colleague due to injuries sustained during earthworks at the Koné project in Côte d’Ivoire. The company has paused construction activities and is conducting an internal investigation while expressing condolences to the affected family and colleagues. Montage Gold aims to become a leading African gold producer, with the Koné project expected to enter production in Q2-2027.",
  "argos_id": "VMW3GGWH9"
}