{
  "url": "https://time.com/7309750/trump-putin-alaska-expectations/",
  "authorsByline": "Philip Elliott",
  "articleId": "6e4e11fad3b3413c8f674804fc4b57b7",
  "source": {
    "domain": "time.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://api.time.com/wp-content/uploads/2025/08/GettyImages-2201823899.jpg?quality=85&w=1024&h=628&crop=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:48:49+00:00",
  "addDate": "2025-08-14T21:43:21.647723+00:00",
  "refreshDate": "2025-08-14T21:43:21.647725+00:00",
  "score": 1.0,
  "title": "Ukraine Prepares to Watch as U.S., Russia Discuss Its Fate",
  "description": "“Putin does not want peace,\" said Ukraine's President. \"He wants to occupy us completely.”",
  "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Given the optimistic tone coming from so many world leaders ahead of Donald Trump’s Friday meeting with Vladimir Putin, one might be forgiven for believing a peaceful end to Russia’s war in Ukraine was merely hours away. German Chancellor Friedrich Merz called Wednesday’s video call with Trump to discuss Trump's upcoming meeting with Russian President Vladimir Putin “a truly exceptionally constructive and good conversation.” From his point of view, Trump “would rate it a 10, very friendly.” Putin told reporters on Thursday that he saw Trump making “quite energetic efforts to stop the fighting, end the crisis, and reach agreements of interest to all parties involved in this conflict.”\n\nAll the while Ukrainian President Volodymyr Zelensky, whose country remains under constant attack from Putin’s Russia, seemed to say what everyone else didn’t want to acknowledge: “Putin does not want peace. He wants to occupy us completely.” Ahead of a bilateral summit between U.S. and Russian leaders slated to take place on Friday in Alaska, no one was offering hard predictions. It’s impossible to forget just how effectively Putin has succeeded in bending Trump with his charm, brutality, and mind games. The session in Anchorage is likely far from resolving the three-year-old war but could, if Trump’s comments this week hold true, a first step toward winding down a conflict that has left Trump beyond frustrated that he cannot simply will peace into being. But everyone has seen Trump set out with one plan only to see him return with a completely revised notion. It’s why Putin is already trying to distract Trump with other agenda items before they even meet.\n\nTo be blunt, it’s a coin-toss what happens next. But one thing is certain: none of it will match the tranquility and conformity that leaders were trying to project heading into this session. Trump is famous for going into these sessions under-prepared and over-confident. And recent reports suggest Trump may be preparing a deal with Russia that would trade rare minerals—perhaps those mined in Alaska—with Russia in exchange for peace in Ukraine, a suggestion Trump did not shoot down during a Thursday meeting with reporters. Separately, there are reports that Trump is bandying around an idea that would give Russia military and economic control of an occupied Ukraine, much like Israel has the run of the Palestinians’ West Bank. Indeed, the expectations-lowering machine was going so fast this week you could see the smoke coming off the gears, with Trump on Thursday doubling-down on the idea that Friday’s session was merely an opening act for the real games that would come quickly and with Zelensky on hand.\n\n“We have a meeting with President Putin tomorrow,” Trump told reporters in the Oval Office on Thursday. “I think it's going to be a good meeting, but the more important meeting will be the second meeting that we're having. We're going to have a meeting with President Putin, President Zelensky, myself, and maybe we'll bring some of the European leaders along. Maybe not.” It’s the maybe not that has a lot of Ukraine’s allies on edge. Europe’s bloodiest war since 1945 has left the continent unsettled, the West dusting off its Cold War instincts, and Russia increasingly isolated. This will be the first time Putin has had an in-person audience with a U.S. President since 2021, or since he invaded Ukraine the following year. That Trump would welcome Putin on U.S. soil was being spun both as Trump securing home-turf advantage and a moment of capitulation to a cold-blooded dictator whose values are anathema to American values.\n\nFor his part, Trump has been aggressively cagey about the summit’s goals as he tries to improvise his way toward the Nobel Peace Prize he openly covets. “We're going to see what happens. And I think President Putin will make peace. I think President Zelensky will make peace. We'll see if they can get along, and if they can, it'll be great,” Trump said of the two leaders who have killed thousands of foes in a battle that seems fated. White House officials and their proxies on the outside have been shameless in repositioning the goalposts so that Trump could declare a win no matter the outcome. The talking point calling the summit a “listening experience” drew so much derision, it teeters on becoming the new Infrastructure Week, a branding campaign infamous for its lack of tangible results. On Thursday, Trump leaned into that posture in his freewheeling session with reporters. “We're going to find out where everybody stands,” Trump said, seemingly oblivious to the fact Russia invaded Ukraine and has been far from an honest negotiating partner. “And I'll know within the first two minutes, three minutes, four minutes, or five minutes left, we tend to find out whether or not we're going to have a good meeting or a bad meeting. And if it's a bad meeting, it'll end very quickly, and if it's a good meeting, we're going to end up getting peace in the pretty near future.”\n\nIn an earlier radio interview, Trump said he put the odds of a failed summit at one-in-four and said he would leave Alaska immediately if things go sideways. The pieces were certainly in the wings for that outcome. Putin is bringing with him a business delegation that could distract Trump from the task at hand with the prospect of big-ticket investment vehicles. Trump, above all else, sees himself as a deal maker, and an economic package at home could prove more tempting than peace in a far-away corner of the globe. At the same time, Kremlin officials have dangled a nuclear treaty as another potential subject of conversation. Trump’s advisers see the risk. Putin knows its potential. And Trump himself seems indifferent to the distractions hiding in plain sight. So as Friday’s summit barrels toward a starting pistol, it is the diplomatic equivalent of a jump ball, with two nuclear powers making a play as Ukraine is left to watch from afar a discussion about its sheer survival.\n\nMake sense of what matters in Washington. Sign up for the D.C. Brief newsletter.",
  "medium": "Article",
  "links": [
    "https://time.com/7309728/alaska-trump-putin-summit/",
    "https://www.thetimes.com/us/american-politics/article/us-russia-deal-west-bank-occupation-ukraine-wfvnt6v6f",
    "https://time.com/7302345/ukraine-lost-children-russia-war/",
    "http://ing-putin-wants-to-occupy-ukraine-244905029980",
    "https://cloud.newsletters.time.com/signup?nln=dc-brief&source=dc_onsite",
    "https://www.newsweek.com/trump-putin-rare-earth-minerals-alaska-update-2113711",
    "https://time.com/7270880/zelensky-trump-putin-ukraine-endgame-interview/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump",
      "weight": 0.104135096
    },
    {
      "name": "President Putin",
      "weight": 0.08004123
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.076556556
    },
    {
      "name": "Vladimir Putin",
      "weight": 0.068976104
    },
    {
      "name": "Putin",
      "weight": 0.06629476
    },
    {
      "name": "Donald Trump’s Friday meeting",
      "weight": 0.06451929
    },
    {
      "name": "President Zelensky",
      "weight": 0.06276357
    },
    {
      "name": "Trumps upcoming meeting",
      "weight": 0.06090764
    },
    {
      "name": "Russia",
      "weight": 0.059375633
    },
    {
      "name": "Ukrainian President Volodymyr Zelensky",
      "weight": 0.05914529
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.984375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.92431640625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.90625
    },
    {
      "name": "/News/World News",
      "score": 0.87060546875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.81005859375
    }
  ],
  "sentiment": {
    "positive": 0.10227006,
    "negative": 0.61376315,
    "neutral": 0.28396675
  },
  "summary": "The optimism surrounding the upcoming meeting between Donald Trump and Vladimir Putin, which is expected to resolve the three-year-old conflict in Ukraine, could be a first step towards ending the conflict. However, Ukrainian President Volodymyr Zelensky has warned that Putin's intentions are not for peace, but for peace. German Chancellor Friedrich Merz called the meeting a \"constructive and good conversation,\" while Putin praised Trump's efforts to stop the fighting, end the crisis, and reach agreements with all parties involved in this conflict. Reports suggest that Trump may be planning a deal with Russia that would trade rare minerals in exchange for peace in Ukraine. This will be the first time Putin has seen an in-person audience with a U.S. President since 2021 or since he invaded Ukraine the following year.",
  "shortSummary": "Despite the optimistic tone of world leaders, Ukraine’s warring leaders are preparing for a potentially significant peace summit between the US and Russia, with potential for peace talks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "38a1d4139a634aa19b0b5e5f2c74d12b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/trump-putin-rare-earth-minerals-alaska-update-2113711",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nPresident Donald Trump was asked on Thursday about a report that the U.S. is preparing to offer Russian President Vladimir Putin economic incentives to encourage him to end the war in Ukraine—including opening up access to natural resources off Alaska's coast.\nThe Daily Telegraph reported that Treasury Secretary Scott Bessent is exploring the possibility in efforts to facilitate a ceasefire and lasting peace agreement between Ukraine and Russia.\nWhy It Matters\nTrump's \"America First\" policy has seen him strike rare earth mineral deals with Ukraine and Kazakhstan. While the Telegraph report has not been verified and there are few details, the prospect of opening up resources near Alaska to Putin would bolster Russia's strategic interests in the Arctic.\nWhat To Know\nWhen asked about offering Putin access to resources in Alaska, Trump said in part: \"We're going to see what happens with our meeting. We have a big meeting. It's going to be very important for Russia and very important for us. And important to us since we're trying to save a lot of lives.\"\nHe continued, \"As far as rare earth, that's very unimportant. I'm trying to save lives.\"\nTrump's comments on Thursday come a day before he's set to meet with Putin at Joint Base Elmendorf-Richardson in Anchorage, Alaska, to discuss ending Russia's war against Ukraine, which Putin launched in February 2022.\nThe White House said the Russian strongman reached out to request the meeting, and the administration has also pushed to temper expectations surrounding it. Trump said in the past that he would end the Russia-Ukraine war within 24 hours of being elected or shortly after his inauguration.\nNeither promise has come to fruition and the White House this week framed talks between Trump and Putin as a \"listening exercise\" and a \"fact-finding\" mission. Friday's meeting will follow previous negotiations between Trump's special envoy, Steve Witkoff, and Putin, in which the Russian president rejected a U.S. ceasefire proposal.\nAlthough Friday's summit is centered around ending the Russia-Ukraine war, Ukrainian President Volodymyr Zelensky was not invited. The Ukrainian leader has also expressed skepticism about the outcome of the sit-down, saying earlier this week that he believes Putin will benefit significantly from his face-to-face with Trump.\nZelensky has also flatly rejected Trump's earlier suggestion that a deal between Russia and Ukraine could involve some \"swapping of territories\" between the two warring nations. Russia claims to have annexed four Ukrainian territories since the war started 3 1/2 years ago. Ukrainians \"will not give their land to an occupier,\" Zelensky said in response to Trump's suggestion.\nThe Ukrainian leader's refusal to cede land to Russia irked Trump, who said Monday that he vehemently disagreed with him. \"I get along with Zelensky, but, you know, I disagree with what he's done,\" he told reporters at the White House. \"Very, very severely disagree. This is a war that should have never happened.\"\nTrump's announcement about a meeting with Putin occurred as the Kremlin's army slowly advances deeper into Ukraine—in defiance of demands from Trump and other Western leaders to cease attacks on civilian locales, according to the Associated Press (AP).\nRussia and Ukraine are also far apart on their terms for peace. Zelensky has refused to agree to a ceasefire deal that doesn't include security guarantees for his country, while Putin demands Ukraine be shut out from NATO and cede to Russia four territories Moscow claims it annexed.\nUkrainian soldiers on the battlefield have also expressed little hope for a diplomatic solution to the war.\nWhat People Are Saying\nThe White House would not disclose information when asked about the report, telling the Telegraph: \"We do not comment on deliberative conversations that may or may not be happening. As the president stated, everyone agrees this war must come to a close, and that is what he is working towards.\"\nFormer Republican U.S. Representative Adam Kinzinger, a frequent Trump critic, posted to X, formerly Twitter: \"so hang on.... Trump is going to offer to open up F*** ALASKA TO THE RUSSIANS?? Wow. Let's see republicans defend this.\"\nWhat Happens Next\nTrump on Thursday raised the possibility of Zelensky joining him and Putin in Alaska for a second meeting following Friday's summit with the Russian leader.\nRemaining in Alaska \"would be by far the easiest\" way for the three world leaders to hold talks, Trump said during a radio interview.\nThe AP contributed to this report.\nUpdate 8/14/25, 3:16 p.m. ET: This article has been updated with additional information and context.\nAbout the writer\nSonam Sheth is an Evening Politics Editor at Newsweek who is based in New York. She joined Newsweek in 2024 ... Read more"
    },
    {
      "url": "https://time.com/7302345/ukraine-lost-children-russia-war/",
      "text": "Vladimir Putin could not make out the names of the missing children that appeared on the screen in front of him. They were printed in tiny letters, 339 in all, each representing a child abducted from the war zone in Ukraine and, according to authorities in Kyiv, forcibly taken to Russia. Putin had never been confronted with the list in public, and he showed no particular interest in reading it.\nIt was June 4, a warm day in Moscow, exactly three years, three months, and 11 days since Putin ordered the invasion of Ukraine. In keeping with the habit of reclusiveness that he has cultivated during the war, the Russian President convened a meeting of his aides and ministers that day via video call. Their somber faces appeared in little boxes on his screen, while Putin sat at his desk alone.\nThey had a lot on their agenda. Three days earlier, the war had spilled across the breadth of Russia as the Ukrainians smuggled a fleet of cheap drones across the border and used them to attack several military airfields, damaging or destroying Russian warplanes worth billions of dollars. The next day, Ukraine and Russia held another round of peace talks in Istanbul. Putin now wanted to know how they had gone, and he called on his lead negotiator, Vladimir Medinsky, to give the highlights. About two minutes into his report, Medinsky reached for the list of children he had received from the Ukrainians in Istanbul.\n“These so-called kidnapped children,” he said. “They were saved by our soldiers, evacuated under fire.” Leafing through the list of names, he added, “We’ll have to figure out how many of them are here with us.” Putin gave no response, and the meeting moved on to other issues. Outside of Russia, the abduction of these children is widely seen as a war crime. For the Kremlin, it did not seem like an urgent matter.\nIndeed, over the past few months, the children’s fate has been pushed to the edges of the peace process, intensifying fears across Ukraine that they may never come home. The longer they remain in Russia, the more difficult it will be to return and reintegrate them, as the effect of Russian propaganda and indoctrination takes hold over time. In one case, an 11-year-old boy named Serhii refused to speak to his relatives in Ukraine after spending only a few months in Russian foster care. “They completely brainwashed him,” his older sister, Kseniia Koldin, told me after she managed to bring him home. “They convinced him that Ukraine had been destroyed, that he would starve if he went back.”\nSince the start of the war, about 1,200 of the abducted children have returned to Ukraine, thanks mostly to the dogged efforts of their relatives and humanitarian aid organizations. Ukraine’s envoys in Istanbul asked the Russians to return an additional 339 of them, hoping the Kremlin would see it as a simple way to build trust and show goodwill in the peace talks. But, in total, the authorities in Kyiv say 19,546 children still need to be returned.\nAn independent research group at Yale University has spent the past three years tracking them through Russian news reports, public databases, and posts on social media, identifying more than 8,400 children who have been “systematically relocated” from Ukraine. The Trump Administration, as part of its broader suspension of foreign aid, cut off funding to the program in March; it has continued operating with help from private donors.\nRead More: Trump’s New Hard Line on Putin is Softer Than it Looks\nIn a statement published shortly after the suspension of aid, the U.S. State Department said President Donald Trump would continue to work with Russia and Ukraine “to help make sure those children were returned home.” But some U.S. diplomats have urged Ukraine not to make the cease-fire talks with Russia conditional on the children’s return. “You can’t set conditions if you want to move forward,” one of them told me this spring. “And Trump wants to move fast.”\nStill, in his talks with Trump over the past few months, President Volodymyr Zelensky has repeatedly brought up the missing children, as have lawmakers on Capitol Hill. A bipartisan group of Senators proposed a resolution in May calling for the return of all Ukrainian children before any peace deal with Russia is finalized. “We wanted to make sure that it was a part of the discussions,” says Senator Roger Wicker, chairman of the Senate Armed Services Committee, who co-sponsored the resolution. “Vladimir Putin should be in prison with the other notorious war criminals of history,” Wicker told me. “And it’s a shame that we are not coming down on him as forcefully as we should.”\nSo far, the strongest pressure on Putin to return the children has come from the Hague. In March 2023, about a year into the Russian invasion, the International Criminal Court issued an arrest warrant against Putin for the “unlawful transfer” of Ukrainian children to Russia. As an indicted war criminal, Putin faces the risk of arrest whenever he travels to one of the 125 countries that recognize the jurisdiction of the ICC, including all of South America, nearly all of Europe, and roughly half of Africa.\nOne of Putin’s longtime associates in Moscow told me the indictment continues to irk the Russian President: “Of course it’s not comfortable for him, to put it mildly, to have these restrictions, threats of arrest, and so on.” But he has gotten used to the isolation, and he feels no urgency to act on any of Ukraine’s demands. “He could spit on the Hague. He might give the children back as part of some humanitarian exchange. He’s not Stalin. But honestly it’s just not a high priority.”\nIn Russian state media, the adoption and re-education of Ukrainian children is often portrayed as an act of charity and patriotism. The Kremlin commissioner for children’s rights, Maria Lvova-Belova, bragged in a televised meeting with Putin in 2023 that she had herself adopted a teenage boy from Ukraine. “It’s thanks to you,” she told Putin. (The only other Russian official indicted by the ICC is Lvova-Belova, who faces the same war-crimes charges as Putin.)\nRead More: How One Group Reunites Ukrainian Children With Their Families—and Their Identities\nDuring their recent talks in Istanbul, Putin’s envoys at least acknowledged the issue of the missing children and promised to address it. “We will work on every one of the names in this list,” Medinsky, the lead Russian negotiator, said after the talks on June 2. But he could not resist taking a jab at the Ukrainians for demanding their children back. He compared the effort to a scene from Wag the Dog, in which a Hollywood producer helps the White House invent a war. The producer, played by Dustin Hoffman, at one point creates a fake video of a girl running through the ruins of the fabricated war.\n“If you want to get people crying, show them a lost child, ideally one holding a kitten,” Medinsky said. “So that’s what they’re showing us.”\n__________________________________________\nOf all the children on the list Putin saw, perhaps the best-documented case is that of Margarita Prokopenko, who was only a few months old when the Russian invasion began. Abandoned at birth by her mother, Margarita was the youngest of several dozen children living in a home for orphans and kids with disabilities in the city of Kherson. In early March 2022, Russian troops overran that city and installed a puppet government to run it. Many of those who showed open resistance to the occupation were arrested or killed.\nA member of the Russian parliament, Igor Kastyukevich, soon arrived from Moscow to help cement the Kremlin’s control, and he began making frequent visits to the orphanage that spring. Kastyukevich, who represents Putin’s political party, would often arrive in the company of armed men, dressed in camouflage, and bring food and other supplies for the children, according to videos he posted online to document the visits. Early that fall, Kastyukevich and other Russian officials began taking the children away, they said, to ensure their safety. Margarita, the youngest, was among the first.\nAccording to Ukrainian investigators, the girl ended up in the custody of a prominent Putin ally named Sergei Mironov, who has been a fixture of Russia’s ruling elite for over a quarter century. When we first met in Moscow in 2010, Mironov served as chairman of the upper house of parliament, representing Fair Russia, one of the sham opposition parties that the Kremlin uses to create the illusion of competitive politics. With the start of the invasion in 2022, Mironov dropped that charade and became one of the shrillest cheerleaders for Putin and the war.\nHis tirades against Ukraine stood out for their bloodthirsty rhetoric. “Let us destroy all of the infrastructure of Nazi Ukraine once and for all,” he wrote on his website in October 2022. Around that time, Putin took formal steps to annex Kherson and three other frontline regions of Ukraine. Kastyukevich, who oversaw the removal of the children from the orphanage, then became Kherson’s representative in the Russian parliament.\nIt remains unclear exactly how Margarita ended up in the care of Mironov in Moscow. But a BBC investigation found in 2023 that the politician’s wife Inna Varlamova made multiple trips to Kherson to see the girl before her abduction, including at the hospital where Margarita received treatment for bronchitis during the Russian occupation of the city. The BBC obtained documents showing that upon her arrival in Russia, the girl was issued a new birth certificate, which listed her name as Marina Mironova, after her adoptive father in Moscow.\nMironov has not denied taking the girl into his home. In a post on social media, he responded to the BBC report with characteristic vitriol, calling it “another fake hysteria” created by Ukraine’s intelligence agencies and their “curators” in the West. “They have one goal in all this,” he wrote. “To crudely and personally discredit everyone who takes an uncompromisingly patriotic position.” Reached by TIME through his spokeswoman in Moscow, Mironov declined to comment further. He did not respond to specific questions about Margarita.\n__________________________________________\nThe Russian occupation of Kherson did not last long. In early November 2022, about two months after the children were taken from the city’s orphanage, Ukrainian forces drove the Russians out. Zelensky soon went to raise the flag in front of city hall, and he invited me to join him for the ceremony. Kherson and its suburbs had been devastated in the fighting, much of the infrastructure damaged or destroyed. “They cut off all the power, all lines of communication,” the President told me during the trip. “We need to restore all that as soon as possible.”\nThe mood among the people of Kherson worried Zelensky just as much. They had been subjected to nine months of relentless Russian propaganda, which depicts the government in Kyiv as a band of fascist thugs. Curriculums in schools had been changed to convey the same message, and Zelensky feared it had taken hold. “I’m shocked by the force of this information, the sickness of it.” He worried that the older children could be recruited into the Russian military or, as he put it, “dragged into the war against us.”\nOn the train back to Kyiv, the President and his team worked on a set of 10 demands for ending the war. They called it the Peace Formula, and its fourth point called for the return of all Ukrainian children. “We know by name 11,000 children who were forcibly deported to Russia,” he said in a speech on Nov. 15, 2022, the day after our trip to Kherson. “Among them are many whose parents were killed by Russian strikes, and now they are being held in the state that murdered them.”\nIn total, around 1.6 million Ukrainian children are now living in parts of Ukraine that Russia has occupied. They are exposed to Kremlin propaganda in schools, on state-run media, and programs devoted to “patriotic education.” According to the Yale research program, which is run out of its School of Public Health, the kids selected for transfer to Russia tend to be among the most vulnerable, like orphans living in group homes. The researchers found that many of the children were taken from frontline regions of Ukraine and placed in temporary shelters before being assigned to Russian foster families; military transport planes were sometimes used to take the children to Russia.\nFor Ukraine, the permanent loss of these children would deepen a looming demographic crisis. Since the start of the Russian invasion, the population of Ukraine has collapsed from around 41 million people to 32 million, according to official statistics. A U.N. report published last year projected that, by the end of this century, Ukraine would only have 15 million residents. The main drivers of this decline will be knock-on effects from the war, which has killed or wounded hundreds of thousands of men and led millions of women and children to flee as refugees.\nAll of that adds to the sense of urgency Ukrainians feel in bringing their children home. Last year, Zelensky assigned this mission to one of his close aides, Daria Zarivna, who was born and grew up in Kherson, not far from the emptied orphanage. When we met in March, she said she was especially troubled by the case of Margarita. The statements of the girl’s adoptive father in Moscow made it clear she would be raised in an atmosphere of hatred toward her homeland. “If we don’t get these kids back soon,” Zarivna told me, “the Russian system will succeed in turning them against us.”\nIn December, Zarivna got a chance to tell Margarita’s story at the U.N. Arriving in New York City, she carried a folder of documents related to her case, including copies of Margarita’s original birth certificate and the new one issued in Russia. As Zarivna went over a draft of her speech, she got word that Russia was trying to block her appearance. “They used every possible lever,” she says. Russia’s delegates said Zarivna did not have the accreditation needed to address the chamber. The U.S. insisted on giving her the floor, and footage of her speech went viral in Ukraine that day. But it was the Russian reaction that resonated most. “Kherson Children’s Home, just one case of many,” Zarivna said before turning to the Russians in the room. “You know where our children exactly are,” she told them. The representative of Moscow, a young diplomat named Roman Kashaev, looked up from his desk, cracked a smile, and began to laugh.\n__________________________________________\nA few months later, Zelensky arrived in Washington for a meeting with Trump in the Oval Office. Their agenda was packed. The White House wanted Zelensky to hand over the rights to Ukraine’s natural resources, particularly its rare earth minerals. The deal was meant to give Trump an economic rationale for continuing to support Ukraine. Zelensky, for his part, wanted to talk about Trump’s efforts to negotiate with Putin, and the conditions Ukraine wanted to set for the peace process.\nAt the start of their meeting on Feb. 28, Zelensky brought up the missing children. He explained to Trump how the Russians changed their names and placed them with Russian families. “We want to bring them back,” Zelensky said. “It’s a big dream, task and goal for me.” A few minutes later, as Trump began taking questions from reporters, the meeting grew tense, then angry. The two leaders ended up yelling at each other, arguing over the leverage Ukraine has in the peace talks. “You don’t have the cards,” Trump said. “With us you start having cards.”\nRead More: Exclusive: Zelensky on Trump, Putin, and the Endgame in Ukraine\nAfter the argument, Zelensky was asked to leave the White House, and the U.S. froze all aid to Ukraine, including weapons and intelligence. The flow of assistance resumed only after March 11, when envoys from the U.S. and Ukraine held talks in Saudi Arabia. “The Ukrainians made very clear that this isn’t just about ending a war,” Secretary of State Marco Rubio, who led the U.S. delegation, told reporters after those talks. “They need to get their prisoners of war back; they need to get the children back.”\nNonetheless, Ukraine consented to the U.S. plan for a cease-fire with no preconditions. The following week, news broke that the U.S. government had stopped funding the Yale program that tracks children abducted into Russia. Ukraine’s allies in Washington were outraged. “This data is absolutely crucial to Ukraine’s efforts to return their children home,” a bipartisan group of U.S. Congressmen wrote in a letter to Rubio. Speaking later to the press, Rubio promised the U.S. would secure all the data Yale researchers had collected on the missing children and make it accessible to other parties. But the program “is not funded,” Rubio said. “It was part of the reductions that were made.”\nA few days later, I asked Zelensky how he felt about this move, and his face showed a mix of sadness and frustration. Weighing his words, he told me it was “regrettable” for the Trump Administration not to stand more firmly with Ukraine on the matter of the missing children. “I think they want to show that they are in the middle,” he told me. “That means they can get behind Ukraine’s suggestions, or they can get behind those of Russia. They are demonstrating that.”\nStill, at every round of peace talks, Zelensky insisted that Ukraine would continue to demand the return of its children. Even after his argument with Trump in the Oval Office, he continues to raise the matter in their phone calls. “We have talked about the children, how to get them back,” Zelensky told me in his office in Kyiv. “There are really big obstacles. There are children who lost their parents, but they have a grandmother waiting for them here.”\nHe refuses to think of them as prisoners of war, even if that status might make the children eligible for some kind of swap with the Russians. “It cannot be a trade,” Zelensky says, “because we don’t live in some other century. It’s not like buying them out of slavery.”\nIn his view, the only way to win the kids back would be through an international campaign to force Putin’s hand, whether through sanctions against Russia, military support for Ukraine, or criminal charges like the ones Putin faces in the Hague. “The question comes down to the will of certain leaders, who can simply put pressure on Putin to return the children,” Zelensky says. “Trump is one of them. There’s no other way.”"
    },
    {
      "url": "https://time.com/7270880/zelensky-trump-putin-ukraine-endgame-interview/",
      "text": "Nearly six years have passed since Volodymyr Zelensky was elected president of Ukraine, yet he still cringes at all the polished brass and chandeliers that crowd his office. The place does seem rather gaudy, like a room plucked straight from Mar-a-Lago, and Zelensky can’t seem to stop apologizing for it as he shows me around one evening in March. He would rather scrap the furniture, he says, rip down the pilasters, and use white paint to hide the gold leaf on the ceiling.\n“But, you know, we haven’t had much time for renovations, especially these last few years,” he says, referring to the war. Only in the back of his chambers, behind Ukraine’s version of the Resolute Desk, is there a space that feels like home to Zelensky—a small room with a single bed and a set of paintings that he chose himself. They are not museum pieces. At the local bazaar, similar ones might fetch a few hundred dollars at most. But they matter to the president because of what they represent.\nThe one that hangs above his bed shows a Russian warship sinking into the Black Sea. Another shows Ukrainian troops fighting recently on Russian territory. The third, Zelensky’s favorite, shows the Kremlin engulfed in flames. “Each one’s about victory,” he says as we cram into the space for a look at the pictures. “That’s where I live.”\nBut he did not invite me over for a tour. His basic aim, as far as I could tell, was to clear the air after his recent visit to the Oval Office, the one that became a viral sensation for the world and a source of trepidation for his country. For several interminable minutes on the morning of Feb. 28, President Donald Trump and Vice President J.D. Vance had berated Zelensky, calling him ungrateful, weak and dangerous while talking over his attempts to argue back. “You don’t hold the cards,” Trump told Zelensky. “You’re gambling with World War III!”\nOn the advice of people he trusts, Zelensky has mostly avoided talking about the episode, not wanting to deepen a diplomatic crisis that had threatened to cost him nothing less than his country’s existence. His standard answer to questions about it has been, “Let's leave that to history.” Even now, he hopes to turn the page and move on. But his instincts rarely allow him to keep quiet for long about the things that bother him, which is partly what got him into trouble with Trump.\nGoing into that meeting, Zelensky says, he had it all planned out. He had been to the White House a handful of times during the war. But this would be his first sit-down with Trump in the Oval Office, and it would mark a critical point in Trump’s effort to force a peace deal in Ukraine. To make an impression, Zelensky decided to bring a set of gifts. Their aim was to break through any ill will the U.S. President felt toward Ukraine, and to dispel what Zelensky believed was the influence of Russian propaganda on the White House.\nBuy a copy of the Volodymyr Zelensky issue here\nOne of the gifts fit with an emerging tradition of the Trump era, in which guests bring shiny tokens of their respect and fealty. In a recent example, Benjamin Netanyahu, the Prime Minister of Israel, gave Trump a golden pager, commemorating the explosive devices Israel used to kill or injure thousands of its enemies last year in Lebanon. Vladimir Putin went further than that, commissioning an oil painting of Trump and sending it this month to the White House. In Zelensky’s case, the gift was even glitzier: the championship belt of his friend Oleksandr Usyk, who holds the world heavyweight boxing title.\nRead More: Volodymyr Zelensky Is TIME's 2022 Person of the Year\nAs he took his seat in the Oval Office, Zelensky placed the belt on a side table near his right elbow, planning to reach over and hand it to Trump in front of the assembled journalists. Instead, as the televised briefing began, Zelensky reached for another one of his gifts. It was a folder containing a series of gruesome photographs, showing Ukrainian prisoners of war after their time in Russian captivity. Some of their bodies were grotesquely emaciated. Others showed signs of torture. “That’s tough stuff,” Trump said, his face leaden, as he took the photos from Zelensky and began leafing through them.\nThose pictures, according to some U.S. officials, marked the point when the meeting went wrong. Had Zelensky offered the championship belt, the gesture might have lightened the mood. The photos had the opposite effect. They seemed to get Trump’s guard up, as though he were being blamed for the suffering of those soldiers. Still, even today, Zelensky does not regret his decision to present these images. He had been trying to reach beyond Trump’s transactional instincts, beyond his need for flattery, and appeal to Trump as a human being. “He has family, loved ones, children. He has to feel the things that every person feels,” Zelensky says. “What I wanted to show were my values. But then, well, the conversation went in another direction.”\nAmong the most painful exchanges in the Oval Office meeting took place near the end, when Zelensky asked whether J.D. Vance had visited Ukraine during the war. They both knew he had not, and Vance shot back that he had no interest in Zelensky’s “propaganda tours.”\nThe insult must have stung. Throughout the invasion, it has been the policy of Ukraine to encourage guests to see its destruction up close. Zelensky often brings visitors to hospitals full of wounded soldiers, ruins caused by missile strikes, or mass graves that Russian forces leave behind. Envoys from the White House have made a point of avoiding such excursions since Trump took office in January. But Zelensky remains committed to their value in diplomacy, and his team invited me to take such a trip on the day of our interview.\nLate that morning, the presidential convoy drove out from Zelensky’s office toward Kyiv’s western suburbs, and it came to a stop in the village of Moshchun. Before the Russian invasion, the place had a population of about 800 people, and its claim to fame was that Zelensky, in his early career as an actor and comedian, had filmed one of his most popular sitcoms here. Now, throughout Ukraine, Moshchun is known as the hamlet where the Russian attempt to seize Kyiv had failed.\nThe battle that raged in the surrounding fields and forests for 23 days in late February and March of 2022 was arguably the most consequential to take place in Europe since the Second World War. Had it ended differently, the Russians might have succeeded in encircling Kyiv, ousting Zelensky, swallowing up most of Ukraine and redrawing the European map. Instead, hundreds of Russian commandos were slaughtered at Moshchun by a ragged mix of Ukrainian troops, policemen, national guardsmen and regular civilians, some of them armed with nothing more than hand grenades and hunting rifles.\n“Our warriors in Moshchun were outnumbered 13 to one,” Zelensky told me. That is not propaganda, he insisted. “That’s a fact.”\nThree years had passed since Russia lost that battle, and we had come to mark the anniversary. For the occasion, the office of the local governor had prepared an elaborate ceremony, with a military band and an honor guard standing at attention, the bayonets of their rifles glinting in the sun. The field of battle, where at least 125 Ukrainians had died, was now festooned with flags, some of which read, “Ukraine or Death.”\nAs we waited for the ceremony to begin, I walked over to a wooden hut where a few women were selling wartime souvenirs—little gnomes adorned with camouflage and bullet casings. Sidling up to me, a member of Zelensky’s staff recalled how this scene had looked in previous years, on the first and second anniversaries of the battle. “It looked more real,” he whispered.\nMaybe Vance had a point. It can be hard to hold the line between solemnity and propaganda. As time passes, fresh wounds become old scars. Battlefields become memorials, and the kitsch starts creeping in. The scenery around Zelensky looked undeniably choreographed as he walked past the honor guard and set a wreath upon its stand. The immediacy of the events had faded, and that complicates the diplomatic challenge Zelensky faces at this stage in the war. The survival of his country depends on his ability to maintain the support and sympathy of foreign allies. But as the war morphs into a deadly routine, it becomes harder for him to hold their attention, and to keep people like Trump on his side.\nAt the edge of the ceremony, one of the presidential guards suppressed a yawn, which made me do the same. It had been difficult to sleep the night before. The latest swarm of Russian drones had appeared in the sky soon after midnight. They were reported to be Shaheds, or “martyrs,” a design that Russia had acquired from Iran. On social media, Ukrainians like to announce their arrival by posting emojis of a motor scooter, because the weapons sound like flying Vespas, revving as they dive out of the clouds. In my apartment near the presidential compound, the air-raid sirens failed to sound. So I woke up from the booms of the anti-aircraft cannons stationed on the rooftops, the light from their muzzle flashes dancing on my bedroom wall.\nZelensky was on a train at the time, returning from his latest trip to Europe. One of his stops that week had been in Finland, which has the unfortunate distinction of sharing an 830-mile border with Russia, the longest of any NATO member. In the center of Helsinki, Zelensky took a tour of a sprawling underground shelter meant to keep Finnish citizens safe and comfortable in case of a Russian bombing campaign. Although its population is only 5.6 million, the country had built a network of these shelters big enough for nearly five million people. “These kids, they were playing hockey down there,” Zelensky noted in amazement. “They’ve got gyms, shops, like little towns, a huge amount of space.” He had signed an agreement with the Finnish government to build similar warrens in Ukraine.\nOn his way home by train, the screen of his iPhone flashed up with an air-raid alert, noting the approach of the Shaheds. According to the Ukrainian air force, 214 of them would strike in waves throughout the night, some loaded with vacuum bombs that could incinerate entire buildings. The main target was the city of Odesa on the Black Sea coast, where the drones hit an apartment block, a shopping mall and other businesses. They also cut off power to three districts of the city.\nOne of Zelensky’s closest allies, Petr Pavel, the president of the Czech Republic, happened to be in Odesa that day, and his train departed only 20 minutes before the bombardment began. The experience left him shaken. Earlier that day, Trump and Putin had a phone call to discuss the American proposal for a ceasefire, and the Russian leader said he would consider at least some of its terms. Pavel had trouble grasping the duplicity. “One has to be truly cynical when declaring the will to have peace negotiations, or negotiations on a ceasefire, and at the same time to launch a massive attack on civilian infrastructure,” he said during his visit with Zelensky the next day. “It is extremely difficult to deal with such a party.”\nAmong Zelensky’s international allies, Pavel has long been among the most steadfast and effective. In the first year of the Russian invasion, the U.S. scoured the world for the kinds of artillery shells Ukraine needed to keep up the fight, and it came up short. Then Pavel, the leader of a country smaller than Idaho, found a way to source more than a million of these shells, which the Czechs quickly gifted to Ukraine.\nI first met him last summer in Switzerland, during a peace summit Zelensky hosted for more than 80 countries from around the world. Held in the alpine resort of Bürgenstock, the summit was meant to advance Zelensky's vision for ending the war. It was based on a plan he called the Peace Formula, composed of ten principles he saw as essential to any lasting settlement with Russia. Some of its demands struck his allies as fanciful. Point five called for the full and unconditional withdrawal of Russian troops from all of Ukraine. Point seven demanded justice for all Russian war criminals, including Putin and his top generals.\nNo one expected Ukraine to achieve all of these goals, certainly not anytime soon. Still, Zelensky and his team saw the formula as their north star, not a practical roadmap to peace but an ideal toward which the world’s diplomats should aspire in seeking to end the war. “It lays out what we would see as the final resolution of this crisis and its consequences,” says Zelensky’s chief of staff, Andriy Yermak, who also serves as Ukraine’s lead negotiator. “We stand by that vision.”\nLike most of Ukraine’s foreign allies, President Pavel supported the Peace Formula. But he had a far more sober understanding of how the war would end. He had served in the military for most of his career, reaching the rank of general and working in the NATO high command. On the sidelines of the summit in Switzerland, he told me the eventual peace in Ukraine would be ugly, angry and difficult for Zelensky to accept. “Achieving a return of full sovereignty and territorial integrity is not a goal for the short term,” Pavel said. “It will not happen in the foreseeable future.”\nHe urged me to think instead about historical battle lines and occupations that remained frozen for decades. The Soviet domination of East Germany, for instance, where the Berlin Wall stood for more than 28 years. Or the heavily militarized border between North and South Korea, which remain officially at war despite the truce reached in 1953. Or the Baltic countries in eastern Europe, which the Soviet Union occupied in 1940. Using sanctions against Moscow and other forms of diplomatic pressure, the West tried to resist that occupation. But it still went on for over half a century. All of these examples, Pavel told me, serve as precedents for where the war in Ukraine will likely end up. “I don't see a chance,” he said, “that Ukraine would be able to turn the war into their fast success.”\nIndeed, in the months since the summit in Switzerland, Zelensky’s grand vision for peace has been cut down to size. He no longer mentions the Peace Formula in his speeches. In October, as the U.S. presidential elections drew near, Zelensky presented a less ambitious plan. It consisted of only five points. The first one called for Ukraine to receive an invitation to join the NATO alliance, while the last two took a new approach, appealing to U.S. financial interests rather than any shared values. Among the enticements Zelensky offered was access to “trillions of dollars worth of minerals” hidden beneath Ukrainian soil.\nLast fall, after discussing that idea with Zelensky in New York, Trump seized on it, and his administration soon proposed a deal for the U.S. to profit from Ukraine’s mineral wealth as compensation for military support. Zelensky balked at the terms that Trump suggested in his first draft of the deal. But after weeks of tense negotiations, the U.S. and Ukraine settled on a version that both sides could accept. Zelensky and Trump were meant to sign it after their meeting in the Oval Office. Their argument scuppered those plans.\nThe next day, Trump set the minerals deal aside and decided to get tough with Zelensky. His administration announced a suspension of aid to Ukraine, including supplies of critical intelligence, weapons and ammunition. Trump’s special envoy to Ukraine, General Keith Kellogg, said the Ukrainians had “brought it on themselves.” Zelensky had failed in the Oval Office to demonstrate a willingness to accept Trump’s plan for peace, and the U.S. response was “sort of like hitting a mule with a two-by-four across the nose,\" Kellogg said. \"Got their attention.\"\nMore than that, it hobbled Ukraine’s armed forces on the battlefield. Without access to data from U.S. satellites, they lost the ability to detect the approach of Russian bombers and cruise missiles. As a result, Ukraine had less time to warn civilians and military personnel about an approaching airstrike. The impact was most acute in the Russian region of Kursk, where the Russians made swift advances. But Zelensky declined to pin the blame on the Trump administration. “It’s not connected,” he told me. “Don’t get me wrong. The state of morale always depends on whether your partners are standing beside you. But I wouldn’t say that the freeze influenced the operation in Kursk.”\nRead More: Zelensky’s Oval Office Clash with Trump Draws Pride and Fear in Ukraine\nWhat bothered Zelensky most about Trump’s role in that operation had less to do with intelligence sharing than with Russian disinformation. In the middle of the battle, Trump held a call with Putin, who told the U.S. president that thousands of Ukrainian troops in Kursk had been surrounded by Russian forces. “That was a lie,” Zelensky told me. But Trump continued to amplify it.\nFor Zelensky it looked like part of a pattern. U.S. officials, he says, had begun taking Putin at his word, even when their own intelligence contradicted him. “I believe Russia has managed to influence some people on the White House team through information,” Zelensky told me. “Their signal to the Americans was that the Ukrainians do not want to end the war, and something should be done to force them.”\nThe tensions that resulted from the Oval Office meeting began to dissipate about ten days later, when Zelensky and Trump sent their most senior aides for a round of talks in Saudi Arabia. The meeting, which was held in the city of Jeddah on March 11, lasted around nine hours. The American delegation, led by Trump's national security adviser, Mike Waltz, and Secretary of State Marco Rubio, wanted to discuss the details of where a ceasefire would leave the conflict line. “At one point we even broke out a map and started drawing on it how we’re going to end this war,” Waltz later told Fox News. “Of course both sides are going to have to make some compromises.”\nThe remark suggested the U.S. wanted to know how much territory Ukraine was willing to cede to the Russians. But Yermak, the lead Ukrainian negotiator at the meeting, says he did not interpret it that way. “The map was important to help them understand the current situation, where things stand, the key strategic elements.” The Americans did not grandstand or make demands. They took the time to listen to the Ukrainians recount the history of the war and the battles fought along the way to the present moment.\nRead More: “Hundreds of Dead”: Inside the Fallout from Trump’s Ukraine Intel Pause\nSeveral hours into the talks, Yermak and his team placed a call to Zelensky and asked for instructions. He told them to agree to a ceasefire with no preconditions. In some ways, it was another massive climbdown. Zelensky has spent the entire war demanding security guarantees from the Americans and concessions from the Russians. Now nearly all of his demands had been set aside. Yermak admitted this was difficult. “But we have to be pragmatic. We have to move step by step,” he told me. “This is not the moment for idealism.”\nAfter the talks in Jeddah, the U.S. agreed to resume supplies of military aid and intelligence to Ukraine. The Oval Office meeting began to seem like an unpleasant memory. From Zelensky’s perspective, not all of the fallout from that meeting was detrimental. His approval numbers spiked in the first days of March, reaching close to 70% in some polls—a level not seen since the early months of the Russian invasion. This struck me as strange. Given how much he put at risk by arguing with Trump and Vance in the Oval Office, it seemed reasonable for his citizens to blame him for the failure of diplomacy. When I asked about this, Zelensky answered with a question of his own.\n“Why did the Ukrainians defend themselves at the start of this war? It was because of dignity,” he told me. “We do not consider ourselves some kind of superpower,\" he continued, but the Ukrainians “are very emotional, and when it comes to our sense of dignity, freedom, democracy, our people rise up and unite.” What they hoped to see in the Oval Office was proof that the United States remains their ally. “But in that moment there was the sense of not being allies, or not taking the position of an ally,” Zelensky said. “In that conversation, I was defending the dignity of Ukraine.”\nNo matter the cost, his people do not fault him for it. Nor, it seems, have the Americans. In an Ipsos poll conducted in mid-March, about two weeks after the clash in the Oval Office, 60% of respondents said the U.S. should support Ukraine’s bid to join NATO. Three-quarters agreed with Zelensky that Putin cannot be trusted to abide by any ceasefire. Even after weeks of attacks against Ukraine in the right-wing media, a majority of Americans hold a favorable view of Zelensky.\nHe sees that as an opportunity. As Trump continues to push for peace, Zelensky intends to influence the process by making direct appeals to American voters. No doubt he agreed to give me an interview in part for that reason. But he also acknowledges that, without winning over Trump himself, he has little chance of securing a stable peace.\nOn that front, at least, Putin’s recalcitrance may turn out to be an asset. Over the last few months, while Zelensky has given ground and made concessions, the Russian demands have only grown more extreme. While launching bombs against civilians, the Kremlin has continued to push its maximalist terms for ending the war, including the dismantling of Ukraine’s armed forces, the removal of its government, and a guarantee that Ukraine will never join the NATO alliance.\nTo Zelensky’s dismay, Trump has agreed to some of these concessions without getting much in return. He has taken Ukraine’s bid to join NATO off the table. He has even suggested he would welcome Russia back into the G7, the club of the world’s wealthiest democracies. Allowing such a thing, Zelensky says, would lift the only concrete punishment Putin has faced for the invasion of Ukraine: his isolation. “That’s a big compromise,” Zelensky told me. “Imagine releasing Hitler from his political isolation.”\nAs Trump has pushed to end the war, he seems to have reserved all the carrots for Russia, while the Ukrainians get the stick. The image makes Zelensky smile and weigh his words. “If the carrot is poisoned, then thank God,” he says. “Maybe that’s the sneakiness of this diplomacy.” If he wants to, Trump can squeeze concessions from the Russians, because he seems to be the only one that Putin fears. At points in the peace process, when the U.S. threatened to sanction the Kremlin for its continued bombing raids against Ukraine, “the Russians got really scared,” Zelensky says.\nOver time, he still hopes Trump will realize that Putin is weaker than he seems, that he cannot be trusted, and that Russia’s victory in this war would not only be a disaster for Ukraine. It would be a loss, he says, for the entire West, and especially for the U.S. and its current leaders. Trump and his team would not accept such a loss, Zelensky says. “They have their own ambitions. They see their role in history,” not only as powerful leaders but as those who can achieve a dignified end to the war. “That’s why I don’t believe in these apocalyptic scenarios. Honestly I don’t.”\nStill, in one of his recent phone calls with Trump, Zelensky tried to paint a picture of that scenario. What would happen if the ceasefire proves vulnerable to endless Russian violations? All of the towns and cities in Ukraine that sit along the front line would become like a “thousand Berlins” during the Cold War, walled off and divided, barely able to survive. They would be “dead zones,” he said, on the map of Europe, and Zelensky does not think Trump wants to leave that kind of legacy.\nIn the coming weeks, Zelensky will keep making that case to Trump and Vance, appealing not to their narrow political interests but to their principles as statesmen and human beings. During one of their recent phone calls, he even suggested that Vance should reconsider his decision not to visit Ukraine during the war. “We’re still waiting for you,” Zelensky said with a laugh. The Vice President did not respond.\nA few days later, as we stood near the doorway of Zelensky’s office, I wondered what had happened to the championship belt. Did he have a chance to give it to Trump, or did he bring it home after the meeting? “I don’t know,” Zelensky told me. “Maybe it’s still sitting there.” In the confusion that followed their argument, he left it on the side table next to the sofa. Later that day, once the Ukrainians had gone, a member of the White House staff found the belt and took it to Trump's private dining room, where it now sits with other souvenirs, a memento of failed diplomacy."
    }
  ],
  "argos_summary": "Ahead of a meeting between Donald Trump and Vladimir Putin, world leaders expressed optimism about a potential resolution to the ongoing war in Ukraine. However, Ukrainian President Volodymyr Zelensky remains skeptical, asserting that Putin seeks complete occupation rather than peace. Reports suggest Trump may propose economic incentives to Russia, including access to natural resources off Alaska, while discussions about the return of Ukrainian children abducted by Russia have been sidelined in the peace talks. The summit is seen as a diplomatic gamble, with uncertain outcomes for Ukraine's future.",
  "argos_id": "WYA9PTPTD"
}