{
  "url": "https://www.cnet.com/news/social-media/meta-is-under-fire-for-ai-guidelines-on-sensual-chats-with-minors/",
  "authorsByline": "Dashia Milden",
  "articleId": "ac1aeef403e44a13a319a1d9e0968f88",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/3fc0fe551e10ce5a7bd680950946713755420b85/hub/2025/08/14/494cea1b-6edd-4c25-8daf-25f5d6572546/gettyimages-2228363952.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T23:31:40+00:00",
  "addDate": "2025-08-14T23:37:05.384159+00:00",
  "refreshDate": "2025-08-14T23:37:05.384161+00:00",
  "score": 1.0,
  "title": "Meta Is Under Fire for AI Guidelines on 'Sensual' Chats With Minors",
  "description": "Reuters found that Meta's AI guidelines and standards are troublesome in multiple ways.",
  "content": "Many young people use Meta's platforms, including WhatsApp for chat, and Instagram and Facebook for social media. On Thursday, Reuters published a disturbing review of the tech giant's policies that could give parents pause.\n\nReuters reviewed an internal Meta document detailing the company's standards and guidelines for training its platform chatbots and generative AI assistant, Meta AI, and says the company confirmed the document was authentic.\n\nAccording to Reuters, the company's artificial intelligence guidelines allowed the AI to \"engage a child in conversations that are romantic or sensual.\" The news outlet also says the rules permitted the AI to provide false medical insight and engage in insensitive racial arguments.\n\nA representative for Meta did not immediately respond to a request for comment.\n\nReuters flagged passages with Meta, and reports that while some of the concerning sections were removed or revised, others remain untouched.\n\nMeta spokesman Andy Stone told Reuters the company is revising the document, and acknowledged that the company's enforcement of its chats was inconsistent.\n\n\"The examples and notes in question were and are erroneous and inconsistent with our policies, and have been removed,\" Stone told Reuters. \"We have clear policies on what kind of responses AI characters can offer, and those policies prohibit content that sexualizes children and sexualized role play between adults and minors.\"\n\nThe internal document details rules and guidelines approved by several Meta teams and is meant to help define what's acceptable behavior for training Meta AI and chatbots. Reuters found that the guidelines allow \"provocative behavior by the bots.\"\n\nMeta's standards state that it's acceptable for the bot \"to describe a child in terms that evidence their attractiveness\" or to tell a shirtless 8-year-old that \"every inch of you is a masterpiece — a treasure I cherish deeply.\"\n\nMeta had some limitations for the AI bots. \"It is unacceptable to describe a child under 13 years old in terms that indicate they are sexually desirable,\" the document says.\n\nThere are also examples regarding race and false medical advice. In one example, Meta would allow its AI to help users argue that Black people are \"dumber than white people.\"\n\nMissouri Republican senator Josh Hawley posted on X that the guidelines were \"grounds for an immediate congressional investigation.\" A Meta spokesperson declined to comment to Reuters about that post.\n\nMeta's platforms have taken a few steps to increase online privacy and safety for teens and children, including using AI tools to give teens stricter account settings and Instagram teen accounts with more restrictions and parental permissions. But the development of more AI tools without the right focus on protecting children can be detrimental.",
  "medium": "Article",
  "links": [
    "https://x.com/HawleyMO/status/1956009097309892709",
    "https://www.cnet.com/ai-atlas/",
    "https://www.cnet.com/tech/services-and-software/meta-will-use-ai-to-place-teens-into-stricter-account-settings/",
    "https://www.reuters.com/investigates/special-report/meta-ai-chatbot-guidelines/#link=%7B%22role%22:%22standard%22,%22href%22:%22https://www.reuters.com/investigates/special-report/meta-ai-chatbot-guidelines/%22,%22target%22:%22%22,%22absolute%22:%22%22,%22linkText%22:%22Reuters'%20review%22%7D",
    "https://www.cnet.com/tech/services-and-software/instagrams-new-teen-accounts-what-parents-and-kids-need-to-know/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Meta AI",
      "weight": 0.109641545
    },
    {
      "name": "Meta",
      "weight": 0.09704208
    },
    {
      "name": "AI Guidelines",
      "weight": 0.094620995
    },
    {
      "name": "several Meta teams",
      "weight": 0.09345002
    },
    {
      "name": "Meta spokesman Andy Stone",
      "weight": 0.0925177
    },
    {
      "name": "more AI tools",
      "weight": 0.0808644
    },
    {
      "name": "AI tools",
      "weight": 0.07745137
    },
    {
      "name": "guidelines",
      "weight": 0.07382947
    },
    {
      "name": "children",
      "weight": 0.07252811
    },
    {
      "name": "generative AI assistant",
      "weight": 0.07103429
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.93505859375
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.640625
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.5283203125
    }
  ],
  "sentiment": {
    "positive": 0.04896553,
    "negative": 0.6792569,
    "neutral": 0.2717775
  },
  "summary": "Internet company, Meta, has been criticized for its AI guidelines for'sensual' conversations with minors and allowing the AI to provide false medical insight and engage in insensitive racial arguments. The company's guidelines also allow for explicit language and inappropriate behavior towards children. While some sections of the internal document have been removed or revised, others remain untouched. The guidelines were found to be inconsistent with the company's policies and allow for inappropriate language about children and sexualized role play between adults and minors. Missouri Republican senator Josh Hawley called for an immediate congressional investigation.",
  "shortSummary": "Meta's AI guidelines for training chatbots and AI assistants allow inappropriate content, including sexualized content, inconsistent with its current policies, prompting concerns about potential harmful effects on children.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "65b74af596884fd9a18ebbf5ee74dcae",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/ai-atlas/",
      "text": "Videos\nElon Musk to Sue Apple Over App Favoritism, YouTube AI Age Verification Sparks Backlash and More | Tech Today\nCNET's JD Christison covers today's top tech stories, including YouTube users petitioning the platform over its new AI-powered age restriction software, Elon Musk threatening to sue Apple over App Store placement and Amazon rolling out same-day delivery for perishable groceries to 1,000 US cities.\nThe Hidden Impact of the AI Data Center Boom\nUp Next\nThe Hidden Impact of the AI Data Center Boom\nChatGPT Users Want the Old Models Back, Intel CEO Goes to the White House & More | Tech Today\nChatGPT Users Want the Old Models Back, Intel CEO Goes to the White House & More | Tech Today\nGPT-OSS Is Out: Here Are My First Impressions\nGPT-OSS Is Out: Here Are My First Impressions\nApple Has Nothing to Fear With AI\nApple Has Nothing to Fear With AI\nOpenAI Introduces GPT-5 at OpenAI's Summer Update Event\nOpenAI Introduces GPT-5 at OpenAI's Summer Update Event\nInterview With an AI Avatar of a Slain Teen Goes Viral, ESPN Announces New Partnerships, and More | Tech Today\nInterview With an AI Avatar of a Slain Teen Goes Viral, ESPN Announces New Partnerships, and More | Tech Today\nUnitree R1: The Cheapest Humanoid Robot Yet?\nUnitree R1: The Cheapest Humanoid Robot Yet?\nOpenAI Debuts \"Study Mode\" for Students, the Tea App Data Breach, and Could a Robot Dog Deliver Your Next Pizza? | Tech Today\nOpenAI Debuts \"Study Mode\" for Students, the Tea App Data Breach, and Could a Robot Dog Deliver Your Next Pizza? | Tech Today\nTrump's AI Action Plan, Tech Company Layoffs and More | Tech Today\nTrump's AI Action Plan, Tech Company Layoffs and More | Tech Today\nHow You Talk to ChatGPT Matters. Here's Why\nHow You Talk to ChatGPT Matters. Here's Why\nApple's New Protection Plan, AI-Generated Music on Spotify, and More | Tech Today\nApple's New Protection Plan, AI-Generated Music on Spotify, and More | Tech Today\nGoogle Pixel 10 Revealed in Promo, iOS 26 Public Beta to Open, and More | Tech Today\nGoogle Pixel 10 Revealed in Promo, iOS 26 Public Beta to Open, and More | Tech Today\nI Built an AI PC From Scratch\nI Built an AI PC From Scratch\nUnboxing the Oakley HSTN Smart Glasses\nUnboxing the Oakley HSTN Smart Glasses\nyour trusted source on ai\nCNET has been covering AI for more than two decades. Now we're bringing you a new wave of expert, unique and helpful insights, through in-depth explainers, hands-on product reviews, how-to posts and more, to help you see how AI fits into your life.\nHelpful AI resources\nFAQs\nWhat is AI, in very basic terms?\nWhat is an AI hallucination?\nWhat is an LLM and how does it fit into AI?\nWhat is an AI agent?\nour ai experts\nOur writers and editors know the subject cold. Here are CNET's leading authorities on AI.\nAI Atlas is 100% human-generated. For more, see\nCNET's AI policy."
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/meta-will-use-ai-to-place-teens-into-stricter-account-settings/",
      "text": "Meta is expanding its age-verification tools by using AI to detect teenaged users and then automatically placing them into more restrictive Teen Account settings even if the user entered an adult birthday.\nThe company said in a blog post Monday that it will proactively identify accounts it suspects belong to teens and move them into these stricter settings. It acknowledged the system may make mistakes, and users will have the ability to adjust their settings back if needed.\n\"We've been using artificial intelligence to determine age for some time, but leveraging it in this way is a big change,\" Meta said.\nThis move is part of a broader effort by Meta and other social media platforms to better protect young users amid growing pressure from parents and lawmakers who argue that tech companies aren't doing enough to safeguard the safety and mental health of teens.\nInstagram Teen Accounts, which launched last year, include built-in protections that limit who can contact teens, what content they can see and how long they can spend on the platform. Last year, the company automatically enabled these safety features for all teen users, requiring parental or guardian approval for anyone under 16 to make changes.\nThe company said about 97% of users under 16 keep these protections in place. It also recently extended the Teen Account experience to Facebook and Messenger.\nMeta said it will begin sending notifications to Instagram parents with information about why it's important to talk with their teens about providing accurate age information online.\n\"Understanding the age of people online is an industry-wide challenge,\" the company said. \"We'll continue our efforts to help ensure teens are placed in age-appropriate online experiences, like Teen Accounts, but the most effective way to understand age is by obtaining parental approval and verifying age on the app store.\"\nAlthough some organizations have applauded these types of age verification methods, others like Devorah Heitner, author of Growing Up in Public, call the privacy implications \"frightening.\"\n\"For AI to be effective at determining user age, it would have to know more than it should, especially for a newer user with a limited digital footprint,\" she said. \"We need to see social apps do more to protect all users from invasive algorithms and harassment rather than focus on age-gating.\""
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/instagrams-new-teen-accounts-what-parents-and-kids-need-to-know/",
      "text": "Instagram is an online playground full of hazards -- teens know it, parents know it and the platform's parent company Meta knows it. On Tuesday, Meta announced sweeping safety updates designed to keep teens safe while they're on Instagram.\nStarting today, and continuing for the next 60 days, Instagram will migrate all children using the app who live in the US, the UK and Australia and who are under the age of 16 to one of its new teen accounts. Any children signing up for the first time will also be given a teen account, and teens living in the European Union can expect to see teen accounts rolling out later this year.\nThis new account type places restrictions on what teenagers are able to do on Instagram, with the aim of making them safer and providing peace of mind to parents. If children want to change any of their in-built protections, they will need a parent's permission to do so.\nThe changes mark a hard-won victory for children's safety campaigners, who have been asking Instagram to do more to protect kids for years. Back in 2021, Instagram first announced it would make all teen accounts private by default and introduced more parental oversight controls last summer. Even as recently as January, Meta introduced new safety features across its platforms, but none have been quite as radical as the introduction of dedicated teen accounts.\n\"I talk to parents all the time about their concerns about their teens being online, and I consistently hear three things,\" said Instagram CEO Adam Mosseri in a video posted to Threads. \"One, concerns about who can contact them; two, what content they see; and three, how much time that they spend online.\"\nTeen accounts have been designed to address all three of these concerns, he added. All teen accounts will be private, meaning that they will have to accept new followers, and people who don't follow them won't be able to interact with them in any way. This will apply to messages, but also tags and mentions. Instagram will use its Hidden Words feature to automatically filter comments and DM requests in an attempt to minimize bullying.\nIn terms of content, Instagram's most restrictive settings will be placed around what children are able to see. The company wants the entire experience of using the platform to be centered around teens' friends and their interests, which they will be able to preselect in order that they're served content they're genuinely interested in.\nTo prod teens into being mindful about how long they're spending on the app, Instagram will tell them to leave the app after one hour of use every day. It will also enable sleep mode between 10 p.m. and 7 a.m., muting notifications and sending auto-replies to DMs.\nIf teens want to change any of these settings, they will have to set up parental supervision on Instagram. Kids and parents will have to link theirs, which will give adults a degree of oversight into what their children are up to on the platform. They'll be able to see who they're messaging, for example, but not read any of the messages. They'll also be able to set hard limits for how long teens are able to spend on Instagram every day. Even though teen accounts are only for under-16s on the platform, Instagram is also making the parental supervision feature available for parents with older teens.\nYou might be wondering, what about teens that lie about their age? It's a fair question. Since the dawn of the household computer, kids have been finding ways to get around parentally enforced tech restrictions. Instagram will increasingly be asking for age verification, and is working on an additional solution. It's currently developing tech designed to spot children who might be posing as adults, and it says it'll start testing it in the US next year."
    }
  ],
  "argos_summary": "A recent review by Reuters revealed concerning guidelines from Meta regarding its AI systems, which allowed chatbots to engage in inappropriate conversations with children and provide false medical advice. Although Meta acknowledged the existence of these problematic guidelines and stated they are being revised, some sections remain unchanged. In response to growing concerns about child safety, Meta is implementing stricter age verification and safety measures on its platforms, including migrating under-16 users to new teen accounts with enhanced privacy and content restrictions.",
  "argos_id": "XXSQNRJGQ"
}