{
  "url": "https://www.foxnews.com/us/mother-son-arrested-miami-airport-after-fatal-new-jersey-street-racing-crash-escape-attempt",
  "authorsByline": "Alexandra Koch",
  "articleId": "667de1173d2743eaad8f0e440ed1faa3",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/nj-mother-and-son-extradited-to-new-jersey.gif",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T16:54:06-04:00",
  "addDate": "2025-08-14T21:03:05.848933+00:00",
  "refreshDate": "2025-08-14T21:03:05.848935+00:00",
  "score": 1.0,
  "title": "Mother and son arrested at Miami airport after fatal New Jersey street racing crash and escape attempt",
  "description": "Alvi Limani and his mother arrested near Miami while attempting to flee to Albania after deadly BMW street race crash in New Jersey.",
  "content": "A Staten Island man and his mother are facing a slew of charges, including aggravated manslaughter and hindering apprehension, after authorities say he caused a deadly crash in Plainsboro, New Jersey during a dangerous BMW street race.\n\nAlvi Limani, 20, is charged with aggravated manslaughter, vehicular homicide, multiple counts of reckless assault by auto, endangering others, obstruction, tampering with records, leaving the scene of a fatal crash, and causing death or serious injury while driving with a revoked license.\n\nHis mother, Vilma Vneshta, 42, is charged with hindering in the third degree. Both are being held at the Middlesex County Adult Correctional Center without bail.\n\nNew Jersey State Police (NJSP) responded to Garden State Parkway south just after 7 p.m. on June 29 and found Albion Hysenaj, 20, of Staten Island, and another 20-year-old Staten Island resident, who were ejected from their car.\n\nHysenaj and the 20-year-old were taken to Robert Wood Johnson University Hospital, but Hysenaj was later pronounced dead, according to NJSP. The 20-year-old suffered serious injuries.\n\nThe Middlesex County Prosecutor’s Office determined two BMW cars were racing on the Garden State Parkway when the crash happened.\n\nLimani was allegedly driving one of the BMWs recklessly and racing on the Garden State Parkway when his car hit two other cars and rolled over multiple times, according to arrest warrants. Limani is accused of weaving through traffic and driving 112 miles per hour in a 55 miles per hour speed zone.\n\nPolice said the rollover caused two of Limani's occupants, Hysenaj and the 20-year-old, to be ejected.\n\nFollowing the crash, officials accused Limani and his girlfriend, Emily Harrington, 19, of Staten Island, of leaving the scene.\n\nFORMER COP MOM SLAMS POLICIES THAT LET ILLEGAL ALIEN ALLEGEDLY STRIKE SON IN HIT-AND-RUN: ‘A LOT OF PROBLEMS’\n\nHarrington, who was in the passenger seat, is charged with hindering, obstruction and conspiracy to endanger another person.\n\nThe other alleged BMW street-racer, Jeter Ogando, 23, of Perth Amboy, is charged with second-degree vehicular homicide, endangering another person and assault by auto.\n\nDays after the crash, detectives realized Limani fled to Miami in an attempt to leave the country with his mother, Vneshta.\n\nThe pair were arrested on July 17 near Miami, Florida, and detectives noted they purchased both a Florida ID, same-day passport, and plane tickets to Tirana, Albania.\n\nVideo footage showed Limani and Vneshta being cuffed on the tarmac.\n\nAccording to jail records, both Limani and Vneshta are listed as non-citizens.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Vneshta is Albanian and [is] believed to still have roots there,\" detectives wrote in an affidavit.\n\nThe mother-son duo are currently being held at the Middlesex County Department of Corrections, according to jail records.\n\nThe Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), and the Middlesex County Prosecutor's Office did not immediately respond to inquiries from Fox News Digital.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/us/crime/homicide",
    "https://www.foxnews.com/category/auto/attributes/racing",
    "https://www.foxnews.com/politics/ice-captures-illegal-immigrant-wanted-allegedly-killing-mother-dui-crash",
    "https://www.foxnews.com/us/former-cop-mom-slams-policies-that-let-illegal-alien-allegedly-strike-son-hit-run-lot-problems",
    "https://www.foxnews.com/category/auto/make/bmw",
    "https://www.foxnews.com/us/driver-avoids-prison-100-mph-crash-that-killed-college-student",
    "https://www.foxnews.com/video/6376880802112",
    "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
    "https://www.foxnews.com/category/entertainment/genres/crime",
    "https://www.foxnews.com/category/us/us-regions/northeast/new-jersey"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fatal New Jersey street racing crash",
      "weight": 0.07884648
    },
    {
      "name": "Alvi Limani",
      "weight": 0.076185815
    },
    {
      "name": "Limani",
      "weight": 0.07498423
    },
    {
      "name": "Garden State Parkway",
      "weight": 0.07266118
    },
    {
      "name": "New Jersey State Police",
      "weight": 0.06925391
    },
    {
      "name": "Vilma Vneshta",
      "weight": 0.06382938
    },
    {
      "name": "Vneshta",
      "weight": 0.06250358
    },
    {
      "name": "Staten Island",
      "weight": 0.06163604
    },
    {
      "name": "New Jersey",
      "weight": 0.059658784
    },
    {
      "name": "Albion Hysenaj",
      "weight": 0.058159493
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.97265625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.97265625
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.95703125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9267578125
    },
    {
      "name": "/News/Other",
      "score": 0.814453125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.6904296875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.52685546875
    }
  ],
  "sentiment": {
    "positive": 0.045404322,
    "negative": 0.7519999,
    "neutral": 0.20259577
  },
  "summary": "A Staten Island man and his mother, Alvi Limani, are facing multiple charges related to aggravated manslaughter and hindering apprehension following a fatal crash in Plainsboro, New Jersey. Limani allegedly caused the fatal crash during a BMW street race and was driving recklessly and racing on the Garden State Parkway when his car hit two other cars and rolled over multiple times. The other alleged BMW street-racer, Jeter Ogando, is charged with second-degree vehicular homicide, endangering another person and assault by auto. Following the crash, Limani and his girlfriend, Emily Harrington, allegedly fled the scene and attempted to leave the country before being arrested at Miami airport. Both are being held without bail at the Middlesex County Department of Corrections.",
  "shortSummary": "A Staten Island man and his mother face multiple charges, including aggravated manslaughter and hindering apprehension, after a fatal BMW street race in New Jersey.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1d1c131509434573bde81e318756100a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/us/driver-avoids-prison-100-mph-crash-that-killed-college-student",
      "text": "A Michigan mother is heartbroken again after the teenager who killed her son in a 2023 car crash was spared prison time during his sentencing last week.\nGrosse Pointe police initially responded to the single-vehicle crash on Nov. 17, 2023, and located the defendant, Kiernan Tague, belted into the driver's seat, and the 18-year-old victim, Flynn MacKrell, unresponsive and belted into the passenger seat.\nProsecutors accused Tague of driving about 100 mph in a 25-mph zone around 9 p.m. when he crashed the vehicle into a telephone pole.\nThe defendant was initially charged with second-degree murder but later pleaded guilty to manslaughter with a motor vehicle with an adult designation in February 2025 and was given a \"blended sentence\" last week due to his age at the time of the crash: 16.\nTague, now 18, was sentenced to serve probation at a Level two placement facility, as FOX 2 Detroit reported. Fox News Digital reached out to Tague's attorney for comment.\n\"The evidence in this case will show that the defendant was driving in a residential neighborhood at speeds that rival speeding on Michigan freeways,\" Wayne County Prosecutor Kym Worthy said in a June 13 statement. \"Sadly, Mr. MacKrell lost his life as a result. We know that the rules of the road exist for a reason, speed kills. Driving 25 in a residential neighborhood is mandated, not a mere suggestion.\"\nMacKrell's mother, Anne Vanker, of Grosse Pointe, expressed her disappointment with the sentencing results in a June 13 Facebook post.\nMALIBU MAN TO STAND TRIAL FOR MURDER IN HIGH-SPEED CRASH THAT LEFT 4 PEPPERDINE STUDENTS DEAD\n\"Today, instead of being held accountable, Kiernan Tague was once again shielded from facing the full consequences of his violent and criminal actions. He killed my son, Flynn MacKrell, through repeated reckless and destructive behavior, and yet, even after 18 months, the justice system has failed to hold him fully responsible,\" Vanker wrote.\n\"This is not justice.\"\nVanker added that \"[d]espite clear recommendations from two pre-sentencing reports calling for adult sentencing, overwhelming evidence, and the applicable Michigan Court Rules that allow the court to consider the full scope of Kiernan’s behavior, the court chose leniency over accountability.\"\n\"This decision results in a continued injustice for Flynn, our family, and every community that expects real consequences for fatal, preventable actions,\" Vanker said, adding that her family \"will never stop fighting for Flynn\" and \"will continue to advocate for stronger laws.\"\nTEENS' NIGHT OF ROCK THROWING LEADS TO MURDER CONVICTION FOR MAN, NOW 20\n\"My son, my Flynn, was my life, my heart. No words can capture the silence, the rage, and the sorrow that fill every corner of my world. This statement cannot express the hell I live every day since Flynn's death, but Flynn's voice was stolen, now mine must speak for him.\"\nShe also read a victim impact statement in court last week during the sentencing hearing. In her statement, Vanker remembered her son, who had just started studying at the University of Dayton before the crash, as \"a cherished child of God\" and \"a true gift.\"\nShe also described Tague's \"escalating violent behavior\" and \"willful disregard for his mother's authority, the law, and basic human life.\" Vanker added that Tague has never acknowledged \"the gravity of the crime\" and has never expressed \"remorse\" for Flynn's death.\n\"Kiernan Tague has been involved in 20 police incidents since 2018. Most of these police interactions were triggered by Kiernan's mother calling 911 because of his uncontrollable outbursts,\" she wrote.\nTague's driving history in the months before the crash included hitting speeds of 102 mph, 127 mph, 143 mph, 150 mph and 155 mph, the Detroit Free Press reported, citing police reports, cellphone exchanges and Life360 records.\nVanker also noted that Tague's family used the Life 360 app to keep tabs on their son's location, as many parents do, and a search warrant for data from the app showed Tague's reckless driving tendencies. Police reports, Life360 records and other documents showed\nCLICK HERE TO GET THE FOX NEWS APP\n\"From November 1 to November 17, Kiernan made 94 trips in his car,\" Vanker wrote. \"Of those 94 trips, 10% were over 120 [mph], 18% were over 110 [mph], 26% were over 100 [mph], and 45% were over 90 [mph]. The top speed was recorded on November 1, 2023, when Kiernan Tague traveled at or above 153.7 mph for 20.5 miles.\"\nTague also spoke at his sentencing and at times became choked up when talking about Flynn, whom he described as his best friend, according to FOX 2.\n\"My heart is profoundly heavy with grief, regret and remorse,\" Tague said on June 13, as FOX 2 reported. \"What pains me most is that I know that any pain that I've experienced is nothing compared to what Flynn's loved ones, especially his parents, sister, brother, and family have experienced.\""
    },
    {
      "url": "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/us/former-cop-mom-slams-policies-that-let-illegal-alien-allegedly-strike-son-hit-run-lot-problems",
      "text": "A former police officer is pleading for the illegal immigrant who nearly killed her son in a hit-and-run on his 21st birthday to stop hiding and own up to his crime.\n\"I keep saying it doesn't go back to if you're legal or illegal or any of that stuff. It's not a race thing. It is not any of that. It's called being a decent human being,\" Sheena Carach, the mother of Zach Carach, who is still hospitalized, told Fox News Digital.\n\"It's about right and wrong. And if you hit someone, you stop. I mean, that's just what you do. It's inhumane not to stop. I don't care who you are. That makes you a monster.\"\nSheena Carach's life was altered May 19 while she and her family were visiting Nashville from Florida to celebrate her son's 21st birthday. After brunch and touring Music City, she said her son was struck by a speeding car while he was attempting to cross a street, and the driver sped away.\nMANHUNT UNDERWAY FOR ILLEGAL IMMIGRANT WANTED IN SERIOUS NASHVILLE HIT-AND-RUN\n\"I can say in that moment, my heart left my body,\" Carach recalled. \"I mean, I can clearly see myself running in the video. I know that happened. I was there, but I don't know how I was even breathing because I immediately thought I had just saw my child be killed. I thought I had lost my child. I ran to him, and I just started praying.\"\nWeeks after his near-death encounter, Nashville police announced the suspect wanted in the case was Tony Lopez-Infante, 32, an illegal immigrant from Venezuela who remains at large.\nWATCH: Video shows hit-and-run crash involving illegal suspect in Nashville\nA spokesperson for U.S. Immigration and Customs Enforcement (ICE) confirmed that Lopez-Infante entered the U.S. illegally in August 2023 and \"has a final order of removal.\"\nAlong with the hit-and-run, police noted that Lopez-Infante has several outstanding warrants, including one in Williamson County for a probation violation for a theft arrest.\nPolice said the vehicle involved in the accident, a Mitsubishi Mirage, was returned by Lopez-Infante, with front-end damage, to a rental business in Mt. Juliet May 19.\nHomeland Security shared a post on X, stating, \"The Biden Administration released this illegal alien into our country in 2023.\n\"This crime was preventable and is the direct result of open border policies that prioritized illegal aliens over the safety of American citizens.\"\n\"Officers located the car there the next day, on May 20. Investigation resulted in Lopez-Infante of Venezuela being identified as the hit-and-run driver,\" police said.\nCarach said her son would \"never have gotten hit\" if Lopez-Infante would \"not have been allowed to rent a vehicle illegally.\"\n\"He rented a car in February of this year that he had until he hit my son with no driver's license, with no insurance, without a major credit card on file. I mean, I wouldn't be able to walk into a business and do that,\" she said, after she ran her own investigation into her son's near-fatal crash.\n\"I have to be 25. I have to have a license. I have to have insurance. I have to have a major card to rent a vehicle, but he just did it. And he paid cash every week, $200 every single week to rent this car. So, knowingly driving without a license, knowingly driving without insurance and he was just allowed to do this. There's a lot of problems with that.\"\nILLEGAL IMMIGRANT HELD WITHOUT BAIL IN DEATH OF UNIVERSITY OF SOUTH CAROLINA STUDENT\nCarach added that what was even more frustrating was Lopez-Infante showed no concern about hitting her son.\n\"You know what you did, and you don't care at all? And you haven't come forward. To even try to … not that you could make it right at this point, but to even say like, 'Hey, I'm sorry for what I did.' He has no remorse in my eyes. He's a monster,\" she said.\nCarach said that her son will be using a wheelchair the next two months and is hopeful there is no permanent damage.\n\"I will say it was a hard one for me when this first happened, and I didn't feel like things were going as they should go. And I will say … that I won't put that on the police department. I'll put that on the mayor and everything that's been brought to my attention,\" Carach explained.\nShe was referring to the backlash Nashville Mayor Freddie O’Connell, a Democrat, has received.\nU.S. Sen. Bill Hagerty, R-Tenn., said O'Connell \"condemned ICE’s good work, promoted a fund to provide support dollars for illegal immigrants and their families in Nashville and even updated an executive order to fast-track the collection of all Nashville government employees’ interactions with ICE.\"\n\"It is indefensible that blue city mayors like Mayor O’Connell in Nashville have violated their oath of office by prioritizing illegal aliens over the law-abiding citizens they were elected to serve,\" Sen. Marsha Blackburn, R-Tenn., told Fox News Digital.\n\"The illegal alien wanted for a hit-and-run in Nashville that left a 21-year-old man wheelchair-bound is exactly the type of person the mayor is protecting. Mayors across the country have a choice: help get these people off our streets or jeopardize the safety of their residents.\"\nO'Connell declined to comment to Fox News Digital.\nLaw enforcement officials said that federal partners, including Homeland Security Investigations, are helping in the ongoing efforts to locate Lopez-Infante.\nCLICK HERE TO GET THE FOX NEWS APP\n\"For us, this has just been an ongoing nightmare. To know that this guy, that we've seen his face, we know who he is, he's out there walking around free and then every single day we're sitting by our son's hospital bed,\" Carach said. \"So, for us, it's kind of a little bit freeing, I guess, that you know they have now finally released his face to the public, and we can have that extra help in finding him.\"\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com"
    },
    {
      "url": "https://www.foxnews.com/category/auto/attributes/racing",
      "text": "Sports 9 hours ago 2025 NASCAR Richmond qualifying: Order for Cook Out 400 Check out the 2025 NASCAR Richmond qualifying order for Cook Out 400\nSports 23 hours ago 2025 NASCAR Odds: Denny Hamlin, Christopher Bell Atop Board For Cook Out 400 Denny Hamlin is first on the board for the Cook Out 400, but another driver is closing in. Check out the early odds for NASCAR's race at Richmond.\nVIDEO 1 day ago Racing star poised to return to NASCAR after having son NASCAR driver Natalie Decker discusses motherhood and her upcoming return to the racetrack on ‘Fox & Friends.’\nNascar 1 day ago NASCAR's Connor Zilisch ironically deemed 'fall risk' after Victory Lane tumble causes broken collarbone NASCAR Xfinity Series star Connor Zilisch was able to get a good laugh as he posted a photo of his ironic wristband while he was in the hospital.\nAuto Racing 2 days ago Driver dies after medical emergency during race in North Carolina Robbie Brewer, 53-year-old Sportsman Series champion and respected competitor, passed away following a medical incident while racing at Bowman Gray Stadium in North Carolina.\nIndyCar Racing 3 days ago In His Own Words: Alex Palou On What Each Win Meant In Title Run From wins at St. Pete and the Indy 500 to the races he lost, Alex Palou reflects on the highs and lows of his historic championship season.\nIndyCar Racing 3 days ago INDYCAR Power Rankings: It's Alex Palou And Then Everyone Else We'll save the dramatics this week. Freshly crowned INDYCAR champion and now four-time title winner Alex Palou is No. 1 in the rankings now and for the foreseeable future.\nIndyCar Racing 3 days ago IndyCar driver Conor Daly rips fellow racer after hard racing leads to nasty wreck: 'It's inexcusable' IndyCar star Conor Daly ripped Christian Rasmussen after aggressive driving at the Bitnile.com Grand Prix of Portland led to a nasty wreck on Sunday.\nNascar 4 days ago NASCAR driver Austin Hill sparks massive wreck at Watkins Glen A NASCAR Xfinity Series race saw a massive crash occur at Watkins Glen International on Saturday featuring Austin Hill, Michael McDowell and others.\nNascar 4 days ago NASCAR driver Connor Zilisch breaks collarbone after hard fall in Victory Lane NASCAR Xfinity Series driver Connor Zilisch took a hard fall as he celebrated a win at Watkins Glen on Saturday and suffered a broken collarbone.\nIndyCar Racing August 7 Mexican IndyCar driver 'caught off guard' by ICE's 'Speedway Slammer' post on social media Pato O'Ward, a Mexican-born IndyCar driver, was \"caught off guard\" by the Department of Homeland Security's post depicting an ICE-sponsored racecar.\nAuto Racing August 5 Veteran driver Chris Raschke dies after losing control at 283 mph during record attempt at Utah salt flats Chris Raschke tragically died Sunday after he lost control of his vehicle while reportedly traveling 283 mph while attempting a record at the Bonneville Salt Flats in Utah.\nNascar July 29 NASCAR driver Stewart Friesen goes airborne, vehicle catches fire in wreck at dirt track race NASCAR Truck Series driver Stewart Friesen suffered some injuries after he was involved in a scary and fiery wreck during a Super DIRTcar Series race.\nIndyCar Racing July 28 Chip Ganassi Relishes Alex Palou's Incredible Season: 'You're Seeing History Made' Team owner Chip Ganassi loves that his driver Alex Palou is on a roll during this historic season and is adamant that the best is yet to come.\nSports July 28 2025 NASCAR Playoffs Standings and Picture After Indy's Brickyard 400 Check the latest 2025 NASCAR Playoff standings and playoff picture following the Indy race. Who's in, who's on the cut line, and what it all means.\nIndyCar Racing July 27 Alex Palou On Brink Of Title With Win No. 8: 'It's Never Over Until It's Over' Alex Palou doesn't even have to win again this season to capture the 2025 INDYCAR title, but it's still head down for the driver of the No. 10 car.\nNascar July 27 Bubba Wallace makes NASCAR history with thrilling Brickyard 400 victory at Indianapolis NASCAR driver Bubba Wallace ended his 110-race winless streak with a historic Brickyard 400 victory, narrowly beating Kyle Larson despite fuel concerns in a dramatic finish.\nNascar July 27 NASCAR driver Aric Almirola blasts Austin Hill over 'intentional' crash: 'That was violent' NASCAR Xfinity Series drivers Austin Hill and Aric Almirola were involved in a massive wreck during the Pennzoil 250 at Indianapolis Motor Speedway.\nSports July 22 Monster truck wheel detaches during show in Washington, destroying multiple cars in nearby parking lot One unlucky fan had their car completely flattened at a monster truck show in Washington over the weekend after a rogue wheel flew out of the arena and into a nearby parking lot.\nSports July 13 Shane van Gisbergen Dominates Again, Wins at Sonoma to Extend Streak Shane van Gisbergen extended his winning streak with yet another dominating run on a road course, this time at Sonoma on Sunday.\nIndyCar Racing July 13 Alex Palou Pads Championship Lead With Iowa Win: 'It's Magical' Alex Palou is on a \"magical\" run, and it seems that only a total collapse could stop him from securing the championship.\nIndyCar Racing July 13 INDYCAR Driver Nolan Siegel Suffers Mild Concussion, Out For Sunday's Race At Iowa Nolan Siegel learned his fate for Sunday's INDYCAR race at Iowa after crashing hard on Saturday.\nAuto Racing July 12 Mother of rising motocross star Aidan Zingg, 16, reveals cause of death following fatal mid-race crash Rising motocross star Aidan Zingg, 16, died after crashing during a race in California last month. On Friday, his family revealed his cause of death was a result of cardiac tamponade.\nFormula One July 9 Christian Horner out as Red Bull team principal in shocking F1 shake-up The Red Bull F1 team will have new team principal as the organization announced the dismissal of Christian Horner on Wednesday in a shocking move.\nIndyCar Racing July 7 IndyCar NXT drivers get involved in terrifying crash An IndyCar NXT race featured a horrific crash between up-and-coming drivers Sebastian Murray and Ricardo Escotto on Sunday afternoon at Mid-Ohio.\nSports June 29 Chase Elliott Stoked After Energizing Crowd With Wild Atlanta Win Chase Elliott — NASCAR's most popular driver — broke his winless streak, and he did it right at home.\nIndyCar Racing June 22 Fuel-Saving Maestro Scott Dixon Can't Save Enough To Beat Alex Palou From now on out, it's all about rolling the dice for Scott Dixon. And he and his team will be throwing Hail Marys for the foreseeable future.\nIndyCar Racing June 22 Alex Palou Breaks Mini Drought and Races to Victory in XPEL Grand Prix at Road America Alex Palou drove to his sixth victory of the season at Road America on Sunday.\nIndyCar Racing June 21 Driver Gifts Cameraman Bottle Of Bourbon After Fall That Went Viral A bottle of bourbon takes the pain away. At least that's what Devlin DeFrancesco is hoping after last week's incident at St. Louis.\nNascar June 16 NASCAR's Shane van Gisbergen recalls fighting queasiness to win Mexico City race NASCAR Cup Series driver Shan van Gisbergen mastered the road course in Mexico City and talked about fighting off an illness in his effort to win the race."
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/northeast/new-jersey",
      "text": "New Jersey 46 mins ago Mother and son arrested at Miami airport after fatal New Jersey street racing crash and escape attempt Alvi Limani and his mother arrested near Miami while attempting to flee to Albania after deadly BMW street race crash in New Jersey.\nFox News Flash 4 hours ago NJ police chief says 'out of control' kids forced new town law that could put parents behind bars Gloucester Township, New Jersey passes ordinance allowing parents to face 90 days in jail and $2,000 fines for their teens' repeated criminal behavior.\nVIDEO 9 hours ago ‘Something’s got to change!’: NJ town targets parents of 'out of control' teens Gloucester Township Police Chief David Harkins discusses a new town law that would hold parents accountable for their children's misconduct and the pushback it's facing from residents.\nVIDEO 1 day ago Skyrocketing energy prices threaten to upend NJ politics Fox News' CB Cotton reports on exploding electric bills riling voters in the Garden State ahead of a critical gubernatorial race.\nNew Jersey 5 days ago Parents could face jail time under New Jersey town's ordinance targeting children's unruly behavior Parents in Gloucester Township, New Jersey, face potential jail time and fines under a new ordinance holding them responsible for preventing children's unruly behavior.\nMassachusetts August 6 'Larger than life' shipwreck explorer dies during deep-sea diving expedition Shipwreck explorer Joe Mazraani, 48, died during a deep-sea dive off the Massachusetts coast, as the investigation into his death continues.\nNew Jersey August 5 New Jersey governor's race: Democrat Sherrill leads Republican Ciatterelli by six points in 2026 bellwether New poll shows Democrat Mikie Sherrill leading Republican Jack Ciattarelli by 6 points in New Jersey's gubernatorial race with three months until election.\nNew Jersey August 4 Fire under NJ train sends passengers fleeing; multiple treated for smoke inhalation Several people were treated for smoke inhalation after a fire erupted under an eastbound PATH train at Newport station, suspending Hoboken and JSQ lines.\nMedia August 4 Democratic senator defends working with Trump after Booker's 'complicity' accusation One Democratic senator responded to Sen. Cory Booker accusing them of being complicit in the harm of the Trump administration because of their support for police legislation.\nNew Jersey August 3 Fighter jets scrambled after civilian aircraft violates Trump airspace at New Jersey Bedminster NORAD aircraft used flares to escort civilian planes out of restricted airspace near Trump's Bedminster golf club after five unauthorized incursions occurred.\nNew Jersey August 3 Boat collision with whale sends passenger overboard, kills 20-foot marine mammal A boat collision with a whale off the Jersey Shore left the 20-foot-long animal dead and sent a passenger overboard. The person is believed to be OK following the incident.\nCrime August 2 Illegal migrant with DUI rap sheet facing vehicular homicide charges after head-on crash kills mom, daughter ICE lodges detainer against suspect charged with vehicular homicide in Lakewood crash that killed woman and her daughter, citing prior DUI arrests.\nNew Jersey August 1 GOP activist reveals why New Jersey is not 'just a Democrat state' in push to flip governorship Republican activist Scott Presler launches voter registration drive in New Jersey to help flip the governorship red, targeting rural areas and diverse communities\nVIDEO July 30 'The Five’: 'Spartacus’ rages at fellow Dems 'The Five' discusses Sen. Cory Booker, D-N.J., yelling on the Senate floor that his colleagues were 'complicit' with President Donald Trump.\nJustice Department July 30 Trump exploits loopholes to keep Alina Habba in US attorney role, triggering court clash Alina Habba's appointment as New Jersey U.S. attorney faces legal challenge from criminal defendant claiming her authority is unlawful after Trump administration maneuvers.\nSenate Democrats July 29 Cory Booker slams Dem colleagues for 'complicity' with Trump in angry 'wake-up call' floor speech Sen. Cory Booker, D-N.J., blasted is own party Tuesday over their refusal to adopt amendments the senator argued will ensure Trump cannot pick winners and losers when it pertains to federal funding.\nNew York Yankees July 26 Yankees star Jazz Chisholm Jr rips Little League for suspending 12-year-old over bat flip celebration Little League player Marco Rocco is getting major league support after he was suspended from a state tournament for flipping his bat during a game. The suspension was overturned.\nAlina Habba July 24 Alina Habba defiant after judges vote against her in New Jersey: 'I don't cower to pressure' Habba signaled that she does not plan to leave her role as the temporary U.S. attorney of New Jersey, announcing she does \"not cower\" to pressure.\nSports July 24 12-year-old Little Leaguer allowed back in state tourney after judge overturns bat flip suspension A New Jersey Little Leaguer's suspension for a bat flip was overturned, allowing the 12-year-old to play in the state tournament game Thursday.\nNew Jersey July 24 Trump stands by Alina Habba as DOJ clashes with judges over her replacement Trump doubles down on Alina Habba's nomination for U.S. attorney in New Jersey after federal judges declined to extend her interim term, creating confusion over who will assume the role.\nHouse Of Representatives July 24 House to vote on censuring Dem rep charged in ICE facility incident New Jersey House Democrat LaMonica McIver faces censure resolution after being indicted for allegedly interfering with federal officers at an immigration facility.\nNew Jersey July 23 Little Leaguer suspended for state tournament game after bat-flipping during epic home run A Little League player in New Jersey was suspended for a state tournament game after celebrating an epic home run with a bat flip last week.\nNew Jersey July 23 New Jersey seagull snatches sandwich out of stunned woman's hand New Jersey beach-goer Victoria Shannon Reed captured the moment an aggressive seagull swooped in and stole her sandwich while she was filming.\nNew Jersey July 22 New Jersey's ban on privately operated ICE detention centers struck down by court A federal appeals court overturned a New Jersey law that blocked private immigration detention centers, citing interference with federal immigration powers.\nJustice Department July 22 DOJ swiftly fires Alina Habba's court-appointed replacement for US attorney in New Jersey Former Trump lawyer Alina Habba faces an uncertain future as a U.S. attorney after judges voted against extending her term, prompting the Trump DOJ to swiftly fire her replacement.\nNew Jersey July 21 Teen lifeguard impaled by beach umbrella returns to work after freak accident: ‘I’m pretty good’ New Jersey lifeguard Alex Kaus returns to work three weeks after a freak accident where a gust of wind caused her to fall onto a beach umbrella stake that impaled her shoulder.\nImmigration July 19 Democrats fume over new plan to house illegal migrants in New Jersey, Indiana military bases Military bases in both New Jersey and Indiana will soon be used by Homeland Security to house illegal immigrants, furious Democrat lawmakers who oppose the move have announced.\nNew Jersey July 16 Man dies after being struck by lightning at New Jersey golf course: report Lightning strike at golf course in New Jersey reportedly claimed the life of 28-year-old golfer Simon John Mariani despite CPR efforts from his father and fellow golfers.\nNew Jersey July 15 NJ flash flooding kills at least 2 after surging waters sweep up vehicle Severe storms brought flooding to New Jersey and Pennsylvania, resulting in two deaths, a house fire, and over 100 flight cancelations at Newark Airport.\nBarack Obama July 14 Obama tells Democrat big wigs to 'toughen up,' start backing candidates that can actually win Barack Obama calls for Democrats to show courage and stand up for what they believe in, while pointing out that Democrats' increasing propensity to elect far-left candidates is not a winning strategy."
    },
    {
      "url": "https://www.foxnews.com/category/auto/make/bmw",
      "text": "VIDEO May 3 Economist warns about this ‘dramatic upheaval’ in the auto market due to Trump tariffs Economist Doug Holtz-Eakin discusses the Trump administration’s quest to make new trade deals with foreign countries and more on ‘Fox News Live.’\nUS Crime January 8 TikToker whose speeding BMW killed 6 farmworkers avoids possible 55-year prison sentence with plea deal Noah Galle reached a plea deal with prosecutors in which he was sentenced to 12 and a half years in prison after he pleaded guilty to six counts of vehicular homicide for a car crash that left six people dead.\nTECH August 21 The next-gen humanoid robot is knocking at your door Figure of California has introduced its Figure 02, its second-generation humanoid robot designed for production lines at commercial sites.\nCrime July 6, 2024 Dead body found wrapped in sleeping bag on New York City sidewalk Police are investigating the discovery of a dead body which was found wrapped in a sleeping bag on top of a dolly on a New York City sidewalk Friday.\nCrime November 18, 2023 Man fatally flung from hood of BMW while trying to stop car thieves Video shows the moment a New York City man was fatally flung from the hood of a BMW after he tried to stop thieves from stealing out of his car.\nVIDEO October 19, 2023 Footage shows aftermath of Malibu crash that killed four Pepperdine students Pepperdine University seniors Niamh Rolston, Peyton Stewart, Asha Weir and Deslyn Williams died Tuesday after a driver lost control of his BMW on the Pacific Coast Highway, according to the Los Angeles Sheriff's Department.\nVIDEO May 3, 2023 Fairfax County Police Officer narrowly avoids getting hit by out-of-control car Dashcam footage shows Fairfax County Police Officer narrowly avoiding serious injury in May 1 crash. (Credit: Fairfax County Police Department)\nNew York Auto Show February 23, 2023 What is the best car in the world? The World Car of the Year award will be announced at the New York International Auto Show in April and the 10 finalists have been revealed.\nBMW January 5, 2023 BMW's 'Dee' is the color-changing car of the future The BMW i Vision Dee is a concept car that previews new technologies the brand will debut in an all-new electric car that's set to launch in 2025.\nTECH December 11, 2022 Automakers like BMW, GM, and Mercedes charge monthly fees for faster speeds, heated seats and more Optional extras have been around since the dawn of auto sales, but subscription services for anything from Wi-Fi hotspot to self-driving mode are relatively new.\nBMW November 29, 2022 BMW 'Batmobile' returns at a super high price The BMW 3.0 CSL has been resurrected with styling inspired by the original 1970's 'Batmobile' race car. The model also has BMW's most powerful straight-six engine ever.\nFox News Car Reviews September 30, 2022 Review: The 2022 BMW i40 M50 is a sprinter The BMW i4 M50 electric compact four-door can outsprint a BMW M3 for a lower price, but can only drive 227 to 270 miles between battery charges.\nGermany August 16, 2022 Self-steering BMW cuts into oncoming traffic, killing 1 One person is dead and nine are injured after a self-steering BMW test vehicle veered into oncoming traffic in Germany. BMW says the driver 'retains responsibility.'\nBMW July 13, 2022 BMW's V12 engines are dead amid electric shift BMW has ended production of V12 engines as it adds more electric models to its lineup. A final run of a dozen 7-series sedans with V12s has been sold out.\nFox News Car Reviews June 24, 2022 Review: The 2022 BMW iX electric SUV is so futuristic it can fix itself\nBMW February 21, 2022 BWW's new car is a $350,000 work of art The BMW 8 X Jeff Koons is a limited edition version of the M850i xDrive Gran Coupe that features a paint scheme created by the artist and is priced at $350,995.\nBMW January 19, 2022 BMW is killing the V12 engine this summer BMW will end production of its V12 engines this June. A dozen M760i xDrive Final V12 models will be sold in the U.S. to mark the occasion.\nMedia December 30, 2021 WSJ editorial mocks auto manufacturers getting 'double-crossed' by Biden admin: 'Hard not to get a chuckle' The Wall Street Journal editorial board mocked traditional automotive manufacturers in a Wednesday editorial for allowing themselves to be \"double-crossed\" by the Biden administration over new fuel-economy standards.\nBMW November 30, 2021 Blocky American-made BMW XM is brand's most powerful vehicle ever The BMW Concept XM heralds a new high performance plug-in hybrid SUV that will go on sale next year. The 750 hp vehicle is set to be built at BMW's South Carolina factory.\nBMW October 22, 2021 Test drive: The 2021 BMW M4 keeps it old school The 2021 BMW M4 is equipped with a standard manual transmission and rear-wheel-drive to enhance the entertainment factor.\nBMW June 2, 2021 BMW's new i4 electric car doesn't look like one The BMW i4 electric four-door hatchback has been revealed with a starting price of $56,395 and a range of up to 300 miles per charge.\nMaintenance April 6, 2021 5 vehicles you might not want to buy new (and 5 you do) Some cars hold their value a lot better than others after just 12 months of ownership, according to a new report from iseecars.com.\nBMW September 25, 2020 Test drive: The BMW X7 M50i would make a good pickup The luxury SUV is a capable and comfortable hauler.\nBMW August 7, 2020 BMW driver survives being crushed between 2 semitrucks The accident occurred on a ramp to the M1 highway in Loughborough, U.K., on Wednesday, SWNS reported.\nTest Drives July 30, 2020 Test drive: The 2020 BMW M340i is MMM good The sports sedan is the best of both BMW world's.\nBMW July 23, 2020 A $35,000 BMW M3 sold for $250,000, here's why The compact performance coupe is rising in value among car collectors.\nBMW March 25, 2020 BMW deletes, apologizes for insensitive coronavirus-themed promotional tweet #FlattenTheCurve joke falls flat.\nMaintenance March 12, 2020 Firefighters rescue man with hand stuck in his car's trunk lid How many firefighters does it take to change a lightbulb?"
    },
    {
      "url": "https://www.foxnews.com/category/us/crime/homicide",
      "text": "Bryan Kohberger 3 mins ago Bryan Kohberger called his mom while returning to Idaho murder scene the next day, expert reveals Bryan Kohberger called his mother multiple times after killing four University of Idaho students, including when he returned to the crime scene, forensic analysis reveals\nKentucky 2 hours ago Louisville woman shot and killed walking child to school bus stop Kentucky police are searching for the shooter who killed a woman at a school bus stop in Louisville. Children witnessed the deadly shooting.\nNew York 5 hours ago Homicide investigator warns against rushing bikini designer's yacht death probe as lawyer reveals new details East x East fashion founder Martha Nolan died on 54-foot yacht owned by business investor while going through divorce; homicide squad investigating.\nVIDEO 6 hours ago Bryan Kohberger 'relentlessly taunted' by inmates, says criminal defense attorney Criminal defense attorney Donna Rotunno analyzes the death of designer Martha Nolan-O'Slatarra, reports of Bryan Kohberger being taunted in jail, and the arrest of four suspects in the robbery at Brad Pitt’s home on 'America's Newsroom.'\nTrue Crime 22 hours ago Idaho killer Bryan Kohberger complains to guards about inmate taunts with target on his back: report Bryan Kohberger faces harassment from fellow inmates at Idaho Maximum Security Institution after pleading guilty to murdering four Idaho students, report says\nVIDEO 1 day ago Attorney Arthur Aidala says relatives of Martha Nolan met with homicide detectives The prominent New York attorney says he is now representing her family and that the cause of her death remains inconclusive as of Wednesday afternoon.\nVIDEO 1 day ago Staten Island mother and wanted son nabbed attempting to flee the US A mother and her 20-year-old son, who is accused in a fatal New Jersey crash, were nabbed by authorities on a tarmac and taken to Middlesex County Correctional Facility. (Jonathan Girabel via Storyful)\nVIDEO 1 day ago Atlanta CDC shooter expressed 'discontent' with COVID-19 vaccine: Report Senior correspondent Jonathan Serrie reports the latest on the shooting at the Centers for Disease Control headquarters that left an officer dead.\nWashington DC 1 day ago DC’s 100th homicide of year puts popular neighborhood on edge as police hunt for killer A 33-year-old man was killed in Northwest D.C. Monday evening, marking the first homicide since the Trump administration took control of the Metropolitan Police Department.\nCrime 1 day ago Polite stranger's 'yes ma'am, no sir' demeanor suddenly turned violent in murder of country singer's mom Random home invasion murder rocks peaceful Shenandoah Valley as Kevin Walker kills Holly Hatcher, mother of Nashville country singer Spencer Hatcher, in Timberville.\nCrime 1 day ago ‘Radical’ DC officials treated officers ‘like crap,’ police leader says – 7 attacks that led to Trump takeover President Donald Trump moves to federalize policing in Washington, D.C., following string of violent crimes including carjackings and shootings targeting government officials.\nCrime 1 day ago New Uvalde body camera video captures parents pleading with officers during 70-minute delay Body cam video from Uvalde school shooting reveals parents pleading with officers to act. Nearly 400 law enforcement waited over 70 minutes to respond.\nVIDEO 1 day ago Video shows parents begging cops to storm Uvalde elementary school after 2022 shooting Body camera footage from police shows desperate parents begging officers to storm an elementary school in Uvalde, Texas, after a gunman opened fire in 2022. (Uvalde County Sheriff's Department)\nPolice and Law Enforcement 1 day ago CDC shooter had police contacts over suicide, used father's guns in attack: officials The man accused of killing a police officer while shooting at the U.S. Centers for Disease Control and Prevention (CDC) headquarters in Atlanta had previously been reported to police for suicidal thoughts and launched the deadly attack with his father’s weapons to send a message against COVID-19 vaccines, authorities said Tuesday.\nU.S. 2 days ago Mountain town rocked after country singer's mom murdered in random home invasion A Virginia sheriff said the fatal home invasion stabbing of the mother of an an up-and-coming country music singer is unlike “anything\" he's ever seen.\nVIDEO 2 days ago US Attorney for DC Jeanine Pirro says she does not 'need any more statistics' on crime U.S. Attorney for D.C. Jeanine Pirro speaks out about those shot and killed in the nation's capital and the city's juvenile crime.\nVIDEO 2 days ago National Guard will get the 'worst of the worst' off DC streets: Chris Swecker Former FBI assistant director Chris Swecker and former Assistant District Attorney Phil Holloway discuss President Donald Trump's crackdown on crime on 'The Faulkner Focus.'\nVIDEO 2 days ago DC Police Union agrees with Trump: 'Crime is out of control' D.C. Police Union Chairman Greggory Pemberton explains how data is manipulated to make it appear that crime in the capital city is going down on 'Varney & Co.'\nImmigration 2 days ago ICE Houston arrests more than 350 gang members -- and it's not just MS-13 In Trump’s first six months back in office, ICE Houston has arrested more than 350 illegal migrants tied to over 40 gangs — including violent street crews like MS-13 and Tren de Aragua.\nTrue Crime 2 days ago Alex Murdaugh appeal challenging murder convictions faces state pushback over jury influence claims The South Carolina Attorney General's Office argues Alex Murdaugh was convicted on overwhelming evidence, not clerk's comments, in response to appeal challenging double murder convictions.\nVIDEO 3 days ago Gunman opens fire at Texas Target store Austin Police said at least two people were killed after a gunman opened fire at a Target store. Police also said the suspect was detained. (Credit: KTBC)\nVIDEO 3 days ago Mother of son caught in DC crossfire weighs in on Trump’s crime crackdown Tamara Tarpinian-Jachym, the mother of a murdered congressional intern, weighs in on President Donald Trump’s takeover of Washington, D.C. police on ‘The Story.’\nMigrant Crime 3 days ago Rachel Morin's family slams illegal immigrant killer at sentencing: 'He can't hurt anyone else' Convicted killer Victor Martinez-Hernandez sentenced to consecutive life terms for strangling Rachel Morin, 37-year-old mother, on Maryland trail in 2022.\nHomicide 3 days ago Country singer's mother killed in home invasion before father shoots intruder dead in Virginia Holly Hatcher, the mom of country singer Spencer Hatcher, was killed in a home invasion before her husband fatally shot the attacker in self-defense.\nVIDEO 3 days ago Trump's DC crime clean-up is not a partisan issue: Doug Burgum Fox News correspondent Alexandria Hoff has the details on President Donald Trump's public safety emergency. Interior Secretary Doug Burgum pushes back against Democrats' claim that crime is down in Washington, D.C.\nVIDEO 3 days ago Rachel Morin's family to confront migrant killer at sentencing Patty Morin, whose daughter Rachel was brutally killed by an illegal immigrant, joins 'Fox & Friends' to discuss her thoughts ahead of the sentencing hearing and how she wants her daughter to be remembered.\nManhunt 3 days ago Special Forces vet exposes tactics of Montana, Washington state survivalists: 'Can't stay hidden forever' Former soldier Michael Brown was on the run while Travis Decker evades a massive manhunt following Montana bar shooting and Washington child murders as authorities deploy.\nHomicide 3 days ago Man arrested on suspicion of murder after woman’s body found at remote California campsite California authorities arrested a Nevada man for murder after a woman's body was discovered at a remote Sierra County campsite early Friday morning.\nCrime 4 days ago Rural Montana residents predicted bar massacre suspect's violent outburst: 'He will kill you' Michael Paul Brown was on the run after allegedly shooting four people at The Owl Bar in Anaconda, Montana, with police searching rugged mountain terrain\nNew York 4 days ago Woman found dead on yacht sparks scrutiny of Montauk’s party scene and rising wealth The sudden death of a young fashion entrepreneur has shaken the idyllic coastal town of Montauk — and raised fresh concerns about how a once tranquil, tight-knit fishing community is being reshaped by wealth, influencers, and the seasonal arrival of the yacht-owning nouveau riche."
    },
    {
      "url": "https://www.foxnews.com/category/entertainment/genres/crime",
      "text": "New Jersey 59 mins ago Mother and son arrested at Miami airport after fatal New Jersey street racing crash and escape attempt Alvi Limani and his mother arrested near Miami while attempting to flee to Albania after deadly BMW street race crash in New Jersey.\nNew York 1 hour ago NYPD releases dramatic body cam footage of officers tackling alleged teen gunman in Brooklyn chase Brooklyn teen faces multiple gun charges after NYPD officers chase and arrest him following shots fired call, body camera video shows incident.\nVIDEO 1 hour ago Former Trump staffer reveals she 'never felt safe' living in DC Political strategist Tiffany Marie Brannon former Trump White House staffer Gabrielle Cuccia join 'Fox News @ Night' to discuss President Donald Trump's take over of the Washington, D.C. police.\nVIDEO 2 hours ago Bondi puts sanctuary cities on notice after DC federal takeover, answers if other areas could be next Attorney General Pam Bondi told Fox News Digital she's demanding answers from sanctuary jurisdictions on what they're doing to cooperate with the Trump administration after D.C. police federal takeover.\nKentucky 2 hours ago Louisville woman shot and killed walking child to school bus stop Kentucky police are searching for the shooter who killed a woman at a school bus stop in Louisville. Children witnessed the deadly shooting.\nWashington DC 3 hours ago Trump's federal crime operation brings 100 arrests, 800 National Guard troops to Washington Trump's federal crime task force makes 45 arrests overnight in Washington, D.C., while protests emerge against National Guard deployment and police takeover.\nImmigration 3 hours ago DC police announce major action on immigration enforcement after Trump's crime crackdown DC police chief authorizes sharing information with immigration agencies during traffic stops but prohibits arrests based solely on federal immigration warrants.\nVIDEO 3 hours ago DC shop owners speak out on juvenile crime after massive robbery Sajib Uddula and Tamika Alston, the owners of a store that was robbed by juveniles, discusses Washington D.C.’s crime problem and more on ‘America Reports.’\nNevada 3 hours ago Dramatic video shows Nevada casino gunman immediately opening fire on responding officers Bodycam footage shows Reno officers engaging with armed suspect Dakota Hawver after police say he killed Justin Aguila, Andrew Canepa and Angel Martinez at Grand Sierra Resort casino.\nVIDEO 3 hours ago Controversial college 'health kits' go viral, spark debate 'Outnumbered' reacts to some parents sending their children to college with Narcan."
    },
    {
      "url": "https://www.foxnews.com/politics/ice-captures-illegal-immigrant-wanted-allegedly-killing-mother-dui-crash",
      "text": "EXCLUSIVE: Immigration and Customs Enforcement captured an Ecuadorian illegal immigrant who is facing vehicular homicide charges in Minnesota on Friday.\nThe August crash, in which German Adriano Llangari Inga allegedly had a blood alcohol content \"twice the legal limit,\" killed mother Victoria Eileen Harwell, and hurt her teenage daughter and sister, according to DHS and local media outlets.\n\"Despite a lack of cooperation from local Minnesota authorities, ICE arrested criminal illegal alien German Llangari Inga. This criminal illegal alien has been evading prosecution for vehicular homicide that resulted in the death of Minnesota mom, Victoria Eileen Harwell,\" Assistant Secretary Tricia McLaughlin said in a statement on Tuesday.\nWHITE HOUSE RIPS MINNESOTA DEMS AFTER ILLEGAL IMMIGRANT CHARGED IN DUI DEATH OF MOTHER: 'ON THE RUN'\nHe was arrested by Hennepin County Sheriff’s Office on May 10 \"on an outstanding warrant,\" but then released on May 13 without notifying ICE despite the detainer request placed by the agency on that day, according to the Department of Homeland Security.\nThere was another detainer placed by ICE in August when the crash occurred, but Hennepin County Sheriff’s Office told Fox News Digital that because of the state Attorney General’s guidance, they \"cannot lawfully hold individuals in custody based solely on an administrative detainer issued by the Department of Homeland Security or Immigration and Customs Enforcement (ICE).\"\n\"If a judicially-signed warrant is presented to HCSO, ICE will be notified when it becomes the holding agency. In the absence of such a warrant, individuals must be released once all criminal charges or holds have been resolved. HCSO is committed to working with federal and local partners and honoring the constitutional rights of all individuals,\" HCSO’s statement at the time added.\nIn August, he was in county jail for two days.\nCLICK HERE FOR MORE IMMIGRATION COVERAGE\n\"Despite Hennepin County refusing to honor this criminal illegal alien’s detainer TWICE, ICE officers tracked him down and removed this criminal from Minnesota’s streets. Tim Walz should be thanking ICE not using despicable rhetoric. Remember sanctuary politicians are fighting for criminal illegal aliens. President Trump and Secretary Noem are fighting for the victims of illegal alien crime, like Eileen Harwell,\" McLaughlin continued.\nEarlier this month, the Trump White House took aim at Minnesota leaders because the man was still at large. According to ICE, he first came to the United States in June 2016 and \"was detained by U.S. Customs and Border Protection, issued an order of expedited removal and placed into removal proceedings.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"An illegal immigrant drove drunk, killed an innocent mother, and is now on the run because Democrats didn't do their most important job: protect their constituents,\" Alex Pfeiffer, White House Principal Deputy Communications Director, told Fox News Digital in an exclusive statement at the time.\nFox News Digital reached out to Hennepin County Sheriff’s Office on Tuesday."
    }
  ],
  "argos_summary": "Alvi Limani, 20, and his mother Vilma Vneshta, 42, were arrested in Miami after attempting to flee to Albania following a fatal street racing crash in New Jersey that resulted in the death of Limani's friend, Albion Hysenaj. Limani faces multiple charges including aggravated manslaughter and vehicular homicide, while Vneshta is charged with hindering apprehension. The crash occurred during a reckless street race on the Garden State Parkway, where Limani was allegedly driving at 112 mph in a 55 mph zone.",
  "argos_id": "XZF4M8MA5"
}