{
  "url": "https://www.usatoday.com/story/news/politics/2025/08/14/feds-conduct-raid-outside-newsom-event/85667080007/",
  "authorsByline": "Terry Collins",
  "articleId": "7198bb274f2c4b6e8f69abf2bbe45dc5",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/14/USAT/85665463007-20250814-t-195350-z-62264802-rc-277-gahdad-6-rtrmadp-3-usaelectiontexasredistrictingnewsom.JPG?crop=5499,3093,x0,y0&width=3200&height=1800&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T22:19:30+00:00",
  "addDate": "2025-08-14T22:24:03.140634+00:00",
  "refreshDate": "2025-08-14T22:24:03.140636+00:00",
  "score": 1.0,
  "title": "Federal agents conduct apparent raid outside Newsom event in Los Angeles",
  "description": "As California Gov. Gavin Newsom called for a special election for redistricting, numerous federal agents conducted a raid nearby.",
  "content": "• In response, Newsom and his press office posted about the agents' presence on social media.\n• Los Angeles Mayor Karen Bass called the timing of the patrol \"a provocative act\" and \"unbelievably disrespectful.\"\n\nJust as California Gov. Gavin Newsom was announcing a special election for state redistricting at a cultural center in Downtown Los Angeles, numerous federal agents showed up nearby.\n\nWhile Newsom was inside the Japanese American National Museum on Aug. 14, stating his proposed changes to California’s congressional districts to counter Texas Republicans' plans to create more GOP-friendly districts in their state, a group of federal agents was conducting immigration enforcement patrols in L.A.'s Little Tokyo district.\n\nNewsom and his press office both took to social media to announce the agents’ presence, with an homage to President Donald Trump's punctuation and rhetoric.\n\n“BORDER PATROL HAS SHOWED UP AT OUR BIG BEAUTIFUL PRESS CONFERENCE! WE WILL NOT BE INTIMIDATED!” the post said.\n\nU.S. Border Patrol Sector Commander Gregory Bovino told KNBC-TV that the agency was conducting roving immigration enforcement patrols in the area. Bovino told the station that one person was taken into custody and detained for being in the U.S. illegally.\n\nLos Angeles Mayor Karen Bass later told news media on site, \"There’s no way this was a coincidence,\" noting that the news conference featuring Newsom, Attorney General Rob Bonta and Sen. Alex Padilla, among others, was well-publicized.\n\n\"They decided they were going to come and thumb their nose in front of the governor’s face,\" Bass said. \"Why would you do that? That is unbelievably disrespectful. It’s a provocative act. They’re talking about disorder in Los Angeles, and they are the source of the disorder in Los Angeles right now.\"\n\nThe Department of Homeland Security did not immediately return USA TODAY's request for comment about the patrol in the area.",
  "medium": "Article",
  "links": [
    "https://x.com/GovPressOffice/status/1956061011225780421",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.instagram.com/p/DNWNQiTyOMW/",
    "https://www.usatoday.com/story/news/politics/2025/08/14/california-special-election-redistricting-gerrymandering/85664690007/",
    "https://usatoday.com/story/news/politics/2025/08/13/congressional-seats-redistricting-2026/85622742007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/07/12/immigration-raid-cannabis-farm-california-photos/84792904007/",
    "https://x.com/GavinNewsom/status/1956067038822326666",
    "https://www.nbclosangeles.com/news/local/live-updates-border-patrol-immigration-raid-newsom-trump/3764338/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Los Angeles Mayor Karen Bass",
      "weight": 0.099204704
    },
    {
      "name": "immigration enforcement patrols",
      "weight": 0.08940291
    },
    {
      "name": "Los Angeles",
      "weight": 0.08836585
    },
    {
      "name": "roving immigration enforcement patrols",
      "weight": 0.08815965
    },
    {
      "name": "Downtown Los Angeles",
      "weight": 0.08811839
    },
    {
      "name": "California Gov. Gavin Newsom",
      "weight": 0.08753864
    },
    {
      "name": "Gavin Newsom",
      "weight": 0.08662544
    },
    {
      "name": "Newsom event",
      "weight": 0.08619424
    },
    {
      "name": "Federal agents",
      "weight": 0.085059285
    },
    {
      "name": "federal agents",
      "weight": 0.085059285
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9580078125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.896484375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.619140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.4990234375
    },
    {
      "name": "/News/Local News",
      "score": 0.4111328125
    }
  ],
  "sentiment": {
    "positive": 0.043523133,
    "negative": 0.7669589,
    "neutral": 0.18951799
  },
  "summary": "The timing of the apparent raid outside of California Gov. Gavin Newsom's event was criticized as \"provocative\" as he was announcing a special election for state redistricting. The federal agents were conducting immigration enforcement patrols in L.A.'s Little Tokyo district, where one person was taken into custody for being in the U.S. illegally. Los Angeles Mayor Karen Bass called the timing of these patrols \"unbelievably disrespectful\" and \"no coincidence\" as the news conference featuring Newsom, Attorney General Rob Bonta and Sen. Alex Padilla was well-publicized. The Department of Homeland Security did not immediately respond to the request for comment.",
  "shortSummary": "Federal agents conducted an apparent raid on a California governor's event, prompting criticism from officials and constituents in Los Angeles.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f398ea8f4a7c48e882e3edb051d3c082",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://usatoday.com/story/news/politics/2025/08/13/congressional-seats-redistricting-2026/85622742007/",
      "text": "Why Democrats have limited power to fight Republican redistricting\nRepublicans plan to re-draw districts in Florida, Ohio and Texas. Democrats have limited power to fight back.\nThough Democrats such as New York Gov. Kathy Hochul say they will \"fight fire with fire\" and counter Texas Republicans' planned redistricting, the GOP is in a much stronger position to alter congressional maps in its favor before the 2026 midterms.\nRepublicans could flip at least nine seats in the House of Representatives if they redraw district maps in heavily populated states where they have the power to redistrict.\nDemocrats, on the other hand, are hamstrung in the biggest blue states such as California and New York, which have enacted redistricting changes to prevent one party from having too much control over map-drawing.\nIn all, five new Republican seats could come from Texas, two to three from Ohio, and at least one from Florida. The ruby-red states of Indiana and Missouri have discussed redrawing their maps and could add one seat each, but they have not taken steps forward. The number of seats Democrats could win is less clear because the process would be slower and less certain.\nMichael McDonald, a political science professor at the University of Florida, said the purpose of Democrats pushing back on Republican efforts to redistrict \"is really to shine a light on the Republicans' anti-democratic tendencies\" as part of their messaging strategy.\nThe mid-decade redistricting movement could provide a short-run benefit to Republicans, who are at risk of losing their 219-212 majority in the House of Representatives.\nThough states typically redistrict every decade in the two years that follow the new census, President Donald Trump has encouraged redistricting to happen ahead of 2026. Even several seats may not be enough to withstand the tendency of the party in the White House to lose seats in between presidential elections. In 2010, under President Barack Obama, the House of Representatives swung toward Republicans by 63 seats.\nHere’s a look at where redistricting is in progress, and where leaders have said they're considering redrawing their maps.\nThe process is moving in Texas, Florida and Ohio\nRepublicans' biggest gains in redistricting would come from Florida, Ohio and Texas, the most populous states with unified Republican control of state government. All of these states are taking action related to redistricting, and the resulting maps could provide Republicans up to nine new seats.\nIn Texas, the Republican-led state Legislature is moving aggressively to pass a new congressional map with five new districts likely to lean Republican. Democrats left the state in protest to deny their colleagues a quorum, but Republican Gov. Greg Abbott issued arrest warrants for the Democrats who fled, and Trump suggested the FBI may have to force them back to the state.\n\"I’m a little skeptical that that shift is going to be enough to withstand what’s going to happen in the larger blue wave that’s likely to happen in the 2026 election nationally in response to Trump,\" McDonald said of the five congressional seats Texas Republicans are trying to capture.\nOhio was already planning to redraw its congressional map because of gerrymandering reform language in the state Constitution. Because no Democrats in the state Legislature voted in favor of the new maps drawn in response to the 2020 Census, the Republican-approved map could legally be used only in 2022 and 2024.\nThe Legislature must draw a new map and pass it by Nov. 30. Observers are expecting two to three more seats to lean Republican, possibly affecting voters in the Akron, Cincinnati and Toledo areas.\nFlorida House of Representatives Speaker Daniel Perez has announced a special committee for redistricting that will focus exclusively on the state’s congressional map, not state legislative maps. He said there is limited time to handle additional redistricting and points to a recent state Supreme Court case that upheld the Republican-friendly congressional map.\nGov. Ron DeSantis said Aug. 11 that Florida should have gotten an additional seat during the 2020 census and raised questions about the congressional districts in South Florida. Politico pointed to any of three Democratic-held seats in south Florida as possible targets. The Washington, DC-based news outlet Punchbowl reports that Republicans want at least three seats from a new map.\nIndiana and Missouri consider redrawing, too\nAdditional Republican congressional seats could be drawn in the staunchly Republican states of Indiana and Missouri − one in each state − but the process for doing so is not as far along as in other states. Governors of both states would need to call special legislative sessions to have the maps redrawn.\nVice President JD Vance took the unusual step of visiting Indiana to meet with some of the state’s top Republican officials Aug. 7 and discuss redistricting. Though Republicans already hold seven of the state’s nine congressional seats, an expert says they have their eyes on the 1st Congressional District, which covers the northwest corner of Indiana and includes the suburbs of Chicago. It’s more moderate than the other Democratic-leaning district, which encompasses Indianapolis, and the Cook Partisan Voting Index now ranks the district as a slight Democratic lean, so changing the boundary to add GOP voters could tip the balance. Republicans also have targeted the seat in past elections.\nRepublicans hold a supermajority in the state Legislature in Missouri. The state has eight congressional seats, and only two are held by Democrats. Republicans are eyeing Missouri’s 5th District, according to the Missouri Independent. The district encompasses a large portion of the Kansas City area and is held by Democratic Rep. Emanuel Cleaver. But even the Republican Legislature rejected a similar map in 2022 that gave seven seats to the Republicans, according to St. Louis Public Radio.\nDemocratic states grapple with redistricting changes\nDemocrats who run populous states are considering redistricting, but some of them face a hurdle: Their parties don’t have control over drawing legislative maps. Instead, the power is in the hands of independent commissions, something often left-leaning pro-democracy advocates have supported to enact fair maps that reduce gerrymandering.\nIn California, the only state more populous than Texas, Gov. Gavin Newsom wants to hold a special election in November so voters can greenlight a one-time redistricting plan to add seats for Democrats, according to ABC 7 News. He wants five to six seats in time for 2026, according to CalMatters. The congressional maps that are drawn every decade are usually completed by the California Citizens Redistricting Commission, which includes Democrats, Republicans and independents.\nNew York Gov. Kathy Hochul wrote in an Aug. 5 op-ed that she's looking at ways to redraw the maps. \"If Republicans are changing the rules, we’ll meet them on the same field,\" she wrote.\nThat includes asking voters to approve a constitutional amendment to allow for mid-decade redistricting, according to City & State New York. The move would bypass the state’s independent redistricting commission, which essentially stops the Democrat-led Legislature from drawing its own maps. Change wouldn’t come before 2028.\nIllinois Gov. JB Pritzker said in a social media post Aug. 10 that Congress should pass new, fair maps, but he added that until that happens, \"Democratic states must consider all the options to protect our constitutional republic.\" Common Cause, a left-leaning nonpartisan group that supports redistricting reform, gives Illinois an F grade for its maps that are drawn by the Democrat-led state Legislature. It's not clear how many seats Illinois could gain or when.\nNew Jersey has a redistricting commission that was created by a state constitutional amendment. A change to the process would require a change to the state constitution, according to Politico. Despite the long odds, House Minority Leader Hakeem Jeffries specifically told CNN he’d be interested in redistricting New Jersey. Gov. Phil Murphy didn’t rule it out, but also hasn't taken action, making any seats gained unclear.\n\"Never bring a knife to a gunfight,\" Murphy told the New Jersey Globe on July 21, quoting a Sean Connery movie. \"So if that’s the way we’re going, we’re from Jersey, baby, and we won’t be laying down.\"\nContributing: Columbus Dispatch reporter Jessie Balmert; Indianapolis Star reporters Brittany Carloni, Tony Cook and Kayla Dwyer; and Tallahassee Democrat reporter Gray Rohrer"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/14/california-special-election-redistricting-gerrymandering/85664690007/",
      "text": "California Gov. Gavin Newsom announces special election to re-draw maps\nCalifornia is the most populous state in the union and the only one with more seats in Congress than Texas.\nCalifornia Gov. Gavin Newsom announced Thursday that his state would hold a special election Nov. 4 to ask voters to approve a mid-decade redistricting plan.\nNewsom made the announcement after criticizing President Donald Trump and Texas Republicans for intending to redraw that state's congressional map ahead of the 2026 elections to create more Republican-leaning congressional districts. Redistricting efforts are also ongoing in Florida and Ohio that could benefit Republicans. Indiana and Missouri are also Republican-controlled states discussing redistricting.\nAltogether, those efforts could yield Republicans nine or more additional seats to bolster their House 219-212 majority in advance of an election that may favor the Democrats, as Trump's approval rating sags.\nCalifornia has an independent redistricting commission that is designed to limit partisan influence on the map-drawing process, but Newsom said voters could approve a measure to allow a new process to draw maps that would go into effect for House elections in 2026, 2028, and 2030, before ceding power back to the commission to draw maps ahead of 2032.\n\"We will affirm our commitment to the state independent redistricting after the 2030 census, but we're asking the voters for their consensus to do mid-decade redistricting,\" Newsom said. He did not say how many seats he is seeking to flip from Republican-leaning to Democratic-leaning.\nHe called on Congress to pass a national law that creates a national redistricting commission to effectively end partisan gerrymandering nationwide, and blamed Republicans in Congress for not backing such a proposal in the past.\nChristian Martinez, a regional press secretary for the Republicans' congressional campaign arm, criticized Newsom's announcement on social media as a \"stunt\" that \"has nothing to do with Californians and everything to do with consolidating radical Democrat power.\"\nA longtime Democratic stronghold, California is the most populous state in the union and the only state with more seats in Congress than Texas.\n\"I know they say, 'Don't mess with Texas,'\" Newsom quipped. \"Well, don't mess with the great Golden State.\""
    }
  ],
  "argos_summary": "California Governor Gavin Newsom announced a special election for mid-decade redistricting to counter Republican efforts in Texas and other states that could yield additional GOP seats in Congress. This announcement coincided with federal immigration enforcement patrols in Los Angeles, which Mayor Karen Bass criticized as a provocative act meant to undermine Newsom's press conference. The redistricting efforts in Republican-controlled states like Texas, Florida, and Ohio could potentially add nine or more seats to the GOP's House majority, while Democrats face challenges in enacting their own redistricting plans.",
  "argos_id": "YKRWG4VTI"
}