{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/trump-new-docs-show-absolute-proof-guilt-clapper-comey-creating/",
  "authorsByline": "https://www.washingtontimes.com/staff/kerry-picket/, Kerry Picket, The Washington Times https://www.washingtontimes.com",
  "articleId": "f66a9590ffab486483b258fd43f82d7e",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2016/02/25/aptopix_apple_encryption_c0-0-4873-2842_s1200x700.jpeg?fbf4ceda28664963bdfee8d99a702bdb620bf0bb",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T20:27:25+00:00",
  "addDate": "2025-08-14T20:36:40.114070+00:00",
  "refreshDate": "2025-08-14T20:36:40.114071+00:00",
  "score": 1.0,
  "title": "Trump: New docs show ‘absolute proof of guilt’ for Clapper, Comey in creating Russia collusion hoax",
  "description": "President Trump said declassified documents show “absolute proof of guilt” that former Director of National Intelligence James Clapper and former FBI Director James Comey conspired to sabotage his 2016 campaign.",
  "content": "President Trump said declassified documents show “absolute proof of guilt” that former Director of National Intelligence James Clapper and former FBI Director James Comey conspired to sabotage his 2016 campaign.\n\nThe president called the newly revealed documents “incredible” evidence of wrongdoing.\n\n“They’re sick people, and they’re criminals, and they should be taken care of,” Mr. Trump told reporters Thursday in the Oval Office. “We’ll see what happens. But Clapper and Comey and that whole group of criminals. They’re criminals.”\n\nHe added, “They did the fake Russia, Russia, Russia witch hunt that lasted for two years, and I got totally exonerated. … It was a whole scheme to try and demean Trump so that I couldn’t win an election.”\n\nDirector of National Intelligence Tulsi Gabbard this week declassified documents showing a Dec. 22, 2016, email exchange between Mr. Clapper and former National Security Agency Director Mike Rogers discussing the “joint product related to Russian attribution and intent for the DNC/DCCC hacks.”\n\nMr. Clapper was resolute about “stickin’ to” the narrative that Russia meddled in the 2016 presidential election to benefit Mr. Trump, despite a former top intelligence official saying otherwise in e-mail exchanges.\n\nIt is the latest trove of declassified documents that has shed new light on how Mr. Clapper and other Obama administration officials manipulated intelligence about Mr. Trump’s links to Moscow.\n\nMr. Clapper said last month that he “lawyered up” after Ms. Gabbard made a criminal referral to the Justice Department about the Trump-Russia hoax.\n\nIn the newly declassified documents, Mr. Clapper discussed the Obama administration’s endeavor to overhaul an intelligence community assessment on Russian interference as a “team sport” and said they may need to “compromise” their standards, Ms. Gabbard said Wednesday.\n\nMr. Rogers cautioned that his team raised concerns about pushing the report out too fast and their lack of time to review the intelligence and weigh in on the matter.\n\n“I know that this activity is on a fast track and that folks have been working very hard to put together a product that can be provided to the President,” Mr. Rogers wrote in the email. “However, I wanted to reach out to you directly to let you know of some concerns I have with what I am hearing from my folks.”\n\n“I asked my team if they had sufficient access to the underlying intelligence and sufficient time to review that intelligence. On both points, my team raised concerns,” Mr. Rogers wrote to Mr. Clapper.\n\n“I’m concerned that given the expedited nature of this activity, my folks aren’t fully comfortable saying that they have had enough time to review all of the intelligence to be absolutely confident in their assessments,” he wrote.\n\n“To be clear, I am not saying that we disagree substantively, but I do want to make sure that when we are asked in the future whether we can absolutely stand behind the paper, that we don’t have any reason to hesitate because of the process.”\n\nMr. Clapper pressured the former NSA director, though, to push forward.\n\n“Understand your concern. It is essential that we (CIA/NSA/FBI/ODNI) be on the same page, and are all supportive of the report — in the highest tradition of ‘that’s OUR story, and we’re stickin’ to it,’” Mr. Clapper wrote back.\n\nHe rejected any talk that any additional time was necessary to review the intelligence.\n\n“We will facilitate as much mutual transparency as possible as we complete the report … but, more time is not negotiable,” Mr. Clapper said.\n\n“We may have to compromise on our ‘normal’ modalities, since we must do this on such a compressed schedule,” he said, adding, “This is one project that has to be a team sport.”\n\nThe e-mail exchange happened within days of a Dec. 9, 2016, meeting between President Obama, Mr. Clapper, CIA Director James Brennan and other top administration officials. At the meeting, Mr. Obama called for a report that described the “tools Moscow used and actions it took to influence the 2016 election.”\n\nThe Washington Times reached out to Mr. Clapper for comment.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Clapper",
      "weight": 0.11351203
    },
    {
      "name": "Mr. Trump",
      "weight": 0.103553034
    },
    {
      "name": "Mr. Rogers",
      "weight": 0.09598511
    },
    {
      "name": "Mr. Obama",
      "weight": 0.095331326
    },
    {
      "name": "James Clapper",
      "weight": 0.08406655
    },
    {
      "name": "Clapper",
      "weight": 0.07929115
    },
    {
      "name": "former FBI Director James Comey",
      "weight": 0.076673195
    },
    {
      "name": "former National Security Agency Director Mike Rogers",
      "weight": 0.070960276
    },
    {
      "name": "President Trump",
      "weight": 0.07028885
    },
    {
      "name": "declassified documents",
      "weight": 0.06917065
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9892578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.97314453125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6865234375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.65185546875
    },
    {
      "name": "/Law & Government/Government/Intelligence & Counterterrorism",
      "score": 0.6181640625
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.396240234375
    }
  ],
  "sentiment": {
    "positive": 0.06600006,
    "negative": 0.71164936,
    "neutral": 0.22235057
  },
  "summary": "President Trump has accused former Director of National Intelligence James Clapper and former FBI Director James Comey of creating the \"Trump-Russia hoax\" scandal, claiming they conspired to undermine his 2016 campaign. The president called the newly revealed documents \"incredible\" evidence of wrongdoing. The documents also reveal a Dec. 22, 2016, email exchange between Clapper and ex-NSA Director Mike Rogers discussing the \"joint product related to Russian attribution and intent for the DNC/DCCC hacks\" and that Clapper was adamant about maintaining the narrative that Russia meddled in the 2016 presidential election to benefit Mr. Trump. The new documents shed new light on how the Obama administration manipulated intelligence about Mr. Donald Trump's links to Moscow and how the intelligence community was manipulated.",
  "shortSummary": "President Trump claims newly declassified documents prove James Clapper and James Comey guilty of creating a Russia collusion hoax to discredit him.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "60997ad7e9de4d8390f82a10296be872",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Trump claims that newly declassified documents provide \"absolute proof of guilt\" against former intelligence officials James Clapper and James Comey for conspiring to undermine his 2016 campaign. The documents reveal discussions about manipulating intelligence regarding Russian interference in the election, with Clapper insisting on a unified narrative despite concerns from other officials about the rushed process. Trump has labeled Clapper and Comey as criminals, asserting that their actions were part of a scheme to discredit him during the election.",
  "argos_id": "YR3VW6G2V"
}