{
  "url": "https://www.foxnews.com/politics/mamdani-points-bronx-population-loss-proof-nycs-affordability-crisis-during-his-anti-trump-tour",
  "authorsByline": "Deirdre Heavey",
  "articleId": "639b223088474be9a022e357bac2af2e",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/07/mamdani-trump-getty.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T15:41:49-04:00",
  "addDate": "2025-08-14T19:52:06.815553+00:00",
  "refreshDate": "2025-08-14T19:52:06.815554+00:00",
  "score": 1.0,
  "title": "Mamdani points to Bronx population loss as proof NYC’s affordability crisis during his anti-Trump tour",
  "description": "Democratic mayoral nominee, Zohran Mamdani, visited a small business in the Bronx to attack Trump's tax policies while connecting the president to his rival candidate, Andrew Cuomo.",
  "content": "New York City Democratic mayoral nominee Zohran Mamdani traveled uptown to the Bronx on Thursday for the fourth day of his \"Five Boroughs Against Trump\" tour, arguing that President Donald Trump's administration is hurting small businesses.\n\n\"We are here today on the fourth stop of our five borough tour, to speak about how Bronx sites can not afford the city that they call home, Mamdani said. \"That is a struggle that many residents of the Bronx feel individually. It's also a struggle that I know our small businesses are feeling at this moment. From 2020 to 2022, the population of the Bronx dropped by 6.3%. That's more than any other borough in New York City. People are leaving this further, leaving this city because it's too expensive. We are the most expensive city in the United States of America.\"\n\nThroughout the week, Mamdani has connected Trump to his leading competitor in the race, former Gov. Andrew Cuomo, who lost the Democratic primary to Mamdani in June and is now running as an independent candidate.\n\nThe theme continued on Thursday as the Mamdani campaign visited Nohble, a small business in the Bronx, where he argued that both Trump and Cuomo have handed \"tax breaks to billionaires and megacorporations\" throughout their political careers. Meanwhile, Mamdani has made affordability the central message of his campaign.\n\nTrump's \"big, beautiful bill,\" which narrowly passed Congress last month, has been widely celebrated by Republicans for extending Trump's 2017 tax cuts and adding deductions on tipped wages and overtime, while reducing spending on Medicaid and clean energy and strengthening border security.\n\nMAMDANI TAKES AIM AT TRUMP'S IMMIGRATION POLICIES IN FIERY STATEN ISLAND SPEECH: 'WE ARE FIGHTING TO KEEP NYC A SANCTUARY CITY'\n\nBut Democrats have been quick to claim that Trump's megabill handed tax breaks to the wealthy while cutting benefits to the most vulnerable – a key Democratic message ahead of competitive midterm elections expected in 2026.\n\nWhile Republicans argue the bill only cuts waste, fraud and abuse in Medicaid, according to the Congressional Budget Office (CBO), about 10 million more people will be uninsured by 2034 due to Trump's mega-bill.\n\nAs national Democrats slam Trump's tax breaks, Mamdani has criticized Cuomo's own record as governor, which includes offering $3 billion in tax breaks for the failed Amazon HQ2 deal in Queens, expanding $420 million-a-year film industry credits and launching \"Tax-Free NY\" zones to give businesses 10 years without state taxes.\n\nThroughout the week, Mamdani has criticized Cuomo following The New York Times report that Trump spoke on the phone with Cuomo about how to defeat Mamdani in November. Meanwhile, Mamdani has described how his administration would be Trump's \"worst nightmare.\"\n\n\"As we see Donald Trump and Andrew Cuomo trip over themselves to reward those who already have a fortune, we will stand up and fight for those that have been forgotten,\" Mamdani said on Staten Island on Wednesday at an anti-Trump event focused on immigration.\n\nTrump made waves on the 2024 presidential campaign trail when he held a rally in the Bronx and then visited a local barber shop in the borough.\n\nThe focus on deep blue New York City was seen as politically unusual for a Republican candidate, but Trump spent weeks in New York City for his criminal trial and often used the Big Apple as his own personal campaign trail.\n\nDuring the rally, Trump vowed to \"turn New York City around,\" promising to make the city \"bigger, better and greater than ever before.\"\n\nThe Republican candidate also spoke with voters at Knockout Barbershop in the Bronx, taking questions from locals grappling with economic hardship.\n\n\"We see far too many parallels between Donald Trump and Andrew Cuomo, far too many stories that make clear that both administrations have been characterized by corruption, by a sense of impunity, by an inability of an executive to understand that no means no, a prioritization of the interests of billionaires over working people, and an agenda that is driven by little else beyond the retention and accumulation of power,\" Mamdani said on Monday in Manhattan.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe White House did not immediately respond to Fox News Digital's comment request, but said on Monday, ahead of Mamdani's first anti-Trump event, \"The American people have repeatedly rejected this Communist agenda and the more Mamdani shares his radical policies, the more the American people will recoil.\"",
  "medium": "Article",
  "links": [
    "https://nohble.com/",
    "https://www.foxnews.com/politics/zohran-mamdani-vows-trump-proof-nyc-fiery-staten-island-event",
    "https://www.nytimes.com/2025/08/06/nyregion/trump-nyc-mayor-cuomo-adams-mamdani.html",
    "https://www.empirecenter.org/publications/ny-gov-andrew-cuomo-calls-for-tax-free-business-zones-around-college-campuses/",
    "https://www.foxnews.com/video/6376887002112",
    "https://www.foxnews.com/media/trump-tells-bronx-barbershop-what-he-would-do-differently-elected-second-time-its-all-about-people",
    "https://nypost.com/2022/01/14/ny-lawmakers-slam-film-tv-and-cuomo-corporate-tax-breaks/",
    "https://www.foxnews.com/category/person/donald-trump",
    "https://www.foxnews.com/tech/amazon-pulls-out-of-plan-to-build-new-york-city-headquarters",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/politics/trump-vows-save-deep-blue-new-york-city-masive-historic-bronx-rally",
    "https://www.foxnews.com/category/person/andrew-cuomo",
    "https://www.foxnews.com/politics/mamdani-zings-cuomo-rent-stabilized-housing-spat-during-anti-trump-tour-stop"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.08868808
    },
    {
      "name": "Trump",
      "weight": 0.086102
    },
    {
      "name": "New York City Democratic mayoral nominee Zohran Mamdani",
      "weight": 0.083902255
    },
    {
      "name": "Mamdani",
      "weight": 0.07825726
    },
    {
      "name": "Zohran Mamdani",
      "weight": 0.07768563
    },
    {
      "name": "New York City",
      "weight": 0.077138826
    },
    {
      "name": "tax breaks",
      "weight": 0.07159044
    },
    {
      "name": "deep blue New York City",
      "weight": 0.0708287
    },
    {
      "name": "New York Times",
      "weight": 0.0685077
    },
    {
      "name": "Andrew Cuomo",
      "weight": 0.067645386
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.97607421875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.84814453125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.77099609375
    },
    {
      "name": "/News/Local News",
      "score": 0.7216796875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.69921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.399169921875
    }
  ],
  "sentiment": {
    "positive": 0.037810538,
    "negative": 0.84722203,
    "neutral": 0.114967376
  },
  "summary": "New York City Democratic mayoral nominee Zohran Mamdani has made his anti-Trump campaign a focus on affordability in the city. He argues that President Donald Trump's administration is hurting small businesses and points out that the Bronx population has dropped by 6.3% from 2020 to 2022 due to high costs. Mamdan has also connected Trump to his competitor, former Gov. Andrew Cuomo, who is now running as an independent candidate. The campaign also highlighted the importance of affordable housing for small businesses. The \"Big, Beautiful\" bill, which passed Congress last month, has been criticized by Republicans for extending Trump's 2017 tax cuts and reducing spending on Medicaid and clean energy, while Democrats claim it gives tax breaks to the wealthy while reducing benefits to the most vulnerable.",
  "shortSummary": "New York City Democratic mayoral nominee Zohran Mamdani's tour highlights the city's affordability crisis, criticizing President Donald Trump's administration for economic policies and tax breaks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b7c0c50c100d4b2ca0415ece04fb4a13",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/person/andrew-cuomo",
      "text": "New York City 1 hour ago Mamdani rivals defiant against dropping out despite facing long odds in NYC mayor battle NYC mayoral race features Zohran Mamdani leading polls against Andrew Cuomo, Curtis Sliwa, and Eric Adams as candidates debate dropping out strategy.\nEric Adams 1 day ago NYC Mayor Eric Adams picks up former Democratic governor's endorsement Former New York Gov. David Paterson noted that he is backing incumbent New York City Mayor Eric Adams for re-election in the city's mayoral contest.\nNew York City 2 days ago New poll exposes trouble for rivals in heated NYC mayoral race as one candidate takes commanding lead A new Siena poll shows Democratic nominee Zohran Mamdani maintaining a strong lead in New York City mayoral race against Cuomo, Sliwa, and Adams.\nZohran Mamdani 2 days ago Mamdani zings Cuomo in rent-stabilized housing spat during anti-Trump tour stop NYC mayoral candidate, Zohran Mamdani, has faced criticism from former Gov. Andrew Cuomo over his rent-stabilized apartment amid his anti-Trump tour through New York City.\nZohran Mamdani 3 days ago Cuomo proposes 'Zohran's law' to protect rent-stabilized housing from the wealthy A political feud erupted between former Gov. Andrew Cuomo and Zohran Mamdani over affordable housing policies and rent-stabilized apartments in NYC mayoral contest.\nNew York 4 days ago Cuomo supporters look to wealthy enclave to take down Mamdani: report Andrew Cuomo supporters urge Hamptons residents to switch voter registration to NYC to vote against Democratic socialist mayoral candidate Zohran Mamdani.\nAndrew Cuomo 4 days ago Cuomo calls out NYC mayoral candidate Mamdani over rent-stabilized apartment: 'Move out immediately' Former governor Andrew Cuomo has criticized mayoral rival Zohran Mamdani for allegedly living in a rent-stabilized apartment while earning a more than six-figure income.\nZohran Mamdani 6 days ago Chicago's budget shortfall puts spotlight on Mamdani's 'socialism' agenda for New York City NYC mayoral frontrunner Zohran Mamdani faces criticism over costly socialist policies that opponents warn could create a fiscal crisis similar to Chicago.\nPolitics August 7 Mamdani vows to be Donald Trump’s ‘worst nightmare’ as president weighs working with rival in NYC mayor race NYC socialist mayoral candidate Zohran Mamdani said his administration will be President Trump's \"worst nightmare\" while claiming Trump is conspiring with his opponent.\nOpinion August 7 DAVID MARCUS: How a Trump-Cuomo alliance can save New York City Trump and Cuomo could form unlikely alliance in New York City mayor's race as Cuomo trails socialist Zohran Mamdani by 13 points in current polling\nZohran Mamdani August 6 Cuomo flips script on Mamdani for owning property in Uganda despite its anti-LGBT laws: 'Silence is violence' NYC mayoral candidate Andrew Cuomo took a shot at socialist opponent Zohran Mamdani over Uganda's strict anti-LGBT track record in a social media post Tuesday.\nZohran Mamdani August 4 Top Dem senator reveals socialist Mamdani is what her party should look like: 'You bet' Senator Elizabeth Warren backs Zohran Mamdani's NYC mayoral campaign, praising his focus on housing, childcare and affordability for working families.\nZohran Mamdani July 31 Mamdani, Cuomo clash over who is better at supporting law enforcement after Manhattan mass shooting NYC mayoral candidates Zohran Mamdani and Andrew Cuomo clash over law enforcement support after a Manhattan office building shooting that left four dead.\nPolitics July 30 Deadliest NYC shooting in decades takes center stage in mayoral race as candidates spar on public safety Fox News Digital reached out to all four NYC mayoral candidates for a response to the Monday shooting in midtown Manhattan that left four dead, including an NYPD officer.\nNew York City July 28 Mamdani's past 'defund the police' stance resurfaces after deadly Manhattan shooting A Midtown Manhattan mass shooting brings renewed attention to NYC Democratic mayoral nominee Zohran Mandani's evolving stance on policing ahead of November's election.\nZohran Mamdani July 22 Cuomo tones down Trump rhetoric after stunning loss to Mamdani in NYC mayor primary After his defeat at the hands of Zohran Mamdani in the Democratic Party mayoral primary in New York City, former Gov. Andrew Cuomo reset his campaign: less Trump and more affordability.\n2025 Elections Coverage July 21 DeSantis has message for Cuomo after former governor jokes he would move to Florida Florida Governor Ron DeSantis had a special request for New York City mayoral candidate Andrew Cuomo after the former Democratic governor joked he would move to the Sunshine State.\nSanctuary Cities July 21 Eric Adams responds to Tom Homan pledge to ‘flood the zone’ with ICE agents after CBP shooting After Tom Homan vowed to “flood the zone\" with ICE agents in response to the shooting of a CBP agent in NYC, Mayor Eric Adams weighed in on whether he'll cooperate.\nZohran Mamdani July 21 Poll Position: Mamdani's the frontrunner, but isn't running away with NYC mayoral race just yet Polls show Zohran Mamdani narrowly leading Andrew Cuomo in the NYC mayoral race, with incumbent Mayor Eric Adams and Republican Curtis Sliwa trailing in an unusually competitive election.\nNew York City July 20 Mamdani to take extended Africa trip amid campaign for mayor of New York Democratic socialist mayoral candidate Zohran Mamdani taunted critics while announcing a planned trip to Uganda and campaigning to lead New York City.\nNew York July 19 Cuomo quips ‘even I will move to Florida’ if Mamdani wins NYC mayoral bid At a Hamptons event, former Gov. Andrew Cuomo joked he’d move to Florida if far-left Zohran Mamdani became NYC mayor to a room of donors and supporters.\nVIDEO July 16 NYC mayoral candidate's campaign ad shows him helping jump-start a vehicle A new campaign ad from New York City mayoral candidate Andrew Cuomo shows the former New York governor helping to jump-start a vehicle.\nAndrew Cuomo July 16 Andrew Cuomo jump-starts car and political comeback in new NYC mayoral campaign advertisement Former governor Andrew Cuomo faces backlash for his latest mayoral campaign video, yet vows to continue his race as an independent candidate after losing the Democratic primary.\nZohran Mamdani July 16 Dem Disorder: DNC squabbles play out in NYC mayoral race for all to see Democratic socialist Zohran Mamdani's primary win exposes generational divides and reignites debates within the Democratic Party about moving left or center.\nDonald Trump July 15 Trump says Cuomo's got a 'good shot' of beating Mamdani in NYC mayor election Trump comments on NYC's mayoral race between Cuomo and Mamdani, calling Mamdani a 'communist' while suggesting the progressive's primary win may not secure the election.\nMedia July 15 Andrew Cuomo talks rematch with Mamdani, says socialist's policies will cause 'death' of NYC During a new interview, former New York governor Andrew Cuomo declared that Democratic New York City mayoral candidate Zohran Mamdani's policies would cause the \"death\" of the city.\nBarack Obama July 15 Former Obama staffer rips Cuomo campaign video: 'No message, no charisma' Former Obama aide Dan Pfeiffer ripped Andrew Cuomo's campaign video as not compelling as the former governor takes on Zohran Mamdani in November.\nNew York Liberty July 15 WNBA champ Natasha Cloud mocks Andrew Cuomo as he vows to stay in NYC mayoral race New York Liberty guard Natasha Cloud needled former New York Gov. Andrew Cuomo as he announced he was staying in the race for New York City mayor as an independent.\nNew York City July 14 Cuomo opponents slam his re-entry into NYC mayor race, say city wants to move on from ex governor New York City mayoral candidates Mamdani, Sliwa, and Adams criticize Andrew Cuomo's decision to stay in the race as an independent after losing the Democratic primary by 12 points.\nAndrew Cuomo July 14 'In it to win it': Cuomo refuses to back down in heated NYC mayoral race against Zohran Mamdani Andrew Cuomo vows to stay in the NYC mayoral race as an independent following his primary defeat, joining a general election that includes incumbent Mayor Eric Adams."
    },
    {
      "url": "https://www.foxnews.com/tech/amazon-pulls-out-of-plan-to-build-new-york-city-headquarters",
      "text": "Amazon announced Thursday it was turning back on its plans to build its second headquarters in New York City, the company said in a statement. The move comes after backlash from lawmakers, notably Congresswoman Alexandria Ocasio-Cortez, who bemoaned the project.\n\"After much thought and deliberation, we’ve decided not to move forward with our plans to build a headquarters for Amazon in Long Island City, Queens,\" the Seattle-based Amazon said in the release.\n\"For Amazon, the commitment to build a new headquarters requires positive, collaborative relationships with state and local elected officials who will be supportive over the long-term. While polls show that 70% of New Yorkers support our plans and investment, a number of state and local politicians have made it clear that they oppose our presence and will not work with us to build the type of relationships that are required to go forward with the project we and many others envisioned in Long Island City,\" the statement reads.\nOCASIO-CORTEZ CHEERS AS AMAZON REPORTEDLY RECONSIDERS NY HQ AFTER FIERCE OPPOSITION\nThe company added that it is \"disappointed to have reached this conclusion.\"\n\"We are deeply grateful to Governor Cuomo, Mayor de Blasio, and their staffs, who so enthusiastically and graciously invited us to build in New York City and supported us during the process,\" the company continued in the statement.\nIn a statement provided to Fox News, de Blasio said that New York City gave Amazon an opportunity and it \"threw away that opportunity.\"\n\"You have to be tough to make it in New York City. We gave Amazon the opportunity to be a good neighbor and do business in the greatest city in the world,\" de Blasio said in the statement. \"Instead of working with the community, Amazon threw away that opportunity. We have the best talent in the world and every day we are growing a stronger and fairer economy for everyone. If Amazon can’t recognize what that’s worth, its competitors will.”\nOcasio-Cortez tweeted that \"anything is possible,\" taking a victory lap upon hearing the news.\nBankrate.com's senior economic analyst Mark Hamrick called it a \"stunning development,\" adding: \"For those who didn’t want Amazon to bring the promised 25,000 new jobs and added economic vitality to the area: Be careful what you wish for.\"\nAMAZON EXECS GRILLED, JEERED AT NEW YORK CITY COUNCIL HEARING OVER HQ2\nThe opposition against HQ2 has been mounting in recent months. In December, for example, Amazon execs were grilled and jeered at a New York City Council meeting over the deal.\nEarlier this month, reports surfaced that Amazon was reconsidering its plans for its New York office, which led to cheers from Ocasio-Cortez. \"Can everyday people come together and effectively organize against creeping overreach of one of the world’s biggest corporations? Yes, they can,\" the freshman lawmaker tweeted.\nOcasio-Cortez has also slammed the company for having bias in its facial recognition technology.\nAMAZON'S NEW YORK HQ2 CANCELLATION DRAWS FIERY RESPONSES FROM LAWMAKERS, TECH WORLD\nIn a statement, New York Gov. Andrew Cuomo expressed his frustration over Amazon's nixed New York City headquarters. \"Bringing Amazon to New York diversified our economy away from real estate and Wall Street, further cementing our status as an emerging center for tech and was an extraordinary economic win not just for Queens and New York City, but for the entire region, from Long Island to Albany's nanotech center,\" he said. \"However, a small group politicians put their own narrow political interests above their community -- which poll after poll showed overwhelmingly supported bringing Amazon to Long Island City -- the state's economic future and the best interests of the people of this state. The New York State Senate has done tremendous damage. They should be held accountable for this lost economic opportunity.\"\nAmazon said it would proceed as planned with the second part of its HQ2, which will be built in Northern Virginia, as well as its distribution center that it said it would open in Nashville. It will also continue to \"hire and grow across our 17 corporate offices and tech hubs in the U.S. and Canada.\"\nThe deal was greeted with much fanfare when it was announced last year and was lauded as a major economic boost.\nTENNESSEE 'VERY INTERESTED' IN AMAZON HQ2 AFTER NYC STRIFE\nCuomo and New York City Mayor Bill de Blasio had touted the benefits of Amazon's HQ2, which included a pledge from the tech giant to create 25,000 jobs, paying an average of $150,000 per year in exchange for a slew of city and state tax breaks and subsidies worth up to $3 billion.\nIn addition to the 25,000 jobs, Amazon would've brought $2.5 billion in Amazon investment and eventually 8 million square feet of office space to Long Island City as part of its investment announced last November. The Seattle-based company said it would have generated \"incremental tax revenue of more than $10 billion over the next 20 years as a result of Amazon’s investment and job creation.\"\nAccording to a December Quinnipiac University poll, 57 percent of New York City residents support Amazon’s arrival in the region, compared to just 26 percent who oppose the deal, Fox Business previously reported.\nAMAZON CANCELED NYC HQ 'LIKE A PETULANT CHILD,' LOCAL POLITICIAN SAYS\nAmazon faced fierce opposition over the tax breaks it was offered in New York, with critics complaining that the project was an extravagant giveaway to one of the world's biggest companies and that it wouldn't provide much direct benefit to most New Yorkers.\n\"This announcement marks a landmark victory for our communities and shows the power of the people, even when taking on the world's richest man,\" said Deborah Axt, co-executive director of the anti-poverty group Make the Road New York.\nShe said the Amazon was getting \"taxpayer giveaways\" so that it could \"force its empire-building on our neighborhoods.\"\nThere had also been concerns about what Amazon's decision could do to already rising real estate prices in the area, but Hamrick said Thursday's announcement won't solve those problems.\nCLICK HERE TO GET THE FOX NEWS APP\n\"From a broader view, this decision will do nothing to resolve the challenges associated with housing affordability voiced by critics of the Amazon decision and the generous tax incentives offered by government,\" Hamrick said in comments obtained by Fox News. \"That requires a bigger conversation which could very well unfold along with the 2020 election cycle.\"\nFox News' James Rogers, Christopher Carbone and the Associated Press contributed to this report. This story has been updated with comment from Mayor de Blasio and Ocasio-Cortez."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-vows-save-deep-blue-new-york-city-masive-historic-bronx-rally",
      "text": "NEW YORK – Former President Trump has broken political norms by visiting one of the most deep-blue areas in New York City, a town not necessarily known for its kindness to Republicans.\nTrump rallied a crowd of what his campaign estimated to be 25,000 supporters at Crotona Park in the Bronx on Thursday, far more than the initial 3,500 it said were expected to attend. Those numbers appeared to also include those lined up outside the event – who waited hours for a shot at getting inside even after the event began. Law enforcement sources later told The New York Post that between 8,000 and 10,000 attended.\n\"I'm here tonight to declare we are going to turn New York City around, and we are going to turn it around very, very quickly,\" Trump said after taking the stage, vowing to bring back safety and better schools to the city. \"We are going to make New York bigger, better and greater than ever before.\"\nBIDEN'S ABORTION SCRIPT FLIPPED BY BUSINESSWOMAN'S BOOST TO PRO-LIFE GROUPS\nTrump praised the history of New York, but lamented that it was \"now a city in decline.\"\n\"I've never seen it quite like this,\" he said, noting the violent crime taking place on subways and homeless encampments across the city.\nTrump went on to rail against President Biden, saying he wasn't \"getting the job done\" for the people of the Bronx, and that he was \"grossly incompetent.\"\n\"If a New Yorker can't save this city, no one can,\" Trump declared to loud cheers. \"Who said we're not going to win New York?\"\nTOP KENNEDY STAFFER STEPS DOWN FROM ROLE CITING ‘HATEFUL AND DIVISIVE ATMOSPHERE’\nHe vowed, if elected, to work with Democrat Gov. Kathy Hochul and Democrat Mayor Eric Adams to fix the city and state, including renovating the subway system, cleaning up the parks and removing the homeless and mentally ill from the streets.\nTrump also used the speech to rail against the economic downturn facing the country under the Biden administration, with an emphasis on how he said it affected Black and Hispanic families the most, and repeated some of his often used lines about energy, inflation and being \"weak\" on the foreign stage.\nNear the end of the speech, he recited Al Wilson's song, \"The Snake,\" which he often uses as a metaphor to criticize uncontrolled illegal immigration.\nThe thousands of people gathered to see the former president were a diverse group of people, including what Fox News Digital noted were Black, Hispanic, White, Asian and Muslim supporters. A number of attendees traveled from as far as Pennsylvania, New Jersey and Connecticut. Many said they were from the Bronx, Brooklyn or Queens.\nThe former president touted his visit on social media ahead of the rally, while his campaign declared he was \"unafraid to bring his message to every borough of New York, to every corner of this great country, because he believes his message is a winning one.\"\nAt one point, someone in the crowd appeared to suffer from a medical incident. Trump paused his speech and asked if anyone in the audience was a doctor. He called for someone to bring water, and after a few minutes people in the area gave thumbs-up signs. Trump responded with a fist pump, thanked the \"doctor\" who assisted and resumed his remarks.\nTrump was the first Republican presidential candidate to actively campaign for the general election in New York City in decades, and, should he pull off what many expect to be an impossible feat, would be the first to win the Empire State in 40 years.\nTrump won less than 10% of the vote in the Bronx in his 2016 presidential election victory. His support in the Bronx edged up to 16% in his 2020 re-election defeat, with Biden winning 83.5% of the vote, but current polls suggest the former president is making more gains with Black and Hispanic voters.\nTrump’s campaign thinks the former president can make a dent in Biden's support among both demographics.\nMany people in attendance told Fox News Digital that their main concerns in the upcoming election were the economy, inflation and illegal immigration. They said they believed President Biden's performance on those issues would lead to more New Yorkers voting for Trump.\nCLICK HERE TO GET THE FOX NEWS APP\nCritics planned a counterprotest to the massive rally, with the Bronx Democratic Party holding their own event in the same park. Fox News Digital noticed a small group of about a few hundred protesters outside the event, but police cleared them out with no massive disruption.\nThey left before the end of Trump's remarks, and late-arriving Trump fans could be seen sprinting up the hill after making their way through security to try and catch a glimpse of the 45th president.\nThe event came during a brief pause in Trump's criminal trial in Manhattan. Closing arguments are expected when court resumes on Tuesday, following a break for the Memorial Day federal holiday."
    },
    {
      "url": "https://www.foxnews.com/politics/mamdani-zings-cuomo-rent-stabilized-housing-spat-during-anti-trump-tour-stop",
      "text": "Zohran Mamdani, New York City's Democratic mayoral nominee, continued his \"Five Boroughs Against Trump\" tour in Brooklyn on Tuesday, as President Donald Trump's agenda continues to take center stage on the New York City campaign trail.\nSpeaking at the Flatbush Gardens Community Center, Mamdani's second anti-Trump event of the week was focused on housing, a hot-button issue in the New York City mayoral race as former Gov. Andrew Cuomo has spent days criticizing Mamdani's rent-stabilized apartment in Astoria.\n\"We must remember that Andrew Cuomo has spent more time talking about my apartment than asking why so many New Yorkers are being forced out of theirs. He has spent more time criticizing me than he has in criticizing the legislation that Donald Trump has passed,\" Mamdani said on Tuesday.\nMamdani began his week-long tour alongside Rep. Jerry Nadler, D-N.Y., in Manhattan on Monday morning. After visiting Brooklyn on Tuesday, Mamdani will travel to Staten Island on Wednesday, the Bronx on Thursday and Queens on Friday, Fox News confirmed.\nCUOMO PROPOSES 'ZOHRAN'S LAW' TO PROTECT RENT-STABILIZED HOUSING FROM THE WEALTHY\nThe 33-year-old self-described socialist's tour is a rejection of the Trump administration's sweeping second-term agenda and his so-called \"authoritarian\" attack on working New Yorkers, with Tuesday's event focused on housing.\nZOHRAN MAMDANI LAUNCHES ANTI-TRUMP TOUR ACROSS FIVE BOROUGHS IN NEW YORK CITY\n\"While housing experts are ringing the alarm, Andrew Cuomo is ringing Donald Trump,\" Mamdani said.\nDuring Mamdani's events on Monday and Tuesday, reporters peppered the 33-year-old socialist candidate with questions about Cuomo's latest policy proposal – \"Zohran's law.\"\nThe former governor, who lost the Democratic mayoral primary to Mamdani in June, began trolling the assemblyman over the weekend with an edited video of Mamdani admitting he pays \"$2,300 for my one bedroom in Astoria.\"\n\"Rent-stabilized apartments when they're vacant should only be rented to people who need affordable housing, not people like Zohran Mamdani,\" Cuomo told reporters in a video posted on social media.\nCuomo said \"Zohran's law\" was designed to prevent high-income individuals from occupying rent-stabilized apartments.\nBut Mamdani fired back at Cuomo's criticism on Tuesday, telling reporters, \"It pains me to say that in our disgraced former Governor Andrew Cuomo's mind, these units, these buildings, these tenants are but a political pawn.\"\nChief among Mamdani's now-infamous progressive policy proposals is his commitment to freezing rents.\n\"As Mayor, Zohran will immediately freeze the rent for all stabilized tenants, and use every available resource to build the housing New Yorkers need and bring down the rent,\" according to Mamdani's campaign website.\nMamdani has accused incumbent Mayor Eric Adams of appointing Rent Guidelines Board members to raise rents on stabilized apartments. While landlords and advocates argue the freeze would be illegal, Mamdani can accomplish this goal by appointing members to the board who wouldn't vote to increase the rent.\nFormer Mayor Bill de Blasio's board voted to freeze the rent three times during his tenure.\nCuomo had previously called the democratic socialist's plan to freeze rent a \"politically convenient posture,\" and said such a move would hurt landlords who would be \"unable to maintain their buildings.\"\nAs Cuomo's fiery social media posts about Mamdani's rent-controlled apartment made the rounds, de Blasio – who has yet to endorse a candidate in the race to run the nation's most populous city – fired back at his former governor.\n\"I did a rent freeze and almost 2 million hard-working New Yorkers benefited. @ZohranKMamdani wants to do a rent freeze. You know who doesn’t want to do a rent freeze? @andrewcuomo, and he thinks he can trick us into forgetting that,\" de Blasio trolled on X.\nDuring the first stop on his anti-Trump tour on Monday, Mamdani responded to Cuomo's freshly proposed law \"that will keep the rich out of New York’s affordable housing.\"\n\"What do we know about this policy proposal beyond the fact that it seeks to evict me from my apartment?\" Mamdani questioned on Monday.\n\"Like so much of Andrew Cuomo's politics, it is characterized by a petty vindictiveness. It leaves far more questions than it has answers. How many New Yorkers would this apply to? How many New Yorkers would be evicted from their apartments? How many New Yorkers would have their lives upended by a former governor who is responding to the fact that he was handily beaten by a tenant of a rent-stabilized apartment?\" Mamdani asked.\n\"I live rent-free in his head,\" Mamdani trolled Cuomo, arguing that he had many years to implement such policies as governor but is now only focused on trying to reckon with a \"political defeat.\"\nSoon after Mamdani's criticism, the Cuomo campaign unveiled his proposal to protect rent-stabilized apartments from being occupied by high-income individuals.\n\"Under Cuomo’s proposal, when a rent-stabilized apartment becomes vacant, the incoming individual income would be capped so that the annual rent makes up at least 30 percent of that income. For example, if an apartment rents for $2,500 a month ($30,000 per year), the new tenant’s income could not exceed $100,000,\" according to the plan.\nThe Cuomo campaign also clarified that \"Zohran's law\" would only apply to vacant apartments.\nMamdani poured cold water on Cuomo's plan during the press conference on Tuesday, telling reporters, \"What is so absurd to me about Andrew Cuomo's proposal is that it wouldn't even apply to me. The way that he has put forward this language does not actually apply to me, and yet he uses my name in it.\"\nWhen reached for comment regarding Mamdani's anti-Trump tour, White House spokeswoman, Abigail Jackson, told Fox News Digital, \"Comrade Mamdani is the American people’s worst nightmare. His communist policies will crater our economy, increase crime, crowd out Americans with free health care for illegal immigrants, and defund the brave men and women of law enforcement who keep us safe.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe White House added that \"Mamdani's idea of ‘immigration reform’ is no borders and amnesty for all the violent criminal illegal aliens that Joe Biden released into our country. The American people have repeatedly rejected this Communist agenda and the more Mamdani shares his radical policies, the more the American people will recoil.\"\nFox News' Marly Carroll and Bryan Llenas contributed to this report."
    },
    {
      "url": "https://www.empirecenter.org/publications/ny-gov-andrew-cuomo-calls-for-tax-free-business-zones-around-college-campuses/",
      "text": "High-tech businesses from other states and abroad that move onto or next to college campuses in New York would operate free of all business, property and personal income taxes for up to 10 years under a proposal released Wednesday by Gov. Andrew Cuomo.\nCuomo said the plan would create jobs in a long-stagnant upstate economy by connecting academic research campuses with businesses in those fields.\n“We create great businesses here in this state because we have great schools and we have great young minds,” Cuomo said Wednesday in Buffalo during a daylong tour of announcements.\n“We lose them in the first year. Why? Because we have an anti-business reputation, we’re a high-tax state,” said Cuomo, a Democrat. “What we want to do is create an environment where those businesses stay here and create jobs. … There would be no place in the country that you could go and pay less taxes.”\nIt was unclear whether the proposal would help retain new companies beyond the 10 years in which they would be exempt from what now are some of the nation’s highest taxes. Cuomo wouldn’t answer questions after his first presentation at the College of Nanoscale Science and Engineering in Albany.\nEarlier this month, Chief Executive magazine ranked New York as the 49th worst state for business in the opinion of CEOs questioned, based on high taxes, bureaucracy and regulations.\nThe full exemption from all taxes is a “promising new wrinkle,” said E.J. McMahon of the fiscally conservative Manhattan Institute. “But the state should go much further than this.”\nMcMahon said the state should use its more generous $440 million tax subsidy for TV and movie productions to phase out all corporate taxes for new and existing companies.\nRepublicans said a broad tax-cutting approach is needed.\n“We need to improve our overall tax structure and make it friendly to business,” said state Senate GOP leader Dean Skelos. He said the state also needs to cut its business regulations and bureaucracy.\n“Why,” asked Republican Assemblyman Kieran Michael Lalor back in Albany, “should New York’s struggling small businesses continue to pay high taxes while the governor lets a few pay no taxes at all?”\nIn Buffalo, reporters asked Cuomo about just that.\n“We’re working — we have been the last two years — reducing taxes all across the board,” Cuomo said.\nState Assembly Speaker Sheldon Silver said after the Albany announcement that he will insist current New Yorkers benefit from the new jobs and that there be serious “claw back” provisions and penalties for companies that fail to meet promises of jobs and development.\nSilver, D-Manhattan, said that project has been discussed for weeks and he expects it to be adopted by the Legislature before the end of its session on June 20.\n“It’s not forever. We’re talking about some five-year benefits, some 10-year benefits,” Silver said. “Eventually they are going to become fully taxpaying citizens.”\nSilver said the program would bring in new jobs and new businesses, so technically, there would be no cost to the state.\n“The tax-free zones will be the answer to finally creating jobs in New York,” said Sen. Jeff Klein, leader of the Independent Democratic Conference in the Senate.\n© 2013, Daily Freeman"
    },
    {
      "url": "https://nypost.com/2022/01/14/ny-lawmakers-slam-film-tv-and-cuomo-corporate-tax-breaks/",
      "text": "New York’s $10 billion in annual public subsidies and tax breaks to corporations were trashed as wasteful and mired in corruption during a state Senate hearing Friday.\nThe programs that were especially cited for failing to provide the biggest bang for the buck include the hefty $420 million film and TV industry tax credit to shoot projects in New York — and former Gov. Andrew Cuomo’s upstate economic development.\n“Study after study has demonstrated there is a fairly poor return from states that offers a film and tax credit,” said Sen. James Skoufis, chair of the investigations committee.\nUnder questioning, Empire State Development officials could not cite any study that the film and tax credit provides a solid return on investment.\nIndeed, it was revealed at the hearing that ESD does not provide a rigorous analysis of firms receiving tax subsidies.\nThe Citizens Budget Commission, among other researchers, have called for the tax credit program to be phased out and eliminated.\n“Business subsidy programs are politicized, beset by scandal and a massive, ongoing corruption risk,” testified John Kaehny, director of the government watchdog group Reinvent Albany.\n“They are a waste of public funds, and all independent analyses have found them an extremely inefficient way for government to create jobs.”\nThe corporate welfare, Kaehny added, contributes to Albany’s corrupt pay-to-play culture between recipients of the government largesse who then funnel tens of thousands of dollars into coffers of elected officials who support the programs.\n“There is a reason that subsidies are at the center of the biggest New York corruption scandals of the last decade. The wealthy people who control the businesses receiving billions in state subsidies are among the largest campaign contributors,” Kaehny said.\nCuomo’s controversial Buffalo Billion upstate corporate subsidy programs led to massive bribery and bid-rigging corruption scandals that resulted in felony convictions against the then-governor’s right hand man, Joe Percoco, and the architect of the state programs, Alain Kaloyeros, as well as bidders who were big donors to the former governor.\nSen. John Liu (D-Queens) said the tax breaks for a select few and not others create an unfair playing field.\n“Most jobs created in New York are without state subsidies. It puts companies that don’t get an incentive at a disadvantage,” Liu said.\nEven advocates for the business community said awarding wealthy businesses massive subsidies has provoked a backlash — particularly when Cuomo and former Mayor Bill de Blasio offered $3 billion in tax subsidies in a failed bid to get e-tail giant Amazon to build a headquarters along the Queens waterfront.\nAmazon withdrew the project amid fierce opposition.\nKathy Wylde, CEO of the Partnership for the City of New York, said people found the Amazon break offensive.\nThe problem, Wylde said, is the tax incentives are offered to offset the high cost of doing business in New York, including regulatory costs as well as taxes.\n“In New York state, the primary role of economic development incentives has been to offset the high costs of doing business in the state. Our experience with the Amazon HQ2 fiasco illustrates how poorly New York’s approach to economic development has been working,” Wylde said.\nShe said the Amazon debacle was instructive.\n“Virginia won the HQ2, including the additional 20,000 jobs originally intended for New York, in a bid that did not require tax subsidies because they are a state with competitive tax rates,” Wylde said.\n“Instead, their offer was to put up state funding for new transit, affordable housing and a huge fund to prepare thousands of local residents for Amazon jobs. With a similar package, New York would have kept those jobs, but we were stuck with the wrong tools and a cost structure that had to be mitigated to get into the game.”\nThe lawmakers who complained about subsidies raised corporate taxes last year from 6.5 percent to 7.25 percent for firms making more than $5 million in income.\nAgency spokesman Matt Gorton responded, “Empire State Development is laser-focused on creating jobs and expanding economic opportunity for all New Yorkers, and ESD’s incentive programs are delivering results: Tesla surpassed its job and investment commitment and the film production industry contributes more to the Empire State economy — particularly small businesses — than any investment it is provided.\n“As we rebuild our economy from the pandemic, smart, strategic investments to support growing industries are an important tool in New York’s economic development tool kit.”"
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    },
    {
      "url": "https://www.foxnews.com/politics/zohran-mamdani-vows-trump-proof-nyc-fiery-staten-island-event",
      "text": "New York City's Democratic mayoral nominee, Zohran Mamdani, brought his anti-Trump campaign swing to Staten Island on Wednesday, blasting President Donald Trump's signature immigration reform agenda.\nTrump was once again front-and-center in the race for Gracie Mansion on Wednesday as Mamdani continued his \"Five Boroughs Against Trump\" tour at the Istanbul Bay Authentic Mediterranean Restaurant on Staten Island.\n\"As we gather here on an island, where nearly 1 in 4 were born outside of this country, an island where 30% of its residents speak a language other than English, it's an island that we know is not immune from this horrific crackdown. We are seeing from the Trump administration. We are seeing it and feeling it,\" Mamdani said. \"And we know that it has nothing to do with safety. It has to do with punishment.\"\nWhile Trump campaigned for president last year on securing the border and deporting illegal immigrants, Mamdani is campaigning for mayor this year on protecting New York immigrant communities amid Trump's deportation rollout.\nJoined by Staten Island District Staten Island District Leader, Jasmine Robinson, Immigration Rights Activist, Yesenia Matas, and President of the Staten Island Democratic Association, Ali Ansari, Mamdani focused Wednesday's event on Trump’s \"horrific attacks on New York City’s immigrant communities\" in which he continues to \"rip New Yorkers off the street without due process.\"\nMAMDANI ZINGS CUOMO IN RENT-STABILIZED HOUSING SPAT DURING ANTI-TRUMP TOUR STOP\n\"It is not enough to fight against authoritarianism. What are you also fighting for? We are fighting to keep this city a sanctuary city,\" he said.\nMamdani said earlier this month that New York City and the United States are facing a \"dark moment.\" He then called the Trump administration an \"authoritarian government\" and slammed ICE for \"abduct[ing]\" immigrants.\"\nAccording to Mamdani's campaign website, he is committed to \"Trump-proofing NYC,\" by removing ICE from \"all City facilities\" and strengthening sanctuary city laws.\nZOHRAN MAMDANI LAUNCHES ANTI-TRUMP TOUR ACROSS FIVE BOROUGHS IN NEW YORK CITY\nResistance to Trump's crackdown on illegal immigration dominated headlines during New York City's Democratic mayoral primary, in which Mamdani handily won in June.\nPrimary contender and New York City Comptroller Brad Lander—whom Mamdani cross-endorsed and campaigned with in the primary—was arrested by Department of Homeland Security (DHS) agents in June after being accused of assaulting a federal officer as he tried to escort a migrant from their federal immigration court hearing.\nWhile Lander ultimately faced no charges, the incident catapulted Trump's illegal immigration crackdown onto the New York City campaign trail.\nAfter being detained for several hours, Lander joined fellow primary candidates outside 26 Federal Plaza, an immigration facility in Manhattan, as Mamdani called the incident \"fascism.\"\nIt was one such instance of elected officials being detained by federal immigration officials as they protested Trump's deportations, including Newark mayor Ras Baraka in neighboring New Jersey.\nSen. Alex Padilla of California was also forcibly removed and handcuffed by federal agents earlier this year when he shouted questions about U.S. Immigration and Customs Enforcement (ICE) raids at DHS Secretary Kristi Noem during a press conference.\nProtests rejecting ICE have erupted across the country this year, particularly in Los Angeles, where protests delved into riots, leading Trump to authorize the National Guard without Gov. Gavin Newsom's request – the first time in 60 years.\nDuring incumbent Mayor Eric Adams' tenure, New York City became an epicenter of the migrant crisis as President Joe Biden's administration lifted COVID-era Title 42 expulsions and Gov. Greg Abbott, R-Texas, began sending busloads of migrants to New York City from his border state.\nAs the situation unfolded, Adams began speaking out against Biden's immigration policies, calling New York City's migrant crisis a state of emergency.\nWhen Mamdani declared victory in the Democratic primary, he described his vision for New York City’s future as a place \"where the mayor will use their power to reject Donald Trump's fascism, to stop mass ICE agents from deporting our neighbors and to govern our city as a model for the Democratic Party.\"\nMeanwhile, Adams built a reputation during his tenure for challenging Biden's immigration policies while vowing to coordinate with Trump's illegal immigration crackdown, including working alongside Trump's border czar, Tom Homan.\nAdams has also cozied up to Trump since he was elected in November, visiting both Mar-a-Lago and the White House. Trump's Justice Department dropped bribery, wire fraud and conspiracy charges against Adams earlier this year.\nCLICK HERE TO GET THE FOX NEWS APP\nGov. Kathy Hochul, D-N.Y., weighed removing Adams from office following a slew of City Hall resignations after Adams' case was dropped.\nAdams and former Gov. Andrew Cuomo are both running as independent candidates in New York City's mayoral race, and Curtis Sliwa is the Republican nominee. The election is on Nov. 4.\nFox News Digital's Andrew Mark Miller contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/media/trump-tells-bronx-barbershop-what-he-would-do-differently-elected-second-time-its-all-about-people",
      "text": "Former President Trump spoke candidly with voters at Knockout Barbershop in the Bronx, taking questions from locals grappling with economic hardships and escalating expenses in a \"Fox & Friends\" exclusive.\nWith Fox News' Lawrence Jones by his side and surrounded by visitors donning \"Make Barbers Great Again\" shirts, Trump addressed concerns over high taxes and expensive rents, opening up about what he'd do differently if granted a second term.\n\"What is one thing that you probably feel like you didn't do in your first term that you feel like you could do better now?\" one voter asked.\n\"It's all about people. I've got to get the right people,\" Trump responded.\nHe reflected on his outsider status to relate to the group, emphasizing his roots are entrenched in New York City rather than D.C.\n\"I went to Washington 17 times in my entire life, so I wasn't a Washington person. I was a New York person. I mean, I was here as a developer, so when I went to Washington, all of a sudden, I'm standing in the White House opposite the Lincoln Bedroom, and I said, ‘Man, this is so amazing.’ But I didn't really know too many [people], so I had to rely on people to give me recommendations for people to run agencies… and I still did great.\"\nHe picked up after a moment, \"But I had some people that, if I had it to do again, I wouldn't have used. Now, I've been there four years plus another four that I'm sort of there in a way. I know the best people. To me, it's all about people. You got to have the right people. When we have the right people, it runs beautifully.\"\nAs he looked toward the election just over two weeks away, Trump was confident, insisting he now has the \"best people lined up\" for roles in his administration as he prepares for what might be his second term should he defeat Vice President Harris.\n\"We will do a great job,\" he pledged.\nDONALD TRUMP LEADS RAUCOUS ‘U-S-A!’ CHANT FROM SUITE AT STEELERS-JETS GAME\nThroughout the discussion, Trump made a recurring point to connect with the everyday voter, suggesting a shared common ground despite his wealth and fame.\n\"You guys are the same as me. It's the same stuff. We were born the same way. I grew up in Queens and all of that. I had a great father, had a father, was a great guy – he was tough but [had] a good big heart, and he was a construction guy, pretty much, and a real estate guy, and I learned a lot from him. He was great, but I know you people so well without knowing you.\"\nThe former president took a series of questions related to other topics, including the prospect of eliminating a federal income tax.\n\"There is a way,\" Trump said.\n\"In the old days when we were smart, when we were a smart country in the 1890s and all this, this is when the country was relatively the richest it ever was. It had all tariffs. It didn't have an income tax.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Now we have income taxes, and we have people that are dying. They're paying tax, and they don't have the money to pay the tax. In the old days … we had so much money, they had to set up committees, blue-ribbon committees, [on] how to spend our wealth. We had no idea how to spend it with so much money. Then we went to the income tax system and the rest is sort of history. But no, there is a way.\""
    }
  ],
  "argos_summary": "Zohran Mamdani, the Democratic mayoral nominee for New York City, is on a 'Five Boroughs Against Trump' tour, emphasizing the negative impact of Trump's policies on small businesses and housing affordability, particularly in the Bronx. Mamdani criticizes both Trump and his rival Andrew Cuomo for prioritizing the wealthy over working-class New Yorkers, while advocating for rent freezes and stronger protections for immigrant communities. Meanwhile, Trump has been actively campaigning in New York City, rallying support among diverse voters and addressing economic concerns, as he seeks to regain influence in a traditionally Democratic stronghold.",
  "argos_id": "YXNH52VHZ"
}