{
  "url": "https://www.washingtontimes.com/news/2025/aug/14/wollman-rink-lesson-trump-succeeds-democrats-fail/",
  "authorsByline": "Kelly Sadler, The Washington Times https://www.washingtontimes.com, https://www.washingtontimes.com/staff/kelly-sadler/",
  "articleId": "410c682abf344c8ba9170d35c1dda5e4",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/14/Sadler_AH_c0-158-1500-1033_s1200x700.jpg?d148b5bca3ae74ddf59f2a6b7af43ba13b113cbd",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-14T19:55:06+00:00",
  "addDate": "2025-08-14T19:58:18.605680+00:00",
  "refreshDate": "2025-08-14T19:58:18.605683+00:00",
  "score": 1.0,
  "title": "The Wollman Rink lesson: Why Trump succeeds where Democrats fail",
  "description": "President Donald J. Trump’s superpower has always been his ability to read the cultural zeitgeist and meet the moment with commonsense solutions.",
  "content": "President Trump’s superpower has always been his ability to read the cultural zeitgeist and meet the moment with commonsense solutions.\n\nThe Wollman ice-skating rink was opened in 1949 in New York City’s iconic Central Park. It was featured in several Hollywood blockbusters and drew tourists worldwide. However, the beloved rink was closed in 1980 after city officials failed to maintain it, and it fell into disrepair.\n\nMayor Ed Koch promised to reopen it by 1985, but a year later, the project was nowhere near completion and was running $12 million over its $4.7 million budget.\n\nMr. Trump was no fan of Mr. Koch’s, to say the least. Frustrated with the rink’s lack of progress, Mr. Trump offered to step in and manage the project, promising to complete the effort before Christmas 1986.\n\n“If Koch doesn’t like this offer, then let him have the same people who have built it for the last six years do it for the next six years,” Mr. Trump said at the time of the incompetent contractors and city officials tasked with the rink’s reopening.\n\nMr. Koch agreed, and Mr. Trump, with his contracting team, had the rink opened by Nov. 1, 1986, delivering a major win to the city’s residents and visitors. From a cultural perspective, the victory may have meant more to New Yorkers battling high crime rates and urban decay at the time than any skyscraper he built.\n\nMr. Trump’s can-do attitude — the belief that proficient, qualified and skilled outsiders can always best a slow, lazy and corrupt government — propelled him into the White House in 2016 and then again in 2024.\n\nIt has Democrats “stuck,” as Mr. Trump said Wednesday. He touted his efforts to fight crime in the nation’s capital and beautify it, including refurbishing the Kennedy Center, the city’s parks and the Federal Reserve building.\n\n“It’s almost a waste of time to meet [with Democrats] because they never approve anything. If we want money to fight crime, if we want money to do only good things, just good things. Let’s not even talk about controversial. They don’t want to meet about anything. They really are — they’re stuck,” Mr. Trump said when announcing the celebrities to be honored this year at the Kennedy Center.\n\nHe continued: “The Democrats are afraid to do anything because they don’t want to be criticized, but fighting crime is a good thing. We have to explain. We’re going to fight crime.\n\n“That’s a good thing. Already, they’re saying, ‘He’s a dictator. The place is going to hell, and we’ve got to stop it.’ So instead of saying, ‘He’s a dictator,’ they should say, ‘We’re going to join him and make Washington safe.’ But they say, ‘He’s a dictator.’ And then they end up getting mugged.”\n\nDemocrats widely criticized Mr. Trump for mobilizing the National Guard to patrol the streets of the District of Columbia. They downplayed crime in the nation’s capital and argued it was safe.\n\n“Trump’s federal takeover of D.C. isn’t about safety, it’s about distracting Americans from high prices, a bad jobs report, a falling economy, and the Epstein files,” Rep. Eric Swalwell, California Democrat, wrote on “X” on Monday. He attached an article claiming crime in the District was declining from pandemic-era spikes.\n\nMr. Swalwell wrote on X last year that he and his wife had practiced “going out through the back seat to get our kids if we are carjacked. This is not normal.”\n\nRep. Henry Cuellar, Texas Democrat, was carjacked at gunpoint near his D.C. home. Rep. Angie Craig, Minnesota Democrat, was assaulted in the elevator of her D.C. apartment building. Then there’s Naomi Biden, President Biden’s granddaughter, whose Secret Service detail had to open fire in Georgetown last year as three teenagers tried to break into their unmarked vehicle.\n\nDemocrats seem incapable of recognizing the reality right before them, let alone working with Mr. Trump to address it, all because they must stand in opposition to him, even if it’s to their detriment, against the desires of everyday Americans.\n\nMr. Trump is not only trying to deliver safety and beauty to the District but his administration has also achieved no tax on tips, no tax on Social Security, no tax on overtime, and the ability for Americans to deduct interest payments on new cars, a major win for the working class that not one Democrat voted for.\n\nMr. Trump shut down the southern border without a single Democratic vote. He has advocated for women by keeping biological men out of women’s athletics, a bill that Senate Democrats blocked from advancing earlier this year.\n\n“You know, they talk about 80/20, 80/20 issues. But I think many of those 80/20 issues, like men and women sports, I think it’s 97 to 3, not 80/20. And I think crime is maybe 100 to nothing,” said Mr. Trump, speaking of the support of policies he is championing that Democrats oppose.\n\n“[Democrats] don’t approve anything. It’s amazing. It’s like they just don’t want to vote for anything,” Mr. Trump ruminated Wednesday.\n\nHe continued: “I don’t believe that anybody is capable of making a deal with these people. They have gone crazy.”\n\nSo Mr. Trump and Republicans are going it alone and, just like with the Wollman Rink in New York City, delivering to the American people in their fight against inept government bureaucracy.\n• Kelly Sadler is the commentary editor at The Washington Times.",
  "medium": "Article",
  "links": [
    "https://goo.gl/forms/xGjXcUKYsKxMeCUl1"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Trump",
      "weight": 0.10058341
    },
    {
      "name": "Trump",
      "weight": 0.07886014
    },
    {
      "name": "Mr. Koch",
      "weight": 0.07693123
    },
    {
      "name": "Mr. Swalwell",
      "weight": 0.074201494
    },
    {
      "name": "last year",
      "weight": 0.06700121
    },
    {
      "name": "high crime rates",
      "weight": 0.06414208
    },
    {
      "name": "crime",
      "weight": 0.05970437
    },
    {
      "name": "Senate Democrats",
      "weight": 0.058771573
    },
    {
      "name": "New York City",
      "weight": 0.056253668
    },
    {
      "name": "Democrats",
      "weight": 0.056147464
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.97412109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.96240234375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.53662109375
    }
  ],
  "sentiment": {
    "positive": 0.06092918,
    "negative": 0.7257831,
    "neutral": 0.21328768
  },
  "summary": "President Trump's ability to adapt to cultural trends and provide commonsense solutions has led him to victory in both 2016 and 2024 elections. The Wollman Rink in New York City's Central Park was closed in 1980 after city officials failed to maintain it, causing it to fall into disrepair. Mayor Ed Koch promised to reopen it by 1985 but the project was nearly completion and running $12 million over its $4.7 million budget. Trump stepped in to manage the project and managed it by 1986, a major win for New Yorkers battling high crime rates and urban decay. Despite criticism from Democrats for mobilizing the National Guard to patrol the streets of the District of Columbia, they downplayed crime and argued it was safe.",
  "shortSummary": "President Trump's strategic thinking led to the Wollman ice-skating rink's reopening, despite criticism from Democrats and calls for increased police presence in Washington.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5f074588f0594c759e47e1fb87a8c985",
  "places": [
    {
      "osmId": "136507647",
      "road": "Center Drive",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10153",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.7677164,
        "lon": -73.97446700948448
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The article discusses President Trump's historical ability to address cultural issues and his recent comments on crime and governance. It highlights his successful reopening of the Wollman ice-skating rink in 1986 as a metaphor for his approach to tackling bureaucratic inefficiencies. Trump criticizes Democrats for their inaction on crime and other issues, asserting that they are unwilling to collaborate for the benefit of the public. He emphasizes his administration's achievements and positions himself as a champion for safety and working-class interests.",
  "argos_id": "ZB9QC128S"
}