{
  "url": "https://thehill.com/homenews/5453483-what-the-national-guard-in-dc-looks-like/",
  "authorsByline": "Ellen Mitchell",
  "articleId": "81e8d77fd58a44d78fcf0662ba4f56e7",
  "source": {
    "domain": "thehill.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://thehill.com/wp-content/uploads/sites/2/2025/08/Leading-DC-deployment_081425_AP_Scott-Applewhite.jpg?w=1280",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-15T00:41:53+00:00",
  "addDate": "2025-08-15T00:46:19.846834+00:00",
  "refreshDate": "2025-08-15T00:46:19.846836+00:00",
  "score": 1.0,
  "title": "What the National Guard in DC looks like",
  "description": "Welcome to The Hill’s Defense & NatSec newsletter{beacon} Defense &National Security Defense &National Security   The Big Story What the National Guard in DC looks l…",
  "content": "What the National Guard in DC looks like The National Guard started ramping up its presence in Washington on Thursday as President Trump’s takeover of city crime-fighting begins to take shape. While the Guard had a relatively small footprint in the city earlier this week, by Thursday, all of the roughly 800 Army and Air National Guard troops Trump ordered to the streets had mobilized for duty, the Pentagon confirmed. “They will remain until law and order has been restored in the district as determined by the president, standing as the gatekeepers of our great nation’s capital,” Department of Defense press secretary Kingsley Wilson told reporters at the Pentagon. She added that the guard members will assist the D.C. Metropolitan Police Department and federal law enforcement officers with “community safety patrols,” protecting monuments, federal facilities and traffic control posts, and “area beautification.” The number of guard members has steadily increased since Monday evening, when they were first spotted along the National Mall. On Thursday, they were positioned around the National Mall and Metro stops such as Union Station, where tourists milled about and the occasional camera crew stopped to capture footage of the troops and their vehicles. At 7th Avenue NW and Madison Drive NW, between the long stretches of grass that separate the Washington Monument from the Capitol Building, a lone military vehicle was spotted idling on the street with two service members inside. Tourists stopped to take pictures of the vehicle with the monuments in the background. And at Union Station, four Humvees were parked outside the building on the grass, with guard members standing in the nearly 90-degree heat as numerous camera crews captured their largely quiet presence. National Guard Bureau spokesperson Maj. Micah Maxwell said the guard members were part of two teams sent to the National Mall and nearby Metro stations for a continuous presence of 24 hours, with plans to increase locations in the days ahead. “It will be a slow increase, so I wouldn’t expect to see a big increase of soldiers and airmen across the city,” he told The Hill. Part of the National Guard’s mission is to support law enforcement — which has also been expanding its presence across the district — though they will not be armed and cannot make arrests. The troops are allowed to detain people temporarily in certain circumstances until federal agents arrive, much like the guard members deployed in Los Angeles in June to help quell protests over immigration raids. Welcome to The Hill’s Defense & National Security newsletter, I’m Ellen Mitchell — your guide to the latest developments at the Pentagon, on Capitol Hill and beyond. Did someone forward you this newsletter? Subscribe here.",
  "medium": "Article",
  "links": [
    "https://thehill.com/homenews/administration/5453095-dc-protests-federal-takeover/?email=467cb6399cb7df64551775e431052b43a775c749&emaila=12a6d4d069cd56cfddaa391c24eb7042&emailb=054528e7403871c79f668e49dd3c44b1ec00c7f611bf9388f76bb2324d6ca5f3&utm_source=Sailthru&utm_medium=email&utm_campaign=08.14.25%20%E2%80%94%C2%A0Defense%20%26%20National%20Security",
    "https://nxslink.thehill.com/join/7aa/signup"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "guard members",
      "weight": 0.0927374
    },
    {
      "name": "National Guard",
      "weight": 0.092064396
    },
    {
      "name": "Air National Guard",
      "weight": 0.08941067
    },
    {
      "name": "National Guard Bureau spokesperson Maj. Micah Maxwell",
      "weight": 0.08096868
    },
    {
      "name": "federal law enforcement officers",
      "weight": 0.077920035
    },
    {
      "name": "law enforcement",
      "weight": 0.06660044
    },
    {
      "name": "federal facilities",
      "weight": 0.06420575
    },
    {
      "name": "federal agents",
      "weight": 0.06316007
    },
    {
      "name": "numerous camera crews",
      "weight": 0.06290355
    },
    {
      "name": "Guard",
      "weight": 0.060071137
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.916015625
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.8017578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.57666015625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.35302734375
    }
  ],
  "sentiment": {
    "positive": 0.33241427,
    "negative": 0.2322326,
    "neutral": 0.4353531
  },
  "summary": "The National Guard has increased its presence in Washington, following President Trump's takeover of city crime-fighting. All of the roughly 800 Army and Air National Guard troops ordered to the streets have mobilized, according to the Pentagon. The Guard members will assist with D.C. law enforcement and assist with \"community safety patrols,\" protecting monuments, federal facilities, and traffic control posts. The number of guard members has steadily increased since Monday evening. They are part of two teams sent to the National Mall and nearby Metro stations for a continuous presence of 24 hours, with plans to increase locations in the future.",
  "shortSummary": "The National Guard has increased its presence in Washington, supporting law enforcement and monuments, as part of President Trump’s anti-crime strategy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b293d8988cd04533877e95226abd01ea",
  "places": [
    {
      "osmId": "6062978",
      "road": "Madison Drive Northwest",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20565",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 38.8905993,
        "lon": -77.017694
      }
    },
    {
      "osmId": "603191105",
      "road": "Pennsylvania Avenue Northwest",
      "quarter": "Penn Quarter",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20004",
      "country": "United States",
      "countryCode": "us",
      "amenity": "Pennsylvania Avenue NW & 7th St Northwest",
      "coordinates": {
        "lat": 38.8936064,
        "lon": -77.0224091
      }
    },
    {
      "osmId": "738189330",
      "road": "Union Station Drive Northeast",
      "suburb": "Near Northeast",
      "city": "Washington",
      "state": "District of Columbia",
      "postcode": "20401",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "NoMa",
      "coordinates": {
        "lat": 38.897766,
        "lon": -77.0074143
      }
    },
    {
      "osmId": "11158003",
      "city": "Washington",
      "state": "District of Columbia",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 38.8854281,
        "lon": -77.0414734922376
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The National Guard has increased its presence in Washington, D.C., with approximately 800 troops mobilized to assist local law enforcement and ensure community safety as part of President Trump's crime-fighting measures. Their duties include patrolling, protecting monuments, and traffic control, although they will not be armed or able to make arrests. The deployment began earlier in the week and is expected to gradually expand in the coming days.",
  "argos_id": "ZDYYFCU4J"
}