{
  "url": "https://www.engadget.com/big-tech/trumps-administration-may-look-to-buy-a-stake-in-intel-213234862.html",
  "authorsByline": "Anna Washenko",
  "articleId": "907afd6c45f247ea80702a918c85ff3c",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/YvFK1kjyPmdI.x5hbJUtvw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTQ-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/f6211560-77b3-11f0-92fa-e867d1e4f73d",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-14T21:32:34+00:00",
  "addDate": "2025-08-14T21:36:55.102577+00:00",
  "refreshDate": "2025-08-14T21:36:55.102578+00:00",
  "score": 1.0,
  "title": "Trump's administration may look to buy a stake in Intel",
  "description": "Intel has had some recent struggles in delivering results for its shareholders, but the company could soon be answering to an additional boss.",
  "content": "Intel has had some recent struggles in delivering results for its shareholders, but the company could soon be answering to an additional boss. The current administration is reportedly in talks to have the US government acquire a stake in the chipmaker. No specifics about the size or value of the potential share in the company have been disclosed, but the focus appears to be on increasing Intel's manufacturing footprint in the US. first reported the news, but at least one source cautioned the publication that the situation is still in flux.\n\nIntel initially shared plans to construct a semiconductor facility in Ohio while Pat Gelsinger was still at the helm of the company. Since then, the project has faced , and at its latest quarterly earnings report, execs said Intel would \" \" on the Ohio construction, as well as scrapping other international building plans and making workforce cuts.\n\nThe potential for government ownership of Intel is the latest swing of the administration's attitude toward the company. A few days after calling for his resignation over connections to China, President Donald Trump met with CEO Lip-Bu Tan and seemed to now hold on the company leader.\n\nA representative from Intel told Bloomberg in a statement that the company is \"deeply committed to supporting President Trump’s efforts to strengthen US technology and manufacturing leadership. We look forward to continuing our work with the Trump administration to advance these shared priorities, but we are not going to comment on rumors or speculation.\"",
  "medium": "Article",
  "links": [
    "https://www.engadget.com/big-tech/intels-ceo-has-successfully-wooed-president-trump-035339132.html",
    "https://www.engadget.com/big-tech/intel-confirms-layoffs-as-it-tries-to-make-engineers-more-productive-143825752.html",
    "https://www.engadget.com/computing/intel-once-again-delays-its-long-awaited-ohio-chip-fabrication-facilities-185516274.html",
    "https://www.bloomberg.com/news/articles/2025-08-14/trump-administration-is-said-to-discuss-us-taking-stake-in-intel?embedded-checkout=true",
    "https://www.engadget.com/intel-ichip-making-facility-in-ohio-073608482.html",
    "https://www.engadget.com/big-tech/intel-confirms-it-will-cut-a-third-of-its-workforce-by-the-end-of-2025-215014365.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Intel",
      "weight": 0.10210293
    },
    {
      "name": "President Donald Trump",
      "weight": 0.09702677
    },
    {
      "name": "Donald Trump",
      "weight": 0.08709134
    },
    {
      "name": "other international building plans",
      "weight": 0.083035804
    },
    {
      "name": "Trump",
      "weight": 0.079628676
    },
    {
      "name": "US",
      "weight": 0.07142907
    },
    {
      "name": "government ownership",
      "weight": 0.06881086
    },
    {
      "name": "Ohio",
      "weight": 0.063711494
    },
    {
      "name": "plans",
      "weight": 0.06266326
    },
    {
      "name": "Pat Gelsinger",
      "weight": 0.060142323
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94287109375
    },
    {
      "name": "/News/Technology News",
      "score": 0.90283203125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.84716796875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7724609375
    },
    {
      "name": "/Computers & Electronics/Computer Hardware/Computer Components",
      "score": 0.308349609375
    }
  ],
  "sentiment": {
    "positive": 0.0530916,
    "negative": 0.7096644,
    "neutral": 0.23724397
  },
  "summary": "The US government is reportedly in talks to acquire a stake in Intel, focusing on increasing the company's manufacturing footprint in the US. The news comes after President Donald Trump called for the resignation of Intel CEO, Pat Gelsinger, over connections to China. No details have been disclosed regarding the potential stake.",
  "shortSummary": "The US government is in talks with Intel to acquire a stake, focusing on expanding its manufacturing footprint, amid ongoing criticism of current leadership.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f17531a3766d4f0493c84b9b3a274413",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/big-tech/intel-confirms-it-will-cut-a-third-of-its-workforce-by-the-end-of-2025-215014365.html",
      "text": "Intel confirms it will dramatically cut its workforce by the end of 2025\nThe chipmaker is also scrapping new building plans to further reduce its operating expenses.\nIntel provided more detail about the scope of its planned job cuts and other business changes while sharing its second-quarter earnings results. Reports in April suggested that Intel could eliminate around 20 percent of its staff in a restructuring plan. Today, the chipmaker said it anticipates having a core workforce of 75,000 employees by the end of 2025, down from 99,500 at the start of the year.\nThe numbers are even more dramatic when considering the company's downsizing efforts as a whole. This time last year, the chipmaker employed 116,500 across the globe, not including workers at its subsidiaries, and that number has fallen precipitously since. As of June 28, the company had 96,400 workers, meaning it's planning a reduction of more than 20,000 employees over the second half of the year.\nThese cuts are part of the company's current goal to bring its non-GAAP operating expenses down to $17 billion this year, then to $16 billion at the end of 2026. The effort to rein in spending is also leading Intel to abandon some previously announced expansions. The business will no longer embark on new projects in Germany and Poland, and it said it will consolidate its Costa Rican testing and assembly operations into existing efforts in Vietnam and Malaysia. Finally, it will also \"slow the pace\" of its stateside growth at a construction site in Ohio.\n\"Our operating performance demonstrates the initial progress we are making to improve our execution and drive greater efficiency,\" said Lip-Bu Tan, who has been forthright about his plans to downsize since assuming the CEO title in March. Tan was brought in to replace Pat Gelsinger in an effort to turn around Intel's business following a long, slow slide into financial trouble.\nUpdate, July 25, 3:30PM ET: This story has been updated multiple times since publish to provide more context around the layoffs. The employment numbers were also simplified by removing some mentions of employees at Intel subsidiaries."
    },
    {
      "url": "https://www.engadget.com/big-tech/intels-ceo-has-successfully-wooed-president-trump-035339132.html",
      "text": "Intel's CEO has successfully wooed President Trump\nTrump said Lip-Bu Tan's 'success and rise is an amazing story.'\nIt sounds like President Trump no longer thinks Intel's CEO should resign. Trump has revealed on Truth Social that he met with Lip-Bu Tan, Howard Lutnick, the Secretary of Commerce, and Scott Bessent, the Secretary of the Treasury. He didn't discuss the details of their meeting, but he described it as \"a very interesting one.\" Trump added: \"His success and rise is an amazing story.\" If you'll recall, Trump alleged that Tan was \"highly conflicted\" due to his investments in hundreds of Chinese firms and should resign. Reuters had previously reported that some of those companies had links to the Chinese military. \"Mr. Tan and my Cabinet members are going to spend time together, and bring suggestions to me during the next week,\" Trump said in his post.\nAccording to a report by the Financial Times, Tan wrote a letter to Intel employees about the issue, telling that there had been a lot of misinformation about the roles he'd held. \"I wanted to be absolutely clear... I have always operated within the highest legal and ethical standards,\" he reportedly wrote in the letter. He also said that Intel was communicating with the White House \"to address the matters that have been raised and ensure they have the facts.\"\nTrump's call for Tan to resign reportedly came about due a letter from Tom Cotton, the Republican head of the Senate Intelligence Committee, to the Intel CEO. Cotton apparently expressed concerns aout the \"security and integrity of Intel's operations\" due to Tan's ties with China. Tan was named the CEO of Intel in March, taking over a company that was losing money due to its foundry business being unable to secure big customers and lagging behind rivals like Taiwan Semiconductor. Since taking over, Tan has enforced several cost-cutting measures, including cutting jobs with the goal of reducing its workforce by 22 percent by the end of the year. He also recently told investors that Intel could abandon the development of its next-gen manufacturing technology if it fails to secure a large client."
    },
    {
      "url": "https://www.engadget.com/computing/intel-once-again-delays-its-long-awaited-ohio-chip-fabrication-facilities-185516274.html",
      "text": "Intel once again delays its long-awaited Ohio chip fabrication facilities\nOhio One is now set to open in 2030.\nIntel announced that it's further delaying plans to open two chip fabrication facilities in Ohio, pushing their completion out to 2030. The company originally announced its plans for Ohio in 2022, with an ambitious opening set for 2025.\nIntel says it completed the \"basement\" level of its Ohio One project last quarter, which allows above-ground construction to get underway now. The $20 billion dollar project is technically split across two different chip fabs, dubbed Mod 1 and Mod 2, which won't be completed at the same time. Mod 1 is now set to open in 2030, to \"align the start of production of our fabs with the needs of our business and broader market demand,\" according to Intel. Mod 2 will be completed the following year in 2031.\nThe justification is financial: Intel says it's taking a \"prudent approach\" that will ensure the chip fabs are completed in a \"financially responsible manner.\" Intel previously told the state of Ohio that it was delaying the fabs until 2027. It also delayed the groundbreaking of the project seemingly to incentivize the passing of the CHIPS Act in 2022, according to a report from The Washington Post.\nMore delays add to what's been a tumultuous period for Intel as a company. In December, former CEO Pat Gelsinger was pushed out, likely because he wasn't pulling-off Intel's aggressive plans to expand chip production. Prior to that, the funding the company was set to receive through the CHIPS Act was reduced by $600 million. Add in layoffs and the continued dominance of chip makers like AMD, and Intel remains in a tricky spot."
    },
    {
      "url": "https://www.engadget.com/intel-ichip-making-facility-in-ohio-073608482.html",
      "text": "Intel is spending $20 billion to build a massive chip-making facility in Ohio\nIntel CEO Pat Gelsinger expects it to be the biggest 'silicon manufacturing location on the planet.'\nIntel has revealed its plans to build a massive semiconductor facility in Ohio to Time — one that company CEO Pat Gelsinger is expecting to become \"the largest silicon manufacturing location on the planet.\" The company is earmarking $20 billion to build the site on a 1,000-acre land in New Albany, located on the outskirts of Columbus, Ohio. Intel's initial plans include building two semiconductor fabrication plants (or fabs) on the property that would employ 3,000 people. Construction on the site is scheduled to begin this year, and Intel expects the fabs to be operational by 2025.\nA Bloomberg report back in late 2021 claimed that the White House \"strongly discouraged\" Intel from ramping up chip production in China. The administration has been pushing for companies to manufacture chips in the US in order to address the ongoing global shortage. In turn, companies have been lobbying the president to fund semiconductor research and manufacturing. It's worth noting, though, that since building new plants takes years, projects like this won't be able to help address supply chain shortages anytime soon.\nIntel said it looked at 38 different sites in the US for the facility but ultimately chose Ohio, because of all the space it could use. The company doesn't want to build in places where it could displace residents, since that's what ultimately killed Amazon's plans to build a second headquarters in NYC. When the fabs are done, Intel will use them to manufacture both its own chips and chips for clients under the Intel Foundry Services. The company announced its foundry services when it revealed that it's building two factories in Arizona, which will also cost Intel $20 billion, back in March 2021.\nAccording to Gelsinger, the chipmaker has the option to expand the Ohio site to 2,000 acres and to build as many as eight fabs in the future. \"We helped to establish the Silicon Valley,\" the CEO told Time. \"Now we’re going to do the Silicon Heartland.\"\nUpdate 01/21/22 3:45PM ET: Intel has officially published a press release confirming that it's building a new \"mega-site\" in Ohio. The whole project, if the company decides to expand its initial plans and build more fabs, could be worth up to $100 billion over the next decade.\nIf you buy something through a link in this article, we may earn commission."
    },
    {
      "url": "https://www.engadget.com/big-tech/intel-confirms-layoffs-as-it-tries-to-make-engineers-more-productive-143825752.html",
      "text": "Intel confirms layoffs as it tries to 'make engineers more productive'\nAn unspecified number of people will lose their jobs as the company looks to cut out middle management.\nBeleaguered chipmaker Intel has confirmed plans to restructure in a shift that will involve an unspecified number of layoffs. It was reported this week that the company could lay off around 20 percent of staff (it had 108,900 employees at the end of last year). In a memo, new CEO Lip-Bu Tan declined to detail the extent of the downsizing, which is largely aimed at reducing \"unnecessary bureaucracy\" and layers of middle management.\n\"I’m a big believer in the philosophy that the best leaders get the most done with the fewest people. We will embrace this mindset across the company, which will include empowering our top talent to make decisions and take greater ownership of key priorities,\" Tan wrote. \"There is no way around the fact that these critical changes will reduce the size of our workforce. As I said when I joined, we need to make some very hard decisions to put our company on a solid footing for the future. This will begin in Q2 and we will move as quickly as possible over the next several months.\"\nIntel has been downsizing significantly over the last few years. Just last August, the company said it would cut more than 15,000 jobs to reduce costs. Intel has been struggling with slowing sales — it didn't act quickly enough to keep up with the industry's shift toward artificial intelligence.\nUnsurprisingly, AI will be a focus for Intel going forward. \"My focus will be ensuring that our team builds products that are highly competitive and meet the needs of our customer as we enter a new era of computing, defined by AI agents and reasoning models,\" Tan said in a call with investors on Thursday. \"To achieve this, we are taking a holistic approach to redefine our portfolio to optimize our products for new and emerging AI workloads. We are making necessary adjustments to our product roadmap, so that we are positioned to make the best-in-class products while staying laser focused on execution and ensuring on time delivery.\"\nTan is aiming to speed things up by turning Intel into a company that's focused on engineering. \"Many of the changes we will be driving are designed to make engineers more productive by removing burdensome workflows and processes that slow down the pace of innovation,\" he wrote. The company is planning to reduce costs elsewhere in order to \"make necessary investments in our engineering talent and technology roadmaps.\" It's hoping to lower its operating expenses by $1.5 billion over the next two years.\nEfficiencies are the name of the game here. Tan wants managers to get rid of unnecessary meetings and reduce the number of people who attend meetings as \"too much valuable time is being wasted.\" Intel is also expanding its return-to-office mandate by requiring workers to be on site four days a week (up from three) starting in September.\nTan certainly has lofty goals as he looks to turn around Intel's fortunes. \"I’m talking about the opportunity to fundamentally reinvent an industry icon. To pull off a comeback that will be studied in business schools for generations to come. To create new technologies and deploy them at scale to change the world for the better,\" he wrote. \"Intel was once widely seen as the world’s most innovative company. There’s no reason we can’t get back there, so long as we drive the changes needed to improve.\""
    }
  ],
  "argos_summary": "Intel is reportedly in discussions with the US government about a potential acquisition of a stake in the company to enhance its manufacturing capabilities in the US. The chipmaker has announced significant workforce reductions, planning to cut its staff by over 20% by the end of 2025, while also delaying the opening of its Ohio chip fabrication facilities to 2030. New CEO Lip-Bu Tan is implementing cost-cutting measures and restructuring efforts to improve operational efficiency amid ongoing challenges in the semiconductor market.",
  "argos_id": "ZZ8LDZPYO"
}