{
  "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/30/2025-fantasy-football-running-back-rankings-sleepers-busts/85909624007/",
  "authorsByline": "Steve Gardner, Ayrton Ostly",
  "articleId": "a2b7650424d34a159112681eda44133c",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/30/USAT/85910164007-kaleb-johnson.jpg?crop=5755,3237,x734,y536&width=3200&height=1800&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T18:09:35+00:00",
  "addDate": "2025-08-30T18:14:54.962988+00:00",
  "refreshDate": "2025-08-30T18:14:54.962989+00:00",
  "score": 1.0,
  "title": "Fantasy football RB preview: Rankings, sleepers, busts and more",
  "description": "Here's how the running back position stacks up for fantasy football drafts in 2025. See our staff rankings, favorite sleepers and players to avoid.",
  "content": "It's prime time for fantasy football drafts over the holiday weekend (and even a few days beyond). So finding concise, consolidated information is critical as time is of the essence with only a few days until the 2025 NFL regular season kicks off on Thursday, Sept. 4.\n\nNeed to get up to speed on the running back position? USA TODAY's Ayrton Ostly has your back with this all-encompassing position preview.\n\nIf you're looking for player overviews, tiered rankings, top sleepers, value picks or potential busts, they're right here at your fingertips.\n\nOur USA TODAY Sports staff rankings are constantly being updated, so keep checking back for the latest. As of Aug. 30, here are the top 20 running back in half-PPR formats. (You can see the full rankings and change the scoring system to match your league in the drop-down box below.)\n\nHere is a handful of players who could outperform their current ADP due to preconceived thoughts about health, workload or other reasons.\n\nThese are later-round players who could make a huge difference in value this season\n\nLooking back at all the running backs who busted over the last eight years, USA TODAY's Elish Twerski attempts to identify common trends and eliminate those who don't meet those benchmarks. Here's this year's group of backs with red flags across the board.",
  "medium": "Article",
  "links": [
    "https://sportsdata.usatoday.com/football/nfl/players/tank-bigsby/1215035",
    "https://sportsdata.usatoday.com/football/nfl/players/jordan-mason/1116001",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/20/fantasy-football-running-back-values-sleepers-steals/85731663007/",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/27/2025-fantasy-football-running-back-busts-rankings/85837358007/",
    "https://sportsdata.usatoday.com/football/nfl/players/chuba-hubbard/1062047",
    "https://sportsdata.usatoday.com/football/nfl/players/jaydon-blue/1378898",
    "https://www.usatoday.com/picture-gallery/sports/nfl/fantasy/2025/08/04/25-best-fantasy-football-running-back-ppr-seasons-since-2001/85468492007/",
    "https://sportsdata.usatoday.com/football/nfl/players/breece-hall/1162537",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/12/fantasy-football-rb-tiers-2025/85449111007/",
    "https://sportsdata.usatoday.com/football/nfl/players/tyrone-tracy-jr/1109708",
    "https://sportsdata.usatoday.com/football/nfl/players/tony-pollard/880398",
    "https://sportsdata.usatoday.com/football/nfl/players/kenneth-walker-iii/1164402",
    "https://sportsdata.usatoday.com/football/nfl/players/javonte-williams/1107881",
    "https://sportsdata.usatoday.com/football/nfl/scores",
    "https://sportsdata.usatoday.com/football/nfl/players/kaleb-johnson/1381902",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/15/fantasy-football-value-picks-cj-stroud/85528215007/",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/07/31/fantasy-football-rb-rankings-bijan-saquon/85423703007/",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/06/fantasy-football-rb-sleepers-2025/85491868007/",
    "https://sportsdata.usatoday.com/football/nfl/players/kyren-williams/1167361",
    "https://sportsdata.usatoday.com/football/nfl/players/miles-sanders/924261",
    "https://sportsdata.usatoday.com/football/nfl/players/rj-harvey/1172401",
    "https://sportsdata.usatoday.com/football/nfl/teams/new-york-giants/351",
    "https://www.usatoday.com/story/sports/fantasy/football/2025/08/29/2025-fantasy-football-rankings-printable-cheat-sheets-ppr/85868903007/",
    "https://www.usatoday.com/sports/fantasy/football/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tiered rankings",
      "weight": 0.09667351
    },
    {
      "name": "backs",
      "weight": 0.09430197
    },
    {
      "name": "USA TODAY Sports",
      "weight": 0.09106295
    },
    {
      "name": "Rankings",
      "weight": 0.09088721
    },
    {
      "name": "Fantasy football RB preview",
      "weight": 0.08675661
    },
    {
      "name": "fantasy football drafts",
      "weight": 0.08193559
    },
    {
      "name": "top sleepers",
      "weight": 0.08149923
    },
    {
      "name": "player overviews",
      "weight": 0.076419994
    },
    {
      "name": "value picks",
      "weight": 0.07626747
    },
    {
      "name": "Our USA TODAY Sports staff rankings",
      "weight": 0.0742039
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "Fantasy Sports"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9677734375
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.8212890625
    },
    {
      "name": "/Sports/Fantasy Sports",
      "score": 0.5146484375
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.475830078125
    }
  ],
  "sentiment": {
    "positive": 0.22114265,
    "negative": 0.29008397,
    "neutral": 0.48877338
  },
  "summary": "The article provides a comprehensive position preview of the running back position for fantasy football players. It includes player overviews, tiered rankings, top sleepers, and potential busts. As of August 30, the top 20 running back in half-PPR formats are ranked by USA TODAY's Ayrton Ostly.",
  "shortSummary": "Fantasy football draft is underway, featuring comprehensive rankings, top sleepers, and potential busts, all compiled by USA TODAY's Ayrton Ostly.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "df9ce45c42ef4b5181661b986701b315",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/06/fantasy-football-rb-sleepers-2025/85491868007/",
      "text": "Fantasy football RB sleepers: Kenneth Walker III, Kaleb Johnson top list\nIn 2024, a few running backs stood out by outperforming their average draft position (ADP). Those sleepers who paid off include Chase Brown, whose ADP was RB37 but finished the year as RB12 in half-PPR leagues, and Bucky Irving whose ADP was RB53 and ended up as RB14 in a breakout rookie season.\nNFL teams ran the ball more in 2024 than almost any year in the last decade. On average, teams notched 27 carries for 119.8 yards per game, the second-most in a season since 2014. Only 2022 had higher averages at 27.3 and 121.6, respectively.\nAs defenses have moved to limit explosive plays in the passing game, offenses are finding more value in running the ball efficiently. Running backs have always been valuable in fantasy football and increased volume in recent years brings even more to the position.\n2025 POSITION RANKINGS: QB | RB | WR | TE | K | D/ST | Overall\nIt can be tough to find sleepers in fantasy football with the avalanche of content and analysis. We're doing our best, though, and have a handful of players who could outperform their current ADP due to preconceived thoughts about health, workload or other reasons.\nHere are five sleeper running back candidates to target in fantasy football:\nNote: ADP is from FantasyPros and in half-PPR league formats.\nKenneth Walker III, Seattle Seahawks\nWalker quietly finished tied for 14th in fantasy points per game (14.4) in half-PPR leagues last season. He ended the year as RB28 due to playing just 15 games in an offense that struggled to run the ball. Seattle finished the year 19th in expected points added (EPA) per rush, per Sumer Sports data, and ranked 28th league-wide in total rushing yards.\nThat should change in 2025 under new coordinator Klint Kubiak. He's already stated that he plans to ask a lot out of Walker this season and likely will use a lot of outside zone, a running scheme that should maximize Walker's skillset.\nWalker's health is always a concern. He's missed 10 games combined over the last three seasons, hence why his current ADP is RB18. There's a good chance he will take a step under Kubiak and could be a high-end RB2 if he's healthy for at least 15 games.\nKaleb Johnson, Pittsburgh Steelers\nA great way to find some value at the running back position is to look for rookies who have a skillset and environment to thrive in their first season. This year's rookie running back class is loaded with talent with the likes of first-round picks Ashton Jeanty (Las Vegas) and Omarion Hampton (Los Angeles Chargers) poised to have great seasons. They're not quite sleeper candidates, though, but Johnson is.\nPittsburgh's offensive line should take a step in 2025 with Troy Fautanu healthy at right tackle and another year of development from Mason McCormick and Zach Frazier. Offensive coordinator Arthur Smith wants to run the ball and they'll need to in order to be successful with an aging Aaron Rodgers at quarterback and limited receiving weapons.\nJohnson's powerful skillset should get him the majority of carries out of the backfield as teammate Jaylen Warren works more on third downs. That volume behind an ascending line could be enough to have Johnson outperform his current ADP of RB28.\n2025 FANTASY FOOTBALL SLEEPERS: QB | RB | WR | TE | K\nTony Pollard, Tennessee Titans\nTo be clear, Pollard will be splitting carries with Tyjae Spears which will ultimately cap his ceiling. He may not end up as a top-15 running back in 2025. At an ADP of RB26, he could be in for a better finish than that.\nPollard managed 11.3 points per game last season in an offense with one of the worst quarterback situations in the league and few threats in the passing game. Cam Ward will almost certainly be an upgrade at quarterback in 2025 behind an improved offensive line and a receiving corps with more options than a year ago. The rising tide of the offense should lift all boats, Pollard included.\nTank Bigsby, Jacksonville Jaguars\nBigsby enters Year 2 in the NFL in a crowded backfield. Travis Etienne and rookies Bhayshul Tuten and LeQuint Allen provide a wide-open competition for the top running back in Jacksonville. New Jaguars coach Liam Coen made the most of a three running back rotation with Tampa Bay last season, meaning all of them could earn some carries.\nBigsby may be in the driver's seat as he's been taking more snaps with the starting offense early in training camp. He was one of the better running backs in yards after contact per carry in 2024 and that could endear him to Coen as an early-down back with Etienne and Tuten in the mix for third downs. His current ADP is RB42, meaning there's little risk to taking him in the middle rounds and capitalizing on value over the course of the year.\nJavonte Williams or Jaydon Blue, Dallas Cowboys\nWilliams is competing for the lead back role in Dallas. The Cowboys may be stuck in a contract stalemate on defensive star Micah Parsons but have worked to improve the offense this offseason. Top pick Tyler Booker is a day one starter at guard and trading for George Pickens will give the Cowboys another threat in the passing game.\nBlue is by far the most explosive running back on the Cowboys roster at the moment. He may take some time but could become a factor on passing downs sooner than later.\nDallas' new offensive coordinator Klayton Adams comes from Arizona where he was the offensive line coach and helped scheme up one of the most creative rushing offenses in the NFL. He should bring some of that with him to Dallas, to the benefit of these two players. Williams is currently RB37 by ADP and Blue is down at RB44. Both could absolutely outperform those projections."
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/20/fantasy-football-running-back-values-sleepers-steals/85731663007/",
      "text": "5 best fantasy football running back value picks in 2025\nNFL teams are running the ball more productively than at almost any point in the last decade. The running game is back but that hasn't always translated to fantasy football.\nEntering the 2025 NFL season, there are a handful of players widely expected to be the top scorers at the position. Reigning Offensive Player of the Year Saquon Barkley, Bijan Robinson, Jahmyr Gibbs, Derrick Henry and Christian McCaffrey are among those experts predict will be reliable double-digit scorers week in and week out.\nLook at the next tier of running backs in fantasy football and you'll find productive players at the position with some question marks. Ashton Jeanty has plenty of hype but is a rookie in arguably the toughest division in the NFL. Bucky Irving had an impressive rookie season but enters Year 2 with a new offensive coordinator. Johnathan Taylor hasn't played a full season since 2021 which negates his solid production when on the field.\nThis list isn't about the first two or even three tiers of fantasy football running backs. This is about finding value beyond the top 15 players at the position entering 2025. That's where mid-round flyers on players could make the difference between competing for a title and hoping to avoid last-place punishments.\nUSA TODAY Sports identified five value picks at running back who could outplay their current average draft position (ADP) in 2025:\n2025 fantasy football RB value picks\nADP is from FantasyPros and in half-PPR league formats.\nKenneth Walker III, Seattle Seahawks\n- ADP: RB17, OVR42\nThe fourth-year running back has never been down on talent. His issue throughout his career has been availability; he's missed 10 games over his first three seasons in the NFL.\nThe Seahawks had the fifth-worst rushing offense in the NFL a year ago. New offensive coordinator Klint Kubiak will offer schematic improvements that should play to Walker's strengths, specifically in outside zone runs. He's going this low likely because of injury concerns and worries about Seattle's offensive line. The Seahawks spent their first round pick on guard Grey Zabel, showing how committed they are to improving up front. That's enough reason to have optimism about Walker in 2025.\nTony Pollard, Tennessee Titans\n- ADP: RB25, OVR61\nPollard managed 1,317 yards from scrimmage and five touchdowns last season in a Titans offense that was a bottom-eight unit in points and yards. Tennessee overhauled a lot on offense this offseason with a new quarterback in No. 1 overall pick Cam Ward, two new starters on the offensive line and a revamped wide receiver room.\nAll of this should see the Titans offense take a step forward on offense to at least get closer to the middle of the pack. That rising tide should elevate Pollard to a solid No. 2 running back. Tyjae Spears' injury will keep him sidelined for the rest of the preseason, giving Pollard the majority of touches with the first-team offense.\nKaleb Johnson, Pittsburgh Steelers\n- ADP: RB28, OVR71\nRookie running backs can be hard to predict but Johnson may be in a good situation to outproduce his current draft position. Even with the arrival of quarterback Aaron Rodgers and wide receiver DK Metcalf, offensive coordinator Arthur Smith will still want to run the ball effectively. Johnson fits the bill well as an early-down back in that system.\nA healthy offensive line in Pittsburgh could take a step this year with center Zach Frazier, right guard Mason McCormick and right tackle Troy Fautanu all entering their second year in the NFL. In his time as a play-caller on offense, Smith has ranked in the top-10 in rushing attempts five times in six NFL seasons. Last year the Steelers were fourth in the league in rushing attempts. The volume is there for Johnson to produce beyond his RB28 status.\nJordan Mason, Minnesota Vikings\n- ADP: RB34, OVR92\nMinnesota has traditionally had one primary running back during coach Kevin O'Connell's tenure. That's reportedly changed this offseason during training camp as it's been closer to an even split between Aaron Jones Sr. and Mason.\nThe Vikings invested in the offensive line with new starters at center and both guard spots. They're dropping in an unproven quarterback in J.J. McCarthy. This should lead Minnesota to rely more on the running game in 2025 than in years past.\nThe Vikings traded one of their few draft picks for Mason this offseason. Through the first seven games of 2024, only two running backs had more rushing yards: Henry and Barkley. He's been productive when given the opportunity and could usurp the 30-year-old Jones as the Vikings' primary back over the course of the season.\nJavonte Williams, Dallas Cowboys\n- ADP: RB36, OVR111\nRegardless of their playoff chances in 2025, the Cowboys should be a more productive offense on the ground. They spent their top pick on guard Tyler Booker, a mauler in the run game, and brought in Klayton Adams from Arizona to be their offensive coordinator. Adams had a big role in the Cardinals' running scheme which has been one of the most diverse in the league over recent seasons.\nWilliams is currently slated to start for the Cowboys. He played in all 17 games last season for Denver with 11 starts but managed just 859 yards from scrimmage. Williams should have the edge over other running backs in Dallas to start the season. He could easily benefit from the ground game's improvement under Adams and outplay his status as a low-end RB3."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/javonte-williams/1107881",
      "text": "Despite a sudden surge of Cowboys confidence, the Eagles should soar past them in Week 1.\nIn his first Packers press conference, Parsons reflected on leaving Dallas, thanked Cowboys fans, and addressed expectations in Green Bay.\nThe Micah Parsons trade changed the whole complexion of the Cowboys' defense. How will Dallas replace its star pass rusher in the short and long term?\nThe Dallas Cowboys could have a multitude of reasons behind who they chose to keep.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/breece-hall/1162537",
      "text": "With food and drink specials, massive televisions and camaraderie, go out and experience some the area's top sports grills and restaurants this season.\nDiscover a list of the top receivers in the franchise history of the Jets.\nDiscover a list of the top passers in the franchise history of the Jets.\nDiscover a list of the top rushers in the franchise history of the Jets.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/29/2025-fantasy-football-rankings-printable-cheat-sheets-ppr/85868903007/",
      "text": "Printable fantasy football draft rankings, PPR cheat sheets\nWith only a few days remaining until the 2025 NFL season kicks off, many fantasy football leagues have put off their drafts until the last possible moment. And many procrastinating fantasy managers now have precious little time to get ready.\nWe're here to help!\nWhile we've written tons of in-depth content about this year's sleepers, busts and value picks, sometimes you just want an up-to-date list of players and positions you can print out and take to your draft. For that, you've come to the right place.\nOur printable cheat sheets have been updated with all the final cuts as NFL teams set their rosters for Week 1. Draft with confidence!\nPrintable 2025 fantasy football overall rankings\nUSA TODAY Sports' consensus overall rankings are available to download here. As a preview, here are our latest top 100 overall players.\n- Ja'Marr Chase (CIN - WR1)\n- Justin Jefferson (MIN - WR2)\n- Bijan Robinson (ATL - RB1)\n- Saquon Barkley (PHI - RB2)\n- Jahmyr Gibbs (DET - RB3)\n- CeeDee Lamb (DAL - WR3)\n- Amon-Ra St. Brown (DET - WR4)\n- Malik Nabers (NYG - WR5)\n- Puka Nacua (LAR - WR6)\n- Derrick Henry (BAL - RB4)\n- Nico Collins (HOU - WR7)\n- Brian Thomas Jr. (JAC - WR8)\n- Ashton Jeanty (LV - RB5)\n- Christian McCaffrey (SF - RB6)\n- Bucky Irving (TB - RB7)\n- A.J. Brown (PHI - WR9)\n- Brock Bowers (LV - TE1)\n- Jonathan Taylor (IND - RB8)\n- Ladd McConkey (LAC - WR10)\n- Chase Brown (CIN - RB9)\n- Josh Jacobs (GB - RB10)\n- De'Von Achane (MIA - RB11)\n- Drake London (ATL - WR11)\n- Trey McBride (ARI - TE2)\n- Kyren Williams (LAR - RB12)\n- Lamar Jackson (BAL - QB1)\n- Jaxon Smith-Njigba (SEA - WR12)\n- Tee Higgins (CIN - WR13)\n- James Cook (BUF - RB13)\n- Josh Allen (BUF - QB2)\n- George Kittle (SF - TE3)\n- Tyreek Hill (MIA - WR14)\n- Mike Evans (TB - WR15)\n- Jalen Hurts (PHI - QB3)\n- Terry McLaurin (WAS - WR16)\n- Davante Adams (LAR - WR17)\n- Kenneth Walker III (SEA - RB14)\n- Jayden Daniels (WAS - QB4)\n- DK Metcalf (PIT - WR18)\n- Garrett Wilson (NYJ - WR19)\n- Courtland Sutton (DEN - WR20)\n- Marvin Harrison Jr. (ARI - WR21)\n- Omarion Hampton (LAC - RB15)\n- Alvin Kamara (NO - RB16)\n- Breece Hall (NYJ - RB17)\n- DJ Moore (CHI - WR22)\n- Joe Burrow (CIN - QB5)\n- DeVonta Smith (PHI - WR23)\n- James Conner (ARI - RB18)\n- Jameson Williams (DET - WR24)\n- TreVeyon Henderson (NE - RB19)\n- Chuba Hubbard (CAR - RB20)\n- Zay Flowers (BAL - WR25)\n- Xavier Worthy (KC - WR26)\n- D'Andre Swift (CHI - RB21)\n- David Montgomery (DET - RB22)\n- Calvin Ridley (TEN - WR27)\n- Aaron Jones Sr. (MIN - RB23)\n- Isiah Pacheco (KC - RB24)\n- Tony Pollard (TEN - RB25)\n- Sam LaPorta (DET - TE4)\n- Tetairoa McMillan (CAR - WR28)\n- Patrick Mahomes II (KC - QB6)\n- George Pickens (DAL - WR29)\n- RJ Harvey (DEN - RB26)\n- Jaylen Waddle (MIA - WR30)\n- Kaleb Johnson (PIT - RB27)\n- Travis Kelce (KC - TE5)\n- Rome Odunze (CHI - WR31)\n- Tyrone Tracy Jr. (NYG - RB28)\n- Jerry Jeudy (CLE - WR32)\n- Ricky Pearsall (SF - WR33)\n- Baker Mayfield (TB - QB7)\n- Travis Hunter (JAC - DB, WR34)\n- T.J. Hockenson (MIN - TE6)\n- Jaylen Warren (PIT - RB29)\n- Chris Olave (NO - WR35)\n- Bo Nix (DEN - QB8)\n- Mark Andrews (BAL - TE7)\n- Kyler Murray (ARI - QB9)\n- Rashee Rice (KC - WR36)\n- Dak Prescott (DAL - QB10)\n- Brock Purdy (SF - QB11)\n- Jakobi Meyers (LV - WR37)\n- Chris Godwin Jr. (TB - WR38)\n- Evan Engram (DEN - TE8)\n- Emeka Egbuka (TB - WR39)\n- Jordan Mason (MIN - RB30)\n- Javonte Williams (DAL - RB31)\n- Jauan Jennings (SF - WR40)\n- Tank Bigsby (JAC - RB32)\n- Travis Etienne Jr. (JAC - RB33)\n- Tucker Kraft (GB - TE9)\n- Matthew Golden (GB - WR41)\n- Deebo Samuel Sr. (WAS - WR42)\n- Najee Harris (LAC - RB34)\n- David Njoku (CLE - TE10)\n- Zach Charbonnet (SEA - RB35)\n- Stefon Diggs (NE - WR43)\n- Khalil Shakir (BUF - WR44)\nPrintable 2025 fantasy football position rankings\nIf you prefer rankings grouped by position, you can download those here."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/kenneth-walker-iii/1164402",
      "text": "Find Vegas odds on the top Super Bowl favorites and find out where the Seattle Seahawks rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Kansas City Chiefs rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/27/2025-fantasy-football-running-back-busts-rankings/85837358007/",
      "text": "6 fantasy football RB bust candidates based on trends\nDrafting an early-round bust in fantasy football is like being a Jets fan. Your season is over before it even starts.\nFor this article, we'll define \"bust\" as someone with a positional average draft position (ADP) of 30 or higher who missed his ADP by at least 10 slots. For example, if a back had an ADP of RB14, he'd have had to finish as the RB24 or worse to be considered a bust.\nRather than trying to pinpoint busts, we'll use a process of elimination to exclude players whose trends don't align with previous busts. In other words, we'll look back at all the running backs who busted over the last eight years, attempt to identify common trends, and eliminate those who don't meet those benchmarks.\nAn important note before we dive in — this is a shortlist of candidates based on trends. These are NOT predictions.\n2025 POSITION RANKINGS: QB | RB | WR | TE | K | D/ST | Overall\n2025 fantasy football RB busts\nNote: All fantasy scoring references are half-PPR, and all ADP data is via FantasyPros.\nTo generate this shortlist, we'll look at the running back busts from the last eight years and identify common trends from their preceding seasons. Rookies are excluded, given that they're in their first season.\nIn all, there were 80 players during this stretch who fit the bust criteria, but we'll focus on the runners who didn't bust primarily due to injury. To do that, we'll narrow the parameters to those who busted despite missing four games or fewer. That gives us a list of 31 running backs.\nHere are the trends:\n0.38 — As you'll gather from most of these trends, inefficiency is a key indicator for a potential bust. In our sample, 25 of the 31 backs averaged 0.38 fantasy points per snap or less.\n0.85 — On a very related note, 25 of the 31 running back busts averaged less than 0.85 fantasy points per touch. Using fantasy points per opportunity would have yielded similar results.\n0.45 — There are several ways to dissect volume, but one of the most predictive signals is how often a player gets the ball when he's on the field. On that note, 24 of the 31 busts averaged fewer than 0.45 touches per snap in their preceding season.\n9.8 — The correlation of pass-catching to fantasy production is well-documented, and that's especially true in today's NFL. Of our 31-player sample, only three averaged more than 9.8 yards after the catch per reception.\n14 — The final trend ties in two predictive metrics, volume and high-value pass-catching opportunities. Over the last eight years, only four of the 31 running back busts totaled 14 or more red zone targets.\nSo, who are the fantasy football RB bust candidates?\nHere are the six players who failed to be eliminated by any of the thresholds above (ranked in order of positional ADP):\n- Kyren Williams (11.7 ADP) - Unimpressive efficiency is something Williams has in common with most of the highly drafted busts in recent years. Among the 17 busts in our sample with an ADP higher than RB20, Kyren's 2024 season would have ranked third-worst in yards per touch and yards per snap, as well as dead last in yards per route run. He'd also have been in the bottom third in fantasy points per opportunity. Additionally, the Rams have two top-120 picks on the depth chart behind him (Blake Corum and Jarquez Hunter), so his leash might not be as long if the inefficiency continues.\n- Breece Hall (16.0 ADP) - Hall already busted last year, though that came at a premium ADP of RB2 (he finished as the RB17). Being inefficient in a potential timeshare on a bad offense could result in a second consecutive bust season for Hall. At least this year's ADP won't kill your team if he tanks.\n- Kenneth Walker III (16.7 ADP) - Based strictly on his 2024 performance, Walker is a risk on two fronts. His 3.7 yards per carry ranks dead last among all backs going inside the top-30 this year, and he's also missed 20% of Seattle's games through three seasons. That said, the upside is tantalizing, and the risk seems to be baked into his ADP.\n- Chuba Hubbard (17.7 ADP) - Hubbard ended up being one of the best picks in fantasy last year, but there are reasons for skepticism ahead of 2025. The 26-year-old wasn't very efficient, particularly as a receiver. Among the 43 backs with at least 20 receptions, Hubbard ranked last in yards per route run and tied for last in yards after catch per reception.\n- Tony Pollard (24.0 ADP) - Among all running backs with a top-30 positional ADP, only Isiah Pacheco averaged fewer fantasy points per opportunity than Pollard. Pollard struggled as a receiver, finishing the 2024 season in a tie for last place in yards after the catch per reception. Tyjae Spears starting the season on IR gives Pollard some leeway, but his leash might not be as long this year.\n- Tyrone Tracy Jr. (28.7 ADP) - Tracy was one of the best waiver pickups last year, but his volume and efficiency were all over the place. Among the top 30 backs drafted this year, Tracy ranked last in opportunities per snap and second-worst in fantasy points per snap last season. Even after he took over as lead back in Week 5, he still had five games with fewer than 14 touches. In addition to a healthy Devin Singletary, he'll have to fend off rookie Cam Skattebo in New York's backfield this season.\nFantasy football RB workload concerns\nFour running backs had at least 344 touches last season — Saquon Barkley, Bijan Robinson, Kyren Williams and Derrick Henry. Since 2010, 34 players have handled that kind of workload, and here are their trends from the following season:\n- All but five of the backs (85%) saw declines in their per-game production the following season, including 22 who experienced declines of 20% or more.\n- All but five of those runners sustained total fantasy-point declines larger than 17%. More than two-thirds of the 34 backs had their total points decline by at least 26%."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/miles-sanders/924261",
      "text": "Despite a sudden surge of Cowboys confidence, the Eagles should soar past them in Week 1.\nIn his first Packers press conference, Parsons reflected on leaving Dallas, thanked Cowboys fans, and addressed expectations in Green Bay.\nThe Micah Parsons trade changed the whole complexion of the Cowboys' defense. How will Dallas replace its star pass rusher in the short and long term?\nThe Dallas Cowboys could have a multitude of reasons behind who they chose to keep.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/15/fantasy-football-value-picks-cj-stroud/85528215007/",
      "text": "Top fantasy football value picks at every position in 2025 drafts\nFantasy football is all about finding advantages with extra value in your picks.\nManagers across all league formats are looking for players who will outperform their draft positions. A productive first-round pick is the simplest way to contending year-in and year-out. It's a pick made in the later rounds that plays like a top five-to-10 player at their position that can make a championship team.\nIt's tough to accurately predict which players will outplay their draft position in fantasy football. If it were easy, everyone would win championships. There are some common ways that players outshine expectations on a regular basis, though.\nRookies can provide opportunity for value, depending on their landing spot and the talent or coaching around them. Players can take a step in their second year in the league or with a new coordinator or play-calling head coach. A rough situation a year ago can give way to better conditions thanks to roster changes as well.\nWe've come up with a dozen players and units who could be great value picks this season. With one exception, all of them are ranked lower than 70th overall in average draft position (ADP) by FantasyPros. These aren't the players you're expecting to get in Rounds 1-5; these are the later-round players who could make a huge difference in value this season.\nQB C.J. Stroud, Houston Texans\n- FantasyPros ADP: QB17, OVR130\nAn incredible rookie season in 2023 had Stroud up to QB5 by FantasyPros' rankings ahead of the 2024 season. As the offense stalled out, Stroud finished as QB18 in fantasy football, a step down from his QB11 finish in 2023.\nThere's been a lot of change this offseason in Houston. He'll have a new offensive coordinator in Nick Caley who spent the last two years in Los Angeles on the Rams' coaching staff. The offensive line will have multiple new starters, as will the receiving corps with free agent additions and top draft picks alike.\nEven as things change around him, Stroud has a top-10 wide receiver in Nico Collins to rely on. If Caley can bring the offense back to a top-half of the league unit, Stroud will be the catalyst for it and should finish much better than QB17.\nQB Michael Penix Jr., Atlanta Falcons\n- FantasyPros ADP: QB23, OVR153\nPenix had some flashes as a rookie down the stretch in Atlanta last season. He will have a full offseason as the starter under his belt with the Falcons and their dynamic offensive weapons headlined by Drake London and Bijan Robinson.\nAtlanta had one of the best rushing attacks in the NFL last year and should be solid in that area once again. It's down to Penix to make the most of the passing game. Atlanta should have an easy schedule of defenses this season including the Panthers and Saints twice. He's being drafted as a low-end QB2 by ADP but, with the continuity and supporting cast around him, could conceivably make it to high-end QB2 or low-end QB1 by season's end.\nRB RJ Harvey, Denver Broncos\n- FantasyPros ADP: RB25, OVR52\nHarvey is the lone exception to the ADP below 75th, but he's around RB25 in most formats. That makes him a low-end RB2 entering the season despite playing for one of the top offensive minds in Sean Payton.\nDenver spent a second-round pick on Harvey. That's no small investment at running back. He should get a large share of carries even with veteran J.K. Dobbins in the building. His receiving skills out of the backfield should increase his value even more in half- and full-PPR formats as Payton likes to involve his backs in the passing game.\nRB Miles Sanders, Dallas Cowboys\n- FantasyPros ADP: RB64, OVR208\nTo balance the Harvey pick out we offer the second-lowest overall ADP on this list. Sanders is one of two veterans vying for a starting role in the Dallas backfield. Javonte Williams could be the starter, but his injury history causes some concern.\nThat could be to Sanders' gain, at least early on. The Cowboys brought in new offensive coordinator Klayton Adams who had a prominent role in one of the top rushing attacks in the league in recent years in Arizona. Rookies Jaydon Blue and Phil Mafah might take time to have an impact on late and early downs, respectively. That leaves the door open for Sanders to have a role that far outranks his current draft position.\nWR Jaylen Waddle, Miami Dolphins\n- FantasyPros ADP: WR31, OVR73\nTyreek Hill is two years removed from leading the NFL in receiving yards and touchdowns and is entering his age-31 season. In 2024, Hill failed to reach 1,000 yards as a starter for the first time without missing any games for injury.\nThat's all to say the torch could be passed to Waddle more than before in 2025. With quarterback Tua Tagovailoa missing time, Waddle also struggled and failed to reach 1,000 yards for the first time in his career. He should bounce back in 2025 and could get a bigger target share with tight end Jonnu Smith (111 targets in 2024, second to Hill) no longer on the team.\nWR Stefon Diggs, New England Patriots\n- FantasyPros ADP: WR42, OVR91\nDiggs' 2024 season ended early with a significant knee injury but he seems to be healthy as the preseason approaches. The Athletic's Chad Graff observed in camp that \"if he can stay healthy, another 1,000-yard season isn’t just in play but might be likely.\"\nDiggs is in the decline of his career considering that injury and his age (he'll turn 32 years old this season). Still, considering the dearth of proven weapons in New England and the current receiver hierarchy, Diggs should be the No. 1 target in the passing game. That's enough opportunity to see him outplay this draft spot.\nWR Ricky Pearsall, San Francisco 49ers\n- FantasyPros ADP: WR48, OVR100\nOutside of tight end George Kittle, target distribution in the passing game is unclear in San Francisco. Brandon Aiyuk won't be ready by Week 1 and that leaves Pearsall and Jauan Jennings to pick up the slack among the pass-catchers.\nPearsall's come back from an early hamstring tweak to be one of the stars in training camp for the 49ers. He's getting a lot of attention in the passing game from quarterback Brock Purdy, especially as Jennings deals with a calf injury. Pearsall could absolutely out-perform his draft position at least until Aiyuk returns midseason.\nWR Emeka Egbuka, Tampa Bay Buccaneers\n- FantasyPros ADP: WR52, OVR117\nEgbuka was one of the top wide receiver prospects in the 2025 NFL Draft. He's one of the most pro-ready of the group with the skillset to contribute from the slot as a rookie. He may have a great opportunity to do so in year one.\nTampa Bay's touted one of the better wide receiver duos in the league for years with Mike Evans and Chris Godwin. The former is entering his age-32 season in the NFL and the latter is recovering from a devastating ankle injury that required a second surgery this offseason. Godwin's absence has given Egbuka more opportunity to shine in training camp and he has. His ceiling as capped at likely a high-end WR3 at best but he could absolutely outplay his current ADP.\nTE Jonnu Smith, Pittsburgh Steelers\n- FantasyPros ADP: TE11, OVR108\nSmith had a career-high 111 targets in Miami with inconsistent quarterback play due to Tua Tagovailoa missing multiple games. There's a chance he could eclipse that in Pittsburgh as he's been reunited with his former coach Arthur Smith, now the Steelers' offensive coordinator.\nTrade acquisition DK Metcalf is the Steelers' top weapon on offense but we've seen him in Seattle allow for more than one fantasy-relevant pass-catcher around him. Smith's rapport with Arthur Smith could be key at a top-heavy position. There's a cliff after the top five or six players at the position when it comes to expectations entering 2025.\nTE Zach Ertz, Washington Commanders\n- FantasyPros ADP: TE17, OVR158\nErtz was one of many veterans in Washington to benefit from Jayden Daniels' arrival in 2024. The three-time Pro Bowl tight end had 654 yards and seven touchdowns, his best year since 2021.\nHe enters 2025 with good value due to the contract standoff between Washington and top wide receiver Terry McLaurin. That could drag well into the preseason and keep McLaurin from getting valuable reps and cause him to start slow to the year. That could give Ertz a bigger portion of the targets and a chance to sustain that through the season.\nSan Francisco 49ers D/ST\n- FantasyPros ADP: D/ST10, OVR200\nThe 49ers were the third-best defense in fantasy football in 2022. In the two seasons since, they dropped to 10th in 2023 then 25th in 2024, their lowest ranking since 2018. That looked appropriate given what happened on the field as well.\nSan Francisco invested heavily into the draft to turn the tide. Rookie defensive linemen Mykel Williams, Alfred Collins and CJ West should all see significant playing time this season in a turnaround year for the franchise. But what really makes them such a value play is their schedule. San Francisco faces the easiest schedule by 2024 winning percentage in the league in 2025. They'll play the NFC South and AFC South teams as well as the Browns, Bears and Giants. That's a cushy schedule featuring plenty of first-time play-calling head coaches or rookie quarterbacks.\nTampa Bay Buccaneers D/ST\n- FantasyPros ADP: D/ST15, OVR220\nTampa Bay also has one of the easier schedules when it comes to opposing offenses thanks to playing the Panthers and Saints twice each. The Buccaneers also take on the AFC East this year which includes the Patriots and Jets.\nThe Buccaneers added depth at cornerback in the draft and added in free agency at edge rusher with Haason Reddick. Even if the talent isn't top-tier, the coaching is with Todd Bowles calling plays on that side of the ball.\nAll the NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/sports/fantasy/football/",
      "text": "AI's guide to winning fantasy football drafts in 2025\nfootball\nTop fantasy football D/ST sleepers for 2025\nfootball\nFantasy football value picks at every position\nfootball\nGet your printable 2025 fantasy football rankings and cheat sheets\nfootball\nHow Malik Nabers' positive injury update impacts fantasy outlook\nfootball\n4 fantasy football WR busts to avoid in 2025 drafts\nfootball\nWhat are the best D/STs in fantasy football drafts in 2025?\nfootball\nShould you draft Rashee Rice in fantasy football? Impact of suspension\nfootball\n6 fantasy football RB bust candidates for 2025 based on trends\nfootball\nShould you draft Travis Kelce in fantasy football?\nfootball\nShould you draft Jordan Addison in fantasy?\nfootball"
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/08/12/fantasy-football-rb-tiers-2025/85449111007/",
      "text": "Fantasy football RB tiers for 2025: Best fantasy options, ranked\nRunning back has long been the most important position in fantasy football. Even as wide receivers become more valuable in modern fantasy football, running back remains a position that can win or lose your league.\nLast year, Saquon Barkley was a league-winner for countless managers behind a career year with the Super Bowl champion Philadelphia Eagles. Jahmyr Gibbs was especially good for full-PPR leagues thanks to his receiving abilities.\nIt's time to look ahead to the 2025 season as preseason action heats up. The likes of Barkley and Gibbs will command a high draft pick in snake drafts or top dollar in auction leagues.\nBeyond them, it's a challenge for managers to determine the right value of other players. We're here to help with a tiered breakdown of the running position for fantasy football in 2025:\nTier 1\n- Saquon Barkley, Philadelphia Eagles\n- Bijan Robinson, Atlanta Falcons\n- Ashton Jeanty, Las Vegas Raiders\n- Jahmyr Gibbs, Detroit Lions\nThese are the bell cows of the position, though they all come with some question marks. Barkley had 378 total touches last year and the history of running backs hitting 370 is not good. He should avoid a huge drop-off thanks to an elite offensive line, but it will be tough to match his career-bests from 2024.\nRobinson operated in one of the most efficient running games of the last decade with Atlanta in 2024. That may regress more towards the mean this year. Jeanty is the clear No. 2 weapon behind a tight end, something none of the other Tier 1 backs can say. Gibbs has a new coordinator but that could see him get an even bigger share of the carries as an electrifying young back.\nTier 2\n- Derrick Henry, Baltimore Ravens\n- Josh Jacobs, Green Bay Packers\n- De'Von Achane, Miami Dolphins\n- Christian McCaffrey, San Francisco 49ers\n- Bucky Irving, Tampa Bay Buccaneers\nIf you don't get the top four guys, this group is full of league-winner as well. Henry's shown no signs of slowing down in one of the best offenses in the league. Green Bay invested in its offensive line this offseason and that should mean Jacobs remains a fringe top-five fantasy running back.\nAchane is a borderline Tier 1 running back in full PPR leagues as he's one of the more productive receivers out of the backfield. McCaffrey is one of the toughest reads ahead of the season because of his injuries last season and the 49ers building up depth behind him. Irving was a star as a rookie behind one of the best offensive lines in the league. Without Liam Coen at coordinator, it's unclear how things could improve in 2025.\nTier 3\n- James Cook, Buffalo Bills\n- Chuba Hubbard, Carolina Panthers\n- Jonathan Taylor, Indianapolis Colts\n- Omarion Hampton, Los Angeles Chargers\n- Kenneth Walker III, Seattle Seahawks\n- Aaron Jones Sr., Minnesota Vikings\nCook had a top-10 fantasy RB season in 2024 on the back of his 18 touchdowns from scrimmage. If that regresses, can he churn out the yards to make up for it? Hubbard should be in for another strong season as the Panthers passing offense gets a boost from rookie wideout Tetairoa McMillan. Indianapolis' offense has lots of questions but Taylor isn't one of them. He should be a reliable starter when healthy, unfortunately a big caveat for a player who hasn't played a full season since 2021.\nHampton should have lots of opportunity to become the Chargers' top running back in the first month of the season in what should be a run-first offense. Walker could thrive with more outside zone run schemes that new offensive coordinator Klint Kubiak is expected to bring to Seattle in 2025. Few teams signaled an intent to run the ball more and better than Minnesota this offseason with their moves in free agency and the draft, something that should greatly benefit Jones Sr.\nTier 4\n- Chase Brown, Cincinnati Bengals\n- Kyren Williams, Los Angeles Rams\n- Breece Hall, New York Jets\n- Alvin Kamara, New Orleans Saints\n- James Conner, Arizona Cardinals\n- Kaleb Johnson, Pittsburgh Steelers\nThis tier is has some reliable players and a few with a chance to exceed expectations. Brown was one of the top six backs in fantasy football over the second half of the season and could keep that clip up in 2025. Williams was one of the least productive backs on a per-carry basis in 2024; but was that more to do with the Rams' early-season woes or a true drop-off?\nHall was a fantasy bust after being a preseason top-five player, but he has a new coordinator and quarterback around him in 2025. Kamara just turned 30, but has a new play-calling head coach who may lean on him as a rookie quarterback gets up to speed. Conner thrived in the Cardinals' diverse running scheme last season but, like Kamara, is entering his age-30 season. Johnson is a rookie but under Arthur Smith in Pittsburgh, it's hard to find a better fit of player and scheme.\nTier 5\n- TreVeyon Henderson, New England Patriots\n- D'Andre Swift, Chicago Bears\n- RJ Harvey, Denver Broncos\n- Tyrone Tracy Jr., New York Giants\n- David Montgomery, Detroit Lions\n- Joe Mixon, Houston Texans\n- Isiah Pacheco, Kansas City Chiefs\n- Brian Robinson Jr., Washington Commanders\n- Tony Pollard, Tennessee Titans\n- Javonte Williams, Dallas Cowboys\nTier 5 rounds out the other starting running backs in the NFL or players whose 2025 outlook is murky. The rookie Henderson is undoubtedly the most explosive skill position player in New England but his role is unclear with the incumbent Rhamondre Stevenson in town. Swift should benefit from a change in offensive play-caller with Ben Johnson's impressive track record of success from Detroit.\nHarvey, another electric rookie back, may not be the top man to start in Denver but should grow into a bigger role, especially with his proven skills as a receiver out of the backfield. Tracy Jr. was solid in his first season but enters Year 2 with questions around him at quarterback and offensive line -- and one of the toughest slates of defenses in the league.\nMontgomery hit 1,100 yards and dozen touchdowns again in 2024 but his role may change with a new offensive coordinator. Mixon is dealing with injuries to open the season behind a less talented offensive line and Nick Chubb spelling him for carriers. Injury cut Pacheco's 2024 season short so he could be in for a bounce-back season in a contract year.\nRobinson Jr.'s value is limited in half- and full-PPR leagues thanks to Austin Ekeler's presence but he's still the top man in one of the more efficient offenses in the league. Pollard should get a big boost this season from a change in quarterback and an upgraded offensive line, the question is just how high he could go. Williams could benefit from offensive coordinator Klayton Adams' arrival in Dallas after years helping the Cardinals create one of top rushing schemes in the league.\nTier 6\n- Zach Charbonnet, Seattle Seahawks\n- Jaylen Warren, Pittsburgh Steelers\n- Jordan Mason, Minnesota Vikings\n- Travis Etienne Jr., Jacksonville Jaguars\n- Rhamondre Stevenson, New England Patriots\n- J.K. Dobbins, Denver Broncos\n- Rachaad White, Tampa Bay Buccaneers\n- Nick Chubb, Houston Texans\n- Dylan Sampson, Cleveland Browns\n- Tyler Allgeier, Atlanta Falcons\n- Najee Harris, Los Angeles Chargers\n- Cam Skattebo, New York Giants\n- Jaydon Blue, Dallas Cowboys\n- Tank Bigsby, Jacksonville Jaguars\n- Isaac Guerendo, San Francisco 49ers\n- Tyjae Spears, Tennessee Titans\n- Roschon Johnson, Chicago Bears\n- Brashard Smith, Kansas City Chiefs\n- Trey Benson, Arizona Cardinals\nWelcome to the land of handcuffs and low-end starters. Charbonnet, Warren and Mason should all have large roles in run-first offenses and could spell the starter if they miss time. Warren's value as a receiver sets him apart in that trio.\nThe Jaguars' backfield hierarchy is unclear but Etienne Jr. could see a bigger role with a new offensive play-caller. Stevenson and Dobbins are both proven veterans but in backfields with more dynamic rookie rushers. White could see a drop with Liam Coen's departure but his value as a receiver keeps him relevant. Chubb may get more carries as Mixon makes his way back to healthy status ahead of Week 1.\nLike Jacksonville, it's unclear who will lead the way in Cleveland's backfield but Sampson has the receiving ability to make a difference in fantasy. Harris is dealing with injury but is expected to spell Hampton by Week 1. The rookie Skattebo should be a complement to Tracy Jr. but his share of the carries is unclear at this point.\nBlue is the most dynamic running back in the Cowboys backfield and that should work to his benefit as the season wears on. Bigsby was the Jaguars' leading rusher in 2024 and he could get a boost from Coen's arrival. Guerendo started in place of the injured McCaffrey at times in 2024 and looks primed to be a top handcuff in Year 2. As the Titans' offense likely improves in 2025, Spears should benefit as a flex option in a pinch.\nJohnson could see a bigger role with Ben Johnson now calling plays in Chicago. Smith's receiving abilities give him the opportunity to take on a Jerick McKinnon-like role in Kansas City. Benson could take a step as Conner ages. If not, he's a great handcuff option."
    },
    {
      "url": "https://www.usatoday.com/story/sports/fantasy/football/2025/07/31/fantasy-football-rb-rankings-bijan-saquon/85423703007/",
      "text": "Fantasy football RB rankings: Bijan Robinson or Saquon Barkley at No. 1?\nThe end of July means preseason football is just around the corner for teams across the NFL. For some, it's already here: the Hall of Fame game July 31 pits the Los Angeles Chargers against Detroit Lions to open football for the 2025 season.\nThat means we're getting closer to fantasy football draft season for millions of managers deciding how best to fill out their rosters, including at running back.\nAs in 2023, last year's top fantasy running back, Saquon Barkley, earned Offensive Player of the Year honors in real life while winning plenty of fantasy football leagues for managers across the country. He also will be featured on the cover of Madden, following fully in Christian McCaffrey's footsteps a year prior.\nThis year could be an intriguing one for the running back position. One of the most talented draft classes in years gave dozens of teams viable rookie starters or rotational players. Returning stars like Barkley and McCaffrey face some question marks in the wake of their standout seasons.\nThat's a lot to sort through for fantasy managers but don't worry, USA TODAY Sports has you covered with the top 50 running backs in fantasy football this season.\n2025 POSITION RANKINGS: QB | RB | WR | TE | K | D/ST | Overall\nFantasy football rankings: RB\n1. Bijan Robinson, Atlanta Falcons. The Falcons were one of the best rushing offenses in the league last season. They lost starting center Drew Dalman in free agency but the offense as a whole could take a step forward in year two with QB Michael Penix. Robinson improved in 2024 without racking up too much mileage. He's one of the most talented running backs in the league. Don't overthink it.\n2. Saquon Barkley, Philadelphia Eagles. Barkley had an outstanding 2024 season but history is not on his side to replicate that success. He had 378 total touches in the regular season; each of the nine running backs to hit more than 370 in the last decade saw a significant drop-off in production the following year. He's still this high thanks to one of the best offensive lines in the league.\n3. Ashton Jeanty, Las Vegas Raiders. This absolutely could be too high for a rookie running back, especially one running behind an offensive line with some question marks. But the Raiders offense is an anomaly. The only weapon ahead of Jeanty in the pecking order is tight end Brock Bowers. Las Vegas offensive coordinator Chip Kelly has evolved as an offensive play-caller and Jeanty should benefit with his generational traits.\n4. Jahmyr Gibbs, Detroit Lions. What the Lions offense will be without longtime coordinator Ben Johnson is one of the biggest questions across the NFL in 2025. Gibbs is a game-breaking weapon for new coordinator John Morton, who schemed the 2017 Jets into a top-20 rushing attack led by Bilal Powell and a 32-year-old Matt Forte in his last coordinator job. Detroit continued its investment in the offensive line in the draft and that should give fantasy owners confidence despite the changes.\n5. Derrick Henry, Baltimore Ravens. He can't keep doing this forever but we won't be the ones too early on King Henry's drop-off. He had 2,114 yards from scrimmage in his first season in Baltimore. Even with the threat of Lamar Jackson and the return of the speedy Keaton Mitchell, Henry is the No. 1 ball-carrier for one of the best rushing offenses in the league.\n6. Josh Jacobs, Green Bay Packers. Jacobs was RB5 in standard scoring last season and Green Bay invested in the offensive line even more in free agency and the draft. A healthy Jordan Love in 2025 could impact Jacobs' share of the offensive load but not enough to negatively affect his overall production.\n7. De'Von Achane, Miami Dolphins. Achane was a top-10 RB in 2024 and especially valuable in PPR leagues with a career-high 78 catches for 592 yards and six touchdowns. Raheem Mostert is now in Las Vegas and that should give Achane more of the rushing load even as Jaylen Wright takes on a bigger role.\n8. James Cook, Buffalo Bills. Cook is still participating in training camp even as he looks for a contract extension. He was a touchdown machine in 2024 but had just 1,267 yards from scrimmage, the lowest total among the top 10 fantasy running backs. He should still be a top-10 fantasy back this season thanks to a top-tier offense, even if his touchdown total regresses.\n9. Bucky Irving, Tampa Bay Buccaneers. Irving was one of the biggest surprises in the NFL last season thanks to his breakout year in which he was remarkably efficient on a per-touch basis. His ceiling may be capped by Rachaad White's presence in the passing game, a top-tier wide receiving corps and a new play-caller but he's still running behind a top-tier offensive line. He's got one of the highest floors in the league entering year two.\n10. Christian McCaffrey, San Francisco 49ers. McCaffrey may be the toughest running back to project for 2025. He looks to be fully healthy after a tumultuous 2024 season that saw him fail to find the end zone for the first time in his career. The 49ers drafted Jordan James in Round 5 this year and Isaac Guerendo could take on a bigger role in Year 2. San Francisco is facing uncertainty in the receiving corps so McCaffrey could be relied upon early in the season to shoulder the load.\n11. Jonathan Taylor, Indianapolis Colts. Taylor may have won (or lost) many fantasy football championships in 2024 thanks to his string of top-five performances from Weeks 16-18. Indianapolis has question marks at quarterback as well as interior offensive line and Taylor hasn't played a full season since 2021. That's a lot of concern but he's still one of the top runners in the NFL when healthy.\n12. Chuba Hubbard, Carolina Panthers. Hubbard hit 1,000 yards and 10 touchdowns for the first time in his career last season. Things could be even better in 2025 thanks to the Panthers' passing offense potentially taking a step forward with wideout Tetairoa McMillan's arrival. He should keep defenses from focusing on stopping the run when lining up against Carolina's offense.\n13. Omarion Hampton, Los Angeles Chargers. Behind Jeanty, Hampton was in his own tier of running back prospects in the 2025 NFL draft. He's in a perfect spot to be a contributor early on. Chargers coach Jim Harbaugh wants to win by running the ball effectively. Hampton should enjoy running behind two of the top young tackles in the league and will have plenty of opportunity to showcase his skills as a receiver.\n14. Kenneth Walker III, Seattle Seahawks. Seattle has a new coordinator with Klint Kubiak and that should lead to running the ball much more effectively than in 2024. The game plan will likely feature a lot of outside zone, which plays into Walker's skillset. Zach Charbonnet may vulture some carries, but all signs point to Walker enjoying his best season in Seattle to date, pending health.\n15. Chase Brown, Cincinnati Bengals. Brown was a top-six fantasy RB in all scoring formats from Week 9 on in 2025. Cincinnati should have better play at both guard spots on the offensive line and feature the best wide receiver duo in the league. Rookie Tahj Brooks is a powerful runner and could work into a role sooner than later, but that should alleviate injury concerns for Brown without eating into his production too much.\n16. Kyren Williams, Los Angeles Rams. Williams had more carries (316) than all but two running backs in the NFL (Henry and Barkley) last season but finished as RB6 or RB7, depending on the format. Williams is looking for an extension and the Rams added Jarquez Hunter in the draft. The volume should be there but he may not make the most of it.\n17. Breece Hall, New York Jets. Hall entered last season viewed as one of the top RBs in fantasy and ended the year outside of the top 15 in all formats. He's in great position to have a better year in 2025 with a new offensive coordinator in Tanner Engstrand, a bolstered offensive line and a dual-threat quarterback in Justin Fields.\n18. Aaron Jones Sr., Minnesota Vikings. Jones was a top-20 running back in 2024 despite reaching the end zone just seven times. Minnesota overhauled the interior of its offensive line and that shows an intent to run the ball more and more effectively. With first-year starter J.J. McCarthy taking over at quarterback, Jones' ceiling is much higher than a year ago, even with Jordan Mason now in town.\n19. Alvin Kamara, New Orleans Saints. New Orleans is welcoming a new offensive play-caller in head coach Kellen Moore, upgrades on the offensive line and lots of questions at quarterback. Kamara's well past his prime as a top-10 fantasy RB but should have a high floor in what could be a run-first offense.\n20. James Conner, Arizona Cardinals. Conner was a fringe top-10 running back last season in one of the most diverse running schemes in the league. Cardinals running game coordinator Klayton Adams is now the offensive coordinator in Dallas, which could affect Conner and the offense as he reaches his age-30 season.\n21. Kaleb Johnson, Pittsburgh Steelers. Johnson is another rookie running back in a good situation. Steelers offensive coordinator Arthur Smith will welcome his skillset and there's a chance the Steelers offensive line can become one of the best in the league.\n22. TreVeyon Henderson, New England Patriots. Henderson is New England's most dynamic playmaker on offense entering 2025. Rhamondre Stevenson may be ahead of him on the depth chart, but it'd be a surprise if offensive coordinator Josh McDaniels limits his touches as a rookie.\n23. D'Andre Swift, Chicago Bears. New Bears head coach and offensive play-caller Ben Johnson schemed up one of the top offenses in the league in Detroit based on a potent running game. Swift could benefit from the new hire and upgrades on the offensive line.\n24. RJ Harvey, Denver Broncos. Denver signed veteran J.K. Dobbins, but the dynamic rookie Harvey should be a threat as a runner and receiver. Even with Dobbins and Audric Estime in the building, Harvey will have a big role.\n25. Tyrone Tracy Jr., New York Giants. Tracy had a strong rookie season last year and could improve in Year 2, especially in half- and full-PPR leagues thanks to his background as a receiver. New York has a tough schedule in 2025, three potential starting quarterbacks and added to the running back room in free agency and the draft. That makes Tracy a risky pick.\n26. Joe Mixon, Houston Texans. Mixon will miss significant time with a foot injury and that's a tough outlook entering the 2025 season under a new offensive coordinator. He's going into his age-29 season behind an offensive line with plenty of question marks.\n27. David Montgomery, Detroit Lions. Only seven RBs had more rushing touchdowns than Montgomery last season, but he barely cracked 1,000 yards from scrimmage. If that scoring total takes a dip with a change in coordinator and a larger role for Gibbs, that could knock Montgomery down from low-end RB2 status.\n28. Isiah Pacheco, Kansas City Chiefs. Pacheco struggled in 2024 following a fractured fibula early in the season. He'll be contending for touches with free agent addition Elijah Mitchell and rookie Brashard Smith but should still be the lead back. That gives him a high floor entering 2025.\n29. Tony Pollard, Tennessee Titans. Tennessee upgraded everything around the running back position this offseason and Pollard should benefit. There will be multiple new starters on the offensive line, an upgraded receiving corps and a No. 1 pick at quarterback. That's much improved from his RB21 circumstances a year ago.\n30. Brian Robinson Jr., Washington Commanders. Washington upgraded its offensive line and should take a step under second-year coordinator Kliff Kingsbury and quarterback Jayden Daniels. But Robinson isn't much of a threat as a receiver, especially with Austin Ekeler still on the roster, which keeps his ceiling low despite a high floor.\n31. Zach Charbonnet, Seattle Seahawks. Walker will be the lead back in Seattle but hasn't played a full season since entering the league in 2022. That makes Charbonnet one of the top handcuff options in fantasy this year with RB3 potential in an offense lacking playmakers outside of Walker and Jaxon Smith-Njigba.\n32. Jaylen Warren, Pittsburgh Steelers. The Steelers opted to re-sign Warren this offseason and he should benefit from the improved offensive line. Johnson may shoulder a lot of the rushing load, but Warren could be a sleeper in PPR leagues as Pittsburgh's pass-catching group lacks much beyond D.K. Metcalf.\n33. Javonte Williams, Dallas Cowboys: Williams is one of two free agent additions alongside Miles Sanders in a new-look Cowboys backfield. New offensive coordinator Klayton Adams helped design a creative running scheme in Arizona. That could benefit Williams and the other runners in Dallas.\n34. Jordan Mason, Minnesota Vikings. Mason moved from San Francisco to Minnesota this offseason and his outlook significantly improved. Aaron Jones is entering his age-31 season and the Vikings should run the ball enough to make Mason an attractive handcuff with RB3 potential.\n35. Travis Etienne Jr., Jacksonville Jaguars. New Jaguars coach Liam Coen maximized a backfield with Rachaad White, Bucky Irving and Sean Tucker in Tampa Bay last year. It's unclear early how the touches will be divvied up in Jacksonville with Etienne competing with Tank Bigsby and rookie Bhayshul Tuten.\n36. Rhamondre Stevenson, New England Patriots. Stevenson is the lead returning ball-carrier in New England but Henderson's dynamic potential could eat into his opportunities. The Patriots offensive line shouldn't be nearly as bad as a year ago, giving some potential for Stevenson as a low-end RB3.\n37. Nick Chubb, Houston Texans. With Mixon facing an injury in training camp, Chubb could be a surprise contributor early on in 2025. Houston has a first-year offensive coordinator and a new-look offensive line but the carries could be there for Chubb as Mixon works his way back to health.\n38. Dylan Sampson, Cleveland Browns. Cleveland's offense is full of question marks at quarterback and running back. Second-round pick Quinshon Judkins remains unsigned behind incumbent Jerome Ford. Sampson's abilities in the receiving game give him the edge over Ford here.\n39. J.K. Dobbins, Denver Broncos. Dobbins was an early-season fantasy darling last year before injury cut into his production. He and rookie RJ Harvey figure to share carries but Harvery should be the more explosive option, lowering Dobbins' ceiling.\n40. Rachaad White, Tampa Bay Buccaneers. White will be playing under his third offensive coordinator in the last three seasons. New coordinator Josh Grizzard was the passing game coordinator last year, which could see White's value as a receiver continue ... but Irving could eat even more into his share of the carries out of the backfield.\n41. Tyler Allgeier, Atlanta Falcons. Allgeier is one of the top handcuffs this season and has the track record to produce should Robinson miss time with injury. There may not be enough carries to go around if Robinson is in the lineup, though, capping Allgeier's ceiling.\n42. Najee Harris, Los Angeles Chargers. Harris is recovering from an eye injury and that could knock his already low fantasy outlook this season. But given how much the Chargers will likely want to run the ball, he should get steady carries behind Hampton in 2025. Just not enough to move him out of RB4 territory.\n43. Cam Skattebo, New York Giants. Skattebo will pair with Tracy in the Giants backfield, but things are bleak given the schedule, quarterback situation and offensive line. He showed off his skills as a receiver in college, which improves his outlook.\n44. Jaydon Blue, Dallas Cowboys. While Williams and Sanders may start the year with the most touches, look for Blue to get a bigger role as the season wears on. He's a proven receiver out of the backfield with dynamic ability in open space. In an offense lacking playmakers, watch out for him to improve as the season moves along.\n45. Tank Bigsby, Jacksonville Jaguars. Bigsby could see a bigger role with Coen now in Jacksonville, but his lack of receiving chops means he'll likely be pigeonholed in a crowded backfield. His best outlook is to take over as the early-down runner from Etienne and churn out yards behind an improved offensive line.\n46. Isaac Guerendo, San Francisco 49ers. Guerendo played well in a couple of starts as a rookie. McCaffrey is back and healthy in 2025 but Guerendo could be a top handcuff with rookie Jordan James offering potential as an early-down running back.\n47. Tyjae Spears, Tennessee Titans. Spears should benefit from the Titans' improved offense, though not as much as Pollard. He struggled with injury last season but looks set for a bigger role as the primary pass-catching back in Tennessee's offense.\n48. Roschon Johnson, Chicago Bears. New coach Ben Johnson used two running backs very effectively during his time in Detroit. That bumps Johnson's potential in 2025 to have a role akin to David Montgomery in recent years. That makes him a worthwhile late-round flyer.\n49. Brashard Smith, Kansas City Chiefs. Pacheco is the hard-nosed runner leading the way in Kansas City but Smith could be the dynamic receiving option out of the backfield. His background as a receiver should give him a role similar to what Jerick McKinnon had in years past.\n50. Trey Benson, Arizona Cardinals. Benson could see a bigger role in his sophomore season in Arizona as Conner gets one year older with a history of missing games with injury. He's a worthwhile handcuff with potential for a larger share of carries in 2025."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/jaydon-blue/1378898",
      "text": "Despite a sudden surge of Cowboys confidence, the Eagles should soar past them in Week 1.\nIn his first Packers press conference, Parsons reflected on leaving Dallas, thanked Cowboys fans, and addressed expectations in Green Bay.\nThe Micah Parsons trade changed the whole complexion of the Cowboys' defense. How will Dallas replace its star pass rusher in the short and long term?\nThe Dallas Cowboys could have a multitude of reasons behind who they chose to keep.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/rj-harvey/1172401",
      "text": "There is no one way to feel about MSU's win on Friday. But if you're looking for something to inspire confidence, the Spartans' maturity might be it.\nFind Vegas odds on the top Super Bowl favorites and find out where the Seattle Seahawks rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/chuba-hubbard/1062047",
      "text": "Find Vegas odds on the top Super Bowl favorites and find out where the Seattle Seahawks rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Kansas City Chiefs rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/kaleb-johnson/1381902",
      "text": "The Pittsburgh Steelers are hiring former Chicago Bears Director of Football Analytics Krithi Chandrakasan.\nSteelers safety DeShon Elliott says it's obvious the Dolphins have \"no culture.\"\nThe Steelers sent a scout to Texas vs Ohio State and here are the six guys they should be scouting.\nDiscover a list of the top rushers in the franchise history of the Steelers.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/tony-pollard/880398",
      "text": "New Tennessee Titans team captain Calvin Ridley opens up on his injuries and the suspension that helped shape who he is today.\nDiscover a list of the top receivers in the franchise history of the Titans.\nDiscover a list of the top passers in the franchise history of the Titans.\nDiscover a list of the top rushers in the franchise history of the Titans.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/kyren-williams/1167361",
      "text": "Here's where Eagles' Tanner McKee truly ranks when measured vs. other NFL backup quarterbacks.\nThe Rams could be the top team in the NFC, per Rich Eisen.\nJared Verse is already considered one of the best defenders in the NFL.\nDeebo Samuel stats, projections, injury status, news and betting insights.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/tank-bigsby/1215035",
      "text": "Find Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Kansas City Chiefs rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the New England Patriots rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/new-york-giants/351",
      "text": "25 Labor Day weekend sales at Crocs, Samsung, Anthropologie\nShopping\nVance says Trump is in 'good health' in exclusive interview\nPolitics\nNotre Dame, Alabama on upset alert? Bold predictions for Week 1\nCollege Football\nPrime minister of Yemen's Houthi government killed in Israeli strike\nWorld\nFEMA extends hiring freeze through 2025 as hurricane season looms\nPolitics\n4 women accused of encouraging Alabama middle school students to fight\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\n'On-the-job training': Takeaways from exclusive JD Vance interview\nPolitics\nThree Georgia universities hit by hoax armed shooter calls\nNation\nQuiz: Celebrate Taylor Swift's engagement to Travis Kelce with trivia\nGraphics\nFiring squad execution for murder of mother of 3 halted. Why?\nNation"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/tyrone-tracy-jr/1109708",
      "text": "Find Vegas odds on the top Super Bowl favorites and find out where the Seattle Seahawks rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Kansas City Chiefs rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/players/jordan-mason/1116001",
      "text": "Find Vegas odds on the top Super Bowl favorites and find out where the Seattle Seahawks rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Washington Commanders rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Tampa Bay Buccaneers rank among the best teams in the NFL.\nFind Vegas odds on the top Super Bowl favorites and find out where the Kansas City Chiefs rank among the best teams in the NFL.\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    }
  ],
  "argos_summary": "USA TODAY Sports releases updated 2025 NFL fantasy football running‑back rankings, highlighting sleepers, value picks, and potential busts. The article outlines how recent changes in coaching, offensive schemes, and player health could shift player value, with a focus on players like Kenneth Walker III, Kaleb Johnson, and Tony Pollard. Draft managers are advised to consider these insights when setting rosters ahead of the September 4 season start.",
  "argos_id": "1FCZKAB4J"
}