{
  "url": "https://finance.yahoo.com/news/end-minimis-loophole-means-higher-213725234.html",
  "authorsByline": "Megan Cerullo",
  "articleId": "6993fe5f5b084323a811528a991378f1",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/Pxrx.ojbqd9CDnH..kdRcQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/cbs_news_897/b254b1b82ec4bd85e2a0d47c4354a8f0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T21:37:25+00:00",
  "addDate": "2025-08-29T21:52:07.577879+00:00",
  "refreshDate": "2025-08-29T21:52:07.577880+00:00",
  "score": 1.0,
  "title": "End of de minimis loophole means higher prices for overseas goods, experts say",
  "description": "As of Aug. 29, shipments to the U.S. valued at less than $800 are subject to tariffs, potentially resulting in surprise costs for consumers.",
  "content": "The end of the de minimis tax loophole on Friday means that low-cost shipments to the U.S. are no longer exempt from import duties, a potential hit to consumers ordering goods from abroad.\n\nUnder the prior tax break, parcels containing goods worth less than $800 were not subject to tariffs, making many products from overseas, such as clothing and beauty products, a cheaper alternative to U.S.-made items.\n\nNow, stepped-up duties apply to all online orders entering the U.S. That could lead to higher costs and longer delivery times given that customs agents must now inspect and process the shipments, experts said.\n\n\"This means that, when making e-commerce purchases from your favorite international sites that you didn't have to worry about paying duties on before — now you have to,\" Rathna Sharad, CEO and co-founder of FlavorCloud, a global logistics platform, told CBS MoneyWatch. \"This increases the cost of common consumer goods, and it varies widely by category of product.\"\n\nIn her case, Sharad said the cost of the Korean beauty products she likes has already risen about 15%. \"It's a massive change for U.S. consumers, and a big change for brands and retailers because they have to scramble to figure out their pricing strategies and what this means for them.\"\n\nThe White House on July 30 announced it would suspend the de minimis treatment, calling it a \"catastrophic loophole\" that provided a pathway for opioids \"as well as other unsafe or below-market products that harm American workers and businesses\" to enter the U.S.\n\nThe White house said in a statement to CBS MoneyWatch that the loophole was exploited by bad actors.\n\n\"Between 2015 and 2024, shipments that entered the United States under de minimis ballooned by over 900%,\" White House spokesperson Kush Desai said in a statement. \"Thanks to President Trump's historic action, the days of criminal exporters and drug traffickers exploiting the de minimis loophole to flood our country with counterfeit goods, lead toys and illicit drugs like fentanyl are over.\"\n\nThe International Trade Administration, a federal agency, also cited statements from companies praising the move.\n\n\"The de minimis loophole has long provided an opportunity for some importers & retailers to avoid paying their fair share of U.S. duties,\" Gap said Friday. \"These packages are also typically subject to minimal inspection, raising potential safety concerns for U.S. consumers. Closing this loophole strengthens our nation's supply chain integrity, improves consumer protection, and levels the playing field for all retailers.\"",
  "medium": "Article",
  "links": [
    "https://www.trade.gov/press-release/what-they-are-saying-americans-praise-president-trumps-decisive-leadership-suspending?ftag=YHF4eb9d17",
    "https://www.cbsnews.com/news/de-minimis-us-tariffs-exemption-low-value-imports-ends/?ftag=YHF4eb9d17",
    "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-president-donald-j-trump-is-protecting-the-united-states-national-security-and-economy-by-suspending-the-de-minimis-exemption-for-commercial-shipments-globally/?ftag=YHF4eb9d17"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. consumers",
      "weight": 0.09221074
    },
    {
      "name": "U.S. duties",
      "weight": 0.08792055
    },
    {
      "name": "common consumer goods",
      "weight": 0.08714199
    },
    {
      "name": "counterfeit goods",
      "weight": 0.0721866
    },
    {
      "name": "consumer protection",
      "weight": 0.07152256
    },
    {
      "name": "overseas goods",
      "weight": 0.0715012
    },
    {
      "name": "U.S.",
      "weight": 0.07146668
    },
    {
      "name": "higher costs",
      "weight": 0.07105678
    },
    {
      "name": "many products",
      "weight": 0.0701437
    },
    {
      "name": "goods",
      "weight": 0.06803013
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.927734375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.91259765625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.564453125
    },
    {
      "name": "/Finance/Accounting & Auditing/Tax Preparation & Planning",
      "score": 0.521484375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.462890625
    }
  ],
  "sentiment": {
    "positive": 0.054044,
    "negative": 0.7206334,
    "neutral": 0.22532254
  },
  "summary": "The end of the de minimis tax loophole means that low-cost shipments to the U.S. are no longer exempt from import duties, a move that could result in higher costs and longer delivery times for consumers ordering goods from abroad. The change was made in response to criticism that the loophole was exploited by criminals and drug traffickers. The White House suspended the de minimalis treatment on July 30, calling it a \"catastrophic loophole\" that allowed for illegal drugs and other unsafe or below-market products to enter the country.",
  "shortSummary": "The end of the de minimis tax loophole will result in higher prices for overseas goods, longer delivery times, and potential safety concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e6894b0402844c2cb89a246f2073685b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/news/de-minimis-us-tariffs-exemption-low-value-imports-ends/?ftag=YHF4eb9d17",
      "text": "\"De minimis\" U.S. tariffs exemption ends for low-value imports\nAn exemption that allowed low-value parcels shipped to the United States to avoid tariffs ended at 12:01 a.m. Friday, Trump administration officials said.\nPresident Trump signed an executive order suspending what's known as the de minimis exemption late last month.\nAt the time, the White House said that would close what it called a \"catastrophic loophole\" that shippers use to \"evade tariffs and funnel deadly synthetic opioids or below-market products\" into the U.S.\nThe exemption applied to parcels valued at $800 or less and let overseas retailers ship inexpensive goods to consumers in the U.S. tax-free.\nMr. Trump \"is putting an end to the proliferation of shippers worldwide that, among other things, deceptively exploit the de minimis privilege in an effort to evade duties, inspection, and U.S. law,\" the White House said in a fact sheet outlining the new policy.\nThe president \"ending of the deadly de minimum loophole will save thousands of American lives by restricting the flow of narcotics and other dangerous prohibited items, and add up to $10 billion a year in tariff revenues to our Treasury,\" White House trade adviser Peter Navarro told reporters Thursday, the Reuters news agency reported.\nBut there will still be a six-month transition period when postal service shippers can choose to pay a flat duty of $80 to $200 per package depending on the country of origin, Reuters said, citing Trump administration officials.\nMr. Trump ended the de minimis loophole for imports from China and Hong Kong in May. It had allowed retailers such as Shein and Temu to ship ultra low-cost apparel and other goods to U.S.-based consumers at bargain-basement prices. Shipments from China and Hong Kong account for most de minimis shipments to the U.S., according to the White House.\nThe exemption's end now applies to all nations.\nThe de minimis provision was added to the Tariff Act of 1930 several years after the law passed. It was intended to facilitate trade by eliminating the administrative burden of collecting modest import duties on low-cost goods.\nThe number of low-value parcels entering the U.S. has surged over the past decade. Between 2015 and 2025, that figure jumped from 134 million shipments per year to nearly 1.4 billion. Customs and Border Patrol was processing more than 4 million de minimis shipments to the U.S. daily, the White House said.\nRetailers such as Shein and Temu were forced to scramble when the loophole for imports from China and Hong Kong was suspended China-based Temu halted shipments of Chinese goods to American customers and shifted to only selling products to U.S. shoppers that could be sourced from the company's U.S. warehouses."
    },
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-president-donald-j-trump-is-protecting-the-united-states-national-security-and-economy-by-suspending-the-de-minimis-exemption-for-commercial-shipments-globally/?ftag=YHF4eb9d17",
      "text": "Fact Sheet: President Donald J. Trump is Protecting the United States’ National Security and Economy by Suspending the De Minimis Exemption for Commercial Shipments Globally\nTAKING DECISIVE ACTION GLOBALLY TO PROTECT AMERICANS: Today, President Donald J. Trump signed an Executive Order suspending duty-free de minimis treatment for low-value shipments, closing the catastrophic loophole used to, among other things, evade tariffs and funnel deadly synthetic opioids as well as other unsafe or below-market products that harm American workers and businesses into the United States.\n- President Trump is taking action to deal with the national emergencies that he has recently declared with respect to unusual and extraordinary threats to the national security, foreign policy, and economy of the United States.\n- Effective August 29, imported goods sent through means other than the international postal network that are valued at or under $800 and that would otherwise qualify for the de minimis exemption will be subject to all applicable duties.\n- For goods shipped through the international postal system, packages will instead be assessed duties according to one of the following methodologies:\n- Ad valorem duty: A duty equal to the effective tariff rate imposed under the International Emergency Economic Powers Act (IEEPA) that is applicable to the country of origin of the product. This duty shall be assessed on the value of each package.\n- Specific duty: A duty ranging from $80 per item to $200 per item, depending on the effective IEEPA tariff rate applicable to the country of origin of the product. The specific duty methodology will be available for six months, after which all applicable shipments must comply with the ad valorem duty methodology.\n- Longstanding exemptions under 19 U.S.C. 1321(a)(2)(A) and (B) remain in place – meaning American travelers can still bring back up to $200 in personal items and individuals can continue to receive bona fide gifts valued at $100 or less duty-free.\nCOMBATTING ESCALATING DECEPTIVE SHIPPING PRACTICES, ILLEGAL MATERIAL, AND DUTY CIRCUMVENTION: President Trump is putting an end to the proliferation of shippers worldwide that, among other things, deceptively exploit the de minimis privilege in an effort to evade duties, inspection, and U.S. law.\n- Packages entering the United States using the duty-free de minimis exemption are typically subject to less scrutiny than traditional imports; however, the packages can pose health, safety, national and economic security risks.\n- Between 2015 and 2024, the volume of de minimis shipments entering the U.S. increased from 134 million shipments to over 1.36 billion shipments. On average, CBP processes over 4 million de minimis shipments into the U.S. each day.\n- The de minimis exemption has been abused, with shippers sending illicit fentanyl and other synthetic opioids, precursors, and paraphernalia into the United States in reliance on the lower security measures applied to de minimis shipments, killing Americans.\n- Enforcement data consistently shows that de minimis shipments account for the majority of all cargo enforcement actions. In FY24, 90% of all cargo seizures originated as de minimis shipments, including:\n- 98% of narcotics seizures (by number of cases).97% of intellectual property rights seizures, totaling 31 million counterfeit items.\n- 77% of health and safety/prohibited items seizures totaling more than 20 million dangerous or illicit items (e.g., weapons parts and Glock switches).\n- The volume of de minimis shipments, even from countries that historically have not been the primary source of de minimis abuse, has skyrocketed this year, with 309 million so far for FY25 (through June 30), compared to 115 million for all of FY24, resulting in significant lost revenue for the United States.\n- CBP is increasingly interdicting de minimis shipments where the certificate of origin is misrepresented in an attempt to circumvent duties.\nBUILDING ON A RECORD OF FIGHTING HARMFUL TRADE LOOPHOLES: President Trump is delivering on his promise to “put an end” to the “big scam” of de minimis shipments killing Americans and hurting U.S. businesses.\n- In February, President Trump declared national emergencies on the United States’ northern and southern borders, including the public health crisis caused by fentanyl and other illicit drugs.\n- In April, President Trump declared a national emergency relating to the conditions underlying the United States’ exploding trade deficit and the implications of that deficit for the United States’ economy and national security.\n- Effective May 2, President Trump suspended de minimis treatment for low-value packages from China and Hong Kong, which account for the majority of de minimis shipments to the United States.\n- The President signed into law the One Big Beautiful Bill Act, which permanently repeals the statutory basis for the de minimis exemption worldwide effective July 1, 2027.\n- President Trump is acting more quickly to suspend the de minimis exemption than the OBBBA requires, to deal with national emergencies and save American lives and businesses NOW."
    },
    {
      "url": "https://www.trade.gov/press-release/what-they-are-saying-americans-praise-president-trumps-decisive-leadership-suspending?ftag=YHF4eb9d17",
      "text": "WHAT THEY ARE SAYING: Americans Praise President Trump’s Decisive Leadership in Suspending the De Minimis Exemption Globally\nWASHINGTON, D.C. – On August 29, 2025, President Donald J. Trump’s executive order suspending duty-free de minimis treatment globally for low-value shipments goes into effect. President Trump is delivering on his promise to close the catastrophic loophole used to evade tariffs and funnel illicit drugs and other dangerous products into the United States.\nThe President’s bold leadership suspending de minimis treatment is being championed by industry leaders, manufacturers, and safety advocates from across the country.\nWhat They Are Saying Across America:\n“De minimis changes, including for postal channels, have been long overdue, and claims that this change is not feasible are incorrect. The top postal operators in the world and many others, are ready for the de minimis change, due in large part to collaboration with CBP, Department of Commerce, USPS, Department of Treasury, and members of Congress, who reached out for our advice and listened. Removing de minimis requires foreign sellers to provide quality data for proper duty calculations and collection, making us safer by ensuring CBP has advanced intelligence to assess risk before shipments arrive on U.S. soil.”\n— Clint Reid, CEO, Zonos\nA CBP-Approved Qualified Party\n…\n“SafePackage is honored to support U.S. Customs and Border Protection (CBP) and the U.S. Postal Service (USPS) in providing cost efficient, effective, and accurate tools to enhance national security. We praise the administration for taking action to protect American consumers, the American economy and the intellectual property rights of American businesses by combating the flow of unsafe and illegal items and by ensuring fair and compliant implementation of tariffs on foreign goods… .We trust the industry will rally around this opportunity to support CBP and USPS by deploying proven and readily available technology solutions to ensure that international mail and eCommerce continue to flourish.”\n— Jack Farley, Founder and CEO, SafePackage\nA CBP-Approved Qualified Party\n…\n“On behalf of the U.S. textile industry, we commend President Trump for using his executive authority to end de minimis for all global commercial shipments, effective August 29… .We are grateful to President Trump for recognizing the severe impact of this loophole and validating that de minimis has caused widespread harm across businesses and communities, in the action he is taking today to repeal de minimis immediately. We thank the president and his administration for listening, acting, and standing with American manufacturers and workers.”\n— Kim Glas, President and CEO, National Council of Textile Organizations (NCTO)\n…\n“Gap Inc. welcomes the Administration’s decision to suspend duty-free de minimis treatment worldwide. The de minimis loophole has long provided an opportunity for some importers & retailers to avoid paying their fair share of U.S. duties. These packages are also typically subject to minimal inspection, raising potential safety concerns for U.S. consumers. Closing this loophole strengthens our nation’s supply chain integrity, improves consumer protection, and levels the playing field for all retailers.”\n— Gap Inc.\n…\n“This is simply a monumental victory for American workers, manufacturers, and national security. President Trump’s move to end abuse of the de minimis loophole is a critical step forward, and today’s executive order effectively finishes the job that the administration set out to do with China back in May. The de minimis loophole was a massive backdoor for untaxed, uninspected imports from all countries—and our members are proud to see the administration go further than just China to end de minimis treatment so that every foreign seller plays by the same rules as American businesses.”\n— Jon Toomey, President, Coalition for a Prosperous America (CPA)\n…\n“The coalition, which includes American manufacturers and retailers, law enforcement, families who have lost loved ones to fentanyl, unions, and other organizations whose members are harmed by the de minimis exemption, applauds the administration for taking action to close this destructive tariff loophole for all commercial shipments… .Today’s action sends a clear and strong message: the days of bad actors exploiting this loophole to flood the U.S. with illicit narcotics and illegal and unsafe products—endangering citizens and undercutting workers—are over. We are grateful this critical step is being taken to put an end to this damaging loophole.”\n— The Coalition to Close the De Minimis Loophole\n…\n“On behalf of my company, Embroidery Solutions Manufacturing LLC and the broader U.S. flag manufacturing community, I want to extend our deepest thanks for your decisive leadership in closing the de minimis free-trade loophole for low-value imports entering our country… .Your recent actions will have a profound and positive impact, not just for our 100 employees here in South Carolina, but for the more than 5,000 men and women across the country whose livelihoods are tied to producing the most sacred symbol of our nation: the American flag. We are deeply grateful for your commitment to American manufacturing and your steadfast support for restoring integrity and fairness to our trade policies.”\n— Larry Severini, President, Embroidery Solutions Manufacturing LLC (ESM)\n…\n“Ferrara Manufacturing strongly supports President Trump’s Executive Order to close the de minimis loophole. This action protects American manufacturers like us who have proudly produced apparel in New York City for nearly 40 years. By leveling the playing field, this policy strengthens domestic manufacturing and ensures a more resilient future for the American apparel & textile industry.”\n— Gabrielle Ferrara, President, Ferrara Manufacturing\n…\n“Greenwood Mills applauds President Trump’s executive order that immediately closes the de minimis loophole. This will protect American manufacturing by taking away a path for foreign companies to steal our jobs. It also protects our towns from the harmful effects of illegal drugs that entered through this loophole as well. Thank you to the President for putting Americans first!”\n— Jay Self, President, Greenwood Mills, Inc.\n…\n“American Fashion Network is deeply grateful for the initiative taken by President Trump, his cabinet and administration to close the de minimis loophole that has plagued our families, retailers and American manufacturers for decades. By leveling the playing field, we will show the strength in our American innovation and power of our industrial base.”\n— Jackie Ferrari, CEO, American Fashion Network LLC\n…\n“Central Textiles Inc. wholeheartedly supports President Trump’s decisive Executive Order closing the de minimis loophole, which will significantly bolster the U.S. textile industry. This bold action by the Trump administration levels the playing field, protecting American jobs and strengthening domestic manufacturing against unfair foreign competition. We are optimistic that this policy will drive growth and resilience for our industry, ensuring a brighter future for U.S. textile producers.”\n— James McKinnon, CEO, Central Textiles, Inc.\n…\n“We are extremely grateful for President Trump’s support of the U.S. textile and apparel manufacturers critical to our National Security, and his decision to close the Section 321 de minimis tariff loophole for all countries. As an exclusive U.S. producer of PPE and complex tactical uniform apparel for our warfighters, this significant step validates the importance of the U.S. textile supply chain and our dedicated workers, providing greatly needed relief of these destructive trade practices we’ve been faced with. Thank you!”\n— Marisa Fumei-South, President and COO, Two One Two New York, Inc.\n…\n“On behalf of Glaser Mills, the largest supplier of domestically manufactured fabric for the American Flag industry, we extend our sincere gratitude for your bold leadership in closing the de minimis free-trade loophole for low-value imports entering the United States… .This meaningful step supports the thousands of hardworking men and women across the U.S. flag manufacturing and distribution industry. It also reaffirms our country’s commitment to preserving the dignity and heritage of the American flag.”\n— Michael Glaser, President, Glaser Mills, Inc.\n…\n“On behalf of the Flag Manufacturers Association of America and the National Independent Flag Dealers Association, we extend our sincere gratitude for your bold leadership in closing the de minimis free-trade loophole for low-value imports entering the United States. This action is a tremendous victory for the American flag industry… .Your decision to address this issue restores fairness to the marketplace and ensures that American-made flags—those sewn, embroidered, and assembled by American workers—can continue to fly proudly across our nation’s homes, schools, government buildings, and military installations.”\n— FMAA President Lauren VandenBosch & NIFDA President David McGehee\n…\nPresident Trump’s leadership in closing the de minimis loophole globally builds on his action of suspending de minimis treatment for China and Hong Kong effective May 2:\n“I want to thank President Trump and the Administration for a critical first step forward to save lives by closing de minimis for Chinese and Hong Kong shipments. The de minimis loophole has become a pipeline for drug dealers to ship fentanyl, pill presses and precursors – substances used to manufacture illegal drugs – directly to the doorsteps of people like my son… .This loophole cost my family everything. We aren’t the only family affected by this dangerous loophole. Today is a critical day forward in this fight.”\n— Leah DeVere, Bowdon, Georgia\nMother of Cory Lee Crews, lost to fentanyl poisoning in 2022\n…\n“I want to express my gratitude to President Trump for his ongoing efforts to combat the fentanyl crisis. His administration’s actions—including targeting countries that enable the shipment of synthetic opioids, enforcing stronger border controls, and recognizing the importance of domestic enforcement—have shown critical leadership we have long awaited in addressing the most urgent drug crisis in American history.”\n— Andrea Thomas, Founder, Voices for Awareness & Project Facing Fentanyl\nMother of Ashley Romero, lost to fentanyl poisoning in 2018\n…\n“We thank President Trump for taking this significant step in countering the illicit flow of fentanyl and synthetic opioids into our country from China through the international mail system. By closing the de minimis loophole for commercial packages from China starting today, he is helping stem the flow of illicit narcotics coming across our borders and will safeguard the lives of our children, families, and friends. We stand with the President in the fight against the scourge of fentanyl in our communities and strongly support his executive action to eliminate de minimis treatment for China.”\n— Mick McHale, President of the National Association of Police Organizations (NAPO)\n…\n“The National Sheriffs’ Association (NSA) applauds the recent executive action to close the de minimis loophole that has allowed countless shipments valued at $800 or less to enter the United States duty-free. For too long, this loophole has been exploited by bad actors, enabling the unchecked flow of fentanyl precursors and other illicit substances into our country through small, low-value packages… .We thank the administration for recognizing the urgency of this issue and for standing with law enforcement in the fight against opioids.”\n— The National Sheriff’s Association\n…\n“As a U.S. manufacturer, I’ve seen firsthand how the de minimis loophole gave Chinese companies an unfair advantage, allowing them to dump low-quality, often counterfeit products into our market with zero oversight and accountability. President Trump’s decisive action to close this loophole for China is a major win for American workers and American businesses that play by the rules. This is about more than economics—it’s about protecting American jobs, families, and consumers from a broken system that’s been exploited for far too long.”\n— Brian Riley, CEO of Guardian Bikes\n…\n“As the owner of Artelo.io, an American print-on-demand wall art business, I strongly support ending de minimis treatment for goods from China. This change levels the playing field, boosts domestic manufacturing, and helps businesses like ours compete fairly. It’s an important step towards strengthening American jobs, innovation, and economic growth.”\n— Ophir Rahimi, Founder of Artelo.io\n…\n“The de minimis loophole has impacted our businesses and our workforce significantly. Roughly half of de minimis shipments contain textile and apparel products which get an unfair competitive advantage at our expense. Illegal products like fentanyl and products made with Uyghur forced labor come into the United States under the de minimis exemption, causing economic damage and impacting the lives of many Americans. I am pleased to see President Trump take action to eliminate de minimis for products from China, and I encourage the administration to end de minimis for imports from all countries so we textile manufacturers can compete on a more level playing field.”\n— Anderson Warlick, Chairman and CEO, Parkdale Mills\n…\n“The de minimis loophole has wreaked havoc on the U.S. textile industry by enabling duty-free access for massive volumes of fast fashion imports, largely from China. This policy undermines American manufacturers who play a critical role in our national security and industrial resilience… the current de minimis threshold has created an unfair advantage for foreign competitors, particularly China, by allowing them to bypass duties and flood the market with underpriced goods — at the direct expense of American jobs. I am encouraged by President Trump’s commitment to ending de minimis eligibility for Chinese imports.”\n— Amy Bircher Bruyn, CEO and Founder, MMI Textiles\n…\n“I am truly thankful to President Trump for closing the de minimis loophole for Chinese imports. This loophole has been devastating to my family’s 44-year-old textile manufacturing business in Gastonia, North Carolina, forcing us to lay off 175 workers and significantly reduce capacity in our plants. We can’t compete against subsidized imports from China that enter the U.S. duty free through the de minimis loophole. With the administration’s action today, our company which provides hundreds of jobs and supports our community and the U.S. economy, will once again have a level playing field that will allow us to expand, invest and hire more associates here in the United States.”\n— Ron Sytz, CEO of Beverly Knits\n…\n“It is a blessing to be put back onto an even playing field with the copy-cat companies who have undercut us on price, along with so many other American companies, for the last four years… . I bet as soon as the Chinese start feeling the effects of the tariffs, they’ll drop out and our sales will go through the roof. We are so thankful that this loophole, which never should have been allowed, has finally been closed.”\n— Ken Finley, CEO of SawHaul\n…\nRead the Executive Order suspending de minimis globally here.\nRead the related White House Fact Sheet here.\n###\nAbout the International Trade Administration\nThe International Trade Administration (ITA) at the U.S. Department of Commerce is the premier government resource for American companies competing in the global marketplace. Operating in more than 100 U.S. locations and 80 markets worldwide, ITA promotes trade and investment, assists U.S. businesses and workers to export and expand globally and ensures fair trade and compliance by enforcing U.S. trade laws and agreements. For more information on ITA, visit www.trade.gov."
    }
  ],
  "argos_summary": "The U.S. has ended the de minimis tax loophole, meaning all online orders valued at $800 or less will now face tariffs, raising consumer costs and potentially slowing delivery times. The move, announced by President Trump, aims to curb illicit drug shipments and level the playing field for domestic retailers, with industry groups praising the action. The policy will generate an estimated $10 billion in annual tariff revenue and includes a six‑month transition period for postal carriers to adjust duty calculations.",
  "argos_id": "268NMUI67"
}