{
  "url": "https://www.businessinsider.com/us-economy-stock-maket-outlook-wall-street-banks-sp500-investing-2025-6",
  "authorsByline": "Christine Ji",
  "articleId": "a7e51c9bdd8d4249bf42c457cacf4031",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/66f2e7bbce3009a0fac8f249?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-06-30T09:45:01+00:00",
  "addDate": "2025-06-30T09:51:41.195687+00:00",
  "refreshDate": "2025-06-30T09:51:41.195689+00:00",
  "score": 1.0,
  "title": "What 5 Wall Street heavyweights expect for markets and the economy in the 2nd half of 2025",
  "description": "After a turbulent first half of the year, here's what top strategists are forecasting for the next six months.",
  "content": "Investors entered 2025 wildly optimistic after two back-to-back years of 20% stock market gains, only to watch the S&P 500 plunge to the edge of a bear market in April and then rally back to record highs last week. After an eventful first half of the year, Wall Street is buckling up for more volatility in the next six monthsWhile recession risks have gone down, there's plenty of turbulence in store. The July 9 tariff deadline looms large, and President Donald Trump's \"Big Beautiful Bill\" is slowly taking shape. Meanwhile, the Trump-Powell feud continues, and geopolitical risks are still on the radar. The second half of the year should offer more clarity on the impact of tariffs on the economy, as the data begins to fully reflect any inflation or consumer spending headwinds.Here's what top strategists across Wall Street are expecting for stocks, inflation, tariffs, and other economic developments in the second half of 2025.After a tough first half, Mike Wilson, the bank's chief investment officer, is anticipating a smoother end to 2025.\"President Trump is like a new CEO coming into a situation with an opportunity for a strategic pivot. In that sense, he appears to have decided to 'kitchen sink' the first half of the year and blame the prior administration for soft economic results in the near term,\" Wilson wrote. \"Following this analogy, the next step would be to shift to new, pro-growth strategies and take credit for the recovery next year when these policies take hold.\"Lower tariff rates have significantly reduced the risk of a recession, and Morgan Stanley believes the market bottomed during the Liberation Day sell-off. One sign of rising optimism in the market is an increased number of upward earnings revisions, the bank said.Markets are expecting two rate cuts in 2025, and Morgan Stanley economists are forecasting seven rate cuts in 2026, which could be a catalyst for higher-than-average valuations. The bank's year-end target for the S&P 500 is 6,500, which would imply a gain of about 5% from current levels. According to Hussein Malik, the bank's head of global research, the economy is set to soften in the second half of the year, but a recession is unlikely as the deepest fears related to the trade war fade.The bank expects rates to be higher for longer as inflation remains sticky, and sees the Fed cutting 100 basis points between December and the spring of 2026 — arriving at a terminal Fed funds rate of 3.5%. While the AI trade remains in full swing and earnings continue to be strong, tariff and geopolitical concerns are persistent headwinds. \"Absent major policy and/or geopolitical surprises (i.e., tariff escalation, oil shock), we believe the path of least resistance to new highs will be supported by Tech/AI-led strong fundamentals, a steady bid from systematic strategies, and flows from active investors on dips,\" Malik wrote.JPMorgan expects the S&P 500 to end the year at 6,000.Multiple tailwinds can carry the stock market to new highs by year-end, according to the bank's chief investment officer Darrell Cronk.Markets shouldn't over-worry about the economic outlook, the bank believes. Inflation is on a path to normalization, and deregulation will help companies, especially small businesses. Cronk is confident that consumers and businesses will be able to adjust to tariff uncertainty. Household incomes are growing, and corporate earnings and balance sheets are strong.Cronk also points out that US energy independence lessens the risk of an inflation surge from oil shocks.The bank believes areas such as aerospace and defense, information technology, and financials will be top stock market performers going forward. As the AI trade progresses, investors should look beyond the US into international markets as well for opportunities. Wells Fargo has a year-end S&P 500 target of 5,900-6,100.Tariffs will likely continue to contribute to market volatility and the Fed's wait-and-see approach to rates, according to Greg Calnon, co-head of public investing.\"We anticipate a couple of rate cuts later this year if hard data weakens in the coming months, though risks are skewed towards fewer and later cuts,\" Calnon wrote.Much of the economy's fate depends on the tax legislation passed by the Trump administration, which could counteract the negative impacts of tariffs. A push to build domestic manufacturing capabilities could also boost economic growth.The bank expects the stock market to continue broadening beyond the Magnificent Seven, with opportunities for European stocks and small caps thanks to deregulation and friendly tax policy.\"A shift in US policy focus from tariffs, immigration controls, and federal government efficiency towards fiscal easing and regulatory relief has the potential to improve investor sentiment in the second half of the year,\" Calnon wrote.\"The economy is likely to muddle through,\" Claudio Irigoyen, head of the bank's Global Economics Research, wrote in his midyear review.The bank is betting on the US economy to remain resilient throughout the rest of the year, as the trade war with China has de-escalated faster than anticipated. Although tariffs still pose a risk, Bank of America believes tariff revenue will help lower the national debt levels and calm the bond market.The bank sees inflation peaking at lower-than-expected levels of 3.1% thanks to companies' frontloading activity earlier this year, although oil prices do pose a risk.Irigoyen is betting on no rate cuts at all this year. With tariff effects taking longer than expected to show up in inflation prints, the Fed isn't in a hurry to cut unless there's a severe economic downturn.He's not phased by Fed independence concerns. \"The more political pressure is exerted on the Fed to lower government borrowing costs, the less likely we are to see a rate cut,\" Irigoyen wrote.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "\"Lower tariff rates",
      "weight": 0.0753622
    },
    {
      "name": "top stock market performers",
      "weight": 0.07310085
    },
    {
      "name": "market volatility",
      "weight": 0.06998946
    },
    {
      "name": "Markets",
      "weight": 0.06825668
    },
    {
      "name": "markets",
      "weight": 0.06825668
    },
    {
      "name": "international markets",
      "weight": 0.06745922
    },
    {
      "name": "rate cuts",
      "weight": 0.066540346
    },
    {
      "name": "tariff revenue",
      "weight": 0.064612396
    },
    {
      "name": "tariffs",
      "weight": 0.064475074
    },
    {
      "name": "tariff effects",
      "weight": 0.06353417
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9892578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.900390625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.7138671875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.69775390625
    }
  ],
  "sentiment": {
    "positive": 0.4909668,
    "negative": 0.2442627,
    "neutral": 0.26489258
  },
  "summary": "Wall Street heavyweights are predicting a significant increase in volatility for the second half of 2025, following two years of 20% stock market gains. The S&P 500 fell into a bear market in April and then rallied back to record highs last week. While recession risks have decreased, there is still a significant amount of uncertainty ahead. The second half should provide more clarity on the impact of tariffs on the economy, as data begins to fully reflect inflation or consumer spending headwinds. Morgan Stanley predicts two rate cuts in 2025 and seven in 2026, which could trigger higher-than-average valuations. JPMorgan expects the S&T 500 to end the year at 6,000. While the AI trade continues strong, tariff and geopolitical concerns remain persistent. Wells Fargo expects the stock market to continue broadening beyond the Magnificent Seven, with European stocks and European stocks expected to be big opportunities.",
  "shortSummary": "Wall Street analysts predict mixed signals for the second half of 2025, with rising inflation, tariffs, and potential rate cuts offsetting potential market volatility amid ongoing geopolitical risks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1a684c9cd7344e64954bce6597367021",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Investors entered 2025 with high optimism after two years of 20% equity gains, but the S&P 500 fell to bear‑market territory in April before rallying to record highs. Market analysts now expect increased volatility in the second half of the year, driven by the July 9 tariff deadline, the Trump administration’s policy shift, and ongoing geopolitical risks. While recession fears have eased, Fed policy remains a key uncertainty, with most banks forecasting two rate cuts in 2025 and a terminal rate of 3.5% in 2026. AI and technology earnings continue to support equity upside, but tariff and geopolitical headwinds could temper growth, especially if tariff escalation or oil shocks materialize.",
  "argos_id": "2CYFNIGYB"
}