{
  "url": "https://finance.yahoo.com/news/check-washing-costs-americans-over-210000527.html",
  "authorsByline": "Jessica Wong",
  "articleId": "3ff0b277df3941b08404daf739794b54",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/moneywise_327/104d4a636bd35a04bddfcef9fb5f5a21",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T21:00:00+00:00",
  "addDate": "2025-08-30T21:10:14.795369+00:00",
  "refreshDate": "2025-08-30T21:10:14.795373+00:00",
  "score": 1.0,
  "title": "‘Check washing’ costs Americans over $1 billion each year, says USPIS — how to spot it and protect your money",
  "description": "Thieves swipe checks from mailboxes, alter them and take off with the money.",
  "content": "Despite seeming retro, check fraud is experiencing a surprising resurgence, with criminals stealing billions of dollars through these schemes. According to the U.S. Postal Inspection Service (USPIS), \"check washing\" fraud is inflicting substantial financial damage on Americans. Postal inspectors report intercepting more than $1 billion in fraudulent checks and money orders annually. Despite the rise of digital financial transactions, thieves are increasingly targeting mail containing paper checks as a vulnerable point in the system. Using common household supplies, scammers can modify stolen checks by removing the original information and substituting false details before depositing them under assumed identities. Below, we explain their tactics and how to protect yourself.\n• Thanks to Jeff Bezos, you can now become a landlord for as little as $100 — and no, you don't have to deal with tenants or fix freezers. Here's how\n• I'm 49 years old and have nothing saved for retirement — what should I do? Don't panic. Here are 6 of the easiest ways you can catch up (and fast)\n• Dave Ramsey warns nearly 50% of Americans are making 1 big Social Security mistake — here’s what it is and 3 simple steps to fix it ASAP Check washing is a theft method where criminals steal checks, commonly from mailboxes, and use household chemicals such as nail polish remover or rubbing alcohol to erase the ink. After removing the original information, the thief changes the payee name and amount, cashes the altered check and escapes with the stolen funds. This scheme, which has been around for decades, has seen a significant increase in incidents since 2021, with check fraud cases nearly doubling according to the FBI's Internet Crime Complaint Center. Postal inspectors warn that this troubling trend is expected to worsen throughout 2025. Criminal organizations have been identified selling stolen checks on digital platforms and recruiting individuals known as \"money mules\" to deposit falsified checks into fraudulent accounts, according to NASDAQ Verafin. In a contemporary evolution of this long-established fraud scheme, these stolen checks are now being traded on dark web marketplaces in exchange for cryptocurrency. Real-world cases show just how quickly it can happen, and victims are losing thousands. According to ABC7 NY, when Carol Perlman mailed a $656 check, criminals altered it to $9,000. Though her bank eventually refunded the money, they only did so after local media covered her story.\n\nIn the same ABC7 NY report, Matt Schick became a victim after depositing a contractor's payment in a street mailbox. Within days, someone had intercepted and cashed it for $7,500. Fortune magazine reported on entrepreneur Steve, who was stunned to discover that his $310,000 IRS payment never arrived. Thieves had chemically \"washed\" the check, replacing \"IRS\" with another name before depositing it. He was forced to pay his taxes again, including penalties and interest, while still fighting with his bank to recover the stolen funds. These real-life examples demonstrate the devastating impact of check washing and the challenges victims face in recovering their money. While some people get their funds back quickly, many others endure months of waiting and uncertainty. How can you protect yourself from becoming the next victim of this increasingly common scam? Read more: Rich, young Americans are ditching stocks — here are the alternative assets they're banking on instead How to protect yourself from check washing Although digital payments are popular, checks remain necessary in certain situations. If you still use checks, consider these protective measures to prevent check washing: Avoid outdoor mailboxes: When sending important documents, such as checks, it's advisable to use a post office for mailing rather than a standard mailbox. Check your mail regularly: To avoid mail accumulation and safeguard your deliveries during absences, consider utilizing the USPS hold-mail service when you'll be away from home for extended periods. Write smarter: When completing important documents, it's recommended to utilize gel or rollerball pens with permanent blue or black ink, as this makes alteration more difficult. Ensure you complete each field thoroughly, leaving no blank spaces. Cover it up: To protect your financial information from potential mail theft, use security envelopes when sending checks. These specially designed envelopes feature patterns that prevent contents from being visible through the paper. Go digital: Utilize digital payment options like bank bill-pay systems or mobile apps instead of sending paper checks through mail. Keep an eye on accounts: Check your accounts regularly and set up transaction alerts to catch fraud early. Act fast: Contact your bank, local police and the USPIS immediately if you’re a victim. Check washing might seem like an outdated scam, but this fraud scheme continues to drain billions of dollars from unsuspecting victims, even in our digital era. This sophisticated con can catch even the most careful consumers by surprise. By remaining alert and opting for more secure payment alternatives when available, you can protect yourself from significant financial losses and avoid becoming another statistic. What to read next\n• Robert Kiyosaki warns of a 'Greater Depression' coming to the US — with millions of Americans going poor. But he says these 2 'easy-money' assets will bring in ‘great wealth’. How to get in now\n• Want an extra $1,300,000 when you retire? Dave Ramsey says this 7-step plan ‘works every single time’ to kill debt, get rich in America — and that ‘anyone’ can do it\n• Commercial real estate has beaten the stock market for 25 years — but only the super-rich could buy in. Here's how even ordinary investors can become the landlord of Walmart, Whole Foods or Kroger\n• The biggest myth in real estate investing? That you need big money. Here are 5 ways to grow your wealth — starting with just $10 Stay in the know. Join 200,000+ readers and get the best of Moneywise sent straight to your inbox every week for free. Subscribe now. This article provides information only and should not be construed as advice. It is provided without warranty of any kind.",
  "medium": "Article",
  "links": [
    "https://moneywise.com/managing-money/dave-ramsey-baby-steps?throw=WTRN2_yahoo&placement_syn=placement_3&utm_source=syn_oath_mon&utm_medium=BL&utm_campaign=121478&utm_content=syn_922cf1e6-ffc3-4542-b213-834d186581a5",
    "https://fortune.com/article/check-fraud-jpmorgan-chase-wells-fargo-check-washing-internal-revenue-service-wells-fargo/",
    "https://moneywise.com/managing-money/retirement-planning/dave-ramsey-warns-nearly-50-of-americans-are-making-1?throw=DM3_yahoo&placement_syn=placement_1&utm_source=syn_oath_mon&utm_medium=WL&utm_campaign=121478&utm_content=syn_1b61204f-b87d-4dfd-a67a-242f8febb744",
    "https://moneywise.com/investing/robert-kiyosaki-warns-of-greater-depression-coming-to-us?throw=WTRN1_yahoo&placement_syn=placement_3&utm_source=syn_oath_mon&utm_medium=BL&utm_campaign=121478&utm_content=syn_aa19f6fc-566c-4c01-891f-4ca9db3c55ad",
    "https://moneywise.com/retirement/retirement/hybrid-nothing-saved-for-retirement-catch-up?throw=DM2_yahoo&placement_syn=placement_1&utm_source=syn_oath_mon&utm_medium=WL&utm_campaign=121478&utm_content=syn_b0d97390-6a69-478b-9bae-9b4f9fd48538",
    "https://moneywise.com/investing/real-estate/ways-to-invest-in-real-estate?throw=WTRN4_yahoo&placement_syn=placement_3&utm_source=syn_oath_mon&utm_medium=BL&utm_campaign=121478&utm_content=syn_c67f26a1-675c-4bbe-bbcd-21a69bbee172",
    "https://moneywise.com/investing/alternative-investments/rich-young-americans?throw=HALF_yahoo&placement_syn=placement_2&utm_source=syn_oath_mon&utm_medium=BL&utm_campaign=121478&utm_content=syn_1a3f449a-f0ee-4afc-9e48-9b3e1cf5f4f5",
    "https://moneywise.com/investing/real-estate/invest-vacation-rental-homes?throw=DM1_yahoo&placement_syn=placement_1&utm_source=syn_oath_mon&utm_medium=WL&utm_campaign=121478&utm_content=syn_4f4ac575-14fa-4e48-a985-2bd10d1ccda0",
    "https://moneywise.com/investing/alternative-investments/hedge-your-portfolio-with-commercial-real-estate?throw=WTRN3_yahoo&placement_syn=placement_3&utm_source=syn_oath_mon&utm_medium=BL&utm_campaign=121478&utm_content=syn_938ff6ea-a0f8-4fee-9b7b-38e7db420487",
    "https://www.ic3.gov/PSA/2025/PSA250127",
    "https://www.youtube.com/watch?v=_XkdpIEvLXs",
    "https://moneywise.com/subscription?throw=WTRN5_yahoo&placement_syn=placement_3&utm_source=syn_oath_mon&utm_medium=WL&utm_campaign=121478&utm_content=syn_9dddffa7-0370-44b1-b0d6-1e12fedad12d",
    "https://verafin.com/2023/03/criminals-cash-in-on-stolen-checks/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "stolen checks",
      "weight": 0.09630584
    },
    {
      "name": "check fraud",
      "weight": 0.09533328
    },
    {
      "name": "Check washing",
      "weight": 0.094763294
    },
    {
      "name": "check washing",
      "weight": 0.094763294
    },
    {
      "name": "check fraud cases",
      "weight": 0.09160916
    },
    {
      "name": "paper checks",
      "weight": 0.08927183
    },
    {
      "name": "checks",
      "weight": 0.08868451
    },
    {
      "name": "fraudulent checks",
      "weight": 0.08865135
    },
    {
      "name": "falsified checks",
      "weight": 0.086422525
    },
    {
      "name": "digital payments",
      "weight": 0.058888506
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.81982421875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.78466796875
    },
    {
      "name": "/Shopping/Consumer Resources/Identity Theft Protection",
      "score": 0.5771484375
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.345458984375
    }
  ],
  "sentiment": {
    "positive": 0.04444104,
    "negative": 0.6999433,
    "neutral": 0.25561568
  },
  "summary": "The U.S. Postal Inspection Service (USPIS) has reported that check fraud, which costs Americans over $1 billion each year, is experiencing a resurgence. The theft method involves removing the original information from the stolen checks and substituting false details before depositing them under assumed identities. These fraudulent checks are now being traded on dark web marketplaces for cryptocurrency. The FBI's Internet Crime Complaint Center has reported a significant increase in incidents since 2021, with check fraud cases nearly doubling. USPIS warns that this trend is expected to worsen throughout 2025. While digital payments are increasingly popular, checks are still necessary in certain situations.",
  "shortSummary": "Despite the rise of digital banking, \"check washing\" fraud is rapidly increasing, costing Americans over $1 billion annually, highlighting the dangers of improper check-ins and identity swaps.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8ebd6821aa3c46ba9495f0a86a0a409c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://fortune.com/article/check-fraud-jpmorgan-chase-wells-fargo-check-washing-internal-revenue-service-wells-fargo/",
      "text": "Fraud can happen to anyone, even wealthy entrepreneurs. Steve, who asked his last name not be used so he could tell this story, was shocked to discover that someone had stolen one of his checks that was supposed to go to the IRS. Months later, Steve, whose firm helps lawyers serve legal documents, was still on the hook for a $310,000 federal tax payment.\nIn early January 2024, Steve’s wife wrote a check, from their personal Wells Fargo bank account, and addressed it to the IRS for $310,000. This check was Steve’s estimated payment for his first-quarter federal taxes that year. She took the check to a secure mailbox inside a Seattle area post office and the check cleared on Jan. 31, according to a Wells Fargo bank statement.\nIt wasn’t until the following November, when his accountant contacted him, that Steve realized the IRS never got the check. Then, on Dec. 18, the IRS asked Steve to provide a front and back copy of the $310,000 check. After his wife retrieved a copy from a local Wells Fargo branch, Steve discovered that someone had stolen the $310,000 check, chemically washed it, and replaced “IRS” on the payee line with a random name “Ezavier Josiah Staples.”\nStaples—or whoever pulled off the scam—had signed the back of the check and deposited it into a JPMorgan Chase checking account.\nWhen asked why he didn’t realize any sooner that someone had stolen the check, Steve said he makes “more than a hundred” payments each quarter because he operates multiple businesses across different states, which is why he didn’t notice that the IRS hadn’t received the check. He could go through each payment but that “would be exhausting,” Steve said.\nA very prevalent fraud\nCheck fraud is big business. In 2023, nearly 80%, or $21.1 billion, of global check fraud occurred in the Americas, according to the Nasdaq’s Global Financial Crime Report. Fraud prevention was one reason that prompted President Donald Trump to sign an executive order in March directing the federal government to stop using paper checks and switch to secure electronic payments as of Sept. 30.\nChristopher Caffarone, a partner at law firm Pillsbury Winthrop Shaw Pittman’s corporate investigations and white collar defense practice, said schemes like check washing are very prevalent. “Members of the public should be vigilant about reviewing financial accounts. If they see anything suspicious, they should report it to the financial institution and to the police,” Caffarone said.\nThis is exactly what Steve did. On Dec. 18, the day he learned of the check fraud, Steve filed a claim with Wells Fargo. One week later, Steve received a form letter from the bank denying the claim, because too much time had elapsed. Then he reported the fraud to the Seattle police, who told Steve that he had a year to report the fraud, which started the moment he realized a crime had been committed. “I’m just shocked that [banks] don’t have insurance for this kind of thing, or with all the fraud stuff they’re doing, that they don’t care about protecting the consumer,” he said.\nU.S. Banks are governed by the Uniform Commercial Code. Under the UCC, victims of check fraud have one year to file a claim, but banks can shorten this time to much less. Banks like Wells Fargo typically give consumers 30 to 60 days to notify them of check fraud, which will start the process of recovering funds.\nSteve also reported the case to the Office of Comptroller of the Currency, which regulates and supervises national banks; the Consumer Financial Protection Bureau, a government agency dedicated to protecting the consumer in the financial marketplace; and with the Internet Crime Complaint Center, a division of the FBI. He hasn’t heard anything from the OCC or the IC3. The CFPB told Steve there was nothing they could do because Wells did nothing wrong.\nThe entrepreneur isn’t backing down. “It’s just a principle of the thing for me. I just can’t believe that in this day and age, someone could steal $310,000 and both Chase and Wells Fargo just say, ‘Tough luck.’ They have no checks and balances, or nothing in place to protect us,” Steve said.\nHe has started legal action against Wells Fargo, but there is still no resolution. The bank, in a Feb. 11 letter, said it had sent a request to Chase to retrieve the $310,000. A Chase spokesman told Fortune that the bank did receive a claim from Wells Fargo and are looking into the matter.\nSteve said the case may go to arbitration, where he might lose and then he could be responsible for much more, including Wells Fargo attorney fees.\nHow to avoid\nWells Fargo and Chase each provided tips to help deter check fraud. Both banks encourage consumers to use check alternatives, including online or digital payments, when possible. Chase advises its customers to use permanent ink and, when writing the payee’s name, to fill up the whole line. Wells Fargo recommends that consumers set up account alerts, and promptly review their statements, including the front and back images of cashed checks. “We never want to see anyone fall victim to fraud or scams,” a Wells Fargo spokeswoman said.\nSteve is not to blame for what happened, said Pillsbury’s Caffarone. “Blame falls squarely on the individual who stole the check and used it for their own personal gain,” Caffarone said.\nFor now, Steve is out an additional $310,000, which he paid to the IRS—along with interest and a penalty. But he and his wife have learned an important lesson. “Don’t use checks for anything, unless you’re just paying your babysitter or your dog walker or someone you really know and you’re handing it to them. And don’t put checks in the mail,” Steve said."
    },
    {
      "url": "https://www.ic3.gov/PSA/2025/PSA250127",
      "text": "The FBI and USPIS are warning that check fraud is on the rise, with a significant volume enabled through mail theft. Suspicious Activity Reports related to check fraud have nearly doubled from 2021 to 2023.1 Fraudsters take advantage of regulations requiring financial institutions to make check funds available within specified timeframes, which is often too short a window for the consumer or financial institutions to identify and stop the fraud. As a result, the compromised checks clear, and the funds are withdrawn by the criminal participants before the fraud is detected.\nObtaining the Checks\nFraudsters gain access to legitimate checks and sensitive financial data by stealing mailed checks from USPS facilities or during delivery to the intended recipient. Check theft occurs several ways.\nPreparing/Altering the Checks for Deposit\nTo make the checks appear legitimate, fraudsters use check washing or other check \"cooking\" techniques to alter checks or create counterfeits. In other instances, checks are unaltered and deposited with forged endorsements.\nCheck washing involves the use of chemicals to physically alter the check, typically altering the original payee and financial amount.\nCheck cooking involves the digital manipulation of an image of a stolen check. Using readily available photo editing software and high-tech printers, fraudsters can manufacture checks. Check cooking allows fraudsters to manufacture multiple checks from a single check image. Often these checks are written for smaller amounts which can go undetected for longer periods of time by escaping the scrutiny or visibility of a larger check amount.\nDepositing the Checks\nStolen checks are deposited, often by a collusive account holder who is recruited by the fraudster or sold online for a fraction of the face value to other criminal actors who deposit the checks. In many cases, financial institutions, consumers, and law enforcement agencies are not aware of the fraudulent activity until after funds have been illicitly withdrawn.\nWho is Harmed by Check Fraud?\n- Businesses\n- Businesses could experience disruption to business activities and reputational harm due to overdue or missed payments or delays or disruption in finalizing payments when account details are compromised.\n- Consumers\n- Consumers can experience impacted credit scores for late payments for bills, account closures, stop payment fees for other outstanding checks, missed interest from refund checks, compromised personally identifiable information (PII) which may also be sold in subsequent fraud schemes, and loss of assets or investment money. Victims of fraud are often refunded some of the charges, but refunds are often delayed until investigations are complete.\n- Government Entities\n- Funds intended for citizens are intercepted and altered or forged, resulting in government funds being dispersed incorrectly. It can be a time intensive process to investigate and reissue payments to the rightful recipients of intercepted checks.\nHow to Protect Your Mail\n- Pick up your mail promptly after delivery. Do not leave mail in your mailbox overnight or for long periods of time.\n- If you are heading out of town, submit a USPS Hold Mail™ request asking your local Post Office to hold your mail until you return.\n- Sign up for Informed Delivery® at USPS.com to receive daily email notifications of incoming mail and packages.\n- Contact the sender if you do not receive a check, credit card or other valuable mail you are expecting.\n- Consider buying and using security envelopes to conceal the contents of your mail.\n- Use the letter slots inside your local Post Office to send mail. If using a blue USPS collection box, be sure to drop your mail as close to the posted pickup time as possible and before the last collection of the day.\nHow to Protect Your Checks\n- Use pens with indelible black ink so it is more difficult for a criminal to wash your checks.\n- Don't leave blank spaces in the payee or amount lines.\n- Don't write personal details, such as your Social Security number, credit card information, driver's license number, or phone number on checks.\n- Use mobile or online banking to access copies of your checks and ensure they are not altered. While logged in, review your bank activity and statements for errors.\n- Consider using e-check, ACH automatic payments, and other electronic and/or mobile payments.\n- Follow up with payees to make sure they received your check.\n- Use check positive pay if available at financial institutions to help detect and stop fraudulent checks.\n- Use checks with security features to limit the effectiveness of check washing. Security features can include microprinting, holograms, heat-sensitive ink, watermarks, toner adhesion, chemically reactive paper, security screens, thermal thumbprints, void pantographs, ultraviolet overprinting, security padlock icon, and fraud warnings.\n- If you believe you have been defrauded, contact your bank immediately. Consider opening a new account and closing out the compromised account to prevent future counterfeit checks being drawn off the account.\n- Protect vulnerable members of your family and community. Fraudsters use high-tech, low-cost technology including printers, call spoofing technology, and AI-assisted voice recreation to fool vulnerable people into acting as unwitting accomplices.\nIf you think you were targeted by fraud, file a report with your bank and request copies of all fraudulent checks. Report the incident to the FBI Internet Crime Complaint Center (IC3), www.ic3.gov. If you believe you are the victim of mail theft-related check fraud, report to your local police and the United States Postal Inspection Service at uspis.gov/report or 1-877-876-2455."
    }
  ],
  "argos_summary": "Check fraud, particularly check washing, has surged, with the U.S. Postal Inspection Service reporting over $1 billion in fraudulent checks annually and cases nearly doubling since 2021. Criminals steal paper checks from mailboxes, chemically erase the original details, alter payee and amount, and cash them, often trading stolen checks on dark‑web marketplaces for cryptocurrency. High‑profile victims include individuals who lost thousands to altered checks and a business owner who lost $310,000 on a stolen IRS payment. The FBI and USPIS warn that the trend will worsen in 2025, urging consumers to use secure digital payments, secure envelopes, permanent ink, and to monitor accounts closely to mitigate losses.",
  "argos_id": "6ILI55V3O"
}