{
  "url": "https://www.latimes.com/world-nation/story/2025-08-30/3-dead-after-mob-sets-fire-to-indonesian-regional-parliament-building",
  "authorsByline": "Niniek Karmini and Andi Jatmiko",
  "articleId": "ba3fe5a001d145bab9b9719f7c0736dc",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/915628e/2147483647/strip/true/crop/5000x2625+0+350/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F06%2F23%2F24dd70424726b5b6229667915e7a%2F6a86352cb5b246c0b40b7ff154ed64e2.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T18:00:36.934000+00:00",
  "addDate": "2025-08-30T18:04:05.579667+00:00",
  "refreshDate": "2025-08-30T18:04:05.579669+00:00",
  "score": 1.0,
  "title": "In Indonesia, protesters set fire to regional parliament building, leaving 3 dead",
  "description": "Protesters, angered at a report of lawmakers' inflated pay and a bystander's death during a previous rally, set fire to a local parliament building in Makassar, Indonesia, leaving at least three dead and five hospitalized.",
  "content": "Antigovernment protesters set fire to a local parliament building in an Indonesian provincial capital, leaving at least three people dead and five others hospitalized, officials said.\n\nThe parliament building fire in Makassar, the capital of South Sulawesi province, began late Friday. Television reports showed the provincial council building ablaze overnight, casting an orange glow over the city.\n\nRescuers retrieved three bodies by Saturday morning, while five people were hospitalized with burns or broken bones after jumping from the building, said Fadli Tahar, a local disaster official.\n\nDaily protests this week over a report on lawmakers’ compensation, which many deem excessive, have intensified since the death of a bystander, apparently at the hands of security forces, at a rally in the capital Thursday.\n\nProtesters in West Java’s Bandung city also set a regional parliament ablaze Friday, but no casualties were reported. In Surabaya, Indonesia’s second-largest city, protesters stormed the regional police headquarters after destroying fences and torching vehicles. Security forces fired tear gas and used water cannons, and demonstrators fought back with fireworks and wooden clubs.\n\nForeign embassies in Jakarta, including the U.S., Australia and Southeast Asian countries, have advised their citizens in Indonesia to avoid protest areas or large public gatherings.\n\nCalm largely returned to Indonesia’s capital Saturday as authorities cleaned up burned-out cars, police offices and bus shelters that were set ablaze by angry protesters.\n\nFive days of protests began in Jakarta, the capital, on Monday, sparked by reports that all 580 lawmakers receive a monthly housing allowance of $3,075 in addition to their salaries. The allowance, introduced last year, is almost 10 times the Jakarta minimum wage.\n\nCritics argue the new allowance is excessive, especially at a time when most people are grappling with soaring living costs and taxes and rising unemployment.\n\nThe protests over lawmakers’ pay grew wider and more violent after the death of 21-year-old ride-hailing driver Affan Kurniawan. A video on social media that appeared to show his death during a rally in Jakarta on Thursday shocked the nation and spurred an outcry against the security forces.\n\nKurniawan was reportedly completing a food delivery order when he was caught in the clash. Witnesses told local television that the armored car from the National Police’s Mobile Brigade unit suddenly sped through the crowd of demonstrators and hit Kurniawan, causing him to fall. Instead of stopping, the car ran over him.\n\nOn Saturday, hundreds of ride-hailing drivers and students in Bali staged a solidarity demonstration over Kurniawan’s death in a rare protest on the tourist island. They called for police reform and the release of those arrested during the protests.\n\nProtesters marched to Bali’s regional police headquarters, and riot police fired rounds of tear gas at them to push back those who tried to reach the heavily guarded compound. Protesters responded by throwing rocks, bottles and flares.\n\nClashes between riot police and protesters erupted in cities across Indonesia on Friday, including Medan, Solo, Yogyakarta, Magelang, Malang, Bengkulu, Pekanbaru and Manokwari in easternmost Papua region.\n\nSome 950 people were arrested in rallies in Jakarta alone by Thursday, according to the National Commission on Human Rights, or Komnas HAM.\n\nAuthorities said about 25 officers were hospitalized with serious injuries after being attacked by protesters in Jakarta. The Komnas HAM said that the number of injured people on the community side is much bigger.\n\nAmnesty International criticized the Indonesian government Saturday, saying it suppresses free speech with crackdowns on public protests.\n\n“No one should lose their lives for exercising their right to protest,” said Usman Hamid, the executive director of Amnesty International Indonesia. “The authorities must immediately and unconditionally release anyone detained solely for exercising their rights.”\n\nKarmini and Jatmiko write for the Associated Press. AP journalists Dita Alangkara and Achmad Ibrahim contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-29/trump-administration-plans-to-remove-nearly-700-unaccompanied-migrant-children-senator-says",
    "https://www.latimes.com/world-nation/story/2025-08-30/federal-appeals-court-to-decide-whether-texas-can-give-police-broad-powers-to-arrest-migrants",
    "https://www.latimes.com/world-nation/story/2025-08-28/immigration-deportation-los-angeles-mexico"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "regional parliament building",
      "weight": 0.070164
    },
    {
      "name": "public protests",
      "weight": 0.06484541
    },
    {
      "name": "protest areas",
      "weight": 0.06100858
    },
    {
      "name": "angry protesters",
      "weight": 0.060828604
    },
    {
      "name": "Daily protests",
      "weight": 0.058950175
    },
    {
      "name": "Protesters",
      "weight": 0.058876283
    },
    {
      "name": "protesters",
      "weight": 0.058876283
    },
    {
      "name": "protests",
      "weight": 0.0588461
    },
    {
      "name": "Antigovernment protesters",
      "weight": 0.05863856
    },
    {
      "name": "riot police",
      "weight": 0.05850546
    }
  ],
  "topics": [
    {
      "name": "Protests"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9453125
    },
    {
      "name": "/News/Other",
      "score": 0.9375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.845703125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.78515625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.61474609375
    },
    {
      "name": "/News/Local News",
      "score": 0.60791015625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.572265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.53857421875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.370849609375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.316162109375
    }
  ],
  "sentiment": {
    "positive": 0.05061906,
    "negative": 0.800367,
    "neutral": 0.14901398
  },
  "summary": "Antigovernment protesters in Makassar, Indonesia, have set fire to a local parliament building in an Indonesian provincial capital, leaving at least three dead and five others hospitalized. The parliament building was set alight, with rescue workers recovering three bodies and five people suffering from burns or broken bones after jumping from the building. Protests were sparked by a report on lawmakers’ compensation, which many deem excessive. The death of 21-year-old ride-hailing driver, Affan Kurniawan, sparked the violent protests. Foreign embassies in Jakarta have advised their citizens to avoid protest areas or large public gatherings. Some 950 people were arrested in rallies in Jakarta alone, according to the National Commission on Human Rights.",
  "shortSummary": "Antigovernment protesters in Indonesia killed three people and injured five others after setting fire to a regional parliament over lawmakers’ compensation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e3f4bcb207e1408890227f8758b1b3d8",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-30/federal-appeals-court-to-decide-whether-texas-can-give-police-broad-powers-to-arrest-migrants",
      "text": "Federal appeals court annuls block on Texas law giving police broad powers to arrest migrants\n- Share via\nNEW ORLEANS — A federal appeals court has vacated a ruling that a Texas law giving police broad powers to arrest migrants suspected of illegally entering the U.S. was unconstitutional.\nThe 5th Circuit Court of Appeals on Friday vacated a ruling by a three-judge panel, and now the full court will consider whether the law can take effect.\nThe Texas Legislature passed Senate Bill 4 in 2023, but a federal judge in Texas ruled the law unconstitutional. Texas appealed that ruling.\nUnder the proposed law, state law enforcement officers could arrest people suspected of entering the country illegally. Once in custody, detainees could agree to a Texas judge’s order to leave the country or face a misdemeanor charge of entering the U.S. illegally. Migrants who don’t leave after being ordered to do so could be arrested again and charged with a more serious felony.\nTexas Gov. Greg Abbott said in a social media post Friday that the court’s decision was a “hopeful sign.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-29/trump-administration-plans-to-remove-nearly-700-unaccompanied-migrant-children-senator-says",
      "text": "Trump administration plans to remove nearly 700 unaccompanied migrant children, senator says\n- Share via\n- Sen. Ron Wyden (D-Ore.) called on the government to halt the deportation plans.\n- The removals would violate the Office of Refugee Resettlement’s long-established practice of protecting such children, Wyden said.\nWASHINGTON — The Trump administration is planning to remove nearly 700 Guatemalan children who had come to the U.S. without their parents, according to a letter sent Friday by Sen. Ron Wyden of Oregon, and the Central American country said it was ready to take them in.\nThe removals would violate the Office of Refugee Resettlement’s “child welfare mandate and this country’s long-established obligation to these children,” Wyden told Angie Salazar, acting director of the office within the Department of Health and Human Services that is responsible for migrant children who arrive in the U.S. alone.\n“This move threatens to separate children from their families, lawyers, and support systems, to thrust them back into the very conditions they are seeking refuge from, and to disappear vulnerable children beyond the reach of American law and oversight,” the Democratic senator wrote, asking for the deportation plans to be terminated.\nUndocumented parents are preparing for the worst in response to the L.A. immigration raids. Bracing for potential deportation, they’re making emergency care plans for their kids.\nIt is another step in the Trump administration’s sweeping immigration enforcement efforts, which include plans to surge officers to Chicago for an immigration crackdown, ramping up deportations and ending protections for people who have had permission to live and work in the United States.\nGuatemalan Foreign Affairs Minister Carlos Martínez said Friday that the government has told the U.S. it is willing to receive hundreds of Guatemalan minors who arrived unaccompanied to the United States and are being held in U.S. facilities.\nGuatemala is particularly concerned about minors who could age out of the facilities for children and be sent to adult detention centers, he said. The exact number of children to be returned remains in flux, but they are currently discussing a little over 600. He said no date has been set yet for their return.\nThat would be almost double what Guatemala previously agreed to. The head of the country’s immigration service said last month that the government was looking to repatriate 341 unaccompanied minors who were being held in U.S. facilities.\nA federal appeals court has blocked the Trump administration’s plans to end protections for 600,000 people from Venezuela who have had permission to live and work in the United States.\n“The idea is to bring them back before they reach 18 years old so that they are not taken to an adult detention center,” Guatemala Immigration Institute Director Danilo Rivera said at the time. He said it would be done at Guatemala’s expense and would be a form of voluntary return.\nThe plan was announced by President Bernardo Arévalo, who said then that the government had a moral and legal obligation to advocate for the children. His comments came days after U.S. Homeland Security Secretary Kristi Noem visited Guatemala.\nThe White House and the Department of Health and Human Services did not immediately respond to requests for comment on the latest move, which was first reported by CNN.\nQuoting unidentified whistleblowers, Wyden’s letter said children who do not have a parent or legal guardian as a sponsor or who don’t have an asylum case already underway “will be forcibly removed from the country.”\nThe idea of repatriating such a large number of children to their home country also raised concerns with activists who work with children navigating the immigration process.\n“We are outraged by the Trump administration’s renewed assault on the rights of immigrant children,” said Lindsay Toczylowski, president and CEO of Immigrant Defenders Law Center. “We are not fooled by their attempt to mask these efforts as mere ‘repatriations.’ This is yet another calculated attempt to sever what little due process remains in the immigration system.”\nSantana, Seitz and Gonzalez write for the Associated Press. Gonzalez reported from McAllen, Texas. AP writers Sonia Pérez D. in Guatemala City and Tim Sullivan in Minneapolis contributed to this report."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-28/immigration-deportation-los-angeles-mexico",
      "text": "- Share via\n- Jesús Cruz came to Los Angeles 33 years ago. He was sent back to Mexico and his wife faced an impossible decision. Should she and their children join him in Mexico? Or stay in Inglewood?\n- ‘I want them to have a better life,’ Cruz says of his U.S.-born children. ‘Not the one I had.’\nKINI, Mexico — On a hot June night Jesús Cruz at last returned to Kini, the small town in Mexico’s Yucatán Peninsula where he spent the first 17 years of his life.\nHis sister greeted him with tearful hugs. The next morning she took him to see their infirm mother, who whispered in his ear: “I didn’t think you’d ever come back.”\nAfter decades away, Cruz was finally home.\nYet he was not home.\nSo much of what he loved was 3,000 miles away in Southern California, where he resided for 33 years until immigration agents swarmed the car wash where he worked and hauled him away in handcuffs.\nCruz missed his friends and Booka, his little white dog. His missed his house, his car, his job.\nBut most of all, he missed his wife, Noemi Ciau, and their four children. Ciau worked nights, so Cruz was in charge of getting the kids fed, clothed and to and from school and music lessons, a chaotic routine that he relished because he knew he was helping them get ahead.\n“I want them to have a better life,” he said. “Not the one I had.”\nNow that he was back in Mexico, living alone in an empty house that belonged to his in-laws, he and Ciau, who is a U.S. permanent resident, faced an impossible decision.\nShould she and the children join Cruz in Mexico?\nOr stay in Inglewood?\nCruz and Ciau both had families that had been broken by the border, and they didn’t want that for their kids. In the months since Cruz had been detained, his eldest daughter, 16-year-old Dhelainy, had barely slept and had stopped playing her beloved piano, and his youngest son, 5-year-old Gabriel, had started acting out. Esther, 14, and Angel, 10, were hurting, too.\nBut bringing four American kids to Mexico didn’t seem fair, either. None of them spoke Spanish, and the schools in Kini didn’t compare with those in the U.S. Dhelainy was a few years from graduating high school, and she dreamed of attending the University of California and then Harvard Law.\nThere was also the question of money. At the car wash, Cruz earned $220 a day. But the day rate for laborers in Kini is just $8. Ciau had a good job at Los Angeles International Airport, selling cargo space for an international airline. It seemed crazy to give that up.\nCiau wanted to hug her husband again. She wanted to know what it would feel like to have the whole family in Mexico. So in early August she packed up the kids and surprised Cruz with a visit.\nKini lies an hour outside of Merida in a dense tropical forest. Like many people here, Cruz grew up speaking Spanish and a dialect of Maya and lived in a one-room, thatched-roof house. He, his parents and his five brothers and sisters slept in hammocks crisscrossed from the rafters.\nHis parents were too poor to buy shoes for their children, so when he was a boy Cruz left school to work alongside his father, caring for cows and crops. At 17 he joined a wave of young men leaving Kini to work in the United States.\nHe arrived in Inglewood, where a cousin lived, in 1992, just as Los Angeles was erupting in protest over the police beating of Rodney King.\nCruz, soft-spoken and hardworking, was overwhelmed by the big city but found refuge in a green stucco apartment complex that had become a home away from home for migrants from Kini, who cooked and played soccer together in the evenings.\nEventually he fell for a young woman living there: Ciau, whose parents had brought her from Kini as a young girl, and who obtained legal status under an amnesty extended by President Reagan. They married when she turned 18.\nAs their family grew, they developed rituals. When one of the kids made honor roll, they’d celebrate at Dave & Buster’s. Each summer they’d visit Disneyland. And every weekend they’d dine at Casa Gambino, a classic Mexican restaurant with vinyl booths, piña coladas and a bison head mounted on the wall. On Fridays, Cruz and Ciau left the kids with her parents and went on a date.\nAs the father of four Americans, Cruz was eligible for a green card. But the attorneys he consulted warned that he would have to apply from Mexico and that the wait could last years.\nCruz didn’t want to leave his children. So he stayed. When President Trump was reelected last fall on a vow to carry out mass deportations, he tried not to worry. The government, he knew, usually targeted immigrants who had committed crimes, and his record was spotless. But the Trump administration took a different approach.\nOn June 8, masked federal agents swarmed Westchester Hand Wash. Cruz said they slammed him into the back of a patrol car with such force and shackled his wrists so tightly that he was left with bruises across his body and a serious shoulder injury.\nCiau, who was helping Esther buy a dress for a middle school honors ceremony, heard about the raid and raced over. She had been at the car wash just hours earlier, bringing lunch to her husband and his colleagues. Now it was eerily empty.\nAt the Westchester Hand Wash last June, an employee tells a customer that they are closed due to a recent immigration raid. (Genaro Molina/Los Angeles Times)\nAt a news conference in June at Culver City Express Hand Car Wash and Detail, Noemi shows a photo of her husband, Jesús, who was taken into custody by immigration agents that month at a car wash.\n(Genaro Molina/Los Angeles Times)\nCruz was transferred to a jail in El Paso, where he says he was denied requests to speak to a lawyer or call his family.\nOne day, an agent handed him a document and told him to sign. The agent said that if Cruz fought his case, he would remain in detention for up to a year and be deported anyway. Signing the document — which said he would voluntarily return to Mexico — meant he could avoid a deportation order, giving him a better shot at fixing his papers in the future.\nCruz couldn’t read the text without his glasses. He didn’t know that he very likely would have been eligible for release on bond because of his family ties to the U.S. But he was in pain and afraid and so he signed.\nReturning to Kini after decades away was surreal.\nSprawling new homes with columns, tile roofs and other architectural flourishes imported by people who had lived in the U.S. rose from what had once been fields. There were new faces, too, including a cohort of young men who appraised Cruz with curiosity and suspicion. With his polo shirts and running shoes, he stood out in a town where most wore flip-flops and as few clothes as possible in the oppressive heat.\nCruz found work on a small ranch. Before dawn, he would pedal out there on an old bicycle, clearing weeds and feeding cows, the world silent except for the rustle of palm leaves. In all his years in the big city, he had missed the tranquility of these lands.\nHe had missed his mother, too. She has multiple sclerosis and uses a wheelchair. Some days, she could speak, and would ask about his family and whether Cruz was eating enough. Other days, they would sit in silence, him occasionally leaning over to kiss her forehead.\nHe always kept his phone near, in case Ciau or one of the kids called. He tried his best to parent from afar, mediating arguments and reminding the kids to be kind to their mother. He tracked his daughters via GPS when they left the neighborhood, and phoned before bed to make sure everyone had brushed their teeth.\nHe worried about them, especially Dhelainy, a talented musician who liked to serenade him on the piano while he cooked dinner. The burden of caring for the younger siblings had fallen on her. Since Cruz had been taken, she hadn’t touched the piano once.\nDuring one conversation, Dhelainy let it slip that they were coming to Mexico. Cruz surged with joy, then shuddered at the thought of having to say goodbye again. He picked them up at the airport.\nThat first evening, they shared pizza and laughed and cried. Gabriel, the only family member who had never been to Mexico, was intrigued by the thick forest and the climate, playing outside in the monsoon rain. For the first time in months, Dhelainy slept through the night.\n“We finally felt like a happy family again,” Ciau said. But as soon as she and the kids arrived, they started counting the hours to when they’d have to go back.\nDuring the heat of the day, the family hid inside, lounging in hammocks. They were also dodging unwanted attention. It seemed everywhere they went, someone asked Cruz to relive his arrest, and he would oblige, describing cold nights in detention with nothing to keep warm but a plastic blanket.\nBut at night, after the sky opened up, and then cleared, they went out.\nIt was fair time in Kini, part of an annual celebration to honor the Virgin Mary. A small circus had been erected and a bull ring constructed of wooden posts and leaves. A bright moon rose as the family took their seats and the animal charged out of its pen, agitated, and barreled toward the matador’s pink cape.\nCruz turned to his kids. When he was growing up, he told them, the matador killed the bull, whose body was cut up and sold to spectators. Now the fights ended without violence — with the bull lassoed and returned to pasture.\nIt was one of the ways that Mexico had modernized, he felt. He felt pride at how far Mexico had come, recently electing its first female president.\nThe bull ran by, close enough for the family to hear his snorts and see his body heave with breath.\n“Are you scared?” Esther asked Gabriel.\nWide-eyed, the boy shook his head no. But he reached out to touch his father’s hand.\nLater, as the kids slept, Cruz and Ciau stayed up, dancing cumbia deep into the night.\nThe day before Ciau and the kids were scheduled to leave, the family went to the beach. Two of Ciau’s nieces came. It was the first time Gabriel had met a cousin. The girls spoke little English, but they played well with Gabriel, showing him games on their phones. (For days after, he would giddily ask his mother when he could next see them.)\nThat evening, the air was heavy with moisture.\nThe kids went into the bedroom to rest. Cruz and Ciau sat at the kitchen table, holding hands and wiping away tears.\nThey had heard of a U.S. employer who, having lost so many workers to immigration raids, was offering to pay a smuggler to bring people across the border. Cruz and Ciau agreed that was too risky.\nThey had just paid a lawyer to file a lawsuit saying Cruz had been coerced into accepting voluntary departure and asking a judge to order his return to the U.S. so that he could apply for relief from removal. The first hearing was scheduled for mid-September.\nCruz wanted to return to the U.S. But he was increasingly convinced that the family could make it work in Mexico. “We were poor before,” he told Ciau. “We can be poor again.”\nCiau wasn’t sure. Her children had big — and expensive — ambitions.\nDhelainy had proposed staying in the U.S. with her grandparents if the rest of the family moved back. Cruz and Ciau talked about the logistics of that, and Ciau vowed to explore whether the younger kids could remain enrolled in U.S. schools, but switch to online classes.\nWhen the rain began, Cruz got up and closed the door.\nThe next morning, Cruz would not accompany his family to the airport. It would be too hard, he thought, “like when somebody gives you something you’ve always wanted, and then suddenly takes it away.”\nJesús comforts his son Angel as they walk to the car to leave for the airport. (Juan Pablo Ampudia/For The Times)\nJesús hugs his son Gabriel as they say goodbye. (Juan Pablo Ampudia/For The Times)\nGabriel wrapped his arms around his father’s waist, his small body convulsed with tears: “I love you.”\n“It’s OK, baby,” Cruz said. “I love you, too.”\n“Thank you for coming,” he said to Ciau. He kissed her. And then they were gone.\nThat afternoon, he walked the streets of Kini. The fair was wrapping up. Workers sweating in the heat were dismantling the circus rides and packing them onto the backs of trucks.\nHe thought back to a few evenings earlier, when they had celebrated Dhelainy’s birthday.\nThe family had planned to host a joint sweet 16 and quinceñera party for her and Esther in July. They had rented an event hall, hired a band and sent out invitations. After Cruz was detained, they called the party off.\nThey celebrated Dhelainy’s Aug. 8 birthday at the house in Kini instead. A mariachi band played the Juan Gabriel classic, “Amor Eterno.”\n“You are my sun and my calm,” the mariachis sang as Cruz swayed with his daughter. “You are my life / My eternal love.”"
    }
  ],
  "argos_summary": "Indonesian protests over lawmakers’ housing allowance have escalated into widespread violence, with arson attacks on provincial and regional parliament buildings in Makassar, West Java, and Surabaya, resulting in at least three deaths and multiple injuries. The unrest, sparked by a $3,075 monthly allowance deemed excessive amid high living costs, intensified after the death of a ride‑hailing driver during a Jakarta rally, prompting nationwide demonstrations and police crackdowns. Authorities have detained hundreds, and foreign embassies have urged citizens to avoid protest zones. The turmoil underscores growing public frustration with perceived government excesses and the broader social‑economic tensions in Indonesia.",
  "argos_id": "91BPHWJHM"
}