{
  "url": "https://www.foxnews.com/entertainment/walking-tall-sheriff-accused-murdering-wife-cold-case-twist-authorities",
  "authorsByline": "Stephanie Giang-Paunon",
  "articleId": "59abefc99a9b4b549c751e557bec92d8",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/pusser-investigation.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T14:16:53-04:00",
  "addDate": "2025-08-30T18:28:17.900894+00:00",
  "refreshDate": "2025-08-30T18:28:17.900897+00:00",
  "score": 1.0,
  "title": "‘Walking Tall’ sheriff accused of murdering his wife following cold case twist: authorities",
  "description": "Tennessee sheriff Buford Pusser, hero of \"Walking Tall,\" is now accused of murdering his wife Pauline in 1967 after investigators found evidence he staged the crime.",
  "content": "Tennessee sheriff Buford Pusser, once celebrated as a crime-busting hero and the inspiration behind the Hollywood hit movie \"Walking Tall,\" faces new accusations of pulling the trigger that killed his own wife.\n\nA cold-case review by the Tennessee Bureau of Investigation has concluded that there is probable cause that Pusser, who died in 1974, staged his wife’s 1967 murder. Prosecutors said Friday that if he were alive today, they would present an indictment to a grand jury for the murder of his wife, Pauline Mullins Pusser.\n\nInvestigators also said they uncovered signs that Pauline suffered from domestic violence.\n\n'GO BIG OR GO HOME': DISTURBING CONFESSION FROM HUSBAND WHO ALLEGEDLY MURDERED WIFE AND CONCEALED HER BODY\n\nThe McNairy County sheriff died in a car crash seven years after his wife's death.\n\nFor nearly six decades, the public believed that Buford and his wife were ambushed while responding to a disturbance. According to his account at the time, shots were fired from a passing vehicle, leaving Pauline dead and Buford severely wounded. The case closed, largely resting on his own testimony.\n\nProsecutors joined forces with the Tennessee Bureau of Investigation, which reopened Pauline’s case in 2022 during a cold-case sweep, according to agency director David Rausch.\n\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\nAgents flagged inconsistencies between Buford’s account and the physical evidence, as they chased down a tip about a possible murder weapon and exhumed Pauline’s body for a new autopsy.\n\nThe probe uncovered evidence that Pauline was shot outside the car and placed inside to fit Buford’s narrative.\n\nBlood-spatter patterns on the vehicle and surrounding ground did not align with his description of the scene.\n\nSUZANNE MORPHEW'S REMAINS MAY HAVE BEEN MOVED TWICE AFTER BEING KILLED, FORENSIC SCIENTIST SAYS\n\nDuring the reexamination of the case, Dr. Michael Revelle, an emergency medicine physician and medical examiner, found that cranial trauma suffered by Pauline didn't match crime-scene photographs of the car's interior.\n\nPauline’s remains revealed signs of previous abuse, including a healed broken nose — as the evidence pointed to a violent marriage that Buford hid from the public.\n\nPauline’s brother, Griffon Mullins, expressed relief after the investigation update, saying, \"You would fall in love with her because she was a people person. And of course, my family would always go to Pauline if they had an issue or they needed some advice and she was always there for them. She was just a sweet person. I loved her with all my heart.\"\n\nMullins said he knew there was some trouble in Pauline's marriage, but she wasn't one to talk about her problems. For that reason, Mullins said he was \"not totally shocked.\"\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nThe Tennessee Bureau of Investigation plans to make the entire file, which exceeds 1,000 pages, available to the public by handing it over to the University of Tennessee at Martin once it finishes with redactions.\n\n\"This case is not about tearing down a legend. It is about giving dignity and closure to Pauline and her family and ensuring that the truth is not buried with time,\" Mark Davidson, the district attorney for Tennessee’s 25th judicial district, said in a news conference streamed online. \"The truth matters. Justice matters. Even 58 years later. Pauline deserves both.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe Associated Press contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/us/california-1977-cold-case-murder-suspect-identified-69-year-old-former-army-private-living-ohio",
    "https://www.foxnews.com/us/mississippi-sheriffs-deputy-shot-killed-while-responding-domestic-call-died-hero",
    "https://www.foxnews.com/us/go-big-go-home-disturbing-confession-husband-allegedly-murdered-wife-concealed-body",
    "https://www.foxnews.com/us/suzanne-morphews-remains-may-have-been-moved-twice-after-being-killed-forensic-scientist-says",
    "https://www.foxnews.com/video/6376518454112",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/entertainment",
    "https://www.foxnews.com/category/us/us-regions/southeast/tennessee"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pauline Mullins Pusser",
      "weight": 0.09784696
    },
    {
      "name": "Pauline",
      "weight": 0.09301419
    },
    {
      "name": "Tennessee sheriff Buford Pusser",
      "weight": 0.088650815
    },
    {
      "name": "Buford Pusser",
      "weight": 0.07324172
    },
    {
      "name": "cold case twist",
      "weight": 0.069616236
    },
    {
      "name": "WIFE",
      "weight": 0.06612202
    },
    {
      "name": "Tennessee",
      "weight": 0.06548332
    },
    {
      "name": "Buford",
      "weight": 0.06478082
    },
    {
      "name": "Pauline’s case",
      "weight": 0.05636186
    },
    {
      "name": "agency director David Rausch",
      "weight": 0.052621115
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Law Enforcement"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.97509765625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.97412109375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9658203125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.7890625
    },
    {
      "name": "/News/Local News",
      "score": 0.6884765625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.55615234375
    },
    {
      "name": "/News/Other",
      "score": 0.377197265625
    }
  ],
  "sentiment": {
    "positive": 0.07769742,
    "negative": 0.64991754,
    "neutral": 0.27238506
  },
  "summary": "Tennessee sheriff Buford Pusser, known for his work as a crime-busting hero and inspiration behind the Hollywood hit movie \"Walking Tall,\" is accused of staging his wife's 1967 murder. A cold-case review by the Tennessee Bureau of Investigation has concluded that there is probable cause that the former sheriff, who died in 1974, staged the murder. The investigators uncovered signs of domestic violence and evidence that Pauline was shot outside the car and placed inside to align with Bufords' narrative. The case was reopened in 2022 during a cold-cases sweep and will be made public once it finishes with redactions.",
  "shortSummary": "Tennessee sheriff Buford Pusser is accused of murdering his wife, Pauline Mullins, in 1967, after a cold case investigation found inconsistencies and domestic violence signs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9fac76ceb2c0465f871f6b5389626524",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/us/mississippi-sheriffs-deputy-shot-killed-while-responding-domestic-call-died-hero",
      "text": "A Mississippi community is mourning the loss of a sheriff's deputy after he was shot and killed while responding to a domestic call Sunday evening.\nHinds County Sheriff Tyree Jones identified the slain deputy as 37-year-old Martin Shields, Jr., in a Facebook post.\nShields had been with the Hinds County Sheriff's Office for about nine months, but \"his law enforcement career extends beyond being employed with the HCSO,\" the sheriff said. Memorial posts on social media showed previous employment with the Mississippi Department of Corrections and the Jackson Police Department.\nShields' father retired from HCSO as a captain, according to the Jackson Fallen Firefighters Memorial Foundation.\nPENNSYLVANIA POLICE OFFICER KILLED IN HOSPITAL SHOOTING; GUNMAN DEAD, OFFICIALS SAY\nLimited details are available, but Jones had said a couple of hours earlier that there was a \"very serious situation\" taking place in the 15000 block of Midway Road in Terry, Mississippi, which is approximately 15 miles southwest of Jackson.\nTwo deputies, Shields and an unidentified Hinds County deputy, were responding to a domestic call at a residence at the aforementioned address. Jones said he heard the other deputy come across the radio calling for \"shots fired\" and made his way to the scene on Midway Road.\nA \"Be On the Lookout\" alert was issued Sunday evening for Eric Brown, 42, who was \"wanted for questioning regarding the situation on Midway Road\" and was considered armed and dangerous. The alert was canceled sometime before 10 p.m. when police said there was no longer an active threat.\nA Facebook post made at about 10:19 p.m. Sunday announced the deputy's death and also said an \"unidentified Black male subject believed to be related to the call\" was found dead inside the home on Midway Road. That person was identified as Brown on Monday and his cause of death is under investigation, according to the Hinds County Sheriff's Office.\nBrown is suspected to be responsible for Shields' death, Jones said on Monday. A woman identified as Brown's wife was also shot, as well as another woman – who wasn't identified in any way – at the scene. Both women are in stable condition.\nThe investigation into the shooting remains active and the Mississippi Bureau of Investigation is assisting.\nTWO VIRGINIA BEACH POLICE OFFICERS SHOT DEAD WHILE 'DEFENSELESS' DURING LATE-NIGHT TRAFFIC STOP\nJones wrote a heartfelt tribute to Shields on his professional Facebook page early Monday morning, sharing that the two men had just responded to a capsized boat together earlier in the day. He said that while he was responding to the \"shots fired\" call, he paged Shields several times with no answer.\n\"The deputy who called ‘shots fired’ was in survival mode due to the situation but still performed very heroic acts. My heart sank as I rushed to the scene, not getting a response from the fallen deputy. Just prior to my arrival, I learned that he had been shot and was obviously deceased,\" Jones wrote, adding there was an \"outpouring of support\" at the scene.\nHe said Shields \"died a hero\" and \"while responding to a call for service to assist someone in need.\"\n\"He fulfilled his assignment and his God-given mission on earth. Pray for his family, his friends, the many lives he touched, and the men and women of the HCSO as we all prepare for a final salute,\" he wrote. \"There’s absolutely no way I could ever imagine or prepare to tell a family their deputy will not be coming home from their tour of duty. However, tragically, I found myself in that situation late this evening.\"\nCLICK HERE TO GET THE FOX NEWS APP\nShields' death marks the latest killing in a deadly weekend for law enforcement across the country.\nTwo Virginia Beach police officers died Saturday morning after they were both shot while conducting a traffic stop late Friday night.\nIn Pennsylvania, West York Borough Patrolman Andrew Duarte was shot and killed while responding to an active shooter at UPMC Memorial Hospital on Saturday morning.\nFox News Digital has reached out to the Mississippi Bureau of Investigation and Hinds County Sheriff Tyree Jones."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/us/california-1977-cold-case-murder-suspect-identified-69-year-old-former-army-private-living-ohio",
      "text": "An arrest has been made in a grisly cold-case murder that has been \"haunting\" prosecutors in California’s Bay Area for more than a decade, a district attorney told Fox News Digital.\nWillie Sims, a 69-year-old former Army private now living in Jefferson, Ohio, was identified as the suspect who allegedly strangled Jeanette Ralston to death with a long-sleeved shirt in early 1977 after meeting the 24-year-old at a bar in San Jose. The Santa Clara County District Attorney's Office announced Sims’ arrest this week, citing new fingerprint and DNA evidence.\n\"This is a case that's been haunting all the cold-case prosecutors for literally since 2011, when [our] Cold Case Unit was established,\" Santa Clara Deputy District Attorney Rob Baker told Fox News Digital. \"About a year ago, we decided, ‘Hey, let's have the fingerprints in this case checked again.’ We caught a break last summer when we sent the fingerprints out, and we got a hit, which led us to the front door of Mr. Sims’s home in Ohio.\"\n\"Our guiding principle at the Cold Case Unit here in Santa Clara County is we never forget. We never forget the victims. We never forget the family of those victims, and we never forget the loved ones of those victims,\" he added. \"And we're always going to seek justice, whether it takes 10 years, 20 years or 50 years.\"\nThe Santa Clara County District Attorney's Office said friends of Ralston had last seen her alive on Jan. 31, 1977, \"when she left the Lion’s Den Bar at 1500 Almaden Road in San Jose with an unknown man just before midnight.\"\n\"On February 1, 1977, Ralston, then 24-years-old and living in San Mateo, was found dead, wedged tightly in the back seat of her Volkswagen Beetle in the carport area of an apartment complex near the bar,\" the attorney’s office added. \"The medical examiner concluded the cause of death was strangulation from a long-sleeve dress shirt tied around her neck. The autopsy also showed evidence of sexual assault. The killer tried to light her car on fire, but it failed to burn.\"\nAt the time of her murder, no suspects were identified, prosecutors said.\nThe case then went cold for decades \"until a fingerprint found on one of Ralston’s cigarette packs was found to match Sims in August 2024,\" according to the Santa Clara County District Attorney's Office.\nBaker told Fox News Digital that prosecutors previously searched for the fingerprints in this case, \"but it wasn't until we searched again last year where the new FBI's fingerprint algorithm made an identification.\"\nATTEMPTED MURDER FUGITIVE BUSTED AS 40-YEAR SCHEME POSING AS DEAD COLLEGE MATE UNRAVELS\nHe described it as a \"major break\" in the hunt for Ralston’s killer.\n\"It was an emotional day for us when we actually made the arrest, and certainly it was an emotional day for the family,\" Baker added.\n\"I talked to Jeanette's son. He was 6 years old when she died, and he was very appreciative of the work we did and the work that we had done in the case,\" Baker said.\nProsecutors said Sims was an Army private assigned to Fort Ord, a former U.S. military base in Marina, California, at the time of Ralston's murder. He \"was convicted in 1978 for an assault to commit murder in Monterey County\" and later \"moved out of state before his DNA could be entered into CODIS, the state’s DNA database,\" they added.\nDNA SAMPLE TIES ELDERLY MAN TO 40-YEAR-OLD COLD CASE MURDER OF TEXAS WOMAN\n\"Earlier this year, DA’s Bureau of Investigation and San Jose Police Department investigators traveled to Ohio to collect a DNA sample from Sims with the assistance of Ashtabula County authorities. Weeks ago, the DA’s Crime Lab found DNA consistent with Sims on Ralston’s fingernails and the shirt used to strangle her,\" the attorney’s office said.\nAshtabula County Prosecutor April Grabman told Fox News Digital that Sims made an initial court appearance Tuesday in Ohio and waived his right to a full extradition hearing.\n\"I am hopeful with Mr. Sims’ arrest the family can hold on to hope that justice will be served and, although several years later, they can finally bring some closure to their loss,\" she said.\nProsecutors in California said Sims faces 25 years to life in prison if convicted.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Jeanette was at a bar with two of her friends, and they were just dancing and hanging out and having a fun night out, and she ran into the man who killed her,\" Baker told Fox News Digital. \"We don't have any apparent connection between Mr. Sims and Ms. Ralston other than they met at this bar on Feb. 1, 1977.\""
    },
    {
      "url": "https://www.foxnews.com/category/us/us-regions/southeast/tennessee",
      "text": "MLB 3 days ago Babe Ruth namesake in Tennessee faces charges for alleged use of deceased MLB stars' IDs in fraud scheme A Tennessee man named George Herman “Babe\" Ruth has been charged after allegedly using names of dead professional baseball players in a six-figure fraud scheme.\nDiversity 4 days ago DHS juggles ‘mass deportation’ push with Helene relief, adds $124M after Biden backlash Department of Homeland Security delivers $124 million in August Hurricane Helene relief funds under Trump administration for debris removal and infrastructure.\nImmigration 4 days ago Top Trump agency torches Dem lawmakers rallying around detained Abrego Garcia: 'It is insane' The Department of Homeland Security slams Democratic lawmakers who condemned ICE detention of alleged MS-13 member, Kilmar Abrego Garcia, who's facing Uganda deportation.\nTrue Crime 5 days ago Witness in Holly Bobo murder trial admits lying, raising questions about nursing student's true killer Key witness in 2017 Holly Bobo murder trial admits to lying about Zachary Adams' involvement, prompting defense to request new trial for convicted killer, court records show.\nNashville 6 days ago Decapitated body discovered near Nashville Waffle House Nashville authorities probe discovery of headless body found in wooded area by restaurants on Friday, with police seeking victim's identity.\nImmigration August 23 ICE notifies Kilmar Abrego Garcia's lawyers of possible deportation to Uganda after Tennessee jail release Illegal immigrant Kilmar Abrego Garcia may be deported to Uganda after his release from jail in Tennessee on Friday, ICE told his lawyers.\nImmigration August 22 Noem torches 'activist liberal judges' after Abrego Garcia's release from jail: 'New low' An Immigration case involving Kilmar Abrego Garcia sparked a social media firestorm after a federal judge ruled ICE can't arrest him as the case continues to drive national attention.\nDigital Originals August 20 From ‘homicide capital’ to safer streets? Memphis area sees policing push Tennessee Highway Patrol troopers are tackling drugs, guns and reckless driving in Memphis, a city dubbed America's \"homicide capital\" by FBI Director Kash Patel.\nTennessee August 19 Ex-officer sentenced following arrest for groping OnlyFans star in video while on duty Former Nashville police officer sentenced to probation after pleading guilty to official misconduct for participating in adult video while on duty.\nCrime August 17 Tennessee man charged for allegedly raping unconscious woman outside church before she died Mohamed Mohamed, 39, has been charged with four counts of rape after following an alleged sexual assault outside of the Nashville Life Church on Thursday.\nSports August 17 From training to retirement, the bucking bulls of PBR live like star athletes When the gate opens, cowboys are put to the test during Professional Bull Riders events. But the stars aren't necessarily those who ride the bucking animals.\nReptiles August 14 Hiker made fatal mistake when encountering venomous snake, officials believe A hiker suffered a fatal snake bite in Tennessee after picking up a Timber rattlesnake near the beginning of a trail in Savage Gulf State Park, officials said.\nDonald Trump August 13 Rural town to turn closed prison into ICE detention facility despite resident pushback The small town of Mason, Tenn., has voted to turn a former prison into an ICE detention center, which will be run by CoreCivic.\nArkansas August 13 Appeals court allows Arkansas' first-in-the-nation ban on gender transition care for minors to be enforced A federal appeals court on Tuesday upheld Arkansas' first-in-the-nation law prohibiting doctors from providing gender transition medical treatment to minors.\nTennessee August 6 Tennessee Sen. Marsha Blackburn launches campaign for governor U.S. Sen. Marsha Blackburn announces bid for Tennessee governor, seeking \"to ensure Tennessee is America’s conservative leader,\" according to a press release\nTravel August 5 Dollywood tops Disney parks in best amusement park rankings survey A Tripadvisor survey ranked America's best amusement parks based on millions of reviews, with Dollywood in Tennessee claiming the top spot ahead of Disney parks. Check out the details.\nU.S. August 5 Quadruple murder suspect Austin Drummond captured after intensive Tennessee search Tennessee quadruple murder suspect Austin Drummond was arrested on Tuesday morning, according to the Jackson Police Department.\nU.S. August 5 Quadruple murder suspect Austin Drummond’s lavish life behind bars included alcohol, TV streaming Quadruple murder suspect Austin Drummond bragged about his life behind bars, posting pictures on Facebook that featured a streaming device, video games and alcohol.\nManhunt August 4 Tennessee 'associates' of quadruple murder suspect arrested Tennessee authorities arrested Giovonte Thomas, Tanaka Brown and Dearrah Sanders as the manhunt for Austin Drummond, who allegedly killed four people, continues.\nTennessee August 2 Tennessee man allegedly tries to blow up law enforcement officials during arrest at his home: authorities A Polk County man was charged with 11 counts of attempted murder and weapons violations after authorities found 14 improvised explosive devices in his home.\nManhunt August 2 Vehicle of Tennessee quadruple murder suspect found as details of criminal past emerge Police in Jackson, Tennessee have found the vehicle driven by Tennessee quadruple murder suspect Austin Drummond and are warning locals to stay vigilant.\nManhunt August 1 Manhunt on for Tennessee quadruple murder suspect who DA says was out on bond for 2024 attempted murder charge Manhunt continues for Austin Robert Drummond wanted for targeted quadruple murder of girlfriend's family members in Dyer County, Tennessee while he was out on bond.\nVIDEO August 1 Manhunt underway for Tennessee quadruple murder suspect Fox News national correspondent Madison Scarpino has the latest on the manhunt underway for a man charged with murdering four members of a Tennessee family on 'America Reports.'\nUS July 31 Tennessee authorities hunt for 28-year-old suspect in quadruple murder linked to abandoned baby A manhunt is underway in Tennessee for Austin Robert Drummond, 29, who is suspected of killing four people in Tiptonville in a case linked to the discovery of an abandoned baby.\nIllegal Immigrants July 31 Senate bill looks to box out future presidents who may try to skirt immigration enforcement laws New GOP legislation would classify all DUI convictions as deportable offenses for illegal immigrants, regardless of misdemeanor or felony classification.\nRepublicans July 29 Republican congressman kicked by horse, breaks rib during farm accident Rep. Tim Burchett, R-Tenn., was kicked in the chest by both hooves of his horse after a horsefly spooked the animal, breaking one rib but recovering.\nDEI July 28 University runs damage control amid concerns it hides illegals, upholds reverse discrimination Belmont University in Tennessee has hired an external partner for compliance review amid concerns the Christian school rebranded reverse-discrimination policies.\nCarrie Underwood July 27 Carrie Underwood fully embraces traditional country living on her Tennessee farm Country star Carrie Underwood has embraced her Tennessee farm, growing produce, raising livestock and canning foods while balancing her career as a performer.\nTennessee July 24 Bodies of 3 men recovered from Mississippi River after swimming, fishing on sandbar The bodies of three men were recovered from the Mississippi River near Memphis, Tennessee, on Wednesday after they went missing while fishing and swimming on a sandbar.\nVIDEO July 23 Ex-Homeland Security official: I can hardly think of a more likely 'FLIGHT RISK' Former acting DHS deputy secretary Ken Cuccinelli weighs in on a Maryland judge blocking ICE from deporting Kilmar Abrego Garcia upon his release on 'The Will Cain Show.'"
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/us/suzanne-morphews-remains-may-have-been-moved-twice-after-being-killed-forensic-scientist-says",
      "text": "Suzanne Morphew's body may have been moved twice after she died, according to a forensic scientist.\nBarry Morphew was re-indicted by a grand jury in Colorado on a murder charge on June 20 after he allegedly killed his wife, 49-year-old Suzanne Morphew, who vanished on Mother's Day in 2020. The Morphews lived near Salida, Colorado, where Suzanne Morphew was last seen alive.\nBarry Morphew was arrested near Phoenix, Arizona, on June 20, booking documents show. He was living inside a trailer park located in Cave Creek, Arizona, according to property tax records.\nThough Suzanne Morphew went missing in 2020, agents with the Colorado Bureau of Investigation found her remains on Sept. 22, 2023. According to prosecutors, a 2024 autopsy report showed a deer tranquilizer called \"BAM\" was found in her bone marrow, which stands for the chemicals butorphanol, azaperone and medetomidine.\nProsecutors said Suzanne Morphew's remains were found \"in and around a shallow clandestine grave\" in Saguache County, Colorado, a \"few hundred feet\" off Highway 17.\nAccording to the indictment charging Barry Morphew with first-degree murder after deliberation, the clothes on Suzanne Morphew's body \"lacked evidence of decomposition.\" Officials also said a \"very small amount\" of dried soft tissue was found on the bones, no hair mass was located and there was a lack of animal predation visible on the bones.\n\"All these features would have been expected if this had been the original gravesite where decomposition occurred,\" a board-certified forensic anthropologist, a botanist and an entomologist told prosecutors. \"The forensic anthropologist opined that based on these factors it was unlikely Suzanne decomposed from a fresh body to a skeleton at this location.\"\nPeter Valentin, associate professor of forensic science at the University of New Haven, told Fox News Digital the body was moved \"at least\" one time.\n\"There's certainly every indication that decomposition occurred in a place other than where the body was found,\" Valentin said. \"Now, I've seen that people have said the body's been moved at least twice. And I think that's a reasonable inference. But you can't know that for sure, because that assumes, that makes an assumption, that the body was killed in one location. Transported to a second location where the decomposition occurs, and then brought to the third location where the body is discovered. And I don't think you know that for sure yet.\nValentin also said there's an \"absence of evidence\" suggesting that the clothing Suzanne Morphew's remains were found in is what she decomposed with.\nSuzanne Morphew's bones were found \"significantly bleached,\" according to the indictment. Valentin said the term \"bleached,\" in this context, refers to how much sun exposure the bones had.\nIn this case, Valentin said the \"significantly bleached\" bones help support prosecutors' argument that Suzanne Morphew's body was moved.\nCLICK HERE TO GET THE FOX NEWS APP\n\"As part of the decomposition process, so if some bones are bleached and some aren't, you can get a sense of you know how the remains are positioned. If where Suzanne Morphew's remains are found, are in a place that are not exposed to the sun, therefore they couldn't be bleached at the site where they recovered that would be another indicator that she was.\"\nBarry Morphew's next court date is Sept. 2."
    },
    {
      "url": "https://www.foxnews.com/us/go-big-go-home-disturbing-confession-husband-allegedly-murdered-wife-concealed-body",
      "text": "A Texas man allegedly admitted to killing his wife and concealing her decomposing body in their home for a month, reportedly telling investigators he wanted to \"go big or go home\" with his first offense.\nCharles Byrd, 49, was apprehended on Sunday following a day-long search initiated after a family member contacted authorities, claiming Byrd had confessed to murdering his wife, Angela Byrd. Bexar County Sheriff Javier Salazar shared the details during a press conference.\nDeputies found Angela Byrd, 44, deceased and wrapped in plastic inside the couple’s home, where Byrd allegedly lived for weeks as the body decomposed, according to the sheriff.\nSalazar said a particularly disturbing comment from Byrd left a \"huge impression\" on the investigator.\nBARRY MORPHEW ACCUSED OF WIFE SUZANNE’S MURDER: SEE HOW THE 5-YEAR COLORADO MURDER MYSTERY UNRAVELED\n\"He told the investigator he had never been in trouble with the law before and then blurted out the comment to our investigator, ‘You know, go big or go home',\" Salazar recalled. \"It was a pretty disturbing remark.\"\n\"That was pretty shocking to me, to hear that he... used that to describe what we believe to be, at this point, evidence of the murder of his wife. I just found that very, very shocking.\"\nAUSTIN MORTUARY EMPLOYEE ARRESTED FOR ALLEGEDLY ‘EXPERIMENTING’ ON CORPSES\nByrd reportedly repeated his confession to a local reporter after being found at a vacant house about a mile away from the scene.\n\"I’m so sorry. I loved my wife,\" he told KSAT, attributing his actions to a \"mental break.\"\nAuthorities said Byrd cooperated with the investigation and provided details about the violent incident that occurred on June 16. He also allegedly acknowledged that he expected the body would eventually be discovered.\nTEXAS MAN ARRESTED FOR FATAL BEATING OF MOTHER DURING 'EXORCISM': POLICE\nByrd is currently facing charges for tampering with evidence involving a human corpse. Additional murder charges are pending as officials await the determination of Angela’s official cause of death.\n\"Once we get the ruling of the medical examiner, if indeed they are able to confirm that those remains are of Angela Byrd and if they are to confirm that she was indeed the victim of a homicide, then at that point, based upon some of the admissions that were made by Mr. Byrd, we will be seeking at least a murder charge on him,\" Salazar said.\nCLICK HERE TO GET THE FOX NEWS APP\nByrd remains in custody at the Bexar County Jail and is undergoing a mental health evaluation.\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com"
    }
  ],
  "argos_summary": "The Tennessee Bureau of Investigation has reopened the 1967 murder of Pauline Mullins Pusser, concluding probable cause that Sheriff Buford Pusser staged the death and concealed evidence of domestic violence. New forensic work—blood‑spatter analysis, re‑exhumation, and a fresh autopsy—revealed inconsistencies with Pusser’s original story and signs of prior abuse. Prosecutors say that if Pusser were alive, a grand‑jury indictment would be filed, and the 1,000‑page case file will soon be made public. The investigation underscores a long‑unsettled crime that has now entered the public record after decades of silence.",
  "argos_id": "A71WAYHXE"
}