{
  "url": "https://finance.yahoo.com/news/gold-provides-u-government-statement-210300879.html?_guc_consent_skip=1756588010",
  "authorsByline": "Business Wire",
  "articleId": "355d80bced964397a1194f373fd2ab14",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T21:03:00+00:00",
  "addDate": "2025-08-30T21:07:58.342847+00:00",
  "refreshDate": "2025-08-30T21:07:58.342848+00:00",
  "score": 1.0,
  "title": "Gold Reserve Provides Update on U.S. Government’s Statement of Interest Supporting Venezuelan Opposition Government in Litigation Regarding Validity of 2020 PDVSA Bonds",
  "description": "PEMBROKE, Bermuda, August 30, 2025--Gold Reserve Ltd. (TSX.V: GRZ) (BSX: GRZ.BH) (OTCQX: GDRZF) (\"Gold Reserve\" or the \"Company\") announces that on August 29, 2025, the U.S. Government filed a Statement of Interest in the pending New York federal court litigation regarding the validity of the 2020 PDVSA bonds.",
  "content": "PEMBROKE, Bermuda, August 30, 2025--(BUSINESS WIRE)--Gold Reserve Ltd. (TSX.V: GRZ) (BSX: GRZ.BH) (OTCQX: GDRZF) (\"Gold Reserve\" or the \"Company\") announces that on August 29, 2025, the U.S. Government filed a Statement of Interest in the pending New York federal court litigation regarding the validity of the 2020 PDVSA bonds. The key question in the litigation is whether the 2020 PDVSA bonds are invalid under Venezuelan law and, if so, the consequences of this invalidity. The 2020 PDVSA Bonds were issued by the Maduro regime in October 2016, but the 2015 National Assembly of Venezuela has issued multiple resolutions supporting the conclusion that the 2020 bonds are invalid under Venezuelan law. In its Statement of Interest, the U.S. Government \"affirmed its recognition of, and firm support for, the 2015 National Assembly of Venezuela as the government of Venezuela,\" and stated that the \"2015 National Assembly is the only government duly elected by the Venezuelan people.\" Accordingly, the views of the 2015 National Assembly regarding Venezuelan law should be given \"respectful consideration\" by the New York court. In conclusion, the U.S. Government stated: For the foregoing reasons, the United States respectfully (1) advises the Court of its recognition of and support for the 2015 National Assembly as the government of Venezuela; (2) urges the Court to accord respectful consideration to the Republic’s views as required by Animal Science Products; and (3) takes no position on the legal issues in the parties’ pending cross-motions for summary judgment. A copy of the Statement of Interest can be found here. This release contains \"forward-looking statements\" within the meaning of applicable U.S. federal securities laws and \"forward-looking information\" within the meaning of applicable Canadian provincial and territorial securities laws and state Gold Reserve’s and its management’s intentions, hopes, beliefs, expectations or predictions for the future. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable by management at this time, are inherently subject to significant business, economic and competitive uncertainties and contingencies. They are frequently characterized by words such as \"anticipates\", \"plan\", \"continue\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"may\", \"will\", \"potential\", \"proposed\", \"positioned\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. Forward-looking statements contained in this press release include, but are not limited to, statements relating to any bid submitted by the Company for the purchase of the PDVH shares (the \"Bid\").\n\nWe caution that such forward-looking statements involve known and unknown risks, uncertainties and other risks that may cause the actual events, outcomes or results of Gold Reserve to be materially different from our estimated outcomes, results, performance, or achievements expressed or implied by those forward-looking statements, including but not limited to: the discretion of the Special Master to consider the Bid, to enter into any discussions or negotiation with respect thereto; the Special Master may not recommend the Bid in the Final Recommendation; an objection to the Bid may be upheld by the Court; the Bid will not be approved by the Court as the \"Final Recommend Bid\" under the Bidding Procedures, and if approved by the Court may not close, including as a result of not obtaining necessary regulatory approvals, including but not limited to any necessary approvals from the U.S. Office of Foreign Asset Control (\"OFAC\"), the U.S. Committee on Foreign Investment in the United States, the U.S. Federal Trade Commission or the TSX Venture Exchange; failure of the Company or any other party to obtain sufficient equity and/or debt financing or any required shareholders approvals for, or satisfy other conditions to effect, any transaction resulting from the Bid; that the Company may forfeit any cash amount deposit made due to failing to complete the Bid or otherwise; that the making of the Bid or any transaction resulting therefrom may involve unexpected costs, liabilities or delays; that, prior to or as a result of the completion of any transaction contemplated by the Bid, the business of the Company may experience significant disruptions due to transaction related uncertainty, industry conditions, tariff wars or other factors; the ability to enforce the writ of attachment granted to the Company; the timing set for various reports and/or other matters with respect to the Sale Process may not be met; the ability of the Company to otherwise participate in the Sale Process (and related costs associated therewith); the amount, if any, of proceeds associated with the Sale Process; the competing claims of other creditors of Venezuela, PDVSA and the Company, including any interest on such creditors’ judgements and any priority afforded thereto; uncertainties with respect to possible settlements between Venezuela and other creditors and the impact of any such settlements on the amount of funds that may be available under the Sale Process; and the proceeds from the Sale Process may not be sufficient to satisfy the amounts outstanding under the Company’s September 2014 arbitral award and/or corresponding November 15, 2015 U.S. judgement in full; and the ramifications of bankruptcy with respect to the Sale Process and/or the Company’s claims, including as a result of the priority of other claims. This list is not exhaustive of the factors that may affect any of the Company’s forward-looking statements. For a more detailed discussion of the risk factors affecting the Company’s business, see the Company’s Management’s Discussion & Analysis for the year ended December 31, 2024 and other reports that have been filed on SEDAR+ and are available under the Company’s profile at www.sedarplus.ca. Investors are cautioned not to put undue reliance on forward-looking statements. All subsequent written and oral forward-looking statements attributable to Gold Reserve or persons acting on its behalf are expressly qualified in their entirety by this notice. Gold Reserve disclaims any intent or obligation to update publicly or otherwise revise any forward-looking statements or the foregoing list of assumptions or factors, whether as a result of new information, future events or otherwise, subject to its disclosure obligations under applicable rules promulgated by applicable Canadian provincial and territorial securities laws. NEITHER THE TSX VENTURE EXCHANGE NOR ITS REGULATION SERVICES PROVIDER (AS THAT TERM IS DEFINED IN POLICIES OF THE TSX VENTURE EXCHANGE) ACCEPTS RESPONSIBILITY FOR THE ADEQUACY OR ACCURACY OF THIS RELEASE. For further information regarding Dalinar Energy, visit: https://www.dalinarenergy.com. For further information regarding Gold Reserve Ltd., visit https://www.goldreserve.bm or contact:",
  "medium": "Article",
  "links": [
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sedarplus.ca&esheet=54315565&newsitemid=20250830285411&lan=en-US&anchor=www.sedarplus.ca&index=2&md5=b2e33b3e5fcb3f996cbcb92dc0d7ebc3",
    "https://www.businesswire.com/news/home/20250830285411/en/",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fstatic1.squarespace.com%2Fstatic%2F678169d94a42245884c4f0f3%2Ft%2F68b26d74704382725381fa40%2F1756523892543%2F393.pdf&esheet=54315565&newsitemid=20250830285411&lan=en-US&anchor=here&index=1&md5=bcff87bd2ba2ad8249bf8d40fa270fc0",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.goldreserve.bm&esheet=54315565&newsitemid=20250830285411&lan=en-US&anchor=https%3A%2F%2Fwww.goldreserve.bm&index=4&md5=989d10dfc90db291b0ea97cb9e9b53df",
    "https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.dalinarenergy.com&esheet=54315565&newsitemid=20250830285411&lan=en-US&anchor=https%3A%2F%2Fwww.dalinarenergy.com&index=3&md5=dddb1c79be34bb2347987331ba1cb015",
    "https://www.businesswire.com"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gold Reserve",
      "weight": 0.07196201
    },
    {
      "name": "Company",
      "weight": 0.07158508
    },
    {
      "name": "Gold Reserve Ltd.",
      "weight": 0.071436025
    },
    {
      "name": "other factors",
      "weight": 0.06900053
    },
    {
      "name": "applicable U.S. federal securities laws",
      "weight": 0.06877683
    },
    {
      "name": "other conditions",
      "weight": 0.06552401
    },
    {
      "name": "other risks",
      "weight": 0.06496956
    },
    {
      "name": "other creditors",
      "weight": 0.064902104
    },
    {
      "name": "other reports",
      "weight": 0.06395674
    },
    {
      "name": "other claims",
      "weight": 0.06345962
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.97705078125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.74365234375
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.732421875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.64013671875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.63916015625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.52197265625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.357177734375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.331787109375
    }
  ],
  "sentiment": {
    "positive": 0.17003968,
    "negative": 0.17605948,
    "neutral": 0.6539008
  },
  "summary": "Gold Reserve Ltd. (TSX.V: GRZ) (BSX:GRZ.BH) (OTCQX: GDRZF) announces that the US Government has filed a Statement of Interest supporting the Venezuelan Opposition Government in a pending New York federal court litigation regarding the validity of the 2020 PDVSA bonds. The key question is whether the 2020 bonds are invalid under Venezuelan law and if so, the consequences of this invalidity. The U.S. Government has stated that it supports the 2015 National Assembly of Venezuela as the government of Venezuela and urges the court to give respect to the Republic's views on Venezuelan law. This release includes \"forward-looking statements\" within the meaning of applicable U.N. federal securities laws and \"forward information\" within Canadian provincial and territorial securities laws. However, these statements are subject to significant business, economic and competitive uncertainties and contingencies. The company cautions that these forward-looking information may not be considered considered considered reasonable by management at this time and may not accurately address any legal issues in the parties’ pending cross-motions for summary judgment.",
  "shortSummary": "Gold Reserve Ltd. provides an update on U.S. Government's Statement of Interest regarding the 2020 PDVSA bonds validity, amid potential regulatory delays and market disruptions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "56ee1d490b8d4d8994713474f51b19a1",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Gold Reserve Ltd. announced that the U.S. Government filed a Statement of Interest in a New York court case over the validity of 2020 PDVSA bonds, recognizing the 2015 National Assembly as Venezuela’s legitimate government. The statement urges the court to consider the Assembly’s view that the bonds are invalid under Venezuelan law. Gold Reserve also highlighted potential risks and uncertainties surrounding its bid for PDVH shares and the sale process, noting regulatory, financing, and legal challenges.",
  "argos_id": "F6BVENZZR"
}