{
  "url": "https://www.reuters.com/legal/government/most-trump-tariffs-are-not-legal-us-appeals-court-rules-2025-08-29/",
  "authorsByline": "Dietrich Knauth",
  "articleId": "7800b6374daf4628b0cd1a8149eaf2ca",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/2J6OWOGHUJMGHBIWOA76MU5FDY.jpg?auth=579cf860cbc9c2272ee2e02d183c466d5ac8500863fc8cdd7cf945eed08afd56&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T21:35:46.401000+00:00",
  "addDate": "2025-08-29T21:49:52.833578+00:00",
  "refreshDate": "2025-08-29T21:49:52.833580+00:00",
  "score": 1.0,
  "title": "Most Trump tariffs are not legal, US appeals court rules",
  "description": "A U.S. appeals court ruled on Friday that most of Donald Trump's tariffs are illegal, undercutting the Republican president's use of the levies as a key international economic policy tool.",
  "content": "NEW YORK, Aug 29  (Reuters) - A U.S. appeals court ruled on Friday that most of Donald Trump's tariffs are illegal, undercutting the Republican president's use of the levies as a key international economic policy tool.\n\nTrump has made tariffs a pillar of U.S. foreign policy in his second term, using them to exert political pressure and renegotiate trade deals with countries that export goods to the U.S.\n\nThe tariffs have given the Trump administration leverage to extract economic concessions from trading partners but have also increased volatility in financial markets.\n\nThe decision from the U.S. Court of Appeals for the Federal Circuit in Washington, D.C., addressed the legality of what Trump calls \"reciprocal\" tariffs imposed as part of his trade war in April, as well as a separate set of tariffs imposed in February against China, Canada and Mexico.\n\nThe court's decision does not impact tariffs issued under other legal authority, such as Trump's tariffs on steel and aluminum imports.\n\nThe case is widely is expected to be appealed to the U.S. Supreme Court.\n\nTrump justified both sets of tariffs - as well as more recent tariffs - under the International Emergency Economic Powers Act. IEEPA gives the president the power to address \"unusual and extraordinary\" threats during national emergencies.\n\nThe 1977 law had historically been used for sanctioning enemies or freezing their assets. Trump, the first president to use IEEPA to impose tariffs, says the measures were justified given trade imbalances, declining U.S. manufacturing power and the cross-border flow of drugs.\n\nThe law does not mention tariffs, although it allows the president to take a wide range of actions in response to a crisis. Trump's Department of Justice has argued that the law allows tariffs under emergency provisions that authorize a president to \"regulate\" imports or block them completely.\n\nTrump declared a national emergency in April over the fact that the U.S. imports more than it exports, as the nation has done for decades. Trump said the persistent trade deficit was undermining U.S. manufacturing capability and military readiness. Trump said the February tariffs against China, Canada and Mexico were appropriate because those countries were not doing enough to stop illegal fentanyl from crossing U.S. borders, a claim the countries have denied.\n\nThe appeals court ruled on two cases, one brought by five small U.S. businesses and the other by 12 Democratic-led U.S. states, which argued that IEEPA does not authorize tariffs.\n\nThe Constitution grants Congress, not the president, the authority to issue taxes and tariffs, and any delegation of that authority must be both explicit and limited, according to the lawsuits.\n\nThe New York-based U.S. Court of International Trade ruled against Trump's tariff policies on May 28, saying the president had exceeded his authority when he imposed both sets of challenged tariffs. The three-judge panel included a judge who was appointed by Trump in his first term.\n\nAnother court in Washington, D.C., ruled that IEEPA does not authorize Trump's tariffs, and the government has appealed that decision as well. At least eight lawsuits have challenged Trump's tariff policies, including one filed by the state of California.",
  "medium": "Article",
  "links": [
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Most Trump tariffs",
      "weight": 0.122118875
    },
    {
      "name": "tariffs",
      "weight": 0.10653525
    },
    {
      "name": "challenged tariffs",
      "weight": 0.10546945
    },
    {
      "name": "U.S. foreign policy",
      "weight": 0.09778179
    },
    {
      "name": "U.S. manufacturing capability",
      "weight": 0.09359166
    },
    {
      "name": "declining U.S. manufacturing power",
      "weight": 0.09325778
    },
    {
      "name": "U.S. borders",
      "weight": 0.09308731
    },
    {
      "name": "U.S.",
      "weight": 0.09292105
    },
    {
      "name": "Trump",
      "weight": 0.08932563
    },
    {
      "name": "Trumps tariff policies",
      "weight": 0.0766112
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97705078125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9208984375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.8896484375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.62744140625
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.533203125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.53125
    }
  ],
  "sentiment": {
    "positive": 0.07250496,
    "negative": 0.6680467,
    "neutral": 0.25944826
  },
  "summary": "A U.S. appeals court has ruled that most of Donald Trump's tariffs are illegal, undermining his use of these levies as a key international economic policy tool. The court's decision does not affect tariffs issued under other legal authority, such as Trump's steel and aluminum imports. The case is expected to be appealed to the U.N. Supreme Court. The ruling comes as tariffs have been a key tool for the Trump administration, giving them leverage to extract economic concessions from trading partners. The International Emergency Economic Powers Act allows the president to address \"unusual and extraordinary\" threats during national emergencies.",
  "shortSummary": "A US appeals court ruled most of Donald Trump's tariffs are illegal, undercutting his use of the controversial levies as a key foreign policy tool.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "227beb83d07f4f1bba04d98ecb73359e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "A U.S. appeals court ruled that most of President Trump’s tariffs are illegal, undermining his use of tariffs as a foreign‑policy tool. The decision, based on the International Emergency Economic Powers Act, found the president lacked authority to impose these tariffs, though some tariffs under other legal authority remain unaffected. The ruling is expected to be appealed to the Supreme Court, highlighting constitutional limits on executive tariff power.",
  "argos_id": "FWEAQ0TH4"
}