{
  "url": "https://www.seattletimes.com/business/california-lawmakers-reach-deal-with-uber-lyft-that-would-allow-drivers-to-unionize/",
  "authorsByline": "TRÂN NGUYỄN, Jaimie Ding",
  "articleId": "d3b23af6b0e74056858ef404e1f47b07",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/urnpublicidap.org74ea0034d3b1d7211e4a0fbc43e98ebfCalifornia_Rideshare_Drivers_72101.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T14:37:09-07:00",
  "addDate": "2025-08-29T21:58:14.885462+00:00",
  "refreshDate": "2025-08-29T21:58:14.885466+00:00",
  "score": 1.0,
  "title": "California lawmakers reach deal with Uber, Lyft that would allow drivers to unionize",
  "description": "California Gov. Gavin Newsom and state lawmakers have struck a deal with rideshare companies Uber and Lyft on a bill that would allow drivers to join a union and bargain collectively for better wages and benefits.",
  "content": "SACRAMENTO, Calif. (AP) — California Gov. Gavin Newsom and state lawmakers have struck a deal with rideshare companies Uber and Lyft to allow drivers to join a union and bargain collectively for better wages and benefits.\n\nThe agreement includes a bill for collective bargaining backed by the Service Employees International Union along with a measure sponsored by Uber and Lyft that would significantly reduce the companies’ insurance requirements for accidents caused by underinsured drivers, would ultimately reduce costs for passengers.\n\n“Labor and industry sat down together, worked through their differences, and found common ground that will empower hundreds of thousands of drivers while making rideshare more affordable for millions of Californians,” Newsom said in a press release.\n\nThe legislative package represents a significant compromise in the yearslong battle between labor unions and tech companies.\n\nLast July, the California Supreme Court ruled that app-based ride-hailing and delivery services like Uber and Lyft can continue treating their drivers as independent contractors not entitled to benefits like overtime pay, paid sick leave and unemployment insurance. It upheld a voter-approved ballot measure passed in 2020 that reversed a 2019 law mandating that Uber and Lyft provide drivers with benefits.\n\nThe collective bargaining bill would allow the more than 800,000 rideshare workers in California to join a union while still being classified as independent contractors. Currently, independent contracters are excluded from the National Labor Relations Act, a federal law that grants workers collective bargaining rights and protections.\n\nDavid Green, president of SEIU Local 721, called it the “largest expansion of private sector collective bargaining in California history.”\n\nWith the endorsement from Newsom and legislative leaders, it will likely become law, but it still has to be passed in the Senate and the Assembly in the next two weeks before being signed by the governor to be enacted.\n\nSome of the issues that rideshare drivers say they face include being “deactivated” from the app without an explanation or fair appeals process if a passenger complains.\n\nMargarita Penazola, a driver and member of the California Gig Workers Union advocacy group, said this happened to her a few years ago, resulting in three days of lost income. She believes the ability to unionize would give drivers a voice to address these issues.\n\n“It means being able to speak up and protect ourselves and our passengers without fear,” Penazola said. “We’re the ones out there every day. We’re the ones that know what’s really happening on the ground, and we should be a part of the decisions that impact our jobs and the people we are trusted to drive safely.”\n\nAnother driver, Mike Robinson, said he saw his pay go from $700 per week driving 40 hours per week when he first started in 2015, to $500 per week today, before expenses like gas and maintenance. When he was diagnosed with cancer in 2023, he couldn’t work and did not have health insurance, he said.\n\n“We need to be able to bargain for fair pay, basic protections and real benefits,” Robinson said.\n\nCalifornia would be the second state where drivers would be able to unionize after Massachusetts voters passed a ballot referendum last November allowing drivers to do the same. Uber and Lyft initially opposed the bill.\n\n“We’re encouraged to see these two bills advancing in tandem,” Ramona Prieto, Uber’s head of public policy for California, said in a press release. “Together, they represent a compromise that lowers costs for riders while creating stronger voices for drivers.”\n\nUber and Lyft fares in California are consistently higher than in other parts of the U.S. because of insurance requirements, according to the companies. Uber has said that nearly one-third of every ride fare in the state goes toward paying for state-mandated insurance.\n\nThe insurance bill would reduce the coverage requirement for accidents caused by uninsured or under-insured drivers from $1 million to $60,000 per individual and $300,000 per accident.\n\nNick Johnson, director of public policy at Lyft, said it will bring “runaway insurance costs under control” and help “maintain the affordability of rideshare.”",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "rideshare drivers",
      "weight": 0.09178972
    },
    {
      "name": "drivers",
      "weight": 0.08287352
    },
    {
      "name": "underinsured drivers",
      "weight": 0.08213849
    },
    {
      "name": "California Gov. Gavin Newsom",
      "weight": 0.07456271
    },
    {
      "name": "California lawmakers",
      "weight": 0.07396971
    },
    {
      "name": "California Gig Workers Union",
      "weight": 0.07195422
    },
    {
      "name": "California history",
      "weight": 0.07182991
    },
    {
      "name": "California",
      "weight": 0.0709747
    },
    {
      "name": "runaway insurance costs",
      "weight": 0.066910125
    },
    {
      "name": "Uber",
      "weight": 0.0666442
    }
  ],
  "topics": [
    {
      "name": "Ridesharing"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.92236328125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.80322265625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.53857421875
    },
    {
      "name": "/Law & Government/Legal/Labor & Employment Law",
      "score": 0.53369140625
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.49560546875
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.39453125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.346923828125
    }
  ],
  "sentiment": {
    "positive": 0.083346166,
    "negative": 0.6616786,
    "neutral": 0.2549753
  },
  "summary": "California Gov. Gavin Newsom and state lawmakers have reached a deal with rideshare companies Uber and Lyft to allow drivers to join a union and bargain for better wages and benefits. The agreement includes a bill for collective bargaining backed by the Service Employees International Union, and a measure sponsored by Uber that would significantly reduce the companies’ insurance requirements for accidents caused by underinsured drivers. This move is seen as a significant compromise in a yearslong battle between labor unions and tech companies. The collective bargaining bill would allow the more than 800,000 rideshare workers in California to join unions while still being classified as independent contractors. The bill still requires to pass in the Senate and Assembly before being signed by the governor to be enacted.",
  "shortSummary": "California lawmakers and Uber have agreed on a deal allowing drivers to unionize and reducing insurance costs for underinsured drivers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f96ee1701ff34ca6861f24e4a5015051",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "California Gov. Gavin Newsom and lawmakers have reached a deal with Uber and Lyft that lets rideshare drivers form unions while remaining independent contractors, potentially improving wages and benefits for the 800,000 California drivers. The agreement also cuts insurance requirements for underinsured drivers—from $1 million to $60,000 per person and $300,000 per accident—aiming to lower passenger fares. The legislation, backed by the Service Employees International Union, is poised to become law after Senate and Assembly approval within the next two weeks.",
  "argos_id": "H9FYI18M3"
}