{
  "url": "https://www.pymnts.com/real-estate/2025/armd-and-dangerous-how-adjustable-rate-mortgages-are-bleeding-millions-of-americans-dry/",
  "authorsByline": "PYMNTS",
  "articleId": "210618dac06b4047b5d002ea4946fa13",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/Adjustable-Rate-Mortgages-ARMs-real-estate.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T08:00:55+00:00",
  "addDate": "2025-08-05T08:09:14.022411+00:00",
  "refreshDate": "2025-08-05T08:09:14.022413+00:00",
  "score": 1.0,
  "title": "ARM’d and Dangerous: How Adjustable Rate Mortgages Are Bleeding Millions of Americans Dry",
  "description": "For millions of Americans, the biggest threat to their personal finances and spending routines isn’t tariffs. It’s their mortgages. Many homebuyers jumped",
  "content": "Younger homeowners and those with less financial cushion are most at risk — and many are already scaling back household spending.\n\nFor millions of Americans, the biggest threat to their personal finances and spending routines isn’t tariffs. It’s their mortgages.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nMany homebuyers jumped at the chance to take out an adjustable rate mortgage (ARM) when interest rates began spiking in early 2022.\n\nARMs are attractive when rates rise because they start with a lower “teaser” rate that varies periodically after the first three to 10 years, with subsequent adjustments reflecting current market conditions. Buyers can land a bargain on their initial rate or trade up to a bit more house than they could afford with a traditional fixed mortgage. The median borrowing amount for ARMs is more than $40,000 larger compared to regular mortgages, data from the St. Louis branch of the Federal Reserve shows.\n\nSome homeowners with 30-year ARMs thought they were getting a discount on the American dream.\n\nIt’s not turning out that way.\n\nARM adjustments can be upward or downward, depending on the market, and with interest rates still high, many homeowners now owe meaningfully more in monthly payments for their houses, condos or apartments. The resets are slicing into homeowners’ personal balance sheets just as the Trump administration’s global tariffs start to seep into consumer prices, prompting more ARM holders to turn to buy now, pay later and other alternative budgeting tools to manage their monthly expenses. Mortgage payments typically eat up around 30% of a household’s income, the St. Louis Fed branch says. The more spent on your home, the less for essential and discretionary purchases.\n\nIt all means that the price tag of the American dream now comes with fine print: Home ownership can push you into spending all your monthly income as soon as it comes in the door. Consumers can find themselves in that paycheck-to-paycheck reality either by necessity — they don’t earn enough income for non-essential purchases — or by choice — they have good income and meet their monthly basic but opt to spend what’s left over on nice-to-haves. Either way, ARM resets make the affordability of daily life more difficult.\n\nA recent PYMNTS Intelligence report found that nearly four in 10 ARM holders have recently delayed or canceled a major purchase, versus 31% of fixed rate mortgage holders. Some 42% have cut back on non-essential spending, more than 37% of fixed-rate holders. Nearly one in two (46%) are using credit cards to cover basic purchases, versus 40% of those with fixed-rate loans. The signal: ARMs can put consumers in a slow-motion financial squeeze — and it’s starting to tighten.\n\nHomebuyers who take out ARMs are betting that higher, fixed rates on traditional 30-year mortgages are a temporary blip, that lower rates on those mainstay loans will last, or that that they’ll sell their house before the first adjustment sets in. For the first two scenarios, the wager is that when an ARM’s initial rate resets, the broader market will either have rebalanced to lower rates or have consistently been there. That’s not happening.\n\nTake a five-year ARM, the most common type of adjustable mortgage, with a rate of 2.91% in August 2020. It’s now adjusting according to the index it’s tied to, the most common being the secured overnight financing rate, or SOFR. That index’s rate is now 4.39%. A homeowner with a $400,000 mortgage will see their monthly payment rise this month to $2,001 from $1,667, a $334 increase, according to Zillow’s mortgage calculator. The figures don’t include property taxes or insurance.\n\nSome people with 3/1 ARMs are faring worse. Historical data on those mortgages is scarce — Freddie Mac and the Fed stopped tracking 3/1 rates in 2022 due to insufficient data from lenders — but the loans typically have rates below those of 5/1 ARMs.\n\nAssume our same homeowner as above took out a 3/1 ARM at 2.5% in January 2022. That seemed smart at the time — it was on the eve of the Fed’s first of 11 consecutive interest rates hikes in March, intended to combat the steepest inflation in four decades following a flood of post-COVID money into the economy. But last January, the loan adjusted to 4.32%. The homeowner’s monthly payments shot up to $1,984 from $1,580, over $400 more. The average rate on a 30-year fixed rate mortgage was 6.72% as of end-July, making refinancing an ARM expensive. The industry likes to say, “marry the house, date the rate,” but the honeymoon for now is over.\n\nWorse may be yet to come. ARMs come with rate increase “caps” — a typical 5/1 limits the first rate adjustment to five percentage points above the initial rate, later adjustments to two percentage points above the previous rate, and a lifetime cap of 5% on the initial rate.\n\nBut the sticker shock over time can be severe. For example, a $400,000 mortgage at 3% is $1,686 a month, not including insurance and taxes, mortgagecalculator.org shows. At the lifetime cap of 8%, it’s $2,935 — over $1,200 more. The real inflation threat may not be in groceries or gas — it’s in mortgages that haven’t adjusted yet.\n\nBy November 2022, as the Fed continued to raise rates following its first increase in March, 12% of all mortgages were ARMs, compared to just over 3% a year prior, data from the Washington, D.C.-based think tank Urban Institute shows.\n\nBy one estimate, the ARMs race has since pulled back, and the mortgages now account for just over 8% of all residential loans applications, equal to one in 12 borrowers. Data on ARMs is notoriously variable; if there are now just over 51 million residential mortgages of all types outstanding, according to U.S. federal housing agency data, perhaps four million American have ARMs.\n\nThe Urban Institute says today’s ARMs are nothing like those pre-dating the 2007-08 financial crisis and that they helped open homeownership to more people amid booming property prices. In June 2022, the rate on a fixed 30-year home loan spiked to an average 5.81%, topping out at 7.79% by November 2023, Freddie Mac shows a 5/1 ARM in November 2023 hovered around a more affordable 7%. ARMs are popular with younger, higher-income households that can more easily absorb a rate increase, the St. Louis Fed branch says. But that doesn’t necessarily mean a homeowner’s spending patterns can stay the same.\n\nPYMNTS Intelligence data shows that living paycheck to paycheck is not just the purview of lower-income consumers. It also encompasses millions of middle- and upper-income Americans.\n\nIf ARMS were initially a financial life raft that allows homebuyers to get in on the American dream for less, that raft now looks less sea-worthy.\n\nRelief isn’t in sight any time soon. Fed Chair Jerome Powell, whom President Donald Trump is pressuring to cut interest rates, said on Wednesday (July 30) that tariffs “have begun to show through more clearly to prices of some goods, but their overall effects on economic activity and inflation remain to be seen.” Inflation — and its impact on rates — could be “short-lived” or its effects “more persistent,” he added — meaning that ARM holders might not find joy the next time their mortgages adjust.\n\nPocketbook pressure is coming from other sides as well.\n\nThe Trump administration restarted collections on student loans in May; defaults on the loans could slash consumer spending by $63 billion by dinging credit scores, closing off access to new credit and reducing disposable income through wage garnishments, Bloomberg reported.\n\nMeanwhile, the consumer price increases many economists have been looking out for after companies stockpiled goods in anticipation of tariffs are starting to show up. Consumer goods giant Procter & Gamble, the maker of products like Tide detergent and Pampers, said July 29 it would raise prices “in the single digits” on a quarter of its goods. Nearly half of U.S. consumers expect price increases to be double the rate of inflation, currently 2.7% — a sentiment that economists know can become self-fulfilling.\n\nTo find extra cash, Americans are pulling money out of their 401(k)s in record numbers, investment giant Vanguard said in June, with 4.8% taking a hardship distribution to plug financial emergencies last year, more than double the rate during the pandemic. But non-hardship withdrawals have also risen to 4.5% of account holders, up from 4% last year and during the height of the pandemic in 2021.\n\nThe Adjustable Rate Reckoning: How Home Ownership is Pushing Millions Paycheck to Paycheck\n\nRising Mortgage Costs Push Affluent Families to the Financial Edge\n\nConsumers Say They Want Budgeting But Aren’t Using Them",
  "medium": "Article",
  "links": [
    "https://www.stlouisfed.org/on-the-economy/2024/feb/which-households-prefer-arms-fixed-rate-mortgages#:~:text=ARMs%20tend%20to%20have%20lower,scope%20of%20this%20blog%20post.",
    "https://magazine.northeast.aaa.com/daily/money/mortgages/marry-the-house-date-the-rate-a-good-homebuying-strategy/#:~:text=Your%20initial%20rate%20may%20be,expert%20mortgage%20help%20with%20AAA.",
    "https://www.pymnts.com/consumer-finance/2025/student-loan-defaults-could-reduce-consumer-spending-by-63-billion/",
    "https://myhome.freddiemac.com/blog/homebuying/considering-adjustable-rate-mortgage-heres-what-you-should-know#:~:text=Let's%20look%20at%20an%20example,(the%20%E2%80%9C1%E2%80%9D).",
    "https://www.bls.gov/cpi/",
    "https://us.pg.com/",
    "https://investor.vanguard.com/corporate-portal",
    "https://fred.stlouisfed.org/graph/?g=WaJj",
    "https://www.newyorkfed.org/markets/reference-rates/sofr#:~:text=The%20Secured%20Overnight%20Financing%20Rate,of%20transactions%20considered%20%E2%80%9Cspecials%E2%80%9D.",
    "https://nationalmortgageprofessional.com/news/mortgage-applications-hit-two-month-low-amid-market-uncertainty",
    "https://www.stlouisfed.org/on-the-economy/2024/feb/which-households-prefer-arms-fixed-rate-mortgages#:~:text=Mortgage%20payments%20account%20for%20about%2030%25%20of%20household%20income",
    "https://www.pymnts.com/consumer-finance/2025/rising-mortgage-costs-push-affluent-families-to-the-financial-edge/",
    "https://www.pymnts.com/study_posts/the-adjustable-rate-reckoning-how-homeownership-is-pushing-millions-paycheck-to-paycheck/",
    "https://www.pgpf.org/article/what-is-inflation-and-why-does-it-matter/",
    "https://www.federalreserve.gov/mediacenter/files/FOMCpresconf20250730.pdf",
    "https://www.federalreservehistory.org/people/jerome-h-powell",
    "https://corporate.vanguard.com/content/dam/corp/research/pdf/how_america_saves_report_2025.pdf",
    "https://www.freddiemac.com/pmms",
    "https://www.pymnts.com/study_posts/consumers-say-they-want-budgeting-tools-but-arent-using-them/",
    "https://www.pymnts.com/news/retail/2025/shoppers-want-honest-answers-on-rising-prices/",
    "https://www.urban.org/",
    "https://www.stlouisfed.org/on-the-economy/2024/feb/which-households-prefer-arms-fixed-rate-mortgages#:~:text=ARMs%20Appear%20to,lower%20introductory%20rates.",
    "https://www.freddiemac.com/research/insight/20221103-freddie-macs-newly-enhanced-mortgage-rate-survey#:~:text=We%20will%20no%20longer%20report,if%20they%20paid%20no%20points.",
    "https://loanpronto.com/blog/mortgage-rates-today-nov-10-2023-rates-are-near-60-day-lows/",
    "https://myhome.freddiemac.com/blog/homebuying/considering-adjustable-rate-mortgage-heres-what-you-should-know",
    "https://www.fhfa.gov/data/dashboard/nmdb-outstanding-residential-mortgage-statistics",
    "https://www.urban.org/urban-wire/should-borrowers-be-afraid-adjustable-rate-mortgages",
    "https://www.pymnts.com/earnings/2025/pg-plans-price-hikes-as-shoppers-grow-more-careful/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Adjustable Rate Mortgages",
      "weight": 0.09509419
    },
    {
      "name": "fixed rate mortgage holders",
      "weight": 0.094508804
    },
    {
      "name": "interest rates",
      "weight": 0.084583424
    },
    {
      "name": "lower rates",
      "weight": 0.08397924
    },
    {
      "name": "rates",
      "weight": 0.08324721
    },
    {
      "name": "Mortgage payments",
      "weight": 0.06849923
    },
    {
      "name": "adjustable mortgage",
      "weight": 0.06750874
    },
    {
      "name": "more ARM holders",
      "weight": 0.0668383
    },
    {
      "name": "Rising Mortgage Costs",
      "weight": 0.06655786
    },
    {
      "name": "mortgages",
      "weight": 0.064916916
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.8212890625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.72607421875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.662109375
    }
  ],
  "sentiment": {
    "positive": 0.10583496,
    "negative": 0.45874023,
    "neutral": 0.43579102
  },
  "summary": "The biggest threat to personal finances and spending routines is the mortgage, according to a report by PYMNTS Intelligence. The report suggests that millions of Americans are at risk from their mortgages, particularly younger and less financially stable, younger homeowners and those with less financial cushion. Many homebuyers have already begun reducing household spending due to low interest rates. The study also reveals that nearly four in 10 ARM holders have recently delayed or canceled major purchases, while nearly one in two are using credit cards for basic purchases, compared to 40% of those with fixed-rate loans. Homeowners with 30-year ARMs thought they were getting a discount on the American dream, but this has not been so successful. The most common type of adjustable mortgage (ARM) is now adjusting according to the index it's tied to, the most common being the secured overnight financing rate, or SOFR, which is now 4.39%.",
  "shortSummary": "ArMs, commonly known as adjustable mortgage rates, are significantly reducing homeowners' personal finances and spending, especially among younger homeowners who are more likely to cut back on household spending.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d6fbfa8a98c74421b39f45f01a1dee99",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://us.pg.com/",
      "text": "© 2025 Procter & Gamble\n8/30/2025\nP&G Releases 2025 Annual Report\nP&G’s 2025 Annual Report highlights P&G’s integrated growth strategy.\nRead more\n8/26/2025\nP&G Latin America: How Consumer Insights Shape Everyday Essentials\nDiscover how P&G uses real-life insights to innovate products for everyday needs across Latin America and beyond.\n8/23/2025\nWorld Water Week: Contributing to a Water Positive Future\nOur comprehensive strategy is focused on reducing water in our operations.\n8/15/2025\nMentorship Fuels Growth, Belonging and Longevity at P&G\nAt P&G, mentors are more than helpful resources — they are powerful forces behind a thriving, inclusive culture that grows talent from within.\nOur brands\nCareers at P&G\nInvestor Relations"
    },
    {
      "url": "https://www.federalreservehistory.org/people/jerome-h-powell",
      "text": "Jerome H. Powell\n- Chair, Board of Governors, 2018 –\n- Governor, Board of Governors, 2012 – 2018\nJerome H. Powell first took office as Chair of the Board of Governors of the Federal Reserve System on February 5, 2018, for a four-year term. He was reappointed to the office and sworn in for a second four-year term on May 23, 2022. Mr. Powell also serves as Chairman of the Federal Open Market Committee, the System's principal monetary policymaking body. Mr. Powell has served as a member of the Board of Governors since taking office on May 25, 2012, to fill an unexpired term. He was reappointed to the Board and sworn in on June 16, 2014, for a term ending January 31, 2028.\nPrior to his appointment to the Board, Mr. Powell was a visiting scholar at the Bipartisan Policy Center in Washington, D.C., where he focused on federal and state fiscal issues. From 1997 through 2005, Mr. Powell was a partner at The Carlyle Group.\nMr. Powell served as an Assistant Secretary and as Under Secretary of the U.S. Department of the Treasury under President George H.W. Bush, with responsibility for policy on financial institutions, the Treasury debt market, and related areas. Prior to joining the Bush administration, Mr. Powell worked as a lawyer and investment banker in New York City.\nIn addition to service on corporate boards, he has served on the boards of charitable and educational institutions, including the Bendheim Center for Finance at Princeton University and the Nature Conservancy of Washington, D.C., and Maryland.\nMr. Powell was born in February 1953 in Washington, D.C. He received an AB in politics from Princeton University in 1975 and earned a law degree from Georgetown University in 1979. While at Georgetown, he was editor-in-chief of the Georgetown Law Journal.\nWritten by the Board of Governors of the Federal Reserve System and updated March 3, 2025. See disclaimer and update policy."
    },
    {
      "url": "https://www.pymnts.com/consumer-finance/2025/student-loan-defaults-could-reduce-consumer-spending-by-63-billion/",
      "text": "Rising student loan defaults could reduce consumer spending by as much as $63 billion a year, according to Bloomberg Economics.\nAfter five years of there being no “involuntary collections” on defaulted loans, the U.S. Department of Education is set to restart collections and return the student loan system to where it was before the pandemic, Bloomberg reported Friday (May 2).\nThis will mark the first time some younger student loan borrowers have been required to make payments, and it will end some other student loan borrowers’ hopes that the debt would be forgiven, according to the report.\nPayments were paused in March 2020, and delinquent borrowers were not reported to credit agencies until October, per the report.\nBeth Akers, an economist at the American Enterprise Institute, said in the report of the borrowers: “They’re facing this jarring news — that their loans, which had no consequences tied to them for five years, suddenly have very big consequences.”\nThe Department of Education announced April 21 that its Office of Federal Student Aid (FSA) will resume federal student loan collections on Monday (May 5).\nThe department said in a press release that 42.7 million borrowers owe more than $1.6 trillion in student debt, more than five million have not made a monthly payment in over 360 days and sit in default, and four million are in late-stage delinquency of 91-180 days.\nIn a few months, almost 10 million borrowers — making up almost 25% of the federal student loan portfolio — could be in default, the release said.\nCurrently, only 38% of borrowers are in repayment and current on their student loans, per the release.\n“The Biden Administration misled borrowers: the executive branch does not have the constitutional authority to wipe away debt, nor do the loan balances simply disappear,” Secretary of Education Linda McMahon said in the release. “Hundreds of billions have already been transferred to taxpayers. Going forward, the Department of Education, in conjunction with the Department of Treasury, will shepherd the student loan program responsibly and according to the law, which means helping borrowers return to repayment — both for the sake of their own financial health and our nation’s economic outlook.”"
    },
    {
      "url": "https://www.urban.org/urban-wire/should-borrowers-be-afraid-adjustable-rate-mortgages",
      "text": "As mortgage interest rates rise, adjustable-rate mortgages (ARMs) become more popular, and they now make up 12.0 percent of total production, up from 3.3 percent in November 2021.\nThis development has alarmed many housing market observers who, informed by their experiences with subprime mortgages from 2005 to 2008, worry ARMs are risky and that future mortgage payments could become unsustainable for borrowers as rates rise.\nAre they right to be concerned? Not according to the research, which shows today’s ARMs are no riskier than other mortgage products and that their lower monthly payments could increase access to homeownership for more potential buyers.\nWhat a borrower should know about ARMs\nARMs predate the last housing bubble. Among mortgages originated from 1995 to 2004, the average ARM share was 18.3 percent. What is atypical is the very low ARM share, by historical standards, from 2010 to 2021, driven in part by ultra-low interest rates during this period.\nBefore 2005, lenders held ARM borrowers to higher lending standards than borrowers who took out fixed-rate mortgages, requiring higher credit scores, higher incomes, and larger down payments to compensate for the higher risk. Borrowers understood how their mortgages worked, and there were no market hiccups.\nCompared with homeownership rates in other developed countries, the US rate is slightly below average. And for most developed countries, ARMs are the go-to mortgage product; only the US and Denmark offer 30-year fixed-rate mortgages.\nARMs generally have interest rates lower than the 30-year fixed-rate product. Mortgage rate attractiveness is measured by the difference between the current mortgage rate and the average 30-year mortgage rate over the preceding three years. When rates are attractive, this difference trends negative; when rates are less attractive, the difference trends positive.\nWhen mortgage rates are attractive, the ARM share is low, because borrowers want to lock in their rates for 30 years. When rates are less attractive, ARMs allow borrowers to save money given the lower rates, and the borrower can refinance if rates drop. Of course, if rates keep rising, ARM monthly payments will rise over time.\nToday’s ARMs are not crisis-era ARMs\nThe risks of ARMs were substantially mitigated by the regulatory reforms put in place after the 2008 bust. Today’s ARMs are not the risky products of 2008 or even the prebubble version. Instead, they are fully amortizing mortgages with initial fixed terms of 5, 7, or 10 years and are subject to an interest rate reset each year thereafter. (ARMs are usually referred to as 5/1, 7/1, and 10/1, depending on the length of the initial reset period.)\nOur calculations of Fannie Mae and Freddie Mac data from 2020 to 2022 indicate 19.5 percent of ARM originations have an initial fixed term of 5 years, 47.8 percent have a fixed term of 7 years, and 32.7 percent have a fixed term of 10 years. These mortgages reset annually after the fixed period ends.\nThis contrasts sharply with the 2005 to 2007 subprime ARMs, which generally had fixed terms of two or three years, and the rate for that initial period was often “teased” down; it also contrasts with the so-called negative amortization product, where the initial payments did not cover the full principal and interest payments on the loan and the loan balance was permitted to grow. It was this layering of risk— where risky products are provided to less-creditworthy borrowers, often without income verification—that set borrowers up for failure.\nIn comparison, the risk profile of today’s ARMs, like that of prebubble ARMs, is stronger than that of fixed-rate mortgages. The most recent data show ARM borrowers have higher FICO scores and lower loan-to-value ratios and are more affluent, as measured by their higher home values and larger loan balances. And borrowers taking out ARMs during this period received mortgage rates 0.58 percent lower, on average, than the fixed 30-year rate.\nCredit Characteristics of New Government-Sponsored Enterprise Borrowers\nARMs versus Fixed-Rate Mortgages\n| FICO | LTV ratio | Loan amount | Home value | Rate | ||\n| June–August 2022 | ARM | 762 | 75 | $354,500 | $498,641 | 4.92 |\n| Fixed | 753 | 80 | $283,333 | $383,199 | 5.50 |\nSource: Urban Institute calculations of eMBS data.\nNotes: ARM = adjustable-rate mortgage. LTV = loan-to-value.\nToday’s ARMs also contrast with the so-called 1/1 and 3/1 ARMs of the late 1990s and early 2000s, for which payments were fixed for an initial period of just one or three years. After the financial crisis, the Consumer Financial Protection Bureau implemented an ability-to-repay rule, essentially requiring that mortgages be fully amortizing and that the lender qualify the borrower at the highest rate they could experience in the first five years. The result: very few ARMs have a reset period shorter than five years.\nFinally, ARMs tend to have caps at the reset. For example, today’s government-sponsored enterprise (GSE) ARMs, 5/1s have a maximum increase at the first reset of 2 percent, and 7/1s and 10/1s have a maximum increase at the first reset of 5 percent. For subsequent resets, the usual adjustment is a maximum of 1 percent. And most ARMs have a 5 percent lifetime cap—the rate cannot increase by more than 5 percent over the life of the loan. The reset caps are more meaningful the longer the initial period.\nShould more borrowers take advantage of ARMs?\nARMs offer considerable interest rate savings, even with today’s inverted yield curve, in which shorter-term rates are higher than longer-term rates. On November 3, the rate on a 30-year fixed-rate mortgage was 6.95 percent and the rate on a 5/1 ARM was 5.95 percent, a 100 basis-point differential. And this is typical: in 2022, the differential has averaged 109 basis points.\nConsider the savings on a $375,000 loan (close to the 2022 GSE average): For a 30-year fixed-rate mortgage at 6.95 percent, the monthly payment is $1,820. For a 5/1 ARM at 5.95 percent, the monthly payment is $1,640—nearly 10 percent less.\nThe ARM saves the borrower $2,160 per year—almost $11,000 over the five-year initial reset period. Even if the borrower doesn’t have an opportunity to refinance and the rate resets up, the borrower’s income would likely be higher after five years, which could help keep payments manageable.\nMany borrowers buy a home anticipating to keep it for fewer than 10 years. For these borrowers, ARMs are highly economical when rates are higher. Even for those planning a longer holding period, an ARM allows for lower payments during the fixed period and preserves the option to refinance. This could help more renters transition to homeownership and access all the financial security and wealth-building benefits it provides.\nARMs are no longer something to fear—in fact, they could help borrowers save money and reduce barriers to homeownership.\nLet’s build a future where everyone, everywhere has the opportunity and power to thrive\nUrban is more determined than ever to partner with changemakers to unlock opportunities that give people across the country a fair shot at reaching their fullest potential. Invest in Urban to power this type of work."
    },
    {
      "url": "https://www.pymnts.com/consumer-finance/2025/rising-mortgage-costs-push-affluent-families-to-the-financial-edge/",
      "text": "For decades, homeownership has stood as the bedrock of the American dream — a symbol of prosperity, stability, and upward mobility. But for millions of U.S. households in 2025, that dream is rapidly transforming into a source of financial fragility.\nData from the latest PYMNTS Intelligence in the July 2025 New Reality Check: The Paycheck-to-Paycheck Report, “The Adjustable-Rate Reckoning: How Homeownership Is Pushing Millions Paycheck to Paycheck,” reveals that a confluence of rising home prices, sticky inflation and the delayed impact of interest rate hikes has turned a growing share of homeowners into paycheck-to-paycheck survivors.\nAt the heart of this reckoning is a significant shift in borrowing behavior. Adjustable-rate mortgages (ARMs), once a niche product with a checkered past, are gaining renewed relevance in a high-rate environment. But as these loans reset, homeowners are grappling with a new financial reality: one where housing, once a source of equity, becomes a destabilizing liability.\nAccording to the PYMNTS Intelligence report, more than 24 million Americans living paycheck to paycheck attribute their precarious financial state to the costs of homeownership — particularly mortgage burdens.\nWhy the American Dream Is Getting More Expensive\nSince March 2022, the Federal Reserve has raised interest rates from near zero to a 23-year high, seeking to tame inflation. While much of the immediate impact was felt in business and capital markets, mortgage borrowers — especially those with ARMs — are now experiencing the lagged effects.\nAccording to PYMNTS Intelligence data, homeowners with ARMs are disproportionately burdened. Nearly 80% of those living paycheck to paycheck have increased credit card usage in recent months to manage rising mortgage payments. These borrowers are also more likely than their fixed-rate counterparts to defer large purchases or cut back on discretionary spending.\nThis behavior isn’t isolated. It signals a broader tightening of consumer liquidity across the middle and upper-middle class, even among households that traditionally maintained financial buffers. The PYMNTS Intelligence report underscores that high income is no longer a reliable proxy for financial stability. In fact, over one-third of ARM borrowers making more than $100,000 annually now report living paycheck to paycheck.\nAfter all, to afford a median-priced home in 2025, a household requires an annual income of $116,986 — up 50% from five years ago. The median home price is now exceeding $416,900, up 100% since the financial crisis.\nThis disconnect between home prices and wage growth — average household income grew just 1.3% between 2020 and 2023 — means that an increasing number of buyers are stretching themselves thin to enter the market. The decision to own is no longer a straightforward investment play.\nRead the report: The Adjustable-Rate Reckoning: How Homeownership Is Pushing Millions Paycheck to Paycheck\nThe most revealing aspect of the study is not the existence of financial hardship, but its demographic breadth. Living paycheck to paycheck is no longer a symptom of low income. It now encompasses millions of middle- and upper-income Americans.\nNotably, among paycheck-to-paycheck consumers with mortgages, 31% say it’s entirely due to homeownership costs, while 36% cite a mix of factors. This bifurcation is critical for banks, retailers and policymakers: a one-size-fits-all solution won’t suffice.\nIn this environment, tools like BNPL are not just convenience products—they are financial infrastructure. Among homeowners with mortgages, 1 in 5 reported using BNPL services in the past six months, more than renters or outright owners. For choice-driven consumers, BNPL is a way to manage cash flow without paying interest. For necessity-driven users, it may be a last resort.\nThe rise of consumer-grade financial engineering poses both opportunities and risks for providers. FinTech lenders and embedded finance platforms are uniquely positioned to serve this demand. However, underwriting quality and default exposure remain concerns as credit usage climbs.\nTraditional banks, meanwhile, are rethinking product strategies. The line between secured and unsecured debt is blurring. Mortgage holders using credit cards or BNPL to cover household costs are indirectly leveraging their homes for cash flow — without the formal structure of a HELOC or refinance."
    },
    {
      "url": "https://www.pymnts.com/study_posts/the-adjustable-rate-reckoning-how-homeownership-is-pushing-millions-paycheck-to-paycheck/",
      "text": "Homeownership has been a cornerstone of the American Dream ever since the New Deal introduced the 30-year mortgage following the Great Depression. What’s new is how that widely held aspiration increasingly comes with strings. Property prices vary wildly by region and zip code, of course, but the toughest housing market in more than a generation means the average home went for $416,900 in the first quarter of this year. This price tag is more than double the amount in early 2009 following the subprime mortgage crisis.\nNeedless to say, the rise in most people’s household incomes hasn’t kept up with real estate’s vertiginous run-up. The steep price tag means that a larger share of a typical homeowner’s income now goes to the mortgage for their house, apartment or condo. Bankrate estimates that the average U.S. homebuyer now needs an annual household income of $116,986 to afford the typical property. This is nearly 50% more than just five years ago. Meanwhile, average household income rose just 1.3% from 2020 to 2023, according to the most recent data from the Federal Reserve’s St. Louis branch. Inflation has also cut into pocketbooks. The latest Bureau of Labor Statistics data shows you need $191 today to buy what $100 bought in January 2025.\nHowever, despite the worsening pocketbook economics, homebuyers are willing to sacrifice their financial safety nets to achieve the American dream. More than two-thirds of U.S. consumers now live paycheck to paycheck, with their monthly income going out the door for basic bills and other expenses as soon as it comes in. Among those, 14% cite the financial strain of buying a home as a key reason for their financial condition. That means more than 24 million consumers live with crimped pocketbooks at least partly as a result of a tradeoff they deliberately made in order to own a home. As owning a new home often comes with a more restrictive financial lifestyle, many consumers choose pay-later credit methods that help make that possible. Nowhere is that more evident than with homeowners paying adjustable-rate mortgages (ARMs).\nThe share of consumers living paycheck to paycheck overall has decreased very slightly from its peak in April and May. But over the last two years, the youngest and highest-income segments have experienced the greatest strain with this financial tightrope. That signals that homebuyers and homeowners across the spectrum are choosing to put a larger share of their income toward owning a home.\nOnly about one-third of consumers living paycheck to paycheck do so solely out of financial necessity.\nPYMNTS Intelligence research finds that among consumers living paycheck to paycheck, 31% do so by choice. That is, these consumers’ financial lifestyles are a result of their voluntary spending decisions. This group is the most likely to cite buying a residence as a key reason. Another 34% of paycheck-to-paycheck consumers attribute their financial lifestyle to necessity—to not making enough money to save or pay for anything beyond monthly bills for necessities and whatever discretionary items they choose. The remaining 35% of paycheck-to-paycheck consumers live that way due to a combination of circumstance and choice.\nThese are just some of the findings explored in “The Adjustable-Rate Reckoning: How Homeownership Is Pushing Millions Paycheck to Paycheck,” the latest installment of“ New Reality Check: The Paycheck-to-Paycheck Report,” a PYMNTS Intelligence exclusive series. This edition examines the financial tradeoffs consumers make and the expense management strategies they use to afford homeownership. It draws on insights from a survey of 2,135 consumers conducted from June 2, 2025, to June 23, 2025\n24.4 Million Consumers Cite Homeownership as a Reason for Living Paycheck to Paycheck\nHomeownership is a key reason for consumers choosing to live paycheck to paycheck. Nearly one in five such consumers cite buying a home that stretched their budget as a key reason they cannot live solely on their savings. These consumers aren’t buying a bigger or fancier house than they can safely afford. Instead, they’re holding mortgages that cut into their income. This share is greater than the 14% of all paycheck-to-paycheck individuals who said the same. It is far higher than the 7.8% of consumers who live this way by necessity, who cited this reason. The upshot is that homeownership is a major factor behind sending consumers into a paycheck-to-paycheck financial lifestyle. It ranks only behind taking time off work, buying a car and starting a business or freelancing as a primary source of income.\nSimilarly, consumers living paycheck to paycheck by choice are more likely than others in this lifestyle to be considering buying a home. Among these, 13% are actively looking to buy. This percentage is nearly three times the share of those living paycheck to paycheck by necessity. Meanwhile, by-necessity consumers are more likely to be considering purchasing a home down the line.\nHomeowners Are More Likely than Other Paycheck-to-Paycheck Individuals to Use BNPL to Manage Expenses\nWith mortgages often accounting for a significant portion of these consumers’ incomes, they are turning to alternative budgeting tools to manage expenses. Many, for instance, are using BNPL to afford large purchases.\nOne in four consumers living paycheck to paycheck by choice report that they used BNPL for larger purchases in the past six months to manage rising living costs. This figure is more than twice the share of those living paycheck to paycheck by necessity. It seems that the widespread perception that shoppers use BNPL, which typically splits purchase payments into three or four monthly installments, out of desperation may be misleading. Many consumers whose budgets are stretched are using the credit method as a deliberate budgeting strategy.\nEven homeowners are leveraging BNPL as a tool to manage rising living costs. One in five homeowners who pay a mortgage report having used BNPL in the past six months. This figure exceeds the share of renters who reported the same. Mortgage payers are the most likely of all paycheck-to-paycheck consumers to use the pay later method, intentionally utilizing BNPL as a flexible budgeting solution.\nBNPL users are utilizing the credit tool in conjunction with other financial strategies to mitigate rising living costs. For instance, 41% of BNPL users have also reduced their nonessential spending in the past six months. Additionally, one in three have delayed or canceled a major purchase such as appliances, furniture or a car. It is evident that consumers are using BNPL as part of a broader, disciplined financial approach. They are combining flexible payment options with spending cuts to optimize their budgets.\nAdjustable-Rate Mortgages Strain Paycheck-to-Paycheck Homeowners’ Budgets\nAdjustable-rate mortgages can leave consumers in a tricky position financially. As such, borrowers with such mortgages are taking more actions to manage rising living costs than their counterparts with fixed-rate mortgages.\nFor instance, 42% of adjustable-rate mortgage holders living paycheck to paycheck report they have cut back on nonessential spending in the last six months. Just 37% of fixed-rate mortgage holders living paycheck to paycheck say the same. Similarly, 39% of those with adjustable rates have delayed or canceled a major purchase. In comparison, just 31% of those with fixed rates did so.\nThese disparities suggest that, as rates rise, these types of mortgages are cornering homeowners into more intensive financial coping strategies as they juggle cost pressures.\nAdjustable-rate mortgage holders also rely more heavily on credit to make ends meet. They are more likely to use credit cards to cover basic expenses than those with fixed rates. Additionally, nearly eight in 10 paycheck-to-paycheck consumers with adjustable-rate mortgages have increased their use of credit in the last six months. Just over half of those with fixed rates have done the same. Only 2.9% of paycheck-to-paycheck adjustable-rate mortgage holders have decreased their use of credit in that timeframe, compared to 15% of fixed-rate mortgage holders. It appears that, as mortgage payments increase, homeowners are becoming more reliant on deferring payments for purchases.\nRead More\nPYMNTS Intelligence is the leading provider of information on the consumer trends driving innovation in consumer finance, digital payments and financial inclusion. To stay up to date, subscribe to our newsletters and read our in-depth reports.\nMethodology\nThis edition of “New Reality Check: The Paycheck-to-Paycheck Report” is based on a survey of 2,135 consumers conducted from June 2, 2025, to June 23, 2025. The report examines the financial tradeoffs consumers make and the expense management strategies they use to afford homeownership. Our sample was balanced to match the U.S. adult population by age, gender and region."
    },
    {
      "url": "https://www.pymnts.com/news/retail/2025/shoppers-want-honest-answers-on-rising-prices/",
      "text": "Nearly half of U.S. consumers report being unable to purchase essential goods such as food, household supplies, and apparel due to stockouts, according to a new report by PYMNTS Intelligence.\nThe research in the June 2025 Consumer Tariff Sentiment report, “Stock Out. The Impact of Tariffs on Consumer Product Prices and Availability,” found that 47% of shoppers were unable to find key items in recent weeks. While these shortages stem in part from lingering global disruptions, tariffs are emerging as a clear price driver, and one that is disproportionately affecting younger and financially vulnerable consumers.\nAfter all, among the categories most affected include groceries, personal care products, and clothing; all segments where many U.S. households depend on low-cost imported goods. The downstream impact of the tariff-induced price hikes and supply constraints is that they are tending to hit the hardest where wallets are thinnest: younger and financially vulnerable consumers.\nThe report found Gen Z, millennials, and households living paycheck to paycheck are not only more exposed to product stockouts, but they are also paying more for less variety.\nThis isn’t just a consumer story. It’s a retail reckoning, and potentially a strategic inflection point.\nConsumers Want Clarity and Consistency\nThe PYMNTS Intelligence data shows that consumers, particularly those under financial pressure, are more exposed to tariff-related effects. Paycheck-to-paycheck households without savings were significantly more likely to report stockouts in essential goods. They also showed higher reliance on low-cost imports, with 22% using them for food and 28% for clothing, compared to 12% and 22% respectively among financially secure shoppers.\nMeanwhile, Gen Z and millennials, who dominate emerging purchasing power, are also more affected due to their price sensitivity and preferences for affordable, global brands.\nRetailers that proactively address these issues through transparent pricing, adaptive sourcing and stronger supply visibility may have a chance to redefine consumer trust and loyalty. Underscoring this is the fact that while 1 in 3 consumers said retailers were direct in attributing price increases to tariffs, another quarter received only vague references to “higher costs.” In an inflationary environment, that lack of clarity can potentially drive uncertainty and defection.\nRead the report: Stock Out. The Impact of Tariffs on Consumer Product Prices and Availability\nOn the upshot, retailers may have a role to play in bridging the communication gap. Price changes and product shortages — when explained clearly — don’t necessarily erode trust. On the contrary, transparency can help to serve as a competitive advantage, especially among younger demographics who increasingly value authenticity in brand relationships.\nThe PYMNTS Intelligence report also found that 48% of consumers expect tariffs to double the pace of inflation. That expectation — particularly high among Gen Z and financially stressed consumers — means retailers may have a window to lead with messaging, not just pricing.\nBy integrating tariff impact communications into apps, receipts, loyalty platforms and in-store signage, retailers may be able to shift from reactive to proactive. Instead of being blamed for higher prices, they may ultimately be seen as advocates for consumer interests.\nThe report also found that retailers haven’t stopped attempts at innovating on pricing. As cost pressures rise, multi-tier product strategies may allow stores to maintain access at multiple price points. Private-label lines — many of which carry lower import exposure — are increasingly being positioned as first-line alternatives to global brands impacted by tariffs. In previous inflationary cycles, retailers that expanded affordable options often saw stronger customer retention and brand affinity, particularly among younger and lower-income segments.\nThe current pressure from tariffs and global sourcing is real. But for retailers willing to rethink supply chains, double down on private-label innovation and engage transparently with their customers, the moment offers more than a challenge. It could offer a brand-building opportunity."
    },
    {
      "url": "https://myhome.freddiemac.com/blog/homebuying/considering-adjustable-rate-mortgage-heres-what-you-should-know#:~:text=Let's%20look%20at%20an%20example,(the%20%E2%80%9C1%E2%80%9D).",
      "text": "Adjustable-rate mortgages have benefits and drawbacks that you should carefully consider when choosing a home loan. Learn about how ARMs work, the different types of ARMs, when an ARM may be a good option, and when to think about refinancing to a fixed-rate mortgage.\nHow Do ARMs Work?\nAn adjustable-rate mortgage (ARM) is a loan with an interest rate that will change throughout the life of the mortgage. This means that, over time, your monthly payments may go up or down.\nThis is different from a fixed-rate mortgage (FRM), which has a fixed interest rate that is set when you take out the loan and does not change. With this type of loan, your monthly payments will not change.\nARMs have two distinct periods:\n- Initial period: Also known as the fixed-rate period, during this time, the interest rate on your loan doesn't change. The initial period can range from six months to 10 years. The most common ARM terms will have an initial period of 3, 5 or 10 years.\nAfter the initial period, most ARMs adjust. Simply put, when your loan adjusts, your interest rate may change.\n- Adjustment period: All ARMs have adjustment periods that determine when and how often the interest rate can change. Your adjusted rate will be based on your individual loan terms and the current market.\nYou need to make sure you are financially prepared for rate adjustments if you are considering an ARM.\nWhat Are the Different Types of ARMs?\nThere are different types of ARMs that lenders offer. The name of these ARMs will indicate:\n- The duration of the initial period.\n- How often in a year your rate can adjust during the adjustment period.\nLet’s look at an example: The most common adjustable-rate mortgage is a 5/1 ARM. This means you will have an initial period of five years (the “5”), during which the interest rate doesn’t change. After that time, you can expect your ARM to adjust once a year (the “1”).\nMost ARMS will also typically offer a rate cap structure, which is meant to limit how much your rate can increase or decrease.\nThere are three different caps:\n- Initial cap: Limits how much your rate can increase when your rate first adjusts.\n- Periodic cap: Limits how much your rate can increase from one adjustment period to the next.\n- Lifetime cap: Limits how much your rate can increase or decrease over the life of your loan.\nLet’s say you have a 5/1 ARM with a 5/2/5 cap structure. This means on the sixth year — after your initial period expires — your rate can increase by a maximum of 5 percentage points (the first \"5\") above the initial interest rate. Every year thereafter, your rate can adjust a maximum of 2 percentage points (the second number, \"2\"), but your interest rate can never increase more than 5 percentage points (the last number, \"5\") over the life of the loan.\nWhen shopping for an ARM, you should look for interest rate caps you can afford.\nWhen Should You Consider an ARM?\nMany homeowners choose an ARM to take advantage of the lower mortgage rates during the initial period. You may consider an adjustable-rate mortgage if:\n- You plan on moving or selling your home within five years, or before the adjustment period of the loan.\n- Interest rates are high when you buy your home.\nIf rates are low, it would make more sense to get a fixed-rate mortgage to lock in the low rate.\nKeep in mind that, with an ARM, there is a level of uncertainty about how much your monthly payment will go up or down. Depending on the market, your rate could adjust upward and increase your monthly payments. It is important to be mindful of this because you are still responsible for making your monthly payments if your rate adjusts upward.\nWhen Should You Consider Refinancing to a Fixed-Rate Mortgage?\nSwitching from an adjustable-rate mortgage to a fixed-rate mortgage is one of the most common reasons homeowners choose to refinance.\nYou may want to refinance your ARM into a FRM if:\n- Your ARM is scheduled to adjust soon. This is especially important if you cannot afford a higher monthly mortgage payment.\n- Mortgage rates are low. This will help you lock in a low rate and take advantage of the stability of a fixed-rate mortgage.\nAlternatively, if you plan to move soon, it may make financial sense to stick with an ARM.\nBefore you make plans to refinance later, it’s important to take into account the costs of refinancing — which are similar to what you pay when you purchase a home — and any penalties you may face if you refinance too soon.\nSome ARMs may require you to pay fees or penalties if you refinance or pay off the ARM early, usually during the initial period (the first three to five years) of the loan. Prepayment penalties can total several thousand dollars. It’s important to know about these potential extra fees before you take out an ARM.\nWhen it comes to mortgages, you have options. To determine the right mortgage for your situation, lean on your lender or financial professional for guidance. Be sure you know the details of how and when this type of loan may change your monthly payments.\nLast reviewed: January 02, 2024\nMy Home in your inbox\nSign up to receive resources, tools and tips about buying, owning, refinancing, selling and renting a home in your inbox."
    },
    {
      "url": "https://fred.stlouisfed.org/graph/?g=WaJj",
      "text": "Data in this graph are copyrighted. Please review the copyright information in the series notes before sharing.\nSource: Freddie Mac\nRelease: Primary Mortgage Market Survey\nUnits: Percent, Not Seasonally Adjusted\nFrequency: Weekly, Ending Thursday\nOn November 17, 2022, Freddie Mac changed the methodology of the Primary Mortgage Market Survey® (PMMS®). The weekly mortgage rate is no longer based on a survey of lenders. For more information regarding Freddie Mac’s enhancement, see their research note.\nData are provided “as is” by Freddie Mac®, with no warranties of any kind, express or implied, including but not limited to warranties of accuracy or implied warranties of merchantability or fitness for a particular purpose. Use of the data is at the user’s sole risk. In no event will Freddie Mac be liable for any damages arising out of or related to the data, including but not limited to direct, indirect, incidental, special, consequential, or punitive damages, whether under a contract, tort, or any other theory of liability, even if Freddie Mac is aware of the possibility of such damages.\nCopyright, 2016, Freddie Mac. Reprinted with permission.\nFreddie Mac, 5/1-Year Adjustable Rate Mortgage Average in the United States (DISCONTINUED) [MORTGAGE5US], retrieved from FRED, Federal Reserve Bank of St. Louis; https://fred.stlouisfed.org/series/MORTGAGE5US, .\nSource: Freddie Mac\nRelease: Primary Mortgage Market Survey\nUnits: Percent, Not Seasonally Adjusted\nFrequency: Weekly, Ending Thursday\nOn November 17, 2022, Freddie Mac changed the methodology of the Primary Mortgage Market Survey® (PMMS®). The weekly mortgage rate is now based on applications submitted to Freddie Mac from lenders across the country. For more information regarding Freddie Mac’s enhancement, see their research note.\nData are provided “as is” by Freddie Mac®, with no warranties of any kind, express or implied, including but not limited to warranties of accuracy or implied warranties of merchantability or fitness for a particular purpose. Use of the data is at the user’s sole risk. In no event will Freddie Mac be liable for any damages arising out of or related to the data, including but not limited to direct, indirect, incidental, special, consequential, or punitive damages, whether under a contract, tort, or any other theory of liability, even if Freddie Mac is aware of the possibility of such damages.\nCopyright, 2016, Freddie Mac. Reprinted with permission.\nFreddie Mac, 30-Year Fixed Rate Mortgage Average in the United States [MORTGAGE30US], retrieved from FRED, Federal Reserve Bank of St. Louis; https://fred.stlouisfed.org/series/MORTGAGE30US, .\nSource: Board of Governors of the Federal Reserve System (US)\nRelease: H.15 Selected Interest Rates\nUnits: Percent, Not Seasonally Adjusted\nFrequency: Monthly\nAverages of daily figures.\nFor additional historical federal funds rate data, please see Daily Federal Funds Rate from 1928-1954.\nThe federal funds rate is the interest rate at which depository institutions trade federal funds (balances held at Federal Reserve Banks) with each other overnight. When a depository institution has surplus balances in its reserve account, it lends to other banks in need of larger balances. In simpler terms, a bank with excess cash, which is often referred to as liquidity, will lend to another bank that needs to quickly raise liquidity. (1) The rate that the borrowing institution pays to the lending institution is determined between the two banks; the weighted average rate for all of these types of negotiations is called the effective federal funds rate.(2) The effective federal funds rate is essentially determined by the market but is influenced by the Federal Reserve as it uses the Interest on Reserve Balances rate to steer the federal funds rate toward the target range.(2)\nThe Federal Open Market Committee (FOMC) meets eight times a year to determine the federal funds target range. The Fed's primary tool for influencing the federal funds rate is the interest the Fed pays on the funds that banks hold as reserve balances at their Federal Reserve Bank, which is the Interest on Reserves Balances (IORB) rate. Because banks are unlikely to lend funds in the federal funds market for less than they get paid in their reserve balance account at the Federal Reserve, the Interest on Reserve Balances (IORB) is an effective tool for guiding the federal funds rate. (3) Whether the Federal Reserve raises or lowers the target range for the federal funds rate depends on the state of the economy. If the FOMC believes the economy is growing too fast and inflation pressures are inconsistent with the dual mandate of the Federal Reserve, the Committee may temper economic activity by raising the target range for federal funds rate, and increasing the IORB rate to steer the federal funds rate into the target range. In the opposing scenario, the FOMC may spur greater economic activity by lowering the target range for federal funds rate, and decreasing the IORB rate to steer the federal funds rate into the target range. (3) Therefore, the FOMC must observe the current state of the economy to determine the best course of monetary policy that will maximize economic growth while adhering to the dual mandate set forth by Congress. In making its monetary policy decisions, the FOMC considers a wealth of economic data, such as: trends in prices and wages, employment, consumer spending and income, business investments, and foreign exchange markets.\nThe federal funds rate is the central interest rate in the U.S. financial market. It influences other interest rates such as the prime rate, which is the rate banks charge their customers with higher credit ratings. Additionally, the federal funds rate indirectly influences longer- term interest rates such as mortgages, loans, and savings, all of which are very important to consumer wealth and confidence.(2)\nReferences\n(1) Federal Reserve Bank of New York. \"Federal funds.\" Fedpoints, August 2007.\n(2) Monetary Policy, Board of Governors of the Federal Reserve System.\n(3) The Fed Explained, Board of Governors of the Federal Reserve System\nFor further information, see The Fed's New Monetary Policy Tools, Page One Economics, Federal Reserve Bank of St. Louis.\nFor questions on the data, please contact the data source. For questions on FRED functionality, please contact us here.\nBoard of Governors of the Federal Reserve System (US), Federal Funds Effective Rate [FEDFUNDS], retrieved from FRED, Federal Reserve Bank of St. Louis; https://fred.stlouisfed.org/series/FEDFUNDS, .\nmodal open, choose link customization options\nSelect automatic updates to the data or a static time frame. All data are subject to revision."
    },
    {
      "url": "https://www.newyorkfed.org/markets/reference-rates/sofr#:~:text=The%20Secured%20Overnight%20Financing%20Rate,of%20transactions%20considered%20%E2%80%9Cspecials%E2%80%9D.",
      "text": "The Secured Overnight Financing Rate (SOFR) is a broad measure of the cost of borrowing cash overnight collateralized by Treasury securities. The SOFR includes all trades in the Broad General Collateral Rate plus bilateral Treasury repurchase agreement (repo) transactions cleared through the Delivery-versus-Payment (DVP) service offered by the Fixed Income Clearing Corporation (FICC), which is filtered to remove a portion of transactions considered “specials”. Note that specials are repos for specific-issue collateral, which take place at cash-lending rates below those for general collateral repos because cash providers are willing to accept a lesser return on their cash in order to obtain a particular security.\nThe SOFR is calculated as a volume-weighted median of transaction-level tri-party repo data collected from the Bank of New York Mellon as well as GCF Repo transaction data and data on bilateral Treasury repo transactions cleared through FICC's DVP service, which are obtained from the U.S. Department of the Treasury’s Office of Financial Research (OFR). Each business day, the New York Fed publishes the SOFR on the New York Fed website at approximately 8:00 a.m. ET.\nFor more information on the SOFR’s publication schedule and methodology, see Additional Information about Reference Rates Administered by the New York Fed."
    },
    {
      "url": "https://www.pymnts.com/earnings/2025/pg-plans-price-hikes-as-shoppers-grow-more-careful/",
      "text": "The company released earnings Tuesday (July 29) showing a 2% increase in net sales, while also introducing guidance for its next fiscal year included a $1 billion hit based on projections of higher costs from tariffs.\nSpeaking on an earnings call, Chief Financial Officer Andre Schulten said the price hikes would be in the “mid-single digits” on about 25% of products in the U.S.\nManagement said it was projecting a slight downturn in consumption among both higher-income and lower-income consumers in response to economic conditions.\n“The volatility the consumer is seeing, I think, is maybe not necessarily grounded in their current reality, but more on what to expect for the future,” Schulten said.\n“So consumers are a bit more careful in terms of consumption. They are using up pantry inventory. And they are looking for value either in smaller packs and promotions or in larger pack sizes in the club channel and online.”\nJon Moeller, the company’s outgoing CEO, pointed to a “level of baseline uncertainty” influencing the Pampers-maker’s guidance for the coming year.\n“To the extent that people are frustrated with the lack of certainty, and the breadth of the range, trust me, there’s no one more frustrated with that than I,” Moeller said.\nMoeller is set to become Procter & Gamble’s executive chairman at the start of 2026. Succeeding him as CEO will be Shailesh Jejurikar, the company’s current chief operating officer, P&G said in a news release earlier this week.\nThe company’s planned price increases come as consumers continue to feel the impact of tariffs, as recent PYMNTS Intelligence research shows.\nLast month’s report, “Stock Out. The Impact of Tariffs on Consumer Product Prices and Availability,” found nearly half of all shoppers — 47% to be exact — reported being unable to find key items in recent weeks.\n“While these shortages stem in part from lingering global disruptions, tariffs are emerging as a clear price driver, and one that is disproportionately affecting younger and financially vulnerable consumers,” PYMNTS wrote Tuesday.\n“After all, among the categories most affected include groceries, personal care products, and clothing; all segments where many U.S. households depend on low-cost imported goods. The downstream impact of the tariff-induced price hikes and supply constraints is that they are tending to hit the hardest where wallets are thinnest: younger and financially vulnerable consumers.”"
    },
    {
      "url": "https://myhome.freddiemac.com/blog/homebuying/considering-adjustable-rate-mortgage-heres-what-you-should-know",
      "text": "Adjustable-rate mortgages have benefits and drawbacks that you should carefully consider when choosing a home loan. Learn about how ARMs work, the different types of ARMs, when an ARM may be a good option, and when to think about refinancing to a fixed-rate mortgage.\nHow Do ARMs Work?\nAn adjustable-rate mortgage (ARM) is a loan with an interest rate that will change throughout the life of the mortgage. This means that, over time, your monthly payments may go up or down.\nThis is different from a fixed-rate mortgage (FRM), which has a fixed interest rate that is set when you take out the loan and does not change. With this type of loan, your monthly payments will not change.\nARMs have two distinct periods:\n- Initial period: Also known as the fixed-rate period, during this time, the interest rate on your loan doesn't change. The initial period can range from six months to 10 years. The most common ARM terms will have an initial period of 3, 5 or 10 years.\nAfter the initial period, most ARMs adjust. Simply put, when your loan adjusts, your interest rate may change.\n- Adjustment period: All ARMs have adjustment periods that determine when and how often the interest rate can change. Your adjusted rate will be based on your individual loan terms and the current market.\nYou need to make sure you are financially prepared for rate adjustments if you are considering an ARM.\nWhat Are the Different Types of ARMs?\nThere are different types of ARMs that lenders offer. The name of these ARMs will indicate:\n- The duration of the initial period.\n- How often in a year your rate can adjust during the adjustment period.\nLet’s look at an example: The most common adjustable-rate mortgage is a 5/1 ARM. This means you will have an initial period of five years (the “5”), during which the interest rate doesn’t change. After that time, you can expect your ARM to adjust once a year (the “1”).\nMost ARMS will also typically offer a rate cap structure, which is meant to limit how much your rate can increase or decrease.\nThere are three different caps:\n- Initial cap: Limits how much your rate can increase when your rate first adjusts.\n- Periodic cap: Limits how much your rate can increase from one adjustment period to the next.\n- Lifetime cap: Limits how much your rate can increase or decrease over the life of your loan.\nLet’s say you have a 5/1 ARM with a 5/2/5 cap structure. This means on the sixth year — after your initial period expires — your rate can increase by a maximum of 5 percentage points (the first \"5\") above the initial interest rate. Every year thereafter, your rate can adjust a maximum of 2 percentage points (the second number, \"2\"), but your interest rate can never increase more than 5 percentage points (the last number, \"5\") over the life of the loan.\nWhen shopping for an ARM, you should look for interest rate caps you can afford.\nWhen Should You Consider an ARM?\nMany homeowners choose an ARM to take advantage of the lower mortgage rates during the initial period. You may consider an adjustable-rate mortgage if:\n- You plan on moving or selling your home within five years, or before the adjustment period of the loan.\n- Interest rates are high when you buy your home.\nIf rates are low, it would make more sense to get a fixed-rate mortgage to lock in the low rate.\nKeep in mind that, with an ARM, there is a level of uncertainty about how much your monthly payment will go up or down. Depending on the market, your rate could adjust upward and increase your monthly payments. It is important to be mindful of this because you are still responsible for making your monthly payments if your rate adjusts upward.\nWhen Should You Consider Refinancing to a Fixed-Rate Mortgage?\nSwitching from an adjustable-rate mortgage to a fixed-rate mortgage is one of the most common reasons homeowners choose to refinance.\nYou may want to refinance your ARM into a FRM if:\n- Your ARM is scheduled to adjust soon. This is especially important if you cannot afford a higher monthly mortgage payment.\n- Mortgage rates are low. This will help you lock in a low rate and take advantage of the stability of a fixed-rate mortgage.\nAlternatively, if you plan to move soon, it may make financial sense to stick with an ARM.\nBefore you make plans to refinance later, it’s important to take into account the costs of refinancing — which are similar to what you pay when you purchase a home — and any penalties you may face if you refinance too soon.\nSome ARMs may require you to pay fees or penalties if you refinance or pay off the ARM early, usually during the initial period (the first three to five years) of the loan. Prepayment penalties can total several thousand dollars. It’s important to know about these potential extra fees before you take out an ARM.\nWhen it comes to mortgages, you have options. To determine the right mortgage for your situation, lean on your lender or financial professional for guidance. Be sure you know the details of how and when this type of loan may change your monthly payments.\nLast reviewed: January 02, 2024\nMy Home in your inbox\nSign up to receive resources, tools and tips about buying, owning, refinancing, selling and renting a home in your inbox."
    },
    {
      "url": "https://loanpronto.com/blog/mortgage-rates-today-nov-10-2023-rates-are-near-60-day-lows/",
      "text": "Having reached their highest point since 2000, mortgage interest rates recently experienced their most substantial weekly decline since July 2022. This significant drop, the most pronounced in over a year, resulted in the first uptick in mortgage demand in a month.\nAs per the Mortgage Bankers Association’s seasonally adjusted index, total mortgage application volume increased by 2.5% last week compared to the previous week. Specifically, applications for home purchase mortgages rose by 3%. Joel Kan, the vice president and deputy chief economist at the MBA, attributed the rate decrease last week to factors such as the U.S. Treasury’s issuance update, the Federal Reserve adopting a dovish tone in the November FOMC statement, and data indicating a slower job market.\nApplications to refinance a home loan experienced a 2% increase for the week but remained 7% lower than the same week one year ago. The Federal Reserve’s decision to pause its rate hike in the latest meeting, coupled with the Bureau of Labor Statistics’ October jobs report indicating fewer jobs added than expected, bodes well for mortgage rates. If the Fed continues its rate pause (or even considers a rate drop) in the upcoming meetings, and if the job market remains cool, there is potential for a continued downward trend in mortgage rates. The Fed’s last rate-setting meeting of the year is scheduled for December 12-13.\nMortgage rates experienced a dip midweek until slightly rising again across all loan products except for the 30-Year VA loan type.\n| Product | Rate | Mid Week | Change |\n| 30-year fixed | 7.56% | 7.46% | ⇧ – 0.10 |\n| 15-year fixed | 6.92% | 6.85% | ⇧ – 0.07 |\n| 30-year jumbo | 7.87% | 7.82% | ⇧ – 0.05 |\n| 5/1 ARM | 7.21% | 7.19% | ⇧ – 0.02 |\n| 30-year FHA | 6.91% | 6.82% | ⇧ – 0.09 |\n| 30-year VA | 6.74% | 6.83% | ⇩ – 0.11 |\nDISCLAIMER: ALL LOANS ARE SUBJECT TO CREDIT APPROVAL. INTEREST RATES ARE SUBJECT TO CHANGE DAILY AND WITHOUT NOTICE. CURRENT INTEREST RATES SHOWN ARE INDICATIVE OF MARKET CONDITIONS AND INDIVIDUAL QUALIFICATIONS AND WILL VARY UPON YOUR LOCK-IN PERIOD, LOAN TYPE, CREDIT SCORE, LOAN TO VALUE, PURPOSE, AND LENDING SOURCE.\n30-year fixed-rate mortgages\nPresently, the 30-year fixed-rate mortgage sits at 7.46%, reflecting a drop of 42 basis points from the preceding week. Despite its interest rate being higher than that of the 15-year mortgage, the 30-year option is favored by many buyers for its advantage of providing more budget-friendly monthly payments.\nget approved in 24 hours\nget approved in 24 hours\n15-year fixed-rate mortgages\nThe current interest rate for a 15-year fixed-rate mortgage is 6.85%, showcasing a decrease of 39 basis points from the week prior. Choosing a 15-year mortgage enables borrowers to pay back their loan repayment quicker compared to the 30-year option. While this leads to increased monthly payments, it substantially diminishes the total interest paid over the loan’s duration.\n30-year jumbo mortgages\nThe interest rate for a 30-year jumbo loan has decreased by 19 basis points, currently resting at 7.82%. Jumbo loans generally carry higher interest rates due to their larger loan amounts. Nevertheless, the current rate aligns with the average for a 30-year fixed-rate mortgage.\n5/1 adjustable-rate mortgages\nRight now the interest rate for a 5/1 adjustable-rate mortgage (ARM) is 7.19%, indicating a 5 basis point decline from the preceding week. Generally, adjustable-rate mortgages feature lower interest rates in contrast to fixed-rate mortgages, with the current margin being to 27 basis points in relation to a 30-year fixed-rate mortgage.\nUse our free mortgage and amortization calculators to calculate your monthly payment, including insurance, taxes, and interest.\nGet My Custom Rate QuoteNo SSN required. Zero impact to credit. Your Information is never sold."
    },
    {
      "url": "https://www.freddiemac.com/research/insight/20221103-freddie-macs-newly-enhanced-mortgage-rate-survey#:~:text=We%20will%20no%20longer%20report,if%20they%20paid%20no%20points.",
      "text": "Freddie Mac’s Newly Enhanced Mortgage Rate Survey Explained\nFor decades, the mortgage industry has relied on Freddie Mac’s Primary Mortgage Market Survey® (PMMS) as the industry standard for mortgage interest rates in the United States. Throughout the history of the PMMS, we have adjusted the methodology to account for changes in technology and the mortgage industry while maintaining continuity with historical rates. In order to ensure that the PMMS continues to provide high-quality information on the mortgage market, we are making new enhancements to our methodology.\nIn this Research Note, we provide details of the adjustments and explain how the changes may impact users of the PMMS. We also discuss how the adjustments in methodology would have impacted historical PMMS results had we implemented these changes at an earlier date. While the methodological changes will set up the PMMS for continued success in years to come, the total impact on rates is currently very small, as we document below.\nBackground on the PMMS\nFreddie Mac has been surveying lenders on weekly mortgage rates since 1971.1 The survey included discount points and origination fees for 30-year and 15-year fixed-rate and 5/1 hybrid amortizing adjustable-rate mortgage products.\nThe survey captures mortgage rates for first-lien, conventional, conforming, purchase mortgages with a borrower who has a loan-to-value of 80% and excellent credit. In addition, it captures adjustable-rate mortgage (ARM) rates indexed to U.S. Treasury yields. The lenders surveyed are asked for both the initial coupon rate and points as well as the margin on the ARM products. The lenders represent a mix of business models—credit unions, commercial banks, and mortgage lending companies—roughly proportional to the level of mortgage business each type commands nationwide. The rates are collected from Monday through Wednesday, and the results are released on Thursdays at 10 a.m. Eastern Time (ET).\nEnhancement of Freddie Mac’s mortgage rate survey\nThere have been growing challenges with the traditional survey approach. The current survey operates on sampled data where a subset of records in the overall population is selected. As the underlying population changes in response to economic conditions and the evolution of the mortgage market, the survey faces a variety of issues that could result in statistical bias and eventually reduce the reliability of the results.\nWhile our survey carefully samples lenders covering a broad range of lender types to reflect the U.S. mortgage market, we had to make frequent adjustments to our selection process to reflect changes in the housing market. The entry and exit of new participants into and out of the mortgage market creates more complexity in accurately tracking the market with a traditional survey method.\nMany institutions have turned to administrative datasets to supplement or replace survey methods. Administrative datasets are data collected by governments or other organizations for non-statistical reasons to provide overviews on registration, transactions, and record keeping. To enhance the PMMS, we have also decided to turn to administrative data, leveraging Freddie Mac’s vast data resources to estimate weekly mortgage rates. For the long-run viability of the PMMS, Freddie Mac has enhanced the PMMS methodology to improve the quality—as well as reliability and consistency—of its results.\nFor the long-run viability of the PMMS, Freddie Mac has enhanced the PMMS methodology to improve the quality—as well as reliability and consistency—of its results.\nLeveraging loan application data\nGoing forward, the traditional survey approach will be replaced with loan application information submitted to Freddie Mac’s automated underwriting system, Loan Product Advisor® (LPA). LPA helps simplify the origination processes and provides lenders with greater certainty of meeting Freddie Mac’s eligibility requirements.\nThe loan application data is extensive and contains various information about the property being considered for purchase, the borrower’s financial situation, employment history, and more.\nIn general, mortgage rates are determined by a combination of various factors such as current economic conditions, the lender’s risk appetite and overhead costs, and borrowers’ credit profiles. However, the application data is neither a pledge by the applicant nor a commitment by the lender.\nThere are many advantages of using loan application data instead of a survey, including the dramatic increases in coverage and a real-time view of the mortgage market. The loan application data also covers a broad range of lenders and geographies in the United States and immediately and automatically adjusts to shifts in the composition of the mortgage market. While the current PMMS in recent years has captured mortgage rates reported by lenders in a majority of states, the loan application covers lenders in all 50 states, plus the District of Columbia, on a weekly basis.\nLimitations of the loan application data\nAlthough there are many advantages of using loan application data to measure the mortgage rate, it comes with a cost. First, we do not have the information on the mortgage rate when lenders do not intend to sell to the secondary market or if they do not use the LPA as the underwriting tool.\nAs noted above, we measure the mortgage rate not in the origination but in the application stage. Therefore, our reported rate does not represent the rate at the time of loan origination. Not all applications will necessarily be approved and result in originated loans. Users should be aware of these factors when using the PMMS.\nIn addition, using LPA will result in two major changes related to our PMMS output:\n- We will no longer report interest rates, margin, or discount points and fees for the hybrid 5/1 Treasury Indexed Adjustable-Rate Mortgage (ARM).\n- We will no longer report average discount points and origination fees for the 30-year and the 15-year fixed-rate mortgage (FRM).\nWe will not include the ARM products rate due to insufficient numbers of applicants with ARM programs in recent years in LPA data.\nThe cessation of reporting average points and fees merits some further discussion. Since LPA does not capture discount points or origination fees, we are not able to report them in the PMMS going forward. The full cost of a mortgage is captured by both the interest rate and the discount points and origination fees paid by a borrower. Theoretically, a borrower who pays discount points would receive a lower rate compared to the rate they would receive if they paid no points. However, in practice, we have found that in recent years the difference in rate between a borrower paying discount points and borrowers who do not pay discount points has been very near to zero.\nConsider Exhibit 1. We analyzed loans funded by Freddie Mac where the loan meets the PMMS profile and the closing date was between 2018 and 2021—then segmented the data into two sets: (1) borrowers who purchased discount points and (2) borrowers who did not purchase discount points. We found that for purchase transactions, mortgage rates are nearly the same regardless of whether borrowers purchased discount points. We found similar outcomes in refinance and cash- out refinance, where average mortgage rates did not change regardless of whether borrowers purchased discount points.2\nMethodology\nOur main goal is to capture the average interest rate from loan applications submitted to Freddie Mac’s LPA tool. In order to align with the historical PMMS approach, we will limit the selection of loan applications to conventional, conforming, fully amortizing home purchase loans for borrowers who put 20% down and have excellent credit.\nAt first, we collect all purchase loan applications that could result in future home purchases. Next, we clean the data by removing irrelevant, corrupted, incorrectly formatted, and incomplete data. Then, we deduplicate the transactions to extract the most recent submissions after eliminating the transactions with outliers.\nThen, we select the loan applications meeting the following criteria:\n- Single Family (SF) Loan — A mortgage loan secured by a property that contains one to four residential dwelling units.\n- Owner Occupied (OO) — A property in which at least one unit is occupied by an individual with an ownership interest.\n- Conventional — A mortgage or loan that is not offered or secured by a government entity.\nIt is available through private lenders, such as banks, credit unions, and mortgage companies. - 30-year or 15-year fixed rate mortgage — A loan that will be paid off completely in 30 or 15 years, respectively, for which the interest rate stays the same for as long as the borrower keeps the mortgage.\n- A single-unit property — A property containing only one dwelling unit.\n- Origination Loan-to-Value ratio — LTV greater than or equal to 75 and less than or equal to 80.\n- Origination FICO score — 740 or above.\n- Conforming Loan — A mortgage with terms and conditions that meet the underwriting guidelines of the GSE (government-sponsored enterprises). To be consistent, we exclude loans with a higher loan amount than the national conforming loan limits ($647,200 in 2022).\n- Property is within the lower 48 contiguous states or the District of Columbia (excludes Alaska, Hawaii, and U.S. territories3)\nWe selected these loan features to maximize the compatibility between our new approach and the historical survey-based PMMS.\nLastly, we applied several additional rules to calculate the timely mortgage rate. In LPA, a lender may submit the same application multiple times in the loan application stage. Therefore, in our final selection, we keep only the existing applicants when their rates have changed compared to prior submissions, while we include all new applicants. By selecting only new applicants and existing applicants only if their rate change, we ensure our measure represents the most recent rate in the current mortgage market.\nSpecifically, we:\n- Filter LPA records to include only the purchase applications that could result in new home applications.\n- Create weekly application measures by aggregating applications from Thursday prior to the current week through Wednesday.\n- Set the first week of 2005 as the initial period, calculating the weekly rate. We provide the historical series of the PMMS under our new methodology back to 2005 to enable users to perform time series analysis.\n- Focus on the mortgage rate based on the latest submission for any loan application during the week. Our approach differs from collecting the mortgage rate based on the rate set date, which includes only the loan applications when the rates are locked.\nPMMS calendar\nGoing forward, the PMMS will be published weekly each Thursday at 12 p.m. ET. When a U.S. holiday falls on a Thursday, the PMMS will publish on the Wednesday of that week.\nThe week of application activity starts at 12:00 a.m. ET the Thursday of last week and goes through 11:59p.m. ET the following Wednesday. We collect the mortgage rate of all purchase applications that meet our weekly criteria and calculate the average mortgage rate.\nComparing the new methodology to historical PMMS and external measures\nIn preparation for launching the newly enhanced PMMS, we created a complete weekly time series dating back to January 2005, when the loan application data collected from LPA was considered reliable for PMMS purposes. As we applied the same filters to the historical data as to the real-time data, the weekly releases are aligned with the same data-generation process as the historical series. This allowed us to construct a time series of weekly rates that would have been published if the new methodology had been applied historically in real-time.\nWe find that the new methodology based on loan applications tracks very closely with our historical survey approach. On average, the difference between the traditional survey approach and the new approach for the 30-year FRM rate is about 0.066 percentage points from 2005 through 2021, with a standard deviation of about 0.074 percentage points. See Exhibit 3 below.\nWe conducted a similar experiment for the 15-year FRM; see Exhibit 4 below. On average, the difference between the traditional survey approach and the new approach for the 15-year FRM rate is about 0.0475 percentage points from 2005 through 2021, with a standard deviation of about 0.069 percentage points.\nThe very small difference in the rates reported in our historical survey and the real-time estimate of the new LPA-based approach give us great confidence in using the new approach. We also tested our results with other loan datasets purchased from third parties applying the same PMMS filters. The average rate computed using the new PMMS methodology and in the third-party data filtered to match the PMMS were quite similar. Finally, we assessed the results with the closed loans funded by Freddie Mac collected from the Uniform Closing Dataset after applying the same PMMS filters and we received comparable results.\nThe very small difference in the rates reported in our historical survey and the real-time estimate of the new LPA-based approach give us great confidence in using the new approach.\nConclusion\nBy using comprehensive and timely loan application data, our enhanced PMMS will produce a more reliable and accurate mortgage rate. Instead of surveying lenders, the weekly mortgage rate will be based on thousands of applications submitted to Freddie Mac from lenders across the country. We believe this improved PMMS will reflect the broader market and be able to monitor the real-time mortgage rate more closely.\nWe believe this improved PMMS will reflect the broader market and be able to monitor the real- time mortgage rate closely.\nPMMS users interested in time series properties using the new methodology are encouraged to submit this form to receive a file containing the historical real-time estimates displayed in Exhibits 3 and 4 above.\nPMMS data users with questions about the methodological change are encouraged to reach out to us at [email protected].\n-\nFootnotes\n- For more background see Freddie Mac’s Mortgage Rate Survey Explained — Freddie Mac.\n- We also sampled closed loans from the HMDA 2021 dataset. We found similar results as what is displayed in Exhibit 1, showing that mortgage rates tend to stay consistent regardless of whether borrowers purchased discount points.\n- Alaska, Hawaii, the U.S. territories of Guam and the U.S. Virgin Islands have special statutory provisions that provide higher national loan limits than those in the lower contiguous 48 states and the District of Columbia.\nPrepared by the Economic & Housing Research group\nSam Khater, Chief Economist\nLen Kiefer, Deputy Chief Economist\nMihwa Kim, Macro Housing Economics Director"
    },
    {
      "url": "https://www.pymnts.com/study_posts/consumers-say-they-want-budgeting-tools-but-arent-using-them/",
      "text": "June 2025 New Reality Check: The Paycheck-to-Paycheck Report\nConsumers Say They Want Budgeting Tools but Aren’t Using Them\nMore Americans than ever are living paycheck to paycheck and struggling to make ends meet. Advanced budgeting apps and personal finance tools can make a world of difference in fighting money stress, yet they are underutilized.\nGet Unlimited Access\nComplete the form below for free, unlimited access to all our Data Studies, Trackers, and MonitorEdge reports.\nThank you for registering. Please confirm your email to view all our Trackers.\nWorried about your financial situation? You’re in good company. PYMNTS Intelligence’s Paycheck-to-Paycheck index hit a new high of 68.4% in May. Whether it’s due to persistent inflation, rising housing costs or the impact of tariffs, more Americans than ever—684 out of every 1,000—are walking a financial tightrope, watching their monthly paycheck rapidly dwindle as it’s used to cover essential payments (and splurges). What’s more, the group of people who struggle to pay their bills climbed for the third-straight month, reaching 24.2% of all consumers.\nOur latest survey reveals that amid this pocketbook stress, six in ten consumers feel uncomfortable when thinking about their finances. The good news is that there’s an antidote for at least some of that angst. Specialized budgeting apps and advanced personal finance tools can’t magically send extra dollars to your bank account, but they can help consumers stay worry-free and financially stable, especially during difficult times. Yet even though they can unlock “extra” dollars currently going toward wasteful or inefficient spending, consumers woefully underutilize them.\nAmong the respondents with trouble making ends meet, more than half who use specialized, advanced budgeting tools, such as Intuit’s Credit Karma (which absorbed Mint last year), YNAB (You Need a Budget) or any of the dozens of others out there, said they feel financially comfortable. Meanwhile, just 12% of those who use only rudimentary personal finance tools—and almost none who don’t budget at all—indicated the same. Among the survey’s many findings: Daily budget reminders offer an easy way for people to feel happier about their financial situations.\nThese are just some of the findings detailed in “Feeling Stressed? Budgeting Works Wonders (Really),” the latest installment of the “New Reality Check: The Paycheck-to-Paycheck Report,” a PYMNTS Intelligence exclusive series. This edition draws on insights from a survey of 2,040 U.S. consumers conducted from May 1, 2025, to May 21, 2025.\nMost consumers—even those with high incomes—feel concerned about their finances.\nPersonal finances are a source of stress for most consumers. In fact, 24% feel highly anxious and 36% are somewhat concerned about their financial situation, while only 40% feel comfortable. Lower-income individuals are understandably the most likely to worry, at 71%, but most middle and high earners are also worried.\nNaturally, consumers living paycheck to paycheck and struggling to pay their bills tend to feel the most anxiety. Just less than three-quarters are either highly anxious (47%) or somewhat (28%) concerned. Even among individuals not living paycheck to paycheck, 39% express at least some worry. Meanwhile, the data highlights that financial stress impacts the typical consumer regardless of age, with little variation across generations—although baby boomers are somewhat less likely to report concern. 1\nBudgeting Brings Peace of Mind\nMost advanced budgeters feel comfortable with their finances, even if they are struggling to make ends meet.\nSpecialized budgeting tools can be a powerful tool for reducing financial stress. Nearly half of advanced budgeters (47%) feel comfortable with the state of their pocketbooks. This is substantially higher than the levels seen among basic budgeters and those who do not actively budget, at 34% and 39%, respectively.\nSo which consumers tend to be advanced budgeters? Those with household incomes over $100,000 per year are the most likely, at 45%, compared to just 27% of their low-income counterparts. Conversely, 28% of low-income respondents are non-budgeters, more than twice the rate seen in the high-income bracket. Another clear trend is that younger consumers are more likely to use advanced budgeting tools. Gen Z leads, at 55%, followed by millennials, at 48%.\nThe benefits of advanced budgeting stand out among consumers who struggle to make ends meet. In fact, 53% of consumers who live paycheck to paycheck and both struggle to pay bills and use advanced tools still report feeling financially comfortable. This is several times higher than seen among basic budgeters and non-budgeters. Among consumers who live paycheck to paycheck with no difficulty paying bills and those who do not, there is little variation in budgeting styles. That said, there is complex psychology at work, because using advanced tools forces consumers to get up close and personal with their financial health—or lack thereof. Knowledge is power, but not necessarily comforting.\nPlease Remind Me\nDaily budget reminders significantly boost financial comfort, but many consumers never use them.\nBudget reminders are simple but highly effective—and the more frequently they’re used, the better. Fifty-four percent of consumers who set their budgeting tools to deliver daily nudges feel comfortable about their finances. This drops to between 30% and 42% for those who receive fewer reminders.\nHowever, just 14% of consumers opt for daily reminders. What’s more, 40% of respondents have their budgeting tools nudge them less than once a month or not at all. All of this puts a revealing spotlight on the stark lack of consumer engagement with the typical reminder options offered by many banking apps and other tools.\nWhile daily reminders are underappreciated across demographic segments, the data reveals elevated use in a few segments. Interestingly, 25% of those struggling to pay their bills receive daily nudges, considerably higher than among other respondents. Millennials are the generation likeliest to use daily reminders, at 24%, followed by bridge millennials, at 23%.\nFinding the Right Tools\nBudgeting is not something consumers prioritize, even as they want the planning capabilities and peace of mind that budgeting tools offer.\nDespite its benefits, budgeting is not a mainstream habit. In fact, just 21% of consumers report creating or revising a budget in the last year, and only 6.8% found this to be the most effective method they used to get a handle on their finances. Instead, consumers generally make reactionary cuts to their purchasing. Over a third of respondents reduced discretionary spending in the last year (36%) or changed shopping habits (34%). Similarly, more than one-quarter postponed major purchases (28%), used savings to cover expenses (27%) or canceled subscriptions or services (27%).\nDedicated budget apps don’t just help with money pressures today—they also aid in planning for the future. Money goals range from earning and saving more to paying down debt. Interestingly, most consumers seem to think they already know where their monthly paychecks are going, and are focused on ways to shore up their personal balance sheets both today and tomorrow.\nRead More\nPYMNTS Intelligence is the leading provider of information on the trends driving consumer spending and finance. To stay up to date, subscribe to our newsletters and read our in-depth reports.\n“Feeling Stressed? Budgeting Works Wonders (Really),” the latest installment of the “New Reality Check: The Paycheck-to-Paycheck Report” series, is based on a survey of 2,040 U.S. consumers conducted from May 1, 2025, to May 1, 2025. It examines how consumers manage their finances, with a focus on budgeting tools. Our sample was balanced to match the U.S. adult population in a set of key demographic variables: 51% of respondents identified as female, 33% were college-educated and 29% declared household incomes of between $50,000 and $100,000 per year.\n1. PYMNTS Intelligence uses the following birth dates and approximate age ranges in 2025 for generational cohorts: baby boomers: born in 1964 or earlier and now age 61 or older; Generation X: born between 1965 and 1980 and now 45–60; bridge millennials: born between 1978 and 1988 and now 37–47; millennials: born between 1981 and 1996 and now 28–44; zillennials: born between 1991 and 1999 and now 25–34; and Generation Z: born in 1997 or later and now 28 or younger.↩\nAbout\nPYMNTS Intelligence is a leading global data and analytics platform that uses proprietary data and methods to provide actionable insights on what’s now and what’s next in payments, commerce and the digital economy. Its team of data scientists includes leading economists, econometricians, survey experts, financial analysts and marketing scientists with deep experience in the application of data to the issues that define the future of the digital transformation of the global economy. This multi-lingual team has conducted original data collection and analysis in more than three dozen global markets for some of the world’s leading publicly traded and privately held firms.\nThe PYMNTS Intelligence team that produced this report:\nLynnley Browning: Managing Editor\nMariah Warner, PhD: Senior Research Manager\nDaniel Gallucci: Senior Writer\nFranco Coraggio: Analyst\nWe are interested in your feedback on this report. If you have questions\nor\ncomments, or if you would like to subscribe to this report, please email\nus at\nfeedback@pymnts.com.\nDisclaimer\nNew Reality Check: The Paycheck-to-Paycheck Report Series may be updated periodically. While reasonable efforts are made to keep the content accurate and up to date, PYMNTS MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, REGARDING THE CORRECTNESS, ACCURACY, COMPLETENESS, ADEQUACY, OR RELIABILITY OF OR THE USE OF OR RESULTS THAT MAY BE GENERATED FROM THE USE OF THE INFORMATION OR THAT THE CONTENT WILL SATISFY YOUR REQUIREMENTS OR EXPECTATIONS. THE CONTENT IS PROVIDED “AS IS” AND ON AN “AS AVAILABLE” BASIS. YOU EXPRESSLY AGREE THAT YOUR USE OF THE CONTENT IS AT YOUR SOLE RISK. PYMNTS SHALL HAVE NO LIABILITY FOR ANY INTERRUPTIONS IN THE CONTENT THAT IS PROVIDED AND DISCLAIMS ALL WARRANTIES WITH REGARD TO THE CONTENT, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND NONINFRINGEMENT AND TITLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF CERTAIN WARRANTIES, AND, IN SUCH CASES, THE STATED EXCLUSIONS DO NOT APPLY. PYMNTS RESERVES THE RIGHT AND SHOULD NOT BE LIABLE SHOULD IT EXERCISE ITS RIGHT TO MODIFY, INTERRUPT, OR DISCONTINUE THE AVAILABILITY OF THE CONTENT OR ANY COMPONENT OF IT WITH OR WITHOUT NOTICE.\nPYMNTS SHALL NOT BE LIABLE FOR ANY DAMAGES WHATSOEVER, AND, IN PARTICULAR, SHALL NOT BE LIABLE FOR ANY SPECIAL, INDIRECT, CONSEQUENTIAL, OR INCIDENTAL DAMAGES, OR DAMAGES FOR LOST PROFITS, LOSS OF REVENUE, OR LOSS OF USE, ARISING OUT OF OR RELATED TO THE CONTENT, WHETHER SUCH DAMAGES ARISE IN CONTRACT, NEGLIGENCE, TORT, UNDER STATUTE, IN EQUITY, AT LAW, OR OTHERWISE, EVEN IF PYMNTS HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\nSOME JURISDICTIONS DO NOT ALLOW FOR THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, AND IN SUCH CASES, SOME OF THE ABOVE LIMITATIONS DO NOT APPLY. THE ABOVE DISCLAIMERS AND LIMITATIONS ARE PROVIDED BY PYMNTS AND ITS PARENTS, AFFILIATED AND RELATED COMPANIES, CONTRACTORS, AND SPONSORS, AND EACH OF ITS RESPECTIVE DIRECTORS, OFFICERS, MEMBERS, EMPLOYEES, AGENTS, CONTENT COMPONENT PROVIDERS, LICENSORS, AND ADVISERS.\nComponents of the content original to and the compilation produced by PYMNTS is the property of PYMNTS and cannot be reproduced without its prior written permission."
    },
    {
      "url": "https://www.fhfa.gov/data/dashboard/nmdb-outstanding-residential-mortgage-statistics",
      "text": "Accessibility Help\nSpecial Instructions for users with disabilities, keyboard users, and screen reader technologies.\n- Data filter navigation: When a user changes any criteria, all other parts of the page layout updates filtered data accordingly. Once you navigate out of the filter area, the information you selected is present in the other sections.\n- Data visualization graph/chart navigation: This section presents the data visually in graph/chart format. The information contained within is fully provided in the export/copy features.\n- Buttons for export/copy navigation: Users of a screen reader should limit themselves to \"Export to CSV\", and \"Copy\". Color-blind users can use mouse and/or download CSV file.\nIf you require special assistance with navigation, please contact the FHFA Webmaster at FHFAWebmaster@FHFA.gov , 202-649-3813, TTY users should use #711.\nAbout\nNational Mortgage Database (NMDB®) Aggregate Statistics include summary statistics derived from aggregating data in the NMDB. The NMDB is a de-identified loan-level database of closed-end first-lien residential mortgages, containing a nationally representative 5 percent sample of mortgages in the United States. To make NMDB statistics available to the general public, FHFA produces the NMDB Aggregate Statistics.\nFor more information about the NMDB, refer to the National Mortgage Database Technical Documentation.\nFor more information about NMDB Aggregate Statistics, refer to the NMDB Aggregate Statistics Data Dictionary and Technical Notes.\nQuestions or Feedback: Please contact the NMDB team at nmdbdata@fhfa.gov\nDisplay Settings: The Dashboards are optimized for Display settings of 100%. If the dashboard is not displaying properly in your browser, try adjusting the display settings. On most PCs Display settings can be found in the Settings menu."
    }
  ],
  "argos_summary": "Adjustable‑rate mortgages that surged during the Fed’s 2022‑23 rate hikes are now pushing many U.S. homeowners into a paycheck‑to‑paycheck cycle. As SOFR‑linked ARM rates climb to 4.39% from 2.91%, monthly payments on a $400k loan jump from $1,667 to $2,001, and 42% of ARM holders have cut discretionary spending versus 31% of fixed‑rate holders. Nearly half are using credit cards for essentials, and 46% of ARM owners report increased credit usage, signaling a liquidity squeeze that could dampen consumer demand and pressure the U.S. dollar. The Fed’s continued pause or potential rate cuts could moderate the impact, but the lagged effect of rising mortgage costs remains a key catalyst for near‑term consumption softness.",
  "argos_id": "KX6AOMQZ5"
}