{
  "url": "https://finance.yahoo.com/news/tesla-asks-court-throw-big-213908674.html",
  "authorsByline": "BERNARD CONDON",
  "articleId": "99c121d49e0640e187b91e103e731911",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T21:39:08+00:00",
  "addDate": "2025-08-29T21:47:52.538208+00:00",
  "refreshDate": "2025-08-29T21:47:52.538211+00:00",
  "score": 1.0,
  "title": "Tesla asks court to throw out big damage award in crash by arguing comments about Musk misled jury",
  "description": "The car company run by Elon Musk asked a federal court Friday to dismiss massive damages awarded to victims of a deadly crash, arguing that their lawyers had misled the jury by improperly bringing up the billionaire during the trial.  The filing in Miami federal court seeks to overturn the $243 million award after a 22-year old student out stargazing was flung through the air to her death by a runaway Tesla equipped with Autopilot features that Musk had talked up for years.  A jury earlier this month found that the speeding Tesla driver was mostly to blame but Tesla was also responsible because of faulty technology.",
  "content": "NEW YORK (AP) — The car company run by Elon Musk asked a federal court Friday to dismiss massive damages awarded to victims of a deadly crash, arguing that their lawyers had misled the jury by improperly bringing up the billionaire during the trial.\n\nThe filing in Miami federal court seeks to overturn the $243 million award after a 22-year old student out stargazing was flung through the air to her death by a runaway Tesla equipped with Autopilot features that Musk had talked up for years. A jury earlier this month found that the speeding Tesla driver was mostly to blame but Tesla was also responsible because of faulty technology.\n\nThe case has been watched closely by carmakers racing to develop fully self-driving features. They fear it could portend massive liability risks should future juries reviewing accidents decide carmakers are also to blame even when drivers act recklessly.\n\n“If the verdict is allowed to stand, it will chill innovation, harm road safety and invite future juries to punish manufacturers who bring new safety features to market,” the company said in the filing.\n\nTesla is also arguing that opposing lawyers “led the jury astray” by introducing “highly prejudicial but irrelevant evidence” suggesting Tesla had hid or lost video and data that, after it was dug up by the opposing side, helped recreate what went wrong moments before the crash. Tesla had said that it made a mistake in not offering up the evidence earlier and did not do that deliberately.\n\nMusk had taken a big chance by allowing the case to go to trial at a pivotal moment for his electric car company. He is trying to convince Americans that his self-driving technology, improved since the 2019 crash, can be trusted amid ambitious plans to roll out driverless Tesla robotaxis around the country.\n\nMany similar cases against Tesla had either been dismissed or been settled by the company before going to trial.\n\nThe plaintiff lawyers revealed in a court filing last week that they had told Tesla that they were willing to accept $60 million to settle. But Tesla refused. In the end, the jury decided on compensatory and punitive damages for the family of the killed Naibel Benavides and her boyfriend, Dillon Angulo, amounting to four times that amount.\n\nThe filing by Tesla on Friday asked the judge to grant it a new trial, throw out the award or at least vastly reduce it.\n\nThe jury held that Tesla bore significant responsibility because its technology failed even though the driver had admitted he was wrong to be distracted by his cellphone. The driver had settled separately with the Benavides family and Angulo. Tesla has said the technology had nothing to do with the crash.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/musk-austin-robotaxis-incidents-tesla-autonomous-selfdriving-0e32a7613a6c41c20ce258dbc5ec2cba",
    "https://finance.yahoo.com/quote/TSLA/",
    "https://apnews.com/article/tesla-miami-musk-benavides-selfdriving-autopilot-autonomous-vehicles-c342f2716b1ec4e9ede09b8e958751b7",
    "https://www.yahoo.com/people/elon-musk/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tesla",
      "weight": 0.10268193
    },
    {
      "name": "driverless Tesla robotaxis",
      "weight": 0.09833834
    },
    {
      "name": "future juries",
      "weight": 0.08853556
    },
    {
      "name": "jury",
      "weight": 0.08128002
    },
    {
      "name": "big damage award",
      "weight": 0.076737516
    },
    {
      "name": "new safety features",
      "weight": 0.07132605
    },
    {
      "name": "Miami federal court",
      "weight": 0.07012709
    },
    {
      "name": "massive damages",
      "weight": 0.06735964
    },
    {
      "name": "opposing lawyers",
      "weight": 0.06585756
    },
    {
      "name": "faulty technology",
      "weight": 0.06300306
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.79150390625
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.67041015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.45703125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.35595703125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.31982421875
    }
  ],
  "sentiment": {
    "positive": 0.052869536,
    "negative": 0.72948515,
    "neutral": 0.21764523
  },
  "summary": "Tesla, the car company run by Elon Musk, has asked a federal court in Miami to dismiss $243 million in damages awarded to victims of a fatal car crash, arguing that their lawyers misled the jury by bringing up the billionaire during the trial. The lawsuit was brought after a 22-year-old student was killed by a runaway Tesla with Autopilot features. The jury found that the speeding Tesla driver was primarily responsible for the accident, but Tesla was also responsible for faulty technology. The case has been watched closely by carmakers who fear it could pose significant liability risks for future carmakers even if they find fault with drivers' actions even when they act recklessly. The company argues that opposing lawyers introduced \"highly prejudicial but irrelevant evidence\" suggesting Tesla hid or lost video and data that helped recreate what went wrong moments before the crash.",
  "shortSummary": "Tesla seeks to overturn a $243 million wrongful death award for a fatal crash involving its Autopilot system, arguing that jurors misled them during the trial.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "75e87576cb9f4442a16abd8c4cef6f96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/quote/TSLA/",
      "text": "Tesla, Inc. (TSLA)\n- Previous Close\n345.98 - Open\n347.23 - Bid 333.64 x 500\n- Ask 351.17 x 100\n- Day's Range\n331.70 - 348.75 - 52 Week Range\n207.03 - 488.54 - Volume\n80,774,223 - Avg. Volume\n98,913,161 - Market Cap (intraday)\n1.077T - Beta (5Y Monthly) 2.33\n- PE Ratio (TTM)\n196.39 - EPS (TTM)\n1.70 - Earnings Date Oct 22, 2025\n- Forward Dividend & Yield --\n- Ex-Dividend Date --\n- 1y Target Est\n306.32\nTesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also provides services and repairs to its energy product customers, including under warranty; and various financing options to its residential customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.\nwww.tesla.com125,665\nFull Time Employees\nDecember 31\nFiscal Year Ends\nSector\nIndustry\nRecent News: TSLA\nView MoreRelated Videos: TSLA\nPerformance Overview: TSLA\nTrailing total returns as of 8/29/2025, which may include dividends or other distributions. Benchmark is S&P 500 (^GSPC) .\nYTD Return\n1-Year Return\n3-Year Return\n5-Year Return\nCompare To: TSLA\nSelect to analyze similar companies using key performance metrics; select up to 4 stocks.\nStatistics: TSLA\nView MoreValuation Measures\nMarket Cap\n1.12T\nEnterprise Value\n1.09T\nTrailing P/E\n205.94\nForward P/E\n185.19\nPEG Ratio (5yr expected)\n6.52\nPrice/Sales (ttm)\n13.12\nPrice/Book (mrq)\n14.43\nEnterprise Value/Revenue\n11.78\nEnterprise Value/EBITDA\n80.66\nFinancial Highlights\nProfitability and Income Statement\nProfit Margin\n6.34%\nReturn on Assets (ttm)\n2.91%\nReturn on Equity (ttm)\n8.18%\nRevenue (ttm)\n92.72B\nNet Income Avi to Common (ttm)\n5.88B\nDiluted EPS (ttm)\n1.70\nBalance Sheet and Cash Flow\nTotal Cash (mrq)\n36.78B\nTotal Debt/Equity (mrq)\n16.82%\nLevered Free Cash Flow (ttm)\n1.34B\nResearch Analysis: TSLA\nView MoreResearch Reports: TSLA\nView MoreLarge Cap US Pick List - August 2025\nThis pick list highlights constituents of the Morningstar US Large Cap Index that we believe offer investors the best risk-adjusted return prospects. Stocks of large-cap companies where neither growth nor value characteristics predominate. Stocks in the top 70% of the capitalization of the U.S. equity market are defined as large cap.\nTesla: Board Announces New Pay Package for CEO Elon Musk\nTesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network.\nRatingPrice TargetTesla: Board Announces New Pay Package for CEO Elon Musk\nTesla is a vertically integrated battery electric vehicle automaker and developer of autonomous driving software. The company has multiple vehicles in its fleet, which include luxury and midsize sedans, crossover SUVs, a light truck, and a semi truck. Tesla also plans to begin selling more affordable vehicles, a sports car, and offer a robotaxi service. Global deliveries in 2024 were a little below 1.8 million vehicles. The company sells batteries for stationary storage for residential and commercial properties including utilities and solar panels and solar roofs for energy generation. Tesla also owns a fast-charging network.\nRatingPrice TargetLowering EPS estimates; CEO Musk sees 'rough quarters ahead'\nTesla Inc. manufactures and sells electric vehicles, and energy generation and storage systems. The company was founded in 2003 and went public in June 2010 with an initial public offering at $17 per share. Tesla has approximately 49,000 employees. It recently moved its headquarters to Austin, Texas from Palo Alto, California and its stock is a component of the S&P 500 index.\nRatingPrice Target\nTop Analysts: TSLA\nView MoreOverall Score\nDiscover which analysts rank highest for TSLA overall weighted by direction, price target, and price movement.\nLearn MoreDirection Score\nDiscover which analysts rank highest on predicting the directional movement of TSLA.\nLearn MorePrice Score\nDiscover which analysts rank highest on predicting the price target of TSLA.\nLearn More"
    },
    {
      "url": "https://apnews.com/article/tesla-miami-musk-benavides-selfdriving-autopilot-autonomous-vehicles-c342f2716b1ec4e9ede09b8e958751b7",
      "text": "Jury orders Tesla to pay more than $240 million in Autopilot crash case\nJury orders Tesla to pay more than $240 million in Autopilot crash case\nMIAMI (AP) — A Miami jury decided that Elon Musk’s car company Tesla was partly responsible for a deadly crash in Florida involving its Autopilot driver assist technology and must pay the victims more than $240 million in damages.\nThe federal jury held that Tesla bore significant responsibility because its technology failed and that not all the blame can be put on a reckless driver, even one who admitted he was distracted by his cellphone before hitting a young couple out gazing at the stars. The decision comes as Musk seeks to convince Americans his cars are safe enough to drive on their own as he plans to roll out a driverless taxi service in several cities in the coming months.\nThe decision ends a four-year long case remarkable not just in its outcome but that it even made it to trial. Many similar cases against Tesla have been dismissed and, when that didn’t happen, settled by the company to avoid the spotlight of a trial.\n“This will open the floodgates,” said Miguel Custodio, a car crash lawyer not involved in the Tesla case. “It will embolden a lot of people to come to court.”\nThe case also included startling charges by lawyers for the family of the deceased, 22-year-old, Naibel Benavides Leon, and for her injured boyfriend, Dillon Angulo. They claimed Tesla either hid or lost key evidence, including data and video recorded seconds before the accident. Tesla said it made a mistake after being shown the evidence and honestly hadn’t thought it was there.\n“We finally learned what happened that night, that the car was actually defective,” said Benavides’ sister, Neima Benavides. “Justice was achieved.”\nTesla has previously faced criticism that it is slow to cough up crucial data by relatives of other victims in Tesla crashes, accusations that the car company has denied. In this case, the plaintiffs showed Tesla had the evidence all along, despite its repeated denials, by hiring a forensic data expert who dug it up.\n“Today’s verdict is wrong,” Tesla said in a statement, “and only works to set back automotive safety and jeopardize Tesla’s and the entire industry’s efforts to develop and implement lifesaving technology,” They said the plaintiffs concocted a story ”blaming the car when the driver – from day one – admitted and accepted responsibility.”\nIn addition to a punitive award of $200 million, the jury said Tesla must also pay $43 million of a total $129 million in compensatory damages for the crash, bringing the total borne by the company to $243 million.\n“It’s a big number that will send shock waves to others in the industry,” said financial analyst Dan Ives of Wedbush Securities. “It’s not a good day for Tesla.”\nTesla said it will appeal.\nEven if that fails, the company says it will end up paying far less than what the jury decided because of a pre-trial agreement that limits punitive damages to three times Tesla’s compensatory damages. Translation: $172 million, not $243 million. But the plaintiff says their deal was based on a multiple of all compensatory damages, not just Tesla’s, and the figure the jury awarded is the one the company will have to pay.\nIt’s not clear how much of a hit to Tesla’s reputation for safety the verdict in the Miami case will make. Tesla has vastly improved its technology since the crash on a dark, rural road in Key Largo, Florida, in 2019.\nBut the issue of trust generally in the company came up several times in the case, including in closing arguments Thursday. The plaintiffs’ lead lawyer, Brett Schreiber, said Tesla’s decision to even use the term Autopilot showed it was willing to mislead people and take big risks with their lives because the system only helps drivers with lane changes, slowing a car and other tasks, falling far short of driving the car itself.\nSchreiber said other automakers use terms like “driver assist” and “copilot” to make sure drivers don’t rely too much on the technology.\n“Words matter,” Schreiber said. “And if someone is playing fast and lose with words, they’re playing fast and lose with information and facts.”\nSchreiber acknowledged that the driver, George McGee, was negligent when he blew through flashing lights, a stop sign and a T-intersection at 62 miles an hour before slamming into a Chevrolet Tahoe that the couple had parked to get a look at the stars.\nThe Tahoe spun around so hard it was able to launch Benavides 75 feet through the air into nearby woods where her body was later found. It also left Angulo, who walked into the courtroom Friday with a limp and cushion to sit on, with broken bones and a traumatic brain injury.\nBut Schreiber said Tesla was at fault nonetheless. He said Tesla allowed drivers to act recklessly by not disengaging the Autopilot as soon as they begin to show signs of distraction and by allowing them to use the system on smaller roads that it was not designed for, like the one McGee was driving on.\n“I trusted the technology too much,” said McGee at one point in his testimony. “I believed that if the car saw something in front of it, it would provide a warning and apply the brakes.”\nThe lead defense lawyer in the Miami case, Joel Smith, countered that Tesla warns drivers that they must keep their eyes on the road and hands on the wheel yet McGee chose not to do that while he looked for a dropped cellphone, adding to the danger by speeding. Noting that McGee had gone through the same intersection 30 or 40 times previously and hadn’t crashed during any of those trips, Smith said that isolated the cause to one thing alone: “The cause is that he dropped his cellphone.”\nThe auto industry has been watching the case closely because a finding of Tesla liability despite a driver’s admission of reckless behavior would pose significant legal risks for every company as they develop cars that increasingly drive themselves.\n__\nCondon reported from New York.\n__\nEarlier versions of this story incorrectly reported that the jury ordered Tesla to pay $329 million and that the compensatory damages totaled $49 million."
    },
    {
      "url": "https://apnews.com/article/musk-austin-robotaxis-incidents-tesla-autonomous-selfdriving-0e32a7613a6c41c20ce258dbc5ec2cba",
      "text": "Musk’s ‘robotaxis’ draw regulatory scrutiny after video shows one driving in an opposing lane\nMusk’s ‘robotaxis’ draw regulatory scrutiny after video shows one driving in an opposing lane\nFederal traffic safety regulators are looking into suspected problems with Elon Musk’s test run of self-driving “robotaxis” in Texas after videos surfaced showing them braking suddenly or going straight through an intersection from a turning lane and driving down the wrong side of the road.\nThe National Highway Traffic Safety Administration said Tuesday that it has asked Tesla for information about the apparent errors. Though many other videos show robotaxis driving perfectly, if regulators find any major issues, that would likely raise questions about Musk’s repeated statements that the robotaxis are safe and his claim that Tesla will dominate a future in which nearly all cars on road will have no one behind the wheel — or even need a steering wheel at all.\n“NHTSA is aware of the referenced incidents and is in contact with the manufacturer to gather additional information,” the agency said in a statement.\nPassengers in Tesla robotaxis on the road in Austin, Texas, have generally been impressed, and the stock rose 8% Monday. Investors grew more cautious Tuesday after news of NHTSA’s inquiry, and the stock fell more than 2%.\nTesla did not immediately respond to a request for comment.\nA bullish Tesla financial analyst who was driven around in a robotaxi on Sunday when the test runs began said his ride was perfect and suggested the videos on X and YouTube showing errors were no big deal.\n“Any issues they encounter will be fixed,” said Wedbush Securities’ Dan Ives, calling the test a “huge success” in the past three days “despite the skeptics.”\nOne of those skeptics, a Telemetry Insight expert in car technology, said the videos were alarming enough that the tests as currently run should be halted.\n“The system has always had highly erratic performance, working really well a lot of the time but frequently making random and inconsistent but dangerous errors,” said Sam Abuelsamid in a text, referring to Tesla’s self-driving software. “This is not a system that should be carrying members of the public or being tested on public roads without trained test drivers behind the wheel.”\nIn one video, a Tesla moves into a lane with a big yellow arrow indicating it is for left turns only but then goes straight through the intersection instead, entering an opposing lane on the other side. The car seems to realize it made some mistake and begins to swerve several times, with the steering wheel jerking back and forth, before eventually settling down.\nBut the Tesla proceeds in the opposing lane for 10 seconds. At the time, there was no oncoming traffic.\nThe passenger in the car who posted the video, money manager Rob Maurer, shrugged off the incident.\n“There are no vehicles anywhere in sight, so this wasn’t a safety issue,” Maurer said in commentary accompanying his video. “I didn’t feel uncomfortable in the situation.”\nAnother video shows a Tesla stopping twice suddenly in the middle of the road, possibly responding to the flashing lights of police cars. But the police are obviously not interested in the Tesla or traffic in front or behind it because they have parked on side roads not near it, apparently responding to an unrelated event.\nFederal regulators opened an investigation last year into how Teslas with what Musk calls Full Self-Driving have responded in low-visibility conditions after several accidents, including one that was fatal. Tesla was forced a recall 2.4 million of its vehicles at the time.\nMusk has said his Teslas using Full Self-Driving are safer than human drivers and his robotaxis using a newer, improved version of the system will be so successful so quickly that he will be able to deploy hundreds of thousands of them on the road by the end of next year.\nEven if the Austin test goes well, though, the billionaire faces big challenges. Other self-driving companies have launched taxis, including Amazon’s Zoox and current market leader Waymo, which is not only is picking up passengers in Austin, but several other cities. The company recently announced it had clocked its 10 millionth paid ride.\nMusk needs a win in robotaxis. His work on in Trump administration as cost-cutting czar has alienated many buyers among Tesla’s traditional environmentally conscious and liberal base in the U.S., tanking sales. Buyers in Europe having balked, too, after Musk embraced some extreme right-wing politicians earlier this year in both Britain and Germany."
    }
  ],
  "argos_summary": "Tesla faced a $243 million verdict in a Miami jury case over an Autopilot crash, with the company seeking to overturn it. The jury found Tesla partly responsible for the fatal accident, citing faulty technology despite driver negligence. Tesla argues the evidence was misrepresented and that the verdict could chill autonomous vehicle innovation. The case highlights legal risks for automakers developing self‑driving features and may influence investor sentiment and regulatory scrutiny.",
  "argos_id": "LJZYDXVL3"
}