{
  "url": "https://www.nasdaq.com/articles/us-stocks-move-back-downside-following-recent-upward-trend",
  "authorsByline": "RTTNews",
  "articleId": "93dcbc459d2744bba4dc0be8e1b135f4",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "http://nasdaq.com/sites/acquia.prod/files/rttnews_article/wallstreet-sep04_19sep23-m.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T20:14:00+00:00",
  "addDate": "2025-08-29T20:34:43.150133+00:00",
  "refreshDate": "2025-08-29T20:34:43.150135+00:00",
  "score": 1.0,
  "title": "U.S. Stocks Move Back To The Downside Following Recent Upward Trend",
  "description": "(RTTNews) - After trending higher over the past few sessions, stocks moved back to the downside during trading on Friday. The major averages all moved lower on the day, with the tech-heavy Nasdaq posting a particularly steep loss.",
  "content": "(RTTNews) - After trending higher over the past few sessions, stocks moved back to the downside during trading on Friday. The major averages all moved lower on the day, with the tech-heavy Nasdaq posting a particularly steep loss.\n\nThe major averages ended the day off their lows of the session but still in negative territory. The Nasdaq slumped 249.61 points or 1.2 percent to 21,455.55, the S&P 500 slid 41.60 points or 0.6 percent to 6,460.26 and the Dow dipped 92.02 points or 0.2 percent to 45,544.88.\n\nWith the pullback on the day, the major averages closed slightly lower for the week. The S&P 500 edged down by 0.1 percent, while the Dow and the Nasdaq both slipped by 0.2 percent.\n\nThe weakness on Wall Street may partly have reflected profit taking, as some traders looked to cash in on the recent strength in the markets.\n\nTrading has been somewhat choppy over the past few sessions, but the S&P 500 still managed to end Thursday's trading at a new record closing high.\n\nMeanwhile, traders have seemingly shrugged off a typically closely watched Commerce Department report showing U.S. consumer prices increased in line with estimates in the month of July.\n\nWhile the data has increased confidence the Federal Reserve will lower interest rates next month, a September rate cut may already have been priced into the markets.\n\nCME Group's FedWatch toll is currently indicating an 87.1 percent chance the Fed will lower rates by a quarter point at its next monetary policy meeting.\n\nThe Commerce Department said its personal consumption expenditures (PCE) price index rose by 0.2 percent in July after climbing 0.3 percent in June. The uptick matched expectations.\n\nThe annual rate of growth by the PCE price index in July came in unchanged from June at 2.6 percent, which was also in line with estimates.\n\nExcluding food and energy prices, the core PCE price index rose by 0.3 percent in July, matching the increase seen in June as well as expectations.\n\nThe annual rate of growth by the core PCE price index ticked up to 2.9 in July from 2.8 percent in June. The slight acceleration also matched estimates.\n\nTraders also kept an eye on developments in Washington, D.C., where a District Court Judge held a hearing on Federal Reserve Governor Lisa Cook's request to temporarily block President Donald Trump's attempt to remove her from her position.\n\nThe hearing ended without District Judge Jia M. Cobb issuing a ruling, leaving Cook's fate up in the air going into the long week.\n\nSemiconductor stocks turned in some of the market's worst performances on the day, dragging the Philadelphia Semiconductor Index down by 3.2 percent.\n\nConsiderable weakness was also visible among computer hardware stocks, with the NYSE Arca Computer Hardware Index tumbling by 2.0 percent after ending the previous session at a record closing high.\n\nDell Technologies (DELL) helped lead the sector lower, plunging by 8.9 percent after reporting better than expected second quarter results but providing disappointing guidance.\n\nOn the other hand, gold stocks showed a strong move to the upside along with the price of the precious metal, driving the NYSE Arca Gold Bugs Index up by 3.3 percent.\n\nIn overseas trading, stock markets across the Asia-Pacific region turned in a mixed performance during trading on Friday. Japan's Nikkei 225 Index dipped by 0.3 percent, while China's Shanghai Composite Index rose by 0.4 percent.\n\nMeanwhile, the major European markets all moved to the downside on the day. While the French CAC 40 Index slid by 0.8 percent, the German DAX Index declined by 0.6 percent and the U.K.'s FTSE 100 Index fell by 0.3 percent.\n\nIn the bond market, treasuries gave back ground after trending higher over the past few sessions. As a result, the yield on the benchmark ten-year note, which moves opposite of its price, rose by 2.0 basis points to 4.227 percent.\n\nFollowing the long Labor Day weekend, next week's trading may be impacted by reaction to the closely watched monthly jobs report along with reports on manufacturing and service sector activity.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "stock markets",
      "weight": 0.0786356
    },
    {
      "name": "U.S. consumer prices",
      "weight": 0.06818034
    },
    {
      "name": "U.S. Stocks",
      "weight": 0.06578419
    },
    {
      "name": "computer hardware stocks",
      "weight": 0.064930014
    },
    {
      "name": "Semiconductor stocks",
      "weight": 0.06388827
    },
    {
      "name": "gold stocks",
      "weight": 0.06364022
    },
    {
      "name": "Shanghai Composite Index",
      "weight": 0.062230866
    },
    {
      "name": "stocks",
      "weight": 0.061561536
    },
    {
      "name": "overseas trading",
      "weight": 0.05910869
    },
    {
      "name": "District Judge Jia M. Cobb",
      "weight": 0.056621622
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9873046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.93603515625
    }
  ],
  "sentiment": {
    "positive": 0.0910335,
    "negative": 0.78257895,
    "neutral": 0.1263875
  },
  "summary": "The major averages in the U.S. moved back to the downside during trading on Friday, with the tech-heavy Nasdaq posting a significant loss of 249.61 points or 1.2 percent to 21,455.55, the S&P 500 slid 41.60 points or 0.6 percent to 6,460.26, and the Dow dipped 92.02 points to 45,544.88. The major averages closed slightly lower for the week. The weakness may partly reflect profit taking as some traders look to cash in on the recent strength in the markets. Meanwhile, traders ignored a Commerce Department report showing that US. consumer prices increased in line with estimates in July, matching expectations. While the data has increased confidence in the Federal Reserve, a September rate cut may already have been priced into the markets, CME Group's FedWatch toll indicates an 87.1 percent chance the Fed will lower rates at its next monetary policy meeting. The decline in the major European markets was also seen in the bond market.",
  "shortSummary": "US stocks moved lower on Friday, with the Nasdaq suffering a 1.2% loss, while gold prices rose amid Fed interest rate speculation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "412e93e0713d44c6a46cc5f3f1f7ccf6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "US stocks fell on Friday, with the Nasdaq dropping 1.2% and the S&P 500 slipping 0.6%, partly due to profit taking after recent gains. The Commerce Department’s July PCE data matched expectations, keeping the market’s 87% probability of a 25‑basis‑point Fed rate cut in September largely priced in. Semiconductor and computer hardware indices suffered significant losses, while gold stocks and the metal’s price rose. International markets were mixed, with Asia‑Pacific showing a slight gain in China and a dip in Japan, and European indices trending lower. Treasury yields rose 2 basis points to 4.227% on the ten‑year note, and traders are awaiting next week’s jobs report for further direction.",
  "argos_id": "MEZ3P47LC"
}