{
  "url": "https://www.dailymail.co.uk/sport/tennis/article-15048659/Tennis-player-cap-SNATCHED-child-selfish-US-Open-fan-responds-shocking-act-issues-message-youngster-centre-row.html",
  "authorsByline": "Robert Summerscales",
  "articleId": "83254b682f144292bd5117ada4e99618",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/29/15/101665961-0-image-m-30_1756477387924.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-29T23:21:00+01:00",
  "addDate": "2025-08-29T22:38:28.919468+00:00",
  "refreshDate": "2025-08-29T22:38:28.919469+00:00",
  "score": 1.0,
  "title": "Tennis star whose cap was SNATCHED from child by selfish fan responds",
  "description": "Kamil Majchrzak has tracked down the young boy who was left devastated when an adult fan snatched a souvenir cap intended for him in the aftermath of the Pole's stunning US Open victory.",
  "content": "Kamil Majchrzak has tracked down the young boy who was left devastated when an adult fan snatched a souvenir cap intended for him in the aftermath of the Pole's stunning US Open victory.\n\nThe 29-year-old, who pulled off the biggest win of his career by beating No 9 seed Karen Khachanov in a marathon five-set thriller on Thursday, was filmed removing his cap and trying to hand it to a child in the crowd on Court 11.\n\nBut in ugly scenes that quickly went viral, a man standing next to the boy reached out, grabbed the cap and stuffed it into his bag — leaving the youngster looking crestfallen and asking 'what are you doing?' as Majchrzak walked away, unaware of what had just happened.\n\nThe clip sparked fury online, with fans branding the unidentified man 'selfish' and 'a jerk' for stealing a moment that should have belonged to a child.\n\nMajchrzak moved to put things right on Friday, taking to Instagram to appeal for help in finding the boy.\n\nAfter the match I didn't record that my cap didn't get to the boy,' he wrote. 'Thanks to @asicstennis I've got enough caps, so I'm prepared for that. Hey guys, could you help me find the kid from my match. If it's you (or your parents see this), please send me a DM.'\n\nJust hours later, the Polish star confirmed the boy had been located. Sharing the same pictures of the incident on his story, he added: 'I am impressed by the power of the internet. We got it! All good now.'\n\nThe heart-warming resolution capped a dramatic 24 hours for Majchrzak, whose on-court exploits have already made headlines in New York.\n\nOn Thursday he produced a performance of extraordinary grit to topple Khachanov 2-6, 6-7(4), 6-4, 7-5, 7-6(5) in four and a half hours — saving five match points along the way.\n\nIt marked his first win over a Top 10 opponent and matched his best-ever run at the US Open, where he is now into the third round.\n\nKhachanov, who had beaten Majchrzak at Wimbledon in July, appeared in full control after taking the first two sets, breaking twice in the opener and edging a tight second in a tiebreak.\n\nBut the Pole refused to fold, taking the third set as errors crept into his opponent's game.\n\nHe held firm again in the fourth before breaking late to force a decider, and even when Khachanov opened a 5-3 lead and served for the match, Majchrzak dug deep to fend off three match points and break back.\n\nTwo more slipped away for Khachanov in the next game as Majchrzak again refused to yield, ultimately forcing a deciding tiebreak.\n\nThere he raced into an early lead and, despite brief resistance from the Russian, held his nerve to complete a famous comeback 10-5.\n\n'This is the biggest win of my career,' Majchrzak said afterwards. 'It shows I can compete with the very best and gives me so much belief.'\n\nHis reward is a third-round meeting with Swiss qualifier Leandro Riedi, ranked 435 in the world but also coming off a giant-killing win after upsetting No 19 seed Francisco Cerundolo.\n\nVictory would see Majchrzak reach the last 16 of a Grand Slam for the first time.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Majchrzak",
      "weight": 0.08541518
    },
    {
      "name": "Kamil Majchrzak",
      "weight": 0.08388689
    },
    {
      "name": "enough caps",
      "weight": 0.070182994
    },
    {
      "name": "Karen Khachanov",
      "weight": 0.06542251
    },
    {
      "name": "Khachanov",
      "weight": 0.062096164
    },
    {
      "name": "selfish fan",
      "weight": 0.06174818
    },
    {
      "name": "Swiss qualifier Leandro Riedi",
      "weight": 0.053402953
    },
    {
      "name": "US Open",
      "weight": 0.052453335
    },
    {
      "name": "child",
      "weight": 0.052139305
    },
    {
      "name": "fans",
      "weight": 0.049809214
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.96337890625
    },
    {
      "name": "/News/Sports News",
      "score": 0.92431640625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.85986328125
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.456298828125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.39990234375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.340576171875
    }
  ],
  "sentiment": {
    "positive": 0.11423147,
    "negative": 0.5925689,
    "neutral": 0.2931997
  },
  "summary": "Kamil Majchrzak, a Polish tennis player, has tracked down the young boy who was snatched from his souvenir cap following his US Open victory. The incident occurred after Majchzak won the biggest win of his career by beating No 9 seed Karen Khachanov in a five-set thriller. The young boy was left devastated when an adult fan snatched the cap and stuffed it into his bag. The footage sparked outrage online, with fans branding the man'selfish' and 'a jerk' for stealing a moment that should have belonged to a child. Following the incident, Majchrsrzk took to Instagram to ask for help in finding the boy. He confirmed the boy had been located hours later.",
  "shortSummary": "Kamil Majchrzak tracked down a boy whose cap was snatched from him after his US Open win, sparking controversy online.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f2e97a59f56f466e9456a4f891680b97",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Polish tennis star Kamil Majchrzak won a dramatic five‑set victory over Karen Khachanov at the US Open, marking his first top‑10 win and advancing to the third round. After the match, a fan snatched a souvenir cap intended for a child, sparking online outrage. Majchrzak publicly apologized, sought help to locate the boy, and later confirmed the child was found, resolving the incident. The match highlighted Majchrzak’s resilience, as he saved five match points and secured a 10‑5 tiebreak win in the final set.",
  "argos_id": "R0EI6BBQ1"
}