{
  "url": "https://www.yahoo.com/news/articles/blue-angels-arrive-2025-thunder-090523134.html",
  "authorsByline": "Katie Landeck, USA TODAY NETWORK - New England",
  "articleId": "f61f141f7a1345989e187aa0c2f4b555",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/zIbTBudxV0WxgcAmW0Glig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NTc7Y2Y9d2VicA--/https://media.zenfs.com/en/portsmouth-herald/0c2e7a33850125cf2a5e3bc60fdf8096",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T09:05:23+00:00",
  "addDate": "2025-08-30T09:48:20.399590+00:00",
  "refreshDate": "2025-08-30T09:48:20.399595+00:00",
  "score": 1.0,
  "title": "When will the Blue Angels arrive for 2025 Thunder Over New Hampshire Air Show?",
  "description": "Thunder Over New Hampshire Air Show is bringing the Blue Angels to the state. Here's when they're expected to fly in.",
  "content": "The U.S. Navy Blue Angels are about to fly back into town.\n\nThe 2025 Thunder over New Hampshire Air Show returns to Pease Air National Guard Base on Sept. 6 and 7, where the six powerful F/A-18 Hornet fighter jets that fly as little as 18 inches apart are expected to entertain over 80,000 people over the weekend.\n\nBut, first they have to get to town, which means there is an early chance to get to see them in the air.\n\nWhen exactly the Blue Angels will come to town is subject to change, but event spokesman Rob Nichols said they are expected to arrive on Tuesday.\n\nBut, if you miss the arrival, there's always the show itself, which promises to be far more impressive.\n\nHow to go to the Thunder over NH Air Show\n\nAdmission to the air show at Pease Air National Guard Base, located at 302 Newmarket St. in Newington, is free. Premium covered and box seats have sold out.\n\nWhile admission is free, parking onsite requires a pass, which have sold out.\n\nBut, there are other options. People can still walk, bike to or be dropped off at the air show, and there is a nearby off-site parking area at the Mall at Fox Run in Newington, where shuttles will transport people to the air show gates. Some shuttle passes are still available both days as of Aug. 28.\n\nGates for the show open at 9 a.m. The Patriot Plaza, the aircraft on display, vendors and concessions on the runway will open about 9:30 a.m. The national anthem will be played at noon and performances begin right after that and go until about 4 p.m. both days. The gates and parking lots close at 5 p.m.\n\nWho are air show performers joining the Blue Angels at Pease?\n\nThe Blue Angels will be joined by the Marines' C-130 “Fat Albert,” the Air Force's F-35 Lightning II Team, KC-46A Pegasus, UH-60 Blackhawk, U.S. Para Commandos, JackAces P-51 Demo, Michael Goulian, Smoke-N-Thunder Jet Car and the Third Strike Wingwalking team.\n\nThis article originally appeared on Portsmouth Herald: Blue Angels coming to NH for air show. Here's when they're expected",
  "medium": "Article",
  "links": [
    "https://www.yahoo.com/news/articles/want-thunder-over-nh-air-231402748.html",
    "https://thunderovernewhampshire.com/tickets/",
    "https://www.seacoastonline.com/story/lifestyle/things-to-do/2025/08/30/blue-angels-coming-thunder-over-nh-air-show-arrival/85883997007/",
    "https://www.seacoastonline.com/picture-gallery/entertainment/2025/08/01/blue-angels-prepare-for-2025-air-shows/85482657007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "air show",
      "weight": 0.10679447
    },
    {
      "name": "air show performers",
      "weight": 0.10313389
    },
    {
      "name": "Blue Angels",
      "weight": 0.095268935
    },
    {
      "name": "Pease Air National Guard Base",
      "weight": 0.09240269
    },
    {
      "name": "U.S. Para Commandos",
      "weight": 0.06473168
    },
    {
      "name": "F-35 Lightning II Team",
      "weight": 0.06420486
    },
    {
      "name": "Thunder Over New Hampshire Air Show",
      "weight": 0.0639182
    },
    {
      "name": "Thunder over New Hampshire Air Show",
      "weight": 0.0639182
    },
    {
      "name": "event spokesman Rob Nichols",
      "weight": 0.06383911
    },
    {
      "name": "the air show gates",
      "weight": 0.062041074
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.7666015625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.62451171875
    },
    {
      "name": "/News/Local News",
      "score": 0.5732421875
    },
    {
      "name": "/Law & Government/Military/Air Force",
      "score": 0.50830078125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.49609375
    },
    {
      "name": "/News/Other",
      "score": 0.378173828125
    }
  ],
  "sentiment": {
    "positive": 0.22595735,
    "negative": 0.1532501,
    "neutral": 0.62079257
  },
  "summary": "The U.S. Navy Blue Angels are expected to arrive for the 2025 Thunder Over New Hampshire Air Show on Sept. 6 and 7, where they will perform alongside six powerful F/A-18 Hornet fighter jets. The event is set to be held at Pease Air National Guard Base and is expected to attract over 80,000 people. While admission is free, parking onsite requires a pass, there are other options such as walking, bike, or being dropped off at the air show. The Blue Angels will be joined by other performers including the Marines' C-130 “Fat Albert”, the Air Force’s F-35 Lightning II Team, and the Third Strike Wingwalking team.",
  "shortSummary": "The Navy Blue Angels will arrive in New Hampshire for the 2025 Thunder over New Hampshire Air Show, with performances expected from various groups.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8a4dcd50f3df419d8835074ed05bfc5a",
  "places": [
    {
      "osmId": "7384952",
      "county": "Rockingham County",
      "state": "New Hampshire",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 43.089284649999996,
        "lon": -70.81947393724462
      }
    },
    {
      "osmId": "491452994",
      "county": "Rockingham County",
      "state": "New Hampshire",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 43.0965439,
        "lon": -70.8049444962299
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://thunderovernewhampshire.com/tickets/",
      "text": "PARKING UPDATE - All on-site parking has been reserved. There are a limited number of parking passes, and shuttle passes available for purchase.\nPlease visit our tickets page to purchase the passes.\nTickets and Parking Passes\nNeed your parking passes or Premium Seating tickets resent?\nFollow the link below.\nOn the ticket vendor page, select or type \"2025 Thunder Over New Hampshire Air Show\" in the \"Event You're Attending\" field, and then enter the email you used during purchase.\nShow general admission is free and does not require a ticket, but parking on site does require the reservation of a parking pass.\nMall at Fox Run Parking & Shuttle Service\nWe recently secured additional parking space for the Air Show. This lot will be located at the Mall at Fox Run. In order to get guests safely to and from the Air Show, we will have a shuttle service. Each person riding the shuttle must reserve a shuttle pass. These passes will cost $40 per adult and come with a free parking pass to park in the lot.\nKids ages 3 - 15 will receive a free shuttle pass when accompanied by a paid adult (up to four free kids per adult pass). Kids shuttle passes must be reserved in advance. There are limited numbers of shuttle passes available and will sell out in advance of the air show.\nHow the Shuttle Passes Work\n- Anyone with a shuttle pass will park at the Mall at Fox Run (50 Fox Run Rd, Newington, NH 03801).\n- Each person riding the shuttle must have a shuttle pass. The only exception is lap children; they do not need a pass.\n- Kids ages 3 - 15 will receive a free shuttle pass when accompanied by a paid adult (up to four free kids per adult pass).\n- When you purchase a shuttle pass, you will get a free parking pass, as well. The number of parking passes you receive depends on the number of shuttle passes you purchase.\n1-4 shuttle passes = 1 parking pass\n5-8 shuttle passes = 2 parking passes\n9-12 shuttle passes = 3 parking passes\n13-16 shuttle passes = 4 parking passes\n17-20 shuttle passes = 5 parking passes\nOther Important Items\n- All vehicles attempting to park in the Air Show designated lot at the Mall will require a parking pass.\n- You will receive a parking pass with the purchase of a shuttle pass.\n- Shuttle passes are limited and will cost $40 per adult for a round-trip pass.\n- Each paid adult will have the option of reserving up to 4 free shuttle passes for kids ages 3-15.\n- EACH PERSON RIDING THE SHUTTLE MUST HAVE A PASS. The only exception is lap children.\n- Parking will be located at the Mall at Fox Run (50 Fox Run Rd, Newington, NH 03801).\n- Bus shuttles will provide back-and-forth transportation from the Mall lot to nearby the South Entry Gate.\n- There will be bus shuttles equipped for handicap accessibility.\n- Shuttle passes and parking passes will be day-specific.\nSaturday: 61% Sold Out\nSunday: Limited Quantity Remaining\nThe Wildcat Club\nThe WILDCAT CLUB is a spacious, tented area designed for guests to enjoy shade and have access to tables and chairs for relaxation.\nTicket includes:\n- Complimentary beverages (non-alcoholic).\n- Access to non-public portable washrooms.\n- Premium outdoor seating along the flightline.\n- Children four and under are free when accompanied by a ticketed adult.\n- Free (Blue Lot) parking pass.\n*Please note: Space is limited each day. Ticket will be good only for the day for which it is purchased (Saturday, September 6 or Sunday, September 7). Guests purchasing Wildcat Club tickets will be provided a free (Blue Lot) parking pass at the conclusion of their transaction. **All ticket sales are final, no refunds, no rain checks.\nSaturday - SOLD OUT!\nSunday - SOLD OUT!\n*Advance tickets will be discounted significantly from regular pricing but ticket prices will increase without notice as more tickets are sold and the show gets closer to sold out.\nThe Patriot Club\nMembership in the PATRIOT CLUB represents the ultimate Air Show experience where guests will be pampered with top-shelf hospitality. This spacious and comfortable tented area located on prime show line position affords guests the best available viewing from the comfort of their reserved six-person umbrella table. Ideal for entertaining your family, friends, clients, or special guests in first-class style.\nGroup Membership includes:\n- A reserved umbrella table with seating for six on the club terrace right along the show line.\n- Spacious tented shade area.\n- Delicious catered breakfast buffet (between 9:00am – 10:30am).\n- Catered premium lunch from one of New Hampshire's top event caterers (between 11am - 1 pm).\n- Snacks, gourmet desserts, and ice cream.\n- Premium full-service bar.\n- Access to air-conditioned non-public portable washrooms.\n- Children four and under are free when accompanied by a ticketed adult.\n- Includes on-site parking (2 Blue Lot parking passes per table)\n- Includes right of first refusal for membership renewal for the next air show.\n*Please note: Membership/Space is limited each day. Membership will be good only for the day for which purchased (Saturday, September 6th or Sunday September 7th). Patriot Club Group Membership: $1,800 per table/per day. Members will receive their tickets upon purchase. **All ticket sales are final, no refunds, no rain checks.\nFor questions or additional information email: info@thunderovernewhampshire.com\nSaturday - SOLD OUT!\nSunday - SOLD OUT!\nPremium Box Seats\nNo need to bring a chair, we’ll save you a seat. Catch all the action from a prime position on the flightline!\nTicket includes:\n- Choose and reserve your seat in advance.\n- A folding chair.\n- Access to non-public portable washrooms.\n- A terrific view of the show.\n- Free (Blue Lot) parking pass.\n*Please note: This is not a tented area. Ticket will be good only for the day for which it is purchased (Saturday, September 6 or Sunday, September 7). Guests purchasing premium box seating will be provided a free (Blue Lot) parking pass at the conclusion of their transaction. **All ticket sales are final, no refunds, no rain checks.\nSaturday – SOLD OUT!\nSunday – SOLD OUT!\n*Advance tickets will be discounted significantly from regular pricing but ticket prices will increase without notice as more tickets are sold and the show gets closer to sold out.\nThe Pegasus Club\nExperience top-shelf air show hospitality by spending your day at the PEGASUS CLUB. Enjoy the festive atmosphere and entertainment while attending the Air Show in this spacious, tented premium chalet.\nTicket includes:\n- Spacious tented shade area with tables and chairs\n- An outstanding catered premium box lunch (between11am - 1pm)\n- Complimentary beverages (beer and non-alcoholic)\n- Access to non-public portable washrooms.\n- Premium outdoor seating along the flight line.\n- Children four and under are free when accompanied by a ticketed adult.\n*Please note: Space is limited each day. Ticket will be good only for the day for which it is purchased (Saturday, September 6 or Sunday, September 7). Guests purchasing Pegasus Club tickets will be provided a free (Blue Lot) parking pass at the conclusion of their transaction. **All ticket sales are final, no refunds, no rain checks.\nSaturday - SOLD OUT!\nSunday - SOLD OUT!\n*Advance tickets will be discounted significantly from regular pricing but ticket prices will increase without notice as more tickets are sold and the show gets closer to sold out.\nParking Passes\nBecause there is a limited capacity for parking and traffic ingress/egress, once all parking passes have been reserved, no additional parking will be available. Parking passes will not be available for purchase at the gate. Those vehicles arriving without a parking pass will not be permitted to park.\nNorth Ramp Base - FREE Parking - Blue Lot\nThe Base is providing a limited number of spaces on the North Ramp to guests free of charge. These spaces must be reserved in advance and they are expected to go very fast. A very limited number will be available each day. No busses or RV’s. Ticket will be good only for the day for which it is purchased (Saturday, September 6 or Sunday, September 7).\nAll parking passes have been sold/reserved\nNorth Ramp Base - PREMIUM Parking - Green Lot\nDon’t want to mess with the hassle of general parking? We have a very limited number of premium parking spaces available for purchase. These spaces are the closest to the show line and are directly adjacent with easy access to the air show grounds. A very limited number will be available each day. No busses or RV’s. Ticket will be good only for the day for which it is purchased (Saturday, September 9 or Sunday, September 10).\nSaturday - SOLD OUT!\nSunday - SOLD OUT!\nYellow Lot On-Site Premium Parking\nWe have a very limited number of these additional premium parking spaces available for purchase. These spaces are the closest to the show line and are directly adjacent with easy access to the air show grounds. A very limited number will be available each day.\nNo busses or RV’s. Tickets will be good only for the day for which it is purchased (Saturday, September 9 or Sunday, September 10).\nSaturday - SOLD OUT!\nSunday - SOLD OUT!\nMore About Traffic and Parking\nIn order to provide the best possible guest experience, air show organizers are seeking to alleviate traffic and parking challenges that have been an issue at the air shows hosted at Pease several years ago. Organizers have retained the services of a nationally renowned event parking consulting company to develop and implement the parking for this year’s air show. The plan is similar to what was used at the 2021 & 2023 air shows at Pease.\nThe show traffic and parking plan calls for the following:\n- All vehicles parking at the show will be required to obtain a free or paid parking pass online in advance at https://thunderovernewhampshire.com/\n- Because there is a limited capacity for parking and traffic ingress/egress, once all parking passes have been reserved, no additional parking will be available.\n- Parking passes will not be available for purchase at the gate. Vehicles arriving without a parking pass will not be admitted.\n- There will be a drop-off area near the south gate for guests utilizing ride-sharing services.\n- There will be handicap parking available in each of the lots. All lots are hard surface. Handicap parking will be the closest spaces to the air show entrance of the spaces in each lot. Handicap placard or plates are required to park in handicap spaces. An advance air show parking pass is also required for handicap parking (please note that there are not handicap passes separate from the other parking passes).\n*All ticket sales are final, no refunds, no rain checks.\nFollow Our Social Channels\n©2025 Thunder Over New Hampshire Air Show | Site designed and maintained by HERB GILLEN ADVERTISING\n*This web site is not an official U.S. Air Force or Air National Guard production. No government endorsement of supporting partners is intended."
    },
    {
      "url": "https://www.seacoastonline.com/story/lifestyle/things-to-do/2025/08/30/blue-angels-coming-thunder-over-nh-air-show-arrival/85883997007/",
      "text": "When will the Blue Angels arrive for 2025 Thunder Over New Hampshire Air Show?\nThe U.S. Navy Blue Angels are about to fly back into town.\nThe 2025 Thunder over New Hampshire Air Show returns to Pease Air National Guard Base on Sept. 6 and 7, where the six powerful F/A-18 Hornet fighter jets that fly as little as 18 inches apart are expected to entertain over 80,000 people over the weekend.\nBut, first they have to get to town, which means there is an early chance to get to see them in the air.\nWhen exactly the Blue Angels will come to town is subject to change, but event spokesman Rob Nichols said they are expected to arrive on Tuesday.\nBut, if you miss the arrival, there's always the show itself, which promises to be far more impressive.\nHow to go to the Thunder over NH Air Show\nAdmission to the air show at Pease Air National Guard Base, located at 302 Newmarket St. in Newington, is free. Premium covered and box seats have sold out.\nWhile admission is free, parking onsite requires a pass, which have sold out.\nBut, there are other options. People can still walk, bike to or be dropped off at the air show, and there is a nearby off-site parking area at the Mall at Fox Run in Newington, where shuttles will transport people to the air show gates. Some shuttle passes are still available both days as of Aug. 28.\nGates for the show open at 9 a.m. The Patriot Plaza, the aircraft on display, vendors and concessions on the runway will open about 9:30 a.m. The national anthem will be played at noon and performances begin right after that and go until about 4 p.m. both days. The gates and parking lots close at 5 p.m.\nThe air show takes place rain or shine.\nWho are air show performers joining the Blue Angels at Pease?\nThe Blue Angels will be joined by the Marines' C-130 “Fat Albert,” the Air Force's F-35 Lightning II Team, KC-46A Pegasus, UH-60 Blackhawk, U.S. Para Commandos, JackAces P-51 Demo, Michael Goulian, Smoke-N-Thunder Jet Car and the Third Strike Wingwalking team."
    }
  ],
  "argos_summary": "The 2025 Thunder over New Hampshire Air Show will take place at Pease Air National Guard Base on September 6‑7, featuring the U.S. Navy Blue Angels and a host of other military aircraft and performers. Admission to the show is free, but on‑site parking passes have sold out; shuttle passes to the Mall at Fox Run are still available as of late August. Gates open at 9 a.m., with the main performances running from noon to about 4 p.m. for both days. The event promises to draw over 80,000 spectators and includes a variety of military aircraft and support teams beyond the Blue Angels.",
  "argos_id": "RVN3USJKS"
}