{
  "url": "https://www.usatoday.com/story/sports/tennis/open/2025/08/30/jelena-ostapenko-taylor-townsend-apology-us-open/85912142007/",
  "authorsByline": "Scooby Axson",
  "articleId": "9be6a410b5814e3aa0efdd890f16f41c",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/30/USAT/85912314007-usatsi-26940644-168402559-lowres.jpg?crop=1293,727,x0,y0&width=1293&height=727&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-30T20:58:30+00:00",
  "addDate": "2025-08-30T21:03:15.997755+00:00",
  "refreshDate": "2025-08-30T21:03:15.997756+00:00",
  "score": 1.0,
  "title": "Jelena Ostapenko apologizes for Taylor Townsend ‘no education’ comments",
  "description": "Jelena Ostapenko apologized on Saturday, taking to social media after her US Open incident with Taylor Townsend.",
  "content": "Jelena Ostapenko apologized on Saturday, taking to social media after her US Open incident with Taylor Townsend, following her second-round loss in which she said Townsend, who is black, had “no education.”\n\nOstapenko, who was the No. 25 seed, again went to social media to issue an apology for saying things after her 7-5, 6-1 loss, in which she confronted Townsend at the net and continued to argue with her following the match. Townsend told ESPN during an interview that Ostapenko also said she had “no class.”\n\nIn the statement, Ostapenko did not reference Townsend, who will play her fourth-round singles match on Sunday.\n\n“Hi all - I wanted to apologize for some of the things I said during my second-round singles match,\" Ostapenka wrote on Instagram. \"English is not my native language, so when I said education, I was speaking only about what I believe as tennis etiquette, but I understand how the words I used could have offended many people beyond the tennis court. I appreciate the support as I continue to learn and grow as a person and a tennis player. Goodbye New York and I look forward to being back next year.”\n\nIn her first statement after the loss, Ostapenko said her opponent \"was very disrespectful as she had a net ball in a very deciding moment and didn’t say sorry at all.\"\n\n“There are some rules in tennis that most of the players follow, and it was the first time that this happened to me on tour. If she plays in her homeland it doesn’t mean that she can behave and do whatever she wants,\" Ostapenko wrote.\n\nIt led two-time US Open champion Naomi Osaka to discuss the comments and defend Townsend, the world's No. 1-ranked doubles player.\n\n“It’s one of the worst things you can say to a Black tennis player in a majority White sport,\" Osaka said. \"I know Taylor and I know how hard she’s worked and I know how smart she is, so she’s the furthest thing from uneducated or anything like that. I think it’s ill-timing and the worst person you could have ever said it to. And I don’t know if she knows the history of it in America.”",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/tennis/open/2025/08/27/jelena-ostapenko-response-taylor-townsend-confrontation-us-open/85857868007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Taylor Townsend",
      "weight": 0.101451665
    },
    {
      "name": "Townsend",
      "weight": 0.08920845
    },
    {
      "name": "Jelena Ostapenko",
      "weight": 0.08872037
    },
    {
      "name": "tennis etiquette",
      "weight": 0.0864654
    },
    {
      "name": "Ostapenko",
      "weight": 0.0853509
    },
    {
      "name": "tennis",
      "weight": 0.08099365
    },
    {
      "name": "US Open",
      "weight": 0.07322155
    },
    {
      "name": "things",
      "weight": 0.06748881
    },
    {
      "name": "social media",
      "weight": 0.06520204
    },
    {
      "name": "Naomi Osaka",
      "weight": 0.06236224
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9541015625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.896484375
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.56396484375
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.46630859375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.45458984375
    }
  ],
  "sentiment": {
    "positive": 0.045223735,
    "negative": 0.7574681,
    "neutral": 0.19730814
  },
  "summary": "Jelena Ostapenko, the No. 25 seed, has publicly apologized for her comments about Taylor Townsend, a black tennis player, who is also black, having “no education” following her second-round loss. The comments were made public on social media. Townsend responded by saying Ostaphenenko had no class and expressed regret over her comments. Two-time US Open champion Naomi Osaka defended Townsend, calling the comments \"ill-timing\" and \"the worst thing you can say to a Black tennis player in a majority White sport\".",
  "shortSummary": "Jelena Ostapenko apologized for calling Taylor Townsend \"no education,\" following a controversial US Open loss, which led to criticism from both her and her fellow players.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9a7b91ee8cff4c59b91a5542d236faef",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/tennis/open/2025/08/27/jelena-ostapenko-response-taylor-townsend-confrontation-us-open/85857868007/",
      "text": "Jelena Ostapenko after Taylor Townsend confrontation: 'Never racist in my life'\nNEW YORK - Jelena Ostapenko took to the internet immediately after her second-round loss to Taylor Townsend at the US Open (7-5, 6-1), in which Ostapenko accused Townsend of having \"no class, no education.\"\nESPN cameras captured the confrontation that ensued after the match. Ostapenko, of Latvia, approached the net for a customary post-match handshake, and words were immediately exchanged.\nOstapenko, who did not have a post-match press conference, went to Instagram to explain her side of the story.\n\"Today after the match I told my opponent that she was very disrespectful as she had a net ball in a very deciding moment and didn't say sorry, but her argument was that she doesn't have to say sorry at all,\" she said. \"There are some rules in tennis which most of the players follow and it was the first time ever that this happened to me on tour. If she plays in her homeland, that doesn't mean she can behave and do what she wants.\"\nApparently, that explanation didn't sit too well with some on the internet, who called Ostapenko, the No. 26th-ranked player in the world, \"racist\" because of her behavior after the match.\n\"I was never racist in my life,\" she wrote in a follow-up post. \"I respect all nations of people in the world, for me it doesn't matter where you come from. Unfortunately, I come from such a small country that I don't have huge support and a chance to play in my homeland.\"\nTownsend said after the match she's \"looking forward to\" playing Ostapenko again in the future.\n\"Still, there's no beef. But again, like you guys saw, I didn't back down because you're not going to insult me, especially after I carried myself a certain type of way with nothing but respect,\" Townsend said. \"If I show respect to you, I expect respect as well. That's just the fact of the matter.\nTownsend will take on the winner of Anastasia Potapova and No. 5 seed Mirra Andreeva in the third round.\nThis story has been updated with new information.\nContributing: Cydney Henderson\nThe USA TODAY app gets you to the heart of the news — fast. Download for award-winning coverage, crosswords, audio storytelling, the eNewspaper and more."
    }
  ],
  "argos_summary": "Jelena Ostapenko apologized on social media after a heated post‑match exchange with Taylor Townsend at the US Open, where she had called Townsend “no education.” The Latvian player said her remarks were about tennis etiquette and not a racist comment, but the incident drew criticism and prompted Naomi Osaka to defend Townsend. Ostapenko’s apology acknowledged the offense her words may have caused and she expressed a desire to learn and grow. Townsend said she was not upset and looked forward to future matches. The controversy highlights the sensitivity around language in sports.",
  "argos_id": "X4MZK85TV"
}