{
  "url": "https://www.searchenginejournal.com/wordpress-ocean-extra-vulnerability-affects-up-to-600000-sites/554900/",
  "authorsByline": "Roger Montti",
  "articleId": "9e3e155c52314485bda5354f6b711543",
  "source": {
    "domain": "searchenginejournal.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Broward County",
      "city": "Deerfield Beach",
      "coordinates": {
        "lat": 26.318342,
        "lon": -80.0996306
      }
    }
  },
  "imageUrl": "https://www.searchenginejournal.com/wp-content/uploads/2025/08/wordpress-ocean-extra-837.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T22:06:57+00:00",
  "addDate": "2025-08-29T22:19:23.190760+00:00",
  "refreshDate": "2025-08-29T22:19:23.190762+00:00",
  "score": 1.0,
  "title": "WordPress Ocean Extra Vulnerability Affects Up To 600,000 Sites",
  "description": "WordPress plugin vulnerability affecting up to 600,000 websites enables stored XSS exploit",
  "content": "An advisory was issued for the Ocean Extra WordPress plugin that is susceptible to stored cross-site scripting, which enables attackers to upload malicious scripts that execute on the site when a user visits the affected website.\n\nThe vulnerability affects only the Ocean Extra plugin by oceanwp, a plugin that extends the popular OceanWP WordPress theme. The plugin adds extra features to the OceanWP theme, such as the ability to easily host fonts locally, additional widgets, and expanded navigation menu options.\n\nAccording to the Wordfence advisory, the vulnerability is due to insufficient input sanitization and output escaping.\n\nInput sanitization is the term used to describe the process of filtering what’s input into WordPress, like in a form or any field where a user can input something. The goal is to filter out unexpected kinds of input, like malicious scripts**,** for example. This is something that the plugin is said to be missing (insufficient).\n\nOutput escaping is kind of like input sanitization but in the other direction, a security process that makes sure that whatever is being output from WordPress is safe. It checks that the output doesn’t have characters that can be interpreted by a browser as code and subsequently executed, such as what is found in a stored cross-site scripting (XSS) exploit. This is the other thing that the Ocean Extra plugin was missing.\n\nTogether, the insufficient input sanitization and insufficient output escaping enable attackers to upload a malicious script and have it output on the WordPress site.\n\nThe vulnerability only affects authenticated users with contributor-level privileges or higher, to a certain extent mitigating the threat level of this specific exploit. This vulnerability affects versions up to and including version 2.4.9. Users are advised to update their plugin to the latest version, currently 2.5.0.",
  "medium": "Article",
  "links": [
    "https://www.wordfence.com/threat-intel/vulnerabilities/wordpress-plugins/ocean-extra/ocean-extra-249-authenticated-contributor-stored-cross-site-scripting-via-oceanwp-library-shortcode"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "WordPress Ocean Extra Vulnerability",
      "weight": 0.118027754
    },
    {
      "name": "insufficient input sanitization",
      "weight": 0.09862507
    },
    {
      "name": "stored cross-site scripting",
      "weight": 0.09521998
    },
    {
      "name": "Ocean Extra",
      "weight": 0.092146836
    },
    {
      "name": "Input sanitization",
      "weight": 0.0909307
    },
    {
      "name": "input sanitization",
      "weight": 0.0909307
    },
    {
      "name": "malicious scripts",
      "weight": 0.088443786
    },
    {
      "name": "insufficient output escaping",
      "weight": 0.08689836
    },
    {
      "name": "WordPress",
      "weight": 0.08378459
    },
    {
      "name": "the Ocean Extra WordPress plugin",
      "weight": 0.080994226
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.6416015625
    }
  ],
  "sentiment": {
    "positive": 0.054815587,
    "negative": 0.6368992,
    "neutral": 0.30828524
  },
  "summary": "An advisory has been issued for the Ocean Extra WordPress plugin, a plugin that adds extra features to the popular OceanWP WordPress theme. The vulnerability is due to insufficient input sanitization and output escaping, which allows attackers to upload malicious scripts that execute on the affected website. The plugin only affects authenticated users with contributor-level privileges. The advisory urges users to update their plugin to the latest version of the plugin.",
  "shortSummary": "An advisory reveals that the Ocean Extra WordPress plugin is vulnerable to stored cross-site scripting, requiring updates to prevent attacks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cc32896adf8c420c882cd4a5b9d0158e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "An advisory warns that the Ocean Extra WordPress plugin (up to version 2.4.9) has a stored cross‑site scripting flaw caused by insufficient input sanitization and output escaping, allowing authenticated contributors or higher to upload malicious scripts that run when visitors view the site. The issue is limited to the Ocean Extra plugin, part of the OceanWP theme, and is mitigated by the contributor‑level restriction. Users are urged to update to version 2.5.0 to eliminate the vulnerability.",
  "argos_id": "X7SOG9BDS"
}