{
  "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/29/nfl-power-rankings-2025-micah-parsons-cowboys-packers-week-1/85894763007/",
  "authorsByline": "Nate Davis",
  "articleId": "a2efb772e46f420295636664e274d5ae",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/29/USAT/85895488007-power-15.jpg?crop=851,479,x834,y812&width=851&height=479&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-29T22:20:26+00:00",
  "addDate": "2025-08-29T22:23:10.119121+00:00",
  "refreshDate": "2025-08-29T22:23:10.119125+00:00",
  "score": 1.0,
  "title": "NFL power rankings: Fallout of Micah Parsons trade evident going into Week 1",
  "description": "Whither Cowboys, Packers and several other clubs in aftermath of blockbuster trade involving star pass rusher?",
  "content": "• The Cowboys ranked 21st in our power poll ... before shipping out Parsons, arguably their best player.\n• Already our NFC pick for Super Bowl 60, where do Packers check in now ahead of opener vs. Lions?\n• Big as the Parsons trade is, the three teams atop our power poll remain unchanged.\n\nNFL power rankings with the 2025 regular season set to kick off Sept. 4 … and Micah Parsons on the move (previous rank in parentheses):\n\n1. Philadelphia Eagles (1): There's little doubt they're a legit threat to follow the Chiefs, whom they decisively vanquished in Super Bowl 59, as the second team to repeat in a four-season span. The early part of the season already seems to be breaking Philly's way − the Eagles now set to open against a Cowboys squad devoid of Parsons, rather than the pitch-count version of Parsons, before heading to Arrowhead Stadium and catching the perennial AFC champions on the back end of their 10,000-mile roundtrip to Brazil in Week 1.\n\n2. Baltimore Ravens (2): Looking for a flaw here? They didn't manage to get in on the Parsons sweepstakes, otherwise … The biggest issue facing Baltimore presently might be avoiding boredom in September and October − and the Ravens have been known to strike some easily avoidable early schedule potholes in past seasons.\n\n3. Kansas City Chiefs (3): You have to wonder just how engaged they'll be during the regular season given how married they are to Super Bowl success.\n\n4. Green Bay Packers (6): Some of the sager members of the NFL media corps had already picked them as the NFC's Super Bowl 60 entry … not that anyone, cough, is looking for credit. But with Parsons now coming aboard in the kind of deal Pack fans rarely enjoy? Better buy another bandwagon. Or two.\n\n5. Buffalo Bills (4): They survived RB James Cook's hold-in. They've almost survived what's been a solid installment of \"Hard Knocks.\" They'll almost undoubtedly survive what should be another cruise-control path to the AFC East crown. For the Bills, similar to the Ravens, it will likely be about what lies beyond that.\n\n6. Los Angeles Rams (5): A young team is hoping to pick up where it left off after last season's resurgence refueled its Super Bowl aspirations. Unfortunately, that young team has an old quarterback with a creaky back who also effectively renders the entire operation a house of cards ... all due respect to Jimmy Garoppolo.\n\n7. Washington Commanders (7): They've eliminated one risk by resolving the contractual situation of longtime team captain Terry McLaurin. They've potentially invited another one by trading starting RB Brian Robinson to the Niners. FWIW, they're also not going to be able to duck Parsons, drawing a Thursday night assignment in Green Bay in Week 2 − get ready, Laremy Tunsil.\n\n8. Denver Broncos (8): They're exactly why you don't judge actual NFL teams by their fantasy football value. Denver arguably has the league's best offensive line and defense. Who needs Bo Nix?\n\n9. Detroit Lions (9): Much of the offseason focus has understandably been trained on their numerous coaching departures, including both coordinators. But let's not forget that DE Aidan Hutchinson will be back wrecking shop in Week 1, either.\n\n10. Pittsburgh Steelers (10): It's worth wondering how long it will take QB Aaron Rodgers to practically get a handle on this offense after he sat out the preseason. Conversely, unnecessary penalties or not, fun to see new DB Jalen Ramsey sending the message Pittsburgh's defense is back.\n\n11. Arizona Cardinals (12): A 5-2 start coming out of a Week 8 bye seems quite reasonable for a team that struggled to get out of the blocks during its first two seasons under coach Jonathan Gannon. It might also be enough to distinguish the Cards in what appears to be a tightly packed NFC West.\n\n12. Tampa Bay Buccaneers (14): Similar to the Lions, let's not try to obsess over the delayed 2025 debuts of LT Tristan Wirfs and WRs Chris Godwin and Jalen McMillan − not to mention the departure of OC Liam Coen ... which we've now mentioned. Instead, let's focus on the opportunity first-round WR Emeka Egbuka now has to make a run at Offensive Rookie of the Year honors.\n\n13. San Francisco 49ers (11): In the event you'd lost track, Russell Gage, Skyy Moore, Marquez Valdes-Scantling and Robbie Chosen (the latter two on the practice squad) are now part of the Niners' expanded − by necessity − suite of wideout options. If that seems problematic … yep.\n\n14. Seattle Seahawks (16): In the event you'd lost track, Dareke Young, Cody White, Jake Bobo, Ricky White III and Tyrone Broden (the latter two on the practice squad) are now part of the Seahawks' expanded − by necessity − suite of wideout options. If that seems problematic … well, Seattle still has Jaxon Smith-Njigba and Cooper Kupp on what's likely going to be a run-oriented offense that isn't overly reliant on new QB Sam Darnold.\n\n15. Minnesota Vikings (17): Their forecast was tempered at best at this time a year ago. So discount the Vikes at your peril. It also would have been crazy to wonder a year ago if J.J. McCarthy could fill Darnold's shoes. Maybe the return of WR Adam Thielen, who will certainly ease the temporary absence of Jordan Addison, helps that cause.\n\n16. Houston Texans (13): With RB Joe Mixon's absence set to extend well into the fall, and his return nowhere in sight, an offense that already had a convulsive offseason has another major question mark going into Week 1 and beyond.\n\n17. Cincinnati Bengals (18): With DE Trey Hendrickson sufficiently appeased (for 2025 anyway), this roster basically heads into the season intact, albeit a significantly more expensive version compared to the disappointing 2024 edition. Good luck with that.\n\n18. Los Angeles Chargers (15): You don't want to undersell a team coached by Jim Harbaugh. But there were enough concerns about portions of this roster before newly extended Pro Bowl LT Rashawn Slater blew out his knee.\n\n19. New England Patriots (19): Exciting new head coach. Exciting free agent additions. Exciting rookie class. The new recipe may not coalesce immediately, but this team should be cooking with grease soon.\n\n20. Jacksonville Jaguars (22): Are we already souring on the grand Travis Hunter experiment now that he's apparently already been sideswiped by injury before the games that count have even started?\n\n21. Chicago Bears (20): After an offseason seemingly overflowing with justifiable optimism, the last few weeks have been something of a reality check as rookie HC Ben Johnson gets his sea legs under him while his players try to stay afloat in their new reality. Fun fact, Bears are actually great swimmers.\n\n22. Atlanta Falcons (24): Amazing how (relatively) quiet RB Bijan Robinson 1,887 yards from scrimmage in 2024 were but good bet he breaks into the coverage of Saquon Barkley and Derrick Henry in 2025.\n\n23. New York Jets (23): Preseason was a mixed bag, similar to their new Nike \"Gotham City Football Club\" uniforms. But even if the new-look offense struggles at times in 2025, which is probably a given, don't expect the toughness rookie HC Aaron Glenn is injecting into this organization to take a day off.\n\n24. Carolina Panthers (25): There's fresh hope around this group after it finished 2024 on the upswing. But, wow, is QB Bryce Young's receiving corps green following the trade of Thielen and release of Hunter Renfrow.\n\n25. Dallas Cowboys (21): There's no way to spin the departure of Parsons − at least to this locker room − as anything other than a gut punch. And what becomes of first-year coordinator Matt Eberflus' defense, which has been stripped of Parsons, its linchpin, and DeMarcus Lawrence? Seems like the Cowboys could be morphing into Bengals West … without the same level of offensive firepower.\n\n26. New York Giants (29): If the NFL crowned preseason champs, you're probably looking at 'em. Alas. But nevertheless, even though it may not be reflected much in the 2025 win column, plenty of good feels around this team − primarily generated by rookie QB Jaxson Dart and LB Abdul Carter. Factor in WR Malik Nabers, and the Giants' may just have the league's premier trio of youngsters … at least based on what we saw in their dominant August. In a Parsons-less NFC East, maybe Big Blue now has a legit shot at third place.\n\n27. Las Vegas Raiders (26): Maybe first-round RB Ashton Jeanty justifies the hype. Maybe Tyree Wilson, their top pick in 2023, is finally ready to help DE Maxx Crosby. Maybe QB Geno Smith won't have to give way to recently obtained Kenny Pickett. Notice a theme of maybes?\n\n28. Miami Dolphins (27): If this summer taught us anything, there are still concerns about what's going on inside the building and also on the field. Factor in several key starters nursing training camp injuries, and a problematic team that usually starts well under coach Mike McDaniel may struggle to replicate even that.\n\n29. Tennessee Titans (28): September could be tough, but don't be surprised if this team becomes an incrementally tougher out as the season progresses … and rookie QB Cam Ward starts imprinting his unmissable stamp on the organization.\n\n30. Cleveland Browns (31): There are some good players in this lineup. Rookie QB Shedeur Sanders isn't one of them … and that will almost surely be the story until that changes.\n\n31. Indianapolis Colts (30): Quarterback notwithstanding, this roster has plenty going for it. But despite how hard it is to trust Daniel Jones, Indy nevertheless decided he was a preferable option to Anthony Richardson as QB1 ... so drumming up much optimism here is a tough ask.\n\n32. New Orleans Saints (32): Maybe new QB1 Spencer Rattler, 24, has grown leaps and bounds after six ugly starts as a rookie in 2024. But the fact second-rounder Tyler Shough, 25, couldn't beat him out just feels like this organization's latest setback.\n\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter.",
  "medium": "Article",
  "links": [
    "https://sportsdata.usatoday.com/football/nfl/scores",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/28/micah-parsons-trade-cowboys-packers-winners-losers-jerry-jones/85875337007/",
    "https://www.usatoday.com/picture-gallery/sports/nfl/2025/08/05/notable-nfl-contract-holdouts/85518977007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/minnesota-vikings/347",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/22/why-are-commanders-trading-brian-robinson-terry-mclaurin-contract/85781252007/",
    "https://profile.usatoday.com/newsletters/4th-and-monday/?ipid=signuptop10",
    "https://www.usatoday.com/story/sports/nfl/chiefs/2025/08/20/skyy-moore-trade-kansas-city-chiefs-san-francisco-49ers/85750952007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/dallas-cowboys/331",
    "https://sportsdata.usatoday.com/football/nfl/teams/buffalo-bills/324",
    "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/28/dallas-cowboys-jerry-jones-micah-parsons-trade/85876581007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/washington-commanders/363",
    "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/07/exclusive-jacksonville-jaguars-travis-hunter-offense-defense/85560502007/",
    "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/28/micah-parsons-trade-grades-green-bay-packers-dallas-cowboys/85874229007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/26/winners-and-losers-taylor-swift-travis-kelce-engagement/85836958007/",
    "https://www.usatoday.com/story/sports/nfl/super-bowl/2025/02/09/saquon-barkley-super-bowl-25-philadelphia-eagles/78370329007/",
    "https://www.usatoday.com/story/sports/columnist/mike-freeman/2025/08/21/new-york-giants-quarterback-jaxson-dart-star-preseason/85769623007/",
    "https://www.usatoday.com/story/sports/nfl/saints/2025/08/26/new-orleans-saints-starting-quarterback-spencer-rattler-tyler-shough/85726122007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/green-bay-packers/335",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/07/30/nfl-power-rankings-2025-preseason-eagles-ravens-chiefs/85429548007/",
    "https://sportsdata.usatoday.com/football/nfl/teams/san-francisco-49ers/359",
    "https://sportsdata.usatoday.com/football/nfl/teams/baltimore-ravens/366",
    "https://www.usatoday.com/story/sports/nfl/commanders/2025/08/28/commanders-terry-mclaurin-hoodies-contract-extension-jayden-daniels/85861824007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/07/23/nfl-grades-offseason-report-cards-training-camps/85321954007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/27/browns-quarterback-shedeur-sanders-future/85840540007/",
    "https://www.usatoday.com/picture-gallery/sports/nfl/2025/03/12/nfl-free-agency-trades-tracker-2025/82340084007/",
    "https://www.usatoday.com/story/sports/nfl/vikings/2025/08/27/adam-thielen-trade-minnesota-vikings-carolina-panthers/85777861007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/06/nfl-record-projections-win-totals-2025-super-bowl-60-eagles/85529604007/",
    "https://www.usatoday.com/story/sports/nfl/packers/2025/08/28/packers-super-bowl-micah-parsons-trade/85874383007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/26/trey-hendrickson-contract-cheap-bengals-mike-brown/85827699007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/24/nfl-preseason-winners-losers-jaxson-dart-micah-parsons/85798927007/",
    "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/28/nfl-new-uniforms-ranked-best-worst-rivalries-nike/85864301007/"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "actual NFL teams",
      "weight": 0.05894629
    },
    {
      "name": "Micah Parsons trade",
      "weight": 0.055046823
    },
    {
      "name": "Micah Parsons",
      "weight": 0.05335247
    },
    {
      "name": "Parsons",
      "weight": 0.051810008
    },
    {
      "name": "Super Bowl",
      "weight": 0.05043089
    },
    {
      "name": "longtime team captain Terry McLaurin",
      "weight": 0.050275754
    },
    {
      "name": "new QB Sam Darnold",
      "weight": 0.04860126
    },
    {
      "name": "Super Bowl success",
      "weight": 0.047827285
    },
    {
      "name": "rookie QB Jaxson Dart",
      "weight": 0.04708038
    },
    {
      "name": "past seasons",
      "weight": 0.0468925
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9970703125
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.94482421875
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.796875
    }
  ],
  "sentiment": {
    "positive": 0.26268184,
    "negative": 0.26970837,
    "neutral": 0.46760982
  },
  "summary": "The Dallas Cowboys' Micah Parsons trade leaves the team with a significant impact on the team's overall NFL power rankings going into Week 1, with the Cowboys ranked 21st in our power poll before Parsons' departure. The Philadelphia Eagles remain the top three teams in the power poll, with Philadelphia Eagles being the only team to repeat in a four-season span. Meanwhile, the Baltimore Ravens are second and third respectively, while the Kansas City Chiefs are third and third. The Los Angeles Rams are fifth and Los Angeles Raiders are fifth. The Green Bay Packers are 6th and the Los Angeles Steelers are 10th. The Detroit Lions are 9th and San Francisco 49ers are 11th and Tampa Bay Buccaneers are 14th. Seattle Seahawks' wide receiver position has been expanded due to injuries to Liam Coen and Liam Egbgb.",
  "shortSummary": "The post-Pampering trade of key player Micah Parsons leaves the Cowboys, while the top three remain unchanged in the NFL power rankings, with the season set to begin.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9fb815fa1eba4b35a128bee227fd80e3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/07/30/nfl-power-rankings-2025-preseason-eagles-ravens-chiefs/85429548007/",
      "text": "NFL power rankings: As preseason nears, who are Eagles' main threats?\nNFL power rankings with the 2025 preseason set to begin July 31 (previous rank in parentheses):\n1. Philadelphia Eagles (1): The offense returns virtually intact, former coordinator (and new Saints head coach) Kellen Moore a notable exception. Coordinator Vic Fangio is back for a second year running the defense, though that unit will need to adapt from significant losses in free agency. Last year's club was one of the very best of the past quarter century and seems to have an excellent shot at repeating − especially when you consider proven NFL players like RB AJ Dillon, CB Adoree' Jackson and OLBs Azeez Ojulari and Josh Uche are all projected to be among the backups.\n2. Baltimore Ravens (2): How talented is this secondary? Chidobe Awuzie, a Round 2 pick in Dallas eight years ago, projects as the dime back after former Green Bay Pro Bowler Jaire Alexander joined up as the fifth first-rounder likely to play ahead of him on this unit. Stopping the pass was a big problem here a year ago but could be a strength as QB Lamar Jackson and Co. make their latest run at a Super Bowl.\n3. Kansas City Chiefs (4): With G Trey Smith and DE George Karlaftis extended, the only piece of semi-pressing team business remaining is a new deal for All-Pro CB Trent McDuffie − and that may have to wait. Resolution on WR Rashee Rice's post-legal status would also be nice, but even having him back for some portion of this season is a win over his injury-aborted 2024 campaign. K.C.'s biggest issue, the O-line notwithstanding, could be a quickly narrowing gap with their AFC West competitors.\n4. Buffalo Bills (5): The only franchise to play in four consecutive Super Bowls − all infamous losses in the 1990s − is now the only team with 78 wins (playoffs included) over a six-season stretch without reaching a Super Bowl. Will Josh Allen's (and the Mafia's) suffering finally end in 2025?\n5. Los Angeles Rams (3): No team pushed Philly closer to the precipice in the 2024 playoffs than the Rams. No team might be more heavily reliant on a seemingly brittle component − Matthew Stafford − than the Rams, their 37-year-old quarterback sidelined so far this summer by a balky back. He's missed 11 starts over the past three seasons. But if he's generally available in 2025, LA could wind up in SF for SB60.\n6. Green Bay Packers (8): They bring a compelling mixture of young talent but also continuity, an aspect that could distinguish them from their NFC North rivals, who are all undergoing some measure of major upheaval at a key spot.\n7. Washington Commanders (6): If you'd told their fans a year ago that the 2025 Commanders would reach the divisional round of the postseason, imagine what the excitement level would have been. Now? That might seem like a major disappointment for a team led by a quarterback, albeit the amazing Jayden Daniels, heading into just his second season.\n8. Denver Broncos (13): While coach Sean Payton and QB Bo Nix might be this team's most recognizable faces, a defense that ranked seventh overall in 2024 might wind up being its strength.\n9. Detroit Lions (7): The departures of coordinators Ben Johnson (Bears) and Aaron Glenn (Jets) for head coaching gigs have drawn deserved offseason focus for the impact in Motown. But HC Dan Campbell also lost six other assistants as other teams try to replicate Detroit's recent success. Most of the Lions' copious talent remains, but it remains to be seen if the revamped staff can maximize it following a 27-7 regular-season mark over the past two seasons.\n10. Pittsburgh Steelers (16): If the Aaron Rodgers era lasts eight months, this season could be the sterling silver Stairway to Seven. If the Aaron Rodgers era lasts seven months, this season will be a slag pile that could land some folks on the scrap heap. But it seems off to an encouraging start in steamy Latrobe, Pennsylvania.\n11. San Francisco 49ers (14): With many of their top players, like RB Christian McCaffrey and LT Trent Williams, healthy again − and armed with a last-place schedule that is the league's easiest based on opponents' collective winning percentage (.415) in 2024, they're well positioned for a major rebound. Still, with WR Brandon Aiyuk still on the mend from his 2024 ACL/MCL tear, WR Jauan Jennings seeking a raise, and the defense trying to recover from several departures, the beginning of the season could be something of a speed bump.\n12. Arizona Cardinals (17): Below average under rookie coach Jonathan Gannon in 2023 to average last season, the Cards are hoping to sustain the upward trend into the postseason.\n13. Houston Texans (10): Will they regret building their ground game around RBs Joe Mixon, Nick Chubb and Dameon Pierce, who are all in various states of disrepair?\n14. Tampa Bay Buccaneers (9): With LT Tristan Wirfs (knee surgery), arguably the Bucs' best player, and WR Chris Godwin (ankle) stuck on the PUP list amid yet another offensive coordinator change, it's worth wondering if the perennial NFC South champs fall into an early season hole.\n15. Los Angeles Chargers (11): While the eye injury to RB Najee Harris and retirement of WR Mike Williams have generated the summer headlines, the main concern here might be the defense given the Bolts allowed an average of more than 25 points over their final five games of last season ... and that was before they lost Joey Bosa and several others in free agency.\n16. Seattle Seahawks (15): As a member of the Vikings, QB Sam Darnold dealt the 2024 Seahawks a death blow last December in Lumen Field. Now the 12s can only hope he's the real deal and won't serve a self-inflicted coup de grâce in November.\n17. Minnesota Vikings (18): Maybe it's apples to Granny Smith apples, but let's attempt some contextualization. QB J.J. McCarthy attempted an average of 22.1 passes during his final (championship) season at Michigan in 2023. During his rookie absence in 2024, Darnold never threw fewer than 24 in a game for Minnesota on the way to his first Pro Bowl honors. Should be interesting to see how long HC Kevin O'Connell keeps the training wheels on McCarthy.\n18. Cincinnati Bengals (12): In case you were wondering just how bad this defense might get without All-Pro DE Trey Hendrickson − though he's at least ready to end his holdout and stop getting fined − no one else had more than five sacks or 23 pressures in 2024. He had a league-leading 17½ and 54, respectively.\n19. New England Patriots (20): Highly regarded new coach. Talented second-year quarterback. An offseason loaded with major moves. Don't be surprised if their 2024 win total (4) doubles.\n20. Chicago Bears (19): Highly regarded new coach. Talented second-year quarterback. An offseason loaded with major moves. Don't be surprised if their 2024 win total (5) doubles.\n21. Dallas Cowboys (22): Tyler Guyton, last year's first-rounder, avoided a catastrophic camp injury and could be ready by Week 1. But whether he's in the lineup or not, this team needs much better play from the left tackle spot if QB Dak Prescott is going to survive the full season.\n22. Jacksonville Jaguars (26): The attention is understandably focused on WR/CB Travis Hunter, the second pick of the 2025 draft. Much more should be focused on QB Trevor Lawrence, the first pick of the 2021 draft − and upon whose shoulders, surgically repaired and otherwise, this franchise's fortunes will rise or fall.\n23. New York Jets (25): They've got certifiable stars, a new coach who seems to be galvanizing the entire organization, a compelling haul of rookies and ample buzz around new QB1 Justin Fields. But given how often potential and production are inversely related in the New York market, Glenn and Co. have plenty to prove despite all the promise.\n24. Atlanta Falcons (27): Amid the runaway speculation about QB2 Kirk Cousins' future here … it might be here. With all of 230 snaps as a rookie, QB1 Michael Penix Jr. hasn't played much more than 2024 draft mate McCarthy, who also effectively replaced Cousins. But now two years removed from his Achilles tear plus arm and shoulder woes in 2024, don't be surprised if \"KFC\" comes out of the bullpen at some point and plays much better than he did late last season.\n25. Carolina Panthers (23): If third-year QB Bryce Young is to sustain last year's late-season momentum, he'll need what was by far the league's worst defense to put him in far fewer compromising positions.\n26. Las Vegas Raiders (21): Maybe the departure of DT Christian Wilkins proves to be addition by subtraction. But it also leaves the defense in an even more precarious position while further incentivizing opponents to double- and triple-team DE Maxx Crosby.\n27. Miami Dolphins (24): Speaking of defenses that have shed Wilkins − and CB Jalen Ramsey and S Jevon Holland and DL Calais Campbell − if the Fins' pass rush can't live up to its dominant potential, then this offense might have to win a lot of shootouts.\n28. Tennessee Titans (31): They got QB Cam Ward atop the draft and, to the degree it wasn't already, it's full speed ahead with the rookie now that backup Will Levis has opted for season-ending shoulder surgery. Could be a rough, if hopeful, ride in Nashville.\n29. New York Giants (28): They didn't get QB Cam Ward atop the draft − but reportedly tried − instead coming back into the bottom of Round 1 for Jaxson Dart. But it's currently full speed ahead with veteran Russell Wilson … even if he's unable to get this offense into third gear.\n30. Indianapolis Colts (30): Legend has it that legendary coach and analyst John Madden uttered the phrase, “If you’ve got two quarterbacks, you have none.” Not sure many folks will be playing \"Madden NFL\" with this Colts team.\n31. Cleveland Browns (29): Given the open question here at quarterback, the offense would most obviously benefit from a strong rushing attack. But Chubb left and rookie second-rounder Quinshon Judkins remains unsigned due to ongoing legal issues. Jerome Ford, who rushed for a team-best 565 yards in 2024, stands to get a heavier workload than the DUDE Wipes that seem to underpin much of the team's marketing efforts.\n32. New Orleans Saints (32): Derek Carr − gone. Tyrann Mathieu − gone. The core of what was a top-10 scoring defense four of the past five seasons − gone. Hope at the outset of the 2025 season − a camp holdout.\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/minnesota-vikings/347",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/columnist/mike-freeman/2025/08/21/new-york-giants-quarterback-jaxson-dart-star-preseason/85769623007/",
      "text": "New York Giants rookie quarterback Jaxson Dart looks like a future star\n- Jaxson Dart's preseason stats (372 yards, 3 TDs, 0 INTs) are impressive.\n- Jaxson Dart is reminiscent of a young John Elway.\n- Russell Wilson's time as the Giants' starting quarterback could be brief.\nYes, we know Jaxson Dart in the preseason was going against future plumbers and Canadian Football League players. (Not that there's anything wrong with that. Plumbers make a lot of cash and Canada is lovely this time of year.) Yes, we know it's preseason. Yes, things will be different when he goes against real NFL defenses. Yes, yes, yes.\nAll true but just, for a moment, look at these numbers for all of Dart's preseason:\n32 of 47 passing.\n372 passing yards.\nThree passing touchdowns.\nZero interceptions.\nSix rushes for 52 yards and a score.\nIn 12 drives.\nSorry to go all single paragraph on you with the stats, but that's a monster preseason. I'm not saying he's John Elway, but he reminds me of a young John Elway.\nMike, what the hell are you doing? Keep Elway's name out of your mouth. It's preseason. Take a Xanax.\nI've tried to stay calm, but in watching Dart closely this preseason you see in him what you do with young players who eventually become good in the NFL. Or great. There's a comfort Dart displays that is almost uncanny. He doesn't get rattled and looks like he's been in the league for years.\nIt was clear that Dart was a good athlete. We saw that in college. But many times that athleticism doesn't translate into the pros. Even in the preseason. But, hoo boy, is it translating for Dart.\nNew York Giants coach Brian Daboll has insisted that Russell Wilson is the starter, but yeah that won't last. There's almost zero chance Wilson starts the entire season, injuries or no injuries. It would be stunning if Wilson lasted past Week 5.\nDude, calm yourself. Calm. Yourself.\nYou calm down. I'm just telling you what's going to happen. This is incredibly predictable, and if I'm wrong I know you people won't hesitate to remind me.\nIn all seriousness, what he's done is impressive. He started against the New England Patriots in the team's Thursday preseason finale and made an impact early when he scrambled and found Gunner Olszewski on a short pass. Olszewski ran for 50 yards. That drive ended with Dart throwing a 7-yard touchdown pass.\nGiants receivers dropped five passes, and it didn't matter to Dart. Learning experience.\nOnce, he got carried away on a scramble, didn't go out of bounds, and got hit from behind. Cameras caught Daboll telling Dart: \"Slide.\" Learning experience.\nPreseason is to regular season what a starship is to a shuttlecraft. In preseason, no defensive coordinator is spending the week hardcore game-planning against you. Dart isn't seeing sophisticated blitzes and schemes. He's facing complete blandness and not even close to what the NFL has to offer in terms of defensive athletes.\nBut when I watch him, I don't feel like the game is above him. Or too difficult, and I think he can adapt.\nHe'll make mistakes, sure. He's a rookie. Dan Marino made mistakes. So did Elway. (There you go with Elway again.)\nThere will be ups and downs and risks but what he did in the preseason was fairly telling.\nLooking at the Giants schedule, the team seems unlikely to start him in the season opener against Washington. That would be a little much. Then come games against Dallas, Kansas City, the Chargers and the Saints. If Wilson is struggling, that Saints game might be a place to make a change.\nYes, we know Jaxson Dart in the preseason was going against future plumbers and CFL players. But watch out, Russell Wilson.\nWatch out."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/packers/2025/08/28/packers-super-bowl-micah-parsons-trade/85874383007/",
      "text": "Opinion: Micah Parsons' trade to Packers automatically makes them Super Bowl contenders\n- The Green Bay Packers traded for star linebacker Micah Parsons, significantly boosting their Super Bowl chances.\n- Green Bay paid a hefty price, including two first-round picks and defensive tackle Kenny Clark, but secured Parsons on a record-breaking contract.\n- Without Parsons, the Pack still generated 45 sacks in 2024.\nThe Green Bay Packers elevated themselves into the NFC's premier tier – if not all the way to the top – following Thursday’s blockbuster trade with the Dallas Cowboys for edge rusher and linebacker Micah Parsons, one of the game’s best defensive players.\nOne news cycle is all it took for Packers fans from Kenosha to Eau Claire to start having Super Bowl dreams. Rightfully so.\nIn the playoffs, rushing attacks and defense travel. Quarterback Jordan Love has played better in the second halves of back-to-back seasons and, should he be healthy, the list of teams capable of knocking off the Packers is short. Like, Eagles, Lions (maybe?), end-of-list short. And I know who I'll now be picking to represent the NFC in California at Super Bowl 60.\nYou might laugh at the idea of Parsons making the Packers even more of a Super Bowl contender. I laughed at the idea of Parsons playing for any team outside of the greater Dallas metro area. Comedy can precede reality.\nGreen Bay secured Parsons for an additional four years on a deal worth $188 million with $136 million guaranteed, making him the highest-paid non-quarterback in NFL history. Sacrificing two first-round picks and defensive tackle Kenny Clark for a two-time All-Pro who has recorded at least 12 sacks in a season? Clark will be missed in the middle of the defensive line, but if Green Bay can realize its postseason potential, the picks in the 20s could be less consequential.\nAt 26, the Packers will have the pleasure of employing Parsons through the rest of his 20s. I'm no GM, but acquiring a player of Parson's caliber on the right side of his expected prime can only be a good thing.\nThe circumstances of arrival aren't the same, but Reggie White's signing with the Packers before the 1993 season is similar to the Parsons trade. White was second in Defensive Player of the Year voting his first season in Green Bay. Four seasons after he signed, the Packers were Super Bowl champions. The Packers are hoping for a more immediate return on investment this time, with the NFL's latest dynasty, the Kansas City Chiefs, playing in the AFC. Gone are the NFC powerhouse dynasties of the 1990s in the San Francisco 49ers and Cowboys.\nGreen Bay made six consecutive postseasons following White's arrival. But getting into the dance hasn't been the issue for the Pack since Aaron Rodgers led them to a victory in Super Bowl 45 over the Pittsburgh Steelers after the 2010 season. Making it to the final game of the season has been the challenge, and Parsons' presence raises their chance of making it through the NFC gauntlet.\nThe production won't happen immediately, since Parsons is apparently nursing some sort of back ailment – a negotiating tactic with Dallas, perhaps – and sat out training camp. The Week 2 \"Thursday Night Football\" game between the Packers and Commanders is now that much juicier.\nFamously, the Packers do not have a singular owner (or ownership group), which may be a welcome development for Parsons and his representation in the wake of his contract dispute with Jerry Jones and the Cowboys' front office that played out publicly and, clearly, didn't end well.\nKudos to Packers general manager Brian Gutenkust for pulling off the deal amid the scrutiny of social-media narratives and a franchise legend openly messing around online (turns out manifestation is a powerful tool). Ed Policy, the franchise's new CEO who took over for Mark Murphy last month, deserves credit for allowing Gutenkust to spend that type of resources – surrendering quarterback-level compensation in the process.\nLove is on a mega-extension, offensive lineman Zach Tom signed a big deal this offseason and Josh Jacobs and Xavier McKinney were brought in as a free agents prior to last season. The front office has identified a window and is going for it. Ask a Cowboys fan (or a Mavericks fan, sorry Dallas) – that's not always the case.\nIf Parsons can replicate his production over the next four seasons (52.5 sacks), he'd be 10th on the all-time Green Bay sack list. Defensive coordinator Jeff Hafley, entering his second season in Green Bay, should be doing backflips on the tarmac at Austin Strabel International Airport to greet Parsons and thank him for the immediate augmentation he provides to the Packers' pass rush.\nThe Packers tied for eighth in sacks as a team last season with 45. They were middle-of-the-pack with 94 quarterback hits and toward the bottom of the league in sack percentage (7.4). But Parsons joining up with Rashan Gary, Edgerrin Cooper and Lukas Van Ness is problematic for playcallers in the stacked NFC North and beyond.\nCompared to the Packers, the Eagles still have the better roster. Repeating as champions is no easy task, however. Winning both games last season against Green Bay, the Lions have the recent momentum. The Commanders (run game, defense) and Rams (Matthew Stafford's back) have question marks.\nIf pre-Week 1 thoughts are meant to be intrusive, let this one float in the cranial membrane for a moment: the Packers are going to the Super Bowl."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/28/micah-parsons-trade-grades-green-bay-packers-dallas-cowboys/85874229007/",
      "text": "Micah Parsons trade grades: Who won deal between Packers, Cowboys?\n- The Dallas Cowboys have traded Micah Parsons to the Green Bay Packers.\n- Dallas is receiving DT Kenny Clark and two first-round picks from Green Bay.\n- Parsons will receive a four-year, $188 million deal from the Packers.\nThe Micah Parsons saga has reached an endpoint that might have seemed unfathomable just weeks ago.\nOn Thursday, the Dallas Cowboys agreed to trade the two-time All-Pro edge rusher to the Green Bay Packers in exchange for two first-round picks and defensive tackle Kenny Clark. Parsons, meanwhile, will receive a four-year, $188 million contract that, in addition to making him the NFL's highest-paid non-quarterback in NFL history, includes $120 million fully guaranteed at signing.\nA massive exchange of resources figures to transform the NFC landscape immediately, with the Packers making an all-out move to reconfigure a flagging pass rush and a Cowboys team that has stubbornly resisted a rebuild now on uncertain ground. But who won the deal?\nLet's hand out grades for maybe the most consequential move of the NFL offseason:\nPackers trade grade: A-\nTypically, dealing away premium draft picks for highly paid veterans is bad business for NFL teams. Between the selections involved and the massive bill that will accompany Parsons to Wisconsin, the Packers are paying a price that would be prohibitive for almost any player in the league.\nExcept, of course, Parsons.\nWhen it comes to one of the game's most important tasks in rushing the passer, the three-time finalist for NFL Defensive Player of the Year is very nearly in a class all his own. Of course, he has never won the award that peers T.J. Watt, Myles Garrett and Nick Bosa all have claimed. But Parsons only turned 26 in May, and he's the only player beyond late legendary pass rusher Reggie White to record at least 12 sacks in each of his first four seasons.\nFor that, it's understandable why a Packers organization known for focusing on home-grown talent would take such a massive swing.\nJeff Hafley reinvigorated Green Bay's defense in his first year at the helm, with his aggressive scheme generating big plays and helping the unit rank fifth in yards allowed and sixth in scoring. But with a pass rush win rate that ranked 26th in the NFL, the coordinator seemed to be staring at a ceiling. Parsons should be a force multiplier for Rashan Gary, who could feast in a complementary role, and the rest of the front that Hafley can count on to bring the heat.\nVery few teams are actually one player away from Super Bowl contender status. But Parsons is the rare talent who might put the Packers over the top - or at least keep them at the front of a hypercompetitive first tier of NFC teams. And with an abundance of young talent, Green Bay could afford to take bold action.\nCowboys trade grade: D+\nWell ... that's it?\nThe NFL offseason landscape was largely defined by cooler heads prevailing in heated negotiations, from Myles Garrett's resolution with the Cleveland Browns to Terry McLaurin landing the long-term contract he sought from the Washington Commanders. Even perhaps the most acrimonious standoff of the summer was at least temporarily defused when Trey Hendrickson and the Cincinnati Bengals found a path forward for 2025.\nYet somehow Jerry Jones couldn't manage to de-escalate the bargaining nightmare of his own creation.\nThe self-inflicted nature of this clash is the most damning aspect for Dallas. In his departure, Parsons said, \"I never wanted this chapter to end, but not everything was in my control. ... Through it all, I never made any demands. I never asked for anything more than fairness. I only asked that the person I trust to negotiate my contract be part of the process.\"\nWhile contentious contract talks between stars and teams are nothing new, the Cowboys - in typical and unfortunate Jones fashion - took things to another level by repeatedly airing out grievances, particularly regarding agent David Mulugheta's role in the talks. That didn't sit well with Parsons, who on Aug. 1 cited \"repeated shots\" as part of the reason he no longer wished to play for the team.\nParsons receiving his wish, however, seemed far-fetched until Thursday, when reports indicated the Cowboys were finally listening for deals. With their star pass rusher gone, what are the Cowboys for 2025 and beyond?\nJones has furiously resisted any notion of a rebuild, unwilling to give off the appearance that his team isn't clawing its way to end a Super Bowl drought now standing at 30 years. Dallas already appeared to be wading in a sort of no-man's land for Brian Schottenheimer's debut season. Now, it's firmly stuck there.\nWith Dak Prescott still claiming the title of the NFL's highest-paid player thanks to a four-year, $240 million contract extension reached just last year, the Cowboys can't blow things up. Jones, of course, would never accept that outcome. The acquisition of Clark would seem to reinforce the stubbornness from up top. Sure, there's been a sizable void at nose tackle for some time. But how does inserting a player who will turn 30 in October move the needle for a defense that now has a massive hole on the edge? Good luck to defensive coordinator Matt Eberflus, who has never been known as a heavy blitzer but will have to concoct some innovative ways to generate pressure with what now looks to be a pretty suspect group.\nThe two first-round picks are nothing to sneeze at, but barring an injury to Jordan Love, the Packers likely are only turning over choices in the mid-20s. If Jones expects this trade to reboot his franchise, he's very likely overconfident in his own personnel preferences.\nJones has pushed back on many of the emerging narratives about his priorities. In an exclusive interview with USA TODAY Sports' Jarrett Bell, he discussed the franchise's astronomical value and popularity by saying, \"I explain it by hard work. I bust my ass. This exact same hard work that is going on in the football. I work my ass off.\"\nMaybe it's not Jones' effort that's worth questioning. In this case - and many others - though, he's hustling backward."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/28/nfl-new-uniforms-ranked-best-worst-rivalries-nike/85864301007/",
      "text": "Ranking NFL's newly revealed Nike 'Rivalries' uniforms best to worst\n- The NFL and Nike unveiled eight new \"Rivalries\" uniforms for the AFC East and NFC West teams.\n- The uniforms celebrate local traditions and team legacies with unique designs.\n- The uniforms will be worn once during the 2025 season in a divisional rivalry game.\nAfter four months of anticipation, particularly among those who fancy themselves football fashionistas, the NFL and Nike revealed their new “Rivalries” uniforms Thursday morning – kits that make a departure from the fairly conservative looks the league has featured for most of its hundred-plus years of existence.\nEffectively cousins to the NBA’s popular \"City Edition\" uniforms or Major League Baseball’s \"City Connect\" jerseys, the \"Rivalries\" unis present looks – if ones that may not be embraced by traditionalists – that will make the AFC East and NFC West teams that wear them this season pop for viewers while attempting to celebrate the local ethos of those clubs.\n\"Everyone loves good rivalries, which have the power to connect and transform athletes, fans, teams and entire communities,\" Nike relayed in a press release regarding the uniforms it first teased on the second day of the 2025 NFL draft.\n\"The 2025 Rivalries uniforms will celebrate storied local traditions and unite fan communities with designs unique to select cities and teams.\n\"The designs are rooted extensively in the legacies and inspirations true to each team, serving as authentic, competitive expressions of community pride while giving athletes and fans an opportunity to connect like never before.\"\nNFL UNIFORM POWER RANKS: Which teams are dressed best? Worst?\nThe new uniforms for all eight teams – and they all had direct input into their customized threads – will be worn once this season during a home game against a division rival (details below). They will then become part of the club’s uniform closet for the next three years.\nThe league’s other 24 teams will get their own \"Rivalries\" uniforms in future years, two additional divisions to be added to the rotation annually through the 2028 season.\n\"Rivalries will bring fresh energy to the field with each new uniform, while providing a platform to amplify the community and hometown pride that is rooted in each NFL fan,\" said Taryn Hutt, the NFL’s vice president of club marketing, said in a statement.\nThe new \"Rivalries\" jerseys and associated gear and apparel will be available at nike.com, NFLshop.com and fanatics.com starting Sept. 10.\nThe league will literally look quite different in 2025 as eight teams – the Bills, Browns, Steelers, Chargers, Commanders, Packers, Saints (a new helmet and a new/old jersey) and Buccaneers – previously revealed new throwback and/or alternate uniform looks earlier this summer.\nUSA TODAY Sports was granted an early look at the \"Rivalries\" uniforms, and they certainly demand a ranking of their own, so here goes – from best to worst:\n1. Arizona Cardinals\nDid you hear about the haboob (better known as a dust storm) that engulfed Phoenix on Tuesday? Apparently it also sand-blasted the Cards’ new uniforms – to glorious effect.\nArizona's \"Rivalries\" unis appear pockmarked by sand and feature a reimagined state flag on the shoulder (a callback to the flag also pops off the helmet bumper). The flag, jersey number and pant stripes are outlined with copper trim, an ode to the official metal of Arizona. Literally a gritty look, the official theme of the Cardinals’ Rivalries unis is “Built to Last.”\n2. Seattle Seahawks\nThey’re a close second, mainly because – I think – going predominantly with \"Wolf Grey\" for the jerseys and pants might be a slight miss. But a “High-Decibel Zone” presentation meant to honor the team’s loud, proud, vocal fans is pretty sweet − Pearl Jam, Nirvana, Heart and Seattle's other legendary rock bands surely approving. A soundwave pattern ripples across the shoulders and down the pants, appropriate given this team has set off seismometers in Seattle amid playoff touchdowns, like Marshawn Lynch’s epic one in a 2011 wild-card upset of New Orleans.\n‘Hawks fans are further honored with “12s” embedded throughout the uniform including a cascade of them within the jersey numbers. The “Beetle Green,” aka iridescent green, trim is a nice change from the typical \"Action Green\" that looks like highlighter ink.\nBut the coolest element is the helmet, a metallic chrome dome with bluish-green coloring that’s been much better executed than the black-and-gold two-tone crowns the Jaguars wore a few years ago.\n3. Buffalo Bills\nNike’s hype video will make “Game of Thrones” fans wonder if the Bills will be now playing north of the Wall (they do have a new stadium under construction after all, but unclear if it’s rising in Westeros).\nAs for the uniforms, they’re quite iced out – similar to the Vikings’ “Winter Warrior” look, complete with silver numbers and helmet logo. Buffalo’s \"Rivalries\" duds carry a \"Cold Front” lable, and fans will be thrilled to see “Bills Mafia” stitched inside the collar. But the coolest detail is the silvery, texturized charging buffalo logo on the sleeve.\n4. New England Patriots\nIf the Bills are north of the Wall, then the Pats seem based somewhere near the Iron Islands. Their “Nor’Easter” uniforms feature a sharp “Storm Blue” jersey “inspired by the New England fog.” The shoulder and tapered pants striping boast reflective silver material “designed to represent beams of light shining off the lighthouse connected to Gillette Stadium.” Also unveiled, a new “NE” logo appearing on the jersey's sleeves.\nThe collar is busy but not in a bad way, encompassed by six red stars representing each state in New England. “We Are All Patriots,” which owner Robert Kraft declared after the team’s first Super Bowl win in 2002 – just five months after 9/11 – is written inside of it. Solid.\n5. San Francisco 49ers\nThey clearly want you to know their fan base is known as the “Faithful,” the word written in gold script above the jersey numbers while “Faithful to the Bay” rings the collar's interior. The red jersey numbers are presented in a slick “saloon font” and trimmed in a vibrant gold the team has never really featured aside from its helmets.\nGiven how the team has incorporated a cream color into its overall palette recently – noticeably on its website and social accounts – it is a bit disappointing the Niners went with a primarily black uniform. But this “For the Faithful” version is the team’s best homage yet to the California gold rush for which it’s named.\n6. New York Jets\nSadly, its best aspect – “Gotham City Football Club” written in Gothic font and topped by the Jets’ plane logo – rests inside the neckline. The colors (“Empire Green,” black and gray) are meant to serve as a callback to Hall of Fame QB Joe Namath, who led the NYJ to their only Super Bowl nearly 57 years ago. The helmet, which has a stripe down the centerline, looks nice, but the Gothic jersey nubmers are shaky. The graphics on the sleeves and chest logo are a whiff, evoking a manhole cover ... though the Jets often wind up in the gutter.\nWe’ll continue to wish this team would go whole hog on intimidating military airframes or, if Gotham is going to be the theme, give us something more Batman-adjacent. Alas.\n7. Los Angeles Rams\nNike can be forgiven given a team that’s played in Cleveland, L.A. (twice), Anaheim and St. Louis doesn’t have especially deep roots. So the Rams’ “Midnight Mode” really just renders them yet another squad with a nearly black (midnight blue) alternate, though the sleeves do a better job showcasing the team’s iconic horns. “Rams House” is stitched inside the collar – even though SoFi Stadium is notoriously often overrun by visiting teams’ fans. The dark helmet does somewhat recall the ones worn by the \"Greatest Show on Turf\" teams led by Hall of Fame QB Kurt Warner in STL.\n8. Miami Dolphins\nFeels like we’re reverting to the 1990s – it was a better time, right? – with more teams wanting a black-ish version uniform in their closet. Miami’s “Dark Waters” unis are meant to convey speed and South Florida’s night life in what’s officially a “dark pitch-blue” uniform with hits of “Turbo Green,” and the club’s standard aqua and orange. Meh, we’re not fooled. Missed opportunity not pivot to something closer to a “Miami Vice” feel.\nWhen will the 'Rivalries' uniforms be worn in 2025?\n▶ Arizona Cardinals: Sept. 25 vs. Seattle Seahawks\n▶ Buffalo Bills: Oct. 5 vs. New England Patriots\n▶ Los Angeles Rams: Nov. 16 vs. Seattle Seahawks\n▶ Miami Dolphins: Sept. 29 vs. New York Jets\n▶ New England Patriots: Nov. 13 vs. New York Jets\n▶ New York Jets: Dec. 7 vs. Miami Dolphins\n▶ San Francisco 49ers: Jan. 4, 2026 vs. Seattle Seahawks\n▶ Seattle Seahawks: Dec. 18 vs. Los Angeles Rams\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/green-bay-packers/335",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/07/23/nfl-grades-offseason-report-cards-training-camps/85321954007/",
      "text": "With training camps open, time to grade every NFL team's offseason – just two get A's\nThe NFL offseason, such as it is, officially ends today as the remainder of the league’s 32 teams kick off their training camps. Or, as Chargers coach Jim Harbaugh said after his team was the first to fully report last week: \"It's being reborn. It's the start of the year. Some would think it's January 1st. Those espoused to Catholicism, Christianity would think it's the birth of Christ. Us in football, it's the first day of training camp.\"\nAs far as we know, it’s not New Year's Day, nor are Three Wise Men set to report to Bethlehem. But we get it, Coach. Back to the football.\nAnd while positional battles, injuries and the constant churn of league-wide transactions will continue to impact every club’s roster and depth chart, issuing report cards for each team’s showing since the 2024 season ended can no longer wait now that squads have essentially taken their full shapes for the upcoming campaign.\nSo, without further ado, here are each team’s grades for their performances off the field over the past few months:\nChicago Bears: A\nThey might have won the offseason the minute they hired highly, highly regarded Ben Johnson as their head coach, not only adding an offensive wunderkind but damaging the rival Lions in the process given the impact he’d had on their attack, which ranked in the top five each of the past three seasons.\nRecently extended GM Ryan Poles made a series of other moves to not only help Johnson but also boost second-year QB Caleb Williams, who had an uneven rookie season (to put it mildly). Poles buttressed the blocking by trading for Gs Joe Thuney, an All-Pro, and Jonah Jackson before signing highly regarded C Drew Dalman. The draft also brought two new toys for Williams, TE Colston Loveland and WR Luther Burden plus, maybe, his next left tackle (Ozzy Trapilo). Poles also put in work on the defensive side, extending LB T.J. Edwards for two years, signing two-time Pro Bowler Grady Jarrett and up-and-coming pass rusher Dayo Odeyingbo before snagging DL Shemar Turner in the draft’s second round.\nLittle room for further excuses here, though Johnson and Poles now seem to have far more security than the players.\nNew England Patriots: A\nThe return of Mike Vrabel to Foxborough as this team’s new head coach should have the broadest impact on this franchise now and well into the future – and is also the stroke that should be the primary accelerant to second-year QB Drake Maye’s career. But the Pats also did plenty from a roster standpoint to bulwark the league’s worst offense – notably earmarking its first draft four picks to that side of the ball. First-round OT Will Campbell and second-round RB TreVeyon Henderson are both expected to immediately have major roles. New WR Stefon Diggs and RT Morgan Moses are veteran additions and somewhat damaged goods – both coming off knee surgery – but benefit Maye.\nExpect a big jump defensively after most of the team’s copious free agent budget went there in order to sign DT Milton Williams (4 years, $104 million), considered perhaps the crown jewel of a thin free agent crop. LB Robert Spillane, OLB Harold Landry and DB Carlton Davis III all got three-year deals worth more than $130 million in sum – a lot to shell out for a trio with all of one Pro Bowl nod on their collective résumés. The return of DT Christian Barmore, who was sidelined by blood clots last season, is a bonus.\nIf Maye continues along his trajectory, a team that won four games in 2024 could easily double that total.\nNew York Jets: A-\nLast week was the cherry on top of Phase One of their cultural reset, WR Garrett Wilson and CB Sauce Gardner signing four-year extensions that not only solidify the roster’s foundation but underscore the philosophical buy-in no-frills rookie coach Aaron Glenn is getting before even working a game. Those deals followed what seemed like a strong draft anchored by first-round RT Armand Membou and second-round TE Mason Taylor, who should both be Week 1 starters while adding further steel to this club’s backbone. New QB1 Justin Fields, tabbed to replace Aaron Rodgers after Glenn put an end to that era (error?), represented new GM Darren Mougey’s biggest foray into free agency and will either put a wedge in the team’s revolving door behind center or put them back in the market for a passer in what should be a strong 2026 draft at the position. CB D.J. Reed will be missed.\nPhiladelphia Eagles: A-\nAs has been the case with nearly every reigning champion during the salary cap portion of the Super Bowl era, you can’t keep everyone. And while the Eagles will return their offense nearly intact – it should be fine sans RG Mekhi Becton – the defense took some hits. Among the departed: Williams, OLB Josh Sweat, DBs Darius Slay and C.J. Gardner-Johnson and retired DE Brandon Graham.\nHowever EVP/GM Howie Roseman, who always seems ready for what’s next, issued smart raises to RB Saquon Barkley and RT Lane Johnson, got new deals done for LB Zack Baun and C Cam Jurgens and, thanks to his drafting acumen, the defense appears backfilled by capable replacements, though there’s no sugarcoating the loss of depth. (However Roseman did bring in a lot of accomplished veterans at low cost, a list that includes LBs Azeez Ojulari and Josh Uche, CB Adoree’ Jackson, TE Harrison Bryant and RB AJ Dillon.)\nVersatile first-round LB Jihaad Campbell, who likely wouldn’t have fallen to the 31st overall pick had his shoulder been healthy, could also make up some of the shortfall. And watch out for second-round S Andrew Mukuba. In other good news, coach Nick Sirianni got an extension … as did the “Tush Push,” perhaps partially thanks to a late shove from former pusher Jason Kelce to the league's owners.\nBaltimore Ravens: B+\nAFC North champs the past two seasons, they’re nicely set up to make another strong Super Bowl push – getting Pro Bowl LT Ronnie Stanley re-signed while adding accomplished veterans such as WR DeAndre Hopkins and CB Jaire Alexander. Their top two draft picks, S Malaki Starks and OLB Mike Green, could make instant impacts. A tight cap could make anything further on the personnel side a challenge, but an extension needs to get done fairly soon for All-Pro QB Lamar Jackson – he carries a prohibitive $74.5 million cap hit in 2026 and ’27 – and then new deals for young core players such as S Kyle Hamilton, C Tyler Linderbaum and TE Isaiah Likely should follow. Also, it remains to be seen what Baltimore gets from whomever replaces disgraced former K Justin Tucker, who was released last month.\nDenver Broncos: B+\nA team that made a surprising playoff run in 2024 behind rookie QB Bo Nix could be poised to take the next step. Denver drafted DB Jahdae Barron and RB RJ Harvey – both could play a ton of snaps as rookies – and took a targeted approach to free agency, which brought TE Evan Engram, RB J.K. Dobbins, LB Dre Greenlaw and S Talanoa Hufanga … though all of those veterans come with extensive injuries in their backgrounds. Yet if half of them pan out, Sean Payton’s team could challenge K.C. for AFC West supremacy.\nKansas City Chiefs: B+\nYou wouldn’t think a cemented dynasty would have this productive an offseason or this much financial flexibility – and QB Patrick Mahomes deserves more credit on that front given his ongoing willingness to restructure his contract and allocate money elsewhere. And while not everyone will be back, notably Thuney and S Justin Reid, the team managed to extend G Trey Smith and DE George Karlaftis, re-signed LB Nick Bolton, WRs Hollywood Brown and JuJu Smith-Schuster and RB Kareem Hunt.\nGM Brett Veach was also able to add OT Jaylon Moore and CB Kristian Fulton. TE Travis Kelce will, at minimum, play out the final year of his contract, and WR Rashee Rice returns after last year’s season-ending knee injury − though he could miss the early part of the season if the NFL hands down a suspension in the aftermath of his legal issues being resolved. The defense was heavily augmented by the draft, but the spotlight will be on first-round OT Josh Simmons who, along with Moore, will be vying to solidify the new-look left side of a line that failed the team during its Super Bowl 59 three-peat bid.\nIt’s a fascinating mix of stability and churn for a team that’s only missed the Super Bowl once in the past six seasons. Yet the O-line does remain something of a question aside from Smith and C Creed Humphrey.\nNew York Giants: B+\nIf HC Brian Daboll and GM Joe Schoen are truly on the hot seat … gonna be interesting. First-round QB Jaxson Dart is clearly the future here, but will Daboll have the luxury of developing him in a redshirt manner after Schoen brought in veterans Russell Wilson and Jameis Winston? How much will the secondary benefit after New York invested three years and nearly $100 million collectively for S Jevon Holland and CB Paulson Adebo? (Maybe a lot with No. 3 overall pick Abdul Carter, Brian Burns and Kayvon Thibodeaux rushing quarterbacks.) A draft that brought Carter, Dart and RB Cam Skattebo could pay off handsomely … whether it’s for this front office or the next one.\nSeattle Seahawks: B+\nA team that unexpectedly won 10 games and fell a tiebreaker short of postseason in 2024, Mike Macdonald’s first as head coach, nevertheless took something of a sledgehammer to the top of its roster. Gone are QB Geno Smith and WRs DK Metcalf and Tyler Lockett, among others. In are Pro Bowl QB Sam Darnold, WR Cooper Kupp and DE DeMarcus Lawrence, among others. The trades of Smith and Metcalf paved the way for a big-time draft that brought OL Grey Zabel, S Nick Emmanwori, TE Elijah Arroyo and highly intriguing third-round QB Jalen Milroe. Should be fascinating to see how a team more tailored to Macdonald’s philosophy coalesces.\nTennessee Titans: B\nGiven QB Cam Ward was the top pick of this year’s draft, there’s been remarkably little national buzz around the player or his new team. And maybe that’s not such a bad thing – ask the 2024 Bears. Ward has decent weaponry around him, and rookie GM Mike Borgonzi prepared for his arrival by securing veteran G Kevin Zeitler and LT Dan Moore in free agency. And now it’s undoubtedly full speed ahead with Ward following Monday’s news that last year’s starter, Will Levis, will miss the 2025 season after opting to undergo shoulder surgery.\nArizona Cardinals: B\nHeavy defensive emphasis, GM Monti Ossenfort taking DT Walter Nolen and highly regarded CB Will Johnson with his first two draft picks after plucking Sweat from the champion Eagles during free agency. Trey McBride got a deal that briefly made him the league’s best paid-tight end at $19 million annually. Will it be enough to vault a team that doubled its win total to eight last season into the playoffs? If WR Marvin Harrison Jr. has improved as much as he and the team think, maybe.\nBuffalo Bills: B\nIs their interminable Super Bowl quest going over the top? Buffalo's biggest move was re-signing QB Josh Allen to a six-year, $330 million extension – which is actually below market value at $55 million annually. Securing the reigning league MVP is a huge plus, and GM Brandon Beane also reinvested heavily elsewhere in his roster (DE Greg Rousseau, WR Khalil Shakir, LB Terrel Bernard, CB Christian Benford). The team seems confident the development of WR Keon Coleman, addition of WR Josh Palmer and return to health by TE Dalton Kincaid can take the passing game up a notch. But will a generally conservative reliance on continuity be enough? Also, first-round CB Maxwell Hairston is dealing with legal issues, and DE Joey Bosa (calf) is already coping with an injury.\nGreen Bay Packers: B\nThey made a splash – by Wisconsin standards – after taking Matthew Golden in the first round of the draft, breaking a 23-year streak when they’d avoided Round 1 wideouts. If he can establish himself as the No. 1 receiver, much as HC Matt LaFleur hates that label, this offense could reach a new level. GM Brian Gutekunst made other significant, if less noted, moves, extending OL Zach Tom and bringing in free agent G Aaron Banks and CB Nate Hobbs, all on four-year contracts. Hobbs basically replaces now-departed Alexander.\nHouston Texans: B\nAfter the offense regressed around second-year QB C.J. Stroud in 2024, a team that’s won the past two AFC South crowns should probably be given credit for not resting on its laurels, largely remaking the O-line and receiver room while firing coordinator Bobby Slowik, who was taking head coach interviews just a year ago. It remains to be seen how Stroud fares with new play caller Nick Caley or behind a line that could have a different player in every spot but right tackle compared to the combinations Houston used in last season’s playoffs. But with newly acquired vets like WR Christian Kirk and Gardner-Johnson plus a nice haul of rookies – OL Aireontae Ersery, WRs Jayden Higgins and Jaylin Noel – and perhaps six picks in the first three rounds of next year’s draft, it’s easy to understand GM Nick Caserio’s logic. And he gets extra points for moving quickly to extend All-Pro CB Derek Stingley Jr.\nJacksonville Jaguars: B\nWith the bold move up to get WR/CB Travis Hunter, rookie GM James Gladstone is banking on this as a transformative offseason that’s potentially netted a new face of the franchise. Whether Hunter, who cost the Jags their second-rounder this year and a first in 2026, can effectively gain this team a roster spot or even consistently be a major presence on both sides of the ball game in and game out remains to be seen. His impact will also be largely dictated by the health of QB Trevor Lawrence, who underwent surgery on his non-throwing shoulder and is adapting to yet another head coach with rookie Liam Coen now in the post.\nBut Lawrence should enjoy upgraded protection after Gladstone signed free agent OL Patrick Mekari and Robert Hainsey to three-year deals. But the organization really needs Coen, Hunter, WR Brian Thomas Jr. and maybe even new deep threat Dyami Brown to help the No. 1 pick of the 2021 draft blossom into the superstar he was projected to be coming out of Clemson.\nLos Angeles Rams: B\nYou’re forgiven if you thought a team that traded out of the first round basically spent the offseason swapping out Kupp for Davante Adams and tweaking its O-line. But GM Les Snead also got new deals done for QB Matthew Stafford and LT Alaric Jackson while adding NT Poona Ford to an ascending defense. Second-round TE Terrance Ferguson could quickly add a new offensive dimension.\nMinnesota Vikings: B\nHC Kevin O’Connell and GM Kwesi Adofo-Mensah both got deserved extensions in the wake of a surprising 14-win season and busily did what they could to put new QB1 J.J. McCarthy into an optimal situation as he prepares to take his first regular-season snaps following a rookie year completely lost to a knee injury. That’s meant adding OL Will Fries, Ryan Kelly and first-rounder Donovan Jackson plus re-signing RB Aaron Jones. McCarthy should also benefit from a play-making defense reinforced by veteran DTs Jonathan Allen and Javon Hargrave plus the retention of S Harrison Smith and fast-improving CB Byron Murphy. But this whole thing might be undone if the decision to part with Darnold proves a mistake.\nPittsburgh Steelers: B\nUltimately, this season will be judged by whether a team nearly a decade removed from its last playoff win made the right call at quarterback … something it hasn’t done for some time. But after failing to convince Fields, who was benched for Wilson last season, to re-sign or pry Stafford loose from the Rams, per reports, coach Mike Tomlin and GM Omar Khan settled on Rodgers – for what’s likely a one-year rental – rather than roll the dice on a rookie passer in a draft that seemed thin on QB prospects.\nOtherwise? In are Metcalf, CBs Jalen Ramsey and Slay and TE Jonnu Smith. Out are WR George Pickens, RB Najee Harris and S Minkah Fitzpatrick. For better or worse, soon-to-be 31-year-old OLB T.J. Watt just landed an extension averaging $41 million, meaning he’s now the league’s best-compensated non-QB for the next five minutes. A seemingly strong draft class headlined by DL Derrick Harmon and RB Kaleb Johnson effectively gets additional boosts from 2024 first-round RT Troy Fautanu and speedy third-round WR Roman Wilson, who made one appearance apiece as rookies.\nWill all that be enough to win more than 10 games and reach the divisional round of postseason? We don’t have to tell you to stay tuned.\nTampa Bay Buccaneers: B\nA team that values stability as much as any certainly maintained it, extending the contracts of GM Jason Licht and coach Todd Bowles as the organization eyes a fifth straight NFC South crown. WR Chris Godwin and LB Lavonte David are also back. OLB Haason Reddick and rookie WR Emeka Egbuka are probably the most prominent newcomers, though the draft brought quite a few defensive reinforcements. LT Tristan Wirfs (knee surgery) will miss the start of the season, but Godwin is hoping his ankle is ready to go for Week 1.\nDallas Cowboys: B-\nWelp, it’s never dull in Big D. The Cowboys began 2025 with the fairly surprising choice of naming Brian Schottenheimer to his first head coaching gig – he replaced Mike McCarthy – and his tenure seems to be off to a good start in the locker room. It helps to have QB Dak Prescott fully recovered from the hamstring injury that cut his 2024 season short. There’s also been ample buzz following the trade with Pittsburgh for Pickens.\nIssues certainly remain − though, despite owner Jerry Jones’ rhetoric, expect DE Micah Parsons to soon become the league’s next highest-paid non-quarterback. Figuring out if they have an effective runner to replace departed RB Rico Dowdle, whether Joe Milton III is potentially ready to fill in for Prescott and if recently fined CB Trevon Diggs can get back into the team’s good graces could actually be more difficult answers to find.\nSan Francisco 49ers: B-\nSome bills came due, literally and figuratively. Primarily, Brock Purdy finally became eligible to come off the NFL’s version of quarterback welfare, signing a five-year, $265 million extension. Two of the team’s other linchpins, TE George Kittle and LB Fred Warner, also inked new deals.\nBut there were unavoidable ripple effects, perhaps most notably the trade of WR Deebo Samuel. The defense was also stripped of several former mainstays, including Greenlaw, Hufanga, DE Leonard Floyd, CB Charvarius Ward, and DTs Hargrave and Maliek Collins. Former Jets coach Robert Saleh is back to run the unit but will have to try and revive it with a lot of new players after GM John Lynch devoted his first five 2025 draft picks to the defensive side of the ball before trading for DE Bryce Huff.\nOn the health front, All-Pros Christian McCaffrey and Trent Williams seem ready to return, but WRs Brandon Aiyuk and Ricky Pearsall are currently on the PUP list.\nWashington Commanders: B-\nGiven QB Jayden Daniels enters his second season as a bona fide MVP candidate, you want to commend a team that’s already going for it by adding veterans like OLB Von Miller. And retaining leaders like LB Bobby Wagner, TE Zach Ertz and QB2 Marcus Mariota should only pay current and future dividends. Rookies Josh Conerly and Trey Amos should contribute heavily early and often.\nYet it’s worth asking if Washington will ultimately be happy with its trades for Samuel, who’s a touch volatile and often banged up, and LT Laremy Tunsil, who led the NFL with 19 penalties in 2024 (12 of them false starts). Also, three years and $45 million for DL Javon Kinlaw? And it probably shouldn’t have taken this long to reach a financial agreement with WR Terry McLaurin, who’s been a good soldier here long before the team got good … or even respectable.\nNew Orleans Saints: C+\nDerek Carr recently retired. Former All-Pro Ryan Ramczyk officially retired. The longtime 4-3 base defense was retired. Tyrann Mathieu juuust retired. At least the team's often tenuous cap situation improved. Reid, OLB Chase Young and TE Juwan Johnson are all good players who signed three-year deals. Rookies Kelvin Banks, Tyler Shough and Vernon Broughton, might be, too. However expectations for this season should be decidedly in check. Perhaps it's all ultimately for the best if Shough turns out to be the starting quarterback for rookie HC Kellen Moore much sooner than initially expected.\nCarolina Panthers: C\nThough they drafted WR Tetairoa McMillan with the eighth pick of the first round, the general lack of tinkering with the offense is indicative of how they feel about QB Bryce Young’s progress last year and the pieces around him. The return of DE Derrick Brown, who missed all but one game in 2024 with a knee injury, should be the best news for a defense that gave up the most points and yards in the league last season. But GM Dan Morgan also paid up to improve that side of the ball, signing S Tre’von Moehrig and DTs Tershawn Wharton to three-year deals averaging at least $15 million after missing out on ex-Eagle Milton Williams. CB Jaycee Horn also got a huge extension. OLB Jadeveon Clowney was released in May, and lingering concussion issues led to LB Josey Jewell’s departure, at least for now.\nCincinnati Bengals: C\nThey deserve some credit after ponying up to extend WRs Ja’Marr Chase, who was the league’s top-paid non-quarterback for a few months, and Tee Higgins, a development that kept QB Joe Burrow happy. But, at least in regard to Chase, an All-Pro who won the league’s receiving triple crown in 2024, that was a no-brainer … as it was last year, when he would have cost significantly less. One would also think giving All-Pro DE Trey Hendrickson the raise he’s earned going into the last year of his contract, or even simply signing first-round DE Shemar Stewart would similarly be no-brainers. But the Bengals have been Bengal-ing and risk immediately crippling their season at its outset if Hendrickson and Stewart, whose impressive skill set already needed polishing, remain absent from what’s already a highly suspect defense.\nLas Vegas Raiders: C\nThere’s little doubt they should be more competitive on the heels of a 4-13 campaign. Yet with a soon-to-be 74-year-old coach in Pete Carroll and soon-to-be 35-year-old QB Geno Smith, it all feels very … interim? The team locked up DE Maxx Crosby through the 2029 season. But All-Pro TE Brock Bowers feels like the only other cornerstone right now, though rookie GM John Spytek certainly hopes he found more in RB Ashton Jeanty, WR Jack Bech and others in what could be a strong draft class. Thursday's release of DT Christian Wilkins (foot) is a personnel and financial disaster, even if the team recoups some of his guarantees.\nLos Angeles Chargers: C-\nThey’ll likely need to rely even more on their top two draft picks, RB Omarion Hampton and WR Tre Harris, following the July 4 eye injury suffered by RB Najee Harris, a free agent pickup, and WR Mike Williams, who decided to retire last week. (Good thing the Bolts drafted with a sense of redundance.) Beyond that, they hung on to OLB Khalil Mack but let Bosa go. The Chargers’ other biggest additions were Becton and CB Donte Jackson. Meh. Despite Harbaugh’s optimism, tight end, corner and maybe even who will be QB Justin Herbert’s top pass-catching alternative to WR Ladd McConkey remain concerns. LT Rashawn Slater still needs a new contract.\nAtlanta Falcons: D+\nUnlike the Vikings, they haven’t been able to optimize the supporting cast around QB Michael Penix Jr., who enters a season as the starter for the first time, because he’s got a backup, Kirk Cousins, with a nine-figure contract. And now he’ll loom over Penix from the sideline while hovering like a dark cloud over the salary cap. GM Terry Fontenot did manage to extend LT Jake Matthews but couldn’t hang on to promising Dalman. Jarrett also left for Chicago. Maybe Fontenot will get more from a notoriously underwhelming pass rush after signing Floyd and drafting Jalon Walker and James Pearce in Round 1, though Pearce came at the exorbitantly high cost of next year’s first-round pick.\nIndianapolis Colts: D+\nAs Brad Pitt’s “F1” character, Sonny Hayes, said: \"Hope is not a strategy.\" But kinda feels like that’s where the Colts are as they assess whether Anthony Richardson or Daniel Jones will be their Week 1 quarterback – an issue potentially exacerbated after the offensive line was raided during free agency. First-round TE Tyler Warren projects as an immediate difference maker. Sadly, much will be different in these parts for an organization rocked by the recent death of longtime owner Jim Irsay.\nDetroit Lions: D\nFor those who see water in the glass, DE Aidan Hutchinson is on track to return from the broken leg that prematurely ended a 2024 season in which he seemed destined to win Defensive Player of the Year honors. All-Pro Kerby Joseph also became the league’s highest-paid safety with a four-year, $86 million extension.\nBut the injury bug also got an extension, DT Levi Onwuzurike already lost to a season-ending knee injury, and DT Alim McNeill still recovering from a torn ACL. C Frank Ragnow belatedly chose retirement over another season of pain. Rookie DL Tyleik Williams and OL Tate Radledge will need to be ready to play straight away. LB Alex Anzalone also seems to have some wounded pride as he awaits an extension heading into his walk year.\nBut the main issue for this team, which is a bit of a victim of its own recent success, could be the departure of eight assistants, most notably OC Ben Johnson (Bears) and DC Glenn (Jets), both hired to their first head coaching gigs. A team that’s gone 27-7 over the past two regular seasons will be severely challenged to maintain its momentum, much less build on it.\nMiami Dolphins: D\nA team that’s been unable to win games of importance in recent years has been hemorrhaging talent, LT Terron Armstead retiring, Holland leaving during free agency, then Ramsey and Jonnu Smith traded last month. WR Tyreek Hill admits he's (still) working on his professionalism. Maybe first-round DT Kenneth Grant and second-round G Jonah Savaiinaea will provide toughness some have said this team lacks. GM Chris Grier and HC Mike McDaniel don’t seem all that well positioned to justify the vote of confidence owner Stephen Ross gave them after last season’s 8-9 finish.\nCleveland Browns: I (for incomplete)\nThey seem to be playing something of a long game, but it’s just too early to know how it ultimately plays out as a team likely destined to finish last in the AFC North straddles the line between rebuilding and trying to remain competitive.\nThey compelled DE Myles Garrett to stick around after making him the first non-QB with a contract averaging $40 million annually (over 4 years). Whether Cleveland should have cashed out on a 29-year-old at the peak of his powers who’d requested a trade earlier in the year remains an open question. After all, the Browns divested the No. 2 overall pick of the draft for a package that included Jacksonville’s first-rounder next year.\nSo what are we doing? TBD, which also sums up the team’s four-way competition to determine its starting quarterback, a scrum that includes former Super Bowl MVP Joe Flacco and fifth-round lightning rod Shedeur Sanders. Otherwise? Though GM Andrew Berry passed on the opportunity to pick Hunter, he brought in some very nice players, including DT Mason Graham, LB Carson Schwesinger and battering ram RB Quinshon Judkins – though his availability is currently in limbo after he was recently charged with misdemeanor domestic battery. Pro Bowl LB Jeremiah Owusu-Koramoah (neck) is already out for the year.\nBut hey, y’all, the team could be playing in a fancy new stadium in four years … a point when we’ll know whether keeping Garrett, bypassing Hunter and picking Judkins and Sanders while likely punting on a long-term quarterback solution until 2026 were wise decisions.\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/28/micah-parsons-trade-cowboys-packers-winners-losers-jerry-jones/85875337007/",
      "text": "Winners, losers of Micah Parsons trade: Ample fallout for Cowboys, Packers\n- The Cowboys traded Micah Parsons, arguably their best player, for two first-rounders and a Pro Bowler.\n- As Parsons joins the Packers, he also pulls down a record-setting contract.\n- Dallas owner Jerry Jones is likely to face even more questions moving forward than he did for the balance of this summer.\nJust when you thought Micah Parsons was going to become the latest Dallas Cowboys star to take the scenic route – literally and figuratively – to a nine-figure extension …\nJust when you thought Dallas owner Jerry Jones was going to take another bath by losing a negotiation to one of his premier players …\nJust when you thought the latest NFL superstar to follow the hold out, hold in, I’m hurt, trade me, now just pay me playbook to riches would get his bag …\nJust when you assumed all that was unfolding as it so often has in so many NFL quarters − but particularly in North Texas − Jones and “America’s Team” ship Parsons to the Green Bay Packers, a team much of America actually loves and has been typically relevant over the past 30 years.\nHoo ‘Boys!\nNaturally, a deal of this magnitude immediately lends itself to dissection and declarations of who won and lost – so let’s get to it:\nWINNERS\nMicah Parsons\nAs he waited and waited in Frisco, Texas, and Oxnard, California, he eventually grew so disillusioned with Jones and his typically polarizing negotiating rhetoric, that he wanted out and went public with a trade demand. Amazingly, Parsons not only got his wish, he was transferred to a better team, and, per reports, reeled in a record-setting four-year, $188 million contract with $136 million guaranteed. Now set up to make $47 million per year, Parsons not only reset the contractual scale for non-quarterbacks by orders of magnitude − he surpassed recently extended T.J. Watt, who is set to average $41 million annually − at 26 years old, he’s nicely set up to get to a third massive contact if his highly productive career arc (52½ sacks in 63 regular-season games) generally remains on its current heading.\nDavid Mulugheta\nAmazing what a good agent can do for a player when NFL teams actually invite him into the process.\nGreen Bay Packers\nUSA TODAY Sports had already projected them as the 2025 NFC champions – look at me! – and their Super Bowl odds will only substantially shorten from here. By virtue of their stability and the draft-and-develop approach GM Brian Gutekunst and coach Matt LaFleur generally embrace, Green Bay had already enjoyed the least disruptive offseason of any team in the NFC North. But Parsons’ arrival will certainly further disrupt the opponents of a team that finished tied for eighth in the league last season with 45 sacks.\nAidan Hutchinson\nThe Detroit Lions star is likely going to be the next pass rusher to get paid. He almost certainly won't pull down $47 million per, but Parsons’ big deal should only help Hutchinson’s cause whenever he bellies up to the table.\nTrey Hendrickson\nThe Cincinnati Bengals star – set to make a mere $30 million or so in 2025 – also stands to benefit from Parsons’ windfall. Hendrickson would get at least a $36 million franchise tag in 2026 if Cincy goes that route, though that number could also rise as the pass-rushing pay scale continues to explode, Parsons taking it to another level. Barring that, Hendrickson will almost certainly command $40+ million per year from whichever team signs him next March.\nPhiladelphia Eagles\nThat regular-season kickoff game against the Cowboys next Thursday night is starting to look like little more than a speed bump for the reigning Super Bowl champions, who now appear to have only one legitimate challenger (Washington) in the NFC East. No team has won the division in consecutive seasons since the Eagles sat on its summit from 2001 to ’04 − but even harder to bet against them breaking that hex now.\nNBC\nPackers at Cowboys, Sept. 28, “Sunday Night Football.” Legit chance it’s the highest-rated regular-season game of all time given this subplot added to what was already a matchup of two of the country’s most popular clubs.\nLOSERS\nJerry Jones\nSure, getting two first-round picks − albeit ones likely to land near the back of Round 1 − and a front-line player like Pro Bowl defensive lineman like Kenny Clark isn't nothing. And the Cowboys will also have much more salary cap in future years to import and pay other players now that Parsons won’t take up a significant chunk of it, as QB Dak Prescott and WR CeeDee Lamb already do.\nBut, man. Jones just about literally drove his best player away, and that also sends a bad message to the guys currently in the locker room as well as the ones who might consider joining it. And given his summer shenanigans led to this outcome, hard to believe that fans won’t continue calling for Jones to relinquish his de facto general manager duties ... not that he'll listen. And, heck, if players like Laremy Tunsil and Jamal Adams have fetched two first-rounders in trades in recent years, did Jones really get the maximum return for a player who could wind up as a generational pass rusher? It’s quite feasible whatever shape the trio of Clark and his two future teammates takes, they won’t actually fill the void left by Parsons, either from a production or public relations standpoint.\nRecently paid pass rushers\nThe Steelers’ Watt, Browns’ Myles Garrett, Texans’ Danielle Hunter and Raiders’ Maxx Crosby all signed extensions this offseason averaging at least $35 million – at least $40 million per in the cases of Watt and Garrett. Oops?\nKenny Clark\nHe quietly gave the Packers nine really good seasons, and his 10th teemed with possibilities – until … Sorry, dude.\nBrian Schottenheimer\nBeing a rookie head coach is tough enough without losing your best player a week before your inaugural season starts. But while expectations are usually outsized around the Cowboys, maybe Schottenheimer, 51, at least enjoys a more measured grace period as Dallas clearly veers into something more adjacent to a rebuild and retool mode.\nDallas fans\nFirst Luka, then Micah. But, hey, the Mavericks wound up with Cooper Flagg, y’all − maybe the NFL script now delivers Arch Manning to the Cowboys atop next year’s draft? Right?\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/06/nfl-record-projections-win-totals-2025-super-bowl-60-eagles/85529604007/",
      "text": "2025 NFL record projections: Who wins Super Bowl 60? (Hint: not the Eagles)\n- Win-loss outlooks for all 32 teams, with one going 14-3.\n- We fully project and seed the 2025 playoff field.\n- And since we're not picking the Eagles to win Super Bowl 60, guess who will ...\nWith few exceptions – for better or worse – most of the NFL's 32 squads have fully taken shape, though a few important positional battles and contract standoffs await resolution. Still, this is the time of year when most clubs project confidence and optimism that, if everything falls into place, they could wind up in the playoffs and maybe even vie for a Super Bowl berth.\nYet the cold truth for most is that some level of disappointment awaits – whether that’s a tough loss on Super Sunday or winding up with a top-five draft pick in 2026 (though that would be an optimal outcome in some quarters). Remember, this is a zero-sum game. Despite the good vibes emanating from most clubs, there's no avoiding the reality of math − meaning for every 14-win team, there's a mirror image somewhere with 14 losses.\nSo how will it all shake out? With every roster basically finalized (and maybe optimized) for the season ahead, let's try to forecast the 2025 season with record projections for every outfit.\n(A note on methodology: Using the most current information amid a few iterations of this exercise, I predict winners and losers for all 272 regular-season games to arrive at my projections. The outcomes allow me to apply tiebreakers, when needed, to determine and slot the 14-team playoff field – seedings in parentheses – before arriving at a champion. Warning, past performance is no guarantee of future returns.)\nAFC East\n(2) Buffalo Bills (13-4): Barring an injury to reigning league MVP Josh Allen, a sixth consecutive division title seems all but inevitable. Following their Sunday night opener against Baltimore, the Bills play six consecutive non-playoff teams from 2024 – an entire circuit through the AFC East with three other games against NFC South crews – which could catapult them to a very good start, which also includes home games in four of the first five weeks. Buffalo could also finish with a strong kick, four of its final five games against opponents who didn’t reach the postseason last year.\nNew England Patriots (8-9): Could the hiring of coach and team legend Mike Vrabel plus an influx of talent into a roster that needed it allow the Pats to double their 2024 win total? From Week 6 through their Week 14 bye, New England faces just one team that reached last season’s playoffs, a stretch that could set the Patriots up for a wild-card charge of their own.\nNew York Jets (7-10): Rookie coach Aaron Glenn has probably inherited a more talented team than his former boss, Dan Campbell, did in Detroit – Campbell’s 2021 Lions losing 13 games. But these Jets could get off to a slow start, four of their first six games against clubs that reached the 2024 postseason, including a “home” game against Denver in London. But if new QB Justin Fields and his talented fellow youngsters jell over the course of the season, they could build momentum going into 2026 – nine of their final 11 opponents failing to reach the playoffs last season.\nMiami Dolphins (5-12): Will HC Mike McDaniel, who enters the season under some pressure from ownership, even make it to the stretch drive? If he does, the Fins’ final five games are either in outdoor northern cities and/or against teams that had winning records in 2024 … and, historically, his team hasn’t played well in either of those circumstances.\nAFC North\n(1) Baltimore Ravens (14-3): Could this finally be the year QB Lamar Jackson takes his team all the way? An upgraded secondary should address what was Baltimore's Achilles for much of 2024. And how good is an offense that seems to (somehow) get an improved version of Jackson every year, including 2024 when he was probably robbed of a third league MVP? Consider that recently signed WR DeAndre Hopkins, likely a future Hall of Famer, is probably the sixth option when you consider an attack that has a second tight end like … Isaiah Likely. Yes, I like, like, like these Ravens – and considering they have a midseason stretch when they play two games in 27 days, good way to stay fresh as they pursue a second No. 1 playoff seed in three seasons.\n(6) Pittsburgh Steelers (11-6): Optimism was riding high as new/old QB Aaron Rodgers assimilated with his new mates in the sweltering Latrobe, Pennsylvania, camp environment. There’s little question this roster is stacked, more so after a bold offseason plan executed by coach Mike Tomlin and GM Omar Khan. Whether it coalesces remain to be seen. Five of the Steelers' first six opponents didn’t make the playoffs last year, perhaps a nice layout as Rodgers and Co. work out the kinks, though that stretch also includes a trip to Dublin. But four of the final six games are against 2024 division winners, and Pittsburgh collapsed down the stretch last season against strong competition. Still, it does feel like there’s enough ammo here to end the franchise’s run without a playoff win at nine years.\n(7) Cincinnati Bengals (9-8): Since QB Joe Burrow was drafted in 2020, they’re 1-9 collectively in Weeks 1 and 2 – the lone win coming in 2021, when Cincy reached Super Bowl 56. The ongoing drama with All-Pro DE Trey Hendrickson seems to portend another rough start – and the Bengals open at Cleveland, where they rarely win, followed by a stretch of six games that includes five 2024 playoff opponents. Starting in October, the Bengals leave Ohio once in a six-week period, so perhaps that’s when they catch fire. Still, as much money as they’ve already spent this offseason, the Stripes seem to have fallen further behind Baltimore and Pittsburgh, teams that finished ahead of them last season.\nCleveland Browns (3-14): Whoever wins their high-profile four-way quarterback competition will still be the division’s weakest QB1. And with so many other question marks, especially on offense, it does feel like a team that has two first-round picks next year is already somewhat aimed toward the 2026 draft.\nAFC South\n(4) Houston Texans (10-7): With a new offensive coordinator (Nick Caley), reconfigured line, an already beaten-up group of running backs and three 2024 division winners awaiting in the season’s first five weeks, don’t be surprised if the Texans get off to a slow start. But they also appear to remain the least-flawed team in what seems like a fairly weak division and play three of their final four games at home.\nJacksonville Jaguars (8-9): Though they’re not projected to advance to the Super Bowl 60 tournament in this scenario, this could be a team that surprises – especially if rookie HC Liam Coen can elicit results from QB Trevor Lawrence at least somewhat comparable to what he got from Baker Mayfield in Tampa last year. There’s a fair amount of established talent on this roster, and that doesn’t include rookie WR/CB Travis Hunter, who’s now its highest-profile member. Over the season’s final six weeks, the Jags face just one 2024 playoff team.\nTennessee Titans (5-12): A team set to start a rookie quarterback, No. 1 pick Cam Ward, will start out swimming in even deeper water with four of its first six games on the road. But maybe Ward gets on a subsequent roll with three successive games in Nashville following a Week 10 bye.\nIndianapolis Colts (4-13): Even if they were settled behind center – which Indy most certainly is not – a schedule loaded with the entirety of the AFC and NFC West was going to present a serious challenge for a team that’s generally hovered around .500 since QB Andrew Luck retired six years ago.\nAFC West\n(3) Denver Broncos (12-5): The focus will naturally be on Year 2 of the Bo Nix-Sean Payton union, which comes off a spectacular honeymoon. However the Broncos don’t get enough attention for an elite offensive line nor a defense which may be the league’s best – particularly after it was further fortified by free agency and the draft. After playing the Jets in London on October 12, the Broncos will only make one road trip over the ensuing 48 days – a good time to gain altitude at altitude. But ending K.C.’s nine-season run atop the division won’t be easy – particularly when the Chiefs get a bye ahead of their trip to Denver and, later, host the Broncos on Christmas, which lands on a Thursday.\n(5) Kansas City Chiefs (11-6): Coming off what was probably the flimsiest 15-victory regular season in league history (average margin of victory 7.1 points), could they actually win four fewer games, relinquish the divisional throne … and still functionally be a better team when the playoffs start? Absolutely, especially with RB Isiah Pacheco and WRs Hollywood Brown and Rashee Rice healthy, though a suspension could still likely curb the latter’s contributions. But don’t be surprised if the dynasty stumbles out of the gate as the new offensive line takes shape – while weathering a trip to Brazil before Arrowhead welcomes the Eagles, Ravens and Lions for its first three home dates.\nLos Angeles Chargers (9-8): Coach Jim Harbaugh took the 49ers to the Super Bowl during his second year in San Francisco, so it’s tempting to foresee the Bolts making a quantum leap, too, despite how badly they performed in last season’s playoffs. But the offense still seems a bit light on weaponry − despite WR Keenan Allen's return − the defense lost some stalwarts in free agency, and the Chargers must navigate a schedule that includes nine dates with 2024 playoff squads. The loss of LT Rashawn Slater to a season-ending knee injury is a crushing blow.\nLas Vegas Raiders (5-12): They should be more competitive and entertaining with coach Pete Carroll, QB Geno Smith and titillating rookie RB Ashton Jeanty aboard. Yet it’s hard to envision the Silver and Black making up any ground in an otherwise loaded division and, despite DE Maxx Crosby’s presence, this defense could be regularly overrun. Doesn’t help when a team from Sin City is forced to play three 1 p.m. kickoffs in the Eastern time zone in the season’s first five weeks.\nNFC East\n(1) Philadelphia Eagles (12-5): Viewed through the lens of a single season, the 2024 Eagles are probably one of the top three or four teams of the 21st century, so little reason to think they won’t be really strong again despite significant personnel losses on the defensive side. But though the Chiefs have made it seem routine, defending an NFL title is exceptionally hard – and the Eagles have to do it with a first-place schedule that includes the entirety of the AFC West and NFC North. Brutal. And awesome as Saquon Barkley, 28, was last season – maybe the best season a running back has ever had – it would be more realistic, given his personal history, to expect he misses a few games with injuries than an encore performance. It wouldn’t be a shock if the Eagles repeat … but history is decidedly with the field.\n(7) Washington Commanders (10-7): Their Cinderella run exceeded everyone’s wildest imagination – especially that of a long-suffering fan base. But are expectations ratcheted up a bit too much now? Washington’s schedule is basically as challenging as Philly’s yet also includes a stretch between Weeks 4 and 8 with just one home game. After what was arguably the greatest rookie season in league history, maybe QB Jayden Daniels takes an MVP step in 2025. But if he plateaus or even suffers something of a sophomore slump ... and/or pricey veteran acquisitions like Laremy Tunsil and Deebo Samuel don’t live up expectations ... and/or if this defense proves suspect – especially up front – then the Commanders’ season could be defined following a Week 12 bye, a gauntlet that includes the Broncos, Vikings, Cowboys and Eagles … twice.\nDallas Cowboys (9-8): They’re almost always relevant when QB Dak Prescott survives a full season or close to it – which he didn’t in 2024. But the Cowboys are adjusting to a rookie head coach, Brian Schottenheimer, still have a glaring concern at tailback, have yet another change at defensive coordinator (Matt Eberflus) and are currently playing contractual games with DE Micah Parsons, arguably the franchise’s best player. Also? Eagles, Chiefs, Lions, Vikings, Chargers, Commanders, i.e. the murders’ row Dallas must face from Weeks 12-17. Woof.\nNew York Giants (2-15): A team coming off a 3-14 season somehow draws the league’s toughest schedule based on opponents’ 2024 winning percentages (.574). So much for competitive balance. This record projection isn’t indicative of the young talent on this roster, including WR Malik Nabers, LT Andrew Thomas, rookie OLB Abdul Carter and others. But it’s very hard to find wins on this schedule or expect QB Russell Wilson will enjoy a renaissance at age 36, especially when pressure to play quarterback of the future Jaxson Dart as the season wears on is only likely to incrementally grow.\nNFC North\n(2) Green Bay Packers (12-5): Unlike the rest of their divisional rivals, they should benefit from continuity. And if QB Jordan Love remains healthy during the regular season, rookie Matthew Golden makes the consistent impact not always provided by this receiving corps and they get off to a strong start – and the early part of the schedule sets up nicely – the Pack might just find themselves in the Super Bowl.\n(5) Detroit Lions (11-6): They’re going to have to adapt – without coordinators Ben Johnson and Aaron Glenn and six other staff members from a team that earned the NFC’s top playoff seed in 2024, to say nothing of the retirement of tough-as-rawhide C Frank Ragnow. Talent remains in abundance, and the return of DE Aidan Hutchinson should bring a needed jolt to the defense. But finding synchronicity could be tough, especially with four of the first six games on the road.\nMinnesota Vikings (9-8): They’re going to have to adapt – to new QB1 J.J. McCarthy, who lost his entire rookie season with a knee injury and watched Sam Darnold blossom into a Pro Bowler during his on-field absence. Similar to his time at the University of Michigan, McCarthy should have everything a quarterback could want in a supporting cast, including a fantastic coach in Kevin O’Connell. But the Vikes will have to weather WR2 Jordan Addison’s three-game season suspension to start the season. And following their (voluntary) two-week European vacation, they’ll have the Eagles, Chargers, Lions and Ravens lined up on the opposite side of a Week 6 bye. Replicating last season’s 14-3 record – or even something close to it – seems like a long shot.\nChicago Bears (7-10): They’re going to have to adapt – to Johnson, their new head coach, who’s changing the culture, scheme and expectations (yet again) after this organization’s disastrous 2024 campaign. And the learning curve is amplified by a schedule that, statistically, is second only to the Giants’ in terms of difficulty. Six of the Bears’ final eight opponents made the playoffs last season.\nNFC South\n(4) Tampa Bay Buccaneers (9-8): They probably don’t get enough credit for their recent dominance of the division, which they’ve won the past four seasons – albeit by an average of one game since the start of the 2022 campaign. That could again be the case with teams like the Panthers and Falcons at least displaying the potential to be threats. The Bucs could also be hamstrung as long as LT Tristan Wirfs, arguably their best player, remains sidelined by recent knee surgery expected to cost him at least a handful of games – and against formidable defenses. But even if they endure a rocky start, Tampa Bay could finish with a surge – its last six games against teams that didn’t make the playoffs in 2024.\nCarolina Panthers (8-9): They’re a chic playoff pick in some quarters after QB Bryce Young and the rest of the team got off the mat during the encouraging second half of last season. WRs Xavier Legette and Tetairoa McMillan, the club’s most recent first-rounders, could further elevate this offense in 2025. But a defense that was resoundingly the NFL’s worst by most important metrics in 2024 remains a looming question despite the return of dominant DE Derrick Brown. Still, a fast start could be in the offing as the Panthers won’t face a 2024 playoff outfit until Week 8.\nAtlanta Falcons (7-10): So much boils down to the quarterback position, but especially here. Michael Penix Jr. flashed in three starts as a rookie but is hardly a proven commodity. QB2 Kirk Cousins is battle-tested … and his presence is likely to add to the burden of Penix, who will almost undoubtedly struggle at some point – and perhaps from the jump, Atlanta facing four postseason squads from last season among its first five opponents.\nNew Orleans Saints (2-15): A rookie head coach (Kellen Moore). Likely a rookie quarterback (Tyler Shough) or one coming off a rough rookie season (Spencer Rattler). Schematic changes on both sides of the ball. The biggest questions here seem to be if players like RB Alvin Kamara and WR Chris Olave remain beyond the trade deadline and/or if hometown hero Arch Manning winds up returning, though Saints fans would have to wait until 2027.\nNFC West\n(3) San Francisco 49ers (11-6): On the opposite side of the scheduling scale from the Giants, the Niners, little more than a year removed from an overtime loss in Super Bowl 58, drew the league’s easiest schedule (.415 opponent winning percentage in 2024) – one that includes all of the AFC and NFC South teams and three additional last-place operations from last year. San Francisco opens with four 2024 non-playoff teams and finishes with seven of the same. Make no mistake, a new-look defense has much to prove, and the team’s best players – RB Christian McCaffrey, LT Trent Williams, WR Brandon Aiyuk – have to stay on the field, though Aiyuk (knee) is likely still a few months away.\n(6) Los Angeles Rams (11-6): Again, it’s worth noting that this team came the closest to knocking off the loaded Eagles on the road to Super Bowl 59, the Rams nearly pulling off the upset … on the road … in the snow. Imagine what they can do with a promising young defense one year better, not to mention being somewhat past the LA wildfires that affected this team and its city last January. So much hinges on the health of QB Matthew Stafford, 37, whose back has kept him sidelined during training camp, though by design, according to reports. But if he can continue posting on game day, as he usually does, he and his team have a legit shot at a second ring in a five-season span.\nArizona Cardinals (9-8): They went from bad (4-13) in HC Jonathan Gannon’s first year to quietly middling last season (8-9). If QB Kyler Murray and the young players around him can take another collective step forward, a postseason return seems very much in play – especially if they can leverage a schedule that opens against six teams that didn’t reach the playoffs in 2024. However the Cards will only have two home games after Thanksgiving.\nSeattle Seahawks (9-8): A tiebreaker cost them a playoff berth last season. They might be on the razor’s edge once again but not for lack of trying. Heading into his second year, coach Mike Macdonald and GM John Schneider have done more than retool this roster – especially a passing game that has a new coordinator (Klint Kubiak), quarterback (Darnold) and receiver (Cooper Kupp). Yet it's also fair to expect these Seahawks to be far more reliant on the run, per Macdonald’s wishes. Seattle seems more philosophically calibrated for the long haul, but that could mean another round of uneven performances in the near term.\nAFC playoffs\nWild card: (2) Bills def. (7) Bengals; (6) Steelers def. (3) Broncos; (5) Chiefs def. (4) Texans\nDivisional: (1) Ravens def. (6) Steelers; (5) Chiefs def. (2) Bills\nChampionship game: (1) Ravens def. (5) Chiefs\nNFC playoffs\nWild card: (2) Packers def. (7) Commanders; (6) Rams def. (3) 49ers; (5) Lions def. (4) Buccaneers\nDivisional: (6) Rams def. (1) Eagles; (2) Packers def. (5) Lions\nChampionship game: (2) Packers def. (6) Rams\nSuper Bowl 60 (Santa Clara, California)\nRavens def. Packers\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/26/trey-hendrickson-contract-cheap-bengals-mike-brown/85827699007/",
      "text": "Different stripes? Trey Hendrickson is back, but these are same, silly Bengals\n- Trey Hendrickson got a raise for 2025 but won't make nearly as much as his peers or have their security.\n- He isn't the first Bengals player who's gone to financial war with owner Mike Brown.\n- And while Hendrickson is back for one more season, the Bengals might have invited long-term harm that trumps a short-term solution.\nJust when you thought the Cincinnati Bengals might actually be changing their stripes, they sent a fresh signal that Joe Burrow’s championship window will actually open about as far as one in a 12th-floor hotel room – like the one Boomer Esiason has to pay for.\nThe newest evidence that the Bengals really aren’t that serious about winning came Monday, when they belatedly reached a contractual resolution with All-Pro defensive end Trey Hendrickson. If you didn’t read past that headline, you might think it was a positive development – last season’s NFL sack leader (he had 17½) getting more money and preparing to return to practice for a defensively hindered team known for its notoriously slow starts, like the one that crippled it in 2024. But if you dig a bit, it becomes apparent that the Bengals have simply relapsed into the same old cheapskates who last won a Super Bowl … well, never.\nHendrickson’s arrangement for the 2025 season benefits just about nobody. Maybe Burrow and an offense that may – may have to – lead the league in points gets a few extra possessions and key stops given Hendrickson’s sublime ability to bag opposing quarterbacks, his 35 sacks since 2023 and 54 pressures in 2024 also league pacesetters.\nOtherwise, what's been achieved here? Something adjacent to nil. Maybe worse.\nHendrickson, who was seeking a raise and long-term security, achieved the former – to a degree – but not the latter. He’ll pull down an extra $14 million or so this season, meaning he’ll make at least $30 million in total, but is unsigned for 2026. He effectively becomes a player operating without a safety net, much like one bearing a franchise tag. This occurs at a time when four of his peers (T.J. Watt, Myles Garrett, Danielle Hunter and Maxx Crosby) signed extensions this offseason averaging more than $35 million – $40 million per in the cases of Watt and Garrett. And while Hendrickson is 30, those other players are also roughly the same age, not to mention generally less sturdy than a guy who’s missed two games since coming to Cincy in 2021.\nHendrickson’s contractual Band-Aid – and make no mistake, it’s one of those smaller circular ones you use for a shaving nick – comes despite his production and durability. Meanwhile, over the past two years, he’s watched this same organization make Burrow the league’s highest-paid player and wideout Ja'Marr Chase its highest-paid non-quarterback – temporarily in both cases – while receiver Tee Higgins, never a Pro Bowler in five NFL seasons, pulled down a four-year, $115 million extension. But apparently there's no financial bandwidth to reward Hendrickson even though Cincinnati is scheduled to have nearly $55 million in cap space in 2026, per OverTheCap, among the top quartile in the NFL.\nNot that it’s his brand, but (relatively) miserly Bengals owner Mike Brown didn’t even take the opportunity to give Hendrickson a one-year balloon payment of $43 million or so – actually reasonable given what he’s done for this team over the years – which would have thrown a nice little socket wrench into Dallas Cowboys owner Jerry Jones’ interminable (or are they non-existent?) negotiations with Micah Parsons, who will undoubtedly overtake Watt as the league’s next top-paid non-QB whenever Jones ends his charade.\nBut there’s a bigger picture being painted (again) in The Queen City.\nAsked about that proverbial championship window before the 2022 playoffs, when Cincinnati lost the AFC championship game, Burrow said: “The window is my whole career.”\nYou’ve got to love the swag of a slinger who did lead the Bengals to Super Bowl 56 to conclude the 2021 season and is almost universally regarded as one of the NFL’s top five quarterbacks, leading the league with 4,918 yards and 43 touchdowns through the air last season.\nAnd yet Cincy hasn't been back to the postseason since that 2022 AFC title round loss at Arrowhead Stadium. Even with the heroics of Burrow, Chase – he won the NFL’s receiving triple crown in 2024 – and Hendrickson, the team went 9-8 a year ago. The Bengals remain virtually intact in 2025, albeit a far more expensive version, yet appear to have lost personnel ground to their AFC North rivals, the Baltimore Ravens and Pittsburgh Steelers.\nAnd what happens a year from now?\nBrown mollified Burrow by minting Chase and Higgins, but now his team – one that doesn’t ooze discretionary dough the way Jones’ does – has a lot of cash tied up in that offensive trio. Hendrickson? He’s scheduled to be a free agent next March … unless Brown is willing to eat a $36 million franchise tag, which may cost even more depending on how much Parsons and maybe Aidan Hutchinson further boost the wage scale for pass rushers.\nBarring that, why would Hendrickson want to come back? And in the wake of the message Brown just sent him, why would other Pro Bowl-caliber players want to join a team that’s rarely loosened its purse strings during free agency anyway? Quarterback Carson Palmer and wideouts Carl Pickens and Chad Johnson are among the many former Bengals who have been at bitter loggerheads with Brown in years past. Just last week, longtime Cincinnati star and former league MVP Esiason revealed that the team isn’t paying for hotel rooms so Ring of Honor players like himself can attend the ceremony for this year’s enshrinees in October.\nBut that tracks with the franchise’s frugal ways, Brown resistant for years to the notion of upgrading the club’s practice environment among other aspects of its working conditions. He won’t even confer the general manager title to Duke Tobin, the man who does that job without the label.\nBurrow, Chase and Hendrickson are first-class players. But their ranks will probably thin in 2026 given their second-class employer refuses to fully embrace what's required to get Burrow and this roster though a Lombardi window likely to realistically remain jammed shut.\nMaybe Burrow gets back to the Super Bowl ... just seems probable he'll also be paying for airfare and lodging.\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/buffalo-bills/324",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/san-francisco-49ers/359",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/cowboys/2025/08/28/dallas-cowboys-jerry-jones-micah-parsons-trade/85876581007/",
      "text": "Jerry Jones during press conference says Cowboys might be better after Parsons trade\nEverything is fine with the Dallas Cowboys, according to Jerry Jones.\nIn fact, without Micah Parsons, Jones thinks his team might be better after he decided to trade Parsons to the Green Bay Packers on Thursday.\n\"This gives us a better chance to be a better team than we have been the last several years while Micah has been here,\" Jones told reporters. \"Nothing negative on Micah.\n\"We can win more games than we would have, had we gone the other route and signed Micah.\"\nParsons signed a four-year deal worth $188 million ($136 million guaranteed), which makes him the highest-paid non-quarterback in the league. The Packers sent two first-round picks and defensive lineman Kenny Clark to Dallas to complete the deal.\nJones, who appeared to call Parsons “Michael” multiple times throughout the news conference, said the team could flip either of the two first-round draft picks acquired from the Packers for 2026 and 2027 for other deals.\n“Those draft picks could get us top Pro Bowl players,\" he said.\nJones added: “Nothing says we can’t use those picks to go get somebody right now. Don’t rule that out.”\nTo start the news conference, Jones spent plenty of time talking about run defense.\n\"Without being too broad, we did think it was in the best interest for our organization, not only in the future but right now, for this season,” Jones said. “We gained a Pro Bowl player in an area that we had big concerns in, on the inside of our defense.\n“The facts are, specifically, we need to stop the run. We haven’t been able to stop the run in key times for several years.”\nThe pass-rushing depth, per Jones, was why comfortable moving on and that adding Clark would overall improve the defense – even with the loss of Parsons.\n“It was a prerequisite, and we only picked teams … that could pay Micah and had top (defensive) tackles,” Jones admitted.\n“In addition to the depth, you could scheme pressure as well,” Stephen Jones, the team's chief operating officer, said. “...But what is tough to scheme, is stopping the run.”\nJones said he has nothing but good feelings regarding Parsons. \"I really like Micah,\" he said.\n“There’s not an ounce of vindictiveness, there’s no bad feelings on my part about the fact that we didn’t come together on an agreement,” Jones said.\nOne thing Jones didn't want to discuss was why, if he indeed entertained trading Parsons as early as the spring, that didn't occur prior to the draft.\nIn the end, Parsons was \"an asset we got four great years out of.\"\nBut it was the next four years that led to Jones throwing up the caution flag.\n\"That’s quite a commitment,\" said Jones, referring to the deal Parsons sought, \"and none of that counts about what he did for the first four years.\"\nJones also confessed that his repeated comments about his lack of desire to trade Parsons was a negotiating tactic with other teams.\n“Do you really think if I wanted someone to be interested in (Parsons) I would say ‘Oh I want to trade him?’ It’s the opposite. And I thank you for writing it,” Jones said.\nJones recounted a quick story from the offseason when Parsons returned from an international trip straight to the Cowboys facility to talk business. According to Jones, Parsons wanted to talk brass tax that night, but Jones encouraged him to wait until the next morning. Stephen Jones was involved during the talks, he said.\n“That was a very genuine negotiation, I changed the amounts, and then we left and he called back,” Jerry Jones said.\n“Of course, the rest is history,\" Jones added. \"When the time came to say let’s go, he said, well, let’s start the negotiation. Again, nothing in the world am I criticizing Micah at all.”\nJones, who said he still plans on negotiating with players, wouldn’t provide a timeframe but talked to Green Bay several times over several days, he said, but came to a head Thursday.\n“I would say that certainly it was still up in the air (Thursday) morning,” he said.\nWhat wasn’t up for debate, he said, was the consideration to trade Parsons “as a complete organization, that if we could get this done, with our terms, that we would make the trade.”\nPlaying Parsons would be \"problematic,\" he said. \"I suggest we get ahead and run the ball.\"\nApparently, that's what Jones wants.\n\"I'm excited,\" Jones said. \"We got what we wanted.\n\"Things are good here.\""
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/07/exclusive-jacksonville-jaguars-travis-hunter-offense-defense/85560502007/",
      "text": "Exclusive: Jacksonville Jaguars star Travis Hunter unfazed by playing offense and defense\n- Rookie's double duty in practice increasing.\nJACKSONVILLE, FL — Time was a bit tight, as usual, for Travis Hunter.\n“I’m going to eat, take a shower, and go back to work,” Hunter told USA TODAY Sports, pausing for a few minutes during his lunch break on Tuesday.\nTalk about time management. After taking snaps on both offense and defense during the Jacksonville Jaguars training camp practice – the first session this summer that he went both ways – Hunter joined the wide receivers group for an autograph session with dozens of fans on hand at Miller Electric Center.\nAnd the rest of the day?\n“I’ll have 45 minutes with the defense,” he said of a pending meeting. “Back to offense from 2:05 to 4:35. Then walk-throughs.”\nHe caught himself and recalibrated.\n“Actually, I’ve got defensive walk-through today from 4:35 to 5:50. Then we’re out. Then tomorrow, I’ll be on defense.”\nAs he recited his schedule, Hunter, 22, was full of youthful exuberance and charisma − as advertised. Hunter, who won the Heisman Trophy last year as college football’s best player, is so driven to prove that he can excel while playing receiver and cornerback on the NFL level. And the desire seems palatable as he flashes a huge grin.\nThen again, for all of his accomplishments, there’s some down-to-earth humility.\n“I’ve had a lot of progress,” Hunter said. “But now I’ve got to continue to prove myself and prove that I’m supposed to be here.”\nNo, this two-way duty hasn’t been done in the NFL in decades. But when Hunter joined forces with Deion Sanders – first at Jackson State, then Colorado – the conventional wisdom was that he couldn’t hold up going both ways on the college level. Coach Prime was the only coach who pledged to let him try.\nAnd look at him now. The Jaguars sent a bundle of draft picks to the Cleveland Browns to select the best athlete in the NFL draft with the second pick overall and made the “organizational decision,” as coach Liam Coen put it, to use Hunter both ways.\nSure, there’s a huge challenge for Hunter – who makes his NFL preseason debut against the Pittsburgh Steelers on Saturday night -- to hold up physically against better athletes for a longer season in the NFL. Yet Hunter is quick to emphasize the mental game, which will enable him to absorb nuances of sophisticated NFL game plans.\n“We’ve got a schedule set up and I’ll get it before the week even starts,” he said. “By the end of the week, I’ll have another schedule for next week.”\nIs this how it worked at Colorado?\n“In Colorado, I met with both (units) every day, so I was good,” he replied.\nCoen, the Jaguars rookie head coach, is adjusting to this flow in his own right. He said there’s been trial and error – “more reps here, less reps there,” Coen said – to balance the workload.\n“It’s what he’s been doing, whereas for us coaches and staff, it’s new and different,” Coen told USA TODAY Sports. “To find that sweet spot of how much is too much and what’s not enough, it’s a revolving door.\nCoen texted Hunter on Monday night and told him of the plan to give him snaps on both sides of the ball on Tuesday for the first time during a practice.\n“He’s like, ‘Alright, finally, dude,'\" Coen said of the response.\nDuring one series in Tuesday's practice, Hunter, wearing a teal No. 12 jersey, zipped inside on a skinny post route and snagged a tight spiral. The next series, Hunter wore a white, No. 12 pinnie over his jersey for a shift on defense where he blanketed his assigned receiver with tight man-to-man coverage.\nNear the end of practice, Coen kept Hunter out of the final 11-on-11 drill, but it was surely a full load. According to The Florida Times-Union, Hunter went 19 plays (10 on offense, 9 on defense) in the team drills, testing the high level of conditioning that is his calling card.\n“The last time I got tired, tired?” Hunter said, repeating the question. “Probably today. It was a lot on me, but I got through the day and did what I was supposed to do. For the most part, I was good.”\nFrom this point, Coen expects the double-duty during practices will become the norm rather than the exception. Since the offseason workouts, Coen has been particularly impressed with Hunter’s learning curve in absorbing the nuances of the offense.\n“Corner is probably a lot more natural for him to just go and play,” Coen said. “It’s probably where he’s had the most development in his college experiences. Well, he’s worked his tail off this summer, working on the receiver fundamentals and techniques, and it’s showed up.”\nWhen the Jaguars released their first official depth chart this week, Hunter was listed as a starting receiver alongside Brian Thomas, Jr. and Dyami Brown, and as the backup left cornerback behind Jarrian Jones. Of course, that’s subject to change. Yet Coen projects that when the games count Hunter could play 80% of the snaps – on both offense and defense, which would be in the range of the 111 snaps he averaged last season at Colorado.\n“But we’ve got to train him,” Coen added. “It’s a long season.”\nCoen, inheriting a team that finished 4-13 in 2024, also hasn’t been shy about his expectations of excellence. Earlier this week, Coen said he thinks that Hunter could win honors as NFL Offensive Rookie of the Year and NFL Defensive Rookie of the Year.\n“I didn’t hear that, but I’m happy he said that because I know I can be,” Hunter said. “I’ve just got to continue to prove myself.”\nThe debates could go on and on. Cornerback or receiver?\n“Selfishly, I definitely want him on offense more,” Jaguars quarterback Trevor Lawrence told The NFL Network. “And I told him, ‘Do you want to catch touchdowns or do you want to maybe break up a pass or two? That’s a decision you have to make.’\n“He’ll make plays wherever he is, but obviously as a quarterback, I hope he plays more on offense. Wherever he plays…he will make us better.”\nJust don’t think Hunter is feeling any pressure. Sure, he’s a marquee attraction infusing much hope for a franchise that has posted double-digit losses in five seasons since 2018. On many levels the Jaguars need him premium talent on offense and defense, which explains why there’s been healthy lobbying from coaches on both units for Hunter’s services.\n“Nah, there ain’t no pressure,” Hunter insists. “It don’t faze me at all. I’ve been doing this for a minute. I’m not worried about what people say. I’m just out here playing football, doing what I’ve got to do to help my team win.”\nListen to Tony Boselli rave about Hunter. Boselli, the Hall of Fame left tackle, is the only player in Jaguars history with his jersey retired. During the offseason, he became the franchise’s executive vice president for football operations, which put him in the mix with Coen and new GM James Gladstone in assessing Hunter’s stock.\nOf course, Hunter was the top-rated player on the Jaguars’ draft board – and one they figured they had no shot to get when originally holding the fifth pick in the first round.\nBoselli admits that initially, he had reservations that Hunter could play both ways.\n“I had my questions, maybe some doubts, because I had never met him,” Boselli told USA TODAY Sports. “But then you get an idea of the personality and intelligence that he had, and you watch the tape, and it’s like, ‘If anybody can do it, this guy can.’ “\nBoselli said he quickly became of the opinion that Hunter doesn’t like football – he loves it.\n“That’s what we need – guys who love the game,” Boselli said.\nCoen sees it similarly. “He’s all ball,” Coen said. “The guy fishes and does football.”\nEspecially when he comes to work.\n“He’s here all day and his day is maximized,” Coen said. “Every single moment he’s in the building, he has something to do. And he wouldn’t have it any other way.”\nSo we’ve heard.\nContact Jarrett Bell at jbell@usatoday.com or follow on social media: On X: @JarrettBell. On Bluesky: jarrettbell.bsky.social"
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/scores",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/chiefs/2025/08/20/skyy-moore-trade-kansas-city-chiefs-san-francisco-49ers/85750952007/",
      "text": "Chiefs trade Skyy Moore to 49ers, ending second-rounder's disappointing run in Kansas City\nThe Kansas City Chiefs are moving on from one of their more disappointing recent early-round draft selections.\nThe team on Wednesday agreed to trade wide receiver Skyy Moore to the San Francisco 49ers.\nMoore, 24, was a second-round pick out of Western Michigan in 2022. The 5-10, 195-pound target served primarily as a backup as a rookie before making eight starts in 2023, but he struggled to establish himself as a reliable target for Patrick Mahomes. A core muscle injury limited him to just six games last season, and he has not caught a pass since December 2023.\nNow, a player who appeared to have an uphill battle to remain in Kansas City for the final year of his rookie contract has a new home.\nDespite Moore's various setbacks, which included a hamstring injury in training camp and two drops in last week's preseason loss to the Seattle Seahawks, Chiefs special teams coordinator Dave Toub maintained his faith in the wide receiver and returner's future.\n\"His punt-return ability and kick-return ability has really gotten better over the years,\" Toub said Tuesday of Moore, who returned a punt 88 yards for a touchdown against the Seahawks. “It showed right there. He’s solid there in that part of it. The other part is the mental thing with him. It’s just getting over the hump.\n\"He’s definitely an NFL player, whether he’s on our team or not on our team. I think the return helped him and opened a lot of eyes for people. He’s a good football player.”\nIn San Francisco, Moore will provide depth to a San Francisco receiving corps dealing with a rash of injuries. Brandon Aiyuk is expected to sit out at least the first few weeks of the season as he recovers from last season's knee injury, while Jauan Jennings has been slowed by a calf ailment. Backups Jacob Cowing and Jordan Watkins also remain sidelined, and Demarcus Robinson is facing a three-game suspension for violating the league's policy on substance abuse, coach Kyle Shanahan confirmed Wednesday.\nThis story was updated with additional information."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/super-bowl/2025/02/09/saquon-barkley-super-bowl-25-philadelphia-eagles/78370329007/",
      "text": "Rolexes and records: Saquon Barkley's impact on Eagles goes way beyond outrageous stats\nNEW ORLEANS – A few weeks back, Jordan Mailata got a text out of the blue. The message? He could go to the office of Philadelphia Eagles chief security officer Dom DiSandro – “Big Dom” – and pick up his Rolex.\nMailata, the Eagles’ second-team All-Pro left tackle, had completely forgotten about something running back Saquon Barkley had said months earlier.\n“When we first got him,” Mailata said, reflecting back to when Barkley surprisingly came to Philadelphia during free agency last March, “I guess he understood what he had in the O-line, and we understood what we had in the running back. And he told us at the start of the season – not even at the start of the season, this is in OTAs – ‘If I win the rushing title, I'm going to get you guys Rolexes.’”\nNearly a year later, Barkley, the newly anointed Offensive Player of the Year, had banked more than 2,000 rushing yards and that rushing crown … and had also reached into his bank account to pay for those promised timepieces.\n“We were like, ‘Well, we forgot about that,’” Mailata beamed, “but he was a man of his word. And I guess we hadn't known him long enough to know he was being serious, but he's a man of his word, and he has true character.”\nSuch character, that Barkley had to do even more to make good on his pledge.\n“Yeah, sometimes you gotta talk things into existence, right?” he said when talking about the promise he made to a unit he now calls “one of the greatest offensive lines of all time,” a group with whom he’s earned honorary membership.\n“I was able to fulfill that and get those guys some watches. Big shoutout to my jeweler, Gabe. He helped me out there. But what I did learn is, you know, those are some big guys. So, you get the standard size and, you know, I got to help them out, get some extra (watchband) links.”\nIt’s one of the few things that hasn’t gone to plan for Barkley this season – one that will conclude Sunday, when he will play in the Super Bowl for the first time.\nHis talent has always been readily apparent, since he was the second player taken in the 2018 NFL draft and through the years as he piled up so many yards and highlights for Philly’s archrivals, the New York Giants. It’s the only way a running back lands a three-year contract for nearly $38 million nowadays.\nLike everyone else, the Eagles knew Barkley was good (even if many couldn’t believe he was switching sides). What they didn’t know was what they were truly getting when he walked into their facility for the first time.\n“I don’t know how he ended up here, that was my first reaction,” said Pro Bowl right tackle Lane Johnson. “Then having a chance to play with him is extraordinary.\n“I was probably more impressed with just his character, (who) he was off the field.”\nTalk to any member of the Eagles, and it quickly becomes apparent that Johnson’s sentiment is universal.\n“It was pretty easy taking Saquon into the family because of the résumé that he came with,” said Mailata. “It was pretty easy to welcome him with open arms. And I think what stands out to me more than the player – and the player that you guys see – is how he is as a human being. His personality – the way he cares about a human, where he cares about his teammates on a personal level – that means a lot to us, and I think it means a lot to him.”\nIt does.\nBarkley quickly became a leading figure inside a locker room that already had strong veteran leadership. And that meant competing in the weight room, sharing his faith and numerous rounds on the golf course.\n“I believe relationships are key to having a successful team,” he said.\nIn this case, success meant the ninth 2,000-yard rushing season in NFL history. With 30 more Sunday against the Kansas City Chiefs, Barkley will eclipse Hall of Famer Terrell Davis’ 26-year-old mark for most rushing yards in a season (2,476) when including the playoffs. His seven TD runs of at least 60 yards is a record for a season and postseason combined – the three in the playoffs another mark for a single postseason and more than any other player has in an entire career. The effort might go down as the greatest single campaign by a runner ever.\nBut more importantly to Barkley, who turns 28 on Super Sunday, has been the way his team has flourished, winning its second conference title in three seasons and now on the verge of capturing Philadelphia’s second Lombardi Trophy.\n“I wanted to play in big games and be part of a team that had an opportunity to go compete and play in a Super Bowl,” said Barkley. “And all that happened.\n“Now did I expect the accolades, and the records and the yards that come along with it? No. Did I work for that? Yeah. But the most important thing was to come here and compete for a championship and a Super Bowl.”\nEven if that’s what is most important, the way he’s gone about it has been at least equally meaningful to his teammates and coaches.\n“He’s a great person, and he’s personable,” defensive tackle Moro Ojomo told USA TODAY Sports. “He accepted us, and we accepted him, and it was a match made in heaven.”\nSaid head coach Nick Sirianni: “Yeah, it’s very obvious when you watch the tape how good of a player he is, right? But the things that he has that he brings to our football team as far as his leadership, his work ethic. He’s an awesome teammate. Those are the things that make him very special.\n“And that’s pretty special that I’m saying that even more after you see him jumping over guys backwards and all that stuff.\n“He’s an awesome teammate, an awesome person. I can’t say enough good things. I can spend the rest of this press conference talking about what Saquon has meant to this football team and not even talk about anything on the field.”\nEven Barkley, who was a bit leery of his new coach prior to landing in Philly, can hardly believe how good the fit has been from almost every perspective.\n“A year ago, I probably despised him,” he said of Sirianni, who’s had something of a polarizing reputation, particularly among outsiders. “But now our relationship has grown so much. He genuinely cares about players and that don’t get talked about enough.\n“He’s an awesome person.”\nNo surprise to outsiders\nWhen Barkley was in New York, one of his close friends was Hall of Famer and Giants legend Michael Strahan. He’d routinely dine with Strahan, who assumed a mentorship role as well.\nMuch as Strahan has hated the outcome for the lowly Giants, he also instantly foresaw Barkley’s wild success in Philadelphia.\n“Saquon’s just a leader, period. He’s just that guy. Not only the leader in words, but you watch him on the field. I think to be a real leader of a team, you have to perform. You can have guys who chirp all the time in a locker room, but if they’re never playing, no one’s gonna respect that.” Strahan, now an analyst for Fox, told USA TODAY Sports.\n“He backs up everything that he says. And I think because of that, guys respect him. It’s hard to go to a new team, a team in your old division that you were trained to dislike, and all of a sudden you gotta like ‘em? Gotta be weird to put that uniform on for the first time. But I’m happy he’s there. I think as a Giants fan, obviously, it’s disheartening to see him play so well in Philly – I don’t know if he woulda had that year in New York. He didn’t have the same support system around him.\n“I wanna see him do so well, I wanna see him play his best. I got a chance to see that in the regular season, and I’m hoping I see that in the Super Bowl. I love Saquon. He’s the most genuine guy off the field, and a helluva player on it.”\nAnd now he’s the Chiefs’ problem as they go for their historic Super Bowl three-peat Sunday. One of their biggest stars knows all to well that Barkley could muck up their plans.\n“I’m pretty sure me and my brother knew exactly what was gonna happen in Philly when they got Saquon Barkley,” said Kansas City tight end Travis Kelce, brother of former Eagles All-Pro center Jason Kelce.\n“Saquon, he’s a generational talent. And you put that with the style of offensive line that they have, and the ability they have on the perimeter, and obviously their ability at quarterback – you kinda knew that something special was gonna happen in Philly this year.”\nThe city loves its new star – Barkley already the recipient of some of the most thunderous roars at Lincoln Financial Field during pre-game introductions – almost as much as his new teammates do.\n“I would say the team means everything to me,” said Barkley. “Just from Day 1, the way that they welcomed me with open arms. And I'm kind of the new guy, (but) I feel like I've been on this team for seven years.”\nAnd if all continues to go to plan, those Super Bowl rings will fit better than the Rolexes.\n“All of them were too small,” laughed Mailata, “we’ve got big hands!”\nAnd also a big back who’s made just about everything else just right.\nTime to get Super Bowl ready: Sign up for USA TODAY's 4th and Monday newsletter for NFL news."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/bell/2025/08/27/browns-quarterback-shedeur-sanders-future/85840540007/",
      "text": "Quarterback Shedeur Sanders has made the Cleveland Browns team. Now what?\n- Shedeur Sanders made the Cleveland Browns' 53-man roster as a backup quarterback.\n- Sanders has a significant social media presence, generating substantial interest and scrutiny.\n- Despite a rough preseason finale, Sanders impressed with his post-game composure and media savvy.\nHe’s in. Obviously.\nShedeur Sanders survived the final cutdown on Tuesday and landed a spot on the 53-man Cleveland Browns roster, which is, well, probably old news to you.\nIf you didn’t get a notification on your smartphone, maybe you saw a Tweet or checked out a video. Somehow, in this day and age of instant digital action and reaction, you know.\nEspecially when it comes to Shedeur, son of Hall of Famer Deion Sanders.\nSanders, 23, can certainly throw a pretty mean football, tight and deadly accurate, which underscores his opportunity to further develop as a third-string quarterback. Yet the young man is pretty much Internet gold, too, which for better or worse, is part of his story, too.\nAfter his free fall in the NFL Draft a few months ago generated a flood of conspiracy theories, Sanders now holds the distinction of being among the NFL’s most popular players while pegged to ride the bench, at least for now, with one of the league's worst teams.\nSure, Sanders, who led the NCAA in completion percentage while starring last season at Colorado, hopes to ultimately establish himself as an impact NFL quarterback – to change a franchise, as he’s put it – from his humble entry as a fifth-round rookie. Yet he’s also the one who isn’t quite like any and every fifth-round pick as his every move, performance or word tends to generate thousands of clicks. He moves the needle, as they say.\n“It’s not like anything I’ve ever seen,” Tony Grossi, a talk radio host on ESPN Cleveland, told USA TODAY Sports on Tuesday. “Social media just cranks it up to another level.”\nSanders’ high profile – and legion of haters − is also fueled by the exposure that he had while playing under his father. Since Coach Prime arrived in Boulder in 2023, Colorado became a de facto “Black America’s Team” on the college football landscape, boosted by the presence of its high-profile coach. And many of the fans (and presumably, detractors) who followed Shedeur’s college journey have come along to keep tabs on his NFL transition – which is one reason why his tumble in the draft coincided with the record TV ratings for the third day of the NFL Draft in April.\nIt should be noted, too, that Sanders’ preseason debut at Carolina, broadcast live on NFL Network, generated the highest ratings for a preseason game in 10 years.\nIn other words, love him or loathe him, it’s tough to ignore him.\nThat Sanders’ star power is wrapped in his enormous social media presence is another type of X-factor. Grossi can vouch for that. A light-hearted exchange between Sanders and Grossi following the preseason opener went viral. Grossi didn’t realize that Shedeur’s older brother, Deion, Jr., filmed the exchange for his “Well Off Media” site – I saw and heard it, standing less than 10 feet away – and that it made for a neat behind-the-scenes snippet.\nSanders told Grossi that he hoped he’d have something positive to say about him after his big game. Grossi has been battered by Sanders followers as clips featuring talk-show comments about the rookie have circulated on social media. Smiling at Grossi, Sanders said, “You only say negative stuff about me. And I’m like, ‘I ain’t do nothing to you.'\"\nBut really, he knows. Critical analysis comes with the territory. And there was plenty of it after Sanders’ horrendous showing in the second half against the Los Angeles Rams on Saturday, when he hurt himself with poor decision-making and contributed greatly to his five sacks by holding onto the football too long in many cases.\nDespite that, Grossi was impressed by Sanders’ reaction afterward.\n“He stood in the locker room for an extra-long time and answered every single question,” Grossi said. “A lot of players hide in the training room after they’ve had tough games.”\nAnd when someone asked Sanders if he felt he deserved a spot on the roster, he began a thoughtful response, with a single word, “Obviously,” before proceeding to explain how every player in the locker room believed similarly.\nThe snippet was edited and reposted on social media. However, the substance of Sanders’ response was diminished while the one-word message was circulated out of context, which suggested an air of arrogance and entitlement.\nGrossi, though, already calls Sanders, “the most media-savvy athlete I’ve ever come across.” That’s saying a lot, and not just because of the relatively short time window since the Browns drafted Sanders. Grossi has covered the team for more than 40 years.\nAs an example, Grossi recalled a media session after a practice when Sanders paused while responding to a question because of the loud noise from a lawnmower. Grossi remembers Sanders saying: “That’s not good for content. I’ll hold up.”\nNo, you can’t knock his awareness.\nNow if Sanders can consistently translate that to the football field – like when protection breaks down and he must quickly rip through progressions to connect with a “hot” receiver.\nAt least he’s positioned to continue the development. Drafted 144th overall, it would have been only so shocking if Sanders didn’t survive the cut. Yet his chances seemed to improve when Browns GM Andrew Berry maintained during an interview on the broadcast of the preseason finale that he wouldn’t have any qualms about keeping four quarterbacks.\nOn Monday night, the odds increased as the Browns traded Kenny Pickett, a fourth-year pro, to the Las Vegas Raiders. Pickett was obtained in an offseason trade with the Philadelphia Eagles, and was expected to compete for the starting job. Yet he spent much of training camp and the preseason nursing a hamstring injury.\nAs expected, Browns coach Kevin Stefanski named 40-year-old Joe Flacco as the starter, backed up by Sanders and fellow rookie Dillon Gabriel, a third-round rookie. The rookie quarterbacks have quite the benefit in learning the NFL ropes with a superb mentor in Flacco.\nBehind the scenes, the rookie quarterbacks conceivably can jockey for their position on the depth chart. Gabriel has been listed ahead of Sanders since they were drafted, and the Oregon product’s solid preseason – he led the Browns to scores on five of his seven preseason drives, and was seven-of-nine on third downs – has been largely overshadowed by the buzz attached to Sanders. The preseason debates will likely continue.\nAs the No. 3 quarterback, it’s likely that Sanders will work in practices as the “scout team” quarterback, working plays from the opposing offense to prep Cleveland’s defense. Unless he supplants Gabriel as the No. 2 quarterback, Sanders will probably spend game days as the inactive “emergency” third quarterback.\nThat means Sanders will essentially be two snaps away from the lineup when the Browns open the season against the Cincinnati Bengals on Sept. 7. But he’s here. He has the chance to continue his development, and who knows how fast that will progress and when and how the opportunities to play in real games are afforded. The key is that Sanders has stuck, positioned for growth.\nImagine, though, if Sanders didn’t survive the cut. The conspiracy theories might have been off the hook. After all, Sanders entered the preseason against the backdrop that he was set up to fail due to limited practice work with frontline players. He didn’t play in the second preseason game due to an oblique injury. After he stumbled in the preseason finale, a narrative persisted that suggested the Browns failed Sanders with Stefanski’s play-calling and the bottom-of-the-roster personnel around him. It should also be noted that Sanders didn’t exactly light it up himself.\nStill, he survived. Obviously.\nContact Jarrett Bell at jbell@usatoday.com or follow on social media: On X: @JarrettBell\nOn Bluesky: jarrettbell.bsky.social"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/vikings/2025/08/27/adam-thielen-trade-minnesota-vikings-carolina-panthers/85777861007/",
      "text": "Adam Thielen traded back to receiver-needy Vikings in deal with Panthers\n- The Minnesota Vikings traded for veteran wide receiver Adam Thielen from the Carolina Panthers.\n- Thielen previously played for the Vikings from 2013-2022 and ranks third in franchise history in receptions.\n- Thielen is entering the final year of his contract, worth $8.75 million with an additional $4 million possible through incentives.\nThe Minnesota Vikings are turning to a familiar figure to address an emerging problem area.\nThe team on Wednesday agreed to acquire veteran wide receiver Adam Thielen in a trade with the Carolina Panthers.\nMinnesota also acquired a conditional 2026 seventh-round pick in exchange for a 2026 fifth-round pick and a fourth-round pick in 2027.\nThe move sends the Minnesota native back home to the organization with which he rose from an undrafted free agent to a two-time Pro Bowl selection. The Vikings, meanwhile, equip new starting quarterback J.J. McCarthy with immediate help behind two-time All-Pro Justin Jefferson while starting receiver Jordan Addison serves a three-game suspension to open the season and No. 3 target Jalen Nailor continues to be sidelined by a hand injury. Rondale Moore also suffered a season-ending knee injury in the preseason.\n\"I'm inquiring,\" Vikings general manager Kwesi Adofo-Mensah said Friday when asked in an interview with KFAN-FM radio whether he was interested in adding another receiver. \"Always got to be mindful of that as a I look at the roster.\"\nThielen, 35, played with the Vikings from 2013-22 and eventually became a staple of the passing attack as well as a fan favorite before being released in a cap-saving move. He ranks third in franchise history in career receptions (534), trailing only Hall of Famers Cris Carter and Randy Moss.\nIn Carolina, Thielen helped ease No. 1 overall pick Bryce Young's pro transition, leading the team in receiving yards for each of the last two seasons. But the Panthers seemed to reconfigure the focal points of their passing game in recent months by adding Tetairoa McMillan with the No. 8 overall pick in April to pair with 2024 first-round pick Xavier Legette.\n\"We felt strongly enough about a young, talented group that we could do (the trade),\" Panthers coach Dave Canales said Wednesday.\nMeanwhile, veteran Hunter Renfrow – who made the Pro Bowl in 2021 with the Las Vegas Raiders but sat out last season – was released Tuesday after signing with Carolina in the offseason. Canales, however, said the team had remained in contact with Renfrow about a possible return.\nAdam Thielen contract details\nThielen is entering the final year of his contract after in March signing a revision to the three-year, $25 million contract he reached with the Panthers in March 2023. The new pact is worth $8.75 million with an additional $4 million possible through incentives, according to Over The Cap, with two void years tacked on.\nAccording to multiple reports, however, Thielen and the Vikings are working on a revised contract to sort out his 2025 pay.\nHe received a $1.5 million roster bonus from the Panthers as part of the original agreement."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/26/winners-and-losers-taylor-swift-travis-kelce-engagement/85836958007/",
      "text": "Winners, losers of Taylor Swift, Travis Kelce engagement: NFL taking an L?\n- What will marriage mean for Kelce's NFL career? We've got you.\n- What will marriage mean for the Chiefs? We've got you.\n- Do you even remember which other NFL stars were married in 2025? We've got you.\nTaylor Swift and Travis Kelce are engaged.\nThe NFL’s 2025 season opener, which kicks off in nine days, immediately takes a back seat. The 2025 NFL season takes a back seat. Super Bowl 60 will take a back seat. Christmas will take a back seat. Trying to broker world peace remains in the back seat.\nKelce's Kansas City Chiefs’ play their Week 1 contest in Brazil 10 days hence, and maybe that gets to ride shotgun, especially given multiple reports that Swift will travel to São Paulo for her fiancée’s 2025 regular-season debut against the Los Angeles Chargers – presumably in far more comfortable fashion than her harried, trans-Pacific trip from an Eras Tour concert date in Japan to Las Vegas to see K.C. win Super Bowl 58 last year. And the league's latest dalliance with South American fans will doubtless wind up a resounding success − because everyone south of the Amazon will come to catch a glimpse of Swift. (This is the same Taylor Swift who's brought the NFL approximately $1 billion worth of publicity, according to one marketing firm's estimate.)\nShe and her new album, “The Life of a Showgirl,” set to drop in October, are definitely in the driver’s seat amid the latest seismic news event created by, almost inarguably, the world’s most famous woman. Kelce? Oh, yeah, he’s got a supporting role here, too, maybe in a sidecar or caravaning.\nBut let’s show Trav the respect he deserves by meting out the winners and losers (with a heavy football flavor) of what is almost undoubtedly – maybe regretfully, maybe hopefully and maybe both – going to be the biggest story of the year.\nWINNERS\nTravis Kelce (the football player)\nPlay as long as you want, bud. You’re pulling down $17.3 million in the final season of your contract, presumably enough to get you started on a payment plan for what needs to be an appropriately sized ring and honeymoon for your Boo. You’re coming off what’s probably your worst NFL season from an individual standpoint and a dismal showing, along with the rest of your Chiefs teammates, in a blowout loss to the Philadelphia Eagles in Super Bowl 59 earlier this year. Yet it already seemed like your football fire had been stoked anew well ahead of Tuesday's bombshell and that you’re ready for a resurgent 2025 – which might bring you a fourth Lombardi Trophy and perhaps burnish your (arguable) case as the greatest tight end in league history. And, regardless of what happens, stay ready for 2026, too. We assume your wife will be out touring and you’ll need something to do on the home front. May as well while away the hours and the separation anxiety by hanging out with Paddy Mahomes and Andy Reid as much as you can!\nTravis Kelce (the entertainer)\nFootball, commercials, movies – which you’ve admitted have detracted from your day job – podcasts (now that Swift has made her “New Heights” debut), do whatever you want, pal. If Tom Brady taught us anything, it’s that you can be all you can be (old Army slogan) when your more talented spouse is bringing home the real bacon.\nChiefs Kingdom\nThe Chiefs are 32-9, including two Super Bowl berths and one championship, since Swift and Kelce began dating in 2023 – a sterling record that has far more to do with side streaming the A-list relationship than anything Kelce, Mahomes, Reid or GM Brett Veach are doing otherwise. Team owner Clark Hunt recently relayed that the club’s fan base now skews heavily female after its influx of supportive Swifties. We can only imagine what the wedding gift tally will be from the Kingdom if Kelce picks up two rings over the next year or so.\nJason Kelce\n'Sup, BIL! Some suggested the former Eagles All-Pro was a bit too ubiquitous during the media blitz that was his first year of “retirement.” Now? Folks won’t be able to get enough now that he's the sibling of a commoner marrying into royalty.\nTaylor Swift (the football analyst)\nDid you hear her breaking down the game on “New Heights” while suggesting she’ll be an NFL analyst in 16 months? Yes, please! There are so many telecasts already in need of a Swift infusion – not sure why we need to wait a year-plus. Oh right, the album and, presumably, another tour. Damn.\nTaylor Swift (the entertainer)\nYou're apparently going to marry a good dude, T. Kelce’s teammates seem to love him almost to a man – I’ve asked about him enough, annually, during the Super Bowl. He’s talented, self-deprecating and has been a good advocate to those who need one. Salud.\nSo moving on, “Showgirl” and whatever follows will doubtless be another resounding smash – and Kelce has doubtless added some inspiration along the way. Maybe more is to come in the wake of married life, too. But can you imagine if this whole hullabaloo ends in divorce? I’m told Taylor, a 14-time Grammy winner, does some of her best work in the aftermath of failed relationships, so …\n(And I’m not stupid, Swift was never going to end up in the “losers” section lest I be doxed, canceled and disappeared. And I caught part of the Eras Tour on Disney+ − good stuff. Also … U2 and Pearl Jam forever and you’ll never change my mind, Swifties, no matter what a talented troubadour you support!!!)\nLOSERS\nJosh Allen and Hailee Steinfeld\nAnd you thought the reigning league MVP and Oscar-winning actress were going to produce the biggest NFL wedding news of 2025. As if. (Wait, Steinfeld hasn’t won an Academy Award yet? Fine. But she was nominated for \"True Grit.\")\nAaron Rodgers and … Brittani\nThis was the biggest NFL wedding of 2025 prior to Allen-Steinfeld. Allegedly. Still waiting to see the photo album, A-Rod, but we know you like to foment a good conspiracy theory, so ...\nJustin Herbert and Madison Beer\nGoogle recently made me aware that the Chargers’ quarterback is allegedly linked to Beer − and I legit thought he was promoting a microbrew. (Apparently, she's a singer.) Yet I was also told by an unnamed associate that the couple (?) was a sub-Kirkland brand NFL relationship compared to Allen and Steinfeld, so … not sure how a guy who’s never won a playoff game and his GF (?) made it into this story.\nTight End University?\nAlong with George Kittle and Greg Olsen, Kelce helped launch this annual three-day summer school designed to help his positional peers in 2021. Similar to “New Heights,” Swift helped to take it to the next level(s), namely by providing a brief Nashville performance at Tight End U earlier this summer. But surely Trav can’t remain involved with this endeavor as his career winds down? Especially if TEU interferes with cake tastings, destination site surveys, or pre-nup negotiations.\nNFL roster cutdowns\nAnd you thought the league’s 32 teams paring their rosters to 53 men per would be Tuesday’s preeminent football news. Pfft. TRAV MADE THE TEAM Y’ALL, HE’S NOT GETTING CUT!! Lamar Jackson was, however, released after the Swift-Kelce announcement and didn’t even rate a blip. (Just kidding. As far as you know.)\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/baltimore-ravens/366",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/saints/2025/08/26/new-orleans-saints-starting-quarterback-spencer-rattler-tyler-shough/85726122007/",
      "text": "Saints name Spencer Rattler starting QB over rookie Tyler Shough\nThe New Orleans Saints aren't yet ready to turn to their highest-drafted quarterback in decades.\nSpencer Rattler was selected Tuesday as the team's starter for the regular-season opener against the Arizona Cardinals, first-year coach Kellen Moore announced, with the second-year signal-caller beating out rookie Tyler Shough for the role.\nRattler and Shough seemed to remain even with one another throughout most of the summer, with the two splitting first-team reps in training camp practices as Jake Haener, who was waived Tuesday, loomed as a wild card. Rattler started the preseason opener against the Los Angeles Chargers while Shough opened the second contest against the Jacksonville Jaguars, with each producing mixed results and faring better in work with backups. Rattler, however, earned the nod for the finale against the Denver Broncos.\n\"He's done an awesome job this offseason,\" Moore said in a news conference Tuesday while announcing Rattler as the starter. \"He's just been consistent. He's made some really good decisions throughout this whole entire process, and his ability to make plays with his arm and feet have certainly shown up.\n\"I'm really, really excited about Spencer. He's earned this opportunity and going to do a tremendous job for us.\"\nMoore said after the second preseason game that he wanted to give the two passers as many reps as possible before making a decision given each one's youth. But with Week 1 drawing near and New Orleans standing alone as the only team yet to make clear its starting quarterback, Moore opted for the more experienced presence behind center.\nA fifth-round pick out of South Carolina in 2024, Rattler started six games for the Saints as a rookie while stepping in for injured veteran Derek Carr. Mounting offensive injuries, however, left Rattler with little support, especially in a receiving corps that was without starters Chris Olave and Rashid Shaheed throughout most of the season. Rattler was at the helm when the Saints became the lone team in 2024 to be shut out in a 34-0 drumming by the Green Bay Packers in Week 17, and he finished the year with 1,317 passing yards, four touchdowns and five interceptions.\nYet while many presumed the starting job would belong to Shough once Carr retired this offseason in the wake of the fallout from his right shoulder injury, Rattler demonstrated enough to hold onto his position atop the depth chart – for now.\nShough, who was the No. 40 overall selection in April's draft, became the Saints' highest-selected quarterback since Archie Manning went No. 2 overall to the franchise in 1971. Set to turn 26 in September, he actually is exactly one year older than Rattler despite his delayed arrival to the NFL. His nomadic college career featured three years apiece at Oregon and Texas Tech, with injuries derailing each stint. In his final year after transferring to Louisville, however, the 6-5, 219-pound passer revived his career and re-emerged as a coveted prospect, eventually becoming the third quarterback selected in his class.\nShough, however, will begin his career in New Orleans on the bench, leaving No. 1 overall pick Cam Ward of the Tennessee Titans as the only rookie quarterback set to start in the NFL in Week 1.\n\"I'm a big believer in the importance of developing quarterbacks - developing them the right way,\" Moore said. \"There's a process for both of the guys, giving them the space to develop. We think we have two guys who will have great careers for us.\""
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/washington-commanders/363",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/22/why-are-commanders-trading-brian-robinson-terry-mclaurin-contract/85781252007/",
      "text": "What are Commanders up to after Brian Robinson trade? Give them time to show us\n- Coming off a run to the NFC title game, Commanders seemed to fortify their roster yet agreed to trade Robinson on Friday.\n- Washington has also been slow to award WR Terry McLaurin, a longtime leader, a new contract.\n- But there are still two weeks to smooth things over and reveal a plan before the Giants come to play in the Week 1 opener.\nIf you’re wondering what the Washington Commanders are doing … same. But let’s not suggest they don’t deserve the benefit of the doubt despite their recent maneuvers (or lack thereof).\nFriday’s agreement to trade starting running back Brian Robinson Jr. to the San Francisco 49ers – in what effectively and belatedly becomes a Robinson-for-Deebo Samuel swap − landed with a perplexing first impression, particularly given what had occurred otherwise during the offseason.\nComing off a magical ride to the NFC championship game last season, spearheaded by Offensive Rookie of the Year Jayden Daniels and a wholly new regime, the Commanders punctuated – well ahead of schedule – their return to NFL relevance. Then GM Adam Peters and coach Dan Quinn spent a good chunk of the spring signaling a Lombardi Trophy push as their wunderkind quarterback entered his second season – meaning at least two more to go before Daniels is even eligible for the nine-figure extension he probably already deserves.\nPeters made a deal in March for Samuel, an often dynamic player if one who’s often banged up and has limitations as a receiver. He’s also in a walk year. Also acquired was left tackle Laremy Tunsil, who has a reputation as one of the league’s better blockers … and for forgetting the snap count. Aging leaders like LB Bobby Wagner, TE Zach Ertz and QB2 Marcus Mariota all re-signed. OLB Von Miller joined, too, hoping for a Super Bowl ring with his third different team. Rookies Josh Conerly Jr. and Trey Amos appear to have the chops to be immediate and key contributors.\nIt all seemed to make sense, reloading and maybe upgrading in a bid to potentially deliver mortal blows to the reigning Super Bowl champion Philadelphia Eagles, who rule the NFC East and KO’d the Commanders decisively in that NFC title game.\nBut lately?\nThe Commanders have been dragging their feet amid WR Terry McLaurin’s desire for a new contract – and if ever there was a good soldier, it’s McLaurin, who also deserves a medal for willingly being front and center for his teammates while unfailingly performing at a high level throughout the final tumultuous years of the Danny Snyder era. And, even then, despite a brief holdout and a training camp largely spent in street clothes, it felt like McLaurin would – will? – probably get his bag and smoothly reassimilate into Kliff Kingsbury’s offense as the Batman to Samuel’s Robin.\nBut exporting Robinson, who had nearly 1,000 yards from scrimmage and eight touchdowns in 2024? It’s still a bit of a surprise, even though the writing appeared on the Commanders Park walls in recent days. Quinn excused Robinson from Monday’s preseason loss to the Cincinnati Bengals and had the good sense and class to inform the player and team of the situation before kickoff. Afterward, rookie Jacory Croskey-Merritt scored on a 27-yard TD run. Third-year man Chris Rodriguez Jr. started at tailback and rushed six times for 62 yards.\n“These are some really tough, tough decisions,” Quinn said Thursday, when Robinson remained on the roster.\n“So, I'm definitely looking at those and that's what's keeping me up (at night).”\nRECORD PROJECTIONS: How many games will Commanders win?\nThere’s no question that Quinn and Peters see a bigger picture than fans, reporters and maybe even some Commanders players can envision – and maybe it will come into focus sooner than later. Maybe the hype surrounding Croskey-Merritt, who's been turning heads since being plucked out of Arizona in the seventh round is legit and no one will mourn Robinson’s departure in a month. Heck, no one in this town saw Alfred Morris coming when he rushed for a team record 1,613 yards as rookie in 2012 – directly benefiting from the presence of dual threat QB Robert Griffin III for what it’s worth.\nPerhaps the combo of Daniels, veterans Austin Ekeler and Rodriguez plus Croskey-Merritt actually elevates a run game that ranked third in the league in 2024 even though no Commander rushed for as many as 900 yards. And it’s not like anyone will confuse Robinson's pedestrian production − by NFL standards − with Christian McCaffrey, the dynamic runner he'll now backstop. And yet Robinson was a generally reliable pass protector and a guy willing to fight for hard yards so Quinn and Kingsbury didn’t have to overly rely on Daniels, whose electric legs produced a team-high 891 yards in 2024.\nYet it's hard to ignore the potential fraying to the “brotherhood” mantra Quinn has leaned on throughout his career. Robinson, a pending free agent due a modest $3.4 million in 2025, gets shipped out for a song two weeks before the season – for whatever the team’s reasons were, contractual or performance or both. Worse, McLaurin, a beloved team leader and perhaps the offense's second-most important component, continues twisting in the wind for a club projected to have more than $60 million worth of salary cap space in 2026, per OverTheCap.\nBut Quinn is attuned to the NFL's business side, much as he seems to be tiring of questions regarding Robinson and, especially, McLaurin, who’s now off the PUP list but not yet practicing. As for Peters, who previously worked for the Niners, he witnessed his former boss, John Lynch, routinely drive hard bargains late into the summer and make many tough decisions – most worked out fine.\nThe Commanders only have 16 days until the regular season starts. Also, the Commanders have 16 days until the regular season starts. Much will doubtless be revealed before they open against the division rival New York Giants on September 7, a game that maybe isn’t the layup it appeared to be even two weeks ago.\nBut in this brief interim, maybe a Washington squad loaded with veterans and led by a galvanizing coach deserve a little time and grace before anyone on Capitol Hill, Richmond, Ashburn, Landover or anywhere else in the greater DMV (D.C.-Maryland-Virginia) area pushes the panic button.\nBut just a little.\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/commanders/2025/08/28/commanders-terry-mclaurin-hoodies-contract-extension-jayden-daniels/85861824007/",
      "text": "Commanders star WR gives ringing endorsement of hoodies ... and his quarterback\n- Terry McLaurin spent much of the summer keeping a low profile in his favorite form of clothing.\n- Washington's No. 1 receiver ended his hold-in Monday by agreeing to a three-year extension.\n- 'Scary Terry' also shared on Thursday how important his teammates, especially QB Jayden Daniels, are to him.\nASHBURN, VA − After speaking with reporters for nearly a half hour Wednesday about his recently signed extension, and following his first practice of the summer on a pleasant but unseasonably cool August afternoon at Commanders Park, Terry McLaurin was just about ready to call it a day.\nThen he got a question about the hoodies, which he seemed to perpetually wear at the team's facility – regardless of Northern Virginia's infamous summer heat and humidity – while his teammates were on the field and in uniform during McLaurin's training camp hold-in, when he was awaiting his new deal and rehabbing an ankle injury while on the physically unable to perform list.\nMcLaurin returned to the table where he’d just conducted his lengthy press conference to wax poetic on what is apparently his garment of choice.\n“What people don't know about the hoodie,” he grinned, “(L)ike, I'm a hoodie guy. Like, it could be 90 degrees out. I'm going to wear a hoodie. It could be 50 degrees out. I'm going to wear a hoodie. And it's like, I mean, you can catch me out here in Ashburn, I probably got a hoodie on because I'm trying to stay low key. Like, I just, I never want to be like, in the way.”\nMcLaurin’s months-long financial impasse had threatened to get in the way of Washington’s upcoming season following the club’s unexpected run to the NFC championship game in 2024. But he and the team agreed to a three-year contract Monday worth up to $96 million, paving the way for his return to the fold and first-team reps Wednesday.\n2025 NFL record projections and playoff predictions: How far will the Commanders go this time?\nAnd McLaurin’s teammates couldn’t have been happier to re-embrace a guy who’s been a team leader almost from the moment he was drafted in 2019, his steady presence desperately needed during the final years of Dan Snyder’s ownership as much as his production on the field was.\n“I didn't even know like it was announced yet,” McLaurin said when reflecting on Monday’s events, “and I go back into the weight room to lift, and – I'm not kidding – like 30 guys were in the weight room giving me an ovation, cheering for me, happy for me, patting me on the back, just loving me up. And through all this entire process that was the biggest gift that I probably got in playing football.\n“And for guys to – I’m talking, they're coming from the cafeteria, they're coming from the training room – just to congratulate me and give me a hug and just say how happy they are for me. And that's what the brotherhood's about.”\nThe support of reigning Offensive Rookie of the Year Jayden Daniels, 24, was especially important to McLaurin even though he’s five years older than his quarterback.\n“That's my guy. That's my dog man,” McLaurin said of Daniels, with whom he forged a strong bond on and off the field in 2024. “All this was kind of unraveling and to be able to have conversations with your quarterback, but (also) somebody I consider my friend and my teammate, it really helped me.\"\nMcLaurin admitted the process to land his third contract was a tough one – bad enough that he said the trade request he made during it wasn’t merely a negotiating ploy. But no bad blood seemed to linger on either side of the table Wednesday.\n“(I)t was a long time, obviously from when we started the talks until when we got finished,” said general manager Adam Peters, who had a few sideline conversations with a hoodied McLaurin during training camp.\n“But I think you get optimistic, pessimistic, all those different things throughout the process. But what we'd never lost was our love and respect and really admiration for Terry and what he does for us on and off the field.”\nAnd now it’s back to the field, McLaurin’s ankle and bank account once again fully healthy. He’ll be aiming for a sixth consecutive season with at least 1,000 receiving yards and is looking forward to playing with new teammates like fellow receiver Deebo Samuel and left tackle Laremy Tunsil. McLaurin is also especially excited to reunite with Daniels, who threw him 12 of his career-high 13 touchdown receptions in 2024.\n“This is my first time in my career,” said McLaurin, “I have the same quarterback two years in a row. That definitely helps, you know? And then just in a situation where I'm in the same offense as well, you know what I mean?”\nMcLaurin will again be a marked man on the field while remaining a highly popular one off it – whether in the locker room or amongst Washington's fans. But that doesn’t mean he won’t continue to try maintaining a low profile.\n“(T)he hoodie's not going anywhere, man,” he said, adding with a laugh that it will continue to help disguise him.\n“I'm a hoodie person. So, shout out to all the hoodie people out there.”\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    },
    {
      "url": "https://sportsdata.usatoday.com/football/nfl/teams/dallas-cowboys/331",
      "text": "20 Labor Day weekend sales at Anthropologie, Walmart, Tarte\nShopping\nTrump moves to bypass Congress to rescind $5 billion in foreign aid\nPolitics\nOfficials bristle as Trump readies flood of ICE agents in Chicago\nPolitics\nKatrina's wake: A New Orleans community thrives as another fights on\nNation\nNo, there is not an 'epidemic' of shootings by trans people\nNation\nSenator blasts RFK Jr. over school shooting comments\nPolitics\nAmerican Dream mall in New Jersey sued for selling items on Sundays\nMoney\n'Hole in our hearts': Dad of boy killed in Minneapolis shooting speaks\nNation\nFox News correspondent diagnosed with malaria after shivering on air\nCelebrities\nWinners, losers of Parsons trade: Ample fallout for Cowboys, Packers\nNate Davis\n57 billionaires pledged to give away half their wealth. Did they?\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/sports/nfl/columnist/nate-davis/2025/08/24/nfl-preseason-winners-losers-jaxson-dart-micah-parsons/85798927007/",
      "text": "NFL preseason winners, losers: Stars still await deals, but Jaxson Dart waits for no one\n- Star hold-ins like Micah Parsons ... are still awaiting their just rewards.\n- One of the Giants' first-round picks might be August's MVP – if there was such a thing.\n- The returns for rookie quarterbacks were generally quite solid, though Cleveland's Shedeur Sanders (and his brother) ended on low notes.\nAnd that's a wrap.\nThe rehearsals are over, the exhibitions are done, and the figurative football bullets are set to fly after the NFL’s 2025 preseason officially reached its conclusion Saturday night.\nThere’s only so much to glean from pro football in August. The game plans are typically diluted, the stars are typically in sweats, and even legions of fans are typically home and maybe not even paying attention. Still, some key positional battles and compelling performances have been on display over the past month. How much of it translates into regular-season relevance? Stay tuned.\nBut, for now, here are your winners and losers from the freshly completed preseason:\nWINNERS\nJaxson Dart\nYep, the Force is strong in this one. Dart, the Giants’ Round 1 rookie quarterback and an avid “Star Wars” fan, would probably be the prohibitive preseason MVP if such an award existed. He passed for 372 yards, three TDs and crafted a 113.1 QB rating while rushing for another 52 yards and a score. He even fed teammate Jameis Winston a “W” during Thursday night’s walkover of the New England Patriots. (Priceless content, Padawan.)\nPerhaps most important, his swag has sent an infusion of optimism through the Giants' fan base. Dart may not be a Jedi master just yet or even an NFL QB1. But don’t be surprised if his powers prove too strong for incumbent starter Russell Wilson before long. “I feel like whenever my number is called that I’m going to go out there, and I’m going to play my game, and I’m going to ball,” Dart said Thursday.\nRookie quarterbacks\nIt wasn’t just Dart, one of two QBs taken in the first round of this year’s draft. No. 1 overall pick Cam Ward of the Tennessee Titans appeared comfortable and steady as he heads into his rookie season, even if his numbers don't necessarily bear that out. Tyler Shough, a second-round pick of the New Orleans Saints, also has a shot to be a Week 1 QB1. The Seattle Seahawks’ Jalen Milroe and Philadelphia Eagles’ Kyle McCord had their moments, too. And, of course, so did highly scrutinized Cleveland Browns rookies Shedeur Sanders and Dillon Gabriel, who will both apparently make their team’s 53-man roster (despite Sanders’ rough showing Saturday afternoon).\nNew York Giants\nThe buzz Dart alone generated was a welcome spark for a franchise badly in need of one. But the G-Men looked resurgent in many other aspects while winning all three of their games in dominant fashion − by a collective score of 107-47. There’s a nice collection of young talent on this team, Dart joined by the likes of fellow rookie LB Abdul Carter, second-year WR Malik Nabers and others. Given how difficult their schedule projects, the Giants may not improve much record-wise from last season’s 3-14 finish, but they could also be positioned to take off in 2026. It’s worth wondering if coach Brian Daboll and GM Joe Schoen have already sown enough hope to save their jobs beyond this year.\nJoe Flacco\nNaturally, the 40-year-old is the only Browns quarterback who didn’t get hurt this summer, allowing Flacco to fairly easily beat out Kenny Pickett, Gabriel and Sanders for Cleveland’s starting gig to begin the season. The Super Bowl 47 MVP is also quite simply one of the game’s good guys and an easy person to root for … if you don’t actually have a rooting interest. Flacco sliced up the Los Angeles Rams while playing into the second quarter Saturday, his only preseason action of the month.\nEmeka Egbuka\nThe Tampa Bay Buccaneers’ first-round pick not only made a strong impression in camp, he showed his wares on the field – his first professional TD catch a spectacular one. With fellow WRs Chris Godwin and Jalen McMillan expected to be weeks away from playing, Egbuka should be starting early … and could be a quasi-sneaky find for your fantasy roster.\nCam Little\nThe Jacksonville Jaguars’ second-year kicker drilled a 70-yard field goal − eclipsing the regular-season record by 4 yards − in his first game this month and hit a 59-yarder Saturday. Of Little's seven August field goals, four were from 50+ yards.\nTyler Loop\nThe Baltimore Ravens' rookie kicker appears comfortably installed as the replacement for disgraced and departed Justin Tucker. Loop hit all eight of his extra-point tries in preseason and was 9-for-11 on field goals, including five from at least 50 yards. His misses were from 46 and 50. Don't be surprised if Loop winds up as the league's leading scorer given the numerous opportunities he's likely to get this season.\nBuffalo Bills\nThey added RB James Cook to a long list of players who landed extensions this year – preventing his negotiations from spilling over into the regular season. They haven’t embarrassed themselves on “Hard Knocks” – yet – and seem generally ready to make another strong run at their first Lombardi Trophy.\nNFL RECORD PROJECTIONS: How many games will Buffalo win in 2025?\nKansas City Chiefs\nAs head coach Andy Reid has been historically inclined to do, he played his starters extensively this month. And they generally looked pretty good, the first teamers shining Friday night against the Bears while scoring 17 points on their first three possessions. “This is a little step but it’s a step in the right direction,” said QB Parick Mahomes, who was not sacked in August behind his reconfigured offensive line.\nCincinnati Bengals offense\nIn a bid to get off to a better start – coach Zac Taylor is 1-11 in his career during Weeks 1 and 2 – they played starters like QB Joe Burrow and WR Ja’Marr Chase this month, and their high-scoring chemistry seems to be carrying over from 2024. We’ll see what that means in September.\nDak Prescott\nHe’s healthy on the heels of a season cut in half by a serious hamstring injury and was encased in bubble wrap throughout the preseason ahead of the Dallas Cowboys’ opener Sept. 4 in Philadelphia, when they and the Eagles kick off the 2025 regular season. Not only that, with so much attention on teammate Micah Parsons’ contract impasse, there’s been relatively little heat on Prescott and his high-profile team heading into what could be the 30th consecutive season in which “America’s Team” fails to make the Super Bowl.\nTrey Lance\nThe No. 3 overall pick of the 2021 draft was the Los Angeles Chargers’ leading passer and second-leading rusher this preseason. After making a strong case to be Justin Herbert’s backup, Lance might finally be in the right situation with coach Jim Harbaugh to get his long-stagnant career finally on track.\nMicah Parsons, Trey Hendrickson and Terry McLaurin\nAll All-Pro-caliber players. All hold-ins. All still, maybe not so patiently, awaiting much-deserved contract extensions. But, hey, at least all of them got to more or less coast through training camp and preseason while their mostly younger, mostly less accomplished teammates had to grind through the heat. The entire trio should be fresh for Week 1 … assuming they’re actually in uniform by then.\nLOSERS\nMicah Parsons, Trey Hendrickson and Terry McLaurin\nAll All-Pro-caliber players. All hold-ins. All still, maybe not so patiently, awaiting much-deserved contract extensions. Assuming those deals eventually come, all three players must then try to vigilantly avoid the soft tissue injuries that so often plague players forced to deal with business instead of football at this time of year. Yet maybe it shouldn’t be a foregone conclusion all will find a middle ground. Parsons and Hendrickson, in particular, have been at loggerheads for months and more – both have even expressed a desire to be traded – in their bids to extract raises and security from owners, Dallas’ Jerry Jones and Cincinnati’s Mike Brown, respectively, very much set in their ways ... for better or worse. Kinda hard to fathom why three teams with playoff aspirations have chosen to play with fire this long over stars who are arguably their most important players, quarterbacks notwithstanding.\nAnthony Richardson\nLance can relate to Richardson’s seemingly premature demise. The No. 4 overall pick of the 2023 draft for the Indianapolis Colts, he now finds himself backing up Giants washout Daniel Jones going into Week 1. Maybe Richardson, a raw but sublimely talented dual threat passer who’s 8-7 as an NFL starter, can work his way back into the lineup and flourish. But it currently feels like he might need a change of scenery in order to fulfill his estimable potential.\nJoe Milton III\nThe second-year man with the howitzer attached to his right shoulder was acquired by the Cowboys via an offseason trade with the Patriots to be Prescott’s backup. Milton played much better Friday, albeit mostly against Atlanta Falcons backups, but generally left much to be desired in his other appearances – and for a team that had to rely so heavily in recent years on QB2 Cooper Rush, now Baltimore's backup. And, at some point, Prescott has to shed that aforementioned bubble wrap ...\nCincinnati Bengals offense\nIn a bid to get off to a better start – coach Zac Taylor is 1-11 in his career during Weeks 1 and 2 – they played starters this month … and they continued their 2024 pattern of getting scorched, whether by front-line opponents or backups. Might help having Hendrickson out there, fellas. We’ll see what that means in September.\nChicago Bears\nCaleb Williams and the offense looked fantastic in a Week 2 whitewash of the Bills, who, notably, didn’t play their starters at Soldier Field. Yet the Bears' first team looked just as bad in Friday’s loss at Kansas City, Williams seemingly reverting to some of the indecision and bad habits that plagued him as a rookie. “It was not the start we wanted from our (starters), really on offense, defense or special teams” said Chicago rookie head coach Ben Johnson. “Offensively, the first two possessions were really sloppy football that has plagued us in and out of camp so far and unfortunately that is what we got here tonight.”\nThe Bears should be better in 2025, but it might take a minute for that improvement to show up in the win column.\nDerrick Harmon\nThe Pittsburgh Steelers’ first-round defensive lineman could miss up to a month of his rookie season after suffering a sprained MCL on Thursday. Total bummer.\nMatthew Stafford\nHe’s finally back on the practice field after missing most of training camp with a disc issue in his back. Stafford seems on track to play in Week 1 … but is a 37-year-old with a bad back going to last until Week 18 and hopefully beyond for a team with serious Super Bowl aspirations?\nBrian Robinson\nAfter getting traded from the Washington Commanders to the San Francisco 49ers, he’s been relegated from starting in D.C. to backup running back duties behind Christian McCaffrey heading into his walk year.\nKirk Cousins\nAfter not getting traded by the Falcons – yet – he’s still a backup quarterback in search of something more.\nChristian Wilkins\nAfter getting cut by the Las Vegas Raiders amid fairly bizarre circumstances in July, the talented defensive tackle remains without a job.\nJ.J. McCarthy\nHeading into his second NFL season – after missing all of his rookie campaign with a knee injury – he’s got all of two career preseason appearances (one of them this year) under his belt as he prepares to take over for Sam Darnold as the Minnesota Vikings’ starting quarterback. What could go wrong in September given McCarthy’s scant professional experience?\nAaron Rodgers\nPittsburgh opted not to play him at all in preseason even though he’s new to the roster and OC Arthur Smith’s playbook. Maybe it’s no biggie given Rodgers got some live work against the Bucs in a joint practice and knows a thing or two about thriving in a league he's been MVP of four times … even if the Steelers open against the New York Jets at MetLife Stadium, where Rodgers infamously blew out his Achilles in Week 1 two years ago.\n“I’m never a fan when guys don’t play in the preseason, especially at the quarterback position,” said NFL Network analyst and former two-time league MVP Kurt Warner. “Last year wasn’t (Rodgers’) best year … would’ve loved to see him get out there and just play a little bit – with a new system, with the new guys, get that feel back.”\nDeion Sanders' weekend\nHe watched one son, Shedeur, play like a rookie who deserved to be a fifth-rounder on Saturday afternoon. In the evening, he saw another son, Shilo, an undrafted free agent trying to stick with Tampa Bay, ejected for throwing a punch against Buffalo. Shilo Sanders was waived Sunday. As Coach Prime has been known to say, “Oh Lawd.”\nAll NFL news on and off the field. Sign up for USA TODAY's 4th and Monday newsletter."
    }
  ],
  "argos_summary": "The article outlines the 2025 NFL power rankings, highlighting the Cowboys’ drop after trading star linebacker Micah Parsons to the Packers and the resulting shift in team dynamics. It details Parsons’ four‑year, $188 million contract and the Packers’ acquisition of two first‑round picks and defensive tackle Kenny Clark, while noting the Cowboys’ plans to rebuild with a new head coach. The piece also previews key matchups, such as the Eagles’ potential title run, the Packers’ strengthened pass rush, and the Cowboys’ adjusted roster, and briefly touches on other offseason moves and preseason insights across the league.",
  "argos_id": "ZR1JW0VC4"
}