{
  "url": "https://www.theverge.com/policy/718880/trump-mobile-letter-democrats-regulators",
  "authorsByline": "Lauren Feiner",
  "articleId": "51b66fb10c9d4ff08c40efb5e1054844",
  "source": {
    "domain": "theverge.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/06/t1-phone-trump.jpg?quality=90&strip=all&crop=0,1.7328436659964,100,78.534031413613",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T15:03:05+00:00",
  "addDate": "2025-08-05T15:05:29.014733+00:00",
  "refreshDate": "2025-08-05T15:05:29.014736+00:00",
  "score": 1.0,
  "title": "Democrats ask how Trump’s government will regulate Trump Mobile",
  "description": "The T1 phone is supposed to be available this month.",
  "content": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nWhen a Trump-branded phone on a Trump-branded mobile network launches sometime this year (if all goes according to plan), US regulators will face what’s become a recurring conundrum in Donald Trump’s presidency: how to regulate a product with ties to the head of state.\n\nSix Democratic lawmakers are confronting key federal agencies with that very question in a letter shared exclusively with The Verge. Led by Sen. Elizabeth Warren (D-MA), the lawmakers ask the Federal Communications Commission (FCC), Federal Trade Commission (FTC), Food and Drug Administration (FDA), the departments of Commerce and Treasury, and US Trade Representative’s (USTR) Office about how they’ll avoid “undue political influence” and what they’d do if they were asked by the White House to stop investigating potentially unlawful practices by Trump Mobile.\n\nThe lawmakers, including Sens. Richard Blumenthal (D-CT), Adam Schiff (D-CA), Chris Van Hollen (D-MD), as well as Reps. Doris Matsui (D-CA) and Greg Casar (D-TX), singled out the six entities because of the role they could play in regulating Trump Mobile’s operations. The FCC is tasked with regulating mobile virtual network operators (MVNOs) like Trump Mobile across state lines. The FTC enforces laws against consumer deception, including claims of products being made in the US, as the Trump Mobile phone was initially said to be. The FDA regulates medical devices including some software apps, which could include the telehealth service that Trump Mobile claims can help read vital signs with a phone camera.\n\nThe departments of Commerce and Treasury and the USTR oversee tariff policy, which the lawmakers fear could be exploited to benefit Trump Mobile. They note that Trump exempted smartphones from his tariffs after meeting with and receiving a million-dollar donation from Apple CEO Tim Cook, and “the opportunities for corruption and self-dealing will be even greater as Trump Mobile ramps up its business.”\n\nThe lawmakers acknowledge that Trump Mobile says its offerings are not “designed, developed, manufactured, distributed or sold by The Trump Organization or any of their respective affiliates or principals.” But selling a trademark license for the Trump name can still be lucrative for the president, since the company that controls it is owned by his trust. The president earned $8 million by licensing his name to products last year, NPR reported. It’s not the first time that Trump family businesses have raised potential conflict of interest concerns — critics warned that the president’s support for bills boosted by the cryptocurrency industry could ultimately help his own family’s stablecoin ventures, even though the White House says Trump’s own assets are in a trust managed by his kids.\n\nThe Democrats are also worried that other companies — like mobile network carriers or phone retailers — will offer Trump Mobile favorable terms to help their own dealings with the government. Tech CEOs have wasted no time trying to get on the administration’s good side, including by donating millions to Trump’s inaugural fund.\n\n“Trump Mobile offers yet another avenue for tech and telecom companies to purchase influence with President Trump, such as by offering Trump Mobile favorable conditions for MVNO arrangements like preferential network access or pricing arrangements, making their proprietary apps available on the Trump Mobile platform, or selling T1 devices in their stores,” they write. “It is critical that federal regulators continue to evenhandedly enforce competition and consumer protection laws against Trump Mobile and any companies with which it works, especially in the face of this opportunity for corruption and self-dealing for President Trump.”\n\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates.",
  "medium": "Article",
  "links": [
    "https://www.npr.org/2025/06/26/nx-s1-5446114/trump-wealth-business-crypto-brand-golf-course",
    "https://www.theverge.com/2025/1/7/24338125/meta-mark-zuckerberg-fact-checking-censorship-brendan-carr-trump",
    "https://www.theverge.com/2025/1/17/24346044/tiktok-ceo-shou-zi-chew-trump-ban-supreme-court",
    "https://www.theverge.com/gadgets/693080/trump-mobile-t1-phone-made-usa",
    "https://www.reuters.com/business/trumps-world-liberty-crypto-tokens-become-tradable-2025-07-16/",
    "https://www.theverge.com/tech/607947/donald-trump-tariffs-china-mexico-canada-explainer",
    "https://www.theverge.com/politics/709483/crypto-week-genius-clarity-act-trump",
    "https://www.theverge.com/news/687418/trump-mobile-network-t1-trademark-application",
    "https://www.theverge.com/2025/1/17/24345244/elizabeth-warren-senator-press-big-tech-trump-donations"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump Mobile",
      "weight": 0.12803783
    },
    {
      "name": "Trump",
      "weight": 0.10895917
    },
    {
      "name": "President Trump",
      "weight": 0.10815661
    },
    {
      "name": "Trump family businesses",
      "weight": 0.10345513
    },
    {
      "name": "the Trump Mobile phone",
      "weight": 0.07234146
    },
    {
      "name": "the Trump Mobile platform",
      "weight": 0.070743784
    },
    {
      "name": "Trump Mobile’s operations",
      "weight": 0.07015952
    },
    {
      "name": "Trump Mobile’s",
      "weight": 0.06790231
    },
    {
      "name": "Trump’s own assets",
      "weight": 0.0614663
    },
    {
      "name": "mobile network carriers",
      "weight": 0.059225924
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9462890625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8310546875
    },
    {
      "name": "/News/Technology News",
      "score": 0.6064453125
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.5361328125
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.328125
    }
  ],
  "sentiment": {
    "positive": 0.0758667,
    "negative": 0.56933594,
    "neutral": 0.3544922
  },
  "summary": "Six Democratic lawmakers have asked key federal agencies, led by Sen. Elizabeth Warren (D-MA), to ensure that the US government will not be influenced by the influence of Donald Trump. The lawmakers, led to the question in a letter shared exclusively with The Verge, include the Federal Communications Commission, Federal Trade Commission (FTC), Food and Drug Administration (FDA), and Department of Commerce and Treasury, and US Trade Representative’s (USTR) Office. They also highlighted the potential conflicts of interest between the two parties. The Democrats fear that other companies, like mobile network carriers or phone retailers, may offer Trump Mobile favorable terms to help their dealings with the government. They note that while the Trump name is owned by his trust, it could still be lucrative for the president for licensing his name to products.",
  "shortSummary": "Six Democratic lawmakers question how US regulators will regulate Trump Mobile, amid potential conflicts of interest and self-dealing concerns related to the Trump family business.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ae05401a35346938046679b09ef0848",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theverge.com/2025/1/17/24345244/elizabeth-warren-senator-press-big-tech-trump-donations",
      "text": "Sens. Elizabeth Warren (D-MA) and Michael Bennet (D-CO) are putting pressure on big tech firms to explain their motives for donating to President-elect Donald Trump’s inauguration fund. In letters to Amazon, Apple, Google, Meta, Microsoft, OpenAI, and Uber, the lawmakers express concerns about the companies making contributions to “avoid scrutiny, limit regulation, and buy favor.”\nLawmakers press Meta, Apple, Google, and others on massive Trump donations\nSens. Elizabeth Warren and Michael Bennet want to know why Big Tech firms have donated millions to Trump’s inauguration.\nOver the past several weeks, Google, Microsoft, Apple CEO Tim Cook, Meta, Amazon, and OpenAI CEO Sam Altman all donated $1 million apiece to Trump’s inauguration, while Uber and its CEO, Dara Khosrowshahi, each contributed $1 million. Many of these tech execs have already met with Trump, and Meta CEO Mark Zuckerberg is even hosting an inauguration party for the incoming president, according to The New York Times.\nThese sizable donations surpass the amount most of these companies contributed to President Joe Biden’s inauguration fund in 2021. A filing with the Federal Election Commission shows Uber donated $1 million to the event, followed by Microsoft with a $500,000 contribution, Google at $337,500, and Amazon at $276,509. Apple donated just $43,200 to Biden’s inauguration, while Meta and OpenAI didn’t contribute at all.\nIn the letters, Sens. Warren and Bennet draw attention to the regulatory scrutiny the Biden administration has directed toward big tech firms. “You have a clear and direct interest in obtaining favors from the incoming administration: your company and many other Big Tech donors are already the subject of ongoing federal investigations and regulatory actions,” the lawmakers write. “These donations raise questions about corruption and the influence of corporate money on the Trump administration, and Congress and the public deserve answers.”\nBiden echoed these concerns in a farewell message this week, saying he was particularly worried about the “potential rise of a tech industrial complex that could pose real dangers for our country.”\nSens. Warren and Bennet have posed several questions to Amazon, Apple, Google, Meta, Microsoft, OpenAI, and Uber, asking for their “rationale” behind the contributions as well as “when and under what circumstances” the companies decided to make a donation. They’re giving the companies until January 30th to respond.\nUpdate, January 17th: Added post from Altman.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.theverge.com/news/687418/trump-mobile-network-t1-trademark-application",
      "text": "The Trump family is launching a mobile network, Trump Mobile, and a Trump-branded phone, the T1, which they claim will be made in America.\nTrump Mobile is launching with a single plan called “The 47 Plan” for $47.45 per month, which it says offers the same coverage as the big three carriers. It will work with existing phones, but if you prefer, the company will also sell a $499 T1 Phone in a gold finish.\nIn a press release, Trump Mobile calls it “a sleek, gold smartphone engineered for performance and proudly designed and built in the United States.” It’s available to preorder now with a $100 deposit, and will either be available from August 2025 or September 2025, depending on whether you believe the press release or the Trump Mobile website.\nDetails on the phone itself are sketchy. The product page includes what appears to be a Photoshopped image of a brushed gold phone with a “T1” logo and US flag on the back. The triple camera layout appears similar to recent iPhone Pro models at first glance, but the lenses are strangely spaced, and there doesn’t appear to be any camera flash.\nThere are numerous errors on the page, from a processor section that doesn’t list a processor, RAM that’s described as storage, and the boast of a “5000mAh long life camera,” when it presumably means the battery.\nNo chipset is listed, but it will apparently have 12GB of RAM and 256GB of expandable storage, and run on Android 15. The 6.78-inch display uses a 120Hz OLED panel, and the phone will pack a 5,000mAh battery and even a 3.5mm headphone jack. It’s not an awful spec sheet, though the cameras don’t sound impressive: a 50-megapixel main camera flanked only by 2-megapixel macro and depth sensors. There isn’t even an ultrawide.\nAs for the network, Trump Mobile’s online Terms of Use say that it’s “powered by Liberty Mobile,” a freedom-themed mobile virtual network operator (MVNO) that uses the T-Mobile network. The 47 Plan includes unlimited calls, texting, and data, along with roadside assistance from Drive America and access to a 24/7 telehealth service. Coverage and cell service should be similar to Mint Mobile, Metro, US Mobile, and other MVNOs on the T-Mobile network, which offer cheaper unlimited plans than Trump.\n“Trump Mobile is going to revolutionize cellphones, mobile calling,” Eric Trump told Fox News, before suggesting that the company will run a call center out of St. Louis, Missouri.\nThe new venture was announced today by the Trump Organization, the main holding entity for most of Donald Trump’s businesses, currently controlled by his children. The announcement comes just after a trademark application surfaced for both “Trump” and “T1” within telecoms, mobile accessories, and phones.\nTrump launching a mobile network could have complications. For one, the question of how FCC chairman Brendan Carr will handle regulating a network owned by his boss’s family.\nThe Trumps aren’t the only public figures with their sights set on telecoms. While Ryan Reynolds has gotten out after selling his stake in Mint Mobile to T-Mobile in 2023, just last week saw the launch of SmartLess Mobile, brought to you by the podcast of the same name hosted by Hollywood stars Will Arnett, Jason Bateman, and Sean Hayes.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.npr.org/2025/06/26/nx-s1-5446114/trump-wealth-business-crypto-brand-golf-course",
      "text": "Trump opened a new golf course in Scotland. It's not his only new venture as president\nPresident Trump wrapped his five-day foreign trip to Scotland — that included discussions about trade deals with the European Union — with a ribbon cutting ceremony at a new golf course opening on a property bearing his name.\nThe second course at Trump International Golf Links Aberdeen is the latest new venture for a president whose business ties — and eponymous properties — have been key to his wealth.\nWhile the golf course, along with launch of a Trump \"meme coin\" in early 2025 and Trump Mobile later in the year, are recent additions to the president's portfolio whose value won't be known for some time, they will be adding to an already significant income.\nTrump reported income of more than $630 million last year, including $57 million from cryptocurrency sales and more than $8 million licensing his name for products like watches, guitars and Bibles.\nAccording to a 234-page financial disclosure released in June, the billionaire president has assets of more than $1.6 billion across his business empire that includes real estate, hotels and golf courses, plus investment accounts and newer Trump-branded ventures touted on the campaign trail.\nAbout three quarters of the income reported is revenue from Trump's hotels and golf courses, like his Mar-a-Lago Club in Florida which made $50 million last year. The Aberdeen property accounted for about $6 million in income in 2024.\nThere's also millions in merchandise and retail sales, plus licensing deals, like $2.8 million for Trump Watches, $2.5 million for Trump Sneakers and Perfumes and more than $1.3 million from the \"God Bless the USA Bible,\" which features the chorus of Lee Greenwood's eponymous song, plus the Constitution, Declaration of Independence and Pledge of Allegiance.\nPrior to his time in politics, Trump's fortune largely derived from the deals and holdings of the Trump Organization, but in recent years he has sought new forms of business, raising conflict of interest concerns and allegations from ethics watchdogs that he may be profiting from the presidency.\nThere has also been much attention paid to the disclosure of more than $57 million in income from selling cryptocurrency tokens through the World Liberty Financial crypto venture founded last year – and does not account for the estimated hundreds of millions of dollars earned this year through the launch of the $TRUMP coin.\nDemocrats and ethics experts have questioned the president's involvement in crypto, particularly as Congress debated legislation to regulate the burgeoning industry. Trump signed the GENIUS Act in July after shaping the bill's progress through Congress. The new law adopts regulations for a type of cryptocurrency known as stablecoins.\nThe White House has repeatedly pointed out the president's assets are in a revocable trust and said the president follows all ethics laws.\nWhite House press secretary Karoline Leavitt said in a May press briefing that it was \"absurd for anyone to insinuate that this president is profiting off of the presidency.\"\nTrump's financial disclosure shows a diverse stream of income sources, ranging from a few hundred dollars in residual checks from appearances in movies and TV shows like The Little Rascals and The Fresh Prince of Bel Air to a few million dollars from selling a Cessna airplane last March.\nAcross three trusts and four investment accounts, Trump has more than $236 million in investments that earned more than $13 million in interest and dividends.\nThe latest drop: Trump Mobile\nThe ethics report is a snapshot of a moment in time and does not include new ventures and income since Trump returned to office in January, including the new Trump Mobile phone company announced by the Trump Organization June 16.\nLaunched on the 10-year anniversary of his presidential campaign announcement, it's another example of Trump's brand on full display. The phone plan reportedly offers service through the three major cell providers, and its \"The 47 plan\" is available for $47.45 – a nod to Trump being the 47th and 45th president.\nThere's also the option to pre-order a golden \"T1\" phone for $499 that says it is \"brought to life right here in the USA.\" The phone will be released later this year.\nLike many of Trump-named things through the years, the Trump Organization is licensing the president's name rather than taking part in the creation or distribution of the actual product.\nThe fine print on the website notes: \"Trump Mobile, its products and services are not designed, developed, manufactured, distributed or sold by The Trump Organization or any of their respective affiliates or principals. T1 Mobile LLC uses the TRUMP name and trademark pursuant to the terms of a limited license agreement which may be terminated or revoked according to its terms.\"\nThere's a Trump company — DTTM Operations — designed to handle the trademarks and licensing of the Trump name.\nTrump as a brand\nLong before entering politics, Donald Trump was a name synonymous with \"brand.\" The filing provides insight into how that brand has changed over time.\nRobert Passikoff, founder and president of Brand Keys, has tracked the value and impact of Trump's brand since the 1980s, said Trump started out as one of a small number of people that you could call a \"human brand.\"\n\"If you took a brand-new building that you were going to now rent out and you could get $350 a square foot, if you put the Trump name on it, you could get $500 a square foot,\" Passikoff said. \"What the products and services were absorbing were the values that at that time he stood for.\"\nThat's still true now that Trump's in politics, but it's for a much different, primarily conservative audience.\n\"To borrow from another human brand, he's become the Martha Stewart of the conservative right,\" Passikoff said. \"And what the purchases are more resonant as is political allegiance rather than a desire for a new guitar, or running shoes.\"\nHe said that Trump-branded memorabilia and retail stemming from his political career works because it gives people something tangible to demonstrate their personal values.\n\"They see these things as being symbols that they can own, that they can show their friends, their family and the world: 'This is who I am and what I stand for,'\" he said."
    },
    {
      "url": "https://www.theverge.com/politics/709483/crypto-week-genius-clarity-act-trump",
      "text": "The crypto industry is beginning to see a return on one of its most prescient investments: Donald Trump.\nOn Thursday, the House of Representatives passed three bills that industry supporters believe will bring more legitimacy and predictability to the digital currency space — and that critics warn could enrich the president’s own family and hand too much power to the industry at the expense of stability in the financial system. With the summer recess looming, there’s a limited amount of time to pass two of the bills that still require a Senate vote, but one is already headed to Trump’s desk. Crypto Week, as House Republicans took to calling it, didn’t go as smoothly as hoped, with some hardline Republicans blocking a procedural step to advance the bills earlier on in the week. But after the president had “a short discussion” with them, Trump wrote on Truth Social that he was able to secure the necessary votes to move the bills forward.\nThat kind of sway is exactly what crypto executives — who poured tens of millions into Trump’s election, loudly proclaimed their support for him, and contributed to his inaugural fund — paid for. After a four-year struggle with the Biden administration over crypto policy, the industry is finally seeing the US government adopt policies it’s long asked for.\n“We are getting incredibly close to finally having clear rules for crypto to grow this industry in the United States of America,” Coinbase CEO Brian Armstrong wrote on X after the passage of the GENIUS and CLARITY Acts. Summer Mersinger, CEO of the crypto industry group Blockchain Association, called the GENIUS Act’s bipartisan passage “a watershed moment for digital assets in the United States.”\nThe industry is finally seeing the US government adopt policies it’s long asked for\nThe GENIUS Act was already passed by the Senate and now heads to the president’s desk to be signed into law. The bill creates a regulatory framework for stablecoins, or digital currency tied to the value of the US dollar. Bipartisan supporters see it as a positive step to create guardrails for a burgeoning industry, but some Democrats who opposed the bill fear it would help funnel new investment into an area in which Trump’s own family has a direct stake through World Liberty Financial.\nThe other two bills, the CLARITY Act and the Anti-CBDC Surveillance State Act, still need to be approved by the Senate. The latter would prevent the Federal Reserve from issuing a central bank digital currency (CBDC), which could compete with existing digital currencies but whose skeptics think could be used for government surveillance.\nThe CLARITY Act would outline rules around when digital assets could be treated as securities regulated by the Securities and Exchange Commission (SEC) or a commodity regulated by the Commodities Futures Trading Commission (CFTC). This distinction was a sore point for the crypto industry during the previous administration, to the point where previous SEC Chair Gary Gensler was lambasted as a symbolic bogeyman for all of crypto.\nTrump successfully courted crypto money for his campaign on the promise that he would fire Gensler, and now the industry is seeing high dividends on this investment. They’ve gone from an era in which they were embattled by independent agencies to having the president himself help get industry-favorable legislation over the finish line.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.theverge.com/2025/1/7/24338125/meta-mark-zuckerberg-fact-checking-censorship-brendan-carr-trump",
      "text": "I have to commend Meta CEO Mark Zuckerberg and his new policy chief Joel Kaplan on their timing. It’s not hugely surprising that, as the pair announced early today, Meta is giving up on professional third-party fact-checking. The operator of Facebook, Instagram, and Threads has been backing off moderation recently, and fact-checking has always been contentious. But it’s probably smart to do it two weeks before President-elect Donald Trump takes office — and nominates a Federal Communications Commission head who’s threatened the company over it.\nMeta’s fact-checking changes are just what Trump’s FCC head asked for\nThe company is ditching third-party fact-checking after Brendan Carr sent Mark Zuckerberg veiled threats about it. Convenient!\nTrump’s FCC chairman pick (and current FCC commissioner), Brendan Carr, is a self-identified free speech defender with a creative interpretation of the First Amendment. In mid-November, as part of a flurry of lightly menacing missives to various entities, Carr sent a letter to Meta, Apple, Google, and Microsoft attacking the companies’ fact-checking programs.\nThe letter was primarily focused on NewsGuard, a conservative bête noire that Meta doesn’t actually work with. But it also demanded information about “the use of any media monitor or fact checking service,” and it left no doubt about Carr’s position on them. “You participated in a censorship cartel that included not only technology and social media companies but advertising, marketing, and so-called “fact checking” organizations,” Carr wrote. The incoming Trump administration and Congress, he continued, will take “broad ranging actions ... and those actions can include both a review of your companies’ activities as well as efforts by third-party organizations and groups that have acted to curtail those [speech] rights.”\nIn case the implications weren’t clear enough, Carr spelled out exactly how his agency could punish them:\nFor now, I am writing to obtain information from you that can inform the FCC’s work to promote free speech and a diversity of viewpoints. As you know, Big Tech’s prized liability shield, Section 230, is codified in the Communications Act, which the FCC administers. As relevant here, Section 230 only confers benefits on Big Tech companies when they operate, in the words of the statute, “in good faith.”\nPrized liability shield you’ve got there! It’d be a real shame if someone... administered it.\nIf you’re wondering, “Since when is the FCC in charge of Section 230?” Carr links to a memo from Trump’s first term about a proposal that then-chairman Ajit Pai never got around to passing. It was unclear whether the FCC could do it back then, and that was before the Supreme Court handcuffed regulatory agencies by killing the doctrine of Chevron deference. Even Federalist Society contributors think Carr’s going off the rails here. (In any case, the “in good faith” provision only applies to one currently lesser-used section of Section 230 and it’s unclear why fact-checking services would violate it.) That said, it’s likely he and Trump will try again anyway — and they can still create a lot of headaches for a company that flouts his demands.\nIf you’re also wondering what the big deal is, this is almost textbook jawboning: a form of soft government censorship that Carr and other Republicans have railed against their political opponents for (allegedly, and according to the Supreme Court, probably not actually) performing. Now, Trump is taking credit for Meta’s changes. Private companies have the right to moderate — or not moderate — platforms, and they have the right to label — or not label — posts with third-party fact-checks. Government officials shouldn’t threaten to strip legal protections from them for doing it.\nOn top of all that, this kind of high-profile jawboning undercuts the notion that Meta made a principled decision. It’s entirely possible the company would have discontinued fact-checking anyway; it’s a lightning rod for controversy that social networks are increasingly trying to avoid, and there are pragmatic questions about how well it works. Meta has a long and lofty justification for its move that even complains about government pressure, implicitly under the Biden administration, to take down content in the past. But Carr’s letter makes that complaint look laughable — and it makes Meta look like cowards.\nCorrection: The new policies were announced today, not yesterday. We regret the error.\nUpdate 12:46PM ET: Added comment from Trump press conference taking credit for the changes.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.theverge.com/tech/607947/donald-trump-tariffs-china-mexico-canada-explainer",
      "text": "If you live in the US, congratulations — you are now a foot soldier in what has been called “the dumbest trade war in history.” And if you live in one of the top three countries that trade most with the US (Canada, Mexico, and China), apologies: you are part of this as well.\nDonald Trump’s tariffs, explained\nTrump imposed an additional 10 percent tax on all goods coming from China. He also imposed 25 percent tariffs on goods from Mexico and Canada.\nDonald Trump loves tariffs despite regularly misrepresenting how they work, and after months of saying he would impose them on goods coming into the US, he made good on his promise this week: there is a 10 percent tax on all products from China imposed as of February, plus an extra 10 percent announced this week. After pausing tariffs on Canadian and Mexican goods last month, those also apply as of March 4th — a whopping 25 percent on our neighbors that will affect everything from lumber to tomatoes.\nThere’s a deep misunderstanding of tariffs, in part thanks to Trump’s false claims. Who pays tariffs? What do they actually do? How do they affect consumers? Let’s talk about it.\nWhat’s a tariff, exactly?\nLeave the word “tariff” aside for a second and think about it like this: it’s a tax. Specifically, tariffs are a tax set by the government on goods and services that come from abroad. They can be wide reaching (a tax on everything coming in from China) or narrow (a tax on certain items from a certain country) and typically are a percentage of the value of the thing being imported.\nTrump’s initial executive order on tariffs on Chinese products was a blanket 10 percent tax on everything coming in from the country, plus an additional 10 percent on top of that as of March. His taxes on goods from Canada and Mexico are similarly broad: everything imported into the US from these countries will get a 25 percent tax applied, except for Canadian oil, which would be pegged at 10 percent.\nIs that even legal?\nLike many of Trump’s actions in the flurry of the last few weeks, the way he imposed tariffs is of questionable legality. As Politico reports, Trump levied tariffs in a way that no other president has in history, using a 50-year-old law called the International Emergency Economic Powers Act (IEEPA). The US Constitution gives Congress the power to levy tariffs, but in practice and over the course of many decades, the president has been given more authority to set tariff policy, particularly on the basis of national security. While the manner that Trump went about imposing sweeping tariffs is unique, it’s part of a larger trend in US history.\n“Congress has become less effective every subsequent year for almost 40 years,” says Kathryn Anne Edwards, an economist and policy consultant. “As a result of Congress being incapable of passing meaningful reforms, the office of the presidency has expanded to the fullest extent possible. The executive branch has taken up basically all of the air in the room.”\nWhat we’ve seen this week is a rerun of Trump’s tariff strategy during his first term. In 2019, he also attempted to use the IEEPA to threaten a 5 percent tariff on Mexico but ultimately backed down. Trump had announced a series of border actions Mexico would take — but later reporting indicated that Mexico had already agreed to them months before. (Sound familiar?)\nWho pays for tariffs?\nTrump and Vice President JD Vance have regularly lied about tariffs (or have no concept of how they work, which is maybe even more concerning). At many rallies during the 2024 campaign, Trump said other countries would be taxed using US import tariffs. That claim is “unequivocally false,” Edwards says.\nA tariff is paid by the entity importing the product, whether that’s Target, or Apple, or the Trump campaign merch store, for example. Sometimes it could even be individual shoppers (more on that later). The money goes into the US Treasury and is a relatively small portion of the federal revenue: it’s amounted to less than 2 percent for the last 70 years. Last year, Customs and Border Protection collected $77 billion in tariffs, or 1.57 percent of the federal revenue.\nEven if a department store pays the tariff initially, that additional cost is likely to burden consumers — companies are in business to make money, after all.\n“If Target has to pay on every good that they import from Canada and sell in their stores, Target is paying that tax, but they’re not paying it, paying it,” Edwards says. “They’re passing it on to somebody else.”\nEconomists agree that the cost of tariffs ultimately fall on consumers — and there’s data from Trump’s first presidency to illustrate that point.\n“You can’t control the price consequences of tariffs”\nIn 2018, Trump imposed steep tariffs on imported washing machines as he vowed to put American businesses first, a move celebrated by companies like Whirlpool. But researchers at the Federal Reserve and the University of Chicago found something interesting: not only did the price of washing machines go up but also the price of dryers. All in all, the tariffs cost consumers around $1.5 billion a year, while the revenue from the tariffs the US collected was just $82 million. Washing machines went up by around $86 and dryers went up by $92, the researchers found, even though dryers were not subject to tariffs.\nWashers and dryers are typically purchased in pairs, and a likely explanation for the parallel price increases is that companies selling the appliances didn’t want to raise the price of one but not the other — instead of bumping up the washer by 20 percent, they spread the increase across the two products, for example. And it wasn’t just imported washers and dryers that got more expensive: domestic brands (including Whirlpool) also bumped up their prices.\n“It’s a lesson in the fact that you can’t control the price consequences of tariffs,” Edwards says.\nWhen will we feel the effects of tariffs?\nThe ripple effects of tariffs depend on a lot of factors, including how tariffs are implemented, the industries they cover, and how companies in those industries are structured, to name a few. Trump’s tariffs are sweeping and immediate, as opposed to targeted at specific products or industries and phased in over time.\n“Consumer-facing companies have every incentive not to shock consumers,” says Monica Gorman, managing director at Crowell Global Advisors and deputy assistant secretary for manufacturing under former President Joe Biden. “They’re going to want to do their best to continue to provide a competitively priced product for consumers. But the importer pays the tariffs, so at some point those costs have to be absorbed somehow.”\nIt also depends on what the market for that product or industry is — competitive industries might wait until they use up existing inventory of purchased goods and then raise prices as new inventory comes in, says Susan Helper, professor of economics at Case Western Reserve University and chief economist at the Department of Commerce under former President Barack Obama. If they have market power, they might raise prices immediately, having noticed in advance that the price of their products will rise.\n“The foreign companies can also decide that they may absorb some of the tariffs — so that if the tariff is 25 percent, they may lower their price so that the consumer doesn’t feel the full 25 percent tariff,” Helper says. “That’s not typical, but it does happen in some cases.”\nHow companies respond to tariffs also depends on what other choices consumers have — say, someone who was considering buying a foreign car and now will opt for an American one, Helper says. In competitive industries where shoppers have a substitute, companies may try to minimize the price increase. But ultimately, consumers have two options: they can find a substitute or simply buy less.\nDo tariffs create jobs in the US?\nA cornerstone of Trump’s sales pitch for tariffs on imports has been that the move would create and protect jobs in the US.\n“The higher the tariff, the more likely it is that the company will come into the United States and build a factory in the United States so it doesn’t have to pay the tariff,” Trump said in one interview. Research has shown some previous tariffs Trump imposed didn’t bring in jobs in those industries.\nHelper says she is more sympathetic to the argument that tariffs could create jobs than many economists, but with an important caveat: tariffs have to be part of a larger program to nurture a domestic industry. And there are important considerations to keep in mind when anyone promises to reshore lost manufacturing jobs — for one, you tend not to get many jobs to begin with because so much of the work is automated.\n“Other reasons you might want to do it are, [that] the manufacturing jobs are often good jobs or there’s a national security reason,” Helper says. “National security” can mean ramping up domestic capacity to manufacture N95 masks in case of another pandemic, for example.\n“We don’t get to go back in time.”\nTariffs might also encourage domestic innovation, but they can’t be the only mechanism. Helper, who also worked for the Biden administration, notes the tariff hikes under Biden on things like Chinese solar panels, semiconductors, and electric vehicles were in conjunction with other efforts to build nascent industries.\n“It’s not efficient, really, to have tariffs be your only way, your only mechanism. So this is where I would part ways with the Trump administration,” Helper says.\nManufacturing jobs peaked in the US in 1979. Edwards says the idea of tariffs as a way to bring back jobs is understandably appealing but isn’t realistic.\n“We don’t get to go back in time,” Edwards says. “Wasn’t it great in the ’50s when all men had unionized jobs and everybody was fine? But we don’t get to go backwards.”\nHere again, the washing machine study offers an eye-opening detail. In that example, about 1,800 jobs were created. But researchers estimate that it cost consumers about $815,000 per job.\nWhat’s this about Temu and Shein orders?\nBefore the direct effects of the additional tariffs, something much more immediate started causing shipping chaos — something called the de minimis exemption. It was a mess from the beginning.\nUnder the de minimis exemption rule, packages valued under $800 used to enter the US duty free, thus avoiding a whole slew of existing tariffs. Trump ended the exemption for packages from China and Hong Kong, meaning businesses and consumers who previously didn’t have to pay tariffs on those parcels are now on the hook. Trump’s tax plan for so-called low value packages gives carriers two options: they can tack on 90 percent of the parcel’s value or a flat $75 fee. Those added costs are paid by the consumer (who is technically the importer if you’re getting drop-shipped packages delivered to your home).\n“Companies could choose to absorb the costs, pass along the costs to consumers, or do some combination thereof,” says Gorman. “That said, it’s important to note that the tariffs these products are now subject to are significant.”\nIf you order from ultracheap discount store Temu, fast-fashion giant Shein, Amazon Haul, or other dropshipping businesses, your orders are going to cost you more, plain and simple. What that looks like exactly will depend on how e-commerce platforms decide to handle it. It could mean you have to pay the taxes to get your package from the carrier; platforms could add it to the end, like a processing fee; or retailers could fold it into the price of the item.\nA knock-on effect of de minimis exemptions ending is that shoppers’ packages could be delayed while in transit. Previously, these lower-value parcels didn’t go through the same processing by Customs and Border Protection (CBP) — but under Trump’s executive order, that could all change. Trump’s executive order on the end of de minimis carves out the right for CBP to require formal entry, a more detailed paperwork process that de minimis packages previously bypassed. It’s not clear whether every under $800 package will be subject to higher standards of processing, but it would be costly. An Oxford Economics study previously estimated that a similar bill restricting de minimis exemptions for China and Russia would cost the US $3.2 billion a year, amounting to the salaries of 39,000 CBP officers. The study estimates the move would generate $627 million in revenue, with taxpayers potentially footing the bill for the difference.\n“Much remains to be seen as to how shippers of these packages will address these new paperwork requirements,” Gorman told The Verge via email. “But given the significant volume of de minimis packages in recent years from China, it is likely that we will see delays and confusion in the near-term. Packages coming in via mail and the U.S. Postal Service (as opposed to through major cargo carriers) will probably face additional logistical challenges.”\nBut there were cracks showing in the system just a few days before de minimis was set to expire. In late April, DHL said it was suspending deliveries to the US worth over $800, with reports indicating it was because many more packages required additional paperwork to enter the country. A week later, those shipments were back up and running after what DHL called a “constructive dialogue” with the US government. It’s not clear what exactly was negotiated.\nHow long will this last?\nGreat question — I don’t know! As we’ve already seen, Trump’s tariffs are subject to change at literally any moment, so tariffs on China could also be rolled back or paused at some point, just like those applied to Canada and Mexico. Trump uses tariffs as a bargaining chip to get other things he wants, whether that’s more money and resources thrown at the borders or to create things like a “fentanyl czar.” China has already announced retaliatory tariffs and other actions in response to Trump’s, and Canada and Mexico have threatened to do the same. Check back in a few weeks and we’ll see where we’re at.\nUpdate, May 2nd: President Trump’s tariffs on goods from Canada, Mexico, and China went into effect in March. After a temporary pause on the removal of the de minimis rule, Trump’s executive order to end the exemption took effect. The story has been updated to reflect these changes.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.theverge.com/gadgets/693080/trump-mobile-t1-phone-made-usa",
      "text": "When the Trump Organization launched the Trump Mobile wireless carrier, it also launched a flagship phone called the T1 Phone 8002 (gold version). One of the phone’s main selling points was that it was to be made in America. We figured that was unlikely to be true. And we were right: sometime in the last several days, the Trump Mobile site appears to have been scrubbed of all language indicating the phone is to be made in the USA. (Like, for instance, the huge banner on the homepage that says the T1 is “MADE IN THE USA.” Just to name one example.)\nInstead, the Trump Mobile website now includes what can only be described as vague, pro-American gestures in the direction of smartphone manufacturing. The T1’s new tagline is “Premium Performance. Proudly American.” Its website says the device is “designed with American values in mind” and there are “American hands behind every device.” Under Key Features, the first thing listed is “American-Proud Design.” None of this indicates, well, anything. It certainly doesn’t say the device is made in the USA, or even designed in the USA. There are just… some hands. In America.\nThat’s not the only thing that appears to have changed about the phone since its launch last week. It was originally advertised to have a 6.78-inch AMOLED screen, but now the T1’s site says it’s 6.25 inches. The site used to list the phone as having 12GB of RAM, and now doesn’t list RAM at all. It’s not entirely clear what’s happening here — the Trump Organization hasn’t responded to a request for comment — but it looks like Trump Mobile may have switched suppliers for the T1. Whatever’s going on, it’s certainly another reason to doubt whether this phone is for real. (The badly photoshopped image of the phone hasn’t changed, though, so that’s something.)\nWhen Trump Mobile first launched, it was also promising the T1 Phone 8002 would ship in September. Now, the only timing I could find was “later this year.” Probably best not to hold your breath.\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    },
    {
      "url": "https://www.theverge.com/2025/1/17/24346044/tiktok-ceo-shou-zi-chew-trump-ban-supreme-court",
      "text": "In his first statement since the Supreme Court upheld a law that could ban TikTok from the US on Sunday, TikTok CEO Shou Zi Chew offered no insight into what would happen to the app in just a few days. Instead, he took the opportunity to appeal to President-elect Donald Trump.\nTikTok CEO flatters Trump ahead of US ban deadline\nBut he didn’t say what the company will do on Sunday when the ban takes effect.\nBut he didn’t say what the company will do on Sunday when the ban takes effect.\n“I want to thank President Trump for his commitment to work with us to find a solution that keeps TikTok available in the United States,” Chew says in a video on the platform. “We are grateful and pleased to have the support of a President who truly understands our platform — one who has used TikTok to express his own thoughts and perspectives, connecting with the world and generating more than 60 billion views of his content in the process.”\nIn discussing Trump’s TikTok views, Chew is speaking his language. After all, the incoming president is famous for keeping close tabs on his TV ratings and recently declared he had a “warm spot” for TikTok after seeing how the platform played a role in his campaign. It’s TikTok’s most public attempt to butter Trump up before he takes over the Oval Office on Monday (one day after the ban takes effect), but Chew has already visited him at Mar-a-Lago and plans to attend his inauguration, along with several other tech CEOs.\nTrump has previously declared his intention to save TikTok but has not said how he’d do so. After Friday’s Supreme Court ruling, he asked the public to “respect it” and said, “My decision on TikTok will be made in the not too distant future, but I must have time to review the situation.” Earlier on Friday, he said he’d spoken with China’s President Xi Jinping about TikTok, among other things, calling it a “very good” call.\nChew’s statement seems to indicate that TikTok believes appealing to Trump is now its most promising path to remaining viable in the US. Even so, Trump’s options are somewhat limited. The most effective path, if he could achieve it, would be to somehow broker a deal to get ByteDance (with China’s allowance) to sell TikTok and comply with the law’s divestiture requirements. Otherwise, he could instruct his Justice Department not to enforce the ban, possibly through an executive order — but that might not be enough to reassure companies like Apple, Google, and Oracle that they won’t risk serious penalties by continuing to provide service for TikTok.\nIn the meantime, we still don’t know how TikTok itself will handle the impending ban, which takes effect the day before Trump is sworn in. The company has reportedly planned to go dark in the US in that case. “Rest assured, we will do everything in our power to ensure our platform thrives as your online home for limitless creativity and discovery, as well as a source of inspiration and joy for years to come,” Chew says. “More to come.”\nMost Popular\n- Google dunks on Apple Intelligence in new Pixel 10 ad\n- Google’s healthcare AI made up a body part — what happens when doctors don’t notice?\n- 8BitDo’s first wireless Xbox controller is a surprise Rare collaboration\n- Alienware’s AW2725Q 4K OLED gaming monitor is down to its lowest price ever at Amazon\n- Lenovo’s rollable laptop is the coolest computer I’ve used all year"
    }
  ],
  "argos_summary": "The Trump Organization is set to launch Trump Mobile, a mobile network featuring a Trump-branded phone, the T1, which has raised concerns among Democratic lawmakers regarding potential conflicts of interest and regulatory oversight. Led by Senator Elizabeth Warren, six lawmakers have questioned federal agencies about how they will prevent undue political influence over Trump Mobile's operations. The phone is marketed as 'made in America,' though recent changes to its promotional language have raised doubts about its actual manufacturing origins.",
  "argos_id": "6PR7EUUC0"
}