{
  "url": "https://www.cnet.com/deals/amazon-deals-of-the-day-get-your-back-to-school-schedule-on-track-for-a-record-low/",
  "authorsByline": "Aashna Gheewalla",
  "articleId": "e395783397f8468a9c2a4e657b55ca06",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/42855fe659cd754bd7ab57dd551ae2b3df982177/hub/2025/08/05/1bb6d422-95dd-49f8-b3fc-464d74274f56/amazon-dod-8-5.png?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T15:04:38+00:00",
  "addDate": "2025-08-05T15:09:08.247773+00:00",
  "refreshDate": "2025-08-05T15:09:08.247774+00:00",
  "score": 1.0,
  "title": "Amazon Deals of the Day: Get Your Back-to-School Schedule on Track for a Record Low",
  "description": "Amazon has slashed the price of the Skylight calendar. Also, enjoy a new low on the already affordable Google Pixel 9A and 43% off Renpho's smart scale.",
  "content": "Amazon sells a vast array of products, with new ones arriving daily across many categories, including home essentials, tech and furniture. Lucky for us, the retail giant loves cutting prices as much as it loves adding new products. However, deciding which offers are worth grabbing (and which aren't) is a full-time job, but we've done the heavy lifting, hand-picking the top markdowns from the bunch.\n\nToday, we spotted the Skylight Calendar Max down to a new record low price, perfect for the back-to-school season. We also found a nice $100 discount on the Google Pixel 9A. Finally, we spotted Renpho's smart scale at over 40% off.\n\nWith the back-to-school season quickly approaching, our lives are starting to get super busy again. Keeping track of everything going on in life can be quite overwhelming, especially with multiple kids. Having a smart calendar can make a huge difference. One that we love is the Skylight Calendar Max.\n\nThe Skylight Calendar helps you keep track of your appointments, chores, meetings and more. You can color-code events either by type or by person so it's easy to follow. You can also add in things like weather and dinner plans to help plan your day. You can even keep track of meal plans. Plus with the Skylight app, you can easily check on things on your phone. Speaking of apps, it connects to your Google or Apple calendar for easy syncing.\n\nA device this handy certainly doesn't come cheap. It retails for a whopping $620. But for a limited time you can score one for $570. It's still pricey but it's a new record low.\n\nA lot of us are probably upgrading our phones for the new back-to-school season. But a recent survey we conducted found that 78% of back-to-school shoppers are worried about affording tech purchases. If you're among this group, you'll be happy to hear the already-affordable Google Pixel 9A is now down to a record low price. The 9A has a substantial battery life and uses the same Tensor G4 chipset as the rest of the Pixel 9 series. This phone also allows you to take advantage of Gemini AI features. It also has a gorgeous display with a 6.3-inch OLED screen and 2,700 nits of brightness. Plus it comes with 128 GB of storage.\n\nThis phone is more affordable than the rest of the Pixel 9 series with a starting price of $499. But today, you can get $100 off this price bringing it down to $399. Plus this price is valid for all the color options, so you can pick your favorite.\n\nIf you're someone who really prioritizes health and fitness, I'll probably find some sort of scale in your bathroom. I love using a smart scale since it can tell you more important metrics than just your weight. This scale from Renpho is a great choice as it's super simple an easy to use. It uses four sensors to give you an accurate reading in precise 0.2lb increments. It can also tell you your body fat percentage, muscle mass, body water, metabolic age and more. The data is stored on your phone so you can easily monitor progress.\n\nThis smart scale is pretty affordable with a list price of $35. But thanks to this 43% discount, you'll pay just $20. Although it's not the record low price, it's only $2 more. That makes this a pretty fantastic deal.\n\nWith so many deals on Amazon, deciding which ones are worth your money can be difficult. But CNET has combed through what the world's largest online retailer has to offer, and we've gathered the best deals for you to check out.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/health/fitness/",
    "https://www.amazon.com/Skylight-Calendar-Max-Interactive-Touchscreen/dp/B0F1WYX8J6?ref_=ast_sto_dp&tag=cnet-buy-button-20",
    "https://www.cnet.com/tech/computing/best-laptop/",
    "https://www.amazon.com/RENPHO-Bluetooth-Bathroom-Composition-Smartphone/dp/B01N1UX8RW?ref=dlx_deals_dg_dcl_B01N1UX8RW_dt_sl14_e7_pi&pf_rd_r=TE4Q7F4BTWTP4QWVW39S&pf_rd_p=996f2b05-9e88-4ece-8de8-467770dc3be7&th=1&tag=cnet-buy-button-20",
    "https://www.cnet.com/gifts/our-favorite-back-to-school-picks/",
    "https://www.cnet.com/health/sleep/best-mattresses/",
    "https://www.cnet.com/health/",
    "https://www.cnet.com/tech/back-to-school-survey-2025/",
    "https://www.cnet.com/health/fitness/best-smart-scale/",
    "https://www.cnet.com/tech/mobile/pixel-9a-buying-guide-everything-to-know-about-googles-budget-phone/",
    "https://www.cnet.com/tech/services-and-software/what-is-gemini-everything-you-should-know-about-googles-ai-tool/",
    "https://www.amazon.com/Google-Pixel-Gemini-Smartphone-Incredible/dp/B0DVHV7X53?ref=dlx_deals_dg_dcl_B0DVHV7X53_dt_sl14_e7&pf_rd_r=QW8TY7N7KNXG0WA3GXG8&pf_rd_p=996f2b05-9e88-4ece-8de8-467770dc3be7&th=1&tag=cnet-buy-button-20"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new ones",
      "weight": 0.06843591
    },
    {
      "name": "new products",
      "weight": 0.06384406
    },
    {
      "name": "prices",
      "weight": 0.06334438
    },
    {
      "name": "Pixel 9A",
      "weight": 0.0609315
    },
    {
      "name": "School",
      "weight": 0.05903591
    },
    {
      "name": "school",
      "weight": 0.05903591
    },
    {
      "name": "Amazon Deals",
      "weight": 0.058826156
    },
    {
      "name": "more important metrics",
      "weight": 0.056837223
    },
    {
      "name": "scale",
      "weight": 0.05618763
    },
    {
      "name": "a new record low price",
      "weight": 0.055729635
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.86474609375
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.5791015625
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.393798828125
    },
    {
      "name": "/Shopping/Shopping Portals",
      "score": 0.3330078125
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.30419921875
    }
  ],
  "sentiment": {
    "positive": 0.16101074,
    "negative": 0.37280273,
    "neutral": 0.4658203
  },
  "summary": "Amazon is selling a wide range of products, with new ones arriving daily across many categories. The Skylight Calendar Max has been reduced to a new record low price, perfect for the back-to-school season. The Google Pixel 9A has also been discounted by $100, bringing it down to $399. Renpho's smart scale from the company is also over 40% off. A recent survey found 78% of back-for-school shoppers were concerned about paying for tech purchases.",
  "shortSummary": "Amazon.com's best deals for the back-to-school season include Skylight Calendar Max, Renpho's smart scale, Google Pixel 9A, and Skylight calendar Max, all selling at record lows.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "da34bf9e6cee4881bbfc4409ef25edc9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/tech/computing/best-laptop/",
      "text": "I review all types of laptops at CNET, from budget models for everyday tasks to high-performance laptops for PC gaming and content creation -- and everything in between. With decades of experience, I conduct rigorous performance tests and supplement the benchmarks with extensive hands-on use to get a sense of a laptop's design and features in addition to its performance. And I always keep price and value in mind when evaluating a laptop. I have favorite MacBooks and I also have many Windows laptops to recommend for a variety of uses. No matter your budget or whether you need a laptop for home, school or work, I'm confident there's a laptop here that's perfect for you. Let's dive in.\nOur Picks\nLAPTOP DEALS OF THE WEEK\nWhat is the best laptop overall?\nApple’s already fantastic laptop is now faster and cheaper. The MacBook Air recently received a jolt with an update to Apple’s latest M4 silicon and its price dropped by $100. The 13-inch MacBook Air M4 starts at $999 and the 15-inch MacBook Air M4 starts at $1,199. Each provides a ton of value for the money. The larger Air is still thin and light while supplying a roomy 15.3-inch display. It’s the best laptop for most people. The smaller and lighter Air sacrifices some screen size for increased portability, making it the best student laptop.\nA Windows rival to the MacBook Air has arrived in the form of Microsoft's first Copilot Plus PC. Based on a Qualcomm Snapdragon X CPU, the Surface Laptop 7 offers strong application and AI performance and outstanding battery life. It was the first Windows laptop I've tested with a longer battery life than that of the MacBook Air. With a design that's on par with the Air's, the Surface Laptop 7 is one of the best laptops. So is the Asus Zenbook A14, which is a lightweight laptop with an even longer battery life than the Surface Laptop 7.\nRead more:\nBest laptops of 2025\nPros\n- Optimal balance of screen size and system weight\n- M4 processor provides good balance of performance and battery life\n- Lower $1,199 starting price\nCons\n- 256GB SSD is too small for the price\n- $200 upcharge for more RAM or storage is steep\n- Smooth ProMotion display still exclusive to MacBook Pro\nThe 15-inch MacBook Air is proof that you don't need a Pro to get a larger display. It supplies a larger screen that you once found only on the pricier Pro models. If you're eyeing the 14- or 16-inch Pro models primarily for the added screen size, the MacBook Air 15 is the more affordable option you should go for, especially at its new lower starting price.\nWhy we like it\nI really enjoyed the roomy, 15.3-inch display. It made juggling multiple windows during the workday easier, and I liked watching show, movies and baseball on it in the evenings.The Apple M4 update adds incremental improvements -- and a new sky blue color -- to an already fantastic laptop that sits in the Goldilocks Zone of Apple's MacBook lineup.\nWho it's best for\nPeople looking for a big-screen MacBook who don't need the power of a MacBook Pro. With its roomy display, trim design and new lower starting price, the 15-inch M4 MacBook Air should be viewed as the default Air, with its cheaper and smaller 13-inch sibling a good alternative for students and others with tighter budgets and busy, on-the-go lifestyles.\nWho shouldn't get it\nStudents who need a more affordable and portable laptop will be better off with the 13-inch Air. Creative types who need more graphics oomph will need to spend more for the added power of a MacBook Pro. Check out our best MacBooks page for more MacBook recommendations.\nPros\n- Big performance gains from M1, Intel MacBook Airs\n- Great design, features\n- Support for two external displays simultaneously with MacBook display\n- 12-megapixel Center Stage camera\nCons\n- 256GB SSD might fill up fast\n- Expensive upgrades\nFor Apple’s latest MacBook Air, the bigger news than moving from Apple's M3 silicon to M4 chips is the drop in price.\nWhy we like it\nStarting at $999, the MacBook M4 Air is $100 cheaper than the entry point for the previous M3 models. In addition to a slight bump in performance over the previous generation, the M4 Air adds a Center Stage webcam, better support for external displays and a new ice blue color option.\nWho it's best for\nStudents and anyone looking for the most affordable and portable MacBook. My colleague, Josh Goldman, tested it and found that the M4 chip refresh adds up to a good, if minor, update to an already fantastic lightweight laptop that’s now more affordable for students and those on tight budgets. With its mix of strong overall performance, long battery life and a trim design, it’s no wonder it’s such a popular laptop for students.\nWho shouldn't get it\nAnyone who is buying a MacBook Air for toting around the house instead across campus will enjoy the roomier display of the 15-inch Air. Also, graphics pros who need the power of a Pro will need to spend more for a 14- or 16-inch MacBook Pro.\nPros\n- Beautiful, durable design\n- Class-leading battery life\n- Strong performance\n- Awesome and accurate haptic touchpad\nCons\n- No OLED option\n- Upgrades get costly and don't include dedicated GPU\n- Your Arm-on-Windows compatibility mileage may vary\nThe Surface Laptop 7 reverses earlier Arm-based efforts that were plagued by lackluster performance and limited compatibility. Many x86 apps were unable to run on an Arm-based system. This time around, performance has improved and so has compatibility.\nWhy we like it\nI like it for its polished design and class-leading battery life. The Surface Laptop 7 ran for nearly 20 hours in testing -- that’s the longest of any 13- or 14-inch laptop I've ever tested -- including the M4 MacBook Air. The Surface Laptop 7 competes with the MacBook Air in performance and battery life and supplies a similarly sleek and solid build.\nWho it's best for\nPeople who love the look and long battery life of the MacBook Air but want a Windows laptop. We wish there were an OLED display option, and you’ll need to do a compatibility check for your mission-critical applications before embracing the Arm-based Surface Laptop 7, but if you can get past those hurdles, then you’ll get a well-built, good-looking and long-running Windows ultraportable. You don't necessarily need to spend the roughly $2,000 that our test system costs; one of the lower-priced configurations that starts at $900 should meet the needs of most people.\nWho shouldn't get it\nAnyone worried about potential Windows-on-Arm compatibility issues should skip Qualcomm-based laptops and pick out an Intel or AMD model. The Surface Laptop 7 is also not the pick if you want an OLED display on your next laptop. For more, check out my other favorite Windows laptops.\nPros\n- Incredibly thin and light without feeling flimsy\n- All-day-and-all-night battery life\n- OLED display at this price is a nice surprise\n- Ample RAM and storage for the price too\nCons\n- Meh performance from Snapdragon X CPU\n- Meh mechanical touchpad\n- Meh speakers\nBuilt around an Arm-based Qualcomm Snapdragon X processor, the Zenbook A14 is the lightest Copilot Plus PC I've tested and the second-longest running. It weighs less than 2.2 pounds and offers a battery life of more than 24 hours.\nWhy we like it\nI was hugely impressed with the Ceraluminum shell that allows the Zenbook A14 to be incredibly light yet rigid, and its 14-inch OLED display is excellent. It also serves up ample RAM and storage for the price.\nWho it's best for\nStudents and anyone who is on the road with regularity for their job. If portability is paramount, then the lightweight, long-running Zenbook A14 is the pick.\nWho shouldn't get it\nIf you are concerned about Windows-on-Arm compatibility issues, then you should skip the Zenbook A14 and find an Intel- or AMD-based laptop. I have other best lightweight laptop picks.\nBest budget laptop\nAcer Aspire 14 AI\nPros\n- Exceedingly long battery life\n- Competitive performance for the price\n- Useful port selection\nCons\n- Dull display\n- Dull design\nThis recent release from Acer's budget Aspire line is based on an Intel Lunar Lake CPU. Its Intel Core Ultra 5 226V has a neural processing unit capable of 40 trillion operations per second (TOPS) for local AI processing, which happens to be the minimum requirement for Microsoft's Copilot Plus PC platform. The Aspire 14 AI is on sale for just $500 at Amazon, making it easily the cheapest Copilot Plus PC I've reviewed.\nWhy we like it\nThe Aspire 14 AI is a great pick among budget laptops. Its performance and battery life exceed what I expected for the price, and the design is nearly the same as I've seen from Acer's more expensive Swift models. You're forced to sacrifice display quality to hit such a low price but that's an item that's usually not very high on a budget shopper's priority list. More important is getting a modern CPU that delivers sufficient performance for everyday use that's also efficient to allow for lengthy battery life -- plus a bit of future-proofing with its AI capabilities.\nWho it's best for\nBudget laptop shoppers. With the lengthy battery life we've come to expect from Copilot Plus PCs and with application and AI performance that's competitive with pricier models, the Aspire 14 AI offers great value for budget buyers looking for a Copilot Plus PC. For more, check out my other best budget laptop picks.\nWho shouldn't get it\nIf you care about the overall look of your next laptop and have the money, you can find more exciting designs. Spending more will also get you a brighter display with better color performance.\nPros\n- Strong build quality\n- Great performance for the price\n- Long battery life\n- Comfortable, quiet keyboard\n- Good port selection\nCons\n- A little on the heavy side\n- Clacky touchpad\n- Uninspired audio output\nWith its excellent build quality, adequate display, strong performance and lengthy battery life, the Yoga 7 14 Gen 9 provides a ton of value and is a great fit as a versatile machine for home use or students.\nWhy we like it\nIt's a great deal at its price of $900 at Best Buy and an even better deal at its regularly discounted price of $800 direct from Lenovo. We like its solid, all-metal chassis and the power and efficiency you get from its AMD Ryzen 7 8000-series CPU.\nWho it's best for\nAnyone looking for a flexible two-in-one for a great price, including students who might like to take notes in tablet mode. It lacks some of the refinement and extras you get with Lenovo’s flagship Yoga 9i 14, but the midrange Yoga 7 14 is much more affordable. We think it's the better option for most people.\nWho shouldn't get it\nLaptop buyers who want a lighter two-in-one with a better OLED display and better speakers -- and are willing to spend more to get those extras -- should instead consider the Yoga 9i 14. For more, check out my picks for the best two-in-one laptop.\nBest gaming laptop\nAsus ROG Zephyrus G16\nPros\n- Excellent fast, calibrated OLED screen\n- Well designed\n- Performance vs. size reasonably balanced\n- Good port selection\nCons\n- Battery life is just okay\n- Big power brick\n- Bottom and hinge areas can get hot\n- Settings in Armoury Crate software can get confusing\nThe Zephyrus G16 that my colleague, Lori Grunin, reviewed is relatively pricey at $2,700 for an upscale configuration with a 16-inch OLED screen, RTX 4080, 32GB of RAM, a 1TB SSD and an Intel Core Ultra 9 185H.\nWhy we like it\nThe ROG G16 configuration that Lori tested isn't cheap but it's a good all-around system for both gaming and creative work. She liked the huge, calibrated OLED display and performance from the pairing of the Core Ultra 9 CPU and RTX 4080 graphics. The port selection was also a positive.\nWho it's best for\nGamers who want a large screen for a more immersive gaming experience, and creators who will make use of the calibrated OLED display. Solid configurations start at $2,000, so you don't need to spend as much as the model we reviewed. If you have a smaller budget, then take a peek at our picks for best cheap gaming laptop.\nWho shouldn't get it\nThe Zephyrus G16 is a great choice for gamers, but its little sibling -- the G14 -- is a little more highly rated because of its more general-use advantages, which include size, weight and lower price.\nPros\n- Excellent 2.8K OLED display\n- Beautiful design that's also compact and lightweight\n- Competitive application and AI performance from Intel Lunar Lake CPU\nCons\n- Very expensive when not on sale\n- Battery life is good but not great\nIf you love the sleek look and great portability of a MacBook Air but need a Windows laptop for work, then HP's flagship EliteBook Ultra is a great alternative.\nWhy we like it\nWith a spectacular 14-inch, 2.8K OLED display wrapped up in an elegant and compact enclosure, the EliteBook Ultra G1i deserves its Ultra label. It definitely has a premium look and feel that I found was on par with a MacBook Air in terms of being thin and light yet rigid and sturdy. In my tests, the Intel Lunar Lake CPU proved to be a well-rounded performer with great efficiency for good battery life that'll get you through almost any work day on a single charge.\nWho it's best for\nWith its compact chassis and deluxe design, the EliteBook Ultra G1i is well suited for traveling executives or anyone who appreciates a small, lightweight OLED laptop for work.\nWho shouldn't get it\nAnyone who can't wait for it to go on sale or isn't purchasing at a quantity that qualifies for a volume-pricing discount should take a pass. At its sale price of $1,899 or $1,999, the EliteBook Ultra G1i is an excellent value and a great choice for your next work laptop, but it's harder to recommend at its full price of nearly $3,000. If you're buying a laptop for work, then I'd point you to my list of best business laptops for more recommendations.\nBest Chromebook\nAcer Chromebook Plus 514\nPros\n- Long battery life\n- Excellent webcam performance\n- Bright, matte touchscreen\n- Durable build\n- 512GB SSD\nCons\n- No keyboard backlight\n- Lots of flex on the keyboard, touchpad\n- Slower 5Gbps USB-C ports\nWhy we like it\nThis new Chromebook Plus model delivers good performance and even better battery life along with a respectably bright display with a matte finish to limit glare. It has more storage than you'd typically find at its price. The model we reviewed lacked keyboard backlighting, which was a bit of a bummer, but Acer does sell models with a backlit keyboard that aren’t that much more expensive.\nWho it's best for\nStudents and anyone looking for a Chromebook for a home office or secondary entertainment machine. It's a fixed configuration based on an Intel Core i3-N305 CPU and 8GB of RAM. Those specs might seem underpowered but suffice for ChromeOS, which is much more lightweight than Windows. With its mix of features and performance for the price, it’s easy to recommend for school, work or home.\nWho shouldn't get it\nIf you need to run a specific Windows or MacOS application, then you'll need to skip a low-cost Chromebook and choose a budget Windows laptop or MacBook Air -- we have recommendations.\nBest laptops compared\nSee the pricing and specs for our favorite laptops.\n| Starting price | Display size/resolution | Weight | CPU tested | GPU tested | |\n|---|---|---|---|---|---|\n| Apple MacBook Air 15 (M4, 2025) | $1,199 | 15.3-inch, 2,880x1,864 | 3.3 pounds | Apple M4 10‑core CPU | Apple M4 10‑core GPU |\n| Apple MacBook Air 13 (M4, 2025) | $999 | 13.6-inch, 2,560x1,664 | 2.7 pounds | Apple M4 10‑core CPU | Apple M4 8‑core GPU |\n| Microsoft Surface Laptop 7 | $1,000 | 13.8-inch, 2,304x1,536 | 2.96 pounds | Qualcomm Snapdragon X Elite X1E-80-100 | Qualcomm Adreno |\n| Asus Zenbook A14 | $1,100 | 14-inch, 1,920x1,200 OLED | 2.16 pounds | Qualcomm Snapdragon X X1-26-100 | Qualcomm Adreno |\n| Acer Aspire 14 AI | $750 | 14-inch, 1,920x1,200 | 3.05 pounds | Intel Core Ultra 5 226V | Intel Arc 130V |\n| Lenovo Yoga 7 14 Gen 9 | $900 | 14-inch, 1,920x1,200 | 3.6 pounds | AMD Ryzen 7 8840HS | AMD Radeon 780M |\n| Asus ROG Zephyrus G16 | $2,700 | 16-inch, 2,560x1,600 OLED | 4.3 pounds | Intel Core Ultra 9 185H | Nvidia GeForce RTX 4080 |\n| HP EliteBook Ultra G1i | $1,999 | 14-inch 2,880x1,800 OLED | 2.6 pounds | Intel Core Ultra 7 268V | Intel Arc 140V |\n| Acer Chromebook Plus 514 | $350 | 14-inch, 1,920x1,080 | 3.2 pounds | Intel Core i3-N305 | Intel UHD |\nMost recent additions\nThe HP EliteBook Ultra G1i is the most recent addition to the list. With its trim design, excellent build quality and high-res OLED display, it's our pick for the best business laptop.\nThe new M4 versions of the MacBook Airs are the next-newest additions. The 15-inch Air acts as the bridge between the 13-inch MacBook Air M4 and MacBook Pro line and offers fans the best of both worlds: a larger display without the MacBook Pro premium. Because Apple has dropped the price by $100 for the M4 MacBook Air models, the price gap between the Air and Pro has grown.\nOther laptops we've tested\nHP OmniBook X Flip 16: While it has a handful of appealing features, this midrange 16-inch convertible ends up being a clumsy assemblage of disparate parts.\nLenovo ThinkPad X9 14 Aura Edition: It offers a cheap path to an OLED ultraportable, but is a ThinkPad a ThinkPad without the little red nub in the middle of the keyboard?\nHP OmniBook X Flip 14: This two-in-one laptop offers style, value and configuration options abound, including a 3K OLED display for only an extra $100.\nMicrosoft Surface Laptop (13-inch): It’s compact, solidly built and great for travel, but the 13.8-inch version is the better choice as your daily driver.\nDell 14 Plus: Skip the two-in-one and opt for the clamshell laptop I tested, when it goes on sale.\nAcer Swift Go 16 (2025): Built around a beautiful 16-inch OLED screen, the latest Swift Go 16 improves on its predecessors without significant price inflation.\nDell 16 Plus 2-in-1: This big-screen, mini-LED convertible laptop certainly has some positives, but there are a few too many negatives to give this Plus a full-throated recommendation.\nLenovo ThinkPad X1 Carbon Gen 13 Aura Edition: It’s a great business laptop, but it can get pricey fast with upgrades.\nAcer Swift 14 AI: This midrange Copilot Plus PC offers incredible battery life but is missing one key feature.\nHP EliteBook X G1a: X does not mark the spot for this biz laptop when the Ultra version costs roughly the same and supplies a far better display inside a slimmer, more compact design.\nLenovo Yoga Slim 9i 14 Gen 10: It's ultrastylish and ultracompact, but maybe don't hide the camera behind the display next time?\nAcer Chromebook Plus 516: The 16-inch display provides plenty of room to work but Acer has a similar model that offers more for less.\nHP Pavilion Plus 14 (2025): Parts of the HP Pavilion Plus 14 are great but there's one poor-quality feature that totally ruins the experience.\nAcer Swift 16 AI: It's thin. It's light. It's long-running. And it boasts a big, bright 16-inch OLED display. So what's holding this Copilot Plus PC back from being more than just a big-screen productivity machine?\nHow we test laptops\nThe review process for laptops consists of two parts: performance testing under controlled conditions in the CNET Labs and extensive hands-on use by our reviewers. This includes evaluating a device's aesthetics, ergonomics and features with respect to price. A final review verdict is a combination of both objective and subjective judgments.\nWe test all laptops with a core set of benchmarks, including Primate Labs Geekbench 5 and 6, Cinebench R23, PCMark 10, a variety of 3DMark benchmarks (whichever can run on the laptop), UL Procyon Photo and Video (where supported) and our own battery life test. If a laptop is intended for PC gaming, we'll also run benchmarks from Guardians of the Galaxy, The Rift Breaker (CPU and GPU) and Shadow of the Tomb Raider.\nFor the hands-on, the reviewer uses it for their work during the review period, evaluating how well the design, features (such as the screen, camera and speakers) and manufacturer-supplied software operate as a cohesive whole. We also place importance on how well they work given their cost and where the manufacturer has potentially made upgrades or tradeoffs for its price.\nThe list of benchmarking software and comparison criteria we use changes over time as the devices we test evolve. You can find a more detailed description of our test methodology on our How We Test Computers page.\nBest time to buy a laptop\nAmazon Prime Day is a great time to find a laptop at a great price, and you might be able to nab some remaining Prime Day deals from last week's big event.\nOther times of the year when you can find the best laptop deals are during back-to-school sales in late summer or early fall and a bit later in the year during Black Friday and Cyber Monday sales. You can find discounts on laptops throughout the year but, if you're looking for the best deal and can afford to wait, these are typically the best times to buy one.\nBest laptop brands\nApple’s MacBooks are the most popular laptops and for good reason. They offer excellent build quality and leading performance and battery life ever since Apple introduced its M series processors in 2020.\nThe top two brands on the Windows side are Lenovo and HP. Both offer a wide variety of models, from thin-and-light ultraportables to larger, more powerful models for gaming content creation. Lenovo’s ThinkPads have long been a favorite among business laptops and its Yoga models are usually highly rated two-in-one laptops.\nHP is in the middle of a branding transformation. It's ended its Pavilion, Envy and Spectre laptop brands in favor of OmniBook consumer models and EliteBook business models. Its Omen brand will continue as the home for its gaming laptops. I liked the first OmniBook laptop I reviewed and look forward to testing more.\nFor a budget laptop, Acer and Apple have great options -- each dominates our best budget laptop list. Acer makes great low-cost laptops and budget gaming laptops and Apple's MacBook Air can usually be found for less than $1,000 where it's a great deal. And the older M1 model costs even less.\nFactors to consider when shopping the best laptops\nThere are a ton of laptops on the market at any given moment and almost all of those models are available in multiple configurations to match your performance and budget needs. If you're feeling overwhelmed with options when looking for a new laptop, it's understandable. To help simplify things for you, here are the main things you should consider when you start looking.\nPrice\nThe search for a new laptop for most people starts with price. If the statistics that chipmaker Intel and PC manufacturers hurl at us are correct, you'll be holding onto your next laptop for at least three years. If you can afford to stretch your budget a little to get better specs, do it. That stands whether you're spending $500 or more than $1,000. In the past, you could get away with spending less upfront with an eye toward upgrading memory and storage in the future. Laptop makers are increasingly moving away from making components easily upgradable, so again, it's best to get as much laptop as you can afford from the start.\nGenerally speaking, the more you spend, the better the laptop. That could mean better components for faster performance, a nicer display, sturdier build quality, a smaller or lighter design from higher-end materials or even a more comfortable keyboard. All of these things add to the cost of a laptop. I'd love to say $500 will get you a powerful gaming laptop, for example, but that's not the case. Right now, the sweet spot for a reliable laptop that can handle average work, home office or school tasks is between $700 and $800 and a reasonable model for creative work or gaming is upward of about $1,000. The key is to look for discounts on models in all price ranges so you can get more laptop capabilities for less.\nOperating system\nChoosing an operating system is part personal preference and part budget. For the most part, Microsoft Windows and Apple's MacOS do the same things (except for gaming, where Windows is the winner), but they do them differently. Unless there's an OS-specific application you need, go with the one you feel most comfortable using. If you're not sure which that is, head to an Apple store or a local electronics store and test them out. Or ask friends or family to let you test theirs for a bit. If you have an iPhone or iPad and like it, chances are you'll like MacOS, too.\nIn price and variety (and PC gaming), Windows laptops win. If you want MacOS, you're getting a MacBook. Apple's MacBooks regularly top our best lists, the least expensive one is the M1 MacBook Air for $999. It is regularly discounted to $750 or $800, but if you want a cheaper MacBook, you'll have to consider older refurbished ones.\nWindows laptops can be found for as little as a couple of hundred dollars and come in all manner of sizes and designs. Granted, we'd be hard-pressed to find a $200 laptop we'd give a full-throated recommendation to but if you need a laptop for online shopping, email and word processing, they exist.\nIf you are on a tight budget, consider a Chromebook. ChromeOS is a different experience than Windows; make sure the applications you need have a Chrome, Android or Linux app before making the leap. If you spend most of your time roaming the web, writing, streaming video or using cloud-gaming services, they're a good fit.\nSize\nRemember to consider whether having a lighter, thinner laptop or a touchscreen laptop with a good battery life will be important to you in the future. Size is primarily determined by the screen -- hello, laws of physics -- which in turn factors into battery size, laptop thickness, weight and price. Keep in mind other physics-related characteristics, such as an ultrathin laptop isn't necessarily lighter than a thick one, you can't expect a wide array of connections on a small or ultrathin model and so on.\nScreen\nWhen deciding on a screen, there are a myriad number of considerations: How much you need to display (which is surprisingly more about resolution than screen size), what types of content you'll be looking at and whether you'll be using it for gaming or creative work.\nYou really want to optimize pixel density; that is, the number of pixels per inch the screen can display. Although other factors contribute to sharpness, a higher pixel density usually means a sharper rendering of text and interface elements. (You can easily calculate the pixel density of any screen at DPI Calculator if you don't feel like doing the math, and you can also find out what math you need to do there.) I recommend a dot pitch of at least 100 pixels per inch as a rule of thumb.\nBecause of the way Windows and MacOS scale for the display, you're frequently better off with a higher resolution than you'd think. You can always make things bigger on a high-resolution screen, but you can never make them smaller -- to fit more content in the view -- on a low-resolution screen. This is why a 4K, 14-inch screen may sound like unnecessary overkill but may not be if you need to, say, view a wide spreadsheet.\nIf you need a laptop with relatively accurate color that displays the most colors possible or that supports HDR, you can't simply trust the specs -- not because manufacturers lie, but because they usually fail to provide the necessary context to understand what the specs they quote mean. You can find a ton of detail about considerations for different types of screen uses in our monitor buying guides for general purpose monitors, creators, gamers and HDR viewing.\nProcessor\nThe processor, aka the CPU, is the brains of a laptop. Intel and AMD are the main CPU makers for Windows laptops, with Qualcomm as a new third option with its Arm-based Snapdragon X processors. Both Intel and AMD offer a staggering selection of mobile processors. Making things trickier, both manufacturers have chips designed for different laptop styles, like power-saving chips for ultraportables or faster processors for gaming laptops. Their naming conventions will let you know what type is used. You can head to Intel's or AMD's sites for explanations so you get the performance you want. Generally speaking, the faster the processor speed and the more cores it has, the better the performance will be.\nApple makes its own chips for MacBooks, which makes things slightly more straightforward. Like Intel and AMD, you'll still want to pay attention to the naming conventions to know what kind of performance to expect. Apple uses its M-series chipsets in Macs. The entry-level MacBook Air uses an M1 chip with an eight-core CPU and seven-core GPU. The current models have M2-series silicon that starts with an eight-core CPU and 10-core GPU and goes up to the M2 Max with a 12-core CPU and a 38-core GPU. Again, generally speaking, the more cores it has, the better the performance.\nBattery life has less to do with the number of cores and more to do with CPU architecture, Arm versus x86. Apple’s Arm-based MacBooks and the first Arm-based Copilot Plus PCs we’ve tested offer better battery life than laptops based on x86 processors from Intel and AMD.\nGraphics\nThe graphics processor handles all the work of driving the screen and generating what gets displayed, as well as speeding up a lot of graphics-related (and increasingly, AI-related) operations. For Windows laptops, there are two types of GPUs: integrated (iGPU) or discrete (dGPU). As the names imply, an iGPU is part of the CPU package, while a dGPU is a separate chip with dedicated memory (VRAM) that it communicates with directly, making it faster than sharing memory with the CPU.\nBecause the iGPU splits space, memory and power with the CPU, it's constrained by the limits of those. It allows for smaller, lighter laptops, but doesn't perform nearly as well as a dGPU. There are some games and creative software that won't run unless they detect a dGPU or sufficient VRAM. Most productivity software, video streaming, web browsing and other nonspecialized apps will run fine on an iGPU.\nFor more power-hungry graphics needs, like video editing, gaming and streaming, design and so on, you'll need a dGPU; there are only two real companies that make them, Nvidia and AMD, with Intel offering some based on the Xe-branded (or the older UHD Graphics branding) iGPU technology in its CPUs.\nMemory\nFor memory, I highly recommend 16GB of RAM (8GB absolute minimum). RAM is where the operating system stores all the data for currently running applications and it can fill up fast. After that, it starts swapping between RAM and SSD, which is slower. A lot of sub-$500 laptops have 4GB or 8GB, which in conjunction with a slower disk can make for a frustratingly slow Windows laptop experience. Also, many laptops now have the memory soldered onto the motherboard. Most manufacturers disclose this but if the RAM type is LPDDR, assume it's soldered and can't be upgraded.\nSome PC makers will solder memory on and also leave an empty internal slot for adding a stick of RAM. You may need to contact the laptop manufacturer or find the laptop's full specs online to confirm. Check the web for user experiences because the slot may still be hard to get to, it may require nonstandard or hard-to-get memory or other pitfalls.\nStorage\nYou'll still find cheaper hard drives in budget laptops and larger hard drives in gaming laptops but faster solid-state drives have all but replaced hard drives in laptops. They can make a big difference in performance. Not all SSDs are equally speedy, and cheaper laptops typically have slower drives; if the laptop only has 4GB or 8GB of RAM, it may end up swapping to that drive and the system may slow down quickly while you're working.\nGet what you can afford and if you need to go with a smaller drive, you can always add an external drive or two down the road or use cloud storage to bolster a small internal drive. The one exception is gaming laptops: I don't recommend going with less than a 512GB SSD unless you really like uninstalling games every time you want to play a new game.\nFrequently asked questions\nHow much money should I spend on a laptop?\nJudging from the current selections on our list, I recommend spending $600 or more for a midrange laptop and at least $1,000 and probably closer to $2,000 on a gaming laptop. We’ve already seen price hikes on many laptop models since the Trump tariffs began earlier this year. Acer's Jason Chen said in February that the company would raise its prices by 10% in anticipation. \"We will have to adjust the end user price to reflect the tariff,\" the CEO of the Taiwan-based company said.\nThe Trump administration has eased up somewhat on its tariffs against China, dropping the overall rates from 145% to 30% for 90 days, while trade negotiations continue. While this temporary cut may help prevent further price increases, I haven’t seen any price reductions outside of sales. And if you are patient, you can usually find the model you want on sale. Laptop vendors and online retailers are constantly rotating sales so it pays to keep an eye on pricing and buy during a dip. During the summer, check out laptop sales for dads and grads and then back-to-school sales.\nWhich is better: MacOS or Windows?\nDeciding between MacOS and Windows laptops for many people will come down to personal preference and budget. Apple's base model laptop, the M1 MacBook Air, starts at $999. You can sometimes find it discounted or you can get educational pricing from Apple and other retailers. In general, it'll be at least $1,000 for a new MacBook and the prices just go up from there.\nFor the money, you're getting great hardware top to bottom, inside and out. Apple recently moved to using its own processors, which resulted in across-the-board performance improvements compared to older Intel-based models. The company's most powerful laptop, the 16-inch MacBook Pro, still hasn't been updated to Apple silicon.\nAgain, that great hardware comes at a price. Also, you're limited to just Apple laptops. With Windows and Chromebooks (more on these below), you get an amazing variety of devices at a range of prices.\nSoftware between the two is plentiful so unless you need to run something that's only available on one platform or the other, you should be fine to go with either. Gaming is definitely an advantage for a Windows laptop.\nMacOS is also considered to be easier and safer to use than Windows, especially for people who want their computers to get out of the way so they can get things done. Over the years, Microsoft has done its best to follow suit and, with Windows 11 here, it's trying to remove any barriers. Also, while Macs might have a reputation for being safer, with the popularity of the iPhone and iPad helping to drive Mac sales, they've become bigger targets for malware.\nAre there any laptop accessories I might need?\nIf you plan to travel with your laptop, whether across campus or the country, a good laptop backpack is essential. There are a lot of subpar backpacks out there, so check our best laptop backpacks list for our recommendations based on hours and hours of testing.\nAnd for when you aren’t on the move but at your desk and ready to work, a laptop cooling pad can help your laptop run smoothly. From gaming and video editing to just having dozens of Chrome tabs open, there are times when your laptop needs some help to stay cool and maintain full performance. Our sister site ZDNet has a good list of the best laptop cooling pads.\nAre Chromebooks worth it?\nYes, they are, but they're not for everyone. Google's Chrome OS has come a long way in the 10-plus years since they arrived and Chromebooks -- laptops that run on Chrome OS -- are great for people who do most of their work in a web browser or using mobile apps. They are secure, simple and, more often than not, a bargain. What they can't do is natively run Windows or Mac software."
    },
    {
      "url": "https://www.cnet.com/health/fitness/best-smart-scale/",
      "text": "Tracking your weight is a good starting point if you’re focused on improving your health. However, it is just one part of the equation. You should invest in a smart scale to help you measure body fat, muscle mass and heart rate. These metrics will give you a more complete picture of your health. As CNET’s fitness expert, my role is to offer honest, informative and helpful fitness advice and content in a world of misinformation. That’s why I tested top-rated smart scales for over two weeks, comparing their results with recent readings from my doctor and tracking consistency with daily weigh-ins. These are the models that stood out for their accuracy, features and overall value.\nOur Picks\nFITNESS TRACKER DEALS OF THE WEEK\n- $199 (save $101)\n- $190 (save $110)\n- $110 (save $50)\nWhat is the overall best smart scale?\nBecause most of these smart scales offer different options for different preferences, we decided not to pick a best-overall option. Each smart scale has unique (and some similar) qualities that fit your specific needs, whether you're an athlete or someone who monitors their weight occasionally.\nBest smart scales for 2025\nPros\n- Affordable at under $50\n- Stylish for any bathroom\n- Easy to use\n- Suitable for various weights and people with 400-lb capacity\nCons\n- App could give more information\n- It could have more integrated apps\n- Not ideal for those who want a scale that connects to Wi-Fi\nWhat we like about it: The Wyze Scale X is the most versatile scale on the list because it can weigh adults, babies, pets and even luggage. The scale’s face is made of smooth tempered glass and it's conveniently lightweight and thin, so it can be stored easily. It has a weight capacity of 400 pounds, so people of various sizes can comfortably use it.\nYou can create up to eight profiles and customize them accordingly. This scale can read up to 13 body composition metrics, including body fat percentage, basal metabolic rate, metabolic age, muscle mass, body mass index and heart rate. The Wyze scale was consistent through every weigh-in when I tested it. It provides quick readings, but the LED display panel only shares your weight and body fat percentage. In the Wyze app, you can find the rest of the body composition metrics. Overall, I liked this scale because it is customizable for the whole family, has an easy-to-read app and is inexpensive for all that it offers.\nWho it’s best for: This scale is best if you're looking for something customizable based on the members of your household using it, plus other features. You can customize your profile based on your gender, age, height and activity level. If you're pregnant or have an implanted device, you can turn on the pregnancy or weight-only mode. The Wyze Scale also connects to integrated apps like Apple Health, Fitbit and Google Health Connect.\nThe Wyze app is unique in that it can read your heart rate. Other scales have heart rate built into the software, whereas Wyze measures your heart rate by connecting to the smartphone camera and having you place your finger over the lens to get a reading. If you care about having access to your health data, you can export it if you need to share it with your doctor or another health practitioner.\nWho shouldn’t get it: If you want a smart scale with a reliable app, this one may not be the best choice. I thought the app could do a better job of explaining the purpose of each measurement but it does give you a synopsis for each one as you click through. It also provides a rubric with which range you fall in but it's not clear whether that means you're in a healthy range. If you prefer a rechargeable scale, you may find it a nuisance that this one is battery-powered only.\nPros\n- App interface is user-friendly\n- Reads data quickly\n- Inexpensive at under $45\n- Unlimited user profiles\nCons\n- Doesn't look as high-end as other smart scales\n- Not suitable for pregnant people or those with implanted devices\nWhat we like about it: This scale from Renpho is the best option if you're looking for a user-friendly smart scale app. I liked how easy it is to connect to the Renpho app and its interface because although it's simple, the design shows all 13 body composition measurements clearly. Upon weighing yourself, the only metrics this scale displays are your weight, body fat percentage and BMI. You can also view your measurement trends in the form of a line graph across a week, month or year. If you'd like to sync your Renpho scale with third-party apps, you can connect it to Apple Health, Fitbit App, Google Health Connect and Samsung Health. I found the weigh-ins with the Renpho scale to be repeatedly consistent throughout the two-week testing period.\nThe scale uses Wi-Fi and Bluetooth, which is helpful because it means you can save your data in Wi-Fi mode and sync it up later via Bluetooth. This sleek, black design doesn't look as fancy as the other high-end scales on the list, but it's the right size to store in your bedroom or bathroom.\nWho it’s best for: This scale from Renpho is the best option if you want a user-friendly smart scale app. Smart scales can get complicated fast, but Renpho keeps things simple. The scale uses Wi-Fi and Bluetooth, which is helpful because it means you can save your data in Wi-Fi mode and sync it up later via Bluetooth. This sleek, black design doesn't look as fancy as the other high-end scales on the list but it's the right size to store in your bedroom or bathroom. You’ll also get unlimited profiles if there are going to be multiple users -- including infants -- in your home.\nWho shouldn’t get it: It's battery-powered, so if you want a rechargeable scale, this may not be the best choice for you. It's important to note that, unlike most of the other scales on this list, this one doesn't have a mode for pregnant people or those with implanted devices.\nPros\n- Accurate weight tracking with consistent readings\n- Seamless design\n- Syncs with popular fitness apps like Apple Health, Fitbit and Google Fit\n- Multi-user friendly\n- Made with recycled material\nCons\n- No Wi-Fi connectivity\n- Fingerprints are visible on the glass after use\nWhy we like it: The recently launched Homedics Luxe Smart Scale is one of the most accurate (and stylish) smart scales I've tested. It has a sleek, minimalist design that I like -- no clunky electrodes sticking out, just a smooth tempered glass platform that works well with any decor. Once you step on it, you get a quick weight reading on the bright LED display. Whether you're tracking your fitness journey or keeping tabs on your health, this is a great smart scale for anyone.\nWho it’s best for: If you want a foolproof scale that can be used by multiple people in your home, this is the best pick. This smart scale has multi-user recognition -- it automatically identifies different users and includes a special mode for babies and athletes.\nThe Homedics Luxe Smart Scale offers advanced body composition tracking beyond your weight and BMI. It also measures 13 essential body metrics such as body fat percentage, muscle mass, visceral fat and metabolic age. You can sync the scale with the Homedics Scales app, which tracks your trends over time and integrates your data with Apple Health, Fitbit and Google Fit.\nWho shouldn’t get it: This scale is one of the more expensive selections on this list, priced at $100. It’s also battery-powered instead of rechargeable, which some people may not prefer. If you’re looking for something simpler without all the extra body metrics, you can opt for a scale like the Greater Goods Premium Wi-Fi scale.\nPros\n- High-resolution display screen is easy to read\n- The app is easy to use and sync up to the scale\n- Safe for pregnant people and those with implanted devices\n- Unlimited profiles can be created\nCons\n- Expensive at $80\n- Some extra data like weather and temperature don't seem necessary\nWhy we like it: It may not seem like a big deal, but the way a scale shows readings on its display screen can make or break your experience. This is especially true if you have vision issues or are tall and would like your scale to have larger fonts for easier reading. Etekcity's HR Smart Fitness Scale has the best display screen because the high-resolution graphics make it easy to read your weight and it depicts a custom set of key measurements on the screen (so you don't have to go to the app every time). This scale connects via Wi-Fi and Bluetooth and is easy to set up when you download the Vesync app. In the app, you can set up unlimited user profiles and customize each one.\nWho it’s best for: This scale is best for the user who wants a scale with an easy-to-read screen that’s safe for everyone to use. This smart scale has a 400-pound weight capacity and can also be used in Zero-Current mode, which only reads your weight and BMI and is user-friendly for pregnant people and those with implanted devices like a pacemaker. It also has a baby mode, intended to weigh infants and pets.\nWho shouldn’t get it: If extra data on your weight triggers unhealthy reactions, you can opt for a standard scale that doesn’t provide this type of information. Some people like having this information at their fingertips, but it isn’t for everyone.\nPros\n- Scale stays true to basic readings with 4 sensors\n- It uses Wi-Fi connection\nCons\n- App interface leaves more to be desired\n- Lacks Bluetooth\n- Lacks customization\n- Not suitable for pregnant people or those with implanted devices\n- Lacks customization\n- Not suitable for pregnant people or those with implanted devices\nWhy we like it: The Greater Goods Premium Wi-Fi scale fits the bill for a smart scale that can provide basic readings. It's made up of white tempered glass so it looks sleek and blends in with most bathroom settings. The design works well with the blue backlit LCD screen. What I liked about this scale is that the display screen has a dial that lights up and goes around until it properly calculates your weight. On the same screen, it displays your muscle mass, body fat percentage, bone mass, BMI and water weight in a smaller font.\nWho it’s best for: If you like a simple scale with basic readings, this is your best pick. This Wi-Fi scale fits the bill for a smart scale that can provide basic readings. This scale can hold up to 400 pounds and uses four sensors to give you accurate results. If you’re looking for a scale that gives you the basic and important information you want and need, you can’t go wrong with this selection.\nWho shouldn’t get it: Setting up this scale was more challenging than I expected because I had to troubleshoot to make sure it was synced up to my Wi-Fi (this scale doesn't use Bluetooth). Once the scale and Weight Gurus app were synced up, it was simple to use and the results were consistent during the two-week testing period. A few times, I had issues uploading data to the app. Eventually, this issue fixed itself, but it could be because my router wasn't close to the bathroom where I was weighing myself.\nIf you’re detail-oriented, this scale is very limited. The only metrics you'll find besides your weight are BMI, body fat, muscle mass and water weight percentage. The downside is that you can't click through each metric, nor does it give you an explanation of each one. The most you can do on the app is set a goal to lose, gain or maintain your weight and view it on a dot graph over a week, month or year. I think this scale could be improved by at least providing an explanation for each metric it provides.\nPros\n- Unlimited profiles for the family\n- Good for body recomposition\n- App interface is user-friendly\nCons\n- App rubric may be inconsistent with results\nWhy we like it: The scale display has big numbers for easy reading, and the screen also shows your body fat percentage and heart rate. When you open up the app, you're greeted with a customizable 3D cartoon model of yourself. The app displays your scale readings next to the rotating 360-degree 3D model. As you click through the data, you'll see a detailed list of other measurements including muscle mass, bone mass, lean body mass, skeletal muscle mass and more.\nI liked that the app gives you a practical approach to body recomposition, if that's your goal. Instead of focusing on the number on the scale, you can use the measuring tape provided with the scale to get your measurements and manually input them in the app. This is a helpful way to track changes that the scale may not be able to properly read. If you're looking for a scale that allows you to have unlimited profiles and a user-friendly interface, you'll like the Eufy Smart Scale P2 Pro.\nWho it’s best for: Many scales have a limited number of users on their platform but the Eufy Smart Scale P2 Pro is set up for unlimited profiles. The Renpho, Etekcity and Sportneer smart scales also allow unlimited users, but the Eufy smart scale has a better way of displaying each person's results via its app interface.\nOnce you download the Eufylife app, setup is easy, and the scale has Wi-Fi and Bluetooth connectivity. You can then set up specific profiles for the people who'll use it. This scale has a 400-pound weight capacity and can also weigh pets and babies. Additionally, there's a simple mode you can select to weigh yourself safely if you're pregnant or have an implanted device.\nWho shouldn’t get it: There were times when I had to reposition the scale on the floor because it was having a hard time setting itself to a zero reading. It’s something to consider if you’re looking for a scale that gives you an accurate reading each time. I remember when the scale got temperamental, it would take me at least four tries, lifting and placing the scale on the floor until I got a zero reading.\nPros\n- Connects to hundreds of third-party apps\n- High-end look to scale\n- Uses Wi-Fi and Bluetooth\nCons\n- Not ideal for pregnant people or those with implanted devices\n- The app isn't the most user-friendly\n- The carpet feet can be flimsy\n- Lacks body composition readings\nWhy we like it: The Withings Body Plus scale is a good option if you want the ability to sync more than 100 third-party apps like Apple Health, Google Health Connect and MyFitnessPal to your scale. It's a large, sleek, mirrored glass scale that has four high-precision sensors to give you the most accurate readings. I was impressed by the number of third-party apps you could connect with the Withings Body Plus. Although the app only presents a few, you can go into the respective third-party apps and connect the scale through there as well. I stuck with connecting my Apple Health account to the scale and it uploads your step count, any workouts you've done and your heart rate.\nThe weight measurements over two weeks were consistent overall. Sometimes, they were off by a couple of ounces or a pound or two but nothing overwhelmingly different. If you like to be connected to multiple apps and want a scale that can handle all of it, you'll appreciate the Withings Body Plus scale.\nWho it’s best for: If you like having your health data synced across multiple third-party apps, this is the smart scale for you. What’s nice is it doesn’t matter if have an iPhone or Android because you can connect to Apple Health or Google Health, among other apps. So anyone in your family can connect to this scale regardless of the type of smartphone they own. I’d also recommend this scale to someone who may prefer to weigh themselves in a carpeted area because it comes with carpet feet to keep the scale even and balanced.\nWho shouldn’t get it: This may not be the ideal scale for pregnant people or those with implanted devices because it doesn't provide a specific mode that turns off electrical currents. The scale comes with carpet feet, which can be placed at the bottom of the scale on each corner. The carpet feet weren't my favorite accessory because sometimes the scale wobbled on my tiled bathroom floor and I had to reposition it until the surface felt even. Hence why it’s a better fit for a carpeted floor.\nFor the most part, the Withings Body Plus scale provided a fast reading, but at times, it lagged. The LED display screen has triangles blinking on each corner as the scale works to get a measurement. When it gathers the information, the triangles disappear and the calculated weight remains steady. Sometimes this takes longer than anticipated, but I'm not sure if it's the scale's fault or user error.\nBest Smart Scale for 2025 compared\n| Smart Scales | Display type | Weight Limit | Compatible Apps | Size | Battery life |\n|---|---|---|---|---|---|\n| Wyze Scale X | LED | 400 pounds | Apple Health, Google Fit, and Fitbit | 11.8 inches x 11.8 inches x 1.18 inches | 22 months |\n| Renpho Smart Wi-Fi Bluetooth Body Fat Scale- Premium | LED | 396 pounds | Samsung Health, Apple Health, and Google Fit | 11.1 inches x 11.1 inches x 1 inches | Battery-powered |\n| Etekcity HR Smart Fitness Scale | Wi-Fi and Bluetooth | 400 pounds | Apple Health, Google Fit, FitBit, MyFitnessPal, and Samsung Health | 11.8 inches x 1.8 inches x1.1 inches | Rechargable |\n| Greater Good Premium Wi-Fi Scale | Wi-Fi | 400 pounds | Fitbit, Apple Health, and Google Fit | 12.6 x 12.6 x 0.9 inches | Battery-powered |\n| Withings Body Plus | Wi-Fi and Bluetooth | 396 pounds | Google Fit, Apple Health, Runkeeper, Strava, Samsung Health and MyFitnessPal | 12.8 inches x 12.8 inches x 0.9 inches | 18 months |\n| Eufy Smart Scale P2 Pro | Wi-Fi and Bluetooth | 400 pounds | Apple Health, Google Fit, and Fitbit | 11.8 inches x 1.8 inches x1.1 inches | Rechargable |\n| Homedics Luxe Glo Scale | LED | 400 pounds | Apple Health, Google Fit and Fitbit | 11.8” x 11.8” with 5mm tempered glass | Battery powered, 4 AAA batteries included |\nHow we tested the best smart scales\nEase of use: I looked at how easy it is to sync up the scale and app using Bluetooth or Wi-Fi. Additionally, how easy it is to interpret the weight and other data provided by the scale.\nDesign: I looked at whetherthe scale is aesthetically pleasing and designed to blend into different rooms.\nConsistency: I looked atweight across the board for two weeks and made sure it was consistent for multiple weigh-ins at the same time each day.\nApp measurements: I looked at the app interface and the measurements provided, as well as how detailed and easy it is to access and read.\nOther smart scales tested\nFitTrack Dara BMI Smart Scale: I wanted to give this smart scale a chance because it had the most body composition measurements, but it never functioned properly when I weighed myself. The only data it provided was my weight, but it never seemed to capture the rest.\nOmron Body Composition Monitor and Scale: I had a hard time setting this scale up. I tried troubleshooting and following the directions it came with, but to no avail.\nFactors to consider\nPrice: Consider how much you're willing to spend on a scale. Just because a scale is expensive, doesn't mean it's the best option. There are inexpensive scales that can provide the same measurements.\nFeatures: Determine if you're going to want various measurement modes such as for pregnancy, pets or children.\nAccuracy: Smart scales aren't always accurate and the only way to get the most precise measurement is through a DEXA (or DXA) scan. Consult with a medical professional if you're interested in this data.\nElectrical currents: If you wear a pacemaker or implanted medical device, make sure the scale offers an option to shut off electrical currents. Currents sent by scale are generally safe, but they can potentially interfere with the device and ruin it.\nWeight limit: It's important to consider the weight capacity on a scale since you want to make sure it can handle various weights. This is also something to consider if you are pregnant and want to safely weigh yourself.\nBody image: If you struggle with body image or are recovering from an eating disorder, consider discussing with your doctor if owning a smart scale is the right choice for you. It's also helpful to know that some scales don't show you your weight or have a similar mode setting.\nApp compatibility: If you'd like to sync up the scale to shared apps, make sure your app of choice is compatible with the scale.\nConnectivity: Decide if you'd like your smart scale to connect to Wi-Fi, Bluetooth or both. Some allow both connections, while others only allow one.\nUser-friendly interface: Choose a smart scale that has an interface that's easy to read and follow. This will also be helpful if there will be multiple users.\nDurability: Choose a smart scale that is long-lasting and can handle multiple recharges or battery changes. If you're concerned about your scale breaking down too soon, make sure you know its warranty.\nPrivacy policy: If privacy is of concern, make sure you read the privacy policy of the smart scale you plan to purchase first.\nBattery life: Whether you're going to use the scale often or occasionally, you want a smart scale with decent battery life that doesn't require constant recharging.\nBest smart scale practices\nWeigh yourself at the same time: To get a consistent reading when using any scale, it's important to weigh yourself first thing in the morning before you've drunk or eaten anything. \"You should weigh yourself without clothes, or minimal clothing, and if you do so, try to wear the same clothing each time you weigh yourself,\" said Stella Lucia Volpe, professor and head of the Department of Human Nutrition, Foods and Exercise at Virginia Tech.\nVolpe recommends weighing yourself no more than once a week. \"If you weigh yourself more than that, you will see fluctuations in your body weight, and it may be frustrating if you are trying to lose weight,\" she said.\nChoose an even surface: You want to make sure your scale is on an even surface otherwise that imbalance will throw off the reading. Make sure to weigh yourself in the same place each time.\nKeep in mind that the smart scale can be flawed: Remember that just because a smart scale can offer more data than an analog scale doesn't always mean it's better. \"Smart scales have not been shown to have high accuracy and cannot be compared to the 'gold standard' measures of assessing bone mineral density and body composition as it relates to body fat and lean body mass, which is via using dual-energy X-ray absorptiometry,\" said Volpe.\nMost people don't have access to a Dexa scan, so the next best thing is a smart scale. \"The smart scale can provide an estimation of body fat and total body water; but note that the 'gold standard' ways to measure these would provide the more accurate data,\" Volpe explains.\nMake sure it's set to zero: As with any scale, you want to make sure that it's set to zero so you get an accurate reading.\nRemember your weight fluctuates: It's easy to get caught up in a number, but remember your weight is a range instead of an exact number and will fluctuate throughout the day. Fluctuations can be affected if you work out, eat more than normal, go to the bathroom or even if your muscles are sore and retaining fluid.\nKnow that the data are estimations: Smart scales include data on your heart rate, bone mineral density, total body water, body fat and more. Keep in mind these are estimations based on your age, sex and body weight. Therefore, these scales are not completely accurate. \"Knowing that these scales are providing an estimation -- but without the highest of accuracy -- is important, but can help provide some guidance to the user of these products, especially when many individuals may not have the ability to have their bone mineral density and body composition evaluated by DXA,\" said Volpe."
    },
    {
      "url": "https://www.cnet.com/tech/services-and-software/what-is-gemini-everything-you-should-know-about-googles-ai-tool/",
      "text": "Ever since ChatGPT first made waves in late 2022, tech companies have been racing to make their mark in generative AI. Google, long a powerhouse in artificial intelligence, has centered its efforts on its Gemini system.\nLaunched in December 2023 by Google DeepMind and updated to Gemini 2.0 in December 2024, this next-generation model has been integrated across a range of Google products, including Google Search and Workspace and Pixel phones as well, making these tools smarter and more responsive and intuitive.\nSo what is Gemini? It's a large language model developed to understand and generate text that is similar to what a human might write. It was designed to integrate advanced AI into everyday user interactions and complex enterprise solutions. You can interact with Google's LLM via the Gemini chatbot on the web or via mobile app.\nGemini has four models: Ultra, Pro, Flash and Nano, each designed for different use cases. One new standout feature is its expanded token context window, which allows for more extended and coherent responses. Gemini 1.5 Flash now offers a 1 million token window, while the 1.5 Pro model pushes that to a whopping 2 million. In comparison, ChatGPT caps at 32,000 tokens in the expanded version.\nIf you haven't yet developed a soft spot for everything AI-related and all of this sounds confusing, keep on reading.\nAI terminology: LLMs, generative AI, chatbots, tokens\nGenerative AI (or gen AI) refers to AI systems that can create content — think text, images or even music — based on the data they've been trained on. LLMs like Gemini are a type of generative AI. They learn from massive datasets of text and code and then use that knowledge to understand and generate human-like text.\nYou've likely interacted with an LLM before, whether through an online customer service chatbot, or ChatGPT itself.\nThese chatbots use LLMs to engage in real-time conversations, provide you with information and solve problems — though sometimes, they miss the mark and give some weird answers. That is called AI hallucinations. And Google had its fair share of mishaps with them. But more on this later.\nTokens are the building blocks of text that AI models use to process language. When AI reads and generates text, it breaks everything into small chunks called tokens. These can be whole words, parts of words or even punctuation. For example, in the sentence \"Hello, world!\" the AI might treat \"Hello\" and \",\" as separate tokens.\nSo when we talk about token limits, we're talking about how much the AI can \"remember\" from the conversation to keep things coherent and relevant.\nOne thing to keep in mind: as with any new technology, Gemini is still under development, and artificial intelligence continues to improve practically daily.\nGemini on Pixel Phones and Google Search\nSo how does Gemini play into the devices you use every day? For starters, it's built right into Google's Pixel phones.\nIf you've used your Pixel to transcribe a voice message or generate a quick email response, that's Gemini doing its magic in the background. It basically helps Pixel get things done faster and more intuitively.\nGemini also plays a big role in AI Overviews in Google search results. If you've noticed more detailed, contextually rich answers popping up at the top of your searches, that's because of this integration. Gemini helps break down complicated topics into bite-size explanations.\nGoogle came under fire for some bizarre advice AI Overviews threw out to users at its launch, including things like suggesting people eat rocks daily and or put glue in pizza recipes. The company quickly made some fixes.\nAll users in the US aged 13 and older who manage their own Google accounts can access AI Overviews. In other countries, such as the UK, India, Mexico, Brazil, Indonesia and Japan, users aged 18 and above can also access this feature. Google plans to continue expanding it globally, with the goal of reaching over a billion users by the end of 2024.\nNow some people don't like this feature, and the downside is you can't disable AI Overviews. However, we've covered a few workarounds that might help with that.\nFixing the infamous image generation fiasco with new launches\nWhen Gemini first launched, it didn't take long for things to go sideways. Google faced criticism over some hallucinations and how it depicted historical figures and different races. It made headlines for showing Black and Asian Nazi soldiers, which didn't go over well. Critics accused Google of trying too hard to show diversity. Google hit the brakes on Gemini's image generation, promising to clean up the mess.\nOn Aug. 28, Google announced the latest version of its text-to-image tool, Imagen 3, for Gemini Advanced, Business and Enterprise subscribers. The ability to generate images of people was on hold at that time.\nEarlier, on Aug. 13, Google launched Gemini Live for Advanced subscribers on Android devices, with plans to expand to iOS. Gemini Live offers hands-free, real-time conversations with 10 new voice options, even when the app is in the background or your phone is locked. You can also pause and resume conversations whenever you want, which is a neat feature.\nPricing and access\nGemini is free as a personal AI assistant, offering access to the 1.5 Flash model with a 32,000 token context window — perfect for long, back-and-forth conversations. But for more advanced features, Gemini has a few subscription plans:\n- Gemini Advanced with 1.5 Pro model: $20 per month.\n- Gemini Business: $20 per user monthly on an annual plan or $24 if paid monthly.\n- Gemini Enterprise: $30 per user monthly on an annual plan, with custom pricing through Google's sales team.\nFor developers and businesses, Google has set up a tiered pricing structure for its Gemini API models, like Flash and Pro. Developers can access them through Google Cloud's API services and integrate AI capabilities directly into applications.\nBoth models offer scalable AI usage, with pricing and rate limit differences based on the tier and token length. You can check detailed pricing rates on Google's official website. There's also a free tier, giving you a taste with limited usage — great for testing the waters before diving in.\nRead on to check out CNET's full review of Gemini."
    },
    {
      "url": "https://www.cnet.com/health/sleep/best-mattresses/",
      "text": "From hot sleepers to people with back pain to couples, everyone has different sleep needs. Luckily, there are plenty of beds out there, but you can’t just choose any bed and expect to sleep well. I've done the research and hands-on testing to help you find the best mattress for you. I’ve been testing and reviewing mattresses for years, and during that time, I’ve formed plenty of opinions on which beds are worth your money and which you should skip. Using those opinions and years of knowledge as a certified sleep scientist, I've picked out the best mattresses that will suit every type of sleeper.\nOur Picks\nMATTRESSES DEALS OF THE WEEK\n- $315 (save $56)\n- $300 (save $41)\n- $899 (save $100)\nWhat's the best mattress overall?\nWhile testing mattresses for this list, I found that the Brooklyn Bedding Signature Hybrid is the best overall mattress you can buy. It has three firmness options -- so it's great for people who prefer a firm mattress or a softer mattress -- and a durable hybrid construction, meaning anyone can sleep on this bed.\nThis bed is already priced well for the quality you get, but to make it even sweeter, Brooklyn Bedding offers generous sales that can knock a couple of hundred dollars off the retail price.\nYou might notice that the Brooklyn Bedding Signature only scores 8 out of 10. While some beds may have scored higher in testing metrics on the list, I feel that the Brooklyn Bedding Signature is the best overall mattress for the average person. It's a classic mattress that's very neutral in feel.\nWatch: Our best mattress for 2025 video overview\nWhat We Updated: July 2025\nUpdated listicle format.\nAdded Ashley Home Signature Design as the best cheap pillow-top mattress on Amazon.\nBest mattresses of 2025\nPros\n- Three firmness options mean any sleeper type will be comfortable\n- Neutral foam feel\n- Affordable for the quality at $1,332 before sales\nCons\n- Firmest option still isn’t truly firm\n- Still might be out of the price range for some\nThe Brooklyn Bedding Signature Hybrid mattress is one of the best quality beds you can get for the money.\n“When my sister asked me what my recommendation was for a comfortable and affordable hybrid bed, the Brooklyn Bedding Signature was my immediate choice. She and her dogs have slept on it comfortably for years, and she was able to save even more thanks to Brooklyn Bedding’s 30% military discount,” says Owen Poole, CNET senior video producer.\nWhy we like this bed: The flagship Brooklyn Bedding mattress is 12.25 inches tall and has a neutral foam feel that just about anyone will find comfortable. There’s plenty of support, too, thanks to the eight-inch individually-wrapped coils reinforced around the edge for increased edge support. Then two layers of foam provide plenty of pressure relief while molding to your body without sucking you in like some dense foams do. An airy topper offers a softness that memory foam just can’t achieve.\nWhile it doesn’t have all the bells and whistles like zoned support or foam-tipped coils, the Brooklyn Bedding Signature mattress is one of our favorite mattresses to recommend to people. Why? Besides the solid construction, it’s an incredibly accommodating bed. It’s available in three firmness levels: Soft (medium-soft or 3), Medium (medium or 5) and Firm (medium-firm or 7).\nWho should get this mattress: If you want a straight-to-the-point hybrid bed that’s comfortable, durable and well-priced, no need to look any further than the Brooklyn Bedding Signature mattress. It’s what most people want.\nWho shouldn’t: This Brooklyn Bedding is a great bed, but it’s not particularly advanced in additional features like cooling overs or a zoned support construction for people with back pain. I’d recommend it to the average sleeper, though not to people with specific needs.\nPros\n- Dual-coil design makes it extra durable\n- Free white glove delivery\n- Three firmness options available\n- Lifetime warranty\nCons\n- Expensive at $2,099 before sales\n- Too firm for some sleepers, especially side sleepers\n- $99 fee if you want to return it\nYou get both plush comfort and superior support with the Saatva Classic. It’s a proper luxury mattress with a hefty construction.\n“My dad lives in a rural location, and he’s getting older. He’s not the best candidate for solo unboxing of a new king-size mattress. That’s why I chose to get him a brand-new Saatva Classic for his birthday. The bed was white glove delivered right to his door: a team of professionals set it up for him and even hauled away his old bed. He’s been sleeping like a baby ever since,” says CNET Senior Video Producer JD Christison.\nWhy we like this bed: The Saatva Classic has all the essential parts that make up a classic mattress that everyone can recognize and love: a bouncy feel, an innerspring system and a comfy pillow top. That said, there is so much more going on with this bed than anything you’ve probably slept on. The construction of the 11.5-inch Saatva Classic makes it stand out. It has a dual-coil design that starts with a base layer of tempered steel coils, then comes the second layer of coils that are firmer in the center third of the bed.\nWhat I love about this bed is the classic pillow-top feel that’s responsive and easy to move around, even with the layers of memory foam underneath. You don’t sink into it because it’s so supportive, but the pillow top delivers on cushion. Not to mention, it has a 365-night trial and a lifetime warranty.\nWho should get this bed: Those who want a traditional pillow-top mattress that’s ultra supportive and you’re willing to pay for it will like the Saatva Classic. Every type of sleeper will enjoy it because you choose from three firmness options: Plush soft (medium or 5), Luxury firm (medium-firm or 7) and Firm (firm or 9). The firmest model is why it wins as the best firm mattress.\nWho shouldn’t: That said, this bed isn’t for everyone. I’d say if you’re under 150 pounds, then all the extra support features aren’t worth the money. It’s not a cheap bed, and while heavier body types will benefit from all that support, petite folks just don’t need it.\nPros\n- Responsive memory foam feel\n- Available in an all-foam or hybrid construction\n- Generous sales around holidays, I've seen up to 50% off\n- Temperature neutral\nCons\n- All-foam construction probably isn’t supportive enough for people over 230 pounds\n- Too soft for some back and stomach sleepers\nMemory foam lovers and critics alike will love the all-foam 14-inch Nectar Premier for its comfort and affordable price tag with sales. Nectar does some of the most generous sales I’ve seen.\nWhy we like this bed: The all-foam Nectar Premier is a memory foam mattress that hugs your curves as you sink into it. It reminds me of a watered-down Tempur-Pedic, though I’d classify it as a responsive memory foam feel because it’s easy to move around on. You still feel the bed cradle your form when lying down on it.\nIt hits a sweet spot of satisfying both memory foam lovers and those (like me) who don’t prefer it. We also found it to be a touch above a medium firmness, which means that any sleeping position can enjoy it. Though side sleepers who want a soft bed might find it too firm, that said, I think the average side sleeper should enjoy it. The Nectar Premier is available in an all-foam or hybrid construction. The all-foam is a simple three-layer construction: a support foam, a transition layer and a gel memory foam comfort layer.\nWho should get this bed: The Nectar Premier gives you memory foam without it being off-putting to people who don’t like how sinking and dense true memory foam can be. It’s all-around comfortable and widely accommodating. I’d recommend it to people who love memory foam or those considering trying it out for the sink-in sensation. This bed also has a 365-night trial and a forever warranty, which is as generous as it gets.\nWho shouldn’t: You don’t want this bed if you’re looking for an extreme firmness in either direction -- super firm or super soft. It’s just a tad above medium at a 6 out of 10 on our scale. Also, the Nectar Premier is not a cooling bed despite the cooling additions to keep it from trapping heat, like the top layer of therapeutic gel memory foam with ActiveCool and a textured cover. Those things are nice to see, but won’t actively cool you.\nPros\n- Thick, hybrid construction\n- Phase-changing cover\n- Responsive feel\n- My top pick for heavy people\nCons\n- Firmer than some wants\n- Not a budget choice at $1,899. Generally, Big Fig doesn't do huge markdowns either\nBig Fig is an ultra-supportive mattress designed for heavier people. This bed offers advanced support you can’t get from just any bed.\nWhy we like this bed: The Big Fig mattress offers a responsive, firm foam feel. It won’t have the sinking feel of memory foam. Make no mistake, this is a firm mattress, though it might feel a little softer depending on how much you weigh. The average person will find it around a medium-firm to firm bed, though someone over 300 pounds might think it’s more like a medium. We’d recommend it for stomach, back and combination sleepers.\nThe 13-inch construction is where the Big Fig mattress really shines. It has ultradurable steel coils encased in a foam border for edge support, then three layers of high-density poly foam. A gel-infused latex foam layer is the comfort layer below the quilted cover.\nWho should get this bed: The Big Fig is the best overall pick for heavy people because of its advanced support. People who want a responsive foam feel will like this bed, especially if they want their bed to respond immediately to their movements, rather than lag behind like memory foam.\nWho shouldn’t: Petite people don’t need this bed. While I don’t think the $1,899 queen price is unwarranted, you could get away with a much more affordable all-foam mattress, or a hybrid like the Brooklyn Bedding Signature for only $1,332 before sales. I’ll also say that side sleepers who want a soft bed won’t get it from Big Fig.\nPros\n- Only $284 for a queen is rare\n- Great quality for the price\n- Best for back, stomach or combo sleepers\nCons\n- Too firm for some side sleepers\n- Lacks additional features that other options have\nBudget doesn’t mean you have to sacrifice quality. If you need a new bed and have a tight budget, you’ll be happy to know that the Allswell is an affordable and long-lasting 10-inch mattress.\n“I’m not sure if there’s a better value online for a hybrid mattress of this quality. It’s quite nice for the price, and if you’re a heavier person on a tight budget, I couldn’t see you going wrong with this option,” says JD Christison, CNET senior video producer.\nWhy we like this bed: The Allswell mattress from Walmart is the perfect example of a budget bed that’s actually good. Despite being what we would consider “ultra-budget friendly,” it’s a supportive and bouncy hybrid mattress that’s surprisingly comfortable. It has a soft, neutral foam feel instead of a dense or syrupy memory foam feel that can be polarizing. At a medium-firm or 7, the Allswell mattress is perfect for back and stomach sleepers.\nBecause the Allswell is a budget hybrid bed, its construction is pretty straightforward. You won’t see advanced additions like zoned support or cooling covers, but that doesn’t detract from the comfort or quality. The Allswell mattress has a three-layer construction with individually wrapped coils sandwiched between layers of polyfoam. It’s finished with a soft, quilted cover.\nWho should get this bed: If you need a long-lasting, supportive bed on a budget, you’ll like the Allswell mattress. It might lack all the extra bells and whistles, but Allswell is a high-quality hybrid bed at a fraction of the cost. I can’t think of a better value on the market.\nWho shouldn’t: If you’re a strict side sleeper, the medium-firm profile might cause pressure points at the shoulders, hips and knees. So, I wouldn’t recommend it to them, especially petite body types. I’ll also add that while I like the value of this bed, it isn’t going to knock your socks off with advanced features or construction. It’s an old-school, hybrid bed that’s incredibly affordable.\nPros\n- Physically cool when you touch it\n- Multiple firmness options\n- Soft, neutral foam feel that everyone will like\n- Additional pillow top available\nCons\n- A little expensive at $2,265\n- Price isn't warranted for anyone except hot sleepers\n- No true firm option\nWhen it comes to cooling mattresses, no other brand does it as well as the Brooklyn Bedding Aurora Luxe. It’s one of the most physically cool mattresses we’ve tested.\n“As a hot sleeper, I love how I instantly can feel the cooling sensation when I lie on this mattress. If you combine this bed with light or cooling bedding, you're in good shape to decrease night sweating,” says CNET editor Caroline Igo.\nWhy we like this bed: The Brooklyn Bedding Aurora Luxe is a 13.25-inch premium hybrid mattress that actually sleeps cool at night. But this bed is more than just a cooling solution. It’s also extremely comfortable, with a neutral foam feel. The foam layers provide pressure relief, though you’re not sinking into the bed like memory foam. At checkout, you can add a pillow top to your Aurora Luxe for a softer, airy pillow-top feel.\nAnother point in this bed's favor is that it’s available in three firmness options: Soft (medium-soft or three), Medium (medium or five) and Firm (medium-firm or seven). Also, the firmest option of this Brooklyn Bedding Aurora Luxe isn’t all that firm, so if you’re looking for a truly firm bed, look elsewhere.\nThis premium mattress is five layers thick and features a mix of foam and coils. All the cooling power comes from a layer of CopperFlex foam on top and the Titan Cool cover. If you’re a hot sleeper, you’ll be hard-pressed to do better than the comfort, durability and cooling tech of the Aurora Luxe.\nWho should get this bed: If you’re a hot sleeper, this is the bed for you. The Aurora Luxe is a high-quality mattress that backs up the cooling claims. I don’t think the average person will find a more accommodating bed than this.\nWho shouldn’t: Cooling beds tend to be more expensive, and the Aurora Luxe is no exception. If you’re on a tight budget, I suggest the Cocoon Chill, our best budget cooling mattress selection.\nBest mattress for back pain\nSaatva Rx\nPros\n- Zoned support design with multiple layers of coils is good for back pain\n- Unique construction that you don't see from other beds\n- Accommodating pillow top\nCons\n- Too soft for some stomach and back sleepers\n- One firmness option available shrinks how many people can sleep on it\n- Very expensive at $3,399 for a queen\nSaatva is a brand known for making premium mattresses that are exceptionally durable and supportive. The Rx mattress was designed to alleviate back pain from conditions like scoliosis and sciatica.\nWhy we like this bed: When we tested the Saatva Rx mattress, the team found it on the softer side of medium on our firmness scale, a 4 or 5 out of 10. That firmness level will make it suitable for side sleepers, though it might be too soft for some back and stomach sleepers.\nThe Saatva Rx is a 15-inch mattress with seven layers of gel memory foam, high-density foam, and durable coils. This bed's base layer of coils includes a unique feature of what Saatva calls the “Rx foam module,” which is a foam tip on each coil. If that wasn’t enough, there is an additional layer of micro coils wrapped in high-density foam.\nWho should get this bed: People who want a softer mattress that has a construction to alleviate back pain will like the Saatva Rx.\nWho shouldn’t: The Saatva Rx mattress is softer, excellent for side sleepers with back pain or people with joint pain. However, I think many back and stomach sleepers will want something firmer. The Saatva Classic mattress is a firmer alternative that will give people with back pain all the support they need.\nPros\n- Two firmness levels in one bed\n- Great for side sleepers\n- Cooper-infused memory foam for temperature regulation\n- Airy memory foam feel isn't dense\nCons\n- Not a true budget choice at $1,699 for a queen\n- Too soft for most back and stomach sleepers\nWhy choose one firmness when you can have two in one bed? The Layla Hybrid mattress is a 13-inch flippable bed that provides both comfort and versatility to side sleepers.\n“My parents sleep on this mattress! Our team prefers the Layla Hybrid since it is a flippable bed that offers two firmness options that provide the proper support and pressure relief for side sleepers,” says Dillon Payne, CNET director of production.\nWhy we like this bed: The Layla hybrid mattress is uniquely constructed because it’s flippable. The coils are in the center of the bed, and the foam layers are stacked around them. Among the foam on either side are layers of copper-gel memory foam as the main comfort layer. It’s supposed to also help temperature regulation and keep the foam from trapping heat.\nSide sleepers need as much pressure relief as possible to ensure no painful spots develop and cause joint pain the next day. The Layla Hybrid mattress does just that. The soft side of the Layla hybrid is around medium-soft, and the firmer side is a tad above medium. Neither side is truly firm, though you will get plenty of support and comfort with the firmer side.\nThe Layla Hybrid mattress has a responsive, almost airy memory foam feel that contours your body. Not to mention, the trademark honeycomb pattern cover is super soft. I think it’s one of the only beds that looks as good as it feels.\nWho should get this bed: This bed is made for side sleepers, particularly ones looking for an airy memory foam mattress that gives you two options for firmness. While you might not flip the mattress over when you get it, there is comfort in knowing you have two chances to get it right.\nWho shouldn’t: Most stomach and back sleepers won’t get the support they need from this bed because it’s soft enough that your hips and shoulders could sink into the bed at uneven points. This would result in back pain over time. I also wouldn’t recommend this bed if you don’t care that it’s flippable.\nPros\n- Different firmness options means everyone has a model to pick\n- Base firmness is good for back and stomach sleepers\n- Made from eco-friendly materials\n- Endorsed by the American Chiropractic Association\nCons\n- An additional pillow top skyrockets the price by $1,440.\n- It's too firm for side sleepers without the pillow top\nThe Avocado Green mattress is one of the most popular beds in the organic mattress industry. It’s an 11-inch luxurious bed that uses no chemicals or glues. It has the highest number of certifications of any bed we’ve tested.\nWhy we like this bed: The Avocado Green mattress has a latex foam feel that organic beds are known for, with a firmness that’s good for back and stomach sleepers. Latex foam tends to be naturally firmer, so you won’t sink into it. It’s also highly responsive, so changing positions won’t be an issue. Based on the additional pillow top, you can choose between three firmness levels.\nThe Avocado Green mattress uses natural materials, such as GOLS-certified organic Dunlop latex and GOTS-certified organic cotton and wool. It also has a layer of recycled steel coils with a zoned support design that’s good for back pain. If you want to add the pillow top, you’ll get two inches of Talalay latex foam. Tufted rosettes add the finishing touch.\nWho should get this bed: If you want a firm organic mattress and are willing to spend the money, the Avocado Green mattress is one of the best beds you can get.\nWho shouldn’t: The base Avocado Green mattress has no pillow top. We rate it as a firm or nine on the firmness scale, which is best for stomach and back sleepers. Side sleepers can add a pillow top to make it softer. Here’s the thing about adding the pillow top: it will cost you. The medium pillow top costs $800 more, and the plush option is $1,680 more. It’s more expensive than what many people want to spend.\nPros\n- Lifetime renewal exchange for foam layers\n- Has handles that makes it easier to move\n- Hybrid construction\n- Three firmness options to choose from\nCons\n- $2,132 for a queen is expensive\n- Petite couples may not need the added support\nThe Sparrow Signature Hybrid mattress is a luxurious pillow-top bed that scores high in all the essential factors for couples: edge support, motion isolation and temperature regulation.\nWhy we like this bed: The Sparrow Signature Hybrid mattress from Nest Bedding is our pick for the best mattress for couples. It has a plush, pillow-top feel that’s like a cloud. It’s available in three firmness levels, which always score a bed extra points. What sets the Sparrow Signature Hybrid mattress as the obvious choice for the best mattress for couples is the split king size that allows you to choose a firmness for each side.\nIndividually-wrapped coils are the main support layers of this 13-inch bed. On top of that comes the high-density foam layer to mask the feeling of the coils. The main comfort layer of Energex foam is a neutral foam that’s pretty responsive. The quilted pillow top has a little bit of memory foam for added pressure relief, but it doesn’t change the feel of the bed.\nUnique to the Sparrow Signature is a lifetime renewal exchange program. Because the top comfort layers are easily removable, Nest Bedding will replace the comfort foam even after the trial period. This could change the bed's firmness or replace sagging foams from years of use, which is not something that other brands offer.\nWho should get this bed: This is a luxury mattress with a plush pillow top that anyone can sleep on. It’s a great choice for people who can’t decide what bed to get. It’s comfortable and scores high in factors that matter for sleeping with another person, like edge support and motion isolation. This bed also has a 365-night trial and a lifetime warranty.\nWho shouldn’t: I wouldn’t say anyone should avoid this bed, it’s that comfortable. However, if you want the feel of memory foam, you won’t get it from the Nest Sparrow.\nPros\n- Neutral foam feel that you expect from classic beds\n- Three height options with varying prices\n- Ultrabudget pick at only $275 for a queen\nCons\n- Off-gassing smell when we opened it\n- Not the best for heavy people\nThe Dreamfoam Doze is an ultra-budget, surprisingly supportive mattress with a neutral foam feel. It has no bells and whistles, but it’s a solid choice for the average person.\nWhy we like this bed: For being so cheap, our team was pleasantly surprised with how comfortable and supportive the Dreamfoam Doze mattress was. It has a neutral foam feel that I associate with the old-school beds that I grew up with. It’s familiar.\nThe Dreamfoam Doze is available in a 7-, 9- and 11-inch profile. The thinnest option is the most firm, and the thickest is the softest. We tested the 9-inch model and found it to be medium to medium-firm or six on the firmness scale. It should work for most sleepers, though back and stomach sleepers will probably like it more. Many side sleepers will want the 11-inch option.\nWho should get this bed: The Dreamfoam Doze is the one of the best beds you can get on a budget. It’s solid, though not fancy. It’s an excellent choice for guest rooms.\nWho shouldn’t: The Dreamfoam Doze mattress doesn’t have all the bells and whistles you get from luxury beds. It’s a straightforward budget mattress with a foam support system, transitional foam layer and quilted top. It’s not a fancy bed, but for $275, it’s not trying to be. It’s probably not the best choice for heavy folks who need added support.\nPros\n- Hybrid design that offers support\n- Comfy pillow top\n- From a known brand\n- Affordable at only $350 for a queen\nCons\n- Motion isolation was only OK, might not be good for light sleepers\n- Confusing storefront on Amazon with different beds\n- Only one firmness option\nIf you’re on a budget and want a classic innerspring bed with a comfy pillow top, look no further than the Ashley Home Signature Design Chime mattress. It’s a quality option for only $350 for a queen.\nWhy we chose this bed: The Chime mattress is an accommodating bed that has a plush, fluffy pillow top. It’s not quite as luxurious as other beds on the list, but there’s no way it would be for as cheap as it is. It’s a straightforward, comfortable bed that costs a fraction of what the other beds do. If you’re a budget shopper, this bed won’t disappoint you. It’s a proper medium, a safe firmness level for couples and combination sleepers. This is a good middle ground choice unless you want extreme firmness in either direction.\nI recommend the 12-inch model of the Chime mattress. Amazon has eight different height options, but unlike other brands, the beds are entirely different. So, to get the medium-firm mattress with a comfy pillow top, you must choose the 12-inch height I’m describing here.\nWho should get this mattress: Amazon has many cheap hybrid beds, but the Chime stands out. It’s affordable and performs better than other budget beds we’ve tested. No, it’s not going to have all the bells and whistles that more expensive beds have, but for this price, it’s hard to pass up this quality. It’s a top choice for budget shoppers.\nWho shouldn’t: The Chime mattress only performed OK in motion isolation. It doesn’t hold up super well compared to more expensive beds. While I think that won’t be a huge deal for the average person, light sleepers often woken up by their partner or pet might care. I recommend they opt for an all-foam bed that will absorb that movement. Try out the Tuft & Needle Kin mattress on Amazon.\nBest mattresses of 2025 compared: price, trial and warranty\nCompare our top picks by price and warranty information.\n| Mattress brand | Mattress type | Price (queen) | Sleep trial period | Warranty |\n|---|---|---|---|---|\n| Brooklyn Bedding Signature Hybrid | Hybrid | $1,332 | 120 nights | 10-year limited |\n| Saatva Classic | Hyrbid | $2,095 | 365 nights | Lifetime |\n| Nectar Premier | Memory foam | $1,499 | 365 nights | Forever |\n| Big Fig | Hybrid | $1,899 | 120 nights | 20-year prorated |\n| Allswell | Hybrid | $317 | 100 nights | 10-year limited |\n| Brooklyn Bedding Aurora Luxe | Hybrid | $1,865 | 120 nights | 10-year limited |\n| Saatva Rx | Neutral hybrid | $3,295 | 365 nights | Lifetime |\n| Layla Hybrid | Flippable hybrid | $1,699 | 120 nights | 10-year limited |\n| Avocado Green | Latex hybrid | $1,999 | 365 nights | 25-limited warranty |\n| Sparrow Signautre | Ply foam hybrid | $2,132 | 365 nights | Lifetime warranty |\n| Dreamfoam Doze | Neutral foam | $275 | 120 nights | 10-year limited warranty |\n| Signature Design by Ashley Furniture | Innerspring | $370 | 100 nights | Unspecified |\nBest mattress firmness data\nOur sleep team recently developed a method to measure a mattress’s true firmness: the Mattress Smasher 9000. This proprietary device and corresponding software were developed in-house by our lab technicians. It presses into the middle of the mattress and measures its firmness to score each bed on a scale of 1 to 10, with 10 being the firmest and 1 being the softest. While we also test each bed personally for perceived firmness and feel, we use data from the MS9K to complement our conclusions.\nHere's the data we learned testing the best mattresses with our Mattress Smasher 9000. Sorted from the softest beds to the firmest, here's how the mattresses scored on our firmness scale.\nHow to choose the best mattress\nIt’s easy to get lost in the industry terminology like Hyper-Elastic Polymer or zoned support and not know which bed is right for you. These things sound appealing, but not everyone will like or need every feature. The best mattress for you will suit your needs. So before you do anything, you need to consider three main points: your sleeping position, body type and budget.\nSleeping position\nHow you sleep will help you narrow down your mattress pool by firmness.\n- Side sleepers will need softer mattresses to ensure they get enough cushion for their joints.\n- Stomach and back sleepers want a firmer mattress to ensure their spine stays neutral to avoid back pain.\n- Combo sleepers have more flexibility, although they should make the call based on the position in which they spend the most time.\nYour body type\nYour body type also will help you determine which mattress you should choose. We always recommend that heavier folks go with hybrid beds for longevity.\nHow much pressure you put on a mattress will also influence how firm it feels. Heavy people who put the most pressure on mattresses will find mattresses to be softer. The inverse is true for petite body types who will find things feel firmer. We base our firmness rating of 1 through 10 from the perspective of someone weighing 150 to 230 pounds.\nWomen also have to consider breast comfort when shopping for their mattresses. Stomach sleepers need firm mattresses for spinal support, although many women find extremely firm beds painful across the chest. That’s not to say women can’t sleep on firm mattresses, although it may influence how firm of a bed you choose. Pillow tops, memory foam or padded covers can provide extra cushion to firm mattresses.\nPrice\nOnce you know what you need from your mattress, you must establish your budget. The reality is that beds are a big investment. The average online mattress costs around $1,200, although beds under $500 are available for people on a budget. Don't worry, just because they’re cheaper doesn’t mean they’re poor quality.\nA recent CNET survey found that more than half of adults are willing to spend $1,000 a year to attain better sleep -- especially those in their 20s or 30s -- and admitted to needing one or more accessories, supplements or systems to cope with sleep-related issues. With mattresses lasting longer and offering extended warranties -- every mattress in this guide includes at least a 10-year warranty, and some even come with lifetime coverage -- the cost can pay for itself quickly if it helps you cut back on pricey supplements or stop chasing the latest sleep app or gadget every month.\nHere’s another thing about mattresses: there are always mattress deals available. You should never have to buy a mattress for full price. From Memorial Day to Black Friday to every season in between, you’ll almost have access to some sort of discount.\nHow we test and rate mattresses\nOur team of sleep experts has spent years researching, testing and deconstructing over 300 mattresses. Most of our testing happens in our 6,000-square-foot mattress warehouse in Reno, Nevada. In addition to the office space where our team tirelessly compiles mattress data, there are also two mock bedrooms we use to test and film reviews in. A back room also serves as an overflow for the hundreds of mattresses the team has tested.\nTesting mattresses is a very hands-on process that involves analyzing the construction, feeling and rolling around on the beds from multiple points of view. Our team has a variety of genders, body types and sleeper positions, which allows us to give each bed a well-rounded view that we can compile into recommendations for the average person.\nFirmness and feel: Firmness and feel are some of the most subjective factors when testing mattresses. How firm a mattress feels will depend on how much pressure you put on the bed -- aka your body weight -- and this varies from person to person. We often find that our opinion on a bed’s firmness does not always match a brand’s claim.\nTo get a full view of a mattress, each person in the testing facility rates each mattress we test on firmness. Then we compare it to our data set to see where a bed falls on our firmness scale.\nDurability and construction: We can’t sleep on every mattress we test for years to test the durability (though we have done it for some). While we note the construction of a bed, we use it to inform how durable and supportive a bed will be over time. Saatva, for example, received a 10 support score during testing because of the hefty construction and dual-coil system.\nMotion isolation: When I say motion isolation, I’m referring to how well a bed can dampen movement across the surface. We test this by having multiple teammates move around and measure how much motion they can feel. Memory foam tends to perform best in this area. For example, the Nectar Premier mattress scored higher in motion isolation because the memory foam layers are superior at dampening movement compared with innerspring mattresses.\nEdge support: This one might not seem like a big deal, but edge support is important if you sleep on the edge of the bed. Think about it like how strong the bed’s perimeter is. If it caves in when we sit or lay on it, it doesn’t have good edge support and receives a score corresponding to where it falls in the data.\nTemperature: Many brands claim their mattresses are cooling, although very few are. While adding cooling technology or gel-infused foams can help regulate temperature, it doesn’t mean they are physically cool to the touch. We carefully assess each of the cooling features but differentiate between being temperature-neutral and cooling. For instance, Purple is a naturally breathable bed because of the grid construction, but we don’t consider it an actively cooling bed.\nRead more on how we test mattresses.\nOther mattresses we've tested\nWe’ve tested many other beds outside of what was included in this best mattress list. Many of them are great but didn’t quite cut earning that “best” title. Mattresses are subjective, and there’s a chance that one of these beds might work better for you.\nPurple Restore:No other mattress compares to the feel of the squishy, Hyper-Elastic Polymer that makes up the Purple Grid. When you lie on it, you feel almost buoyant. Not only does that give it a leg up in pressure relief, but it also regulates temperature well. It’s unlike any other bed I’ve tested. If you’re an adventurous sleeper who wants a widely accommodating hybrid mattress that will stand the test of time, get the Purple Restore mattress. While it’s not actively cooling, it does a surprisingly good job of pulling heat away from the body while you’re sleeping. So I’d also recommend it for hot sleepers.\nBear Original: The Bear Original is an affordable all-foam bed that’s great for people under 230 pounds who want the pressure relief of memory foam without the slow, sinking feeling. It responds faster than other memory foam beds like Nectar or Amerisleep, making changing positions much easier. This mattress falls at around a medium-firm or seven on our firmness scale. It’s definitely firmer, so some strict side sleepers may find it too hard. However, that firmness offers great spinal support to back and stomach sleepers. I wouldn’t recommend any all-foam mattress to anyone over 230 pounds. It will be fine for a while, but it will sag faster, and you won’t get as much life out of it as you want. Just go with a hybrid bed and save yourself the headache.\nHelix Sunset Luxe: The is medium-soft premium mattress is a medium-soft premium mattress that gives side sleepers all the pressure relief they want. Fans of pillow tops will love its plushness. This pillow-top mattress has a mostly neutral feel, although you just have a touch of memory foam. When lying on it, you get a little bit of the sinking-in feeling, though it doesn’t overpower the neutral pillow-top feel. We rate the Helix Sunset Luxe a medium-soft or three on our firmness scale. It’s soft and will provide plenty of pressure relief where side sleepers need it: the shoulders, hips and knees. Given it’s a soft mattress, I wouldn’t recommend it to strict back and stomach sleepers who need a firmer profile for spinal support. It's also pretty expensive.\nWinkBed: Fans of pillow-top mattresses will love the comfort and luxury of the WinkBed mattress. It’s firm enough to support stomach sleepers and has one of the most comfortable pillow tops I’ve ever tested. It has the burly presence of a classic innerspring mattress, but modern upgrades make it seriously comfortable. It’s the type of bed you would expect to see in a fancy hotel. The fluffy pillow top feels like a cloud, and the hefty construction makes it extremely supportive.\nPlank Firm Luxe: Back sleepers need a firmer mattress to ensure their spine stays in a neutral alignment at night. The Plank Firm Luxe mattress is an ultra-firm mattress with a flippable design. It offers a firm and an extra-firm side. On the extra-firm side, we rate it 10 out of 10 on our firmness scale. The name encompasses how this bed feels, like a plank with a layer of foam over it. Because it’s so firm, you won’t sink into the bed at all. That means it will be extremely responsive, so you don’t have problems moving positions. The American Chiropractic Association also endorses it. I'd advise that side sleepers stay far away from this bed.\nMattresses we're currently testing\nCNET’s sleep team is constantly testing and reviewing new mattresses behind the scenes. These are the next ones up in our process:\n- Amerisleep Organica - An organic hybrid mattress made with Talalay latex foam.\n- Novilla Mattress - An ultra-budget gel memory foam that only costs $190 for a queen.\n- Siena Mattress - This affordable mattress on Amazon is only $555 for a queen.\n- Kin by Tuft & Needle - This budget bed comes in all-foam and hybrid constructions.\nWhat are the different kinds of mattresses\nIf you’re new to online mattress shopping, one easy way to narrow down the best mattress for you is by choosing a type of bed.\nFoam mattresses are made entirely of layers of foam, whether it be polyfoam or gel foam. Each foam layer has a different density because it serves a distinct purpose in the bed. The foams with the highest density will be on the bottom because it’s the bed's structure.\nLatex foam mattresses are divided into two types: natural and synthetic. Natural and organic latex foam is hypoallergenic, antimicrobial and environmentally friendly. Synthetic latex foam is artificially made but cheaper than organic material. Either way, latex foam is durable, breathable and very bouncy. Latex beds are almost always very heavy, so having two people to move them is best.\nMemory foam mattresses are one of the most popular types because they are comfortable and excellent at isolating motion and offering pressure relief to the joints. Memory foam is often slower to respond, making it difficult to switch positions at night.\nHybrid mattresses use both foam and metal coils. They’re closest in design to the innerspring mattress most of us grew up with, but the added layers of foam do wonders for pressure relief. We recommend hybrid mattresses for people who weigh over 230 pounds.\nPillow-top mattresses have a padded layer on the top of the bed that’s often tufted to provide extra cushioning. They’re often made of wool, organic cotton or other light and airy materials.\nBuying the best mattress FAQs\nHow much should I pay for a mattress?\nHow much you should spend on your next bed depends on your budget. The average online bed retails for around $800 to $1,200 for a queen-size mattress. But there are beds under $500 and mattresses that cost over $2,000 if you're looking for affordability or luxury.\nHowever, price doesn't necessarily mean quality. Like any product, be sure to do your research (or rely on ours) and check that the mattress comes with a generous trial period, as most do these days.\nHow often should you replace your mattress?\nThe average lifespan of a mattress is about seven to 10 years. How long your mattress lasts depends on how often you sleep on it, if you rotate it and what it’s made of. All-foam mattresses tend to wear out a little fast because the foam can sag.\nThe average lifespan of the average mattress is between seven and ten years. Although there are things you can do to extend the life of your bed:\n- Clean regularly\n- Rotate your mattress to avoid uneven wear\n- Add a mattress protector\n- Use a mattress topper to change the firmness or feel of your bed\nWhat is the best time to buy a mattress?\nThere is always some sort of mattress sale going on. The type of sale and size of discounts will vary depending on the time of year. You’ll see the biggest markdowns around major holidays like Labor Day, Memorial Day, Presidents Day, Black Friday and Christmas. And you'll likely be able to save by bundling your mattress with other products you may need, such as a bed frame or bedding.\nWhat mattress is recommended by doctors?\nYour sleeping habits and body type are essential to any mattress recommendation. There is no one mattress recommendation by doctors, but there are certifications to look for. For instance, mattresses like the Avocado Green and Plank Firm Luxe are endorsed by the American Chiropractic Association.\nHow do I choose the best mattress for my sleeping position?\nYour sleeping position will determine how firm your mattress should be. Side sleepers sleep best on softer mattresses that offer enough pressure relief so they don’t develop pressure points on the shoulders, knees and hips. Stomach and back sleepers need a firmer mattress that keeps their spine in a neutral position throughout the night. If a mattress is too soft, you’ll wake up with back pain. Combination sleepers should choose based on where they spend the most time.\nWhat type of mattress is best for people with allergies?\nPeople with allergies benefit most from mattresses made with hypoallergenic materials, like latex foam beds. Latex foam is naturally hypoallergenic and antimicrobial, so mold and other allergens can’t grow on it. Alternatively, memory foam beds are a good choice for people with allergies.\nHow can I tell if a mattress is good for me without trying it in-store?\nBuying your next bed online can seem like a risk. The best online mattresses offer trial periods and free returns to make sure you’re satisfied with your selection. Trials from brands range from around 90 days up to a full year to make your decision. If you’re unhappy, you can return it and get a refund.\nThe best way to start shopping for your next bed is to consider your preferences, sleeping position and budget. That will help you narrow down the market to your best options.\nHow do mattress warranties work, and what should I look for?\nNearly all online mattress brands offer a warranty. The warranty duration will vary by brand, though the low side tends to be around ten years. Just because a mattress has a warranty doesn’t mean everything is covered under it. Warranties protect you against defects in the bed, like broken coils or split seams. Warranties do not cover normal wear and tear to your bed.\nSome brands, like Nest Bedding, offer unique programs like the lifetime renewal exchange, which allows you to replace old layers of foam.\nAre more expensive mattresses always better?\nNo, expensive mattresses aren’t always better. Plenty of really affordable beds rival the quality and comfort of costly beds. More expensive beds often have extra bells and whistles like zoned support and cooling covers that budget choices don’t have.\nHow do I properly clean and maintain my mattress?\nChanging your bedding regularly is the first step in keeping your bedroom clean. It won’t stop your bed from collecting stains, dead skin cells and dust mites. Properly cleaning your mattress includes spot cleaning, vacuuming and deep cleanings."
    },
    {
      "url": "https://www.cnet.com/gifts/our-favorite-back-to-school-picks/",
      "text": "Somehow, it's that time of the summer again: Back-to-school season is on the horizon. That means it's time to start shopping. Whether you have a kiddo heading to kindergarten or college, they'll need a few key supplies to get the year started off right. To help you avoid last-minute scrambling, our editors have hand-selected some school essentials for you.\nFrom top-rated laptops, durable water bottles, smart notebooks and everything in between, these finds cover gear, gadgets and services that will help students stay productive and engaged in the classroom. A smooth start can help set your scholar up for success the whole year. Check out our favorite finds to get ready for the school year now.\nBest back-to-school tech\nKadams Pomodoro Visual Timer Cube\nIt can be tough for everyone to transition from the freedom of summer to the structure and homework a new school year brings. To help students stay focused while doing school tasks, try a visual timer. This handy, easy-to-use device can help with time management and reduce procrastination for scholars of all ages. You can set it for any time between 1 and 99 minutes, and the LED ring display then gradually fills as the time progresses. There's also a stopwatch mode that can be used for timing other activities -- like workouts and cooking. Fun for the whole family.\nRocketbook Core reusable spiral notebook\nTaking notes is a whole lot easier -- and smarter -- thanks to Rocketbook's reusable notebooks. Students can write on pages like they're regular paper, then scan and upload their notes to a cloud platform of choice (like Google Drive, Dropbox and more). Once their notes are safely stored, they can wipe the page clean with a damp cloth and start fresh.\nOther features include the ability to bundle pages together and search for handwritten text -- no more flipping through pages to find that one note they took in history class last week. They can also choose between classic lined, custom dot grids or blank pages to suit their needs. Genius, right?\nApple MacBook Air M1\nThis isn't the latest MacBook Air in Apple's lineup, but it's hard to beat the price. For just $649, you get a solid laptop that features Apple's M1 processor with an eight‑core CPU, seven‑core GPU and 16‑core Neural Engine. It also has Touch ID, Apple's Magic Keyboard, a Force Touch trackpad and a 13.3-inch Retina display.\nAnker Zolo portable power bank\nMost students can't go one second without their phones, whether they're texting friends or looking up homework assignments. If you want to make sure their phone never runs out of juice, get them a power bank for easy charging on the go. The 10,000-mAh Anker Zolo is CNET's favorite power bank. It's fast-charging, easy to slip into a pocket or backpack and you can use the USB-C cable as a lanyard when it's not plugged into a device.\nBe aware that Anker recently issued a global recall of several products, so double-check the model number of the Anker charger you select before finalizing your purchase to make sure you're not buying a faulty product.\nSpeck phone case\nNot only do you need to keep their phone juiced up, but you'll need to make sure it stays protected and can withstand the rigors of being thrown into a backpack or left on a gym floor. Speck makes a variety of stylish cases for various models. Prices start as low as $9 for a clear polycarbonate case and go all the way up to $50 depending on the model.\nApple AirPods 4\nApple's got a pretty solid grip on kids and teens, which is why AirPods remain a top choice among students. While you could pay a bit more for the AirPods Pro 2, we suggest going with the excellent but less expensive fourth-gen AirPods, winner of a CNET Editors' Choice Award. They offer active noise cancellation, the same H2 chip found in the Pro 2 and the design fits smaller ears a bit better than the Pros.\nAcer Chromebook Plus 514\nIf you don't want to plunk down a ton of cash for a new Apple laptop, a Chromebook is the way to go. They're almost always less expensive and simpler to use than a laptop running Windows or MacOS. This Acer Chromebook Plus 514 is durable, lightweight, and offers a long battery life and good webcam performance, which is why it landed at the top of our list of the best Chromebook of 2025.\nJall Wake Up Light sunrise alarm clock\nGetting up for school in the morning is hard. Make those morning a little more peaceful with a sunrise alarm clock. According to a study in the journal Behavioral Brain Research, exposure to simulating light in the mornings can improve cognitive performance throughout the day. This Jall Wake Up Light is our favorite budget pick for the best sunrise alarm. For less than $40, you get seven colors and 20 brightness levels, along with seven natural sounds to accompany the light.\nBest back-to-school backpacks and water bottles\nMake It Mine backpack\nDon't you wish you'd had a fun, personalized backpack like this one growing up? This Pottery Barn Make It Mine backpack includes a trio of patches that can be ironed on, plus a fun charm that can be attached to a loop or zipper pull. You can also add your favorite student's name or initials to further customize it. Prices start at $59.50 (for small) and $69.50 (for large) and you can also purchase a matching lunch box (with two patches) and additional iron-on patches for $10. What a great way to get your little scholar excited about the school year.\nThe North Face Recon backpack\nA good backpack not only should be able to hold all your student's supplies, but it also needs to withstand the wear and tear of daily use. That's what you'll find here with North Face's Recon Backpack. It's durable, with ample space for a laptop, books, water bottle and more. Bonus: It has a padded laptop compartment to protect your device from bumps and falls.\nOwala FreeSip water bottle\nThe Stanley has officially outlived its cool factor, and the Owala FreeSip is the water bottle of choice among students now. Unlike the Stanley, it's easy to carry around and it won't leak all over your backpack or tote. It's also got a cool built-in straw that makes it easy to sip from all day long.\nHydro Flask\nIt's not the Owala, but it's still a popular choice among students. While the bigger, wide-mouth version was popular a few years ago, now more students go for the standard-mouth version since it's easier to fit into backpacks and cup holders.\nBest back-to-school supplies\nBack-to-school elementary school supply box\nYou know how school supply lists usually require you loading up your cart -- in-store or online -- with a ton of items and you still inevitably forget something? This school supply box takes the stress out of that shopping experience. It's a one-stop shop for the essentials most elementary school kids will need this year. The 32-piece box includes items like a pencil box, erasers, glue sticks, pencil sharpener, ruler, notebook -- plus Crayola markers, crayons and colored pencils.\nFirst day of school memory board\nSo this isn't so much a first-day essential for kids, it's more for proud parents. Whether your kiddo is starting first grade or heading off to high school (and rolling their eyes at your photo request), you'll be glad you bought this customizable board to mark the occasion. You can fill it in with their teacher's name, favorite things, career ambitions -- even their height. Then, at the end of the year, swap in the \"last day of\" magnetic tag to see how much they've grown. Cue those happy tears.\nLocker accessory kit\nLocker accessories have come a long way. With everything they need to stay organized and stylish, the student in your life can make their locker their own with this set. It includes a whiteboard, organizer basket, shelf, mirror and some magnets -- perfect for keeping track of class schedules, homework and more. It'll make those in-between-class book drop-offs just a little more enjoyable.\nA Nice Night faux fur reading pillow\nSo much for desks. Most kids end up doing the majority of their homework in bed or on the floor. This faux fur reading pillow offers a perfect blend of comfort and support. And it comes in a variety of colors so it will suit any decor.\nPalomino Blackwing 602 pencils\nNo matter which grade they're in, students go through a lot of pencils -- so it's important to have at least a 12-pack of them on hand before school starts. While Dixon Ticonderoga No. 2 pencils are a classic, if you want to make your student feel special, get them an upgrade with these Palomino Blackwings. Yes, they're much pricier than Dixon Ticonderoga pencils, but the quality of these pencils can't be beat. Once you try them, you'll never want to go back.\nPowerMe electric pencil sharpener\nEven if you buy pre-sharpened pencils, you'll need a pencil sharpener on hand for when they start going dull. PowerMe's electric pencil sharpener does the job and comes in a variety of colors. We like that it's battery-operated and compact so it doesn't take up much desk space.\nDecomposition notebook\nNot everything requires a Chromebook or MacBook. Sometimes you just want to jot something down with a good old-fashioned pencil and paper. The timeless Decomposition Notebook is a classic and comes in a variety of patterns, starting at $6 on Amazon. It's lightweight and perfect for tossing into a backpack for your next brainstorming session.\nSephora gift card\nDon't forget about skincare. As kids get older, cleansers and acne treatments take center stage. Set them up for skincare success with a Sephora gift card. Cards can be loaded at any increment between $10 and $250."
    },
    {
      "url": "https://www.cnet.com/tech/mobile/pixel-9a-buying-guide-everything-to-know-about-googles-budget-phone/",
      "text": "Google's latest budget phone, the $499 Pixel 9A, arrived fresh off the heels of Apple's \"affordable\" offering, the $599 iPhone 16E. Very convenient timing.\nThe Pixel 9A is $300 cheaper than the baseline Pixel 9 and therefore scales back when it comes to features like cameras and RAM. But it maintains other attributes, like display size, processor and AI features -- and even touts a higher battery capacity than its pricier Pixel counterparts. For more on what the new phone has in store, be sure to check out CNET's Pixel 9A review.\nSo, is the Pixel 9A a good fit for you? Here's our guide, with everything to consider.\nCamera guide\nBeing able to take good photos is usually a top priority when buying a new phone since, for most people, their phone is their only camera. The Pixel 9A has two cameras on the back: a 48-megapixel wide and 13-megapixel ultrawide, along with a 13-megapixel front-facing camera. That places the 9A's rear camera specs below those on the Pixel 9 and 9 Pro, but megapixels aren't the only factor in getting quality shots. (You can check out the spec chart below to see how the cameras compare on these phones.)\nThe Pixel 9A's camera supports Macro Focus, meaning you can get closer to your subject -- like if you're snapping a close-up of your delicious meal -- and have it be in crisp focus. With the 9A, Google uses the main camera to enable Macro Focus instead of the ultrawide camera, as with many other phones.\nAI guide\nWhat's perhaps most notable about the Pixel 9A is the suite of AI editing tools you'll still have access to, even with that lower price. Features like Magic Editor can help clean up your shots and alter backgrounds, Best Take creates an image where everyone in a group photo looks their best, and Add Me employs AI and augmented reality to incorporate the photographer in the final image.\nFor people who are curious about the myriad AI features companies are bombarding us with, the Pixel 9A can be a good device for dipping your toes in those waters, hopefully without feeling inundated -- and without shelling out too much cash to see what all the buzz is about. I find photo editing tools among the best uses of AI because they eliminate the need for pricey software and let you touch up photos directly on your device, with no special skills needed.\nBut if you would rather venture deeper into AI territory, the 9A's still got you covered. You'll have access to Gemini to help with tasks like writing, brainstorming and carrying out actions across apps. You'll also get Circle to Search so you can learn more about whatever's on your screen -- a feature upon which I've become heavily reliant. Those features are great because they feel like a natural way to ease into AI since they're so deeply integrated into your device and seamless to use.\nWith AI being a staple of almost every new phone, tapping into those capabilities without breaking the bank can be an enticing option for someone who still isn't sure what the big deal is -- and then see if the Pixel 9A changes their mind.\nFor those who hold onto their phones\nWhile carriers may expect you to upgrade your phone every two years, manufacturers like Google and Samsung have extended the window for software and security upgrades on their phones to seven years. That applies to lower-priced phones like the Pixel 9A as well, giving budget-conscious consumers even more reason to feel like they've scored a deal.\nNot buying a flagship device can also mean feeling less susceptible to the pressures of upgrades. It's typically more premium phones -- usually with minor tweaks -- that are aggressively pushed onto those keen to purchase the latest tech. If simply having a phone with key features is all that matters, then the Pixel 9A can be a good way to dodge all that noise.\nThis can also make the Pixel 9A a good option for kids, who probably don't need the flashiest devices. Features like Family Link allow parents to manage privacy settings, screen time limits and location sharing, and they can also silence notifications and disable apps during school hours.\nThe Pixel 9A packs the same Google Tensor G4 processor as the flagship Pixel 9 and 9 Pro but has 8GB of RAM instead of the 12GB and 16GB you'll get on those premium phones. That should still be more than enough for everyday use, like scrolling through social media, snapping photos and browsing the web. If you're a heavy mobile gamer, 8GB of RAM might not be ideal, but it won't be an issue for most people.\nThe Pixel 9A's 6.3-inch OLED display matches up with what you'll get on the Pixel 9 and Pixel 9 Pro, so you don't have to scale back your viewing experience -- especially with a 60Hz to 120Hz variable refresh rate that should make scrolling seamless.\nAnd with a 5,100-mAh battery, the Pixel 9A should be able to last you throughout the day. Like the iPhone 16E, the Pixel 9A actually touts a higher battery capacity than its pricier peers, which each have a 4,700-mAh battery. That can also help you feel like you're getting the most bang for your buck.\nWhat you won't get with this phone is the Pixel 9's Satellite SOS feature, which uses satellites to contact emergency services when you're out of range of a cell signal or Wi-Fi. But if you don't often find yourself in places without cell service, like on a remote hiking trail, then you hopefully shouldn't feel its absence.\nWith all that in mind, if you have last year's Pixel 8A, there's probably not enough reason to upgrade to the 9A, as they share many of the same features, specs and AI capabilities.\nBut if you've got a Pixel 7A and want to tap into some newer AI features, the 9A might be enticing. Similarly, if you have a Pixel 6A or older, you could see a noticeable improvement in the 9A's camera, battery life and overall performance.\nAnd if you'd rather hang tight to your phone and keep stretching your dollar, more power to you.\nGoogle Pixel 9A vs. Pixel 8A vs. Pixel 9 vs. Pixel 9 Pro\n| Google Pixel 9A | Google Pixel 8A | Google Pixel 9 | Google Pixel 9 Pro | |\n| Display size, tech, resolution, refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.1-inch OLED; 2,400x1,080 pixels, 60-120Hz variable refresh rate | 6.3-inch OLED; 2,424x1,080 pixels; 60-120 Hz variable refresh rate | 6.3-inch LTPO OLED; 2,856x1,280 pixels; 1-120Hz variable refresh rate |\n| Pixel density | 422 ppi | 430 ppi | 422 ppi | 495 ppi |\n| Dimensions (inches) | 6.1 x 2.9 x 0.4 in | 6 x 2.9 x 0.4 in | 6 x 2.8 x 0.3 in | 6 x 2.8 x 0.3 in |\n| Dimensions (millimeters) | 154.7 x 73.3 x 8.9 mm | 152 x 74 x 10.2 mm | 152.8 x 72 x 8.5 mm | 152.8 x 72 x 8.5 mm |\n| Weight (grams, ounces) | 186g (6.6 oz) | 193 g (6.7 oz) | 198g (7 oz) | 199g (7 oz) |\n| Mobile software | Android 15 | Android 14 | Android 14 | Android 14 |\n| Camera | 48-megapixel (wide), 13-megapixel (ultrawide) | 64-megapixel (main), 13-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide) | 50-megapixel (wide), 48-megapixel (ultrawide), 48-megapixel (5x telephoto) |\n| Front-facing camera | 13-megapixel | 13-megapixel | 10.5-megapixel | 42-megapixel |\n| Video capture | 4K | 4K | 4K | 4K |\n| Processor | Google Tensor G4 | Google Tensor G3 | Google Tensor G4 | Google Tensor G4 |\n| RAM + storage | 8GB + 128GB, 256GB | 8GB + 128GB, 256GB | 12GB RAM + 128GB, 256GB | 16GB + 128GB, 256GB, 512GB, 1TB |\n| Expandable storage | None | None | None | None |\n| Battery | 5,100 mAh | 4,492 mAh | 4,700 mAh | 4,700 mAh |\n| Fingerprint sensor | Under display | Under display | Under display | Under display |\n| Connector | USB-C | USB-C | USB-C | USB-C |\n| Headphone jack | None | None | None | None |\n| Special features | 7 years of OS, security and Pixel feature drops; Gorilla Glass 3 cover glass; IP68 dust and water resistance; 2,700-nit peak brightness; 1,000,000:1 contrast ratio; 23W fast charging (charger not included); 7.5W wireless charging Qi certified; Wi-Fi 6E; NFC; Bluetooth 5.3; dual-SIM (nano SIM + eSIM); Add Me; Best Take; Magic Eraser; Magic Editor; Photo Unblur; Super Res Zoom; Circle To Search | IP67 rating dust and water resistance; 18W fast charging; 7.5W wireless charging; 5G (5G sub6 / mmWave); VPN by Google One; Circle to Search; 7 years Android OS updates; 7 years security updates; Best Take; Audio Magic Eraser; Wi-Fi 6E; NFC; Bluetooth 5.3; dual-SIM (nano SIM + eSIM) | Satellite SOS; 7 years of OS, security and Pixel feature drops; Gorilla Glass Victus 2 cover glass; IP68 dust and water resistance; 2,700-nit peak brightness; 45W fast charging (charger not included); 15W wireless charging with Google Pixel Stand (second gen); 12W wireless Qi-charging; Wi-Fi 6 and Wi-Fi 7; NFC; Bluetooth 5.3; dual-SIM (eSIM + nano SIM); Add Me; Best Take; Magic Eraser; Magic Editor | Satellite SOS; 7 years of OS, security and Pixel feature drops; IP68 dust and water resistance; Video Boost with 8K Upscaling; Macro Focus on ultrawide; Gorilla Glass Victus 2 cover glass; 3,000-nit peak brightness; 45W fast charging (charger not included); 15W wireless charging with Google Pixel Stand (second gen); 12W wireless Qi-charging; Wi-Fi 6 and Wi-Fi 7; NFC; Bluetooth 5.3; dual-SIM (eSIM + nano SIM); Add Me; Best Take; Magic Eraser; Magic Editor |\n| US price starts at | $499 (128GB) | $499 (128GB) | $799 (128GB) | $999 (128GB) |\n| UK price starts at | Converts to £385 (128GB) | £499 (128GB) | Converts to £640 (128GB) | Converts to £780 (128GB) |\n| Australia price starts at | Converts to AU$780 (128GB) | AU$849 (128GB) | Converts to AU$1,210 (128GB) | Converts to AU$1,510 (128GB) |"
    }
  ],
  "argos_summary": "The article highlights Amazon's latest deals, focusing on the Skylight Calendar Max, Google Pixel 9A, and Renpho's smart scale, all of which are discounted for the back-to-school season. The Skylight Calendar Max is praised for its organizational features, while the Pixel 9A offers impressive AI capabilities and camera features at a lower price point compared to its flagship counterparts. Additionally, the Renpho smart scale is noted for its affordability and health tracking metrics, making it a great choice for fitness enthusiasts.",
  "argos_id": "F2JP7J4DS"
}