{
  "url": "https://www.gamesradar.com/entertainment/crime-movies/heat-2-is-getting-so-expensive-that-warner-bros-wants-a-streaming-service-to-co-finance-the-movie-and-leonardo-dicaprio-is-reportedly-in-talks-to-star/",
  "authorsByline": "Emily Garbutt",
  "articleId": "9871061ca32840989edab055df497467",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/yvsJJRiEahHeFwFWLCvLs3-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T15:36:03+00:00",
  "addDate": "2025-08-05T15:44:17.225058+00:00",
  "refreshDate": "2025-08-05T15:44:17.225060+00:00",
  "score": 1.0,
  "title": "Heat 2 is getting so expensive that Warner Bros. wants a streaming service to co-finance the movie, and Leonardo DiCaprio is reportedly in talks to star",
  "description": "Michael Mann might be bringing both Apple and Leonardo DiCaprio on board for Heat 2",
  "content": "Heat 2 is reportedly getting too expensive for Warner Bros. to handle on their own – but Leonardo DiCaprio may be joining the prequel's cast.\n\n\n\nAccording to Puck's What I'm Hearing newsletter, the movie's initial budget came in at over $200 million. Mann has since brought it down to about $170 million, but that's still too steep for Warner Bros. The studio is reportedly open to partnering with a streamer or another studio, so the script has been passed on to Apple for their consideration.\n\nWhat's more, DiCaprio is reportedly in talks to star in the movie, and Puck thinks his involvement would guarantee the movie's future. It's unclear who he would play if his casting is made official.\n\nThere's been talk of the prequel for a couple of years, but Mann revealed he'd completed the first draft of the script in March 2025. No formal casting announcements have been made yet but the rumor mill has been in overdrive, with Adam Driver and Austin Butler's names being thrown into the mix to play younger versions of Neil McCauley and Chris Shiherlis, the roles played by Robert De Niro and Val Kilmer in the original 1995 movie.\n\nThe new movie is based on Mann's 2022 novel, which he co-wrote with Meg Gardiner, which alternates between two timelines to act as both a prequel and a sequel to the cat-and-mouse chase between McCauley and Al Pacino's LAPD detective Vincent Hanna.\n\nHeat 2 doesn't have a release date yet. While we wait for more updates, get up to speed with the rest of this year's best upcoming movies with our guide to 2025's biggest movie release dates.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/entertainment/drama-movies/la-la-land-director-eyeing-james-bond-and-oppenheimer-stars-for-new-prison-drama/",
    "https://www.gamesradar.com/movie-release-dates/",
    "https://www.gamesradar.com/entertainment/action-movies/new-tom-cruise-underwater-action-thriller-reportedly-put-on-pause-after-budget-spirals-to-usd275m/",
    "https://puck.news/newsletter_content/what-im-hearing-ellison-warners-buzz-paramount-yaccarino-flirtation-heat-2-crunch-anistons-apple-issue/",
    "https://www.gamesradar.com/entertainment/horror-movies/american-psycho-reboot-has-another-potential-patrick-bateman-the-white-lotus-and-gen-v-star-patrick-schwarzenegger/",
    "https://www.gamesradar.com/upcoming-movies/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Warner Bros.",
      "weight": 0.084907316
    },
    {
      "name": "Leonardo DiCaprio",
      "weight": 0.07952069
    },
    {
      "name": "Neil McCauley",
      "weight": 0.07272809
    },
    {
      "name": "Robert De Niro",
      "weight": 0.068637036
    },
    {
      "name": "Mann",
      "weight": 0.066033036
    },
    {
      "name": "McCauley",
      "weight": 0.06251449
    },
    {
      "name": "Adam Driver",
      "weight": 0.062134024
    },
    {
      "name": "DiCaprio",
      "weight": 0.06205274
    },
    {
      "name": "younger versions",
      "weight": 0.06038941
    },
    {
      "name": "Chris Shiherlis",
      "weight": 0.06028029
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    },
    {
      "name": "Movies"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.958984375
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.95361328125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.439453125
    },
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.425537109375
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.323974609375
    }
  ],
  "sentiment": {
    "positive": 0.1739502,
    "negative": 0.27172852,
    "neutral": 0.5541992
  },
  "summary": "Warner Bros. is reportedly seeking a streaming service to finance the movie, Heat 2, which is too expensive for them to handle on their own. The movie's initial budget was initially set at over $200 million, but has since been reduced to about $170 million. Warner Bros. has expressed interest in partnering with a streamer or another studio, and has reportedly passed on the script to Apple for consideration. Leonardo DiCaprio is reportedly in talks to star in the movie. The casting announcement has not yet been made. The film is based on Mann's 2022 novel, which he co-wrote with Meg Gardiner.",
  "shortSummary": "Leonardo DiCaprio is in talks to star in Heat 2, requiring co-finance from Apple and other streaming services, amid rising costs and uncertain release dates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b7a66abd99a244d392baa12de762ae04",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/entertainment/drama-movies/la-la-land-director-eyeing-james-bond-and-oppenheimer-stars-for-new-prison-drama/",
      "text": "Cillian Murphy and Daniel Craig are in talks to star in Damien Chazelle's next movie, according to Deadline.\nLittle is known about the currently untitled film yet, other than the fact that Chazelle, who is perhaps best known for helming Oscar-winning musical La La Land, will write and direct. Olivia Hamilton is set to produce alongside Chazelle, under their Wild Chickens Productions banner, while Paramount Pictures will distribute the flick.\nThough it is yet to be confirmed, insiders allegedly told the aforementioned publication that the movie will be set inside a prison. Principal photography is expected to start sometime this year.\nAs of March 2025, Chazelle is filming his upcoming action adventure Heart of the Beast, starring Anna Lambe, J.K. Simmons, and Brad Pitt, in New Zealand. It had previously been reported that he had planned to work on an Evel Knievel biopic with Leonardo DiCaprio next, but after struggling to pin down a studio to back it, the filmmaker has pivoted to the prison drama.\nHaving picked up the Best Actor gong for his performance in Christopher Nolan's Oppenheimer, Murphy just wrapped production on feature-length Peaky Blinders spin-off The Immortal Man and is eyeing up a role in the threequel to Danny Boyle's 28 Years Later. As for Craig, who was most recently seen in Luca Guadagnino's critically acclaimed Queer, he's gearing up for the release of third Knives Out installment Wake Up Dead Man in the second half of 2025.\nWhile we wait for more news on Chazelle's next project, check out our guide to the most exciting upcoming movies heading our way.\nBringing all the latest movie news, features, and reviews to your inbox\nI am an Entertainment Writer here at GamesRadar+, covering all things TV and film across our Total Film and SFX sections. Elsewhere, my words have been published by the likes of Digital Spy, SciFiNow, PinkNews, FANDOM, Radio Times, and Total Film magazine.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/horror-movies/american-psycho-reboot-has-another-potential-patrick-bateman-the-white-lotus-and-gen-v-star-patrick-schwarzenegger/",
      "text": "American Psycho reboot has another potential Patrick Bateman: The White Lotus and Gen V star Patrick Schwarzenegger\nThere's a new contender to lead Luca Guadagnino's American Psycho\nLuca Guadagnino's American Psycho reboot is reportedly circling another potential Patrick Bateman: Patrick Schwarzenegger.\nAccording to The Hollywood Reporter, \"Schwarzenegger is very much on the radar of the film’s producers,\" although some of those involved \"fret that he hasn’t yet toplined a major feature.\" However, as THR points out, neither had Christian Bale when he took on the role in Mary Harron's adaptation of Bret Easton Ellis' satirical horror novel in 2000.\nWhen asked by the publication if the role was on his list of career goals, Schwarzenegger replied, \"What’s on the very top of it is to work with a person like that, like Luca.\"\nNo casting announcements for the movie have been made yet, but Austin Butler and Jacob Elordi have previously been rumored to be taking on the role of investment banker by day and serial killer by night. At this year's CinemaCon, Call Me By Your Name and Challengers helmer Guadagino said he was in \"conversation with very exciting performers to play the leads.\"\nContagion and The Bourne Ultimatum screenwriter Scott Z. Burns is penning the movie's script. \"He's doing an incredible job. The script is coming out very handsomely,\" Guadagnino said at CinemaCon.\nSchwarzenegger played Golden Boy in The Boys spin-off Gen V, and most recently starred as Saxon Ratliff in The White Lotus season 3. Next, he's starring alongside The Substance's Margaret Qualley in new Amazon romantic drama Love of Your Life.\nGuadagnino's take on American Psycho doesn't have a release date yet. While we wait for more updates, check out our guide to the biggest upcoming movies still to come in 2025.\nI’m an Entertainment Writer here at GamesRadar+, covering everything film and TV-related across the Total Film and SFX sections. I help bring you all the latest news and also the occasional feature too. I’ve previously written for publications like HuffPost and i-D after getting my NCTJ Diploma in Multimedia Journalism.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/movie-release-dates/",
      "text": "Movie release dates 2025: every major film coming out in cinemas and on streaming services\nFrom Tron: Ares to Avatar 3, these are the major 2025 movie release dates to add to your watchlist\nAs summer blockbuster season starts to wind down, there's still no shortage of 2025 movie release dates on the calendar. The second half of the year brings plenty of exciting new movies and sequels, from comedy to horror to sci-fi.\nComing out the other side of Superman and The Fantastic Four: First Steps dominating the box office, the superhero fun isn't over yet with The Toxic Avenger just around the corner. There are also plenty of upcoming horror movies on the way, including the final installment in The Conjuring franchise and a follow-up to The Black Phone. And that's before we even get to major new releases like Avatar 3 and a new Tron film.\nTo make it all a bit easier to digest, we've compiled a comprehensive list of all the most important 2025 movie release dates that should be on your radar, as well as where you can watch these upcoming movies. So, without further ado, grab your popcorn, head to the multiplex, and happy watching.\nNEW MOVIES IN AUGUST\n- The Bad Guys 2 [Cinemas] – August 1\n- The Naked Gun [Cinemas] – August 1\n- Beneath the Storm [Cinemas] – August 1\n- My Oxford Year [Netflix] – August 1\n- Freakier Friday [Cinemas] – August 8\n- Weapons [Cinemas] – August 8\n- Fixed [Netflix] – August 13\n- Nobody 2 [Cinemas] – August 15\n- Splitsville [Cinemas] – August 22\n- The Thursday Murder Club [Netflix] – August 28\n- The Toxic Avenger [Cinemas] – August 29\n- Caught Stealing [Cinemas] – August 29\n- The Roses [Cinemas] – August 29\nNEW MOVIES IN SEPTEMBER\n- The Conjuring: Last Rites [Cinemas] – September 5\n- Downton Abbey 3 [Cinemas] – September 12\n- The Long Walk [Cinemas] – September 12\n- Demon Slayer: Kimetsu no Yaiba Infinity Castle [Cinemas] – September 12\n- Spinal Tap II: The End Continues [Cinemas] – September 12\n- Him [Cinemas] – September 19\n- Xeno [Cinemas] – September 19\n- A Big, Bold Beautiful Journey [Cinemas] - September 19\n- Gabby's Dollhouse: The Movie [Cinemas] – September 26\n- One Battle After Another [Cinemas] - September 26\n- The Strangers: Chapter 2 [Cinemas] - September 26\nNEW MOVIES IN OCTOBER\n- The Smashing Machine [Cinemas] – October 3\n- Roofman [Cinemas] – October 3\n- Avatar: The Way of Water (Re-release) [Cinemas] – October 3\n- TRON: Ares [Cinemas] – October 10\n- Kiss of the Spider Woman [Cinemas] – October 10\n- The Black Phone 2 [Cinemas] – October 17\n- Good Fortune [Cinemas] – October 17\n- After the Hunt [Cinemas] – October 17\n- Mortal Kombat 2 [Cinemas] – October 24\n- Regretting You [Cinemas] – October 24\n- Springsteen: Deliver Me From Nowhere [Cinemas] – October 24\n- Chainsaw Man - The Movie: Reze Arc [Cinemas] – October 29\n- Bugonia [Cinemas] – October 31\nNEW MOVIES IN NOVEMBER\n- Predator: Badlands [Cinemas] – November 7\n- The Running Man [Cinemas] – November 7\n- Nuremberg [Cinemas] – November 7\n- Now You See Me: Now You Don't [Cinemas] – November 14\n- Trap House [Cinemas] – November 14\n- Jay Kelly [Cinemas] – November 14\n- Keeper [Cinemas] – November 14\n- Wicked: For Good [Cinemas] – November 21\n- Sisu 2 [Cinemas] – November 21\n- Zootopia 2 [Cinemas] – November 26\nNEW MOVIES IN DECEMBER\n- Troll 2 [Netflix] – December 1\n- Five Nights at Freddy's 2 [Cinemas] – December 5\n- Ella McCay [Cinemas] – December 12\n- Silent Night, Deadly Night [Cinemas] – December 12\n- Hamnet [Cinemas] – December 12\n- Scarlet [Cinemas] – December 12\n- Knives Out: Wake Up Dead Man [Netflix] – December 12\n- Avatar: Fire and Ash [Cinemas] – December 19\n- The SpongeBob Movie: Search for SquarePants [Cinemas] – December 19\n- Anaconda [Cinemas] – December 25\n- The Housemaid [Cinemas] – December 25\n- Marty Supreme [Cinemas] – December 25\nNeed more to get excited about? Well then, be sure to keep up to date with all of the most exciting new TV shows coming our way, and read about all the new anime scheduled.\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Mireia MullorContributing Writer\n- Molly EdwardsDeputy Entertainment Editor\n- Anthony McGlynnContributing Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/action-movies/new-tom-cruise-underwater-action-thriller-reportedly-put-on-pause-after-budget-spirals-to-usd275m/",
      "text": "New Tom Cruise underwater action thriller reportedly put on pause after budget spirals to $275m\nThe Mission: Impossible star has hit rough waters with his next movie, Deeper\nTom Cruise is going to have to hold his breath a little longer for his new film, Deeper, with Ana de Armas, after reports that Warner Bros. has halted development on the next project because of budgetary issues.\nNews from Puck reveals that the star has been trying to nail down a price tag of $275 million for the film's production, which the studio is not on board with, and is looking to settle for $230 million instead (have they not checked the back of their sofa?). Sources close to the site have revealed that the water tower isn't willing to spill any more on the film, forcing Cruise to take the project elsewhere and find another studio to agree to his required number. Regardless of this happening, though, it will leave a lot of work that Warner Bros. has already done in developing the project.\nDirected by Doug Liman, the film features Cruise as a discredited astronaut who embarks on a deep-sea mission to explore a newly discovered ocean trench, with De Armas along for the ride. The two encounter trouble, however, when they uncover a dangerous and forgotten presence hidden in the depths.\nAs an alternative, Cruise has swiftly shopped the movie to Universal, who are supposedly close to taking over and willing to meet the number the star is aiming for. If all goes smoothly, they'll need to get a move on, as the original plan was for cameras to start rolling this summer.\nIt's an understandably concerning setback for Cruise, who would be making his first movie not linked to a franchise since 2017's American Made. There's also the important detail that, following Mission: Impossible – The Final Reckoning, which earned $566.8 million against a budget of nearly $400 million, Warner Bros. may be somewhat reluctant to invest in a film not linked to an existing IP that comes with an already established audience. It's a bit of a shame, given that the plotline for this one sounds fantastic. Fingers crossed, then, that Universal saves the day and Cruise gets to go Deeper, after all. Should you want to fill your Cruise quota with a film this week, why not check out our ranking of the star's best work here.\nBringing all the latest movie news, features, and reviews to your inbox\nNick is a freelancer whose work can be found at Screen Rant, The Digital Fix, and Looper. He loves movies, TV, DC, and Marvel. He also believes that the best Robin Hood is still a talking fox.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/upcoming-movies/",
      "text": "Upcoming movies: The most exciting new movies coming in 2025\nFrom new blockbusters to sci-fi sequels like Avatar 3 and Predator: Badlands, here are the best upcoming movies to keep track of in 2025\nWe're well past the halfway point of the year as August is finally here, but we've still got a whole bunch of exciting upcoming movies heading our way in the second half of 2025. In July, we saw DC and Marvel go head to head in theaters as Superman and The Fantastic Four: First Steps hit screens. But this month, it's all about the weird and wonderful, like action sequel Nobody 2, as well as The Toxic Avenger starring Elijah Wood, Kevin Bacon, and Peter Dinklage, creeping closer.\nThe rest of 2025 is stacked with new titles, too. So, to make your lives easier, we've rounded up the biggest releases still set to come. However, it is important to note that our round-up below doesn't include every upcoming movie. Here we have listed our picks of the best movies on the way, such as Predator: Badlands and Avatar: Fire and Ash. For a full list of new films, you can head over to our 2025 movie releases page.\nSo what are you waiting for? Get ready to purchase some movie tickets and take a seat, as we guide you through everything you need to know about the most exciting upcoming movies in 2025 and beyond. When you're done, check out our roundup of the best upcoming horror movies heading your way.\nNobody 2\nRelease date: August 15, 2025\nAfter we saw the hero take on some bad guys in 2021's Nobody, Bob Odenkirk returns as workaholic assassin Hutch Mansell in the highly anticipated sequel, which sees Mansell take a much-needed family vacation. However, summer is ruined when Mansell finds himself between a dodgy theme-park operator, a shady sheriff, and a crime boss. Newcomer Timo Tjahjanto directs the sequel, with stars Connie Nielsen and Christopher Lloyd returning.\nThe Toxic Avenger\nRelease date: August 29, 2025\nMacon Blair's long-awaited Toxic Avenger remake is finally hitting theaters after first premiering at Fantastic Fest back in 2023. The pic starts Peter Dinklage as Toxie, a janitor who turns into a goopy superhero after a freak accident. The cast includes Elijah Wood, Kevin Bacon, Jacob Tremblay, and Taylour Paige.\nBringing all the latest movie news, features, and reviews to your inbox\nThe Conjuring: Last Rites\nRelease date: September 5, 2025\nThe Conjuring franchise is coming to an end, but of course, it's going out with a bang. The final installment sees Ed (Patrick Wilson) and Lorraine (Vera Farmiga) Warren take on the case of a lifetime - which more or less forces them into retirement. Directed by Michael Chaves, the cast includes Mia Tomlinson, Taissa Farmiga, Shannon Kook, and Ben Hardy.\nDemon Slayer: Kimetsu no Yaiba Infinity Castle\nRelease date: September 12, 2025\nDemon Slayer is one of the best anime series of all time, so the first movie kicking off its final saga is a big deal, to say the least. Demon Slayer Infinity Castle will see Tanjiro's final battle against Muzan Kibutsuji and the rest of his high-ranking demons. Still desperate to cure his demon sister Nezuko, while Muzan is equally desperate to grab her new powers to survive sunlight, the climax promises to be amazing. The film was recently released in Japan, and is already breaking records, which is a great sign for us come September.\nTRON: Ares\nRelease date: October 10, 2025\nIt's been years, however, we're finally getting a new Tron movie. TRON: Ares. TRON: Ares is the sequel the 2010 movie Legacy and will see an AI come into the real world for the first time in the series history. Jared Leto is set to star as the titular AI and Jeff Bridges will be returning to reprise his iconic role as Kevin Flynn. This has been a long time coming, so we're very excited for this one. Stay tuned as we learn more plot details.\nThe Black Phone 2\nRelease date: October 17, 2025\nWould it really be October without a scary movie? Just in time for Halloween, Scott Derrickson's highly anticipated sequel, The Black Phone 2, will hit screens. Set years after the first movie, The Black Phone 2 revisits The Grabber's lone survivor, Finny, as he struggles to move on from being kidnapped by Ethan Hawke's demented child killer. Although he seemingly died in the first movie, Hawke's villain is returning, as well as Jeremy Davies, Mason Thames, and Madeleine McGraw.\nMortal Kombat 2\nRelease date: October 24, 2025\nMortal Kombat is one of the best video game franchises ever made, and one of the most exciting upcoming video games movies of the year. Mortal Kombat 2 is directed by Simon McQuoid, and filming officially wrapped last year in January. While we don’t much about the upcoming story, we do know that the cast is stacked with A-listers. Karl Urban is on board as Johnny Cage, Tati Gabrielle is cast as Jade, and Hiroyuki Sanada will be Scorpion.\nPredator: Badlands\nRelease date: November 7, 2025\nPrey director Dan Trachtenberg returns for another installment in the Predator franchise – but, unlike the critically acclaimed 2022 prequel, Predator: Badlands is set in the future. Elle Fanning stars as Thia, a Weyland-Yutani android, while Dimitrius Schuster-Koloamatangi plays a young Predator. Per the film's official synopsis, he is \"outcast from his clan\" but \"finds an unlikely ally in Thia and embarks on a treacherous journey in search of the ultimate adversary.\"\nAs suggested by that logline, the movie's first trailer confirms that unlike previous installments in the Predator franchise, Badlands will make the titular aliens the focus of the story rather than the adversary coming up against a human hero. Bring it on.\nWicked: For Good\nRelease date: November 21, 2025\nThe second and final part in Jon M. Chu's adaptation of the iconic musical Wicked arrives at the end of this year. Titled Wicked: For Good, after one of the movie's most anticipated songs, it will pick up in the aftermath of the first film. If you'll recall, this saw Elphaba on the run after refusing to bend to the will of the Wizard. Expect more songs, seriously emotional moments, and some neat twists in the second half.\nFrankenstein\nRelease date: November 2025\nA new adaptation of Mary Shelley's beloved classic Frankenstein arrives in 2025, and it's helmed by the master of gothic storytelling Guillermo del Toro. It's set to follow the classic story of Victor Frankenstein bringing the dead back to life in the form of a horrific creature, but we can't wait to see this new twist. Oscar Isaac plays Victor Frankenstein and Jacob Elordi is Frankenstein's monster in the upcoming movie, which also stars Mia Goth, Christoph Waltz, and Ralph Ineson.\nFive Nights at Freddy's 2\nRelease Date: December 5, 2025\nThe sequel to the hit PG-13 horror adaptation of the massively popular video game series sees the return of Josh Hutcherson's Mike and Elizabeth Lail's Vanessa - but also features a pretty cool Scream reunion what with Matthew Lillard returning as supervillain William Afton and Skeet Ulrich joining the cast as a brand new character. Per the official tagline, \"Anyone can survive five nights. This time, there are no second chances.\"\nWake Up Dead Man: A Knives Out Mystery\nRelease date: December 12, 2025\nThe third installment in Netflix's hit Knives Out franchise arrives in 2025 with Wake Up Dead Man. Written and directed by Rian Johnson, the movie follows the same convention as the first two with a rotating cast revolving around Daniel Craig's Benoit Blanc. The new outing is just as star-studded too with Josh O'Connor and Josh Brolin playing priests and Mila Kunis playing a police officer. The rest of the cast features Glenn Close, Jeremy Renner, Kerry Washington, Andrew Scott, and Cailee Spaeny. There's no release date yet, but we know it arrives at some point in 2025.\nAvatar: Fire and Ash\nRelease date: December 19, 2025\nIt feels like it's been too long since we had a new Avatar movie, but thankfully James Cameron's epic fantasy world returns in 2025. The third installment, titled Avatar: Fire and Ash, focuses on a new clan, the volcano-dwelling \"Ash People\". Most of the major stars return, including Sam Worthington as Jake Sully, Zoe Saldaña as Neytiri, Sigourney Weaver as Kiri, and Stephen Lang as Colonel Miles Quaritch. A lot is still up in the air about what the movie will focus on, but it's certain it will be visually stunning.\nFor more on what's to come, check out our guide to all the new anime and all the upcoming Star Wars movies heading your way soon.\nI’m the Deputy Entertainment Editor here at GamesRadar+, covering TV and film for the Total Film and SFX sections online. I previously worked as a Senior Showbiz Reporter and SEO TV reporter at Express Online for three years. I've also written for The Resident magazines and Amateur Photographer, before specializing in entertainment.\n- Megan GarsideEditorial Associate, GamesRadar+\n- Mireia MullorContributing Writer\n- Emily GarbuttEntertainment Writer\n- Amy West\n- Lauren MiliciSenior Writer, Tv & Film\n- Molly EdwardsDeputy Entertainment Editor\n- Anthony McGlynnContributing Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "Warner Bros. is reportedly struggling with the budget for the prequel 'Heat 2,' initially set at over $200 million and now reduced to about $170 million, leading them to consider partnerships with other studios or streamers, including Apple. Leonardo DiCaprio is in talks to join the cast, which could secure the film's future. Meanwhile, other upcoming films include Damien Chazelle's untitled prison drama with Cillian Murphy and Daniel Craig, and a reboot of 'American Psycho' potentially starring Patrick Schwarzenegger.",
  "argos_id": "IDQEUS2AY"
}