{
  "url": "https://www.businessinsider.com/left-california-moved-to-colorado-boulder-life-better-perks-2025-8",
  "authorsByline": "Emily Pennington",
  "articleId": "66fe78046e1246d3ab134c71e3a31964",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/687e5e7d85e81483682e5ced?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T14:10:01+00:00",
  "addDate": "2025-08-05T14:17:05.256479+00:00",
  "refreshDate": "2025-08-05T14:17:05.256480+00:00",
  "score": 1.0,
  "title": "After 20 years in Los Angeles, I moved to Boulder, Colorado. I'm happier, my social life is booming, and I still get so much sunshine.",
  "description": "I left Los Angeles, California, to live in Boulder, Colorado. I have more space for less, and my move has benefited my social life and health.",
  "content": "When I was younger, living in a big city like Los Angeles or New York seemed like the epitome of hipness and culture to me.I wanted to be in the middle of the action, to be able to stroll down my block for a cocktail and thumping music or hit up the newest Ethiopian restaurant on a whim.Once I finally moved to Los Angeles, I loved it. As an outdoorsy person, I even felt spoiled by its mild winters, solid hiking trails I could drive to, and year-round sunny weather.But after 20 years of living there, my dreams of making it big as a film producer were waning just as my career as an outdoor journalist was soaring.Leaving a big city in search of cheaper rents and improved outdoor access was on my radar. I craved change, and knew I should leave if I ever wanted to own a place.The increased frequency of summer heat waves and even worse traffic during my years in the city might have been the final nails in the coffin.I knew my ideal new city would have to be pretty lively, with sunny weather, more access to the outdoors, and desirable real estate I could more reasonably afford.After many weeks of careful online research, I settled on the small Colorado city of Boulder with a population of just over 100,000. I still haven't looked back.One of the first things on my Boulder to-do list was to find a well-priced condo and snatch it off the market before I got left behind.To be honest, the real-estate market in Boulder isn't wildly affordable. In fact, based on data from Zillow, the average home in Boulder is about as much (or a little more) than the average home in Los Angeles.However, I feel really happy with what my money has gotten me here.For $450,000, I ended up in a gorgeously updated two-bedroom, two-bathroom unit from the 1970s with mature landscaping, great neighbors, and an absolutely stunning mountain view.In Los Angeles, something similar in one of my preferred neighborhoods would've easily cost far more.Finally, at the ripe age of 37, I have my own office, which doubles as a guest room. Plus, later on, I had plenty of space for my partner and a lab mix to move in.Boulder is famously said to have over 300 days of sunshine each year.I can't say for sure if that's true, but I do get tons of it, which helps make the Colorado city an outdoor lover's paradise. Within a 15-minute drive, I have access to world-class hiking in the Flatirons, a farmers market, and miles of well-planned bike paths.Because of this, it's been so easy to find friends who also love the outdoors.Within one month of moving to Colorado, friends from across the country had added me to group texts and email chains with their Boulder connections, setting me up with a bevy of new hiking pals.I met a fellow outdoorsy author with a cute mutt, a former mountaineer, and loads of people to go skiing with in the winter months.Being able to join a handful of new women's hiking groups helped me build my social groups, too.Beyond building my circle, all that access to the outdoors has vastly improved my mental health. I feel freer, more relaxed, and less anxious living in the center of a small city.When I moved to Colorado, I had no idea that the folk and bluegrass music scenes were so legendary in Boulder County.In just about every season of the year, there's some kind of outdoor music festival happening in city parks, at local craft breweries, or at the storied Planet Bluegrass. Here, you're just as likely to stumble across a badass banjo player busking on the Pearl Street Mall as you are at a major music venue.In order to keep my hands busy and foster a sense of community during the cold, dark winter months, I picked up a guitar and started a folk band with my boyfriend.It's something I never would have dreamed of doing when I lived in LA, but I'm proud to say that Trouble's Braids has been steadily gigging all across the Front Range for over a year.Moving to Boulder was the absolute right decision for me.There are some things I miss about living in a big city. For example, I have more limited late-night options since many local restaurants close by 8:30 p.m. I also don't have as much access to big events, and I have to drive for an hour to go to a concert at Red Rocks or see a musical in Denver.However, the nearness of the natural world is an invaluable addition to my lifestyle. It's helped me build new relationships with like-minded outdoorsy people, and I have built many connections that I treasure.I don't know where I'd be if I had stayed in Los Angeles, but I'm really glad I'm here instead.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "city parks",
      "weight": 0.06951934
    },
    {
      "name": "Los Angeles",
      "weight": 0.064777456
    },
    {
      "name": "improved outdoor access",
      "weight": 0.06446841
    },
    {
      "name": "new hiking pals",
      "weight": 0.064451516
    },
    {
      "name": "outdoor music festival",
      "weight": 0.06410317
    },
    {
      "name": "Boulder",
      "weight": 0.06379984
    },
    {
      "name": "Boulder County",
      "weight": 0.06330879
    },
    {
      "name": "more access",
      "weight": 0.060241368
    },
    {
      "name": "many local restaurants",
      "weight": 0.056422755
    },
    {
      "name": "new relationships",
      "weight": 0.05604285
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Travel Guides & Travelogues",
      "score": 0.71826171875
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.6005859375
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.55908203125
    }
  ],
  "sentiment": {
    "positive": 0.3544922,
    "negative": 0.25048828,
    "neutral": 0.3947754
  },
  "summary": "After 20 years living in Los Angeles, author Sarah Kohn moved to Boulder, Colorado, seeking cheaper rents and improved outdoor access. Kohn found a new home in Boulder with a population of over 100,000, and settled with a well-priced condo for $450,000. She credits her new lifestyle to building relationships with outdoorsy people and feeling freer, more relaxed, and less anxious living in a small city. Despite the lack of affordable housing, Kohn credits Boulder's outdoor lover's paradise with its 300 days of sunshine each year. Kohan also credits the city's folk and bluegrass music scenes for their success. Despite living in LA, she misses some things about living near the big city, including late-night events and limited access to big events.",
  "shortSummary": "After 20 years in Los Angeles, Boulder, Colorado, has transformed my life and social life, thanks to affordable real estate and outdoor access, enhancing my social life and mental health.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "248d7f78670142e99792b9fe6120092b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "After 20 years in Los Angeles, the author moved to Boulder, Colorado, seeking a more affordable lifestyle and better access to the outdoors. Despite the real estate market being similar in price to LA, they found a beautiful condo and experienced improved mental health and social connections through outdoor activities and music. The move has allowed them to pursue new interests, such as forming a folk band, while enjoying the vibrant local culture and natural beauty.",
  "argos_id": "Y8LK764V5"
}