{
  "url": "https://nypost.com/2025/09/03/entertainment/prince-harrys-demands-for-royals-before-uk-visit-revealed-report/",
  "authorsByline": "Nika Shakhnazarova",
  "articleId": "da6b2cbaaeca4f1dad4a58e1f03a4021",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/110592317.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T13:35:07+00:00",
  "addDate": "2025-09-03T13:37:22.756611+00:00",
  "refreshDate": "2025-09-03T13:37:22.756612+00:00",
  "score": 1.0,
  "title": "Prince Harry demands to royals revealed before UK visit revealed — and one involves Meghan Markle: report",
  "description": "The Duke of Sussex has reportedly barked out a list of demands ahead of his rumored peace talks with King Charles.",
  "content": "Prince Harry has reportedly dished out a list of demands ahead of his upcoming trip to the UK — and the duke’s firm orders are said to have left palace courtiers “reeling.”\n\nThe Duke of Sussex, 40, will reportedly meet with his estranged father, King Charles, next week — marking their first in-person reunion in 20 months.\n\nBut in order for the rumored peace talks to take place, Harry has reportedly barked out several requests that need to be fulfilled by the Windsor clan, according to top celebrity publicist Rob Shuter.\n\nIn his most-recent Substack, Jennifer Lopez’s former PR honcho claimed that insiders close to the “Spare” author revealed some of the things on Harry’s alleged list.\n\nAmong those is “full security” for himself and his family, “press control” that will be “coordinated by Buckingham Palace,” and finally, for his wife, Meghan Markle, to be treated as HRH “complete with bows and curtsies” if she attends.\n\n“For William, that’s a hard no,” a source told Shuter. “Harry doesn’t want another trip where he feels unprotected and exposed.”\n\n“He wants iron-clad guarantees — not vague promises. Security and privacy are non-negotiable,” the insider added.\n\nThe Invictus Games founder previously insisted that having his family join him on future trips to the UK was not an option without “full police protection” — for which he lost his appeal earlier this year.\n\nIt’s understood, however, that Harry will be flying solo as his wife — who has not set foot in the UK since September 2022 — will remain in Montecito, Calif., with their two children, Archie, 6, and Lilibet, 4.\n\nFollow The Post’s royal family live blog for the latest pics, news, exclusive details and more\n\nElsewhere, another insider claimed that King Charles “wants peace and to see his son, but these demands risk blowing open old wounds.”\n\n“Harry’s offering reconciliation — but at a price. And that price includes the entire royal family bowing to Meghan,” a source said.\n\nThe Post has reached out to Harry’s reps, as well as Buckingham and Kensington Palaces for comment.\n\nThe former working royal’s upcoming UK dash coincides with the third anniversary of Queen Elizabeth II’s death.\n\nIt also comes weeks after Harry’s press team was seen meeting with the monarch’s communications secretary for a top-secret discussion in London.\n\nWhile the rumored meet-up may suggest that things are heading in the right direction, Harry claimed in May that his cancer-stricken father was not speaking to him.\n\nStill, the father of two — who has been married to the “Suits” alum, 44, since 2018 — told the BBC that he would “love a reconciliation” with his estranged family.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/09/02/entertainment/king-charles-faces-pushback-over-harry-peace-talks-as-prince-william-calls-it-a-terrible-idea-report/",
    "https://nypost.com/2025/05/02/entertainment/prince-harry-loses-final-bid-for-taxpayer-funded-security/",
    "https://nypost.com/terms",
    "https://nypost.com/2025/07/15/entertainment/prince-harry-broke-this-cardinal-rule-ahead-of-secret-peace-talks-with-king-charless-aides-expert/",
    "https://nypost.com/privacy",
    "https://nypost.com/2025/09/02/entertainment/worlds-best-tennis-players-flock-to-this-nyc-italian-joint-during-us-open/",
    "https://robshuter.substack.com/p/exclusive-prince-harry-lays-out-demands",
    "https://email.nypost.com/",
    "https://nypost.com/2025/09/03/entertainment/dwts-season-34-cast-revealed-alix-earle-robert-irwin-more/",
    "https://nypost.com/2025/05/02/world-news/prince-harry-reveals-he-wants-reconciliation-with-royal-family-in-bombshell-bbc-interview/",
    "https://nypost.com/2025/08/20/entertainment/royal-family-live-updates-news-and-photos-aug-20-21-22-2025/",
    "https://nypost.com/2025/08/29/entertainment/prince-harry-to-meet-with-king-charles-during-uk-return-as-william-rejects-invitation-report/",
    "https://nypost.com/2025/09/02/entertainment/jack-osbourne-slams-pathetic-roger-waters-over-ozzy-osbourne-comments/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Prince Harry",
      "weight": 0.08479295
    },
    {
      "name": "Harry",
      "weight": 0.08394576
    },
    {
      "name": "UK visit",
      "weight": 0.07052193
    },
    {
      "name": "UK",
      "weight": 0.06839497
    },
    {
      "name": "Meghan Markle",
      "weight": 0.06363553
    },
    {
      "name": "top celebrity publicist Rob Shuter",
      "weight": 0.06273743
    },
    {
      "name": "King Charles",
      "weight": 0.05922314
    },
    {
      "name": "future trips",
      "weight": 0.058735717
    },
    {
      "name": "Buckingham Palace",
      "weight": 0.05391985
    },
    {
      "name": "Meghan",
      "weight": 0.052300945
    }
  ],
  "topics": [
    {
      "name": "Royal Family"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9873046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.888671875
    },
    {
      "name": "/Law & Government/Government/Royalty",
      "score": 0.69921875
    }
  ],
  "sentiment": {
    "positive": 0.07187479,
    "negative": 0.6163724,
    "neutral": 0.31175283
  },
  "summary": "Prince Harry has reportedly made a list of demands ahead of his upcoming UK trip, which includes a meeting with his estranged father, King Charles, marking their first in-person reunion in 20 months. The demands reportedly include full security for himself and his family, press control for Buckingham Palace, and for Meghan Markle to be treated as HRH if she attends. These demands have left palace courtiers \"reeling,\" according to celebrity publicist Rob Shuter. Despite this, Harry has previously stated that having his family join him on future trips to the UK without full police protection.",
  "shortSummary": "Prince Harry has demanded full security and proper treatment for Meghan Markle during his upcoming UK visit, amid ongoing tensions with his father.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d321cf5431a9417e92c1e45139cfb52e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/09/02/entertainment/worlds-best-tennis-players-flock-to-this-nyc-italian-joint-during-us-open/",
      "text": "World’s best tennis players flock to this NYC Italian joint during US Open: ‘They love it here’\nGame, set, mangia!\nUS Open stars are loading up on the carbs before their matches at a tony Midtown Italian joint — where they dine near each other at night before trying to take one another down in Flushing.\n“Jannik Sinner, he like the pasta with the bolognese sauce,” said Gustavo Hodzic, a co-owner of the hot spot Osteria Delbianco, to The Post on Tuesday, referring to the 24-year-old tennis sensation from Italy.\nThe East 49th Street eatery is so popular with Open aces that No.1-ranked Sinner and his 22-year-old court rival, No. 2 star Carlos Alcaraz of Spain, showed up to dinner there on the same night last week.\n“We run into each other. Just was a coincidence,” Alcaraz later told reporters of the pair’s chance encounter Thursday around 9 p.m. “It is a good restaurant.”\nIt must be. The Spaniard dropped in a second time Monday.\nThe 2022 US Open victor has since advanced to the semifinals in Queens after knocking out the Czech Republic’s Jiří Lehečka — another Delbianco devotee — on Tuesday in straight sets.\nSinner, the defending champ, will do battle in the quarterfinals Wednesday with fellow countryman Lorenzo Musetti, who himself dined at the Osteria on Sunday.\nThis pasta clearly packs a punch.\nPlayers such as Andrey Rublev, Lorenzo Musetti, Leylah Fernandez and Jasmine Paolini have also eaten at the restaurant during the tournament.\nConvenience is key. Many tennis pros stay in Midtown East hotels, in close proximity to the eatery, whose cuisine is inspired by chef Diego Bigucci’s upbringing in the Emilia-Romagna region of Italy. There’s also the restaurant’s warm Italian vibe.\n“They feel very relaxed [here]. They feel at home,” co-owner Dorjan Kalaja said of the space’s famous tennis customers.\nFollow along for The Post’s live coverage of the 2025 US Open\n“They love it here,” he said. “They create such a wonderful atmosphere when they are here. People love them. Now we have a personal relationship with them.”\nBut Sinner, who hails from Innichen in northern Italy, is special to the place.\n“Sinner, he like to cook — a good Italian cook,” Bigucci said. “Simple, traditional Italian cook. The father was a chef, worked in the kitchen as well. He likes the more traditional Italian food, what we do here.\n“I’m proud of him.”\nAlthough the meeting between the top seed and his fellow tennis titan from Spain was unplanned, the duo didn’t clash at the eatery like they do on court, Hodzic noted.\n“Sinner came first, and after that, as soon as Alcaraz came in, they start talking and stuff, you know, like friends,” the chef said. “They talked, they laughed. [They had] a very good time.”\nSinner, who first started dining at Osteria Delbianco in 2020 shortly after it opened, knows his noodles, workers said.\nBut he’s also a fan of the veal and scallops.\nOn Monday, Alcaraz scarfed down the gnocchi with a “little ragu and truffle” and with a side of grilled fish and roasted potatoes, Hodzic said.\nIn the past, the Spanish ace has enjoyed the chicken diavolo and and risotto, alongside salmon.\nHe brought along a huge entourage of 11, including his father Carlos Alcaraz González, and his coach, former World No. 1 Juan Carlos Ferrero, on Monday.\n“Around 8:30 p.m., Alcaraz’s coach came in the door with two other people,” Hodzic said. “We were busy. He told me, like, ‘Do you have a table for us?’ I said, ‘Of course.’ That corner table I left empty — if somebody coming, a player.”\nNow into week two of the Open, there aren’t many players left standing.\nBut Alcaraz and Sinner are still going strong.\nSo far this year, the Spanish hotshot and Italian big-hitter have met at finals of the French Open, where Alcaraz won, and Wimbledon, where Sinner took the trophy.\nNext up could be at Sunday’s final in Arthur Ashe Stadium — or over a plate of pasta."
    },
    {
      "url": "https://nypost.com/2025/07/15/entertainment/prince-harry-broke-this-cardinal-rule-ahead-of-secret-peace-talks-with-king-charless-aides-expert/",
      "text": "Prince Harry broke this ‘cardinal rule’ ahead of secret peace talks with King Charles’ aides: expert\nPrince Harry broke a “cardinal rule” in the lead up to last week’s secret peace talks between his communications team and King Charles’ press rep, according to a royal expert.\nRoyal commentator Charlotte Griffiths claims the Duke of Sussex breached a fundamental protocol by publicly discussing private matters concerning his estranged family.\nAfter Harry aired out his family’s dirty laundry on several public platforms — including the bombshell 2021 sit-down interview with Oprah Winfrey, his and Meghan Markle’s tell-all Netflix series and his memoir “Spare” — the king is now very cautious when interacting with his youngest son, Griffiths claims.\n“I think he would be willing to meet his demands and it is a pretty simple demand, it is ‘if I talk to you, can it not leak out on Oprah Winfrey or any other program?'” Griffiths said of the king’s requirements for any future communication with the exiled royal.\n“Harry really wants reconciliation and to be able to freely speak to his father, at the moment he cannot get through to his father, he has to go through his aides,” she added.\n“What will definitely happen is some ground rules for communications. What Harry cannot do is repeat what goes on in private conversations,” she noted.\nIn an interview with the BBC in May, Harry said he would “love a reconciliation” with his cancer-stricken father as the Invictus Games founder alluded to King Charles’ health being far worse than His Majesty has let on.\n“I don’t know how much longer my father has,” Harry told the outlet, claiming the king “won’t speak” to him.\nAccording to Griffiths, Harry’s choice of words weren’t received well at Buckingham Palace.\n“Harry said ‘we don’t know how much time my father has left’ and that went down extremely badly, that’s why this story is so surprising,” she said. “He broke the cardinal rule which was speculating on the king’s health.”\nPrince Harry’s fueling of public speculation about his ailing father was a clear violation of royal protocol, Griffiths added.\nWhile reps for the Sussexes, Meredith Maines and Liam Maguire were spotted chatting to Tobyn Andreae, the monarch’s communications secretary, the meeting notably excluded Prince William and Princess Catherine’s communications team.\nAccording to the royal commentator, the future king, 43, has no interest in mending fences with his estranged brother.\n“William is in perfect health and is in no rush to make amends with his brother,” she noted.\n“I think the king will have let William know this was his approach and there would have been a certain conversation. But I don’t think William will want to get involved,” Griffiths said.\nGriffiths added that the king’s health woes might be the reason behind his willingness to reconcile.\n“I think this is driven by the king’s health in the respect that the king is very circumspect at the moment and is perhaps in a more forgiving place,” she added."
    },
    {
      "url": "https://nypost.com/2025/05/02/entertainment/prince-harry-loses-final-bid-for-taxpayer-funded-security/",
      "text": "Prince Harry loses final bid for taxpayer-funded UK security\nPrince Harry has lost his appeal against the UK government over taxpayer-funded security.\nDuring a two-day hearing at a London court last month, the Duke of Sussex, 40, claimed he had been singled out for “unjustified and inferior treatment” when he and his family were stripped of their publicly funded security detail.\nOn Friday, Sir Geoffrey Vos, Lord Justice David Bean and Lord Justice Andrew Edis announced the ruling — which comes as a huge blow to the “Spare” author and his wife, Meghan Markle, who has refused to return to the UK following Queen Elizabeth II’s funeral in September 2022.\nThe appeal was widely considered Harry’s final shot at winning back the security detail.\nIt is not yet known whether the Invictus Games founder will be allowed to apply for permission to appeal to the Supreme Court following the ruling.\nDelivering the ruling, Vos noted that while Harry’s arguments were “powerful and moving,” he “could not say that the duke’s sense of grievance translated into a legal argument for the challenge to” the decision by the Royal and VIP Executive Committee (RAVEC).\n“The conclusion, in my judgment, with which my colleagues Lord Justice Bean and Lord Justice Edith agreed, was that the Duke of Sussex’s appeal would be dismissed,” he added.\nThe Home Office, which has ultimate legal authority over RAVEC, rejected Harry’s appeal.\nIts legal team asserted that the decision was made in an exceptional context and that there were no valid grounds to contest it.\n“The duke was in effect stepping in and out of the cohort of protection provided by RAVEC,” Vos said while reading a summary of the court’s decision Friday.\n“Outside the UK, he was outside the cohort, but when in the UK, his security would be considered as appropriate.”\n“It was impossible to say that this reasoning was illogical or inappropriate, indeed it seemed sensible,” he said, adding that the decision was “understandable and perhaps predictable.”\nThe Post has reached out to Harry’s reps for comment.\nDuring his April court hearing, Harry complained about not feeling safe enough to return to his home soil with his wife and their two children, Prince Archie and Princess Lilibet, because “it is too dangerous.”\nThe duke’s lawyers added that the UK’s treatment of him was “unlawful and unfair,” and warned of “the impact on the UK’s reputation of a successful attack” against him.\nHarry’s legal team also mentioned the duke’s failed bid to hire armed bodyguards from London’s Metropolitan Police on his own dime — a request that was refused last year.\nIn February 2024, London’s High Court ruled to strip the Sussexes of taxpayer-funded UK security protection.\nThe father of two — who lives in Montecito, California, with his family — was ordered to pay 90% of the UK Home Office’s legal costs for defending the court’s initial ruling.\nSir Peter Lane, the judge of the High Court, ruled that there was no unlawfulness in stripping the Sussexes of their security in February 2020 following their shocking departure from royal life the month prior.\nFollowing the ruling, Harry has made it his mission to win the security detail back for him and his family — but has notably received zero help from the royals."
    },
    {
      "url": "https://nypost.com/2025/09/03/entertainment/dwts-season-34-cast-revealed-alix-earle-robert-irwin-more/",
      "text": "‘DWTS’ Season 34 cast revealed: Hilaria Baldwin, Alix Earle, Robert Irwin, Corey Feldman and more\nWe can’t tap dance around this star-studded lineup.\nViewers are gearing up for the Season 34 premiere of “Dancing with the Stars” on Sept. 16. And ahead of the first episode, ABC revealed the official cast list on “Good Morning America” on Wednesday.\nThe celebrities and their pro partners competing this season are:\n- Social media star Alix Earle and Valentin Chmerkovskiy\n- Wildlife conservationist Robert Irwin and Witney Carson\n- “The Secret Lives of Mormon Wives” star Jen Affleck and Jan Ravnik\n- “The Secret Lives of Mormon Wives” star Whitney Leavitt and Mark Ballas\n- Alec Baldwin’s wife, Hilaria Baldwin, and Gleb Savchenko\n- Olympic gymnast Jordan Chiles and Ezra Sosa\n- “The Traitors” star Dylan Efron and Daniella Karagach\n- NBA star Baron Davis and Britt Stewart\n- “Boy Meets World” star Danielle Fishel and Pasha Pashkov\n- Comedian Andy Richter and Emma Slater\n- “The Parent Trap” actress Elaine Hendrix and Alan Bersten\n- Actor Corey Feldman and Jenna Johnson\n- Pentatonix singer Scott Hoying and Rylee Arnold.\n- Fifth Harmony singer Lauren Jauregui and Brandon Armstrong.\nJudges Carrie Ann Inaba, Bruno Tonioli and Derek Hough are also returning to the ballroom. Alfonso Ribeiro is back to host alongside co-host Julianne Hough.\nIn August, Derek confessed that he wouldn’t be opposed to performing on “DWTS” alongside his sister again.\n“We should,” the dancer-turned-judge told US Weekly. “That door is always open for us to get together and do something fun, especially on ‘Dancing with the Stars.'”\nDerek also teased the upcoming season.\n“I don’t know what that means these days, but I guess that’s a phrase that people use,” he detailed. “Tea will be spilled. I think there’s a lot of energy. There’s a lot of momentum with ‘Dancing with the Stars’. … I think that momentum is gonna carry through into this one and it’s already feeling bigger than it’s ever been before we’ve even started. I think it’s going to be a big season.”\nFor some contestants, their journey to the ballroom came as a total shock.\nDuring the “Secret Lives of Mormon Wives” reunion special in July, host Nick Viall revealed that both Jen Affleck and Whitney Leavitt were picked to compete.\nMany of this year’s contestants have spoken out about joining the long-running competition series.\n“I seriously can not wait for this journey! Dance has always been apart of my life. tysm @dancingwiththestars I’m coming for that 🪩✨,” Leavitt, 32, wrote on Instagram shortly after.\nIn May, Earle, 24, gushed over the opportunity.\n“I’ve always been a fan of ‘Dancing with the Stars,’” she said during a “Good Morning America” interview. “I used to watch it when I was so young with my grandma, and she would always say to me, ‘Maybe one day you could be on there.’”\n“I was so in love with dance,” Earle, who was a competitive dancer in high school, continued. “I’m ready to challenge myself, I think it’s gonna be a lot of fun. So it was a very obvious answer to say yes.”\nThe son of the late Steve and Terri Irwin also expressed his gratitude for the iconic franchise.\n“I am over the moon to be joining ‘Dancing with the Stars’ this season,” Robert, 21, told E! News in April. “It hasn’t sunk in yet. I’m ready to hit the ballroom. Let’s go, let’s do this. I don’t know how my dance moves are, but I’m gonna give it 110 percent anyway.”\n“Any exciting new project and really bring it back to the central message that we have which is conservation and protecting animals.”\nRobert also reminisced on his sister Bindi’s Season 21 win.\n“I was 11 years old when she did the show, a decade ago,” the zookeeper shared. “I just sat there watching in the crowd every night. I was so proud of her.”"
    },
    {
      "url": "https://nypost.com/2025/05/02/world-news/prince-harry-reveals-he-wants-reconciliation-with-royal-family-in-bombshell-bbc-interview/",
      "text": "Prince Harry reveals King Charles ‘won’t speak’ to him, claims he wants ‘reconciliation’ with royal family in bombshell BBC interview\nPrince Harry said he would “love a reconciliation” with the British Royal family — but his father, King Charles III, “won’t speak” to him.\nThe Duke of Sussex, 40, told the BBC that he is willing to move on from the disagreements that have marred the Royal household since he and wife Meghan Markle’s departure because he doesn’t “know how much longer” his father, who is battling cancer, has left.\n“There have been so many disagreements between myself and some of my family,” he told the outlet.\nBut he said he’s since “forgiven” them.\n“I would love reconciliation with my family. There’s no point continuing to fight anymore, life is precious,” Harry said.\nHis latest clash with the king stems from Harry’s appeal to maintain his tax-payer funded security detail since moving to America — which he lost on Friday.\nThe legal team behind the decision said it would not be appropriate for Harry to have the publicly-paid-for security since shirking his royal duties.\nHarry said Charles “won’t speak to me because of this security stuff” — but admitted “I can’t see a world in which I would bring my wife and children back to the UK at this point,” he told the BBC after the court defeat.\nIn a rare statement, Buckingham Palace told the BBC: “All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.”\nThe prince called the legal showdown a “good old-fashioned establishment stitch up,” and said he believes the Royal Family influenced the outcome.\n“I’m devastated — not so much as devastated with the loss that I am about the people behind the decision, feeling as though this is okay. Is it a win for them?” he questioned.\n“I’m sure there are some people out there, probably most likely the people that wish me harm, [who] consider this a huge win,” he added.\nDuring a two-day hearing at a London court last month, Harry claimed he had been singled out for “unjustified and inferior treatment” when he and his family were stripped of their security detail when they stepped away from Royal life.\nOn Friday, Sir Geoffrey Vos, Lord Justice David Bean and Lord Justice Andrew Edis announced the ruling — a blow to Harry and his wife, Meghan Markle, who has refused to return to the UK following Queen Elizabeth II’s funeral in September 2022."
    },
    {
      "url": "https://nypost.com/privacy",
      "text": "Last Modified: January 7, 2025\nNYP Holdings, Inc. (“Company,” “we,” “us,” or “our”), publisher of the New York Post, understands and respects that you care about your personal data and how it is used. We respect your privacy, as further described in our full Privacy Notice. These highlights set out some points about how we treat your personal data.\nPlease review the full Privacy Notice to understand our privacy practices.\nPRIVACY NOTICE SCOPE\nCompany owns, operates, or provides access to print publications, websites, mobile applications and direct marketing programs (collectively, the “Services”). Our Privacy Notice applies to those Services and describes how we treat your personal data when you use the Services. Our Privacy Notice describes in detail what information we collect about you, why we collect it, what we do with it and how to contact us about our privacy practices.\nCOLLECTION OF INFORMATION\nWe collect personal data from a variety of sources, including:\n- Information you provide directly to the Services;\n- Information about you that our Company affiliates may also have;\n- Information about you from third party sources, including public and commercially available sources; business partners; third party social media networks;\n- Information about your device and browsing activities on the Services, including through cookies and other similar technologies.\nUSE OF INFORMATION\nOur use of the personal data we collect will depend on the way you interact with the Services. For example, we may use the information we collect to:\n- Provide our products and Services;\n- Improve your experience with our products and Services;\n- Understand your interests and tell you about products and Services we think you will value;\n- Communicate with you and respond to your requests or questions;\n- Otherwise, as we may notify you at the point of collection or with your consent.\nYOUR CHOICES AND RIGHTS\nAs described further in our Privacy Notice, you have certain choices and rights related to the information we collect about you, including:\n- You have the opportunity to access, update and correct contact information that you choose to share with us, subject to applicable law.\n- You can stop receiving commercial email messages from a Service by submitting a request to us as outlined in the Contact Us section or as outlined in the Your Choices section.\n- You have choices about the collection and use of your information by third parties to display\nrelevant advertisements, as described in our Cookie Notice.\nSHARING OF INFORMATION\nWe may share your information in certain situations, including:\n- Where we have obtained your consent, including video content and social networking services as described in our Video Services Notice and Social Networking Notice;\n- With our subsidiaries and affiliates https://newscorp.com/about/our-businesses/\n- With our third party service providers;\n- With our business partners, who sponsor a contest or promotion, or who jointly offer services with our Services;\n- With third parties for those parties’ own marketing or other commercial purposes;\n- If the Company or the Services is merged with or is sold to another company;\n- To comply with the law or to protect or defend the rights of the Company or our users.\nADDITIONAL INFORMATION\nWe maintain administrative, technical and physical safeguards to protect and secure your information, but no data transmission or storage, or use of the Internet, can be guaranteed to be 100% secure.\nFor more information about our privacy practices, please review the full Privacy Notice.\nCONTACT US\nIf you have questions, comments or concerns regarding our privacy practices or the Privacy Notice, or wish to update your information, please contact us at privacy@nypost.com.\nYou may also write to us using the postal address listed below:\nNYP Holdings, Inc.\nAttention: Privacy Lead\n1211 Avenue of the Americas\nNew York, NY 10036\nCALIFORNIA PRIVACY RIGHTS\nThe Californian Shine the Light Law, the California Consumer Privacy Protection Act (CCPA) and the California Privacy Rights Act (CPRA) provide certain rights to residents of California. For additional information for California residents, click here.\nOTHER US STATE PRIVACY RIGHTS\nThe laws of certain US States each provide certain rights to their respective residents. For additional information for those residents, click here.\nUK/EU/EEA PRIVACY RIGHTS\nThe GDPR provides certain rights to residents of the United Kingdom, European Union and European Economic Area. For additional information, click here.\nPlease click here to review the full Privacy Notice"
    },
    {
      "url": "https://robshuter.substack.com/p/exclusive-prince-harry-lays-out-demands",
      "text": "EXCLUSIVE: PRINCE HARRY LAYS OUT DEMANDS BEFORE MEETING KING CHARLES\nPLUS: DESIGNERS CLAMOR TO DRESS TAYLOR SWIFT’S “DIANA-LEVEL” WEDDING GOWN, AND JIMMY FALLON & SETH MEYERS FACE UNCERTAIN FUTURE POST-LORNE MICHAELS\nEXCLUSIVE: PRINCE HARRY’S ROYAL SHOWDOWN DEMANDS\nDespite reports, Prince Harry’s long-awaited reunion with King Charles isn’t happening without strings attached. Palace insiders tell #ShuterScoop the Duke of Sussex has issued a list of demands so bold it has royal courtiers reeling.\nAccording to sources, Harry, 40, is demanding three major concessions before he’ll agree to sit down with his cancer-stricken father:\n• Full security for himself, Meghan, and their children while in the UK — funded by the King.\n• Press control coordinated by Buckingham Palace to keep paparazzi at bay.\n• Meghan treated as HRH — complete with bows and curtsies, despite her stepping down as a working royal.\n“Harry doesn’t want another trip where he feels unprotected and exposed,” one insider explains. “He wants iron-clad guarantees — not vague promises. Security and privacy are non-negotiable.”\nThe Meghan clause, however, is the real flashpoint. “Harry insists Meghan must be treated as HRH,” the source stresses. “That means family member must show her the formal respect of bows and curtsies. For William, that’s a hard no.”\nCharles, insiders say, is torn. “He wants peace and to see his son,” one palace veteran explains. “But these demands risk blowing open old wounds.”\nAs one courtier put it: “Harry’s offering reconciliation — but at a price. And that price includes the entire royal family bowing to Meghan.”\nEXCLUSIVE: DESIGNERS LINING UP TO DRESS TAYLOR SWIFT — “THE MOST IMPORTANT GOWN SINCE PRINCESS DIANA’S WEDDING”\nTaylor Swift’s wedding to NFL superstar Travis Kelce isn’t just a cultural moment — it’s the fashion world’s Super Bowl. Industry insiders tell #ShuterScoop that top designers across the globe are battling for the once-in-a-lifetime honor of creating her wedding gown.\n“This isn’t just a dress — it’s history,” one fashion executive gushes. “Taylor’s gown will be the most important since Princess Diana’s. Whoever lands it becomes immortal.”\nThe calls are already pouring in. Valentino, Versace, Dior, and Oscar de la Renta are all pushing for the job. Vera Wang, who famously designed gowns for Mariah Carey and Victoria Beckham, has made her interest known. “It’s a feeding frenzy,” whispers one insider. “Sketches, fabrics, archival ideas — everything’s being thrown at Taylor’s camp.”\nSwift, however, is playing her cards close. “Taylor knows the power she has,” a close friend says. “One dress, one designer, one photo — and the entire industry will be defined by it for decades.”\nThe stakes couldn’t be higher. “Forget the Oscars, forget the Met Gala,” says another source. “This gown will set trends worldwide. Brides from Des Moines to Dubai will want a piece of Taylor’s magic.”\nAs one fashion insider put it bluntly: “This isn’t a wedding. It’s the coronation of couture.”\nEXCLUSIVE: JIMMY FALLON & SETH MEYERS ‘ONLY SAFE WHILE LORNE MICHAELS IS AROUND’ — FUTURE IN DOUBT AFTER HIS RETIREMENT\nBehind NBC’s polished late-night facade, insiders whisper that Jimmy Fallon and Seth Meyers’ futures hinge on one man: Lorne Michaels.\nThe 80-year-old Saturday Night Live creator, who also executive produces The Tonight Show Starring Jimmy Fallon and Late Night with Seth Meyers, recently insisted both hosts are “safe” despite CBS abruptly axing Stephen Colbert. But #ShuterScoop hears that “safety” vanishes the moment Michaels retires.\n“Jimmy and Seth are protected because of Lorne — full stop,” one NBC insider explains. “Once he steps down, executives won’t hesitate to clean house.”\nRatings for both Fallon and Meyers have sagged, with viewers flocking to YouTube, TikTok, and podcasts. Fallon still delivers viral games and impressions, but insiders say it isn’t enough to justify his mega salary. “Without Lorne, there’s no buffer,” another source notes. “The knives are already out.”\nMichaels has hinted he’ll retire soon after SNL’s 50th anniversary season, leaving both hosts dangerously exposed. “He’s the kingmaker,” the insider adds. “But once the king leaves the throne, the palace gets rebuilt. And Jimmy and Seth may not be in it.”\nAs one rival network exec puts it: “Late-night is collapsing. Without Lorne, NBC will burn it down and start over.”\n#ShuterScoop"
    },
    {
      "url": "https://nypost.com/2025/08/29/entertainment/prince-harry-to-meet-with-king-charles-during-uk-return-as-william-rejects-invitation-report/",
      "text": "Prince Harry to meet with King Charles for first time in 20 months — as William rejects invitation: report\nPrince Harry is set to meet with his estranged father, King Charles, in the coming weeks, marking their first in-person reunion in a whopping 20 months, according to a report.\nThe Duke of Sussex, 40, will be jetting to the UK in early September for the annual WellChild Awards, and will meet up with the monarch, 76, during his time on home soil, the Mirror reports.\nAnd while insiders claim that a royal reconciliation is “within reach,” Prince William has seemingly rejected his brother’s invitation “out of hand.”\n“Nobody is pretending the wider family issues have been resolved, but this is about beginning with Charles and Harry,” a source told the outlet, adding that there is “determination on both sides to make this happen.”\n“For the first time in a long time, there’s a genuine sense that reconciliation is within reach,” the insider went on.\n“Prince Harry’s team and the Palace have opened a line of communication, and there is every hope that father and son will see one another when the Duke returns to London in September.”\nThe palace insider said there is a “feeling the time is right” to mend bridges — especially after the “Spare” author’s press team was seen meeting up with the monarch’s communications secretary for a top-secret discussion in London in July.\nWhile exact details remain under wraps, insiders claim the estranged father-son duo will have a “simple face-to-face conversation” rather than a “grand gesture or set-piece meeting.”\n“Privacy and dignity” have reportedly been highlighted as priorities, though sources note that the Prince of Wales had “rejected” his brother’s olive branch.\nThe Post has reached out to reps for Harry, Kensington Palace and Buckingham Palace for comment.\nThe September meetup may put the Charles in a tricky position as he’s set to welcome President Donald Trump at Windsor Castle for his upcoming state visit on Sept. 17.\nIt’s understood that Harry will be flying solo as his wife Meghan Markle — who has not set foot in the UK since September 2022 — will remain in Montecito, Calif., with their two children, Archie, 6, and Lilibet, 4.\nFollow The Post’s royal family live blog for the latest pics, news, exclusive details and more\nWhile it’s a step in the right direction, the cancer-stricken monarch’s lack of bond with Archie and Lilibet is said to have caused him great sorrow.\nThe last time Charles saw Archie and Lilibet was in June 2022, when the Sussexes returned for the late Queen Elizabeth II’s Platinum Jubilee celebrations. At the time, Archie was just 3 years old, while Lilibet was 1.\nHarry previously insisted that having his family join him on future trips to the UK was simply not an option without “full police protection” — for which he lost his appeal earlier this year.\nIn the same interview, the Invictus Games founder told the BBC that he would “love a reconciliation” with his estranged father, though he claimed the king “won’t speak” to him.\n“There have been so many disagreements between myself and some of my family,” he said in May.\n“I would love reconciliation with my family. There’s no point continuing to fight anymore, life is precious,” Harry said, adding that he has since “forgiven” them for their many “disagreements.”"
    },
    {
      "url": "https://nypost.com/2025/09/02/entertainment/king-charles-faces-pushback-over-harry-peace-talks-as-prince-william-calls-it-a-terrible-idea-report/",
      "text": "King Charles faces pushback over Harry peace talks as Prince William calls it a ‘terrible idea’: report\nKing Charles is reportedly facing internal pushback over his rumored upcoming peace talks with estranged son Prince Harry.\nThe monarch, 76, will reportedly meet with the Duke of Sussex, 40, next week — marking their first in-person reunion in 20 months.\nAnd while the duo’s meeting is sure to signal that things are heading in the right direction, insiders last week suggested that Prince William had rejected his brother’s invitation to chat.\nSources claim that the Prince of Wales, 43, strongly opposes his brother being granted any formal — or informal — audiences with members of the royal family.\n“Ultimately, William is a loyal soldier,” a friend of the future king told the Daily Beast.\n“He respects his father’s rank, and he respects his father’s right to make his own decisions, and he won’t make a fuss if it happens. But he thinks a Harry meeting is a terrible, terrible idea.”\nIndeed, fundamental issues remain that prevent the royals from fully burying the hatchet.\n“There are trust issues there, but the king misses his son [Harry],” the monarch’s former personal butler, Grant Harrold, exclusively told The Post.\n“William is worried that with the stuff Harry has said, he could use it to his advantage again … like he’s already done. I think, sadly, they don’t trust him. It’s a shame, because Harry wants them to.”\nThe Post has reached out to Buckingham and Kensington palaces for comment.\nFollow The Post’s royal family live blog for the latest pics, news, exclusive details and more\nPalace insiders said William is wary of meeting with Harry, fearing another breach of trust after past tell-alls in Harry’s memoir “Spare,” Netflix series “Harry & Meghan,” and the sit-down interview with Oprah Winfrey.\nHarry’s upcoming UK dash coincides with the third anniversary of Queen Elizabeth II’s death.\nIt also comes weeks after Harry’s press team was seen meeting with the monarch’s communications secretary for a top-secret discussion in London.\nIt’s understood that Harry will be flying solo as his wife, Meghan Markle — who has not set foot in the UK since September 2022 — will remain in Montecito, Calif., with their two children, Archie, 6, and Lilibet, 4.\nHarry previously insisted that having his family join him on future trips to the UK was not an option without “full police protection” — for which he lost his appeal earlier this year.\nIn the same interview, the Invictus Games founder told the BBC that he would “love a reconciliation” with his estranged father, though he claimed the cancer-stricken king “won’t speak” to him."
    },
    {
      "url": "https://nypost.com/2025/09/02/entertainment/jack-osbourne-slams-pathetic-roger-waters-over-ozzy-osbourne-comments/",
      "text": "Jack Osbourne slams ‘pathetic’ Roger Waters after Pink Floyd founder trashes late legend Ozzy Osbourne\nThe battle of the bands continues.\nJack Osbourne took to social media on Tuesday, Sept. 2, to slam Roger Waters after the Pink Floyd founder ridiculed Ozzy Osbourne in the wake of his shocking death.\n“Ozzy Osbourne, who just died, bless him in his whatever that state that he was in his whole life,” Waters, 81, told The Independent Ink during an interview last month. “We’ll never know. The music, I have no idea. I couldn’t give a f–k.”\n“I don’t care about Black Sabbath, I never did,” the “Comfortably Numb” bassist continued. “Have no interest in biting the heads off chickens or whatever they do. I couldn’t care less, you know.”\nAfter hearing Waters’ surprising remarks for the first time this week, Ozzy’s 39-year-old son rushed to Instagram to fire back at the “Hey You” musician for disrespecting his late father.\n“Hey [Roger Waters],” Jack wrote on his Instagram Stories. “F–k you. How pathetic and out of touch you’ve become.”\n“The only way you seem to get attention these days is by vomiting out bulls–t in the press,” the former “Osbournes” reality star continued. “My father always thought you were a c–t – thanks for proving him right.”\nOzzy and Sharon Osbourne’s only son ended his fiery message with a clown face emoji before returning to his Instagram Stories once more to share the hashtag “f–krogerwaters.”\nThe Post reached out to Waters’ rep for comment.\nThe Black Sabbath legend passed away on July 22 following a lengthy battle with Parkinson’s disease.\nSharon and Jack, as well as Ozzy’s children Aimee, 42, Kelly, 40, and Louis, 50, shared the devastating news in an emotional statement to The Post.\n“It is with more sadness than mere words can convey that we have to report that our beloved Ozzy Osbourne has passed away this morning,” they said at the time.\n“He was with his family and surrounded by love. We ask everyone to respect our family privacy at this time,” the “Crazy Train” singer’s loved ones added.\nOzzy played his final show with Black Sabbath on July 5 in Birmingham, England, with fellow rocker Tom Morello revealing the Prince of Darkness knew it would be his last performance.\n“The fact that he lived to play and feel that love and to one more time… You know, to do ‘Paranoid;’ to do ‘Crazy Train.’ If you have got to go — I mean, I wish Ozzy lived another 30 years — but if you’ve got to go out, it really felt like he knew,” the Rage Against the Machine co-founder recalled.\nHe also called Ozzy’s passing “a tragedy,” but added it was “a miracle” that he “lived as long as he did.”\nThe “Hellraiser” singer’s death certificate, obtained by the Sun, revealed that Ozzy died from cardiac arrest, acute myocardial infarction, coronary artery disease and Parkinson’s disease.\nHe was laid to rest near the lake of his Buckinghamshire home on July 31, with several fellow rock icons attending the private ceremony.\nThe day before his service, an emotional Sharon, Jack, Kelly and Aimee broke cover at his funeral procession, which was held in the streets of Ozzy’s hometown of Birmingham, England.\nOn Aug. 5, Jack broke his silence about his father’s death.\n“I haven’t really wanted to post anything since the passing of my father. My heart has hurt too much,” he wrote on Instagram with a video montage of their time together.\n“I’m gonna keep this short because he certainly hated long rambling speeches. He was so many things to so many people, but I was so lucky and blessed to be apart of a very small group that got to call him ‘Dad,'” Jack continued.\n“My heart is full of so much sadness and sorrow, but also so much love and gratitude. I got 14,501 days with that man and I know that is such a blessing,” he shared.\nHe concluded with a quote from Hunter S. Thompson, which Jack said “best describes my father.”\n“Grave with the intention of arriving safely in a pretty and well-preserved body… but rather to skid in broadside in a cloud of smoke, thoroughly used up, totally worn out, and loudly proclaiming, ‘Wow! What a ride!’ That was my dad. He lived and he lived his life fully,” Ozzy’s son wrote. “I love you dad.”"
    },
    {
      "url": "https://nypost.com/terms",
      "text": "Last Updated: January 7, 2025\nPlease read these TERMS OF USE (“Terms”) carefully. Your access to and/or use of the Services (as defined below) constitutes your legally binding agreement to be bound by these Terms.\nTHESE TERMS CONTAIN A MANDATORY ARBITRATION CLAUSE AND A WAIVER OF CLASS ACTION CLAUSE. PLEASE REFER TO AND READ SECTION 19 OF THESE TERMS.\nThese Terms govern your use of the websites, applications and software operated by NYP Holdings, Inc. (“Company”, “we”, “us” or “our”), publisher of the New York Post, to which these Terms are linked or referenced to, including all content, features and functionality, and related services such as emails, newsletters, sweepstakes and promotions (collectively, the “Services”). These Terms apply whether you are accessing the Services via a personal computer, wireless or mobile device, or any other technology or device (each, a “Device”). These Terms do not cover other services, websites or any corresponding content, features, and activities made available by any other company or third party, unless specifically stated. If you do not agree to these Terms, you may not access or use any portion of the Services.\nThese Terms apply to all users of the Services, whether or not you have registered for one or more of the Services, and by using the Services you agree to comply with these Terms and any additional terms and conditions that we provide to you in connection with your use of or access to same (“Additional Terms”). The Services may also provide rules of participation for certain activities within the Services, including, without limitation, contests, sweepstakes, membership programs, and other initiatives (“Rules”). The New York Post Privacy Notice (the “Privacy Notice”), the Additional Terms and the Rules together form a part of these Terms, and are incorporated herein by reference.\nWe reserve the right, at any time and from time to time, temporarily or permanently, in whole or in part, to modify, suspend or discontinue the Services; charge fees in connection with the Services; modify and/or waive any fees charged in connection with the Services; and/or make available opportunities to some or all users of the Services. You agree that neither we nor any of our affiliates shall be liable to you or to any other person for any modification, suspension or discontinuance of the Services or any component thereof.\nIf you are having any trouble accessing these Terms or the Services, please contact us at 800-552-7678 or refer to our support page at https://nypost.com/customer-service/ or send an email to help@nypost.com.\n1. Term. These Terms shall remain in full force and effect while you use the Services. You may terminate your use of or registration for the Services at any time, for any reason, and Company may terminate your use of or registration to the Services at any time, for any or no reason, with or without prior notice or explanation, and without liability or obligation to you or any third party. These Terms shall continue to apply to your previous access and/or use of the Services after any such termination.\n2. Modifications. We may modify these Terms from time to time and at any time in our sole discretion. Changes to these Terms of Use will be effective immediately or, if required by law, 30 days after notice to you, which may be given by posting the updated Terms of Use on our Service. Your use of the Services after these changes are made is subject to the Terms as modified thereby, and if you use the Services after they become effective it will signify your agreement to be bound by the changes. We recommend that you check back frequently and review these Terms regularly so you are aware of the most current rights and obligations that apply to you. The Last Updated legend at the top of this page indicates when these Terms was last revised. Customer service representatives are not authorized to modify these Terms of Use, either verbally or in writing, and any such modification shall have no effect.\n3. Eligibility; Compliance. Use of the Services is limited to users 16 years of age and older. By using the Services, you represent and warrant that (a) you are 16 years of age or older and (b) your use of the Services does not violate any applicable law, rule or regulation. Certain features of the Services may be subject to heightened age and/or other eligibility requirements. If you provide information that is untrue, inaccurate, not current or incomplete, or Company suspects that such information is untrue, inaccurate, not current or incomplete, Company has the right to suspend or terminate your registration (in whole or in part) and refuse any and all current or future use of the Services (or any portion thereof), in our sole discretion, with or without notice to you, and without liability or obligation to you. Company is based in the United States and the Services are provided from the United States. Company makes no representation or warranty that the Services or the Content (as defined herein) are appropriate or available for use in other locations. If you use the Services from a jurisdiction other than the United States, you agree to do so at your own risk, and you are responsible for complying with any and all local laws applicable to your use of the Services.\n4. Proprietary Rights.\n4.1 As between you and Company, Company owns, solely and exclusively, all right, title and interest in and to the Services and all content, data and information (including associated metadata) contained and/or made available through the Services (“Content”), and all such Content is protected, without limitation, under U.S. Federal and State, as well as applicable foreign laws, rules, regulations and treaties. The term “Content” includes, without limitation, all audio/visual content, artwork, photographs, illustrations, graphics, logos, copy, text, computer code, software, music (including the musical compositions therein), data, user interfaces, visual interfaces, information, materials, and all copyrightable or otherwise legally protectable elements of the Services, including, without limitation, the design, selection, sequence, look and feel, and arrangement of the Services, and any copyrights, trademarks, service marks, trade names, trade dress, patent rights, database rights and/or other intellectual property and/or proprietary rights therein (including with respect to any content contained and/or made available in any advertisements or information presented to you via the Services). Unless the context clearly requires otherwise or we explicitly set forth in writing, the term “Services” includes “Content” as well.\n4.2 The Services are to be used solely for your non-exclusive, non-assignable, non-transferable, non-commercial and limited personal use and for no other purposes. No other uses are permitted or authorized. You may not exceed the limited rights and access provided to you under these Terms. You must not alter, delete or conceal any copyright, trademark, service mark or other notices contained on the Services, including, without limitation, notices on any Content you transmit, download, display, print, stream or reproduce from the Services. All rights not expressly granted to you hereunder are reserved to us and our licensors.\n4.3 Except as expressly authorized by Company, you shall not, nor shall you allow any third party (whether or not for your benefit or otherwise) to, frame, scrape, reproduce, modify, create derivative works from, display, perform, publish, distribute, disseminate, broadcast or circulate to any third party (including, without limitation, on or via a third-party website or platform) any Content without the express, prior written consent of Company or its owner if Company is not the owner. You shall not nor shall you make it possible for others to – access, collect, text or data mine any Content from the Services by automated means or any other method, whether directly or through an intermediary, intended to circumvent the prohibitions set forth in this Section 4 (e.g., robot, spider, script, service, software or any manual or automatic device, tool or process). For the avoidance of doubt, you shall not use any Content for any machine learning or artificial intelligence (AI) purposes, including, but not limited to, developing, building, training, fine tuning, or grounding or otherwise utilizing in any large language models (LLMs), machine learning tools, or generative AI systems.\n4.4 Any unauthorized or prohibited use of any Content may subject you to civil liability, criminal prosecution, or both, under applicable federal, state, local laws, or applicable foreign laws, rules, regulations and treaties. We require users to respect our copyrights, trademarks, other intellectual property rights, and all other rights specified in these terms, and shall enforce same. We likewise respect the intellectual property of others. If you believe that the Services contain elements that infringe your copyrights in your work, please follow the procedures set forth in Section 10 below. You may not access parts of the Services to which you are not authorized, or attempt to circumvent any restrictions imposed on your use of or access to the Services. For clarity, your use of our Services and Content is only permitted as expressly set forth in these Terms and your rights are not expanded, nor are any prohibitions modified or limited, in any way by our use or configuration of exclusionary protocols (e.g., the Robots Exclusion Protocol as implemented through robots.txt files).\n4.5 Requests for permission to reprint individual articles or webpages can be made by submitting a request here.\n5. User Registration. In order to access and use certain content, features, or functionality of the Services, we may require that you register for the applicable Services and have a unique username and password combination (“User Credentials”) and provide certain additional information, which may include, without limitation, your email address, legal name, country of residence, zip code, etc., and, for fee-based transactions and purchases offered by us, your physical address, telephone number(s), and applicable payment data and information (collectively, a “User Account”). You represent and warrant that all registration and account information you submit is truthful and accurate and you shall maintain and promptly update the accuracy of such information. Further, if you elect to become a registered user of the Services, you are responsible for maintaining the confidentiality of your User Credentials, and you shall be responsible and liable for any access to or use of the Services by you or any person or entity using your User Credentials, whether or not such access or use has been authorized by you or on your behalf, and whether or not such person or entity is your employee or agent, including, without limitation, any fee-based transactions. It is therefore critical that you do not share your User Credentials with anyone. You agree to immediately notify Company of any unauthorized use of your User Credentials or User Account, or any other breach of security. It is your sole responsibility to (a) control the dissemination and use of your User Credentials and User Account, (b) update, maintain and control access to your User Credentials and User Account, and (c) cancel your User Account on the Services. We reserve the right to deny access, use and registration privileges to any user of the Services if we believe there is a question about the identity of the person trying to access any account or element of the Services. Company shall not be responsible or liable for any loss or damage arising from your failure to comply with this Section 5.\n6. Personal Information. We respect your privacy and the use and protection of your personal information. In the course of your use of the Services, you may be asked to provide certain personal information to us. Our information collection and use policies with respect to the privacy of such personal information are set forth in the Privacy Notice. We encourage you to read the Privacy Notice, and to use it to help make informed decisions. You acknowledge and agree that you are solely responsible for the accuracy and content of personal information. The Privacy Notice is available at https://nypost.com/privacy/.\n7. Payment, Pricing, and Related Terms. You must be 18 years of age or older to make any purchase (e.g., subscriptions, one-time purchases, etc.) of the Services, Content (as defined herein) or any other product or service offered through the Services by us. If you are less than 18 years of age, and want to make any such purchase, please ask your parent or guardian to complete the purchase on your behalf. You hereby agree to pay in full the prices and fees (including, without limitation, all applicable taxes) for any purchases that are made using your User Account(s) or other information you supply to us via an authorized payment method at the time of purchase. Company or its designees reserves the right to change any and all prices for any Services and Content, for any reason. Purchases may be governed by Additional Terms. Purchases may also be controlled, handled, processed and/or fulfilled by third parties not affiliated with Company (a “Third-Party Processor”). Where a Third-Party Processor is responsible for controlling, handling, processing or fulfilling a purchase, all payment and other obligations regarding such purchase may be governed by the terms of use/service and privacy notice(s) of the Third-Party Processor. Accordingly, you should familiarize yourself with the applicable terms and policies imposed by any Third-Party Processor. Company makes no warranty, and accepts no liability for loss or damage whatsoever, relating to purchases with a Third-Party Processor and you are solely responsible for any and all transactions utilizing your information (personal, financial or otherwise) with a Third-Party Processor, including, but not limited to any and all fees and charges. Moreover, you acknowledge and agree that in the event a Third-Party Processor experiences a data breach that affects your information (personal, financial or otherwise), Company will in no way be liable or responsible to you for such breach.\n8. User Conduct.\n8.1 You are solely responsible for your conduct in connection with the Services. We want to keep the Services enjoyable for everyone and the use of the Services for unlawful or harmful activities is not allowed. While using the Services, you will not:\n| (a) | engage in or encourage conduct that would violate any applicable law, rule, regulation, judicial or government order or give rise to civil liability or violate or infringe upon any intellectual property, proprietary, privacy, moral, publicity or other rights of ours or of any other person or entity; |\n| (b) | submit, post, email, display, transmit or otherwise make available through the Services any material or take any action that is or is likely to be unlawful, harmful, threatening, abusive, tortious, defamatory, libelous, deceptive, fraudulent, invasive of another’s privacy or publicity rights, harassing, profane, obscene, vulgar or that contains explicit or graphic imagery, descriptions or accounts of excessive violence or sexual acts (including, without limitation, sexual language of a violent or threatening nature directed at another individual or group of individuals), contains a link to an adult website or is patently offensive, promotes racism, bigotry, hatred or physical harm of any kind against any group or individual; |\n| (c) | submit, post, email, display, transmit or otherwise make available through the Services any material that you do not have a right to make available under any law, rule or regulation or under contractual or fiduciary relationships (such as inside information, proprietary or confidential information learned or disclosed as part of employment relationships or under nondisclosure agreements), or otherwise creates a security or privacy risk for any other person or entity; |\n| (d) | engage in or encourage conduct that affects adversely or reflect negatively on Company, its affiliates, or parent company, the Services, our goodwill, name or reputation or causes duress, distress or discomfort to us or anyone else, or discourage any person or entity from using all or any portion, features or functions of the Services, or from advertising or becoming a supplier to us in connection with the Services; |\n| (e) | submit, post, email, display, transmit or otherwise make available through the Services any material that contains a software virus, worm, spyware, Trojan horse or other computer code, file or program designed to interrupt, impair, destroy or limit the functionality of any computer software or hardware or telecommunications equipment; |\n| (f) | use the Services for commercial or business purposes, including, without limitation, engaging in barter arrangements, pyramid schemes, advertising, marketing or offering goods or services or exploiting information or material obtained on, through or in connection with the Services, whether or not for financial or any other form of compensation or through linking with another website or service; |\n| (g) | modify, disrupt, impair, alter or interfere with the use, features, function, operation or maintenance of the Services or the rights or use or enjoyment of the Services by any other user; |\n| (h) | impersonate any person or entity or falsely state or otherwise represent your affiliation with a person, or entity; |\n| (i) | forge headers or otherwise manipulate identifiers in order to disguise the origin of any content transmitted on, through or in connection with the Services; |\n| (j) | solicit passwords or personal identifying information for commercial or unlawful purposes from other users; |\n| (k) | engage in spamming, flooding, harvesting of email addresses, other personal information or content, “spidering”, “screen scraping”, “phishing”, “database scraping”, or any other activity designed to text and/or data mine with the purposes of collecting user data, other information or Content; or |\n| (l) | modify, reverse engineer, decompile or disassemble any part of the Services, whether in whole or in part, or create any derivative works from any part of the Services, or encourage, assist or authorize any other person to do so. |\nCompany assumes no responsibility for monitoring the Services for inappropriate content or conduct. If at any time Company chooses in its sole discretion to monitor the Services, Company nonetheless assumes no responsibility for User Postings (as defined herein), assumes no obligation to modify or remove any User Postings, and assumes no responsibility for the conduct of any user. Company reserves the right to investigate and take appropriate legal action against anyone who, in Company’s sole discretion, violates, or is suspected of violating, this Section 8, including, without limitation, reporting you to law enforcement authorities. Further, you acknowledge, consent and agree that Company may access, preserve and disclose your account and registration information and any other content or information if required to do so by law or if based on a good faith belief that such access, preservation or disclosure is reasonably necessary to (a) comply with the law or legal process; (b) enforce these Terms; (c) respond to claims that any content or information violates the rights of any third party; (d) respond to your requests for customer or technical service; or (e) protect the rights, property or personal safety of Company, users or any third parties including acting in urgent circumstances.\n8.2 We do not accept any unsolicited ideas via the Services or otherwise from outside the company including without limitation suggestions about advertising or promotions, or merchandising of any products, additions to our services, or changes in methods of doing business. We may already be working on or may in the future work on a similar idea. This policy eliminates concerns about ownership of such ideas. If, notwithstanding this policy, you submit an unsolicited idea via the Services or otherwise, you understand and acknowledge that such idea is not submitted in confidence and we assume no obligation, expressed or implied, by considering it. You hereby grant Company an irrevocable, perpetual, world-wide license to use the idea and any associated intellectual property in any manner, in any medium now known or hereafter developed, without compensation to you.\n9. User Postings and Events.\n9.1 The Services may provide you and other users with an opportunity to participate in blogs, forums and other message, comment and communication features and may provide you with the opportunity to submit, post, email, display, transmit or otherwise make available comments, reviews, links, materials, ideas, opinions, messages and other content and information via the Services (each, a “User Posting”, and collectively, “User Postings”). You understand, acknowledge and agree that all User Postings are the sole responsibility of the person from which such User Postings originated and that you are solely and entirely responsible for the consequences of all User Postings that you submit, upload, post, email, display, transmit or otherwise make available, including without limitation as set forth in Section 8. You may not submit a User Posting is or may be construed as violating these Terms, including, without limitation, Section 8 above, or is deemed to be unacceptable to Company, as determined in Company’s sole discretion.\n9.2 User Postings do not reflect the views of Company, its affiliates or parent company, and you understand that by using the Services, you may be exposed to other people’s User Postings that could be offensive, indecent or objectionable. Company has the right, but not the obligation, to review any User Posting and to delete, remove, move, edit or reject, without notice to you, for any reason or for no reason whatsoever, any User Postings. Under no circumstances shall Company be liable in any way for User Postings, including, without limitation, errors or omissions in any User Postings, or any loss or damage of any kind incurred as a result of any User Postings submitted, uploaded, posted, emailed, displayed, transmitted or otherwise made available, nor shall Company have any obligation or liability to you or any third party for not removing any User Posting.\n9.3 In connection with all User Postings you submit, post, email, display, transmit or otherwise make available, you grant to Company the unrestricted, worldwide, non-exclusive, irrevocable, perpetual, fully paid-up and royalty-free right and license, in any form or format, on or through any media or medium and with any technology or devices now known or hereafter developed, in whole or in part, to host, cache, store, maintain, use, reproduce, distribute, display, exhibit, perform, publish, broadcast, transmit, modify, prepare derivative works of, adapt, reformat, translate, and otherwise exploit all or any portion of your User Posting on the Services and any other websites, channels, services, and other distribution platforms, whether currently existing or developed in the future, for any purpose whatsoever (including, without limitation, for any promotional purposes) without accounting, notification, credit or other obligation to you, and the right to license and sub-license and authorize others to exercise any of the rights granted hereunder to Company, in our sole discretion. For the avoidance of doubt, the rights, licenses and privileges described in these Terms and granted to Company shall commence immediately upon submission of your User Posting and shall continue thereafter perpetually and indefinitely, regardless of whether you use the Services as a registered user or not.\n9.4 Company does not acquire any title or ownership rights in the User Postings that you submit and/or make available, and Company’s sole right to utilize the User Postings is set forth in Section 9.3, above. After you submit, post, email, display, transmit or otherwise make available any User Posting, you continue to retain any such rights that you may have in such User Posting, subject to the rights, licenses and privileges granted herein. You also represent, warrant and covenant that (a) you own the User Posting posted by you or otherwise have the right to grant the rights, licenses and privileges described in these Terms and to perform and comply with all of the requirements set forth herein; (b) your submission, uploading, posting, emailing, displaying, transmission and/or making available of User Postings does not violate these Terms, any rights of any other party or entity, any of your obligations, any law, rule or regulation or infringe upon, misappropriate or violate any intellectual property, proprietary, privacy, moral, publicity or other rights of any party or entity; (c) you have the legal right and capability to enter into these Terms and perform and comply with all of its terms and conditions; and (d) you hold and shall continue to hold all the ownership, license, proprietary and other rights necessary to enter into, authorize, grant rights and perform your obligations under these Terms and shall pay for all royalties, fees, and any other monies owing to any person or entity by reason of your User Postings.\n9.5 The Services may provide you and other users with an opportunity to appear or participate in in-person and virtual events. If you participate in such events, Company may record your voice, image (both video and static), appearance, name, likeness, biographical information, and any statements you make verbally or in writing (your “Likeness and Statements”). You hereby grant to Company, as well as any third parties that Company may designate from time to time, the fully-paid, royalty-free, sublicenseable, irrevocable license to copy, display, perform, reproduce, make derivative works from, and otherwise use separately, or together, your Likeness and Statements, in whole or in part, in any and all media now known or hereafter developed, throughout the world, in perpetuity, for any lawful purpose, including, without limitation, in connection with (i) the subsequent broadcast, display, or dissemination of the events; and/or (ii) the promotion or advertising of Company or any such third party.\n10. Digital Millennium Copyright Act. If you are a copyright owner or an agent thereof and believe that any content on the Services infringes upon your copyrights, you may submit a notification pursuant to the Digital Millennium Copyright Act (“DMCA”) by providing our Designated Agent (as set forth below) with the following information in writing (see 17 U.S.C. 512(c)(3) for further details):\n- A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed;\n- Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works on the Services are covered by a single notification, a representative list of such works on the Services;\n- Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit us to locate the material;\n- Information reasonably sufficient to permit us to contact you, such as an address, telephone number, and e-mail address;\n- A statement that you have a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent or the law; and\n- A statement that the information in the notification is accurate, and under penalty of perjury, that you are authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.\nWritten notification of claimed infringement must be submitted to the following Designated Agent:\nNYP Holdings, Inc.\nCopyright Agent\nAttn. Legal Department\n1211 Avenue of the Americas\nNew York, NY 10036\nEmail Address of Designated Agent: dmca@nypost.com\nFor clarity, only DMCA notices should be sent to the Designated Agent and any other feedback, comments, requests for technical support, and other communications should be directed to Company customer service by sending an email to help@nypost.com. The Company has a policy of terminating repeat infringers’ access to its Services in appropriate circumstances.\n11. Certain Services Terms and Requirements.\n11.1 Availability. You acknowledge that Company licenses some or all of the Content under agreement from third parties, and that Company may add, delete or disable Content, and/or add, delete, disable or modify some or all of the Services, at its sole election, and you acknowledge: (a) that you may no longer be able to use the Services to the same extent, or at all, as prior to such change or discontinuation, and (b) that Company shall have no obligation or liability to you in such case. In no event shall Company be liable for the removal of, or disabling of access to, any Content, the Services, materials or any features or portions of the Services. Company may also impose limits on the use of or access to certain features or portions of the Content or the Services, in any case and without notice or liability to you.\n11.2 Device Requirements and Terms. In order to access and use the Services and the Content, you may be required to use Device(s) and other technology meeting certain system, configuration and other requirements established by Company, its content partners, licensors and other third parties (e.g., storefront, network, website, platform and other operators, etc.) (collectively, “Operators”), and you are responsible for ensuring that your Device(s) and other technology meet all such requirements at all times and prior to any purchase or order on or in connection with the Services. Company is not responsible for any failure of the Services or your inability to access the Services as a result of your use of Device(s) that do not meet Company’s or its Operators’ system requirements. In addition, you are responsible for any data access, messaging and other service rates and charges you may incur in connection with your Device and/or use of the Services.\n11.3 Usage Rules. Certain Content and Services (in whole or in part) may be accompanied by technology and/or other restrictions (e.g., digital rights management technology) that protect digital information and content from unauthorized use and access and may limit and restrict your usage of such Content and Services in accordance with certain rules and restrictions established by Company and/or Operators (“Usage Rules”). You agree to comply with such Usage Rules at all times, and shall not violate or attempt to violate any security components thereof. You further acknowledge and agree that the Usage Rules may be controlled and monitored by Company and/or its designees for compliance purposes, and Company reserves the right to enforce the Usage Rules with or without notice to you.\n11.4 Software License Grant and Restrictions on Use. Any software available in connection with the Services is subject to United States export control laws. No such software may be downloaded or otherwise exported or re-exported in violation of United States export laws. Furthermore, any software is licensed, not sold, to users. Subject to these Terms, Company agrees to permit you, on a non-exclusive, revocable, non-transferable, non-sublicensable, limited basis, to install and/or use the software on a single Device that you own or control, provided that your installation and/or use of the software is solely (a) for your own personal use; and (b) in accordance with the restrictions and limitations set forth in these Terms. Without limiting the generality of the foregoing, you shall not: (a) rent, lease, timeshare, license, distribute, sublicense or otherwise transfer the software or any portion thereof; (b) make copies of the software or any portion thereof; (c) reverse engineer, decompile or disassemble any portion of the software; (d) create derivative works of or from the software or any portion thereof; (e) incorporate the software or any portion thereof, into any product or service; (f) use the software or any portion thereof for commercial purposes; and (g) remove, alter or obscure any copyright, trademark, trade name or other proprietary notices, legends, symbols or labels that appear in the software. All rights not expressly granted to you hereunder are reserved to us and our licensors.\n11.5 Objectionable Material. You understand that by using the Services, you may encounter Content that may be deemed offensive, indecent, or objectionable by some, which Content may or may not be identified as such. Nevertheless, you agree to use the Services at your sole risk and that Company shall have no liability to you for Content that may be found to be offensive, indecent, or objectionable.\n12. Customer Support. For assistance with technical issues or customer support inquiries, please refer to our support page at https://nypost.com/customer-service/or send an email to help@nypost.com.\n13. Third-Party Services and Content. The appearance, availability, or your use of (a) URLs or hyperlinks referenced or included anywhere in connection with the Services or any other form of link or re-direction of your connection to, with or through the Services, or (b) any third-party websites, content, data, information, applications, goods, services or materials (collectively, “Third-Party Services”) does not constitute an endorsement by, nor does it incur any obligation, responsibility or liability on the part of Company, its affiliates, or parent company, or any of their respective successors and assigns, directors, officers, employees, representatives, agents, licensors, Advertisers, suppliers, Operators or service providers. We do not verify, endorse, or have any responsibility for Third-Party Services and any third-party business practices (including, without limitation, their collection and use of personal and other information), whether the Services’ or Company’s logo and/or sponsorship identification is on the Third-Party Services as part of a co-branding or promotional arrangement or otherwise. Accordingly, we encourage you to be aware when you leave the Services and to read the terms and conditions and privacy notice of each Third-Party Service you use.\n14. Advertisements. Access to the Content available on the Services is made available to you in part due to the paid advertising that appears on the Services. You agree that that you will not, and will not permit any third party to, remove, obstruct, modify or otherwise interfere with the delivery or display of advertisements on the Services. We reserve the right to suspend your access to and/or re-insert advertisements in the event we detect any such interference with the delivery or display of advertisements on the Services. Moreover, from time to time, you may choose to communicate with, interact with, or obtain Third-Party Services from our advertisers, sponsors, or other promotional partners (collectively, “Advertisers”) found on or through the Services or via a hyperlinked website or platform. All such communication, interaction and participation is strictly and solely between you and such Advertisers and we shall not be responsible or liable to you in any way in connection with these activities or transactions (including, without limitation, any representations, warranties, covenants, contracts or other terms or conditions that may exist between you and the Advertisers or any goods or services you may purchase or obtain from any Advertiser).\n15. Promotions, Contests, and Sweepstakes. From time to time, Company, or the Services’ operational service providers, suppliers, Operators, and Advertisers may conduct promotions and other activities on, through or in connection with the Services, including, without limitation, contests and sweepstakes (collectively, “Promotions”). Each Promotion may have Additional Terms and/or Rules which shall be posted or otherwise made available to you in connection therewith, and your participation in such Promotions shall be subject to such Additional Terms and/or Rules.\n16. Assignment. These Terms, and any rights, licenses and privileges granted herein, may not be transferred or assigned by you, but may be assigned or transferred by Company without restriction, notice or other obligation to you.\n17. Indemnity. You agree to indemnify, defend and hold Company, its affiliates, and parent company, and their respective successors and assigns, directors, officers, employees, representatives, agents, licensors, Advertisers, Operators, suppliers and service providers harmless from any and all claims, liabilities, damages, losses, costs and expenses (including reasonable attorneys’ fees), arising in any way out of or in connection with (a) your use of the Services, (b) your breach or violation these Terms, (c) your User Postings, or (d) any violation by you of applicable law. Company reserves the right to assume the exclusive defense and control of any matter subject to indemnification by you and all negotiations for its settlement or compromise, and you agree to fully cooperate with us upon our request.\n18. DISCLAIMER AND LIMITATIONS OF LIABILITY. THE SERVICES, AND ALL CONTENT, PRODUCTS, SERVICES AND USER POSTINGS MADE AVAILABLE ON, THROUGH OR IN CONNECTION THEREWITH, ARE PROVIDED ON AN “AS IS” AND “AS AVAILABLE” BASIS, WITHOUT ANY REPRESENTATION OR WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, OR ANY GUARANTY OR ASSURANCE THE SERVICES WILL BE AVAILABLE FOR USE, OR THAT ANY PRODUCTS, FEATURES, FUNCTIONS, SERVICES OR OPERATIONS WILL BE AVAILABLE OR PERFORM AS DESCRIBED. ALL IMPLIED REPRESENTATIONS, WARRANTIES AND CONDITIONS RELATING TO THE SERVICES AND THIS SITE, INCLUDING WITHOUT LIMITATION THE IMPLIED WARRANTIES OF MERCHANTABILITY, TITLE, NON-INFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE, AND ALL CONTENT, PRODUCTS, SERVICES AND USER POSTINGS ARE HEREBY DISCLAIMED. COMPANY DOES NOT WARRANT THAT THE FUNCTIONS CONTAINED IN THE SERVICES OR ANY CONTENT, PRODUCTS, SERVICES AND USER POSTINGS MADE ON, THROUGH OR IN CONNECTION THEREWITH WILL BE UNINTERRUPTED OR ERROR FREE, THAT DEFECTS WILL BE CORRECTED, OR THAT THE SERVICES OR THE SERVER(S) THAT MAKES THEM AVAILABLE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. TO THE FULLEST EXTENT PERMITTED BY LAW, COMPANY SHALL NOT BE LIABLE FOR THE USE OF THE WEBSITE, INCLUDING, WITHOUT LIMITATION, THE CONTENT AND ANY ERRORS CONTAINED THEREIN.\nWithout limiting the foregoing, we are not responsible or liable for any viruses, malicious code, delays, inaccuracies, errors, or omissions arising out of your use of the Services. You understand, acknowledge and agree that you are assuming the entire risk as to the quality, accuracy, performance, timeliness, adequacy, completeness, correctness, authenticity, security and validity of any and all features and functions of the Services, including, without limitation, User Postings and Content associated with your use of the Services.\nYOU UNDERSTAND AND AGREE THAT, TO THE FULLEST EXTENT PERMISSIBLE BY LAW, COMPANY, ITS AFFILIATES, SUCCESSORS AND ASSIGNS, AND EACH OF THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AGENTS, REPRESENTATIVES, LICENSORS, OPERATORS, SERVICE PROVIDERS, ADVERTISERS AND SUPPLIERS (THE “RELEASED PARTIES”, SHALL NOT BE LIABLE FOR ANY LOSS OR DAMAGE, OF ANY KIND, DIRECT OR INDIRECT, IN CONNECTION WITH OR ARISING FROM USE OF THE SERVICES OR FROM THESE TERMS, INCLUDING, WITHOUT LIMITATION, COMPENSATORY, CONSEQUENTIAL, INCIDENTAL, SPECIAL, EXEMPLARY OR PUNITIVE DAMAGES. IN NO EVENT SHALL THE RELEASED PARTIES’ TOTAL LIABILITY TO YOU FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION, WHETHER BASED IN CONTRACT, TORT, STRICT LIABILITY OR OTHERWISE EXCEED THE LESSER OF THE TOTAL DOLLAR AMOUNT, IF ANY, PAID BY YOU TO COMPANY FOR USE OF THE SERVICES AND $100. Some jurisdictions do not allow for the exclusion of certain warranties or certain limitations on damages and remedies, accordingly some of the exclusions and limitations described in these Terms may not apply to you.\n19. DISPUTE RESOLUTION, AGREEMENT TO ARBITRATE, AND CLASS ACTION WAIVER\nPLEASE READ THE FOLLOWING ARBITRATION AGREEMENT IN THIS SECTION (“Arbitration Agreement”) CAREFULLY. THIS SECTION AFFECTS YOUR LEGAL RIGHTS, INCLUDING YOUR RIGHT TO BRING A LAWSUIT IN COURT.\n19.1 APPLICABILITY OF ARBITRATION AGREEMENT. You agree to the following dispute resolution provisions of this Section 19 with respect to any dispute, claim, or request for relief relating in any way to your access or use of the Services, to any Services sold or distributed through the Website, or to any aspect of your relationship with the Company (“Dispute”) and any lawsuit, arbitration or other proceeding that may\narise out of such Dispute (each, an “Action”).\nThe terms of Section 19 apply to all Disputes, even if the actions or relationship giving rise to such Disputes occurred prior to this version of the Terms (or such modification). However, these Dispute Resolution terms do not apply to any Dispute as to which you have personally initiated a lawsuit or arbitration prior to agreeing to these Terms.\nEach provision of this Section 19 applies to the maximum extent permitted by law.\nCovered Disputes. If you live in the United States, any Dispute between You and the Company (collectively, the “Parties”) is a Covered Dispute, with the following exceptions: (1) to the extent you have in any manner violated or threatened to violate our intellectual property rights, our suit to enforce such intellectual property rights including by injunction; or (2) any claim that involves an amount in controversy that is equal to or greater than $75,000.\nIf a Dispute is a Covered Dispute, the Mandatory Dispute Resolution Provisions for U.S. Users (as described in Sec 19.3 below) apply. If there is any dispute between the Parties as to whether a Dispute is a Covered Dispute, that dispute shall be resolved in the state or federal courts located in the County of New York.\n19.2 DISPUTE RESOLUTION PROVISIONS APPLICABLE TO ALL USERS\nCLASS ACTION AND JURY WAIVER. THE PARTIES WAIVE THE RIGHT TO TRIAL BY JURY OR TO PARTICIPATE IN A CLASS ACTION, MASS ACTION, GROUP ACTION, REPRESENTATIVE ACTION, AND/OR COLLECTIVE ACTION IN ANY DISPUTE. EACH PARTY MAY PROCEED AS TO ANY DISPUTE ONLY IN THAT PARTY’S INDIVIDUAL CAPACITY, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED CLASS ACTION, MASS ACTION, GROUP ACTION, REPRESENTATIVE ACTION, AND/OR COLLECTIVE ACTION.\nApplicable Law. These Terms and your use of the Services are governed by, construed and enforced in accordance with the internal substantive laws of the State of New York, United States, regardless of the State’s conflict of laws provisions. However, any question as to whether a Dispute is a Covered Dispute (as defined above) and/or whether a Dispute is subject to the Mandatory Dispute Resolution Provisions for U.S. Users is to be decided by applying the provisions of the Federal Arbitration Act, Title 9 of the U.S. Code (“FAA”).\nChoice of Venue. For any Action allowed to proceed in court (including but not limited to any claim that involves an amount in controversy that is equal to or greater than $75,000, any claim related to whether a Dispute is a Covered Dispute, or any suit to enforce our intellectual property rights including by injunction), or to enforce the terms of this Agreement, the Parties agree to exclusive personal jurisdiction and venue in the state or federal courts located in the County of New York.\nInformal Dispute Resolution Required. Before initiating an Arbitration (as defined below) or any other type of Action or adversary proceeding, the Parties agree to use commercially reasonable efforts to settle any Covered Dispute (as defined above) directly through consultation and good faith negotiations according to the following process (“Informal Dispute Resolution Process”), which shall be a precondition to either Party initiating an Arbitration.\n| i. | If you have a Covered Dispute with us, you must send an individualized, written notice describing the Covered Dispute to us to NYP Holdings, Inc., Attn: Legal Department, 1211 Avenue of the Americas, New York, NY 10036. If we have a Covered Dispute with you, we will send a written notice to you using the contact information we have for you. |\n| ii. | Promptly following receipt of such notice, we will personally meet, via telephone or videoconference, in a good-faith effort to confer with each other and try to resolve informally any Covered Dispute covered by this Agreement. |\n| iii. | If you are represented by counsel, your counsel may participate in the conference as well, but you agree to fully participate in the conference personally. Likewise, if we are represented by counsel, our counsel may participate in the conference as well, but we agree to have a company representative fully participate in the conference. |\n| iv. | The statute of limitations and any filing fee deadlines shall be tolled while the Parties engage in the Informal Dispute Resolution Process required by this paragraph. |\n| v. | If the Covered Dispute is not resolved within 60 days of the opposing Party receiving the notice, then either you or we may proceed in accordance with the below Mandatory Dispute Resolution Provisions. |\n| vi. | Failure to complete the Informal Dispute Resolution Process is grounds for dismissal of any Arbitration (as defined below) and the Party initiating such Action will be required to pay any reasonable costs and fees of the other Party. |\n19.3 MANDATORY DISPUTE RESOLUTION PROVISIONS FOR U.S. USERS\n| i. | Agreement to Arbitrate Covered Disputes. Any Covered Dispute that the parties cannot resolve through the Informal Dispute Resolution Process (as defined above) must be brought on an individual basis and will be resolved exclusively by final and binding arbitration (“Arbitration”) before an arbitrator mutually selected by the Parties (the “Arbitrator”). The Arbitrator must have experience with the subject matter of the Dispute, and be a former federal or state court judge. The Parties intend the FAA to apply to ensure enforcement of these Mandatory Dispute Resolution Provisions for U.S. Users. Your agreement to these Mandatory Dispute Resolution Provisions for U.S. Users is material to Company offering the Services, as Company could not offer the Services for free or at the price charged without the cost savings provided thereby |\n| ii. | Arbitrator Selection. The parties will meet and confer in good faith to select an arbitrator. For purposes of this Section, good-faith meet-and- confer efforts require that each party propose at least three arbitrators who meet the qualifications described in these Terms. If, after 60 days of good faith meet and confer efforts, the Parties are unable to agree on an arbitrator, either Party may petition the state or federal courts located in the County of New York to appoint an arbitrator meeting the requirements herein from the arbitrators proposed by the parties. |\n| iii. | Rules Selection. The Arbitration shall be administered pursuant to JAMS’ Streamlined Arbitration Rules and Procedures or other comparable rules to which the parties agree. The selection of JAMS rules does not mean that JAMS will administer the Arbitration or appoint the Arbitrator. |\n| iv. | Conduct of Arbitration. The Arbitration shall be conducted via electronic or telephonic means. If the Party seeking Arbitration fails to appear at the administrative conference regardless of whether such Party’s counsel attends, the Arbitrator will administratively close the Arbitration proceeding without prejudice, unless such Party shows good cause as to why they were not able to attend the conference. |\n| v. | Arbitration Costs. If the Arbitrator finds that the costs and fees of an Arbitration you initiate will be prohibitive for you as compared to the costs of litigation, we will pay as much of your filing, arbitrator, and hearing fees in the Arbitration as the Arbitrator deems necessary to prevent the Arbitration from being cost-prohibitive, regardless of the outcome of the Arbitration, unless the Arbitrator determines that your claim(s) were frivolous or asserted in bad faith. If we initiate an Arbitration against you, we will pay all costs associated with the Arbitration (other than your attorneys’ fees and expenses unless permitted to be recovered under the arbitration rules or applicable law). |\n| vi. | No Opt Out Rights. You do not have the right to opt out of the Dispute Resolution section. Rather, your sole remedy if you do not accept these Terms of Use (including this Dispute Resolution section) is to stop using the Services. |\n| vii. | Company Right To Terminate Mandatory Dispute Resolution Program. At any time, Company may terminate its agreement to Section 19.3. That termination will not affect any Action that has already been initiated. |\n| viii. | Arbitration Agreement Survival. This Arbitration Agreement will survive the termination of your relationship with Company. |\n20. Miscellaneous. These Terms contains the entire understanding and agreement between you and Company concerning the Services and supersedes any and all prior or inconsistent understandings relating to the Services and your use thereof. These Terms cannot be changed orally, nor may these Terms be modified except as expressly authorized in these Terms. If any provision of these Terms is held to be illegal, invalid or unenforceable, this shall not affect any other provisions and these Terms shall be deemed amended to the extent necessary to make it legal, valid and enforceable. Any provision that must survive in order to allow us to enforce its meaning shall survive the termination of these Terms. The failure of Company to exercise or enforce any right or provision of these Terms will not operate as a waiver of such right or provision.\n21. Terms Pertaining to Certain Third Party Content, Data and Information Providers and Mobile Application Platforms.\n21.1 AP Material. By accessing the Services, you specifically acknowledge and agree that (i) Associated Press text, photo, graphic, video and/or audio material shall not be published, broadcast, rewritten for broadcast or publication or redistributed directly or indirectly in any medium; (ii) No Associated Press materials nor any portion thereof may be stored in a computer except for personal and non-commercial use; (iii) The Associated Press will not be held liable for any delays, inaccuracies, errors or omissions therefrom or in the transmission or delivery of all or any part thereof or for any damages arising from any of the foregoing; (iv) The Associated Press is an intended third party beneficiary of these terms and conditions and it may exercise all rights and remedies available to it; and (v) The Associated Press reserves the right to audit possible unauthorized commercial use of AP materials or any portion thereof at any time.\n21.2 Mobile Applications. If you access the Services through a mobile application or other type of third party platform, the applicable End User License Agreement for the platform through which you downloaded the mobile application may apply in addition to these Terms and you agree that you are subject to such terms in addition to these Terms."
    }
  ],
  "argos_summary": "Prince Harry has set a list of demands—full security, controlled press coverage, and formal recognition of Meghan as HRH—before agreeing to meet King Charles, a move that could influence UK political stability and market sentiment on UK governance and security costs.",
  "argos_id": "1MICVNI4A"
}