{
  "url": "https://www.macrumors.com/2025/09/03/llm-siri-with-search-early-2026/",
  "authorsByline": "Juli Clover",
  "articleId": "8be47bb49be347beb980ecd5855ae682",
  "source": {
    "domain": "macrumors.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://images.macrumors.com/t/GkZP-V8KFotPShRFsn5zkvBLBOY=/1600x/article-new/2025/05/iPhone-Siri-Glow.jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T13:42:27-07:00",
  "addDate": "2025-09-03T20:47:26.790279+00:00",
  "refreshDate": "2025-09-03T20:47:26.790280+00:00",
  "score": 1.0,
  "title": "LLM Siri With 'World Knowledge' Search Feature Coming in Early 2026",
  "description": "Apple plans to add an AI-powered web search tool to Siri next year, reports Bloomberg's Mark Gurman. The search tool will be an integrated Siri...",
  "content": "Apple plans to add an AI-powered web search tool to Siri next year, reports Bloomberg's Mark Gurman. The search tool will be an integrated ‌Siri‌ feature that will provide information on general search queries, similar to ChatGPT and Google's AI overviews for searches.\n\n\n\nApple is calling the search feature World Knowledge Answers internally, and some Apple executives apparently refer to it as an \"answer engine.\" It will be limited to ‌Siri‌ to begin with, but Apple could add it to Spotlight search and Safari in the future. Apple has also considered creating a chatbot-like app for search, though it is not clear if that will happen.\n\n‌Siri‌ search will include an interface that supports text, photos, videos, and local points of interest, with ‌Siri‌ being able to summarize search results to provide an clear summary of content.\n\nThe new ‌Siri‌ answer engine will be included in the ‌Siri‌ updates that Apple is introducing in 2026. Apple has been working on a smarter, more personalized version of ‌Siri‌ that was supposed to be introduced as part of iOS 18 earlier this year, but it was delayed.\n\nApple couldn't get the first-generation ‌Siri‌ architecture that it was using to work properly, so ‌Siri‌ needed to be rebuilt from the ground up using a second-generation architecture that relies on large language models. In August, Apple software engineering chief Craig Federighi said that the overhauled ‌Siri‌ architecture was giving Apple the results that it needed, and that Apple was now in a position to \"not just deliver what we announced, but to deliver a much bigger upgrade than we envisioned.\"\n\nThe new ‌Siri‌ features have three systems that power them, including a planner that interprets voice or text input, the search system that looks through the web and the user's device, and a summarizer that provides the end answer to the user.\n\nApple has been weighing using its own LLM models for these ‌Siri‌ elements or relying on an outside partner like OpenAI, Anthropic, or Google, and it sounds like progress has been made with Google. Apple and Google have apparently signed a formal agreement that will see Apple evaluating and testing a custom Google-designed Gemini AI model that could power some of the summarization ‌Siri‌ features.\n\nApple is still testing models designed by Anthropic and its own in-house models for the planner functionality, though it could opt to use Google's AI models for that too. Apple's own Foundation Models will be used for searching user data, making sure customer data isn't processed using third-party models.\n\nThe upcoming LLM version of ‌Siri‌ is on track to launch as early as March 2026 in an iOS 26.4 update. Along with the world knowledge feature, ‌Siri‌ will have the personalization capabilities that were promised in ‌iOS 18‌. ‌Siri‌ will be able to use personal information like emails and messages to answer questions and help users find what they're looking for, plus it will be able to interact with on-screen content and do more within apps.\n\nLater in 2026, ‌Siri‌ will get a visual redesign and a built-in health feature that will be the backbone of a paid wellness subscription service.",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/news/articles/2025-09-03/apple-plans-ai-search-engine-for-siri-to-rival-openai-google-siri-talks-advance",
    "https://www.macrumors.com/roundup/ios-18/",
    "https://www.macrumors.com/guide/siri/",
    "https://www.macrumors.com/2025/08/01/tim-cook-apple-all-hands-meeting-ai/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "‌Siri‌ search",
      "weight": 0.12285967
    },
    {
      "name": "‌Siri‌",
      "weight": 0.096492745
    },
    {
      "name": "Apple",
      "weight": 0.09599332
    },
    {
      "name": "search results",
      "weight": 0.09169497
    },
    {
      "name": "Spotlight search",
      "weight": 0.08846423
    },
    {
      "name": "search",
      "weight": 0.08758117
    },
    {
      "name": "searches",
      "weight": 0.08758117
    },
    {
      "name": "Apple software engineering chief Craig Federighi",
      "weight": 0.085973024
    },
    {
      "name": "general search queries",
      "weight": 0.0855835
    },
    {
      "name": "large language models",
      "weight": 0.06487675
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.69873046875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.60107421875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.38916015625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.378173828125
    }
  ],
  "sentiment": {
    "positive": 0.3176158,
    "negative": 0.107536964,
    "neutral": 0.57484716
  },
  "summary": "Apple plans to add an AI-powered web search tool to Siri, World Knowledge Answers, by early 2026. The integrated feature will provide information on general search queries, similar to Google's AI overviews for searches. It will initially be limited to ‌Siri’s, but could be added to Spotlight search and Safari in the future. Apple has also considered creating a chatbot-like app for search, though it is unclear if this will happen. The new features will be included in the updates introduced in 2026 for the release of a smarter, more personalized version of Siri. The company has been considering using its own LLM models or relying on outside partners like OpenAI, Anthropic, or Google.",
  "shortSummary": "Apple plans to introduce an AI-powered web search tool for Siri by early 2026, enhancing personalization and search capabilities with new features and integration features.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "090098a3c207409397c352f2e0fd644b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.macrumors.com/roundup/ios-18/",
      "text": "iOS 18\nApple's next-generation operating system for iPhone and iPad, available now.\niOS 18 Overview\nContents\niOS 18 is the next-generation version of iOS, released in September 2024. iOS 18 is built around Apple Intelligence, which is what Apple is calling its AI feature set that's deeply integrated into iOS. Apple Intelligence combines generative AI with personal context, and Apple calls it \"AI for the rest of us.\"\nApple Intelligence improves writing across the operating system, makes Siri much smarter, and allows for multiple forms of content generation. A set of Writing Tools are available across all apps for rewriting, polishing, proofreading, and summarizing text. You can change your tone, make your writing more concise, and ensure there are no spelling or grammar errors.\nAn Image Playground app lets you generate images using prompts or Apple's suggestions and themes. You can incorporate pictures of your friends and family to make all kinds of fun custom photos in styles that include Animation, Illustration, or Sketch. Image Playground image generation is built into Messages, Notes, and other apps.\nThere's a Genmoji feature in the Messages app that lets you create any emoji you want without being limited to the built-in options. You can enter a short description of what you want, even including your friends, and Apple Intelligence makes it for you.\nIn the Photos app, you can create custom Memories by typing in a description, with Apple Intelligence choosing appropriate photos and videos based on your description. Memories include a storyline, included music, and chapters for a full narrative arc. A Clean Up tool can be used when editing images to remove unwanted objects from the background of a photo.\nApple entirely overhauled Siri with Apple Intelligence, creating an assistant that is more contextually relevant, personal, and natural. You can use voice commands with Siri, but there's also a new type to Siri option you can activate with a double tap on the bottom of the display. Siri has more personal context for fulfilling requests, and can take actions in apps for the first time. Siri can edit photos, manage files, create folders, and tons more.\nSiri better understands language, can keep track of what you asked in a prior request, and knows what's on your screen so you can ask about it. Siri can search your entire device for information and knows your history, so it is prepared to help you with all your everyday tasks.\nApple gave Siri a new look, and when the personal assistant is activated, there's now a glowing ring around the display. Siri also has deep Apple product knowledge and can give you step-by-step instructions on whatever you need to do, so it's like having an Apple Genius in your pocket. When Siri doesn't know something, there's an option to bring in OpenAI's ChatGPT for your requests. ChatGPT is free, gets no info from you, and can be used for creating and illustrating content from scratch.\nApple Intelligence is limited to the iPhone 15 Pro models, iPhone 16 models, the iPad mini 7, and iPads and Macs with an M-series chip, and that's because much of the processing is done on-device for privacy purposes and to keep user data safe. Apple cloud servers running on Apple silicon are used for more intensive tasks. Apple promises that its Private Cloud Compute feature does not store data or make it accessible to Apple in any way.\nIn addition to the AI features, there are a ton of other new features that are not AI related and are available on a much wider range of iPhones. There are new customization options for the Home Screen, with the option to rearrange apps and widgets with open spaces and around wallpapers. Icons and widgets can be made larger and have a darker option for dark mode, plus there's an option to add a colored tint.\nApple redesigned Control Center and made it so everything can be rearranged to put what you use most front and center, with customized sizes and groups. A controls gallery lets you add all kinds of new quick actions, including controls from third-party apps. Control Center can also be split into multiple screens, so you can have dedicated sections for HomeKit, media playback, connectivity, and more, with the option to swipe between them.\nThe Flashlight and Camera icons on the Lock Screen are part of the Control Center in iOS 18 and can be swapped for other controls or removed entirely, plus controls can also be assigned to the Action button on the iPhone 15 Pro models.\nApple updated the Photos app, merging the Library and For You tabs into a simplified view that focuses on surfacing your best photos and memories. With Collections, it's easy to find photos organized by themes like recent days, trips, and people and pets. Collections can be pinned for quick access to your most used content.\nThe Messages app supports scheduling texts for the first time, and the Tapback feature that you use to react to texts now supports any emoji. Text effects can be added to a word, phrase, or emoji, and formatting like bold and italic is available. With iOS 18, Apple has transitioned from SMS/MMS to Rich Communication Services or RCS for green bubble text, which results in better messaging experiences with Android users.\nIf you don't have a cellular or a Wi-Fi connection, you can still text family and friends using Messages via satellite on the iPhone 14 and later. It connects to nearby satellites and works with texts, emoji, and Tapbacks. You can text iPhone users with iMessage or Android users with SMS, but only iMessages are end-to-end encrypted.\nIn iOS 18.2, Mail adopted on-device categorization with sections like promotions, transactions, and personal email, and there is a new digest view that aggregates all of the relevant emails from a business for a full look at correspondence.\nThere are Highlights in Safari that surface key information about a webpage like a summary of an article, the location of a restaurant, or access to a map on a webpage for a shop. Reader mode has been upgraded with a summary and table of contents. The Notes app supports live audio recording and transcription, along with Math Notes that can automatically solve equations and expressions.\nMaps now includes topographic maps and trail networks, including detailed maps of all 63 U.S. national parks. Hikes can be saved for offline access, and you can create custom walking and hiking routes.\nApple added a Game Mode that minimizes background activity to ensure all of your processing power goes to the game you're playing, plus it cuts down on latency from game controllers and AirPods, with AirPods also gaining support for Personalized Spatial Audio for gaming.\nWith a Tap to Cash feature, you can tap your iPhone to another iPhone to send money over Apple Cash without having to share your phone number or other personal information. Apple Pay supports paying with rewards and with installment plans offered by some credit cards, plus event tickets have been redesigned in Wallet to include maps, information about the venue, and more.\nThe Passwords section in Settings is now a whole Passwords app that stores iCloud Keychain logins and passwords. The Passwords app supports passkeys, Wi-Fi passwords, verification codes, and more. Passwords can be accessed on iPhone, iPad, Mac, and Windows PCs.\nApple improved privacy in iOS 18, and it's now possible to lock any app, requiring Face ID or Touch ID to open it even when your iPhone is unlocked. You can also hide an app, which removes it from the Home Screen and tucks it away in a hidden folder in the App Library that can't be accessed without authentication. Apps that are locked or hidden won't send notifications and aren't available in search.\nApps that ask for contacts can now be granted access to just select contacts, hiding access to your full contact list. Apple has also added a new method for connecting third-party accessories without letting an app see other devices on the network.\nAirPods Pro 2 in iOS 18 support a new gesture-based Siri response option, so you can shake your head for no or nod for yes. If you get a call, you can shake your head to decline, for example. Apple is also adding Voice Isolation so you can better tune out background noise.\nCurrent Version\nThe current version of iOS 18 is iOS 18.5, released in May. iOS 18.5 added a new Pride Harmony wallpaper to match the 2025 Pride Apple Watch face and band. It also added support for carrier-provided satellite features on the iPhone 13 models, and fixed an issue where the Vision Pro app could display a black screen.\nA full list of features is available in our iOS 18.5 features guide.\nApple is testing iOS 18.6, which is available to developers and public beta testers. No new features have been found in iOS 18.6, but it will bring changes to the way apps are downloaded from alternative app stores and websites in the European Union.\nApple Intelligence\nApple Intelligence is the name for the set of artificial intelligence features that are in iOS 18, iPadOS 18, and macOS Sequoia, powered by machine learning and large language models. Apple Intelligence is deeply integrated into Apple's latest operating systems, providing new capabilities across a range of apps. As of iOS 18.3, Apple Intelligence is enabled automatically on devices that support it, but it can be turned off in the Settings app.\nThe first Apple Intelligence features were introduced in iOS 18.1, including Writing Tools, Smart Replies, notification summaries, and more, with a full list of features available in our guide. Additional Apple Intelligence features came out in iOS 18.2 in December. iOS 18.2 includes Genmoji, Image Playground, Image Wand, Visual Intelligence, and ChatGPT integration with Siri, and more.\n- Everything You Need to Know About Apple Intelligence\n- All of the Image Playground Features\n- Genmoji in iOS 18.2: Everything You Need to Know\n- Siri's Apple Intelligence Features\n- Apple Intelligence Image Wand: All the New Features in iOS 18.2\nWriting Tools\nWriting Tools are meant to help you edit, refine, and improve your writing. It is a collection of features included in Notes, Pages, Mail, and other apps where you write text. It can be used to correct errors, locate missing words, change your tone, and summarize content.\n- Proofread - Proofread checks your spelling and grammar, looking for spelling issues, incorrect verb forms and punctuation, missing words, and situations where you've used the wrong word like \"effect\" instead of \"affect.\"\n- Rewrite - With the Rewrite option, Apple Intelligence can change the tone of your email. If you've written something to be too casual, for example, you can use the \"Professional\" setting to have AI rewrite it. Your base message and ideas are kept, but wording is cleaned up. So far, options for Rewrite include Friendly, Professional, and Concise. With iOS 18.2, you can use an open-ended text prompt to make changes, which provides additional options for tone and style.\n- Summary - As the name suggests, Summary sums up what you've written, offering a quick tl;dr. You can also have the Summary feature list key points from whatever you've written or text that you've selected.\n- Smart Reply - In the Mail app, the iPhone can detect the content of emails and Suggests relevant smart replies so you can respond quickly.\nImage Playground\nImage Playground is a new app that lets you generate images based on your ideas. You can generate an image with a prompt, similar to ChatGPT, and Apple also has a list of suggested concepts.\nApple's concepts are organized into categories like themes, places, costumes, and more. Apple suggests ideas if you can't come up with your own prompt, but you don't have to use them and can enter whatever you like. All of the content created by Image Playground is stylized, so you can't create anything that looks realistic. The three available styles include Animation, Illustration, and Sketch.\nImages that are generated can incorporate your friends and family because you're able to pull their likenesses from the Photos app. You can create fun images of people that you can then send in a message, with all of the image creation done privately on device.\nWhile Image Playground is a standalone app, it is also integrated into apps like Notes and Messages, plus it can be added to third-party apps. When you use Image Playground in Messages, it does pull in context from what you were doing previously. If you were discussing fireworks, for example, it might show suggestions that involve fireworks.\nFor any generated image, you can look through multiple options and choose your favorite, plus you can iterate as many times as you want because image generation is done on device.\nIn the Notes app, Image Playground can be used to generate an image that fits into the content of your note, and on iPad, you can draw a rough sketch and have it converted into a better image, a feature that Apple calls the Image Wand.\nGenmoji\nGenmoji are similar to emoji, and are designed to behave like emoji. With Genmoji, you can essentially generate any emoji you want, so you're no longer limited to the standard set.\nGenmoji work as emoji on Apple devices, but they are not the same characters encoded by the Unicode Consortium. Instead, Apple designed a special API for them, and they display properly anywhere that supports rich text.\nGenerating a Genmoji can be done by entering a description of what you're looking for, and you can even create Genmoji modeled after people in your Photos library.\nSiri and Search\nApple Intelligence revamps Siri and Search, and Siri is much more intuitive and responsive to requests. Siri has better language understanding and can keep up even if you stumble over your words or change your mind mid-sentence.\nSiri also maintains continuity between requests, so you can make a reference to your prior request. If you make a calendar event for a trip using Siri, for example, you can then follow it up and ask what the weather is like, and Siri understands what you mean.\nSiri is able to tap into a huge database of Apple product knowledge and can tell you about device features and settings, as well as give tutorials on how to complete tasks on the iPhone, iPad, and Mac.\nThere is a built-in type to Siri feature, which can be activated by double tapping the bottom of the iPhone's display. To mark the major change with Siri, Apple has changed Siri's visual design. When activated, there's a glowing light around the edges of the display to denote that Siri is listening.\nChatGPT Integration\nApple partnered with OpenAI to integrate ChatGPT into the iPhone, iPad, and Mac. Siri can refer complex requests to ChatGPT, such as generating images or writing from scratch. With Writing Tools, ChatGPT can create and illustrate original content from scratch, which is above and beyond what Siri does.\nYou can open up a long PDF, ask Siri what it says about a particular subject, and Siri can hand it off to ChatGPT to create a full summary. Apple sees Siri as a steward for AI models and tools, using available resources and presenting you with an answer without the need for multiple apps.\nChatGPT integration is opt-in, and Siri asks for permission each time before sending a request to ChatGPT and OpenAI's servers. Neither Apple nor OpenAI keep track of requests, unless you are signed in to a paid ChatGPT account.\nVisual Intelligence\nOn iPhone 16, Visual Intelligence can be used to identify objects and places around you. Long press the Camera Control button to get to Visual Intelligence, and then point your iPhone at something. You can get hours and reviews if the camera is looking at a restaurant, copy text, get text read aloud, search for items on Google, ask ChatGPT questions about objects, and more.\nWith iOS 18.3, Visual Intelligence can be used to add dates to the Calendar app, and identify various animals and plants.\nSummarization and Prioritization\nAs mentioned earlier, Apple Intelligence can summarize all kinds of text, including both what you've written and what other people have written. You can select text and get a summary, but Apple has also built this functionality into notifications and Messages.\nLong group texts can be summarized so you can catch up quickly, and entire lectures you've recorded can be distilled down into what's important.\nYour incoming notifications are summarized, and the most important are at the top of the stack so you know what to focus on first. Incoming text messages and email messages are summarized so you can see everything that you need to know at a glance. As of iOS 18.3, Apple has removed Notification summaries for news and entertainment apps as the company works on a way to make them more accurate, but the feature will return in the future.\nNotification summaries generated with Apple Intelligence are denoted with italicized text, a feature that Apple added in iOS 18.3.\nWith a new Reduce Interruptions Focus mode, your iPhone filters your notifications and only alerts you if you get a notification that needs immediate attention, such as a text about a ride arriving.\nAI App Features\nWe go into detail on the specific features coming to apps in other sections of the roundup, but here's a quick list of the app changes that are powered by Apple Intelligence. You'll only get these options on a supported device.\n- Messages - Genmoji and Image Playground.\n- Mail - Writing Tools, Priority messages, summaries, and smart replies.\n- Photos - Clean Up tool, enhanced natural language search, and memory movies.\n- Notes - Writing Tools, Image Wand, and recording, transcribing, and summarizing of audio recordings.\n- Phone - Recording, transcribing, and summarizing phone calls.\n- Notifications - Priority Notifications, Notification summaries and Reduce Interruptions Focus mode. Note that summaries are on hold for news and entertainment apps, but Apple will bring them back in an update.\nPrivacy\nMost Apple Intelligence features are completed on-device to preserve user privacy. Siri gathers data from your iPhone to answer your requests rather than relying on Apple's servers, but there are instances where the compute power of the cloud is required.\nApple is using Private Cloud Compute for this, with Apple's servers equipped with Apple silicon chips for privacy protection through the Secure Enclave.\nApple says that data is not stored and is used only for requests, and to prove that, Apple allows independent experts to inspect the code that runs on Apple silicon servers. Private Cloud Compute cryptographically ensures that the iPhone, iPad, and Mac do not talk to a server unless its software has been publicly logged for inspection.\nApple Intelligence tools are opt-in, and you can select specific features that you want to use. Apple has also designed parental controls for Apple Intelligence.\nApple Intelligence Requirements\nApple Intelligence in iOS 18 is limited to the iPhone 15 Pro, iPhone 15 Pro Max, and all iPhone 16 models.\nOn the iPad and the Mac, Apple Intelligence requires an M1 processor or later. Apple says that these requirements are due to the power needed to process AI requests. While technically older iPhones could run AI models, it would be too slow to be useful.\niOS 18 Design Updates\nApple Intelligence is the biggest overall change in iOS 18, but Apple has implemented some noteworthy design changes that overhaul the look of the Home Screen and bring it more in line with the Lock Screen that was updated in iOS 17.\nHome Screen\nApps and widgets can be placed anywhere on the iPhone's hidden grid in iOS 18, so you can have a Home Screen and app pages with just a handful of apps and widgets with as much spacing as you want between row of icons.\nYou can't quite put an app icon anywhere you want on the screen, but you can rearrange icons around your wallpaper and have more empty space than before. The names of apps can be removed, increasing the size of the icons and widgets on the Home Screen with the space saved.\nApp Icons\nApple added a Dark color for app icons that pairs well with Dark Mode. The Dark option can be selected independently of Dark Mode or paired with it, and all of Apple's built-in apps now have a new, darker look when it's activated.\nYou can also choose to tint your app icons to match your wallpaper, overwriting the default color of each icon. You can't choose individual colors for every icon, and the feature only works to put a blanket tint over everything.\nHiding and Locking Apps\nIf you have an app you don't want anyone to see, you can choose to lock it or hide it from the Home Screen entirely. It's a useful feature if you want to be able to hand your phone to someone to show off pictures or allow them to play a game as it keeps your most sensitive content out of sight.\nLocked apps require Face ID or Touch ID authentication to unlock them when they're tapped, but they stay on your Home Screen. If you lock an app and hide it, it only shows up in the App Library in a hidden apps folder that takes biometric authentication to open up. Locked and hidden apps do not appear in other places such as search or in notifications.\nControl Center\nControl Center has been overhauled, and it now features rearrangeable tiles and support for multiple pages so you can put what you need most right at the top of it. You can customize all of the Control Center options, adding new controls from the Controls gallery that Apple introduced.\nThere is a grid design where you can move your controls, resizing them to be bigger or larger for easier access. Some controls like Remote can only be as big as four tiles or as small as one tile, while others like Home can be as large as an entire page. Others like volume are limited to two vertical squares, and some, like music, can be four vertical squares or an entire page. Controls like Wi-Fi and Bluetooth are still grouped together, and can be made larger or smaller.\nControls can be organized into separate pages for favorites, music, home, and connectivity, and more, and you can swipe up and down between the Control Center pages. A long, continuous swipe gets you to where you need to go the fastest. Tapping into a smaller set of controls like connectivity or music expands it into a full screen view that you can interact with.\nThird-party apps can create Control Center controls for the first time, so there are a lot more quick access options that you can assign. Apple has also added a power button that's activated with a long press, and there are some new Control Center options like Translate, Tap to Cash, Shortcuts, and numerous Accessibility controls.\n- How to Reorder, Resize, and Remove Buttons in Control Center\n- How to Use the Controls Gallery to Customize Control Center\n- How to Add Multiple Pages to Control Center\nLock Screen\nThe Camera and Flashlight options on the Lock Screen are now considered part of Control Center, which means you can swap them out for other Control Center controls. You can assign those buttons to do different things or turn them off entirely, which is useful for those who don't want to accidentally activate the Camera or Flashlight from the Lock Screen.\nIt can be set to access apps like Home, Calculator, or Translate, or activate features like Dark Mode. There are multiple options, including one to open any app on your iPhone.\nAction Button\nControl Center controls can be assigned to the Action button on the iPhone 15 Pro models, so you can access more apps and features from the button. Available Control Center actions:\n- Calculator\n- Stopwatch\n- Alarm\n- Home\n- Timer\n- Dark Mode\n- Scan Code\n- Airplane Mode\n- Cellular Data\n- Personal Hotspot\n- Dark Mode\n- Quick Note\n- Remote\n- Wallet\n- Tap to Cash\n- Ping My Watch\nRead More\nWe have a more in-depth look at the new Home Screen, Lock Screen, and Control Center features in our dedicated guides.\nNew App Features\nApple added Apple Intelligence features across many of its apps, and also added new features for Messages, Mail, Photos, Safari, and more.\nMessages\niOS 18 includes multiple notable new features for the Messages app aside from the Genmoji and Image Playground additions coming with Apple Intelligence.\nScheduling\nYou can schedule an iMessage to be sent at a later date and time, with Apple permitting texts to be scheduled up to 14 days in advance. Scheduled messages can be set up by tapping the \"+\" sign next to the text field, choosing the More option, and selecting Send Later.\nAfter you've scheduled an iMessage, you can tap it to edit it, delete it, or reschedule it.\nTapbacks\nApple redesigned the default Tapback response options to make them more colorful than before, plus there is support for using any emoji or sticker to respond to a message.\nLong press on a message and tap on the emoji icon to select any emoji or sticker, and this feature also works with custom Genmoji you've created.\nMessages via Satellite\nIn iOS 18, you can send and receive iMessages and SMS text messages using satellite when you don't have a Wi-Fi or cellular connection. Apple previously introduced an Emergency SOS via satellite option for texting in emergencies, but the new option lets you text anyone even when there's not an emergency.\nMessages via satellite works with emoji, Tapbacks, and all messages features, plus end-to-end encryption for iMessages. Messages via satellite works on the iPhone 14 and newer, and it is initially limited to the United States.\nWith iOS 18.3, Apple partnered with Starlink and T-Mobile to allow T-Mobile iPhones to connect to Starlink satellites when a cellular connection is unavailable.\nRCS Support\nApple plans to transition from SMS/MMS to a new messaging protocol, RCS or Rich Communication Services. RCS is designed for text messages between iPhone and Android users or when iMessage is not available, with iMessage still the default for iPhone-to-iPhone conversations.\nRCS brings multiple improvements to conversations with Android users, and Apple is adopting RCS after years of pushing from Google.\n- Support for higher resolution photos and videos.\n- Support for larger file sizes and file sharing.\n- Audio messages.\n- Cross-platform emoji reactions.\n- Real-time typing indicators.\n- Read receipts.\n- Ability to send messages over cellular or Wi-Fi (SMS is cellular only). There is no cost to send an RCS message over Wi-Fi.\n- Improved group chats.\n- Better security. Google's version of RCS has end-to-end encryption, which Apple does not intend to use. Apple is instead work with the GSMA to develop a more secure form of encryption that is baked natively into RCS.\n- Emoji - Messages with a single emoji now depict the emoji as larger than before.\n- Links - Link cards have been improved with a background that matches the content in the link, plus there is an option to send plain text links or opt for full-size or compact link cards.\n- Equations - Math equations can be solved in any text field, including Messages. To get a solution, just type in your equation and then add an equals sign.\n- Hidden\n- Recently Deleted\n- Duplicates\n- Receipts\n- Handwriting\n- Illustrations\n- QR Codes\n- Recently Saved\n- Recently Viewed\n- Recently Edited\n- Documents\n- Imports\n- Maps\n- Recovered\nMore information on all of the features coming with the adoption of RCS can be found in our RCS guide.\nOther Messages Features\nPhotos\nApple overhauled the Photos app with an updated design for the library that essentially combines the For You, Albums, and Library tabs. In iOS 18, there's a main Library section paired with different \"Collections\" that you can get to by scrolling down. Collections include Memories, People and Pets, Recent Days, Trips, Albums, and more.\nYou can still get to the same general library view, but you need to swipe down to access the month and year filtering tools, along with new filter options to hide screenshots and other similar images. You can also pin your own Collections and organize your Photos app to put what's important to you front and center.\nAlong with People and Pets, the Photos app supports Groups for the first time, so you if you have a lot of photos with two or more people, you can see those organized into a specific group as well as individual people. Groups are created automatically using on-device learning, but you can also create them.\nThe Photos app includes Apple Intelligence \"Clean Up\" for image editing. You can use the Clean Up tool to remove unwanted background objects from your images. The Photos app can automatically highlight what you might want to remove based on the composition of the image, but you can also take control and tap, circle, or paint over what you want to remove. The removal tool understands the main subject of the image and maintains the integrity of the photo while filling in the area where an object was removed.\nApple Intelligence can also create custom memory movies of anything that you want to see. You can enter a description like \"all the photos of my cat last winter set to a rock song\" or \"the desserts I ate during the summer, set to a pop song\" and Apple Intelligence finds the relevant photos and create a movie that is complete with a narrative arc.\nSearch in the Photos app is improved with natural language support, so you can describe what you're looking for to find it. You can even search for a specific moment in a video clip.\nApple has added a number of new Utilities albums for finding content within photos like text and receipts. You were previously able to search for some of these options, but having a dedicated Utility folder makes them quicker to get to.\nSome of the Utilities options only show up if you have an image in that category. The Recovered section, for example, shows up if there are pictures or videos on your device that are not in the Photos Library. This can happen from database corruption issues or if images taken with a camera app that do not get properly saved to the Photos app.\nAt the bottom of the Photos app, you'll also see suggestions for images that would make good wallpapers.\nApple is overhauled the Mail app with Apple Intelligence. As of iOS 18.2, incoming emails are organized into categories that include Primary for your main time-sensitive emails, Promotions for marketing and sales messages, Transactions for receipts and order confirmations, and Updates for newsletters and other similar emails.\nApple automatically knows which emails are important and gives them a priority status, which puts them at the top of your Primary inbox. Priority emails include things like flight check-ins, deadlines, and reminders that are due. Messages from the same sender are grouped together, so you can see things like all of your receipts from one vendor or all of the marketing emails from a store in the same place.\nA summary of a long email can be generated with just a tap, so you can check to see if a message is worth your time before you read the entire thing.\nSmart Reply can be used to identify questions in an email that you were asked with your iPhone generating relevant responses so you can send a reply with a few taps.\nSafari\nSafari's \"Highlights\" feature automatically detects relevant information on a webpage and highlights it for you as you browse. You might see highlights for directions, hours, and menus on restaurant and store websites, and on other sites, Safari highlights information about people, music, movies, and TV shows, depending on what you're browsing.\nApple also redesigned the Reader mode, adding a table of contents so you can skip to relevant parts of a site and an option that summarizes the page for you.\nSafari includes Distraction Control, a feature that cuts down on distracting elements on webpages like sign-in windows, cookie preference popups, GDPR notices, newsletter signup banners, autoplay videos, and more. Distraction Control is not an ad blocker and it can'tt be used to block elements on a page that refresh, but it is useful for static elements.\nDistraction Control can be enabled from the Safari Page Menu by tapping the Hide Distracting Items option. From there, elements on the page can be hidden by tapping on them.\nMore on what's new in Safari can be found in our iOS 18 Safari guide.\nPasswords (NEW)\nApple moved the Passwords section in the Settings app to a dedicated Passwords app in iOS 18, so it's now easier to get to all of your passwords and logins that you've stored.\nThe Passwords app holds your passwords and logins for apps and websites, one-time access codes for two-factor authentication, Wi-Fi passwords, and passkeys. There are also dedicated sections for security alerts, with Apple letting you know about passwords that are too short, have been reused, or have been found in a breach.\nYou can share passwords with friends and family by creating a shared password group, which gives everyone logins to shared streaming services, home devices, and more. Passwords are added to the Passwords app automatically when you use Apple's built-in saving feature on an Apple device, but you can also add logins by tapping on the \"+\" button.\nThe app is organized with a search bar at the top and a series of letters so you can search for the login you're looking for or tap on a letter of the alphabet to get to that section quickly. Tapping in to one of your passwords gives the option to change it, add notes, or set up a verification code. Apple lets you know if your password for a given site is strong enough.\nIf you have AutoFill turned on, the Passwords app can supply your passwords and logins for apps and websites. Passwords are synced across iPhone, iPad, Mac, Apple Vision Pro, and even Windows PCs through the iCloud for Windows app.\nYou can find more information on the Passwords app in our dedicated Passwords guide.\nNotes\nNotes includes a feature for capturing audio recordings and putting out a live transcript along with a summary of what's included. Live transcriptions can be searched though, and combined with other documents, comments, and lists in the Notes app.\nMath Notes, a built-in feature in the Notes app, allows you to solve equations, so you can do things like add up a monthly budget or figure out a split for a restaurant bill. It can solve all kinds of math problems, and generates totals when you add in an equals sign.\nFor improved organization, sections in notes can be collapsed down, with this feature available when you have your notes organized with headers. You can also now highlight text in notes, with Apple providing five colors to choose from.\nPhone\nIn the Phone app, there's now an option to record an incoming call. Both parties are alerted when this option is selected, and your iPhone is able to generate a transcript of the call.\nApple has also added support for T9 dialing, allowing you to type a contact's name using the number pad. When you use the letters on the number pad in this way, matching contacts appear above so you can quickly dial you're trying to reach without having to use the Contacts app.\nWhen you type in a number using the keypad in the Phone app, it provides options to create a new contact or add it to an existing contact. Adding a new contact with this method was available previously, but updating an existing contact with a new number was not an option.\nMore on the new features in the Phone app can be found in our Phone app guide.\nWallet\nTap to Cash is a new feature that makes it easy to make in-person payments with another iPhone user. You can tap two iPhones together to send money without having to share your email address or phone number.\nMoney transfers use Apple Cash and are authenticated with Face ID, Touch ID, or a passcode. To use the feature, open up the Wallet app, tap on \"Tap to Cash,\" authenticate, and then touch your iPhone to the iPhone of the person you're paying.\nTickets for events that are stored in the Wallet app have a new look with an included event guide that provides details on bag policies, food options, merchandise, temperature, opening times, parking info, and more.\nWith Apple Pay, Apple supports viewing and using rewards or point balances for credit and debit cards, so you can do things like apply your credit card points toward an Apple Pay purchase. You can also access financing installment options from your bank if you want to pay for something over time.\nMaps\nThe Maps app supports topographic maps that are complete with trail networks and hikes, a feature that Apple first brought to the Apple Watch last year. There are maps of trails and hike suggestions for all 63 national parks in the United States. There are thousands of hikes available, with Apple providing an option to save favorites, add notes, and get information like elevation and length.\nAs with regular maps, the topographic hiking maps can be saved for offline use, complete with turn-by-turn guidance.\nThere is support for creating your own hikes and walking routes, with tools for route options like one way, out and back, or a loop. Creating routes is available for walking directions and is not limited to trails, but there is no option to create a custom driving route.\nRead more about what's new in the Maps app in our dedicated guide.\nJournal\nThe dedicated Journal app now supports logging your state of mind when you write an entry, and time spent journaling can be recorded as mindful minutes in the Health app.\nApple added an insights view so you can see your writing streaks, a calendar with your entries, and stats like places you've visited, number of words you've written, and how often you've journaled during the year.\nOther new additions include options for sorting and searching past entries and adding a widget for tracking streaks or providing writing prompts.\nApple TV App\nThe dedicated Apple TV app supports InSights, a feature that provides more information about music and actors in a TV show or movie. You can get InSights when using the iPhone as a remote for the Apple TV 4K, but it is limited to Apple TV+ shows.\nEnhance Dialogue has been an Apple TV app feature on the Apple TV 4K, but Apple is adding it to the iPhone when playing content through the built-in speakers, AirPods, or other speakers and headphones. Enhance Dialogue uses machine learning and computational audio to boost vocal clarity over the noise of music and background sounds in a show or movie.\nHome\nThe Home app supports new guest features so you can give people temporary access to your smart locks, garage door openers, and alarm systems at select times. Access can repeat, so you can do things like let your house cleaner in weekly at a set time.\nHands-free unlocking is available for door locks that support Ultra Wideband technology, which means you can unlock your door automatically with an iPhone or Apple Watch as you approach.\nApple allows you to select which Home Hub you want HomeKit to rely on, which is handy if you have multiple devices that work as a Home Hub like HomePods and Apple TVs. You can also now use the Adaptive Lighting functionality with Matter smart lights.\nHomeKit provides home electricity use metrics in partnership with electric companies that include Pacific Gas and Electric. As of iOS 18.4, HomeKit supports Matter-enabled robot vacuum cleaners.\nCalculator\nThe Calculator app stores history, so you are able to see all of your prior calculations. In addition to the Basic and Scientific sections, Apple added a Math Notes section to the Calculator app that ties in with the Notes app for solving equations in a note.\nYou can swap modes by tapping on the calculator icon at the bottom of the Calculator app interface, and this icon also opens up a new convert option. If you type in 10, for example, and then hit the calculator icon and then convert, you can choose from all kinds of conversion options.\nCurrency, area, data, energy, force, length, power, pressure, temperature, time, volume, and weight are just some of the inputs you can choose.\nCalendar\nApple refreshed the Calendar app with a new month view that makes it simpler to see the events that you have coming up.\nCalendar also integrates with the Reminders app for creating, viewing, editing, and completing reminders in the Calendar app without having to open up Reminders.\nFind My\nWith iOS 18.2, Apple added a Share Lost Item Location feature, which is designed to allow you to share a lost item's location with a trusted person. Apple says that the feature is meant to help you locate an item through a third-party, like an airline employee, and several airlines have implemented official support for the feature.\nIn the Find My app, there's now an option to \"Share Item Location\" and \"Show Contact Info.\" Choosing the Share Item Location option creates a link that allows someone to see the location of a lost item when they open the link. The link can be opened on a non-Apple device, so people without an iPhone or Mac can help you find something that's lost. Find My links that you share expire after a week and you can see how many people visited the link. Shared links stop working when an item is returned to you or when the link sharing date expires.\nChoosing Show Contact Info lets any phone or tablet connect to a lost item to open a website with more information about it, including the phone number and email address of the person who owns it.\nVoice Memos\niOS 18.2 introduced layered Voice Memos recording for the iPhone 16 Pro and iPhone 16 Pro Max, making it easier for musicians to flesh out song ideas and experiment with new ideas.\nOnce installing iOS 18.2, iPhone 16 Pro and Pro Max users can layer a vocal track on top of an existing instrumental recording, with no headphones needed. Instrumental compositions can be played through the iPhone's speaker while vocals are recorded at the same time using the iPhone 16 Pro microphones.\nApple says that this feature is powered by the A18 Pro chip, using advanced processing and machine learning to isolate the vocal recording. Voice Memos is able to create two individual tracks so users can apply additional mixing and production in apps like Logic Pro.\nInvites\niOS 18 includes an \"Invites\" app that came out in February 2025. It is designed to allow users to plan events like birthday parties, graduations, vacations, baby showers, and more, creating custom invitations and tracking responses.\nThe Invites app supports RSVPs, integrates with the Maps and Weather apps, and includes features like shared albums for sharing photos and videos and a shared Apple Music playlist option.\nInvites is an iCloud+ service, which means an iCloud+ plan is required to create an event, but anyone can respond to an invite, even Android or PC users.\nmacOS Sequoia iPhone Mirroring\nWith an iPhone running iOS 18 and a Mac running macOS Sequoia, you can use the new iPhone Mirroring feature. iPhone Mirroring lets you control your iPhone from your Mac.\nWhen you're signed in to the same Apple ID on a Mac and an iPhone, you can use iPhone Mirroring to interact with your iPhone from your Mac even when the iPhone is locked. You can open up and use apps, receive and interact with notifications, and send messages.\nYou can use your Mac keyboard, trackpad, or mouse with your iPhone, which is useful for typing up long emails and other documents on the iPhone. As of iOS 18.1, iPhone Mirroring allows files, photos, and videos to be dragged and dropped between your iPhone and Mac and vice versa.\nWe have a complete guide on how to use iPhone Mirroring, how it works, and more, if you're looking for more information.\nAirPods Pro Updates\niOS 18 brings several changes to AirPods Pro 2, Apple's latest earbuds. With head gestures, you can control the AirPods Pro handsfree and without speaking. Just nod your head up and down or shake it to respond to incoming notifications and phone calls. Nodding answers a call, while shaking your head declines it.\nVoice Isolation cuts down on background noise so your voice sounds clearer to the person you're speaking with on a phone call. The microphones on the AirPods Pro avoid picking up ambient noise with Voice Isolation, prioritizing your voice.\nThere's already an Adaptive Noise Control feature that adjusts sound and Active Noise Cancellation in response to changes in the environment, and in iOS 18, there's a \"Customize\" setting for adjusting it to allow for more or less environmental noise to come through.\nHearing Health\nWith iOS 18.1, Apple added hearing aid and hearing health capabilities to the AirPods Pro 2. The AirPods Pro 2 and a connected iPhone are able to provide a hearing test to users to look for signs of hearing loss. The test plays a series of tones across different frequencies, similar to what takes place in an audiologist's office.\nFor people who have minor to moderate hearing loss, there is an option to use the AirPods Pro 2 as a dedicated hearing aid. The sound from the AirPods Pro 2 is configured based on each individual's hearing profile, and it boosts parts of speech, elements in the environment, and more in real time.\nAlong with hearing assistance, the AirPods Pro 2 offer hearing protection. The earbuds continuously monitor the environment and reduce loud sounds like traffic or concerts. Hearing protection is available across modes, such as Transparency and Active Noise Cancellation.\nPrivacy Features\nAs mentioned earlier, you can lock and hide apps to require Face ID or Touch ID to access them, but there are also a few other privacy additions in iOS 18.\nApple redesigned the Privacy and Security section of the Settings app, providing at-a-glance information about what you're sharing so you can make adjustments. The Privacy and Security section shows how many apps have access to various privacy settings like location, camera, microphone, and more.\nWhen apps request access to your contacts in iOS 18, you now have the option to share just a few contacts instead of sharing your entire address book. You are able to select exactly which contacts an app is able to access, if any.\nApple created a new way for developers to pair Bluetooth accessories to the iPhone that allows for pairing without providing information about nearby Bluetooth devices.\nNFC\nWith iOS 18.1, Apple opened up the NFC chip to developers, allowing them to offer in-app contactless transactions that are separate from Apple Pay and Apple Wallet.\nApple created new APIs that let NFC be used for in-store payments, car keys, closed-loop transit, corporate badges, student IDs, home keys, hotel keys, merchant loyalty and rewards cards, and event tickets, plus government IDs in the future. The APIs use the Secure Enclave for privacy and security.\nYou can make a contactless payment with your iPhone using a payment method other than Apple Pay with this new functionality, and banks and other companies can offer their own contactless payment options.\nTo use NFC in an app, you need to open up the app and then double click on the Side button to initiate a transaction. There is also an option to set a third-party app as the default contactless app in the Settings app.\nNFC and Secure Enclave APIs are available to Australia, Brazil, Canada, Japan, New Zealand, the UK, and the U.S. first, with an expansion to additional regions planned in the future. iOS 18.1 is required.\nGame Mode\nA dedicated Game Mode in iOS 18 is designed to minimize background activity so that all of the iPhone's processing power can go toward the game. Game Mode is meant to provide consistently high frame rates, even when gaming for hours.\nGame Mode also cuts down on audio latency with AirPods, and it makes game controllers more responsive than before. Apple says that the Bluetooth polling rate with wireless controllers is doubled for better in-game responsiveness.\nGame developers are now able to take advantage of Personalized Spatial Audio to create more immersive audio for their games.\nAccessibility\nApple announced several new accessibility features coming to iOS 18 in May, giving us a quick preview of what to expect.\nReduce Motion Sickness\nThere's a new Vehicle Motion Cues option that's meant to prevent motion sickness when looking at an iPhone or iPad while in a moving vehicle as a passenger. Motion sickness is often caused by a sensory conflict between what a person sees and what they feel, which is an issue in a moving vehicle.\nMotion Vehicle Cues use visual elements on the display that indicate real-time changes in motion. Basically, animated dots at the edges of the screen represent changes in vehicle motion, reducing sensory conflict without interfering with the main content. The option can be set to show automatically on the iPhone and it can be turned on and off in Control Center.\nEye Tracking\nEye Tracking allows users to navigate through the iPhone or iPad interface with only their eyes. The feature uses AI and the front-facing camera to determine where a user is looking. It can be used to activate buttons, swipes, and other gestures.\nMusic Haptics\nWhen Music Haptics is enabled, the iPhone's Taptic Engine plays \"taps, textures, and refined vibrations\" that correspond to the audio of the music. The feature works across millions of songs in the Apple Music catalog and developers can implement it into their apps.\nVocal Shortcuts\nWith Vocal Shortcuts, iPhone and iPad users can assign \"custom utterances\" so that Siri is able to launch shortcuts and understand complex tasks.\nOther New Features in iOS 18\nThere are a ton of new feature additions that don't fit into specific categories, so we've listed some of the other useful updates available with the new software.\n- External Drives - There's an option to format external drives connected to the iPhone.\n- New APIs - Third-party apps can integrate with the Translate app and offer spatial video recording.\n- Emergency SOS - Video can be sent to emergency responders with Emergency SOS Live Video support.\n- Siri Wake Word - Siri can be assigned a new name with the Vocal Shortcuts Accessibility feature, plus there's an option to use Siri to set up triggers for screenshots, changing volume, opening apps, activating Control Center, and more.\n- Accessory Pairing - Apps are able to offer AirPods-like simple pairing for Bluetooth and Wi-Fi accessories.\n- SharePlay - SharePlay now supports drawing on someone's screen so you can give instructions, or taking control of a screen. This feature is not available in the European Union.\n- Podcasts - The Podcasts app shows chapter segments in a podcast when you scrub through an episode, so it's easier to skip around.\n- iCloud Drive - In iCloud Drive, there's a new \"Keep Downloaded\" option so you can select files and folders that remain stored locally on your device as well as in iCloud.\n- Lock Screen Clock - You can now select a multicolor clock on the Lock Screen.\n- Battery Charging - When charging, the Battery section of the Settings app lets you know if you're using a slow charger.\n- Button Animations - When you press a button on the iPhone in iOS 18, there's a pop-out bezel animation.\n- Background Sounds - There are two new Background Sound options: Night and Fire.\n- Camera App - When recording a video, you can choose to have the audio playing on your iPhone continue to play in the background rather than automatically pausing.\nCompatibility\niOS 18 runs on all iPhones that are able to run iOS 17, which includes the iPhone XR, iPhone XS, iPhone SE 2, and newer.\n- All iPhone 16 models\n- All iPhone 15 models\n- All iPhone 14 models\n- All iPhone 13 models\n- All iPhone 12 models\n- All iPhone 11 models\n- iPhone XS and XS Max\n- iPhone XR\n- iPhone SE (2nd and 3rd gen)\nThough iOS 18 is compatible with many older iPhones, on-device AI capabilities require an iPhone 15 Pro or later."
    },
    {
      "url": "https://www.macrumors.com/guide/siri/",
      "text": "Siri is the voice assistant on Apple devices, equivalent to Amazon's Alexa, Microsoft's Cortana, and Google's Google Assistant. Siri is available across most of Apple's devices, including iPhone, iPad, Mac, Apple Watch, Apple TV, and HomePod.\nYou can ask Siri all kinds of questions, from simple queries about the weather to more complex questions about everything from sports scores to the number of calories in food. Siri can also enable or disable settings, find content, set alarms and reminders, place calls and texts, and so much more.\nThis guide covers the basics of Siri, including some of the commands you can use to activate Siri, devices that have Siri included, and devices that support more advanced hands-free \"Hey Siri\" commands.\nActivating Siri\nOn an iPhone or iPad, Siri can be activated by holding the Home button on compatible models or holding the Side button on devices without a Home button. On iOS 14 and later, on the iPhone and the iPad, Siri pops up as a small icon at the bottom of the device's display, and on devices capable of Apple Intelligence, there is a Siri glow around the display that denotes that the personal assistant is activated.\nOn the Mac, you can click on the Siri app icon on the dock or the menu bar, or press and hold the command key and the space bar. On iPhones, iPads, and Macs, you can activate Siri with a \"Hey Siri\" wake word.\nOn the Apple Watch, you can say \"Hey Siri\" to activate Siri. On Apple Watch Series 3 or later with the latest version of watchOS, there's a Raise to Speak feature that lets Siri respond to commands even without the Hey Siri trigger word. Just hold the watch up near your mouth and speak a command. Siri can also be activated by holding down on the Digital Crown.\nOn first-generation AirPods, a double tap activates Siri, and on second-generation AirPods, Siri can be activated with the \"Hey Siri\" command.\nOn HomePod, say \"Hey Siri\" or press on the top of the HomePod to activate Siri.\nOn the fourth and fifth-generation Apple TV, hold down the Siri button on the remote (the button with the microphone) to activate Siri. On the sixth-generation Apple TV or models with the newer Siri Remote (the aluminum remote), press on the side button to activate Siri.\nDevices Compatible With Siri\nSiri is on almost every Apple device, and it's built into macOS, iOS, watchOS, and tvOS. You can activate Siri on Macs running macOS Sierra or later, all Apple Watch models, the Apple TV HD and Apple TV 4K, all modern iPhones, all AirPods models, the HomePod, and the HomePod mini.\nMultiple Siri Devices\nWhen multiple devices that can respond to \"Hey Siri\" commands are available, the devices will use Bluetooth to determine which one should respond to the request so not all of them answer at once. According to Apple, the device that heard you best or the device that was most recently raised or used will respond.\nIf you have a HomePod, the HomePod will often take precedent and respond to \"Hey Siri\" requests even when other devices that support the feature are nearby.\nCountries Where Siri Support is Available\nSiri is available in more than 35 countries around the world, including the U.S., UK, Canada, Australia, New Zealand, and many countries in Asia and Europe.\nA full list of countries where Siri is available can be found on Apple's Feature Availability website.\nCertain Siri features like translations, sports info, restaurant information and reservations, movie information and showtimes, dictionary, calculations, and conversions are limited to a smaller number of countries.\nWhat Siri Can Do\nBelow is a list of some of the commands and questions Siri is able to respond to, and some of the actions Siri is able to take.\n- Make calls/Initiate FaceTime\n- Send/read texts\n- Send messages on third-party messaging apps\n- Set alarms/timers\n- Set reminders/check calendar\n- Split a check or calculate a tip\n- Play music (specific songs, artists, genres, playlists)\n- Identify songs, provide song info like artist and release date\n- Control HomeKit products\n- Play TV shows and movies, answer questions about them\n- Do translations and conversions\n- Solve math equations\n- Offer up sports scores\n- Check stocks\n- Surface photos based on person, location, object, and time\n- Apple Maps navigation and directions\n- Make reservations\n- Open and interact with apps\n- Find files (on Mac)\n- Send money via Apple Pay\n- Check movie times and ratings\n- Search for nearby restaurants and businesses\n- Activate Siri Shortcuts\n- Search and create Notes\n- Search Twitter and other apps\n- Open up the Camera and take a photo\n- Increase/decrease brightness\n- Control settings\n- Tell jokes, roll dice, flip a coin\n- Play voicemails\n- Check the weather\nApple Intelligence\nStarting with iOS 18, iPadOS 18, and macOS Sequoia, Apple made Siri more intelligent on devices that support Apple Intelligence. This includes devices with an A17 Pro chip or later or an M-series chip. These chips are included in the iPhone 15 Pro, iPhone 16 models, all Macs with Apple silicon, all iPads with Apple silicon, and the iPad mini 7.\nWith Apple Intelligence, Siri has a new look. There's now a glow around the edges of the display when Siri is activated, applicable to iPhone, iPad, and CarPlay. On Mac, the Siri window can be placed anywhere. The glow animates responsively to the sound of your voice so you can tell when Siri is listening without interrupting other things you're doing.\nApple also added a Type to Siri feature, so you can type requests to Siri instead of speaking them. To activate Type to Siri, you can double tap on the bottom of the display. On Mac, you need to press the Command key twice to bring up Type to Siri. Type to Siri includes suggested requests so you can get your questions answered faster.\nSiri is now able to maintain context between requests so you can ask a question and then reference it in a second reply. If you ask about the temperature in Raleigh, for example, and then follow up with \"what's the humidity?\" Siri should know you mean in Raleigh. If you stumble over your words when speaking to Siri, or change what you're saying mid-sentence, Siri will follow along.\nSiri has Apple's product knowledge and support base for answering questions about your device's features and settings, and can even find settings when you don't know the exact name by using natural language search.\nSiri ChatGPT Integration\nOne of the biggest features in Apple Intelligence is Siri's integration with ChatGPT. Siri ChatGPT integration lets Siri hand requests over to OpenAI's ChatGPT. ChatGPT is off by default, but you can turn it on in the Apple Intelligence and Siri section of the Settings app.\nIf ChatGPT integration is enabled, Siri will consult ChatGPT for complex requests. Complex requests might include creating an image, generating text from scratch, making recipe ideas based on what's in your refrigerator, describing what's in a photo, and more.\nSiri will analyze each request to see if it's something that needs to be answered by ChatGPT, but you can also automatically invoke ChatGPT for a request by using a request like \"Ask ChatGPT to give me a chocolate chip cookie recipe.\" Siri asks your permission before querying ChatGPT, but there is an option to turn off that extra permission step by toggling off \"Confirm ChatGPT Requests\" in the ChatGPT section of Settings.\nYou don't need an account to use ChatGPT, and it is free, but if you have a paid account, you can sign in. If you're not signed in, OpenAI does not store any of your ChatGPT requests, nor is your information used for training ChatGPT. If you sign in, ChatGPT can save a copy of your queries. Apple does not store ChatGPT queries.\nChatGPT can be used with Siri, but it is also integrated into Writing Tools and Visual Intelligence. With Writing Tools, ChatGPT can generate text, and with Visual Intelligence, ChatGPT can answer questions about what the Camera sees.\nSiri\nApple released some of the Siri features in iOS 18.1, iPadOS 18.1, and macOS Sequoia 15.1, but additional Siri capabilities are coming in later updates to iOS 18, iPadOS 18, and macOS Sequoia. We'll likely see these sometime around the iOS 18.5 update in May. Apple is working on onscreen awareness, personal context, and the ability to take more actions in and across apps.\nOnscreen awareness will let Siri take actions when you ask something about what's on your display. If you're looking at a photo and want to message it to your friend Eric, you'll be able to tell Siri to \"Send this picture to Eric,\" and Siri will understand and do it.\nPersonal context will let Siri do more with your personal data like emails and messages. This is an on-device feature, and it will let Siri learn more about you, who you're communicating with, and how you use your device. Personal context will let you do things like ask Siri to find a specific message, or remind you when you took a photo that you're looking for.\nThe Siri option to take more actions in and across apps will drastically improve what Siri is capable of. You'll be able to move files from one app to another and control app functions with Siri that you never could before. It'll work in third-party apps as well as Apple's own apps.\nPassive Siri\nSiri is an active assistant that you can interact with, but Apple has also integrated Siri into other aspects of iOS and watchOS, allowing Siri to make proactive suggestions that you can act on.\nOn the iPhone, iPad, and Apple Watch, Siri can make various kinds of recommendations. When you're running late for a scheduled meeting, for example, Siri might suggest that you call your boss either on the Home screen or when you swipe down to search and access the Siri Suggestions options.\nIn Messages and Mail, Siri can suggest things like phone numbers or addresses based on what you've typed, and in Safari, Siri can offer up search suggestions. Siri can do other things like suggest HomeKit scenes to activate, suggest a time to leave when you have an event scheduled, suggest events to add to your calendar from your email, and more. Siri suggestions are all based on your personal device usage habits, so what you see will vary.\nOn-Device Speech Processing and Personalization\nA lot of Siri's speech processing and personalization features are handled on-device, which allows for more security than typical personal assistants that use the cloud for everything. Most audio requests are kept entirely on-device and are not uploaded to Apple's servers, but if ChatGPT is engaged, data is sent to OpenAI, and some Apple Intelligence features also require cloud connectivity.\nApple has designed Private Cloud Compute, a secure way for devices to interface with Apple servers.\nOffline Support\nWith on-device processing now available, there are a wide range of Siri requests that can be handled offline. Siri can create (and disable) timers and alarms, launch apps, control audio playback, and access Settings options. Apple says Siri can also process Messages, sharing, and Phone requests.\nSiri Privacy\nSiri does send data back to Apple, but searches and requests are not associated with your identity to keep your personal information safe.\nApple does not sell your data to advertisers or other organizations, and end-to-end encryption is used for all data syncing between your devices and the cloud. Apple does sometimes use Siri recordings for improving Siri's performance, but there's now a toggle to opt out of Siri data collection and usage, which can be found in our how to.\nGuide Feedback\nHave questions about Siri, know a feature we left out, or want to offer feedback on this guide? Send us an email here."
    },
    {
      "url": "https://www.macrumors.com/2025/08/01/tim-cook-apple-all-hands-meeting-ai/",
      "text": "Tim Cook Defends Apple's AI Delay: 'We've Rarely Been First'\nApple CEO Tim Cook spoke to employees at an all-hands meeting today, providing some insight into Apple's work on AI. According to Bloomberg, Cook said that AI is going to be bigger than smartphones and the internet, and that it's a priority for the company.\n\"Apple must do this. Apple will do this. This is sort of ours to grab. We will make the investment to do it,\" Cook told employees.\nCook pointed out that Apple has dominated several markets even when the company wasn't first to the technology. \"We've rarely been first. There was a PC before the Mac; there was a smartphone before the iPhone; there were many tablets before the iPad; there was an MP3 player before iPod,\" Cook said, suggesting that Apple will play a major role in transforming AI in the future.\nThe all-hands meeting comes a day after Apple's earnings call, where Cook made similar remarks about Apple's plan to make significant investments in AI. During the call, Cook said Apple was open to making an acquisition that would accelerate its roadmap.\nApple has held talks with Perplexity and Mistral about a potential major AI acquisition, and the company has also discussed using technology from OpenAI or Anthropic for an LLM-based version of Siri.\nApple software chief Craig Federighi was also on hand to discuss Siri, and he said the company's efforts to overhaul the underlying Siri architecture are promising. Apple is getting the \"needed\" results from the Siri overhaul. \"This has put us in a position to not just deliver what we announced, but to deliver a much bigger upgrade than we envisioned. There is no project people are taking more seriously,\" Federighi said.\nCook and Federighi may have been aiming to reassure employees about Apple's dedication to AI due to Meta's efforts to poach AI experts. Several Apple AI engineers have left Apple for Meta because Meta has been offering massive pay packages, and morale at Apple has been falling.\nPopular Stories\nApple is expected to unveil the iPhone 17 series on Tuesday, September 9, and last-minute rumors about the devices continue to surface.\nThe latest info comes from a leaker known as Majin Bu, who has shared alleged images of Apple's Clear Case for the iPhone 17 Pro and Pro Max, or at least replicas.\nImage Credit: @MajinBuOfficial\nThe images show three alleged changes compared to Apple's iP...\nAn iPhone 17 announcement is a dead cert for September 2025 – Apple has already sent out invites for an \"Awe dropping\" event on Tuesday, September 9 at the Apple Park campus in Cupertino, California. The timing follows Apple's trend of introducing new iPhone models annually in the fall.\nAt the event, Apple is expected to unveil its new-generation iPhone 17, an all-new ultra-thin iPhone 17...\nApple will launch its new iPhone 17 series this month, and the iPhone 17 Pro models are expected to get a new design for the rear casing and the camera area. But more significant changes to the lineup are not expected until next year, when the iPhone 18 models arrive.\nIf you're thinking of trading in your iPhone for this year's latest, consider the following features rumored to be coming to...\nApple and Samsung have reportedly issued cease-and-desist notices to Xiaomi in India for an ad campaign that directly compares the rivals' devices to Xiaomi's products. The two companies have threatened the Chinese vendor with legal action, calling the ads \"disparaging.\"\nAds have appeared in local print media and on social media that take pot shots at the competitors' premium offerings. One...\nApple is preparing to release iOS 18.7 for compatible iPhone models, according to evidence of the update in the MacRumors visitor logs.\nWe expect iOS 18.7 to be released in September, alongside iOS 26. The update will likely include fixes for security vulnerabilities, but little else.\niOS 18.7 will be one of the final updates ever released for the iPhone XS, iPhone XS Max, and iPhone XR,...\nAnother hint has surfaced that Apple is preparing to eliminate the physical SIM card tray from iPhones in more countries this year.\nIn particular, a source familiar with the matter has informed MacRumors that retail employees at Apple Authorized Resellers in the EU are required to complete a training course related to iPhones with eSIM support by Friday, September 5. There are 27 countries..."
    }
  ],
  "argos_summary": "Apple will launch an AI‑powered web search feature, dubbed World Knowledge Answers, in Siri by early 2026, enabling users to query general topics and receive summarized responses. The feature relies on a second‑generation Siri architecture built on large language models, with Apple partnering with Google’s Gemini for some components and testing models from Anthropic and its own foundation models. Initially limited to Siri, the search engine may later extend to Spotlight and Safari, offering text, photo, video, and local point‑of‑interest queries.",
  "argos_id": "3VEF6AR7W"
}