{
  "url": "https://www.rawstory.com/epstein-survivors-speak-scared/",
  "authorsByline": "Travis Gettys",
  "articleId": "63453eebd5f24264b7669dafdcc4413d",
  "source": {
    "domain": "rawstory.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.rawstory.com/media-library/image.png?id=61551540&width=1200&height=600&coordinates=0%2C25%2C0%2C25",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T16:17:27+00:00",
  "addDate": "2025-09-03T16:28:46.400435+00:00",
  "refreshDate": "2025-09-03T16:28:46.400436+00:00",
  "score": 1.0,
  "title": "'I'm already scared enough': Epstein survivor sidesteps direct question about Trump",
  "description": "A Jeffrey Epstein survivor sidestepped a direct question about President Donald Trump as she urged lawmakers to mandate the release of materials related to the late financier's sex trafficking network.Dozens of survivors appeared Wednesday morning on Capitol Hill at an event organized by Reps. Thoma...",
  "content": "A Jeffrey Epstein survivor sidestepped a direct question about President Donald as she urged lawmakers to mandate the release of materials related to the late financier's sex trafficking network. Dozens of appeared Wednesday morning on Capitol Hill at an event organized by Reps. Thomas Massie (R-KY) and Ro Khanna to urge lawmakers to support a discharge position they have filed mandating the release of Justice Department records about Epstein's crimes. \"It's not okay for us to be silenced and it's not okay for Jeffrey Epstein and everybody else to be put on a pedestal,\" said abuse survivor Marina Lacerda. \"I think everybody needs to hear from us because we know what went on, right, and there is not only me who's been silenced. There are hundreds of women that are silenced. My hope is to stop this abuse for the future, right, for people that are coming up for women – my daughter, for example. These people have these women have daughters, they they most definitely don't want that anymore, and I think mainly it is it is this is therapy for all of us to, you know, we want to be heard.\" \"Nobody also has ever asked me to speak,\" she added. \"That's also another thing, so I can say for all of us here we are here we want this bill to pass. It is very important and we need transparency. We are tired of looking at the and seeing Jeffrey Epstein's name and saying that this is a hoax. We are tired of it, we are done, we are not going to be silenced, and I hope that my voice will bring other survivors and other victims to come along and speak up so that we can be more of a stronger voice and louder.\" President Donald Trump's came up multiple times during the news conference, and a reporter asked Lacerda what she would say to him if given a chance. \"Listen, I don't like to, I don't want to send a direct message to him,\" Lacerda said. \"I'm already scared enough. Yeah, just just pass the vote, listen to us. This is not a hoax, like, it's not going to go away.\"",
  "medium": "Article",
  "links": [
    "https://www.rawstory.com/epstein-survivors-speak-scared/",
    "https://www.rawstory.com/doj-blasted-failure-hinted-maxwell/",
    "https://www.rawstory.com/trump-epstein-2673886078/",
    "https://www.rawstory.com/jeffrey-epstein-2673877419/",
    "https://www.rawstory.com/trump-news/",
    "https://youtu.be/66KliQmNTg0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Epstein survivor",
      "weight": 0.10313593
    },
    {
      "name": "Jeffrey Epstein",
      "weight": 0.0980732
    },
    {
      "name": "abuse survivor Marina Lacerda",
      "weight": 0.094690286
    },
    {
      "name": "other survivors",
      "weight": 0.086102195
    },
    {
      "name": "Epstein",
      "weight": 0.08133783
    },
    {
      "name": "direct question",
      "weight": 0.08045036
    },
    {
      "name": "Reps. Thomas Massie",
      "weight": 0.07757188
    },
    {
      "name": "President Donald Trump",
      "weight": 0.07592536
    },
    {
      "name": "President Donald",
      "weight": 0.069026716
    },
    {
      "name": "Marina Lacerda",
      "weight": 0.06855987
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.986328125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.91015625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.90771484375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8232421875
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.5849609375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.3720703125
    }
  ],
  "sentiment": {
    "positive": 0.049510755,
    "negative": 0.7484544,
    "neutral": 0.2020348
  },
  "summary": "A Jeffrey Epstein survivor, Marina Lacerda, has urged Congress to mandate the release of materials related to the late financier's sex trafficking network. She appeared at an event organised by Reps. Thomas Massie (R-KY) and Ro Khanna, to urge lawmakers to support a discharge position they have filed demanding the Justice Department records about Epstein's crimes. Lacerada stated that \"it's not okay for us to be silenced and it's not acceptable for Jeffrey Epstein and everybody else to be put on a pedestal.\" She also mentioned that \"nobody\" has ever asked her to speak publicly.",
  "shortSummary": "A Jeffrey Epstein survivor urged lawmakers to release information on his crimes, emphasizing the need for transparency and encouraging other survivors to speak out.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3554d035674f4778acc1bb7dfe65fcc3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.rawstory.com/trump-news/",
      "text": "Gavin Newsom calls out Trump's 'dementia' after he repeats wildfire conspiracy theory\nGov. Gavin Newsom (D-CA) accused President Donald Trump of having dementia because he keeps repeating the same lie over and over again.\nThe conspiracy theory is that Newsom somehow wasn't releasing a flood of water that could be used to extinguish the wildfires in Southern California. Somehow he was sitting on tons of water that could be used to fight the fires that comes from snow runoff.\nAccording to Trump, the entire wildfire in Southern California would never have happened to begin with due to sprinklers.\n\"You wouldn't have had the fire because all the sprinklers would've worked in the houses,\" said Trump.\nHomes don't have fire suppression sprinkler systems. Large structures do.\n\"Forty-six states have completely removed the sprinkler requirements for one- and two-family homes,\" said the National Association of Home Builders.\nAs one fact-check, from CNN, explained, \"This is false. Newsom has never refused to sign a 'water restoration declaration.' In fact, there is no such document, as Newsom’s office said on social media on Wednesday and experts on California water policy confirmed.\"\nJeffrey Mount, a senior fellow in the Water Policy Center at the Public Policy Institute of California think tank, told CNN in January, “At no time was water scarcity in general an issue. Rather, there were local shortages of water during the firefight, principally due to infrastructure constraints. But Southern California has plenty of water in storage right now, so this was not a limiting factor.\"\nNewsom even published comments on the governor's website from water agencies, water contractors, and a metro water district dispelling Trump's myth.\nNewsom replied to Trump's post with a screen capture in which he asks the AI site Perplexity whether it's a sign of dementia to repeat the same \"crazy conspiracies\" over and over again.\nPeople with dementia often repeat the same statements, questions, and sometimes false or mistaken beliefs, primarily because of memory loss and impaired reasoning. This repetitive behavior can include everyday concerns, but may also involve delusions of persistent falsehoods, such as believing people are stealing from them or thinking they are in danger—sometimes leading to repeated expression of these ideas,\" Perplexity wrote, according to Newsom's screen capture."
    },
    {
      "url": "https://www.rawstory.com/doj-blasted-failure-hinted-maxwell/",
      "text": "Critics argue that the Justice Department’s recent public release of the convicted sex offender Ghislaine Maxwell's interview with Deputy Attorney General Todd Blanche is more theatrical than revelatory.\nA report in The Guardian published Sunday noted that Maxwell hinted that convicted pedophile Jeffrey Epstein's associates included members of President Donald Trump’s cabinet, yet Blanche made no effort to follow up. Observers say this lapse suggests the department prioritized optics over accountability.\nBlanche asked Maxwell whether individuals in Epstein’s circle, including “the numerous high‑profile and powerful men who had known him,\" might have been involved with him for sexual purposes. In response, Maxwell said that some of the “cast of characters” around Epstein were “in your cabinet, who you value as your co‑workers.”\nREAD MORE: 'Superficial': Analysis shows how this Fox News star's Trump appointment is backfiring\nLegal observers, like former federal prosecutor Neama Rahmani, criticized the approach as superficial.\nRahmani told the Guardian: “Many of Blanche’s questions were surface‑level and didn’t drill down the way lawyers, especially prosecutors, do when they want to catch inconsistencies.”\nHe added: “She has zero credibility and I don’t believe for a second that she saw nothing and knows nothing. Perhaps Blanche’s questions were more of the softball variety … there was no world where Maxwell was going to implicate herself … or anyone in the administration when she is trying to get a presidential pardon.”\nSpencer Kuvin, a lawyer representing Epstein survivors, told the outlet: “We have heard nothing from the DoJ or the House subcommittee regarding request to speak with either the attorneys for the victims or the victims … The victims have been ignored in this entire process.” Another attorney said they received document updates but “no requests to speak to my clients.”\nREAD MORE: 'Reveals everything': Trump ripped for 'meltdown' at White House worker\nJennifer Freeman, also a counsel for Epstein survivors, charged: “Ghislaine Maxwell is a convicted sex trafficker and felon who has been previously accused of lying under oath. [Her conversations] reveal nothing shocking; Maxwell provided a version of the truth that best suits her agenda … For far too long survivors have been left in the dark, shut out and shunted aside from receiving vital information in their most painful hours.”"
    },
    {
      "url": "https://www.rawstory.com/jeffrey-epstein-2673877419/",
      "text": "A press conference in which several victims of Jeffrey Epstein will speak publicly “for the first time” has been scheduled for early September in a bipartisan effort to force President Donald Trump’s hand in releasing files on the disgraced financier.\nThe presser is organized by Reps. Thomas Massie (R-KY) and Ro Khanna (D-CA), and is scheduled for Sept. 3 at the U.S. Capitol in Washington, D.C. It is part of an ongoing bipartisan push to compel the Trump administration to release files on Epstein, who died in 2019 awaiting trial on sex-trafficking charges and is alleged to have maintained a ‘client list’ of powerful figures for blackmail purposes.\n“Rep. Khanna and I will be hosting a press conference at the Capitol joined by survivors of Epstein and (Epstein associate Ghislaine) Maxwell’s abuse – several of whom will be speaking out for the first time,” Massie wrote in a social media post Monday on X. “The survivors deserve justice and Americans deserve transparency.”\nTrump has been unable to shake scrutiny from a sizable share of his own base of support over his handling of the Epstein case, despite repeated attempts to label theories around Epstein as a Democrat-manufactured “hoax.”\nThe backlash has intensified amid swirling rumors that Trump is weighing a pardon for Maxwell, who is serving a 20-year sentence for sex trafficking in connection with Epstein.\nMassie has been among the most outspoken Republicans as it relates to Epstein, and is currently planning to file a discharge petition when the House reconvenes on Tuesday to compel the DOJ to release all files on Epstein. He’s voiced concerns, however, that House Speaker Mike Johnson (R-LA) may “try to pull a fast one” and rewrite House rules to block his discharge petition.\nTrump has responded fiercely to Massie’s efforts to increase transparency around Epstein, calling the Kentucky lawmaker the “worst Republican congressman,” and vowing to support a Republican primary challenger to oust him from office. The pair also went head-to-head as Massie refused to support Trump's 'big, beautiful bill.\"On September 3rd at 10:30am ET, @RepRoKhanna and I will be hosting a press conference at the Capitol joined by survivors of Epstein and Maxwell's abuse — several of whom will be speaking out for the first time.\nThe survivors deserve justice and Americans deserve transparency. pic.twitter.com/JuoAJhWla6\n— Thomas Massie (@RepThomasMassie) August 11, 2025"
    },
    {
      "url": "https://www.rawstory.com/trump-epstein-2673886078/",
      "text": "President Donald Trump has said very little about disgraced financier Jeffrey Epstein's sex trafficking victims, but the story is different inside the White House, according to a new report.\nRolling Stone spoke with two White House insiders \"familiar with [Trump's] private remarks\" about how he describes the victims when the cameras are not around. The report was published as the president tries to distract his base from his administration's refusal to release the Epstein case files, despite promising to release them on the campaign trail.\n\"At times, Trump has said that some of these people speaking out are, in his words, clearly of a 'Democrat' political affiliation, while wondering aloud if some of them are coordinating with prominent liberal attorneys or groups,\" Rolling Stone reported.\nA White House official responded to the story by saying, \"None of this is true.\"\nTrump has tried desperately to distract from his administration's mishandling of the Epstein files. Multiple media reports have indicated that Trump and Epstein had close ties for several years, despite Trump's claims that he and Epstein were never close.\nThe president has also been implicated in some of Epstein's affairs, although the extent to which he was involved remains unknown. For example, it was reported that Trump was notified in May that he appears in the Epstein files. Other reports indicate that hundreds of FBI agents were assigned to comb through the Epstein files and remove any mentions of Trump."
    }
  ],
  "argos_summary": "Jeffrey Epstein survivor Marina Lacerda, joined by other survivors, appeared on Capitol Hill to urge lawmakers to mandate the release of DOJ records on Epstein’s sex‑trafficking network. She emphasized that survivors should not be silenced and called for transparency, while sidestepping a direct question about President Donald Trump. The event, organized by Representatives Thomas Massie and Ro Khanna, seeks to pressure the Trump administration to provide the requested files.",
  "argos_id": "48BKV57X0"
}