{
  "url": "https://www.howtogeek.com/reasons-ive-started-using-flash-drives-over-ssds/",
  "authorsByline": "Bertel King",
  "articleId": "41a797498ad54463b33edb463b4f410a",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static0.howtogeekimages.com/wordpress/wp-content/uploads/2025/09/pattern_of_usb_flash_drives_and_ssds_in_different_colors_arranged_on_a_blue_background.jpg?w=1600&h=900&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T16:30:15+00:00",
  "addDate": "2025-09-03T16:41:51.864173+00:00",
  "refreshDate": "2025-09-03T16:41:51.864175+00:00",
  "score": 1.0,
  "title": "5 Reasons I've Started Using Flash Drives Over SSDs",
  "description": "Sometimes, smaller is better.",
  "content": "When it comes to backups, it’s easy to think bigger is better—but I’ve started going smaller. I’m done with bulky spinning disks and rarely even reach for an external SSD. I’m now all about flash drives.\n\nIt All Comes Down to Portability\n\nI don’t use your typical computer. I’m writing these words on my Samsung Galaxy Z Fold 6, a device that has completely replaced my laptop. If you’ve never tried, it’s rather easy to plug in an external hard drive to a phone and transfer files. USB-C devices just work. Drives with a traditional USB-A cable merely need a USB-C hub to work as expected.\n\nBut plugging in an external drive to a phone is far more tedious than plugging one into a desktop or laptop. You can largely use the latter as normal while files transfer, at least until you need to move the laptop. It’s far more awkward to use a phone while it’s tethered to a drive that, in some cases, may even be bigger than it is.\n\nBy contrast, a flash drive merely sticks out the bottom. Files can transfer while I’m writing, scrolling through an ebook, or doing whatever else.\n\nThe beauty of a flash drive is that it is a self-contained unit. I like them for a similar reason I like doing my work from a foldable phone—I don’t need to double-check that I’ve brought along something else in order to get my work done. This is because a flash drive doesn’t need a separate USB-C cable the way external SSDs and hard drives do.\n\nThis isn’t even a matter of making sure I have everything I need when I leave the house. Even when just reaching into a drawer next to me, I prefer to grab a USB drive and plug it in rather than having to first reach for an SSD, then reach again for a cable, put my phone down, and use both hands to make sure everything is plugged in.\n\nI can keep things simple by leaving the USB cable plugged into the SSD, but I’ve broken the USB port on an external hard drive that way before, and let me tell you, that’s a frustrating way to lose access to your data.\n\nFlash drives have a few weaknesses compared to other forms of external storage. One of those is transfer speeds. Most external SSDs will read and write files much faster than most flash drives.\n\nNewer flash drives are hitting store shelves with speeds possibly exceeding those of the external SSD you might have bought just last year. The PNY Duo Link V3 boasts read speeds of 1,000MB/s and write speeds of 800MB/s. That’s a huge leap from the speeds on the SanDisk Luxe drives I’m currently using. That’s even a step up from the Samsung and SanDisk SSDs I bought a few years back.\n\nFlash Drives Are Becoming More Reliable\n\nFlash drives have not been recommended for backups in part because they lack the long-term reliability of external hard drives. I understand this intellectually, but it hasn’t matched my experience in practice. I’ve had multiple portable hard drives stop working over some form of mechanical failure. I imagine the disks still have the data inside and could be taken to someone who knows how to salvage them, but as for simply plugging the drive into my computer and getting them to work—they didn’t.\n\nMeanwhile, my flash drives have continued to truck along for years and years. They have few moving parts, so they're less prone to damage from drops. There are also tools now for checking for corrupted data.\n\nThe size of external storage tends to creep up over time, and that’s not a bad thing. I’m glad we no longer max out at 128GB. But it remains the case that if you can get by with a smaller drive, that’s a cheaper option than buying a larger one. I personally have yet to need more than 512GB of storage.\n\nAt a time when 512GB external SSDs are being phased out, 512GB flash drives aren’t hard to find. Plus, they can be had for nearly half the price of 1TB SSDs, even if I opt for a blazing-fast versions from PNY or SanDisk. That makes it more affordable to buy multiple sticks, ensuring that I have more than one copy of my data in different places.\n\nOver the past two years, I’ve significantly reduced the physical size of my digital life. Now that my phone is my PC, I can arrive somewhere with nothing in my hand and no bag on my back, yet I have everything I need to get to work. With a flash drive in my pocket or on a keychain, I have everything I need for backups as well.\n\nThat said, if you're considering carrying around sensitive data, it's worth refreshing up on how to encrypt your USB drive.",
  "medium": "Article",
  "links": [
    "http://pny.com",
    "https://www.howtogeek.com/samsung-galaxy-z-fold-6-review/",
    "https://shop.sandisk.com/products/usb-flash-drives/sandisk-extreme-pro-dual-drive-usb",
    "https://www.howtogeek.com/a-usb-c-hub-is-one-of-the-best-cheap-upgrades-for-your-phone/",
    "https://www.microcenter.com/product/692409/sandisk-512gb-extreme-pro-dual-dr",
    "https://www.howtogeek.com/what-is-a-pc-i-thought-i-knew/",
    "https://www.howtogeek.com/encrypt-usb-flash-drive-windows/",
    "https://www.bhphotovideo.com/c/product/1902347-REG/pny_p_fdi256dulnk3tyc_ge_256gb_duo_link_v3.html/BI/22163/KBID/28708/SID/UUhtgUeUpU2016181",
    "https://www.howtogeek.com/vertical-scrolling-makes-ebooks-as-addictive-as-social-media/",
    "https://www.pny.com/PNY-DUO-Link-V3-USB-3-2-Gen-2-Type-C-OTG?sku=P-FDI256DULNK3TYC-GE",
    "https://www.amazon.com/PNY-External-Compatible-Smartphone-Desktops/dp/B0FC3GCM8D?th=1&tag=hotoge-20&ascsubtag=UUhtgUeUpU2016181&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Freasons-ive-started-using-flash-drives-over-ssds%2F&asc_campaign=Feed",
    "https://amazon.com/dp/B0DSG3FWJB?tag=hotoge-20&ascsubtag=UUhtgUeUpU2016181&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Freasons-ive-started-using-flash-drives-over-ssds%2F&asc_campaign=Feed"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "external hard drives",
      "weight": 0.1228008
    },
    {
      "name": "Flash Drives",
      "weight": 0.1200373
    },
    {
      "name": "Flash drives",
      "weight": 0.1200373
    },
    {
      "name": "flash drives",
      "weight": 0.1200373
    },
    {
      "name": "most flash drives",
      "weight": 0.112675026
    },
    {
      "name": "hard drives",
      "weight": 0.112351716
    },
    {
      "name": "Newer flash drives",
      "weight": 0.11197782
    },
    {
      "name": "Drives",
      "weight": 0.10640823
    },
    {
      "name": "multiple portable hard drives",
      "weight": 0.10150846
    },
    {
      "name": "external SSDs",
      "weight": 0.099375114
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.55517578125
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.419677734375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.306396484375
    }
  ],
  "sentiment": {
    "positive": 0.07833288,
    "negative": 0.57486284,
    "neutral": 0.34680423
  },
  "summary": "The article discusses five reasons why I've started using flash drives over external storage systems, including the ease of plugging in an external hard drive to a mobile phone and transferring files. Flash drives are portable units that can transfer files while on the go. They are self-contained units, which are easier to use from a foldable phone than external SSDs or hard drives. The article also notes that flash drives are becoming more reliable due to their lack of long-term reliability and transfer speeds. The author notes that newer flash drives with speeds exceeding those of the previous year are now reaching store shelves with speeds reaching 1,000MB/s and write speeds of 800 MB/s, a significant leap from the speeds on the SanDisk Luxe and Samsung and SanDisk SSDs purchased a few years ago. Despite the growing popularity of external storage, the author acknowledges that it's not always a good idea to have more data in the digital life, as storage size increases over time.",
  "shortSummary": "Flash drives are becoming more reliable and portable, offering better storage options for backups due to convenience, convenience, and increased transfer speeds, despite long-term reliability concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "15030974a54c4052b658d29ff33e6bc9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.pny.com/PNY-DUO-Link-V3-USB-3-2-Gen-2-Type-C-OTG?sku=P-FDI256DULNK3TYC-GE",
      "text": "$36.99\nPNY DUO LINK™ V3 Type-C® OTG USB 3.2 Gen 2 Flash Drive is the ultimate on-the-go storage solution for advanced tech users. Enjoy extreme performance up to 1000MB/s read and up to 800MB/s write. Dual Type-A & Type-C connectors maximize compatibility to seamlessly manage files across host devices on up to 2TBs of storage space. With a premium metal swivel design for durability & portability.¹,²,³,⁴\n¹For Flash Media Devices, 1 megabyte = 1 million bytes; 1 gigabyte = 1 billion bytes. Actual useable capacity may be less than total listed (some capacity is used for formatting and other functions, and thus is not available for data storage).²Noted speeds require USB 3.2 Gen 2 devices (speeds may be lower with earlier generation host devices). Performance and photo/video support (eg, \"full HD\") may vary depending on the host devices, user’s settings and configurations.³Mobile device with OTG (On-The-Go) support required.4For full details visit www.pny.com\nAchieve extreme performance with speeds up to 1000MB/s read & up to 800MB/s write2\nConveniently keep large data files at your fingertips with extensive storage capacities up to 2TB1\nEasily store & transfer sophisticated data across devices with the versatile dual Type-A & Type-C® connectors - ideal for on-the-go advanced tech users3\nSeamless digital file transfers from Type-C mobile devices such as smartphones and tablets to full size devices such as laptop and desktop computers3\nSleek metal swivel design made of premium components for ultimate durability & portability with 2 year limited warranty4\nRead speeds of up to 1000MB/s²; Write speeds of up to 800MB/s2\nCompatible with a variety of Type-C enabled mobile devices and Type-A enabled host devices3\nUp to 265x faster than standard USB 2.0 Flash Drives2\nUSB 3.2 Gen 2 technology to quickly & easily Store, Share and Transfer content. Backwards compatible with USB 3.2 Gen 1/USB 3.0 and USB 2.0³\nFree up space on Type-C equipped mobile devices by transferring content to DUO LINK V33\nAccess and stream digital content anytime, anywhere\nDownload and store photos, videos, music, and more directly to DUO LINK V3 for permanent storage\nPNY’s DUO LINK™ V3 Type-C® OTG USB 3.2 Gen 2 Flash Drives provide the ultimate mobile storage solution with blazing fast performance and maximum compatibility. Engineered with the latest USB 3.2 Gen 2 technology to achieve extreme speeds up to 1000MB/s read and up to 800MB/s write, an astounding 265x faster than standard USB 2.0 flash drives.2\nDUO LINK V3 maximizes compatibility via dual USB-C and USB-A connectors, facilitating data storage across leading edge and trail edge host devices.3\nTake file management to the next level and seamlessly store & transfer files from Type-C mobile devices like smartphones & tablets to full size Type-A host devices such as laptops & desktops. Experience compatibility across USB 3.2 Gen 2 enabled host devices, and backwards compatibility with USB 3.2 Gen 1/USB 3.0 and USB 2.0 devices.2,3\nIdeal for advanced tech users on-the-go, DUO Link V3 Type-C OTG offers convenience without compromise. Keep extensive digital media files at your fingertips with immense storage capacities up to 2TB.1\nExpertly crafted with premium metal components and a sleek metal swivel design for ultimate durability & portability.\nHave a question?Call a Specialist or chat online.Call 1-800-234-4597.\nResources & DownloadsProduct Support & FAQs\nGo to cart/checkout Continue Shopping"
    },
    {
      "url": "https://www.howtogeek.com/encrypt-usb-flash-drive-windows/",
      "text": "Quick Links\nSummary\n- Windows 10 and 11 Pro users can easily encrypt and decrypt flash drives using the built-in BitLocker feature, providing a convenient way to protect sensitive information.\n- BitLocker uses powerful encryption technology (AES-128) that is virtually impossible to crack, ensuring the security of your data.\n- While BitLocker is suitable for protecting sensitive information on portable computers, there are third-party encryption options available for Windows Home users.\nFlash drives are convenient, but they're also easy to lose and often contain sensitive information you don't want in the wrong hands. Luckily, Windows 10 and 11 Pro users can easily encrypt and decrypt flash drives with no additional software.\nWhat Is BitLocker (And Why Use It)?\nBitLocker is a powerful encryption feature in Windows 10 and 11 Pro that protects the data on your drives so that no one can read their contents without the encryption key. The default level of encryption is AES-128, which would take millions or even billions of years to crack using current supercomputers.\nTo use BitLocker, in addition to having the right version of Windows, your computer must be equipped with a TPM (Trusted Platform Module) of at least version 1.2. If your computer doesn't have one, you'll need to create a startup USB key. However, this is only relevant to internal system drives, and here we're discussing removable media. Likewise, encrypting the drive that contains Windows has special requirements regarding how the drive must be partitioned, but these requirements don't apply to secondary internal drives or removable, non-bootable drives.\nFull disk encryption isn't something everyone needs to do, but if your computer has sensitive information on it that could harm you if the drive were stolen, BitLocker is a good way to protect yourself. It's particularly useful for portable computers, since these have a much higher chance of being lost or stolen than a desktop system.\nHow to Encrypt a USB Flash Drive in Windows 10 or 11\nIf you've decided that BitLocker is the right solution for your removable drive, here's how to set it up:\n1. Plug in your USB drive.\n2. Open File Explorer. You can use Windows+E to do this quickly.\n3. Right-click on the flash drive in Explorer and select \"Turn on BitLocker\". In Windows 11, you'll have to click on \"Show more details\" first.\n4. Wait for BitLocker to initialize the drive.\n5. Choose a password.\n6. Choose where and how to save your recovery key, which will let you decrypt the drive if you forget your password.\n7. Choose whether to encrypt the whole drive or only used space. If the drive is empty and formatted, choose \"Used Space\"; otherwise, choose \"Entire Drive.\"\n8. Choose the encryption type, which in almost all cases should be \"Compatibility Mode.\" This ensures that older versions of Windows can read the drive. Since we're encrypting a portable drive, this is presumably something you want. However, if you're only going to use this drive with one computer, feel free to select the newer encryption option instead.\n9. Click \"Start Encrypting\" and wait for the process to finish.\nIf the process was successful, your drive is now protected by strong encryption and can only be accessed using its password.\nHow to Decrypt a USB Flash Drive in Windows 10 or 11\nSo what if you don't want to have an encrypted flash drive anymore? One option is simply to format the drive, which will get rid of the encryption, but also all the data on the drive! If you don't need the data anymore, this is the fastest and easiest way to get the drive back to its factory condition.\nIf you still need the data, you should simply copy it to another drive that's not encrypted before formatting the encrypted drive. This is just a fast workaround, however. The proper way to decrypt the drive and preserve all the data on it is as follows:\nRight-click on the drive in File Explorer and select \"Manage BitLocker.\" On Windows 11, you'll have to click \"Show more options\" first.\nIn the BitLocker management Windows, choose \"Turn off BitLocker\" for the drive in question.\nThen simply confirm as you did when first encrypting the drive.\nThird-Party Encryption Options\nAs mentioned earlier, BitLocker isn't included in Home versions of Windows. That doesn't mean you have to be left in the lurch when it comes to keeping your data safe.\nIf you're using a Home version of Windows, third-party apps like VeraCrypt (a free, open-source tool known for its robust security features) and AxCrypt (a user-friendly app with a subscription model) are great alternatives.\nVeraCrypt is best for those who need high-level security without cost concerns, while AxCrypt offers a balance of ease of use and security for a modest fee.\nSecuring your data, especially on portable media that's easily lost or stolen, is more important than ever. If you must carry sensitive information on-the-go, BitLocker is an excellent and easy solution."
    },
    {
      "url": "https://www.howtogeek.com/a-usb-c-hub-is-one-of-the-best-cheap-upgrades-for-your-phone/",
      "text": "Quick Links\nOur phones were once limited by their power, but they now pack all the power of a larger PC. What they lack, more than ever, are ports. But that’s a problem a USB-C hub can solve, and it’s one of the simplest ways to upgrade your phone.\nUSB-C hubs come in various forms. Most are wired dongles that plug into a USB-C port. Some phone-specific models hold your phone upright and are geared toward desktop modes like Samsung DeX. No matter which variety you select, they're all good for the tasks on this list.\nThe Best USB-C Hubs of 2025\nNeed more ports for your laptop, PC, or gaming rig? Check out these USB-C hubs.\n8 Plug in a Higher Quality Mic\nAudio recordings are one area where many of us turn to our phones. They’re on us wherever we are, and a voice recorder app is often more accessible than desktop software.\nThe built-in mic on your phone is better than those on laptops and tablets, but if you want professional audio for a podcast or other types of media, you can plug in a higher-quality USB mic regardless of whether it runs off USB-C or USB-A.\n6 Excellent USB Microphones Small Enough to Toss in Your Laptop Bag\nNeed a better mic? All of these are easy to use and will stay out of your way.\n7 Import Camera Photos\nSmartphone cameras have come a long way, and I have taken many photos for this site directly from my Galaxy Z Fold 6. But there’s still a difference between those and the photos I take with my Panasonic Lumix G7. The shots I’m able to get out of that Micro Four-Thirds sensor and f/1.7 aperture are still difficult to replicate from a phone.\nFortunately, I can pop the full-size SD card out of my camera and slide it into my USB-C hub. I then upload those images just as easily as I would from a PC.\n6 Connect to Large External Displays\nFor over a year now, I’ve done all of my computing from my phone. While these days I work directly on my phone’s large internal screen, initially I replicated the desktop experience using Samsung DeX combined with a large external monitor. To make that work, I needed a USB-C hub to connect the monitor's HDMI cable to my phone.\nThe fun doesn't stop with monitors. With a USB-C hub and a phone that supports DisplayPort Alt Mode, you can turn a phone into a streaming box for your TV.\n5 Manage Multiple External Drives\nIt still feels a bit novel to plug a USB stick into my phone to back up or transfer files. It feels even more novel to plug in an external SSD. Yet while either one of these can plug directly into my phone, if I want to transfer files from one external drive to another, that’s where a USB-C hub comes in to make up for the fact that, unlike most laptops, my phone only has one USB port to work with.\n4 Connect to Ethernet\nWith my phone serving as my only PC, I don’t have a laptop readily on hand when I need to troubleshoot issues with our home router. Admittedly, we now have mesh Wi-Fi where everything is managed through an app, but my previous router required connecting via Ethernet to make configuration changes during those circumstances when I was unable to connect to the Wi-Fi network. That’s where having the ability to plug an Ethernet cable into a USB-C hub is a godsend.\nThe Best Ethernet Cables of 2024\nDon't get stuck with an Ethernet cable that'll slow your internet down or wear out quickly. Our recommendations will make sure you get the best.\n3 Plug in a Wired Gamepad\nThere are absolutely no shortage of ways to connect a controller to your phone for games. It’s a booming enough market that Backbone has released a $170 pro version of its popular telescopic controller. But if you rather spend under $30, you can enjoy games just fine with a wired Bluetooth gamepad instead. As much as I love my wireless 8BitDo Pro 2 controllers, the wired version is available for almost half the price.\n2 Type With a Mechanical Keyboard\nWhile most of us don’t think of phones when we think of writers, both the Play Store and the Apple App Store are packed with writing apps. I’m typing these words in one right now—PenCake, a distraction-free app whose interface helps me feel more relaxed while I work.\nI personally do the bulk of my writing using a stylus and fallback to a virtual keyboard, but I occasionally have mechanical keyboard envy. In my line of work, I’ve had numerous colleagues who swear by theirs. The only mechanical keyboard I briefly owned was wired, and while I didn’t allow myself to use the keyboard long enough to grow attached, it was only thanks to a USB-C hub that I was able to use it at all.\nThe Best Mechanical Keyboards of 2024\nMechanical keyboards are incredibly popular, and these six are at the top of their class.\n1 Use USB Devices While Charging\nGetting the dreaded low battery pop-up can put an end to any of these tasks. With only a single USB port, I can’t easily charge while transferring files or gaming with a wired controller. Not without a USB-C hub.\nMany USB-C hubs can now accept up to 100W of power and pass that through to my phone, eliminating the concern of my phone dying before a massive file transfer is complete.\nA USB-C hub is one of those relatively few tech investments that stands the test of time, remaining useful for years because no one has artificially limited its life through a lack of software updates. It just works. Whether it's with your phone, a laptop, a mini PC, or a Raspberry Pi—you never know when it will be handy to have a USB-C hub lying around.\nBaseus Metal Gleam Series II 10-in-1 USB Hub\nThe Baseus 10-in-1 USB Hub is a compact but powerful laptop dock that's not only portable but also offers a ton of useful ports.\nThis Blazing Fast 8-Port USB-C Hub Is Well-Built, But It's Got Quirks\nNot quite a flex, but not bad."
    },
    {
      "url": "https://www.howtogeek.com/samsung-galaxy-z-fold-6-review/",
      "text": "Summary\n- Refined screen sizes, decreased weight, and polished software make the Samsung Galaxy Z Fold 6 a solid choice.\n- Despite some downsides, like app optimization and no Qi2 magnetic charging, the Galaxy Z Fold 6 is still worth the hefty $1900 price tag.\n- Samsung's improvements in hardware design and software AI features make the Galaxy Z Fold 6 a compelling foldable phone option.\nIn the U.S., Samsung has led the foldable market. Now that competition is increasing, the company is under pressure to innovate. Unfortunately, the Galaxy Z Fold 6 isn't groundbreaking, but with this year's improvements, I have no problem recommending this phone.\nSamsung Galaxy Z Fold 6\n- SoC\n- Qualcomm Snapdragon Gen 3 for Galaxy\n- Display\n- 7.6-inch AMOLED inside display, 6.3-inch AMOLED cover display, both with 120Hz dynamic refresh rate\n- RAM\n- 12GB\n- Storage\n- 256GB, 512GB, 1TB\nThe Samsung Galaxy Z Fold 6 is a foldable smartphone that combines the functionality of a tablet with the convenience of a phone. It features a large, flexible internal screen that automatically picks up where you left off on the cover display.\n- Refined and improved screen sizes\n- Decreased weight\n- Polished software experience\n- Not all apps (but most) are optimized for the internal display\n- No Qi2 charging\n- Almost twice the cost of a traditional Android smartphone\nPrice and Availability\nThe Galaxy Z Fold 6 costs $100 more than 2023's Fold 5, retailing for $1,899.99 with 256GB of built-in storage. The 512GB and 1TB models cost $2,019.00 and $2,259.99, respectively. All three spec tiers have 12GB of RAM and the Qualcomm Snapdragon Gen 3 for Galaxy.\nThe foldable can be purchased from almost every carrier and third-party retailer and is available in Pink, Navy, and Silver Shadow (the color I tested). If you buy directly from Samsung, you can also choose from Crafted Black (with a textured back) and White.\nSpecifications\n- SoC\n- Qualcomm Snapdragon Gen 3 for Galaxy\n- Display\n- 7.6-inch AMOLED inside display, 6.3-inch AMOLED cover display, both with 120Hz dynamic refresh rate\n- RAM\n- 12GB\n- Storage\n- 256GB, 512GB, 1TB\n- Battery\n- 4,400 mAh\n- Ports\n- USB-C\n- Operating System\n- Android 14 / One UI 6.1.1\n- Front camera\n- 10MP cover camera, 4MP under-display main screen camera\n- Rear camera\n- 10MP 3x optical zoom, f/2.4, 12MP ultra-wide, f/2.2, 50MP main camera with autofocus, f/1.8\n- Connectivity\n- 5G, 4G LTE, 802.11 a/b/g/n/ac/ax 2.4GHz+5GHz+6GHz Wi-Fi, Bluetooth 5.3, NFC, UWB\n- Dimensions\n- 68.1 x 153.5 x 12.1mm (folded); 132.6 x 153.5 x 5.6mm (unfolded)\n- Colors\n- Navy, Silver Shadow, Pink, Crafted Black, White\n- Weight\n- 239g\n- Charge speed\n- 25W wired, 15W wireless, Wireless PowerShare\n- IP Rating\n- IP48\n- Stylus\n- S Pen for Galaxy\nHardware Improvements You'll Feel\nEven if you stared at the Z Fold 6 and the Fold 5, I highly doubt you could figure out which phone is which. Samsung nailed down its design last year, finally making it so that the handset folded flat. But the moment you pick up the Fold 6, you'll feel a difference.\nThe most noticeable difference out of the box is the weight. The Fold 6 comes in at 239g, which shaves off 14g compared to last year's model. That's only 7g heavier than the Galaxy S24 Ultra. We're finally at a point where Samsung's largest foldable doesn't feel like a brick or two phones taped together in your pocket.\nHowever, slightly adjusted dimensions and screen sizes are the most welcome changes. When folded, the phone is 1mm wider and 1.3mm thinner than the Fold 5. That doesn't sound like much, but it makes the Z Fold 6's cover display feel that much closer to a \"traditional\" smartphone. I found myself using it much more than with previous generations, only unfolding the device when I wanted to multitask or use a tablet-sized screen.\nThose changes also affect the inside display. When unfolded, the Fold 6 is 1.4mm shorter, 2.7mm wider, and .5mm thinner than last year's handset. I have always preferred shorter and wider designs after using the Google Pixel Fold and OnePlus Open. It's easier to use the cover display, reach the top of the screen, and offer a better widescreen experience. I'm happy to see Samsung move in this direction.\nThe cherry on top is the frame's flat edge, found all the way around the phone. It makes the Fold 6 feel slimmer and more premium. Plus, the edges and back glass are matte, which is always preferred over polished metal. The corners are a bit sharper, which means it's not quite as comfortable to hold, but I forgot about this a day into using the foldable.\nI've gotten pretty accustomed to large camera bumps, but they cause an annoyance on the Fold 6 that I didn't completely notice until I read a piece by my colleague Will Sattelberg on Android Police. As he points out, having the three cameras lined up in the top-left corner of the device causes the phone to be extremely wobbly when placed on a table. It's so unstable that it's uncomfortable to interact with the foldable. I almost always pick up the device when checking notifications.\nAlso, the Z Fold 6 is still incredibly slippery despite the matte back glass. I once had it slide off my bedside table. I don't know if the camera bumps worsened the situation, but I'd feel better if the device wasn't lying awkwardly every time I sat it down.\nThe AMOLED displays themselves are as great as ever. They both have a variable 120Hz refresh rate and a 2600nits peak brightness, making all content look good whether you're inside or outside.\nThe same goes for battery life. The Z Fold 6 retains the 4,400mAh battery found in the Fold 5, but Samsung claims several extra hours of juice while watching videos or listening to audio. In my real-world testing, it was difficult to nail down an average screen-on battery life because they varied greatly depending on whether I used the cover or the inside screen for most of the day.\nI could always make it through to the end of the day, but some nights, I ended with under 15% left. That normally equated to five and a half to six and a half hours of screen-on time.\nOne UI Is Perfected for Foldable (and AI)\nSamsung, which adds its own touch and flair to Android, offers the Fold 6 a good mix of easy-to-use multitasking features while retaining heavier customization features in the Settings menu for those who like to tinker.\nLike desktop operating systems, the Z Fold 6 has a taskbar that hosts shortcuts to your most important apps and the app drawer. Once you have an app open, you can use the taskbar to drag and drop a second (or a third or a fourth) app in another section of the internal screen. Then, you can tap on the indicators between or above each app to adjust sizing, swap out apps, and more.\nThe experience is incredibly intuitive after playing with the phone for several hours. Having both my password manager and two-factor authentication apps open alongside others while setting up the phone is incredibly powerful.\nThankfully, roughly 95% of my apps scaled properly during my time with the foldable, whether I was using the more narrow cover display or the wide, tablet-sized inside screen.\nFor those that don't play nice, you can go into the Z Fold 6's Settings menu and set the aspect ratio specifically for that app. So, instead of launching in full screen, you can choose between 16:9 and 4:3. It's not a perfect solution, but it's a good stop-gap until developers update their apps.\nSamsung went all-in on \"Galaxy AI\" in January 2024 with the launch of the S24 Series. This included the launch of Circle to Search with Google, Interpreter mode, and more. Those same features, plus some extras, made their way to the Fold 6.\nTwo of the flagship AI features are Drawing Assist and Photo Assist. The first provides you with a blank canvas to sketch on. From there, you can choose an art style and generate several versions of your drawing. This feature doesn't take too many creative licenses and mostly sticks to the shape you drew.\nPhoto Assist takes a different approach. Found in the Gallery app, you take any photo and draw what you'd like added to the scene, such as a tree, bird, dog, or butterfly. Tap the Generate button and wait a hot second. Before you know it, the Z Fold 6 offers you several options to choose from. I've included a selection of samples above.\nWhile I'm still in awe that Samsung was able to understand my truly awful drawings and correctly insert the object or animal I drew, none of these look exactly natural. Others, like The Verge, have had better results. Allison Johnson drew a bee next to an out-of-focus flower, and her Z Fold 6 inserted an equally out-of-focus bee. It looks surprisingly realistic, and I would have never guessed it was AI-generated.\nSpeaking of which, Samsung automatically adds an \"AI-generated content\" watermark to the bottom-left corner of every one of these images. The issue is that this watermark is almost transparent and can easily be cropped out of the frame. While I don't think anyone will be fooled by my images, it won't be long before this tech is perfected.\nAs both of these new AI features require you to draw, they would benefit from an S Pen. Thankfully, the inside screen supports Samsung's stylus, but one does not come with the $1,900 phone like it does with the S24 Ultra. Instead, you'll have to purchase a $130 case or the S Pen by itself. While I understand the choice not to include a built-in slot for space-saving and battery-related reasons, throwing one in the box would have helped promote the new AI features.\nStop Advertising on $2,000 Phones\nSamsung has been known to push notifications to advertise upcoming announcements. I'm sad to report that it's still happening on the Fold 6. More than once, I felt the phone buzz, only to find an ad prompting me to pre-order the Z Flip 6 or Z Fold 6. Beyond the irony that this message was being sent to a Fold 6, it was common for this notification to be pushed twice in the span of a couple of minutes.\nIt shouldn't need to be said, but Samsung has to stop dropping advertisements on its customers. I can forgive the company if it places a banner ad in its apps, but to push a notification multiple times is ridiculous.\nThe Cameras Have Gone Mostly Untouched\nThe Samsung Galaxy Z Fold 6 has five cameras: a 10MP selfie camera on the cover display, a new 12MP ultra-wide, 50MP wide, 10MP 3x telephoto, and a 4MP under-display camera (more on that below).\nI've included image samples taken outside on a sunny day, inside a store, using Portrait mode with 2x zoom, night shots, and several selfies. Overall, the photos all came out pretty sharp, with plenty of contrast. I don't think they're equal to what you can capture using Samsung's flagship smartphone (or even Google's Pixel 8a), but they're more than adequate.\nThe main difference between the new 12MP ultrawide and last year's is that it is better optimized for shooting in low light. Beyond that, the image quality is basically on par with what you might have experienced with the Fold 5.\nIn basically every instance, I preferred the look of selfies captured using the rear-facing cameras. They're more natural-looking, the color is more accurate, and the scene doesn't look as compressed.\nSamsung makes it pretty easy for you to swap between cameras, but there's a taking-photos-with-a-13in-iPad-type of awkwardness with an unfolded handset. Plus, you have to grip the more fragile inside screen, which is a bit nerve-wracking.\nIt's Time to Drop the Under-Display Camera\nThe promise of under-display cameras was that you would maintain a selfie camera while not losing screen real estate. Unfortunately, despite Samsung using this tech for multiple years, the image quality is still terrible.\nAs you can see from the first two photos above, pixels cover about half of the camera when you're interacting with the phone. But when you launch the camera, they disappear. When you take a selfie, Samsung processes the image and tries to fill in missing details. Despite this work, you still have a soft and out-of-focus-looking photo.\nIt's 2024. At this point, most consumers are used to and fine with hole punches, notches, and Dynamic Islands. I never found myself actually needing to use the inside display's selfie camera, but if I had, I would have tried to find a way to use any of the foldable's other sensors. The under-display camera is potato quality and should be replaced or removed completely.\nThe Galaxy Z Flip 6 Is Also Worth Considering\nThe Z Flip 6 will launch alongside the Z Fold 6. Despite it also including a foldable display with ultra-thin glass, it targets a different audience. Instead of someone who wants a large, 2-in-1 device, the Flip 6 is all about minimalism and convenience. It's a small and pocketable package with a cover display for quickly checking notifications and a standard phone-sized internal screen for everything else.\nUnlike the Fold, the Flip has fewer noticeable improvements but's also slightly thinner and lighter. The most notable year-over-year change is the improved camera sensors. It gained the 50MP sensor found on the Galaxy S24 series, allowing you to capture sharper images. Camera quality has always been poor on the Flip series, so this is a welcome change.\nHow-To Geek will have a review of the Z Flip 6 published shortly, but in the meantime, you can read my thoughts after a brief hands-on.\nShould You Buy the Samsung Galaxy Z Fold 6?\nI've really enjoyed testing the Galaxy Z Fold 6 over the past week and a half. Its ability to function as both a phone and a tablet has been great. I can comfortably use the cover display as a regular phone and then easily multitask with two to four apps at once on the inside screen, something I can't do with my primary smartphone (an iPhone). The foldable finally feels like a finished product that shouldn't be reserved for early adopters.\nIf you have a Z Fold 5 or the OnePlus Open, there is basically no reason to rush out and spend $1,900 on the Galaxy Z Fold 6. The improved dimensions, more rugged hinge, and IP48 rating aren't worth replacing last year's handsets. But if you're considering a foldable phone for the first time, the Z Fold 6 is a fantastic starting point.\nHowever, you have to consider that Google will launch the Pixel 9 Pro Fold in less than a month. Last year's model was far from a success, with a hinge that didn't unfold flat, but I have high hopes for the second generation. If camera performance is a high priority for you, I'd consider holding off until we see what comes out of the Googleplex.\nSamsung Galaxy Z Fold 6\n- SoC\n- Qualcomm Snapdragon Gen 3 for Galaxy\n- Display\n- 7.6-inch AMOLED inside display, 6.3-inch AMOLED cover display, both with 120Hz dynamic refresh rate\n- RAM\n- 12GB\n- Storage\n- 256GB, 512GB, 1TB\nThe Samsung Galaxy Z Fold 6 is a foldable smartphone that combines the functionality of a tablet with the convenience of a phone. It features a large, flexible internal screen that automatically picks up where you left off on the cover display."
    },
    {
      "url": "https://www.howtogeek.com/what-is-a-pc-i-thought-i-knew/",
      "text": "Quick Links\nWhat defines a PC has changed substantially over the course of my life. They've drastically changed shape and size, but until I bought my most recent one, they were all at least vaguely similar. Now my concept of a PC has been completely turned on its head.\nPCs Can Be Laptops\nThe first computer I owned was a second-hand Dell laptop with a dead battery and a dial-up modem. We placed it on a desk, and for all intents and purposes, it was an underpowered desktop that I had the luxury of plugging in on the floor if I wanted to lay down.\nThis laptop ran Windows XP. It had 128MB of RAM and 8MB of video memory. I don't remember the size of the hard drive, but it was not a number measured in the hundreds. The limits were such that I could run StarCraft, but WarCraft 3 would only run on extremely low settings, and my hard drive didn't have much space for anything else.\nI don't have any photos from that time, but there is a corner of YouTube where you can relive the long boot times and garish taskbar on a similar machine.\nYes, I'm aware there are legions who love Windows XP. I never did, even when it was the only operating system I knew.\nPCs Can Also Be Desktops\nShocker, I know, but I didn't own PCs in the order they were invented. I don't remember the sequence in which the next two computers entered my life. One was an old iMac my dad was able to bring home from school. It ran an old version of Mac OS, and I was never able to connect it to the internet. This was the only time in my life I ever owned a Mac, and there was little I could actually do with it. Already, computers weren't much use without being able to get online.\nMy other desktop was my first computer that didn't come with strict power limitations. It was an Intel Pentium Dell desktop with a large CRT monitor. You can still find machines like it floating around eBay.\nThis Dell machine had 512MB of RAM, and while I don't remember the video memory, it was enough to play Resident Evil 4. Considering that was one of the hottest games on home consoles like my PlayStation 2 at the time, I was blown away. Running StarCraft and WarCraft were no issue at all. I could now run larger office suites like OpenOffice.org rather than lighter apps like AbiWord.\nThis computer still ran Windows XP, so ultimately my concept of a computer remained unchanged. This was the same fundamental experience, just better.\nBut Laptops Can Be Just As Good\nWhen I went to college, the school provided me with a Dell Latitude D630 laptop, which came with an NVIDIA graphics card. It wasn't a gaming card, but it was powerful enough to play Xbox 360-quality games on medium settings (which was the current console generation at the time).\nThis time I had a laptop with a working battery, and I was on a college campus with actual broadband. Plus, it was wireless! Not only was I no longer tethered to a wall, but I wasn't tethered to just those sites that could run on a few kilobytes a second. I could finally stream video from YouTube! I could try out Steam and download games myself, rather than rely on install discs! This was huge for someone like me who grew up in the sticks.\nI could also finally download and install Ubuntu Linux, which I had initially come across in high school.\nUbuntu Was My First Distro—Here's Why We Went Our Separate Ways\nWe just don't see eye to eye anymore.\nI never went back to a desktop. As an adult, I've found the portability of laptops too vital to give up. If anything, I wanted my PC to be even more portable.\nCan a Tablet Be a PC?\nOnce tablets hit store shelves, I immediately took a liking to the idea of replacing my laptop with one. It was just a matter of waiting for an option with the right combination of hardware and software. I saw this in the Toshiba Thrive, a 10-inch tablet running Android 3.0 Honeycomb, which was designed exclusively for tablets.\nThis tablet had a full-sized USB port for flash drives, allowing me to easily transfer files and use printers that I couldn't connect to wirelessly. I bought a Bluetooth keyboard and actually used this tablet during my college classes to take notes and write papers, despite how immature the software was in retrospect. Android has genuinely benefited from having another decade and a half in the oven to bake since then.\nI've owned various Android tablets since, ranging from the Nexus 7 to the Boox Tab Ultra C. Yet after a max of a few months, I consistently returned back to a laptop. A tablet could be a PC, but I wasn't having much luck pulling it off long-term.\nMy Favorite PC Is a Foldable Phone\nWhen I bought the Galaxy Z Fold 5, I was getting it to use Samsung DeX. I had been using a Moto Edge+ 2023 connected to a lapdock for a few months, and I knew I liked the concept. I just needed more mature software.\nThe Galaxy Z Fold 5 offered that and more. The interior screen is large enough to do everything I previously needed a laptop for. Samsung's apps are more capable than Google's and, for that matter, many of my favorite desktop Linux apps. The phone's interface allows me to manage apps in windows like other PCs. The stylus has become my primary way of using the device, enabling me to write by hand and supplanting my need for a keyboard.\nAll of this is on addition to the ability to connect my Z Fold 6 to a monitor, pair a keyboard and mouse, and have the traditional PC experience.\nA Galaxy Z Fold is a genuine 3-in-1 device that has locked me into Android, because no other device like this is available in the US. It's a phone, tablet, and desktop in one. Frankly, it's so much more. It's my preferred eReader. It's a game console. It's a camera and music player. Ultimately, it's more of a pocket computer than smartphones already are, and it has rewired my brain to think of mobile devices this way.\nIf I can write, do everything I need to do in a browser, edit images, and manage all of my files—if I haven't had to reach for a laptop in months—why not genuinely embrace this as the only computer I need?\nI've used an Android phone as my primary computer for over a year and a half now. At least a year of that has specifically been with a Galaxy Z Fold, though I transitioned to the Galaxy Z Fold 6 along the way. Due to the sheer number of devices I've been able to sell or no longer need to upgrade, this mind shift has saved me money, and it continues to reshape how I inhabit the world.\nWhen your entire working life is spent in front of a PC, it matters quite a bit what shape that PC takes. When I'm done for the day, rather than put my computer to sleep, I now fold it up and slide it into my pocket. My office is anywhere I want it to be."
    },
    {
      "url": "http://pny.com",
      "text": "with PNY GeForce RTX™ 50 Series at MSRP\nA Grace Blackwell AI Supercomputer on Your Desk\nNVIDIA RTX PRO™ - Built for Professionals\nCelebrate Gaming and Gaming Culture with PNY at PAX West 2025\nGet Borderlands 4 With Select GeForce RTX 50 Series.*\n*Terms and conditions apply.\nPNY delivers solutions in over 50 countries. Our professional, enterprise and OEM products are available from leading system builders, B2B providers, DMRs, e-tailers, resellers and distributors.\nPNY Consumer Solutions provides you with quality products that are reliable, affordable, and geared toward your needs.\nPNY Professional Solutions provides you with powerful tools to manage heavy workloads.\nOverclocking capabilities, high-frequency performance, low latency, brilliant LEDs and frosted light guide lens\nGamers demand the highest visual quality, and the AI-enhanced NVIDIA DLSS 4 technology.\nRealize faster boot times, quicker application launches and better overall system performance.\nUpgrade your PC Memory to see low latency and power consumption, and extreme overclocking.\nCapacity: Amazing 512GB of storageSize: Compact, small footprintPerformance: Up to 200MB/s transfer speed\nStore and share all of your documents, photos, videos, music, and more.\nCapture, store, and share digital content from your camera or mobile device quickly and easily.\nFree up space, download & store, and sync & share \"on-the-go\" by transferring your videos, photos, music and more from your mobile devices.\nDelivering incredible performance to professionals\nNVIDIA IGX ORIN™ is an industrial-grade edge AI platform that combines enterprise-level hardware, software, and support\nDesigned for incredible performance and power efficiency while meeting the highest quality and reliability standards.\nNVIDIA® Virtual GPUs (vGPUs) enable enterprises to access powerful GPU performance from the enterprise data center to support every workload, from virtual client computing to the most compute-intensive workloads.\nThe VAST Data Platform unifies storage, database, and containerized compute into a single, scalable software platform to power AI & deep learning in modern data centers & clouds.\nPNY's product portfolio delivers superior performance and quality, backed by outstanding support and service."
    },
    {
      "url": "https://www.howtogeek.com/vertical-scrolling-makes-ebooks-as-addictive-as-social-media/",
      "text": "Quick Links\nReading a book digitally is different from holding a paper copy in your hands, and that's a good thing. I can vertical scroll through books like I'm reading a webpage or feed, and I read more in the process.\nThe Web Has Taught Us to Read By Scrolling\nI learned how to read well before I ever touched a computer, but the web changed where I did most of my reading. Back then, the web was a place primarily read, not watched or listened to. Even today, unless your primary interaction is through video shorts and streaming platforms, the web is a place where we read each other's thoughts.\nThere is a PgUp and PgDn button our keyboards to make reading the web a paginated experience, but most of us never bother with those keys, and our smartphones lack them entirely. We read web by flipping or clicking through pages, but by scrolling.\nIs that perpetual upward movement of text a good thing for our eyes or our comprehension? Maybe not, but we're accustomed to it. If there's one thing about us humans, it's that we're adaptable, and the patterns we habituate ourselves to become easier than the ones that we don't.\nReading on Phones Makes Scrolling eBooks an Option\nPhysical, dedicated eReaders like the Kobo or Kindle attempt to replicate the physical book experience as best they can. Their screens look like paper, and you can turn pages by swiping across the screen. The page numbers may not exactly match the physical editions, but you still make your way through the book one page at a time.\nOn phones and tablets, we have more options. While most eReading software defaults to pagination, some apps let you scroll through the text of an ebook as though you were making your way through a series of webpages. I personally use Moon+ Reader on Android for the wealth of customization options it provides, and this is a big part of why my phone is my preferred way to read books.\nForget Kindle, Here's Why I Prefer to Read eBooks on My Phone\nMy eyes aren't burning, and I still sleep through the night.\nThat said, I don't have your typical phone. I do my reading on a Samsung Galaxy Z Fold 6. This book-style foldable has an internal screen that isn't that different in size from a paperback. It feels the perfect size to hold, yet part of the beauty of scrolling is it's just as viable on a conventional phone.\nSamsung Galaxy Z Fold 6\n- SoC\n- Qualcomm Snapdragon Gen 3 for Galaxy\n- Display\n- 7.6-inch AMOLED inside display, 6.3-inch AMOLED cover display, both with 120Hz dynamic refresh rate\nThe Samsung Galaxy Z Fold 6 is a foldable smartphone that combines the functionality of a tablet with the convenience of a phone. It features a large, flexible internal screen that automatically picks up where you left off on the cover display.\nScrolling Makes Me Want to Reach the End of Each Chapter\nWhen I pick up a physical book, I try to avoid flipping ahead to see how many pages I have left in the chapter I'm reading. Whatever the number, I usually find it discouraging. 20 pages left! 40!? This makes me more likely to find a stopping point and come back later.\nScrolling typically treats each chapter as one long page. Some apps may even give you the option to treat the entire book as one page, using a scrollbar on the side as your marker of progress. I currently go chapter by chapter, and I have the scrollbar turned off.\nI read until there's nothing left to scroll, pause to reflect on whether I want to keep reading, and then I start the next chapter. If I need to stop, I still find a place to stop, but it's due more out of circumstances than intimidation of the task that remains ahead of me.\nThese Are the Best Sites for DRM-Free eBooks and Comics\nIn case you want to actually own your digital books.\nScrolling Is Such an Easy, Mindless Gesture\nReading a physical book requires a certain posture. While you don't have to be sitting upright or at a desk, you do need to have access to both hands. You need to be laid back or propped up in a way to support turning the page. Phones are easier. All you need is a single hand and a working thumb.\nMost of us have developed this mindless, scrolling habit. We open an app, start scrolling, and lose all sense of time. It becomes something we do whenever we have a moment to ourselves. It's comforting, assuming what we're reading isn't active discomforting (which it often is).\nReading a book takes this habit and puts it to good use. I have Moon+ Reader as the first icon on my internal screen, and when I want to read something, I tap it and start scrolling. Scrolling is also the way I enjoy reading digital comics and magazines as well.\nIs scrolling perfect? Hardly. I can understand why anyone would choose to flip through the physical pages of their novels. Sometimes I, too, prefer to hold my book-shaped phone like a book, and there are periods when that's what works for me. What I love about eBooks is that they don't require you to approach them in only one way."
    },
    {
      "url": "https://shop.sandisk.com/products/usb-flash-drives/sandisk-extreme-pro-dual-drive-usb",
      "text": "Your portable, professional, performance essential.\nAmplify your data management with the SanDisk Extreme PRO Dual Drive, boasting read speeds up to 1,000MB/s2 and write speeds up to 900MB/s.2 Transition seamlessly between your USB-C™ and USB-A devices, and store tons of content with up to 2TB1 capacity. The SanDisk Extreme PRO Dual Drive is where rugged construction meets state-of-the-art data protection and convenience — for on-the-go professionals that need high performance and portability.\nYour portable, professional, performance essential.\nAmplify your data management with the SanDisk Extreme PRO Dual Drive, boasting read speeds up to 1,000MB/s2 and write speeds up to 900MB/s.2 Transition seamlessly between your USB-C™ and USB-A devices, and store tons of content with up to 2TB1 capacity. The SanDisk Extreme PRO Dual Drive is where rugged construction meets state-of-the-art data protection and convenience — for on-the-go professionals that need high performance and portability.\nYour portable, professional, performance essential.\nAmplify your data management with the SanDisk Extreme PRO Dual Drive, boasting read speeds up to 1,000MB/s2 and write speeds up to 900MB/s.2 Transition seamlessly between your USB-C™ and USB-A devices, and store tons of content with up to 2TB1 capacity. The SanDisk Extreme PRO Dual Drive is where rugged construction meets state-of-the-art data protection and convenience — for on-the-go professionals that need high performance and portability.\nPeak performance for seamless transfers\nUp to 1,000MB/s2 read speeds and 900MB/s2 write speeds ensure you meet your deadlines with time to spare.\nSubstantial storage to store and share\nEasily store, access, and share your creative projects and critical documents with up to 2TB1 capacity.\nDurable metal enclosure\nEngineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures — so you can take your files anywhere.\nPassword protection and encryption\nLive confidently knowing SanDisk helps protect your data with encryption technology.3\nFriendly with USB Type-C™ and USB Type-A devices\nTransfer files between your USB Type-C™ and USB Type-A laptop, tablet, and smartphone.5\nOrganize with ease with the SanDisk app\nHarness the power of the SanDisk app for auto backup, swift file management and retrieval.4\nPeak performance for seamless transfers\nUp to 1,000MB/s2 read speeds and 900MB/s2 write speeds ensure you meet your deadlines with time to spare.\nSubstantial storage to store and share\nEasily store, access, and share your creative projects and critical documents with up to 2TB1 capacity.\nDurable metal enclosure\nEngineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures — so you can take your files anywhere.\nPassword protection and encryption\nLive confidently knowing SanDisk helps protect your data with encryption technology.3\nFriendly with USB Type-C™ and USB Type-A devices\nTransfer files between your USB Type-C™ and USB Type-A laptop, tablet, and smartphone.5\nOrganize with ease with the SanDisk app\nHarness the power of the SanDisk app for auto backup, swift file management and retrieval.4\nPeak performance for seamless transfers\nUp to 1,000MB/s2 read speeds and 900MB/s2 write speeds ensure you meet your deadlines with time to spare.\nSubstantial storage to store and share\nEasily store, access, and share your creative projects and critical documents with up to 2TB1 capacity.\nDurable metal enclosure\nEngineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures — so you can take your files anywhere.\nPassword protection and encryption\nLive confidently knowing SanDisk helps protect your data with encryption technology.3\nFriendly with USB Type-C™ and USB Type-A devices\nTransfer files between your USB Type-C™ and USB Type-A laptop, tablet, and smartphone.5\nOrganize with ease with the SanDisk app\nHarness the power of the SanDisk app for auto backup, swift file management and retrieval.4\nSpecifications\n- USB-C\n- USB-A\n- Up to 1000MB/s read speeds and 900MB/s write speeds ensure you meet your deadlines with time to spare.\n- Easily store, access, and share your creative projects and critical documents with high-capacity flash storage.\n- Engineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures - so you can take your files anywhere.\n- Windows® 10+\n- macOS v12+\n- USB Type-A devices\n- USB Type-C™ devices\nSpecifications\n- USB-C\n- USB-A\n- Up to 1000MB/s read speeds and 900MB/s write speeds ensure you meet your deadlines with time to spare.\n- Easily store, access, and share your creative projects and critical documents with high-capacity flash storage.\n- Engineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures - so you can take your files anywhere.\n- Windows® 10+\n- macOS v12+\n- USB Type-A devices\n- USB Type-C™ devices\nSpecifications\n- USB-C\n- USB-A\n- Up to 1000MB/s read speeds and 900MB/s write speeds ensure you meet your deadlines with time to spare.\n- Easily store, access, and share your creative projects and critical documents with high-capacity flash storage.\n- Engineered for resilience with a sophisticated metal design, this dual drive not only performs; it endures - so you can take your files anywhere.\n- Windows® 10+\n- macOS v12+\n- USB Type-A devices\n- USB Type-C™ devices\nRatings & Reviews\nSupport & Resources\nDisclosures\n- 1GB=1,000,000,000 bytes. 1TB=1,000,000,000,000 bytes. Actual user storage capacity less.\n- Based upon read speed, unless otherwise stated. 1MB/s = 1 million bytes per second. Based on internal testing; performance may vary depending upon host device, usage conditions, drive capacity, and other factors. USB 3.0 port required.\n- Password protection uses 128-bit AES encryption and is supported by Windows® 10+ and macOS v12+ (Software download required, see Password Protection page on SanDisk site).\n- Download and installation required. Set up automatic backup within app settings. See official SanDisk website for mobile app details.\n- Mobile device requires USB Type-C port and On-The-Go (OTG) support. See www.sandisk.com/compatibilityusb-c for list of compatible devices\n- 1GB=1,000,000,000 bytes. 1TB=1,000,000,000,000 bytes. Actual user storage capacity less.\n- Based upon read speed, unless otherwise stated. 1MB/s = 1 million bytes per second. Based on internal testing; performance may vary depending upon host device, usage conditions, drive capacity, and other factors. USB 3.0 port required.\n- Password protection uses 128-bit AES encryption and is supported by Windows® 10+ and macOS v12+ (Software download required, see Password Protection page on SanDisk site).\n- Download and installation required. Set up automatic backup within app settings. See official SanDisk website for mobile app details.\n- Mobile device requires USB Type-C port and On-The-Go (OTG) support. See www.sandisk.com/compatibilityusb-c for list of compatible devices\n- 1GB=1,000,000,000 bytes. 1TB=1,000,000,000,000 bytes. Actual user storage capacity less.\n- Based upon read speed, unless otherwise stated. 1MB/s = 1 million bytes per second. Based on internal testing; performance may vary depending upon host device, usage conditions, drive capacity, and other factors. USB 3.0 port required.\n- Password protection uses 128-bit AES encryption and is supported by Windows® 10+ and macOS v12+ (Software download required, see Password Protection page on SanDisk site).\n- Download and installation required. Set up automatic backup within app settings. See official SanDisk website for mobile app details.\n- Mobile device requires USB Type-C port and On-The-Go (OTG) support. See www.sandisk.com/compatibilityusb-c for list of compatible devices"
    }
  ],
  "argos_summary": "The article argues that for portable backups, flash drives outperform external SSDs due to their smaller size, ease of use with smartphones, and lack of extra cables. While flash drives historically lagged in speed, newer models now match or exceed older SSDs, offering up to 1,000 MB/s read speeds. They also prove more reliable—having no moving parts—and are cheaper, allowing users to keep multiple copies of data. The piece concludes that the convenience and cost‑effectiveness of flash drives make them the preferred choice for most backup needs.",
  "argos_id": "4YEP7J1N4"
}