{
  "url": "https://finance.yahoo.com/video/gen-z-plans-pull-back-212521101.html",
  "authorsByline": "Yahoo Finance Video",
  "articleId": "918ee8897d584b77a15bfdcb33bb533d",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/rv0qrR2LXzurDMk3l9IE3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-09/74db5730-890c-11f0-9bdf-a0ce2949a755",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T21:25:21+00:00",
  "addDate": "2025-09-03T21:37:03.046437+00:00",
  "refreshDate": "2025-09-03T21:37:03.046439+00:00",
  "score": 1.0,
  "title": "Gen Z plans to pull back on holiday spending, survey says",
  "description": "A new holiday shopping survey from PwC found that Americans plan to spend around 5% less this holiday season than they did in 2024. The group that said they plan to pull back the most is Gen Z. In the video above, PwC US consumer markets industry Leader Ali Furman explains two reasons why Gen Z may not spend as much, while Yahoo Finance Senior Reporter Brooke DiPalma shares what she is hearing from retail CEOs. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend.",
  "content": "Well, the holiday season is approaching quickly and PWC says shoppers may be tightening their belts in 2025. A new report from the firm highlighting that consumer spending could be down by 5% compared to 2024 with Gen Z pulling back sharply even as boomers step up their spending. Joining me now, we have one of the authors of that report that would be Ally Furman, US Consumer Markets Industry Leader at PWC, and Yahoo Finance senior reporter, Brooke DiPalma. Welcome to you both. Ally, I'll start with you.\n\nOn that data point, um, Ally, which jumps out from your survey. So consumers expect their seasonal spending to decline on average by 5% from 2024. Why is that, Ally? What would be the reasons to explain that trend?\n\nYeah, well, it's a few things. Of course, the tariffs in the backdrop are deep in the consciousness of all consumers. They're very focused on are prices going to rise and they're very budget-oriented. So we're seeing the trend that we've seen for the last 12, 18 months continue right into the holiday season, and that's across every generation that we've surveyed.\n\nThe 5% spend decrease is actually very much a story about Gen Z, weighing down that average to your point, 23% less spend year-over-year, and you see millennials and Gen X holding flat for the most part year-over-year, and baby boomers spending about 5% more.\n\nWhat's going on with Gen Z?\n\nThere's a lot to talk about with Gen Z, but if I had to make two main points, I would say it's a coming of age story. The average Gen Z-er is now 22 years old. Uh, the oldest Gen Z-er is 29. So they're having kids, they have mortgages, they have different expenses and they're more focused on budget. But probably more interestingly, I think it's a validation that retailers are not yet meeting Gen Z's needs. They're a unique generation. They are the fastest to adopt trends and abandon trends. They're looking for incredibly fast, what I call social to shelf velocity. So they see trends on social media, they want it on the shelf right away. It often takes retailers months to get those trends on the shelves and that trend may have passed by that point in time. They're looking for value, they're into treasure hunts, authenticity. I mean, there's so many things that are different about this generation than generations before, that the vast majority of retailers have yet to capture their wallets.\n\nAnd Brooke to bring you here. You know, does what Ally's saying here, does it generally kind of dovetail with what you hear from retail execs?\n\nYeah, well right now what we're hearing is ultimately this this newness, this innovation that consumers need in order to splurge on that purchasing power. We even heard it this morning. I was on a call with Tony Spring, Macy's CEO, and he said to me that they're going to denim, they're going to silhouettes, they're going to even others. And also he said that there's resiliency in the consumer right now, but they really don't know what the fall is going to bring, especially because of those headwinds that you brought up. They're still concerned about tariffs. There's still this uncertainty around what exactly their wallets will look like this holiday season.\n\nAlly, do expectations always align with actual behavior? I mean, what consumers say they're going to do? Does it always perfectly align with what they actually do at the mall?\n\nThey they don't. And we know that there's this say versus do gap, particularly with some of the younger generations. For example, last year in our survey, Gen Z intended to spend 37% more than the prior year. They were kind of the stars of our holiday outlook. In actuality, they spent about 6 to 7% more year-over-year. So just as an example. So, and we also surveyed in June to early July. It was a slightly different environment at that point with economic uncertainty and tariffs than it even is now. So we have to just keep a close eye on what they're saying versus what they're actually doing, which we plan to do. We plan to track actuals all the way up till Black Friday because our survey says 80% of holiday shopping is meant to be completed by Cyber Monday.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gen Z",
      "weight": 0.09743494
    },
    {
      "name": "consumer spending",
      "weight": 0.08131418
    },
    {
      "name": "Gen X",
      "weight": 0.07979148
    },
    {
      "name": "holiday spending",
      "weight": 0.07855351
    },
    {
      "name": "last year",
      "weight": 0.07551883
    },
    {
      "name": "year",
      "weight": 0.06982016
    },
    {
      "name": "holiday shopping",
      "weight": 0.06732691
    },
    {
      "name": "consumers",
      "weight": 0.067151666
    },
    {
      "name": "Ally Furman",
      "weight": 0.06544808
    },
    {
      "name": "trends",
      "weight": 0.062441174
    }
  ],
  "topics": [
    {
      "name": "Black Friday Shopping"
    },
    {
      "name": "Polls"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.97802734375
    },
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.6484375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.46630859375
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.453857421875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.314208984375
    }
  ],
  "sentiment": {
    "positive": 0.034299076,
    "negative": 0.8062106,
    "neutral": 0.15949039
  },
  "summary": "A report by PWC has revealed that consumers may be tightening their belts in 2025, with consumer spending expected to drop by 5% compared to 2024, according to the report. The report suggests that Gen Z (Gen Z) is expected to significantly decrease consumer spending, with Gen Z pulling back sharply, even as boomers increase their spending. The trend is attributed to tariffs and a shift from millennials and Gen X holding flat year-over-year spending to Gen X, and baby boomers spending about 5% more. The author of the report, Ally Furman, and Yahoo Finance senior reporter, Brooke DiPalma, also highlighted that retailers are not meeting Gen Z's needs and that this generation is more focused on budget and adopting trends quickly. Despite this, there is still uncertainty around what consumers expect this holiday season's spending will look like this year.",
  "shortSummary": "PWC reports that Gen Z is expected to cut holiday spending by 5% in 2025, amid economic uncertainties and rising tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "28cd2d5d1054403aa501ee5aaaad9330",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "PwC's latest holiday‑shopping survey indicates U.S. consumers will cut spending by about 5% compared with 2024, largely driven by Gen Z's sharper pullback. Gen Z is expected to spend roughly 23% less year‑over‑year, while millennials and Gen X remain flat and boomers increase spending by about 5%. The decline reflects heightened tariff concerns and a shift toward budget‑oriented, value‑focused shopping, with retailers struggling to keep pace with Gen Z's rapid trend adoption.",
  "argos_id": "5D0G1EK6Q"
}