{
  "url": "https://www.androidauthority.com/wallpaper-wednesday-sep-03-2025-3593243/",
  "authorsByline": "C. Scott Brown",
  "articleId": "754d7b054361464ba0a364ec8799f923",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2025/09/Wallpaper-Wednesday-2025-09-03-1-of-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:30:27+00:00",
  "addDate": "2025-09-03T12:39:06.686738+00:00",
  "refreshDate": "2025-09-03T12:39:06.686740+00:00",
  "score": 1.0,
  "title": "Wallpaper Wednesday: More great phone wallpapers for all to share (September 3)",
  "description": "Looking for some new Android wallpapers? Here's the Android Authority Wallpaper Wednesday roundup for September 3, 2025.",
  "content": "Welcome to Wallpaper Wednesday! In this weekly roundup, we’ll give you a handful of Android wallpapers you can download and use on your phone, tablet, or even your laptop/PC. The images will come from folks here at Android Authority as well as our readers. All are free to use and come without watermarks. File formats are JPG and PNG, and we’ll provide images in both landscape and portrait modes, so they’ll be optimized for various screens.\n\nFor the newest walls as well as all the ones from previous weeks, check out this Drive link. Want to submit your own? Head to the bottom of this article.\n\nAnother week, another set of awesome Android wallpapers for you to share! Remember that we are always looking for submissions from our readers. Head to the bottom of this article to find out how you could have one of your images featured in an upcoming Wallpaper Wednesday!\n\nWith that in mind, we’ve got six awesome images from our readers that would look great on your phone, tablet, or PC. As usual, we also have three images from the Android Authority team.\n\nFirst, we have a picture of a tiny, pretty Texas flower. That comes from reader Christopher Tobar. After that, we have an incredible shot of a fly, captured by reader Siyon Savalajkar, who used a CMF Phone 1 to get it! Next, we have a great photo of a sunset peeking through some trees in India from reader John William. After that, we have a photo motorcycle fans will love, courtesy of reader Rahul Koparde. Next, we have an astounding photo of a lizard in Arkansas from reader Ruth Gullotta. Ruth used a Google Pixel 9 Pro for that one! Finally, we have a photo of a dead tree on a beach from reader (and frequent contributor) Julius Earle, Jr. As usual, Julius used an oldie for that one, this time a Samsung Galaxy Note 4! Thanks so much for your submissions, all!\n\nFrom the Android Authority team, we have a great photo of the “Great Gate” at the Taj Mahal from Joe Maring. We also have a pic of some water under a bridge from Rita El Khoury. Finally, we have a photo of some stone from Zac Kew-Denniss.\n\nHow to submit your own Android wallpapers We are very excited to see your own contributions to our Wallpaper Wednesdays project. Before submitting, here are the rules:\n• Your submissions should be your own creation. That means photos you took, digital art you created, etc. Please don’t submit other people’s work — that’s just not cool. Also, please don’t send images purely created with AI. They will not be accepted. Images you created and then augmented with AI tools are OK.\n• You must agree to let Android Authority share your Android wallpapers for free with anyone who wants them.\n• We will not accept watermarked images. You will, however, get a credit and a link in the article itself. We can link to your social media account only. Ready to submit? Fill out the form below. You’ll need to include the highest-resolution version of the image you can provide, your name, and a brief description of what the image is. If you want us to link to a social media page you own in your credit, please provide that, too, but that’s optional.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/nothing-cmf-phone-1-review-3502896/",
    "https://www.androidauthority.com/news/",
    "https://www.androidauthority.com/android-wallpapers-662790/",
    "https://www.androidauthority.com/author/zackewdenniss/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://www.androidauthority.com/google-pixel-9-pro-review-3478671/",
    "https://www.androidauthority.com/author/ritaelkhoury/",
    "https://www.androidauthority.com/author/joemaring/",
    "https://www.androidauthority.com/tag/wallpapers/",
    "https://andauth.co/WallpaperWednesdays"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "awesome Android wallpapers",
      "weight": 0.090084925
    },
    {
      "name": "Android wallpapers",
      "weight": 0.08897783
    },
    {
      "name": "Images",
      "weight": 0.087566614
    },
    {
      "name": "images",
      "weight": 0.087566614
    },
    {
      "name": "reader Siyon Savalajkar",
      "weight": 0.08730629
    },
    {
      "name": "reader",
      "weight": 0.08726028
    },
    {
      "name": "reader Ruth Gullotta",
      "weight": 0.08611506
    },
    {
      "name": "watermarked images",
      "weight": 0.08602903
    },
    {
      "name": "More great phone wallpapers",
      "weight": 0.0846923
    },
    {
      "name": "reader Rahul Koparde",
      "weight": 0.083699584
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.61962890625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.615234375
    },
    {
      "name": "/News/Technology News",
      "score": 0.544921875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.412841796875
    }
  ],
  "sentiment": {
    "positive": 0.4598389,
    "negative": 0.07079458,
    "neutral": 0.46936655
  },
  "summary": "Welcome to Wallpaper Wednesday, a weekly roundup of Android wallpapers from both Android Authority and readers. The images will be free to download and use on your phone, tablet, or even a laptop/PC. All images will come from both JPG and PNG and come without watermarks. The rules for submitting include that images should be your own creation, not be created with AI tools, and that images must be in both landscape and portrait modes to be optimized for various screens. Submissions must include the highest-resolution version of the image, a brief description of what the image is, a credit and a link in the article itself, and social media account only.",
  "shortSummary": "Wallpaper Wednesday features free Android wallpapers from Android Authority's readers, with free JPG and PNG versions available for download and use without watermarks, and encourages submissions for inclusion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "47b08452b5c14226b4466fb04b953fe3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/author/joemaring/",
      "text": "Joe Maring\nJoe is the Trending Editor for Android Authority, focusing on op-eds, analysis pieces, and hands-on impressions of the latest phones and other gadgets. If it has a screen and a processor, chances are he has something to say about it.\nJoe started the industry nearly 13 years ago when he launched a mobile tech-focused YouTube channel called “MobileCupOfJoe.” After running that for a few years throughout high school, he freelanced for PhoneArena, XDA, and 9to5Google. He spent three and a half years as a News Editor and Senior Editor for Android Central and was a Senior Writer and Editor for Screen Rant’s Tech section. He was most recently the Section Editor for Digital Trends’ Mobile section, leading the site’s mobile tech coverage for nearly three years. He’s also a tech trade show veteran, having attended CES, MWC, IFA, and other press briefings and product launches all over the world.\nWhen he’s not writing, you can likely find Joe out running, at the movie theater, or at one of his favorite coffee shops. Joe lives in Michigan with his partner of 10 years, two adorable cats, and a very sweet (and lazy) pit bull/boxer mix."
    },
    {
      "url": "https://www.androidauthority.com/tag/wallpapers/",
      "text": "Pages tagged:\nWallpapers\nWallpaper Wednesday: More great phone wallpapers for all to share (September 3)\nHere is a weekly selection of Android wallpapers created by our readers and members of the Android Authority team!\nC. Scott Brown57 minutes ago\n0\nC. Scott BrownAugust 27, 2025\n0\nWallpaper Wednesday: Special Google Pixel 10 edition! (August 27)\nSamsung wallpapers: Get the latest ones available\nEdgar CervantesAugust 24, 2025\n0\nDownload the Google Pixel 10 wallpapers here\nStephen SchenckAugust 20, 2025\n0\nWallpaper Wednesday: More great phone wallpapers for all to share (August 20)\nC. Scott BrownAugust 20, 2025\n0\nThese smashing Galaxy Z Flip 7 cover screen wallpapers make clever use of the cameras\nTushar MehtaAugust 15, 2025\n0\nWallpaper Wednesday: More great phone wallpapers for all to share (August 13)\nC. Scott BrownAugust 13, 2025\n0\nWallpaper Wednesday: More great phone wallpapers for all to share (August 6)\nC. Scott BrownAugust 6, 2025\n0\nThe best Android wallpapers: Default wallpapers from 90+ Android devices\nEdgar CervantesAugust 3, 2025\n0\nWallpaper Wednesday: More great phone wallpapers for all to share (July 30)\nC. Scott BrownJuly 30, 2025\n0"
    },
    {
      "url": "https://andauth.co/WallpaperWednesdays",
      "text": "Namn\nÄgare\nÄndrades senast\nFilstorlek\n- Överst\n- Blandat med filer\n2021\nÄgaren är dold\n29 nov. 2022\n—\nLadda ned\n2022\nÄgaren är dold\n30 dec. 2022\n—\nLadda ned\n2023\nÄgaren är dold\n14 dec. 2023\n—\nLadda ned\n2024\nÄgaren är dold\n26 dec. 2024\n—\nLadda ned\n2025-01-01 (1).jpg\nÄgaren är dold\n26 dec. 2024\n284 kB\n2025-01-01 (1).png\nÄgaren är dold\n26 dec. 2024\n325 kB\n2025-01-01 (2).jpg\nÄgaren är dold\n26 dec. 2024\n1,7 MB\n2025-01-01 (3).jpg\nÄgaren är dold\n26 dec. 2024\n1,2 MB\n2025-01-01 (4).jpg\nÄgaren är dold\n26 dec. 2024\n2,1 MB\n2025-01-01 (5).jpg\nÄgaren är dold\n8 juni 2023\n420 kB\n2025-01-01 (6).jpg\nÄgaren är dold\n26 dec. 2024\n368 kB\n2025-01-01 (7).JPG\nÄgaren är dold\n13 dec. 2024\n18,5 MB\n2025-01-01 (8).jpg\nÄgaren är dold\n7 apr. 2023\n553 kB\n2025-01-08 (1).jpg\nÄgaren är dold\n2 jan. 2025\n592 kB\n2025-01-08 (2).jpg\nÄgaren är dold\n2 jan. 2025\n1,8 MB\n2025-01-08 (3).jpg\nÄgaren är dold\n2 jan. 2025\n2,9 MB\n2025-01-08 (4).jpg\nÄgaren är dold\n2 jan. 2025\n1,4 MB\n2025-01-08 (5).jpg\nÄgaren är dold\n2 jan. 2025\n7,7 MB\n2025-01-08 (6).jpg\nÄgaren är dold\n13 dec. 2024\n3,2 MB\n2025-01-08 (7).jpg\nÄgaren är dold\n2 jan. 2025\n2,6 MB\n2025-01-08 (8).jpg\nÄgaren är dold\n24 sep. 2023\n1,7 MB\n2025-01-08 (9).jpg\nÄgaren är dold\n1 jan. 2025\n3 MB\n2025-01-15 (1).jpg\nÄgaren är dold\n13 jan. 2025\n1,3 MB\n2025-01-15 (2).jpg\nÄgaren är dold\n1 jan. 2025\n1,8 MB\n2025-01-15 (3).jpg\nÄgaren är dold\n9 aug. 2023\n1,7 MB\n2025-01-15 (4).JPG\nÄgaren är dold\n13 dec. 2024\n15,2 MB\n2025-01-15 (5).jpg\nÄgaren är dold\n13 jan. 2025\n1,9 MB\n2025-01-15 (6).jpg\nÄgaren är dold\n13 jan. 2025\n4,9 MB\n2025-01-15 (7).jpg\nÄgaren är dold\n13 jan. 2025\n2 MB\n2025-01-15 (8).jpg\nÄgaren är dold\n13 jan. 2025\n5,7 MB\n2025-01-15 (9).jpg\nÄgaren är dold\n13 jan. 2025\n709 kB\n2025-01-22 (1).jpeg\nÄgaren är dold\n20 jan. 2025\n7,3 MB\n2025-01-22 (1).jpg\nÄgaren är dold\n20 jan. 2025\n3 MB\n2025-01-22 (2).jpg\nÄgaren är dold\n20 jan. 2025\n708 kB\n2025-01-22 (3).jpg\nÄgaren är dold\n13 dec. 2024\n6,2 MB\n2025-01-22 (4).jpg\nÄgaren är dold\n20 jan. 2025\n181 kB\n2025-01-22 (5).jpg\nÄgaren är dold\n20 jan. 2025\n2,1 MB\n2025-01-22 (6).jpg\nÄgaren är dold\n20 jan. 2025\n4,8 MB\n2025-01-22 (7).jpg\nÄgaren är dold\n15 juli 2023\n986 kB\n2025-01-22 (8).jpg\nÄgaren är dold\n27 dec. 2024\n1,7 MB\n2025-01-29 (1).jpg\nÄgaren är dold\n27 jan. 2025\n2,1 MB\n2025-01-29 (2).jpg\nÄgaren är dold\n27 jan. 2025\n4,6 MB\n2025-01-29 (3).jpg\nÄgaren är dold\n27 jan. 2025\n614 kB\n2025-01-29 (4).jpg\nÄgaren är dold\n13 dec. 2024\n4,2 MB\n2025-01-29 (5).jpg\nÄgaren är dold\n27 jan. 2025\n778 kB\n2025-01-29 (6).jpg\nÄgaren är dold\n27 jan. 2025\n1,6 MB\n2025-01-29 (7).jpg\nÄgaren är dold\n27 dec. 2024\n1 MB\n2025-01-29 (8).jpg\nÄgaren är dold\n28 maj 2023\n2 MB\n2025-01-29 (9).jpg\nÄgaren är dold\n27 jan. 2025\n1,1 MB\n2025-02-05 (1).jpg\nÄgaren är dold\n3 feb. 2025\n4,8 MB\nInga filer i den här mappen.Logga in för att lägga till filer i den här mappen"
    },
    {
      "url": "https://www.androidauthority.com/google-pixel-9-pro-review-3478671/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nThe Pixel 9 Pro is the small Android phone I've been waiting for\nFebruary 1, 2025\nGoogle Pixel 9 Pro\nMSRP: $999.00\nWhat we like\nWhat we don't like\nGoogle Pixel 9 Pro\nIf you’ve read any of my many reviews here at Android Authority, you’ll know I like a small phone. You’ll know I appreciated devices like the base Pixel 8 and iPhone 15 because they would fit comfortably in my hand (and pocket) and let me go about my life without feeling like I had a tablet in my pocket.\nBut you’ll also know that smaller phones almost always come with compromises, like ditching a telephoto sensor, trimming a few gigabytes of RAM, or capping the charging speed — minor cuts that limit the overall experience. I always had to give something up to keep a phone I liked in my pocket, at least until Google launched the Pixel 9 Pro.\nNot too big, not too small\nIf I’ve waxed poetic once about Google’s design evolution over the years, I’ve done it a hundred times — and now I’ll do it just one more time. After all, Google’s penchant for colorful finishes and clean lines drew me to the Pixel series in the first place, and the Pixel 9 Pro is no exception. In fact, the Pixel 9 Pro specifically might well be the best iteration yet, if only because it finally gives me the top-tier Pixel experience in a phone that I can use one-handed. I think it’s fairly obvious that Google saw what Apple was doing with its two Pro-level iPhones and decided it could do one better.\nThat’s not much of an exaggeration, either — the Pixel 9 Pro is more iPhone-like than ever. It has a simple G logo on the back instead of a half-eaten apple and a camera bar that’s become more of an island, but the flattened side rails and display are similar enough to make Tim Cook blush. And, like I said when I called the Pixel 9 Pro XL the best iPhone ever, I mean that in the best ways. See, Apple has long set a standard when it comes to smartphone build quality. Whether or not its latest iPhone models look exciting, you know they’ll feel sturdy and reliable. Google’s annual updates, on the other hand, always felt like they had room to improve, either due to super-thin side rails, curved displays prone to accidental touches, or in-display fingerprint readers that weren’t very good.\nThe Pixel 9 Pro is the best-made Pixel of all time, and it even fits in my hand.\nNow, it’s hard to even think of those flaws while using the Pixel 9 Pro. Google’s new 6.3-inch AMOLED panel is perfectly flat, yet the slight curve on the back of the aluminum frame allows the phone to sit comfortably in your hand for a long day of usage. Its slightly textured back panel of Gorilla Glass Victus 2 feels ever so slightly more premium than its predecessor, tucking comfortably into the glossy frame rather than sticking out behind it. And, while I thought that glossy frame might have worked against Google’s larger Pixel 9 Pro XL, it’s much easier to admire on a smaller phone that doesn’t feel like you have to hold onto it for dear life. Even if you drop it, the IP68 rating should give you a little peace of mind in dirt and water if you’re out for a weekend away from home. Nevertheless, you’ll definitely want to protect your investment with a suitable case.\nDespite its smaller stature, the Pixel 9 Pro’s display packs the same impressive specs as its top-end sibling. It pairs its slim bezels with an impressive 3,000 nits of peak brightness while holding a solid 2,000 nits in high-brightness mode. Both measures are enough to keep the Pixel 9 Pro easily visible while sitting on the beach during Labor Day weekend on the East Coast — though I’ve hardly come close to maxing out the phone’s display otherwise. It’s still interrupted by a punch-hole selfie camera, but even that’s about as easy to ignore as the bezels.\nI’ll admit that a small part of me, somewhere deep down, feels slightly disappointed by Google’s newfound maturity. Shrinking the camera bar and giving it durable aluminum edges might make it more durable, but it also means that the days of two-toned Pixels might be gone for good. Its side rails might be easier to hold, yet they’re less distinctive in an ever-evolving Android market. Even the color options feel more muted on the Pixel 9 series, with fun hues like Bay and Mint making way for Rose Quartz and Hazel. They’re still gorgeous, just not as fun or flashy as Pixels of the past.\nHowever, if my biggest complaints are improved durability and slightly grown-up colors, the Pixel 9 Pro is doing many things right. Taking all the best parts of the Pixel 9 Pro XL, it’s easily the most enjoyable Pixel to use in my experience, and it feels like it should set the tone for smaller, lighter phones in the future. The Pixel 9 Pro feels like a message to Samsung, OnePlus, and other Android competitors that a pro-level phone doesn’t need a massive display.\nOh, and the temperature sensor is still here — just figured I should mention it after Google essentially forgot about it. I’m still struggling to find reasons to use it.\nIt still runs (mostly) like a Pro\nOf course, with Google packing its updated Tensor G4 chipset into a smaller body with less room for cooling components, I was a little nervous about how the Pixel 9 Pro would perform. I figured that any thermal shortcomings associated with the Tensor chip would only be amplified by its new, pocket-friendly residence and that the Pixel 9 Pro might fall a bit behind its full-sized sibling, the Pixel 9 Pro XL. I’m happy to report that I was wrong (mostly).\nAs usual, I put the chipset — which comes backed by 16GB of RAM and a disappointing 128GB of storage in its base configuration — through its paces with our usual set of CPU, GPU, and battery tests. But, while you might expect that extra RAM to kick things up a notch, you can only actually use 13GB of it with the remaining 3GB carved out for Gemini. Anyway, I lined it up against its top Android foes and Apple’s more portable Pro, if only so that it could tell me what I already knew: The Tensor G4 is still no benchmarking beast.\nSure, it beat its predecessor, the Tensor G3, in just about all of our testing, but it still has a decent gap to make up before it’s genuinely racing against the Qualcomm Snapdragon 8 Gen 3 or Apple’s A17 Pro — though rumor has it that we might see some of those improvements on the Pixel 10. Surprisingly, the Pixel 9 Pro is neck and neck with the larger Pixel 9 Pro XL across most of our workload and CPU tests. It’s not a significant gap — just a percentage point or two across most of my tests — but good news for small phone enthusiasts everywhere. That said, the expected dip in GPU performance for the smaller Pixel 9 Pro is pretty visible as the phone drops to the Tensor G3-powered Pixel 8 Pro‘s performance after just five runs, while the XL version manages to sustain decent stability for another 10 runs. This is likely due to the reduced room for the new vapor chamber.\nOf course, while we compared the Pixel 9 Pro to the latest from Apple and Google at its launch, things have changed since then. The iPhone 16 series arrived with Apple’s A18 chip under the hood and Samsung’s Galaxy S25 series picked up an overclocked Snapdragon 8 Elite for Galaxy processor, both of which open the gap a little bit wider over the Tensor G4. So, we’re right back to Google feeling a bit further behind on paper, but we’ll hold out some hope for the next generation to tighten up again.\nThe Pixel 9 Pro's performance keeps up with the XL model... mostly.\nThankfully, the Pixel 9 Pro feels just as capable as its sibling in day-to-day use. I headed down to the Jersey shore for a holiday weekend and compared my Pixel 9 Pro head-to-head against the Pixel 9 Pro XL my dad recently bought from Verizon. We started our days at about the same time, me kicking off my day with a mix of Spotify streaming and checking the Chelsea FC score a few times throughout a five-mile run and him heading to the end of the island to capture some photos and see how the cameras compared to the Galaxy S21 Ultra that he traded in.\nThe rest of the day saw us use our Pixels a bit closer together, sitting in the sun and sand and putting the Tensor G4 under a bit more thermal load than it probably would have liked. I put my Pixel 9 Pro through an hour or so of gaming, split between Royal Match and Warhammer 40,000: Tacticus, which warmed it up a bit, but never to the point where I needed to hide it in the shade to let it cool off. Even though my stretch of gaming didn’t cook the Tensor G4, it did show me one thing — the Pixel 9 Pro has a bit of a battery weakness.\nI know what you’re thinking — of course, the Pixel 9 Pro puts in a shorter battery shift than Google’s other Pro-grade Pixels; it has a smaller battery (over ~300mAh smaller than the XL). That’s true, but it’s also powering a smaller display, so I was still surprised to see such a gap in our battery drain testing. It fell short of the Pixel 9 Pro XL by a pretty good margin across all categories, faring the worst when 4K video was involved — either recording or playback.\nThe smaller Pixel’s Zoom and web results are a bit more respectable, and it leads Google’s trio in gaming durability, but it’s not enough that you can expect two full days of usage between charges. Real life involves a better mix of usage, so you might not feel the effects of poor gaming battery usage, but I found myself reaching for a charger more than every 36 hours.\nWhen you need a charge, you’ll run into another one of Google’s puzzling Pixel decisions. Even though it bumped the Pixel 9 Pro XL’s wired charging up to 37W, it left the Pixel 9 Pro behind with 27W wired charging with a USB PD PPS-enabled charger. Strangely, that’s the same speed the previous Pixel 8 Pro supported, but you wouldn’t know it from the graph above. The Pixel 9 Pro took almost 90 minutes to fill with Google’s brand-new 45W charger, while the Pixel 8 Pro filled its larger battery nearly 10 minutes quicker with an older 68W Motorola TurboPower charger I had lying around.\nInterestingly, our testing showed that the Pixel 9 Pro spent more time charging at near-peak speeds (21 minutes instead of 19), but it reached a top temperature of 42.2 degrees Celsius compared to the Pixel 8 Pro’s 38.2 degrees, which is likely where you see the dropoff at around the 35-minute mark above. Thankfully, though, the Pixel 9 Pro appears capable of reaching its full 27W speeds from that same TurboPower charger that I’ve trusted for a few years — unlike the Pixel 9 Pro XL, which seems to require an extra special set of chargers to reach its full potential due to weird interactions with charger voltage.\nYou can also skip Google’s headache of a wired setup and charge your Pixel 9 Pro wirelessly, in which case it’ll reach 21W with the second-generation Pixel Stand ($79 at Best Buy) or 12W from any other Qi-certified pad. I wish I could make complete sense of Google’s plan for its charging setup, but alas, Goog’ gonna Goog’.\nPortable Pixel cameras\nOne thing I wasn’t worried about was Google’s cameras not living up to the hype on the Pixel 9 Pro. After all, it packs the same trio of high-resolution sensors I just finished testing on the Pixel 9 Pro XL, just in an easier-to-wield form factor. That means you once again have a 50MP primary sensor with a shallow maximum aperture of ƒ/1.7 with which to capture your world, as well as ultrawide and telephoto sensors to back it up. They fill out the camera bar nicely and make the Pixel 9 Pro one of the best camera phones around — especially at its size.\nBoth of Google’s peripheral lenses offer matching 48MP resolutions but are pretty much opposites otherwise. The ultrawide snapper gained the same maximum aperture as the primary camera but swapped to a slightly tighter 123-degree field of view — just like the Pixel 9 Pro XL. While you probably won’t notice that loss of three degrees, you’ll probably welcome the extra light capture, which should make it easier to grab macro shots using Google’s software-based solution. Oh, and it’s a little easier to get close to your subject with the smaller 6.3-inch footprint. The Pixel 9 Pro’s periscope telephoto sensor offers less of a change from its predecessor, sticking with 5x optical zoom and reaching up to 30x Super Res Zoom. Let’s head to the beach to check out a few camera samples.\nFirst, proof that Google still knows how to shoot and process a well-lit photo. My weekend at the beach wasn’t quite as adventurous or colorful as my trips to Pittsburgh and Washington, DC, with the Pixel 9 Pro XL, but I found that the smaller Pixel 9 Pro was just as willing to pull details out of shots throughout its zoom range. I’m particularly pleased with the photo of the sun setting over the bay, which caught everything from the color of the sky to the small birds on the dock and kept the wood boards in the foreground in soft focus.\nThe image of the capybara in the second row is good, too, even if the water around the world’s largest rodent is pretty gross. Google nailed the colors of the floating leaves and the shade as it falls across the animal’s fur, and you can just about make out the turtle swimming just below the surface of the background. I would have liked a little more pop in the image of the boats next to it, though, which looks a little bit dead and flat.\nThankfully, I got all the pop I wanted on an evening walk downtown. The Pixel 9 Pro gave the middle image of a neon sign plenty of glow in the building and on the tree in the background while preserving the barely visible telephone wires overhead. I’m impressed that you can still make out a bit of green in the leaves in the shot to the left, too — low-light photos often crush those clusters to blackness.\nI’ve said this before, too — macro mode should always be software-based, and the Pixel 9 Pro shows why. It gives its 48MP ultrawide sensor double duty, and the wide-open aperture means that it can grab more light to process. The result is a snail shell that shows every last grain of sand and a Black-Eyed Susan with plenty of detail through its “black eye.”\nGoogle’s overall zoom range is pretty impressive, too. I would typically bin almost all of my 10x and 30x samples shortly after writing a review, but I’m pleased with the details in the seagull and the tracks in the sand at 10x zoom. Our feathered friend is a little bit fuzzier at 30x zoom, but you can still make out that he’d come to steal your hotdog if given a chance.\nAnd then, there’s Google’s updated selection of AI-powered features. I already mentioned that I liked the revamp of panorama mode on the Pixel 9 Pro XL, and it’s just as good here. It’s incredibly simple to line up your shot across a series of dots rather than trusting a steady hand, even if there’s a tiny processing error along the dock to the right side.\nUnfortunately, Zoom Enhance isn’t quite as impressive. It took almost a year to launch after being announced alongside the Pixel 8 Pro, but the result is a photo that looks far too sharp in some places while not looking much different in others. The patriotic badge to the right seems almost like it’s been cut with a laser to capture the leaves and outline, giving it edges that are much too sharp. Rather than Zoom Enhance, the feature feels more like Zoom Oversharpen, and sharper isn’t always better.\nZoom Enhance? More like Zoom Oversharpen... which isn't the same thing.\nOther AI-powered features let you be a little more creative, like the improved Reimagine option in Magic Editor. On top of resizing and rearranging elements of your shot, you can now replace the sky, the ground, and things your subject is holding with a tap and a little typing. The Pixel 9 Pro still gets a little fuzzy at the edges of its image generation, but it’s significantly better than the artifact-heavy version launched with the previous generation.\nGoogle gave the Pixel 9 Pro the same selfie camera overhaul as the Pixel 9 Pro XL, which remains one of the bigger surprises in this year’s camera setup. It packed a 42MP sensor into its punch hole, which captured more accurate colors and details when I compared it to the base Pixel 9’s 10.5MP shooter.\nI could copy and paste the Pixel 9 Pro’s video chops if I wanted to, too — they’re the same as the Pixel 9 Pro XL. It can shoot clips at up to 20x Super Res Zoom, which Google will then apply Video Boost for smoother, sharper final results. The Pixel 9 Pro can upscale videos to 8K resolution, from which you can clip 33MP stills.\nYou can also check out full-resolution versions of these samples (and several more) at this Google Drive link. Oh, and if you want even more samples from the Pixel 9 Pro XL — which has the same hardware — we have a gallery of those at this Google Drive link.\nAnd, of course, there’s Gemini\nAs you’ve probably figured out, everything the Pixel 9 Pro XL can do, the Pixel 9 Pro can do too — just smaller. That, of course, includes its mountain of AI-powered capabilities. I’ve already touched on a few camera-focused features above, but they’re only the start of Google’s lofty plans for the Gemini age.\nAnd yes, I still have reservations about everything I do being used to train Gemini (one week in Pixel-land isn’t enough to change that), but Google’s finished product is much better than the current offerings from Samsung, Motorola, and other phone brands hurriedly jumping into the AI race. Maybe it rushed a few things to market on the Pixel 8 series and launched its Gemini Assistant without giving it the power to, well, assist with your smart home, but it’s clear that Google has learned a lot in the last year or so.\nGemini has come an impressively long way in just one generation, whether I'm creating images or asking tricky questions.\nEverything feels a little smoother and quicker, whether you’re chatting with a revamped and interruptible Gemini Live or generating images from text in Pixel Studio. I’ll admit that since swapping from the Pixel 9 Pro XL to the Pixel 9 Pro, I’ve been a bit more inclined to use the latter than the former — but that’s more so I wouldn’t have to explain the concept of Gemini Live to my grandparents while sharing a beach house for the weekend. The fact still stands that Gemini Live, with its eight interchangeable voices, is scary good, just in a way that I think would freak out two people who currently use a Motorola Moto G Play from 2021.\nOn the other hand, Pixel Studio feels like something every parent wishes they had when their kid asked them to draw something. In fact, that’s kind of how I explained it while showing off my “smartphone of the week,” as my family calls it. This time, I stuck to a theme of beach-related creations, putting animals on surfboards and burying treasure on 85th Street, and the Pixel Studio continued to show off its Imagen 3-powered chops. You still can’t generate people, though, making the overall experience much different from Samsung’s Portrait Studio.\nOther features, like the revamped Pixel Weather app and all-new Pixel Screenshots app, are more like the unsung heroes of Google’s Gemini revolution. You might not notice things like organizable widgets for the air pressure and wind direction if you never scroll past the hourly forecast and radar, but the AI-generated Weather Report is like the one-sentence reminder your mom used to give you before you headed out the door for school in the morning. I’ll also readily admit that I’m not a screenshot guy — preferring to leave a billion Chrome tabs open as reminders — but I might start changing my tune if I can remember to make folders every time I research seven vs seven soccer tactics and look for betting advice during college football season.\nThese are also just the Gemini features we can use so far. Google’s Pixel 9 series is promised software updates for seven years, including Pixel Drops, including security patches, Android versions, and regular feature drops. The Pixel 9 Pro launched with Android 14, which seemed like an unusual step, but it picked up Android 15 shortly after launch.\nGoogle Pixel 9 Pro review verdict: Small and mighty in equal measure\nWhen I finished reviewing the Pixel 9 Pro XL, I called it the phone I’d been waiting for. As it turns out, the Pixel 9 Pro was the phone I actually had been waiting for — I just didn’t know it. Everything I said about Google’s larger flagship absolutely still rings true, with impressive cameras, an impressive suite of AI-powered features that are mostly user-ready, and a build quality that’s head and shoulders above Pixels of the past. The Pixel 9 Pro XL is a sublime choice for anyone who wants the very best Pixel has ever had to offer and wants it in the biggest package possible. But for me, it’s just far more enjoyable on a phone that I can use with one hand.\nGoogle’s ability to pack this much power into a 6.3-inch smartphone should put other Android flagship series’ on notice. You don’t need to churn out a nearly 7-inch smartphone to call it a Pro or even an Ultra (though I guess that size still justifies the Plus moniker). The Pixel 9 Pro combines a battery capacity that rivals the Galaxy S24 Plus, cameras that out-process the OnePlus 12, and an update commitment that goes up against just about anyone. Factor in its build quality, and there aren’t many phones I’d reach for before this one.\nFinally, a pro-grade Pixel that fits comfortably in my pocket.\nAnd yet, the Pixel 9 Pro isn’t without a few small phone compromises. Google didn’t see fit to bring its fastest charging to its smaller model, nor has it figured out a few of the kinks (thermals and benchmarking) that have plagued the Tensor chip since its earliest days. Perhaps the latter results from the former, but we’ll probably find out when Google makes its anticipated switch from Samsung to TSMC for its next in-house chipset. I don’t think either flaw is a true dealbreaker, though, as the Pixel 9 Pro escapes most of the charging headache that plagues its big brother while feeling just as smooth as any other flagship from day to day.\nBut if you want a solution for at least one of those issues, Google has a Pixel 9 Pro XL ($1099 at Amazon) that it’ll sell you. It offers almost the same experience as the Pixel 9 Pro, from the flattened-out design to the brilliant cameras and Gemini infusion, just bigger. It picks up an extra half-inch of screen real estate to match its 5,060mAh battery and grabs the 37W wired charging that can save you a few minutes — provided you have one of a particular set of chargers. My colleagues and I don’t often hand out five-star ratings at the end of reviews, but the Pixel 9 Pro XL more than earned its accolades.\nShould you decide to venture outside of Google’s ecosystem, it becomes a bit tougher to choose natural rivals for the Pixel 9 Pro. It’s configured closer to Samsung’s Galaxy S25 Plus ($999.99 at Amazon), yet sized to match the base Galaxy S25 ($809.99 at Amazon). Personally, I’d rather have Google’s more natural cameras and more complete AI experience, but I’m sure that some will reach for the Galaxy S25 Plus with its larger 6.7-inch display and faster 45W wired charging at the same price. Both of Samsung’s smaller phones pack the more powerful Snapdragon 8 Elite for Galaxy chipset, which might sway users, too, even though it won’t feel any quicker in day-to-day usage.\nAnd then there’s the iPhone — Google’s twin from another operating system. Whereas the Pixel 9 Pro XL matched up nicely against the iPhone 16 Pro Max, the Pixel 9 Pro is more comfortable against the smaller iPhone 16 Pro ($999 at Amazon). From the side, the two are nearly twins, sharing flat frames and glossy finishes and even matching the placement of their antennas with only the square camera bump and Google’s camera bar to tell them apart, as well as Apple’s new Camera Control, which I’ve only found a few reliable uses for. Of course, going for the iPhone probably means diving headfirst into Apple’s larger ecosystem, which could be quite the investment once you add an Apple Watch and maybe an iPad to replace your current Android alternatives.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/android-wallpapers-662790/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nThe best Android wallpapers: Default wallpapers from 90+ Android devices\nAugust 3, 2025\nChange your smartphone wallpaper, and suddenly, you’ll feel like you’re holding a whole new device. Changing the wallpaper on your Android is also a straightforward task. What’s hard is finding the right one.\nWe’ve rounded up some of the best Android wallpapers around. More specifically, these are the stock wallpapers from many of the best devices available in the market. You’re bound to find something you like here, so let’s get right into it!\nAndroid Wallpapers from top smartphones\nEditor’s note: We’ll keep updating this list of the best wallpapers as new devices launch.\nHow to download and set your Android wallpapers\nLet’s start by explaining how this works. You’ll need to click on the device and download the full wallpaper from the page you’re redirected to.\nThe easiest way to do this is to simply download the files on the device you want to set these wallpapers on. Otherwise, you can use any other device to download the files. Then, transfer your wallpaper to your phone using something like Google Drive, sending yourself an email, or sending the file over USB or Bluetooth. Once you have your wallpaper on your phone, follow the steps below to set it as your wallpaper. Just ensure not to use services that compress images, such as Messenger or WhatsApp.\nHow to set a wallpaper on Android:\n- Launch the Settings app.\n- Select Wallpaper & style.\n- Pick More wallpapers.\n- Go into My photos.\n- Find the wallpaper you’ve downloaded and pick it.\n- You can now modify and move the wallpaper to your preferred position.\n- When ready, hit Set Wallpaper.\n- Pick whether you want to set the wallpaper on your Home screen and/or Lock screen.\n- Tap on Set.\nDo we have any iPhone users around? You can also use any of these wallpapers on iOS! That’s the beauty of wallpapers. They are just images, and you can use them on any device.\nHow to set a wallpaper on an iPhone:\n- Launch the Settings app.\n- Go into Wallpaper.\n- Tap on Add New Wallpaper.\n- Go into Photos.\n- Select the image you downloaded.\n- You can now slide left and right to change styles, pinch to crop, add widgets, edit the font, and more.\n- When you’re done customizing, select Add.\n- You can now tap on Set as Wallpaper Pair. You can also opt to Customize Home Screen.\nNote: We developed these steps using a Google Pixel 8a running Android 16 and an Apple iPhone 15 running iOS 18.5. Keep in mind that each phone operates differently, so the steps might differ for each device.\nAndroid wallpapers from software versions\nHere, you’ll find the stock wallpapers included in the most recent versions of Android, such as Pie, Oreo, Marshmallow, Lollipop, and a few others.\nNote: Most of the other stock wallpapers on Pixel phones can be found in Google’s Wallpapers app.\nApple\nWe know most of our readers are Android users, but some of you might still like Apple’s wallpapers! The good news is wallpapers work on any phone, so you can use these as Android wallpapers, too!\nASUS\nASUS has both subtle and very dramatic-looking handsets. The same can be said about their relative wallpapers.\nGoogle Android wallpapers\nWe also have a list of the best Pixel wallpapers, just in case you want to take a look at them before downloading. Also, be sure to grab Google’s 25th Anniversary wallpapers if you love the pen doodle aesthetic.\nHUAWEI\nMicrosoft\nMotorola\nNokia\nnubia\nOnePlus\nOPPO\nPOCO\nRazer Android wallpapers\nRazer only released a couple of phones: the Razer Phone and Razer Phone 2. Both were pretty good, but the gaming giant has moved away from the mobile market. They kept all their wallpapers available for you to download straight from the official website, though! These are very fun wallpapers, especially if you’re into the gaming aesthetics the brand is so well-known for.\nSamsung\n- Samsung Galaxy A14\n- Samsung Galaxy A15\n- Samsung Galaxy A34\n- Samsung Galaxy A35\n- Samsung Galaxy A36\n- Samsung Galaxy A54\n- Samsung Galaxy A55\n- Samsung Galaxy A56\n- Samsung Galaxy A73\n- Samsung Galaxy S10\n- Samsung Galaxy S20\n- Samsung Galaxy S21\n- Samsung Galaxy S21 FE\n- Samsung Galaxy S22\n- Samsung Galaxy S23\n- Samsung Galaxy S24\n- Samsung Galaxy S25\n- Samsung Galaxy S25 Edge\n- Samsung Galaxy Fold\n- Samsung Galaxy Z Fold 2\n- Samsung Galaxy Z Fold 3\n- Samsung Galaxy Z Fold 4\n- Samsung Galaxy Z Fold 5\n- Samsung Galaxy Z Fold 6\n- Samsung Galaxy Z Fold 7\n- Samsung Galaxy Z Flip\n- Samsung Galaxy Z Flip 5G\n- Samsung Galaxy Z Flip 3\n- Samsung Galaxy Z Flip 4\n- Samsung Galaxy Z Flip 5\n- Samsung Galaxy Z Flip 6\n- Samsung Galaxy Z Flip 7\n- Samsung Galaxy Z Flip 7 FE\n- Samsung Galaxy Note 10\n- Samsung Galaxy Note 10 Star Wars Edition\n- Samsung Galaxy Note 20\n- Samsung Galaxy Tab S8\n- Samsung Galaxy Tab S9\n- Samsung Galaxy Tab S9 FE\n- Samsung Galaxy Tab S10\n- Samsung Galaxy Tab S10 FE\nWe also have a list of the best Samsung wallpapers, just in case you need to check them out before downloading.\nSony\nXiaomi\nZTE\nWhich of these will you be using? There are plenty of options for every taste here!\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/nothing-cmf-phone-1-review-3502896/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nNothing's CMF Phone 1 is a fun, bold budget phone but it has one big drawback for folks like me\nDecember 20, 2024\nNothing CMF Phone 1\nMSRP: $199.99\nWhat we like\nWhat we don't like\nNothing CMF Phone 1\nEver since features like replaceable batteries disappeared from smartphones, we’ve been begging for someone to bring them back. Some have tried, like the LG G5 with its Friends modules or the Fairphone 5 with its ten interchangeable parts, but neither made a lasting impact. Now, a new device has entered the modular market: Nothing’s budget-friendly CMF Phone 1.\nOn the surface, it seems like a no-brainer — pack a budget Android phone with some decent specs and make it stand out with interchangeable back panels and accessories like a kickstand. In practice, the CMF Phone 1 doesn’t make life so easy, at least not for someone like me in the US. It’s a phone I’d love to recommend to absolutely anyone looking for a fantastic budget phone for less than $200, but there are some things you need to know before picking one up.\nGo-go gadget, smartphone\nRight out of the box, the CMF Phone 1 looks and feels like something new — especially in the Light Green or Orange finish. It has a certain industrial flair to it with four screws around the edges and Nothing’s classic dot-based branding on the back panel. In some ways, I think the CMF Phone 1 reminds me of the ill-fated Rabbit R1, but in a much more practical, modular sense than that of the aforementioned square, overcomplicated AI companion.\nUnlike some of Nothing’s other designs, where the industrial inspiration is there for aesthetics, the CMF Phone 1’s screws have a purpose. Yes, they unscrew so you can take the budget-focused device apart — well, partly apart. It’s not quite as exciting as a truly replaceable battery, but the CMF Phone 1’s four removable screws allow you to remove and replace the back panel to change the color of your device as well as add an optional vegan leather case to it. You’ll, of course, also have to remove the button-shaped Accessory Point in the bottom right corner and the SIM tray on the bottom edge, but those extra pieces allow you to mix and match colors to make your Phone 1 even more unique.\nThe CMF Phone 1 pairs an industrial design with interchangeable parts, and I love the idea of it.\nIf nothing else, this is what I love about the Phone 1 — I can make it different every day. In addition to those alternative backs I mentioned, you can also pick up practical attachments like a kickstand, a lanyard, and even a card holder to replace your wallet. All three of them attach in the bottom right corner of the Phone 1, which means you can use them — possibly even more than one of them — in addition to whatever back plate you’ve chosen for the day. It really is a neat setup, and it gives Nothing’s most affordable phone a way to stand out from most of its budget-minded competition.\nHowever, there’s a problem with the CMF Phone 1 if you’re not an international buyer: It’s practically impossible to get any of the accessories here in the US. Yes, technically, the phone is only available stateside as part of a beta program (which we’ll get back to later), but that doesn’t mean it should be available at all if you can’t take advantage of one of its key selling points. Oh, and the phone comes without an NFC chip — something I never thought I’d have to say again after Motorola finally added one to its Moto G lineup.\nRight now, the best someone stateside like me can do is look at the splash page for the CMF Phone 1 over at Nothing.tech, see that it has an interchangeable design, and, well, that’s it. You can’t reach a product page to grab a different case, the card holder, or anything else without a very quick 404 error. Users abroad might have a bit better luck — I was able to view the entire selection of accessories on Nothing’s UK site — but it doesn’t give me a great feeling about the state of the beta program in the US.\nIf you can get your hands on the accessories, you’ll find they are a little tricky to swap in and out. I realize that Nothing’s choice of flat-head screws for its CMF Phone 1 was probably done with durability in mind (I guess?), but I’ve yet to swap a single screw without the included screwdriver slipping out of the groove about half a dozen times. Once I got all the screws out so I could change the black plastic back panel, I had to spend another ten minutes or so trying to wrestle the piece itself off the phone — not ideal. Also, the card holder attachment uses different screws altogether, trading the flat heads for small orange knobs that you have to tighten by hand.\nAnd then, there’s Nothing’s choice of materials. Unsurprisingly, given the affordable and replaceable nature of the Phone 1’s parts, almost everything about it is made of plastic. Granted, the frame and the interchangeable accessories are fairly stiff plastic, but it’s plastic nonetheless. That means if you drop it onto a concrete sidewalk while cheering at the Philadelphia Marathon — even one covered in leaves — you’ll probably come up with some damage. Ask me how I know.\nNormally, I’d brush off that damage, knowing that it happens, but it has more of a snowball effect on the CMF Phone 1. I, unfortunately, dropped my phone at such an angle that the plastic protecting the display and the frame itself pushed into each other a bit, making it harder to remove the black backing I have attached and replace it with a different color now that it doesn’t sit perfectly. Thankfully, though, the 6.67-inch Gorilla Glass 5 display escaped unscathed. And no, putting the CMF Phone 1 in a case probably wouldn’t have helped, as any case I used would have blocked me from using the accessories.\nWhether you spring for the CMF Phone 1’s fun accessories or not, you’re still getting the light, clean Nothing OS experience, which is worth the price of entry on its own. It’s just as much a piece of the design as the accessories themselves, offering the right mix of dot-based widgets and accents while skipping the bloatware that usually bogs down affordable phones. Of course, the black and white dots might not be for everyone — they’re occasionally hard to differentiate at a glance — but I can’t help loving the personality. It’s almost as much fun to swap the widgets and fonts in and out as it is to treat the CMF Phone 1 like a hi-tech Erector set, especially when so many other flavors of Android feel very similar.\nGood performance, but strict limitations\nWhile I’ve come away from my time with the CMF Phone 1 a bit less impressed by its accessories (and their lack of availability), its hardware under the hood somewhat won me over. Like Nothing’s other launches, it packs a mid-level MediaTek Dimensity chipset inside its plastic shell, this time backed by 6GB of RAM and 128GB of expandable storage at the base configuration — yet another feature that’s largely disappeared from modern flagship phones.\nIf you need a little more punch, you can grab the Phone 1 with up to 8GB of RAM and 256GB of storage, which might be enough that you don’t have to worry about said microSD slot. Either way, you’ll be backing the Dimensity 7300 chipset, which sounds close to the Dimensity 7200 Pro that Nothing used for both versions of its Phone 2a. Those phones, of course, offer a bit more than the CMF Phone 1 in terms of clock speed and optional RAM — not to mention price — so I was curious to see how Nothing’s new budget offering would keep up.\nMore realistically, though, I was curious to see how the Phone 1 would fare against similarly priced competition like Motorola’s Moto G 5G (2024) and Samsung’s Galaxy A15 5G, so I set it up for our standard gauntlet of CPU and GPU benchmarks. Unsurprisingly, the CMF Phone 1 had no problems outpacing its budget foes, breezing past offerings from Motorola and Samsung with ease. It stayed ahead of the respective Snapdragon 4 Gen 1 and Dimensity 6100 Plus processors in our main CPU test and put in a good shift against the Nothing Phone 2a, coming out on top with higher multi-core performance even if it didn’t keep up on the single-core front.\nThe CMF Phone 1 also thumped its affordable Android rivals when I fired up the graphically intensive 3DMark stress tests, nearly tripling the output of both the Moto G 5G (2024) and Galaxy A15 5G. Better yet, it stayed rock-solid across all 20 runs of the test, suggesting that even if the CMF Phone 1 doesn’t stack up like a top-end gaming phone, it should still deliver decent performance in lighter titles and should be able to maintain its level for a while rather than tailing off after a few minutes.\nIn real life, though, the CMF Phone 1 feels even better against most of the budget-focused Android market. Its punchy (for the price tag) chipset is paired with a huge 6.67-inch, 120Hz AMOLED display that’s brighter and sharper than Motorola’s LCD and Samsung’s own 90Hz AMOLED option. While I couldn’t use the CMF Phone 1 away from Wi-Fi (for reasons I’ll get to), it handled my needs as a lightweight gaming phone for Pokemon TCG Pocket and Royal Match just fine. I also used it as my portable soccer studio over Thanksgiving, setting up Paramount Plus to keep up with the Europa League games while the rest of my family stuck to American football, glad to have the Full HD resolution while picking out players during Roma’s last-minute draw against Tottenham.\nMediaTek's Dimension 7300 more than holds its own against affordable US-based chipsets.\nFor the most part, that lightweight reliance on Wi-Fi meant that the CMF Phone 1’s 5,000mAh battery could last me several days between charges. It wasn’t constantly hunting for reliable mobile service (because it wasn’t going to get it), so the passive battery drain was minimal. Of course, to find out how the Phone 1 would handle sustained usage, I put it through our trusty drain test and found that it could once again keep up with the Nothing Phone 2a. Actually, the CMF Phone 1 beat its light-up sibling in quite a few of our use cases, from the simulated Zoom call to repeated camera snaps, and both Nothing devices lasted hours longer than the Galaxy A15 5G and Moto G 5G across most use cases.\nNow that it’s beaten similarly priced options from Motorola and Samsung in several places, it’s time to see how the CMF Phone 1 performs on a charger. On paper, the answer should be simple — Nothing’s budget option claims that it supports up to 33W wired charging to get you back on your feet. That should be enough to beat the Moto G 5G by nearly 15W and the Galaxy A15 by about 8W at top speeds.\nIn practice, though, the performance isn’t nearly as close as the numbers suggest. I set the CMF Phone 1 up on my trusty Ugreen Nexode Pro — one of the best chargers I’ve used — and found that even though it spent most of its time at around 27W, it was able to finish charging a full 20 minutes faster than the Galaxy A15 5G and thumped the Moto G 5G by about 40 minutes. Based on the graph, it looks like the CMF Phone 1 was able to maintain its peak charging speed for far longer than its competitors, holding pace for about 40 minutes before tailing off.\nUnfortunately, it’s time to talk about the interchangeable elephant in the room — Nothing’s poor US band support. Just like with the Phone 2a and 2a Plus, Nothing is upfront about the fact that the CMF Phone 1 is primarily available as part of a beta program. What that means, though, is that it has almost none of the bands needed for customers on Verizon and AT&T to use the phone effectively. T-Mobile customers are a little luckier, as the Phone 1 covers parts of the 3G, 4G, and 5G spectrum, but once again doesn’t support the entire set of bands needed.\nAs a Verizon customer, that limited support turned my CMF Phone 1 into a fancy, customizable iPod Touch. I could use it while connected to Wi-Fi and stream downloaded music to a pair of CMF Buds Pro 2 that Nothing also sent over (which are quite good — check out our review from sister site SoundGuys at the link), but it meant that the Phone 1 couldn’t bail me out if my Pixel 9 Pro died while away from a charger. So, unless you’re a T-Mobile customer in a well-supported area of the US, you will have a tough time with this one.\nIf you’re outside of the US, though, the CMF Phone 1 has the performance chops (and band support) to compete with Android phones both at and slightly above its price point.\nIs one decent camera enough?\nMoving on to yet another area where cheaper phones tend to struggle, it’s time to talk about the CMF Phone 1’s budget cameras — er, camera. Yes, I know that there are technically two sensors on the back of this plastic beast, but we only really have to dig into one because the other is a lowly 2MP depth sensor with a maximum aperture of f/2.4. It only provides additional data and light for its more capable partner, so let’s turn our focus (pun intended) to that slightly more useful sensor.\nNothing's 50MP camera is decent at its default zoom, but not very good otherwise.\nSaid primary sensor is a 50MP that comes from Sony and packs the CMF Phone 1 with a portrait-ready maximum aperture of f/1.8. Nothing is a little light on the other details about its primary camera, at least regarding sensor size and specific branding, though it does tout Ultra XDR support and AI Vivid modes thanks to its Truelens Engine 2.0. Unsurprisingly, there is not much else to say about the Phone 1’s basic camera setup, so let’s get to a few sample images.\nTypically, when I put together a gallery of sample images for a phone, I’m only looking for the best ones. I usually snap away for the entire time I have a device and come away with plenty of shots I like. This time, though, I missed more shots than I hit — especially in low light. As much as I’m pleased with the look at the rainforest section of the Baltimore Aquarium after dark, I’m thoroughly disappointed by the shot of the musician in the bottom row, which was taken no more than five minutes earlier. I thought I held pretty still while snapping it, yet the text on the wall behind him is blurred, as is a bit of his hair.\nFor the most part, though, those misses are balanced out by the neat colors in the wider view of the main aquarium tank and the view of Independence Hall. Both show decent details throughout, with the shot of Independence Hall looking particularly crisp. The portrait mode shot of Ben Franklin isn’t bad either, as it accurately identifies the edges of his colonial suit and hair. Of course, the lesson here is that you can get some pretty good views out of the CMF Phone 1 as long as you’re willing to be a little bit patient — something that’s true of most budget phones.\nUnfortunately, the CMF Phone 1’s larger camera struggles come when you try to zoom. The lack of an ultrawide camera or a telephoto sensor means that the quality drops off quickly once you move away from 1x zoom. Nothing’s lone sensor tops out at 10x zoom, which seems a bit too far, given the way that the shot of the sailboat and the seagull above turned out. Everything about the shot of the boat is a bit blurry, making it challenging to tell where the top of the ship ends and the dock begins. Granted, the seagull is a little better — you can at least pick out the bricks in the background —but the bird itself looks closer to gray than mostly white. If you’re willing to stick between about 1x and 4x zoom, though, Nothing’s lone sensor can hold its own in good lighting.\nSurprisingly, the best camera on the CMF Phone 1 might be its 16MP selfie shooter. It’s not going to give the sensors on the Pixel 9 or iPhone 16 a run for their money, but it handled the colors and textures in my sweatshirt nicely, with only slight ghosting around the white lettering. I’m decently impressed by how it picked out the edges of my hair, too, as some cheap Android phones tend to cut curls off both sides of my head.\nFor video recording, the CMF Phone 1 supports quality up to 4K resolution at 30 frames per second or 1080p at up to 60fps, both of which are fine for this price tier. Nothing’s electronic image stabilization is decent, though you’ll have to stay at 1x zoom, as anything further has the same quality struggle as the still images above.\nCMF Phone 1 review verdict: A bold, fun budget phone, but not one for the US\nAt the end of the day, I really, really like the idea behind the CMF Phone 1, especially at its very competitive price point. I enjoy swapping the accessories in and out and knowing that the hardware screws will keep them locked securely in place. I also appreciate the power the Dimensity 7300 brings to the table, especially against other budget phones. Nothing’s 33W wired charging setup is good, too, getting the CMF Phone 1 back on its feet quickly compared to affordable Android phones from Samsung and Motorola. Nothing OS is also an incredibly trendy, lean skin, too, which is a breath of fresh air when so many cheaper phones are stacked with bloatware.\nThere are some budget phone concessions you have to deal with, though. Its lone 50MP camera has the potential to be really good, but you have to keep it incredibly stable in low light. Once you get comfortable with some of the camera quirks like that, though, you might find that one camera is all you need. I’ve nicked Nothing’s plastic frame by dropping the Phone 1 on a bed of leaves, and the plastic back is hard enough to swap out that I’m having trouble hiding my unhappy accident. Two years of Android updates and a third year of security patches doesn’t quite match the Galaxy A15 5G in terms of long-term support, but it is acceptable for a phone at this price tier in the US.\nThe CMF Phone 1 is a clever idea and a great budget phone for international buyers, but I hope Nothing starts to treat the US as more than a beta testing ground.\nThat, of course, brings me back to the kicker for the CMF Phone 1 — it’s simply a non-starter here in the US. You can buy it as part of the same beta program that covers Nothing’s Phone 2a (£319.99 at Amazon) and Nothing 2a Plus ($417.5 at Amazon), but it’s hard to find proper support. The limited band setup means you’ll only have access to part of T-Mobile’s network, with radio silence coming from both Verizon and AT&T. Oh, and since you can’t buy Nothing’s colorful accessories stateside, you’re essentially buying a budget phone with half of its intended experience.\nThe rest of the world is getting a fun little phone for an excellent price, but as much as I like the idea of the CMF Phone 1, if you’re in the US like me, I think I’ll have to steer you in another direction. Thankfully, the current state of the budget Android market stateside means that’s pretty easy to do anyway, which hasn’t always been the case. Depending on your budget, there are plenty of affordable Samsung Galaxy A devices to look at or Motorola Moto G options to consider, you’ll just have to decide what matters to you.\nPersonally, though, I think the Galaxy A15 5G ($178.66 at Amazon) is probably the best alternative, both for its longer software support and far more flexible triple camera setup. Yes, the CMF Phone 1 beats it from top to bottom in terms of performance, battery life, and charging, but sometimes, the best phone is the one you can use most readily. Samsung’s offering also has NFC support, unlike the Phone 1.\nShould you decide to go Motorola, the Moto G 5G (2024) ($179.99 at Amazon) is the closest alternative. It’s set up somewhere between the other two, pairing a pretty good 50MP primary camera with a 2MP macro sensor that constantly leaves me scratching my head. It’s nicely dressed up with a vegan leather back panel in an eye-catching Sage finish, though, which is nice. Motorola’s option is also the only one of the three to rock an LCD panel, but it’s easily the most affordable of the bunch in case you’re trying to live on a tight budget.\nOne day, when Nothing finally offers wider US distribution, I’ll happily recommend the CMF Phone 1 (and the Phone 2a or 2a Plus) for budget Android fans over here, but we’re just not quite there yet. For everyone else, this one is a steal.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/author/ritaelkhoury/",
      "text": "Rita El Khoury\nRita is a seasoned tech journalist based in Paris who lives and breathes all things Android. She started writing about smartphones in 2007, and it’s been a love affair ever since. From Symbian to Windows Mobile, Blackberry OS, and iOS, Rita has seen it all, but Android’s versatility won her over from the moment she flashed her first custom ROM on her HTC Desire Z. She has spent over a decade testing and writing about Android ROMs, apps, games, and services, as well as covering and breaking the latest Android news, first for Android Police and later at Android Authority.\nWhen she’s not busy attending product launches and trade shows like CES, MWC, and IFA, or guest-appearing on various tech podcasts, Rita can be found using the latest phones, wearables, smart home products, and other random gadgets. She is renowned for her expert opinions shared on Android Authority via reviews, commentaries, and experiential features. As Senior Features Editor, she also works with a team of writers to help them craft creative content, share their experiences with the latest smartphones and gadgets, and compare and contrast devices and services.\nRita’s current gadget lineup includes the latest and greatest from Google — a Pixel 9 Pro XL, Pixel Buds Pro 2, Pixel Watch 3, and Pixel Tablet. She uses an Apple M1 iMac for work and an M3 MacBook on the go. She also loves to kick back and relax with some rock music and Eurovision songs on her Nest Audio speakers, plan her next travel adventure on her iPad Mini 2024, or catch a Real Madrid game on her Google TV Streamer.\nOtherwise, she’ll be chilling in her home, enjoying her Hue bulbs, Roborock vacuums (there are three of them!), Ajax security system, and Tado thermostat. There’s a Home Assistant project lurking in the background, too.\nIf you ever meet her, don’t be shy to say Hi, Hola, Bonjour, or Marhaba!"
    },
    {
      "url": "https://www.androidauthority.com/author/zackewdenniss/",
      "text": "Zac Kew-Denniss\nZac fell in love with Android when he bought his first smartphone, a Samsung Galaxy S2, back in 2012. What started then as posting his findings in Android betas on Google+ and getting sourced by various sites, including The Verge, quickly turned into a job. Zac has been a tech journalist for five years, joining Android Police in 2020 before moving to Android Authority at the end of 2024. While Zac focuses on Samsung hardware and software, he loves Android in general and has experience with Google and Motorola devices. Outside of phones, Zac has written about and reviewed power banks, headphones and earbuds, and phone cases.\nWhen he isn’t writing about tech, you’ll find him rewatching Transformers One for the billionth time, listening to Fall Out Boy, or replaying the same RPG on his Steam Deck, PS5, or custom gaming PC. Zac is also a car and photography fan, often combining those interests by venturing to car shows and snapping photos of as many JDMs as possible. Zac is based in the UK, so don’t be surprised if he slips a few correctly pronounced “aluminiums” into his work."
    },
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nANBERNIC just put its best screen on a more budget-friendly device\nThis screen on an affordable handheld might be a winning combination.\nNick Fernandez\nWallpaper Wednesday: More great phone wallpapers for all to share (September 3)\nC. Scott Brown53 minutes ago\n0\nGoogle Wallet's exceptional Everything Else feature is rolling out more widely\nTushar Mehta2 hours ago\n0\nLast-minute leak spoils Samsung's Galaxy Tab S11 surprise\nAman Kumar3 hours ago\n0\nPolar's new minimalist fitness band is a subscription-free alternative to Whoop\nThe device tracks heart rate, activity, sleep, and recovery and syncs data to the Polar Flow app.\nKaitlyn Cimino\nNot using a Pixel or Galaxy? The wait for stable Android 16 just got longer\nAamir Siddiqui4 hours ago\n0\nAcer just revealed a stupidly powerful Chromebook convertible\nHadlee Simons4 hours ago\n0\nLatest Galaxy tri-fold rumor says the wait might be longer than we thought\nTushar Mehta5 hours ago\n0\nOur latest\nIs ChatGPT not working for you? Here's how you can try to fix it\nCalvin Wankhede5 hours ago\n0\nBattery sizes on flagship phones are about to explode\nHadlee Simons7 hours ago\n0\nTurns out it's possible to get a Pixel 10 with a physical SIM slot in the US\nAdamya Sharma7 hours ago\n0\nGoogle sets the date for Gemini's arrival on your Google Home devices\nAdamya Sharma10 hours ago\n0\nNo more Prime shipping perks outside your family (Updated: Amazon statement)\nMatt Horne10 hours ago\n0\nThe already-affordable TCL 60 XE NXTPAPER gets $70 cheaper\nEdgar Cervantes11 hours ago\n0\nDeal: Google TV Streamer drops to $79.99, almost its record-low price\nEdgar Cervantes13 hours ago\n0\nThe Ampace Andes 1500 is $800 off, and it is my go-to power station!\nEdgar Cervantes15 hours ago\n0\nNotebookLM can now argue with itself over your notes\nMatt Horne15 hours ago\n0\nCourt rules Google can keep Chrome and Android, but it’s not off the hook entirely\nMatt Horne16 hours ago\n0\nHere's your first look at the Google Play Games profiles revamp (APK teardown)\nMatt Horne18 hours ago\n0\nGoogle is changing how Extra Dim works on the Pixel 10, and it's so much better\nMishaal Rahman20 hours ago\n0"
    }
  ],
  "argos_summary": "",
  "argos_id": "5ZSGVQ2YG"
}