{
  "url": "https://www.zerohedge.com/market-recaps/futures-rebound-google-jumps-court-ruling-bond-selloff-fades",
  "authorsByline": "Tyler Durden",
  "articleId": "7b5f98807a5b443f8266d46a141f8aa5",
  "source": {
    "domain": "zerohedge.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-09/trader%20looking%2091%20from%20the%20back%20with%20large%20monitors.jpg?itok=oOJtwXoN",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T08:36:42-04:00",
  "addDate": "2025-09-03T12:44:22.181130+00:00",
  "refreshDate": "2025-09-03T12:44:22.181134+00:00",
  "score": 1.0,
  "title": "Futures Rebound As Google Jumps On Court Ruling, Bond Selloff Fades",
  "description": "Futures Rebound As Google Jumps On Court Ruling, Bond Selloff Fades\n\n            US equity futures are higher following a two-day slide, led by Tec...",
  "content": "Futures Rebound As Google Jumps On Court Ruling, Bond Selloff Fades\n\n            US equity futures are higher following a two-day slide, led by Tech with a favorable court ruling boosting GOOG (+5.7% pre-mkt) and lifting the Mag7 group. As of 8:00am ET S&P futures are up 0.5%, recovering most of yesterday's losses; while Nasdaq 100 futs add 0.7%. In premarket trading, Mag7 names are all higher with AAPL (+2.9%) and TSLA (+1.7%) the notable standouts alongside GOOG. Cyclicals are poised to outperform as the yield curve bear steepens. In Europe, the Estoxx 50 is up by almost 1%, led by info tech and industrials sectors. Longer duration bonds are seeing a global sell-off (30Y JGBs +7bp, 30Y Gilts +6bp) while US is outperforming (30Y +2bp); underperformance is driven by global budget concerns (these come and go), which have sent gold is higher for the 7th consecutive session, adding ~5% in that time.  USD is weaker and commodities are mixed. WTI crude futures fall 1.7% to near $64.50 after a report said that OPEC+ is considering another supply boost for October at this weekend’s meeting. Today’s data focus is on JOLTS, Durable/Cap Goods, Beige Book, and consumer-sector earnings to gain clarity on the consumer.\n\n\n\nIn premarket trading, Alphabet (GOOGL) shares are up 5% after a US antitrust ruling was not as severe as feared. Google will be required to share online search data with rivals while avoiding harsher penalties, including the forced sale of its Chrome business. Apple (AAPL) rises 4% after a US judge stopped short of barring the iPhone maker’s lucrative search arrangement with Google. All other Mag 7 stocks are also higher (Tesla +1.5%, Nvidia +0.4%, Meta +0.8%, Amazon +0.03%, Microsoft unch).\n\nDollar Tree Inc. (DLTR) falls 4% after the retailer’s 2Q report underwhelmed Wall Street.\n\tHealthEquity (HQY), which administers health savings accounts, rises 4% after posting 2Q profit that beat the average analyst estimate and raised its fiscal year outlook.\n\tMacy’s Inc. (M) climbs 13% after raising its annual outlook and reporting its best comparable sales growth in 12 quarters, the latest signs that consumers are still spending despite concerns about inflation and tariffs.\n\tZscaler (ZS) is up 1.8% after the software company reported fourth-quarter results that beat expectations and gave a revenue forecast that is seen as strong.\nStocks were boosted as the selloff in government debt lost momentum as well. The yield on 30-year Treasuries came within touching distance of 5% before erasing the advance. UK gilts and euro-area bonds rebounded. Japan’s 20-year debt yields hit the highest since 1999 earlier in the day. The recent fragility of bond markets has underscored the strain from heavy public spending, which demands ever-rising issuance. That uncertainty is spilling into equities, where traders grapple with stretched valuations after a record rally, alongside persistent concerns over monetary policy and inflation. \n\nMeanwhile, the bond market is pouring gasoline on the fire: the week has so far seen more than $116 billion of bond sales by governments and companies. The figure includes a record $57.7 billion of issuance in Europe on Tuesday.\n\n“Yesterday was the largest issuance day on record in Europe as a whole,” wrote Fred Repton, a senior fund manager at Neuberger Berman. “One should not draw too many conclusions from one extremely active day. What can be said though is that market participants are again focused on deficits and political risk, and this theme is likely to continue.”\n\nAfter Fed Chair Jerome Powell last month signaled the central bank’s support for a softening jobs markets, Wednesday’s JOLTS data is likely to indicate more labor-market cooling. Further ahead, Friday’s nonfarm payrolls report is expected to show a fourth straight month of sub-100,000 job growth, the weakest stretch since the onset of the pandemic in 2020. Swaps currently imply around a 90% chance of a quarter-point Fed rate cut later this month, with three more similar moves expected by June.\n\n“We don’t see yields rising much further than their current levels,” said Roland Kaloyan, head of equity strategy at Societe Generale SA. “That being said, this bond selloff means that there will be an even greater focus on Friday’s US job data and their impact on the Fed’s easing policy.”\n\nIn Europe, the Stoxx 600 is up 0.7% as investors welcomed a calmer day in the European government bond market. European stocks rebound after bonds globally sold off Tuesday on worries about fiscal deficits in developed markets. Adidas rises after the sportswear group was upgraded to buy at Jefferies. Here are some of the biggest movers on Wednesday:\n\nAdidas shares rise as much as 3.8% on an upgrade to buy from hold at Jefferies following its “brutal” de-rating, while JPMorgan places the German company on a positive catalyst watch.\n\tPVA TePla rises as much as 10% after the German semiconductor firm surprised analysts with details on growth opportunities.\n\tAshtead rises as much as 3.2%, to the highest since January, following the equipment rental specialist’s first-quarter results.\n\tAMG shares rise as much as 9.4% as Citi lifts its price target on the Dutch specialty chemicals firm to a Street high, saying earnings tailwinds are likely to continue.\n\tViridien rises as much as 15% after Bernstein upgraded the earth and data science company to outperform from market perform.\n\tDerichebourg shares plunge as much as 19% as Portzamparc downgrades the French group after it cut its 2025 guidance, citing a late and challenging trade deal with the US.\n\tHilton Food falls as much as 19% after reporting first-half results that analysts describe as “mixed.”\n\tM&G falls by as much as 3.8%, the most since April, as the UK asset manager’s first-half adjusted operating profit misses analyst forecasts.\n\tSwiss Life shares fall as much as 3.9% after the financial services provider reported first-half results, with fees missing analyst estimates.\n\tLufthansa shares slide 3.3% after the airline launched an offering of unsecured and unsubordinated convertible bonds due 2032 in an aggregate principal amount of €600 million with a denomination of €100,000 each, according to a statement.\n\tContinental shares fall as much as 0.9% after Bernstein downgraded the car parts manufacturer to underperform, saying the value unlocked from the upcoming spinoff is now fully priced in and flagging risk to promised margin expansion.\nEarlier in the session, Asian shares headed for a second day of declines, weighed by those in Japan due to domestic political uncertainty and weakness in regional chip-making stocks. The MSCI Asia Pacific Index slid as much as 1%, the most in about a week. Japanese shares, which make up around 30% of the index, were a big drag as the Nikkei 225 Index fell 0.9%%. Australian equities also dropped after growth data reinforced the case for the central bank to keep interest rates unchanged. Investor sentiment soured in Japan after Prime Minister Shigeru Ishiba’s key power broker announced his intention to resign.  Asian chip stocks were under pressure after the US revoked Taiwan Semiconductor Manufacturing Co.’s authorization to freely ship essential gear to its main Chinese chipmaking base. TSMC fell as much as 1.3% before erasing the loss. Elsewhere in the region, Thai stocks rose after the country’s largest political party said it will back conservative politician Anutin Charnvirakul’s bid to form a government following last week’s sacking of Paetongtarn Shinawatra as prime minister for ethics violations.\n\nIn rates, treasuries are slightly lower, with US 30-year yields up 1 bp at 4.96% having come within a whisker of 5% earlier while European bonds stabilize following Tuesday’s global government bond selloff. UK gilts erased an earlier fall to trade higher on the day, pushing UK 30-year yields down 2 bps to 5.67%. German long-end yields also dip. US yields are 2bp-3bp cheaper on the day with 5s30s flatter by around 1bp as long-end marginally outperforms. 10-year is near 4.285% with bunds and gilts in the sector outperforming by around 3.5bp\n\nIn FX, the Bloomberg Dollar Spot Index is down 0.1%. The pound and euro add 0.2% each against the greenback. Spot gold rises $5.\n\nIn commodities, WTI crude futures fall 1.7% to near $64.50 after a report said that OPEC+ is considering another supply boost for October at this weekend’s meeting. Gold’s latest record came as growing expectations for US interest-rate cuts bolstered the metal’s appeal, while the drop in bonds and equities has strengthened its haven status. Bullion climbed as much as 0.5% to close in on $3,550 an ounce.\n\nUS economic data slate includes July JOLTS job openings and factory orders (10am). Fed speaker slate includes Musalem at 9am, and Fed releases Beige Book at 2pm\n\nMarket Snapshot\n\nS&P 500 mini +0.4%\n\tNasdaq 100 mini +0.6%\n\tRussell 2000 mini -0.2%\n\tStoxx Europe 600 +0.6%\n\tDAX +0.6%\n\tCAC 40 +1%\n\t10-year Treasury yield +3 basis points at 4.29%\n\tVIX -0.2 points at 16.99\n\tBloomberg Dollar Index little changed at 1206.71\n\teuro +0.1% at $1.1656\n\tWTI crude -0.6% at $65.22/barrel\nTop Overnight News\n\nAmerican companies are once again beating profit expectations, but this time around they aren’t banking on blockbuster consumer spending to make it happen. Instead, the latest batch of quarterly earnings are getting a lift from managers who are squeezing out costs, boosting productivity and turning to new technologies. WSJ\n\tTreasury Secretary Scott Bessent is planning to start a blitz of interviews on Friday in search of a candidate to be the next chair of the Federal Reserve, according to people familiar with the matter. The interview process would continue next week. There are 11 contenders, including Kevin Hassett, Kevin Warsh, and Fed governors Christopher Waller and Michelle Bowman. WSJ\n\tUS admin officials reportedly want to fund federal agencies until the first quarter of 2026: \"This would avoid repeated shutdown deadline dramas. Yet it also opens the door to a year-long continuing resolution”: Punchbowl\n\tHoliday spending by US consumers is set to tumble 5.3% Y/Y, the steepest decline since the pandemic. RTRS\n\tFTC commissioner Rebecca Kelly Slaughter reinstated to her role by an appeals court decision after being fired by Trump, a decision that could have implications for the White House’s Fed fight. NYT\n\tThe September rise in long-end yields is partly driven by heavy corporate issuance, Pimco said. Natixis warned that a rate cut amid high inflation risks steepening the curve. BBG\n\tXi Jinping showcased China’s military and diplomatic clout at a parade with Russia’s Vladimir Putin and North Korea’s Kim Jong Un — their first joint public appearance. Xi vowed to build a “world-class military” to ensure China stands “self-reliant and strong.” BBG\n\tChina’s services activity expanded at the fastest pace in over a year in August, a private survey showed, driven by increased tourism. BBG\n\tAustralia’s GDP growth advanced 0.6% in the second quarter, beating forecasts and bolstering the case for the RBA to hold rates. BBG\n\tAlphabet shares jumped premarket after a judge ruled Google can retain control of Chrome though it must share some search data with rivals. Apple also rose as it will continue receiving more than $20 billion a year for default search rights. GOOGL +6.48% premkt, AAPL +3.4% premkt. BBG\nCorporate News\n\nGoogle avoided a breakup after a US judge ruled against the government’s most onerous proposals, including a forced sale of its Chrome browser, another court victory for Big Tech in the biggest antitrust case in three decades.\n\tThe US has revoked Taiwan Semiconductor Manufacturing Co.’s authorization to freely ship essential gear to its main Chinese chipmaking base, potentially curtailing its production capabilities at that older-generation facility. TSMC shares retreated in Taiwan.\n\tBlackRock Inc. has lost a mandate worth €14.5 billion ($17 billion) with one of the largest pension funds in the Netherlands, amid concerns the world’s biggest money manager isn’t acting in the best interests of clients when it comes to climate risk.\n\tMacy’s Inc. raised its annual outlook and reported its best comparable sales growth in three years, the latest signs that consumers are still spending despite concerns about inflation and tariffs.\n\tBeach Point Capital Management hired Joshua Baumgarten, a credit veteran who previously worked at TPG Angelo Gordon and Blackstone Inc., as its president and chief investment officer.\n\tJane Street Group LLC filed an appeal in an India court, alleging that the country’s securities regulator denied it access to crucial documents needed for its defense against market manipulation accusations.\n\tSales at Cracker Barrel Old Country Store Inc. took a hit from the political firestorm that emerged after the chain updated its logo, underscoring the real-life business impact of social media outrage fanned by the president.\nTrade/Tariffs\n\nJapanese Trade Negotiator Akazawa is reportedly arranging a visit to the US between September 4th-6th, according to Yomiuri. To travel to the US from Thursday through Saturday, according to the government.\nA more detailed look at global markets courtesy of Newsquawk\n\nAPAC stocks were predominantly lower following the weak handover from Wall St, where the major indices declined on return from the extended weekend as sentiment was dampened by global debt concerns amid a higher yield environment. ASX 200 retreated with the declines led by underperformance in tech, utilities and financials, while slightly stronger-than-expected Australian GDP data failed to inspire. Nikkei 225 was pressured amid a higher global yield environment but with the downside initially cushioned by recent currency weakness. Hang Seng and Shanghai Comp gradually fell despite the better-than-expected RatingDog Services PMI data from China and with the attention in Beijing on the military parade, which was attended by Russian President Putin and North Korean Leader Kim, while US President Trump reacted in a post and accused them of conspiring against the US.\n\nTop Asian News\n\nJapanese ruling party LDP's Aso is set to call for an early party election, according to Mainichi.\n\tBoJ Governor Ueda said he exchanged views with PM Ishiba on the economy and financial markets, while they had discussions on various topics about the economy and talked about forex. Ueda said it was a regular meeting to exchange views on the economy and financial markets and there is no change to their stance of raising interest rates if the economy and prices move in line with the forecast.\n\tJapan's budget requests from government agencies for next FY total JPY 122.45tln, according to the MoF.\n\tRBA Governor Bullock says the RBA is actively exploring the implications of emerging technologies, particularly AI, and how they can support its mission.\nEuropean bourses (STOXX 600 +0.5%) opened in the green and have held an upward bias throughout the morning. Sentiment which is seemingly driven by a paring of the significant pressure seen on Tuesday, and as Google received a favourable judge ruling. European sectors hold a slight positive bias, following on from a poor session on Tuesday. Tech takes the top spot, paring back some of the underperformance seen in the prior session as Google (+5.8% pre-market) helps to lift the mood within the sector (see US section for details). Consumer Products follows closely behind, with the Luxury sector building on the prior day’s gains, this time following a positive trading update from Watches of Switzerland (+7.6%). The Co. confirmed strong sales, affirmed its guidance and highlighted that it does not expect to be materially impacted by US tariffs in H1’26.\n\nTop European News\n\nEU court backs US data pact, avoiding fresh privacy fight\n\tECB’s next move could be to cut or hike rates, Dolenc says\n\tGermany’s services sector unexpectedly contracted in August\n\tBayrou open to alternative budget plan if deficit target remains\n\tRachel reeves to deliver crunch UK budget on November 26\n\tUK Chancellor Reeves says need to bring inflation and borrowing costs down; says economy is not broken.\n\tFrench Finance Minister Lombard urged for a compromise on the 2026 Budget and said the deficit reduction plan will inevitably be less ambitious if the government falls, while he is confident France will accomplish its GDP growth forecast of 0.6% this year and said they are on track to reduce the deficit from 5.8% in 2024 to 5.4% in 2025, according to FT.\n\tEU court backs EU and US data transfer deal affecting thousands of firms.\nFX\n\nDXY was initially a little firmer but is now trading on the backfoot and towards session lows. Traders are mindful of ongoing tariff-related updates with President Trump stating that his administration will be going to the Supreme Court today to appeal the judgement from the US appeals court that most of his tariffs are illegal. Given the other routes available to Trump, desks remain sceptical that an unfavourable Supreme Court judgement would have any material sway on the administration's approach to trade policy. Focus will today also be on the data slate with JOLTS job openings due on deck ahead of ADP tomorrow and NFP on Friday. DXY currently near lows in a 98.20 to 98.63 range.\n\tEUR is slightly firmer with incremental macro drivers for the Eurozone lacking. Final Eurozone PMI metrics passed with little in the way of fanfare with the August composite PMI metric revised a touch lower to 51.0 from 51.1. The accompanying report noted that \"Yes, the economy has been growing since the start of the year, but the pace is painfully slow\". One risk on the horizon for the Eurozone comes via French political tensions as markets brace for the September 8th confidence vote in PM Bayrou. Expectations are firmly in favour of him losing the vote. EUR/USD delved as low as 1.1609 before staging a recovery.\n\tJPY remains on the backfoot and unable to catch a break vs. the USD. Yesterday's softness was largely pinned on a lack of commitment from BoJ Deputy Governor Himino in backing further policy tightening, alongside increased domestic political risk. On which, the latest reports suggest that Japanese ruling party LDP's Aso is set to call for an early party election, according to Mainichi. On trade, Japanese Trade Negotiator Akazawa is reportedly arranging a visit to the US between September 4th-6th, according to Yomiuri. USD/JPY briefly moved back above its 200DMA at 148.83 and took out the 149 level with a session peak at 149.13 before retreating.\n\tAfter a wobble in early European trade, GBP has managed to recoup losses. Back-end UK yields remain higher as fiscal angst continues to grip the market narrative. Markets now have a date for the Autumn Budget with the Treasury opting for November 26th; somewhat later than what many had been expecting. On monetary policy, focus today will be on BoE's Bailey, Lombardelli, Greene and Taylor all due to appear before the TSC. Likely areas of focus will be on how the Bank looks to navigate the pathway between an expected slowdown in growth and stubborn inflation. An upward revision to the August services and composite PMIs failed to provide additional support for GBP. GBP/USD hit a multi-week low at 1.3334 before recovering to levels just above 1.34.\n\tAUD is a touch more resilient than most peers with the currency underpinned by a better-than-expected outturn for Q2 Australian GDP (Q/Q 0.6% vs. Exp. 0.5%). AUD/USD sits in close proximity to its 50DMA at 0.6519 and around the mid-point of Tuesday's 0.6483-0.6558 range.\nFixed Income\n\nA softer start to the day for Bunds, continuing the price action seen on Tuesday but holding above Tuesday's 128.68 low. Thereafter, a bout of pressure to a 128.63 trough, with downside of c. 15 ticks occurring amid a volume spike just after the cash equity open and the morning’s first PMI. The Spanish Services figure came in shy of consensus, though internal commentary was strong. Though this was short-lived. Thereafter, Germany was revised lower into contractionary territory, which helped to lift Bunds marginally back into the green and to a 129.00 high. No real move to a German 2035 auction, which saw a same-as-prior b/c, but higher avg. yield.\n\tOATs are gaining to a similar degree as German paper. The main update has been an interview with Finance Minister Lombard to the FT, the Minister outlined that the toppling of PM Bayrou next week (looks all but certain, currently) would require fresh concessions to be made to the left in order to secure support for the fiscal package. A package that is currently targeting a deficit cut of EUR 44bln. The Bund-OAT 10yr yield spread remains steady around the 80bps mark.\n\tGilts began on the backfoot today, but recent price action has been upwards, following European peers. Confirmation this morning that the Treasury will unveil the Autumn Budget on November 26th, confirming a Huffington Post scoop. Price action this morning began with a continuation of Tuesday’s sell off, Gilts as low as 89.36, 24 ticks below Tuesday’s base. However, the magnitude of this has waned in-fitting with the upticks discussed in EGBs, and most recently UK paper has climbed incrementally into the green. As for yields, thus far a 4.86% high for the 10yr, eyeing January's 4.925% peak, and 5.75% for the 30yr. Ahead, the BoE appears before the TSC to discuss the last policy announcement (subject to two rounds of voting, resulting in a 25bps cut).\n\tUSTs are directionally in-fitting with peers but with action contained to a thin 112-00 to 112-08+ band thus far. USTs await Fed speak Musalem and Kashkari, remarks that are intersected by a handful of data points headlined by JOLTS.\n\tGermany sells EUR 3.81bln vs exp. EUR 5bln 2.60% 2035 Bund: b/c 1.4x (prev. 1.4x), average yield 2.77% (prev. 2.69%), retention 23.8% (prev. 22.3%).\nCommodities\n\nSofter trade in the crude complex this morning after whipsawing yesterday amid a stronger dollar and with the US imposing sanctions targeting Iranian oil. Newsflow for the complex has been quiet, although traders are keeping tabs on developments in the east, with focus overnight on the Chinese military parade - but more so the presence of Russian President Putin and North Korean leader Kim alongside Chinese President Xi. The complex then took a significant leg lower on Reuters source reports that OPEC+ is mulling another oil production hike at Sunday's meeting - this is in contrast to expectations that the OPEC-8 would hold production. WTI fell from USD 65.17/bbl to USD 64.33/bbl before paring around half of the move in the minutes since. At the same time, Brent slipped from USD 68.73/bbl to USD 67.89/bbl.\n\tMixed trade across precious metals in narrow parameters. Spot gold holds a mild upward bias but printed fresh record near the USD 3,550/oz level overnight despite recent dollar strength. Spot gold resides in a USD 3,526.54-3,547.33/oz range at the time of writing, with the next upside level the USD 3,550/oz mark.\n\tUpward tilt across base metals with prices supported by a stable dollar and with sentiment also net-positive. 3M LME copper breached USD 10k/t to the upside and resides in a USD 9,935.80-10,038.13/t range at the time of writing.\n\tWorld Gold Council said to launch a digital form of gold, according to FT.\n\tOPEC+ reportedly mulling another oil production hike at Sunday meeting, according to Reuters source; final decision not made yet\nGeopolitics: Russia-Ukraine\n\nUkraine's military said Russia launched an air attack on Kyiv and it was also reported that all of Ukraine was under air raid alerts following Ukrainian air force warnings of Russian missile and drone attacks, while Poland scrambled aircraft to ensure airspace security after Russia launched strikes on Ukraine.\n\tRussian Foreign Minister Lavrov said Moscow expects Russia-Ukraine talks to continue and he stated that the heads of delegations are in direct contact. Lavrov said Russia expects statements from its partners in support of dialogue with the US on Ukraine, while he added that for a lasting peace in Ukraine, territorial realities must be recognised. Lavrov also said that India did not bow to US demands to stop purchasing resources from Russia, which Moscow appreciates, as well as noted the US is making active diplomatic efforts on Ukraine and that Putin–Trump contacts are substantive. Furthermore, he said a new system of security guarantees for Russia and Ukraine must be formed and that Moscow calls for ensuring a neutral, non-bloc and non-nuclear status of Ukraine, according to RIA and TASS.\n\tRussian Foreign Ministry spokeswoman said Kyiv and its allies reject the possibility of compromises on settlement of conflicts, according to RIA.\n\tRussia and the US are in the process of coordinating on dates and the venue of the next round of talks, according to RIA.\nGeopolitics: Middle East\n\n\"[Israeli] Finance Minister Smotrich seeks to impose sovereignty over 82% of the West Bank\", according to Al Jazeera.\nGeopolitics: Other\n\nChinese President Xi said at the military parade in Beijing that China is a great nation that fears no violence and is self-reliant and strong, while he added the Chinese people stand on the right side of history and are committed to peace. Xi also said the world is facing a choice of peace or war now and he called on nations to prevent historical tragedies from recurring.\n\tUS President Trump posted on Truth Social \"The big question to be answered is whether or not President Xi of China will mention the massive amount of support and “blood” that The United States of America gave to China in order to help it to secure its FREEDOM from a very unfriendly foreign invader. Many Americans died in China’s quest for Victory and Glory. I hope that they are rightfully Honored and Remembered for their Bravery and Sacrifice! May President Xi and the wonderful people of China have a great and lasting day of celebration. Please give my warmest regards to Vladimir Putin, and Kim Jong Un, as you conspire against The United States of America. PRESIDENT DONALD J. TRUMP”.\nUS Event Calendar\n\n5:00 am: Aug Wards Total Vehicle Sales, est. 16.1m, prior 16.41m\n\t7:00 am: Aug 29 MBA Mortgage Applications, prior -0.5%\n\t10:00 am: Jul JOLTS Job Openings, est. 7381.5k, prior 7437k\n\t10:00 am: Jul Factory Orders, est. -1.3%, prior -4.8%\n\t10:00 am: Jul F Durable Goods Orders, est. -2.8%, prior -2.8%\n\t10:00 am: Jul F Durables Ex Transportation, est. 1.1%, prior 1.1%\n\t10:00 am: Jul F Cap Goods Orders Nondef Ex Air, est. 1.1%, prior 1.1%\n\t10:00 am: Jul F Cap Goods Ship Nondef Ex Air, prior 0.7%\nCentral Banks \n\n9:00 am: Fed’s Musalem Speaks on Economy and Policy at Peterson\n\t2:00 pm: Fed Releases Beige Book\nDB's Jim Reid concludes the overnight wrap\n\nLast night we published a new presentation pack, Back to work… until Xmas. Since it has become almost de rigueur to reach for the ‘back-to-school’ analogy, we’ve chosen instead to highlight the joy of returning to work - though with the daunting reality of no holiday break until Christmas. In the pack, we outline five themes we believe will shape the remainder of 2025: whether AI and US equities are in a bubble; the pros and cons of Fed rate cuts; the path for US Treasuries if the Fed is indeed cutting; the state of play five months on from Liberation Day (April 2); and the situation after 225 days of Trump 2.0.\n\nThese themes felt immediately relevant yesterday as global markets fully reopened for the first main day of trading after the holiday season. Fixed income markets led the moves, with a major bond sell-off that pushed 30-year UK gilt yields to their highest since May 1998, while French OATs hit levels last seen in 2009. The pressure was not confined to Europe, with US Treasuries also selling off—10s and 30s both rising sharply, the latter again testing 5% before closing just under at 4.96%. We’re at 4.985% again in Asia as I type. At the same time, gold extended Monday’s record, rising +1.64% to surpass $3,500 for the first time, as its role as a hedge against inflation and fiscal concerns remains firmly in play.\n\nEquities struggled across the board. The S&P 500 fell -0.69%, with the Nasdaq (-0.82%) and the Mag-7 (-1.08%) down by more, as tech underperformed. The S&P did partially recover after trading -1.5% lower intra-day but it was still a broadly weak day with more than three-quarters of its constituents losing ground. Nvidia (-1.95%) and Amazon (-1.60%) were among the key laggards, reigniting investor concerns over AI-linked valuations as US markets returned from the long Labor Day weekend. The risk-off tone was even sharper in Europe, where most indices lost over a percent, led by the DAX with a -2.29% drop as IT (-3.12%) and Industrials (-3.05%) weighed heavily.\n\nConcerns around Fed independence also contributed to the bond market moves. A second court hearing began yesterday on whether President Trump can be temporarily barred from dismissing Fed Governor Lisa Cook, though Bloomberg reporting suggests that there likely won’t be a ruling before the end of the week. Earlier, nearly 600 economists signed an open letter in Cook’s defence, while FHFA Director Bill Pulte kept up accusations of mortgage fraud. Meanwhile, Treasury Secretary Scott Bessent confirmed the search for Powell’s successor as Fed Chair is already underway, with the WSJ reporting that he plans to start interviews on Friday. In comments to Reuters, he stressed that the Fed “should remain independent,” though he was quick to add that it has also “made a lot of mistakes.”\n\nIn the UK, 30yr gilt yields rose +5.2bps to 5.69%, their highest since May 1998, a month when pop group Aqua had a number one single that wasn’t “Barbie Girl”. A prize if you remember what it was without looking. The gilt move underscored the fiscal challenges Chancellor Reeves faces ahead of the autumn budget. The government must fill a £20–25bn gap by November, and sterling fell more than 1% against the dollar as those risks came into sharper focus. See our economist Sanjay Raja’s latest thoughts on all things UK related here.\n\nIn France, 30yr OAT yields rose +4.9bps to 4.49%, the highest since 2009, amid rising expectations of another government collapse next week. Our economists see the French deficit running at 5.6–5.8% of GDP in 2025, above the official 5.4% target, further adding to concerns around debt sustainability.\n\nData offered a mixed picture. In the US, the August ISM manufacturing survey showed a modest improvement, rising to 48.7 from 48.0, though still below the 49.0 expected. New orders beat expectations (51.4 vs 48.0 expected and 47.1 previously). However, the employment index remained subdued (43.8 vs 45.0 expected and 43.4 previously) and prices paid fell from 64.8 to a 6-month low of 63.7, which helped yields reverse from the day’s intra-day highs. Although we have JOLTS today, attention will increasingly shift to Friday’s payrolls, where our economists expect headline and private payroll growth of around 100k, up from the prior month, with unemployment steady at 4.2%—though there is a risk it rounds down to 4.1%. All eyes on the revisions after last month’s shock.\n\nIn Europe, core flash inflation surprised slightly to the upside, at 2.3% YoY (vs. 2.2%), while headline was in line with expectations at 2.1%. Services inflation eased a touch from 3.2% to 3.1%, but the stickiness in core goods kept pressure on yields and reinforced our economists view that we have likely reached the ECB’s terminal rate. Among ECB speakers, the more dovish Simkus suggested in an interview that a rate cut may be in play in October or December, but Isabel Schnabel said “ I do not see a reason for a further rate cut” and indicated that renewed rate hikes “may come earlier than many people currently think”. The amount of ECB rate cuts priced by next June is now down to a cycle low of 15bps.\n\nGeopolitics also crept back onto the radar, with reports that Russia and the US are preparing for a new round of consultations. Meanwhile, in Turkiye, the BIST 100 fell -3.57% after a court removed Ozgur Celik, the newly elected CHP leader.\n\nAsian equity markets are following the global trend and are lower this morning. Across the region, the S&P/ASX 200 (-1.62%) is leading losses as RBA rate cut prospects dimmed following upbeat GDP data (details below). Additionally, the Nikkei (-0.79%), the Hang Seng (-0.40%), the CSI (-0.88%) and the Shanghai Composite (-0.96%) are also trading notably lower. US equity futures are creeping higher though, with the S&P 500 +0.10% higher, while the NASDAQ is outperforming (+0.26%) after Google spiked by more than 7% after-hours following a court decision that it won’t have to sell its Chrome browser.\n\nComing back to Australia, the economy expanded +1.8% y/y (v/s +1.6% expected) in the second quarter of the year, marking the fastest pace of growth since September 2023 and higher than the revised +1.4% growth seen in the previous quarter with the growth largely led by household consumption. Following the data, the Australian Dollar reversed opening losses and is trading flat against the dollar as I type while the yield on the policy sensitive 3yr government bonds have jumped +9.1bps, extended an earlier gain to hit 3.541%, the highest level in seven weeks.\n\nElsewhere, yields on Japan’s longer maturity JGBs continue to be at multi-decade highs, following the global selloff in bonds and political uncertainty in the nation. Yields on 20-year government bonds are +3.1bps to trade at 2.667%, a level last seen in 1999 while those on the 30-year are +4.1bps to 3.26%, its highest since its debut in 1999.\n\nLooking ahead, today brings the US JOLTS report, factory orders, and August vehicle sales. In Europe, we’ll get Italy’s services PMI and Eurozone PPI, while Canada releases Q2 labour productivity. Central banks are also busy: the Fed’s Beige Book is due, with remarks from Musalem, Lagarde, Bailey, and several other BoE speakers. On the earnings side, highlights include Salesforce, HPE, Gitlab and Dollar Tree.\n\n      Tyler Durden\nWed, 09/03/2025 - 08:36",
  "medium": "Article",
  "links": [
    "https://www.zerohedge.com/s3/files/inline-images/ES%202025-09-03_8-15-41.jpg?itok=Sgbv2JOE"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US markets",
      "weight": 0.057095084
    },
    {
      "name": "US yields",
      "weight": 0.057085868
    },
    {
      "name": "US equities",
      "weight": 0.052534394
    },
    {
      "name": "US President Trump",
      "weight": 0.052287802
    },
    {
      "name": "US data pact",
      "weight": 0.051493414
    },
    {
      "name": "US equity futures",
      "weight": 0.05105466
    },
    {
      "name": "US consumers",
      "weight": 0.049789216
    },
    {
      "name": "US",
      "weight": 0.0490903
    },
    {
      "name": "US economic data slate",
      "weight": 0.048886266
    },
    {
      "name": "US tariffs",
      "weight": 0.048757344
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.88330078125
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.6318359375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.5087890625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.3349609375
    }
  ],
  "sentiment": {
    "positive": 0.7545306,
    "negative": 0.13580935,
    "neutral": 0.10966002
  },
  "summary": "US equity futures have risen following a two-day slide, with a favorable court ruling boosting Google (GOOG) and lifting the Mag7 group. S&P futures are up 0.5%, recovering most of yesterday's losses, while Nasdaq 100 futs added 0.7%. In Europe, the Estoxx 50 is up by almost 1%, led by info tech and industrials sectors. Longer duration bonds are seeing a global sell-off, while the US is outperforming due to global budget concerns. Meanwhile, the bond market has seen over $116 billion of bond sales so far, including a record $57.7 billion in Europe. The Fed's support for softening jobs markets is likely to indicate more moves expected by June, with three more expected by the next month.",
  "shortSummary": "Futures rose as Google's shares rose 5% following a US court ruling, calming bond markets amid rising political and economic concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2050651ba9a64b74a8ac8bb9d58cf9e5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "US equity futures bounce after a two‑day slide, driven by a favorable court ruling that lifted Google and the Mag‑7, pushing S&P futures 0.5% and Nasdaq 0.7% higher. Global bond sell‑off eases, with US 30‑year yields up 2bp while European and Japanese long‑dated bonds fall; gold gains its seventh straight session and WTI falls 1.7% amid OPEC+ supply‑boost speculation. Cyclicals are positioned to outperform as the yield curve steepens, and the Fed is expected to cut rates later this month, with JOLTS and the Beige Book as key catalysts.",
  "argos_id": "7ZSVHRORC"
}