{
  "url": "https://www.businessinsider.com/nvidia-stock-price-trading-strategy-buy-signal-short-ratio-nvda-2025-9",
  "authorsByline": "William Edwards",
  "articleId": "f08ccc601a8a463f8f122f8dce495614",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b72dfd194a2d49b8af9133?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:40:55+00:00",
  "addDate": "2025-09-03T12:48:34.789613+00:00",
  "refreshDate": "2025-09-03T12:48:34.789614+00:00",
  "score": 1.0,
  "title": "Watch for this signal in Nvidia stock to capitalize on spring-loaded gains ahead",
  "description": "S3 Partners shares a \"powerful short-to-intermediate-term tool\" for trading Nvidia stock.",
  "content": "It's been a volatile year for shares of Nvidia, with the stock plunging 31% to start the year before rallying 84% since April lows.Sam Pierson, the director of research at S3 Partners, has found a fairly reliable way to capitalize on that volatility. Or rather, a metric to watch within the stock that serves as a signal for outsized gains ahead.It's called the long-to-short ratio, and it's calculated by taking a stock's active long interest and dividing it by short interest. In new research published Tuesday, Pierson found that following notable increases in the ratio, Nvidia's share price has typically surged over the following few months.More specifically, when the ratio climbs to 1.5 standard deviations above its six-month moving average, it's gone up 11% over the following month. That's nearly double the usual average monthly gain of 6%. For the subsequent three-month period, following the signal, Nvidia has returned 28%, versus 19% normally.The stock saw gains 86% of the time in the month following a reading above the 1.5-standard-deviation threshold. When the stock saw rare losses during those periods, it only fell by an average of 1%.These findings led Pierson to call the ratio a \"powerful short-to-intermediate-term tool,\" as it seems to lose its ability to predict returns beyond six months.Here's a chart showing the returns. Periods when the long-to-short ratio is at least at 1.5 are shaded orange. Nvidia's stock returns are shown in the black line. Right now, the measure is below the 1.5 standard-deviation threshold as the ratio of long positions to short positions has fallen in recent weeks to 15.4.The model has continued to be effective so far this year.\"In 2025 year-to-date, the LTS extreme signal has remained effective: across 46 threshold days, NVDA delivered an average +7% forward 1M return with a 76% win rate, compared with just +5% on all days, with a 54% win rate,\" Pierson wrote.He added: \"In 2025, periods of Long-to-Short crowding in NVIDIA have coincided with roughly double the baseline 1-month forward return.\"Nvidia stock has had a rough 10 days after it warned of slowing growth ahead during its quarterly earnings call last week. Since August 26, the stock is down 6.5%.The stock remains a favorite among investors. Brokerage platform Interactive Brokers said Nvidia was the most bought stock over the last five trading days with 234,628 buy orders.\"Our customers are certainly a faithful bunch. #1 NVDA brought immense success to many of them, and they are clearly not willing to abandon that name even if some poorly received earnings get in the way,\" said Steve Sosnick, chief strategist at Interactive Brokers, in an email.He continued: \"It was not only the most active stock on our platform, displacing #3 PLTR, last week's surprise leader, but also representing just under 1/3 of all the net purchasing activity among the stocks in this table.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nvidia stock",
      "weight": 0.11620524
    },
    {
      "name": "\"Nvidia stock",
      "weight": 0.09805628
    },
    {
      "name": "short positions",
      "weight": 0.07565502
    },
    {
      "name": "short interest",
      "weight": 0.07240469
    },
    {
      "name": "Nvidia",
      "weight": 0.07166969
    },
    {
      "name": "last week",
      "weight": 0.07121853
    },
    {
      "name": "long positions",
      "weight": 0.069906004
    },
    {
      "name": "Nvidias stock returns",
      "weight": 0.06937916
    },
    {
      "name": "Brokerage platform Interactive Brokers",
      "weight": 0.06575815
    },
    {
      "name": "Sam Pierson",
      "weight": 0.06144275
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.947265625
    },
    {
      "name": "/News/Technology News",
      "score": 0.458251953125
    }
  ],
  "sentiment": {
    "positive": 0.29190472,
    "negative": 0.3804484,
    "neutral": 0.32764688
  },
  "summary": "The long-to-short ratio, a metric that indicates a potential for outsized gains ahead of shares of Nvidia, has been found to be a reliable predictor of significant increases in the stock's share price. This ratio, calculated by combining active long interest with short interest, typically increases in this ratio. When the ratio climbs to 1.5 standard deviations above its six-month moving average, the stock typically rises by 11% over the following month, nearly double the usual average monthly gain of 6%. For the subsequent three-month period following the signal, Nvidia returned 28%, versus 19% normally. However, the ratio is currently below the 1.05 standard-deviation threshold and has been effective so far this year. Despite warnings of slowing growth ahead during its quarterly earnings call, Nvidia remains popular among investors.",
  "shortSummary": "Nvidia's volatile year has been marked by a reliable long-to-short ratio indicator, which can predict significant gains in the future despite recent losses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e070083deb17481ca2e56a50e0f56a3d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "S3 Partners’ research shows that Nvidia’s long‑to‑short ratio can signal short‑term upside: when the ratio rises 1.5 standard deviations above its six‑month moving average, the stock typically gains about 11% in the following month and 28% over three months, with a 76% win rate. The metric has remained effective into 2025, delivering an average +7% one‑month return versus +5% on average for all days. Despite a recent earnings‑driven dip, Nvidia continues to be heavily traded and viewed positively by investors.",
  "argos_id": "811KDZZJ2"
}