{
  "url": "https://www.pymnts.com/news/investment-tracker/2025/sofi-debuts-etf-to-target-companies-focused-on-ai/",
  "authorsByline": "PYMNTS",
  "articleId": "e152f8a6c8e94eb99cec41c66a04e9e1",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/04/SoFi-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T16:54:50+00:00",
  "addDate": "2025-09-03T17:10:42.502795+00:00",
  "refreshDate": "2025-09-03T17:10:42.502796+00:00",
  "score": 1.0,
  "title": "SoFi Debuts ETF to Target Companies Focused on AI",
  "description": "Digital finance app SoFi has introduced its SoFi Agentic AI exchange-traded fund (ETF). The ETF, dubbed AGIQ, will invest in American companies that are",
  "content": "By completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe ETF, dubbed AGIQ, will invest in American companies that are part of the BITA US Agentic AI Select Index, SoFi announced Wednesday (Sept. 3).\n\n“Emerging market themes can be challenging to capture, especially for new or casual investors—but with the SoFi Agentic AI ETF, investors can easily tap into the next evolution of AI,” Brian Walsh, head of advice and planning director at SoFi, said in a news release.\n\nAccording to the release, the BITA US Agentic AI Select Index tracks businesses engaged in developing, providing, or utilizing agentic artificial intelligence (AI) technologies, and includes companies like Salesforce, Tesla and Nvidia, though holdings are subject to change.\n\nMore broadly, the index monitors companies involved in developing things like self-driving transportation, AI scheduling assistants, cybersecurity networks, autonomous industrial machinery, or with enabling technologies such as semiconductors and cloud computing.\n\n“The emergence of agentic AI—autonomous systems capable of making decisions, initiating actions and collaborating with other agents or humans—is marking a paradigm shift for its potential to drive real-world productivity gains across sectors,” SoFi said in a news release.\n\nThe release cited data from the World Economic Forum projecting that the market for agentic AI will “expand significantly” by the end of the decade.\n\nAnd by 2035, PYMNTS wrote earlier this week, the corporate world could witness the rise of the “AI treasurer,” personified by an artificial intelligence avatar.\n\nEven a well-staffed human team, that report said, has its limitations, while things like “spreadsheets and enterprise systems” can only do so much.\n\n“This is where agentic AI treasury systems could enter,” PYMNTS wrote. “Rather than functioning as silent engines behind a dashboard, next-generation AI treasurers may appear as interactive, explainable agents. They can tell a CFO why a swap was executed, walk through alternative scenarios, and even adjust tone and detail depending on the audience, whether it’s a risk committee or a junior analyst. The once-invisible treasury function suddenly becomes a visible, conversational partner.”\n\nAs for the avatar, the report argued that while it may call to mind a cartoonish image, it’s less about theatrics and more about fostering human trust.\n\n“Avatars serve as the interface for increasingly complex decision-making systems. When an algorithm moves $200 million across jurisdictions, executives want to know not only what happened but why,” PYMNTS wrote. “A face, realistic or stylized, can become a conduit for explainability.”",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/study_posts/payments-execs-say-ai-agents-give-payments-an-autonomous-overhaul/",
    "https://www.nvidia.com/en-us/",
    "https://www.salesforce.com/",
    "https://www.pymnts.com/news/b2b-payments/2025/agentic-ai-puts-a-face-on-corporate-treasurys-next-leap/",
    "https://www.pymnts.com/news/artificial-intelligence/2025/agentic-ai-turns-enterprise-cybersecurity-into-machine-battle/",
    "https://www.tesla.com/",
    "https://www.businesswire.com/news/home/20250903671023/en/SoFi-Announces-the-Agentic-AI-ETF-Providing-Access-to-Next-Wave-of-AI",
    "https://www.pymnts.com/tag/agentic-ai/",
    "https://www.linkedin.com/in/brianmwalsh/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "agentic AI",
      "weight": 0.09757314
    },
    {
      "name": "AI",
      "weight": 0.0879122
    },
    {
      "name": "AI scheduling assistants",
      "weight": 0.08516502
    },
    {
      "name": "agentic AI treasury systems",
      "weight": 0.072898984
    },
    {
      "name": "autonomous systems",
      "weight": 0.06482715
    },
    {
      "name": "the BITA US Agentic AI Select Index",
      "weight": 0.0630961
    },
    {
      "name": "PYMNTS",
      "weight": 0.061810587
    },
    {
      "name": "the SoFi Agentic AI ETF",
      "weight": 0.061127946
    },
    {
      "name": "American companies",
      "weight": 0.060923792
    },
    {
      "name": "enterprise systems",
      "weight": 0.05960459
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98095703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.90869140625
    },
    {
      "name": "/Finance/Investing/Funds",
      "score": 0.8642578125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.455078125
    }
  ],
  "sentiment": {
    "positive": 0.30338398,
    "negative": 0.12871201,
    "neutral": 0.567904
  },
  "summary": "SoFi has launched anETF, AGIQ, which will invest in American companies that are part of the BITA US Agentic AI Select Index. The index includes companies like Salesforce, Tesla, and Nvidia. SoFi's Brian Walsh, head of advice and planning director at SoFi, stated that investors can easily tap into the next evolution of AI. The World Economic Forum predicts that the market for agentic AI will expand significantly by the end of the decade. The report by PYMNTS suggested that by 2035, corporate AI treasurers could become more transparent and more engaging agents who can help in understanding complex decisions.",
  "shortSummary": "SoFi launched an ETF, dubbed AGIQ, targeting companies developing agentic AI technologies, focusing on interactive, context-aware AI, with potential for significant market growth and integration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cb2a52aa619244faa50b72e1f5f51117",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nvidia.com/en-us/",
      "text": "October 27–29 | Walter E. Convention Center\nThe NVIDIA CEO will take the stage to explore the latest in AI. Reserve your spot with early-bird pricing now.\nDisney, Foxconn, Hitachi Ltd., Hyundai Motor Group, Lilly, SAP, and TSMC among first to deploy NVIDIA RTX PRO Servers to speed AI reasoning, physical AI, and business workloads.\nAutomotive\nNVIDIA DRIVE AGX Thor Developer Kit available for pre-order.\nData Center\nDon’t miss the live keynote by Ian Buck, VP of hyperscale and high-performance computing, as he shares what’s next for AI.\nSeptember 9 | 10 a.m. PT\nThe new NVIDIA® Jetson Thor™ is now available.\nNVIDIA experts detail how NVIDIA Blackwell, CUDA, NVLink, and Spectrum-X accelerate AI inference.\nSee Jensen Huang's Keynote at GTC Washington, D.C.\nIndustry Leaders Transform Data Centers With NVIDIA RTX PRO Servers\nRedefining the Future of Autonomous Vehicle Development\nNVIDIA at AI Infra Summit\nThe Ultimate Platform for Physical AI and Humanoid Robotics\nHot Topics at Hot Chips: Inference, Networking, and AI Innovation\nExplore over 70 expert-lead sessions, live demos, and hands-on workshops. Join us October 27–29 in Washington, D.C., including NVIDIA CEO Jensen Huang’s keynote on October 28. Register With Early-Bird Pricing\nDeci was acquired by NVIDIA Corporation of Santa Clara, CA in May 2024 and was dissolved as a separate corporate entity. For legacy support content please refer to the following: Deci AI Documentation"
    },
    {
      "url": "https://www.salesforce.com/",
      "text": "Dreamforce: Anmäl dig idag och spara $400\nVäx snabbare och\narbeta smartare\nBörja enkelt med Starter Suite, ett allt-i-ett-CRM för småföretag. Skala sedan oändligt med autonoma AI-agenter, enhetlig data och CRM-appar tillsammans på en integrerad plattform samt få kontakt med kunderna på ett helt nytt sätt.\nSkapa en obegränsad arbetsstyrka, med Agentforce\nSkapa en digital arbetskraft som arbetar sida vid sida med er mänskliga arbetskraft. AI-agenter arbetar dygnet runt, vidtar åtgärder och ger support till anställda och kunder. Frigör dina anställda att vara mer produktiva, så att de kan fokusera på viktigare saker.\nBörja enkelt. Skala oändligt\nSe resultat på dag ett med Starter Suite\nVår allt-i-ett-lösning för småföretag, Starter Suite, samlar försäljnings-, service- och marknadsföringsverktyg i en enda, lättanvänd app. Du behöver inte installera något. Ange bara dina uppgifter och sätt igång, direkt i webbläsaren. 250kr SEK/Användar/Månad Se fullständig prissättning\nSamla in och spåra kunddata från valfri källa. Håll ditt team på rätt spår med inbyggda affärsfaser. Få rekommenderade nästa steg för att flytta affärer längs processen.\nAnvänd AI för att skapa segment, utarbeta en kampanjbrief, bygga kampanjen och skriva ett e-postmeddelande – allt på bara några minuter.\nFörena alla era supportkanaler i en enda, delad vy. Dirigera ärenden till den bästa agenten eller teknikern för jobbet, prioritera och avsluta fler ärenden.\nFå en realtidsvy över din verksamhet med anpassade instrumentpaneler. Få förinstallerad data för att börja prognostisera från dag ett och skräddarsy den sedan till din verksamhet över tid.\nFortsätt växa med världens främsta AI CRM\nAgentforce\nSkapa och anpassa autonoma AI-agenter som kan hjälpa dina anställda och kunder dygnet runt.\nSmåföretag\nHjälper småföretag att sälja smartare och ge snabbare support i en enda app.\nSales\nKoppla samman team, avsluta fler affärer och förenkla din säljprocess.\nService\nTa hand om supportärenden snabbare i alla kanaler.\nMarketing\nBygg, personifiera och optimera enkelt kampanjer och kundresor.\nCommerce\nFånga kundernas intresse på nätet och i butiken med B2C och B2B.\nArtificiell intelligens\nGe prediktiva och generativa AI-upplevelser till alla arbetsflöden, användare, avdelningar eller branscher.\nData Cloud\nSamla alla din data för att möjliggöra personligt engagemang i stor skala.\nSalesforce Platform\nKoppla samman dina team och data med appar byggda med klick, inte kod.\nSlack\nTillför alla team samma produktivitet som agenter i ett och samma system.\nTableau\nFå användbara insikter från alla data när som helst och var som helst.\nMuleSoft\nAnslut valfri app, data eller enhet – i molnet eller lokalt.\nHeroku\nBygg skalbara appar på en molnbaserad plattform gjord för utvecklare.\nFramgång och tjänster\nMaximera din avkastning på investeringen med självbetjäningsresurser och pålitlig vägledning från våra CRM-, AI- och dataexperter.\nHitta rätt lösning för ditt företag – oavsett storlek, oavsett bransch\nFinancial Services\nLås upp den mest värdefulla valutan: kundförtroende.\nDetaljhandel\nFå lönsamma kunder snabbare med enhetliga data i realtid.\nSjukvård och biovetenskap\nBygg starkare patient- och medlemsrelationer på en uppkopplad plattform.\nKonstruktion och fastigheter\nStrömlinjeforma processer och uppnå operativ excellens för att driva lönsamhet och tillväxt.\nProfessionella tjänster\nÖka kundernas förtroende, rekrytera och behålla rätt talang och bygg en levande arbetskultur.\nTillverkning\nIntegrera alla din data över en enhetlig värdekedja för att bättre betjäna kunder och kanalpartners.\nVad är Salesforce?\nSalesforce sammanför alla dina data, från vilken källa som helst, så att du kan agera utifrån den med betrodd AI och automatisering, allt på en integrerad CRM- plattform. Det gör det enkelt att hitta fler potentiella kunder, avsluta fler affärer och få kontakt med kunder på ett helt nytt sätt. Så det är inte konstigt att Salesforce utsågs till världens främsta CRM 11 år i rad.\nLåt oss göra det här enkelt\nKom igång snabbt\nKom igång med Starter Suite, allt-i-ett-CRM-appen för marknadsföring, försäljning och service.\nDu behöver inte installera något. Ange bara dina uppgifter så är du redo att sätta igång, direkt i din webbläsare.\nSynkronisera din e-post och kalender med några få klick. Du samlar automatiskt in och synkroniserar all din data med Salesforce och använder CRM-funktioner direkt där du arbetar.\nImportera kalkylblad och anslut till datakällor som Google. Guider i appen säkerställer att du har importerad ren data på några minuter.\nSömlös integrering\nSalesforce samarbetar med tusentals partnerappar och certifierade konsulter för att hjälpa dig att utöka Salesforce och öka produktiviteten. Alla är lätta att upptäcka på AppExchange, den ledande marknadsplatsen för företagsmoln och hemvist för över 9 000 lösningar. Behöver du ansluta externa system? Vi har allt du behöver med MuleSoft, vår API-plattform.\nLös problem snabbt\nDin framgång är vår högsta prioritet. Oavsett vilken lösning du väljer, kommer den med kostnadsfri endagsbiljetthantering och Salesforce-aviseringsövervakning, direkt ur lådan. Behöver du mer stöd? Vi har en mängd olika Success Plans och Professionella tjänster som erbjuder resurser, expertvägledning och den tekniska support du behöver för att få ut det mesta av Salesforce.\nIngår i alla produktlicenser:\nLär dig allt eftersom du växer\nNär du är redo att komma igång med Salesforce har vi alla möjliga typer av människor och gratis resurser för att hjälpa dina team att snabbt komma igång. Och vi finns alltid här för dig med mer utbildning och support allt eftersom du fortsätter att växa med Salesforce.\nSe hur våra kunder arbetar smartare, driver automatisering och ökar intäkterna\nFöretag runt om i världen ser häpnadsväckande resultat med Salesforce. Det kan du också.\nInter ökar avkastningen på investeringen genom att anpassa varje bankupplevelse."
    },
    {
      "url": "https://www.pymnts.com/study_posts/payments-execs-say-ai-agents-give-payments-an-autonomous-overhaul/",
      "text": "The latest wave of artificial intelligence (AI) isn’t about better chatbots or faster content generation. It’s about delegation. The emergence of agentic AI is the story of an innovation moving beyond just automation. These secret AI agents are being built into autonomous software workers capable of making decisions, executing tasks and collaborating in ways that were once the exclusive domain of humans.\nAnd in financial services, payments and B2B commerce, the utilization of agentic AI is already underway.\nThe depth of insights from recent conversations with payments industry leaders for the “What’s Next In Payments: Secret Agents” series reveals four defining themes foundational to how the marketplace is thinking about the impact of agentic AI applications across payments:\nThe AI agents are here. They don’t sleep. They don’t get tired. And, increasingly, they don’t need to be told what to do next when it comes to solving real-world business problems.\nThe only question left is whether companies are ready to hire them.\nAI Agents Are Autonomous Operators, Not Just Tech Tools\nAcross sectors, AI is evolving from passive support (e.g., content generation, search) into autonomous agents that execute complex workflows, make decisions and interact with systems in real time.\nThese aren’t just advanced macros or rule-based systems. Today’s AI agents observe, learn, act and reason, often without direct supervision.\n“We now actually think of agents as one of the boxes in our org chart,” i2c CEO and founder Amir Wain told PYMNTS, noting that it’s a philosophical shift.\n“It’s not about being fancy. It’s about being effective,” Wain said.\nThese AI agents are showing the most potential across contact centers, developer workflows, payment orchestration, underwriting systems and fraud detection units.\n“We’re quite bullish on agentic checkout and agentic commerce,” Nabil Manji, SVP head of FinTech growth and financial partnerships at Worldpay, told PYMNTS. “We’re actively using AI to improve our customer onboarding and underwriting journey — something the whole financial services sector has been trying to crack for years.”\n“It’s not just about automation; it’s about delegation,” Coupa Product Strategy and Management SVP Rajiv Ramachandran said. “AI agents aren’t just processing invoices. They’re deciding whether to move money, how much, when and to whom.”\nGovernance, Trust and Responsible AI Are Non-Negotiables\nWith great autonomy comes great responsibility. As AI agents gain power, the accompanying risks grow, too. Unlike traditional AI systems with deterministic outputs, agentic AI is probabilistic, non-linear and unpredictable by nature. This can increase the governance burden.\n“This isn’t a technical upgrade. It’s a governance revolution,” Kathryn McCall, chief legal and compliance officer at Trustly, told PYMNTS. “You’re messing with people’s money here.”\n“You’ve got to treat these AI agents as non-human actors with unique identities in your system. You need audit logs, human-readable reasoning and forensic replay,” McCall added. “Can your agent initiate invoice creation but not approve disbursement without human review? What’s the scope? What are they allowed to do and what are they not allowed to do?”\nForward-looking companies are embedding trust into their tech DNA, building in guardrails like explainability, human oversight and ethical fail-safes to avoid costly missteps and ensure accountability.\n“Payments is a zero-error industry,” Boost Payment Solutions Chief Operating Officer Illya Shell said. “Taking calculated risks is okay. But they’ve got to be very thoughtful and meticulous.”\nAfter all, whether it’s autonomous B2B payments or AI-powered budget assistants, success hinges on ensuring end users (and internal teams) believe in the system.\n“The bedrock of all of this is going to be trust with the member — and building that trust takes time,” Elizabeth Wadsworth, senior innovation strategist at Velera, said.\nInfrastructure Rebuilds Can Scale Agent-First Operations\nBut the shift isn’t plug-and-play. Agentic AI is exposing serious infrastructure limitations, especially in payments and finance. AI agents demand real-time, scalable, secure infrastructure. Legacy systems can’t handle thousands of concurrent autonomous agents acting on APIs, analyzing data and triggering actions across systems.\n“People underestimate what it takes to support this at scale,” Edwin Poot, chief technology officer at Thredd, said. “You’ll deploy agents per transaction — this will require changes to the infrastructure.”\nCompanies are rebuilding platforms for agent orchestration, simulation environments, serverless compute, federated data access and tokenization.\nStax Chief Technology Officer Mark Sundt told PYMNTS that if agentic AI is the engine, orchestration is the transmission. Without a central conductor, even the most capable agents act in isolation.\n“You’ve got agents to agents … but who’s driving the process?” Sundt said. “Who’s doing the orchestration?”\nIntelligent Commerce and Payments as the Proving Ground\nAgentic AI is being battle-tested first in the payments and commerce ecosystem, especially for fraud detection, cross-border transactions, B2B automation, customer engagement and personalization.\n“Cross-border payments aren’t optimized,” Boost’s Shell said. “But agentic AI can help us streamline the front end to ensure we know exactly who’s paying whom, and that the payments are geared in the right way to get out the door quickly.”\nAgentic AI is also forcing a complete rethink of how online commerce happens. These agents don’t click on banner ads or fall for marketing copy. They optimize for price, shipping and past behavior.\n“When AI agents shop on your behalf, they don’t see advertisements the way humans do,” said i2c’s Amir Wain. “They just look for real value.”\nThis space offers rich data, real-time needs, and high-stakes outcomes — making it the ideal launchpad for agentic AI’s full capabilities."
    },
    {
      "url": "https://www.pymnts.com/news/artificial-intelligence/2025/agentic-ai-turns-enterprise-cybersecurity-into-machine-battle/",
      "text": "Fraudsters have traditionally exploited that window, often with catastrophic results.\nNow, Google is showing that the arms race may no longer be moving at human speed, potentially signaling an end to the era of overloaded analysts chasing alerts and engineers patching software after the fact.\nThe tech giant unveiled several updates Tuesday (July 15) around agentic artificial intelligence-powered cybersecurity. Google is developing autonomous systems that can detect, decide and respond to threats in real time — often without human intervention.\n“Our AI agent Big Sleep helped us detect and foil an imminent exploit,” Sundar Pichai, CEO of Google and its parent company, Alphabet, posted on social platform X. “We believe this is a first for an AI agent — definitely not the last — giving cybersecurity defenders new tools to stop threats before they’re widespread.”\nFor business leaders, especially chief information security officers (CISOs) and chief financial officers (CFOs), this rising reality may pose new questions. Are enterprise organizations ready for defense at machine speed? What’s the cost of not adopting these tools? Who’s accountable when AI systems take action?\nRead also: What B2B Firms Can Learn From Big Tech’s Cybersecurity Initiatives\nFrom Threat Reaction to Autonomous Prevention\nHistorically, zero-day vulnerabilities — unknown security flaws in software or hardware — are discovered by adversaries first, exploited quietly, and later disclosed after damage has occurred. Big Sleep reversed that pattern. No alerts, no tip-offs — just AI running autonomously and flagging a high-risk issue before anyone else even knew it existed.\nFor CISOs, this means a new category of tools is emerging. They’re AI-first threat prevention platforms that don’t wait for alerts but seek out weak points in code, configurations or behavior, and they take defensive action automatically.\nFor CFOs, it signals a change in cybersecurity economics. Prevention at this scale is potentially cheaper and more scalable than the human-powered models of the past. But that’s only if the AI is accurate and accountable.\n“The models are only as good as the data being fed to them,” Boost Payment Solutions Chief Technology Officer Rinku Sharma told PYMNTS in April. “Garbage in, garbage out holds true even with agentic AI.”\nThe PYMNTS Intelligence report “The AI MonitorEdge Report: COOs Leverage GenAI to Reduce Data Security Losses” found that the share of chief operating officers (COOs) who said their companies had implemented AI-powered automated cybersecurity management systems leapt from 17% in May 2024 to 55% in August.\nThe report found that these COOs adopted new AI-based systems because they could identify fraudulent activities, detect anomalies and provide real-time threat assessments.\nSee also: Payments Execs Say AI Agents Give Payments an Autonomous Overhaul\nAgentic AI and Risk Accountability at the Edge of the Front Line\nWith power comes responsibility, and in cybersecurity, that translates to risk ownership.\nAgentic AI systems, by definition, act independently. That autonomy introduces new challenges for governance and compliance. Who’s responsible if an AI mistakenly flags a critical system and shuts it down? What happens if the AI fails to detect a breach?\n“This isn’t a technical upgrade; it’s a governance revolution,” Kathryn McCall, chief legal and compliance officer at Trustly, told PYMNTS in June.\n“You’ve got to treat these AI agents as non-human actors with unique identities in your system,” she added. “You need audit logs, human-readable reasoning and forensic replay.”\nThe emergence of agentic AI solutions for cybersecurity also has enterprise composition implications. As workforces remain hybrid and attack surfaces widen, endpoint security is only as good as its weakest device. Bringing autonomous protection to the edge — phones, browsers, apps — may no longer be optional.\nStax Chief Technology Officer Mark Sundt told PYMNTS in June that if agentic AI is the engine, orchestration is the transmission. Without a central conductor, even the most capable agents act in isolation.\n“You’ve got agents to agents … but who’s driving the process?” Sundt said. “Who’s doing the orchestration?”\nIn that light, cybersecurity investments must now answer a new question: How much decision-making power are we ready to give our machines?\nThe adversaries aren’t waiting, and the AI agents aren’t slowing down.\nFor WEX Chief Digital Officer Karen Stroup, the best approach to deploying agentic AI involves a disciplined strategy of experimentation.\n“If you’re going to experiment with agentic AI or any type of AI solutions, you want to focus on two things,” she told PYMNTS in April. “One is the areas where you’re most likely to have success. And two, is there going to be a good return on that investment?”\nFor all PYMNTS AI and digital transformation coverage, subscribe to the daily AI and Digital Transformation Newsletters."
    },
    {
      "url": "https://www.linkedin.com/in/brianmwalsh/",
      "text": "Articles by Brian\nActivity\n-\nEmerging market themes can be challenging to capture, especially for new or casual investors – that’s why I’m excited to announce the SoFi Agentic AI…\nEmerging market themes can be challenging to capture, especially for new or casual investors – that’s why I’m excited to announce the SoFi Agentic AI…\nShared by Brian Walsh, PhD, CFP®\n-\nSoFi Launches Innovative Robo-Advisor Platform for Alternative Investments Learn more & get our take 👇 https://lnkd.in/g5VVMyXq \"Our new robo…\nSoFi Launches Innovative Robo-Advisor Platform for Alternative Investments Learn more & get our take 👇 https://lnkd.in/g5VVMyXq \"Our new robo…\nLiked by Brian Walsh, PhD, CFP®\n-\nWILDLY proud of the SoFi team for all of the amazing work we did in 2023. We've got two campaigns listed as finalists in FOUR categories of the…\nWILDLY proud of the SoFi team for all of the amazing work we did in 2023. We've got two campaigns listed as finalists in FOUR categories of the…\nLiked by Brian Walsh, PhD, CFP®\nExperience & Education\nLicenses & Certifications\nProjects\n-\nThe Fundamentals of Personal Finance\nThis Specialization is intended for anyone looking to take control of their finances. Through these five courses, you will cover a variety of personal finance topics, including budgets, investing, and managing risk. The readings, videos, and activities will prepare you to understand the current state of your money, as well as take actions to work toward your financial goals. This specialization is geared towards learners in the United States of America.\nOther creatorsSee project\nHonors & Awards\n-\n2020 Morningstar Best Paper in Investments\nAcademy of Financial Services Annual Conference\nAnalyzing Retirement Savings of Households with Student Loans.\nMore activity by Brian\n-\nIn August of 2022 I sat down with the team to discuss our popular weekly livestream, Your Next Dollar, and how we could evolve it post-COVID. Despite…\nIn August of 2022 I sat down with the team to discuss our popular weekly livestream, Your Next Dollar, and how we could evolve it post-COVID. Despite…\nLiked by Brian Walsh, PhD, CFP®\n-\nToday marks my last day at SoFi. It’s been an *epic* 6 1/2 years, in every sense of the word. I joined SoFi back in October 2018 and can’t help but…\nToday marks my last day at SoFi. It’s been an *epic* 6 1/2 years, in every sense of the word. I joined SoFi back in October 2018 and can’t help but…\nLiked by Brian Walsh, PhD, CFP®\n-\nAfter almost six years at SoFi, I'm thrilled to announce that I'm taking on a new role at Patreon leading Consumer Comms! After spending week 1 at…\nAfter almost six years at SoFi, I'm thrilled to announce that I'm taking on a new role at Patreon leading Consumer Comms! After spending week 1 at…\nLiked by Brian Walsh, PhD, CFP®\n-\nWhat a Great course from Sofi, i would like to thank to Coursera and Brian Walsh, PhD, CFP® and Lauren Anastasio, MBA, CFP® for great content about…\nWhat a Great course from Sofi, i would like to thank to Coursera and Brian Walsh, PhD, CFP® and Lauren Anastasio, MBA, CFP® for great content about…\nLiked by Brian Walsh, PhD, CFP®\n-\nOn last Tuesday, October 31, I had the opportunity to defend my dissertation. I am grateful to have successfully completed this journey which began…\nOn last Tuesday, October 31, I had the opportunity to defend my dissertation. I am grateful to have successfully completed this journey which began…\nLiked by Brian Walsh, PhD, CFP®\n-\nI'm so happy to announce that I successfully defended my doctoral dissertation at Kansas State University today! They say it's about the journey and…\nI'm so happy to announce that I successfully defended my doctoral dissertation at Kansas State University today! They say it's about the journey and…\nLiked by Brian Walsh, PhD, CFP®\n-\nRare LI poster here 👋 But wanted to express my immense gratitude and joy for a fun project we've been working on over here at SoFi. Richer Live$…\nRare LI poster here 👋 But wanted to express my immense gratitude and joy for a fun project we've been working on over here at SoFi. Richer Live$…\nLiked by Brian Walsh, PhD, CFP®\n-\nUnsurprisingly, the SoFi at Work team has been busy lately. As federal student loan repayment has resumed, more and more organizations are…\nUnsurprisingly, the SoFi at Work team has been busy lately. As federal student loan repayment has resumed, more and more organizations are…\nLiked by Brian Walsh, PhD, CFP®\n-\nHave you watched SoFi's new show, Richer Lives? This week we featured Chrishell Stause, star of Selling Sunset, where we discussed her POV on…\nHave you watched SoFi's new show, Richer Lives? This week we featured Chrishell Stause, star of Selling Sunset, where we discussed her POV on…\nShared by Brian Walsh, PhD, CFP®\n-\nHave you watched SoFi's new show, Richer Lives? This week we featured Chrishell Stause, star of Selling Sunset, where we discussed her POV on…\nHave you watched SoFi's new show, Richer Lives? This week we featured Chrishell Stause, star of Selling Sunset, where we discussed her POV on…\nLiked by Brian Walsh, PhD, CFP®\n-\nHave you heard of our new show Richer Lives? It's all about helping you live your best life! In our latest episode Natalie (Corporate Natalie) is…\nHave you heard of our new show Richer Lives? It's all about helping you live your best life! In our latest episode Natalie (Corporate Natalie) is…\nLiked by Brian Walsh, PhD, CFP®\n-\nSo proud of my rockstar wife! And I echo everything she said: we are immensely grateful for all the resources we have had that enabled Jamie to be…\nSo proud of my rockstar wife! And I echo everything she said: we are immensely grateful for all the resources we have had that enabled Jamie to be…\nLiked by Brian Walsh, PhD, CFP®\n-\nWant to learn how to live a richer life and use money to live your best life? Check out @SoFi’s new original series Richer Lives hosted by…\nWant to learn how to live a richer life and use money to live your best life? Check out @SoFi’s new original series Richer Lives hosted by…\nLiked by Brian Walsh, PhD, CFP®\n-\nExcited to help SoFi launch our new show, Richer Lives. It's amazing to see all the ways SoFi meets people where they are to help them learn how to…\nExcited to help SoFi launch our new show, Richer Lives. It's amazing to see all the ways SoFi meets people where they are to help them learn how to…\nShared by Brian Walsh, PhD, CFP®\nOther similar profiles\n-\nJosh Lopes\nConnect -\nWilliam Quinn\nConnect -\nCraig Lemoine, CFP(r), PhD, MRFC\nDirector of Personal Financial Planning | Associate Professor of Personal Financial Planning & Host | Land & Everything Else Podcast\nConnect -\nDr. Igor Zey, PhD , MSFS, CFP, CLU, ChFC, CAP, AEP, TEP\nConnect -\nSutton White, PMP\nManager, Project Manager | CapTech\nConnect -\nStephen Bene, CFF®, NSSA, CFBS\nConnect -\nDavid S. Rodgers\nConnect -\nEric Klimek\nWork with financial professionals regarding life and disability insurance.\nConnect -\nDouglas A. Boneparth, CFP®\nConnect -\nJeb Jarrell, CFP, CAP, CEPA\nHelping families build, protect, and transition wealth\nConnect\nExplore top content on LinkedIn\nFind curated posts and insights for relevant topics all in one place.\nView top content"
    },
    {
      "url": "https://www.pymnts.com/tag/agentic-ai/",
      "text": "Autonomous agent infrastructure company Kite has raised $18 million in a PayPal Ventures-led funding round. Get the Full Story Complete the form to unlock this...\nPicture this: a treasury office in 2035. The morning might start with a chief financial officer logging into a secure portal, where an artificial intelligence...\nRetailers are increasingly employing artificial intelligence (AI) to optimize their customers’ shopping experience. Get the Full Story Complete the form to unlock this article and...\nImagine an HR manager looking for the PTO record of an employee. Instead of logging onto the HR dashboard and pulling up the worker’s profile,...\nAgentic AI’s splashy arrival on the business scene is proving to be more of a rapid sociotechnical evolution than a pure-play technological upgrade. As such,...\nWhen Coinbase embraced artificial intelligence (AI) adoption, its CEO gave workers a week to get on board. Get the Full Story Complete the form to...\nData analytics firm Databricks is acquiring machine learning startup Tecton. Get the Full Story Complete the form to unlock this article and enjoy unlimited free...\nGoogle is bringing more advanced agentic artificial intelligence (AI) capabilities to its search tool. Get the Full Story Complete the form to unlock this article and...\nWhat happens when a simple request becomes a done deal? When prompts replace buy buttons and commerce moves at the speed of a conversation? Get..."
    },
    {
      "url": "https://www.pymnts.com/news/b2b-payments/2025/agentic-ai-puts-a-face-on-corporate-treasurys-next-leap/",
      "text": "Picture this: a treasury office in 2035. The morning might start with a chief financial officer logging into a secure portal, where an artificial intelligence (AI) avatar greets them with a briefing of overnight currency swings, projected cash balances, and maybe an alert about a supplier default risk in Asia.\nThe AI, against this backdrop, could propose a handful of mitigation strategies, complete with financial impacts and probabilities. The CFO might ask follow-up questions, challenge assumptions, and ultimately greenlights one path. The avatar would then execute, documenting rationale for auditors. Minutes later, the company’s global liquidity profile is adjusted.\nThis is not science fiction. The core technologies of large language models, autonomous agents, and conversational avatars all exist today. What remains is integration, governance, and cultural acceptance.\nAfter all, 2035 is just 10 years away.\nThe AI treasurer is coming; the question is when, not if. And the potential of agentic AI in corporate treasury underscores a broader truth, that finance is no longer confined to numbers in a ledger. It is increasingly about speed, foresight and trust.\nRead more: Treasurers Step Into Strategy Room as Scenario Planning Becomes Corporate Weapon\nFrom Back Office to Center Stage\nCorporate treasury has historically been considered a niche discipline, tucked behind flashier functions like strategy or product innovation. Yet it often determines whether a business can survive shocks. During the 2008 financial crisis, treasury teams scrambled daily to secure funding. During the pandemic, they became lifelines, navigating frozen supply chains and unpredictable demand curves.\nThese historic crucibles have elevated treasury’s strategic importance. Boards now expect treasurers to provide real-time insight, not just static reports. But human teams are limited: even a well-staffed treasury department cannot scan thousands of market signals, liquidity positions and geopolitical shifts in real time without help. Spreadsheets and enterprise systems only go so far.\nThis is where agentic AI treasury systems could enter. Rather than functioning as silent engines behind a dashboard, next-generation AI treasurers may appear as interactive, explainable agents. They can tell a CFO why a swap was executed, walk through alternative scenarios, and even adjust tone and detail depending on the audience, whether it’s a risk committee or a junior analyst. The once-invisible treasury function suddenly becomes a visible, conversational partner.\nAnimated, conversational, and capable of executing trades or wiring funds, these agentic AI systems could fundamentally reshape how corporations think about liquidity, risk and decision-making.\nSee also: Payments Execs Say AI Agents Give Payments an Autonomous Overhaul\nThe Avatar Advantage\nThe idea of an “AI avatar” may conjure images of cartoonish holograms. But in the finance context, the avatar is less about theatrics and more about human trust. Avatars serve as the interface for increasingly complex decision-making systems. When an algorithm moves $200 million across jurisdictions, executives want to know not only what happened but why. A face, realistic or stylized, can become a conduit for explainability.\nImagine a treasury meeting where the AI treasurer presents cash forecasts, highlighting potential liquidity shortfalls two quarters out. The avatar explains that a pattern in supplier payments and foreign exchange exposures points to risk. When asked why the system recommends hedging euro-denominated receivables, the avatar cites real-time volatility metrics, historical correlations, stress tests, then executes the hedge instantly once approved.\nFindings in the July Digital Financial Services Tracker® Series report, “AI Power: The Technology Transforming Accounts Receivable,” a PYMNTS Intelligence collaboration with FIS, revealed that AI is transforming AR from a reactive, transactional function into a proactive, relationship-centered discipline, all while becoming the software engine powering the next generation of smarter financial performance.\nOf course, handing over the corporate wallet to an AI is fraught with risk. Treasury errors are unforgiving, and agentic AI systems must therefore be bound by strict governance.\nExplainability is another cornerstone. Unlike traditional algorithms, which often operate as black boxes, avatars can narrate reasoning in real time. For treasury professionals, that matters. They don’t simply need answers; they need defensible justifications for auditors, regulators and boards. A system that can explain why it took — or refrained from taking — action becomes not just a tool but a partner.\nNot all companies move at the same pace. Highly regulated sectors like banking and healthcare will likely adopt cautiously, layering AI avatars atop existing systems as decision-support tools rather than autonomous actors. Tech-forward firms, meanwhile, may experiment more aggressively, betting that early adoption of AI treasurers can deliver a competitive edge in capital efficiency.\nThe PYMNTS Intelligence report “Smart Spending: How AI Is Transforming Financial Decision Making” found that more than 8 in 10 CFOs at large companies are either already using AI or considering adopting it, while financial institutions like Bank of America are betting heavily on treasury data intelligence platforms, which promise real-time insights and predictive analytics.\nBy giving algorithms a face and a voice, companies can bridge the gap between machine precision and human comprehension. Done right, AI treasurers will not replace humans but extend them by enabling treasury teams to act with unprecedented agility in a world where every signal matters.\nRead more: Why Trust Is Data’s Only Real Currency"
    }
  ],
  "argos_summary": "SoFi has launched the AGIQ ETF, which invests in U.S. companies listed on the BITA US Agentic AI Select Index, including firms such as Salesforce, Tesla, and Nvidia. The index tracks businesses involved in agentic AI technologies—autonomous systems, AI scheduling assistants, cybersecurity, industrial automation, semiconductors, and cloud computing. The ETF aims to give investors exposure to the rapidly expanding agentic AI market, projected to grow significantly by 2035. The launch reflects growing investor interest in AI‑driven productivity gains across multiple sectors.",
  "argos_id": "869BUFDX1"
}