{
  "url": "https://finance.yahoo.com/news/latest-assay-results-show-gold-123500615.html",
  "authorsByline": "Newsfile",
  "articleId": "a0c0a00c95124a1ebd30b852eb942a2c",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/b657334fd0f4cfb6e1bbcea4e7c0f88e",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:35:00+00:00",
  "addDate": "2025-09-03T12:44:01.240946+00:00",
  "refreshDate": "2025-09-03T12:44:01.240947+00:00",
  "score": 1.0,
  "title": "Latest Assay Results Show Gold Sample at 11.2 g/t + 11.35 g/t of Silver on Glenstar's Wildhorse Project and Lays the Foundation for Expanded Phase 2 Exploration Work Program",
  "description": "Vancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Glenstar Minerals Inc. (CSE: GSTR) (OTCQB: GSTRF) (FSE: VO20) (\"Glenstar\" or the \"Company\") is pleased to announce that it has received assay results from twenty-nine (29) stream sediment samples that were collected during the Phase 1 exploration work program conducted on the Wildhorse property in early June (see news release dated July 9, 2025). The assays were conducted by ALS Chemex (\"ALS\") in Vancouver, BC, from samples...",
  "content": "Furthermore, a potentially significant and important gold occurrence has been identified in the sample results in a single sample from a large cobble in the stream drainage 35 meters downhill from the Coca Cola Zone. It is likely that the sampled material is from the identified mineralized zone immediately up slope. This sample returned 11.20 ppm (11.2 g/t or .36 oz/t) gold with 11.35 ppm (11.35 g/t or .37 oz/t) silver, as well as multi-percent copper along with the expected strong tungsten, bismuth and tellurium signature previously encountered.\n\nThis is classic metal zoning seen worldwide in intrusive-center related ore deposits such as the bonanza silver-gold-base metal vein system in nearby Story County Nevada and the Yerington Nevada district where gold and silver mineralization is related to tellurium mineralization within the porphyry copper deposit in adjacent Lyon County.\n\nThe results also add additional support to the developing intrusive-center geologic model at Wildhorse. Within this area there is a prominent steep-sided hill, which the Company has named Palomino Hill, that is surrounded by a well-developed skarn envelope. Strong gold, copper, silver, bismuth, tellurium, and tungsten have been sampled along both the east (Rattlesnake Zone) and southwest (Coca Cola Zone) flanks of Palomino Hill. Further away, mineralization on the south side of Palomino Hill (Highland Zone) changes to zinc, silver, and lead dominant, as previously seen in initial rock chip sampling of the property.\n\nThe results show a series of very strong tungsten-bismuth anomalies that have been mapped in four (4) distinct stream drainages in the central portion of the property. The position of these anomalies confirm the known mineralized zones and, more importantly, also identify two (2) additional drainages as being highly prospective for a more comprehensive and detailed prospecting plan, due to robust tungsten and bismuth reported in the stream sediment assays. This appears to represent a significant expansion of the previously identified Rattlesnake Zone, which is contained within the larger surrounding area where the twenty-nine (29) stream sediment samples were taken.\n\nVancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Glenstar Minerals Inc. (CSE: GSTR) (OTCQB: GSTRF) (FSE: VO20) (\" Glenstar \" or the \" Company \") is pleased to announce that it has received assay results from twenty-nine (29) stream sediment samples that were collected during the Phase 1 exploration work program conducted on the Wildhorse property in early June (see news release dated July 9, 2025). The assays were conducted by ALS Chemex (\" ALS \") in Vancouver, BC, from samples collected, bagged, labelled and shipped by project geologist, and Qualified Person, Robert Marvin.\n\nThese stream sediment and rock chip results are quite encouraging and indicate that further sampling needs to be done to gain a better understanding of the localized mineralization in each of the three zones.\n\nAccording to project geologist Bob Marvin, \"These latest results clearly indicate that the zones of interest warrant an expanded and more comprehensive Phase 2 exploration and work plan, which will provide a clearer picture of what we're actually dealing with. I am extremely happy with what we have discovered so far at the Wildhorse Project and the team will be determining next steps in the very near future.\"\n\nThe Wildhorse Property is comprised of 61 mineral claims, representing 1,220 acres (494 hectares) in Mineral County, Nevada, and was initially targeted after compilation of all available data, including notes of a 1975 field examination contained in the Anaconda Company archives housed at the University of Wyoming. The claims show historical workings that appear to date from the late 1800's and early 1900's. Other claim stakes that the geological team discovered on the property indicate the last time the area was staked was 2011, however, these claims were never registered with the BLM. Preliminary geological assessment of the claims, and the area in general, indicate there are a series of east dipping mineralized zones. Initial field examination of the property identified and sampled a quartz veinlet zone containing in excess of 1 gram per ton gold, 1% copper, and 6,100 ppm of antimony. It was also reported that outcropping zones also contain bismuth and tungsten >200 ppm, which points to a focused intrusive source for the epidote skarn alteration and poly-metallic system.\n\nSeveral additional areas of exposed copper mineralization were located during the staking of the property. The geology of the area is complex, with strongly folded and faulted limestones, shale, and metavolcanic rocks of Paleozoic age underly the known mineralization and cover a large portion of the property claims. Importantly, an intrusive mass of rhyolite has intruded the deformed section in a position proximal to the known mineralization. Land slide rubble and boulder bearing gravel units conceal the underlying geology in the northcentral portion of the property (see news release dated May 8, 2025).\n\nThe economic opportunity at Wildhorse points to the possible discovery of a large, well mineralized skarn system under the surface workings and within the controlling north-south fault zone exposed at surface. Skarns are relatively easy to explore as they respond well to a variety of electric geophysical methods including magnetic surveys.\n\nGlenstar is a mineral exploration Company with a focus on polymetallic minerals. These elements are classified as critical minerals and are essential in the manufacturing of sophisticated electronics and other vital energy technologies. The Company's mission is to leverage its knowledge and connections to explore, acquire, and develop critical mineral and energy metal properties throughout the world.\n\nGlenstar's shares trade on the Canadian Securities Exchange (CSE) under the symbol \"GSTR\", on the Frankfurt Stock Exchange under the symbol \"VO20\", and on the Over-the-Counter market (OTCQB) in the United States under the symbol \"GSTRF\".\n\nRobert Marvin, P.Geo (ONT) is the qualified person as defined by National Instrument 43-101 and is the independent consulting geologist for Glenstar Minerals Inc. who has examined the Green Monster and Wildhorse properties on the ground numerous times since 2022 and 2024 respectively. All fieldwork relating to geologic observations and sampling as reported herein, has been directly overseen by Mr. Marvin who supervised the preparation of, and has reviewed and approved, the technical information in this release.\n\nON BEHALF OF THE BOARD\n\nFurther information regarding the Company can be found on SEDAR+ at www.sedarplus.ca, by visiting the Company's website www.glenstar.ca or by contacting the Company directly at 604-449-2810.\n\nNeither Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nCautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward-looking information\"). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of any Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as \"may\", \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking information.\n\nForward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Mineral exploration is subject to risks and uncertainties and there is no assurance that any potential results or findings that may be suggested in this press release will ultimately happen. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedarplus.ca under the Company's profile and on the Company's website. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date.\n\nThis release may contain certain forward‐looking statements with respect to the financial condition, results of operations and business of the Company and certain of the plans and objectives of the Company with respect to the same. By their nature, forward‐looking statements involve risk and uncertainty because they relate to events and depend on circumstances that will occur in the future and there are many factors that could cause actual results and developments to differ materially from those expressed or implied by these forward‐looking statements.\n\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/264922",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/qp1D4uwXNp",
    "https://api.newsfilecorp.com/redirect/RYxjoTKJvp",
    "https://api.newsfilecorp.com/redirect/0pBJRu0mYM",
    "https://api.newsfilecorp.com/redirect/WAkmpsb528"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Company",
      "weight": 0.06432289
    },
    {
      "name": "news release",
      "weight": 0.05676809
    },
    {
      "name": "Latest Assay Results",
      "weight": 0.056202505
    },
    {
      "name": "assay results",
      "weight": 0.055076007
    },
    {
      "name": "Gold Sample",
      "weight": 0.053576775
    },
    {
      "name": "additional information",
      "weight": 0.052259468
    },
    {
      "name": "actual results",
      "weight": 0.052239478
    },
    {
      "name": "results",
      "weight": 0.05186869
    },
    {
      "name": "exposed copper mineralization",
      "weight": 0.05042062
    },
    {
      "name": "Further information",
      "weight": 0.0497169
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.78515625
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.6513671875
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.45068359375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.414794921875
    }
  ],
  "sentiment": {
    "positive": 0.39026386,
    "negative": 0.04107329,
    "neutral": 0.5686629
  },
  "summary": "Glenstar Minerals Inc. has received assay results from 29 stream sediment samples taken on its Wildhorse Project in Mineral County, Nevada. The results indicate a potentially significant gold occurrence in a single sample from a large cobble in the stream drainage 35 meters downhill from the Coca Cola Zone. The sample returned 11.2 g/t or.36 oz/t, with 11.35 ppm (11.35g/t) silver, and multi-percent copper, along with the expected strong tungsten, bismuth and tellurium signature previously encountered. These results support the developing intrusive-center geologic model at Wildhorse and suggest an expanded Phase 2 exploration program. The Wildhorse Property is comprised of 61 mineral claims, representing 1,220 acres (494 hectares), and was initially targeted after compilation of all available data.",
  "shortSummary": "Glenstar Minerals' latest results confirm significant gold and silver deposits in the Wildhorse Project, prompting an expanded exploration plan.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1b9d04fde4454085bb3b98ac70c27f43",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/qp1D4uwXNp",
      "text": "Latest Assay Results Show Gold Sample at 11.2 g/t + 11.35 g/t of Silver on Glenstar's Wildhorse Project and Lays the Foundation for Expanded Phase 2 Exploration Work Program\nSeptember 03, 2025 8:35 AM EDT | Source: Glenstar Minerals Inc.\nVancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Glenstar Minerals Inc. (CSE: GSTR) (OTCQB: GSTRF) (FSE: VO20) (\"Glenstar\" or the \"Company\") is pleased to announce that it has received assay results from twenty-nine (29) stream sediment samples that were collected during the Phase 1 exploration work program conducted on the Wildhorse property in early June (see news release dated July 9, 2025). The assays were conducted by ALS Chemex (\"ALS\") in Vancouver, BC, from samples collected, bagged, labelled and shipped by project geologist, and Qualified Person, Robert Marvin.\nThe results show a series of very strong tungsten-bismuth anomalies that have been mapped in four (4) distinct stream drainages in the central portion of the property. The position of these anomalies confirm the known mineralized zones and, more importantly, also identify two (2) additional drainages as being highly prospective for a more comprehensive and detailed prospecting plan, due to robust tungsten and bismuth reported in the stream sediment assays. This appears to represent a significant expansion of the previously identified Rattlesnake Zone, which is contained within the larger surrounding area where the twenty-nine (29) stream sediment samples were taken.\nThe results also add additional support to the developing intrusive-center geologic model at Wildhorse. Within this area there is a prominent steep-sided hill, which the Company has named Palomino Hill, that is surrounded by a well-developed skarn envelope. Strong gold, copper, silver, bismuth, tellurium, and tungsten have been sampled along both the east (Rattlesnake Zone) and southwest (Coca Cola Zone) flanks of Palomino Hill. Further away, mineralization on the south side of Palomino Hill (Highland Zone) changes to zinc, silver, and lead dominant, as previously seen in initial rock chip sampling of the property.\nThis is classic metal zoning seen worldwide in intrusive-center related ore deposits such as the bonanza silver-gold-base metal vein system in nearby Story County Nevada and the Yerington Nevada district where gold and silver mineralization is related to tellurium mineralization within the porphyry copper deposit in adjacent Lyon County.\nFurthermore, a potentially significant and important gold occurrence has been identified in the sample results in a single sample from a large cobble in the stream drainage 35 meters downhill from the Coca Cola Zone. It is likely that the sampled material is from the identified mineralized zone immediately up slope. This sample returned 11.20 ppm (11.2 g/t or .36 oz/t) gold with 11.35 ppm (11.35 g/t or .37 oz/t) silver, as well as multi-percent copper along with the expected strong tungsten, bismuth and tellurium signature previously encountered.\nThese stream sediment and rock chip results are quite encouraging and indicate that further sampling needs to be done to gain a better understanding of the localized mineralization in each of the three zones.\nAccording to project geologist Bob Marvin, \"These latest results clearly indicate that the zones of interest warrant an expanded and more comprehensive Phase 2 exploration and work plan, which will provide a clearer picture of what we're actually dealing with. I am extremely happy with what we have discovered so far at the Wildhorse Project and the team will be determining next steps in the very near future.\"\nProject Background & Recent Exploration Work\nThe Wildhorse Property is comprised of 61 mineral claims, representing 1,220 acres (494 hectares) in Mineral County, Nevada, and was initially targeted after compilation of all available data, including notes of a 1975 field examination contained in the Anaconda Company archives housed at the University of Wyoming. The claims show historical workings that appear to date from the late 1800's and early 1900's. Other claim stakes that the geological team discovered on the property indicate the last time the area was staked was 2011, however, these claims were never registered with the BLM. Preliminary geological assessment of the claims, and the area in general, indicate there are a series of east dipping mineralized zones. Initial field examination of the property identified and sampled a quartz veinlet zone containing in excess of 1 gram per ton gold, 1% copper, and 6,100 ppm of antimony. It was also reported that outcropping zones also contain bismuth and tungsten >200 ppm, which points to a focused intrusive source for the epidote skarn alteration and poly-metallic system.\nSeveral additional areas of exposed copper mineralization were located during the staking of the property. The geology of the area is complex, with strongly folded and faulted limestones, shale, and metavolcanic rocks of Paleozoic age underly the known mineralization and cover a large portion of the property claims. Importantly, an intrusive mass of rhyolite has intruded the deformed section in a position proximal to the known mineralization. Land slide rubble and boulder bearing gravel units conceal the underlying geology in the northcentral portion of the property (see news release dated May 8, 2025).\nThe economic opportunity at Wildhorse points to the possible discovery of a large, well mineralized skarn system under the surface workings and within the controlling north-south fault zone exposed at surface. Skarns are relatively easy to explore as they respond well to a variety of electric geophysical methods including magnetic surveys.\nAbout Glenstar Minerals Inc.\nGlenstar is a mineral exploration Company with a focus on polymetallic minerals. These elements are classified as critical minerals and are essential in the manufacturing of sophisticated electronics and other vital energy technologies. The Company's mission is to leverage its knowledge and connections to explore, acquire, and develop critical mineral and energy metal properties throughout the world.\nGlenstar's shares trade on the Canadian Securities Exchange (CSE) under the symbol \"GSTR\", on the Frankfurt Stock Exchange under the symbol \"VO20\", and on the Over-the-Counter market (OTCQB) in the United States under the symbol \"GSTRF\".\nRobert Marvin, P.Geo (ONT) is the qualified person as defined by National Instrument 43-101 and is the independent consulting geologist for Glenstar Minerals Inc. who has examined the Green Monster and Wildhorse properties on the ground numerous times since 2022 and 2024 respectively. All fieldwork relating to geologic observations and sampling as reported herein, has been directly overseen by Mr. Marvin who supervised the preparation of, and has reviewed and approved, the technical information in this release.\nON BEHALF OF THE BOARD\n\"David Ryan\"\nPresident & CEO\nFurther information regarding the Company can be found on SEDAR+ at www.sedarplus.ca, by visiting the Company's website www.glenstar.ca or by contacting the Company directly at 604-449-2810.\nNeither Canadian Securities Exchange nor its Regulation Services Provider (as that term is defined in policies of the Canadian Securities Exchange) accepts responsibility for the adequacy or accuracy of this release.\nCautionary Statement Regarding Forward-Looking Information Certain information contained in this news release constitutes \"forward-looking information\" or \"forward-looking statements\" (collectively, \"forward-looking information\"). Without limiting the foregoing, such forward-looking information includes statements regarding the process and completion of any Offering, the use of proceeds of the Offering and any statements regarding the Company's business plans, expectations and objectives. In this news release, words such as \"may\", \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking information.\nForward-looking information should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Mineral exploration is subject to risks and uncertainties and there is no assurance that any potential results or findings that may be suggested in this press release will ultimately happen. Forward-looking information is based on information available at the time and/or the Company management's good faith belief with respect to future events and is subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. For additional information with respect to these and other factors and assumptions underlying the forward-looking information made in this news release, see the Company's most recent Management's Discussion and Analysis and financial statements and other documents filed by the Company with the Canadian securities commissions and the discussion of risk factors set out therein. Such documents are available at www.sedarplus.ca under the Company's profile and on the Company's website. The forward-looking information set forth herein reflects the Company's expectations as at the date of this news release and is subject to change after such date.\nThis release may contain certain forward‐looking statements with respect to the financial condition, results of operations and business of the Company and certain of the plans and objectives of the Company with respect to the same. By their nature, forward‐looking statements involve risk and uncertainty because they relate to events and depend on circumstances that will occur in the future and there are many factors that could cause actual results and developments to differ materially from those expressed or implied by these forward‐looking statements.\nWe seek safe harbour.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/264922"
    }
  ],
  "argos_summary": "Glenstar Minerals Inc. announced that 29 stream‑sediment samples from its Wildhorse property in Nevada yielded promising results, including 11.2 g/t gold and 11.35 g/t silver, along with copper, tungsten, bismuth and tellurium. The findings reinforce an intrusive‑center skarn model and highlight new prospective drainages, prompting the company to plan an expanded Phase 2 exploration program. The company will continue sampling to refine its understanding of the localized mineralization in the identified zones.",
  "argos_id": "88FN15HV8"
}