{
  "url": "https://www.theverge.com/games/770667/i-tried-jsauxs-new-anti-glare-switch-2-screen-protector-and-it-revealed-a-glaring-bug",
  "authorsByline": "Cameron Faulkner",
  "articleId": "c37c77b169d0462f941a8b7ccedb1c2d",
  "source": {
    "domain": "theverge.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/ob1.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T20:39:00+00:00",
  "addDate": "2025-09-03T20:42:21.804135+00:00",
  "refreshDate": "2025-09-03T20:42:21.804138+00:00",
  "score": 1.0,
  "title": "I tried Jsaux’s new anti-glare Switch 2 screen protector, and it revealed a glaring bug",
  "description": "I slapped a pre-production version on my Switch 2. This $21.99 screen protector is coming in October.",
  "content": "is an editor covering deals and gaming hardware that he thinks you’ll like. He joined in 2018, and after a stint at Polygon, he rejoined The Verge in May 2025.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nI have a dead cockroach in my ceiling, and I only noticed it thanks to a Switch 2 screen protector that, ironically, is supposed to tame reflections. The protector in question is a pre-production sample of the Jsaux Obsidian AR screen protector, which is coming in October for $21.99.\n\nThe company claims it’s better than standard screen protectors because it features a similar physical vapor deposition (PVD) coating found in the Apple Studio Display. It’s supposed to reduce glare while retaining a glossy appearance — an ideal combination for gamers, since you can’t always choose where you’ll play games.\n\nIn reality, this pre-production screen protector boasts minor improvements that are easy to miss. Obsidian AR slightly reduces the intensity of reflections hitting the screen that could otherwise distract me during gameplay. However, I noticed these differences in photos more than I did while actively using the Switch 2.\n\nOne thing I did have the misfortune to notice as I played my Switch 2 with the screen protector equipped was the roach in my ceiling. That little sucker has probably been dead for a while and I only just noticed. In defense of Jsaux’s claims, it makes the bold LED tube illuminating the trapped roach a little dimmer and tougher to pick out, but not nearly enough to wipe this encounter from my memory.\n\nI won’t go as far as to say that the Obsidian AR isn’t worth your money, having only tried an early version. Everyone’s tolerance for glare is different, but I’m skeptical that the differences are worth paying for compared to cheaper alternatives. To reiterate, just one of these protectors will cost $21.99 while you can get a three-pack of good-enough tempered glass protectors for under $10.\n\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates.",
  "medium": "Article",
  "links": [
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/ob2.jpg?quality=90&strip=all",
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/noob6.jpg?quality=90&strip=all",
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/noob1.jpg?quality=90&strip=all",
    "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
    "https://platform.theverge.com/wp-content/uploads/sites/2/2025/09/ob1.jpg?quality=90&strip=all",
    "https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "standard screen protectors",
      "weight": 0.122485
    },
    {
      "name": "the Jsaux Obsidian AR screen protector",
      "weight": 0.08452799
    },
    {
      "name": "this pre-production screen protector",
      "weight": 0.081687905
    },
    {
      "name": "Obsidian AR",
      "weight": 0.07726746
    },
    {
      "name": "Jsaux’s new anti-glare Switch 2 screen protector",
      "weight": 0.07023843
    },
    {
      "name": "the screen protector",
      "weight": 0.06780569
    },
    {
      "name": "gaming hardware",
      "weight": 0.0627877
    },
    {
      "name": "a Switch 2 screen protector",
      "weight": 0.057183668
    },
    {
      "name": "Jsaux",
      "weight": 0.055012472
    },
    {
      "name": "email updates",
      "weight": 0.054929636
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.63671875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.591796875
    },
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.30908203125
    }
  ],
  "sentiment": {
    "positive": 0.2987833,
    "negative": 0.20428796,
    "neutral": 0.49692872
  },
  "summary": "Jsaux's new anti-glare Switch 2 screen protector, the Obsidian AR screen protector for $21.99, has been criticized for revealing a glaring bug that only revealed when playing with the device. The pre-production version of this screen protector has minor improvements that are easy to miss. However, the company claims that it reduces the intensity of reflections on the screen and is better than standard screen protectors due to its similar physical vapor deposition (PVD) coating. The reviewer is skeptical about the differences, noting that just one of these protectors will cost $21., while a three-pack of good-enough tempered glass protectors can be purchased for under $10.",
  "shortSummary": "Jsaux's new Switch 2 screen protector Obsidian AR promises improved glare reduction with a glossy finish, but reveals a hidden flaw that may deter some players.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "39d88d6222e44414a2a6fff86437a3cf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theverge.com/22981744/apple-studio-display-5k-monitor-webcam-speakers-review",
      "text": "Oh boy.\nApple Studio Display review: nothing to see here\nA 5K iMac’s panel, six speakers, three mics, and one terrible camera\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\nLook, people have wanted Apple to sell the 5K display from the now-discontinued 27-inch iMac as a standalone product for years now. When that first 27-inch 5K iMac came out in 2014, the display was so far ahead of the competition that buying one for the screen alone represented a bargain — that there was an entire computer attached to it was almost a bonus.\nSo now Apple’s gone and discontinued the 27-inch iMac and essentially replaced it with the new Mac Studio and the new 27-inch Studio Display. If the Mac Studio represents the fulfillment of a 20-year-old Mac power user’s dream, the Studio Display should be the fulfillment of a similar dream that’s been around since 2014: just give us the iMac’s 27-inch 5K display.\nUnfortunately, a lot of things have happened since 2014. And so far, the Studio Display’s headline webcam feature works so badly that it’s virtually unusable. This dream is a bit of a nightmare.\n(Editor’s note: Apple has released a beta software update for the Studio Display’s camera. You can see our first impressions here and when the final software is released we will update this review.)\nApple Studio Display\nThe Good\nThe only decent 5K display available on the market\nThe Bad\nWebcam will make everyone you know sad\nThe Studio Display marks Apple’s first entry in the mainstream display market in a long time — the company released the Pro Display XDR in 2020, but its $4,999 price tag meant it was decidedly for professionals. The Studio Display is more accessibly priced at $1,599, which is still expensive, but at least defensible when you consider that the only other 5K display available is the old and finicky LG Ultrafine 5K, which lists for $1,299.\nApple also made some grand promises about the Studio Display’s audio and video capabilities: it has six speakers, three microphones, and a 12-megapixel camera that are all run by an A13 chip — the same sort of front camera and chip you might find in an iPad.\nThe pitch, at least on paper, is that you get a 5K display that can display macOS at pixel-perfect resolution with no scaling issues, combined with webcam quality that matches Apple’s world-beating iOS devices. Considering the very recent history of miserable Mac webcams that has only just started improving, this is quite a pitch.\nWe have two Studio Display review units: the standard $1,599 model and the $1,899 model with Apple’s nanotexture matte glass. Both have the stock stand; adding a stand with height adjustment costs another $400 for some reason. You can opt for a VESA mount instead of the stock stand at no extra charge and pair it with whatever stand you want. But you can’t change from the stand to a VESA mount after the fact — you have to decide how you want this display mounted before you click the buy button. It has been a long time since Apple made displays; the company’s approach to display stands and stand pricing reflects that absence from the market, in the sense that it is from a different planet entirely.\nApple is generally terrific when it comes to displays across its devices, and the Studio Display is great at the basics: it’s clear, it’s sharp, it’s bright. If you have ever looked at a 27-inch 5K iMac display, you know exactly what this thing looks like. The Studio display is the same 27-inch size, the same 5120x2880 resolution, the same 218 pixels per inch, the same 60Hz refresh rate, and has the same single-zone LED backlight. The only real spec difference is that Apple says the Studio Display now has a “typical brightness” of 600 nits vs. 500 on the iMac, but in my actual typical use next to a 2015-vintage 27-inch iMac, that’s pretty hard to see.\nThe real issue is that $1,599 is a lot of money, and here, it’s buying you panel tech that is woefully behind the curve. Compared to Apple’s other displays across the Mac, iPhone, and iPad lineup, the Studio Display is actually most notable for the things it doesn’t have.\nThere are $379 TVs with more advanced local-dimming backlights than this\nLet’s start with the backlight. In general, the best modern displays create true blacks by cutting all the light coming from the black parts of the screen. There are several ways to do this, and Apple itself uses different tech across its high-end products to produce true blacks in various ways: OLED screens on the iPhones, advanced local dimming on the Pro Display XDR, and Mini LED display backlights on the MacBook Pro and iPad Pro.\nThe Studio Display has… well, it has none of that. It’s a regular old LED backlight that lights the entire screen all the time, and the darkest black it can produce is basically gray. In normal use in a well-lit room, it looks fine enough — LCD displays have looked like this for a long time now — but if you’re watching a movie in a dark room, the letterboxing will look light gray. There are $379 TVs with more advanced local-dimming backlights than this.\nThe Studio Display is also notable for being an SDR display, with no HDR modes to speak of. Apple’s high-end iPhones, iPads, and Mac laptops all support HDR, but the Studio Display tops out at 600 nits, and Apple doesn’t offer an HDR mode in the software at all. Again, this comes back to the ancient backlight tech: true HDR requires local dimming, and the Studio Display doesn’t have it.\nThe Studio Display also only offers a 60Hz refresh rate, which is both bog-standard and also woefully behind Apple’s other top-tier products like the iPhone 13 Pro, iPad Pro, and MacBook Pro, all of which offer the ProMotion variable refresh rate system that can run as high as 120Hz for smooth scrolling and gaming and as low as 24Hz for movies. (The iPhone 13 Pro can even drop to as low as 10Hz to save battery life.) 60Hz is totally fine for most displays, but this thing costs $1,599. There are a lot of less expensive displays with variable refresh rate and HDR tech out there, and they’re supported by macOS out of the box.\nReally the only reason to chase after this display for the screen itself is if you desperately care about having a 5K display that can display MacOS at pixel-perfect resolution with no scaling. I don’t want to discount this: a lot of people care about that a lot, and for those folks, $1,599 sounds totally reasonable considering that the only other 5K option on the market is that buggy LG UltraFine.\nFor those of you that don’t care about pixel-perfect macOS with no scaling, $1,599 will sound frankly ridiculous, and there are lots of other fascinating displays to think about, including a number of OLEDs, some neat ultrawides, and plenty of displays that support higher refresh rates.\nThe other reasons you might be thinking about spending $1,599 on the Studio Display are the webcam, mic, and speakers, of which Apple is very proud. There’s an entire A13 Bionic chip powering the audio and camera system here, same as the iPhone 11, and the camera itself is a 12-megapixel sensor with an f/2.4 lens that’s theoretically comparable to the front camera on an iPhone or iPad. There are three mics and six speakers: four woofers and two tweeters, which Apple says can support spatial audio.\nLet’s start with the good stuff: the mic and speakers sound great. Really, really great. You can adjust the three-mic array to do voice isolation or not in Control Center, and you’ll sound as good or better on calls as any conference mics I’ve ever heard. The only reason you might need something better is if you’re regularly recording podcasts or streaming to an audience. The speakers are loud and deep, and while I am not entirely convinced that spatial audio in music is anything but a gimmick and even less convinced that anything like “spatial” audio can be produced by a stereo speaker system located in front of you, Apple is certainly processing its heart out here — if you play an Atmos clip, you’ll hear some dramatic swooshing about, which is always fun. These are the best built-in speakers I’ve ever heard.\nThe bad part is that I have no idea what’s going on with this webcam. Apple has a long history of producing amazing images with 12-megapixel sensors and A-series chips, and for some reason, this thing just looks awful.\nThe webcam looks awful in good light and downright miserable in low light\nActually, it looks awful in good light and downright miserable in low light. I’ve tried it connected to the Mac Studio and on my MacBook Pro running macOS 12.3, and on both machines, it produces a grainy, noisy image with virtually no detail. I tried it in FaceTime, in Zoom, in Photo Booth, in QuickTime — you name it, it’s the same sad image quality. Turning off the Center Stage feature that follows you around the room doesn’t help. Turning portrait mode on and off doesn’t help.\nI have sent Apple countless screenshots in various lighting conditions and a full sysdiagnose of our Mac Studio and Studio Display review units, and at publish time, all Apple spokesperson Jennie Orphanopoulos could tell me was that Apple’s team had “looked into the images you shared, and discovered an issue where the system is not behaving as expected. We’ll be making improvements in a software update.”\nThere’s no timeline on that update, nor any details on what it might improve.\nOur rule has always been to review products based on what we have in front of us and never against the promise of a future software update, and based on what I have in front of me, I simply wouldn’t want to use this camera. The cameras on the new MacBook Pro and M1 iMac are far superior to what we’re seeing here, and an iPhone front camera is even better still. I’m hopeful Apple will improve things via software in the future, but I would not spend $1,599 on this display until that actually happens.\nSome other things worth briefly touching on: the $300 nanotexture option smudges easily and is hard to clean, but there are people on the Verge team like our video director Becca Farsace who absolutely love it. It’s one of those things that you probably already know if you need it because it’s decidedly for professional users with demanding color applications.\nThe Studio Display comes with a nice braided Thunderbolt 4 cable in the box; that same cable can deliver 96W of power to a laptop, enough to charge my 16-inch MacBook Pro. That cable connects to the Thunderbolt 4 port on the rear of the display; there are three USB-C ports next to it for peripherals. Ports! People like ‘em.\nPorts! People like ‘em\nIt’s rare that an Apple product is such a miss, but the Studio Display in its current state is a confounding miss. If the webcam actually delivered on the promise of iPhone- or iPad-quality video, it would at least prompt a reasonable debate about whether having local dimming or HDR or variable refresh rate was worth it, but as it stands, you’re getting a less-than-state-of-the-art display and a bad webcam. If you are adamant about having a 5K display connected to your Mac, it might still be the best option. If not, I think you are much better off looking elsewhere."
    },
    {
      "url": "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
      "text": "A glass screen protector is one of a few essential accessories that every Switch 2 owner should make, along with buying a protective case for the console. In fact, it should be a priority to stick one onto the console’s screen as soon as possible to avoid accidental scratches.\nI tested a bunch of Switch 2 screen protectors, and these are the best\nMake sure it’s glass, not plastic, then decide if you want it to be glossy or matte.\nMake sure it’s glass, not plastic, then decide if you want it to be glossy or matte.\nI’ve been installing and removing Switch 2 screen protectors to test others on my console at an alarming rate, more than any sane person should, and here are the most important takeaways:\n- Do not buy a flimsy plastic screen protector. They won’t protect your Switch 2 enough.\n- It’s impossible to tell different brands’ protectors apart once they’re on your screen; product packaging and the installation process are the biggest differences (as well as the key factors that increase cost).\n- Some protectors are glossy and some are anti-reflective, each with its own tradeoffs. For my money, glossy is the way to go. The matte finish looks good, but it reduces the screen’s vivid quality and its viewing angles.\nOf the options below, it’s easiest to recommend amFilm’s three-pack of glossy screen protectors. Not only is the pack incredibly affordable ($7.19 from Amazon), but the tray also allows for perfect alignment of the glass protector for easy, bubble-free installation. I’ve used this company’s screen protectors on various gadgets for years, and I particularly like its glossy option over the matte finish, since it lets the Switch 2’s screen fully shine through.\nWhat I’m looking for in a Switch 2 screen protector\nThe only way to test a screen protector is to go through the installation process for each option. We use the tools included to ensure a proper installation, analyze the fit and finish, and then remove it very, very carefully to proceed with the next candidate.\nEvery screen protector we mention in this buying guide comes with more than one (sometimes three!), which is good because they can sometimes break in the line of duty. We’ll note how many you get with your purchase, as well as what tools are included to make the installation process simpler.\nAll of the protectors in this buying guide claim to be a 9 on the Mohs hardness scale, meaning they should be tough to crack. I don’t put those particular claims to the test because I’m using my personal Switch 2, paid for with my money. Also, all models included feature an oleophobic coating to resist oils from fingerprints.\nI’m ensuring that, during installation, screen protectors fit the entirety of the Switch 2’s screen, including its bezel. I haven’t encountered one yet during testing that doesn’t fit.\nMy go-to screen protector brand for years has been amFilm. Three glossy tempered glass sheets come in the box, and the tools make installation fairly simple. JSAUX’s model is just as good based on my testing, and just as affordable.\nIn keeping up with some brands that offer faster installations, amFilm offers a two-pack of glossy protectors that includes a “OneTouch” tray. Remove the protector’s bottom film, attach the tray to your device, and then press gently on the protector until it’s fully applied.\nDbrand’s Prism 2.0 includes two glass protectors for the Switch 2, each nestled into plastic cases that fit perfectly around the edges of the console (with the Joy-Con 2 removed). $34.99 is expensive for two protectors, but if simplicity and elegant packaging trump value, then this is a good option.\nGenki offers a cheaper alternative to Dbrand with the Aegis Shield. It includes two protectors, and the installation process is nearly identical: just align the plastic frame with the console, pull the tab, and run your finger across the exposed section of the frame. Spigen makes a similar product that costs $24.99 for a two-pack.\namFilm two-pack of matte screen protectors\nLet’s start with one of the most affordable options if you want to go the matte-textured route. AmFilm sells a two-pack of protectors at Amazon for $8.99. The set includes a plastic frame that serves as a guide to align the protector just right. JSAUX makes a similar product that’s the same price.\namFilm OneTouch two-pack of matte screen protectors\nAmFilm also sells a two-pack with a OneTouch frame for easier installation. Again, keep in mind that opting for matte over glossy will reduce glare, but at the cost of viewing angles as well as the full vivid quality of the Switch 2’s screen. That’ll be an acceptable tradeoff for some, but not all people.\nWhat’s coming next?\nJSAUX is launching a new screen protector in August called the Obsidian AR. I’ll be testing this model soon. The company claims that it offers vastly better glare resistance as well as enhanced brightness and color accuracy compared to standard protectors.\nUpdate, August 15th: Adjusted prices as needed, and added a link to our best Switch 2 accessories buying guide."
    }
  ],
  "argos_summary": "The article reviews a pre‑production sample of Jsaux’s Obsidian AR anti‑glare screen protector for the Switch 2, noting modest glare reduction that barely improves gameplay visibility. The author highlights a dead roach in the ceiling that became visible through the protector’s slightly dimmed LED illumination. While the protector offers a glossy finish and a PVD coating similar to Apple’s displays, the author questions whether the $21.99 price is justified compared to cheaper tempered glass options. Overall, the review suggests the product’s benefits are marginal and may not warrant the premium cost.",
  "argos_id": "99GH6K87D"
}