{
  "url": "https://finance.yahoo.com/news/navios-nmm-q2-2025-earnings-143126486.html",
  "authorsByline": "Motley Fool Transcribing, The Motley Fool",
  "articleId": "232f439dfa19432a86859edb97244257",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/motleyfool.com/387c9b6f44ca07885aabb34c4f219b27",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-21T14:31:26+00:00",
  "addDate": "2025-08-21T15:02:24.553515+00:00",
  "refreshDate": "2025-08-21T15:02:24.553517+00:00",
  "score": 1.0,
  "title": "Navios NMM Q2 2025 Earnings Call Transcript",
  "description": "Full Conference Call Transcript Angeliki Frangou: Thank you for joining us for Navios Maritime Partners Second Quarter 2025 Earnings Conference Call. With us today from the company are Chairwoman and CEO, Ms. Angeliki Frangou, Chief Operating Officer, Mr. Stratos Desypris, Chief Financial Officer, Mrs. Erifili Tsironi, and Chief Trading Officer, Mr. Vincent Vandewalle. As a reminder, this conference call is being webcast.",
  "content": "Angeliki Frangou: Good morning, all, and thank you for joining us on today's call. I am pleased with the results for the 2025 in which we reported revenue of $327.6 million and an EBITDA of $178.2 million and net income of $69.9 million. Earnings per common unit were $2.34 for the quarter. Global economies have been surprisingly robust given their uncertain macro environment. In addition, we are witnessing the creation and reshaping of new trade patterns with longer distances due to the war in Ukraine and Russia's continued attacks in the Red Sea and a new and evolving world tariff regime. As a result, the shipping market generally is healthy. Please turn to Slide six.\n\nFrangou will offer opening remarks. Next, Mr. Desypris will give an overview of Navios Partners segment data. Next, Mrs. Tsironi will give an overview of Navios Partners financial results. Mr. Vandewalle will provide an industry overview. Lastly, we'll open the call to take questions. Now I turn the call over to Navios Partners' Chairwoman and CEO, Mrs. Angeliki Frangou. Angeliki?\n\nThis conference call could contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 about Navios Partners. Forward-looking statements are statements that are not historical facts. Such forward-looking statements are based upon the current beliefs and expectations of Navios Partners' management and are subject to risks and uncertainties which could cause actual results to differ materially from the forward-looking statements. Such risks are more fully discussed in Navios Partners' filings with the Securities and Exchange Commission. The information set forth herein should be in light of such risks. Navios Partners does not assume any obligation to update the information contained in this conference call. The agenda for today's call is as follows: First, Ms.\n\nAngeliki Frangou: Thank you for joining us for Navios Maritime Partners Second Quarter 2025 Earnings Conference Call. With us today from the company are Chairwoman and CEO, Ms. Angeliki Frangou, Chief Operating Officer, Mr. Stratos Desypris, Chief Financial Officer, Mrs. Erifili Tsironi, and Chief Trading Officer, Mr. Vincent Vandewalle. As a reminder, this conference call is being webcast. To access the webcast, please go to the Investors section of Navios Partners' website at www.naviosmlp.com. You'll see the webcast link in the middle of the page, and a copy of the presentation referenced in today's earnings conference call will also be found there. Now I will review the Safe Harbor statement.\n\nNavios Partners is a leading publicly listed shipping company with 173 vessels. These vessels have an average age of ten years and are in three different segments and 15 asset classes. As you can see, the vessel value is approximately equal in each sector. We ended the second quarter with $389 million of cash on our balance sheet. Our net LTV as of the end of the second quarter was calculated at 35.3%, essentially unchanged from the last quarter. Please turn to Slide seven. We generated $96 million in gross sales proceeds from the sale of three vessels with an average age of 16.5 years.\n\nWe purchased two Aframax LR2 tankers for $133 million and we expect delivery of these vessels in 2027. We also took delivery of one new building Aframax LR2 target fixed for $27,446 net per day for the next five years. We recently took swift action in response to OFAC sanctions on one of our counterparties. On 07/03/2025, the U.S. Department of Treasury's Office of Foreign Assets Control added a counterparty of Navios to its sanction list. The following day, we terminated contracts for two related VLCCs built in 2020 and 2021. That will therefore chartered out each at a daily net rate of $27,456 ending in October 2030, and February 2031.\n\nSwift action allowed us to redeploy these vessels into a healthy spot market. We anticipate entering into long-term charters for these vessels at an appropriate time. For the remaining six months of 2025, contracted revenue exceeds estimated total cash expense by $56 million. We have 6,838 remaining open and index days, about 25% of our available days, so we have significant cash generative opportunities. Please turn to Slide eight. Where we outline our return of capital program. Under our dividend program, we paid $0.20 dividend per unit annually. In 2025, we paid a dividend of $1 million. In addition, so far this year through August 13, 2025, we repurchased 716,575 common units for $27.8 million.\n\nIncluding dividends, we returned a total of $30.8 million in 2025. Under the entire unit repurchase program, we invested $52.8 million through 08/13/2025 and repurchased 1,206,530 units or about 4% of our common units outstanding at the time we commenced the program. As we show on the slide, we estimate that we effectively returned an additional $3.8 per unit of value of NAV to unitholders through these purchases. As of 08/13/2025, we had $47.2 million available under our unit repurchase program. The volume and timing of further repurchases will be subject to general market and business conditions, working capital requirements, and other investment opportunities among other factors. Please turn to Slide nine. We outline the challenges we have been addressing.\n\nWe assemble our team regularly to dive into the details of emerging information in an attempt to understand how values and risks are evolving. On the top right part of the slide, we outlined how we are addressing the uncertain market and the things we have accomplished. The $3.1 billion in contracted revenue stems from our action in past markets, where sentiment allowed us to enter into long-term charters. We are also focused on our interest rate risk. We have been hedging this risk either by entering into fixed-rate financing arrangements or through hedges that do not require posting additional collateral. At the bottom of the slide, we show how our fleet has evolved through selected metrics.\n\nAs you can see, our fleet size and age are about the same as they were at the year-end 2022. However, about 28% of our fleet was acquired in the past four and a half years. We maximize energy efficiency by maintaining a fleet of useful vessels with the latest technology. On the financial side, we focus on deleveraging and reduced net LTV from 45% at the end of 2022 to 35.3% at the end of the second quarter of 2025. I now turn the presentation over to Mr. Stratos Desypris, Navios Partners' Chief Operating Officer. Stratos?\n\nStratos Desypris: Thank you, Angeliki, and good morning all. Please turn to Slide 10. Details our operating free cash flow potential for 2025. We fixed 75% of available days at the net average rate of $24,989 per day. Contracted revenue exceeds estimated total cash expense by about $56 million, and we have 6,858 remaining open or index-linked days that should provide substantial additional cash flow. So that you can perform your own sensitivity analysis. On the right side of the slide, we provide our 27,615 available days by vessel type. Please turn to Slide 11. We are constantly renewing our fleet in order to maintain the yacht profile.\n\nReduce our carbon footprint by modernizing our fleet, benefiting from new technologies and advanced environmentally friendly features. During the second quarter, we acquired two new building Aframax LR2 vessels, which cost $133 million. Vessels are expected to be delivered in 2027. In June 2025, we took delivery of one Aframax LR2 vessel that has been chartered out for five years at an average net daily rate of $27,446. We have 22 additional new building vessels delivering to our fleet through 2028, representing $1.4 billion of investment. Based on our financing, both agreed and in process, we have about $150 million of equity remaining to be paid.\n\nIn containerships, we have four vessels to be delivered, with a total acquisition price of about $400 million. We have mitigated the residual value risk with long-term creditworthy charters expected to generate about $300 million in revenue over a five-year average charter duration. In tankers, we have 18 vessels to be delivered, a total price of approximately $1 billion. We chartered out 12 of these vessels for an average period of five years, expected to generate aggregate contracted revenue of about $600 million. We have also been opportunistically selling older vessels. In 2025, we sold six vessels, three dry bulk and three container ships, with an average age of 18 years, for a total of about $130 million.\n\nMoving to slide 12, we have a strong backlog of contracted revenue that will be lower than previous years, which creates visibility in an uncertain environment. Our contracted revenue was reduced by about $150 million due to the sale of one transshipment vessel and the termination of the contracts on two VLCC vessels that are currently employed in the healthy spot market. Post these events, our total contracted revenue amounts to $3.1 billion. $1.2 billion relates to our tanker fleet, $200 million relates to our dry bulk fleet, and $1.7 billion relates to our containerships. Charters are extending through 2037 with a diverse group of quality counterparties.\n\nI now pass the call to Erifili Tsironi, our CFO, who will take you through the financial highlights. Erifili?\n\nErifili Tsironi: Thank you, Stratos, and good morning, all. I will briefly review our unaudited financial results for the second quarter and the first half ended 06/30/2025. The financial information is included in the press release and is summarized in the slide presentation available on the company's website. Moving to the earnings highlights on Slide 13, total revenue for 2025 decreased by 4.3% to $328 million compared to $342 million for the same period in 2024 due to lower fleet combined time charter equivalent rate, available days, and revenue from freight voyages. Our combined TCE rate for 2025 decreased by 1.5% to $23,040 per day, and our available days decreased by 0.8% to 13,388 days compared to Q2 2024.\n\nIn terms of sector performance, the TCE rate for our container fleet increased by 3.6% to $31,316 per day. In contrast, the TCE rate for our dry bulk and tanker fleet was 13.9% and 4.6% lower respectively at $15,470 per day for dry bulk and $26,537 per day for tankers. EBITDA for the second quarter of 2025 was adjusted as explained in the Slide footnote. Adjusted EBITDA for Q2 2025 decreased by $17 million to $173 million compared to Q2 2024.\n\nThe decrease is driven primarily by a $15 million decrease in time charter and voyage revenues, a $3 million increase in general and administrative expenses, and a $9 million increase in vessel operating expenses as a result of a 5.6% increase in OpEx days and a 4.5% increase in our combined OpEx rate to $7,108 per day. Also as a result of the change in the composition of our fleet. Adjusted EBITDA was positively affected by a $9 million decrease in time charter and voyage expenses due to fewer freight voyage days in 2025. Adjusted net income for Q2 2025 was $64 million compared to $94 million in Q2 2024.\n\nThe decrease is mainly due to a $17 million decrease in adjusted EBITDA, a $9 million increase in depreciation and amortization, and a $3 million increase in interest expense and finance cost net. Adjusted earnings and earnings per common unit for Q2 2025 were $2.15 and $2.34 respectively. Total revenue for 2025 decreased by $29 million to $632 million compared to the same period in 2024. The decrease was mainly a result of lower combined TCE rate, available days, and revenue from freight voyages. Our combined TCE rate for 2025 was $22,154 per day. In terms of sector performance, the TCE rate for our containers increased by 2.9% to $30,906 per day, compared to the same period in 2024.\n\nIn contrast, our dry bulk and tanker TCE rates were approximately 12.6% and 5.9% lower respectively. TCE rates for our dry bulk vessels stood at $14,070 per day and for our tankers $26,316 per day for 2025. Adjusted EBITDA for 2025 decreased by $28 million to $326 million. The decrease was primarily due to a $29 million decrease in time charter and voyage expenses, a $4 million increase in general and administrative expenses, and a $16 million increase in vessel operating expenses, mainly as a result of a 5.2% decrease in OpEx days and a 3.6% increase in our combined OpEx rate to $7,045 per day. Also as a result of the change in the composition of our fleet.\n\nAdjusted EBITDA was positively affected by a $21 million decrease in time charter and voyage expenses due to fewer freight voyage days in 2025. Adjusted net income for 2025 was $112 million, fifty-four million lower than in 2024. The decrease is mainly due to a $28 million decrease in adjusted EBITDA, a $17 million increase in depreciation and amortization, and a $7.5 million increase in interest expense and finance cost net. Adjusted earnings and earnings per common unit for 2025 were $3.73 and $3.72 respectively. Turning to slide 14, I will briefly discuss some key balance sheet data. As of 06/30/2025, cash and cash equivalents including restricted cash and time deposits in excess of three months were $389 million.\n\nDuring 2025, we paid $107 million under our new building program net of debt. We concluded the sale of three vessels for $34 million, adding about $22 million cash after debt repayment. Long-term borrowings, including the current portion, net of deferred fees, increased to $2.2 billion following the delivery of five vessels during the 33.9%. Slide 15 highlights our debt profile. We continue to diversify our funding sources between bank debt and leasing structures. Following our $88 million interest rate hedge in Q1 2025, 29% of our debt and bareboat liabilities have a fixed interest rate at a no lien rate of 5.5%. The hedge mechanism was part of the original loan agreement and does not require additional collateral.\n\nWe have also mitigated part of the increased interest rate cost by using the average margin for our drawn floating rate debt and bareboat liabilities to 1.9%. I would like to note that the average margin for the committed undrawn floating rate debt of our new building program is 1.4%. Our maturity profile is staggered with no significant balance due in any single year. In Q2 2025, Navios Partners completed three facilities for a total amount of $390 million. I now pass the call to Vincent Vandewalle, Navios Partners' Chief Trading Officer, to take you through the industry section. Vincent?\n\nVincent Vandewalle: Thank you, Erifili. Please turn to Slide 17. Geopolitical developments continue to shift worldwide trading routes caused by the tariff war, restricted Suez Canal passages, Ukraine war, and implementation of the USTR. Announced tariffs are not expected to have a significant effect on tankers and dry bulk trade apart from grain and steel. The heaviest tariff impacts will be on container ships and car carriers. The Red Sea entrance leading to the Suez Canal continues to operate at restricted transit levels, particularly since the sinking of two ships transiting the waterway in July. The Ukraine war is shifting trading patterns with limited grain export out of the Black Sea and benefiting export out of Brazil and the USA.\n\nAnd Russian crude export diverted to Asia due to tighter sanctions. On April 17, USTR released a revised section 301 fee proposal targeting Chinese vessel operators and Chinese-built ships with extra port fees when calling U.S. ports. These fees are to take effect from October 2025. Please turn to Slide 19 for the review of the dry bulk industry. Dry bulk trade softened in the first half of 2025 due to weather patterns, typical seasonality, increased domestic coal production in China and India, and slower Chinese grain imports.\n\nAs a result, the Baltic Dry Index average declined 30% in the first half of 2025 versus the first half of 2024, but has risen 37% since June, standing at 2,044 on August 15. Continued recovery is expected through Q3, driven by Capes due to seasonally higher volumes of iron ore and bauxite. Please turn to Slide 20. The current order book stands at 11% of the fleet. Net fleet growth is expected to be 3.1% in 2025, vessels over 20 years of age are about 11% of the total fleet, which is slightly higher than the order book.\n\nIn concluding our dry bulk sector review, slowing demand growth for natural resources may be balanced by restrictions in transiting the Red Sea, long-haul trades of bauxite and iron ore from West Africa to Asia, and a low pace of new building deliveries. This should support higher freight rates as the freight future market currently indicates, particularly for Capes. Please turn to Slide 22 for the review of the tanker industry. World GDP is expected to grow by 3% in 2025, based on the IMF July forecast. The IEA projects a 700,000 barrels per day increase in global oil demand in 2025.\n\nCrude tanker earnings have risen as OPEC unwinds its 2.2 million barrels per day voluntary production cuts, more crude is exported from Brazil and the USA, and as Asian refineries replace Russian and Iranian barrels with non-sanctioned imports. Overall, the political environment along with the normal seasonality, the reduction of the fleet due to sanctioned vessels, low global oil inventories, and additional production from OPEC and Atlantic basin suppliers, should support crude freight rates. Please turn to Slide 23. The U.S. Office of Foreign Asset Control, OFAC, continues to issue new sanctions targeting Russia and Iran's oil revenue. The total number of sanctioned vessels is now about 13% of the tanker fleet.\n\nBoth China and India have said that they will not allow sanctioned vessels to discharge. Please turn to Slide 24. Seaborne crude and products trades continue to be affected by the war in Ukraine. Both the crude and the product market rates remain at healthy levels. Please turn to Slide 25. The VLCC fleet had zero fleet growth in 2024 and is expected to grow 0.4% in 2025. The current order book is 12.3% of the fleet following a record ordering spree in 2024. Vessels over 20 years of age are about 20% of the total fleet. Turning to Slide 26. Production tanker net fleet growth was 1.7% for 2024, is expected to increase by 5.8% in 2025.\n\nThe current product tanker order book is 19.7% of the fleet compared to 18.3% of the fleet, which is 20 plus years of age. Concluding the tanker market overview, tanker rates continue at healthy levels. The combination of moderate growth in global oil demand, sanctions reducing the numbers of available vessels, new longer trading routes for both crude and products, and the IMO 2023 regulations should provide healthy tanker earnings going forward. Please turn to Slide 28 for a review of the container industry. Container ship rates remained firm because of the Red Sea, TEU miles increased by about 19% in 2024.\n\nThe continuous Red Sea disruption will lead to an expected TEU mile increase of 2.7% this year, providing healthy time charter rates while ships avoid the waterway. However, continuing record new building ordering and record fleet growth should eventually modify these gains. Tariffs, particularly the outcome of the tariff negotiations on U.S. imports of Chinese goods, will have a significant effect on demand and trade should they remain at recently announced levels. Turning to Slide 29. The current order book stands at 31% compared to 0.5% of the fleet 20 years of age or older. About 80% of the order book is for 10,000 TEU vessels or larger.\n\nAlthough trade is expected to grow by 2.6% in 2025, net fleet growth is expected to grow by 6.7% in 2025, following a 10% net fleet growth in 2024. Concluding the container market overview, if the contemplated tariffs between the U.S. and China remain in place, this may have a negative effect on demand and trade. However, the expected world GDP growth of 3% for 2025 provides a somewhat positive counterpoint. This concludes our presentation. I would now like to turn the call over to Angeliki for her final comments. Angeliki?\n\nAngeliki Frangou: Thank you, Vincent. This completes our formal presentation and we open the call to questions.\n\nOmar Nokta: We'll take our first question from Omar Nokta with Jefferies. Please go ahead. Your line is open. Hi, Angeliki. Hi, everyone. Good afternoon. And good morning. Yes. So thanks for the update. Obviously, a very good amount of detail, and it looks like a good amount of stuff has taken place for Navios. And maybe just a couple of questions from my side. Perhaps first, on those two VLCCs. Were unchartered to Versus tankers. Now, that entity now being sanctioned, you've been able to terminate those contracts. It looks like it's gonna perhaps work out nicely given the setup for the sector. I just wanted to ask, you're planning to trade those on the spot market.\n\nYou mentioned looking to put them on charter at some point down the line. Just wanted to ask in terms of your timing of that. When do you when would you wanna put those away on Charter? And then also, if for any reason, that entity were to be removed from that list, the OFAC list, would that in some way compel you to have to give them back to that company and resume those leases?\n\nAngeliki Frangou: Excellent. Let's start with the real I will say one thing, Omar. First of all, I have to give a big congratulation on this to our risk management team. Because to be able to terminate immediately, practically, that is a work that has been done well in advance with the team that was organized that gave us the opportunity immediately to terminate, take the vessels back, and be able to charter them in a healthy spot market. And this is also the team that monitors all this time all the trade, every loading, every discharging, every movement, and I am very proud of the team. The reality is that this is a healthy market.\n\nAnd we will be open to trade in this market and I think Q4 will be it looks to be shaping very well. But always, look at opportunities at the right time to put vessels on longer durations. I mean, one year over fifty thousand and longer duration is let's see. We are monitoring, and we'll take the opportunity at the right time.\n\nOmar Nokta: Okay. Thank you. And then just to make sure that those you're free and clear of those contracts now, you can do what you want with these two ships. And I'm sorry. Because you asked another question.\n\nAngeliki Frangou: The other question is that the moment you cancel the contract, that's it. You have zero Even though I don't see that easily that counterparty will be back, but it cannot claim or come after because it's a clear contract and that cancellation and is a termination of the contract is irreversible.\n\nOmar Nokta: Okay. Very good. Thank you. Yeah. So that looks very unique, and perhaps a compelling opportunity here. Then obviously, just in terms of the fleet, you continue to fine-tune it, which as you've said, is part of the core strategy of Navios. Selling old and investing in newer capacity. The two, I guess two on that. The LR2s you've ordered, those are not chartered. It doesn't look like, although the previous LR2s have been. Is it the expectation that you will fix those out ahead of delivery? That's one. Then two, given that the two older Panamax containerships you sold, look to be very good prices. I would think at least relative to what's in people's models.\n\nDo you think about the other ships that roll off charter in that vessel class? Are those effectively sales candidates? Or do you intend to renew those contracts, or extend them on new charters if you can. Thank you.\n\nAngeliki Frangou: I mean, Omar, I will say we are very surprised with the strength of the container market given the order book and everything. And to be honest, we are here to take advantage of the opportunity. If you see the sale of the two container ships, the significance is also that you are selling vessels almost a year forward. And with a survey due at that time. So for us, this is a beautiful forward, basically, you know, selling 18-year-old almost vessels is a great idea and redeploying cash in a different asset. In today's market, we will not buy a container without a charter.\n\nOn the tanker sector, I will say because we have not really had a lot of exposure on base almost everything fixed. We felt that the market made sense and we do not exclude we can do a longer-term deal but we feel comfortable on that vessel to be in that portfolio today. Without a charter. We have always been investigating and we may fix it on a longer term, but we feel comfortable in that position.\n\nOmar Nokta: Very good. Thank you, Angeliki. I'll turn it over. Thank you.\n\nOperator: And there are no further questions on the line at this time. I'll turn the program back to Angeliki for any additional or closing remarks.\n\nAngeliki Frangou: Thank you. This completes our quarterly results and questions.\n\nOperator: Thank you. And this concludes the Navios Maritime Partners earnings call. Thank you again for your participation and you may now disconnect.\n\nThe Motley Fool’s analysts are tracking a massive shift in U.S. tech. Over $1.5 trillion is already flowing into infrastructure, AI, and advanced manufacturing… and the number keeps climbing.\n\nFollowing a major tariff policy shift, a new AI Gold Rush is taking shape, and we think the real winner is a company 1/100th the size of NVIDIA.\n\nIt builds the tech infrastructure that Apple, OpenAI, and others suddenly can’t live without. We just released a full write-up on this under-the-radar stock — and why now might be the exact moment to move.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.\n\nThe Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nNavios NMM Q2 2025 Earnings Call Transcript was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/legal/terms-and-conditions/fool-rules",
    "https://www.fool.com/earnings/call-transcripts/2025/08/21/navios-nmm-q2-2025-earnings-call-transcript/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d50281be-0faf-4627-abd2-a5b66b683694&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fa-sa-made-in-america%3Faid%3D11109%26source%3Disaeditxt0001141%26ftm_cam%3Dsa-made-in-america%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18009&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=ce824830-80a7-4751-909a-9f6fd2142543",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d50281be-0faf-4627-abd2-a5b66b683694&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fa-sa-made-in-america%3Faid%3D11109%26source%3Disaeditxt0001141%26ftm_cam%3Dsa-made-in-america%26ftm_pit%3D18009%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DNone&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=ce824830-80a7-4751-909a-9f6fd2142543"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "lower fleet combined time charter equivalent rate",
      "weight": 0.06318111
    },
    {
      "name": "healthy time charter rates",
      "weight": 0.062334873
    },
    {
      "name": "available vessels",
      "weight": 0.061276004
    },
    {
      "name": "Production tanker net fleet growth",
      "weight": 0.060483743
    },
    {
      "name": "Net fleet growth",
      "weight": 0.059879135
    },
    {
      "name": "net fleet growth",
      "weight": 0.059879135
    },
    {
      "name": "vessel operating expenses",
      "weight": 0.05881232
    },
    {
      "name": "sanctioned vessels",
      "weight": 0.058744088
    },
    {
      "name": "Vessels",
      "weight": 0.05821628
    },
    {
      "name": "vessels",
      "weight": 0.05821628
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Earnings Calls"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.986328125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9716796875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9208984375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.50048828125
    }
  ],
  "sentiment": {
    "positive": 0.33058816,
    "negative": 0.075017326,
    "neutral": 0.5943945
  },
  "summary": "Navios Maritime Partners (NMM) has reported its second quarter 2025 earnings results, with revenue of $327.6 million and an EBITDA of $178.2 million, and net income of $69.9 million. The company also highlighted the health of global economies and the creation of new trade patterns due to the war in Ukraine and Russia's continued attacks in the Red Sea. This conference call could contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are not historical facts and are subject to risks and uncertainties which could cause actual results to differ from the forward-statement. Navios Partners ended the second quarter with $389 million of cash on its balance sheet. So far, the company has repurchased 716,575 common units for $27.8 million in addition to dividends, returned $30 million in dividends, and took delivery of two Aframax LR2 tankers.",
  "shortSummary": "Navios Partners' Q2 2025 results, highlighted by Angeliki Frangou and other top executives, include:",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "1f89a7ec25804256a5f3ae18436f4b28",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/earnings/call-transcripts/2025/08/21/navios-nmm-q2-2025-earnings-call-transcript/",
      "text": "Image source: The Motley Fool.\nDate\nThursday, Aug. 21, 2025 at 8:30 a.m. ET\nCall participants\nChairwoman and Chief Executive Officer -- Angeliki Frangou\nChief Operating Officer -- Stratos Desypris\nChief Financial Officer -- Erifili Tsironi\nChief Trading Officer -- Vincent Vandewalle\nNeed a quote from a Motley Fool analyst? Email [email protected].\nTakeaways\nRevenue -- Total revenue for 2025 decreased by 4.3% to $328 million compared to $342 million for 2024.\nEBITDA -- Adjusted EBITDA decreased by $17 million to $173 million, primarily due to lower revenue, higher general and administrative expenses, and increased vessel operating expenses.\nNet income -- Adjusted net income was $64 million compared to $94 million in Q2 2024.\nEarnings per common unit -- Adjusted earnings and earnings per common unit for Q2 2025 were $2.15 and $2.34 respectively.\nCombined TCE rate -- Combined TCE rate for 2025 decreased by 1.5% to $23,040 per day; container TCE up 3.6% to $31,316 per day; dry bulk TCE 13.9% lower at $15,470 per day compared to Q2 2024; tanker TCE 4.6% lower at $26,537 per day compared to Q2 2024. Our available days decreased by 0.8% to 13,388 days compared to Q2 2024.\nCash and cash equivalents -- Including restricted cash and time deposits in excess of three months were $389 million for the period.\nNet loan-to-value (LTV) -- 35.3% at the end of Q2 2025, down from 45% at year-end 2022.\nVessel sales and acquisitions -- Six vessels sold in 2025 for approximately $130 million; $96 million in gross proceeds from three vessels sold; two Aframax LR2 tankers ordered for $133 million, with delivery expected in 2027.\nNewbuild program -- 22 additional newbuilds scheduled for delivery through 2028; $1.4 billion investment in newbuilding vessels delivering through 2028, with approximately $150 million equity remaining to be paid.\nContracted revenue -- $3.1 billion in total contracted revenue as of Q2 2025; contracted revenue reduced by about $150 million due to the sale of one transshipment vessel and the termination of contracts on two VLCC vessels; comprised of $1.2 billion in tankers, $200 million in dry bulk, and $1.7 billion in containerships as of Q2 2025; charters extend through 2037.\nUnit repurchase and dividend -- 716,575 units repurchased year-to-date in 2025, totaling $27.8 million; $0.20 annual dividend per unit paid, resulting in $1 million in total dividends; cumulative $52.8 million invested in unit repurchases through Aug. 13, 2025, since inception, with $47.2 million remaining authorized under the unit repurchase program as of Aug. 13, 2025.\nOFAC sanction response -- Immediate termination of two VLCC contracts after counterparty designation; vessels redeployed to the spot market, with management monitoring timing for potential long-term charters.\nOpen and index days -- 6,858 days remain open or index-linked in 2025, approximately 25% of total available days, representing upside cash generation potential.\nInterest rate management -- 29% of debt and bareboat liabilities fixed at 5.5%; floating debt average margin was 1.9% as of Q2 2025; undrawn committed floating debt for newbuilds was 1.4% as of Q2 2025.\nDebt profile -- Long-term borrowings, including the current portion, increased to $2.2 billion as of Q2 2025; three credit facilities totaling $390 million were closed in Q2 2025.\nSummary\nNavios Maritime Partners(NMM 2.03%) reported lower TCE rates and reduced available days, while maintaining a strong liquidity position and disciplined capital return to unitholders. The company took swift risk management actions by terminating two VLCC charters in response to OFAC sanctions in July 2025, redeploying these vessels in the spot market and preserving future chartering flexibility. Asset sales of older vessels combined with long-term newbuild investments illustrate an ongoing fleet optimization strategy focused on newer, more efficient ships. Contracted revenue stands at $3.1 billion as of Q2 2025 and is diversified across tanker, dry bulk, and container segments, supporting earnings visibility into 2037. Debt reduction and interest rate hedging initiatives have improved the leveraged profile and contributed to risk mitigation efforts.\nChairwoman Frangou credited the risk management team for \"terminate immediately, practically\" the OFAC-impaired VLCC contracts, enabling prompt vessel redeployment and contract flexibility.\nManagement highlighted that repurchased units delivered \"an additional $3.8 per unit of NAV value to unitholders through these purchases\" in 2025.\nChief Trading Officer Vandewalle noted that the Baltic Dry Index average declined 30% in the first half of 2025 versus the first half of 2024, but has risen 37% since June, reaching 2,044 on Aug. 15, 2025, indicating positive momentum in dry bulk shipping rates.\nContainership market resilience \"surprised\" management despite a record order book, prompting opportunistic vessel sales to capitalize on current high valuations.\nIndustry glossary\nOFAC: U.S. Department of Treasury's Office of Foreign Assets Control, which administers and enforces economic and trade sanctions.\nVLCC: Very Large Crude Carrier, a type of large tanker vessel used for transporting crude oil.\nTCE (Time Charter Equivalent): A standard shipping industry metric to measure daily earnings from vessel operations, net of voyage expenses.\nOpEx days: Number of days vessels are owned and operational, impacting total operating expenses for the fleet.\nTEU: Twenty-foot Equivalent Unit, the standard measure for container ship capacity.\nFull Conference Call Transcript\nAngeliki Frangou: Thank you for joining us for Navios Maritime Partners Second Quarter 2025 Earnings Conference Call. With us today from the company are Chairwoman and CEO, Ms. Angeliki Frangou, Chief Operating Officer, Mr. Stratos Desypris, Chief Financial Officer, Mrs. Erifili Tsironi, and Chief Trading Officer, Mr. Vincent Vandewalle. As a reminder, this conference call is being webcast. To access the webcast, please go to the Investors section of Navios Partners' website at www.naviosmlp.com. You'll see the webcast link in the middle of the page, and a copy of the presentation referenced in today's earnings conference call will also be found there. Now I will review the Safe Harbor statement.\nThis conference call could contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 about Navios Partners. Forward-looking statements are statements that are not historical facts. Such forward-looking statements are based upon the current beliefs and expectations of Navios Partners' management and are subject to risks and uncertainties which could cause actual results to differ materially from the forward-looking statements. Such risks are more fully discussed in Navios Partners' filings with the Securities and Exchange Commission. The information set forth herein should be in light of such risks. Navios Partners does not assume any obligation to update the information contained in this conference call. The agenda for today's call is as follows: First, Ms.\nFrangou will offer opening remarks. Next, Mr. Desypris will give an overview of Navios Partners segment data. Next, Mrs. Tsironi will give an overview of Navios Partners financial results. Mr. Vandewalle will provide an industry overview. Lastly, we'll open the call to take questions. Now I turn the call over to Navios Partners' Chairwoman and CEO, Mrs. Angeliki Frangou. Angeliki?\nAngeliki Frangou: Good morning, all, and thank you for joining us on today's call. I am pleased with the results for the 2025 in which we reported revenue of $327.6 million and an EBITDA of $178.2 million and net income of $69.9 million. Earnings per common unit were $2.34 for the quarter. Global economies have been surprisingly robust given their uncertain macro environment. In addition, we are witnessing the creation and reshaping of new trade patterns with longer distances due to the war in Ukraine and Russia's continued attacks in the Red Sea and a new and evolving world tariff regime. As a result, the shipping market generally is healthy. Please turn to Slide six.\nNavios Partners is a leading publicly listed shipping company with 173 vessels. These vessels have an average age of ten years and are in three different segments and 15 asset classes. As you can see, the vessel value is approximately equal in each sector. We ended the second quarter with $389 million of cash on our balance sheet. Our net LTV as of the end of the second quarter was calculated at 35.3%, essentially unchanged from the last quarter. Please turn to Slide seven. We generated $96 million in gross sales proceeds from the sale of three vessels with an average age of 16.5 years.\nWe purchased two Aframax LR2 tankers for $133 million and we expect delivery of these vessels in 2027. We also took delivery of one new building Aframax LR2 target fixed for $27,446 net per day for the next five years. We recently took swift action in response to OFAC sanctions on one of our counterparties. On 07/03/2025, the U.S. Department of Treasury's Office of Foreign Assets Control added a counterparty of Navios to its sanction list. The following day, we terminated contracts for two related VLCCs built in 2020 and 2021. That will therefore chartered out each at a daily net rate of $27,456 ending in October 2030, and February 2031.\nSwift action allowed us to redeploy these vessels into a healthy spot market. We anticipate entering into long-term charters for these vessels at an appropriate time. For the remaining six months of 2025, contracted revenue exceeds estimated total cash expense by $56 million. We have 6,838 remaining open and index days, about 25% of our available days, so we have significant cash generative opportunities. Please turn to Slide eight. Where we outline our return of capital program. Under our dividend program, we paid $0.20 dividend per unit annually. In 2025, we paid a dividend of $1 million. In addition, so far this year through August 13, 2025, we repurchased 716,575 common units for $27.8 million.\nIncluding dividends, we returned a total of $30.8 million in 2025. Under the entire unit repurchase program, we invested $52.8 million through 08/13/2025 and repurchased 1,206,530 units or about 4% of our common units outstanding at the time we commenced the program. As we show on the slide, we estimate that we effectively returned an additional $3.8 per unit of value of NAV to unitholders through these purchases. As of 08/13/2025, we had $47.2 million available under our unit repurchase program. The volume and timing of further repurchases will be subject to general market and business conditions, working capital requirements, and other investment opportunities among other factors. Please turn to Slide nine. We outline the challenges we have been addressing.\nWe assemble our team regularly to dive into the details of emerging information in an attempt to understand how values and risks are evolving. On the top right part of the slide, we outlined how we are addressing the uncertain market and the things we have accomplished. The $3.1 billion in contracted revenue stems from our action in past markets, where sentiment allowed us to enter into long-term charters. We are also focused on our interest rate risk. We have been hedging this risk either by entering into fixed-rate financing arrangements or through hedges that do not require posting additional collateral. At the bottom of the slide, we show how our fleet has evolved through selected metrics.\nAs you can see, our fleet size and age are about the same as they were at the year-end 2022. However, about 28% of our fleet was acquired in the past four and a half years. We maximize energy efficiency by maintaining a fleet of useful vessels with the latest technology. On the financial side, we focus on deleveraging and reduced net LTV from 45% at the end of 2022 to 35.3% at the end of the second quarter of 2025. I now turn the presentation over to Mr. Stratos Desypris, Navios Partners' Chief Operating Officer. Stratos?\nStratos Desypris: Thank you, Angeliki, and good morning all. Please turn to Slide 10. Details our operating free cash flow potential for 2025. We fixed 75% of available days at the net average rate of $24,989 per day. Contracted revenue exceeds estimated total cash expense by about $56 million, and we have 6,858 remaining open or index-linked days that should provide substantial additional cash flow. So that you can perform your own sensitivity analysis. On the right side of the slide, we provide our 27,615 available days by vessel type. Please turn to Slide 11. We are constantly renewing our fleet in order to maintain the yacht profile.\nReduce our carbon footprint by modernizing our fleet, benefiting from new technologies and advanced environmentally friendly features. During the second quarter, we acquired two new building Aframax LR2 vessels, which cost $133 million. Vessels are expected to be delivered in 2027. In June 2025, we took delivery of one Aframax LR2 vessel that has been chartered out for five years at an average net daily rate of $27,446. We have 22 additional new building vessels delivering to our fleet through 2028, representing $1.4 billion of investment. Based on our financing, both agreed and in process, we have about $150 million of equity remaining to be paid.\nIn containerships, we have four vessels to be delivered, with a total acquisition price of about $400 million. We have mitigated the residual value risk with long-term creditworthy charters expected to generate about $300 million in revenue over a five-year average charter duration. In tankers, we have 18 vessels to be delivered, a total price of approximately $1 billion. We chartered out 12 of these vessels for an average period of five years, expected to generate aggregate contracted revenue of about $600 million. We have also been opportunistically selling older vessels. In 2025, we sold six vessels, three dry bulk and three container ships, with an average age of 18 years, for a total of about $130 million.\nMoving to slide 12, we have a strong backlog of contracted revenue that will be lower than previous years, which creates visibility in an uncertain environment. Our contracted revenue was reduced by about $150 million due to the sale of one transshipment vessel and the termination of the contracts on two VLCC vessels that are currently employed in the healthy spot market. Post these events, our total contracted revenue amounts to $3.1 billion. $1.2 billion relates to our tanker fleet, $200 million relates to our dry bulk fleet, and $1.7 billion relates to our containerships. Charters are extending through 2037 with a diverse group of quality counterparties.\nI now pass the call to Erifili Tsironi, our CFO, who will take you through the financial highlights. Erifili?\nErifili Tsironi: Thank you, Stratos, and good morning, all. I will briefly review our unaudited financial results for the second quarter and the first half ended 06/30/2025. The financial information is included in the press release and is summarized in the slide presentation available on the company's website. Moving to the earnings highlights on Slide 13, total revenue for 2025 decreased by 4.3% to $328 million compared to $342 million for the same period in 2024 due to lower fleet combined time charter equivalent rate, available days, and revenue from freight voyages. Our combined TCE rate for 2025 decreased by 1.5% to $23,040 per day, and our available days decreased by 0.8% to 13,388 days compared to Q2 2024.\nIn terms of sector performance, the TCE rate for our container fleet increased by 3.6% to $31,316 per day. In contrast, the TCE rate for our dry bulk and tanker fleet was 13.9% and 4.6% lower respectively at $15,470 per day for dry bulk and $26,537 per day for tankers. EBITDA for the second quarter of 2025 was adjusted as explained in the Slide footnote. Adjusted EBITDA for Q2 2025 decreased by $17 million to $173 million compared to Q2 2024.\nThe decrease is driven primarily by a $15 million decrease in time charter and voyage revenues, a $3 million increase in general and administrative expenses, and a $9 million increase in vessel operating expenses as a result of a 5.6% increase in OpEx days and a 4.5% increase in our combined OpEx rate to $7,108 per day. Also as a result of the change in the composition of our fleet. Adjusted EBITDA was positively affected by a $9 million decrease in time charter and voyage expenses due to fewer freight voyage days in 2025. Adjusted net income for Q2 2025 was $64 million compared to $94 million in Q2 2024.\nThe decrease is mainly due to a $17 million decrease in adjusted EBITDA, a $9 million increase in depreciation and amortization, and a $3 million increase in interest expense and finance cost net. Adjusted earnings and earnings per common unit for Q2 2025 were $2.15 and $2.34 respectively. Total revenue for 2025 decreased by $29 million to $632 million compared to the same period in 2024. The decrease was mainly a result of lower combined TCE rate, available days, and revenue from freight voyages. Our combined TCE rate for 2025 was $22,154 per day. In terms of sector performance, the TCE rate for our containers increased by 2.9% to $30,906 per day, compared to the same period in 2024.\nIn contrast, our dry bulk and tanker TCE rates were approximately 12.6% and 5.9% lower respectively. TCE rates for our dry bulk vessels stood at $14,070 per day and for our tankers $26,316 per day for 2025. Adjusted EBITDA for 2025 decreased by $28 million to $326 million. The decrease was primarily due to a $29 million decrease in time charter and voyage expenses, a $4 million increase in general and administrative expenses, and a $16 million increase in vessel operating expenses, mainly as a result of a 5.2% decrease in OpEx days and a 3.6% increase in our combined OpEx rate to $7,045 per day. Also as a result of the change in the composition of our fleet.\nAdjusted EBITDA was positively affected by a $21 million decrease in time charter and voyage expenses due to fewer freight voyage days in 2025. Adjusted net income for 2025 was $112 million, fifty-four million lower than in 2024. The decrease is mainly due to a $28 million decrease in adjusted EBITDA, a $17 million increase in depreciation and amortization, and a $7.5 million increase in interest expense and finance cost net. Adjusted earnings and earnings per common unit for 2025 were $3.73 and $3.72 respectively. Turning to slide 14, I will briefly discuss some key balance sheet data. As of 06/30/2025, cash and cash equivalents including restricted cash and time deposits in excess of three months were $389 million.\nDuring 2025, we paid $107 million under our new building program net of debt. We concluded the sale of three vessels for $34 million, adding about $22 million cash after debt repayment. Long-term borrowings, including the current portion, net of deferred fees, increased to $2.2 billion following the delivery of five vessels during the 33.9%. Slide 15 highlights our debt profile. We continue to diversify our funding sources between bank debt and leasing structures. Following our $88 million interest rate hedge in Q1 2025, 29% of our debt and bareboat liabilities have a fixed interest rate at a no lien rate of 5.5%. The hedge mechanism was part of the original loan agreement and does not require additional collateral.\nWe have also mitigated part of the increased interest rate cost by using the average margin for our drawn floating rate debt and bareboat liabilities to 1.9%. I would like to note that the average margin for the committed undrawn floating rate debt of our new building program is 1.4%. Our maturity profile is staggered with no significant balance due in any single year. In Q2 2025, Navios Partners completed three facilities for a total amount of $390 million. I now pass the call to Vincent Vandewalle, Navios Partners' Chief Trading Officer, to take you through the industry section. Vincent?\nVincent Vandewalle: Thank you, Erifili. Please turn to Slide 17. Geopolitical developments continue to shift worldwide trading routes caused by the tariff war, restricted Suez Canal passages, Ukraine war, and implementation of the USTR. Announced tariffs are not expected to have a significant effect on tankers and dry bulk trade apart from grain and steel. The heaviest tariff impacts will be on container ships and car carriers. The Red Sea entrance leading to the Suez Canal continues to operate at restricted transit levels, particularly since the sinking of two ships transiting the waterway in July. The Ukraine war is shifting trading patterns with limited grain export out of the Black Sea and benefiting export out of Brazil and the USA.\nAnd Russian crude export diverted to Asia due to tighter sanctions. On April 17, USTR released a revised section 301 fee proposal targeting Chinese vessel operators and Chinese-built ships with extra port fees when calling U.S. ports. These fees are to take effect from October 2025. Please turn to Slide 19 for the review of the dry bulk industry. Dry bulk trade softened in the first half of 2025 due to weather patterns, typical seasonality, increased domestic coal production in China and India, and slower Chinese grain imports.\nAs a result, the Baltic Dry Index average declined 30% in the first half of 2025 versus the first half of 2024, but has risen 37% since June, standing at 2,044 on August 15. Continued recovery is expected through Q3, driven by Capes due to seasonally higher volumes of iron ore and bauxite. Please turn to Slide 20. The current order book stands at 11% of the fleet. Net fleet growth is expected to be 3.1% in 2025, vessels over 20 years of age are about 11% of the total fleet, which is slightly higher than the order book.\nIn concluding our dry bulk sector review, slowing demand growth for natural resources may be balanced by restrictions in transiting the Red Sea, long-haul trades of bauxite and iron ore from West Africa to Asia, and a low pace of new building deliveries. This should support higher freight rates as the freight future market currently indicates, particularly for Capes. Please turn to Slide 22 for the review of the tanker industry. World GDP is expected to grow by 3% in 2025, based on the IMF July forecast. The IEA projects a 700,000 barrels per day increase in global oil demand in 2025.\nCrude tanker earnings have risen as OPEC unwinds its 2.2 million barrels per day voluntary production cuts, more crude is exported from Brazil and the USA, and as Asian refineries replace Russian and Iranian barrels with non-sanctioned imports. Overall, the political environment along with the normal seasonality, the reduction of the fleet due to sanctioned vessels, low global oil inventories, and additional production from OPEC and Atlantic basin suppliers, should support crude freight rates. Please turn to Slide 23. The U.S. Office of Foreign Asset Control, OFAC, continues to issue new sanctions targeting Russia and Iran's oil revenue. The total number of sanctioned vessels is now about 13% of the tanker fleet.\nBoth China and India have said that they will not allow sanctioned vessels to discharge. Please turn to Slide 24. Seaborne crude and products trades continue to be affected by the war in Ukraine. Both the crude and the product market rates remain at healthy levels. Please turn to Slide 25. The VLCC fleet had zero fleet growth in 2024 and is expected to grow 0.4% in 2025. The current order book is 12.3% of the fleet following a record ordering spree in 2024. Vessels over 20 years of age are about 20% of the total fleet. Turning to Slide 26. Production tanker net fleet growth was 1.7% for 2024, is expected to increase by 5.8% in 2025.\nThe current product tanker order book is 19.7% of the fleet compared to 18.3% of the fleet, which is 20 plus years of age. Concluding the tanker market overview, tanker rates continue at healthy levels. The combination of moderate growth in global oil demand, sanctions reducing the numbers of available vessels, new longer trading routes for both crude and products, and the IMO 2023 regulations should provide healthy tanker earnings going forward. Please turn to Slide 28 for a review of the container industry. Container ship rates remained firm because of the Red Sea, TEU miles increased by about 19% in 2024.\nThe continuous Red Sea disruption will lead to an expected TEU mile increase of 2.7% this year, providing healthy time charter rates while ships avoid the waterway. However, continuing record new building ordering and record fleet growth should eventually modify these gains. Tariffs, particularly the outcome of the tariff negotiations on U.S. imports of Chinese goods, will have a significant effect on demand and trade should they remain at recently announced levels. Turning to Slide 29. The current order book stands at 31% compared to 0.5% of the fleet 20 years of age or older. About 80% of the order book is for 10,000 TEU vessels or larger.\nAlthough trade is expected to grow by 2.6% in 2025, net fleet growth is expected to grow by 6.7% in 2025, following a 10% net fleet growth in 2024. Concluding the container market overview, if the contemplated tariffs between the U.S. and China remain in place, this may have a negative effect on demand and trade. However, the expected world GDP growth of 3% for 2025 provides a somewhat positive counterpoint. This concludes our presentation. I would now like to turn the call over to Angeliki for her final comments. Angeliki?\nAngeliki Frangou: Thank you, Vincent. This completes our formal presentation and we open the call to questions.\nOperator: Absolutely.\nOmar Nokta: We'll take our first question from Omar Nokta with Jefferies. Please go ahead. Your line is open. Hi, Angeliki. Hi, everyone. Good afternoon. And good morning. Yes. So thanks for the update. Obviously, a very good amount of detail, and it looks like a good amount of stuff has taken place for Navios. And maybe just a couple of questions from my side. Perhaps first, on those two VLCCs. Were unchartered to Versus tankers. Now, that entity now being sanctioned, you've been able to terminate those contracts. It looks like it's gonna perhaps work out nicely given the setup for the sector. I just wanted to ask, you're planning to trade those on the spot market.\nYou mentioned looking to put them on charter at some point down the line. Just wanted to ask in terms of your timing of that. When do you when would you wanna put those away on Charter? And then also, if for any reason, that entity were to be removed from that list, the OFAC list, would that in some way compel you to have to give them back to that company and resume those leases?\nAngeliki Frangou: Excellent. Let's start with the real I will say one thing, Omar. First of all, I have to give a big congratulation on this to our risk management team. Because to be able to terminate immediately, practically, that is a work that has been done well in advance with the team that was organized that gave us the opportunity immediately to terminate, take the vessels back, and be able to charter them in a healthy spot market. And this is also the team that monitors all this time all the trade, every loading, every discharging, every movement, and I am very proud of the team. The reality is that this is a healthy market.\nAnd we will be open to trade in this market and I think Q4 will be it looks to be shaping very well. But always, look at opportunities at the right time to put vessels on longer durations. I mean, one year over fifty thousand and longer duration is let's see. We are monitoring, and we'll take the opportunity at the right time.\nOmar Nokta: Okay. Thank you. And then just to make sure that those you're free and clear of those contracts now, you can do what you want with these two ships. And I'm sorry. Because you asked another question.\nAngeliki Frangou: The other question is that the moment you cancel the contract, that's it. You have zero Even though I don't see that easily that counterparty will be back, but it cannot claim or come after because it's a clear contract and that cancellation and is a termination of the contract is irreversible.\nOmar Nokta: Okay. Very good. Thank you. Yeah. So that looks very unique, and perhaps a compelling opportunity here. Then obviously, just in terms of the fleet, you continue to fine-tune it, which as you've said, is part of the core strategy of Navios. Selling old and investing in newer capacity. The two, I guess two on that. The LR2s you've ordered, those are not chartered. It doesn't look like, although the previous LR2s have been. Is it the expectation that you will fix those out ahead of delivery? That's one. Then two, given that the two older Panamax containerships you sold, look to be very good prices. I would think at least relative to what's in people's models.\nDo you think about the other ships that roll off charter in that vessel class? Are those effectively sales candidates? Or do you intend to renew those contracts, or extend them on new charters if you can. Thank you.\nAngeliki Frangou: I mean, Omar, I will say we are very surprised with the strength of the container market given the order book and everything. And to be honest, we are here to take advantage of the opportunity. If you see the sale of the two container ships, the significance is also that you are selling vessels almost a year forward. And with a survey due at that time. So for us, this is a beautiful forward, basically, you know, selling 18-year-old almost vessels is a great idea and redeploying cash in a different asset. In today's market, we will not buy a container without a charter.\nOn the tanker sector, I will say because we have not really had a lot of exposure on base almost everything fixed. We felt that the market made sense and we do not exclude we can do a longer-term deal but we feel comfortable on that vessel to be in that portfolio today. Without a charter. We have always been investigating and we may fix it on a longer term, but we feel comfortable in that position.\nOmar Nokta: Very good. Thank you, Angeliki. I'll turn it over. Thank you.\nOperator: And there are no further questions on the line at this time. I'll turn the program back to Angeliki for any additional or closing remarks.\nAngeliki Frangou: Thank you. This completes our quarterly results and questions.\nOperator: Thank you. And this concludes the Navios Maritime Partners earnings call. Thank you again for your participation and you may now disconnect."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d50281be-0faf-4627-abd2-a5b66b683694&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fa-sa-made-in-america%3Faid%3D11109%26source%3Disaeditxt0001141%26ftm_cam%3Dsa-made-in-america%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18009&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=ce824830-80a7-4751-909a-9f6fd2142543",
      "text": "Trump’s Tariffs Just Launched A Potential $1.5 Trillion Opportunity\nNVIDIA is about to be “Made in America.”\nDo you know which stock we’re talking about?\nDon’t wait to find out.\nSimply click below to sign up and learn about this investment opportunity.\nThen act fast!\nSimply click below to sign up and learn more about this investment opportunity.\nThank you. You will be redirected momentarily…\nFollowing a major tariff policy shift, a new AI Gold Rush is taking shape.\nIt’s already being measured in trillions, and what we’re witnessing could be a once-in-a-lifetime reshoring of America’s tech infrastructure.\nBest of all: Motley Fool CEO Tom Gardner is predicting there will be one stock that could be a clear winner.\nConsider this…\nEarlier this year NVIDIA announced something unbelievably bold.\nEvery supercomputer would be built entirely in the USA - for the first time ever.\nThe total investment in America: $500 billion over four years.\nThat number should already have investors drooling with anticipation, but if you’ve been paying attention, the story gets even better…\nThat’s because NVIDIA’s announcement - while historic on its own - is just one of many dominoes we expect to fall in the near future.\n- Apple is furiously working to move production out of China, and recently announced $500 billion invested in the USA over the next four years.\n- And ChatGPT-creator OpenAI recently unveiled its ‘Stargate’ project that aims to invest $500 billion entirely in the United States in the next four years.\nAdd that up and it's already at $1.5 trillion.\nKeep in mind, NVIDIA was the first to act, announcing a bold $500 billion commitment to U.S. expansion almost immediately after the policy shift.\nSince then, we’ve seen a growing wave of companies following in NVIDIA’s gigantic footsteps… and all signs point to more on the way.\nWhat we’re seeing is something that could be a once-in-a-lifetime reshoring of America’s dominant technology companies.\nAll announced in what could be as short as a 90-day window. America’s high-tech is now ‘Made in the USA.’\nHere’s the best part: every media headline is focused on how bad tariffs are…. And certainly, many companies will be losers.\nOnce again, we believe this is a once-in-a-lifetime shift happening rapidly before our eyes…\nYet, almost no one is focusing on the fact that this multi-trillion dollar reshoring could mean potential MASSIVE gains for a small group of companies.\nThink of the companies that need to build trillions of dollars of factories, data centers, and other technology flooding back into America.\nLegendary investor and Motley Fool CEO Tom Gardner just identified a small - less than 1/100th the size of NVIDIA - American company (headquartered in Norwalk, Connecticut!) that does exactly this.\nIt specializes in the construction of massive technology projects and could soon become the ‘story stock’ of the potential Made in the USA boom.\nSo while some investors are content to sit and watch their net worth whittle away as tariff story after tariff story hits the news….\nWe believe we’ve found something completely different.\nA stock that could become the next big winner of this possibly Made in the USA boom.\nBut …. Tick, tick, tick… The clock is winding down. If you want to get invested before the next wave of technology companies announces their own Made in the USA plans…\nYou need to consider acting now. To get started with Stock Advisor and learn more about this incredible stock, simply click the button below.\nDo you know which stock we're talking about?\nDon't wait to find out.\nSimply click below to sign up and learn about this investment opportunity.\nThen act fast!\nSimply click below to sign up and learn more about this investment opportunity...\nBy submitting your email address, you consent to us keeping you informed about updates to our website and about other products and services that we think might interest you. You can unsubscribe at any time. Please read our Privacy Statement and Terms & Conditions.\nThe Motley Fool has a disclosure policy.\nMotley Fool Stock Advisor returns are 1,042% as compared to the S&P 500 returns of 183% as of September 3, 2025.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/legal/terms-and-conditions/fool-rules",
      "text": "Welcome to The Motley Fool! We hope you'll enjoy being a part of our Foolishness -- such as Fool.com, our subscription newsletters and their special websites, our discussion boards, CAPS, and whatever else we come up with (each a “Service,” and collectively, the \"Services\"). But first things first: By using the Services, you're agreeing to be bound by these Terms and Conditions (“Terms and Conditions” or “Terms”) INCLUDING THE BINDING ARBITRATION AND CLASS ACTION WAIVER DETAILED IN SECTION 13. These Terms govern your use and access to the website and all our Services. We may change these terms at any time, but we will post a notice on this website of any material changes. Your continued use of The Motley Fool and its Services means that you accept any new or modified terms and conditions. So please check back here from time to time.\nSome Services are works in progress. We reserve the right to change or even eliminate them with no notice, at our sole discretion.\n1. Registration\nExcept as expressly provided in these Terms and Conditions, members may only maintain one active registration with The Motley Fool. In other words, it's one registration per person. The only exception to this rule is if you wish to create more than one CAPS profile, in which case you may have a corresponding number of registrations. Any other use of multiple accounts or aliases on our Services, including attempts to mislead, defraud, confuse, or otherwise trick us or our members, is a breach of these Terms and Conditions.\nIf you subscribe to one of our premium Services, you will be asked to create a password, which you'll need to access the Service. Should you wish to post a message on the discussion boards or comment on an article or a blog, you'll also be required to choose a user name.\nAs a registered user, you can update your account settings, including your email address, by going to the My Fool tab up top. There, you can also change your password at any time and your user name up to three times in a calendar year. Also, if you forget either your password or user name, you can go to this page for help.\n2. Premium Services\nWhen subscribing to a premium Service such as one of our newsletters, you will need to provide us with your name, email address, and billing and shipping addresses, as well as your credit card information. You agree to pay the applicable subscription fee as set forth on this site. Sales taxes may be charged in addition to the subscription fee. BY PLACING YOUR ORDER, YOU PROVIDE YOUR ELECTRONIC AUTHORIZATION FOR FUTURE CHARGES AGAINST YOUR CREDIT CARD ON FILE UNLESS YOU CANCEL.\nYou certify that all information you provide is accurate. You also agree to maintain and update your information as necessary so that it remains accurate and current. In the event that any information you provide is inaccurate or not up to date, The Motley Fool reserves the right to cancel your subscription.\nWe reserve the right to refuse or discontinue the supply of a Service to any user at any time at our sole discretion.\nUnless stated otherwise, membership to any Service is for online and/or electronic access only. Certain promotions may offer features that are issued in physical form. Shipping of any goods or service associated with these promotions is limited to the U.S./APO. Physical fulfillment of goods or services not specifically mentioned in a promotion is at the sole discretion of the Fool.\nOur Services generally deliver their content via email including trade alerts or recommendations, recent actionable investing guidance, Best Buys Now, and other important stock news. There is no opt-out choice available for these emails (unless you cancel your subscription). Of course, you can always opt out of our marketing emails on the settings page.\nTrial Terms, Automatic Billing and Cancellation Policy\nSome Services may provide a free trial or introductory offer. If such an offer is provided, only one per person or household is allowed at any given point in time. In addition, there is a limit of one trial per person and household in any given six-month period unless otherwise stated in the offer.\nUpon signing up for a free trial, you will have access to the Service for the promotional trial period. If you cancel prior to the end of the promotional offer period, your credit card will not be charged. If you don't cancel your subscription within the trial offer period, we will charge the primary credit card you provided during the sign-up process. You may contact Member Support at [email protected] to terminate your trial enrollment.\nYour membership will automatically renew at the then-current rate, until you notify us of your decision to terminate your membership. Many subscriptions will renew for one-year or one-month terms, regardless of the offer under which the subscription was initiated. For subscription terms greater than three months we will email you about the length and price for your renewal before we charge you. Monthly subscription terms will be notified annually regarding future renewals. Automatic renewal term lengths are subject to change and we will email you about the length and price for your automatic renewal before we charge you. If you would like to turn off automatic renewal, or extend your subscription for additional years, please contact Member Support. BY ALLOWING FOR YOUR RENEWAL, YOU PROVIDE YOUR ELECTRONIC AUTHORIZATION FOR FUTURE CHARGES AGAINST YOUR CREDIT CARD ON FILE OR APPLE PAY. Accordingly, you agree that your membership fee or subscription will be billed automatically at the beginning of each renewal period at the then-current rate (plus sales tax, if applicable) to the credit card you used in your most recent transaction with us. Any subscription purchased using Apple Pay will continue to renew on Apple Pay.\nThe Motley Fool reserves the right to increase a Service's fees or institute new charges upon reasonable notice. Service fees are due in advance.\nEnrollment Fees\nFrom time-to-time, we may offer enrollment fee based products which may include an ongoing monthly fee. There is no refund offered for the enrollment fee under these terms. Based on the specific terms of the offer under which you buy the product, the fee may be refundable or eligible for a credit transfer. Please see full offer terms for your product or service for more details.\nRefunds\nDifferent Services (and sometimes specific offers) have different refund policies (including some that offer no refunds, or some that offer different pricing depending on availability of refunds). Please review the specific terms of your offer before signing up as you are agreeing to be bound those terms. If you are unsure of your cancellation rights, please contact Member Support.\nPlease note that most refunds are only available to first-time subscribers. If you subscribe to a Service that allows for refunds beyond 30 days, and cancel (and receive a refund) and then subscribe again, you will not receive a refund after the first 30 days.\nFrom time to time, The Motley Fool offers its premium services through third-party vendors. In such cases, the vendor’s refund policy would apply and may differ from your Service (or specific offer).\nTransfer; Discontinuing a Service\nYou cannot transfer your subscription to someone else, except through bequeathment or by a court order. In the event a subscription is transferred, it will continue through the end of its term and can be renewed at the then-current price and conditions. For assistance in this situation, please contact Member Services.\nIn the event that we discontinue a Service, you agree that The Motley Fool may transfer your subscription to another Service of equal or greater value.\n3. Credits, Transfer Credits, and Bonus Credits Information\nSome of our services provide the option to transfer some or all of the purchase price towards a different Motley Fool service, (a “Transfer Credit(s)”). Depending on the terms of your purchase, you may be allowed to transfer the full or pro-rated credit from your purchase into a Transfer Credit. Most services eligible for a Transfer Credit will allow an exchange for a different service using the Transfer Credit within 30 days of the initial purchase, and there are services that do not allow for credits of any kind.\nIf you are unsure whether or not your service is eligible for a Transfer Credit please contact [email protected].\nIf you take advantage of a Transfer Credit guarantee, please also note that you will lose access to any product(s) and benefits included in the original promotional offer, including additional services or reports that may have been included as a bonus or incentive for taking advantage of the offer.\nIf the list price of the service you would like to transfer into is more than the amount of Transfer Credits you have, you will receive a partial term of the service. If the list price of the service you would like to transfer into is less than the amount of Transfer Credits, you will be given a service extension such that all Transfer Credits are consumed. In both cases the usual automatic renewal notice will be emailed a month prior to the adjusted end-date.\nWhen using a Transfer Credit, the term length of the service being transferred into cannot extend beyond three years. In the event your Transfer Credit would result in a service term greater than three years, your subscription will be extended to three years and the remaining Transfer Credits will immediately expire.\nSome purchases may include a temporary bonus credit (the “Bonus Credit”) that can be applied to a future purchase. These Bonus Credits are valid for 30 days from the date of purchase, and multiple Bonus Credits may be combined for a single purchase. If any Bonus Credits is used on a purchase, the remaining value of all active Bonus Credits immediately expires. Bonus Credits may not be used to early renew a service or extend an existing subscription.\nTransfer and Bonus Credits may be combined for a single purchase. In the event they are combined, the combined credit may only be used for a single purchase, after which all Transfer and Bonus Credits will immediately expire.\nProducts obtained using Transfer Credits and Bonus Credits must be obtained at the list price of the product being transferred into, and cannot be combined with any promotional offers or discounts. Products and services obtained using Transfer or Bonus Credits of any kind are not eligible for exchange, refund, swaps, or any other action that would result in the creation of any Bonus Credits.\nThe Motley Fool reserves the right to disallow Transfer Credits, discounts, or Bonus Credits into certain services depending on insufficient credit, product openings, investment timelines, a member's history of transfers or prior refunds, or for any other reason at The Motley Fool’s sole discretion.\nAt certain times we may offer subscriptions or upgrades to services that may contain components of other services you might currently subscribe to. These offers may include prorated Transfer Credit value for your existing subscriptions. If you purchase one of these subscriptions or upgrades the prorated Transfer Credit value from any existing subscription(s) on your account will be used in its entirety towards the purchase, and the prior-existing subscription will be cancelled upon purchase of the new subscription.\n4. Affiliate Marketing Programs\nSome of our brands such as Motley Fool Money, review various products and services. We may be compensated by third parties whose products we review. This compensation may impact where reviews and offers appear, with higher paying partners appearing higher on a page or in a more prominent position. None of our brands can or does promise to be comprehensive with their reviews of any particular marketplace, and the companies covered may heavily tilt towards partners.\nThat being said, we take try to make sure that our editorial opinions are not affected by our compensation, and no partner or advertiser will review, edit, endorse, or approve editorial content. We also make sure that the editorial teams of any brand remains distinct from the editorial team writing content for Fool.com or our premium services.\nNo reviews of products or services should be construed as an endorsement or guarantee of any kind. We do the best we can to make sure that the information we rely upon for our reviews is true and current, but we cannot and will not warranty that it actually is, or that we have not been confused or misled before or after publication.\nAny service or product not offered by The Motley Fool is subject to its own terms and conditions, including about how they may use the information you provide to them, which should be provided by the company through which you are receiving the product or service, and any use of a product or service not offered by The Motley Fool is done so at your own risk.\n5. Additional and Third-Party Terms of Use\nPlease note that certain individual Services or products may have their own, or additional, terms and conditions. In the event of a conflict, the terms for the individual Service will control with respect to the Service in question. So please be sure to review any additional terms and conditions with respect to any specific Service before subscribing.\nSome portions of our site use Google Maps APIs, or other Google APIs. If you use those parts of our site, you are also bound by the Google Terms of Service. If you do not wish to be bound by these terms, or any of the terms contained within these Rules, please do not use our site.\n6. CAPS\nCAPS is The Motley Fool's service that allows you to make predictions about stocks, see others' predictions, aggregate community opinions, and track their accuracy. By putting together lots of information from a variety of sources, we hope to provide participants with a way to a) have fun and b) learn to make better investment decisions.\nYou should not assume that the opinions that people express in CAPS are the opinions of The Motley Fool or anything other than the opinions of the individuals expressing them.\nWhen you look at other people's predictions, you should remember that those people may have interests in the stocks that they're making predictions about. For example, some people may hope a company's stock will go up because they own many shares of it; others may hope that it will rise because they (or their sister) work for the company; others may hope that the stock will rise because that will increase their CAPS score and their international prestige. When you review people's predictions (or the stock tips you see on television or hear in the supermarket), you should not assume that the person making a prediction is unbiased or independent. One of the beauties of CAPS, though, is that you can see the performance of people's predictions over time and, we hope, distinguish sound analysis from self-serving nonsense.\nMotley Fool employees may participate in CAPS and they may have interests in the stocks about which they make predictions. Employees display their positions in their online TMF profiles at Fool.com. Any predictions made by Fool employees are their own. They are not speaking on behalf of our company and these predictions are not Motley Fool recommendations.\n7. Intellectual Property\nAll of the Content on our websites and any Service we provide is protected by U.S. and international copyright laws and is the property of The Motley Fool and/or providers of the content under license. By \"Content\" we mean any information, mode of expression, or other materials and services found on The Motley Fool. This includes message boards, blogs, CAPS picks, ratings, podcasts, chats, software, our writings, graphics, videos, and any and all other features. You can find out more information on copyright law and the Internet at www.templetons.com/brad/copymyths.html.\nYou may make one copy of the Content for your personal, non-commercial use, provided that any material copied remains intact and includes the following notice: \"Copyright 1995-2018 [or whatever the current year is] The Motley Fool. All rights reserved.\" Any other copying, distribution, storing, or transmission of any kind, or any commercial use of our Content, is prohibited without The Fool's prior written permission. That means you may not sell, auction, transfer or barter your subscription or any individual publication. You can make or end your own CAPS picks at any time, but those picks, their scoring history, your scoring history, and data aggregated by CAPS remain the property of The Motley Fool.\nYou also may not republish, post, transmit, or distribute the Content to online bulletin and message boards, blogs, chat rooms, intranets, or anywhere else without our consent. You further agree not to create abstracts from or scrape our Content, including CAPS ratings, for use on another website or service (including our own personal forums and blogs). In short, you may not post our Content anywhere else online. Aside from opening yourself up to liability, distributing our premium Services, stock picks, and performance data to other sites and forums is unfair to our members who pay good money to receive our Content. So please don't do it.\nPlease note that notwithstanding the foregoing, when you post content (such as a message-board post or CAPS pitch), you are not somehow surrendering your copyright in your expression, but you are granting us an unlimited license to use it. Specifically, by posting content, you agree that The Motley Fool has an irrevocable, perpetual, and worldwide license to use republish, distribute, reproduce, display, communicate to the public, adapt, perform, store, translate, sublicense, and promote anything you post on our websites. This includes the rights to syndicate and make derivative works out of your content. If you don't want us to use or republish your content, then please don't post it on our websites. We'll only republish your content in context, and we'll credit you as author (unless we're using small quotations). We won't republish your posts in advertising without your permission. And we promise not to mock you unless it would amuse us.\nWe also ask that you only upload or include on our Services materials you have the right to use. While we don’t mind if Peter Parker posts photos he’s taken on our platform, we do ask that he not repost images he’s already sold or licensed to The Daily Bugle. If you have a good faith belief that your work has been copied in a way that constitutes copyright infringement, please notify our Copyright Agent.\nYou agree not to display any of The Motley Fool's trademarks or use them in any manner without our express written permission. You can find the list of our trademarks here.\nSome features of our site are patented under U.S. Patent No. 7,813,986 and U.S. Patent No. 7,882,006.\n8. Conduct\nThe Motley Fool champions active and open debate among our members. All we ask is that it's done in a lawful and civil manner -- be it posting on our boards, commenting on blogs or articles, replying to CAPS pitches, or using our system to contact a fellow member in any way.\nAccordingly, you agree to use The Motley Fool for lawful purposes only. You may not use or allow others to use your Fool membership to:\n- Post or transmit any content that is disruptive, uncivil, abusive, vulgar, profane, obscene, hateful, fraudulent, threatening, harassing, defamatory, or which discloses private or personal matters concerning any person;\n• Post or transmit any material that you don't have the right to transmit under law (such as copyrights, trade secrets, or securities) or under contractual or fiduciary relationships (such as nondisclosure agreements);\n• Post, transmit, or link to sexually explicit material;\n• Impersonate any person, or falsely state or otherwise misrepresent your affiliation with a person or entity;\n• Post or transmit any advertising, promotional materials, or other forms of solicitation, including chain letters and pyramid schemes;\n• Violate any applicable law or regulation while accessing and using our sites, including, without limitation, the rules and regulations of the U.S. Securities and Exchange Commission and the national or other securities exchanges (especially and including the rule against making false or misleading statements to manipulate the price of any security);\n• Offer, sell, or buy any security;\n• Post or transmit any file that contains viruses, corrupted files, \"Trojan Horses,\" or any other contaminating or destructive features that may damage someone's computer;\n• Forge headers or manipulate identifiers or other data in order to disguise the origin of any content transmitted through our sites or to manipulate your presence on our sites;\n• Use any automated means, including, without limitation, agents, robots, scripts, or spiders, to access, monitor, copy or harvest data from any part of our sites;\n• Take any action that imposes an unreasonably or disproportionately large load on our infrastructure or disrupts the functioning of our systems or Services; and\n• Take any action that damages or disrupts the functioning of our systems or Services.\nUnauthorized access of our sites is a breach of these Terms and Conditions and a violation of the law. You agree not to access our sites by any means other than through the interfaces we provide for use in our accessing our sites.\nThe Motley Fool may at any time, without prior notice and at our sole discretion, remove any post, terminate any membership, remove any individual CAPS picks, delete any CAPS players, remove any CAPS scorecards, or take any action for violating the above (and, if we may say so, sensible) provisions or otherwise taking an action disruptive to a Service. In the event TMF terminates your premium Service, you will receive a prorated refund at our discretion.\nYou are responsible for statements made and actions taken through the use of your password, so please maintain the confidentiality of your password. You agree to immediately notify Member Support of any actual or suspected unauthorized use of your username and password. We will not be responsible for any loss to you arising from unauthorized use of your data. For more information on posting, please see our Posting Guidelines.\nIf you see something that you feel is a violation of the Fool's Rules, please notify us by emailing [email protected].\n9. No Personalized Advice\nWe want to help you make money. However, The Motley Fool is not in the business of rendering personalized investment advice. We can't know all the relevant facts about you and your individual needs, and we cannot claim or represent that any particular Services are suitable for you. Accordingly, you agree that any recommendation or action taken by a Service does not constitute a recommendation that a particular security, strategy, or action is suitable for you. If you want personal advice, then you should seek a registered investment advisor.\nThe Motley Fool may partner with third parties in order to make buying our Services' recommendations easier for you. We will not, and cannot, trade on your behalf at your brokerage. Only you can decide whether or not a stock is right for you and you agree to be liable for any trades you initiate at your brokerage using tools that we or our partners provide.\nAffiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no nonpublic knowledge of our affiliates' holdings and/or specific recommendations, and the affiliates’ personnel have no knowledge of any editorial content before it is published.\n10. You Bear Responsibility for Your Financial and Investment Decisions\nOne of the principal tenets here at the Fool is that the best person to handle your finances is you. By your use of our Services, you're agreeing that you bear responsibility for your own investment research and investment decisions. You also agree that The Motley Fool, its directors, its employees, and its agents will not be liable for any investment decision made or action taken by you and others based on news, information, opinion, or any other material published through our Services.\n11. Disclaimer of Warranties and Liabilities\nPlease read The Motley Fool's Disclaimer, which is incorporated herein by reference.\nThe Motley Fool provides a very broad range of information and commentary via its many Services. Consequently, as a result of the diverse opinions of our staff, a Fool Service may, from time to time, take actions or issue recommendations with regard to specific securities that are different from those taken or issued by another Service we provide.\nThe Motley Fool does not warrant the completeness or accuracy of the Content found in our Services or its usefulness for any particular purpose. And although we have the hardest-working, most talented techies in the business, The Motley Fool makes no promises that our content or any of the Services will be delivered to you on an uninterrupted, timely, secure, or error-free basis. In fact, we're not making any promises or warranties except that we'll do our best to provide interesting and helpful information, education, and entertainment. Other than that, we reserve the right to be wrong, stupid, or even foolish (with a small \"f\").\nNow what does all this mean? It means that you agree that under no circumstances will The Motley Fool, its employees, or its agents be liable for direct, indirect, incidental, consequential, punitive, or any other type of damages resulting from your use, purchase, or downloading of any material on our Websites, or arising from or related to these Terms or the Privacy Policy, even if we have been advised of the possibility of such damages. This includes, but is no way limited to, loss or injury caused in whole or in part by our negligence or by stuff beyond our control in creating or delivering any of our Services. This disclaimer of liability does not apply in New Jersey.\nThe Fool relies on various sources of information that we believe to be accurate and reliable. There are also literally thousands of contributors here -- most, we believe, with incredibly interesting and insightful information and opinions to share. But we can't and won't take responsibility for, or make any claims or representations about, the accuracy, completeness, or even the truth of every bit of data, information, and opinion provided through our Services. Remember: All information and content provided on or by The Motley Fool is to be used on an \"as is, with all faults, we're not perfect\" basis.\nObligatory Capitalized Disclaimers of Liability:\nEXCEPT WHERE OTHERWISE INAPPLICABLE OR PROHIBITED BY LAW, THE WEBSITE AND PRODUCTS AND SERVICES CONTAINED AND OFFERED ON THE WEBSITE ARE PROVIDED “AS IS” AND ON AN “AS AVAILABLE” BASIS. NEITHER THE MOTLEY FOOL NOR ANY OF OUR PARTNERS MAKES ANY WARRANTY THAT THE QUALITY OF ANY PRODUCTS, SERVICES, INFORMATION, OR OTHER MATERIAL THAT YOU PURCHASE OR OBTAIN FROM THE USE OF OUR SERVICES WILL MEET YOUR EXPECTATIONS OR THAT AND ANY ERRORS WILL BE IMMEDIATELY CORRECTED. NEITHER WE NOR ANY OF OUR PARTNERS MAKES ANY WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE OR IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, WITH RESPECT TO OUR WEBSITES, ANY CONTENT, OR ANY OF OUR SERVICES, TOOLS, PRODUCTS, OR PROPERTIES. YOU EXPRESSLY AGREE THAT YOU WILL ASSUME THE ENTIRE RISK AS TO THE QUALITY AND THE PERFORMANCE OF OUR SERVICES AND THE ACCURACY OR COMPLETENESS OF THEIR CONTENT.\nSOME STATES DO NOT ALLOW EXCLUSION OF IMPLIED WARRANTIES OR LIMITATION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATIONS OR EXCLUSIONS MAY NOT APPLY TO YOU. IN SUCH STATES, OUR LIABILITY AND THAT OF OUR THIRD-PARTY CONTENT PROVIDERS WILL BE LIMITED TO THE GREATEST EXTENT PERMITTED BY LAW. THIS DISCLAIMER OF WARRANTIES DOES NOT APPLY IN NEW JERSEY.\nThat was tiresome, but important.\n12. Communication\nFederal or state law may require that we notify you of certain events. You hereby acknowledge and consent that such notices will be effective upon our posting them on our websites or sending them to you via email (another reason to please keep your account settings current). If you do not provide us with accurate information, we cannot be held liable if we fail to notify you. You may request that we provide such notices to you in paper format by writing to General Counsel, The Motley Fool, LLC, 2000 Duke Street, Alexandria, VA 22314.\n13. Dispute Resolution by Binding Arbitration and Class Action Waiver\nIf a dispute arises in connection with your use of our Services or in relation to any of these Terms (collectively, “Disputes”) our hope is that we can resolve the matter informally. Accordingly, in the event of a Dispute, we agree to first contact each other via email with a description of the Dispute and any proposed resolution. You will email [email protected] with your concern and The Motley Fool will contact you via the email address we have on file for you.\nIf a Dispute cannot be resolved informally, we each agree that except as provided below, the Dispute will be submitted to final and binding arbitration before a panel of three arbitrators of the American Arbitration Association (“AAA”) in a location convenient to you. Either party may commence the arbitration process by submitting a written demand for arbitration with the AAA, and providing a copy to the other party. The arbitration will be conducted in accordance with the provisions of the AAA’s Commercial Dispute Resolutions Procedures, Supplementary Procedures for Consumer-Related Disputes, in effect at the time of submission of the demand for arbitration. We will pay all of the filing costs, including arbitrator fees. Judgment on the award rendered by the arbitrator may be entered in any court of competent jurisdiction. You expressly agree to refrain from bringing or joining any claims in any representative or class-wide capacity, including but not limited to bringing or joining any claims in any class action or any class-wide arbitration.\nYOU UNDERSTAND THAT YOU ARE WAIVING YOUR RIGHT TO HAVE A JUDGE OR JURY DECIDE YOUR CASE AND TO BE PARTY TO A CLASS OR REPRESENTATIVE ACTION. YOU UNDERSTAND AND AGREE TO HAVE ANY CLAIMS DECIDED INDIVIDUALLY AND ONLY THROUGH ARBITRATION.\nEXCEPTIONS\nNotwithstanding the foregoing, the following will not be subject to arbitration and may be adjudicated only in the state and federal courts of Virginia: (i) any dispute, controversy, or claim related to or contesting the validity of our proprietary rights, including without limitation, trademarks, service marks, copyrights, patents, or trade secrets; or (ii) an action by a party for temporary, preliminary, or permanent injunctive relief, whether prohibitive or mandatory, or other provisional relief. You may also file an individual action in a small claims court in lieu of arbitration.\nOPTING OUT\nYou will have thirty (30) days from the date you submit your personally identifiable information to opt out of this arbitration agreement. To opt out of arbitration, you must contact us at The Motley Fool, LLC, 2000 Duke Street, Alexandria, VA 22314, Attention: Legal Department. If more than thirty (30) days have passed, you are not eligible to opt out of arbitration.\n14. Your Agreement to These Terms\nYou acknowledge and agree that by agreeing to these Terms electronically you are expressly agreeing to the terms set forth herein. You acknowledge that your electronic submission constitutes your agreement and intent to be bound by these Terms and Conditions.\n15. Everything Else\nIf any provision in these Terms and Conditions is found to be invalid, unenforceable, or nonsensical, the remaining provisions will continue in full force and effect. This agreement is and always will be governed by the laws of the United States of America and the Commonwealth of Virginia (except with respect to choice of law).You agree that the proper forum for any claim arising thereunder will be the U.S. Court for the Eastern District of Virginia or the appropriate Virginia court.\nOur Services are directed at a U.S. audience. We cannot warrant that the Services are appropriate for users outside the United States or that use of the Services is permitted under the laws of other jurisdictions. All personal data is maintained in the United States under the terms of our Privacy Policy, which is also incorporated by reference.\nExcept as otherwise expressly stated in these Terms and Conditions, there are no third-party beneficiaries to this agreement.\nThese Terms and Conditions, including those that are incorporated by reference, constitute the entire and only agreement between you and The Motley Fool and govern your use of our sites.\nLast Updated: November 17th, 2024\nhttps://www.fool.com/legal/stuff-we-own/"
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d50281be-0faf-4627-abd2-a5b66b683694&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fa-sa-made-in-america%3Faid%3D11109%26source%3Disaeditxt0001141%26ftm_cam%3Dsa-made-in-america%26ftm_pit%3D18009%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DNone&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=ce824830-80a7-4751-909a-9f6fd2142543",
      "text": "Trump’s Tariffs Just Launched A Potential $1.5 Trillion Opportunity\nNVIDIA is about to be “Made in America.”\nDo you know which stock we’re talking about?\nDon’t wait to find out.\nSimply click below to sign up and learn about this investment opportunity.\nThen act fast!\nSimply click below to sign up and learn more about this investment opportunity.\nThank you. You will be redirected momentarily…\nFollowing a major tariff policy shift, a new AI Gold Rush is taking shape.\nIt’s already being measured in trillions, and what we’re witnessing could be a once-in-a-lifetime reshoring of America’s tech infrastructure.\nBest of all: Motley Fool CEO Tom Gardner is predicting there will be one stock that could be a clear winner.\nConsider this…\nEarlier this year NVIDIA announced something unbelievably bold.\nEvery supercomputer would be built entirely in the USA - for the first time ever.\nThe total investment in America: $500 billion over four years.\nThat number should already have investors drooling with anticipation, but if you’ve been paying attention, the story gets even better…\nThat’s because NVIDIA’s announcement - while historic on its own - is just one of many dominoes we expect to fall in the near future.\n- Apple is furiously working to move production out of China, and recently announced $500 billion invested in the USA over the next four years.\n- And ChatGPT-creator OpenAI recently unveiled its ‘Stargate’ project that aims to invest $500 billion entirely in the United States in the next four years.\nAdd that up and it's already at $1.5 trillion.\nKeep in mind, NVIDIA was the first to act, announcing a bold $500 billion commitment to U.S. expansion almost immediately after the policy shift.\nSince then, we’ve seen a growing wave of companies following in NVIDIA’s gigantic footsteps… and all signs point to more on the way.\nWhat we’re seeing is something that could be a once-in-a-lifetime reshoring of America’s dominant technology companies.\nAll announced in what could be as short as a 90-day window. America’s high-tech is now ‘Made in the USA.’\nHere’s the best part: every media headline is focused on how bad tariffs are…. And certainly, many companies will be losers.\nOnce again, we believe this is a once-in-a-lifetime shift happening rapidly before our eyes…\nYet, almost no one is focusing on the fact that this multi-trillion dollar reshoring could mean potential MASSIVE gains for a small group of companies.\nThink of the companies that need to build trillions of dollars of factories, data centers, and other technology flooding back into America.\nLegendary investor and Motley Fool CEO Tom Gardner just identified a small - less than 1/100th the size of NVIDIA - American company (headquartered in Norwalk, Connecticut!) that does exactly this.\nIt specializes in the construction of massive technology projects and could soon become the ‘story stock’ of the potential Made in the USA boom.\nSo while some investors are content to sit and watch their net worth whittle away as tariff story after tariff story hits the news….\nWe believe we’ve found something completely different.\nA stock that could become the next big winner of this possibly Made in the USA boom.\nBut …. Tick, tick, tick… The clock is winding down. If you want to get invested before the next wave of technology companies announces their own Made in the USA plans…\nYou need to consider acting now. To get started with Stock Advisor and learn more about this incredible stock, simply click the button below.\nDo you know which stock we're talking about?\nDon't wait to find out.\nSimply click below to sign up and learn about this investment opportunity.\nThen act fast!\nSimply click below to sign up and learn more about this investment opportunity...\nBy submitting your email address, you consent to us keeping you informed about updates to our website and about other products and services that we think might interest you. You can unsubscribe at any time. Please read our Privacy Statement and Terms & Conditions.\nThe Motley Fool has a disclosure policy.\nMotley Fool Stock Advisor returns are 1,042% as compared to the S&P 500 returns of 183% as of September 3, 2025.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "Navios reported Q2 2025 revenue of $327.6 million, EBITDA of $178.2 million, and net income of $69.9 million, a modest decline from the same period in 2024. The company swiftly terminated two VLCC charters after OFAC sanctions, redeployed the vessels to the spot market, and is pursuing new Aframax LR2 tankers with delivery in 2027. Cash stands at $389 million with an LTV of 35.3%, and a $1.4 billion new‑build program is underway. Container TCE rates rose 3.6% while dry‑bulk and tanker rates fell, reflecting a mixed freight environment.",
  "argos_id": "9TX3G4VHN"
}