{
  "url": "https://www.bostonglobe.com/2025/09/03/business/tax-tips-exemptions/",
  "authorsByline": "FATIMA HUSSEIN",
  "articleId": "861bdf1d82d44d08a653f17a88b3120d",
  "source": {
    "domain": "bostonglobe.com",
    "location": null
  },
  "imageUrl": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/KP7XFEFS6IC5HON766BNJKBAIA.jpg?auth=5dd0e23e442f2e8d35f330cb1779756798c5a5876f407fc3d896922159565c5c&width=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T17:08:31.862000+00:00",
  "addDate": "2025-09-03T17:23:32.285224+00:00",
  "refreshDate": "2025-09-03T17:23:32.285226+00:00",
  "score": 1.0,
  "title": "Podcasters and influencers: The unexpected jobs covered under Trump’s ‘no tax on tips’ plan",
  "description": "The provision in the law signed by President Trump in July eliminates federal income taxes on tips for people working in jobs that have traditionally received them.",
  "content": "The provision in the law signed by President Trump in July eliminates federal income taxes on tips for people working in jobs that have traditionally received them. It’s temporary and runs from 2025 until 2028. It applies to people who make less than $160,000 in 2025.\n\nA bit more unexpected? Podcasters and social media influencers will also be excluded from forking over a portion of their tips, according to the list released Tuesday by the Treasury Department.\n\nWASHINGTON (AP) — Golf caddies, blackjack dealers and house painters are among the jobs covered under the Trump administration’s preliminary list of occupations no required to pay income tax on their tips under Republicans’ new tax cuts and spending bill.\n\nThe Yale Budget Lab estimates that there were roughly 4 million workers in tipped occupations in 2023, which amounts to roughly 2.5% of all jobs.\n\nThe administration was required to publish a list of qualifying occupations within 90 days of the bill’s signing. The full list of occupations is located on the Treasury Department website.\n\nThey are broken down into eight categories, including beverage and food service; entertainment and events; hospitality and guest services; home services; personal services; personal appearance and wellness; recreation and instruction; and transportation and delivery.\n\nAmong other jobs exempted from tax on tips are sommeliers, cocktail waiters, pastry chefs, cake bakers, bingo workers, club dancers, DJs, clowns, streamers, online video creators, ushers, maids, gardeners, electricians, house cleaners, tow truck drivers, wedding planners, personal care aides, tutors, au pairs, massage therapists, yoga instructors, cobblers, skydiving pilots, ski instructors, parking garage attendants, delivery drivers and movers.\n\nA report from the Budget Lab shows that the effects of the law would be small, given that tipped workers tend to be lower income. More than 37% of tipped workers, or over one third, earned income low enough that they faced no federal income tax in 2022.\n\n“The larger and far more uncertain effect would stem from behavioral changes incentivized by the bill, such as substitution into tipped employment and tipped income, which would increase the bill’s overall cost,” states the report, which was written by Ernie Tedeschi, the director of economics at the Budget Lab.\n\nCongressional budget analysts project the “No Tax on Tips” provision would increase the deficit by $40 billion through 2028. The nonpartisan Joint Committee on Taxation estimated in June that the tips deduction will cost $32 billion over 10 years.\n\nOnly tips reported to the employer and noted on a worker’s W-2, their end-of-year tax summary, will qualify. Payroll taxes, which pay for Social Security and Medicare, would still be collected along with state and local taxes.\n\nPolling shows Americans have panned the big bill. Half US adults expect the new tax law will help the rich, according to the poll from The Associated Press-NORC Center for Public Affairs Research. Most — about 6 in 10 — think it will do more to hurt than help low-income people.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "income tax",
      "weight": 0.08838295
    },
    {
      "name": "tipped workers",
      "weight": 0.07802075
    },
    {
      "name": "federal income taxes",
      "weight": 0.07292615
    },
    {
      "name": "Tips",
      "weight": 0.07272668
    },
    {
      "name": "tips",
      "weight": 0.07272668
    },
    {
      "name": "tipped occupations",
      "weight": 0.07253932
    },
    {
      "name": "tax",
      "weight": 0.070442684
    },
    {
      "name": "lower income",
      "weight": 0.07024143
    },
    {
      "name": "bingo workers",
      "weight": 0.06679951
    },
    {
      "name": "tipped income",
      "weight": 0.06491883
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.90234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.78759765625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.72216796875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.63818359375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.464599609375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.423095703125
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.3896484375
    }
  ],
  "sentiment": {
    "positive": 0.061723463,
    "negative": 0.58533,
    "neutral": 0.35294646
  },
  "summary": "The Trump administration has released a preliminary list of occupations exempt from federal income taxes on tips under its 'no tax on tips' plan, which eliminates federal taxes for people working in jobs traditionally receiving them. The list also includes podcasters and social media influencers. The temporary provision, which runs from 2025 until 2028, applies to people who make less than $160,000 in 2025. The Yale Budget Lab estimates that there were roughly 4 million workers in tipped occupations in 2023, representing roughly 2.5% of all jobs. The Treasury Department has not specified which jobs will be exempt from tax. However, a report from the Budget Lab suggests that the effects of the law would be small given that tipped workers tend to be lower income. The provision could increase the deficit by $40 billion through 2028.",
  "shortSummary": "The Trump administration’s “no tax on tips\" provision includes unexpected jobs like Podcasters and social media influencers, which will expire in 2028.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9c08d81392bc4a11999ebdbf4445e3d5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Trump’s July tax bill temporarily exempts federal income taxes on tips for workers earning under $160,000, extending beyond traditional tipped jobs to include podcasters, influencers, and other service roles. The Treasury’s list covers eight categories such as entertainment, hospitality, and personal services, affecting roughly 4 million workers—about 2.5% of U.S. jobs. While the immediate fiscal impact is modest, the provision could spur behavioral shifts toward tipped employment, potentially raising the deficit by $32–$40 billion through 2028.",
  "argos_id": "9WUI93WZT"
}