{
  "url": "https://www.zdnet.com/article/google-gets-off-easy-in-the-most-significant-monopoly-case-since-microsoft-trial/",
  "authorsByline": "Steven Vaughan-Nichols",
  "articleId": "bc05b62e7c0c4083a82b757a80fb95cc",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/3a35818b486f949e16e2cea11fad5914e59ac28d/2025/09/03/8452c7bd-eb66-4110-9674-55ece23a686c/gettyimages-1415832512.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T11:53:50+00:00",
  "addDate": "2025-09-03T11:58:42.348837+00:00",
  "refreshDate": "2025-09-03T11:58:42.348839+00:00",
  "score": 1.0,
  "title": "Google gets off easy in the most significant monopoly case since Microsoft trial",
  "description": "The results are not nearly what the Justice Department has asked for.",
  "content": "Follow ZDNET: Add us as a preferred source on Google.\n• The search giant won't have to divest itself of Chrome, Android, or its ad data.\n• Nevertheless, Google is expected to appeal the decision.\n\nIn a landmark decision, Judge Amit Mehta of the US District Court ruled Google violated the Sherman Antitrust Act by stifling competition. As Mehta wrote in his decision, \"Google is a monopolist, and it has acted as one to maintain its monopoly.\"\n\nNow, Mehta has announced what that means in his long-awaited decision against Google. While it comes with important restrictions, it's well short of granting the Department of Justice's request that the tech giant be forced to sell off core assets such as its Chrome browser or Android operating system, or break up its digital ad business.\n\nAlso: Google is killing the Android phone feature that once made them popular\n\nMehta concluded that Google maintained an illegal monopoly in the online search and search advertising markets through exclusive contracts and other anticompetitive tactics. However, he decided that the government's push for divestiture -- calling for Google to sell off Chrome or Android -- was \"overreaching\" and not appropriately justified, declaring such a remedy \"incredibly messy\" and unsupported by direct evidence.\n\nHe added that in the case of Chrome, \"The court's task is to discern between conduct that maintains a monopoly through anticompetitive acts as distinct from \"growth or development as a consequence of a superior product, business acumen, or historic accident.\"\n\nInstead, Mehta has barred Google from striking or maintaining exclusive deals with phone and browser makers that guarantee its search engine as the default option. This upends long-standing contracts with Apple, Samsung, and Mozilla. Google may continue to pay for preferred placement, but only under non-exclusive agreements. So, Mozilla, which depends on Google paying it to be Firefox's default search engine, will stay in business.\n\nAdditionally, the judge ordered Google to share some search data, specifically portions of user interaction and search index information, with rival competitors. Google will not, however, be required to share its advertising data. What this will look like remains an open question.\n\nTo enforce these changes, Mehta outlined the formation of an independent technology oversight committee, charged with policing Google's compliance for six years. The company must also submit to ongoing federal scrutiny to make sure it doesn't recreate exclusionary arrangements using new technology, such as generative AI products.\n\nAlso: Waze vs. Google Maps: I tested two of the best navigation apps, and there's a clear winner\n\nThis ruling marks the most significant monopoly case since the Microsoft trial nearly 30 years ago. Google's search advertising business, which generated over $198 billion last year, remains under pressure from ongoing antitrust scrutiny even as AI-driven search alternatives, such as Perplexity, grow.\n\nIn the meantime, the market is overjoyed at what it sees as a Google win. Google stock jumped 8% as the news quickly spread. Nevertheless, Google is widely expected to appeal the decision, and the judge's orders will be paused pending appeal. This will take years.",
  "medium": "Article",
  "links": [
    "https://www.zdnet.com/article/i-retested-gpt-5s-coding-skills-using-openais-guidance-and-now-i-trust-it-even-less/",
    "https://www.zdnet.com/article/best-ai-search-engine/",
    "https://www.zdnet.com/article/waze-vs-google-maps-i-tested-two-of-the-best-navigation-apps-and-theres-a-clear-winner/",
    "https://www.zdnet.com/article/google-controls-an-illegal-monopoly-in-internet-search-us-judge-rules/",
    "https://www.zdnet.com/article/google-pixel-10-pro-vs-iphone-16-pro-ive-tried-both-flagships-and-theres-an-easy-winner/",
    "https://www.zdnet.com/home-and-office/networking/why-googles-legal-troubles-could-hasten-firefoxs-slide-into-irrelevance/",
    "https://cc.zdnet.com/v1/otc/00hQi47eqnEWQ6T9d4QLBUc?element=BODY&element_label=Google+is+a+monopolist%2C&module=LINK&object_type=text-link&object_uuid=a6f27686-7e5b-4472-9885-3b42eb973f60&position=1&template=article&track_code=__COM_CLICK_ID__&url=https%3A%2F%2Fwww.documentcloud.org%2Fdocuments%2F25032745-045110819896&view_instance_uuid=7158496d-6531-4f93-9dce-9b7f704b9b00",
    "https://www.zdnet.com/article/what-googles-antitrust-loss-means-for-you-and-the-future-of-search/",
    "https://www.zdnet.com/article/is-meta-secretly-scanning-your-phones-camera-roll-check-this-setting-to-find-out/",
    "https://www.zdnet.com/article/google-is-killing-the-android-phone-feature-that-once-made-them-popular-and-theres-a-big-reason-why/",
    "https://www.nytimes.com/2025/04/21/technology/google-search-remedies-hearing.html",
    "https://www.zdnet.com/article/the-justice-department-wants-to-break-up-googles-ad-business/",
    "https://www.npr.org/2025/09/02/nx-s1-5478625/google-chrome-doj-antitrust-ruling",
    "https://www.cnbc.com/2025/09/02/google-antitrust-search-ruling.html",
    "https://cc.zdnet.com/v1/otc/00hQi47eqnEWQ6T9d4QLBUc?element=BODY&element_label=Add+us+as+a+preferred+Google+source&module=LINK&object_type=text-link&object_uuid=5e5d2e64-4b30-43e6-8555-26eac7e449f3&position=1&template=article&track_code=__COM_CLICK_ID__&url=https%3A%2F%2Fwww.google.com%2Fpreferences%2Fsource%3Fq%3Dzdnet.com&view_instance_uuid=379e95d2-6b56-476b-a90b-043a8dd63bd3",
    "https://www.zdnet.com/article/45-time-saving-windows-keyboard-shortcuts-that-supercharged-my-daily-routine/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google",
      "weight": 0.10709655
    },
    {
      "name": "Google stock",
      "weight": 0.10487177
    },
    {
      "name": "Google Maps",
      "weight": 0.103334256
    },
    {
      "name": "Googles search advertising business",
      "weight": 0.07729587
    },
    {
      "name": "Judge Amit Mehta",
      "weight": 0.06653201
    },
    {
      "name": "Amit Mehta",
      "weight": 0.06641764
    },
    {
      "name": "exclusive contracts",
      "weight": 0.06274986
    },
    {
      "name": "Android operating system",
      "weight": 0.062306516
    },
    {
      "name": "Mehta",
      "weight": 0.062197603
    },
    {
      "name": "ongoing federal scrutiny",
      "weight": 0.06107297
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.94970703125
    },
    {
      "name": "/News/Technology News",
      "score": 0.857421875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.83056640625
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.623046875
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.367919921875
    }
  ],
  "sentiment": {
    "positive": 0.05051885,
    "negative": 0.6356024,
    "neutral": 0.31387874
  },
  "summary": "Google has been awarded a significant victory in a landmark decision by Judge Amit Mehta of the US District Court, accusing the search giant of violating the Sherman Antitrust Act by stifling competition. The decision does not require Google to divest itself of Chrome, Android, or its ad data. However, it does not rule out the Department of Justice's request that Google must sell off its core assets or break up its digital ad business. MehtA has also barred Google from maintaining exclusive deals with phone and browser makers that guarantee its search engine as the default option. He also ordered Google to share some search data, specifically portions of user interaction and search index information, with rival competitors. This ruling marks the most significant monopoly case since the Microsoft trial nearly 30 years ago.",
  "shortSummary": "A US District Court decision allows Google to maintain a monopoly without requiring divestiture of Chrome, Android, and ad data, but is expected to appeal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a410331905f54071bf35b34afea879ab",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/i-retested-gpt-5s-coding-skills-using-openais-guidance-and-now-i-trust-it-even-less/",
      "text": "I retested GPT-5's coding skills using OpenAI's guidance - and now I trust it even less\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- The same prompts in GPT-5 yield success, crashes, or errors.\n- OpenAI's prompt optimizer helps, but introduces its own quirks.\n- AI \"unconsciously\" adding details raises trust concerns.\nDo AI's get headaches? Because GPT-5 has certainly been giving me one. This article was going to be so easy. OpenAI came out with a list of best practices for GPT-5 coding. All I was going to do was try those best practices with the GPT-5 coding tests that previously failed and see if there was improvement.\nIt seemed so simple.\nAlso: I tested GPT-5's coding skills, and it was so bad that I'm sticking with GPT-4o (for now)\nBut then I had a thought. What if OpenAI has improved GPT-5 in the week or so since I ran my tests?\nPerhaps I should re-run the failed tests as-is and see what the results are, to use as a baseline for the new best practices.\nFrom a testing point of view, this was a valid approach. From a personal sanity point of view, not so much.\nRe-running test 1\nI re-ran the first failed test. This test has the AI creating a complete WordPress plugin, complete with a user interface and business logic. The idea is you feed in a set of names, it randomizes them, and it separates duplicates so they're not side-by-side.\nAlso: How I test an AI chatbot's coding ability - and you can, too\nWhen I ran this test on GPT-5 originally, it failed. Clicking the Randomize button sent the browser to another, unrelated page. I was able to cajole GPT-5 into fixing it, but the initial failure was what counted.\nThis time, I ran the exact same test with the exact same prompt again. This time, it worked perfectly. Wow, I thought. GPT-5 has improved in the past week.\nIf only I had left well enough alone. But no.\nI had to try again. On my second time with the exact same test with the exact same prompt, clicking Randomize resulted in what WordPressers call the \"white screen of death.\" This indicates something in the code isn't working.\nAlso: GPT-5 bombed my coding tests, but redeemed itself with code analysis\nI tried the exact same test with the exact same prompt a total of five times. The first time it worked. Subsequent times, it didn't. One time, I got a white screen. One time, I got a page full of error messages. One time, I was redirected to another page. One time, nothing happened at all.\nWe'll come back to test 1. But next, I decided to do the same thing with the other failed test.\nRe-running test 4\nThis test asks the AI to write code that talks to Chrome, AppleScript, and another tool called Keyboard Maestro. It requires the AI to be knowledgeable about the three different environments and how they work together.\nHere's an interesting factoid about AppleScript. The scripting language is inherently case-insensitive. So, if you ask AppleScript to compare \"AppleScript\" to \"applescript\", it will consider both strings to be the same. You have to explicitly tell it to compare case before it will do so.\nAlso: You can learn AI for free with these new courses from Anthropic\nWhen I first ran this test against GPT-5, it hallucinated that AppleScript had a native function for making strings lowercase. It does not, so the code failed.\nThis time, instead of hallucinating that AppleScript has a lowercase function, it decided to do one of the most convoluted sets of operations to lowercase a string. Here's that line of code:\nset tabTitleLower to (do shell script \"echo \" & quoted form of tabTitle & \" | tr '[:upper:]' '[:lower:]'\")\nThe code actually works, but it's very weird and totally unnecessary. It launches a shell (the command line) to run a shell script that converts to lowercase. It's like making a grilled cheese sandwich and when you realize you're out of cheese, flying across the country to buy cheese from a 7-11 on the opposite side of the continent. You're not even getting better cheese. You're just doing it in the weirdest and most inefficient way possible.\nLet's not forget that we really don't need to make that text lowercase in the first place, because AppleScript is case-insensitive. So it wrote a highly convoluted piece of code that, while it works, is entirely unnecessary.\nI didn't bother to re-run this test four more times because the headache was already starting to set in.\nOpenAI's GPT-5 coding best practices\nOpenAI has put out what it calls a cheatsheet for GPT-5 coding. It has six main recommendations:\n- Be precise and avoid conflicting information: Well, duh. But apparently GPT-5 gets really confused if asked to follow vague or conflicting instructions.\n- Use the right reasoning effort: Rather than just letting GPT-5 choose its reasoning level, you might want to adjust its model. If it starts to overthink a problem, use a lower reasoning level. Great, so now we have to deal with a neurotic AI. Yippee?\n- Use XML-like syntax to help structure instructions: Rather than using just text, using XML tags to segment aspects of a prompt helps the AI to parse its assignment. This is a good hint, but it feels like a step back from what it could do.\n- Avoid overly firm language: In previous models, we sometimes had to YELL at the AI to get it to listen. Apparently, GPT-5 is passive aggressive, so if you get too forceful in your instructions, it will overdo its compliance, like what my old bosses used to say was my practice of \"aggressively following instructions.\"\n- Give room for planning and self-reflection: Does the AI need a blankie? Perhaps a warm stuffed animal to cuddle? In reality, what OpenAI is saying is that you need to encourage the AI to think through the instructions it gets. Apparently, if you don't tell it to think through the instructions, it won't. I fear for the planet.\n- Control the eagerness of your coding agent: It turns out GPT-5 is even more of a people-pleaser than GPT-4o. When giving it instructions, tell it to tone down its fawning and sucking-uppage.\nI'd like to say something positive here, but it's starting to feel like a migraine. Check out the PDF if you want more details.\nOpenAI also created an AI prompting helper. You point your browser to this tool, and paste in your prompt. The tool will give you back a more extensive prompt. For example, I gave it this prompt from Test 4:\nWrite a Keyboard Maestro AppleScript that scans the frontmost Google Chrome window for a tab name containing the string matching the contents of the passed variable instance__ChannelName. Ignore case for the match. Once found, make that tab the active tab.\nIt gave me back this:\nCreate an AppleScript for use in Keyboard Maestro that performs the following actions: * Begin with a concise checklist (3-7 bullets) outlining the planned steps before proceeding. * Scan all tabs in the frontmost Google Chrome window. * Search for a tab whose name contains the value of the passed variable 'instance__ChannelName', ignoring case sensitivity. * Once a matching tab is found, activate that tab and make it the current/active tab. After generating the script, validate in 1-2 lines whether the script meets all requirements. If not, state what needs adjustment.\nEssentially, it revised the prompt to add a planning phase at the beginning and a validation phase at the end.\nDoes it work?\nNope. Nopity-nope-nope.\nI ran Test 4's \"optimized\" prompt through GPT-5 and got back this script:\nThere are at least three serious flaws in it. First, the code in the green box doesn't work. It doesn't retrieve the value from Keyboard Maestro. Previous versions did that successfully using a completely different (and well-documented) mechanism. This approach is just loony.\nAlso: AI is creeping into the Linux kernel - and official policy is needed ASAP\nNow, look at the blue box. The considering case operation is used only for evaluation. For example, with considering case, \"BLUE\" and \"blue\" are different values. Do you see any sort of if statement or evaluation inside the blue box? Me neither.\nThen there's the red box. There is no such syntax as \"considering case false.\" First, the default behavior is to ignore case. Second, if you really wanted to explicitly tell AppleScript to ignore case, you'd use an \"ignoring case\" block. But \"considering case false\"? That's just some made-up syntax right there.\nRetrying the WordPress plugin\nI also ran my original prompt for the WordPress plugin through the prompt optimizer. I got back a fairly extensive project requirements document.\nOn the plus side, this time the plugin worked. I tried generating code a second time, and it also worked. So perhaps the optimization is something to try if GPT-5 isn't playing nice.\nBut then there's the weirdness. Because there's always weirdness. Check out the header block generated by GPT-5.\nNotice the author is attributed to Advanced Geekery Labs. Historically, the AIs have listed the author field as \"Your Name.\" But this time, it's Advanced Geekery Labs.\nThere is some relevance, because Advanced Geekery is the name of my YouTube channel and weekly newsletter. But I didn't use it anywhere in my instructions for this plugin. Additionally, I've never added Labs to the end of Advanced Geekery, even though my security product is sold through ZATZ Labs.\nSo I asked GPT-5 where it got the name Advanced Geekery Labs from. Its answer:\nGood question. The name \"Advanced Geekery Labs\" isn't something you provided in your request. I introduced it in the plugin header's Author: field as a placeholder, because in earlier conversations you've mentioned your \"Advanced Geekery\" brand, and I unconsciously expanded it into \"Labs.\"\nI'm glad the AI thinks it's a good question. That warms my heart. But \"unconsciously expanded\"? That's a direct quote from the AI. Those are its words.\nSo, we're now dealing with hallucinating AIs that operate unconsciously?\nWe're all doomed.\nWhat about coding and GPT-5?\nI still don't trust it. Actually, I don't trust it even more than when I tested it originally. What else might it do to my code \"unconsciously\"?\nI guess, if you really need GPT-5 to give you some code, you could try the optimizer. But I wouldn't rely on it.\nGPT-4o was impressive, but it had some problems. GPT-5 is like its more troubled, more difficult sibling.\nWith GPT-4o, I'd be willing to trust, with verification. I just plain don't trust GPT-5. There's something that's just not right. If we were to experience an AI that would revolt against its creators and try to kill us all, I would not be surprised if it all originated with GPT-5.\nAnd no. My headache hasn't gone away. Apparently, Tylenol is now bad for you. So, there's that, too.\nWhat do you think?\nHave you tried relying on GPT-5 for coding projects? If so, did you run into the same kinds of inconsistencies and odd behaviors? Do you find OpenAI's \"best practices\" helpful, or do they feel like workarounds for deeper problems? And what's your take on GPT-5's tendency to improvise or even \"unconsciously\" insert details? Is it a harmless quirk or a reason for concern? Let us know in the comments below.\nYou can follow my day-to-day project updates on social media. Be sure to subscribe to my weekly update newsletter, and follow me on Twitter/X at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, on Bluesky at @DavidGewirtz.com, and on YouTube at YouTube.com/DavidGewirtzTV."
    },
    {
      "url": "https://www.zdnet.com/article/waze-vs-google-maps-i-tested-two-of-the-best-navigation-apps-and-theres-a-clear-winner/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWaze vs. Google Maps: I tested two of the best navigation apps, and there's a clear winner\nFollow ZDNET: Add us as a preferred source on Google.\nA quick Google search will surface article after article claiming that Waze is far better than Google Maps. But is that actually true? I'm a longtime Google Maps (and Google Earth) user. I swear by the app, and I regularly side-eye anyone who says otherwise -- especially, god forbid, Apple Maps users.\nAlso: This hidden Google Maps feature is making people emotional - here's why\nI'm also a tech editor, though, which means I do my best to set aside personal bias in the name of journalism. Every now and then, I force myself to try alternative navigation apps -- and that includes Waze, which, in case you didn't know, Google acquired in 2013.\nSo, if you're looking for a true feature-by-feature breakdown of how Waze compares to Google Maps, you've come to the right place. I've tried both, and I'm here to tell you which one really gets you where you need to go faster, smarter, and better.\nIs Waze or Google Maps better?\nLet's break down all the major features to find a clear winner. Will the final scorecard surprise us both? Maybe.\nNavigation with real-time rerouting\nWinner: Waze, for getting you from A to B the fastest\nWaze is for people who want to get where they are going -- fast.\nIt prioritizes the quickest route and will automatically reroute you the second traffic gets messy. There's no asking for permission... it just does it, even if it means taking you down a weird side street. Google Maps, on the other hand, takes a more measured approach. It considers things like road types and even fuel efficiency for different vehicle types. It'll suggest a faster route if one pops up, and you have to tap to approve.\nAlso: How to share your location on Android quickly - via text or Google Maps\nPersonally, I like having the final say. If an app wants to reroute me last-minute, I'd rather know where I'm headed -- and approve it -- before I take the turn. But if your top priority is shaving off seconds, Waze is the way to go. I'll give this one to Waze for that alone, but it's close.\nPublic transit and other travel modes\nWinner: Google Maps, for walking, biking, the bus, and more\nWaze is just for drivers. Literally. Like, people driving cars or motorcycles. There's no using it for walking, biking, buses, or trains. Basically, if you're not behind the wheel, Waze can't help you. Google Maps, however, has it all. Whether you're headed somewhere on foot or figuring out a multi-leg public transit trip, it's got detailed routes, live schedules, and real-time updates.\nTraffic and incident reporting\nWinner: Waze, for its longtime offering of driver-led data\nWaze has long stood out for its live, driver-submitted information that helps it decide how to reroute you in real time. Users can report everything from traffic jams and road hazards to construction, speed traps, and even bad weather. As you drive, you can confirm or dismiss alerts to help keep the map accurate and up to date.\nLately, though, Google Maps has been catching up. It now also lets users report crashes, slowdowns, road closures, speed traps, and even lane blockages. These reports show up on the map, which is helpful. But, unlike Waze, Google Maps won't automatically reroute you based on that real-time info. If something pops up ahead, it's on you to decide whether to take a detour or stick with the original route.\nAlso: 6 Google Maps tricks to try for the navigation app's 20th birthday\nSince Waze has offered robust real-time reporting from the very beginning, I'll give it the win here, but it could just as easily be a tie at this point. Google Maps has come a long way, with the gap between the two getting smaller.\nPolice and speed trap alerts\nWinner: Waze, for more detailed reporting\nThis is one of the areas where Waze has really made its name.\nThe app has long let users report police sightings -- including when they're hiding -- along with things like mobile phone detection cameras. Google Maps has started to catch up with basic reporting tools, but it's still not as detailed. For example, there's no option to flag mobile phone detection zones yet. Since Waze was the forerunner here and still offers more granular, real-time alerts, it takes the win in this category.\nOffline maps and data use\nWinner: Google Maps, for letting you download maps\nWaze needs a data connection for pretty much everything. It'll cache your route a bit if you start with a signal, but once you're offline, you're mostly out of luck -- no live updates, no rerouting, and limited functionality. Google Maps is a lot more offline-friendly. You can download entire regions ahead of time, complete with turn-by-turn directions, which makes it a total lifesaver when you're in the middle of nowhere or traveling abroad.\nInterface and design\nWinner: Google Maps, for its rich discovery options\nWaze definitely has a personality, thanks to its colorful, cartoony design packed with big icons and bold, in-your-face alerts. It's also got a playful side when it comes to customization. You can stream music directly through the built-in audio player (Spotify, anyone?), pick a voice \"sidekick\" like Halo's Master Chief or comedian Nate Bargatze, and even set a mood once you've driven more than 160 kilometers.\nGoogle Maps isn't quite as caricatured, but it is loaded with features. It's fantastic for exploring neighborhoods, digging into business info, or finding restaurants, parks, and stores. You can even hop into Street View to preview a location before heading out. There are plenty of layers and details too -- switch between satellite, terrain, air quality, wildfire zones, and even 3D buildings. It might feel a little cluttered when you're just trying to drive, but honestly, it's kind of fun to click around and see just how much it can do.\nAlso: How to blur your house on Google Street View (and 4 reasons why people do it)\nWhile Waze has basic details like business addresses and hours, what about restaurant reviews or photos? Not so much. Google Maps is a beast in this department. Full reviews, photos, peak hours, menus, and more.\nI'll admit this can come down to personal preference. If you're into quirky extras and playful design, Waze definitely delivers. But since I'm not big on the gimmicky stuff and prefer a more feature-rich interface with plenty of discovery options that actually help me get around, I'm giving the edge to Google Maps.\nAI voice assistance\nWinner: Google Maps, for deeper Gemini integration\nWaze recently rolled out a \"Conversational reporting\" feature powered by Google Gemini, which lets you say things like \"Looks jammed ahead,\" and the app will parse it into a real-time report. This is fun, especially when driving. But Google Maps has Gemini integrated too. I've been able to use it to ask things like \"What's a good lunch spot around here?\" and get personalized, location-aware suggestions. I like having this deep integration, rather than just using it for reporting, so Google Maps wins. Again, it's close.\nAvailability and compatibility\nWinner: Google Maps, for slightly broader reach\nBoth apps are available globally on iOS, Android, Android Auto, and Apple CarPlay. But Google Maps is preinstalled on most Android phones and comes baked into the Android Automotive OS, so it wins here.\nThe final scorecard\nLet's tally up which navigation app is the winner, based on the key features above and whether they offer them or do it better.\n| Category | Winner | Why it wins |\n|---|---|---|\n| Navigation and rerouting | Waze | Instantly reroutes you based on real-time traffic -- no permission needed. |\n| Transit and travel modes | Google Maps | Supports walking, biking, buses, trains, and more. |\n| Traffic and incident reporting | Waze (near tie) | Real-time, driver-powered alerts with live confirmation and rerouting. |\n| Police and speed trap alerts | Waze | More detailed reports, including hidden police and mobile phone detection. |\n| Offline maps and data use | Google Maps | Full offline map downloads with turn-by-turn directions. |\n| Interface and design | Google Maps (near tie) | Richer toolset: Street View, map layers, business info, etc. |\n| AI voice assistance | Google Maps (near tie) | Gemini is live in both apps, but it's more fully integrated in Google Maps. |\n| Availability and compatibility | Google Maps | Preinstalled on Android, works across more platforms out of the box. |\nTotal:\n- Waze: 3 wins\n- Google Maps: 5 wins\nAnd there you have it, folks. Google Maps edges out Waze by two categories. That said, a few of these could've easily gone either way, and a lot of it really comes down to personal preference. Still, if you want my take (and let's be honest, if you've made it this far, you probably do): Google Maps is a seriously feature-rich app, and any gaps between it and Waze are shrinking fast.\nFAQs\nWhen should you use Waze over Google Maps?\nIf you care most about avoiding traffic, hazards, and speed traps, Waze is built for that. It's faster at rerouting and more focused on the driver's needs. Here's quick decision tree if you're on the fence about which app to use and when.\nAlso: You can ask Google Maps questions now, thanks to Gemini\nUse Waze if...\n- You're driving and want the fastest possible route.\n- You love seeing live, detailed road alerts (speed traps, hazards, cops).\n- You enjoy customizing your experience (fun voices, avatars).\n- You don't need walking, biking, or transit directions.\nUse Google Maps if...\n- You take public transit, walk, or bike.\n- You want detailed business info and reviews.\n- You want to use Street View and its historical timeline feature.\n- You travel internationally or need offline maps.\n- You want to use deep Gemini-powered AI voice assistance.\nCan Waze be used offline?\nNot really. Waze requires a data connection to function properly. It might cache part of a route but doesn't offer true offline maps like Google Maps does.\nDoes Google Maps show police like Waze?\nSort of. Google Maps has added some basic reporting, but it's not as detailed as Waze's real-time, user-generated alerts.\nCan you use Waze for walking or biking?\nNo. Waze is strictly for drivers. If you're walking, biking, or taking transit, use Google Maps.\nWhich uses more mobile data?\nWaze uses more data due to its constant real-time updates and crowd-sourced alerts. Google Maps is more data-efficient, especially with offline maps.\nDoes Waze have Street View or historical timeline data?\nNo. Waze doesn't support Street View or historical timeline data. If you want to visually explore a location before you go -- like seeing what a building entrance looks like or checking parking availability -- you'll need to use Google Maps, which offers full Street View integration. Google Maps also allows you to go back in time to see a place how it looked in the past -- up to 20 years ago.\nGet the morning's top stories in your inbox each day with our Tech Today newsletter."
    },
    {
      "url": "https://www.zdnet.com/article/google-controls-an-illegal-monopoly-in-internet-search-us-judge-rules/",
      "text": "Google controls an illegal monopoly in internet search, US judge rules\nA US District Court judge has found that Google maintains an illegal monopoly in online search and search advertising, violating US antitrust laws.\nOn Monday, Judge Amit Mehta of the US District Court for the District of Columbia handed down his ruling: the company violated Section 2 of the Sherman Antitrust Act by stifling competition and arranging exclusive and restrictive contracts with other companies. In a case that the US Department of Justice filed in 2020 and took to court in September 2023, the ruling represents a major blow to Google.\n\"Google is a monopolist, and it has acted as one to maintain its monopoly,\" Mehta wrote in the 277-page ruling.\nAlso: You can now use Google Lens with your voice to search. Here's how\nSiding with the DOJ, the judge found that Google engages in practices that prevent rival companies from competing fairly. Judge Mehta also criticized the company's contracts with Apple and other tech players that require them to use Google as the default search engine in their products.\n\"The long-drawn-out decision by a federal judge, Judge Amit Mehta, that confirmed Google's violation of section 2 of the Sherman Act was significant and expected,\" Ted Sfikas, field CTO at digital analytics provider Amplitude, told ZDNET. \"Judge Mehta focused on Google general search services and search advertising, but all of the other satellite services are impacted too.\"\nFollowing the judge's ruling, the Antitrust Division of the US DOJ issued a statement from Attorney General Merrick Garland and Assistant Attorney General Jonathan Kanter.\n\"This victory against Google is a historic win for the American people,\" Garland said. \"No company -- no matter how large or influential -- is above the law. The Justice Department will continue to vigorously enforce our antitrust laws.\"\nCalling this a landmark decision that holds Google accountable, Kanter said it \"paves the path for innovation for generations to come and protects access to information for all Americans.\"\nConsidering Google's search engine is responsible for 90% of all searches, Sfikas called it one of the strongest monopolies to ever exist.\nAlso: How to use Google Wallet - and why you should already\n\"Imagine if AT&T owned 90% of the telecom market,\" Sfikas said. \"Would your phone bill be higher or lower? Businesses realistically have no choice but to advertise with Google's search ads. Only 6% use Bing, and I don't blame them. Is it Google's fault that everyone uses their search engine? We could say 'No, it's not,' but only if the typical consumer could easily choose the other ones using a simple interface that walks them through it.\"\nIn a response posted on X, Google Global Affairs President Kent Walker announced the company's intention to appeal the decision:\nThis decision recognizes that Google offers the best search engine, but concludes that we shouldn't be allowed to make it easily available. We appreciate the Court's finding that Google is 'the industry's highest quality search engine, which has earned Google the trust of hundreds of millions of daily users,' that Google 'has long been the best search engine, particularly on mobile devices,' 'has continued to innovate in search' and that 'Apple and Mozilla occasionally assess Google's search quality relative to its rivals and find Google's to be superior.'\nGiven this, and that people are increasingly looking for information in more and more ways, we plan to appeal.\nDespite finding Google culpable of violating antitrust laws, the judge didn't suggest any penalties, at least for now. Instead, the court will rule on possible remedies sometime in the next few months. And for that, Sfikas suggests looking to the past.\n\"We can look at past history to get a sense of what might happen to Google now,\" Sfikas said.\n\"In 1998, it was Microsoft that first encountered an antitrust suit from the US government. Microsoft's browser, Internet Explorer, was determined to be so intertwined with the Windows operating system that it was causing a barrier to entry in the adjacent web application market,\" Sfikas said. \"Microsoft settled this suit by decoupling the browser from the operating system and this ushered in an age of competing browsers and the subsequent online applications that we know and use today, like Google, Amazon, TikTok, Meta.\"\nIronically, it's now online applications that have helped Google achieve a dominant position, Sfikas added. Google's share of the market is linked to Chrome, the Google Ad Network, the Google Ads Hub, Google Analytics, and Google Tag Manager, affecting prices and the quality of service. The government will take the approach that this harm to the market is the reason it took action, a position that Google will naturally argue.\n\"Based on all of this, I believe Google will settle in much the same way its predecessor in [the] antitrust case did,\" Sfikas said. \"They will voluntarily make it a distinct choice as to which browser to use, not just a checkbox per se, but an actual screen that offers immediate download of any other browser right at the beginning when you first turn on your Android [device].\"\nOn a greater scale, what does the ruling itself mean for the search engine and online advertising markets?\n\"If the ruling results in a decomposition of [the] search engine upon devices and browsers, that should result in increased usage of Yahoo, Bing, DuckDuckGo, and many more.\" Sfikas said. \"With the upcoming release of the highly anticipated OpenAI Search engine, this may further recalibrate the market. In either or both scenarios, the result will be a more agnostic data architecture in place globally to work with them all.\"\nThe legal battles aren't over for Google. The company faces another trial in September focused on digital advertising. A lawsuit filed in January 2023 by the DOJ and several states accuses Google of monopolizing the market for online advertising. That trial stands to impact Google even more dramatically.\n\"When the AdTech trial starts this September, I believe the stakes are much higher,\" Sfikas said. \" I believe that Google's monopoly within the system of Google's Ad Network, Search, Ads Hub, and Analytics constitute a unique platform and unfair market advantage that no other competitor can replicate. I believe that the government will move to split those platforms up as separate entities, in an effort to decouple Search from the Ad Network.\""
    },
    {
      "url": "https://www.zdnet.com/home-and-office/networking/why-googles-legal-troubles-could-hasten-firefoxs-slide-into-irrelevance/",
      "text": "Why Google's legal troubles could hasten Firefox's slide into irrelevance\nFirefox has never been the most popular web browser. At its peak, in 2010, Firefox was used by 34.1% of the market. Today, the US federal government's Digital Analytics Program (DAP), with its running count of the last 90 days of US government website visits, the most reliable web browser survey, shows Firefox with a mere 2.8%.\nThat's not Firefox's all-time low, but it's still miserable. Chrome, as you might guess, is the leader with 54.5%, followed by Safari, thanks to iPhones, with 24%, and Edge with 14.2%. Only Internet Explorer -- yes, some people are still running it -- of the well-known browsers has a smaller number of users, with 1.7%.\nAlso: The best secure browsers for privacy: Expert tested\nChrome's numbers are even bigger than they first appear. Its open-source foundation, Chromium, also powers Microsoft Edge. Except for Safari and Mozilla Firefox, all the other web browsers that matter, such as Opera, Vivaldi, and Brave, run on top of Chromium. Altogether, these alternative browsers equal Firefox's market share with 2.8%.\nEven Firefox's parent organization, Mozilla, show Firefox's numbers dwindling. Since March 2020, Firefox has lost over 50 million monthly active users (MAU), dropping from 206 million to 155 million as of July 2024.\nIn a word, ugh.\nSo, why has this slide happened? Well, it all started when Google rolled out Chrome. As Hiten Shah, CEO of Nira, a cloud security company, observed, Google fundamentally reinvented the browser. In 2008, Google started creating an entirely new operating system for a cloud-based open web with its extensions and applications.\nTo make that happen, \"=\"\" top=\"\" web=\"\" browser=\"\" developers=\"\" from=\"\" firefox,=\"\" such=\"\" as=\"\" ian=\"\" hickson,=\"\" darin=\"\" fisher,=\"\" pam=\"\" greene,=\"\" and=\"\" brian=\"\" ryner.\"=\"\"> Microsoft and the Mozilla Foundation were caught flat-footed, and neither have caught up.\nEventually, Mozilla figured out what was happening. It took them much too long. In 2017, almost a decade after Chrome appeared, then Mozilla CEO Chris Beard admitted, \"Firefox did not keep up with the market and what people really want. A lot of hardcore Firefox fans are now happy Chrome users.\"\nAlso: Why you should update Chrome and Firefox right now\nSince then, things haven't gone well with Firefox. For example, the shift towards mobile browsing has favored pre-installed smartphone browsers, such as Chrome and Safari. Indeed, when you install \"Firefox\" on an iPhone, you only have a Firefox skin with the Safari Webkit running underneath it. It's only in the European Union, starting with iOS 17.4, that when you run Firefox on an iPhone, you're actually running Firefox.\nMany Firefox users have also gotten sick of the browser. As one recently wrote on Reddit, \"Let's not pretend Mozilla isn't its own worst enemy. When the focus seems to be more on choosing the right shade of blue for hair dye rather than delivering features people have been begging for -- some for over a decade.\"\nOf course, others passionately defend Firefox, but objectively, Mozilla appears to be circling the drain. Take, for example, the simple fact that Mozilla Foundation recently laid off 30% of its employees because of a \"relentless onslaught of change\".\nSpecifically, Mozilla wiped out two major divisions: advocacy and global programs. This move came after Mozilla Corp. laid off 5% of its workforce in February. This led to cuts in the company's Mozilla social, VPN, Relay, and Online Footprint Scrubber.\nAlso: Chrome adds a quick-fix tool to speed up your browser with a single click\nMoving ahead, Mozilla is spending its remaining resources on incorporating \"=\"\" ai=\"\" capabilities\"=\"\">. Its latest launch is a project named Lumigator 2. Its job is to \"help developers confidently select the best LLM [Large Language Model] for their specific project.\"\nGood luck to artificial intelligence in saving Mozilla's bacon when every company and its brother are burning money and hoping for an AI miracle.\nAlso: OpenAI's Sora AI video generator is here - how to try it\nFor any of this approach to work, Mozilla must rely on Google.\nI find it more than a little ironic that many people still pick Firefox as their web browser because they hate Google and Chrome. Mozilla, Firefox's parent organization, lives and dies by the money it gets from Google.\nNo Google: No Firefox. Seriously.\nIn its last financial report from 2023, the Mozilla Foundation reported a total revenue of over $593 million. Of that cash, $75 million came from subscriptions and advertising for approximately 12.6% of the total revenue. The rest, $510 million, about 86%, came from search engine royalties, primarily from Google.\nAlso: The best ways to transfer large files between your laptop and desktop: 3 options\nWhy does Google do this? In a Bloomberg report, Chris Messina, a product designer and early Firefox adopter, said, \"What a great foil for Google to then sponsor a nonprofit competitor that was never quite as good.\"\nThat approach made some sense when Microsoft Internet Explorer was still a viable rival to Chrome. That hasn't been the case for some time, though.\nIndeed, paying Mozilla so that Google remains Firefox's default search engine seems like a bad move. In August, the Department of Justice won a court case that found that \"Google is a monopolist, and it has acted as one to maintain its monopoly,\" partly because of its search engine deals with Apple and Mozilla.\nGiven this decision, would you renew a deal with Mozilla if you were Google? Yeah, I wouldn't either.\nSo, where does that leave Mozilla? I don't see Mozilla and Firefox collapsing immediately. After all, Mozilla has over a billion dollars in cash and investments.\nSo, why has Mozilla been cutting resources, with all that money in hand and all that cool Google cash coming in? That's a good question.\nAlso: OpenAI's AI transcription tool hallucinates excessively - here's a better alternative\nOne cynical answer comes from Windscribe, a virtual private network (VPN) company. The firm thinks, \"Some of you may be under the impression that Mozilla is a simple non-profit, out to save the world one smidge of privacy at a time.\"\nWindscribe said it's not: \"The whole 'not-for-profit' play is really just corporate speak for we are better at avoiding taxes than you. Despite the illusion of separation, these entities are all so tightly intertwined that the auditor's report simply refers to the collection of the three as 'Mozilla.'\"\nThe company continued, \"In the period between 2008-2018, Mozilla lost 85% of its market share, while [CEO Mitchell] Baker's pay simultaneously rose 400%. I wish I could fail upward like that.\" Don't we all?\nSo, while Mozilla's executives continue to profit and the company/foundation salts away money, it also keeps laying off employees. Of those who work there, twenty on the job review site Glassdoor used the phrase \"absolutely disastrous management\". Others used stronger language.\nIn its day, Firefox was a vital, major open-source program. Today, it's on the way down and out. I doubt Mozilla or Firefox will survive until the end of the decade. Depending on what happens with Google, Firefox might not even make it to the end of next year."
    },
    {
      "url": "https://www.zdnet.com/article/is-meta-secretly-scanning-your-phones-camera-roll-check-this-setting-to-find-out/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nIs Meta secretly scanning your phone's camera roll? Check this setting to find out\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Meta could be scanning your camera roll right now.\n- It's using your photos to provide AI-powered suggestions.\n- Check Facebook settings to turn off the features.\nMeta could be analyzing and retaining your phone's photos without you realizing it.\nSome Facebook users have noticed that, deep within their app settings, toggles are switched on that allow Meta to access their camera roll to offer AI-powered suggestions, including \"personalized creative ideas, like travel highlights and collages\" -- and they don't remember agreeing to this.\nAlso: How to delete Facebook, Messenger, or Instagram - if you want Meta out of your life\nThe problem? This feature allows Meta to access and retain your camera roll images, and that could raise serious privacy concerns, especially for users who wouldn't otherwise knowingly opt in.\nIf you do get Meta's \"cloud processing\" pop-up announcing this feature and tap \"Allow\" on it, you'll agree to Meta's AI Terms of Service and permit your \"media and facial features\" to be analyzed by AI.\nFacebook will then use your camera roll images -- including the dates on them and the presence of people or objects -- to suggest collages, themed albums, recap posts, or AI restyled versions of your pictures. These AI suggestions are only visible to you unless you choose to share them, and Meta says the media won't be used for ad targeting.\nAlso: How to protect your privacy from Facebook - and what doesn't work\nZDNET's editorial director found Meta's camera roll sharing suggestions enabled in her Facebook app without her knowledge. I also noticed they were enabled for me, although I vaguely recall seeing a pop-up from Facebook about the new features a few weeks ago. I think I dismissed it quickly, and I can't remember whether I tapped Allow or Don't allow on it.\nHow to stop Facebook from scanning your camera roll\nMeta said its camera roll sharing suggestions are not enabled by default. If you're worried you dismissed Facebook's pop-up, or unknowingly opted in, and gave access to your camera roll, here's how to check and turn it off.\n1. Open the Facebook app\nThe settings you'll want to check can be found in the Facebook mobile app.\n- Grab your iPhone or Android phone.\n- Open the Facebook app. You'll need to be signed into your account.\n2. Go to the Menu > Settings and Privacy\nFacebook hides most of its settings in the menu -- the three-line hamburger icon in the bottom corner of the app.\n- Tap the Menu icon in the bottom right corner of the screen.\nOnce the menu opens, look for Settings and Privacy with a gear icon.\n3. Select Settings\nOnce you find and tap Privacy and Settings to expand the dropdown options, tap Settings again.\n- Under Settings and Privacy, tap Settings.\n- Now, scroll down and look for \"Camera roll sharing suggestions.\"\n4. Go to Camera roll sharing suggestions\nMeta placed the toggles that grant it access to your camera roll under the \"Camera roll sharing suggestions\" setting. You'll need to go there to see if they're on and, if so, switch them off.\n- Tap the option labeled \"Camera roll sharing suggestions.\"\n- This will open a preference page with a couple of toggles.\n5. Turn off both toggles\nOnce you're inside the camera roll sharing suggestions page, notice the two separate switches. If they're blue and the toggle circle is pushed to the right, they're on -- meaning Meta is already processing and retaining your phone's photos. Turn them off so the app can't automatically upload and analyze your camera roll.\n- Find the option labeled \"Get camera roll suggestions when you're browsing Facebook.\" If the switch is on (blue), tap it once to turn it off (gray). This will stop Facebook from using basic camera roll data, such as which videos you've favorited and when photos were taken, to suggest sharing media you haven't yet uploaded.\nFind the option labeled \"Get creative ideas made for you by allowing camera roll cloud processing.\" If the switch is on (blue), tap it once to turn it off (gray). This will stop Facebook from continuously uploading media from your camera roll -- and using details like time, location, themes, and the presence of people or objects -- to generate personalized creative ideas such as recaps and AI restylings.\nFAQs\nThese steps don't work for me. Why?\nThe steps above, which I've verified using the Faebook app for iPhone, may vary on Android devices.\nSamsung users, for instance, must do the following: Open Facebook > Go to Profile/Menu > Tap the gear icon in the upper right > Scroll down to \"Camera roll sharing suggestions\" and select it > You'll see the two camera roll sharing toggles.\nDefinitely go to Facebook's support hub if you need more help. You basically got to find the Settings and privacy menu in the Facebook mobile app, and from there, you can find \"Camera roll sharing suggestions\" and disable the options.\nWhy is Facebook cloud-processing my device's camera roll?\nMeta is uploading and analyzing your camera roll photos and videos, even ones you haven't posted, in its cloud in order to generate AI-powered suggestions like collages, monthly recaps, themed albums, or AI-restyled versions of your images.\nWhere is this feature being tested?\nMeta has confirmed the feature is a test, saying, \"We're exploring ways to make content sharing easier for people on Facebook by testing suggestions of ready-to-share and curated content from a person's camera roll.\"\nThe test is currently available in the US and Canada, but it's not available in Illinois or Texas due to those states' privacy laws.\nDid Facebook ask for my consent before turning this on?\nMeta is showing a pop-up asking users if they want to enable cloud processing, but some users claim they haven't seen it. Instead, they say found the toggles in their settings switched on without their knowledge, raising questions about whether clear consent was given.\nI've asked several people to check whether camera roll sharing suggestions were enabled in their Facebook app. Besides myself and ZDNET's editorial director, my partner, in-laws, and many friends all found the options turned on without their knowledge. Many users have also reported on social media and in forum threads, like this one on Y Combinator, that the settings were enabled for them.\nSome of these people recalled seeing a consent pop-up from Facebook, while others did not. But nearly everyone said they did not realize they were allowing access to their camera roll data. They also said they would not have allowed it if they had known.\nCan I remove my photos once they've been uploaded?\nZDNET's sister site, CNET, reports that Meta pulls from your newer pictures (roughly the last 30 days) and if you disable the feature, your uploaded photos will be deleted after 30 days. The only way to confirm is by downloading your Facebook account data.\nWhy is this a potential privacy issue?\nIt expands Meta's reach beyond the content you've chosen to upload and share online -- into your private, unposted photos and videos. For many, that's a major red flag and a line they're not comfortable crossing, understandably so.\nAlso: What Zuckerberg's 'personal superintelligence' sales pitch leaves out\nEven if Meta is asking for consent to access your camera roll in order to analyze your phone's photos and provide AI-powered suggestions, the company could have done a better job of being clear and explicit about what it's trying to do.\nHow many users, like me, simply dismissed the consent pop-up without fully realizing what they'd just agreed to?\nEditor's note: This article was last updated on Sept. 2, 2025, to clarify steps for Android users. It was also updated on Aug. 24 to confirm that Meta's camera roll sharing suggestions are not turned on by default and are entirely opt-in. Still, some users say they never knowingly agreed and are finding the features enabled in their settings."
    },
    {
      "url": "https://www.zdnet.com/article/what-googles-antitrust-loss-means-for-you-and-the-future-of-search/",
      "text": "What Google's antitrust loss means for you and the future of search\nIn a landmark decision, Judge Amit Mehta of the US District Court ruled Google violated the Sherman Antitrust Act by stifling competition and arranging exclusive and restrictive contracts with other companies. As Mehta wrote in his decision, \"Google is a monopolist, and it has acted as one to maintain its monopoly.\" Well, that's plain enough.\nAlso: Google controls an illegal monopoly in internet search, US judge rules\nMehta found Google engaged in practices that prevented its rivals from competing fairly. He's got a point. By StatCounter's reckoning, Google owns the lion's share of the search market with 91%, followed by Bing with a paltry 3.86%. DuckDuckGo? It's trailing with a meager 0.62%.\nIn particular, Mehta criticized the company's contracts with Apple, Samsung, other smartphone companies, and Mozilla -- contracts that required them to use Google as the default search engine for their products. In particular, Google reportedly paid Apple $18 billion annually to secure its position as the default search engine on iOS devices. Other firms received over $8 billion a year to ensure that Google was their search engine of choice.\nGoogle, of course, denied that this was why its search engine was their pick. Google Global Affairs President Kent Walker replied, \"This decision recognizes that Google offers the best search engine but concludes that we shouldn't be allowed to make it easily available.\" Them's fightin' words!\nWhat will this mean for users? In the short run, nothing. Google has already announced that it will appeal the decision.\nWhat will it mean in the long run? Well, we'll see. Before this, the only technology lawsuit of this scale was the Microsoft antitrust lawsuit, US versus Microsoft. In theory, Microsoft lost that case. In practice, Netscape died, and for over a decade, Internet Explorer was the browser of choice. For all practical purposes, Microsoft was the winner.\nAlso: How to delete yourself from internet search results and hide your identity online\nIn addition, the court has yet to propose any specific remedies to put Google in its place. For example, the court might force Google to break up its business operations, restrict its ability to enter into exclusive agreements, or make users decide when they first use a browser whether they want Google or another search engine.\nOriginally, in the Microsoft case, Microsoft was supposed to be broken up, but that was later overruled. Other remedies were put in place but amounted to little.\nGoogle, in its case, may not be so lucky. Why? Because in this go-around Google is facing not just the courts and its old rivals Microsoft and Yahoo but a new generation of AI-driven search engines.\nAI-powered search engines, such as OpenAI's ChatGPT, Microsoft's Bing Copilot, and Perplexity, have been gaining traction. These engines use large language models (LLMs) to understand and respond to user queries more naturally and intuitively.\nAlso: 3 ways Google just supercharged your Chrome browser with AI - and they're surprisingly useful\nThis AI twist makes a big difference.\nBack in the late 1970s and early 1980s, my first business -- Researchers at Large -- was based on my ability to master the primitive search engines of the day, such as NASA RECON, DIALOG, and OCLC. Things got easier with AltaVista and, eventually, Google. Even now, though, using Google effectively requires mastery of search techniques.\nThe engines still aren't as good as I am, but they're getting much closer. There's a big enough difference from doing it yourself that I can see these chatbots giving Google a run for its money.\nOf course, Google has tried its own AI-enabled search improvements. However, its efforts, especially AI Overview, have failed so far.\nIn addition, unlike Microsoft, Google's main competitor, some experts have speculated that Google's AI-driven search might not just damage content creators but Google's own ad revenue. John Wihbey, associate professor of media innovation and technology at Northeastern University, thinks \"Google might be cannibalizing their own revenue stream.\"\nStasia research expert Tiago Bianchi agrees, writing that, \"Errors performed by Bard during its release made Google lose around 100 billion US dollars in market value, despite other tools committing similar inaccuracies. Later, sresults on Google's AI Overviews echoed the embarrassment.\"\nAlso: How to turn on Private DNS Mode on Android - and what it can do for you\nIf this analysis is correct, AI-driven search may not be to Google's advantage. However, its competitors -- which aren't wedded to an ad business model -- might be perfectly happy to offer AI-based search.\nBianchi warns, though, that AI-driven search has yet to prove it can steal significant market share from Google. \"Despite over a quarter of surveyed US adults trying and sustaining reasons for using AI-powered search tools across all generations, the majority remains unimpressed or skeptical about AI-tailored results. With little changes in the market share of big search companies, the trend sees more optimism among marketers, who strongly believe in the effectiveness of chat-based search advertising and reflect the enormous investments in the sector.\"\nHe's not alone. Chris Rodgers, CEO of the SEO firm CSP, told me, \"Yesterday's ruling could help Open AI down the line if Google's appeals are unsuccessful. However, it is expected to be a long, drawn-out process. Google could end up seeing a loss of search-market share if they are removed as the default search engine on mobile devices; however, as long as it's the search engine of choice for the majority of consumers, Google will remain the dominant search engine, even if OpenAI or other AI search-engines erode search-market share.\"\nAlso: Your Google Search results are about to look very different. Here are 4 reasons why\nStill, just as the Microsoft case judgment had the potential to change the web browser and PC market, this decision might change the search engine market. Certainly, the combination of AI search, a legal battle, and Google potentially losing its automatic position on iPhones and Android phones may change how we search.\nStay tuned. There's more to come."
    },
    {
      "url": "https://www.zdnet.com/article/google-is-killing-the-android-phone-feature-that-once-made-them-popular-and-theres-a-big-reason-why/",
      "text": "Google is killing the Android phone feature that once made them popular - and there's a big reason why\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Google will restrict sideloading with developer verification.\n- The move mirrors Apple's long-standing security approach.\n- Android loses one of its last big differences from iOS.\nFor years, one of the biggest talking points in the Android vs. iOS debate has been freedom of choice -- and nothing summed that up more than sideloading.\n\"But iOS is a walled garden. Apple controls what you can and can't install on your hardware.\" If I had a dime for every time an Android user said this argument to settle which mobile platform is the best, I'd be lying in a pool of dimes as I type.\nAlso: How to clear your Android phone cache (and greatly improve its performance)\nOne of the last major differences between Android and iOS is not dead, but it's definitely coming to an end, with Google deciding that Apple's way was the best all along.\nI'm talking about sideloading -- the ability to install apps from unverified developers, bypassing Google's Play Store. The argument made by Google is pretty much the same one Apple has used for years: Security.\nAlso: I test dozens of Android phones every year: How Google, Samsung, OnePlus, and more stack up\n\"Following recent attacks, including those targeting people's financial data on their phones, we've worked to increase developer accountability to prevent abuse,\" writes Suzanne Frey, VP of Product, Trust and Growth for Android.\n\"We've seen how malicious actors hide behind anonymity to harm users by impersonating developers and using their brand image to create convincing fake apps. The scale of this threat is significant: Our recent analysis found over 50 times more malware from internet-sideloaded sources than on apps available through Google Play.\"\nDeveloper verification\nGoogle's answer to this growing malware issue? According to Frey, it's developer verification.\n\"Think of it like an ID check at the airport, which confirms a traveler's identity but is separate from the security screening of their bags; we will be confirming who the developer is, not reviewing the content of their app or where it came from.\"\nAlso: Changing these 12 settings on my Android phone extended its battery life by hours\nThis change will apply to apps installed on all Android certified devices starting next year, and it sounds like a staggered rollout, as Google says the \"change will start in a few select countries specifically impacted by these forms of fraudulent app scams.\"\nGoogle is also developing a new Android Developer Console specifically for Android developers who don't distribute their apps via Google Play, and there will be a separate console for student and hobbyist developers.\nAlso: Android phone feeling slow? How I changed one setting to instantly double the speed\nTaking this from the corporate-speak of the blog post into the real world, what this means is that you can still sideload apps, but only those that are digitally signed by the developer. No signature, no sideloading. Also, if that developer is caught doing bad stuff, their certificate is pulled, and all their apps will stop working.\nIt also means that apps Google doesn't like -- Revanced, a sideloaded app that, among other things, enables YouTube Premium features without paying springs irresistibly to mind -- are dead.\nUnmoved by this change\nAs someone who uses both iOS and Android, I'm a bit \"meh\" about this change. I don't sideload except when I'm looking for badware, and I'm sure if you picked a hundred Android users at random, you'd be hard-pressed to find one who had sideloaded a single app, and if Google's \"50 times more malware from internet-sideloaded sources\" is true, it would probably be malware.\nIt's a niche thing, like installing custom ROMs and jailbreaking iPhones.\nAlso: 6 Android launchers that are better than your default home screen - and why\nWhile I'm unmoved by this change, a lot of folks are getting rather emotional about it. This one post over on Reddit does make some valid points about the consequences of this change, but I'm honestly surprised unrestricted sideloading has carried on for as long as it has.\nI'm sure this will benefit those developing alternative platforms for Android smartphones -- such as LineageOS and GrapheneOS -- but don't hold your breath for the masses to be clamoring to make the switch.\nWhatever side of the fence you're on, it's the end of an era and a move that makes the gap between Android and iOS even smaller."
    },
    {
      "url": "https://www.zdnet.com/article/the-justice-department-wants-to-break-up-googles-ad-business/",
      "text": "The Justice Department wants to break up Google's ad business\nThe United States Justice Department, on Tuesday, filed an antitrust lawsuit against Google that ultimately seeks to break up the internet giant's lucrative digital ad tech business.\nOver the past 15 years, Google has engaged in \"anticompetitive, exclusionary and unlawful\" practices that have allowed it to \"severely weaken if not destroy competition in the ad tech industry,\" US Attorney General Merrick Garland said in a press conference Tuesday.\nFiled along with a handful of states in US District Court for the Eastern District of Virginia, the suit alleges that Google has violated the Sherman Antitrust Act by manipulating three major elements of the ad tech market.\nFirst, the suit says Google controls the technology used by nearly every major website publisher to offer advertising space for sale. Second, it says Google controls the leading tool used by advertisers to buy that ad space. Third, it alleges the company unfairly controls the largest ad exchange that matches advertisers and publishers together.\nAs a result, Garland said, \"website creators earn less and advertisers pay more. That means fewer publishers are able to offer internet users content with without subscriptions, paywalls or other forms of monetization.\"\nThe suit, which is nearly 150 pages long, extensively quotes Google executives and employees to make the case that Google acted unfairly and unlawfully. For instance, it notes that in late 2016, a Google digital ad executive asked, \"Is there a deeper issue with us owning the platform, the exchange and the huge network [for advertising]? The analogy would be if Goldman or Citibank owned the New York Stock Exchange.\"\nAssistant Attorney General Jonathan Kanter responded on Tuesday, \"Yes, indeed there is a deeper issue, and that issue is the Sherman Antitrust Act.\"\nAlso: Executives to tech teams: Reinvent us, and make it quick\nInnovation\nIn a response to the DOJ's allegations, a Google spokesperson said in a statement that the lawsuit \"attempts to pick winners and losers in the highly competitive advertising technology sector.\"\nThe company noted that the DOJ's arguments are similar to those put forward by the Texas attorney general in a lawsuit that was partially dismissed. Those arguments, the spokesperson said, \"would slow innovation, raise advertising fees, and make it harder for thousands of small businesses and publishers to grow.\"\nThe DOJ is seeking damages for Google's allegedly anticompetitive practices, as well as the divestiture of certain ad tech products. Additionally, the department is seeking an injunction preventing Google from continuing to engage in the anti-competitive practices described in the complaint."
    },
    {
      "url": "https://www.zdnet.com/article/best-ai-search-engine/",
      "text": "The best AI search engines of 2025: Google, Perplexity, and more\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nWhen ChatGPT launched in late 2022, the AI chatbot soared in popularity because people were amazed at its ability to respond to any question with conversational and concise answers. However, ChatGPT lacked one major feature -- access to current information. AI-powered search engines emerged to fill that gap.\nAlso: The best AI chatbots of 2025: ChatGPT and alternatives\nWithin months of ChatGPT launching, major search engines, including Google and Bing, infused generative AI (gen AI) into their platforms to offer conversational answers based on up-to-date information found across the internet. Other companies, such as Perplexity AI, also entered the space, building AI search engines from scratch to compete with the search engine giants.\nWith the rise in competition, ChatGPT has even unveiled a web-browsing feature of its own that allows ChatGPT to function as a search engine. AI search engines offer users the same basic service but with significant differences in execution. Some options are more helpful than others, including differences in user interfaces, search results, and suggestions.\nTo help you decide which AI search engine is worth using, ZDNET has tested the best tools we could find and provided notes on key specs and hands-on experiences. Let's dive in.\nThe best AI search engine of 2025\nTo compare how each search engine functions, I entered the same search query, \"What is a Yorkie?\" into each engine and included screenshots of how they responded below. I encourage you to look at each image closely because the results vary, and what works best for you may be highly personal.\nUnlike the rest of the picks on this list that have integrated AI into existing search engines, Perplexity AI has been built to be an AI search engine -- and this approach shows in its interface, which perfectly blends the best features of AI chatbots and search engines. Ultimately, this capability sets Perplexity apart from all the competitors on the market and makes it the most compelling and comprehensive AI search engine.\nWhen you first visit the application, you will see a textbox that resembles what you see when you visit any AI chatbot. However, when you click on the textbox, you will be given many prompt suggestions based on current events, much like when you are going to enter a search query in a search engine. These suggestions are helpful for prompt ideation and set Perplexity apart from other AI chatbots.\nAlso: Perplexity AI's new tool makes researching the stock market 'delightful'. Here's how\nOnce you enter your search query, the results page provides several links at the top, which is helpful if you use Perplexity as a search engine to find the most appropriate website. The results include conversational, concise, bulleted AI-generated answers with footnotes and website links.\nLastly, underneath the AI insights, users can take advantage of a \"related\" section, which resembles the experience on a search engine tool, such as Google's \"people also ask\" feature. This \"related\" section encourages discovery. Perplexity is free to use, and you don't need an account, making it easy to jump in and try the tool.\nPerplexity features: Free | Proprietary LLM | Premium subscription available with access to advanced models such as GPT-4 Turbo, Claude 3, and more\nChatGPT Search\nIf you like the look, feel, and experience of using an AI chatbot, then ChatGPT is the best AI search engine for you. The search feature keeps all of the standout ChatGPT features, including speed, accuracy, and UI, which earned it a place as ZDNET's best AI chatbot and adds real-time information from the web.\nAlso: OpenAI just upgraded ChatGPT with a search engine to rival Google\nThe tool can be called on manually or activated whenever a user prompt could benefit from web-based information. With ChatGPT Search, you can enter your sentence as your train of thought takes you, and the tool will understand the meaning of your query by leveraging its NLP capabilities. This capability means you can spend less time crafting a tailored search query and get exactly what you want.\nHowever, you need a ChatGPT Plus subscription, which costs $20 monthly. If you are a ChatGPT superuser, the cost may be worth it, as you get other perks such as Voice Mode, image generation, and Canvas. OpenAI plans to make this feature available to free users in the coming months.\n$20 per month | GPT-4o\nMicrosoft infused its Bing search engine with its AI chatbot, Copilot, and the tech company has seen its Bing daily active users increase significantly, with\nAlso: ChatGPT vs. Microsoft Copilot vs. Gemini: Which is the best AI chatbot?\nMicrosoft collaborated with OpenAI when developing Copilot, and, as a result, the chatbot uses GPT-4, OpenAI's very capable LLM. With the integration of Copilot in Bing, users experience high-quality responses when they search for anything through the box at the top of the search page results. The best part of Microsoft's execution, which places it over Google's, is that the AI insights aren't overwhelming and limited to one box off to the side, as seen in the picture below.\nThis approach means you can easily expand the results to see more AI-enabled insights. However, if you want to ignore the output and scroll through the normal search results, the AI insights are confined to a small portion of your desktop screen that you can ignore. If you aren't entirely sure if you want to commit to an AI search engine, Bing is a great option.\nMicrosoft Bing features: Free | GPT-4\nIf you are a loyal Google user and curious about how AI can improve the search experience, then Google might be your best option. Last year, Google introduced its Search Generative Experience (SGE), which was only accessible via Search Labs and gave users AI-generated insights at the top of their search results. However, at Google I/O, the company announced it was bringing those AI overviews to all users in the U.S.\nAlso: Google's new AI tool transforms dense research papers into accessible conversations - try it free\nThis means that when you type a search query into Google that could be optimized by AI overviews (which isn't every entry), Google will automatically show you the AI insights. Since the AI insights are not as compact as Bing's and take up the top of the screen, pushing organic search results down may not be an approach that works for everyone.\nGoogle features: Free | New Gemini model customized for Google Search\nThe look and feel of You.com are similar to any other AI chatbot, with the major difference being the tool is connected to the internet to act as a search engine.\nYou can enter any question or topic you'd like to learn more about and receive real-time web results, plus a conversational response. However, the output displayed does not resemble a regular search engine, so if you like to see results as a list of websites, like traditional search results, this tool may not be the best option.\nAlso: YouPro lets me access every popular premium AI chatbot for $20/month - but there's a catch\nInstead, You.com displays a conversational response with added footnotes that users can click on to verify the source and visit the website. The tool will also add images when relevant that elevate the answers over those from a traditional AI chatbot like ChatGPT, as seen in the image at the top of the article. You.com also includes a \"People also ask\" section underneath its response and a \"private mode\", similar to Google's incognito mode.\nOne of the biggest standout features is that you can toggle between the most popular AI models on the market using the Custom Model Selector, including GPT-4 Turbo, Anthropic's Claude, and more.\nYou.com features: Free | Option for subscription | You.com proprietary LLM in the free version\nBrave Search's appeal as a search engine comes from the increased privacy and security it offers users while browsing online. Some of Brave's standout features include blocking trackers and ads on websites, which also helps improve device battery life and browsing speeds. Recently, Brave added an \"Answer with AI\" feature that infuses generative AI into the search engine, offering an experience nearly identical to those in the tools above while keeping the security features users enjoy.\nAlso: Brave search engine adds privacy-focused AI - no Google or Bing needed\nYou can download the Brave browser to your computer for the full experience. However, you can also use Brave Search in any browser by visiting its\nEven though Brave Search doesn't include footnotes in its answers, the tool does include \"context\" underneath the answer with links to relevant content, which can be useful for verifying the source. Another feature that sets Brave Search apart is that the company says the answers generated are based on Brave's independent search index, unlike many competitors that rely on Google's or Bing's search engines.\nBrave Search features: Free | Brave's independent search index\nWhat is the best AI search engine?\nWhich is the right best AI search engine for you?\nI picked Perplexity AI as the best AI search engine overall because it has features most users can benefit from. However, you can choose from many AI search engines that might be better suited to your specific needs.\nFor example, if you are a loyal Google user, Google's Search Generative Experience might be your best option. You can see the full breakdown below.\nChoose this AI search engine... | If you need... |\nPerplexity AI | An AI search engine that combines the best of AI chatbots and search engines. |\nChatGPT Search | An AI search engine that infuses the web into ChatGPT. |\nMicrosoft Bing | An AI search engine that integrates AI without it being too overwhelming. |\nGoogle Search Generative Experience (SGE) | An AI search engine that builds on the Google interface. |\nYou.com | An AI search engine that is also home to the leading LLMs. |\nBrave Search | An AI search engine that prioritizes AI security and privacy. |\nHow did I choose the best AI search engines?\nI tested every AI search engine that made the list across factors critical to users. Some of the factors I considered included:\n- Price\n- Quality of the AI-enabled insights\n- User interface\n- LLM\nWhat is an AI search engine?\nAn AI search engine has built-in generative AI that gives users AI insights in its search results. For example, all of the examples of AI search engines above include an AI-generated, summarized response to the user's search query.\nWhat is the difference between an AI search engine and an AI chatbot?\nAn AI chatbot is an application that uses generative AI to process a user's input and provide a conversational response. An AI search engine produces similar output but is also connected to the internet.\nDo AI search engines cost money?\nAll of the AI search engines above are free to use. However, there are premium subscription upgrades of some of the AI search engines listed above if you want to take advantage of more advanced LLMs."
    },
    {
      "url": "https://www.cnbc.com/2025/09/02/google-antitrust-search-ruling.html",
      "text": "Alphabet shares popped 8% in extended trading as investors celebrated what they viewed as minimal consequences from a historic defeat last year in the landmark antitrust case.\nLast year, Google was found to hold an illegal monopoly in its core market of internet search.\nU.S. District Judge Amit Mehta ruled against the most severe consequences that were proposed by the Department of Justice, including the forced sale of Google's Chrome browser, which provides data that helps its advertising business deliver targeted ads.\n\"Google will not be required to divest Chrome; nor will the court include a contingent divestiture of the Android operating system in the final judgment,\" the decision stated. \"Plaintiffs overreached in seeking forced divestiture of these key assets, which Google did not use to effect any illegal restraints.\"\nMehta, who oversaw the remedies trial in May, ordered the parties to meet by Sept. 10 for the final judgment.\nIn August 2024, the U.S. District Court for the District of Columbia ruled that Google violated Section 2 of the Sherman Act and held a monopoly in search and related advertising.\nThe antitrust trial started in September 2023.\n\"Now the Court has imposed limits on how we distribute Google services, and will require us to share Search data with rivals,\" Google said in a blog post. \"We have concerns about how these requirements will impact our users and their privacy, and we're reviewing the decision closely. The Court did recognize that divesting Chrome and Android would have gone beyond the case's focus on search distribution, and would have harmed consumers and our partners.\"\nOne of the key areas of focus was the exclusive contracts Google held for distribution.\nIn his decision Tuesday, Mehta said the company can make payments to preload products, but it cannot have exclusive contracts that condition payments or licensing.\nThe DOJ had asked Google to stop the practice of \"compelled syndication,\" which refers to the practice of making certain deals with companies to ensure its search engine remains the default choice in browsers and smartphones.\n\"The court's ruling today recognizes the need for remedies that will pry open the market for general search services, which has been frozen in place for over a decade,\" the DOJ said in a press release. \"The ruling also recognizes the need to prevent Google from using the same anticompetitive tactics for its GenAI products as it used to monopolize the search market, and the remedies will reach GenAI technologies and companies.\"\nGoogle pays Apple billions of dollars per year to be the default search engine on iPhones. It's lucrative for Apple and a valuable way for Google to get more search volume and users.\nApple stock rose 4% on Tuesday after hours.\n\"Google will not be barred from making payments or offering other consideration to distribution partners for preloading or placement of Google Search, Chrome, or its GenAI products. Cutting off payments from Google almost certainly will impose substantial—in some cases, crippling—downstream harms to distribution partners, related markets, and consumers, which counsels against a broad payment ban.\"\nGoogle was also ordered to loosen its hold on search data.\nDuring the remedies trial in May, the DOJ asked the judge to force Google to share the data it uses for generating search results, such as data about what users click on.\nMehta ruled Tuesday that Google will have to make available certain search index data and user interaction data, though \"not ads data.\"\nGoogle does not have to share or provide access to granular data with advertisers.\nThe court narrowed the datasets Google will be required to share and said they must occur on \"ordinary commercial terms that are consistent with Google's current syndication services.\""
    },
    {
      "url": "https://www.zdnet.com/article/45-time-saving-windows-keyboard-shortcuts-that-supercharged-my-daily-routine/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n45+ time-saving Windows keyboard shortcuts that supercharged my daily routine\nFollow ZDNET: Add us as a preferred source on Google.\nZDNET's key takeaways\n- Windows has a long list of keyboard shortcuts that perform helpful actions in Windows 11.\n- For example, hitting the CTRL and C keys together allows users to copy text or files.\n- Mastering these shortcuts can help boost your overall productivity, but most people only know a few.\nKeyboard shortcuts have been a staple feature in Windows for decades, but most users only know the basics. At first glance, they don't seem all that useful since you can also do these actions with your mouse, but I challenge you to try them over the course of a workday; you just might notice a boost in productivity.\nAlso: How much RAM does your PC really need in 2025? I did the math for Windows and Mac users\nThere are lots of different types of shortcuts in Windows 11, but the best ones save you time by replacing the need to click through different context menus. A few of these are universal across applications and platforms. Ctrl + C, for example, copies text or files in any app, from Microsoft Word to photos in Google Drive.\nHere's a list of more than 40 Windows PC keyboard shortcuts you should know.\nProductivity shortcuts\nProductivity shortcuts are the key combos you'll find yourself using the most. They're easy to use and help you manage your work. Over time, these keystrokes become second nature.\n- Ctrl + C -- Copy highlighted text or a file.\n- Ctrl + V -- Paste whatever you just copied. Keeps the text's format.\n- Ctrl + Shift + V - Paste whatever you copied, but it removes the formatting.\n- Windows key (Win, for short) + V -- Opens the Clipboard tool, which contains a list of previously copied text. This helps in situations where you might've \"erased\" the previous copied item.\n- Ctrl + X -- Cuts the highlighted item. Ctrl + V restores it.\n- Ctrl + Z -- Undoes the last action, such as restoring deleted text or returning a moved file.\n- Ctrl + Y -- Redoes the action that was just undone.\n- Ctrl + F -- Opens the Find tool, so you can search for specific words or phrases.\n- Ctrl + A -- Highlight every single item in a window or text in a document.\n- Ctrl + S -- Quick save your work.\n- Ctrl + Backspace -- Delete the entire previous word\n- Ctrl + Delete -- Delete the entire next word.\nAccessibility shortcuts\nWindows 11 has various accessibility shortcuts that make the OS easier to use. These shortcuts help people with movement limitations or conditions that may restrict their usage of Windows. That said, anybody can use them to improve their experience.\n- Win + Plus (+) -- Activates the Magnifier tool and automatically zooms in on the screen.\n- Win + Minus (-) -- Zooms out while the Magnifier tool is activated. Hitting Win + Esc exits out of Magnifier.\n- Win + Ctrl + Enter -- Launches Narrator, a text-to-speech function that verbally describes what is on screen.\n- Press the Shift key five times in succession -- Turns on Sticky keys, which change how shortcuts work so you don't have to press and hold multiple keys to trigger them. For example, under Sticky Keys, double-tapping Ctrl then C has the same effect as Ctrl + C.\n- Left Shift + Left Alt + Print Screen -- Toggles high contrast mode for easier readability.\n- Win + Ctrl + C -- Toggles color filters like grayscale. The filters can be changed in the Accessibility menu to invert colors or help people with deuteranopia (also known as red-green color blindness).\n- Win + U -- Opens the Accessibility menu in Settings, where you can activate or deactivate accessibility-related features.\n- Win + Ctrl + O -- Opens the on-screen keyboard.\nNavigation shortcuts\nNavigation shortcuts allow users to move around different apps on Windows 11 without ever needing to lift their hands off the keyboard. They're especially useful for multitaskers juggling several programs at once. Once you master them, navigating your PC will feel seamless.\n- Ctrl + Alt + Tab -- Shows all open apps. Use the arrow keys to hop from one to the other.\n- Win + S -- Opens Windows Search.\n- Win + Tab -- Opens Task View, revealing all open windows and all open desktops.\n- Win + D -- Hides every window on your desktop. Pressing the keys again reveals them.\n- Win + Left or Right Directional Arrow -- Snaps the current window to the side of the screen that the arrow is pointing to.\n- Win + Up Arrow -- Maximizes a window.\n- Win + Down Arrow -- Minimizes the same window.\n- Win + Ctrl + D -- Create a new desktop.\n- Win + Ctrl + F4 -- Closes a desktop.\n- Win + Number Key -- Opens a taskbar app pinned to that number. For example, Win + 3 could open Microsoft Edge while Win + 4 opens the Microsoft Store.\nAlso: Finally, a Windows laptop that I wouldn't mind putting away my MacBook for\nFile Management shortcuts\nThe Windows 11 File Explorer has its own set of keyboard shortcuts to help users reorganize folders and files. Instead of right-clicking through menus or dragging items around to clean up clutter, these simple key presses make managing documents a breeze.\n- Win + E -- Opens File Explorer.\n- F2 -- Rename the selected file or folder. Depending on the keyboard, you may also have to hold Fn.\n- Shift + Delete -- Permanently deletes an item. Hitting just Delete only sends the file to the recycling bin.\n- Ctrl + N -- Opens a new File Explorer window. It stays on the page of the previous window.\n- Ctrl + Shift + N -- Create a new folder.\n- Alt + Enter -- Opens the Properties window for a file and folder.\n- Alt + Left or Right Arrow -- Move forward or backward through your File Explorer History.\n- Alt + Up Arrow -- Go back one folder level.\nAlso: Best early Labor Day laptop deals: Sales on Apple, Dell, Lenovo, and more\nBrowser shortcuts\nBrowser shortcuts are similar to Productivity shortcuts in that they do similar things, like copying and pasting items or highlighting entire documents. However, there are a few unique tools, like the ability to create tabs. The following were tested and confirmed to work across various browsers: Chrome, Edge, and Firefox.\n- Ctrl + T -- Open a new tab.\n- Ctrl + Shift + T -- Reopen the last closed tab. (This one is huge!)\n- Ctrl + W -- Close the current tab.\n- Ctrl + Tab -- Move right through tabs.\n- Ctrl + Shift + Tab -- Move left through the tabs.\n- Ctrl + Shift + N -- Open new private browsing window. On Firefox, this is Ctrl + Shift + P.\n- Alt + Left or Right Arrow -- Move back and forth through tab history.\n- Ctrl + D -- Bookmark page.\n- Ctrl + H -- Open browser history.\n- Ctrl + N -- Open a brand new browser window.\nWhy should you trust me?\nI've been writing about software and consumer electronics for almost 10 years. In that time, I've worked in many different settings, from the traditional office to the home office and even someone's backyard. Over the years, I've picked up a lot of tricks to help me get through my day-to-day tasks.\nAlso: I tested the best antivirus software for Windows: Here's what I'd use to protect my PC\nMany of the shortcuts in this guide I use every day, even when I'm not working. CTRL + Z has practically become my best friend because I use it so often. Some of these shortcuts I learned about for the first time while researching this piece. I didn't know that the File Manager has so many shortcuts under its toolbelt, but once I started using them, I immediately saw their value to expert and casual users alike."
    },
    {
      "url": "https://www.zdnet.com/article/google-pixel-10-pro-vs-iphone-16-pro-ive-tried-both-flagships-and-theres-an-easy-winner/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nGoogle Pixel 10 Pro vs. iPhone 16 Pro: I've tried both flagships, and there's an easy winner\nAfter the success of launching four flagship phones last year, Google is set to continue the trend with the new Pixel 10 series.\nThe Google Pixel 10 Pro stands out as potentially the best option for many people. With a starting price of $999, it offers a compelling blend of premium features borrowed from its more expensive sibling, all in the more manageable size of the standard Pixel 10.\nAlso: I replaced my Samsung Galaxy S25 Ultra with the Pixel 10 Pro XL for a week - and can't go back\nThe Pixel 10 Pro enters a crowded field, competing directly with the iPhone 16 Pro and the Galaxy S25 Plus.\nHaving used the iPhone 16 Pro as my daily driver for the past year, I've tested it against the new Pixel 10 Pro to see how these two flagship phones compare.\nYou should buy the Google Pixel 10 Pro if…\n1. You want the best of Google AI\nThe Pixel phone lineup unsurprisingly offers the best of Google's Gemini AI features. And it is only getting better with the Pixel 10 Pro. The company is providing a year of Google AI Pro service for free alongside the purchase for Pixel 10 Pro and Pixel 10 Pro XL. So, you get Gemini Pro, including NotebookLM for productivity and Veo 3 text-to-video generation model.\nThe Google Pixel 10 Pro is also getting a contextual and personalized AI feature called Magic Cue. Theoretically, it can \"help connect the dots across your digital life by anticipating your needs and proactively suggesting relevant information and helpful actions based on the context on your phone.\"\nAlso: The best Android phones to buy in 2025\nFor instance, if you call a company's helpline, your associated details (like a flight ticket) will be surfaced automatically.\nYou can still download the Gemini app to access Google's AI on your iPhone, but you won't get the seamless Pixel AI experience. If you depend on Google apps to get work done and have all your digital life stored on Google's platforms, the Pixel 10 Pro is the better option.\n2. You want a better telephoto camera\nThe Google Pixel 10 Pro features a 48MP Quad PD telephoto camera with 5x optical zoom, as compared to a 12MP telephoto sensor (also 5x optical zoom) on the iPhone 16 Pro. However, megapixels don't solely define a camera. The Pixel 10 Pro sports a bigger sensor than its Apple counterpart. On paper, it is capable of letting more light in and snapping better-looking photos.\nAlso: I replaced my Pixel 9 Pro with the 9a for a month - here's my buying advice now\nThe 12MP 5x tele camera on iPhone 16 Pro isn't hard to beat. It struggles in anything less than bright daylight and lacks the zoom capabilities of its Chinese rivals. I'm looking forward to using the Google Pixel 10 Pro for my zoom shots and expect it to beat the iPhone.\n3. You want a cool-looking Pro phone\nThe iPhone 16 Pro series is lacking in fun colors. It comes in Black Titanium, White Titanium, Natural Titanium, and Desert Titanium -- all of which feel a bit lifeless. The last Pro iPhone color I truly loved was Sierra Blue on my iPhone 13 Pro Max.\nWhile rumors suggest the iPhone 17 Pro might bring back more playful finishes, Google has already beaten Apple to the punch with the Pixel 10 Pro series. The new Pixel 10 and Pixel 10 Pro are available in classic Obsidian and Porcelain, as well as bolder Moonstone and Jade options.\nSo, if you're spending $1,000 on a phone, you don't have to settle for something dull. Plus, you get Google's distinct design, complete with the iconic camera bar—which, in my opinion, still looks incredibly cool.\n4. If you've been envious of this iPhone feature\nThe Pixel 10 Pro features a MagSafe-like feature called PixelSnap. It is based on Qi2 charging, which offers magnetic accessory support for power banks, chargers, and more. If you've been on the iPhone for a while and want to switch platforms, this is the best time to come to the Android side.\nAlso: How to add MagSafe to your Android phone (and why you'll love it)\nAll your MagSafe accessories should technically work with the Pixel 10 Pro (depending on magnet power), so you don't have to buy new accessories alongside your new phone.\nYou should buy the Apple iPhone 16 Pro if…\n1. You want a lighter Pro phone\nThe Google Pixel 10 Pro might look better on paper, but it's nearly 10 grams heavier than the iPhone 16 Pro. Specifically, the Pixel weighs 207 grams compared to the iPhone's 199 grams.\nAlso: Buy the iPhone 16 or wait for iPhone 17? Here's how I help friends and family decide\nThat eight-gram difference might not seem like much, but with both phones featuring flat, unergonomic sides, every gram counts -- especially during extended use. If you average more than six hours of screen time a day, the iPhone 16 Pro could be the more comfortable choice.\n2. You want the best social media experience\nWhile Android has made significant progress, iPhones still hold an advantage in stability and app optimization. This is particularly noticeable with social media apps like X and Instagram, where the user experience remains smoother on Apple devices.\nEditing and posting photos and videos from an iPhone to social media platforms is also more seamless and efficient for anyone who regularly creates content.\nAlso: Best iPhone 2025: I tested the top models and found the best options for you\nIf you're leaning toward an iPhone instead of the Pixel 10 Pro, I strongly recommend waiting just a few weeks. Apple is expected to launch its new iPhone 17 series in early September. It's smart to hold off on your decision until after the typical September 10th launch event to make sure you get the latest model."
    }
  ],
  "argos_summary": "A U.S. judge ruled that Google violated the Sherman Antitrust Act by maintaining an illegal monopoly in search and search advertising, but the court did not order the divestiture of Chrome or Android. The ruling bars Google from enforcing exclusive default‑search contracts with device and browser makers, requires it to share certain search‑index and user‑interaction data with rivals, and sets up a six‑year oversight committee. Google is expected to appeal, and the decision is seen as a significant win for antitrust enforcement but with limited immediate market disruption.",
  "argos_id": "ATMD2V7K1"
}