{
  "url": "https://finance.yahoo.com/news/ufc-wwe-parent-tko-doubles-125132765.html",
  "authorsByline": "Brendan Coffey",
  "articleId": "80cb7f84335d423da50853f0fc98c126",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/sportico_165/8d6c942f958a707e0b9b5240997a5bc6",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:51:32+00:00",
  "addDate": "2025-09-03T13:21:49.035481+00:00",
  "refreshDate": "2025-09-03T13:21:49.035484+00:00",
  "score": 1.0,
  "title": "UFC, WWE Parent TKO Doubles Dividend on Heels of Rights Deals",
  "description": "TKO Group Holdings is doubling its dividend, the company announced Wednesday, as strong cash flow and future revenue provided by recent UFC and WWE U.S. media rights deals spurred the company to boost the cash provided to shareholders. The increase means the next quarterly payment to owners of the company’s Class A shares will be …",
  "content": "TKO Group Holdings is doubling its dividend, the company announced Wednesday, as strong cash flow and future revenue provided by recent UFC and WWE U.S. media rights deals spurred the company to boost the cash provided to shareholders.\n\nThe increase means the next quarterly payment to owners of the company’s Class A shares will be $0.76 a share. That equals about $150 million in capital to be returned to shareholders, according to a TKO press release.\n• Sports Stocks Hit 32-Month Peak With Focus on Rates, Not Tariffs\n\nTKO recently inked a deal with Paramount Skydance that will pay the company about $1.1 billion a year for the next seven years to broadcast UFC events, while WWE agreed to a five-year deal with ESPN worth $1.6 billion. The two deals significantly help the parent company’s outlook.\n\nAt Tuesday’s closing share price of $185.35, the projected $3.04 dividend for the next four quarters gives TKO a dividend yield of 1.64%. The dividend yield of the S&P 500, by comparison, is 1.2%, the lowest mark since the dotcom bubble. Generally, paying a dividend appeals to long-term investors, such as mutual funds. The payments encourage funds to hold shares and be opportunistic buyers on price declines, providing stability to a company’s share price over the long term. Fund giant Vanguard Group is one of TKO’s largest shareholders with about 8% of the company’s equity held across its funds, according to TKO’s latest proxy statement.\n\nTKO also said it is seeking to increase the size of its existing credit facility by up to $1 billion.\n• Most Expensive Sports Memorabilia and Collectibles in History\n• The 100 Most Valuable Sports Teams in the World\n• NFL Private Equity Ownership Rules: PE Can Now Own Stakes in Teams\n\nSign up for Sportico's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://www.sportico.com/business/media/2025/paramount-skydance-stock-trade-up-ufc-1234867002/",
    "https://cloud.email.sportico.com/signup/",
    "https://www.sportico.com/feature/most-expensive-sports-memorabilia-1234762143/?utm_source=yahoo&utm_medium=feeds&utm_campaign=best_of_brands",
    "https://sports.yahoo.com/article/ufc-deal-puts-paramount-fast-164655248.html",
    "https://www.sportico.com/leagues/other-sports/2025/ufc-fighters-pay-paramount-deal-ppv-1234866705/",
    "http://bit.ly/2TntOHq",
    "http://bit.ly/31XsHSx",
    "https://www.sportico.com/feature/most-valuable-sports-teams-1234832079/?utm_source=yahoo&utm_medium=feeds&utm_campaign=best_of_brands",
    "http://bit.ly/2TkcoeG",
    "https://finance.yahoo.com/news/sports-stocks-hit-32-month-120000400.html",
    "https://finance.yahoo.com/news/nfl-private-equity-ownership-rules-190928188.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "TKO Group Holdings",
      "weight": 0.097939774
    },
    {
      "name": "TKO",
      "weight": 0.09637516
    },
    {
      "name": "Rights Deals",
      "weight": 0.081524625
    },
    {
      "name": "Dividend",
      "weight": 0.07846434
    },
    {
      "name": "Fund giant Vanguard Group",
      "weight": 0.07448537
    },
    {
      "name": "shares",
      "weight": 0.07174312
    },
    {
      "name": "UFC, WWE Parent TKO",
      "weight": 0.069119446
    },
    {
      "name": "Sports Stocks",
      "weight": 0.06884528
    },
    {
      "name": "price declines",
      "weight": 0.067814484
    },
    {
      "name": "mutual funds",
      "weight": 0.06727563
    }
  ],
  "topics": [
    {
      "name": "UFC"
    },
    {
      "name": "Wrestling"
    },
    {
      "name": "WWE"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.853515625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.8173828125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.7001953125
    },
    {
      "name": "/News/Sports News",
      "score": 0.61083984375
    }
  ],
  "sentiment": {
    "positive": 0.7427629,
    "negative": 0.027588753,
    "neutral": 0.22964826
  },
  "summary": "TKO Group Holdings is doubling its dividend due to strong cash flow and future revenue from recent UFC and WWE U.S. media rights deals. The next quarterly payment for owners of the company's Class A shares will be $0.76 per share, which could generate about $150 million in capital returned to shareholders. The company recently signed a deal with Paramount Skydance for $1.1 billion a year for broadcast UFC events, while WWE agreed to a five-year deal with ESPN. The projected $3.04 dividend for the next four quarters gives TKO a dividend yield of 1.64%, compared to the S&P 500's 1.2%, the lowest since the dotcom bubble.",
  "shortSummary": "TKO Group Holdings doubled its dividend to $0.76 per share due to strong cash flow and media rights deals, aiming to increase shareholder returns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5073fe9c1d444d4db204d1a0f65bd16b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://sports.yahoo.com/article/ufc-deal-puts-paramount-fast-164655248.html",
      "text": "UFC Deal Puts Paramount+ on Fast Track for Big Subscriber Gains\nJust days after Skydance closed its $8.4 billion merger with Paramount, the newly reconfigured media giant has closed out a rights deal that should position its streaming service for a massive spike in paid subscribers.\nDavid Ellison’s Paramount has inked an exclusive seven-year, $7.7 billion deal with TKO’s UFC, one that will see all 13 marquee numbered events and each of the 30 weekend “Fight Night” cards stream on Paramount+. Under the terms of the agreement, select outings will be simulcast on the broadcast TV flagship CBS.\nIn addition to aligning Paramount with one of sports’ youngest-skewing fan bases, the deal should go a long way toward beefing up the company’s streaming engine. Paramount+ closed out the second quarter of 2025 with 77.7 million subscribers, which represented a sequential loss of 1.3 million customers. During its earnings call last week, Paramount attributed the quarter-to-quarter decline to the expiration of a hard-bundle deal in an unspecified international market.\nParamount+ is chugging along in the middle of the streaming pack, but the service should start gaining on the field once the UFC inventory kicks in next year. While the platform is a good stretch of road ahead of NBCUniversal’s Peacock, which closed out the quarter at 41 million subs, and is well out of reach of ESPN+ (24.1 million as of June 28), Paramount+ trails the top tier by a significant margin. Disney+ closed out the quarter with 127.8 million global subs, of which 57.8 million were situated in the U.S. and Canada, while Warner Bros. Discovery last week indicated that HBO Max would “reach over 150 million subscribers by the end of 2026.”\nBy way of comparison with the rank and file, Amazon’s Prime Video boasts north of 200 million customers around the world—which puts it a good 100 million subs shy of leader Netflix. While Netflix is no longer reporting its quarterly subscription figures, it closed out its final official reckoning in Q4 2024 with a category-topping 301.6 million sign-ups.\nPer Nielsen, Paramount+ accounted for 2% of all U.S. video consumption in June, edging Peacock at 1.5% and the WBD streamers (1.4%). Prime Video finished the month with a 3.6% share of video, while Disney+ claimed a 4.8% share and Netflix took 8.3%. Beating all comers in the streaming space was YouTube, with a 12.8% share of video. By way of comparison, broadcast TV as a whole accounted for 18.5% of video consumption during the month. June marked the first time network TV consumption dropped below a 20% share.\nThus far, Paramount+ has made its biggest splash with original drama series like Yellowstone, Landman and 1923, all of which were created by Taylor Sheridan. A prequel to Yellowstone, 1923 ranked as the sixth most-streamed original show in the first half of 2025, with 8.54 million minutes viewed. Landman was No. 10 with 7.83 million minutes logged. All told, Paramount+ boasted its greatest success in the first six months of the year with the animated juggernaut SpongeBob SquarePants, which was streaming’s sixth-biggest draw with 16.7 million minutes viewed.\nThe NFL accounts for the lion’s share of the Paramount+ sports traffic, as the platform notched its biggest single-day viewership with its simulcast of Super Bowl LVIII on Feb. 11, 2024. The 49ers-Chiefs game held the bragging rights as the most-streamed NFL title tilt for exactly one year, before Fox and Tubi unseated it with Super Bowl LIX.\nWord that Paramount was circling a UFC deal began heating up in the weeks before the Skydance merger closed, talk that intensified with the unveiling of the company’s new management team. (Tongues first started wagging after Ellison was spotted ringside in Miami for the April UFC card, where he was a guest of TKO CEO Ari Emanuel.) Among the heavy hitters in the Paramount C-suite include RedBird Capital Partners’ Andy Gordon, who now serves as chief strategy officer and COO, and former NBCUniversal CEO Jeff Shell, who oversees day-to-day operations as president.\nRedBird has an estimated $2 billion stake in the new entity, which now trades under the ticker symbol PSKY. RedBird holds 22.5% of Paramount’s voting rights, while Ellison holds 50%. The remainder is controlled by Ellison’s father, Oracle cofounder Larry Ellison.\nUnder Gerry Cardinale, the RedBird portfolio is teeming with high-octane sports properties. In 2022, Cardinale’s firm acquired the Serie A club AC Milan in a $1.3 billion deal, a big move that closed the year after RedBird picked up an 11% stake in Fenway Sports Group, the holding company behind MLB’s Boston Red Sox and the club’s regional sports network, NESN, as well as Premier League giant Liverpool FC.\nThe new UFC deal will run from 2026 through 2032, and while the rights fee averages out to some $1.1 billion per year, the payments will be weighted more toward the back end of the span. All told, Paramount’s annual payout is twice as rich as the $550 million that ESPN currently pays for its UFC rights package.\nParamount said it aims to pursue UFC’s rights in territories outside the U.S. as they become available.\nIn pre-noon trading Monday, TKO shares rose 8.07% to $176.47. PSKY shares were down 0.90% at $10.42.\nMore from Sportico.com\nBest of Sportico.com\nSign up for Sportico's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram."
    },
    {
      "url": "https://www.sportico.com/business/media/2025/paramount-skydance-stock-trade-up-ufc-1234867002/",
      "text": "Shares of Paramount Skydance closed up 36.74% on Wednesday, as the company’s Class B stock finished the day at $15.00.\nPSKY shares exploded like a meme-stock two days after the newly merged media company announced a $7.7 billion deal that will give CBS and Paramount+ the exclusive U.S. rights to all UFC events beginning in 2026.\nWhile it’s likely that Wednesday’s boom was precipitated by a short squeeze, there isn’t a sufficient store of published data available under the new ticker with which to substantiate such a theory. That said, short interest as a percentage of the company’s public float lingered around the 13.4% mark, putting PSKY at a remove from media peers such as Warner Bros. Discovery (4.3%) and Disney (1.1%).\nParamount’s big lift also coincided with a heady day for the Dow, which closed up 463.33 points (1.04%). Trading volume for PSKY was uncharacteristically heavy Wednesday, as more than 131.1 million shares moved before the closing bell.\nThe frenzy cooled off somewhat after 1 p.m. ET, when PSKY reached a peak of $17.53—a 60% bump from Tuesday’s closing price of $10.97.\nThe big uptick in trading came less than a week after Skydance’s $8.4 billion takeover of Paramount was announced. The delayed spike was in sharp contrast to Monday’s trading, during which the stock reached a 52-week low.\nParamount Stock Rockets Nearly 40% in Heavy Post-UFC Deal Trading\nMore From Our Brands\nVariety\nAlexander Rodnyansky’s ‘Notes of a True Criminal’ Debuts Teaser Trailer as Film Premieres in Venice: ‘I Portray War as a Persistent Curse’ (EXCLUSIVE)\nRolling Stone\nThe Marías Imagine a New Reality in ‘Sienna’ Performance on ‘Kimmel’\nArtNews\nArt in America’s Fall “Icons” Issue Features Paul Pfeiffer, Rosemarie Trockel, Blindness & Photography, and More\nBGR\nCheaper Vision Air, Foldable iPhone, And Foldable iPad Coming In The Next Three Years, Insider Says\nBillboard"
    },
    {
      "url": "https://www.sportico.com/feature/most-expensive-sports-memorabilia-1234762143/?utm_source=yahoo&utm_medium=feeds&utm_campaign=best_of_brands",
      "text": "What is the most expensive sports memorabilia ever sold? Given the boom in sports collectibles in recent years, that answer keeps changing. Over the past decade, on average, a new piece of sports history has taken the title as the priciest every year.\nIn part, the price surge is because verification methods, such as photo-matching and materials knowledge, have grown so advanced that deep-pocketed investors have more confidence an item is legitimate. Indeed, the world’s most expensive piece of memorabilia—Babe Ruth’s “Called Shot” jersey, which sold for $24.12 million in August 2024—probably saw bidding intensified thanks to the assertions of two well-regarded experts who say photo matching and materials knowledge made them confident the jersey was the same the Babe wore 93 autumns ago.\nBut more fundamentally, the rise in memorabilia values is because sports has knack for creating many vivid, widely known moments of greatness. For many years, baseball dominated the world of sports collectibles—perhaps no surprise as the oldest of the world’s major professional sports. These days it’s no longer just baseball, though it probably accounts for roughly half the high-end sports memorabilia market. Basketball, soccer, boxing and even the Olympics make an appearance in the list of the most valuable collectibles ever sold.\n“What you see is a mixture of natural scarcity with the top, game-worn items, combined with iconic moments,” Brahm Wachter, Sotheby’s head of modern collectibles, said. The most valuable items combine something “representative of the athlete and his or her accomplishments with a thing that everybody remembers.”\nHere are the current top 10 most expensive sports collectibles:\n1932 Babe Ruth ‘Called Shot’ jersey – $24.1 million\nOne of the most iconic athletes sports has produced is also the king of the collectibles. The 1932 World Series between the American League champion Yankees and the National League pennant-winning Cubs was heated, as bad blood boiled between the teams and fans of the North Siders jeered Ruth relentlessly. As legend (and a recorded Lou Gehrig interview) asserts, the Babe stepped out of the batter’s box during a mid-game at-bat to respond to hecklers from the Cubs dugout. Pointing to the center field flagpole at Wrigley Field, he stepped back into the box and hammered the next pitch some 490 feet to dead center. It’s probably the most famous moment of Ruth’s career—it vaulted the Yankees to victory in the game and a sweep of the Cubs, and it was his last appearance in the Fall Classic. It sold for $940,000 in 2005 and then set its record $24.12 million sale price in the summer of 2024.\n2007 Upper Deck Michael Jordan-Kobe Bryant card – $12.9 Million\nThis one-of-one card, signed by both basketball legends, includes the NBA logo snipped from a jersey each star wore—and in Jordan’s case, the logo came from the Bulls’ 1996-97 championship campaign. The 2007-08 Upper Deck “Exquisite Dual Logoman” was held by a private collector for more than a decade before being put up for bid in the summer of 2025. It is the most expensive sports card ever sold, passing the 1952 Topps Mickey Mantle card and outpacing other one-of-one basketball cards from the Logoman series that have sold for multiple millions.\n1952 Topps Mickey Mantle card – $12.6 million\nThis mint condition card of the Hall of Famer sold at auction in August 2022 for more than double the prior record price.\n“Mantle is a bit of a perfect storm. He was a rookie in 1951, so a lot of Baby Boomers were able to see him play,” said Chris Ivy, director of sports collectibles at Heritage Auctions, which sold the card. “The Yankees were dominant his first 10 years in the league going to the World Series eight times, and he’s larger than life, like Babe Ruth.”\nThe card itself has transcended mere collectible into being a pop culture icon, adding to the appeal of owning a rare example of a near-perfect trading card.\n1998 Michael Jordan NBA Finals Chicago Bulls jersey – $10.1 million\nJordan’s jersey ranks near the very top of expensive sports collectibles for many of the same reasons as Mantle’s card. Jordan was the greatest player in the NBA at the time, and arguably of all time. The 1997-98 season run to the Bulls’ last NBA title was featured in the popular ESPN documentary The Last Dance in 2020, which highlighted Jordan’s fifth (and final) MVP season before he shockingly retired from basketball. Sotheby’s sold the jersey for $10.1 million in September 2022. Perhaps amazingly for a record-setting piece of game-worn clothing, Jordan wore this particular shirt in Game 1, a loss.\nDiego Maradona “Hand of God” jersey – $9.3 million\nMaradona wore the famed “Hand of God” jersey in the quarterfinals of the 1986 soccer World Cup, using his hand, unseen by the referee, to score in the first half. A remarkable follow-up came in the second half of the match, when he dribbled half the length of the field, eluding six defenders to score what many consider the greatest goal of the 20th century.\n“It is such a famous and iconic moment in the history of the sport,” said Wachter. Sotheby’s sold the jersey for $9.3 million in 2022, less than two years after the all-time great Argentine died.\nThe Olympic Games Manifesto – $8.8 million\nThis original, hand-written manuscript by Pierre du Coubertin details his vision for sports to serve as a means to greater peace and understanding among the peoples of the world. Coubertin founded the International Olympic Committee two years after writing the manifesto in 1892. This rarely seen original document was gaveled at auction by Sotheby’s in December 2022. History buffs find it hard to overstate the importance of the 14-page document: Coubertin’s vision stands as the ideal for sportsmanship and peaceful competition to benefit both individual athletes and their countries.\nLionel Messi set of six 2022 World Cup match-worn shirts – $7.8 million\nThe great Argentine player starred in the 2022 World Cup captaining his country to its first title since Maradona’s 1986 team. Messi wore this set of six jerseys in the first halves of games in group play, the semifinals and final, scoring four goals in them. Sold by Sotheby’s in December 2023, the shirts are seen as the culmination of Messi’s remarkable international and club-playing career, even as he continues to star in MLS. In a sign of big money getting into collectibles, the jerseys were put up for auction by a venture backed in part by billionaire Steve Cohen.\nHonus Wagner T-206 Baseball card – $7.25 million\nThis rare card of Hall of Famer Honus Wagner was long synonymous with the most expensive sports collectible. That’s because the clean-living Wagner had the cards stopped in 1911 when he saw they featured an ad on the back for cigarettes. Goldin Auctions brokered the record-setting private-party sale of a fine example of the card in 2022. It’s known as T-206 because only 206 of the baseball trading cards were ever printed and just 50 are thought to exist today. It’s believed this is just the second sale of one of the Wagner cards in the past 18 years.\n1914 Babe Ruth rookie card – $7.2 million\nBabe Ruth is renowned as baseball’s greatest player of his era and probably the most important baseball player ever, establishing the home run as the headline thrill of the game and helping make the Yankees sports’ most famous team. But it’s not the Red Sox or Yankees uniform The Babe wears on this card. Instead, it’s his one season hurling for the Baltimore Orioles, then a minor league team. The card is scarce too: probably just 10 exist. This card sold for $7.2 million in 2023 through Robert Edward Auctions, two years after shares in it were sold at a valuation of $6 million.\nKobe Bryant 1996-1997 Lakers jersey – $7 million\nBryant, the all-time leading scorer in the vaunted history of the L.A. Lakers, wore this gold-colored jersey for his debut game, as well as during the preseason and other games his rookie year. Though his rookie campaign was modest, the jersey represents the start of the meteoric rise of the Hall of Famer, who died in a 2020 helicopter accident. Bryant, considered to be one of the most iconic players to hit the court, won five NBA championships and two NBA Finals MVP awards. Like many auctions, the buyer and seller are anonymous. Sotheby’s conducted the 2025 sale.\n(This story was originally published on Jan. 12, 2024. It was updated on Aug. 26, 2024 after Babe Ruth’s “Called Shot” jersey sold for $24.1 million in August 2024, on April 28, 2025 after Kobe Bryant’s rookie jersey sold for $7 million and on Aug. 24, 2025 after the Kobe Bryant-Michael Jordan card sold for $12.9 million.)"
    },
    {
      "url": "https://finance.yahoo.com/news/nfl-private-equity-ownership-rules-190928188.html",
      "text": "In August, the NFL voted to allow institutional investors to buy into franchises. The world’s richest league had stood apart from every other top-level global professional sports league by declining to allow private equity or other institutional investment in its teams. Global soccer was the first to allow private equity to own teams outright in 2006, leading to the current boom in fund interest in owning at least part of teams—the North American sports leagues began allowing PE in starting in 2019.\n“Owners gain more options for how they can invest in the franchise and enhance the value of their team. Projects like stadium renovations and technological advancements are expensive and require significant capital to complete. Private equity can provide this much-needed funding,” the American Investment Council, a PE advocacy organization, said about the news of the NFL’s decision.\nThat’s technically true, but it also was true before—teams were always permitted to go to the bond market to borrow money. The real reason for allowing PE to join team ownership ranks has everything to do with the NFL’s skyrocketing team values. In 1989, Jerry Jones paid $150 million for the Dallas Cowboys—what was then seen as a shocking amount for an NFL team. The club is now the world’s first franchise worth $10 billion, and the average NFL team is worth $5.93 billion. Those huge values mean that some buyers have faced hurdles cobbling together enough cash to buy teams in recent deals. Now PE firms can be part of the consortiums that purchase teams, making raising cash easier.\nProbably more importantly, letting PE buy into teams provides an avenue for minority owners to sell more easily. It’s a simple fact that even a 5% piece of the average team is nearly $300 million—very few of the ultra-wealthy want to spend that money to have minimal say in no the team operates. Family-owned teams also get an easier path to cash out those family members who want to get their money and do something else.\nWho is allowed to own NFL teams today?\nControl ownership of an NFL team hasn’t changed. The NFL requires a the traditional sports team ownership model—one owner making decisions for each team. That person leads the organization, attends owner meetings and votes on matters the NFL puts before its owners.\nOf course, not every franchise is 100% owned by one person; the NFL requires one person to be the decision-maker while allowing others to hold minority stakes in teams. In long-standing exceptions to that rule, the league allows large extended families to divide equity among many family members, like with the Chicago Bears. Even more than half a million fans claim team ownership with a small slice of stock, in the case of the Green Bay Packers.\nWith the acceptance of private equity, permitted firms can own minority stakes in franchises too. But with a few guardrails the NFL has put on transactions.\nWhat are the ownership guidelines for private equity?\nEight firms have been permitted by the league to invest in franchises. Three are acting independently: Arctos Partners, Ares Management and Sixth Street. Five others form a consortium that will buy and sell together: Blackstone, Carlyle Group, CVC, Dynasty Equity and Ludis Capital. The mechanics of the consortium’s arrangement hasn’t been publicly disclosed, but it’s assumed the arrangement allows the smaller funds—Dynasty and Ludis, which otherwise would not meet other league hurdles—to participate in deals.\nFirms that buy into teams have to buy at least 3% of a team’s equity and can’t buy more than 10%—the maximum any team can sell to PE is 10%. In practice, this means at most three PE firms can invest in any single team (i.e. owning 3.33% each or some slight variation).\nAny purchase by a PE firm can’t be sold for six years.\nThe maximum teams any single firm can have a stake in is 6. That means, based on today’s average team value, a PE firm could invest as much as $3.56 billion in the NFL. That’s real money.\nThe league requires any investment fund have at least $2 billion in capital. That means money it has in hand and invested anywhere; it’s a hedge against a fund being too small that it shuts down.\nNo more than 20% of the fund’s assets can be invested in any one club—again, a hedge against problems on the fund side affecting a team.\nNo one person can account for more than 7.5% of the assets of any investing fund.\nIn a mind-bender suitable to a Christopher Nolan film, NFL owners themselves can invest in the PE funds that own equity in their teams, too. The league has put limits on how much owners can put into those funds: No more than 3% of the fund’s capital can be from an owner or their immediate family.\nDoes this differ from ownership rules for people?\nThe admission of PE doesn’t change the rules around other owners.\nAn incoming controlling owner must own at least 30% of the franchise, though it is said the league strongly prefers a new owner to hold half outright. NFL teams with the same owner for at least a decade then see that rule loosened, with the controlling owner having to own just 1% of the franchise equity, while their families need to own 30%.\nA maximum of 25 people can be in any ownership group.\nA detailed succession plan for each team’s ownership must be filed and then updated annually with the league office. Of course, the NFL owners themselves can approve or decline any new owner if 24 of the 32 vote for it, and the owners can always vote to change their rules at any time.\nWhat teams have private equity investors?\nThe Buffalo Bills and Miami Dolphins were the first teams to sell a minority stake to private equity firms in December. Arctos Partners purchased a 10% stake in the Bills while Ares Management bought 10% of the Miami Dolphins as well as stakes in Hard Rock Stadium and the Formula 1 Miami Grand Prix, which is owned by Dolphins majority owner Stephen Ross.\nWill other types of funds will be allowed?\nWhile the NFL’s rules for PE are tighter than other North American leagues (where 20% to 30% of team equity can be sold to institutions), the NFL appears to be following their example. At first, the other leagues just allowed PE firms to invest first. Some later permitted the addition of university endowments, pension plans and sovereign wealth funds to be, at least theoretically, permitted.\nUnlike sports such as basketball, baseball, soccer and ice hockey that have sizeable followings outside the U.S. and Canada in at least handful of countries, American football is nearly only a North American game, at least as far as people who play. In the case of sovereign wealth, which often have a goal of advancing a sport or business in their home country when they invest, the NFL may be too American for them to want to invest.\n(This story was initially published on July 2, 2024 and was updated after the NFL voted to allow private equity in ownership. It was updated again with details of the teams taking private equity investment.)"
    },
    {
      "url": "https://www.sportico.com/feature/most-valuable-sports-teams-1234832079/?utm_source=yahoo&utm_medium=feeds&utm_campaign=best_of_brands",
      "text": "The top 100 franchises are based on Sportico’s most recent valuations for NFL, NBA, MLB, NHL, F1 and global soccer. No MLS, NWSL or WNBA teams made the cut. You can find breakdowns of each of these leagues by clicking on these hyperlinks.\nTo derive the market value of the sports franchises, Sportico calculated each team’s revenue relying on publicly available information and financial records—as well as interviews with those knowledgeable of team finances, including sports bankers and attorneys who actively work on transactions. This information was vetted by team personnel, including owners, team or parent company CEOs, presidents, chief financial officers and media relations employees, as well as industry experts and investors. Below are definitions of some major metrics:\nTotal Value: The sum of the market value of the franchise combined with the value of team-related businesses and real estate holdings.\nTeam Value: Franchise valuations are derived from metrics by which basketball-team transactions occur, including aggregating local and national revenues and factoring in a team-specific multiplier. This represents the market value of the team itself, excluding related businesses held by its owners.\nThe revenue listed are based on the following seasons: 2023 (F1, MLB, NFL) and 2023-24 (NBA, NHL, global soccer).\nTeam-Related Businesses and Real Estate Holdings: The value of a franchise or franchise owner’s equity in team-related businesses—that is, both those on the team’s balance sheet and held in distinct corporate entities—as well as government-assessed real estate related to venue, practice facilities and adjacent developments. Examples include the Atlanta Braves’ six subsidiaries that own the 31 parcels of land adjacent to its ballpark; the New York Yankees’ 26% interest in the YES Network; the Washington Commanders’ subsidiaries, which own nearly 400 acres split between 12 parcels near the team’s stadium and practice facility; and WNBA franchises for the six teams that share common ownership with an NBA club.\nFor franchises that do not own their arenas, the value of a team’s lease—often with advantageous terms negotiated with municipal or state authorities—is captured in the Team Value category."
    },
    {
      "url": "https://finance.yahoo.com/news/sports-stocks-hit-32-month-120000400.html",
      "text": "The Sportico Sports Stock Index closed August at its highest level since the end of 2021, as a belief that interest rates will be cut and boost consumer spending in what is already a strong economic climate lifted sports betting and entertainment stocks.\n“With GDP running at 3.3%, the economy appears to be [firing] on all cylinders, and it should be a boost of confidence to markets that most of the tariff angst was misplaced earlier this year,” Chris Zaccarelli, chief investment officer of Northlight Asset Management, said. “However, markets have already priced in a September rate cut and it is important that the inflation data remains restrained between now and then … [but] the bull market is alive, and well and it will take a meaningful catalyst—such as a recession—to derail it.”\nThe stock market has been feeling especially bullish for over a week, since Federal reserve chairman Jerome Powell gave a speech in Jackson Hole, Wyo., telegraphing that the central bank cares more about employment levels than inflation—suggesting the Fed will probably cut interest rates a quarter of a point in September. Cutting rates typically helps employment and consumer spending, while raising rates would be a tactic to counter rising costs caused by Donald Trump’s tariffs. The day of Powell’s speech, the Sportico Stock Index jumped 2.7%, reversing what had been a down month for the benchmark sports index.\nFor the month, the sports index outpaced the S&P 500 index and closed the month up 2% at 1,550, its highest month-end mark since December 2021. Most sports betting stocks improved in the month, with Rush Street Interactive (RSI) leading all 40 index stocks with a 43% rally in August. Rush Street continued to enjoy momentum from its end-of-July earnings report, which showed strength in Latin America and in online casino technology that allows players to also place sports bets while playing poker, for instance.\nSports data and analytics’ Genius Sports (GENI) was the second-best performer, adding 24%. Early in the month the company reported quarterly revenue was up 25%, led by a 30% gain in betting technology, content and services, its largest division contributing nearly three-quarters of sales. Genius said more bets, better pricing on contract renewals and more customers electing value-added services led to the gains.\nOverall, 35 of the index’s 40 companies advanced in August, nine of those of 10% or more.\nDespite the overall positive performances, there were some sharp decliners in the month, led by Vivid Seats (SEAT), which shed 48% of its value. That came even as the company did a 20-to-1 reverse stock split to prop up its share price early in the month. Vivid’s closing price of $16.92 is the equivalent of $0.85 a share last month. In its quarterly earnings call on Aug. 4, Vivid noted sports ticket sales were down double digits in its second quarter, thanks in part to underwhelming playoff matchups in the NBA and NHL.\nAlso struggling with wrong-way momentum was Under Armour (UAA). Its shares lost 27% in August to fall to a 15 year-low of $5.01. Thought the market has largely brushed off tariff fears with most companies, tariffs were mentioned 25 times on Under Armour’s August earnings call, as management said the Trump taxes will bring a $100 million hit to the business by year’s end. Under Armour is doing its best to paint the tariff hurdle as an opportunity to raise prices for the longer term. “The company is already embedding pricing power into product redesigns and premiumization efforts to offset near-term headwinds,” Jefferies analyst Randal Konik said in a research note.\nWhile Wall Street is generally sounding bullish over stocks heading into the fall, it’s worth noting September is historically the worst month for equities, with the S&P 500 index falling on average 0.7% in the month over the last 75 years, according to Adam Turnquist, the chief technical analyst at LPL Financial. Generally, summertime lends itself to Wall Street pros embracing good news and ignoring the bad, something that tends to shift as vacations end with the Labor Day weekend. In the five years since the Sportico Sports Stock Index was formed, it has declined in three of the Septembers.\nThe Sportico Sports Stock Index is a basket of 40 stocks that rely on sports for a significant portion of future growth. The index includes sports teams and leagues such as Carabao Cup also-ran ManchesterUnited (MANU, up 3%), broadcasters like recently purchased Paramount Skydance Corp. (PSKY, up 10%) and union-battling concessionaires like Aramark, (ARMK, down 9%). The index is equal weighted, meaning each stock starts off as 2.5% the value of the overall benchmark. Every three months the components are reset to 2.5% weighting with stocks dropped and added as needed at those times. To be included in the index, stocks must be traded in the U.S. with sufficient daily volume and a market capitalization greater than $50 million. The index was launched in August 2020 at 1,000."
    },
    {
      "url": "https://www.sportico.com/leagues/other-sports/2025/ufc-fighters-pay-paramount-deal-ppv-1234866705/",
      "text": "Ultimate Fighting Championship CEO Dana White touts the new seven-year, $7.7 billion rights deal with Paramount as a knockout for the promotion’s fighters. After all, they’re now set to be exposed to a wider audience of consumers thanks to Paramount’s platform—a 77 million global subscriber base—which will be more accessible for fans who were paying as much as $80 an event for PPV on ESPN.\nBut in announcing the deal—the first major move by the combined company (coming days after Paramount finalized its merger with production studio Skydance)—TKO president Mark Shapiro apparently put the kibosh on the UFC’s traditional pay-per-view model, which often is tied to the top fighters’ compensation.\nSo what happens when a fighter loses the opportunity to negotiate percentage points on PPV revenue for an upcoming event, or when a clause that calls for a bigger payout based on a number of buys is eliminated from contract talks? These are the questions that White, who has already faced criticism for allegedly underpaying athletes, will have to answer soon.\nShapiro told CNBC that the PPV model is “outdated” and “a thing of the past,” as this deal spells an end to that blueprint. White, however, contradicted that by keeping the door open for UFC to do potential one-off PPV events in an interview with the New York Post. He even went as far to say that “pay per view is not dead,” which speaks to the UFC side seeing at least some upside with the longtime model.\nA representative for White did not reply to a request for comment.\nMeanwhile, Monday’s announcement rollout indicated mixed martial arts fans now only need to pay $12.99 a month to access UFC events, with White telling CBS Sports that four “big” annual events are likely to be aired on Paramount’s CBS through the new partnership. This includes a potential Fourth of July fight on the White House lawn next year. While the deal won’t turn the streaming company profitable in the short term, it’s a victory for Paramount+ as it seeks to maintain a seat at the big-sports table.\n“The deal is good for everyone, except the fighters,” UFC co-founder and Combate Global CEO Campbell McLaren said in a phone interview. The longtime MMA executive believes the promotion, which has “always traded on the UFC name,” will have even more leverage over the top fighters and their agents during negotiations without the PPV sales pressure.\n“If you’re a good promoter, you can build a fight and not necessarily have to spring for the high-priced names,” he said. “They’re (now) less held hostage by the big names. ‘You don’t want to [agree] to it? Fine. We’re moving on. We’ll put on a great card without you’.”\nUFC continues to develop cheaper talent through its minor leagues like Contender Series and The Ultimate Fighter (which air on ESPN but will also need new homes since they’re not part of the CBS deal). UFC, which has lacked a superstar draw since Conor McGregor’s slide and Khabib Nurmagomedov’s retirement, could replenish the talent pool while keeping pay scales under control.\nInternet sensation-turned-pro boxer Jake Paul, a regular critic of UFC, offered his two cents online after the Monday announcement: “Every fighter in the UFC now has a clear picture of what the revenue is… no more PPV excuses. Get your worth boys and girls.”\nBut quantifying a fighter’s worth is complex. Ask ESPN. It was in question before this week’s news given PPV performance on UFC events has declined. The UFC has depended less on PPV revenue over the years as a result, which places more pressure for the top fighters to communicate their value during contract negotiations.\nFormer UFC heavyweight champion Josh Barnett recently pushed back on the wage debate, saying top fighters should be compensated well and lower-profile fighters shouldn’t be allowed to piggyback.\n“If you’re not pulling the money in, if you’re not making the people have to watch you, you probably cost a promotion more than you make it,” he said during an appearance on the Ariel Helwani Show. “When [people argue] about the media rights, then that just means guys are less valuable, because they can just rotate anybody in.”\nFormer UFC executive vice president Marshall Zelaznik is optimistic that top fighters will receive comparable pre-deal payouts, pointing out that Paramount was only for U.S. rights (the company is also interested in acquiring the international rights). Zelaznik believes the new model could call for a “creative” compensation formula based on viewership and historical averages, with more potential guaranteed money.\nZelaznik, now the CEO of the Glory kickboxing promotion, is confident that parent company TKO will maintain competitive market payouts and feels the seven-year pact represents a milestone that UFC is on its way to becoming a “must-have” property—the NFL of MMA.\n“It gives fighters clear security that the UFC is around, driving business and events, and you need not worry that you’ll get fights and will get paid,” he added. “That’s not true for every promotion. … This is good news for the fighters. There’s ambiguity, but they’ll find a way to get the top fighters who drive the business compensated. They usually do.”"
    }
  ],
  "argos_summary": "TKO Group Holdings has doubled its quarterly dividend to $0.76 per share, a $150 million payout, driven by new U.S. media rights deals: a seven‑year, $1.1 billion‑per‑year UFC contract with Paramount Skydance and a five‑year, $1.6 billion WWE deal with ESPN. The move lifts TKO’s dividend yield to 1.64%, above the S&P 500’s 1.2%, and signals confidence in the company’s cash flow. TKO also plans to expand its credit facility by up to $1 billion to support future growth.",
  "argos_id": "DDRPN77NL"
}