{
  "url": "https://www.usatoday.com/story/news/politics/2025/09/03/louisiana-angola-prison-to-hold-ice-immigrant-detainees/85943943007/",
  "authorsByline": "Lauren Villagran",
  "articleId": "126b3027a8d4435c876de9dcf2d9344f",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/06/24/PTX1/84328277007-alexandria-detention-2052.JPG?crop=3499,1968,x0,y182&width=3200&height=1800&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T14:30:59+00:00",
  "addDate": "2025-09-03T14:35:18.382823+00:00",
  "refreshDate": "2025-09-03T14:35:18.382826+00:00",
  "score": 1.0,
  "title": "Trump administration to expand ICE detention into notorious Angola prison",
  "description": "Louisiana has supported federal immigration enforcement for years and has the second-highest number of ICE detention centers outside Texas.",
  "content": "The Trump administration plans to detain immigrants in the nation's largest maximum-security prison – a Louisiana lock-up with a notorious history as a \"prison plantation.\"\n\nLouisiana has played a key role in federal immigration enforcement for years as the state with the second-highest number of ICE detention centers outside Texas. The Louisiana State Penitentiary – better known as Angola – stands to become the state's 10th ICE detention site.\n\nOn Sept. 3, top Trump administration officials are scheduled to meet Louisiana Gov. Jeff Landry outside the 6,300-bed prison located two hours northwest of New Orleans at a bend in the Mississippi River.\n\nThe prison emerged in the late 1800s from the consolidation of four plantations to become a prison farm where prisoners would do the work once done by enslaved people, according to research by Justin Hosbey at the University of California.\n\nA scholarly article housed in the Department of Justice's own virtual library refers to Angola as a \"prison plantation.\"\n\nThe agreement between U.S. Immigration and Customs Enforcement and Louisiana mirrors similar deals struck on immigration detention between Republican-led states and the Trump administration. They include the now-shuttered \"Alligator Alcatraz\" detention camp in the Florida Everglades and 1,000 beds at a correctional facility in Indiana the administration is calling the \"Speedway Slammer.\"\n\nICE officials have said they're looking to secure 80,000 new immigration detention beds in existing prison facilities and on military bases, on top of the 41,500 immigration detention beds already in the system, as part of a massive expansion of immigrant detention.\n\nThis summer, Congress provided $45 billion to ICE to pay for it – a war chest three times greater than what the agency previously had for detention, according to the American Immigration Council.\n\nAngola is notorious not only for its history but for its present.\n\nPrisoners sued the Louisiana prison system in 2023 over conditions on what's known at Angola as the \"farm line,\" where inmates are forced to work the fields under the watchful eye of armed guards. Last year, a federal judge ordered the prison to put more protections in place to safeguard prisoners in conditions of extreme heat.\n\nHomeland Security Secretary Kristi Noem, Attorney General Pam Bondi and ICE Deputy Director Madison Sheahan are expected to tour the Angola prison Sept. 3.\n\nICE is currently holding a record 61,226 people in immigration detention at more than 190 facilities nationwide, according to an analysis of detention data by Austin Kocher, an immigration researcher at Syracuse University.\n\nThe latest data shows that nearly half, or 45%, of people in ICE detention have no criminal record or pending charges. Because ICE holds immigrants with alleged civil violations of immigration law, the agency's standards require that detention be \"non-punitive,\" or not punishing.",
  "medium": "Article",
  "links": [
    "https://www.crt.state.la.us/Assets/OCD/archaeology/discoverarchaeology/virtual-books/PDFs/Angola_Pop.pdf",
    "https://www.ojp.gov/ncjrs/virtual-library/abstracts/prison-plantation-story-angola",
    "https://www.usatoday.com/news/politics/pam-bondi/",
    "https://www.usatoday.com/videos/news/2025/08/22/judge-orders-temporary-closure-of-alligator-alcatraz/85773948007/",
    "https://journals.sagepub.com/doi/10.1177/26349825241296077#:~:text=Angola%20was%20established%20post%2DCivil,the%20plantations%20which%20preceded%20it.",
    "https://www.usatoday.com/story/news/nation/2025/07/20/louisiana-ice-detention-immigration-border/84246870007/",
    "https://www.usatoday.com/news/politics/kristi-noem/",
    "https://www.usatoday.com/story/news/nation/2025/08/23/texas-army-base-japanese-internment-ice-detention/85767850007/",
    "https://www.wwno.org/law/2025-04-25/angola-farm-line-hearings-highlights-controversies-over-prison-labor-heat",
    "https://www.ice.gov/detain/detention-management#:~:text=Detention%20is%20non%2Dpunitive.,Family%20Residential%20Centers%20(FRCs).",
    "https://www.usatoday.com/picture-gallery/news/national/2025/07/20/louisiana-ice-detention-centers-photos/84328276007/",
    "https://www.dhs.gov/news/2025/08/05/speedway-slammer-new-partnership-dhs-and-state-indiana-expand-detention-space",
    "https://www.americanimmigrationcouncil.org/fact-sheet/house-reconciliation-bill-immigration-border-security/",
    "https://thelensnola.org/2025/04/24/angolas-farm-line-again-asks-judge-for-consistent-shade-and-water/",
    "https://www.usatoday.com/story/sports/motor/indycar/2025/08/07/indiana-speedway-slammer-ice-indycar-homeland-security/85566941007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ICE detention",
      "weight": 0.120462924
    },
    {
      "name": "immigration detention",
      "weight": 0.118661866
    },
    {
      "name": "ICE detention centers",
      "weight": 0.11322952
    },
    {
      "name": "notorious Angola prison",
      "weight": 0.10046698
    },
    {
      "name": "detention",
      "weight": 0.09893489
    },
    {
      "name": "detention data",
      "weight": 0.09800738
    },
    {
      "name": "immigrant detention",
      "weight": 0.096874654
    },
    {
      "name": "existing prison facilities",
      "weight": 0.08974387
    },
    {
      "name": "ICE officials",
      "weight": 0.084980145
    },
    {
      "name": "ICE",
      "weight": 0.08085245
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9208984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.837890625
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.7744140625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.771484375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.69189453125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.47802734375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.3857421875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.36865234375
    }
  ],
  "sentiment": {
    "positive": 0.088681564,
    "negative": 0.5707027,
    "neutral": 0.34061578
  },
  "summary": "The Trump administration is planning to expand immigration detention into the Louisiana State Penitentiary, or Angola, a Louisiana lock-up with a history as a \"prison plantation\". This move aligns with Louisiana's role in federal immigration enforcement. The state has the second-highest number of ICE detention centers outside Texas. The agreement mirrors similar agreements between Republican-led states and the Trump administration. ICE officials plan to secure 80,000 new immigration detention beds in existing prison facilities and on military bases as part of a massive expansion of immigrant detention.",
  "shortSummary": "The Trump administration plans to expand ICE detention into Louisiana's largest prison, Angola, where inmates work as \"prison plantations.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fdfbedb84bf94e4ebf93b51339409eb5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.ojp.gov/ncjrs/virtual-library/abstracts/prison-plantation-story-angola",
      "text": "NCJ Number\n54280\nJournal\nSouthern Exposure Volume: 6 Issue: 4 Dated: (WINTER 1978) Pages: 32-38\nDate Published\n1978\nLength\n7 pages\nAnnotation\nLOUISIANA'S PRISON FARM AT ANGOLA IS DISCUSSED, WITH EMPHASIS ON ITS HISTORY AND DOCUMENTED CHARGES OF INHUMANE TREATMENT AND OVERCROWDED, UNSANITARY, AND DEHUMANIZING LIVING AND WORKING CONDITIONS.\nAbstract\nORIGINALLY A FAMILY PLANTATION, WITH AN ANTEBELLUM MANSION OVERLOOKING THE RIVER AND THE DELTA LAND ADJACENT TO BATON ROUGE, ANGOLA (A NAME DERIVED FROM A LATIN WORD FOR 'PLACE OF ANGUISH') WAS CREATED IN 1900 FOLLOWING THE PRISON CONTROL BOARD'S PURCHASE OF THE 8,000 ACRE PLANTATION. CONSISTING OF SEVERAL SMALL CAMPS BUILT WITH INMATE LABOR WITHIN THE CONFINES OF THE PLANTATION COMPOUND, ANGOLA HAS A LONG HISTORY OF SEVERE ABUSES, INCLUDING THE SANCTIONED USE OF FLOGGINGS, PUNISHMENT CAMPS, AND TORTURE. DURING THE ADMINISTRATION OF GOVERNOR HUEY LONG, OFFICIAL BRUTALITY THRIVED AT THE PRISON FARM; INMATES WERE UNDERFED, BEATEN, AND TORTURED AND GUARD CAPTAINS HAVE ADMITTED TO SOME 10,000 FLOGGINGS BETWEEN 1928 AND 1940. THE BRUTAL PRACTICES AND POLICIES OF LONG'S APPOINTEES CONTINUED INTO THE 1950'S AND ONWARD WITH ADMINISTRATORS AND GUARDS RESISTING OUTSIDE ATTEMPTS AT REFORM. ALTHOUGH PUBLIC INQUIRIES INTO CONDITIONS AT ANGOLA RESULTED IN SOME EARLY PROGRESS, BY THE 1960'S SUCH REFORMS HAD TAILSPINNED AND THE LASH AND PUNISHMENT CAMPS WERE REPLACED WITH MORE MODERN FORMS OF BRUTALITY. HOWEVER, AFTER THE U.S. SUPREME COURT CLEARED THE WAY FOR PRISONERS TO BRING LEGAL ACTION AGAINST STATE AND FEDERAL OFFICIALS RESPONSIBLE FOR 'CRUEL AND UNUSUAL PUNISHMENT,' FOUR ANGOLA PRISONERS FILED SUIT AGAINST THE STATE IN 1968. IN 1975, A FEDERAL JUDGE DECLARED THE CONDITIONS AT ANGOLA UNCONSTITUTIONAL AND PROHIBITED THE PRISON FROM ACCEPTING ANY NEW INMATES UNTIL THE POPULATION DECLINED. HE ORDERED THE STATE TO IMPROVE SECURITY, MEDICAL CARE, AND FOOD SERVICE AND TO DECENTRALIZE THE PENITENTIARY BY BUILDING FULL FACILITIES ELSEWHERE AS WELL AS AT ANGOLA. HE ALSO ORDERED THE STATE TO ELIMINATE FIRE, SANITATION, AND HEALTH HAZARDS AND TO DESEGREGATE THE PRISON. WHILE SOME CHANGES HAVE OCCURRED, ANGOLA REMAINS 'A SEWER OF DEGRADATION--PRIMITIVE, COERCIVE AND DEHUMANIZING.' PHOTOGRAPHS ARE INCLUDED. (KBL)"
    },
    {
      "url": "https://www.ice.gov/detain/detention-management#:~:text=Detention%20is%20non%2Dpunitive.,Family%20Residential%20Centers%20(FRCs).",
      "text": "Detention Management\nDetention Standards\nRegardless of whether detention facilities are owned and operated by ICE, a state or local entity, or a contractor, all facilities housing ICE detainees must comply with one of several sets of detention standards which describe a facility’s immigration detention responsibilities, explain what detainee services a facility must provide, and identify what a facility must do to ensure a safe and secure detention environment for staff and aliens in detention:\n- 2025 National Detention Standards\n- Non-Dedicated Intergovernmental Detention Standards (NDIDS)\n- National Detention Standards (NDS) 2000\n- Performance-Based National Detention Standards (PBNDS) 2008\n- PBNDS 2011\n- NDS 2019\n- Family Residential Standards 2020\n- Temporary Housing Standards\nDetention Facility Oversight\nTo ensure compliance with each contract’s terms and conditions and the applicable detention standards, ICE and the Department of Homeland Security (DHS) employ a robust, multilevel oversight and compliance program. ERO monitors detention conditions through daily on-site compliance reviews to identify deficiencies, areas of concern, contract and facility issues, and to facilitate corrective actions. All facilities that house aliens detained by ICE are required to follow a strict set of detention standards.\nDetention Policies\nDetention is non-punitive. Once an alien is transferred to ICE custody, the agency makes a custody determination. ICE uses its limited detention resources to detain aliens to secure their presence for immigration proceedings or removal from the United States — as well as those that are subject to mandatory detention, as outlined by the Immigration and Nationality Act, or those that ICE determines are a public safety or flight risk during the custody determination process.\nWhen an alien is not subject to mandatory detention or is not deemed to be a public safety or flight risk, ICE exercises its discretion in making custody determinations to release aliens with conditions. These custody decisions are made on a case-by-case basis and after considering the totality of circumstances — primarily considering risk of flight, national security threat and risk to public safety.\nICE also takes other factors into consideration — including when an alien has a serious medical condition, is the primary caregiver of minor children, or other humanitarian considerations.\nFamily Detention\nIn the past, ICE housed family units — which contain adult alien parents or legal guardians accompanied by their own juvenile alien children — in its Family Residential Centers (FRCs). In March 2021, ICE converted the Family Residential Centers (FRCs) from an over-72-hour residential program to an under-72-hour residential/staging program called Family Staging Centers (FSCs).\nIn FY 2022, ICE opted to shift its resources again to increase efficiencies in Alternatives to Detention (ATD) enrollment for family units. ICE worked to co-locate with U.S. Customs and Border Protection (CBP) to assist with limiting any processing slowdowns.\nOnce the agency determined that the FSCs were at a lower-than-expected capacity, ICE took steps to increase the use of the bed space for single adults and eventually, ICE stopped housing families entirely by December 2021.\nCustody and Care of Unaccompanied Children (UC)\nICE does not detain unaccompanied children — except in rare instances.\n- As part of the restructuring of the former Immigration and Naturalization Service, the Homeland Security Act of 2002 transferred the responsibilities related to the care and custody of unaccompanied undocumented children to the U.S. Department of Health and Human Services (HHS) Office of Refugee Resettlement (ORR).\n- In accordance with the Trafficking Victims Protection Reauthorization Act (TVPRA) of 2008, ERO coordinates closely with inter-departmental partners to ensure the timely and safe transfer of unaccompanied alien children from DHS to HHS ORR custody.\nDetention Statistics\nICE provides the following custody data below. The data tables are searchable and sortable, and worksheets are protected to ensure their accuracy and reliability. ICE confirms the integrity of the data as published on this site but cannot attest to subsequent transmissions. Data may fluctuate until it is locked at the conclusion of the fiscal year."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/07/20/louisiana-ice-detention-immigration-border/84246870007/",
      "text": "ICE detention is growing in the South. This state was the first.\nLouisiana, long known for its 'prison economy,' now houses more ICE detention facilities than any other non-border state.\nWINN PARISH, LA – Far from the jazz clubs and nightlife of New Orleans, thousands await their fate inside immigration jails.\nLouisiana has more dedicated Immigration and Customs Enforcement detention centers than any other state besides Texas – nine total – after it converted nearly half a dozen correctional facilities to immigrant detention. Most are remote, scattered near farms and forests. Among the sites is a unique \"staging facility\" on a rural airport tarmac for rapid deportations.\nPresident Donald Trump is increasingly leaning on Republican-led Southern states to detain and deport millions of immigrants ‒ from \"Alligator Alcatraz\" in the Florida Everglades to the expansion of a sprawling Georgia immigration facility. Far from the U.S.-Mexico border, Mississippi has the ICE jail with the highest average daily population.\nBut Louisiana was the first non-border state to surge immigration detention capacity, according to the American Civil Liberties Union of Louisiana and Tulane University Law School. The state opened five new facilities to detain immigrants in 2019, during the first Trump administration, and vastly expanded the number of detainees during the Biden administration.\nImmigrants are sent here from all over the country, far from their families, communities and, often, their lawyers.\nThe Trump administration has confined some of its highest-profile detainees in Louisiana, including now-released Columbia University activist Mahmoud Khalil and Harvard University scientist Kseniia Petrova.\nThe state's largest immigration jail, Winn Correctional Center, is tucked deep into dense pine woods nearly five hours northwest of New Orleans. The site is so remote that, for years, online maps routinely sent visitors the wrong way down a dirt road. A warning sign cautions visitors: \"This property is utilized for the training of chase dogs.\"\nOther states might follow Louisiana's example as more federal funds flow to ICE detention. Congress recently authorized the Trump administration to spend $45 billion over the next four years to expand immigration jails around the country. That's nearly four times ICE's previous annual detention budget.\nUSA TODAY traveled to four of Louisiana's nine ICE facilities, hoping to see firsthand what life is like for immigrants detained there. But the Department of Homeland Security and U.S. Immigration and Customs Enforcement denied multiple requests for a tour of any of the locations.\nIn an emailed statement, DHS Assistant Secretary Tricia McLaughlin said ICE originally expanded its detention capacity in Louisiana \"to address the increasing number of individuals apprehended at the border\" under the Biden administration.\n\"ICE continues to explore all options to meet its current and future detention requirements while removing detainees as quickly as possible from the U.S.,\" she said.\nNora Ahmed, legal director of the ACLU of Louisiana, described the state as key to Trump's promised mass deportation campaign.\n\"Louisiana really is the epicenter for a lot of what is currently taking place with this administration,\" Ahmed said. \"It's an outcropping of a prison economy that Louisiana has survived on for a long, long time.\"\nDeportation hub far from the border\nLouisiana found its foothold as a deportation hub at the end of Trump's first term, when the administration was looking to expand immigrant detention.\nThe state had reformed its criminal justice system in 2017, with bipartisan support, to reduce sentences for low-level offenders. That had the effect of dramatically decreasing the state's prison population and freeing thousands of incarcerated people – mainly Black men and women.\nAt the time, the Black imprisonment rate was nearly four times the rate of White imprisonment in Louisiana, according to the ACLU.\nLouisiana eventually rolled back the reforms. But racial justice activists briefly celebrated a win.\nThen ICE came knocking.\nThe first Trump administration, and later the Biden administration, wanted to detain more illegal border crossers. Louisiana offered advantages: empty prisons, employees already trained in corrections, and access to the Alexandria airport with a detention facility and a history of deportation flights.\nIt also has some of the country's most conservative immigration judges, as well as a federal appeals court that, in immigration cases, often sides with the government, lawyers say.\n\"Louisiana had the infrastructure already there,\" said Homero López, legal director of New Orleans-based Immigration Services and Legal Advocacy, a nonprofit that provides free representation. \"ICE comes in saying, ‘Y’all have got the space. We’ve got the people. We’ll pay you double what the state was paying.’ That’s why the expansion was so fast.\"\nLouisiana's rural communities offered advantages for ICE\nMany Americans know Louisiana by its crown jewel, New Orleans, the state's tourism mecca, where social norms and politics are as liberal as the flow of alcohol on Bourbon Street.\nBut Louisiana is largely wooded, rural, proudly conservative and deeply Christian. County governments are called parishes and the poverty rate is the highest in the nation.\n\"People want jobs and who’s to blame them?\" said Austin Kocher, a Syracuse University research assistant professor who studies immigration enforcement. \"It’s fairly easy to promise jobs by setting up a detention facility.\"\nRural Louisiana used to make a living from oil and timber. Logging trucks still rumble down forested two-lane roads, but the decline in natural resources and price unpredictability drove some communities to look for new industries.\nPrisons and now immigration detention deliver good-paying jobs and economic development to places like Winn, Ouachita and LaSalle parishes.\nLaSalle was one of the first to see the potential. In 2007, local leaders in the parish seat of Jena – current population 4,155 – wanted to diversify the economy. A sprawling juvenile detention facility north of town sat empty.\nWhen GEO Group, the nation's largest private detention contractor, swooped in with an ICE contract in hand, local leaders welcomed the opportunity.\n\"Not having to build an entirely new facility was probably a key factor to them locating here,\" said Craig Franklin, editor of the weekly Jena Times. Plus, \"our advantage to a strong employee pool was likely a factor.\"\nIn Ouachita Parish, the mayor and council of Richwood ‒ population 3,881 ‒ debated whether to approve an ICE detention contract. Mayor Gerald Brown didn't have a vote, but he supported the conversion to ICE detention, he said.\n\"Richwood Correctional Center is one of our biggest employers,\" Brown told USA TODAY. \"There was a lot of back and forth. We did town halls, and we had meetings.\"\nThe town stood to gain new income as an intermediary between ICE and the private operator, LaSalle Corrections. When it was a jail, the town earned a $112,000 a year fee. Now that it's an ICE detention center, the town is getting about $412,000 a year.\n\"The financial windfall for the community was something I certainly couldn't turn a blind eye to,\" Brown said.\nRemote ICE detention has consequences for the detained\nThe willingness of rural communities to house ICE facilities is part of the draw to Louisiana, researchers who study immigration detention say.\nAnother factor: When ICE tries to open new detention centers near big cities, the agency is often met with resistance from immigrant rights activists and residents with \"not in my backyard\" arguments.\nBut attorneys say the rural locations have real consequences for the people detained.\nData shows that having access to an attorney dramatically improves a detainee's chance of winning release and a chance at staying in the United States. But it's hard for attorneys to get to many of the facilities; Ahmed regularly drives three to seven hours to visit immigrant clients across the state.\nBaher Azmy, legal director of the New York-based Center of Constitutional Rights, represented Khalil, the Columbia University activist, during his more than three-month detention at the Central Louisiana Processing Center in Jena.\nHe visited twice and said he was struck by its remoteness, the utter lack of space for attorneys to meet their clients and the no-contact family visitation conducted behind plexiglass.\nAccommodations were made for Khalil to see his wife and newborn baby in a separate room, after a court ordered it.\n\"Getting there was an all-day proposition,\" Azmy said. \"It reminded me of my early trips to Guantanamo,\" the military jail on the island of Cuba, where he represented clients accused of terrorism in the years after the 9/11 attacks. \"The desolation, the difficulty getting there. The visiting conditions were better in Guantanamo than in Jena. As horrible as Guantanamo was, I could hug my client.\"\nAccording to ICE, rules and accommodations at different facilities can depend on their design and capacity, as well as contractual agreements.\n\"Allegations that ICE detention facilities have improper conditions are unequivocally false and designed to demonize ICE law enforcement,\" McLaughlin said. \"ICE follows national detention standards.\"\nExponential expansion of ICE detention\nThe United States has consistently grown its immigration detention through both Republican and Democratic administrations.\nBut the average number of immigrants in detention on any given day has risen rapidly over the past six months, from roughly 40,000 people at the end of the Biden administration in January to more than 58,000 in early July.\nUnder President Joe Biden, ICE moved thousands of migrants who sought asylum at the United States-Mexico border over to Louisiana detention centers, said the ACLU's Ahmed.\nNow, the centers are filled with people picked up in the country's interior.\nNearly half of those in ICE detention in early July had no criminal record or pending charges, according to ICE data. They faced civil immigration violations.\nWhen determining whether to send a detainee to Louisiana, ICE considers bed space availability, the detainee's medical and security needs and proximity to transportation, according to an agency statement.\nThe average daily population in Louisiana ICE facilities topped 7,300 in early July. That compares to roughly 2,000 ICE detainees in 2017 at the start of the first Trump administration, according to data collected by TRAC at Syracuse University.\nSome of that increase is due to a Trump administration decision to withdraw legal status from thousands of immigrants who arrived during the Biden administration and followed the rules then in place.\n\"These are mothers. These are children. These are students. And these are individuals who often had status that was very much legal, that's then been taken away by the administration,\" Ahmed said. \"So what we are seeing is the rendering of documented people to undocumented by the stroke of a pen of the United States government.\"\nThree times this spring and early summer, Will Trim traveled to Richwood Correctional to visit his colleague Petrova, the Harvard scientist from Russia. He said the buildings looked \"like warehouses, featureless beige buildings\" encircled with razor wire, separated from a low-income neighborhood by a patch of woods.\nDuring his visits, few of the people he spoke with in the nearby town of Monroe knew that more than 700 immigrant women were being held locally. According to ICE data, on average, in July, 97% of the women in Richwood Correctional had no criminal record.\n\"If they are being held without charge,\" he asked, \"why is there double-barbed wire? Why is it hidden in the forest?\"\nLauren Villagran can be reached at lvillagran@usatoday.com.\nDinah Pulver and Ignacio Calderon contributed to this report."
    },
    {
      "url": "https://www.wwno.org/law/2025-04-25/angola-farm-line-hearings-highlights-controversies-over-prison-labor-heat",
      "text": "In roughly nine years since he first came to Louisiana State Penitentiary, Patrick Jones has picked corn, okra, cabbage and beans by hand.\nHe’s cut grass. He’s baled hay. He’s made sandbags and carried them — all as an incarcerated worker on the site's \"farm line.\"\nBut for people at the prison commonly referred to as Angola, being sent to the \"farm line\" is not quite the same as other work assignments, Jones testified in a federal courtroom this week.\n“It is the only job that you are forced to have a gun pointed at you,\" Jones said. \"You are forced to be talked to like you are less than a human being.\"\nDuring a hearing spanning three days in Baton Rouge, more than 10 witnesses from both sides shed light on the \"farm line\" at the heart of a lawsuit brought by incarcerated men and the grassroots group Voice of the Experienced against Louisiana's prison system and its officials.\nHours of sworn testimony from corrections staff, incarcerated people and medical and academic experts provided a uniquely detailed account of the work assignment at Louisiana's most notorious prison — and of the contradictory views sometimes held by prison officials and people in their custody.\nWorking the “farm line” — compulsory work for pennies an hour, monitored by gun guards armed with an AR-15 and a pistol, at the site of a former plantation, often in sweltering heat — potentially risks their lives and traumatically evokes slavery, plaintiffs contend.\nFirst filed in 2023, the case challenges the existence of the \"farm line.\" Via lawyers with groups including Promise of Justice Initiative and Rights Behind Bars, plaintiffs argue the \"farm line\" endangers their physical and psychological health and violates the Eighth Amendment right to be free of \"cruel and unusual\" punishment.\nThe lawsuit brings together two things people in prisons across the country have recently taken issue with in courts: forced labor and rising heat.\nLitigation challenging how incarcerated people are forced to work has gained attention in Alabama and in Colorado. As the climate changes, people in lockups also have fought for air conditioning and other heat mitigation measures.\nLast month, a federal judge in Texas found that heat exposure in its prisons is unconstitutional, though he stopped short of requiring air conditioning. A federal lawsuit pending in Florida raises similar issues.\nIn their testimony and court filings, Angola officials have framed the \"farm line\" operations as crucial — providing fresh vegetables rather than canned counterparts for incarcerated people. They said that shrinking farm crews over the years have left good produce out to rot.\nThey also point to changes in access to sunscreen and shade. Heat alerts are regularly enforced, and people “work at their own pace and break whenever they need,\" testified Roland Sylvester, an assistant warden and 30-year veteran of the field operations at Angola.\nA spokesperson for the Department of Public Safety & Corrections has said the agency would not be making a statement on the \"pending litigation\" at this time.\nThis week's hearing took place for Judge Brian A. Jackson to weigh whether to certify the case as a class action. That would comprise anyone who is or could be assigned to the \"farm line,\" or most people at Angola, plaintiffs say. It also could include a subclass of people with disabilities.\nAs Louisiana’s fierce summer looms, Jackson also is mulling legal requests from the plaintiffs to order new heat protections, including expanding a list of drugs that qualify people for a special heat work status, trimming the heat index threshold at which work must stop and other changes.\nThat would follow commands by the court for various protections last summer, when Jackson wrote in a July order that \"the dangers for incarcerated persons working in high-heat environments on the Farm Line is open and obvious.\"\n‘Some of them give up’\nJust a few dozen people a day are sometimes working in the fields on the \"farm line,\" one corrections official estimated at this week's hearing. About a hundred can go out if counting tasks such as grass cutting.\nFor the people who make up that relatively small group, plaintiffs and their attorneys underscored the notion of choice: how one is assigned to the \"farm line,\" and what happens to keep you there.\nWhen most people arrive to begin serving a sentence at Angola, the \"farm line\" is the initial work assignment they receive after medical clearance and is mandatory for six months, according to an intake manual.\nIt was the first assignment for Damaris Jackson, one of the case plaintiffs, who was permitted to sit with his lawyers this week only once shackled to a chair in the courtroom. He said working the \"farm line\" can cause people to become irritable, walk in a daze or stop talking to family.\n“I watch my fellow inmates; some of them give up. For me, watching my brothers give up is hard,\" he said.\nRefusing to work on the \"farm line\" can lead to discipline, including being sent to solitary confinement — known colloquially as \"the dungeon” — where Jackson said people in other cells cry out and are sometimes Maced by guards.\nMeanwhile, master sergeant Orlando Scott, who currently works in \"shakedown\" at Angola but spent years as a field foreman, portrayed people in prison as malingering to evade work. He said they sometimes lie about whether they have a special heat-precaution status.\n“They always complain about the work,\" he said.\nAngola staff members did not deny that people could face discipline for infractions on the \"farm line\" and other assignments, including for disobeying orders or not working with appropriate speed and efficiency.\nThey also did not dispute the presence of gun guards on the \"farm line,\" whose attendance is recorded on a sheet next to the line, “gun guard,” official paperwork displayed in court showed. Should they see someone attempt to leave a secured area, their policy is to first fire \"a warning shot\" to get the attention of other staff, Sylvester said.\nHe said he had both seen those shots and fired them himself. The institution's policy is next to shoot to disable, he confirmed in response to a lawyer's questioning.\nJoshua Sbicca, a sociology professor hired as an expert by the plaintiffs, said at the hearing that what happens at Angola is out of step with contemporary correctional institutions, according to his observations and his national research on prison agricultural programs.\nHe drew parallels with the hierarchical structures at chattel slave plantations, where field work was the lowest-status role, and the \"farm line\"s apparent function as a form of discipline.\n“If you do something wrong, you can be put out in a set of work conditions that are generally agreed to be the worst,\" he said.\n‘I never had shade’\nSince the \"farm line\" lawsuit was first filed, Louisiana's prison system has made changes to address some of the heat issues, according to court testimony and legal filings.\nThat includes significantly revising lists of health conditions and medications that could qualify someone for special heat precautions. Attorneys for the plaintiffs have been critical of the drug list, particularly noting the omission of SSRI antidepressants.\nAndrew Blanchfield, a Baton Rouge attorney representing Louisiana's prison system in the case, showed the court a prototype of a shade pavilion with running water and fans. There are plans to build six more of them, and mobile shade wagons now are being sent to the fields.\nPeople in poor health are not being put on the \"farm line,\" but \"there’s some 65-year-olds that are plenty healthy to be out there picking cucumbers,\" he told the court.\nOther changes have moved in the opposite direction than the shade wagons. Last year, a 2018 policy applying to DOC facilities was modified, raising the threshold for \"heat alerts\" to be issued from a heat index of 88 to 91 degrees.\nJones, one of the incarcerated men, acknowledged the movement and improvement to some conditions over the last year. He appeared to get choked up on the witness stand as he described \"dramatic\" differences.\n“I never had a seat except for the ground. I never had shade except for the corn and the okra. That was the only shade that was provided,\" he said.\nNext steps\nA decision on the cases' class-action status is unlikely before at least June, when legal briefs from attorneys are due. It's unclear when the judge may decide on a request for emergency heat protections, like those from last year.\nWhile the case unfolds, work continues at Angola, which houses more than 4,000 people tucked away in a corner of tiny West Feliciana Parish.\nBy definition, there are necessarily fewer opportunities for attorneys, experts and reporters to conduct observations at a prison than would be possible in a more public-facing work site. Much of what happens on the “farm line” on a daily basis remains out of view to most people.\nThat even appears true for experts the state hired to help defend the case. One medical professional with ties to beleaguered correctional health giant Wellpath was enlisted by the Louisiana prison system to redevelop its heat-protection health condition list.\nHe said during the hearing that he toured several medical and other units at Angola but ultimately observed work at the \"farm line\" for less than an hour during his visit, and did not interview any incarcerated people.\nJackson, the federal judge, said he was committed to visiting the \"farm line\" himself to assess conditions there. But he cautioned an \"unannounced\" visit requested by the plaintiffs might not be possible, because of security measures required for a federal judge's visit to a prison.\nHe remains \"cognizant\" of the urgent issues in the case, he told attorneys.\nA few floors down from Jackson's courtroom, a historical display in the entryway to Russell B. Long Federal Building and U.S. Courthouse said the complex stands on the same land that once held Louisiana's state penitentiary before the prison moved to Angola around 1917.\nBlack and white photographs showed incarcerated people in a clothing factory and working to make shoes. A crumbling brick sat behind a glass panel.\n\"The convicts made these bricks by hand,\" a sign read.\nThis story was produced by the Gulf States Newsroom, a collaboration between Mississippi Public Broadcasting, WBHM in Alabama, WWNO and WRKF in Louisiana and NPR."
    },
    {
      "url": "https://www.dhs.gov/news/2025/08/05/speedway-slammer-new-partnership-dhs-and-state-indiana-expand-detention-space",
      "text": "Following Alligator Alcatraz, this marks the second state partnership to expand ICE detention space\nWASHINGTON – Today, the Department of Homeland Security (DHS) announced a new partnership with the state of Indiana to expand ICE detention space by 1,000 beds. U.S. Immigration and Customs Enforcement (ICE) is partnering with the Indiana Department of Corrections and these beds will be available at the Miami Correctional Center. The Speedway Slammer will house some of the worst of the worst criminal illegal aliens arrested by ICE.\nThis agreement was made possible by the One Big Beautiful Bill. This law fully funded the 287(g) program and provided funding to secure 80,000 new beds for ICE to utilize when detaining and deporting the worst of the worst.\n“COMING SOON to Indiana: The Speedway Slammer. Today, we’re announcing a new partnership with the state of Indiana to expand detention bed space by 1,000 beds,” said Secretary Noem. “Thanks to Governor Braun for his partnership to help remove the worst of the worst out of our country. If you are in America illegally, you could find yourself in Indiana’s Speedway Slammer. Avoid arrest and self deport now using the CBP Home App.”\n“We are proud to work with President Trump and Secretary Noem as they remove the worst of the worst with this innovative partnership,” said Indiana Governor Mike Braun. “Indiana is taking a comprehensive and collaborative approach to combating illegal immigration and will continue to lead the way among states.”"
    },
    {
      "url": "https://www.usatoday.com/news/politics/kristi-noem/",
      "text": "Clues emerge about Minneapolis shooter. What do they tell us?\nCrime\n'Breaks my heart': Minneapolis community mourns after deadly shooting\nNation\nFate of Kilmar Abrego Garcia's deportation headed back to federal judge\nNation\n'South Park' makes schedule changes for September episodes\nTV\nJailed trucker puts spotlight on Trump immigration policy\nNation\nFEMA staff tell Congress Trump officials risk Katrina-level disaster\nPolitics\nAbrego Garcia released from jail\nNews\nAbrego Garcia released from jail as deportation case continues\nNation\nTrump says 2026 World Cup draw to be held at Kennedy Center\nWorld Cup\nA look inside Alligator Alcatraz – and how it could be copied near you\nGraphics\nNew 'South Park' goes to White House to brutally mock Trump\nTV"
    },
    {
      "url": "https://www.usatoday.com/news/politics/pam-bondi/",
      "text": "Don't fall for Trump's trap. He can't criminalize flag burning.\nColumnists\nMaybe you can't indict a ham sandwich? What happened to DC sub thrower\nPolitics\n¿Quién es 'El Mayo' Zambada y por qué se declaró culpable en EE. UU.?\nNews\nThis state eliminated cash bail. Did it make crime better or worse?\nNation\nIs flag burning protected speech? What to know about Trump's order\nPolitics\nThe end of bail reform? Trump orders cash bond for anyone who's arrested\nPolitics\nTrump wants a year in prison for flag burners. Is that legal?\nPolitics\nChris Christie says Ghislaine Maxwell's praise of Trump is phony\nPolitics\nDOJ releases transcripts, audio of interviews with Ghislaine Maxwell\nPolitics\nTrump on Epstein file release: 'Innocent people shouldn't be hurt.'\nPolitics\nFed’s Cook faces Trump firing threat over mortgage allegations\nMoney"
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/23/texas-army-base-japanese-internment-ice-detention/85767850007/",
      "text": "Army base used for WWII Japanese internment will be nation's largest ICE detention center\nStewards of Japanese American history are calling out the use of Fort Bliss to detain immigrants.\nFORT BLISS, TX – Americans of Japanese heritage say they hear echoes of their families' forced internment in the Trump administration's newest immigrant detention site.\nHomeland Security officials say President Donald Trump's sweeping mass deportation campaign requires a build-up of detention centers to bridge the gap between arrests and removals. They've turned to the U.S. military and private contractors to get the job done, including erecting the nation's largest immigrant detention site on Fort Bliss in El Paso, Texas.\nBut stewards of Japanese American history, including the children and grandchildren of those who were held in detention, are criticizing the use of Fort Bliss and the plans to expand immigrant detention on American military bases.\nFort Bliss was a \"cog\" in the United States Japanese internment machine, said Brian Niiya, a historian and content director at Densho, a nonprofit that chronicles Japanese American internment.\nNiiya's own grandfather, the managing editor of a Japanese language newspaper, was arrested the night of Japan's Pearl Harbor attack, on Dec. 7, 1941, in Honolulu and held in six different internment camps over the next two years.\n\"It’s important to look to this past to maybe try to understand what’s going on in the present and what the end results could be,\" he said.\nDHS: Detaining the 'worst of the worst'\nThe Fort Bliss facility, known locally as Camp East Montana, rises like a white tent city on a flat desert plain. It falls within the confines of the military base but is visible from El Paso's bustling Montana Avenue and sits adjacent to an unmarked building that is the local headquarters of U.S. Immigration and Customs Enforcement.\nAt a cost of $1.2 billion, the camp has the capacity to detain 5,000 people. Roughly 1,000 men were being held there in mid-August, according to U.S. Rep. Veronica Escobar, an El Paso Democrat whose district includes Fort Bliss.\nTricia McLaughlin, assistant secretary for public affairs at the Department of Homeland Security, called comparisons between detention centers for people in the country illegally and World War II internment camps “deranged and lazy.”\n\"The facts are ICE is targeting the worst of the worst – including murderers, MS-13 gang members, pedophiles and rapists,\" she said in a statement.\nA Cato Institute analysis of government data in June found ICE was arresting four times more noncriminals each week on the streets than people with convictions. ICE's own data show that 45% of the roughly 59,000 people in custody in mid-August had no criminal record or charges.\nMike Ishii, executive director and co-founder of Tsuru for Solidarity, an immigrant rights advocacy group, said he sees parallels with the current administration “coming in and removing people from their homes, from their workplaces, often with no explanations.”\nIshii, whose family was held at the Minidoka concentration camp in Idaho, said, “Right now, it's very frightening for people,” he said. “In 1941, it was also frightening.”\n'No accounts of wrongdoing'\nEighty years ago, Fort Bliss housed dozens of people labeled \"alien enemies\" by the government in a detention camp that included two compounds surrounded by double barbed wire fences, according to Densho.\nSmaller numbers of immigrants from Germany and Italy were also sent there after the United States joined the European Allies and declared war against those countries.\nAt least 113 first-generation Japanese Americans were shipped to the base before being sent to other holding areas across the country, according to records compiled by Ireizō, a nonprofit database of Japanese Americans held in internment.\nThe people detained at Bliss were immigrants. They would be the first in the eventual internment of over 125,000 Japanese Americans across the country, most of them U.S. citizens.\nFor the vast majority, \"there were no accounts of wrongdoing other than being seen as 'enemy aliens,'\" said Karen Umemoto, director of the Asian American Studies Center at the University of California, Los Angeles.\nThe 1798 Alien Enemies Act\nAfter Japan attacked Pearl Harbor, the American government viewed Japanese immigrants and Japanese Americans as potential traitors, Umemoto said. President Franklin Delano Roosevelt immediately invoked the 1798 Alien Enemies Act to detain people and confiscate their property.\nTrump invoked the same law this year to designate some immigrants as \"alien enemies\" and target them for rapid deportation. The Supreme Court has blocked him on certain removals.\nThe Biden administration also used Fort Bliss to house migrants who crossed the border as unaccompanied children.\nUnder Biden, the Fort Bliss \"emergency intake site\" run by a private contractor was used to process the children for admission into the United States – not for deportation. Still, survivors and descendants of Japanese internment staged a protest at the facility in 2021 to call attention to the poor conditions there, including problems related to child safety and case management that were later documented in a 2022 federal report.\nAsked about the base's history of internment, the Pentagon referred USA TODAY to an Aug. 7 news briefing in which spokeswoman Kingsley Wilson said Fort Bliss would \"be the largest federal detention center in history for this critical mission, the deportation of illegal aliens.\"\nLearning lessons from history\nAt midday on Aug. 21, construction and passenger vehicles came and went from the Fort Bliss camp. Puffy, storybook clouds hung in a pale blue sky.\nThere was no signage on the road to announce the facility, other than warnings affixed to plywood: \"All vehicles subject to search. No cameras, cellphones or video recorders allowed.\"\nAs historians, Niiya said, \"We always used to say that it's important to know this (history) so that we can prevent things from ever happening again… But perhaps we can't say that anymore.\""
    },
    {
      "url": "https://www.usatoday.com/story/sports/motor/indycar/2025/08/07/indiana-speedway-slammer-ice-indycar-homeland-security/85566941007/",
      "text": "IndyCar dragged into controversy with Trump administration's ICE car, 'Speedway Slammer'\nAbout 70 miles north of the Indianapolis Motor Speedway, home of the Indianapolis 500, a new immigration detention center got a noteworthy and controversial name.\n“The Speedway Slammer’’ is what the Trump administration is calling it.\n“COMING SOON to Indiana: The Speedway Slammer,’’ Kristi Noem, Secretary of the Department of Homeland Security, wrote on her X account Aug. 5. “Today, we’re announcing a new partnership with the state of Indiana to expand detention bed space by 1,000 beds.’’\nIn her post, Noem also thanked Indiana governor Michael Braun “for his partnership to help remove the worst of the worst out of our country. If you are in America illegally, you could find yourself in Indiana’s Speedway Slammer. Avoid arrest and self deport now using the @CBP.’’\nHomeland Security also issued the image of an Indy car emblazoned with the letters ICE – U.S. Immigration and Customs Enforcement – and No. 5, which belongs to NTT IndyCar Series driver Pato O'Ward, the only Mexican in the Indy 500 and the series this year.\nThe car appears to be driving past a prison.\nO'Ward, who drives for Arrow McLaren, is ranked second in points in the 2025 season and has won two races this year.\nIt wasn’t immediately clear whether the use of the 5 was purposeful to point to O’Ward or if it was just a coincidence. Outside the number, the car lacked any other connections to O’Ward’s traditional black-and-papaya-colored chassis. A spokesperson for Arrow McLaren declined to comment when reached by the Indianapolis Star, part of the USA TODAY Network, regarding the matter.\nBorder Czar Tom Homan, asked about requests not to use the name Speedway, said he didn't know who specifically was behind the name.\n\"I don't want the names [to detract from] the great work they're doing,\" Homan said. “This is serious work and it's dangerous work.\"\nPenske Entertainment, which owns Indianapolis Speedway and the NTT IndyCar Series, provided a statement to The Star in which it said it was unaware of plans to incorporate its imagery as part of the announcement.\n“Consistent with our approach to public policy and political issues, we are communicating our preference that our IP not be utilized moving forward in relation to this matter,’’ Penske Entertainment said.\nRoger Penske, founder and chairman of Penske Corporation, received the medal of freedom from President Donald Trump during Trump’s first term in the White House. Penske Entertainment is a subsidiary of Penske Corporation.\nThe Speedway Slammer joins \"Alligator Alcatraz,'' a detention center in Florida that marked the only other partnership with a state to expand ICE detention capacity.\n“We are proud to work with President Trump and Secretary Noem as they remove the worst of the worst with this innovative partnership,” said Braun, Indiana's governor, said in news release issued by DHS. “Indiana is taking a comprehensive and collaborative approach to combating illegal immigration and will continue to lead the way among states.”\nContributing: Nathan Brown, Indianapolis Star"
    }
  ],
  "argos_summary": "The Trump administration is moving to add the Louisiana State Penitentiary (Angola) as a new ICE detention site, expanding the state’s role in federal immigration enforcement. Angola, a 6,300‑bed maximum‑security prison with a history of harsh conditions, will become the state’s 10th ICE facility. The expansion is part of a broader plan to add 80,000 new detention beds, backed by a $45 billion congressional appropriation, and reflects the administration’s strategy of partnering with Republican‑led states to house and deport migrants far from the border.",
  "argos_id": "ECNKEVDAJ"
}