{
  "url": "https://www.newsweek.com/sports/wnba-star-paige-bueckers-makes-history-recent-honor-2124053",
  "authorsByline": "Matthew Couden",
  "articleId": "b9bb5a85b51c4968a31ed99f6c0eea33",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2690822/paige-bueckers.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T14:56:39-04:00",
  "addDate": "2025-09-03T19:01:05.100314+00:00",
  "refreshDate": "2025-09-03T19:01:05.100316+00:00",
  "score": 1.0,
  "title": "WNBA Star Paige Bueckers Makes History With Recent Honor",
  "description": "Dallas Wings' Paige Bueckers landed among a historic list of players after achieving her latest honor.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nDallas Wings star Paige Buecker continues to receive impressive recognition for her performance as a WNBA rookie.\n\nOn Wednesday, the former No. 1 pick received her third WNBA Rookie of the Month Award, as she recently claimed the honor for August.\n\nFor the month, she averaged 20.3 points, five assists, and 3.7 rebounds a game while shooting 49.7 percent from the field.\n\nIn addition, she set a record for most points scored in a game by a rookie, as she went off for 44 against the Los Angeles Sparks last month.\n\nThe former University of Connecticut star is averaging 18.9 points, 5.3 assists, and 3.8 rebounds per game in her first season in the WNBA.\n\nWith her third WNBA Rookie of the Month Award, she becomes the 10th player in the league's history to have done so. The Washington Mystics' Kiki Iriafen claimed WNBA Rookie of the Month in May 2025, with Paige claiming three-straight.\n\nBased on her stats and monthly award wins, she seems to be the frontrunner for WNBA Rookie of the Year, following in the footsteps of last year's top pick, Caitlin Clark.\n\nPer Basketball Reference, the Indiana Fever star won the Rookie of the Month award four times in 2024, while the Chicago Sky's Angel Reese won it once.\n\nPaige would become only the second Dallas Wings player to claim Rookie of the Year in the league's history, joining 2017 winner Allisha Gray.\n\nBefore her rookie season ends, Paige could make additional history. The WNBA reported that she's just eight points away from surpassing Arike Ogunbowale's record for total points by a rookie player.\n\nAs of this writing, the Wings have the WNBA's worst record overall at 9-32. Their three remaining games are against Golden State, Los Angeles, and Phoenix.\n\nWhile Dallas won't participate in the upcoming playoffs, the team seems on the verge of returning to the postseason behind Paige's contributions.\n\nAlong with that, their record qualifies them to possibly receive one of the top three picks in the next WNBA Draft.\n\nThat could result in the Wings drafting Paige's girlfriend and former UConn teammate, Azzi Fudd, to pair them up in Dallas, depending on how Fudd plays this season in college.\n\nRead more: WNBA Star Cameron Brink Reacts to Fan Criticism After Sparks Return\n\nFor more on the WNBA, head to Newsweek Sports.",
  "medium": "Article",
  "links": [
    "https://www.basketball-reference.com/wnba/awards/rom.html",
    "https://www.newsweek.com/sports",
    "https://www.newsweek.com/sports/wnba-star-cameron-brink-reacts-fan-criticism-after-sparks-return-2121820",
    "https://www.newsweek.com/sports/indiana-fever-get-major-caitlin-clark-injury-update-2123362",
    "https://wings.wnba.com/news/bueckers-earns-third-straight-wnba-rookie-of-the-month-honor"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "WNBA Star Paige Bueckers",
      "weight": 0.121645615
    },
    {
      "name": "WNBA Rookie",
      "weight": 0.12113742
    },
    {
      "name": "WNBA Star Cameron Brink",
      "weight": 0.10852035
    },
    {
      "name": "Dallas Wings star Paige Buecker",
      "weight": 0.10370383
    },
    {
      "name": "WNBA",
      "weight": 0.102460794
    },
    {
      "name": "WNBA Draft",
      "weight": 0.10016738
    },
    {
      "name": "Paige Buecker",
      "weight": 0.081582114
    },
    {
      "name": "Paige Bueckers",
      "weight": 0.08157534
    },
    {
      "name": "Paige",
      "weight": 0.078762524
    },
    {
      "name": "Rookie",
      "weight": 0.07752641
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    },
    {
      "name": "WNBA"
    },
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9892578125
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.97265625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.54248046875
    }
  ],
  "sentiment": {
    "positive": 0.46754703,
    "negative": 0.106954366,
    "neutral": 0.4254986
  },
  "summary": "Dallas Wings player Paige Buecker has made history as a WNBA rookie, earning her third WNBA Rookie of the Month award. This accolade comes after she set a record for most points scored in a game by a rookie by scoring 44 against the Los Angeles Sparks. Bueckers is currently averaging 18.9 points, 5.3 assists, and 3.8 rebounds per game in her first season in the WNBA. She is also eight points away from surpassing Arike Ogunbowale's record for total points by a player.",
  "shortSummary": "Dallas Wings star Paige Buecker made history by winning her third WNBA Rookie of the Month award, setting a record for most points scored in a game, and is poised to win Rookie Of the Year.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cd10f3a515684b738fb7b9bf048f8a9d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/sports/indiana-fever-get-major-caitlin-clark-injury-update-2123362",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nIndiana Fever superstar Caitlin Clark has been sidelined from playing for her team for an extended time since suffering a groin injury in July.\nAs the Fever contend for a playoff spot, fans wonder if and when she'll step onto the court to aid them in their quest for the postseason.\nOn Tuesday, a significant update arrived that could shed light on her return to the hardwood for a WNBA game.\nRead more: Fever Star Lexie Hull Shares Black Eyes Update After Collision in WNBA Game\nThe Fever are scheduled to play the Phoenix Mercury in their next matchup, and are looking to bounce back from a recent loss.\nSo will Clark lace up her sneakers and help lead the charge against the Mercury, or is she still unable to play?\nOn Tuesday, The Indy Star's Chloe Peterson shared an encouraging video featuring Clark on the Mercury's court for practice in Phoenix.\nAccording to Peterson, Clark was \"running with the Fever backups in their full court 5-on-0\" drills.\nThe video clip features the group simulating a rebound and running to the other side of the court to set up their offense. Clark connects on a three-point shot from the side of the circle.\nAs they run back to the opposite side, Clark again sets up outside the three-point arc, but instead of shooting, throws a crisp pass to a teammate for a shot attempt.\nClark suffered her groin injury back on July 15 in the Fever's game against the Sun. That caused her to miss the WNBA All-Star Game, despite being named to the team and getting to choose other players for her lineup.\nAs of July 24, the Fever reported they had not discovered any \"additional injuries or damage\" related to Clark's injury.\nOn August 20, ESPN reported that the WNBA superstar suffered another minor injury while working out.\nDespite Clark practicing, she is listed as out for tonight's game in Phoenix. ESPN estimates she could return on September 7 for the team's away game against the Washington Mystics.\nAs of this report, the Fever (21-19) have only four regular-season games, including that Mystics game and Tuesday night's game in Phoenix.\nIndiana is currently seventh in the WNBA Standings. Eight teams qualify for the postseason, with four already qualified.\nThe Fever are contending for one of the final four spots with the New York Liberty, Golden State Valkyries, Seattle Storm, and Los Angeles Sparks.\nRead more: WNBA Star Cameron Brink Reacts to Fan Criticism After Sparks Return\nFor more on the WNBA, head over to Newsweek Sports.\nIs This Article Trustworthy?\nIs This Article Trustworthy?\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nAbout the writer\nMatt Couden is a sports and entertainment journalist from Virginia covering the NFL, NBA, WNBA, WWE, college athletics, and pop ... Read more"
    },
    {
      "url": "https://wings.wnba.com/news/bueckers-earns-third-straight-wnba-rookie-of-the-month-honor",
      "text": "Bueckers Earns Third Straight WNBA Rookie of the Month Honor\nWed, Sep 3, 2025, 4:51 PM\nDallas Wings guard Paige Bueckers was named the WNBA Rookie of the Month for the third consecutive month. Bueckers becomes the 10th player in WNBA history and first in Wings franchise history to earn the distinction three times. Bueckers led all rookies in scoring and assists in the month of August, punctuated by setting the single-game rookie scoring record.\nThe 6-0 guard averaged 20.3 points and 5.0 assists over 10 games in August, not only leading all first-year players in scoring but listing fourth among all WNBA players. She shot 49.7 percent from the field and 93.6 percent from the free-throw line while adding 3.7 rebounds and 1.2 steals.\nThe month was highlighted by Bueckers’ record-setting performance at the Los Angeles Sparks on Aug. 20. Bueckers scored 44 points to break the WNBA single-game rookie scoring record. She did so by shooting a staggering 80.9 percent from the field, becoming the only player in league history to score 40 or more points while shooting at least 80 percent from the field. Forty-four points are also the most scored by any WNBA player in a game since the 2023 season.\nBueckers enters the final stretch of regular-season games sixth all-time in WNBA rookie scoring and is eight points from the Wings rookie record held by Arike Ogunbowale. She has already broken the franchise rookie assists mark and is seventh in WNBA rookie history in the category. Bueckers continues to lead all rookies in scoring (18.9) and assists (5.3) this season, while listing second in steals (1.58). She remains the only player in the WNBA to rank in the top seven among all players in points (fifth), assists (seventh) and steals (sixth) per game this season."
    },
    {
      "url": "https://www.newsweek.com/sports/wnba-star-cameron-brink-reacts-fan-criticism-after-sparks-return-2121820",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nLos Angeles Sparks star Cameron Brink is still trying to adjust to a significant criticism about her game while playing in the WNBA.\nThe 6-foot-4 Stanford star became the Sparks' No. 2 pick in the 2024 WNBA Draft, with only Caitlin Clark selected ahead of her.\nWhile there were high hopes for her first season, Brink's rookie campaign was cut short last June when she suffered a torn ACL in a game against the Connecticut Sun.\nRead more: Fever Star Sophie Cunningham Gets Honest About Rival Napheesa Collier\nUpon her return to the Sparks this season, she's attempting to help her squad battle for one of the remaining playoff spots with teams including the Washington Mystics, Golden State Valkyries, and Seattle Storm.\nHowever, Brink will need to address the continuing issue she has playing for the Sparks that fans haven't hesitated to point out.\nDuring a recent video interview, CBS Sports' Isabel Gonzalez spoke with Brink about many topics, including critical remarks that fans continue to make about her game.\nGonzalez pointed out that just a few games into Brink's 2025 WNBA return, fans were mentioning her issue with getting into foul trouble, indicating it was a sign she's back.\n\"I don't want anyone to get an and one, so I'm gonna use my fouls,\" Brink said, adding that she's always struggled with that issue.\n\"I'm an aggressive player. I'm still working on it,\" she told Gonzalez.\nHer team recently suffered a 92-84 home loss to the Phoenix Mercury. Brink came off the bench to play 14 minutes in which she scored four points, grabbed five rebounds, dished out two assists, and blocked a shot.\nHowever, she also racked up four fouls during her time on the hardwood. WNBA players are allowed just five fouls before fouling out of games.\nBrink has appeared in just eleven games this season, averaging 5.6 points, 4.3 rebounds, and 1.6 blocks per game. She's averaging 2.6 fouls per game, which is lower than her career average of 3.4 per game.\nIn fairness, Brink has only 26 games of WNBA experience due to her injury and recovery, cutting her rookie and sophomore seasons short.\nAs of this writing, the Sparks are 17-19, but have yet to claim a playoff spot. They'll take on the Connecticut Sun, a very beatable team, in a game in Los Angeles on Friday evening.\nThat is one of eight games left for Brink's team as they continue their push for the playoffs. She'll just need to ensure she remains healthy and abstains from fouling out if she wants to help the Sparks reach the postseason and succeed.\nRead more: WNBA Star Angel Reese Gets Eye-Opening Ranking on Players List\nFor more about the WNBA, head over to Newsweek Sports.\nIs This Article Trustworthy?\nIs This Article Trustworthy?\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nAbout the writer\nMatt Couden is a sports and entertainment journalist from Virginia covering the NFL, NBA, WNBA, WWE, college athletics, and pop ... Read more"
    },
    {
      "url": "https://www.newsweek.com/sports",
      "text": "U.S.\nWorld\nScience\nHealth\nLife\nRankings\nOpinion\nEntertainment\nFact Check\nMy Turn\nEducation\nEvents\nSports\nPodcasts\nBetter Planet\nBetter Workplaces\nVault\nMightier\nAutos\nNewsletters\nUnconventional\nVantage\nExperts\nVoices\nSubscribe\nLogin\n×\nSubscribe\nLogin\nU.S.\nWorld\nScience\nHealth\nLife\nRankings\nOpinion\nEntertainment\nFact Check\nMy Turn\nEducation\nEvents\nSports\nPodcasts\nBetter Planet\nBetter Workplaces\nVault\nMightier\nAutos\nNewsletters\nUnconventional\nVantage\nExperts\nVoices\nHome\n>\nSports\nSports\nFootball\nNFL\nBasketball\nNBA\nBaseball\nMLB\nRacing\nFormula1\nNascar\nBetting\nBetting\nNBA Breaks Silence on Bombshell Kawhi Leonard, Clippers Report\nLatest News\nAEW Officially Announces First PPV on HBO Max\nAEW Officially Announces First PPV on HBO Max\n2025 NFL Season Predictions: Division Winners, Team Records, Playoffs, More\nBears WR Prediction is Fantastic News for Caleb Williams\nCubs Sign Legendary MLB Speedster to Out-of-Nowhere Minor-League Deal\nRavens Rookie Lands Head-Turning Prediction After NFL Draft Slide\nLatest News\nRed Sox's Roman Anthony Offers 2-Word Response on Brutal Injury News\nSteelers' Aaron Rodgers Shuts Down Question on Revenge Game Against Jets\nFever Star Aliyah Boston Wants to See Major WNBA Rule Change\nFans Voice Concern Ahead Of AJ Lee's Expected WWE Return\nNFL\nFormer Patriots Super Bowl Champion Safety Announces Retirement\nPatriots Listed as Potential Suitor for Disgruntled Receiver\nJordan Love Tabbed Packers' Weakest Link by NFL Executive\nFans Are Up in Arms Over Controversial NFL RedZone Change\nJulian Edelman Drops Hard Reality Check On Patriots' AFC East Chances\nNBA\nSee More\nBombshell Kawhi Leonard Report Causes Old Clippers Tweet to Resurface\nLakers' LeBron James Gets Massive Retirement Prediction\nNBA Insider Provides Major Update On Cam Thomas' Free Agency\nRecent Knicks Draft Pick Out Indefinitely After Massive EuroBasket Injury\nMavs' Klay Thompson Reveals Big Plans After NBA Retirement\nMLB\nSee More\nCould Bo Bichette Ditch Blue Jays for Different American League Contender?\nRed Sox to Place Star on Injured List With Possible Season-Ending Injury\nFree Agency Idea Sees Dodgers Replace Mookie Betts With Blue Jays All-Star\nJuan Soto Wants to Accomplish This Feat for First Time in Mets History\nWorld Series Champion Shreds Astros Pitcher For 'Scumbag Move'\nRacing\nSee More\nFerrari F1 Drops Jaw-Dropping Anniversary Livery Ahead of Italian GP\nDenny Hamlin Sparks Controversy Over Connor Zilisch's Win in Portland\nDale Earnhardt Jr. Predicts NASCAR Playoffs Eliminations\nMercedes F1 Chief Nearly Faced 'Dreaded' Lewis Hamilton Decision\nLewis Hamilton's Dutch GP Was \"Tragic\" Amid His Massive Crash, Expert Says\nGolf\nSee More\nRyder Cup Dreams Crushed for These Team Europe Roster Snubs\nSergio Garcia Breaks Down After Ryder Cup Snub, Withdraws From Irish Open\nRyder Cup: European Team Changes From 2023, But It Still Looks the Same\nDonald Defends Controversial Ryder Cup Pick: 'He's Playing Tremendous Golf\nBruins' Nikita Zadorov Makes Headlines With First Hole-in-One at The Park"
    }
  ],
  "argos_summary": "Dallas Wings guard Paige Bueckers has earned her third consecutive WNBA Rookie of the Month award for August, averaging 20.3 points, 5 assists, and 3.7 rebounds while shooting 49.7% from the field. She set a rookie scoring record with 44 points against the Los Angeles Sparks and is now eight points shy of the all‑time rookie scoring record. Bueckers is a frontrunner for Rookie of the Year and could help lift the Wings, who currently sit at a 9‑32 record, toward a better draft position.",
  "argos_id": "EG1YO0ZDM"
}