{
  "url": "https://techxplore.com/news/2025-09-robot-bulky-humans-lesson.html",
  "authorsByline": "Paul Arnold",
  "articleId": "f2284e56c4704514a88291b4e914aac9",
  "source": {
    "domain": "techxplore.com",
    "location": null
  },
  "imageUrl": "https://scx2.b-cdn.net/gfx/news/hires/2025/a-robot-learns-to-hand.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T11:20:01-04:00",
  "addDate": "2025-09-03T15:24:33.292764+00:00",
  "refreshDate": "2025-09-03T15:24:33.292765+00:00",
  "score": 1.0,
  "title": "A robot learns to handle bulky objects like humans do after just one lesson",
  "description": "For all their technological brilliance, from navigating distant planets to performing complex surgery, robots still struggle with a few basic human tasks. One of the most significant challenges is dexterity, which refers to the ability to grasp, hold and manipulate objects. Until now, that is. Scientists from the Toyota Research Institute in Massachusetts have trained a robot to use its entire body to handle large objects, much like humans do.",
  "content": "This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility:\n\nFor all their technological brilliance, from navigating distant planets to performing complex surgery, robots still struggle with a few basic human tasks. One of the most significant challenges is dexterity, which refers to the ability to grasp, hold and manipulate objects. Until now, that is. Scientists from the Toyota Research Institute in Massachusetts have trained a robot to use its entire body to handle large objects, much like humans do.\n\nWe use a variety of skills to pick up and manage objects, from small, precise hand movements to large-muscle movements involving the arms, legs and trunk (gross motor skills). Robots find these larger movements difficult, such as lifting and holding onto a large box, because they require constant, complex adjustments to prevent the object from fumbling or dropping.\n\nIn a study published in the journal Science Robotics, the research team demonstrated how a humanoid upper-body robot, named Punyo, was able to move a large water jug onto its shoulder. It could also pick up and hold onto a large box. To guide its movements, the robot relied on feedback from its soft, pressure-sensing skin and joint sensors.\n\nThe key to the robot's success was the softness of its body (passive compliance) and the flexibility programmed into its joints (active compliance). When compared to a rigid version of the robot, it performed much better. \"Adding any type of compliance (that is, passive, active, or both) is beneficial, showing an increase of 206% in the success rate on average compared to no compliance,\" the scientists wrote.\n\nWhat's more, the robot required minimal learning. The researchers taught Punyo using a method called example-guided reinforcement learning. They showed it what to do with just one demonstration in a virtual environment, and then it practiced on its own until it figured out how to do it. \"A single teleoperated demonstration collected in simulation is sufficient to train policies for stylized, contact-rich motions,\" the research team added.\n\nThis technology is a significant step toward creating robots that can be even more helpful in our daily lives. For example, they could safely and reliably move large, unwieldy objects, such as furniture in the home or heavy packages in a warehouse. They could even help with tasks in a care setting, such as assisting people with mobility challenges. And the robots wouldn't need to be meticulously programmed. Instead, they would be able to learn human-like skills from just a single demonstration.\n\nWritten for you by our author Paul Arnold, edited by Gaby Clark, and fact-checked and reviewed by Robert Egan—this article is the result of careful human work. We rely on readers like you to keep independent science journalism alive. If this reporting matters to you, please consider a donation (especially monthly). You'll get an ad-free account as a thank-you.\n\nCitation: A robot learns to handle bulky objects like humans do after just one lesson (2025, September 3) retrieved 3 September 2025 from https://techxplore.com/news/2025-09-robot-bulky-humans-lesson.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
  "medium": "Article",
  "links": [
    "https://www.science.org/doi/10.1126/scirobotics.ads6790",
    "https://sciencex.com/help/editorial-team/",
    "https://techxplore.com/tags/compliance/",
    "https://techxplore.com/journals/science-robotics/",
    "https://dx.doi.org/10.1126/scirobotics.ads6790",
    "https://techxplore.com/tags/virtual+environment/",
    "http://robotics.sciencemag.org/",
    "https://techxplore.com/tags/robot/",
    "https://sciencex.com/donate/?utm_source=story&utm_medium=story&utm_campaign=story",
    "https://sciencex.com/help/editorial-team/#authors"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "large objects",
      "weight": 0.09006186
    },
    {
      "name": "Robots",
      "weight": 0.08330624
    },
    {
      "name": "robots",
      "weight": 0.08330624
    },
    {
      "name": "bulky objects",
      "weight": 0.074097335
    },
    {
      "name": "objects",
      "weight": 0.06851106
    },
    {
      "name": "passive compliance",
      "weight": 0.05858188
    },
    {
      "name": "active compliance",
      "weight": 0.05674209
    },
    {
      "name": "Science Robotics",
      "weight": 0.05191635
    },
    {
      "name": "research",
      "weight": 0.051799525
    },
    {
      "name": "large, unwieldy objects",
      "weight": 0.051223807
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.93408203125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.7685546875
    }
  ],
  "sentiment": {
    "positive": 0.41164386,
    "negative": 0.13581204,
    "neutral": 0.45254403
  },
  "summary": "Scientists from the Toyota Research Institute in Massachusetts have trained a humanoid upper-body robot to handle large objects like humans do. The robot, named Punyo, was able to move a large water jug onto its shoulder and also hold onto a large box. The key to the robot's success was its softness and flexibility, compared to a rigid version of the robot. The researchers used example-guided reinforcement learning and demonstrated Punyo using a virtual environment before it learned how to handle the large objects. This technology could lead to robots that can be more helpful in our daily lives, potentially assisting people with mobility challenges.",
  "shortSummary": "Scientists at the Toyota Research Institute trained a humanoid to handle large objects like humans using minimal learning, advancing human-like capabilities and accuracy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "acd5e6567e234e9abaf4317466f57396",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://sciencex.com/help/editorial-team/",
      "text": "Science X editorial team\nOur publishing is operated by a completely in-house team\nStephanie Baum\nscientific editor\nStephanie holds a Master's degree in TESOL from The New School in New York, and joined Science X in 2021. She is passionate about cooking, language learning, linguistics, and editing. Stephanie loves to read and edit articles detailing discoveries across the sci-tech realm, especially those involving biology and space exploration. In addition to her work at Science X, she has written numerous patient education articles on topics within medicine and dentistry.\nGaby Clark\nscientific editor\nGaby has an MA in English and has been copy editing since 2021. Her early copy editing career involved working with higher education and health content. The pandemic showed her the power of reliable and trustworthy science news, and she now enjoys how she contributes in her copy editing role at Science X. Gaby is native to east coast USA and enjoys watching thriller series from around the globe.\nRobert Egan\nassociate editor\nRobert had to live in 11 cities and three countries before finding a place that felt like home (he's a picky guy and that's probably why he enjoys being an editor). In addition to a bachelor's degree in mathematical biology and a master's degree in creative writing, Robert possesses a small street dog with a large overbite who likes to hunt crabs on the beach.\nOwen Ferguson\nscientific editor\nOwen began editing technical work for lay audiences in 1998, working for the Toronto Star newspaper before becoming a full-time freelancer. He attended Ryerson Polytechnic University's journalism program before graduating with a Bachelor's of Independent Studies in forensic database architecture from the University of Waterloo. Owen has been copy editing for Science X since 2020.\nSadie Harley\nscientific editor\nSadie began her working life in a microbiology lab for a major pharma company. She holds a BSc (Hons) in Life Sciences & Ecology and began her editing career in pharmaceutical news, specializing in cardiovascular disease, CNS and anti-infectives. She has also worked within the oil and gas and renewable industries. In recent years, she returned to her interest in medical research, working on clinical trial documents. Sadie was very happy to join the Science X team in 2023 and is wowed on a daily basis by the content she works on.\nLisa Lock\nscientific editor\nLisa is a content and copy editor with backgrounds in the arts and medicine. She has a B.A. in art history and an M.A. in material culture. During her diverse career, she has been a publications editor in a decorative arts museum, an emergency paramedic, and an organ transplant coordinator. She has an eye for fine detail, a passion for grammar, and dedication to life-long learning. She has been editing for Science X since 2021.\nChristopher Packham\ncontent editor\nChris has written and edited for newspapers and alt newsweeklies since 2003, including the Kansas City Star, The Pitch and the Village Voice. He has been copyediting and occasionally writing for Science X since 2013. He lives in Brooklyn, New York, with his spouse and two dogs.\nAlexander Pol\ndeputy editor\nAlex holds a Ph.D. in nano-engineering from Delft University of Technology in the Netherlands. He is an author and co-author of numerous scientific publications. Alex served as a reviewer for various peer-reviewed scientific journals before launching his career in scientific journalism. Science X values Alex's thoughtful and careful scientific insight in developing policy and creating standards for content.\nAndrew Zinin\nlead editor\nAndrew has a life-long interest in scientific news. As a youth he contributed science and technology news to local school magazines. Andrew achieved a Master's degree in physics with post-graduate work as a research assistant for five years, conducting scientific research. Throughout his career he has never forgotten the thrill and excitement of capturing the dreams of a young child through scientific discovery. Andrew is an accurate editor whose earnest efforts and youthful zeal play a major part in the success of Science X.\nJohn Benson\nhonorary editor\nJohn joined Science X in 2006 and his guidance was invaluable in creating reliable and trustworthy science and technology stories for Science X.\nContributing authors\nCharles Blue\nCharles has more than 35 years of experience as a science writer. His primary fields of interest include geophysics, astrophysics (with a focus on radio astronomy), and engineering. If all goes according to plan, he will complete his PhD in science writing in 2026. He is a regular panelist at fandom and science fiction conventions. When the workday is done, Charles is often found playing tenor banjo at Irish music jam sessions.\nKrystal Kasal\nKrystal is a freelance science and technical writer with a Master's degree in physics from Washington State University. She has been doing freelance work for the last five years, but also has experience working in clinical research, writing educational physics content, and helping to create an ontology for a software company. She enjoys writing about science, nature, health, and anything a little bit out of the ordinary.\nIngrid Fadelli\nIngrid is a freelance journalist and science enthusiast with a BSc in Psychology and an MA in International Journalism, both from City, University of London. She regularly writes articles for numerous online publications, media websites, and research outreach companies. Her primary interests include artificial intelligence, robotics, psychology, neuroscience, environmental science, and astrophysics. Ingrid started writing for Science X in 2018 and now covers a wide range of research-based topics.\nPaul Arnold\nPaul is a versatile freelance writer with a passion for scientific endeavors and discoveries. Although he graduated from the University of London with a BSc in Biology, he decided the life of a scientist wasn't for him. So he joined the British Broadcasting Corporation (BBC), where he wrote and produced science and medical documentaries for national and international audiences. He traveled the world interviewing fascinating scientists, including research teams in Antarctica and the Canadian High Arctic. After more than ten happy years at the corporation, he left to pursue a freelance writing career. He also waved goodbye to the UK and relocated to sunny southern Spain. When he's not working, you'll find him enjoying long walks by the sea.\nHannah Bird\nHannah Bird possesses a PhD in Earth Sciences, primarily focused on oceanography, climatology and palaeontology. She specialises in terrestrial and marine flora and fauna responses to past global warming events and their implications for future climate change, including her research on the oldest known amphibian footprints in the UK, which was widely covered in national and global media. Hannah is a freelance editor and content creator, with over 10 years of experience translating complex scientific principles into mainstream print and digital media for Earth Science Journals (including the Geological Curator and Palaeontologica Electronica), the Palaeontological Association's newsletter, and the Geological Society of London's Geoscientist Magazine.\nTomasz Nowakowski\nTomasz is a long-time space enthusiast and amateur astronomer. He founded and managed Astro Watch for nearly a decade - one of the premier astronomy and science-related blogs. Tomasz has been freelancing since 2011, writing for many media outlets, including SpaceFlight Insider, Science 2.0, Space Coast Daily, From Quarks to Quasars.\nDelthia Ricks\nDelthia Ricks is an award-winning science writer and author. Her stories have been published in a variety of newspapers and magazines, including Newsday where she was a staff writer; Discover Magazine; the Journal of the National Cancer Institute; Genetic Engineering and Biotechnology News, and numerous other publications. She additionally has written four books, the most recent, 100 Questions and Answers About Coronaviruses. Ricks is a graduate of the University of California, Los Angeles where she received a B.A. in English with a minor in Biology; She has an M.A. in English from Columbia University in New York and an M.S. in Biology from the University of Bridgeport in Connecticut. Ricks has completed additional postgraduate work in the (tropical) infectious diseases program at the London School of Hygiene and Tropical Medicine.\nThamarasee Jeewandara\nThamarasee Jeewandara, Ph.D., is a researcher and science writer with a Doctorate in Medicine and Bioengineering from the University of Sydney, Australia. She has multi-disciplinary Postdoctoral research experience as a research scientist in biochemistry, plasma physics, genetics, bone tissue engineering, paleontology, cell dynamics and organ-on-a-chip technologies broadly within the U.S and internationally. Thamarasee enjoys travelling, reading/writing, the theatre and fine arts.\nPeter Grad\nPeter Grad was a reporter, columnist and editor at newspapers in his hometown of the Bronx; Meriden, Conn., and then (for 32 years) in New Jersey at The Record. He was the Op-Ed Page editor at The Record for 18 years and also contributed a weekly computer column beginning in the nineties under the titles \"The Computer Tutor\" and \"The PC Guy.\"\" He designed a prototype for a video- and audio-enhanced online multimedia newspaper for The Record years before that became the norm for the nation's leading papers. Peter and his wife, Rose, recently moved to Cary, North Carolina. He misses Zabar's, Levain cookies, Central Park, Prince Street Pizza and Manhattan's cool rock and blues venues. He doesn't miss the traffic or the snow.\nJustin Jackson\nJustin has been covering science news as a host of This Week in Science (TWIS podcast) since 2004. The weekly program brings a slightly irreverent, yet fervently pro-science perspective to recent research across all scientific subjects. While he has previously worked in biotech research labs running fermentation experiments and in genomics labs running next-generation sequencers, Justin’s first love of science is in communicating the stories to a wider audience. Justin joins the Science X team after many years of being an avid reader and fan of their publications.\nTejasri Gururaj\nTejasri is a freelance science writer/journalist with an MS in Physics. She explores diverse scientific disciplines and enjoys research-driven writing. When not at her keyboard, you can find her in front of the TV with her feline companions, eating delicious food, or napping.\nSandee Oster\nSandee is an archaeology PhD candidate at the University of the Witwatersrand, where my research focuses on the relationship between humans and animals throughout history, particularly during the 8.2k event in South Africa. As a science writer for Science X since 2024 and an archaeology blogger on Medium, I transform complex archaeological concepts into engaging narratives that captivate broad audiences. With extensive field experience across South Africa and published research, I am committed to making archaeology not just informative but engaging and accessible, sharing my passion for uncovering the stories hidden in the landscapes of our past. When I'm not in the field or writing, you'll find me buried in a book, spending time with animals, or completely absorbed in documentaries for hours on end.\nSanjukta Mondal\nSanjukta Mondal is a freelance science journalist and communicator with a Master’s in Chemistry. She is on a mission to decode the complex world of science writing, one article at a time,powered by coffee and her curiosity for the extraordinary stories behind ordinary things. Her words have appeared on Chemistry World, BioSpace and The Hindu. When she's not crafting stories, you'll find her exploring new worlds through the lens of her camera and the words of a book.\nBob Yirka\nBob Yirka has always been fascinated by science and has spent large portions his life with his nose buried in textbooks or magazines; he has Bachelor of Science Degree in Computer Science and a Master of Science in Information Systems Management. He's worked in a variety of positions in the telecommunications field ranging from help desk jockey to systems analyst to MIS manager. Recently, after nearly twenty years in the business, he's decided to move to what he really loves doing and that is writing. In addition to writing for Science X, Bob has also sold several short-stories and has written three novels.\nLisa Zyga\nLisa graduated from the University of Illinois at Urbana-Champaign with a Bachelor of Arts degree in rhetoric in 2004. She subsequently completed a science writing internship at Fermilab, followed by a communications internship at Caterpillar. Since then, she has been writing in a freelance capacity for a variety of science, technology, and other publications. Lisa began writing for Science X in 2005, providing engaging and interesting editorials about scientific developments. Lisa‘s stimulating and accurate science and technology articles have made her very popular among Science X readers.\nStuart Mason Dambrot\nAs a Consilientist, Mr. Dambrot analyzes deep-structure interconnections between multiple areas of knowledge and creativity, focus on the synthesis of a precise conceptual language that communicates the common neocortical foundations of human intellectual expression. As a Futurist, Mr. Dambrot identifies, monitors, and extrapolates convergent and emergent trends in a wide range of areas, including computing, communications, energy, neuroscience, nanotechnology, biotechnology, synthetic biology, molecular electronics, artificial intelligence, robotics, quantum computing and communications, and quantum neurobiology. Mr. Dambrot speaks and writes about a wide range of topics, many of which are covered in his blog Critical Thought. He has written for Science X, MedicalXpress.com, Nature, Science, Nature Biotechnology, New Scientist, Scientific American, IEEE Spectrum, Electronics, Columbia University 21stC, Economist, Financial Times, International Herald Tribune, Japan Times, EE Times, Photonics Spectra, ChemicalWeek. Mr. Dambrot holds a degree in Physiological Psychology.\nJohn Hewitt\nJohn's background is physics and neuroscience. He worked in industry for many years in a variety electrical and mechanical engineering roles. He also ran CRE precision, a machine shop specializing in the design of biomedical instruments, for 10 years. He sold the business in 2012 to pursue the goal of full time science reading, and has been able to find gainful employment writing in the fields of neuroscience, cell biology, and general technology.\nLaura Mgrdichian\nLaura is a physical sciences writer, covering physics, nanoscience, astronomy/astrophysics, and materials science for Science X. She began her career as a reporter covering local events on Long Island, New York and later worked at Brookhaven National Laboratory and the National Institute of Standards and Technology. She has been freelancing since 2005. She has B.S. degree in physics from Stony Brook University and currently lives near Boston, Massachusetts. Laura's association with Science X began in 2006. Believing wholeheartedly that 'the devil is in the detail', Laura creates accurate and thought-provoking science articles.\nJohn Messina\nAfter a 35-year professional career in the telecommunications industry, John's second-life career began in 2006. He has flourished as a freelance writer for various websites. John's passion is researching and writing electronic technology and science stories. He graduated from RCA Institutes in 1970 with an Associate Degree in electronic technology. John knows his stuff and readers appreciate his practical insights.\nLin Edwards\nLin has a Bachelor's degree in Chemistry/Biochemistry from the University of Sydney, and a Diploma in Freelance Journalism from the Australian College of Journalism. After many years as a technical writer, writing mainly in fields such as chemistry, electronics, heavy engineering, RFID, robotics, and lasers, Lin decided to return to university and has just completed a BA in Literature and Composition. She has also been working as a freelance writer and academic editor, and while she enjoys writing on many topics, science and technology are her first love.\nMiranda Marquit\nMiranda has a M.A. in journalism from Syracuse University and is a life-long lover of science who now enjoys writing about it. A technology columnist for her local newspaper, Miranda has also had her work published in a range of print and online publications including Discover magazine. Miranda joined Science X in 2005. Her passion for science and technology shows through in her writing, making her contributions lively and incisive.\nTed Goodman\nTed Goodman is a versatile writer, who covers many subjects from symphony orchestras to tournament bridge. Somehow, soon after graduate school, he landed a free-lance job with the National Institutes of Health, editing medical research papers and re-creating their texts to publish for lay audiences. That was a tough way to get his feet wet, but the experience led him to similar assignments in other government offices. \"So many folks are afraid of science and new technologies; I like to bring that knowledge home to them so that they can love it like I do.\" Though Ted's degrees from George Washington University (Washington, DC) are in speech and hearing science, his own research stopped after graduate school. He has spent his career either teaching or writing (or playing bridge!)."
    },
    {
      "url": "https://sciencex.com/help/editorial-team/#authors",
      "text": "Science X editorial team\nOur publishing is operated by a completely in-house team\nStephanie Baum\nscientific editor\nStephanie holds a Master's degree in TESOL from The New School in New York, and joined Science X in 2021. She is passionate about cooking, language learning, linguistics, and editing. Stephanie loves to read and edit articles detailing discoveries across the sci-tech realm, especially those involving biology and space exploration. In addition to her work at Science X, she has written numerous patient education articles on topics within medicine and dentistry.\nGaby Clark\nscientific editor\nGaby has an MA in English and has been copy editing since 2021. Her early copy editing career involved working with higher education and health content. The pandemic showed her the power of reliable and trustworthy science news, and she now enjoys how she contributes in her copy editing role at Science X. Gaby is native to east coast USA and enjoys watching thriller series from around the globe.\nRobert Egan\nassociate editor\nRobert had to live in 11 cities and three countries before finding a place that felt like home (he's a picky guy and that's probably why he enjoys being an editor). In addition to a bachelor's degree in mathematical biology and a master's degree in creative writing, Robert possesses a small street dog with a large overbite who likes to hunt crabs on the beach.\nOwen Ferguson\nscientific editor\nOwen began editing technical work for lay audiences in 1998, working for the Toronto Star newspaper before becoming a full-time freelancer. He attended Ryerson Polytechnic University's journalism program before graduating with a Bachelor's of Independent Studies in forensic database architecture from the University of Waterloo. Owen has been copy editing for Science X since 2020.\nSadie Harley\nscientific editor\nSadie began her working life in a microbiology lab for a major pharma company. She holds a BSc (Hons) in Life Sciences & Ecology and began her editing career in pharmaceutical news, specializing in cardiovascular disease, CNS and anti-infectives. She has also worked within the oil and gas and renewable industries. In recent years, she returned to her interest in medical research, working on clinical trial documents. Sadie was very happy to join the Science X team in 2023 and is wowed on a daily basis by the content she works on.\nLisa Lock\nscientific editor\nLisa is a content and copy editor with backgrounds in the arts and medicine. She has a B.A. in art history and an M.A. in material culture. During her diverse career, she has been a publications editor in a decorative arts museum, an emergency paramedic, and an organ transplant coordinator. She has an eye for fine detail, a passion for grammar, and dedication to life-long learning. She has been editing for Science X since 2021.\nChristopher Packham\ncontent editor\nChris has written and edited for newspapers and alt newsweeklies since 2003, including the Kansas City Star, The Pitch and the Village Voice. He has been copyediting and occasionally writing for Science X since 2013. He lives in Brooklyn, New York, with his spouse and two dogs.\nAlexander Pol\ndeputy editor\nAlex holds a Ph.D. in nano-engineering from Delft University of Technology in the Netherlands. He is an author and co-author of numerous scientific publications. Alex served as a reviewer for various peer-reviewed scientific journals before launching his career in scientific journalism. Science X values Alex's thoughtful and careful scientific insight in developing policy and creating standards for content.\nAndrew Zinin\nlead editor\nAndrew has a life-long interest in scientific news. As a youth he contributed science and technology news to local school magazines. Andrew achieved a Master's degree in physics with post-graduate work as a research assistant for five years, conducting scientific research. Throughout his career he has never forgotten the thrill and excitement of capturing the dreams of a young child through scientific discovery. Andrew is an accurate editor whose earnest efforts and youthful zeal play a major part in the success of Science X.\nJohn Benson\nhonorary editor\nJohn joined Science X in 2006 and his guidance was invaluable in creating reliable and trustworthy science and technology stories for Science X.\nContributing authors\nCharles Blue\nCharles has more than 35 years of experience as a science writer. His primary fields of interest include geophysics, astrophysics (with a focus on radio astronomy), and engineering. If all goes according to plan, he will complete his PhD in science writing in 2026. He is a regular panelist at fandom and science fiction conventions. When the workday is done, Charles is often found playing tenor banjo at Irish music jam sessions.\nKrystal Kasal\nKrystal is a freelance science and technical writer with a Master's degree in physics from Washington State University. She has been doing freelance work for the last five years, but also has experience working in clinical research, writing educational physics content, and helping to create an ontology for a software company. She enjoys writing about science, nature, health, and anything a little bit out of the ordinary.\nIngrid Fadelli\nIngrid is a freelance journalist and science enthusiast with a BSc in Psychology and an MA in International Journalism, both from City, University of London. She regularly writes articles for numerous online publications, media websites, and research outreach companies. Her primary interests include artificial intelligence, robotics, psychology, neuroscience, environmental science, and astrophysics. Ingrid started writing for Science X in 2018 and now covers a wide range of research-based topics.\nPaul Arnold\nPaul is a versatile freelance writer with a passion for scientific endeavors and discoveries. Although he graduated from the University of London with a BSc in Biology, he decided the life of a scientist wasn't for him. So he joined the British Broadcasting Corporation (BBC), where he wrote and produced science and medical documentaries for national and international audiences. He traveled the world interviewing fascinating scientists, including research teams in Antarctica and the Canadian High Arctic. After more than ten happy years at the corporation, he left to pursue a freelance writing career. He also waved goodbye to the UK and relocated to sunny southern Spain. When he's not working, you'll find him enjoying long walks by the sea.\nHannah Bird\nHannah Bird possesses a PhD in Earth Sciences, primarily focused on oceanography, climatology and palaeontology. She specialises in terrestrial and marine flora and fauna responses to past global warming events and their implications for future climate change, including her research on the oldest known amphibian footprints in the UK, which was widely covered in national and global media. Hannah is a freelance editor and content creator, with over 10 years of experience translating complex scientific principles into mainstream print and digital media for Earth Science Journals (including the Geological Curator and Palaeontologica Electronica), the Palaeontological Association's newsletter, and the Geological Society of London's Geoscientist Magazine.\nTomasz Nowakowski\nTomasz is a long-time space enthusiast and amateur astronomer. He founded and managed Astro Watch for nearly a decade - one of the premier astronomy and science-related blogs. Tomasz has been freelancing since 2011, writing for many media outlets, including SpaceFlight Insider, Science 2.0, Space Coast Daily, From Quarks to Quasars.\nDelthia Ricks\nDelthia Ricks is an award-winning science writer and author. Her stories have been published in a variety of newspapers and magazines, including Newsday where she was a staff writer; Discover Magazine; the Journal of the National Cancer Institute; Genetic Engineering and Biotechnology News, and numerous other publications. She additionally has written four books, the most recent, 100 Questions and Answers About Coronaviruses. Ricks is a graduate of the University of California, Los Angeles where she received a B.A. in English with a minor in Biology; She has an M.A. in English from Columbia University in New York and an M.S. in Biology from the University of Bridgeport in Connecticut. Ricks has completed additional postgraduate work in the (tropical) infectious diseases program at the London School of Hygiene and Tropical Medicine.\nThamarasee Jeewandara\nThamarasee Jeewandara, Ph.D., is a researcher and science writer with a Doctorate in Medicine and Bioengineering from the University of Sydney, Australia. She has multi-disciplinary Postdoctoral research experience as a research scientist in biochemistry, plasma physics, genetics, bone tissue engineering, paleontology, cell dynamics and organ-on-a-chip technologies broadly within the U.S and internationally. Thamarasee enjoys travelling, reading/writing, the theatre and fine arts.\nPeter Grad\nPeter Grad was a reporter, columnist and editor at newspapers in his hometown of the Bronx; Meriden, Conn., and then (for 32 years) in New Jersey at The Record. He was the Op-Ed Page editor at The Record for 18 years and also contributed a weekly computer column beginning in the nineties under the titles \"The Computer Tutor\" and \"The PC Guy.\"\" He designed a prototype for a video- and audio-enhanced online multimedia newspaper for The Record years before that became the norm for the nation's leading papers. Peter and his wife, Rose, recently moved to Cary, North Carolina. He misses Zabar's, Levain cookies, Central Park, Prince Street Pizza and Manhattan's cool rock and blues venues. He doesn't miss the traffic or the snow.\nJustin Jackson\nJustin has been covering science news as a host of This Week in Science (TWIS podcast) since 2004. The weekly program brings a slightly irreverent, yet fervently pro-science perspective to recent research across all scientific subjects. While he has previously worked in biotech research labs running fermentation experiments and in genomics labs running next-generation sequencers, Justin’s first love of science is in communicating the stories to a wider audience. Justin joins the Science X team after many years of being an avid reader and fan of their publications.\nTejasri Gururaj\nTejasri is a freelance science writer/journalist with an MS in Physics. She explores diverse scientific disciplines and enjoys research-driven writing. When not at her keyboard, you can find her in front of the TV with her feline companions, eating delicious food, or napping.\nSandee Oster\nSandee is an archaeology PhD candidate at the University of the Witwatersrand, where my research focuses on the relationship between humans and animals throughout history, particularly during the 8.2k event in South Africa. As a science writer for Science X since 2024 and an archaeology blogger on Medium, I transform complex archaeological concepts into engaging narratives that captivate broad audiences. With extensive field experience across South Africa and published research, I am committed to making archaeology not just informative but engaging and accessible, sharing my passion for uncovering the stories hidden in the landscapes of our past. When I'm not in the field or writing, you'll find me buried in a book, spending time with animals, or completely absorbed in documentaries for hours on end.\nSanjukta Mondal\nSanjukta Mondal is a freelance science journalist and communicator with a Master’s in Chemistry. She is on a mission to decode the complex world of science writing, one article at a time,powered by coffee and her curiosity for the extraordinary stories behind ordinary things. Her words have appeared on Chemistry World, BioSpace and The Hindu. When she's not crafting stories, you'll find her exploring new worlds through the lens of her camera and the words of a book.\nBob Yirka\nBob Yirka has always been fascinated by science and has spent large portions his life with his nose buried in textbooks or magazines; he has Bachelor of Science Degree in Computer Science and a Master of Science in Information Systems Management. He's worked in a variety of positions in the telecommunications field ranging from help desk jockey to systems analyst to MIS manager. Recently, after nearly twenty years in the business, he's decided to move to what he really loves doing and that is writing. In addition to writing for Science X, Bob has also sold several short-stories and has written three novels.\nLisa Zyga\nLisa graduated from the University of Illinois at Urbana-Champaign with a Bachelor of Arts degree in rhetoric in 2004. She subsequently completed a science writing internship at Fermilab, followed by a communications internship at Caterpillar. Since then, she has been writing in a freelance capacity for a variety of science, technology, and other publications. Lisa began writing for Science X in 2005, providing engaging and interesting editorials about scientific developments. Lisa‘s stimulating and accurate science and technology articles have made her very popular among Science X readers.\nStuart Mason Dambrot\nAs a Consilientist, Mr. Dambrot analyzes deep-structure interconnections between multiple areas of knowledge and creativity, focus on the synthesis of a precise conceptual language that communicates the common neocortical foundations of human intellectual expression. As a Futurist, Mr. Dambrot identifies, monitors, and extrapolates convergent and emergent trends in a wide range of areas, including computing, communications, energy, neuroscience, nanotechnology, biotechnology, synthetic biology, molecular electronics, artificial intelligence, robotics, quantum computing and communications, and quantum neurobiology. Mr. Dambrot speaks and writes about a wide range of topics, many of which are covered in his blog Critical Thought. He has written for Science X, MedicalXpress.com, Nature, Science, Nature Biotechnology, New Scientist, Scientific American, IEEE Spectrum, Electronics, Columbia University 21stC, Economist, Financial Times, International Herald Tribune, Japan Times, EE Times, Photonics Spectra, ChemicalWeek. Mr. Dambrot holds a degree in Physiological Psychology.\nJohn Hewitt\nJohn's background is physics and neuroscience. He worked in industry for many years in a variety electrical and mechanical engineering roles. He also ran CRE precision, a machine shop specializing in the design of biomedical instruments, for 10 years. He sold the business in 2012 to pursue the goal of full time science reading, and has been able to find gainful employment writing in the fields of neuroscience, cell biology, and general technology.\nLaura Mgrdichian\nLaura is a physical sciences writer, covering physics, nanoscience, astronomy/astrophysics, and materials science for Science X. She began her career as a reporter covering local events on Long Island, New York and later worked at Brookhaven National Laboratory and the National Institute of Standards and Technology. She has been freelancing since 2005. She has B.S. degree in physics from Stony Brook University and currently lives near Boston, Massachusetts. Laura's association with Science X began in 2006. Believing wholeheartedly that 'the devil is in the detail', Laura creates accurate and thought-provoking science articles.\nJohn Messina\nAfter a 35-year professional career in the telecommunications industry, John's second-life career began in 2006. He has flourished as a freelance writer for various websites. John's passion is researching and writing electronic technology and science stories. He graduated from RCA Institutes in 1970 with an Associate Degree in electronic technology. John knows his stuff and readers appreciate his practical insights.\nLin Edwards\nLin has a Bachelor's degree in Chemistry/Biochemistry from the University of Sydney, and a Diploma in Freelance Journalism from the Australian College of Journalism. After many years as a technical writer, writing mainly in fields such as chemistry, electronics, heavy engineering, RFID, robotics, and lasers, Lin decided to return to university and has just completed a BA in Literature and Composition. She has also been working as a freelance writer and academic editor, and while she enjoys writing on many topics, science and technology are her first love.\nMiranda Marquit\nMiranda has a M.A. in journalism from Syracuse University and is a life-long lover of science who now enjoys writing about it. A technology columnist for her local newspaper, Miranda has also had her work published in a range of print and online publications including Discover magazine. Miranda joined Science X in 2005. Her passion for science and technology shows through in her writing, making her contributions lively and incisive.\nTed Goodman\nTed Goodman is a versatile writer, who covers many subjects from symphony orchestras to tournament bridge. Somehow, soon after graduate school, he landed a free-lance job with the National Institutes of Health, editing medical research papers and re-creating their texts to publish for lay audiences. That was a tough way to get his feet wet, but the experience led him to similar assignments in other government offices. \"So many folks are afraid of science and new technologies; I like to bring that knowledge home to them so that they can love it like I do.\" Though Ted's degrees from George Washington University (Washington, DC) are in speech and hearing science, his own research stopped after graduate school. He has spent his career either teaching or writing (or playing bridge!)."
    },
    {
      "url": "https://sciencex.com/donate/?utm_source=story&utm_medium=story&utm_campaign=story",
      "text": "Support open science &\nget an ad-free experience\nBrowse ad-free • Help us stay free and independent • Support coverage of the latest science\nLoading...\nLearn more here about how you can support Science X\n- All payments are secured through PayPal, and no payment details are processed on this site.\n- You do not need a PayPal account to make a payment.\n- You must log in to your account to view Science X ad-free, as this is the only way we can distinguish between readers.\n- One-time payments under $5 cannot be accepted due to processing and handling fees."
    }
  ],
  "argos_summary": "Scientists at Toyota Research Institute trained a humanoid robot, Punyo, to manipulate large objects using its whole body, achieving a 206% success rate over a rigid counterpart. The robot leveraged passive and active compliance, guided by soft-skin and joint sensors, and learned the task from a single simulated demonstration via example‑guided reinforcement learning. This breakthrough suggests robots could handle bulky items in warehouses, homes, or care settings with minimal programming.",
  "argos_id": "FFN0C7DOC"
}