{
  "url": "https://finance.yahoo.com/news/aris-mining-announces-positive-prefeasibility-123000306.html",
  "authorsByline": "PR Newswire",
  "articleId": "9476052b17294fb783a8bca0871997f3",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/07ce092d2d0a43f28d37f8e129789859",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:30:00+00:00",
  "addDate": "2025-09-03T12:41:11.331787+00:00",
  "refreshDate": "2025-09-03T12:41:11.331789+00:00",
  "score": 1.0,
  "title": "ARIS MINING ANNOUNCES POSITIVE PREFEASIBILITY STUDY RESULTS FOR THE SOTO NORTE GOLD PROJECT IN COLOMBIA",
  "description": "Aris Mining Corporation (Aris Mining or the Company) (TSX: ARIS) (NYSE-A: ARMN), as required by regulatory disclosures, announces positive results from the recently completed prefeasibility study (PFS) of its 51%-owned Soto Norte Gold Project (Soto Norte or the Project) in Santander, Colombia. The PFS confirms Soto Norte as a high-quality project with robust economics, low operating costs, and industry-leading environmental and social design features. Importantly, the new study design reduces pr",
  "content": "Proven and probable mineral reserves of 20.3 million tonnes at 7.00 g/t Au containing 4.6 Moz gold, supporting a 22-year initial mine life at an owner-mining rate of 2,750 tpd. See Table 4.\n\nMeasured and indicated mineral resources of 39.0 million tonnes at 5.55 g/t Au containing 7.0 million ounces (Moz) gold. See Table 3.\n\nDesigned mill capacity of 3,500 tpd, including 750 tpd dedicated to local community miners – a scale that supports investment returns and extends mine life to 22+ years while reducing construction risk.\n\nNeil Woodyer, CEO, commented: \"The Soto Norte PFS outlines a project that balances scale, profitability, environmental stewardship, and community input. Our plan dedicates 750 tpd – more than 20% of total capacity – for material mined by local community groups, replacing informal mills that pollute waterways with safe, licensed processing. All mine water will be collected, treated, and safely returned, safeguarding the Bucaramanga and regional water supplies and improving water quality in the local community mining areas. The PFS results highlight Soto Norte's ability to deliver significant long-term value for shareholders and for our community and government partners, while adhering to the highest standards of safety, water protection, and environmental management. With the PFS complete, we are completing environmental studies and preparing to apply for an environmental license in early 2026. Soto Norte stands out as one of the most attractive gold projects in the Americas.\"\n\nVANCOUVER, BC, Sept. 3, 2025 /PRNewswire/ - Aris Mining Corporation (Aris Mining or the Company) (TSX: ARIS) (NYSE-A: ARMN), as required by regulatory disclosures, announces positive results from the recently completed prefeasibility study (PFS) of its 51%-owned Soto Norte Gold Project (Soto Norte or the Project) in Santander, Colombia. The PFS confirms Soto Norte as a high-quality project with robust economics, low operating costs, and industry-leading environmental and social design features. Importantly, the new study design reduces processing capacity to 3,500 tonnes per day (tpd) from 7,000+ tpd previously. The full PFS report is available on the Company's website and SEDAR+ profile at www.sedarplus.ca . All amounts are in U.S. dollars unless otherwise indicated.\n• Initial capital of $625 million, including pre-production costs, value added tax (VAT) and contingency.\n• After-tax NPV of $2.7 billion, IRR of 35.4%, and payback in 2.3 years from the start of operations.\n• Low life-of-mine cash costs of $345/oz1 Au and all-in-sustaining costs (AISC) of $534/oz1 Au.\n• Annual EBITDA averaging $547 million over years 2 to 10 and $410 million over years 1 to 21.\n• Life-of-mine income tax and royalty contributions of $2.6 billion and $393 million, respectively.\n• Strong leverage to higher gold prices, at $3,200/oz the NPV increases to $3.6 billion with IRR of 42.1%.\n• Community Processing Capacity – 750 tpd, or more than 20% of plant capacity, reserved to process material purchased from local community miners, providing a safe, regulated alternative that removes mercury use and ensures proper tailings and water management. Until Soto Norte's processing plant is operational, some material can be processed at Aris Mining's Segovia Operations or Marmato Complex.\n• Local Employment – Development of Soto Norte will generate significant employment across the municipalities of California, Suratá, and Matanza, and the wider Santander region. Peak construction will create about 2,300 jobs, with long-term operations sustaining about 675 direct employees. Aris Mining is preparing programs that will support growing local businesses, expand opportunities for women and young adults, and provide education and skills training.\n• Community Engagement Model – Aris Mining has implemented a structured engagement model with California, Suratá, and Matanza, built on social agreements that empower communities to identify priorities and propose initiatives. Through regular forums, the Project team ensures transparent dialogue, addresses concerns, and builds understanding. This model has delivered tangible social programs and is widely recognized as a successful approach to advancing sustainable regional development.\n• Water Protection and Water Improvement – The Project is designed to protect local watercourses. Extensive studies confirm that the shallow páramo waters are not connected to the deeper groundwater where mining is planned. To further limit interaction, advanced drilling and grouting will be used to identify and seal any water-bearing structures before mining activity, reducing potential groundwater inflows. Clean and contact water will be managed separately, treated before safe discharge to La Baja Creek, and recycled to minimize freshwater use.\n• Minimal Water Use – A recycling system allows 96.5% water reuse, resulting in a net water demand of only 2.8 litres per second (0.22% of the Suratá River's flow at the intake point).\n• Surface Tailings Storage – Nearly half of the process tailings will be thickened and used as backfill underground, recovering most water and reducing surface storage requirements.\n• No Cyanide or Mercury – The processing facility will not use cyanide or mercury, eliminating two of the most harmful pollutants historically associated with gold mining in the region.\n• Environmentally Sound Operations – Ore will be transported from the portal to the plant via a rope conveyor having a minimal surface footprint, reducing truck traffic, dust, and spillage potential. Concentrates will be containerized and exported for international refining, avoiding local emissions or chemical residues. At the end of the mine life, the rope conveyor can be dismantled and removed. Mine closure and reclamation practices will follow international best practices, be incorporated into the mine design and will involve local communities during the design and development phase.\n• Filtered Tailings Facility – The facility design follows Canadian and International standards, which are globally recognized as best practice and provide detailed technical design and risk management criteria.\n\nA complete National Instrument 43-101 – Standards of Disclosure for Mineral Projects (NI 43-101) compliant Technical Report titled \"NI 43-101 Technical Report Prefeasibility Study for the Soto Norte Project, Santander, Colombia\" (the Technical Report) has been filed on SEDAR+ and with the U.S. Securities and Exchange Commission on EDGAR, and is also available on the Company's website at https://aris-mining.com/operation/soto-norte/technical-report/\n\n1. Cash cost per ounce, and all-in-sustaining costs (AISC) per ounce are calculated inclusive of underground mining costs; treatment, transport and refining costs; processing surface costs; G&A and other costs; and are net of by-product credits for silver and copper. These metrics are calculated on a payable gold ounce basis.\n\n2. The PFS economic analysis excludes any contribution from the 750 tpd processing capacity dedicated to\n\n local community miners, which is intended to support regional formalization initiatives and environmental improvements.\n\nFounded in September 2022, Aris Mining was established with a vision to build a leading Latin America-focused gold mining company. Our strategy blends current production and cashflow generation with transformational growth driven by expansions of our operating assets, exploration and development projects. Aris Mining intends to unlock value through scale and diversification. The Company is listed on the TSX (ARIS) and the NYSE-A (ARMN) and is led by an experienced team with a track record of value creation, operational excellence, financial discipline and good corporate governance in the gold mining industry.\n\nAris Mining operates two underground gold mines in Colombia: the Segovia Operations and the Marmato Complex, which together produced 210,955 ounces of gold in 2024. With expansions underway, Aris Mining is targeting an annual production rate of more than 500,000 ounces of gold, following the commissioning of the second mill at Segovia, completed in June and ramping up during H2 2025, and the construction of the Bulk Mining Zone at the Marmato Complex, expected to start ramping up production in H2 2026. In addition, Aris Mining operates the 51% owned Soto Norte joint venture, where a PFS study is complete on a new, smaller scale development plan which confirms Soto Norte as a high-quality, long-life project with robust economics and industry-leading environmental and social design features. In Guyana, Aris Mining owns the Toroparu gold/copper project, where a new Preliminary Economic Assessment (PEA) is underway and its results are also expected in Q3 2025.\n\nColombia is rich in high-grade gold deposits and Aris Mining is actively pursuing partnerships with the Country's dynamic small-scale mining sector. With these partnerships, we enable safe, legal, and environmentally responsible operations that benefit both local communities and the industry.\n\nAdditional information on Aris Mining can be found at www.aris-mining.com, www.sedarplus.ca, and on www.sec.gov.\n\nThe Soto Norte Prefeasibility Study titled \"NI 43-101 Technical Report Prefeasibility Study for the Soto Norte Project, Santander, Colombia\" was prepared in accordance with the NI 43-101 by the following Qualified Persons, all of whom are independent of Aris Mining for the purposes of NI 43-101:\n\nPamela De Mark, P.Geo., Senior Vice President Geology and Exploration of Aris Mining, is a Qualified Person as defined by NI 43-101, and has reviewed and approved the technical information contained in this news release.\n\nCash costs ($ per oz sold), all-in sustaining costs ($ per oz sold) (AISC) and EBITDA are non-GAAP financial measures and ratios. These financial measures and ratios do not have any standardized meaning prescribed under IFRS or by Generally Accepted Accounting Principles (GAAP) in the United States, and therefore, may not be comparable to other issuers. Accordingly, these measures are intended to provide additional information and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with IFRS. Cash cost ($ per oz sold) is calculated by dividing total cash costs by volume of gold ounces projected to be produced on a payable basis. AISC ($ per oz sold) is calculated by dividing AISC by volume of gold ounces projected to be produced on a payable basis. EBITDA represents earnings before interest, income taxes and depreciation, depletion and amortization.\n\nThis news release contains \"forward-looking information\" or forward-looking statements\" within the meaning of Canadian and United States securities legislation. All statements included herein, other than statements of historical fact, including, without limitation, statements relating to Soto Norte as a high quality, long-life project with low operating costs, the scale, throughput, reserves and resources, projected production and projected profitability of the Soto Norte Project, all statements included in the \"Responsible Development\" section of this news release, projected and base case gold prices, estimated NPV, IRR and payback period of the Soto Norte project and statements included in the \"About Aris Mining\" section of this news release relating to the Segovia Operations, Marmato Complex, Soto Norte Project and Toroparu Project are forward-looking. Generally, the forward-looking information and forward looking statements can be identified by the use of forward looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", \"will continue\" or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The material factors or assumptions used to develop forward looking information or statements are disclosed throughout this news release.\n\nForward looking information and forward looking statements, while based on management's best estimates and assumptions, are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Aris Mining to be materially different from those expressed or implied by such forward-looking information or forward looking statements, including but not limited to those factors discussed in the section entitled \"Risk Factors\" in Aris Mining's annual information form dated March 12, 2025 which is available on SEDAR+ at www.sedarplus.ca and included as part of the Company's Annual report on Form 40-F, filed with the SEC at www.sec.gov.\n\nAlthough Aris Mining has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information and forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information or statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information or statements. The Company has and continues to disclose in its Management's Discussion and Analysis and other publicly filed documents, changes to material factors or assumptions underlying the forward-looking information and forward-looking statements and to the validity of the information, in the period the changes occur. The forward-looking statements and forward-looking information are made as of the date hereof and Aris Mining disclaims any obligation to update any such factors or to publicly announce the result of any revisions to any of the forward-looking statements or forward-looking information contained herein to reflect future results. Accordingly, readers should not place undue reliance on forward-looking statements and information.",
  "medium": "Article",
  "links": [
    "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=2007347792&u=http%3A%2F%2Fwww.aris-mining.com%2F&a=www.aris-mining.com",
    "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=1465793631&u=http%3A%2F%2Fwww.sec.gov%2F&a=www.sec.gov",
    "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=336301796&u=https%3A%2F%2Faris-mining.com%2Foperation%2Fsoto-norte%2Ftechnical-report%2F&a=https%3A%2F%2Faris-mining.com%2Foperation%2Fsoto-norte%2Ftechnical-report%2F",
    "https://www.prnewswire.com/news-releases/aris-mining-announces-positive-prefeasibility-study-results-for-the-soto-norte-gold-project-in-colombia-302544454.html",
    "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=3779720537&u=https%3A%2F%2Fwww.sec.gov%2F&a=www.sec.gov",
    "https://mma.prnewswire.com/media/2763190/Aris_Mining_Corporation_ARIS_MINING_ANNOUNCES_POSITIVE_PREFEASIB.html",
    "https://mma.prnewswire.com/media/2763098/Aris_Mining_Corporation_ARIS_MINING_ANNOUNCES_POSITIVE_PREFEASIB.html",
    "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=442968913&u=http%3A%2F%2Fwww.sedarplus.ca%2F&a=www.sedarplus.ca"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Aris Mining",
      "weight": 0.06814414
    },
    {
      "name": "Soto Norte Project",
      "weight": 0.0635615
    },
    {
      "name": "Aris Mining Corporation",
      "weight": 0.06349186
    },
    {
      "name": "Soto Norte",
      "weight": 0.06057049
    },
    {
      "name": "Soto Norte Gold Project",
      "weight": 0.05966285
    },
    {
      "name": "gold mining",
      "weight": 0.05879875
    },
    {
      "name": "local communities",
      "weight": 0.05857405
    },
    {
      "name": "local community miners",
      "weight": 0.057934634
    },
    {
      "name": "local community groups",
      "weight": 0.05559161
    },
    {
      "name": "gold ounces",
      "weight": 0.054499302
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.77001953125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.4990234375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.31640625
    }
  ],
  "sentiment": {
    "positive": 0.76452243,
    "negative": 0.022007866,
    "neutral": 0.21346962
  },
  "summary": "Aris Mining Corporation (Arris Mining) (TSX: ARIS) (NYSE-A: ARMN) has announced positive results from its prefeasibility study (PFS) of its 51-owned 51%-owned Soto Norte Gold Project in Santander, Colombia. The study found that the project has proven proven and probable mineral reserves of 20.3 million tonnes at 7.00 g/t Au containing 4.6 Moz gold, supporting a 22-year initial mine life at an owner-mining rate of 2,750 tpd. The project's mill capacity of 3,500 tpd, including 750 tpd dedicated to local community miners, is designed to support investment returns and extend mine life to 22+ years while reducing construction risk. The PFS also highlights the high-quality project with robust economics, low operating costs, and industry-leading environmental and social design features. The full PFS report is available on the company's website and SEDAR+ profile at www.sedarplus.",
  "shortSummary": "Aris Mining Corporation reports promising PFS results for the Soto Norte Gold Project in Colombia, emphasizing significant economic, environmental, and community benefits.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4f35d10a0f9b4ff19b152d1b8fe6cbf5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=336301796&u=https%3A%2F%2Faris-mining.com%2Foperation%2Fsoto-norte%2Ftechnical-report%2F&a=https%3A%2F%2Faris-mining.com%2Foperation%2Fsoto-norte%2Ftechnical-report%2F",
      "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\nPrivacy Overview\nStrictly Necessary Cookies\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\nIf you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again.\n3rd Party Cookies\nThis website uses both Google Analytics and Irwin IQ to collect anonymous information such as the number of visitors to the site, and the most popular pages.\nKeeping this cookie enabled helps us to improve our website.\nPlease enable Strictly Necessary Cookies first so that we can save your preferences!"
    },
    {
      "url": "https://c212.net/c/link/?t=0&l=en&o=4500432-1&h=2007347792&u=http%3A%2F%2Fwww.aris-mining.com%2F&a=www.aris-mining.com",
      "text": "This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful.\nPrivacy Overview\nStrictly Necessary Cookies\nStrictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings.\nIf you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again.\n3rd Party Cookies\nThis website uses both Google Analytics and Irwin IQ to collect anonymous information such as the number of visitors to the site, and the most popular pages.\nKeeping this cookie enabled helps us to improve our website.\nPlease enable Strictly Necessary Cookies first so that we can save your preferences!"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/aris-mining-announces-positive-prefeasibility-study-results-for-the-soto-norte-gold-project-in-colombia-302544454.html",
      "text": "VANCOUVER, BC, Sept. 3, 2025 /PRNewswire/ - Aris Mining Corporation (Aris Mining or the Company) (TSX: ARIS) (NYSE-A: ARMN), as required by regulatory disclosures, announces positive results from the recently completed prefeasibility study (PFS) of its 51%-owned Soto Norte Gold Project (Soto Norte or the Project) in Santander, Colombia. The PFS confirms Soto Norte as a high-quality project with robust economics, low operating costs, and industry-leading environmental and social design features. Importantly, the new study design reduces processing capacity to 3,500 tonnes per day (tpd) from 7,000+ tpd previously. The full PFS report is available on the Company's website and SEDAR+ profile at www.sedarplus.ca. All amounts are in U.S. dollars unless otherwise indicated.\nNeil Woodyer, CEO, commented: \"The Soto Norte PFS outlines a project that balances scale, profitability, environmental stewardship, and community input. Our plan dedicates 750 tpd – more than 20% of total capacity – for material mined by local community groups, replacing informal mills that pollute waterways with safe, licensed processing. All mine water will be collected, treated, and safely returned, safeguarding the Bucaramanga and regional water supplies and improving water quality in the local community mining areas. The PFS results highlight Soto Norte's ability to deliver significant long-term value for shareholders and for our community and government partners, while adhering to the highest standards of safety, water protection, and environmental management. With the PFS complete, we are completing environmental studies and preparing to apply for an environmental license in early 2026. Soto Norte stands out as one of the most attractive gold projects in the Americas.\"\nProject Highlights (100% basis)\nBalanced Development Strategy for a High-Grade Underground Mine\n- Designed mill capacity of 3,500 tpd, including 750 tpd dedicated to local community miners – a scale that supports investment returns and extends mine life to 22+ years while reducing construction risk.\n- Measured and indicated mineral resources of 39.0 million tonnes at 5.55 g/t Au containing 7.0 million ounces (Moz) gold. See Table 3.\n- Proven and probable mineral reserves of 20.3 million tonnes at 7.00 g/t Au containing 4.6 Moz gold, supporting a 22-year initial mine life at an owner-mining rate of 2,750 tpd. See Table 4.\n- Production of concentrates for export containing 4.3 Moz gold, 18.8 Moz silver, and 84.0 million pounds (Mlb) of copper.\n- Average annual gold production (years 2 to 10) of 263 thousand ounces (koz).\n- Average annual gold production (years 1 to 21) of 203 koz.\nProfitability\n- Base case gold price: $2,600/oz, supporting life-of-mine payable gold sales of $10.4 billion.\n- Initial capital of $625 million, including pre-production costs, value added tax (VAT) and contingency.\n- After-tax NPV5% of $2.7 billion, IRR of 35.4%, and payback in 2.3 years from the start of operations.\n- Low life-of-mine cash costs of $345/oz1 Au and all-in-sustaining costs (AISC) of $534/oz1 Au.\n- Annual EBITDA averaging $547 million over years 2 to 10 and $410 million over years 1 to 21.\n- Significant by-product credits from copper and silver.\n- Life-of-mine income tax and royalty contributions of $2.6 billion and $393 million, respectively.\n- Strong leverage to higher gold prices, at $3,200/oz the NPV5% increases to $3.6 billion with IRR of 42.1%.\nResponsible Development\n- Community Processing Capacity – 750 tpd, or more than 20% of plant capacity, reserved to process material purchased from local community miners, providing a safe, regulated alternative that removes mercury use and ensures proper tailings and water management. Until Soto Norte's processing plant is operational, some material can be processed at Aris Mining's Segovia Operations or Marmato Complex.\n- Local Employment – Development of Soto Norte will generate significant employment across the municipalities of California, Suratá, and Matanza, and the wider Santander region. Peak construction will create about 2,300 jobs, with long-term operations sustaining about 675 direct employees. Aris Mining is preparing programs that will support growing local businesses, expand opportunities for women and young adults, and provide education and skills training.\n- Community Engagement Model – Aris Mining has implemented a structured engagement model with California, Suratá, and Matanza, built on social agreements that empower communities to identify priorities and propose initiatives. Through regular forums, the Project team ensures transparent dialogue, addresses concerns, and builds understanding. This model has delivered tangible social programs and is widely recognized as a successful approach to advancing sustainable regional development.\n- Water Protection and Water Improvement – The Project is designed to protect local watercourses. Extensive studies confirm that the shallow páramo waters are not connected to the deeper groundwater where mining is planned. To further limit interaction, advanced drilling and grouting will be used to identify and seal any water-bearing structures before mining activity, reducing potential groundwater inflows. Clean and contact water will be managed separately, treated before safe discharge to La Baja Creek, and recycled to minimize freshwater use.\n- Minimal Water Use – A recycling system allows 96.5% water reuse, resulting in a net water demand of only 2.8 litres per second (0.22% of the Suratá River's flow at the intake point).\n- Surface Tailings Storage – Nearly half of the process tailings will be thickened and used as backfill underground, recovering most water and reducing surface storage requirements.\n- No Cyanide or Mercury – The processing facility will not use cyanide or mercury, eliminating two of the most harmful pollutants historically associated with gold mining in the region.\n- Environmentally Sound Operations – Ore will be transported from the portal to the plant via a rope conveyor having a minimal surface footprint, reducing truck traffic, dust, and spillage potential. Concentrates will be containerized and exported for international refining, avoiding local emissions or chemical residues. At the end of the mine life, the rope conveyor can be dismantled and removed. Mine closure and reclamation practices will follow international best practices, be incorporated into the mine design and will involve local communities during the design and development phase.\n- Filtered Tailings Facility – The facility design follows Canadian and International standards, which are globally recognized as best practice and provide detailed technical design and risk management criteria.\nTechnical Report Availability\nA complete National Instrument 43-101 – Standards of Disclosure for Mineral Projects (NI 43-101) compliant Technical Report titled \"NI 43-101 Technical Report Prefeasibility Study for the Soto Norte Project, Santander, Colombia\" (the Technical Report) has been filed on SEDAR+ and with the U.S. Securities and Exchange Commission on EDGAR, and is also available on the Company's website at https://aris-mining.com/operation/soto-norte/technical-report/\nTable 1 – Soto Norte economic evaluation sensitivity to gold price\nGold price |\n$2,000/oz |\n$2,200/oz |\n$2,400/oz |\n$2,600/oz |\n$2,800/oz |\n$3,000/oz |\n$3,200/oz |\nIndicator |\n|||||||\nAfter-tax NPV5% ($M) |\n1,800 |\n2,093 |\n2,387 |\n2,680 |\n2,973 |\n3,266 |\n3,559 |\nAfter-tax IRR (%) |\n27.7 |\n30.4 |\n33.0 |\n35.4 |\n37.8 |\n40.0 |\n42.1 |\nPayback period (years) |\n2.8 |\n2.6 |\n2.5 |\n2.3 |\n2.2 |\n2.1 |\n2.0 |\nTable 2 – Soto Norte economic evaluation results2\nKey indicators |\nUnits |\nTotal3 |\nTotal gold produced in concentrates over life of mine |\nkoz |\n4,299 |\nInitial life of mine at an owner-mining rate of 2,750 tpd |\nYears |\n22 |\nAverage annual gold production (years 2 to 10) |\nkoz |\n263 |\nAverage annual gold production (years 1 to 21) |\nkoz |\n203 |\nLife of mine average cash cost1 |\n$/oz Au |\n345 |\nLife of mine average all in sustaining cost (AISC)1 |\n$/oz Au |\n534 |\nAverage annual EBITDA (years 2 to 10) |\n$M |\n547 |\nAverage annual EBITDA (years 1 to 21) |\n$M |\n410 |\nSummary cash flow for the life of mine (US$M), at $2,600/oz gold price |\n||\nRevenue from payable gold sales |\n10,403 |\n|\nLess: royalties |\n393 |\n|\nLess: operating costs, net of by-product silver and copper |\n1,381 |\n|\nLess: sustaining capital |\n364 |\n|\nOperating margin |\n8,265 |\n|\nLess: income tax |\n2,630 |\n|\nAfter-tax cash flow |\n5,635 |\n|\nLess: initial capital including pre-production costs, VAT and contingency |\n625 |\n|\nLess: closure costs |\n25 |\n|\nNet cash flow |\n4,985 |\n|\nAfter-tax indicators, at $2,600/oz gold price (base case): |\n||\nNPV at 5% discount rate |\n$M |\n2,680 |\nIRR |\n% |\n35.4 |\nPayback period (from start of operations) |\nYears |\n2.3 |\nAfter-tax indicators, at $3,200/oz gold price: |\n||\nNPV at 5% discount rate |\n$M |\n3,559 |\nIRR |\n% |\n42.1 |\nPayback period (from start of operations) |\nYears |\n2.0 |\nEndnotes\n1. Cash cost per ounce, and all-in-sustaining costs (AISC) per ounce are calculated inclusive of underground mining costs; treatment, transport and refining costs; processing surface costs; G&A and other costs; and are net of by-product credits for silver and copper. These metrics are calculated on a payable gold ounce basis.\n2. The PFS economic analysis excludes any contribution from the 750 tpd processing capacity dedicated to\nlocal community miners, which is intended to support regional formalization initiatives and environmental improvements.\n3. Presented on a 100% basis.\nTable 3 - Soto Norte mineral resources effective August 18, 2025\nClassification |\nTonnes (Mt) |\nGold grade (g/t) |\nSilver grade (g/t) |\nCopper grade (%) |\nContained gold (Moz) |\nContained silver (Moz) |\nContained copper (Mlb) |\nMeasured |\n3.8 |\n7.99 |\n36.8 |\n0.25 |\n1.0 |\n4.6 |\n21.4 |\nIndicated |\n35.2 |\n5.29 |\n27.3 |\n0.18 |\n6.0 |\n30.9 |\n137.8 |\nMeasured + Indicated |\n39.0 |\n5.55 |\n28.2 |\n0.19 |\n7.0 |\n35.5 |\n159.2 |\nInferred |\n25.1 |\n4.81 |\n24.6 |\n0.13 |\n3.9 |\n19.9 |\n74.5 |\nNotes:\n|\nTable 4 - Soto Norte Project mineral reserves effective August 18, 2025\nClassification |\nTonnes (Mt) |\nGold grade (g/t) |\nSilver grade (g/t) |\nCopper grade (%) |\nContained gold (Moz) |\nContained silver (Moz) |\nContained copper (Mlb) |\nProven |\n2.6 |\n8.78 |\n37.1 |\n0.25 |\n0.7 |\n3.0 |\n14.2 |\nProbable |\n17.7 |\n6.72 |\n31.4 |\n0.19 |\n3.8 |\n17.9 |\n75.0 |\nProven + Probable |\n20.3 |\n7.00 |\n32.1 |\n0.20 |\n4.6 |\n20.9 |\n89.2 |\nNotes:\n|\nAbout Aris Mining\nFounded in September 2022, Aris Mining was established with a vision to build a leading Latin America-focused gold mining company. Our strategy blends current production and cashflow generation with transformational growth driven by expansions of our operating assets, exploration and development projects. Aris Mining intends to unlock value through scale and diversification. The Company is listed on the TSX (ARIS) and the NYSE-A (ARMN) and is led by an experienced team with a track record of value creation, operational excellence, financial discipline and good corporate governance in the gold mining industry.\nAris Mining operates two underground gold mines in Colombia: the Segovia Operations and the Marmato Complex, which together produced 210,955 ounces of gold in 2024. With expansions underway, Aris Mining is targeting an annual production rate of more than 500,000 ounces of gold, following the commissioning of the second mill at Segovia, completed in June and ramping up during H2 2025, and the construction of the Bulk Mining Zone at the Marmato Complex, expected to start ramping up production in H2 2026. In addition, Aris Mining operates the 51% owned Soto Norte joint venture, where a PFS study is complete on a new, smaller scale development plan which confirms Soto Norte as a high-quality, long-life project with robust economics and industry-leading environmental and social design features. In Guyana, Aris Mining owns the Toroparu gold/copper project, where a new Preliminary Economic Assessment (PEA) is underway and its results are also expected in Q3 2025.\nColombia is rich in high-grade gold deposits and Aris Mining is actively pursuing partnerships with the Country's dynamic small-scale mining sector. With these partnerships, we enable safe, legal, and environmentally responsible operations that benefit both local communities and the industry.\nAdditional information on Aris Mining can be found at www.aris-mining.com, www.sedarplus.ca, and on www.sec.gov.\nCautionary Language\nQualified Person and Technical Information\nThe Soto Norte Prefeasibility Study titled \"NI 43-101 Technical Report Prefeasibility Study for the Soto Norte Project, Santander, Colombia\" was prepared in accordance with the NI 43-101 by the following Qualified Persons, all of whom are independent of Aris Mining for the purposes of NI 43-101:\n- Kate Kitchen, MAIG, Area Manager Geology, Mining Plus\n- Peter Lock, FAusIMM, Executive Director and Principal Mining Consultant, Mining Plus\n- Jan Eklund, P.E., Process Consultant, LogiProc Pty. Ltd.\n- Nicholas Sianta, P.E., Geotechnical Engineer, Knight Piésold\n- Rolf Schmitt, P.Geo., Technical Director – Geology, Environmental Resources Management Canada Ltd. (ERM)\nPamela De Mark, P.Geo., Senior Vice President Geology and Exploration of Aris Mining, is a Qualified Person as defined by NI 43-101, and has reviewed and approved the technical information contained in this news release.\nNon-GAAP Financial Measures\nCash costs ($ per oz sold), all-in sustaining costs ($ per oz sold) (AISC) and EBITDA are non-GAAP financial measures and ratios. These financial measures and ratios do not have any standardized meaning prescribed under IFRS or by Generally Accepted Accounting Principles (GAAP) in the United States, and therefore, may not be comparable to other issuers. Accordingly, these measures are intended to provide additional information and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with IFRS. Cash cost ($ per oz sold) is calculated by dividing total cash costs by volume of gold ounces projected to be produced on a payable basis. AISC ($ per oz sold) is calculated by dividing AISC by volume of gold ounces projected to be produced on a payable basis. EBITDA represents earnings before interest, income taxes and depreciation, depletion and amortization.\nForward-Looking Information\nThis news release contains \"forward-looking information\" or forward-looking statements\" within the meaning of Canadian and United States securities legislation. All statements included herein, other than statements of historical fact, including, without limitation, statements relating to Soto Norte as a high quality, long-life project with low operating costs, the scale, throughput, reserves and resources, projected production and projected profitability of the Soto Norte Project, all statements included in the \"Responsible Development\" section of this news release, projected and base case gold prices, estimated NPV, IRR and payback period of the Soto Norte project and statements included in the \"About Aris Mining\" section of this news release relating to the Segovia Operations, Marmato Complex, Soto Norte Project and Toroparu Project are forward-looking. Generally, the forward-looking information and forward looking statements can be identified by the use of forward looking terminology such as \"plans\", \"expects\" or \"does not expect\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\" or \"does not anticipate\", \"will continue\" or \"believes\", or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\". The material factors or assumptions used to develop forward looking information or statements are disclosed throughout this news release.\nForward looking information and forward looking statements, while based on management's best estimates and assumptions, are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Aris Mining to be materially different from those expressed or implied by such forward-looking information or forward looking statements, including but not limited to those factors discussed in the section entitled \"Risk Factors\" in Aris Mining's annual information form dated March 12, 2025 which is available on SEDAR+ at www.sedarplus.ca and included as part of the Company's Annual report on Form 40-F, filed with the SEC at www.sec.gov.\nAlthough Aris Mining has attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking information and forward-looking statements, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such information or statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information or statements. The Company has and continues to disclose in its Management's Discussion and Analysis and other publicly filed documents, changes to material factors or assumptions underlying the forward-looking information and forward-looking statements and to the validity of the information, in the period the changes occur. The forward-looking statements and forward-looking information are made as of the date hereof and Aris Mining disclaims any obligation to update any such factors or to publicly announce the result of any revisions to any of the forward-looking statements or forward-looking information contained herein to reflect future results. Accordingly, readers should not place undue reliance on forward-looking statements and information.\nSOURCE Aris Mining Corporation\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    }
  ],
  "argos_summary": "Aris Mining announced a positive prefeasibility study for its 51%-owned Soto Norte Gold Project in Colombia, confirming a high‑quality, 22‑year mine with a 3,500 tpd mill and 750 tpd dedicated to local community processing. The study projects an after‑tax NPV of $2.7 billion, a 35.4% IRR, and a 2.3‑year payback, with life‑of‑mine cash costs of $345/oz and AISC of $534/oz. The project emphasizes low operating costs, strong by‑product credits from copper and silver, and industry‑leading environmental and social design, including no cyanide or mercury use, 96.5% water recycling, and a community engagement model. Environmental studies are underway, with an environmental license expected early 2026, positioning Soto Norte as one of the most attractive gold projects in the Americas.",
  "argos_id": "FHVHFNO47"
}