{
  "url": "https://patch.com/new-jersey/haddon/haddonfield-police-increase-traffic-enforcement-targeting-teen-drivers",
  "authorsByline": "Josh Bakan",
  "articleId": "f3df249864854b57a66afcf8d4467a31",
  "source": {
    "domain": "patch.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://patch.com/img/cdn20/shutterstock/23182514/20250903/010855/styles/patch_image/public/shutterstock-1140637454___03130721626.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T17:08:56+00:00",
  "addDate": "2025-09-03T17:15:52.114212+00:00",
  "refreshDate": "2025-09-03T17:18:08.915138+00:00",
  "score": 1.0,
  "title": "Teen Drivers Targeted As Police Ramp Up Traffic Enforcement In Haddonfield",
  "description": "Police will target key areas of town for speeding and traffic violations. Here's where.",
  "content": "HADDONFIELD, NJ — Haddonfield police plan to ramp up traffic enforcement in an effort to get teenagers to drive more safely.\n\nOfficers are targeting key areas of town to monitor speeding and other traffic violations as part of the new \"Smart Choices Behind the Wheel\" campaign. Although the campaign is designed around teen drivers, any driver can be ticketed for violations. Starting this week, Haddonfield police will increase traffic enforcement on sections of Grove Street, Wood Lane, West End Avenue, Washington Avenue and Chews Landing Road.\n\nHaddonfield police informed student drivers and their parents about the campaign in a letter last week, which the department shared Wednesday on social media. \"Please speak with your teen driver today,\" said the letter from Police Chief Jason Cutler and Borough Commissioner Frank Troy. \"Your voice matters. Reinforce the importance of staying focused, avoiding distractions, maintaining safe following distances, obeying traffic signs and signals, and practicing patience and courtesy behind the wheel.\"",
  "medium": "Article",
  "links": [
    "https://patch.com/new-jersey/haddon/politics"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Traffic Enforcement",
      "weight": 0.119600944
    },
    {
      "name": "traffic enforcement",
      "weight": 0.119600944
    },
    {
      "name": "other traffic violations",
      "weight": 0.11055558
    },
    {
      "name": "Teen Drivers",
      "weight": 0.107643105
    },
    {
      "name": "teen drivers",
      "weight": 0.107643105
    },
    {
      "name": "traffic signs",
      "weight": 0.107090496
    },
    {
      "name": "student drivers",
      "weight": 0.098546304
    },
    {
      "name": "Haddonfield police",
      "weight": 0.09130371
    },
    {
      "name": "West End Avenue",
      "weight": 0.08868584
    },
    {
      "name": "Police Chief Jason Cutler",
      "weight": 0.08557456
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Local News",
      "score": 0.95263671875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.87744140625
    },
    {
      "name": "/Autos & Vehicles/Vehicle Codes & Driving Laws/Other",
      "score": 0.83935546875
    }
  ],
  "sentiment": {
    "positive": 0.21537125,
    "negative": 0.3320703,
    "neutral": 0.4525585
  },
  "summary": "The Haddonfield police are increasing traffic enforcement in an effort to encourage teenagers to drive more safely. The \"Smart Choices Behind the Wheel\" campaign will focus on speeding, other traffic violations and educating the public about the dangers of driving. Although the campaign is primarily aimed at teenagers, any vehicle can be ticketed for these violations. The police have informed student drivers and their parents about the campaign in a letter sent out last week.",
  "shortSummary": "Haddonfield police will increase traffic enforcement to encourage more than 20,000 teenagers to drive safely, focusing on areas like Northampton and Gloucester.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d897651980554651b3cb260099f74c04",
  "places": [
    {
      "osmId": "11597545",
      "road": "Wood Lane",
      "town": "Haddonfield",
      "county": "Camden County",
      "state": "New Jersey",
      "postcode": "08033",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.905121,
        "lon": -75.03789
      }
    },
    {
      "osmId": "11593336",
      "road": "West End Avenue",
      "town": "Haddonfield",
      "county": "Camden County",
      "state": "New Jersey",
      "postcode": "08033",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.8979157,
        "lon": -75.044285
      }
    },
    {
      "osmId": "11596335",
      "road": "Grove Street",
      "town": "Haddonfield",
      "county": "Camden County",
      "state": "New Jersey",
      "postcode": "08033",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.900717,
        "lon": -75.030151
      }
    },
    {
      "osmId": "11594159",
      "road": "Chews Landing Road",
      "town": "Haddonfield",
      "county": "Camden County",
      "state": "New Jersey",
      "postcode": "08033",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.8891078,
        "lon": -75.0430223
      }
    },
    {
      "osmId": "11599297",
      "road": "Washington Avenue",
      "town": "Haddonfield",
      "county": "Camden County",
      "state": "New Jersey",
      "postcode": "08033",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.8915325,
        "lon": -75.0356262
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://patch.com/new-jersey/haddon/politics",
      "text": "Police will target key areas of town for speeding and traffic violations. Here's where.\nThe commissioners voted 2 to 1 to introduce the measure addressing homelessness. Here's what happens next.\nThe borough will have a new garbage collector in a few weeks. Here's what residents should know.\nHaddon Township has 5 candidates running for 3 spots. Here's who's running in the local Board of Education races.\nThe restaurant was proposed for the former site of the Newton Diner, which burned down 15 years ago.\nAttendees will march from Haddon Twp. to Collingswood during the day of protests throughout the country.\nPrimary Election Day is Tuesday, June 10. Here's what to know before you cast your ballot.\nA week after the election, fewer than 50 votes separated 2 of the candidates.\nCommissioners will be sworn in next week. But the race remains too tight to know exactly who will represent the borough.\nOnly a handful of votes separated the candidates for the third and final spot on the Board of Commissioners as of 10 p.m. Tuesday.\nAs most of New Jersey awaits next month's primaries, Haddonfield has an important election coming up next week.\nTavistock formed a century ago so country club members could legally golf on Sundays. Today, it has an estimated population of 9.\nHaddonfield's mayor did not file to run, but 2 incumbents and 3 challengers did. Here's the field of candidates.\nThe family hasn't been able to contact their mother, who remains in ICE's custody, according to her son.\nSuperintendent Chuck Klaus declared the referendum successful, with a significant majority of residents voting in favor.\nBorough voters will determine whether to move forward with $46.7M in school upgrades, which would be partially covered through state funds.\nThe 120-year ban on alcohol sales in Haddon Heights, New Jersey, could soon come to an end.\nLocal races included the Haddonfield commissioner special election and a 6-person field for Haddon Township School Board.\nOfficials previously announced that a stretch of the roadway would be shut down. Instead, there will be a partial closure.\nThe general election is Tuesday, Nov. 5. Here's what to know before you cast your ballot.\nThe voter-registration deadline is creeping closer. Here's what to know if you plan to vote in Haddonfield or Haddon Township.\nIn both municipalities, Election Day will feature several races from county office to the presidency. Here's what to know.\nKevin Roche said criticism of his change in residence made him 'a detriment to the work of my colleagues.'\nUSS New Jersey — a historic watercraft that's the size of a 90-story building — left the waterfront for the 1st time in decades last March.\nThe state-protected areas — which have attracted large crowds, illegal swimming and off-road vehicle use — will close for the season.\nThe homes still smell of flooding and human waste 5 years after a storm, according to the plaintiffs' attorney.\nYou can watch the most-decorated ship in U.S. history make her voyage at the waterfront, from different spots along the way and online.\n2 lucky winners will get to ride the most-decorated battleship in national history. Bidding has reached $3.6K so far on eBay.\nPreparations are underway for the nation's most-decorated battleship to temporarily depart from the waterfront for the 1st time in decades.\nThe ship hasn't left the waterfront in more than 20 years. She will dry-dock for major work in Philadelphia before returning.\nEach community had several precincts with unreported results as of Wednesday morning. Here's the latest tally.\nHere's what you need to know with every seat in the State Legislature and a host of local positions at stake.\nThe county jail strip-searched nearly 5K people charged with non-indictable offenses over a 4-year period, according to court documents.\nBorough officials say it's necessary to offset the burden for taxpayers. Critics say it deters people from visiting Haddonfield businesses.\nThe borough has fully switched to a digital-payment system for parking on downtown streets and in municipal lots.\nThe Diocese and the attorneys representing survivors of sexual abuse will renegotiate the terms of the agreement.\nPSE&G will be performing gas main work on Haddon Avenue between Reeve and Chestnut Avenues.\nShe claimed her former employer pushed her out for refusing to discriminate against Section 8 applicants.\nAs part of the deal, the company trying to build the drug-treatment center has backed out as the parcel's designated redeveloper.\nHaddonfield is developing a telecommunications master plan. Share your thoughts in a borough survey by June 30."
    }
  ],
  "argos_summary": "Haddonfield police are intensifying traffic enforcement to improve teen driver safety, targeting speeding and other violations on key streets such as Grove Street and West End Avenue. The initiative, called \"Smart Choices Behind the Wheel,\" includes a campaign letter to students and parents urging safer driving habits. Enforcement will be increased starting this week across several town sections.",
  "argos_id": "GGU3CUR1O"
}