{
  "url": "https://www.miamiherald.com/living/health-fitness/article311955442.html",
  "authorsByline": "I. Edwards, HealthDay News",
  "articleId": "2f5c7afe58844e148fc79eba79a8769e",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.mcclatchy-wires.com/public/incoming/nfuh4a/picture311955422/alternates/LANDSCAPE_1140/4b897baf-a8f3-4f16-9c90-f26058050d11",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T10:44:43-04:00",
  "addDate": "2025-09-03T15:09:02.982586+00:00",
  "refreshDate": "2025-09-03T15:09:02.982588+00:00",
  "score": 1.0,
  "title": "Gordon Ramsay promotes sunscreen use after skin cancer surgery",
  "description": "Celebrity chef and restaurateur Gordon Ramsay revealed he recently had surgery to remove basal cell carcinoma, a common form of skin cancer, from his jawline.",
  "content": "Celebrity chef and restaurateur Gordon Ramsay revealed he had surgery to remove basal cell carcinoma, a common form of skin cancer, from his jawline.\n\nThe 58-year-old announced the news on social media during the Labor Day weekend, sharing photos of stitches and bandages stretching from his earlobe to his neck.\n\n\"Grateful and so appreciative for the incredible team at The Skin Associates and their fast reactive work on removing this Basal Cell Carcinoma. Thank you! Please don't forget your sunscreen this weekend,\" Ramsay wrote in the post.\n\n\"I promise you it's not a face lift! I'd need a refund.\"\n\nRamsay joins a growing list of celebrities who have spoken publicly about skin cancer, including Khloé Kardashian, Hugh Jackman, Kevin Jonas and Teddi Mellencamp, The Washington Post reported.\n\nSkin cancer is the most common form of cancer worldwide, with more than 1.5 million new cases diagnosed in 2022, according to the World Health Organization's International Agency for Research on Cancer.\n\nThat includes about 330,000 cases of melanoma, the most serious form of the disease.\n\nRamsay's post dovetails with a growing wave of misinformation about sunscreen on social media.\n\nWhile some influencers promote alternatives such as diet changes or gradual sun exposure, dermatologists emphasize that sunscreen remains one of the most effective ways to protect against skin cancer, The Post reported.\n\nPublic health experts recommend using either chemical or mineral sunscreen, both of which protect skin by absorbing or reflecting harmful ultraviolet rays.\n\nExperts also stress that people with darker skin should use sunscreen, despite some misconceptions that they don't need it.\n\nThe Mayo Clinic has more on skin cancer.\n\nThis story was originally published September 3, 2025 at 10:44 AM.",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/kevinjonas/?hl=en",
    "https://www.gordonramsay.com/",
    "https://www.instagram.com/p/DN-LpjmDKaF/?utm_source=ig_web_copy_link",
    "https://www.miamiherald.com/living/health-fitness",
    "https://www.upi.com/topic/Kevin-Jonas/",
    "https://www.upi.com/topic/Hugh_Jackman/",
    "https://www.instagram.com/teddimellencamp/?hl=en",
    "https://www.instagram.com/thehughjackman/?hl=en",
    "https://www.instagram.com/khloekardashian/?hl=en",
    "https://www.upi.com/topic/Gordon_Ramsay/",
    "https://www.iarc.who.int/cancer-type/skin-cancer/",
    "https://www.mayoclinic.org/diseases-conditions/skin-cancer/symptoms-causes/syc-20377605",
    "https://www.healthday.com/a-to-z-health/conditions/melanoma-2659939106.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Skin cancer",
      "weight": 0.11394467
    },
    {
      "name": "skin cancer",
      "weight": 0.11394467
    },
    {
      "name": "skin cancer surgery",
      "weight": 0.11253615
    },
    {
      "name": "darker skin",
      "weight": 0.09562988
    },
    {
      "name": "skin",
      "weight": 0.09288004
    },
    {
      "name": "sunscreen use",
      "weight": 0.08842037
    },
    {
      "name": "sunscreen",
      "weight": 0.084993415
    },
    {
      "name": "Gordon Ramsay",
      "weight": 0.08074598
    },
    {
      "name": "cancer",
      "weight": 0.077327944
    },
    {
      "name": "Ramsay",
      "weight": 0.07062217
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    },
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.6943359375
    },
    {
      "name": "/Health/Health Conditions/Cancer",
      "score": 0.6865234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.490478515625
    }
  ],
  "sentiment": {
    "positive": 0.4225155,
    "negative": 0.16182402,
    "neutral": 0.41566047
  },
  "summary": "Celebrity chef and restaurateur Gordon Ramsay has had surgery to remove basal cell carcinoma, a common form of skin cancer, from his jawline. He announced the news on social media, along with a warning that it was not a face lift. Ramsay joins a growing list of celebrities who have publicly addressed skin cancer. While some have suggested alternative treatments, dermatologists have confirmed that sunscreen remains one of the most effective methods of protecting skin.",
  "shortSummary": "Gordon Ramsay promotes sunscreen use after having successful surgery to remove basal cell carcinoma, highlighting the importance of using both chemical and mineral sunscreen.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "afce2041dcdd4cce9e9dedac7806289a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.upi.com/topic/Gordon_Ramsay/",
      "text": "Top News\nU.S. News\nWorld News\nFeatured\nOdd News\nEntertainment\nMovies\nMusic\nTV\nScience\nHealth\nSports\nNFL\nMLB\nNBA\nSoccer\nVoices\nPhotos\nNews\nUS News\nWorld News\nEntertainment\nSports\nArchive\nAlmanac\nTrending\n22nd Amendment\nChatGPT teens\nTren de Aragua\nCardi B\nEpstein files\nFamous birthdays\nTime capsule\nDjokovic, Fritz\nThreat, Trump\nTopic: Gordon Ramsay\nHealth News\n// 1 hour ago\nGordon Ramsay promotes sunscreen use after skin cancer surgery\nCelebrity chef and restaurateur Gordon Ramsay revealed he recently had surgery to remove basal cell carcinoma, a common form of skin cancer, from his jawline.\nTV\n// 7 months ago\nGordon Ramsay scolds stubborn restaurant owner in 'Kitchen Nightmares'\nFox released a clip from the next episode of \"Kitchen Nightmares: Road to Super Bowl LIX\" on Friday. Gordon Ramsay's visit to Voleo's airs Tuesday.\nTV\n// 7 months ago\nGordon Ramsay sends back old oysters in Super Bowl 'Kitchen Nightmares'\nFox released a clip from the new season of \"Kitchen Nightmares: Road to Super Bowl LIX\" on Monday. The season premieres Tuesday on Fox and Wednesday on Hulu.\nWorld News\n// 1 year ago\nMother, top chef dead after separate attacks during carnival in London\nA mother died from her wounds Saturday after she was stabbed last weekend during the Notting Hill Carnival, and renowned chef Mussie Imnetu died Friday after an attack Monday at the event.\nEntertainment News\n// 1 year ago\nGordon Ramsay survives Connecticut bike crash with helmet\nCelebrity chef Gordon Ramsay was involved in a bike crash last week and credited his survival to the helmet he was wearing in a video posted to social media.\nEntertainment News\n// 1 year ago\nSpice Girls reunite for Victoria Beckham's 50th birthday\nThe '90s pop music group, Spice Girls, reunited this weekend for Victoria \"Posh Spice\" Beckham's 50th birthday celebration.\nTV\n// 1 year ago\nFox renews 'Hell's Kitchen' for 2 more seasons\nFox announced Tuesday that it has renewed \"Hell's Kitchen\" for Seasons 23 and 24.\nTV\n// 1 year ago\n'Gordon Ramsay's Food Stars' renewed for Season 2\nFox renewed \"Gordon Ramsay's Food Stars\" for a second season on Friday and announced plans to take the show global.\nTV\n// 1 year ago\nWhat to binge: 5 shows, films like 'The Bear'\nWith the release of FX's runaway hit \"The Bear\" third season due later this year, viewers are hungry for their next helping of the high-intensity show. Here are five similar food shows to tide fans over.\nTV\n// 1 year ago\n'Hell's Kitchen' unveils winner of Season 22\nWorld-renowned chef Gordon Ramsay crowned a new head chef on the season finale of \"Hell's Kitchen.\"\nLoad More\nMost Popular\nCan Trump torpedo the 22nd Amendment?\nTrump says U.S. military kills 11 members of Tren de Aragua gang\nCardi B found not liable of assault allegations in civil case\nPlane crashes in Wyoming, killing 13-year-old girl\nFamous birthdays for Sept. 3: Holt McCallany, Eileen Gu"
    },
    {
      "url": "https://www.healthday.com/a-to-z-health/conditions/melanoma-2659939106.html",
      "text": "TUESDAY, May 2, 2023 (HealthDay News) -- Of all the skin cancers, melanoma is the one that scares doctors and patients the most.\nLuckily, there are now several options for treatment should you be diagnosed with this aggressive, sometimes deadly, cancer.\nMelanoma affects over 1 million Americans, and its rates have risen significantly in the past 30 years, according to the American Academy of Dermatology (AAD).\nHere, experts explore what melanoma is, along with its causes, risk factors and key symptoms. Plus, you’ll learn about melanoma’s stages, types and treatments.\nWhat is melanoma?\nThe American Cancer Society (ACS) explains that cancer occurs when cells begin to grow out of control. Melanoma is a type of cancer that starts in the pigment-making cells, known as \"melanocytes.\" While not as common as other forms of skin cancer, it is more serious.\n“Melanoma is more aggressive and more likely to spread to the lymph nodes,” said Dr. Hugh Greenway, a dermatologic surgeon with Scripps MD Anderson Cancer Center and Scripps Clinic in California. “It'll spread to the liver, to the brain and throughout the body if not checked.”\nAccording to the AAD, ultraviolet light from the sun or tanning beds is the cause of melanoma.\nRisk factors include:\nBlistering sunburns\nTanning bed use\nLight skin, light-colored eyes, or red or blond hair\nMoles that are asymmetrical or large\nTime in the sun without protection\nNumerous moles (50 or more)\nBeing age 50 or older\nA family history of melanoma\nLowered immunity\nA thyroid, breast or previous skin cancer diagnosis\nTo reduce these risks, Greenway recommended wearing sunglasses, a wide-brimmed hat and using a water-resistant sunscreen that protects against both UVB and UVA light when out in the sun.\n“I tell my patients here at Scripps [MD Anderson Cancer Center] between a 30 to 50 [SPF sunscreen] is fine,” he advised.\nMelanoma types\nThe Skin Cancer Foundation lists four main types of melanoma:\nSuperficial spreading melanoma is the most common type and tends to occur on the upper back, the legs for women and the torso for men\nLentigo maligna melanoma tends to occur in older adults and often shows up on the arms, upper torso, face and ears\nAcral lentiginous melanoma is the most common type for people of color and mostly occurs on the soles of the feet, palms and under the nails\nNodular melanoma is considered the most aggressive type and typically occurs on the arms, legs, torso and scalp in older men\nMelanoma symptoms\nSo, what does melanoma look like?\nScripps MD Anderson Cancer Center says to be on the lookout for irregular-looking spots on your skin, new spots or ones that change size, shape or color.\nOther melanoma symptoms may include:\nFluid (like blood or puss) on a spot’s surface\nItching, redness or pain\nNew inflammation outside the spot’s original borders\nColor (pigmentation) that spreads to surrounding areas\nA spot that won’t heal\nTo help you identify a melanoma, Greenway suggests the A-B-C-D-E rule.\n“’A’ stands for asymmetry,” he explained. If you draw a line down the middle of a melanoma spot or mole, one half won’t typically match the other.\nThe \"B\" is borders that aren’t regular. “That one [mole] that's got a lot of outcropping and things, we say that's a little irregular,” he noted.\n\"C\" stands for color. “All of a sudden if you’ve got a mole that’s got a lot of blacks in it, reds, different colors, that could be a sign that mole’s a problem. 'D’ is just for being different, and 'E’ is for a mole that’s sort of starting to evolve and change a little bit.”\nHe advised that itchy moles or ones you’re suddenly aware of could be early signs of melanoma, while bleeding moles may indicate more advanced stages of the disease.\nStages of melanoma\nAccording to the ACS, the stages of melanoma are:\nStage 0: The cancer is only on the skin’s outer layer (called melanoma in situ)\nStage I: The tumor is less than 2 mm thick and hasn’t spread beyond the skin\nStage II: The tumor is at least 1 mm thick and may be more than 4 mm thick and hasn’t spread beyond the skin\nStage III: This stage has four different substages. The primary tumor can vary in size or not be visible depending on the substage, and the cancer has spread to nearby lymph nodes or areas of the skin\nStage IV: The tumor has spread to distant lymph nodes or organs\nMelanoma treatments\nScripps states that melanoma treatments include:\nSurgery to remove the cancer\nChemotherapy and radiation\nImmunotherapy drugs\nTargeted gene and protein therapy\nOne study published recently in the journal Cancer Discovery found that certain mRNA vaccines combined with immunotherapy helped reduce the risk of melanoma tumors returning, although more research is needed before this treatment is broadly available.\nEarly detection is also key to better melanoma outcomes, according to Greenway.\n“You probably ought to have your skin checked once a year,” he recommended. “We know that if we can make the diagnosis [early], we can cure it with greater than 99% [cure rate] in most people.”\nSOURCE: Hugh Greenway, MD, dermatologic surgeon, Scripps MD Anderson Cancer Center and Scripps Clinic, La Jolla, Calif.\nMelanoma can be a scary diagnosis, but here experts share advice on what it is, how to spot it and how to treat it."
    },
    {
      "url": "https://www.upi.com/topic/Kevin-Jonas/",
      "text": "Top News\nU.S. News\nWorld News\nFeatured\nOdd News\nEntertainment\nMovies\nMusic\nTV\nScience\nHealth\nSports\nNFL\nMLB\nNBA\nSoccer\nVoices\nPhotos\nNews\nUS News\nWorld News\nEntertainment\nSports\nArchive\nAlmanac\nTrending\n22nd Amendment\nChatGPT teens\nTren de Aragua\nCardi B\nEpstein files\nFamous birthdays\nTime capsule\nDjokovic, Fritz\nThreat, Trump\nTopic: Kevin Jonas\nHealth News\n// 1 hour ago\nGordon Ramsay promotes sunscreen use after skin cancer surgery\nCelebrity chef and restaurateur Gordon Ramsay revealed he recently had surgery to remove basal cell carcinoma, a common form of skin cancer, from his jawline.\nMusic\n// 3 weeks ago\nDemi Lovato joins Jonas Brothers at their tour kick off\nDemi Lovato surprised fans by joining the Jonas Brothers during their first show on the \"Jonas20: Greetings From Your Hometown Tour\" in New Jersey Sunday.\nMusic\n// 1 month ago\nJonas Brothers release 'I Can't Lose,' song for Stand Up to Cancer\nThe Jonas Brothers released \"I Can't Lose\" and an accompanying music video Wednesday. The song supports Stand Up to Cancer in partnership with Mastercard.\nMusic\n// 3 months ago\nJoe Jonas releases 'Music for People Who Believe in Love'\nJoe Jonas released his first solo album in over ten years on Friday.\nMusic\n// 5 months ago\nJonas Brothers release 'Love Me to Heaven' music video\nThe Jonas Brothers released a music video Monday to accompany their latest single \"Love Me to Heaven,\" which arrived March 21.\nMusic\n// 5 months ago\nJonas Brothers release 'Love Me to Heaven,' announce tour\nThe Jonas Brothers released the song \"Love Me to Heaven\" and announced the \"Jonas 20: Living the Dream\" tour.\nEntertainment News\n// 1 year ago\nSinger Kevin Jonas shares skin cancer diagnosis\nJonas Brothers singer Kevin Jonas announced his skin cancer diagnosis Wednesday after having a basal cell carcinoma removed from his hairline.\nMusic\n// 1 year ago\nJonas Brothers to perform at NHL Stadium Series pregame show\nThe Jonas Brothers will headline a pregame concert ahead of the NHL Stadium Series hockey game between the New Jersey Devils and Philadelphia Flyers.\nMusic\n// 1 year ago\nJonas Brothers release 'Strong Enough' featuring Bailey Zimmerman\nJonas Brothers released \"Strong Enough,\" a new single featuring country music singer Bailey Zimmerman.\nEntertainment News\n// 2 years ago\nJoe Jonas, Sophie Turner wear matching pajamas in photo on his birthday\nSophie Turner shared a tribute and new photo with Joe Jonas on his 34th birthday.\nLoad More\nMost Popular\nCan Trump torpedo the 22nd Amendment?\nTrump says U.S. military kills 11 members of Tren de Aragua gang\nCardi B found not liable of assault allegations in civil case\nPlane crashes in Wyoming, killing 13-year-old girl\nFamous birthdays for Sept. 3: Holt McCallany, Eileen Gu"
    },
    {
      "url": "https://www.mayoclinic.org/diseases-conditions/skin-cancer/symptoms-causes/syc-20377605",
      "text": "Overview\nMelanoma\nMelanoma\nThe first sign of melanoma is often a mole that changes size, shape or color. This melanoma shows color variations and an irregular border, both of which are melanoma warning signs.\nSkin cancer is cancer that starts as a growth of cells on the skin. The cells can invade and destroy healthy body tissue. Sometimes the cells break away and spread to other parts of the body.\nMany kinds of skin cancer exist. The most common skin cancers are basal cell carcinoma and squamous cell carcinoma. While these are the most common, they often can be cured. The most dangerous form of skin cancer is melanoma. It is more likely to spread, making it harder to cure.\nMost skin cancers happen on skin that gets a lot of sunlight. The light that comes from the sun is thought to cause most skin cancers. You can reduce your risk of skin cancer by covering your skin with clothes or sunscreen to protect it from the sun.\nSome skin cancers happen on skin that doesn't typically get sun. This likely means that something else is causing these cancers. To reduce your risk of these kinds of skin cancers, check your skin regularly for any changes. Report these changes to your healthcare professional.\nProducts & Services\nTypes\nSymptoms\nWhat skin cancer looks like\nBasal cell carcinoma on white skin\nBasal cell carcinoma on white skin\nBasal cell carcinoma is a type of skin cancer that most often develops on areas of skin exposed to the sun, such as the face. On white skin, basal cell carcinoma often looks like a bump that's skin-colored or pink.\nBasal cell carcinoma on brown skin\nBasal cell carcinoma on brown skin\nBasal cell carcinoma is a type of skin cancer that most often develops on areas of skin exposed to the sun, such as the face. On brown and Black skin, basal cell carcinoma often looks like a bump that's brown or glossy black and has a rolled border.\nSquamous cell carcinoma of the skin\nSquamous cell carcinoma of the skin\nSun-exposed areas such as the lower lip and ears are most likely to develop squamous cell carcinoma of the skin.\nSigns and symptoms of skin cancer include:\n- A new growth on the skin that might look like a mole, a bump or a scab.\n- A rough patch on the skin.\n- A sore on the skin that won't heal.\n- Changes to a mole or freckle, such as getting bigger or changing color.\n- Itchy skin around a skin growth.\n- Pain around a skin growth.\nWhere skin cancer happens\nMost skin cancers happen on parts of the body that get a lot of sun. This includes the scalp, face, lips and ears. Other parts of the body that might get sun include the arms, backs of the hands, back and legs.\nSkin cancer also can happen on skin that typically doesn't get sun. This includes the palms of the hands, the genitals, and under the fingernails and toenails. When skin cancer happens in people with Black or brown skin, it tends to happen in these places that don't typically get sun.\nWhen to see a doctor\nMake an appointment with a doctor or other healthcare professional if you notice any changes to your skin that worry you.\nCauses\nWhere skin cancer develops\nWhere skin cancer develops\nSkin cancer begins in the cells that make up the outer layer of the skin, called the epidermis. One type of skin cancer called basal cell carcinoma begins in the basal cells. Basal cells make skin cells that keep pushing older cells toward the surface. As new cells move up, they become squamous cells. Skin cancer that starts in the squamous cells is called squamous cell carcinoma of the skin. Melanoma, another type of skin cancer, happens in the pigment cells, called melanocytes.\nMost skin cancers are caused by exposure to light from the sun. The light that comes from the sun is a kind of ultraviolet light. That kind of light also can come from tanning beds and tanning lamps. Ultraviolet light contains radiation that changes the DNA inside skin cells and leads to skin cancer.\nNot all skin cancers happen on skin that typically gets a lot of sun. This means something else also causes skin cancer. It's not always clear what causes skin cancer. But healthcare professionals have found some things that increase the risk. These include having a weakened immune system and having a family history of skin cancer.\nSkin cancer starts when skin cells develop changes in their DNA. A cell's DNA holds the instructions that tell the cell what to do. In healthy cells, the DNA tells the cells to grow and multiply at a set rate. The DNA also tells the cells to die at a set time.\nIn cancer cells, the DNA changes give different instructions. The changes tell the cancer cells to grow and multiply quickly. Cancer cells can keep living when healthy cells would die. This causes too many cells.\nThe cancer cells can invade and destroy healthy body tissue. In time, cancer cells can break away and spread to other parts of the body. When cancer spreads, it's called metastatic cancer.\nRisk factors\nFactors that may increase the risk of skin cancer include:\n- Skin that sunburns easily. Anyone of any skin color can get skin cancer. But the risk is higher in people with skin that sunburns easily. The risk of skin cancer also is higher in people who have blond or red hair, light-colored eyes or freckles.\n- Light from the sun. Ultraviolet light from the sun increases the risk of skin cancer. Covering the skin with clothes or sunblock can help lower the risk.\n- Light from tanning beds. People who use indoor tanning beds have an increased risk of skin cancer. The lights used in tanning beds give off harmful ultraviolet light.\n- A history of sunburns. Having had one or more sunburns that raised blisters increases the risk of developing skin cancer. If the sunburns happened during childhood, they increase the risk of getting skin cancer as an adult even more.\n- A history of skin cancer. People who've had skin cancer once are much more likely to get it again.\n- A family history of skin cancer. If a blood relative, such as a parent or sibling, had skin cancer, you may be more likely to get skin cancer.\n- A weakened immune system. If the body's germ-fighting immune system is weakened by medicine or disease, there might be a higher risk of skin cancer. People with weakened immune systems include those taking medicine to control the immune system, such as after an organ transplant. Some health conditions, such as HIV infection, also can weaken the immune system.\nPrevention\nMost skin cancers can be prevented by protecting yourself from the sun. To lower the risk of skin cancer you can:\n- Stay out of the sun during the middle of the day. For much of North America, the sun's rays are strongest between about 10 a.m. and 3 p.m. Plan outdoor activities at other times of the day. When outside, stay in shade as much as possible.\n- Wear sunscreen year-round. Use a broad-spectrum sunscreen with an SPF of at least 30, even on cloudy days. Apply sunscreen generously. Apply again every two hours, or more often if you're swimming or sweating.\n- Wear protective clothing. Wear dark, tightly woven clothes that cover your arms and legs. Wear a wide-brimmed hat that shades your face and ears. Don't forget sunglasses.\n- Don't use tanning beds. The lights in tanning beds give off ultraviolet light. Using tanning beds increases the risk of skin cancer.\n-\nCheck your skin often and report changes to your healthcare team. Look at your skin often for new growths. Look for changes in moles, freckles, bumps and birthmarks. Use mirrors to check your face, neck, ears and scalp.\nLook at your chest and trunk and the tops and undersides of your arms and hands. Look at the front and back of your legs and your feet. Look at the bottom of the feet and the spaces between your toes. Also check your genital area and between your buttocks."
    }
  ],
  "argos_summary": "Gordon Ramsay revealed he had surgery to remove basal cell carcinoma from his jawline and urged people to use sunscreen. The 58‑year‑old shared photos of stitches and thanked his medical team. His post joins a wave of celebrity skin‑cancer disclosures that highlight the importance of sun protection. Dermatologists emphasize that sunscreen remains the most effective defense against skin cancer, even for darker skin tones.",
  "argos_id": "JKOAVR5PL"
}