{
  "url": "https://www.newsmax.com/politics/pentagon-west-point-library/2025/09/03/id/1224942/",
  "authorsByline": "Solange Reyner",
  "articleId": "6ac8c8fcc5154ca69b1424cc3da17ecb",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=36b315c4-3841-483c-8f79-03eb945b66cf&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T13:08:58-04:00",
  "addDate": "2025-09-03T17:34:58.400569+00:00",
  "refreshDate": "2025-09-03T17:34:58.400572+00:00",
  "score": 1.0,
  "title": "Pentagon Reinstalls Painting of Robert E. Lee at West Point Library",
  "description": "The Pentagon has reinstalled a painting of Robert E. Lee in his Confederate uniform in the West Point library, reports CBS News. The 20-foot-tall painting previously hung in the library but was removed in 2022...",
  "content": "The Pentagon has reinstalled a painting of Robert E. Lee in his Confederate uniform in the West Point library, reports CBS News.\n\nThe 20-foot-tall painting previously hung in the library but was removed in 2022 under a Department of Defense directive ordering the U.S. Military Academy to address racial injustice and eliminate installations that \"commemorate or memorialize the Confederacy.\"\n\nThe portrait depicts Lee with an enslaved man guiding the Confederate general's horse in the background.\n\n\"At West Point, the United States Military Academy is prepared to restore historical names, artifacts, and assets to their original form and place,\" Rebecca Hodson, the Army's communications director, told The New York Times earlier this week.\n\n\"Under this administration, we honor our history and learn from it — we don't erase it.\"\n\nDefense Secretary Pete Hegseth has been open about his desire to restore Confederate names and monuments that have been removed over the past five years.",
  "medium": "Article",
  "links": [
    "https://www.cbsnews.com/news/robert-e-lee-portrait-restored-west-point-library/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Robert E. Lee",
      "weight": 0.10994726
    },
    {
      "name": "Confederate names",
      "weight": 0.10668467
    },
    {
      "name": "West Point",
      "weight": 0.09991062
    },
    {
      "name": "West Point Library",
      "weight": 0.0977424
    },
    {
      "name": "Defense Secretary Pete Hegseth",
      "weight": 0.09667703
    },
    {
      "name": "Confederate",
      "weight": 0.086536005
    },
    {
      "name": "historical names",
      "weight": 0.08516272
    },
    {
      "name": "Lee",
      "weight": 0.08398128
    },
    {
      "name": "Painting",
      "weight": 0.07680137
    },
    {
      "name": "Rebecca Hodson",
      "weight": 0.07659399
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/Humanities/History",
      "score": 0.8984375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.6845703125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.6708984375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.63623046875
    },
    {
      "name": "/News/Other",
      "score": 0.52490234375
    },
    {
      "name": "/People & Society/Other",
      "score": 0.4384765625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Historical Sites & Buildings",
      "score": 0.38916015625
    },
    {
      "name": "/Books & Literature/Other",
      "score": 0.32666015625
    }
  ],
  "sentiment": {
    "positive": 0.12234321,
    "negative": 0.5593916,
    "neutral": 0.3182652
  },
  "summary": "The Pentagon has reinstalled a painting of Robert E. Lee in his Confederate uniform, which was removed in 2022 under a Department of Defense directive. The painting depicts an enslaved man guiding the Confederate general's horse. The military is committed to restoring historical names, artifacts, and monuments to their original locations.",
  "shortSummary": "The Pentagon has reinstated a painting of Robert E. Lee in his Confederate uniform in West Point library to address racial injustice and commemorate the 70th anniversary of the Civil War.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9e6c4c23ef964509bb1db9286eac2016",
  "places": [
    {
      "osmId": "461898726",
      "road": "West Church Street",
      "city": "Hagerstown",
      "county": "Washington County",
      "state": "Maryland",
      "postcode": "21740",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.654363,
        "lon": -77.7364722
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.cbsnews.com/news/robert-e-lee-portrait-restored-west-point-library/",
      "text": "Robert E. Lee portrait back up in West Point's library\nA painting of Gen. Robert E. Lee dressed in his Confederate uniform is back on display in the West Point's library, several years after the storied academy removed honors to the Civil War military leader.\nThere also are plans to restore a bust of Lee that had been removed from a plaza at the U.S. Military Academy, and a quote from Lee about honor that was removed from a separate plaza is now on display beneath the portrait, an Army spokesperson said Tuesday.\nThe items were removed to comply with a Department of Defense directive in 2022 that ordered the academy to address racial injustice and do away with installations that \"commemorate or memorialize the Confederacy.\"\nThe Pentagon's decision to re-hang the portrait, which shows a Black man leading Lee's horse in the background, was first reported by The New York Times. It had been hanging in the library since the 1950s before it was placed it in storage.\nThe actions at West Point come as the Trump administration restores Confederate names and monuments that had been removed in recent years.\n\"At West Point, the United States Military Academy is prepared to restore historical names, artifacts, and assets to their original form and place,\" Rebecca Hodson, the Army's communications director, said in a prepared statement. \"Under this administration, we honor our history and learn from it - we don't erase it.\"\nPresident Trump issued an executive order in March titled \"Restoring Truth and Sanity to American History\" that decried efforts to reinterpret American history. The Army then restored the names of bases that originally honored Confederate leaders, finding service members with the same surnames to honor.\nA commission created by Congress recommended in 2022 that the name and images of Confederate officers be removed from military academies. Lee graduated second in his West Point class in 1829 and later served as superintendent, and his name and image had prominent places at the academy on the Hudson River.\nCongress took that action after repeated complaints by current and former enlistees and officers in nearly every branch of the armed services who described a deep-rooted culture of racism and discrimination that stubbornly festers despite repeated efforts to eradicate it.\nTy Seidule, a retired brigadier general who served as vice chair of the commission, said Lee's image shouldn't be on display because he \"chose treason\" and doesn't represent the values taught to cadets at West Point.\n\"It is against the motto of 'Duty, Honor, Country,'\" Seidule said. \"Robert E. Lee is the antithesis of that, because his duty and honor was for a rebellious slave republic.\"\nSeidule, now a history professor at Hamilton College, also questioned whether the restoration of these symbols at West Point are legal under the federal law that led to their removal.\nAn Army statement asserts that the law doesn't bar the restoration of Confederacy-related names, symbols, displays, monuments or paraphernalia on military property.\nThe naming commission said in 2022 that it wasn't created \"with any intention of 'erasing history.'\"\n\"The facts of the past remain and the commissioners are confident the history of the Civil War will continue to be taught at all service academies with all the quality and complex detail our national past deserves,\" the commission said at the time. \"Rather, they make these recommendations to affirm West Point's long tradition of educating future generations of America's military leaders to represent the best of our national ideals.\""
    }
  ],
  "argos_summary": "The Pentagon has reinstated a 20‑foot painting of Robert E. Lee in Confederate uniform in the West Point library after it was removed in 2022 under a DoD directive to eliminate Confederate commemorations. The move reflects the Trump administration’s broader effort to restore Confederate symbols that had been removed in recent years. The decision has sparked debate over historical memory, racial justice, and the legal authority to display such imagery on military property.",
  "argos_id": "JWZFK1K8F"
}