{
  "url": "https://www.extremetech.com/gaming/lenovo-legion-go-2-leak-teases-big-oled-screen-hardware-upgrades",
  "authorsByline": "Devesh Beri",
  "articleId": "cb3cbfaa359742369eb5b57aee3a945c",
  "source": {
    "domain": "extremetech.com",
    "location": null
  },
  "imageUrl": "https://i.extremetech.com/imagery/content-types/07cYTbqRgBVSUlwzXbz5ilv/hero-image.fill.size_1200x675.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T16:45:20+00:00",
  "addDate": "2025-09-03T16:52:52.650112+00:00",
  "refreshDate": "2025-09-03T16:52:52.650115+00:00",
  "score": 1.0,
  "title": "Lenovo Legion Go 2 Leak Teases Big OLED Screen, Hardware Upgrades",
  "description": "Beyond the screen, the leaks indicate that the Legion Go 2 will feature a more powerful AMD Ryzen Z2 Extreme processor, a larger 74Wh battery, and up to 32GB of LPDDR5X RAM.",
  "content": "New leaks from Evan Blass, a technology blogger and prominent leaker, reveal that Lenovo is working to raise the bar for handheld gaming PCs with its Legion Go 2. New images and information detail a device with a screen that could set a new standard for the market.\n\nAccording to Blass, the Legion Go successor's screen is an OLED panel—a significant step up from the Legion Go's LCD. It is also designed with a native landscape orientation, which is a technical choice that avoids the visual glitches and \"weirdness\" that can affect screens repurposed from smartphones, The Verge reports. The new display has a variable refresh rate and is rated for a sustained brightness of 500 nits, with a peak of 1000 nits.\n\nBeyond the screen, Blass says the Legion Go 2 will have a more powerful AMD Ryzen Z2 Extreme processor, a bigger 74Wh battery, and up to 32GB of LPDDR5X RAM. The design has also reportedly been made more ergonomic with improved airflow.\n\nThe Legion Go 2's price is bound to be higher than the first Legion Go. We'll hopefully get a number this weekend when Lenovo unveils the new handheld at IFA 2025.",
  "medium": "Article",
  "links": [
    "https://x.com/evleaks/status/1962355111931289871",
    "https://www.extremetech.com/gaming/ces-2025-lenovo-announces-new-pc-gaming-handhelds-legion-go-2-go-s",
    "https://www.theverge.com/lenovo/769314/lenovo-legion-go-2-oled-vrr-nits-leak-evleaks"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Legion Go",
      "weight": 0.13311067
    },
    {
      "name": "Big OLED Screen",
      "weight": 0.11535385
    },
    {
      "name": "New leaks",
      "weight": 0.09961905
    },
    {
      "name": "screens",
      "weight": 0.09502317
    },
    {
      "name": "New images",
      "weight": 0.0914352
    },
    {
      "name": "Lenovo Legion Go 2 Leak",
      "weight": 0.08756699
    },
    {
      "name": "Evan Blass",
      "weight": 0.079123415
    },
    {
      "name": "Lenovo",
      "weight": 0.07664455
    },
    {
      "name": "the first Legion Go",
      "weight": 0.07576497
    },
    {
      "name": "Ryzen Z2 Extreme",
      "weight": 0.07570836
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.82861328125
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.57763671875
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.5
    }
  ],
  "sentiment": {
    "positive": 0.7113549,
    "negative": 0.02720769,
    "neutral": 0.2614374
  },
  "summary": "New leaks reveal that Lenovo is planning to raise the bar for handheld gaming PCs with its Legion Go 2. The device's OLED screen is a significant increase and designed with a native landscape orientation. Other notable upgrades include a more powerful AMD AMD Z2 Extreme processor, a larger 74Wh battery, and up to 32GB of LPDDR5X RAM. The price will be revealed at IFA 2025.",
  "shortSummary": "LenA new leaked image of the Lenovo Legion Go 2 reveals a significantly higher-than-expected OLED screen, enhanced hardware, and improved ergonomic features, including a more advanced design and increased brightness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "87da6321c0a644508babe20502aa2378",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theverge.com/lenovo/769314/lenovo-legion-go-2-oled-vrr-nits-leak-evleaks",
      "text": "Steam Deck, ROG Ally, and more: all the news about the handheld PC gaming revolution\nSee all Stories\nS\nLooks like Lenovo’s Legion Go 2 will have the most advanced handheld screen yet.\nFew handheld gaming PCs have OLED screens — fewer of those have variable refresh rates. The Legion Go 2 has those and sustained brightness of 500 nits, peaking at 1000 nits, in a native landscape orientation to avoid panel refresh weirdness! According to Evan Blass’s huge new dump of leaked images, anyhow.\nFollow topics and authors from this story to see more like this in your personalized homepage feed and to receive email updates."
    }
  ],
  "argos_summary": "Lenovo’s upcoming Legion Go 2 is set to feature a new OLED panel with variable refresh rate, 500‑nit sustained brightness and 1,000‑nit peak, in a native landscape orientation to avoid display glitches. The device will also house a more powerful AMD Ryzen Z2 Extreme processor, a 74Wh battery, and up to 32GB of LPDDR5X RAM, along with improved ergonomics and airflow. Prices are expected to be higher than the original model, with the official reveal slated for IFA 2025.",
  "argos_id": "K87G3Q4KE"
}