{
  "url": "https://www.cnet.com/deals/amazon-deals-of-the-day-grab-a-pack-of-batteries-for-a-record-low-price/",
  "authorsByline": "Aashna Gheewalla",
  "articleId": "3543eca6338b45c88d18ee8ed53dc1f1",
  "source": {
    "domain": "cnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://www.cnet.com/a/img/resize/ce91a6a75f8a530ddeea0a6a371a89ca6ab0d576/hub/2025/09/03/2aa29b51-d333-41a7-845a-c7ca67d2c62e/amazon-dod-9-3.png?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T16:31:09+00:00",
  "addDate": "2025-09-03T16:37:34.579124+00:00",
  "refreshDate": "2025-09-03T16:37:34.579126+00:00",
  "score": 1.0,
  "title": "Amazon Deals of the Day: Grab a Pack of Batteries for a Record Low Price",
  "description": "Also, score 40% off the Govee floor lamp and over $70 off the Yale Smart Lock 2.",
  "content": "Amazon sells a wide range of products, with new ones arriving every day across multiple categories, including home essentials, tech gadgets and furniture. The retail giant also cuts prices as much as it adds products. We know deciding which offers are worth grabbing (and which aren't) is time-consuming, so we compile the top markdowns daily for you.\n\nToday, we spotted a 20 pack of AA and AAA batteries, each down to a record low price. We also found the Govee floor lamp at $40 off. Lastly, the Yale Smart Lock 2 got a nice $71 price cut.\n\nPersonally, I feel like I never have batteries when I need them. From remotes to appliances, batteries eventually run out and replacing them isn't always cheap. Plus with the rise of tariffs, more toys and electronics are foregoing including batteries, adding on an extra cost. The most common batteries are AA and AAA batteries. Energizer Alkaline Power batteries are a great choice. They have long lasting power and are made of recycled material. Plus, it protects against any leaks that might be damaging. Even if you don't need them right now, they have a 10-year shelf life.\n\nRight now, you can get a 20-pack of batteries for just $11. Normally $15, this almost 30% discount, makes it a great time to stock up. You can pick between the AA or the AAA batteries.\n\nAdding some smart lighting to your home is an easy way to add some ambiance. With fall quickly approaching, it's a great way to transition to the season by adding some spooky colors in your home. A smart lamp that our editors and readers alike love is the Govee RGBIC smart floor lamp. Editor James Brickell claims it to be his favorite floor lamp. But it's not exactly cheap. Which is why the basic version of the lamp is a great alternative. This lamp has 1,000 lumens plus 16 million colors to chose from. You can even customize your own color to match the exact vibe you're going for. And it syncs to music, adding extra fun to any party. And of course since it's a smart lamp, you can control it right from your phone.\n\nThis lamp is normally $100 but Amazon has given the black lamp a 40% discount bringing it down to $60. Although it's not a record low, it's only $5 more than the $55 price we saw last Black Friday.\n\nThe Yale Assure Lock 2 is made with a simple and straightforward design, meaning it won't look too bulky on your door. By using the app you can unlock and lock your door from anywhere. You can also provide visitors with a number code that they can use to get in. Plus for the easiest access, a simple fingerprint can unlock the lock as well. It has Wi-Fi and Bluetooth connectivity, allowing you to connect via Bluetooth as a default in case there's a Wi-Fi interruption. You can get real-time alerts about any activity on your phone. And if your phone dies or fingerprint isn't set up, there's also physical key entry, just in case.\n\nThis lock is not cheap by any means, retailing at $260. Thankfully, you can save $71 on the Black Suede and Satin Nickel options bringing it down to a more reasonable $189.\n\nWith so many deals on Amazon, deciding which ones are worth your money can be difficult. But CNET combs through what the world's largest online retailer has to offer each day and gathers the best deals for you to check out.",
  "medium": "Article",
  "links": [
    "https://www.cnet.com/health/sleep/best-mattresses/",
    "https://www.amazon.com/Sonos-Era-300-Wireless-Speaker/dp/B0BW2LV57K?th=1?tag=cnet-buy-button-20",
    "https://www.cnet.com/personal-finance/trumps-tariffs-explained-what-you-need-to-know-as-inflation-picks-up-again/",
    "https://www.amazon.com/Soundcore-Cancelling-Powerful-Playtime-Bluetooth/dp/B0CRTYZG5C?th=1?tag=cnet-buy-button-20",
    "https://www.amazon.com/Smartphone-Unlocked-Processor-ProScaler-Manufacturer/dp/B0DP3GH34F?tag=cnet-buy-button-20",
    "https://www.amazon.com/Ring-Battery-Doorbell-Head-to-Toe-Video-Satin-Nickel/dp/B0BZWRSRWV?tag=cnet-buy-button-20",
    "https://www.cnet.com/home/smart-home/govee-floor-lamp-pro-and-floor-lamp-2-review/",
    "https://www.amazon.com/Govee-Modern-Assistant-Million-Bedroom/dp/B099WTN2TR?ref=dlx_deals_dg_dcl_B099WTN2TR_dt_sl14_0a&pf_rd_r=ZS02SGRM2ZM084MFQ5X2&pf_rd_p=c9a523ed-b02f-42bb-999b-c674b001b40a&th=1&tag=cnet-buy-button-20",
    "https://www.cnet.com/home/kitchen-and-household/best-smart-lights/",
    "https://www.cnet.com/home/energy-and-utilities/best-alkaline-batteries/",
    "https://www.amazon.com/Apple-11-inch-Intelligence-Display-All-Day/dp/B0DZ74YQ1V?th=1?tag=cnet-buy-button-20",
    "https://www.cnet.com/tech/computing/best-laptop/",
    "https://www.amazon.com/Yale-Security-Connected-Back-Up-YRD410-WF1-BSP/dp/B0B9HWYMV5?ref=dlx_deals_dg_dcl_B0B9HWYMV5_dt_sl14_0a&pf_rd_r=ZS02SGRM2ZM084MFQ5X2&pf_rd_p=c9a523ed-b02f-42bb-999b-c674b001b40a&th=1&tag=cnet-buy-button-20",
    "https://www.amazon.com/Energizer-Alkaline-Batteries-Double-Long-Lasting/dp/B0DDWC93VC?ref=dlx_deals_dg_dcl_B0DDWC93VC_dt_sl14_0a&pf_rd_r=ZS02SGRM2ZM084MFQ5X2&pf_rd_p=c9a523ed-b02f-42bb-999b-c674b001b40a&th=1&tag=cnet-buy-button-20",
    "https://www.cnet.com/deals/the-govee-floor-lamp-2-is-my-favorite-smart-lamp-and-its-21-off-right-now/"
  ],
  "labels": [
    {
      "name": "Paid News"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Batteries",
      "weight": 0.07871877
    },
    {
      "name": "batteries",
      "weight": 0.07871877
    },
    {
      "name": "Energizer Alkaline Power batteries",
      "weight": 0.075315736
    },
    {
      "name": "Amazon Deals",
      "weight": 0.062476058
    },
    {
      "name": "prices",
      "weight": 0.06014365
    },
    {
      "name": "home essentials",
      "weight": 0.05633326
    },
    {
      "name": "the Govee RGBIC smart floor lamp",
      "weight": 0.055857956
    },
    {
      "name": "new ones",
      "weight": 0.05385133
    },
    {
      "name": "more toys",
      "weight": 0.052968856
    },
    {
      "name": "last Black Friday",
      "weight": 0.051396422
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.921875
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.6796875
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.30615234375
    }
  ],
  "sentiment": {
    "positive": 0.15930718,
    "negative": 0.3894101,
    "neutral": 0.45128274
  },
  "summary": "Amazon is selling a wide range of products, with new ones arriving every day across multiple categories. The retail giant also cuts prices as much as it adds products. Today, we found a 20 pack of AA and AAA batteries, each at a record low price, and the Govee floor lamp at $40 off. The Yale Smart Lock 2 also received a $71 price cut. The most common batteries are Energizer Alkaline Power, which have long-lasting power and a 10-year shelf life. CNET compiles the best deals on Amazon each day for readers.",
  "shortSummary": "Amazon.com offers record low prices for AA and AAA batteries, Govee floor lamp, Yale Smart Lock 2, and Energizer Alkaline Power batteries, all for $11.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "693c6338cc6d4fc7a29c04ccd18e0a42",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnet.com/health/sleep/best-mattresses/",
      "text": "My years of knowledge as a certified sleep scientist and the time I've spent testing the best mattresses have confirmed one thing: there's more to beds than meets the eye. Different kinds of mattresses cater to hot sleepers, couples and even those with health issues like back pain. The gist is, you can't choose any bed online or in a store and expect to sleep well.\nOur Picks\nMATTRESSES DEALS OF THE WEEK\n- $1,424 (save $475)\n- $315 (save $56)\n- $300 (save $41)\nWith that said, here is a list of mattresses that are worth the money and will cater to any type of sleeper, backed by my research and hands-on knowledge.\nWhat's the best mattress overall?\nWhile testing mattresses for this list, I found that the Brooklyn Bedding Signature Hybrid is the best overall mattress you can buy. It has three firmness options -- so it's great for people who prefer a firm mattress or a softer mattress -- and a durable hybrid construction, meaning anyone can sleep on this bed.\nThis bed is already priced well for the quality you get, but to make it even sweeter, Brooklyn Bedding offers generous sales that can knock a couple of hundred dollars off the retail price.\nYou might notice that the Brooklyn Bedding Signature only scores 8 out of 10. While some beds may have scored higher in testing metrics on the list, I feel that the Brooklyn Bedding Signature is the best overall mattress for the average person. It's a classic mattress that's very neutral in feel.\nWatch: Our best mattress for 2025 video overview\nWhat We Updated: July 2025\nUpdated listicle format.\nAdded Ashley Home Signature Design as the best cheap pillow-top mattress on Amazon.\nBest mattresses of 2025\nPros\n- Three firmness options mean any sleeper type will be comfortable\n- Neutral foam feel\n- Affordable for the quality at $1,332 before sales\nCons\n- Firmest option still isn’t truly firm\n- Still might be out of the price range for some\nThe Brooklyn Bedding Signature Hybrid mattress is one of the best quality beds you can get for the money.\n“When my sister asked me what my recommendation was for a comfortable and affordable hybrid bed, the Brooklyn Bedding Signature was my immediate choice. She and her dogs have slept on it comfortably for years, and she was able to save even more thanks to Brooklyn Bedding’s 30% military discount,” says Owen Poole, CNET senior video producer.\nWhy we like this bed: The flagship Brooklyn Bedding mattress is 12.25 inches tall and has a neutral foam feel that just about anyone will find comfortable. There’s plenty of support, too, thanks to the eight-inch individually-wrapped coils reinforced around the edge for increased edge support. Then two layers of foam provide plenty of pressure relief while molding to your body without sucking you in like some dense foams do. An airy topper offers a softness that memory foam just can’t achieve.\nWhile it doesn’t have all the bells and whistles like zoned support or foam-tipped coils, the Brooklyn Bedding Signature mattress is one of our favorite mattresses to recommend to people. Why? Besides the solid construction, it’s an incredibly accommodating bed. It’s available in three firmness levels: Soft (medium-soft or 3), Medium (medium or 5) and Firm (medium-firm or 7).\nWho should get this mattress: If you want a straight-to-the-point hybrid bed that’s comfortable, durable and well-priced, no need to look any further than the Brooklyn Bedding Signature mattress. It’s what most people want.\nWho shouldn’t: This Brooklyn Bedding is a great bed, but it’s not particularly advanced in additional features like cooling overs or a zoned support construction for people with back pain. I’d recommend it to the average sleeper, though not to people with specific needs.\nPros\n- Dual-coil design makes it extra durable\n- Free white glove delivery\n- Three firmness options available\n- Lifetime warranty\nCons\n- Expensive at $2,099 before sales\n- Too firm for some sleepers, especially side sleepers\n- $99 fee if you want to return it\nYou get both plush comfort and superior support with the Saatva Classic. It’s a proper luxury mattress with a hefty construction.\n“My dad lives in a rural location, and he’s getting older. He’s not the best candidate for solo unboxing of a new king-size mattress. That’s why I chose to get him a brand-new Saatva Classic for his birthday. The bed was white glove delivered right to his door: a team of professionals set it up for him and even hauled away his old bed. He’s been sleeping like a baby ever since,” says CNET Senior Video Producer JD Christison.\nWhy we like this bed: The Saatva Classic has all the essential parts that make up a classic mattress that everyone can recognize and love: a bouncy feel, an innerspring system and a comfy pillow top. That said, there is so much more going on with this bed than anything you’ve probably slept on. The construction of the 11.5-inch Saatva Classic makes it stand out. It has a dual-coil design that starts with a base layer of tempered steel coils, then comes the second layer of coils that are firmer in the center third of the bed.\nWhat I love about this bed is the classic pillow-top feel that’s responsive and easy to move around, even with the layers of memory foam underneath. You don’t sink into it because it’s so supportive, but the pillow top delivers on cushion. Not to mention, it has a 365-night trial and a lifetime warranty.\nWho should get this bed: Those who want a traditional pillow-top mattress that’s ultra supportive and you’re willing to pay for it will like the Saatva Classic. Every type of sleeper will enjoy it because you choose from three firmness options: Plush soft (medium or 5), Luxury firm (medium-firm or 7) and Firm (firm or 9). The firmest model is why it wins as the best firm mattress.\nWho shouldn’t: That said, this bed isn’t for everyone. I’d say if you’re under 150 pounds, then all the extra support features aren’t worth the money. It’s not a cheap bed, and while heavier body types will benefit from all that support, petite folks just don’t need it.\nPros\n- Responsive memory foam feel\n- Available in an all-foam or hybrid construction\n- Generous sales around holidays, I've seen up to 50% off\n- Temperature neutral\nCons\n- All-foam construction probably isn’t supportive enough for people over 230 pounds\n- Too soft for some back and stomach sleepers\nMemory foam lovers and critics alike will love the all-foam 14-inch Nectar Premier for its comfort and affordable price tag with sales. Nectar does some of the most generous sales I’ve seen.\nWhy we like this bed: The all-foam Nectar Premier is a memory foam mattress that hugs your curves as you sink into it. It reminds me of a watered-down Tempur-Pedic, though I’d classify it as a responsive memory foam feel because it’s easy to move around on. You still feel the bed cradle your form when lying down on it.\nIt hits a sweet spot of satisfying both memory foam lovers and those (like me) who don’t prefer it. We also found it to be a touch above a medium firmness, which means that any sleeping position can enjoy it. Though side sleepers who want a soft bed might find it too firm, that said, I think the average side sleeper should enjoy it. The Nectar Premier is available in an all-foam or hybrid construction. The all-foam is a simple three-layer construction: a support foam, a transition layer and a gel memory foam comfort layer.\nWho should get this bed: The Nectar Premier gives you memory foam without it being off-putting to people who don’t like how sinking and dense true memory foam can be. It’s all-around comfortable and widely accommodating. I’d recommend it to people who love memory foam or those considering trying it out for the sink-in sensation. This bed also has a 365-night trial and a forever warranty, which is as generous as it gets.\nWho shouldn’t: You don’t want this bed if you’re looking for an extreme firmness in either direction -- super firm or super soft. It’s just a tad above medium at a 6 out of 10 on our scale. Also, the Nectar Premier is not a cooling bed despite the cooling additions to keep it from trapping heat, like the top layer of therapeutic gel memory foam with ActiveCool and a textured cover. Those things are nice to see, but won’t actively cool you.\nPros\n- Thick, hybrid construction\n- Phase-changing cover\n- Responsive feel\n- My top pick for heavy people\nCons\n- Firmer than some wants\n- Not a budget choice at $1,899. Generally, Big Fig doesn't do huge markdowns either\nBig Fig is an ultra-supportive mattress designed for heavier people. This bed offers advanced support you can’t get from just any bed.\nWhy we like this bed: The Big Fig mattress offers a responsive, firm foam feel. It won’t have the sinking feel of memory foam. Make no mistake, this is a firm mattress, though it might feel a little softer depending on how much you weigh. The average person will find it around a medium-firm to firm bed, though someone over 300 pounds might think it’s more like a medium. We’d recommend it for stomach, back and combination sleepers.\nThe 13-inch construction is where the Big Fig mattress really shines. It has ultradurable steel coils encased in a foam border for edge support, then three layers of high-density poly foam. A gel-infused latex foam layer is the comfort layer below the quilted cover.\nWho should get this bed: The Big Fig is the best overall pick for heavy people because of its advanced support. People who want a responsive foam feel will like this bed, especially if they want their bed to respond immediately to their movements, rather than lag behind like memory foam.\nWho shouldn’t: Petite people don’t need this bed. While I don’t think the $1,899 queen price is unwarranted, you could get away with a much more affordable all-foam mattress, or a hybrid like the Brooklyn Bedding Signature for only $1,332 before sales. I’ll also say that side sleepers who want a soft bed won’t get it from Big Fig.\nPros\n- Only $284 for a queen is rare\n- Great quality for the price\n- Best for back, stomach or combo sleepers\nCons\n- Too firm for some side sleepers\n- Lacks additional features that other options have\nBudget doesn’t mean you have to sacrifice quality. If you need a new bed and have a tight budget, you’ll be happy to know that the Allswell is an affordable and long-lasting 10-inch mattress.\n“I’m not sure if there’s a better value online for a hybrid mattress of this quality. It’s quite nice for the price, and if you’re a heavier person on a tight budget, I couldn’t see you going wrong with this option,” says JD Christison, CNET senior video producer.\nWhy we like this bed: The Allswell mattress from Walmart is the perfect example of a budget bed that’s actually good. Despite being what we would consider “ultra-budget friendly,” it’s a supportive and bouncy hybrid mattress that’s surprisingly comfortable. It has a soft, neutral foam feel instead of a dense or syrupy memory foam feel that can be polarizing. At a medium-firm or 7, the Allswell mattress is perfect for back and stomach sleepers.\nBecause the Allswell is a budget hybrid bed, its construction is pretty straightforward. You won’t see advanced additions like zoned support or cooling covers, but that doesn’t detract from the comfort or quality. The Allswell mattress has a three-layer construction with individually wrapped coils sandwiched between layers of polyfoam. It’s finished with a soft, quilted cover.\nWho should get this bed: If you need a long-lasting, supportive bed on a budget, you’ll like the Allswell mattress. It might lack all the extra bells and whistles, but Allswell is a high-quality hybrid bed at a fraction of the cost. I can’t think of a better value on the market.\nWho shouldn’t: If you’re a strict side sleeper, the medium-firm profile might cause pressure points at the shoulders, hips and knees. So, I wouldn’t recommend it to them, especially petite body types. I’ll also add that while I like the value of this bed, it isn’t going to knock your socks off with advanced features or construction. It’s an old-school, hybrid bed that’s incredibly affordable.\nPros\n- Physically cool when you touch it\n- Multiple firmness options\n- Soft, neutral foam feel that everyone will like\n- Additional pillow top available\nCons\n- A little expensive at $2,265\n- Price isn't warranted for anyone except hot sleepers\n- No true firm option\nWhen it comes to cooling mattresses, no other brand does it as well as the Brooklyn Bedding Aurora Luxe. It’s one of the most physically cool mattresses we’ve tested.\n“As a hot sleeper, I love how I instantly can feel the cooling sensation when I lie on this mattress. If you combine this bed with light or cooling bedding, you're in good shape to decrease night sweating,” says CNET editor Caroline Igo.\nWhy we like this bed: The Brooklyn Bedding Aurora Luxe is a 13.25-inch premium hybrid mattress that actually sleeps cool at night. But this bed is more than just a cooling solution. It’s also extremely comfortable, with a neutral foam feel. The foam layers provide pressure relief, though you’re not sinking into the bed like memory foam. At checkout, you can add a pillow top to your Aurora Luxe for a softer, airy pillow-top feel.\nAnother point in this bed's favor is that it’s available in three firmness options: Soft (medium-soft or three), Medium (medium or five) and Firm (medium-firm or seven). Also, the firmest option of this Brooklyn Bedding Aurora Luxe isn’t all that firm, so if you’re looking for a truly firm bed, look elsewhere.\nThis premium mattress is five layers thick and features a mix of foam and coils. All the cooling power comes from a layer of CopperFlex foam on top and the Titan Cool cover. If you’re a hot sleeper, you’ll be hard-pressed to do better than the comfort, durability and cooling tech of the Aurora Luxe.\nWho should get this bed: If you’re a hot sleeper, this is the bed for you. The Aurora Luxe is a high-quality mattress that backs up the cooling claims. I don’t think the average person will find a more accommodating bed than this.\nWho shouldn’t: Cooling beds tend to be more expensive, and the Aurora Luxe is no exception. If you’re on a tight budget, I suggest the Cocoon Chill, our best budget cooling mattress selection.\nBest mattress for back pain\nSaatva Rx\nPros\n- Zoned support design with multiple layers of coils is good for back pain\n- Unique construction that you don't see from other beds\n- Accommodating pillow top\nCons\n- Too soft for some stomach and back sleepers\n- One firmness option available shrinks how many people can sleep on it\n- Very expensive at $3,399 for a queen\nSaatva is a brand known for making premium mattresses that are exceptionally durable and supportive. The Rx mattress was designed to alleviate back pain from conditions like scoliosis and sciatica.\nWhy we like this bed: When we tested the Saatva Rx mattress, the team found it on the softer side of medium on our firmness scale, a 4 or 5 out of 10. That firmness level will make it suitable for side sleepers, though it might be too soft for some back and stomach sleepers.\nThe Saatva Rx is a 15-inch mattress with seven layers of gel memory foam, high-density foam, and durable coils. This bed's base layer of coils includes a unique feature of what Saatva calls the “Rx foam module,” which is a foam tip on each coil. If that wasn’t enough, there is an additional layer of micro coils wrapped in high-density foam.\nWho should get this bed: People who want a softer mattress that has a construction to alleviate back pain will like the Saatva Rx.\nWho shouldn’t: The Saatva Rx mattress is softer, excellent for side sleepers with back pain or people with joint pain. However, I think many back and stomach sleepers will want something firmer. The Saatva Classic mattress is a firmer alternative that will give people with back pain all the support they need.\nPros\n- Two firmness levels in one bed\n- Great for side sleepers\n- Cooper-infused memory foam for temperature regulation\n- Airy memory foam feel isn't dense\nCons\n- Not a true budget choice at $1,699 for a queen\n- Too soft for most back and stomach sleepers\nWhy choose one firmness when you can have two in one bed? The Layla Hybrid mattress is a 13-inch flippable bed that provides both comfort and versatility to side sleepers.\n“My parents sleep on this mattress! Our team prefers the Layla Hybrid since it is a flippable bed that offers two firmness options that provide the proper support and pressure relief for side sleepers,” says Dillon Payne, CNET director of production.\nWhy we like this bed: The Layla hybrid mattress is uniquely constructed because it’s flippable. The coils are in the center of the bed, and the foam layers are stacked around them. Among the foam on either side are layers of copper-gel memory foam as the main comfort layer. It’s supposed to also help temperature regulation and keep the foam from trapping heat.\nSide sleepers need as much pressure relief as possible to ensure no painful spots develop and cause joint pain the next day. The Layla Hybrid mattress does just that. The soft side of the Layla hybrid is around medium-soft, and the firmer side is a tad above medium. Neither side is truly firm, though you will get plenty of support and comfort with the firmer side.\nThe Layla Hybrid mattress has a responsive, almost airy memory foam feel that contours your body. Not to mention, the trademark honeycomb pattern cover is super soft. I think it’s one of the only beds that looks as good as it feels.\nWho should get this bed: This bed is made for side sleepers, particularly ones looking for an airy memory foam mattress that gives you two options for firmness. While you might not flip the mattress over when you get it, there is comfort in knowing you have two chances to get it right.\nWho shouldn’t: Most stomach and back sleepers won’t get the support they need from this bed because it’s soft enough that your hips and shoulders could sink into the bed at uneven points. This would result in back pain over time. I also wouldn’t recommend this bed if you don’t care that it’s flippable.\nPros\n- Different firmness options means everyone has a model to pick\n- Base firmness is good for back and stomach sleepers\n- Made from eco-friendly materials\n- Endorsed by the American Chiropractic Association\nCons\n- An additional pillow top skyrockets the price by $1,440.\n- It's too firm for side sleepers without the pillow top\nThe Avocado Green mattress is one of the most popular beds in the organic mattress industry. It’s an 11-inch luxurious bed that uses no chemicals or glues. It has the highest number of certifications of any bed we’ve tested.\nWhy we like this bed: The Avocado Green mattress has a latex foam feel that organic beds are known for, with a firmness that’s good for back and stomach sleepers. Latex foam tends to be naturally firmer, so you won’t sink into it. It’s also highly responsive, so changing positions won’t be an issue. Based on the additional pillow top, you can choose between three firmness levels.\nThe Avocado Green mattress uses natural materials, such as GOLS-certified organic Dunlop latex and GOTS-certified organic cotton and wool. It also has a layer of recycled steel coils with a zoned support design that’s good for back pain. If you want to add the pillow top, you’ll get two inches of Talalay latex foam. Tufted rosettes add the finishing touch.\nWho should get this bed: If you want a firm organic mattress and are willing to spend the money, the Avocado Green mattress is one of the best beds you can get.\nWho shouldn’t: The base Avocado Green mattress has no pillow top. We rate it as a firm or nine on the firmness scale, which is best for stomach and back sleepers. Side sleepers can add a pillow top to make it softer. Here’s the thing about adding the pillow top: it will cost you. The medium pillow top costs $800 more, and the plush option is $1,680 more. It’s more expensive than what many people want to spend.\nPros\n- Lifetime renewal exchange for foam layers\n- Has handles that makes it easier to move\n- Hybrid construction\n- Three firmness options to choose from\nCons\n- $2,132 for a queen is expensive\n- Petite couples may not need the added support\nThe Sparrow Signature Hybrid mattress is a luxurious pillow-top bed that scores high in all the essential factors for couples: edge support, motion isolation and temperature regulation.\nWhy we like this bed: The Sparrow Signature Hybrid mattress from Nest Bedding is our pick for the best mattress for couples. It has a plush, pillow-top feel that’s like a cloud. It’s available in three firmness levels, which always score a bed extra points. What sets the Sparrow Signature Hybrid mattress as the obvious choice for the best mattress for couples is the split king size that allows you to choose a firmness for each side.\nIndividually-wrapped coils are the main support layers of this 13-inch bed. On top of that comes the high-density foam layer to mask the feeling of the coils. The main comfort layer of Energex foam is a neutral foam that’s pretty responsive. The quilted pillow top has a little bit of memory foam for added pressure relief, but it doesn’t change the feel of the bed.\nUnique to the Sparrow Signature is a lifetime renewal exchange program. Because the top comfort layers are easily removable, Nest Bedding will replace the comfort foam even after the trial period. This could change the bed's firmness or replace sagging foams from years of use, which is not something that other brands offer.\nWho should get this bed: This is a luxury mattress with a plush pillow top that anyone can sleep on. It’s a great choice for people who can’t decide what bed to get. It’s comfortable and scores high in factors that matter for sleeping with another person, like edge support and motion isolation. This bed also has a 365-night trial and a lifetime warranty.\nWho shouldn’t: I wouldn’t say anyone should avoid this bed, it’s that comfortable. However, if you want the feel of memory foam, you won’t get it from the Nest Sparrow.\nPros\n- Neutral foam feel that you expect from classic beds\n- Three height options with varying prices\n- Ultrabudget pick at only $275 for a queen\nCons\n- Off-gassing smell when we opened it\n- Not the best for heavy people\nThe Dreamfoam Doze is an ultra-budget, surprisingly supportive mattress with a neutral foam feel. It has no bells and whistles, but it’s a solid choice for the average person.\nWhy we like this bed: For being so cheap, our team was pleasantly surprised with how comfortable and supportive the Dreamfoam Doze mattress was. It has a neutral foam feel that I associate with the old-school beds that I grew up with. It’s familiar.\nThe Dreamfoam Doze is available in a 7-, 9- and 11-inch profile. The thinnest option is the most firm, and the thickest is the softest. We tested the 9-inch model and found it to be medium to medium-firm or six on the firmness scale. It should work for most sleepers, though back and stomach sleepers will probably like it more. Many side sleepers will want the 11-inch option.\nWho should get this bed: The Dreamfoam Doze is the one of the best beds you can get on a budget. It’s solid, though not fancy. It’s an excellent choice for guest rooms.\nWho shouldn’t: The Dreamfoam Doze mattress doesn’t have all the bells and whistles you get from luxury beds. It’s a straightforward budget mattress with a foam support system, transitional foam layer and quilted top. It’s not a fancy bed, but for $275, it’s not trying to be. It’s probably not the best choice for heavy folks who need added support.\nPros\n- Hybrid design that offers support\n- Comfy pillow top\n- From a known brand\n- Affordable at only $350 for a queen\nCons\n- Motion isolation was only OK, might not be good for light sleepers\n- Confusing storefront on Amazon with different beds\n- Only one firmness option\nIf you’re on a budget and want a classic innerspring bed with a comfy pillow top, look no further than the Ashley Home Signature Design Chime mattress. It’s a quality option for only $350 for a queen.\nWhy we chose this bed: The Chime mattress is an accommodating bed that has a plush, fluffy pillow top. It’s not quite as luxurious as other beds on the list, but there’s no way it would be for as cheap as it is. It’s a straightforward, comfortable bed that costs a fraction of what the other beds do. If you’re a budget shopper, this bed won’t disappoint you. It’s a proper medium, a safe firmness level for couples and combination sleepers. This is a good middle ground choice unless you want extreme firmness in either direction.\nI recommend the 12-inch model of the Chime mattress. Amazon has eight different height options, but unlike other brands, the beds are entirely different. So, to get the medium-firm mattress with a comfy pillow top, you must choose the 12-inch height I’m describing here.\nWho should get this mattress: Amazon has many cheap hybrid beds, but the Chime stands out. It’s affordable and performs better than other budget beds we’ve tested. No, it’s not going to have all the bells and whistles that more expensive beds have, but for this price, it’s hard to pass up this quality. It’s a top choice for budget shoppers.\nWho shouldn’t: The Chime mattress only performed OK in motion isolation. It doesn’t hold up super well compared to more expensive beds. While I think that won’t be a huge deal for the average person, light sleepers often woken up by their partner or pet might care. I recommend they opt for an all-foam bed that will absorb that movement. Try out the Tuft & Needle Kin mattress on Amazon.\nBest mattresses of 2025 compared: price, trial and warranty\nCompare our top picks by price and warranty information.\n| Mattress brand | Mattress type | Price (queen) | Sleep trial period | Warranty |\n|---|---|---|---|---|\n| Brooklyn Bedding Signature Hybrid | Hybrid | $1,332 | 120 nights | 10-year limited |\n| Saatva Classic | Hyrbid | $2,095 | 365 nights | Lifetime |\n| Nectar Premier | Memory foam | $2,282 | 365 nights | Forever |\n| Big Fig | Hybrid | $1,899 | 120 nights | 20-year prorated |\n| Allswell | Hybrid | $294 | 100 nights | 10-year limited |\n| Brooklyn Bedding Aurora Luxe | Hybrid | $1,865 | 120 nights | 10-year limited |\n| Saatva Rx | Neutral hybrid | $3,399 | 365 nights | Lifetime |\n| Layla Hybrid | Flippable hybrid | $1,699 | 120 nights | 10-year limited |\n| Avocado Green | Latex hybrid | $2,099 | 365 nights | 25-limited warranty |\n| Sparrow Signautre | Ply foam hybrid | $2,132 | 365 nights | Lifetime warranty |\n| Dreamfoam Doze | Neutral foam | $275 | 120 nights | 10-year limited warranty |\n| Signature Design by Ashley Furniture | Innerspring | $370 | 100 nights | Unspecified |\nBest mattress firmness data\nOur sleep team recently developed a method to measure a mattress’s true firmness: the Mattress Smasher 9000. This proprietary device and corresponding software were developed in-house by our lab technicians. It presses into the middle of the mattress and measures its firmness to score each bed on a scale of 1 to 10, with 10 being the firmest and 1 being the softest. While we also test each bed personally for perceived firmness and feel, we use data from the MS9K to complement our conclusions.\nHere's the data we learned testing the best mattresses with our Mattress Smasher 9000. Sorted from the softest beds to the firmest, here's how the mattresses scored on our firmness scale.\nHow to choose the best mattress\nIt’s easy to get lost in the industry terminology like Hyper-Elastic Polymer or zoned support and not know which bed is right for you. These things sound appealing, but not everyone will like or need every feature. The best mattress for you will suit your needs. So before you do anything, you need to consider three main points: your sleeping position, body type and budget.\nSleeping position\nHow you sleep will help you narrow down your mattress pool by firmness.\n- Side sleepers will need softer mattresses to ensure they get enough cushion for their joints.\n- Stomach and back sleepers want a firmer mattress to ensure their spine stays neutral to avoid back pain.\n- Combo sleepers have more flexibility, although they should make the call based on the position in which they spend the most time.\nYour body type\nYour body type also will help you determine which mattress you should choose. We always recommend that heavier folks go with hybrid beds for longevity.\nHow much pressure you put on a mattress will also influence how firm it feels. Heavy people who put the most pressure on mattresses will find mattresses to be softer. The inverse is true for petite body types who will find things feel firmer. We base our firmness rating of 1 through 10 from the perspective of someone weighing 150 to 230 pounds.\nWomen also have to consider breast comfort when shopping for their mattresses. Stomach sleepers need firm mattresses for spinal support, although many women find extremely firm beds painful across the chest. That’s not to say women can’t sleep on firm mattresses, although it may influence how firm of a bed you choose. Pillow tops, memory foam or padded covers can provide extra cushion to firm mattresses.\nPrice\nOnce you know what you need from your mattress, you must establish your budget. The reality is that beds are a big investment. The average online mattress costs around $1,200, although beds under $500 are available for people on a budget. Don't worry, just because they’re cheaper doesn’t mean they’re poor quality.\nA recent CNET survey found that more than half of adults are willing to spend $1,000 a year to attain better sleep -- especially those in their 20s or 30s -- and admitted to needing one or more accessories, supplements or systems to cope with sleep-related issues. With mattresses lasting longer and offering extended warranties -- every mattress in this guide includes at least a 10-year warranty, and some even come with lifetime coverage -- the cost can pay for itself quickly if it helps you cut back on pricey supplements or stop chasing the latest sleep app or gadget every month.\nHere’s another thing about mattresses: there are always mattress deals available. You should never have to buy a mattress for full price. From Memorial Day to Black Friday to every season in between, you’ll almost have access to some sort of discount.\nHow we test and rate mattresses\nOur team of sleep experts has spent years researching, testing and deconstructing over 300 mattresses. Most of our testing happens in our 6,000-square-foot mattress warehouse in Reno, Nevada. In addition to the office space where our team tirelessly compiles mattress data, there are also two mock bedrooms we use to test and film reviews in. A back room also serves as an overflow for the hundreds of mattresses the team has tested.\nTesting mattresses is a very hands-on process that involves analyzing the construction, feeling and rolling around on the beds from multiple points of view. Our team has a variety of genders, body types and sleeper positions, which allows us to give each bed a well-rounded view that we can compile into recommendations for the average person.\nFirmness and feel: Firmness and feel are some of the most subjective factors when testing mattresses. How firm a mattress feels will depend on how much pressure you put on the bed -- aka your body weight -- and this varies from person to person. We often find that our opinion on a bed’s firmness does not always match a brand’s claim.\nTo get a full view of a mattress, each person in the testing facility rates each mattress we test on firmness. Then we compare it to our data set to see where a bed falls on our firmness scale.\nDurability and construction: We can’t sleep on every mattress we test for years to test the durability (though we have done it for some). While we note the construction of a bed, we use it to inform how durable and supportive a bed will be over time. Saatva, for example, received a 10 support score during testing because of the hefty construction and dual-coil system.\nMotion isolation: When I say motion isolation, I’m referring to how well a bed can dampen movement across the surface. We test this by having multiple teammates move around and measure how much motion they can feel. Memory foam tends to perform best in this area. For example, the Nectar Premier mattress scored higher in motion isolation because the memory foam layers are superior at dampening movement compared with innerspring mattresses.\nEdge support: This one might not seem like a big deal, but edge support is important if you sleep on the edge of the bed. Think about it like how strong the bed’s perimeter is. If it caves in when we sit or lay on it, it doesn’t have good edge support and receives a score corresponding to where it falls in the data.\nTemperature: Many brands claim their mattresses are cooling, although very few are. While adding cooling technology or gel-infused foams can help regulate temperature, it doesn’t mean they are physically cool to the touch. We carefully assess each of the cooling features but differentiate between being temperature-neutral and cooling. For instance, Purple is a naturally breathable bed because of the grid construction, but we don’t consider it an actively cooling bed.\nRead more on how we test mattresses.\nOther mattresses we've tested\nWe’ve tested many other beds outside of what was included in this best mattress list. Many of them are great but didn’t quite cut earning that “best” title. Mattresses are subjective, and there’s a chance that one of these beds might work better for you.\nPurple Restore:No other mattress compares to the feel of the squishy, Hyper-Elastic Polymer that makes up the Purple Grid. When you lie on it, you feel almost buoyant. Not only does that give it a leg up in pressure relief, but it also regulates temperature well. It’s unlike any other bed I’ve tested. If you’re an adventurous sleeper who wants a widely accommodating hybrid mattress that will stand the test of time, get the Purple Restore mattress. While it’s not actively cooling, it does a surprisingly good job of pulling heat away from the body while you’re sleeping. So I’d also recommend it for hot sleepers.\nBear Original: The Bear Original is an affordable all-foam bed that’s great for people under 230 pounds who want the pressure relief of memory foam without the slow, sinking feeling. It responds faster than other memory foam beds like Nectar or Amerisleep, making changing positions much easier. This mattress falls at around a medium-firm or seven on our firmness scale. It’s definitely firmer, so some strict side sleepers may find it too hard. However, that firmness offers great spinal support to back and stomach sleepers. I wouldn’t recommend any all-foam mattress to anyone over 230 pounds. It will be fine for a while, but it will sag faster, and you won’t get as much life out of it as you want. Just go with a hybrid bed and save yourself the headache.\nHelix Sunset Luxe: The is medium-soft premium mattress is a medium-soft premium mattress that gives side sleepers all the pressure relief they want. Fans of pillow tops will love its plushness. This pillow-top mattress has a mostly neutral feel, although you just have a touch of memory foam. When lying on it, you get a little bit of the sinking-in feeling, though it doesn’t overpower the neutral pillow-top feel. We rate the Helix Sunset Luxe a medium-soft or three on our firmness scale. It’s soft and will provide plenty of pressure relief where side sleepers need it: the shoulders, hips and knees. Given it’s a soft mattress, I wouldn’t recommend it to strict back and stomach sleepers who need a firmer profile for spinal support. It's also pretty expensive.\nWinkBed: Fans of pillow-top mattresses will love the comfort and luxury of the WinkBed mattress. It’s firm enough to support stomach sleepers and has one of the most comfortable pillow tops I’ve ever tested. It has the burly presence of a classic innerspring mattress, but modern upgrades make it seriously comfortable. It’s the type of bed you would expect to see in a fancy hotel. The fluffy pillow top feels like a cloud, and the hefty construction makes it extremely supportive.\nPlank Firm Luxe: Back sleepers need a firmer mattress to ensure their spine stays in a neutral alignment at night. The Plank Firm Luxe mattress is an ultra-firm mattress with a flippable design. It offers a firm and an extra-firm side. On the extra-firm side, we rate it 10 out of 10 on our firmness scale. The name encompasses how this bed feels, like a plank with a layer of foam over it. Because it’s so firm, you won’t sink into the bed at all. That means it will be extremely responsive, so you don’t have problems moving positions. The American Chiropractic Association also endorses it. I'd advise that side sleepers stay far away from this bed.\nMattresses we're currently testing\nCNET’s sleep team is constantly testing and reviewing new mattresses behind the scenes. These are the next ones up in our process:\n- Amerisleep Organica - An organic hybrid mattress made with Talalay latex foam.\n- Novilla Mattress - An ultra-budget gel memory foam that only costs $190 for a queen.\n- Siena Mattress - This affordable mattress on Amazon is only $555 for a queen.\n- Kin by Tuft & Needle - This budget bed comes in all-foam and hybrid constructions.\nWhat are the different kinds of mattresses\nIf you’re new to online mattress shopping, one easy way to narrow down the best mattress for you is by choosing a type of bed.\nFoam mattresses are made entirely of layers of foam, whether it be polyfoam or gel foam. Each foam layer has a different density because it serves a distinct purpose in the bed. The foams with the highest density will be on the bottom because it’s the bed's structure.\nLatex foam mattresses are divided into two types: natural and synthetic. Natural and organic latex foam is hypoallergenic, antimicrobial and environmentally friendly. Synthetic latex foam is artificially made but cheaper than organic material. Either way, latex foam is durable, breathable and very bouncy. Latex beds are almost always very heavy, so having two people to move them is best.\nMemory foam mattresses are one of the most popular types because they are comfortable and excellent at isolating motion and offering pressure relief to the joints. Memory foam is often slower to respond, making it difficult to switch positions at night.\nHybrid mattresses use both foam and metal coils. They’re closest in design to the innerspring mattress most of us grew up with, but the added layers of foam do wonders for pressure relief. We recommend hybrid mattresses for people who weigh over 230 pounds.\nPillow-top mattresses have a padded layer on the top of the bed that’s often tufted to provide extra cushioning. They’re often made of wool, organic cotton or other light and airy materials.\nBuying the best mattress FAQs\nHow much should I pay for a mattress?\nHow much you should spend on your next bed depends on your budget. The average online bed retails for around $800 to $1,200 for a queen-size mattress. But there are beds under $500 and mattresses that cost over $2,000 if you're looking for affordability or luxury.\nHowever, price doesn't necessarily mean quality. Like any product, be sure to do your research (or rely on ours) and check that the mattress comes with a generous trial period, as most do these days.\nHow often should you replace your mattress?\nThe average lifespan of a mattress is about seven to 10 years. How long your mattress lasts depends on how often you sleep on it, if you rotate it and what it’s made of. All-foam mattresses tend to wear out a little fast because the foam can sag.\nThe average lifespan of the average mattress is between seven and ten years. Although there are things you can do to extend the life of your bed:\n- Clean regularly\n- Rotate your mattress to avoid uneven wear\n- Add a mattress protector\n- Use a mattress topper to change the firmness or feel of your bed\nWhat is the best time to buy a mattress?\nThere is always some sort of mattress sale going on. The type of sale and size of discounts will vary depending on the time of year. You’ll see the biggest markdowns around major holidays like Labor Day, Memorial Day, Presidents Day, Black Friday and Christmas. And you'll likely be able to save by bundling your mattress with other products you may need, such as a bed frame or bedding.\nWhat mattress is recommended by doctors?\nYour sleeping habits and body type are essential to any mattress recommendation. There is no one mattress recommendation by doctors, but there are certifications to look for. For instance, mattresses like the Avocado Green and Plank Firm Luxe are endorsed by the American Chiropractic Association.\nHow do I choose the best mattress for my sleeping position?\nYour sleeping position will determine how firm your mattress should be. Side sleepers sleep best on softer mattresses that offer enough pressure relief so they don’t develop pressure points on the shoulders, knees and hips. Stomach and back sleepers need a firmer mattress that keeps their spine in a neutral position throughout the night. If a mattress is too soft, you’ll wake up with back pain. Combination sleepers should choose based on where they spend the most time.\nWhat type of mattress is best for people with allergies?\nPeople with allergies benefit most from mattresses made with hypoallergenic materials, like latex foam beds. Latex foam is naturally hypoallergenic and antimicrobial, so mold and other allergens can’t grow on it. Alternatively, memory foam beds are a good choice for people with allergies.\nHow can I tell if a mattress is good for me without trying it in-store?\nBuying your next bed online can seem like a risk. The best online mattresses offer trial periods and free returns to make sure you’re satisfied with your selection. Trials from brands range from around 90 days up to a full year to make your decision. If you’re unhappy, you can return it and get a refund.\nThe best way to start shopping for your next bed is to consider your preferences, sleeping position and budget. That will help you narrow down the market to your best options.\nHow do mattress warranties work, and what should I look for?\nNearly all online mattress brands offer a warranty. The warranty duration will vary by brand, though the low side tends to be around ten years. Just because a mattress has a warranty doesn’t mean everything is covered under it. Warranties protect you against defects in the bed, like broken coils or split seams. Warranties do not cover normal wear and tear to your bed.\nSome brands, like Nest Bedding, offer unique programs like the lifetime renewal exchange, which allows you to replace old layers of foam.\nAre more expensive mattresses always better?\nNo, expensive mattresses aren’t always better. Plenty of really affordable beds rival the quality and comfort of costly beds. More expensive beds often have extra bells and whistles like zoned support and cooling covers that budget choices don’t have.\nHow do I properly clean and maintain my mattress?\nChanging your bedding regularly is the first step in keeping your bedroom clean. It won’t stop your bed from collecting stains, dead skin cells and dust mites. Properly cleaning your mattress includes spot cleaning, vacuuming and deep cleanings."
    },
    {
      "url": "https://www.cnet.com/personal-finance/trumps-tariffs-explained-what-you-need-to-know-as-inflation-picks-up-again/",
      "text": "His One Big Beautiful Bill might have made it across the finish line, but tariffs still remain the dominant focus of President Donald Trump's economic agenda. This is especially true as the US Labor Department announced recently that consumer prices rose by 2.7% in June, the highest spike since February, and the White House is holding firm to the deadline for the steepest of Trump's tariffs -- only a few days away.\nAfter unleashing market chaos on April 2, when the president unveiled a laundry list of heavy tariffs for countries around the world, they were paused for 90 days after the stock market dramatically tumbled. That 90-day pause was supposed to end earlier this month but has been extended again through Friday, Aug. 1, a date the administration says will stick this time.\nAs those uncertainties and upheavals continue to play out, Trump has barreled forward with his plans, including doubling the tariffs on steel and aluminum imports and announcing a new plan to increase the rate for China to 55%. He also hyped up a trade deal on July 2 that leaves Vietnam's import tax rate at a historically high 20%, and just this week made a deal with the European Union to cut a proposed 30% tariff to 15%. The sweeping tariff initiative will likely affect your cost of living, which we know from our surveys is something you're worried about.\nThat all came after Trump's push hit its biggest roadblock yet, when the US Court of International Trade ruled late last month that Trump had overstepped his authority when he imposed tariffs. That ruling was stayed, but the fight is likely to head to the Supreme Court. All the while, major US companies like Apple and Walmart have butted heads with the administration over the tariffs and their bluntness about how tariffs will make affording things harder for consumers.\nAmid all this noise, you might still be wondering: What exactly are tariffs, and what will they mean for me?\nThe short answer: Expect to pay more for at least some goods and services. For the long answer, keep reading, and for more, check out CNET's price tracker for 11 popular and tariff-vulnerable products.\nWhat are tariffs?\nPut simply, a tariff is a tax on the cost of importing or exporting goods by a particular country. So, for example, a 60% tariff on Chinese imports would be a 60% tax on the price of importing, say, computer components from China.\nTrump has been fixated on imports as the centerpiece of his economic plans, often claiming that the money collected from taxes on imported goods would help finance other parts of his agenda. The US imports $3 trillion worth of goods from other countries annually.\nThe president has also shown a fixation on trade deficits, claiming that the US having a trade deficit with any country means that country is ripping the US off. This is a flawed understanding of the matter, many economists have said, since deficits are often a simple case of resource realities: Wealthy nations like the US buy specific things from nations that have them, while those nations in turn may not be wealthy enough to buy much of anything from the US.\nWhile Trump deployed tariffs in his first term, notably against China, he ramped up his plans more significantly for the 2024 campaign, promising 60% tariffs against China and a universal 20% tariff on all imports into the US.\n\"Tariffs are the greatest thing ever invented,\" Trump said at a campaign stop in Michigan last year. At one point, he called himself \"Tariff Man\" in a post on Truth Social.\nWho pays the cost of tariffs?\nTrump repeatedly claimed, before and immediately after returning to the White House, that the country of origin for an imported good pays the cost of the tariffs and that Americans would not see any price increases from them. However, as economists and fact-checkers stressed, this is not the case.\nThe companies importing the tariffed goods -- American companies or organizations in this case -- pay the higher costs. To compensate, companies can raise their prices or absorb the additional costs themselves.\nSo, who ends up paying the price for tariffs? In the end, usually you, the consumer. For instance, a universal tariff on goods from Canada would increase Canadian lumber prices, which would have the knock-on effect of making construction and home renovations more expensive for US consumers. While it is possible for a company to absorb the costs of tariffs without increasing prices, this is not at all likely, at least for now.\nSpeaking with CNET, Ryan Reith, vice president of International Data Corporation's worldwide mobile device tracking programs, explained that price hikes from tariffs, especially on technology and hardware, are inevitable in the short term. He estimated that the full amount imposed on imports by Trump's tariffs would be passed on to consumers, which he called the \"cost pass-through.\" Any potential efforts for companies to absorb the new costs themselves would come in the future, once they have a better understanding of the tariffs, if at all.\nWhich Trump tariffs have gone into effect?\nFollowing Trump's \"Liberation Day\" announcements on April 2 and subsequent shifting by the president, the following tariffs are in effect:\n- A 50% tariff on all steel and aluminum imports, doubled from 25% as of June 4.\n- A 30% tariff on all Chinese imports until the new deal touted by Trump takes effect, after which it will purportedly go up to 55%. China being a major focus of Trump's trade agenda, it has faced a rate notably higher than other countries, peaking at 145% before trade talks commenced.\n- 25% tariffs on imports from Mexico and 35% on those from Canada. This applies only to goods from each country that are not covered under the 2018 USMCA trade agreement brokered during Trump's first term. The deal covers roughly half of all imports from Canada and about a third of those from Mexico, so the rest are subject to the new tariffs. Energy imports not covered by USMCA will be taxed at only 10%.\n- A 25% tariff on all foreign-made cars and auto parts.\n- A sweeping overall 10% tariff on all imported goods.\nFor certain countries that Trump said were more responsible for the US trade deficit, Trump imposed what he called \"reciprocal\" tariffs that exceed the 10% level: 20% for the 27 nations that make up the European Union, 26% for India, 24% for Japan and so on. These were meant to take effect on April 9 but were delayed by 90 days due to historic stock market volatility, and then delayed again to Aug. 1. These rates are subject to change until that new effective date, and some have already been altered: the rate against Japan was upped to 25%, the same as the rate against South Korea; Trump has also threatened a 50% rate against Brazil. Another deal announced on July 23 lowered Japan's rate to 15%.\nTrump's claim that these reciprocal tariffs are based on high tariffs imposed against the US by the targeted countries has drawn intense pushback from experts and economists, who have argued that some of these numbers are false or potentially inflated. For example, the above chart says a 39% tariff from the EU, despite its average tariff for US goods being around 3%. Some of the tariffs are against places that are not countries but tiny territories of other nations. The Heard and McDonald Islands, for example, are uninhabited. We'll dig into the confusion around these calculations below.\nNotably, that minimum 10% tariff will not be on top of those steel, aluminum and auto tariffs. Canada and Mexico were also spared from the 10% minimum additional tariff imposed on all countries the US trades with.\nOn April 11, the administration said smartphones, laptops and other consumer electronics, along with flat panel displays, memory chips and semiconductors, were exempt from reciprocal tariffs. But it wasn't clear whether that would remain the case or whether such products might face different fees later.\nHow were the Trump reciprocal tariffs calculated?\nThe numbers released by the Trump administration for its barrage of \"reciprocal\" tariffs led to widespread confusion among experts. Trump's own claim that these new rates were derived by halving the tariffs already imposed against the US by certain countries was widely disputed, with critics noting that some of the numbers listed for certain countries were much higher than the actual rates and some countries had tariff rates listed despite not specifically having tariffs against the US at all.\nIn a post to X that spread fast across social media, finance journalist James Surowiecki said that the new reciprocal rates appeared to have been reached by taking the trade deficit the US has with each country and dividing it by the amount the country exports to the US. This, he explained, consistently produced the reciprocal tariff percentages revealed by the White House across the board.\n\"What extraordinary nonsense this is,\" Surowiecki wrote about the finding.\nThe White House later attempted to debunk this idea, releasing what it claimed was the real formula, though it was quickly determined that this formula was arguably just a more complex version of the one Surowiecki deduced.\nWhat will the Trump tariffs do to prices?\nIn short: Prices are almost certainly going up, if not now, then eventually. That is, if the products even make it to US shelves at all, as some tariffs will simply be too high for companies to bother dealing with.\nWhile the effects of a lot of tariffs might not be felt straight away, some potential real-world examples have already emerged. Microsoft has increased prices across the board for its Xbox gaming brand, with its flagship Xbox Series X console jumping 20% from $500 to $600. Kent International, one of the main suppliers of bicycles to Walmart, announced that it would be stopping imports from China, which account for 90% of its stock.\nSpeaking about Trump's tariff plans just before they were announced, White House trade adviser Peter Navarro said that they would generate $6 trillion in revenue over the next decade. Given that tariffs are most often paid by consumers, CNN characterized this as potentially \"the largest tax hike in US history.\" Estimates from the Yale Budget Lab, cited by Axios, predict that Trump's new tariffs will cause a 2.3% increase in inflation throughout 2025. This translates to about a $3,800 increase in expenses for the average American household.\nReith, the IDC analyst, told CNET that Chinese-based tech companies, like PC makers Acer, Asus and Lenovo, have \"100% exposure\" to these import taxes, with products like phones and computers the most likely to take a hit. He also said that the companies best positioned to weather the tariff impacts are those that have moved some of their operations out of China to places like India, Thailand and Vietnam, singling out the likes of Apple, Dell and HP. Samsung, based in South Korea, is also likely to avoid the full force of Trump's tariffs.\nIn an effort to minimize its tariff vulnerability, Apple has begun to move the production of goods for the US market from China to India.\nWill tariffs affect prices immediately?\nIn the short term -- the first days or weeks after a tariff takes effect -- maybe not. There are still a lot of products in the US imported pre-tariffs and on store shelves, meaning the businesses don't need a price hike to recoup import taxes. Once new products need to be brought in from overseas, that's when you'll see prices start to climb because of tariffs or you'll see them become unavailable.\nThat uncertainty has made consumers anxious. CNET's survey revealed that about 38% of shoppers feel pressured to make certain purchases before tariffs make them more expensive. About 10% say they have already made certain purchases in hopes of getting them in before the price hikes, while 27% said they have delayed purchases for products that cost more than $500. Generally, this worry is the most acute concerning smartphones, laptops and home appliances.\nMark Cuban, the billionaire businessman and Trump critic, voiced concerns about when to buy certain things in a post on Bluesky just after Trump's \"Liberation Day\" announcements. In it, he suggested that consumers might want to stock up on certain items before tariff inflation hits.\n\"It's not a bad idea to go to the local Walmart or big box retailer and buy lots of consumables now,\" Cuban wrote. \"From toothpaste to soap, anything you can find storage space for, buy before they have to replenish inventory. Even if it's made in the USA, they will jack up the price and blame it on tariffs.\"\nCNET's Money team recommends that before you make any purchase, especially a high-ticket item, be sure that the expenditure fits within your budget and your spending plans. Buying something you can't afford now because it might be less affordable later can be burdensome, to say the least.\nWhat is the goal of the White House tariff plan?\nThe typical goal behind tariffs is to discourage consumers and businesses from buying the tariffed, foreign-sourced goods and encourage them to buy domestically produced goods instead. When implemented in the right way, tariffs are generally seen as a useful way to protect domestic industries.\nOne of the stated intentions for Trump's tariffs is along those lines: to restore American manufacturing and production. However, the White House also says it's negotiating with numerous countries looking for tariff exemptions, and some officials have also floated the idea that the tariffs will help finance Trump's tax cuts.\nThose things are often contradictory: If manufacturing moves to the US or if a bunch of countries are exempt from tariffs, then tariffs aren't actually being collected and can't be used to finance anything. This and many other points have led a lot of economists to allege that Trump's plans are misguided.\nAs for returning -- or \"reshoring\" -- manufacturing in the US, tariffs are a better tool for protecting industries that already exist because importers can fall back on them right away. Building up the factories and plants needed for this in the US could take years, leaving Americans to suffer under higher prices in the interim.\nThat problem is worsened by the fact that the materials needed to build those factories will also be tariffed, making the costs of \"reshoring\" production in the US too heavy for companies to stomach. These issues, and the general instability of American economic policies under Trump, are part of why experts warn that Trump's tariffs could have the opposite effect: keeping manufacturing out of the US and leaving consumers stuck with inflated prices. Any factories that do get built in the US because of tariffs also have a high chance of being automated, canceling out a lot of job creation potential. To give you one real-world example of this: When warning customers of future price hikes, toy maker Mattel also noted that it had no plans to move manufacturing to the US.\nTrump has reportedly been fixated on the notion that Apple's iPhone -- the most popular smartphone in the US market -- can be manufactured entirely in the US. This has been broadly dismissed by experts, for a lot of the same reasons mentioned above, but also because an American-made iPhone could cost upward of $3,500. One report from 404 Media dubbed the idea \"a pure fantasy.\" The overall sophistication and breadth of China's manufacturing sector have also been cited, with CEO Tim Cook stating in 2017 that the US lacks the number of tooling engineers to make its products.\nFor more, see how tariffs might raise the prices of Apple products and find some expert tips for saving money."
    },
    {
      "url": "https://www.cnet.com/home/smart-home/govee-floor-lamp-pro-and-floor-lamp-2-review/",
      "text": "Pros\n- Very bright\n- Vibrant colors\n- Loads of preset scenes\n- Bluetooth speaker in the base is a nice touch\nCons\n- No Matter integration at launch\n- A bit expensive\nPros\n- Great light dispersion\n- Lighted base is a nice touch\n- Good color saturation\n- Matter support at launch\nCons\n- Fewer preset scenes\n- No Bluetooth speaker\n- Glossy plastic base\nGenerally, when we think of a smart light, we think of a bulb or a strip. While Govee makes those more traditional smart lighting products, the brand does a great job of stretching the perception of smart lights and lighting in general with various designs. Govee recently updated the original Lyra Floor Lamp with the Govee Floor Lamp Pro and Floor Lamp 2.\nThese floor lamps are designed so that the light faces the wall -- corners work really well -- and the light can \"paint\" your wall with a glow of any of the 16 million-plus colors available, including a range of whites. The way these lamps add illumination to a room is pretty unusual. However, there are some drawbacks and differences between the two models. And I don't just mean the price.\nDesign and hardware\nIn the most basic sense, these two lamps look the same as the first model. The light source is an LED strip in a silicone casing that acts as a diffuser, which snaps into an aluminum tube. The tube is attached to the circular base, and you get a metal clip that mounts to the metal part of the tube, and the included remote magnetically attaches to it.\nGovee upgraded the light strip quality and the base of the lights. The technology used is still RGBICWW, which means the light strip can show multiple colors simultaneously and has dedicated white LEDs, but Govee has put more nodes per strip. This allows for better color representation and means the lamps are brighter than before. The Govee Floor Lamp Pro is about 7 inches taller than the Floor Lamp 2 and 375 lumens brighter.\nThe Floor Lamp 2 is available only in black, but silver is coming. The base and aluminum frame that holds the LED strip are color-matched with the base, getting a glossy finish. But as you reach the bottom of the base, the black finish fades away and becomes clear. This is where the upgrade comes into play, because Govee added LEDs to the base, so it also glows. Within the Govee companion app, you can control the base independently from the main lights if you want.\nGovee added more flair to the base of the Floor Lamp Pro with a fabric covering in gray or black. You'll still get the new lighting effects in the base as you do on the Lamp 2. However, the Floor Lamp Pro has an extra trick that's missing from its counterpart: a Bluetooth speaker in the base.\nThe speaker can act like any other Bluetooth speaker you've used by pairing it to your phone to play audio. The audio gets quite loud and is clear at lower volumes, but it can start to distort as you pump up the volume. But Govee has also built some preset white noise sounds into the app for things like rain, nature, rivers and more. Some of the preset lighting scenes -- we'll get more into that in a later section -- have sounds that match up with the lights for a more immersive experience.\nBoth of these lamps are well-built and offer a clean, minimalist style that looks good in almost any room. The upgraded LED strips and the illuminated bases are great additions to the new lamps.\nMaking it glow\nOne area Govee has always impressed me is its app and its customization options. Aside from simply turning the light on and adjusting the brightness, the app allows you to choose the color of the lamp and the base. While you can pick from over 80 different preset scenes with names like Glacier, Sunset, Moonlit Night, Birthday and Romantic, keep in mind that the Floor Lamp Pro does offer more preset options than the Floor Lamp 2.\nThese preset scenes offer color changes and motion to paint your walls with vibrant light. But aside from passively providing ambiance to your room, some of the scenes also react to music by utilizing the microphone in the lamp's base or your phone's microphone, depending on your choice. If you don't like any of the scenes, the app lets you create your own with different lighting effects and lots of colors.\nControlling your lights with the app is only one way to manage the lamps. Govee's floor lamps also integrate with Alexa and Google Assistant for voice control, and the Floor Lamp 2 is Matter-ready out of the box. The Floor Lamp Pro will pick up the feature in a future update. You can always use the included remote if you don't want to use voice or your phone to control the lamps.\nBut you can go even further in lighting controls by using another helpful smart home device, a motion sensor or the app to set your lamps to power on and off automatically at certain times of the day.\nGovee Floor Lamp comparison\n| Product | Govee RGBICWW Floor Lamp Pro (H6079) | Govee Lyra RGBICWW Floor Lamp (H607C) |\n|---|---|---|\n| Colors | RGBICWW | RGBICWW |\n| Size | 5.39 × 5.39 x 66.9 inches | 5.51 x 5.51 x 59.84 inches |\n| Brightness | 2,100 lumens, 6,500k | 1,725 lumens |\n| Control methods | App, remote control, voice control | App, remote control, voice control |\n| App connectivity | 2.4GHz Wi-Fi, Bluetooth | 2.4GHz Wi-Fi, Bluetooth |\n| Voice control | Alexa, Google Assistant | Alexa, Google Assistant, Matter |\n| Special features | Lighting in lamp base, 80+ scene modes, 29 white noise scenes | Lighting in lamp base, 82 scene modes, 11 music modes |\nShould you buy a Govee Floor Lamp?\nIf you're looking for ways to add more light or some unique ambiance to your home with a less traditional-style fixture, you absolutely should. Govee has been making some of my favorite smart lights for years, and the original Lyra floor lamp has been a staple in my home. These upgraded lights are better in every way, with improved LED strips that provide better color reproduction and brightness.\nThe new lamp base brings improved styling, and the added LEDs are great. With the Govee Floor Lamp Pro, the Bluetooth speaker in the base is a nice touch and does bring some fun features, but it may not be a big selling point to some. It really depends on your use case and where you plan to place the lamp in your home. Overall, both of these lights are great and would be an illuminating choice for your home."
    },
    {
      "url": "https://www.cnet.com/tech/computing/best-laptop/",
      "text": "I review all types of laptops at CNET, from budget models for everyday tasks to high-performance laptops for PC gaming and content creation -- and everything in between. With decades of experience, I conduct rigorous performance tests and supplement the benchmarks with extensive hands-on use to get a sense of a laptop's design and features in addition to its performance. And I always keep price and value in mind when evaluating a laptop. I have favorite MacBooks and I also have many Windows laptops to recommend for a variety of uses. No matter your budget or whether you need a laptop for home, school or work, I'm confident there's a laptop here that's perfect for you. Let's dive in.\nOur Picks\nLAPTOP DEALS OF THE WEEK\nWhat is the best laptop overall?\nApple’s already fantastic laptop is now faster and cheaper. The MacBook Air recently received a jolt with an update to Apple’s latest M4 silicon and its price dropped by $100. The 13-inch MacBook Air M4 starts at $999 and the 15-inch MacBook Air M4 starts at $1,199. Each provides a ton of value for the money. The larger Air is still thin and light while supplying a roomy 15.3-inch display. It’s the best laptop for most people. The smaller and lighter Air sacrifices some screen size for increased portability, making it the best student laptop.\nA Windows rival to the MacBook Air has arrived in the form of Microsoft's first Copilot Plus PC. Based on a Qualcomm Snapdragon X CPU, the Surface Laptop 7 offers strong application and AI performance and outstanding battery life. It was the first Windows laptop I've tested with a longer battery life than that of the MacBook Air. With a design that's on par with the Air's, the Surface Laptop 7 is one of the best laptops. So is the Asus Zenbook A14, which is a lightweight laptop with an even longer battery life than the Surface Laptop 7.\nRead more:\nBest laptops of 2025\nPros\n- Optimal balance of screen size and system weight\n- M4 processor provides good balance of performance and battery life\n- Lower $1,199 starting price\nCons\n- 256GB SSD is too small for the price\n- $200 upcharge for more RAM or storage is steep\n- Smooth ProMotion display still exclusive to MacBook Pro\nThe 15-inch MacBook Air is proof that you don't need a Pro to get a larger display. It supplies a larger screen that you once found only on the pricier Pro models. If you're eyeing the 14- or 16-inch Pro models primarily for the added screen size, the MacBook Air 15 is the more affordable option you should go for, especially at its new lower starting price.\nWhy we like it\nI really enjoyed the roomy, 15.3-inch display. It made juggling multiple windows during the workday easier, and I liked watching show, movies and baseball on it in the evenings.The Apple M4 update adds incremental improvements -- and a new sky blue color -- to an already fantastic laptop that sits in the Goldilocks Zone of Apple's MacBook lineup.\nWho it's best for\nPeople looking for a big-screen MacBook who don't need the power of a MacBook Pro. With its roomy display, trim design and new lower starting price, the 15-inch M4 MacBook Air should be viewed as the default Air, with its cheaper and smaller 13-inch sibling a good alternative for students and others with tighter budgets and busy, on-the-go lifestyles.\nWho shouldn't get it\nStudents who need a more affordable and portable laptop will be better off with the 13-inch Air. Creative types who need more graphics oomph will need to spend more for the added power of a MacBook Pro. Check out our best MacBooks page for more MacBook recommendations.\nCNET’s editors recommend the M4 15-inch MacBook Air as the best overall laptop and the M4 13-inch MacBook Air as the best laptop for students. You can get them for less right now during Best Buy’s MacBook sale. Take up to $300 off any MacBook model with an M2 chip or newer – which means you can get a new MacBook now, built for Apple Intelligence, for as low as $699.\nPros\n- Beautiful, durable design\n- Class-leading battery life\n- Strong performance\n- Awesome and accurate haptic touchpad\nCons\n- No OLED option\n- Upgrades get costly and don't include dedicated GPU\n- Your Arm-on-Windows compatibility mileage may vary\nThe Surface Laptop 7 reverses earlier Arm-based efforts that were plagued by lackluster performance and limited compatibility. Many x86 apps were unable to run on an Arm-based system. This time around, performance has improved and so has compatibility.\nWhy we like it\nI like it for its polished design and class-leading battery life. The Surface Laptop 7 ran for nearly 20 hours in testing -- that’s the longest of any 13- or 14-inch laptop I've ever tested -- including the M4 MacBook Air. The Surface Laptop 7 competes with the MacBook Air in performance and battery life and supplies a similarly sleek and solid build.\nWho it's best for\nPeople who love the look and long battery life of the MacBook Air but want a Windows laptop. We wish there were an OLED display option, and you’ll need to do a compatibility check for your mission-critical applications before embracing the Arm-based Surface Laptop 7, but if you can get past those hurdles, then you’ll get a well-built, good-looking and long-running Windows ultraportable. You don't necessarily need to spend the roughly $2,000 that our test system costs; one of the lower-priced configurations that starts at $900 should meet the needs of most people.\nWho shouldn't get it\nAnyone worried about potential Windows-on-Arm compatibility issues should skip Qualcomm-based laptops and pick out an Intel or AMD model. The Surface Laptop 7 is also not the pick if you want an OLED display on your next laptop. For more, check out my other favorite Windows laptops.\nPros\n- Big performance gains from M1, Intel MacBook Airs\n- Great design, features\n- Support for two external displays simultaneously with MacBook display\n- 12-megapixel Center Stage camera\nCons\n- 256GB SSD might fill up fast\n- Expensive upgrades\nFor Apple’s latest MacBook Air, the bigger news than moving from Apple's M3 silicon to M4 chips is the drop in price.\nWhy we like it\nStarting at $999, the MacBook M4 Air is $100 cheaper than the entry point for the previous M3 models. In addition to a slight bump in performance over the previous generation, the M4 Air adds a Center Stage webcam, better support for external displays and a new ice blue color option.\nWho it's best for\nStudents and anyone looking for the most affordable and portable MacBook. My colleague, Josh Goldman, tested it and found that the M4 chip refresh adds up to a good, if minor, update to an already fantastic lightweight laptop that’s now more affordable for students and those on tight budgets. With its mix of strong overall performance, long battery life and a trim design, it’s no wonder it’s such a popular laptop for students.\nWho shouldn't get it\nAnyone who is buying a MacBook Air for toting around the house instead across campus will enjoy the roomier display of the 15-inch Air. Also, graphics pros who need the power of a Pro will need to spend more for a 14- or 16-inch MacBook Pro.\nPros\n- Incredibly thin and light without feeling flimsy\n- All-day-and-all-night battery life\n- OLED display at this price is a nice surprise\n- Ample RAM and storage for the price too\nCons\n- Meh performance from Snapdragon X CPU\n- Meh mechanical touchpad\n- Meh speakers\nBuilt around an Arm-based Qualcomm Snapdragon X processor, the Zenbook A14 is the lightest Copilot Plus PC I've tested and the second-longest running. It weighs less than 2.2 pounds and offers a battery life of more than 24 hours.\nWhy we like it\nI was hugely impressed with the Ceraluminum shell that allows the Zenbook A14 to be incredibly light yet rigid, and its 14-inch OLED display is excellent. It also serves up ample RAM and storage for the price.\nWho it's best for\nStudents and anyone who is on the road with regularity for their job. If portability is paramount, then the lightweight, long-running Zenbook A14 is the pick.\nWho shouldn't get it\nIf you are concerned about Windows-on-Arm compatibility issues, then you should skip the Zenbook A14 and find an Intel- or AMD-based laptop. I have other best lightweight laptop picks.\nBest budget laptop\nAcer Aspire 14 AI\nPros\n- Exceedingly long battery life\n- Competitive performance for the price\n- Useful port selection\nCons\n- Dull display\n- Dull design\nThis recent release from Acer's budget Aspire line is based on an Intel Lunar Lake CPU. Its Intel Core Ultra 5 226V has a neural processing unit capable of 40 trillion operations per second (TOPS) for local AI processing, which happens to be the minimum requirement for Microsoft's Copilot Plus PC platform. The Aspire 14 AI is on sale for just $500 at Amazon, making it easily the cheapest Copilot Plus PC I've reviewed.\nWhy we like it\nThe Aspire 14 AI is a great pick among budget laptops. Its performance and battery life exceed what I expected for the price, and the design is nearly the same as I've seen from Acer's more expensive Swift models. You're forced to sacrifice display quality to hit such a low price but that's an item that's usually not very high on a budget shopper's priority list. More important is getting a modern CPU that delivers sufficient performance for everyday use that's also efficient to allow for lengthy battery life -- plus a bit of future-proofing with its AI capabilities.\nWho it's best for\nBudget laptop shoppers. With the lengthy battery life we've come to expect from Copilot Plus PCs and with application and AI performance that's competitive with pricier models, the Aspire 14 AI offers great value for budget buyers looking for a Copilot Plus PC. For more, check out my other best budget laptop picks.\nWho shouldn't get it\nIf you care about the overall look of your next laptop and have the money, you can find more exciting designs. Spending more will also get you a brighter display with better color performance.\nPros\n- Strong build quality\n- Great performance for the price\n- Long battery life\n- Comfortable, quiet keyboard\n- Good port selection\nCons\n- A little on the heavy side\n- Clacky touchpad\n- Uninspired audio output\nWith its excellent build quality, adequate display, strong performance and lengthy battery life, the Yoga 7 14 Gen 9 provides a ton of value and is a great fit as a versatile machine for home use or students.\nWhy we like it\nIt's a great deal at its price of $900 at Best Buy and an even better deal at its regularly discounted price of $800 direct from Lenovo. We like its solid, all-metal chassis and the power and efficiency you get from its AMD Ryzen 7 8000-series CPU.\nWho it's best for\nAnyone looking for a flexible two-in-one for a great price, including students who might like to take notes in tablet mode. It lacks some of the refinement and extras you get with Lenovo’s flagship Yoga 9i 14, but the midrange Yoga 7 14 is much more affordable. We think it's the better option for most people.\nWho shouldn't get it\nLaptop buyers who want a lighter two-in-one with a better OLED display and better speakers -- and are willing to spend more to get those extras -- should instead consider the Yoga 9i 14. For more, check out my picks for the best two-in-one laptop.\nBest gaming laptop\nAsus ROG Zephyrus G16\nPros\n- Excellent fast, calibrated OLED screen\n- Well designed\n- Performance vs. size reasonably balanced\n- Good port selection\nCons\n- Battery life is just okay\n- Big power brick\n- Bottom and hinge areas can get hot\n- Settings in Armoury Crate software can get confusing\nThe Zephyrus G16 that my colleague, Lori Grunin, reviewed is relatively pricey at $2,700 for an upscale configuration with a 16-inch OLED screen, RTX 4080, 32GB of RAM, a 1TB SSD and an Intel Core Ultra 9 185H.\nWhy we like it\nThe ROG G16 configuration that Lori tested isn't cheap but it's a good all-around system for both gaming and creative work. She liked the huge, calibrated OLED display and performance from the pairing of the Core Ultra 9 CPU and RTX 4080 graphics. The port selection was also a positive.\nWho it's best for\nGamers who want a large screen for a more immersive gaming experience, and creators who will make use of the calibrated OLED display. Solid configurations start at $2,000, so you don't need to spend as much as the model we reviewed. If you have a smaller budget, then take a peek at our picks for best cheap gaming laptop.\nWho shouldn't get it\nThe Zephyrus G16 is a great choice for gamers, but its little sibling -- the G14 -- is a little more highly rated because of its more general-use advantages, which include size, weight and lower price.\nPros\n- Excellent 2.8K OLED display\n- Beautiful design that's also compact and lightweight\n- Competitive application and AI performance from Intel Lunar Lake CPU\nCons\n- Very expensive when not on sale\n- Battery life is good but not great\nIf you love the sleek look and great portability of a MacBook Air but need a Windows laptop for work, then HP's flagship EliteBook Ultra is a great alternative.\nWhy we like it\nWith a spectacular 14-inch, 2.8K OLED display wrapped up in an elegant and compact enclosure, the EliteBook Ultra G1i deserves its Ultra label. It definitely has a premium look and feel that I found was on par with a MacBook Air in terms of being thin and light yet rigid and sturdy. In my tests, the Intel Lunar Lake CPU proved to be a well-rounded performer with great efficiency for good battery life that'll get you through almost any work day on a single charge.\nWho it's best for\nWith its compact chassis and deluxe design, the EliteBook Ultra G1i is well suited for traveling executives or anyone who appreciates a small, lightweight OLED laptop for work.\nWho shouldn't get it\nAnyone who can't wait for it to go on sale or isn't purchasing at a quantity that qualifies for a volume-pricing discount should take a pass. At its sale price of $1,899 or $1,999, the EliteBook Ultra G1i is an excellent value and a great choice for your next work laptop, but it's harder to recommend at its full price of nearly $3,000. If you're buying a laptop for work, then I'd point you to my list of best business laptops for more recommendations.\nBest Chromebook\nAcer Chromebook Plus 514\nPros\n- Long battery life\n- Excellent webcam performance\n- Bright, matte touchscreen\n- Durable build\n- 512GB SSD\nCons\n- No keyboard backlight\n- Lots of flex on the keyboard, touchpad\n- Slower 5Gbps USB-C ports\nWhy we like it\nThis new Chromebook Plus model delivers good performance and even better battery life along with a respectably bright display with a matte finish to limit glare. It has more storage than you'd typically find at its price. The model we reviewed lacked keyboard backlighting, which was a bit of a bummer, but Acer does sell models with a backlit keyboard that aren’t that much more expensive.\nWho it's best for\nStudents and anyone looking for a Chromebook for a home office or secondary entertainment machine. It's a fixed configuration based on an Intel Core i3-N305 CPU and 8GB of RAM. Those specs might seem underpowered but suffice for ChromeOS, which is much more lightweight than Windows. With its mix of features and performance for the price, it’s easy to recommend for school, work or home.\nWho shouldn't get it\nIf you need to run a specific Windows or MacOS application, then you'll need to skip a low-cost Chromebook and choose a budget Windows laptop or MacBook Air -- we have recommendations.\nBest laptops compared\nSee the pricing and specs for our favorite laptops.\n| Starting price | Display size/resolution | Weight | CPU tested | GPU tested | |\n|---|---|---|---|---|---|\n| Apple MacBook Air 15 (M4, 2025) | $1,199 | 15.3-inch, 2,880x1,864 | 3.3 pounds | Apple M4 10‑core CPU | Apple M4 10‑core GPU |\n| Apple MacBook Air 13 (M4, 2025) | $999 | 13.6-inch, 2,560x1,664 | 2.7 pounds | Apple M4 10‑core CPU | Apple M4 8‑core GPU |\n| Microsoft Surface Laptop 7 | $1,000 | 13.8-inch, 2,304x1,536 | 2.96 pounds | Qualcomm Snapdragon X Elite X1E-80-100 | Qualcomm Adreno |\n| Asus Zenbook A14 | $1,100 | 14-inch, 1,920x1,200 OLED | 2.16 pounds | Qualcomm Snapdragon X X1-26-100 | Qualcomm Adreno |\n| Acer Aspire 14 AI | $750 | 14-inch, 1,920x1,200 | 3.05 pounds | Intel Core Ultra 5 226V | Intel Arc 130V |\n| Lenovo Yoga 7 14 Gen 9 | $900 | 14-inch, 1,920x1,200 | 3.6 pounds | AMD Ryzen 7 8840HS | AMD Radeon 780M |\n| Asus ROG Zephyrus G16 | $2,700 | 16-inch, 2,560x1,600 OLED | 4.3 pounds | Intel Core Ultra 9 185H | Nvidia GeForce RTX 4080 |\n| HP EliteBook Ultra G1i | $1,999 | 14-inch 2,880x1,800 OLED | 2.6 pounds | Intel Core Ultra 7 268V | Intel Arc 140V |\n| Acer Chromebook Plus 514 | $350 | 14-inch, 1,920x1,080 | 3.2 pounds | Intel Core i3-N305 | Intel UHD |\nMost recent additions\nThe HP EliteBook Ultra G1i is the most recent addition to the list. With its trim design, excellent build quality and high-res OLED display, it's our pick for the best business laptop.\nThe new M4 versions of the MacBook Airs are the next-newest additions. The 15-inch Air acts as the bridge between the 13-inch MacBook Air M4 and MacBook Pro line and offers fans the best of both worlds: a larger display without the MacBook Pro premium. Because Apple has dropped the price by $100 for the M4 MacBook Air models, the price gap between the Air and Pro has grown.\nOther laptops we've tested\nHP OmniBook X Flip 16: While it has a handful of appealing features, this midrange 16-inch convertible ends up being a clumsy assemblage of disparate parts.\nLenovo ThinkPad X9 14 Aura Edition: It offers a cheap path to an OLED ultraportable, but is a ThinkPad a ThinkPad without the little red nub in the middle of the keyboard?\nHP OmniBook X Flip 14: This two-in-one laptop offers style, value and configuration options abound, including a 3K OLED display for only an extra $100.\nMicrosoft Surface Laptop (13-inch): It’s compact, solidly built and great for travel, but the 13.8-inch version is the better choice as your daily driver.\nDell 14 Plus: Skip the two-in-one and opt for the clamshell laptop I tested, when it goes on sale.\nAcer Swift Go 16 (2025): Built around a beautiful 16-inch OLED screen, the latest Swift Go 16 improves on its predecessors without significant price inflation.\nDell 16 Plus 2-in-1: This big-screen, mini-LED convertible laptop certainly has some positives, but there are a few too many negatives to give this Plus a full-throated recommendation.\nLenovo ThinkPad X1 Carbon Gen 13 Aura Edition: It’s a great business laptop, but it can get pricey fast with upgrades.\nAcer Swift 14 AI: This midrange Copilot Plus PC offers incredible battery life but is missing one key feature.\nHP EliteBook X G1a: X does not mark the spot for this biz laptop when the Ultra version costs roughly the same and supplies a far better display inside a slimmer, more compact design.\nLenovo Yoga Slim 9i 14 Gen 10: It's ultrastylish and ultracompact, but maybe don't hide the camera behind the display next time?\nAcer Chromebook Plus 516: The 16-inch display provides plenty of room to work but Acer has a similar model that offers more for less.\nHP Pavilion Plus 14 (2025): Parts of the HP Pavilion Plus 14 are great but there's one poor-quality feature that totally ruins the experience.\nAcer Swift 16 AI: It's thin. It's light. It's long-running. And it boasts a big, bright 16-inch OLED display. So what's holding this Copilot Plus PC back from being more than just a big-screen productivity machine?\nHow we test laptops\nThe review process for laptops consists of two parts: performance testing under controlled conditions in the CNET Labs and extensive hands-on use by our reviewers. This includes evaluating a device's aesthetics, ergonomics and features with respect to price. A final review verdict is a combination of both objective and subjective judgments.\nWe test all laptops with a core set of benchmarks, including Primate Labs Geekbench 5 and 6, Cinebench R23, PCMark 10, a variety of 3DMark benchmarks (whichever can run on the laptop), UL Procyon Photo and Video (where supported) and our own battery life test. If a laptop is intended for PC gaming, we'll also run benchmarks from Guardians of the Galaxy, The Rift Breaker (CPU and GPU) and Shadow of the Tomb Raider.\nFor the hands-on, the reviewer uses it for their work during the review period, evaluating how well the design, features (such as the screen, camera and speakers) and manufacturer-supplied software operate as a cohesive whole. We also place importance on how well they work given their cost and where the manufacturer has potentially made upgrades or tradeoffs for its price.\nThe list of benchmarking software and comparison criteria we use changes over time as the devices we test evolve. You can find a more detailed description of our test methodology on our How We Test Computers page.\nBest time to buy a laptop\nAmazon Prime Day is a great time to find a laptop at a great price, and you might be able to nab some remaining Prime Day deals from last week's big event.\nOther times of the year when you can find the best laptop deals are during back-to-school sales in late summer or early fall and a bit later in the year during Black Friday and Cyber Monday sales. You can find discounts on laptops throughout the year but, if you're looking for the best deal and can afford to wait, these are typically the best times to buy one.\nBest laptop brands\nApple’s MacBooks are the most popular laptops and for good reason. They offer excellent build quality and leading performance and battery life ever since Apple introduced its M series processors in 2020.\nThe top two brands on the Windows side are Lenovo and HP. Both offer a wide variety of models, from thin-and-light ultraportables to larger, more powerful models for gaming content creation. Lenovo’s ThinkPads have long been a favorite among business laptops and its Yoga models are usually highly rated two-in-one laptops.\nHP is in the middle of a branding transformation. It's ended its Pavilion, Envy and Spectre laptop brands in favor of OmniBook consumer models and EliteBook business models. Its Omen brand will continue as the home for its gaming laptops. I liked the first OmniBook laptop I reviewed and look forward to testing more.\nFor a budget laptop, Acer and Apple have great options -- each dominates our best budget laptop list. Acer makes great low-cost laptops and budget gaming laptops and Apple's MacBook Air can usually be found for less than $1,000 where it's a great deal. And the older M1 model costs even less.\nFactors to consider when shopping the best laptops\nThere are a ton of laptops on the market at any given moment and almost all of those models are available in multiple configurations to match your performance and budget needs. If you're feeling overwhelmed with options when looking for a new laptop, it's understandable. To help simplify things for you, here are the main things you should consider when you start looking.\nPrice\nThe search for a new laptop for most people starts with price. If the statistics that chipmaker Intel and PC manufacturers hurl at us are correct, you'll be holding onto your next laptop for at least three years. If you can afford to stretch your budget a little to get better specs, do it. That stands whether you're spending $500 or more than $1,000. In the past, you could get away with spending less upfront with an eye toward upgrading memory and storage in the future. Laptop makers are increasingly moving away from making components easily upgradable, so again, it's best to get as much laptop as you can afford from the start.\nGenerally speaking, the more you spend, the better the laptop. That could mean better components for faster performance, a nicer display, sturdier build quality, a smaller or lighter design from higher-end materials or even a more comfortable keyboard. All of these things add to the cost of a laptop. I'd love to say $500 will get you a powerful gaming laptop, for example, but that's not the case. Right now, the sweet spot for a reliable laptop that can handle average work, home office or school tasks is between $700 and $800 and a reasonable model for creative work or gaming is upward of about $1,000. The key is to look for discounts on models in all price ranges so you can get more laptop capabilities for less.\nOperating system\nChoosing an operating system is part personal preference and part budget. For the most part, Microsoft Windows and Apple's MacOS do the same things (except for gaming, where Windows is the winner), but they do them differently. Unless there's an OS-specific application you need, go with the one you feel most comfortable using. If you're not sure which that is, head to an Apple store or a local electronics store and test them out. Or ask friends or family to let you test theirs for a bit. If you have an iPhone or iPad and like it, chances are you'll like MacOS, too.\nIn price and variety (and PC gaming), Windows laptops win. If you want MacOS, you're getting a MacBook. Apple's MacBooks regularly top our best lists, the least expensive one is the M1 MacBook Air for $999. It is regularly discounted to $750 or $800, but if you want a cheaper MacBook, you'll have to consider older refurbished ones.\nWindows laptops can be found for as little as a couple of hundred dollars and come in all manner of sizes and designs. Granted, we'd be hard-pressed to find a $200 laptop we'd give a full-throated recommendation to but if you need a laptop for online shopping, email and word processing, they exist.\nIf you are on a tight budget, consider a Chromebook. ChromeOS is a different experience than Windows; make sure the applications you need have a Chrome, Android or Linux app before making the leap. If you spend most of your time roaming the web, writing, streaming video or using cloud-gaming services, they're a good fit.\nSize\nRemember to consider whether having a lighter, thinner laptop or a touchscreen laptop with a good battery life will be important to you in the future. Size is primarily determined by the screen -- hello, laws of physics -- which in turn factors into battery size, laptop thickness, weight and price. Keep in mind other physics-related characteristics, such as an ultrathin laptop isn't necessarily lighter than a thick one, you can't expect a wide array of connections on a small or ultrathin model and so on.\nScreen\nWhen deciding on a screen, there are a myriad number of considerations: How much you need to display (which is surprisingly more about resolution than screen size), what types of content you'll be looking at and whether you'll be using it for gaming or creative work.\nYou really want to optimize pixel density; that is, the number of pixels per inch the screen can display. Although other factors contribute to sharpness, a higher pixel density usually means a sharper rendering of text and interface elements. (You can easily calculate the pixel density of any screen at DPI Calculator if you don't feel like doing the math, and you can also find out what math you need to do there.) I recommend a dot pitch of at least 100 pixels per inch as a rule of thumb.\nBecause of the way Windows and MacOS scale for the display, you're frequently better off with a higher resolution than you'd think. You can always make things bigger on a high-resolution screen, but you can never make them smaller -- to fit more content in the view -- on a low-resolution screen. This is why a 4K, 14-inch screen may sound like unnecessary overkill but may not be if you need to, say, view a wide spreadsheet.\nIf you need a laptop with relatively accurate color that displays the most colors possible or that supports HDR, you can't simply trust the specs -- not because manufacturers lie, but because they usually fail to provide the necessary context to understand what the specs they quote mean. You can find a ton of detail about considerations for different types of screen uses in our monitor buying guides for general purpose monitors, creators, gamers and HDR viewing.\nProcessor\nThe processor, aka the CPU, is the brains of a laptop. Intel and AMD are the main CPU makers for Windows laptops, with Qualcomm as a new third option with its Arm-based Snapdragon X processors. Both Intel and AMD offer a staggering selection of mobile processors. Making things trickier, both manufacturers have chips designed for different laptop styles, like power-saving chips for ultraportables or faster processors for gaming laptops. Their naming conventions will let you know what type is used. You can head to Intel's or AMD's sites for explanations so you get the performance you want. Generally speaking, the faster the processor speed and the more cores it has, the better the performance will be.\nApple makes its own chips for MacBooks, which makes things slightly more straightforward. Like Intel and AMD, you'll still want to pay attention to the naming conventions to know what kind of performance to expect. Apple uses its M-series chipsets in Macs. The entry-level MacBook Air uses an M1 chip with an eight-core CPU and seven-core GPU. The current models have M2-series silicon that starts with an eight-core CPU and 10-core GPU and goes up to the M2 Max with a 12-core CPU and a 38-core GPU. Again, generally speaking, the more cores it has, the better the performance.\nBattery life has less to do with the number of cores and more to do with CPU architecture, Arm versus x86. Apple’s Arm-based MacBooks and the first Arm-based Copilot Plus PCs we’ve tested offer better battery life than laptops based on x86 processors from Intel and AMD.\nGraphics\nThe graphics processor handles all the work of driving the screen and generating what gets displayed, as well as speeding up a lot of graphics-related (and increasingly, AI-related) operations. For Windows laptops, there are two types of GPUs: integrated (iGPU) or discrete (dGPU). As the names imply, an iGPU is part of the CPU package, while a dGPU is a separate chip with dedicated memory (VRAM) that it communicates with directly, making it faster than sharing memory with the CPU.\nBecause the iGPU splits space, memory and power with the CPU, it's constrained by the limits of those. It allows for smaller, lighter laptops, but doesn't perform nearly as well as a dGPU. There are some games and creative software that won't run unless they detect a dGPU or sufficient VRAM. Most productivity software, video streaming, web browsing and other nonspecialized apps will run fine on an iGPU.\nFor more power-hungry graphics needs, like video editing, gaming and streaming, design and so on, you'll need a dGPU; there are only two real companies that make them, Nvidia and AMD, with Intel offering some based on the Xe-branded (or the older UHD Graphics branding) iGPU technology in its CPUs.\nMemory\nFor memory, I highly recommend 16GB of RAM (8GB absolute minimum). RAM is where the operating system stores all the data for currently running applications and it can fill up fast. After that, it starts swapping between RAM and SSD, which is slower. A lot of sub-$500 laptops have 4GB or 8GB, which in conjunction with a slower disk can make for a frustratingly slow Windows laptop experience. Also, many laptops now have the memory soldered onto the motherboard. Most manufacturers disclose this but if the RAM type is LPDDR, assume it's soldered and can't be upgraded.\nSome PC makers will solder memory on and also leave an empty internal slot for adding a stick of RAM. You may need to contact the laptop manufacturer or find the laptop's full specs online to confirm. Check the web for user experiences because the slot may still be hard to get to, it may require nonstandard or hard-to-get memory or other pitfalls.\nStorage\nYou'll still find cheaper hard drives in budget laptops and larger hard drives in gaming laptops but faster solid-state drives have all but replaced hard drives in laptops. They can make a big difference in performance. Not all SSDs are equally speedy, and cheaper laptops typically have slower drives; if the laptop only has 4GB or 8GB of RAM, it may end up swapping to that drive and the system may slow down quickly while you're working.\nGet what you can afford and if you need to go with a smaller drive, you can always add an external drive or two down the road or use cloud storage to bolster a small internal drive. The one exception is gaming laptops: I don't recommend going with less than a 512GB SSD unless you really like uninstalling games every time you want to play a new game.\nFrequently asked questions\nHow much money should I spend on a laptop?\nJudging from the current selections on our list, I recommend spending $600 or more for a midrange laptop and at least $1,000 and probably closer to $2,000 on a gaming laptop. We’ve already seen price hikes on many laptop models since the Trump tariffs began earlier this year. Acer's Jason Chen said in February that the company would raise its prices by 10% in anticipation. \"We will have to adjust the end user price to reflect the tariff,\" the CEO of the Taiwan-based company said.\nThe Trump administration has eased up somewhat on its tariffs against China, dropping the overall rates from 145% to 30% for 90 days, while trade negotiations continue. While this temporary cut may help prevent further price increases, I haven’t seen any price reductions outside of sales. And if you are patient, you can usually find the model you want on sale. Laptop vendors and online retailers are constantly rotating sales so it pays to keep an eye on pricing and buy during a dip. During the summer, check out laptop sales for dads and grads and then back-to-school sales.\nWhich is better: MacOS or Windows?\nDeciding between MacOS and Windows laptops for many people will come down to personal preference and budget. Apple's base model laptop, the M1 MacBook Air, starts at $999. You can sometimes find it discounted or you can get educational pricing from Apple and other retailers. In general, it'll be at least $1,000 for a new MacBook and the prices just go up from there.\nFor the money, you're getting great hardware top to bottom, inside and out. Apple recently moved to using its own processors, which resulted in across-the-board performance improvements compared to older Intel-based models. The company's most powerful laptop, the 16-inch MacBook Pro, still hasn't been updated to Apple silicon.\nAgain, that great hardware comes at a price. Also, you're limited to just Apple laptops. With Windows and Chromebooks (more on these below), you get an amazing variety of devices at a range of prices.\nSoftware between the two is plentiful so unless you need to run something that's only available on one platform or the other, you should be fine to go with either. Gaming is definitely an advantage for a Windows laptop.\nMacOS is also considered to be easier and safer to use than Windows, especially for people who want their computers to get out of the way so they can get things done. Over the years, Microsoft has done its best to follow suit and, with Windows 11 here, it's trying to remove any barriers. Also, while Macs might have a reputation for being safer, with the popularity of the iPhone and iPad helping to drive Mac sales, they've become bigger targets for malware.\nAre there any laptop accessories I might need?\nIf you plan to travel with your laptop, whether across campus or the country, a good laptop backpack is essential. There are a lot of subpar backpacks out there, so check our best laptop backpacks list for our recommendations based on hours and hours of testing.\nAnd for when you aren’t on the move but at your desk and ready to work, a laptop cooling pad can help your laptop run smoothly. From gaming and video editing to just having dozens of Chrome tabs open, there are times when your laptop needs some help to stay cool and maintain full performance. Our sister site ZDNet has a good list of the best laptop cooling pads.\nAre Chromebooks worth it?\nYes, they are, but they're not for everyone. Google's Chrome OS has come a long way in the 10-plus years since they arrived and Chromebooks -- laptops that run on Chrome OS -- are great for people who do most of their work in a web browser or using mobile apps. They are secure, simple and, more often than not, a bargain. What they can't do is natively run Windows or Mac software."
    },
    {
      "url": "https://www.cnet.com/home/energy-and-utilities/best-alkaline-batteries/",
      "text": "Rechargeable lithium-ion batteries might be in your phones and laptops, but a simple alkaline battery is still the go-to for a whole host of electronics, large and small. Whether it's your TV's remote, a gaming controller, a flashlight or a smoke alarm, alkaline batteries often provide the power. You might not think too much of it, but there are differences between them. Some alkaline batteries have a longer shelf life, while others run for longer before they need to be replaced.\nOur Picks\nHere at CNET, our experts have lab tested a wide range of alkaline batteries to find the longest-lasting options across different price ranges. From standard AAs to 9-volts, we conducted discharge tests and calculated the cost per battery to help you get the best value.\nAll of these batteries are top performers for your everyday devices and are also a great option for people who need reliable power for kids' toys and more. We’re looking at you, Reddit folks, asking about the best batteries to buy.\nOur guide will walk you through all our top picks based on real-world performance, starting with Amazon's own brand of AAA batteries, which many buyers may go for as their first choice.\nPros\n- Reliable discharge\n- Great value\nThe competition for the best AAA battery was closely contested, as all competing brands demonstrated similar performance in our discharge test. Affordability and reliability played a significant role in our evaluation.\nAmazon AAA batteries emerged as the most reliable during our discharge test. They exhibited consistently repeatable results across three different runs and boasted the longest average discharge time, at 28 minutes, 32 seconds.\nMoreover, if you're considering buying in bulk, this option is by far the better choice. The 36-pack was priced at $14.50, translating to approximately 40 cents per unit. Now that's true value.\nPros\n- Reliable and long-lasting power\n- Good value\nAA batteries are likely the most popular battery size, given their widespread use in a variety of electronic devices. They don't hold as much charge as a C or D battery, which means you're probably going to be replacing them a lot. Again, it comes down to bulk price and performance.\nThe two leading AA battery brands, Energizer and Duracell, stood out in the competition. While they displayed similar performance, Energizer had a slight edge. A single Energizer AA Max battery powered three fan motors arranged in parallel for an impressive average of 30 minutes, 15 seconds, marking the best score among the group. The decisive factor between the two brands turned out to be price.\nFurthermore, Energizer AA Max batteries are the second most affordable option. The 20-pack is currently priced at approximately $13 at the time of this publication. With outstanding performance and an affordable price, if you're in the market for AA batteries to power your electronics this summer, this is the optimal choice.\nPros\n- Outperformed the competition\nCons\n- Expensive\nThis one was straightforward. Duracell outperformed its competition convincingly. The only caveat is that this may not be your most budget-friendly option. Since C batteries are primarily used for medium-drain devices like cameras, radios and even some intruder alarms, longevity and reliability are paramount.\nIn our discharge test, Duracell C-type batteries powered four fan motors in parallel for an outstanding average of 25 minutes and 42 seconds, nearly doubling the average duration achieved by other competing brands. Quality sometimes comes at a price, and Duracell C batteries are no exception. The 10-pack is priced at roughly $21 at the time of this publication, totaling roughly $2 per unit, the highest price per unit in this category.\nPros\n- Excellent performance\n- Long lasting\nCons\n- Second most expensive\nD batteries are predominantly used in high-current drain devices that require prolonged running times and emergency gadgets such as flashlights, radio transmitters, and even some water heaters. It should come as no surprise that, in this case, we particularly value performance over price.\nAmazon D batteries excel in performance. They were able to sustain our five-motor parallel circuit for nearly 18 minutes on average, the highest score in this category. Impressively enough, they maintained a voltage output higher than 1.2 volts throughout each of the three runs. That's a lot of juice.\nThat said, they are the second priciest option on our list. The 4-pack is priced at approximately $9 at the time of this publication, translating to roughly $2.25 per unit.\nPros\n- Outperformed the competition\n- Most cost-effective option\n9-volt batteries deliver higher voltage but possess less overall charge, resulting in a shorter lifespan compared to their 1.5-volt counterparts. They are ideal for high-voltage, low-drain applications such as smoke alarms, portable electronics, tools and even the multimeter we used in this test.\nIn our focused analysis, we observed the battery's ability to maintain high voltage output throughout its usable life. Amazon 9-volt batteries not only significantly outperformed other brands in terms of discharge time and voltage output under load, but they also stood out as the most cost-effective option, priced at only $1.16 per unit for a 24-pack at the time of this publication.\nThis makes it the only brand we tested in this category available for less than $2 per unit. In our discharge test, Amazon 9-volt batteries sustained our battery test rig for over 36 minutes -- nearly three times longer than their competitors. This makes them the clear winner across all metrics.\nBest alkaline batteries compared\n| Amazon Basics AAA alkaline batteries | Energizer Max AA alkaline batteries | Duracell C alkaline batteries | Amazon Basics D alkaline battery | Amazon Basics 9V battery | |\n|---|---|---|---|---|---|\n| Brand | Amazon Basics | Energizer | Duracell | Amazon Basics | Amazon Basics |\n| Model | Alkaline High Performance | Max | Coppertop C | D Cell Alkaline | 9V Alkaline |\n| Battery size | AAA | AA | C | D | 9V |\n| Quantities available | 8, 12, 36, 100 | 2, 4, 8, 10, 12, 20, 24 | 2, 4, 8, 10, 14 | 4, 12, 24 | 4, 8, 12, 24 |\n| Price per battery | $0.85 (8-pack) | $2.02 (2-pack) | $2.24 (4-pack) | $2.25 (4-pack) | $2.45 (4-pack) |\n| Capacity (mAh rating) | 1,340mAh | NA (~3,000 mAh typical) | NA (~7,000 mAh typical) | NA (~10,000mAh typical) | NA (~550mAh typical) |\nHow we test batteries\nFor this round of testing, we gathered four of the most popular battery brands and tested five battery categories, including AAA, AA, C, D and 9-volt. Our objective was to find out which battery manufacturer offered the best value for your money. To assess battery performance, we used our custom-built battery test rig and timed the longevity of each battery, paying attention to their voltage output over time, and compared the difference in price per unit.\nBattery performance and voltage drop\nMeasuring battery voltage output is more complex than simply sticking multimeter probes on the positive and negative ends of the battery. For instance, AA, AAA, C and D batteries are rated at 1.5 volts. If you measure voltage output directly on the battery, the reading may be close to 1.6 volts, which is generally a good sign for a new battery. Even batteries that are no longer usable can display a value equal to or higher than 1.5 volts when measured directly. The correct approach is to test voltage output under a load condition, such as when the battery is connected to a resistor or powering a device. Meet the CNET Labs Battery Test Rig:\nComponents include two breadboards, one for 1.5-volt batteries and one for 9-volt, six motor fans that can be arranged conveniently either in series or in parallel, a switch for each circuit, one multimeter for voltage readouts, a chronometer and five battery slots for each type of battery: AAA, AA, C, D and 9-volt.\nThe testing logic is simple but revealing. To get the full picture, let's refresh ourselves with a bit of electronic basics. The number of active load components and the circuit arrangement depend on the type of battery under test. For the 1.5-volt group (AAA, AA, C and D batteries), we arranged the circuit loads in parallel, increasing the number of loads according to the capacity of the battery. This ensures that, regardless of the power source and number of loads, all load components are exposed to the same amount of voltage from such a power source — in this case, any of the 1.5-volt batteries. For example, AA batteries are tested using three motors in parallel, ensuring that all three motors get 1.5 volts each.\nFor the 9-volt types, we arranged six load components in series. A series arrangement evenly distributes the voltage from the power source across all load components. Since each of our fan motors takes at least 1.5 volts to run, using a 9-volt battery provides 9-volt/6 loads = 1.5-volt per load.\nHaving established the basics, we proceed to testing. First, we ensure to connect our multimeter probes in parallel and take an initial voltage reading. Then, we make sure our circuit arrangement is adequate for the type of battery under test and flip the switch on. We start our timer and monitor the test, recording data readouts for voltage output under load every minute until the very last fan stops spinning. We run a \"last man standing\" competition. In our test logic, the battery that sustains the load arrangement the longest wins. The voltage drop allows us to see how efficiently the battery maintains a high voltage output given the test conditions. In this regard, the slower the drop in voltage, the better.\nHere are the results, starting with an overall look at the average discharge time for each battery we tested. Longer bars indicate batteries that lasted longer in our test rig.\nHere's a more detailed look at those results, with the specific, minute-by-minute dip in the average voltage readings for each battery during each test. Again, we're looking for the batteries that last the longest in this test, but more specifically, we're looking for batteries with as gradual a voltage drain as possible.\nPrice per unit\nThe cost of batteries can vary greatly depending on where and when you buy them. For that reason, we sought out the most economical source for each battery and compared the price per unit. Check out the table below, which we'll update regularly:\nOther alkaline batteries we've tested\nDuracell AAA: Second-highest price per unit but a close contender for best performance. Not a bad deal.\nEnergizer AAA: Lowest performance among the options, and the second most affordable. Not the best quality choice.\nAmazon Basics AA: Impressively low performance, nearly half the average run times of competitors. However, it's the cheapest option.\nDuracell AA: Highest price per unit, but the second-best performer and a close contender for the best pick.\nRayovac AA: Second most costly AA battery with moderate performance. Not necessarily the top option available.\nAmazon Basics C: Lowest price per unit among C types, significantly cheaper than the competition. A good choice for bulk purchases.\nEnergizer C: Priced closely with others but lacking in performance, securing last place with an average run time of only 4 minutes.\nRayovac C: Priced similarly to competitors, offering low performance but not the worst.\nEnergizer D: A potential splurge pick with great performance but higher cost compared to others.\nDuracell D: Falls in the median for both performance and price, lacking any remarkable features.\nRayovac D: The most affordable D battery, suitable for bulk purchase with acceptable performance.\nEnergizer 9V: Hard to justify due to its higher price and failure to outperform the competition.\nDuracell 9V: The most expensive option, tying for last place with Rayovac in terms of battery lifetime.\nRayovac 9V: Takes the last place in performance but offers better pricing than the competition.\nRayovac AAA (out of stock): Most expensive AAA battery with room for improvement in performance, ranking second to last."
    },
    {
      "url": "https://www.cnet.com/home/kitchen-and-household/best-smart-lights/",
      "text": "No smart device is quite so simple as a smart light: These LED bulbs and light strips can last for years, let you control them from anywhere or set up automatic schedules and offer many color-changing or syncing tricks. You can also control them on demand with a simple voice command or connect them to other smart home routines you have, like turning on when your door is unlocked.\nOur Picks\nSMART LIGHT BULB DEALS OF THE WEEK\n- $110 (save $20)\n- $99 (save $61)\n- $19 (save $6)\n- $28 (save $12)\nI and other CNET reviewers have tested dozens of the latest smart lights from top brands like Philips Hue, Lifx, Govee, GE Cync and many others. I ultimately chose nine of the very best to use inside and outside of your home.\nWhat is the best smart light?\nMy top pick, especially for anyone just starting out with smart lights, is the ultra-simple Wiz Tunable bulb. There's not much this small bulb can't do, from Matter compatibility for Alexa, Google Home and Siri to 16 million color options and the ability to change brightness levels. And because you can find this bulb for about $10, it's not hard to switch multiple bulbs in your home over to smart versions.\nBest smart lights\nPros\n- Very affordable\n- No hub required\n- Matter support for Alexa, Siri and Google Home\n- Color changing\n- Motion-sensing when multiple bulbs are added\nCons\n- Not for every scenario like outdoor lighting\n- Brightness is a little low at 800 lumens compared to some of my picks\nWhy I like it:\nAfter testing more smart bulbs that I can count, I kept returning to this convenient Wiz bulb that had everything I wanted in a standard A19/E26 home bulb filled with smart features, all for about $10. For the latest updates to the list, I upgraded Wiz’s model to the color version, which is only about $2 more expensive and gives you millions of colors to choose from if you want.\nOtherwise, the bulb shines with its Matter support that allows you to use Siri, Alexa, or Google Home to control the bulb and connect it to smart home routines, without the need for any additional app. There are also lots of scheduling options and automation tricks, from only turning on after sunset to reacting to motion as someone moves throughout the house.\nWho is this for:\nAnyone looking for a cheap smart bulb that fits in any standard home socket and works with everything without a hub.\nWho shouldn't buy it:\nThose looking for more complex color and syncing options or people who need a floodlight or other type of bulb.\nPros\n- Great bulb design\n- Useful app UI with quick mood and scene options without a lot of tinkering\n- Lots of brightness options to choose from\n- White or color ambiance\nCons\n- The bulb is already pricey at about $45 and requires an expensive hub to enable remote app controls\nWhy I like it:\nSmart floodlight bulbs exist too and they’re perfect for larger indoor spaces (especially because they tend to last a lot longer than incandescents before you need to replace them). I’ve testing many LED floodlights, and one of my favorite smart versions is this Philips Hue mode.\nPhilips Hue is a particularly reliable brand for durability, app UI and smart features. This bulb shows off with white and color options, detailed brightness settings and a variety of scenes you can pick from and set to get just the shade you want without having to mess with app controls very much.\nThe bulb works automatically with Bluetooth, Alexa and Google Home, but to add remote control through Wi-Fi (which I highly recommend) or Apple compatibility, you will need a Hue Bridge ($65). It’s the one issue that Philips Hue still struggles with for many of its bulbs, so consider the extra cost before you buy.\nWho is this for:\nBuyers willing to invest in the Philips Hue ecosystem to support an array of durable LED floodlights and other lighting.\nWho shouldn’t buy it:\nPeople who want to avoid paying extra for a bridge device or people who don’t want a color floodlight.\nPros\n- Unique four-part color lighting for imaginative lighting\n- No hub required\n- Excellent app UI for controls\nCons\n- No Apple support\n- Slightly dim for a floodlight bulb\nWhy I like it:\nI bet you’ve never seen a floodlight bulb quite like this before. I certainly came away impressed after testing the GE Cync Dynamic Effects bulb, which has four quadrants that can each turn a different color according to your settings, mixing and matching shades to provide the ideal ambiance for anything from parties and movie nights to romantic dinners or Christmas get-togethers.\nIf you love color changing, this bulb gets top marks but I am also very impressed with the Cync app, which is especially easy to understand and use for such a complex bulb. It also offers music syncing for more in-depth displays. Amazon and Google Home support is a welcome addition but there’s no Apple support here yet.\nWho is this for:\nBuyers who want to play with colors to get the perfect room ambiance, even with just one bulb.\nWho shouldn’t buy it:\nPeople who need Apple support, users who find the four-quadrant color thing too complicated or buyers who don’t want a floodlight bulb.\nPros\n- Easy setup\n- Very affordable\n- A handy group control option\n- Fun sunlight-matching and similar settings\n- No hub needed\nCons\n- No Apple support\n- No color options\nWhy I like it:\nIf you’re looking for a quick, cheap bulbs, especially a multi-bulb solution for several upgrades around your home, Wyze bulb packs don’t disappoint. I found these bulbs, which are just as affordable as my $10 top pick, to be especially easy to set up and control. That’s even more true if you purchase multiple bulbs at once, thanks to the smart group control setting.\nWhile these bulbs are white light only, I appreciated how there were still customization options, including changing the color temperature to warmer or cooler colors, matching the sunlight color throughout the day and shifting the brightness. Alexa and Google Home controls are supported, as are scheduling and on-demand timers to turn the bulbs off after a certain period.\nWho is this for:\nBuyers who want cheap smart bulbs that are easy to control in groups.\nWho shouldn’t buy it:\nUsers who prefer the option to change color or who need floodlight bulbs.\nPros\n- High 1,100 lumen brightness\n- Matter support for Alexa, Google Home and Siri\n- Easy ways to change brightness or color temperature as needed\nCons\n- Slightly more expensive than the most affordable smart bulbs unless you find it on sale\nWhy I like it:\nTapo’s bulb is another great smart color light that remains quite affordable, similar to my top Wiz pick. However, I gave this bulb a different accolade -- at 1,100 lumens, it’s one of the brightest on my list, a handy fit for dark spaces that need extra illumination or craft rooms/workbenches that need to push brightness to high levels during certain projects.\nTapo’s bulb is also Matter-certified, so it works with Alexa, Google Home, and Apple Siri. If you don’t like that brightness, you can shift it down or switch to another color, or adjust the color temperature to a warmer option. That makes this bulb a complete answer for all kinds of illumination.\nWho is this for:\nPeople looking for an especially bright smart bulb that remains affordable and can also change color.\nWho shouldn’t buy it:\nBuyers more interested in soft, lower-brightness lighting or buyers who need floodlights.\nPros\n- IP65 weather resistance\n- 1,100 lumens\n- Color changing\n- Support for Alexa, Google Home, and Apple\nCons\n- Won’t fit in every outdoor light space, like lights that need to be wired in\nWhy I like it:\nMost smart home lighting is indoor-only bulbs, but I’ve tested a few outdoor models as well. This Lifx model proved to be my favorite, combining a high 1,100 lumen rating with IP65 weather resistance for outdoor use. It also supports Wi-Fi without needing an indoor hub, and works with Alexa, Google Home/Gemini and Apple Siri. You can even change the color and color temperature to what suits your home routine best. That’s quite the complete package for an outdoor bulb, just make sure your socket supports a BR30/E26 bulb design.\nWho is this for:\nBuyers looking for an outdoor smart light\nWho shouldn’t buy it:\nPeople who need to have an outdoor light connection that doesn’t support a BR30 design/E26 base.\nPros\n- Smart color changing\n- Expansive music syncing options with 11 modes\n- Dozens of scenes for pre-made effects\n- Multiple lengths\nCons\n- Cannot be cut to size\n- So many modes may be confusing for some users\nWhy I like it:\nI’ve been impressed with Govee light strips in the past, but this newer model is one of the best possible if you want to pick a light strip of a certain length while still giving it plenty of smarts. Those smarts come courtesy of the detailed Govee app, which allows you to customize colors, enable music sync (with 11 music modes to play around with) or choose from different scenes depending on the mood of the room. The strips also work with Alexa and Google Home.\nObviously, light strips aren’t for everyone but I’ve found them to be a handy and sometimes beautiful solution for outlining displays, TVs, bedframes and stairs around the home. Just make sure you choose the right length, which varies from 16.4 to 100 feet. You can’t cut this smart light strip to size.\nWho is this for:\nBuyers looking for smart accent lights that can sync to music or party themes with detailed app controls.\nWho shouldn’t buy it:\nPeople who don’t want smart strip light or buyers looking for the kinds of strip lighting you can cut.\nPros\n- Smart LED panels for colorful and imaginative displays\n- Govee’s light syncing and scenes options\n- Alexa and Google support\n- Tech makes app controls for colors easy to use\nCons\n- One panel will need to have a nearby plugin\n- No Apple support\nWhy I like it:\nFor a more entertaining, front-and-center smart lighting choice, this Govee smart panel set can be a centerpiece or an accompaniment to another display. The little light square (a set of 20, but the adapter supports up to 70) are highly versatile, whether you are giving a bedroom some mood lighting or setting up a gaming space. You’ll want one of the lights close enough to an outlet to plug in, but otherwise you’re free to plot your own shapes.\nGovee’s color options are on full display here, with dozens of scenes and music sync options. Plus, with Matter support you can use Google and Alexa to control them, although Apple hasn’t quite made it here yet.\nWho is this for:\nBuyers with an eye for entertaining, customizable light shows and a big imagination.\nWho shouldn’t buy it:\nPeople who want more traditional lights used primarily for illumination.\nPros\n- Solar powered\n- Works with other Ring products and Alexa\n- Simple setup\nCons\n- Requires Ring Bridge\nWhy I like it:\nOutdoor lighting is key to a safe and secure home, so upgrading to smart outdoor lights that double as motion detectors and sync with your security system makes a lot of sense. For my money, the best way to get there is with Ring, which offers a full portfolio of affordable outdoor smart lights, all of which can sync up with your Ring cameras and sync up with Alexa for voice control, too.\nMy favorites of the bunch are the Ring Pathlights, especially the new solar-powered version pictured above. At just $30 a pop on Amazon, each one includes a built-in motion sensor that can turn on a light or a group of lights whenever someone passes by, and they can trigger your Ring cameras to start recording, too. That's a great way to build a smart home that's aware of what's going on outside.\nYou'll need a Ring Bridge in your home to use the more advanced smart features (which I recommend), but these often come bundled with the Pathlight so you can save money.\nWho is this for:\nBuyers looking for a smart light that can illuminate a path, porch, deck step or similar spot.\nWho shouldn’t buy it:\nPeople who don’t want any smarts on their landscaping lights, users who don’t like Alexa or buyers who want serious illumination instead of safety lights.\nOther smart lights we tested\nKasa Smart Light Bulb: TP-Link’s Kasa brand bulb is another cheap and effective smart light option, although it was slightly outclassed by the Tapo mode and a couple of my other best budget picks.\nGovee LED Smart Light Bulb: Govee’s color smart bulb is an excellent choice if you like to play with colors, which is one reason I chose Govee for more entertainment-oriented picks on this list.\nPhilips Hue White Ambiance Bulb: This white bulb is a fine example of Philips Hue lighting, but overall I prefer the color version so people have the option to change things up.\nPhilips Hue Smart 75W A19 LED Bulb: Hue bulbs can be a good choice if you plan on getting a lot of them, but most Hue bulbs need a hub, which keeps many of them off my list in favor of bulbs that have Wi-Fi capabilities built in.\nSengled Smart LED Color Changing Bulb: I’ve tested Sengled’s bulb and I like it but it’s almost twice as expensive as other bulbs that do all the same things and requires a hub for full functionality, keeping it off the list.\nLutron Caseta Original Smart Dimmer Switch: This dimmer switch tested very well, although I decided to leave it off a list focusing on the lights themselves. However, if you prefer a smart switch instead, this is a great starting point.\nSylvania Smart Plus: Much like Sengled, this light bulb is held back by the higher price and a need for a hub.\nGovee Envisual TV LED Backlight: This is, hands down, the best TV backlight I’ve ever seen and it’s almost scarily smart, although you will need to attach a little camera to the top of your TV for the full effect. It didn’t quite make this list, which is focused on more general smart lighting, but for a home theater this is certainly an option.\nFactors to consider when choosing a smart light\nAny smart LED bulb excels at saving energy. That’s why they use “watt equivalent” numbers and lumens, because the actual wattage is so low. But what else should you look for when buying your bulb? Here are several features I think are especially important.\nIs a hub required?\nSome smart lights require a hub to connect to Wi-Fi and allow for remote operation, which is a very useful feature for most homes. Fortunately, most newer bulbs no longer need hubs, but you still find some models where it’s required. I always prefer versions that don’t require hubs to work, as it’s so much easier.\nBrightness\nThe average smart bulb is about 800 lumens but has the option to control brightness levels. Some LED panels and more specialized bulbs go beyond 1,000 lumens if you want a higher brightness level.\nColor changes\nYou don’t always need a bulb that can change colors, but it’s a useful addition for home routines, various kinds of mood lighting and other tricks. I try to recommend bulbs with color options when possible, especially as there’s no longer much difference in price for a color upgrade.\nColor temperature\nColor temperature, measured in Kelvin, describes how cool or warm a light looks. Even if a smart light can’t fully change color, it’s often valuable to find a light that can switch color temperatures to find exactly the look you want.\nApp controls\nSmart light controls should be easy to use with useful settings and clear UI. Smart lights are generally simple products: The apps shouldn’t be confusing at all. If you already have a preferred brand in tech apps, see if they have smart lights. Additional features like sunrise/sunset settings and quick scheduling are also welcome.\nMusic syncing\nSome smart lights have the ability to sync to music. If that’s important for your plans, choose a bulb with these capabilities. Brands like Philips Hue, Govee and, yes, GE Cync have options to enable automatic music syncing in their apps.\nVoice assistant and app support\nIf you have a preferred voice assistant or a preferred home platforms like Alexa, Google Home, Apple Home, etc., make sure your smart bulb supports it. Most smart bulbs support multiple platforms, but Apple support is a little less common.\nType of bulb socket\nCommon home light bulbs use E26 sockets but you should always double-check the sockets or connections in the lights you want to make sure you are getting a smart light that will fit them.\nIndoor/outdoor\nMany smart lights are indoor but it can also be useful to install an app-controlled light on a porch, patio or other outdoor area. If the bulb is going to be exposed to the weather, it needs to have weather resistance like an IP rating, or it could stop working.\nHow we test smart lights\nAt CNET, we’ve tested more smart bulbs and smart lighting products than we can count. There’s a bit more to it than just finding an empty socket and screwing in a bulb. Here’s what we look for when we test.\nBrightness and color\nWe check that the light bulb meets its expected lumen level and test different levels of brightness to make sure it can dim reliably and accurately. If the bulb has color options, we test a variety of colors to check their accuracy and how they affect a room.\nApp use and settings\nWhen we pull out the smart light app, we have several questions. Is the bulb easy to set up and connect? Is the app easy to navigate and understand, especially when you’re looking for a certain setting? Does the app protect your privacy while making logins simple? Does it have annoying ads or screen clutter?\nGeneral design and durability\nWe also check to make sure the smart bulb is well-designed and not easily damaged during use. When possible, we test smart bulbs for at least several days to see if they experience any issues with unexpected burnout or performance problems.\nSmart home platform support\nThis is also the time we bring up apps like Apple Home, Google Home and Alexa to see how easy the smart bulbs are to detect and connect, and if those connections are stable over time.\nSyncing and tricks\nMany smart bulbs offer extra features, like syncing to music or the ability to change based on daylight in the region. We also pull up settings like these and play with them to make sure they work correctly and are useful or at least fun.\nRecent updates\nAugust 2025: I gave our guide a complete update with the latest models that I and other CNET reviewers have tested, making sure we’re only recommending the latest and greatest lights for your home. The new list includes picks from brands we’ve liked for years, including Wiz, Tapo, Govee and Cync.\nFAQs on smart lights\nWhich smart lighting system is the best?\nThe choice depends on your home and specific needs. My list above includes my favorite brands for this kind of lighting, such as Wiz, Tapo, Philips Hue, Lifx, Govee and GE Cync, which are all hard to go wrong with. Just make sure the lights you choose have the customization options that you really want.\nIs it worth getting smart lights?\nIn most cases, yes. Their LEDs tend to last a long time while saving electricity compared to other types of lighting, and that alone is useful. The smart features allow you to control your lighting from anywhere or set it to the exact brightness and color that you like, options that normal lights just don’t have. I’m not saying every light in your home needs to be smart, but at least a few can be helpful.\nDo smart lights work without Wi-Fi?\nYes, many smart lights can work with Bluetooth. However, without a Wi-Fi connection, you won’t be able to control your lights when you’re away from home, only when you’re in closer range.\nDo smart lights deter burglars?\nBurglars are most likely to be deterred by lights connected to a smart security camera that can shine a spotlight or floodlight when they detect a human approaching. Standard smart lights don’t do much to prevent trespassers on their own."
    },
    {
      "url": "https://www.cnet.com/deals/the-govee-floor-lamp-2-is-my-favorite-smart-lamp-and-its-21-off-right-now/",
      "text": "Govee has made a name for itself in the smart lighting business as an affordable alternative to other brands, like Philips Hue. So when I decided to upgrade my old traditional lighting to smart bulbs, panels and switches, the colorful Govee RGBIC Floor Lamp (replaced by the Floor Lamp 2) was an easy choice for my living room. Why? I wanted something vertical to fit nicely into the space and a look that's different than a typical round smart bulb in your average lamp.\nRight now the Govee Floor Lamp 2 is marked down to as low as $130 on Amazon, depending on the color you choose. That's a discount of 21% off the usual $165 list price.\nLike most smart lighting, the Govee floor lamp uses RGB LEDs to offer just about any color you want. My family chose green to complement the green in our living room, but it also changes depending on the time of day. What I enjoy about this lamp is its low profile: You can barely see it, just a small base and a thin line of metal. The focus is on the light rather than the structure.\nAnother big selling point is its connection to other Govee products. If you own the Govee Backlight for TVs, which CNET's Russell Holly wrote about here, you can link up all your Govee lights to work in tandem as you watch a movie. Having all your lights working in sync with a movie like Dune or Mad Max: Fury Road is a lot of fun. Even without the backlight, a single app or Alexa and Google Assistant easily control all your lights.\nHey, did you know? CNET Deals texts are free, easy and save you money.\nSMART LIGHT BULB DEALS OF THE WEEK\n- $105 (save $36)\n- $25 (save $16)\n- $16 (save $10)\n- $25 (save $10)\nDoes the Govee floor lamp make a good gift?\nAs a big fan of Govee products, I think its lighting makes an excellent gift for others and yourself. If you know someone's decor style well, the floor lamp would be an excellent choice since it has such a slim profile that would fit every room I can imagine.\nOtherwise, an ultraportable, color-changing Govee table lamp that has both in-person tap controls and on-device app controls is also a big winner since the person lucky enough to receive the lamp can bathe themselves in the glow of pretty much any color combination and pattern they can imagine. There are also these Govee color-changing light bulbs, which can spruce up virtually any compatible setting.\nMy buying recommendation\nWithout a discount, this tall and thin smart lamp is a bit of an investment at $165, but it's still considerably cheaper than a Philips Hue equivalent. All three colors are currently on sale on Amazon -- the blue and black models are both marked down to $130, and the silver version is $140. While we've seen a deeper discount before, this model is newer and includes Matter support, higher lumen output and additional upgrades over its predecessor. To me, that makes it a no-brainer.\nFor other options, check out our roundup of the best smart home deals going on now.\nJoin Our Daily Deals Text Group!\nGet hand-picked deals from CNET shopping experts straight to your phone."
    }
  ],
  "argos_summary": "Amazon offers a 20‑pack of AA or AAA batteries at a 30% discount, a Govee floor lamp at 40% off, and a Yale Smart Lock 2 with a $71 price cut. The battery deal highlights long shelf life and recycled materials, while the lamp features 16 million colors, Bluetooth speaker, and Matter support. The lock provides Wi‑Fi, Bluetooth, fingerprint, and app control, with a reduced price of $189 from $260. These promotions aim to entice consumers to stock up on essential home tech amid rising tariffs and supply chain concerns.",
  "argos_id": "LK1LWH9TT"
}