{
  "url": "https://finance.yahoo.com/news/minaurum-provides-adelita-renews-marketing-123000799.html",
  "authorsByline": "Newsfile",
  "articleId": "e1eec8c4d09d4e56a37fe68a04716b3a",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/newsfile_64/60354d1b11ed1e0ad458a188eca1adb5",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:30:00+00:00",
  "addDate": "2025-09-03T12:40:26.173461+00:00",
  "refreshDate": "2025-09-03T12:40:26.173463+00:00",
  "score": 1.0,
  "title": "Minaurum Provides Adelita Update and Renews Marketing Agreements",
  "description": "Vancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Minaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (\"Minaurum\") is pleased to announce it has entered into an agreement dated August 12, 2025 with Kenadyr Metals (\"Kenadyr\") to exchange its 20% interest in the Adelita Project (\"Adelita\") for a 1% net smelter return royalty on all minerals extracted from Adelita. In addition, Kenadyr will be issuing 313,953 shares worth approximately $135,000 to Minaurum. There is no buy down right...",
  "content": "Vancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Minaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (\"Minaurum\") is pleased to announce it has entered into an agreement dated August 12, 2025 with Kenadyr Metals (\"Kenadyr\") to exchange its 20% interest in the Adelita Project (\"Adelita\") for a 1% net smelter return royalty on all minerals extracted from Adelita. In addition, Kenadyr will be issuing 313,953 shares worth approximately $135,000 to Minaurum. There is no buy down right for the royalty. (see Kenadyr News Release dated August 19, 2025) Located in the Sonora-Arizona Copper Belt, the project is anchored by a near-surface, high-grade Cu-Au-Ag skarn system, multiple untested skarn targets, and a 4.5 km porphyry anomaly. The Acquisition is subject to customary conditions, including approval by the TSX Venture Exchange (\"TSXV\"). The Company is pleased to announce that further to its news release on May 12, 2025, it has renewed its agreements with Capital Analytica (\"Capital\") and National Inflation Association (\"NIA\") to provide marketing and communications services. The Company has extended its marketing services agreement with Capital dated May 9, 2025, for another three months. The Company agreed to pay Capital $60,000 for providing services including social media consultation, social sentiment reporting, social engagement reporting, corporate video dissemination, news release dissemination, and marketing communications services. Jeff French is the principal of Capital and will be responsible for all activities related to the Company. Capital and its principal are arm's length to the Company and, as of the date hereof, to the Company's knowledge, Capital does not own any securities of the Company. Capital is based in British Columbia, Canada and can be reached via email: jeff@capitalanalytica.com and phone: 778 872 4551.\n\nThe Company has also extended its marketing services agreement with NIA dated May 9, 2025, for another three months. The Company agreed to pay NIA US$30,000 for providing services including the promotion of the Company's activities through NIA's email distribution lists, website and blog posts. Gerard Adams is the principal of NIA and will be responsible for all activities related to the Company. NIA and its principal are arm's length to the Company and, as of the date hereof, to the Company's knowledge, NIA does not own any securities of the Company. NIA is based in North Carolina, USA and can be reached via email: gerardadamsinflationus@gmail.com and phone: 973 277 7674. YouTube: https://www.youtube.com/user/MinaurumGold\n\nX: @minaurumgold\n\nLinkedIn: https://www.linkedin.com/company/minaurum-gold-inc\n\nSubscribe to our email list at www.minaurum.com Minaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (FSE: 78M) is an Americas-focused explorer concentrating on the high-grade 100% owned, production-permitted Alamos silver project in southern Sonora, Mexico and a portfolio of district-scale projects in Mexico. Minaurum is managed by one of the strongest technical and finance teams and will continue its founders' legacy of creating shareholder value by acquiring and developing a pipeline of Tier-One precious-and base metal projects. For more information, please contact:\n\nSunny Pannu - Investor Relations and Corporate Development Manager\n\n(778) 330 0994 or via email at pannu@minaurum.com The TSX Venture Exchange does not accept responsibility for the adequacy or accuracy of this news release. Data review and verification: Stephen R. Maynard, Vice President of Exploration of Minaurum and a Qualified Person (QP) as defined by National Instrument 43-101, reviewed and verified the assay data, and has approved the disclosure in this News Release. Cautionary Note Regarding Forward Looking Information: This news release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. \"Forward-looking information\" includes, but is not limited to, statements with respect to activities, events or developments that the Company expects or anticipates will or may occur in the future. Generally, but not always, forward-looking information and statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\" or the negative connotation thereof. In making the forward-looking information in this release, Minaurum has applied certain factors and assumptions that are based on Minaurum's current beliefs as well as assumptions made by and information currently available to Minaurum. Although Minaurum considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect, and the forward-looking information in this release is subject to numerous risks, uncertainties and other factors that may cause future results to differ materially from those expressed or implied in such forward-looking information. Readers are cautioned not to place undue reliance on forward-looking information. Minaurum does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by law. To view the source version of this press release, please visit https://www.newsfilecorp.com/release/264861",
  "medium": "Article",
  "links": [
    "https://api.newsfilecorp.com/redirect/oP1Zbs0ogP",
    "https://api.newsfilecorp.com/redirect/PqB8YfKyDZ",
    "https://api.newsfilecorp.com/redirect/5W1jaszrDm",
    "https://api.newsfilecorp.com/redirect/Lq8EPfnAjB",
    "https://api.newsfilecorp.com/redirect/wEwrbi1v3J",
    "https://api.newsfilecorp.com/redirect/OAMepFP8oA"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "information",
      "weight": 0.072023734
    },
    {
      "name": "new information",
      "weight": 0.07139165
    },
    {
      "name": "more information",
      "weight": 0.07067841
    },
    {
      "name": "Minaurum Gold Inc.",
      "weight": 0.06985173
    },
    {
      "name": "Kenadyr News Release",
      "weight": 0.068659864
    },
    {
      "name": "Minaurum",
      "weight": 0.067640096
    },
    {
      "name": "news release dissemination",
      "weight": 0.06635297
    },
    {
      "name": "Marketing Agreements",
      "weight": 0.057784263
    },
    {
      "name": "marketing communications services",
      "weight": 0.057389494
    },
    {
      "name": "Company",
      "weight": 0.05549546
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9716796875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9658203125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.82177734375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.81591796875
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Precious Metals",
      "score": 0.75634765625
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.55908203125
    }
  ],
  "sentiment": {
    "positive": 0.26437604,
    "negative": 0.034308057,
    "neutral": 0.70131594
  },
  "summary": "Minaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) has announced it has entered into an agreement with Kenadyr Metals (Kenadyr) to exchange its 20% interest in the Adelita Project for a 1% net smelter return royalty on all minerals extracted from the project. In addition, Kenadry will issue 313,953 shares worth approximately $135,000 to Minaurums. The Company has also renewed agreements with Capital Analytica and National Inflation Association (NIA) for marketing and communications services. The company has extended its marketing services agreement with Capital dated May 9, 2025, for another three months.",
  "shortSummary": "Minaurum Gold Inc. has acquired a 20% stake in the Adelita Project for $135,000, and extended marketing agreements with Capital and NIA.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "be6b31ca94294f669f74e4cf58c9185d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.newsfilecorp.com/redirect/wEwrbi1v3J",
      "text": "Minaurum Provides Adelita Update and Renews Marketing Agreements\nSeptember 03, 2025 8:30 AM EDT | Source: Minaurum Gold Inc.\nVancouver, British Columbia--(Newsfile Corp. - September 3, 2025) - Minaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (\"Minaurum\") is pleased to announce it has entered into an agreement dated August 12, 2025 with Kenadyr Metals (\"Kenadyr\") to exchange its 20% interest in the Adelita Project (\"Adelita\") for a 1% net smelter return royalty on all minerals extracted from Adelita. In addition, Kenadyr will be issuing 313,953 shares worth approximately $135,000 to Minaurum. There is no buy down right for the royalty. (see Kenadyr News Release dated August 19, 2025)\nThe Adelita Project\nLocated in the Sonora-Arizona Copper Belt, the project is anchored by a near-surface, high-grade Cu-Au-Ag skarn system, multiple untested skarn targets, and a 4.5 km porphyry anomaly.\nDrill results include:\n16.2 metres of 1.97% Cu, 0.84 g/t Au, 73 g/t Ag (CGDD-10-001)\n47.6 metres of 0.98% Cu, 0.46 g/t Au, 46 g/t Ag (CGDD-10-002)\n105.2 metres of 1.03% Cu, 0.43 g/t Au, 36 g/t Ag (CGDD-12-009)\n201.4 metres of 0.52% Cu, 0.15 g/t Au, 13 g/t Ag (CGDD-12-012)\n20.60 m of 1.91% copper, 2.00 g/t gold and 40.91 g/t silver (Hole AD-22-0018)\n32.25 m of 1.01% copper, 0.52 g/t gold and 39.69 g/t silver (Hole AD-22-0019)\n19.85 m of 1.00% CuEq (Hole AD-22-0021)\n20.6 m of 3.71% CuEq (Hole AD-22-0018)\n32.25 m of 1.74% CuEq (Hole AD-22-0019)\n(See Minaurum News Releases dated May 3, 2012; May 31, 2012; October 6, 2010, and Infinitum Copper news release dated September 13 and 29, 2022; May 2, 2023; May 24, 2023, January 24, 2024)\nThe Acquisition is subject to customary conditions, including approval by the TSX Venture Exchange (\"TSXV\").\nExtension of Marketing Agreements\nThe Company is pleased to announce that further to its news release on May 12, 2025, it has renewed its agreements with Capital Analytica (\"Capital\") and National Inflation Association (\"NIA\") to provide marketing and communications services.\nThe Company has extended its marketing services agreement with Capital dated May 9, 2025, for another three months. The Company agreed to pay Capital $60,000 for providing services including social media consultation, social sentiment reporting, social engagement reporting, corporate video dissemination, news release dissemination, and marketing communications services.\nJeff French is the principal of Capital and will be responsible for all activities related to the Company. Capital and its principal are arm's length to the Company and, as of the date hereof, to the Company's knowledge, Capital does not own any securities of the Company. Capital is based in British Columbia, Canada and can be reached via email: jeff@capitalanalytica.com and phone: 778 872 4551.\nThe Company has also extended its marketing services agreement with NIA dated May 9, 2025, for another three months. The Company agreed to pay NIA US$30,000 for providing services including the promotion of the Company's activities through NIA's email distribution lists, website and blog posts.\nGerard Adams is the principal of NIA and will be responsible for all activities related to the Company. NIA and its principal are arm's length to the Company and, as of the date hereof, to the Company's knowledge, NIA does not own any securities of the Company. NIA is based in North Carolina, USA and can be reached via email: gerardadamsinflationus@gmail.com and phone: 973 277 7674.\nFollow us and stay updated:\nYouTube: https://www.youtube.com/user/MinaurumGold\nX: @minaurumgold\nLinkedIn: https://www.linkedin.com/company/minaurum-gold-inc\nSubscribe to our email list at www.minaurum.com\nMinaurum Gold Inc. (TSXV: MGG) (OTCQX: MMRGF) (FSE: 78M) is an Americas-focused explorer concentrating on the high-grade 100% owned, production-permitted Alamos silver project in southern Sonora, Mexico and a portfolio of district-scale projects in Mexico. Minaurum is managed by one of the strongest technical and finance teams and will continue its founders' legacy of creating shareholder value by acquiring and developing a pipeline of Tier-One precious-and base metal projects.\nON BEHALF OF THE BOARD\n\"Darrell A. Rader\"\nDarrell A. Rader\nPresident and CEO\nFor more information, please contact:\nSunny Pannu - Investor Relations and Corporate Development Manager\n(778) 330 0994 or via email at pannu@minaurum.com\nThe TSX Venture Exchange does not accept responsibility for the adequacy or accuracy of this news release.\n| 1570- 200 Burrard Street | Telephone: 1 778 330-0994 |\n| Vancouver, BC V6C 3L6 | www.minaurum.com |\n| | info@minaurum.com |\nData review and verification: Stephen R. Maynard, Vice President of Exploration of Minaurum and a Qualified Person (QP) as defined by National Instrument 43-101, reviewed and verified the assay data, and has approved the disclosure in this News Release.\nCautionary Note Regarding Forward Looking Information: This news release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation. \"Forward-looking information\" includes, but is not limited to, statements with respect to activities, events or developments that the Company expects or anticipates will or may occur in the future. Generally, but not always, forward-looking information and statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", or \"believes\" or the negative connotation thereof or variations of such words and phrases or state that certain actions, events or results \"may\", \"could\", \"would\", \"might\" or \"will be taken\", \"occur\" or \"be achieved\" or the negative connotation thereof.\nIn making the forward-looking information in this release, Minaurum has applied certain factors and assumptions that are based on Minaurum's current beliefs as well as assumptions made by and information currently available to Minaurum. Although Minaurum considers these assumptions to be reasonable based on information currently available to it, they may prove to be incorrect, and the forward-looking information in this release is subject to numerous risks, uncertainties and other factors that may cause future results to differ materially from those expressed or implied in such forward-looking information.\nReaders are cautioned not to place undue reliance on forward-looking information. Minaurum does not intend, and expressly disclaims any intention or obligation to, update or revise any forward-looking information whether as a result of new information, future events or otherwise, except as required by law.\nTo view the source version of this press release, please visit https://www.newsfilecorp.com/release/264861"
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/OAMepFP8oA",
      "text": "Minaurum’s exploration strategy is to develop and acquire a pipeline of potential Tier One precious and base metals projects in Mexico and USA. The Minaurum team has a proven technical and financing track record and has been credited with the discovery of over 300 million ounces of silver and 63 million ounces of gold in the Americas. The company is listed on the TSX Venture Exchange under ‘MGG’ | OTCQX Best Market under ‘MMRGF’ | Frankfurt Stock Exchange under ‘78M’.\nMinaurum's primary focus is advancing its flagship Alamos Silver Project in Sonora, Mexico with a maiden NI 43-101 mineral resource targeted for 2025. Alamos is located adjacent to the Aurifero gold project, and further south the joint ventured Adelita copper-silver project in Sonora. The Santa Marta VMS gold-copper project, Aurena gold project and Taviche silver-gold project are located in the Oaxaca. The Biricu gold project is surrounded by major gold producing mining companies in the heart of the Guerrero Gold Belt. Recently acquired 100% of the Lone Mountain Zinc Project (Nevada, USA) with a historical mineral resource of 3,257,000 tonnes grading 7.57% zinc and 0.70% lead, and PEA demonstrating a 35% after tax IRR.\nMexico has a long history of base and precious metals exploration and mining, resulting in Mexico becoming one of the largest precious metals producers globally and a hub for several Canadian mining companies. Mexico is a “go-to” destination for international mining companies. Investors looking for precious metals exposure, gold stocks to buy, including a silver stock and some of the best copper stocks. Mexico has a large base of mining employment in exploration or producer gold mining stocks and/or silver stocks. Boasting a strong indigenous mining industry, Mexico is known as a stable mining jurisdiction with a fair tax regime and solid mineral tenures."
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/5W1jaszrDm",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/PqB8YfKyDZ",
      "text": "Minaurum’s exploration strategy is to develop and acquire a pipeline of potential Tier One precious and base metals projects in Mexico and USA. The Minaurum team has a proven technical and financing track record and has been credited with the discovery of over 300 million ounces of silver and 63 million ounces of gold in the Americas. The company is listed on the TSX Venture Exchange under ‘MGG’ | OTCQX Best Market under ‘MMRGF’ | Frankfurt Stock Exchange under ‘78M’.\nMinaurum's primary focus is advancing its flagship Alamos Silver Project in Sonora, Mexico with a maiden NI 43-101 mineral resource targeted for 2025. Alamos is located adjacent to the Aurifero gold project, and further south the joint ventured Adelita copper-silver project in Sonora. The Santa Marta VMS gold-copper project, Aurena gold project and Taviche silver-gold project are located in the Oaxaca. The Biricu gold project is surrounded by major gold producing mining companies in the heart of the Guerrero Gold Belt. Recently acquired 100% of the Lone Mountain Zinc Project (Nevada, USA) with a historical mineral resource of 3,257,000 tonnes grading 7.57% zinc and 0.70% lead, and PEA demonstrating a 35% after tax IRR.\nMexico has a long history of base and precious metals exploration and mining, resulting in Mexico becoming one of the largest precious metals producers globally and a hub for several Canadian mining companies. Mexico is a “go-to” destination for international mining companies. Investors looking for precious metals exposure, gold stocks to buy, including a silver stock and some of the best copper stocks. Mexico has a large base of mining employment in exploration or producer gold mining stocks and/or silver stocks. Boasting a strong indigenous mining industry, Mexico is known as a stable mining jurisdiction with a fair tax regime and solid mineral tenures."
    },
    {
      "url": "https://api.newsfilecorp.com/redirect/oP1Zbs0ogP",
      "text": "$MGG $MGG.V $MMRGF Minaurum is pleased to announce it has retained a royalty on its portfolio copper-silver project 'Adelita', advancing exploration and shareholder value...and renews marketing agreements #royalty #exploration #Copper News Release - https://lnkd.in/gqWbGTDv\nMinaurum Gold Inc.\nMining\nVancouver, British Columbia 3,611 followers\nDiscovery of new district-scale silver and gold discoveries in Mexico. Tickers: (MGG | TSX.V & MMRGF | OTCQX)\nAbout us\nMinaurum’s exploration strategy is to develop and acquire a pipeline of potential Tier One precious and base metals projects. Through a portfolio containing Silver projects totaling 37,928 hectares; Gold projects totaling 25,933 hectares; and Copper projects totaling 12,856 hectares, Minaurum provides significant exposure to precious and base metals. The Minaurum team has a proven technical and financing track record and has been credited with the discovery of over 300 million ounces of silver and 16 million ounces of gold in Mexico. The company is listed on the TSX Venture Exchange under ‘MGG’ | OTCQX Best Market under ‘MMRGF’ | Frankfurt Stock Exchange under ‘78M’.\n- Website\n-\nhttp://www.minaurum.com\nExternal link for Minaurum Gold Inc.\n- Industry\n- Mining\n- Company size\n- 11-50 employees\n- Headquarters\n- Vancouver, British Columbia\n- Type\n- Public Company\nLocations\n-\nPrimary\nGet directions\n200 Burrard St\n1570\nVancouver, British Columbia V6C 3L6, CA\nEmployees at Minaurum Gold Inc.\n-\nSunny Pannu\nInvestor Relations and Corporate Development Manager at Minaurum Gold Inc.\n-\nDavid Medilek, P.Eng., CFA\nPresident and Chief Operating Officer at K92 Mining Inc.\n-\nManuel Campa\nExploration Geologist en Minera Cascabel\n-\nJosé Luis Hernández\nIndependent Geologist for Small Miners in Sonora-Sinaloa-Jalisco-Chihuahua Regions\nUpdates\n-\n$MGG $MGG.V 10,000 m Infill Drill Program Targeting Key Zones at Promontorio, Europa-Guadalupe, and Travesia at the Alamos Silver Project! Pipeline of Drill Results News Flow! #silver #exploration #drilling #infilldrilling News Release - https://lnkd.in/gPCSdmuf\n-\n$MGG $MGG.V Minaurum Has Four Drill Rigs Operating To Fast Track Its Ongoing 10,000-m Infill Drill Program at the Alamos Silver Project #silver #exploration #drilling #infilldrilling News Release - https://lnkd.in/gPCSdmuf\n-\n$MGG $MGG.V Drilling at Promontorio and Promontorio Sur also indicate a significant skarn/carbonate replacement (CRD) mineralization at Alamos Silver Project #exploration #silver #CRD News Release - https://lnkd.in/g936GBhz\n-\n$MGG $MGG.V Drill Results Unlock Value from Unexplored New Vein Zone \"Promontorio Sur\", South of Largest Historical Mine \"Promontorio\" at Alamos Silver Project #exploration #drillresults #vein #value News Release - https://lnkd.in/g936GBhz\n-\n$MGG $MGG.V President & CEO Darrell Rader speaks with TokStocks' Keir Reynolds and the roadmap towards a maiden resource in 2025! 👍#alamossonora #silver #exploration Link - https://lnkd.in/gd-mrXwy\n-\n$MGG $MGG.V Minaurum has closed its financing raising C$9.2M. Thank you to all our shareholders for their support as we continue to advance the Alamos Silver Project towards a maiden resource!🔥🚀👍 #silver #exploration #treasury #financed News Release - https://lnkd.in/gcSYCqP7\n-\nMinaurum Gold Inc. Announces Upsize In Best Efforts Private Placement to C$8.0M $MGG $MGG.V 💸🔥#exploration #resource #silver News Release - https://lnkd.in/gwtanFNu\n-\nMinaurum Gold Inc. Announces C$5.0M Best Efforts Private Placement $MGG $MGG.V #financing News Release - https://lnkd.in/gMAKw8DS\n-\n$MGG $MGG.v $MMRGF Minaurum Adds x-SilverCrest Resource Team Members to Alamos Silver Project 🔥🔥#alamos #silver #team #experience News Release - https://lnkd.in/gwQ6uyiY"
    }
  ],
  "argos_summary": "Minaurum Gold Inc. announced that on August 12, 2025 it will exchange its 20% stake in the Adelita copper‑silver project for a 1% net smelter return royalty, with Kenadyr Metals issuing 313,953 shares worth about $135,000. The company also renewed marketing agreements with Capital Analytica and National Inflation Association, paying $60,000 and $30,000 respectively for social media, sentiment reporting, and promotional services. This move strengthens Minaurum’s royalty income and marketing outreach while keeping its focus on high‑grade exploration projects in the Sonora‑Arizona region.",
  "argos_id": "N5BN4ECD8"
}