{
  "url": "https://www.techradar.com/ai-platforms-assistants/amazon-is-giving-your-camera-an-ai-powered-shopping-cart",
  "authorsByline": "Eric Hal Schwartz",
  "articleId": "e5a4a7bd71e54b70b1a7d41a5b4f97a8",
  "source": {
    "domain": "techradar.com",
    "paywall": false,
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/vLSUhc5QAF3rEBAnkzgeie-1280-80.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T21:00:00+00:00",
  "addDate": "2025-09-03T21:06:48.685595+00:00",
  "refreshDate": "2025-09-03T21:06:48.685598+00:00",
  "score": 1.0,
  "title": "Amazon’s new Lens Live brings real-time visual shopping to your phone.",
  "description": "The new Lens Live feature identifies and, with a tap, buys anything you point your phone at",
  "content": "• Amazon's new Lens Live feature lets users point their phone camera at objects and immediately buy similar products\n• Lens Live is integrated with the Rufus AI assistant to provide quick information and answers about the products\n\nYou no longer need to know what something’s called to buy it on Amazon, thanks to the company's new AI-powered Lens Live feature.\n\nAll you need to do is point your smartphone camera at anything that grabs your eye, from a stranger's shoes to a fancy backpack for dogs, and tap the screen. The AI will immediately offer a range of similar products for you to add to your cart, complete with prices and reviews.\n\nIt’s a combination of visual search and assisted shopping sans typing. You have the immediate option to make a purchase by tapping on the plus icon or save it for later with a tap on the heart. Lens Live builds on but isn't replacing the existing visual search tool, Amazon Lens, but it does make impulse buying easier. And if you want to know more about what you’re seeing, it's also linked to Amazon’s AI shopping assistant Rufus. The AI assistant can answer follow-up questions and tell you more about the product and how other customers feel about their purchase.\n\nIt's a lot like Google Lens or Pinterest's own camera tools. But, while Google Lens can identify objects, animals, landmarks, and flowers, and Pinterest’s camera can spot a style or aesthetic, Amazon is all about making it possibly too easy to get straight to making a purchase.\n\nPeople already comparison shop all of the time, deciding if the object catching their eye in a store can be found cheaper online, or if the one they see in an online ad can be obtained faster with an in-store purchase. Lens Live simply speeds things up by skipping the need to type a brand name or describe an item, instead allowing you to point your camera.\n\nLens Live is only rolling out to iOS devices right now, with no Android release date announced. Lens Live fits with Amazon's work to make AI part of its entire company setup. Amazon has rolled out AI-generated review summaries, personalized product prompts, AI-powered clothing fit tools, and more. Lens Live is simply a more direct way to use AI to help people make purchases.\n\nDepending on how people feel about the tool, it could fundamentally reshape shopping. AI visual shopping might have a more subtle impact on people by making the entire world theoretically a catalog of purchases, with Amazon as the checkout counter. Every object becomes a possible purchase, and your camera redirects your buying impulse in seconds. Of course, that's a nightmare if you’re already someone who struggles with self-control on Amazon.\n\nYou might also like...\n• Amazon's AI personal shopper is sharing ads with its advice\n• Amazon's new AI guides know what you want to buy before you do\n• Amazon thinks AI helping you buy clothes is better than you sending back whatever doesn't fit",
  "medium": "Article",
  "links": [
    "https://www.techradar.com/computing/artificial-intelligence/if-you-felt-like-amazon-could-eavesdrop-on-you-before-get-ready-to-meet-its-ai-wearable",
    "https://www.techradar.com/computing/artificial-intelligence/amazons-new-ai-guides-know-what-you-want-to-buy-before-you-do",
    "https://www.techradar.com/computing/software/not-spending-enough-on-amazon-already-its-new-ai-chatbot-is-here-to-help",
    "https://www.techradar.com/ai-platforms-assistants/gemini/gemini-live-can-now-coordinate-your-outfit-and-remind-you-in-a-calm-voice-when-its-time-to-leave",
    "https://www.techradar.com/tag/google-lens",
    "https://www.techradar.com/computing/artificial-intelligence/amazon-thinks-ai-helping-you-buy-clothes-is-better-than-you-sending-back-whatever-doesnt-fit",
    "https://www.techradar.com/computing/artificial-intelligence/amazons-ai-personal-shopper-is-sharing-ads-with-its-advice",
    "https://www.techradar.com/tag/amazon",
    "https://www.techradar.com/computing/artificial-intelligence/i-tried-googles-new-gemini-powered-clothing-app-heres-how-you-can-use-ai-to-find-the-perfect-outfit"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Amazon Lens",
      "weight": 0.11643794
    },
    {
      "name": "AI visual shopping",
      "weight": 0.10297928
    },
    {
      "name": "Lens Live",
      "weight": 0.09893022
    },
    {
      "name": "Amazon",
      "weight": 0.093342975
    },
    {
      "name": "AI",
      "weight": 0.08782511
    },
    {
      "name": "Google Lens",
      "weight": 0.08323739
    },
    {
      "name": "Lens",
      "weight": 0.08086784
    },
    {
      "name": "Amazon’s new Lens Live",
      "weight": 0.07672274
    },
    {
      "name": "Amazon’s AI shopping assistant",
      "weight": 0.07532576
    },
    {
      "name": "similar products",
      "weight": 0.07316545
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.83984375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.72705078125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.67431640625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.6630859375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.488525390625
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.334716796875
    }
  ],
  "sentiment": {
    "positive": 0.2515405,
    "negative": 0.14999214,
    "neutral": 0.59846735
  },
  "summary": "Amazon's new Lens Live feature allows users to point their phone camera at objects and immediately buy similar products. The feature is integrated with the Rufus AI assistant to provide quick information and answers about the products. It is a combination of visual search and assisted shopping without typing. Lens Live is not replacing the existing visual search tool, Amazon Lens, but it makes impulse buying easier. It's also linked to Amazon’s AI shopping assistant Rufu to answer follow-up questions and tell you more about the product. The tool is only available on iOS devices.",
  "shortSummary": "Amazon's new Lens Live feature allows users to quickly buy similar products using a smartphone camera, integrating Rufus AI assistant, enhancing impulse buying on the site.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d62973ff0bba4fe49fa37009c786dacd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techradar.com/tag/google-lens",
      "text": "Google Lens\nLatest about Google Lens\nGoogle Lens just got a time-saving upgrade on your iPhone – here’s how it works\nBy Alex Blake published\nGoogle Lens is getting gesture support, making it easier and quicker to search in the Google and Chrome apps.\nApple Visual Intelligence is already behind the curve as Google adds video search to Lens\nBy John-Anthony Disotto published\nGoogle has announced video search in Google Lens, so is Apple's Visual Intelligence already lagging behind?\nGoogle announces major AI improvements coming to Search - you can’t avoid artificial intelligence anymore\nBy John-Anthony Disotto published\nGoogle has announced major AI updates which the company claims are 'some of the most significant Search updates to date'.\niPhone 16's Camera Control button has a new Visual Intelligence feature to compete with Google Lens\nBy John-Anthony Disotto published\nUsing Visual Intelligence and the new Camera Control button on the iPhone 16, you can search for info about anything your camera points at.\nGoogle Lens now lets you search with your voice and images\nBy Cesar Cadenas published\nAndroid users can add audio recordings to Google Lens, and the app will try its best to answer your burning questions.\nChrome could revolutionize search on PC with a big Google Lens upgrade that lets you Circle to Search images\nBy Darren Allan published\nIncoming Chrome feature is a major one that might change the way you search on a Windows 11 PC, Mac or Chromebook.\nThe latest Google Lens update might bring Circle to Search to many more phones\nBy Cesar Cadenas published\nClues found in recent Google betas hint at the expansion and we could see a new navigation option for the tool as well.\nGoogle teases new AI-powered Google Lens trick in feisty ChatGPT counter-punch\nBy David Nield published\nIt seems Google is preparing to unveil a more comprehensive and capable AI bot at Google I/O 2024.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/amazon-thinks-ai-helping-you-buy-clothes-is-better-than-you-sending-back-whatever-doesnt-fit",
      "text": "Amazon thinks AI helping you buy clothes is better than you sending back whatever doesn't fit\nThe 'Try Before You Buy' program is being replaced with Virtual Try-On\n- Amazon's replacing 'Try Before You Buy' with a 'Virtual Try-On.'\n- Swapping a physical try-on for a digital one is becoming somewhat of a theme in online retail.\n- Virtual Try-On joins other features like AI-powered size recommendations.\nAmazon would rather you try clothes on virtually instead of testing their fits at home. The company is officially retiring its “Try Before You Buy” program at the end of January, and in its place, Amazon wants you to trust its AI tools to find your perfect fit.\nTry Before You Buy launched in 2017 as Prime Wardrobe and has let buyers get up to six items, try them on at home, and only pay for what they keep while sending back the rest. No dressing room with harsh fluorescent lighting is necessary. It's very popular, but Amazon has decided the program is not good enough.\nAmazon believes its AI tools are all you need to find your best look. One might suspect this also has something to do with the company’s increasing investment in AI-driven shopping features. After all, why wait for a box of clothes when an algorithm can tell you which pair of jeans will love you back?\n“Given the combination of Try Before You Buy only scaling to a limited number of items and customers increasingly using our new AI-powered features like virtual try-on, personalized size recommendations, review highlights and improved size charts to make sure they find the right fit, we’re phasing out the Try Before You Buy option,\" Amazon said in a released statement.\nAI e-commerce\nThe tools Amazon points to are a different way of thinking about online shopping for clothes. Virtual try-on is an augmented reality feature that lets you see how shoes, glasses, or lipstick will look without leaving your couch. Meanwhile, the personalized size recommendation system uses your purchase history, return patterns, and feedback from other customers to predict your ideal size.\nFor a more conversational approach, there’s the Rufus AI chatbot, ready to answer all your questions and suggest products based on your shopping habits.\nFor fans of Try Before You Buy, this news might sting. The idea of confidently trying on clothes before committing is hard to replace, and AI, no matter how advanced, doesn’t have the tactile joy of slipping into something that just fits. Still, Amazon says that its free return policy will remain intact for most apparel purchases, so you can always fall back on the classic “order three sizes and hope for the best” strategy.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAmazon’s decision to swap physical try-ons for digital solutions isn’t just a company quirk; it’s part of a more significant trend in retail. AI is becoming increasingly popular as an aid to Google and other retailers' online shopping.\nWhether shoppers will embrace this new era of virtual assistance or will long for the days of box-filled try-on sessions at home remains to be seen.\nYou might also like...\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/software/not-spending-enough-on-amazon-already-its-new-ai-chatbot-is-here-to-help",
      "text": "Amazon’s new AI chatbot wants to be your personal shopper for impulse buys\nIf there's one tech innovation that our bank accounts didn't need in 2024, it's an Amazon chatbot with infinite knowledge of the site's array of potential impulse buys. But unfortunately for our savings, that's exactly what we've just been given in the form of Rufus.\nAmazon says its Rufus chatbot has now launched in the US in beta form to \"a small subset of customers\" who use its mobile app, but that it'll \"progressively roll out to additional US customers in the coming weeks\". Rufus is apparently \"an expert shopping assistant\" who's been trained on Amazon's product catalog and will help answer your questions in a conversational way.\nRather than Googling for extra advice on the differences between trail and road running shoes, the idea is that you can instead search for pointers in the Amazon app and Rufus will pop up with the answers.\nQuite how good those answers are remains to be seen, as Amazon says they come from \"a combination of extensive product catalog, customer reviews, community Q&As, and information from across the web\". Considering the variable quality of Amazon's reviews, and the tendency of AI chatbots to hallucinate, you may still want to cross-reference your research with some external sources.\nStill, it's an early glimpse at the future of shopping, with retailers looking to arm you with all of the information you need so you can, well, spend more money with them. Amazon says that the questions can be as broad as \"what are good gifts for Valentine’s Day?\", but also as specific as “is this cordless drill easy to hold?\" if you're on a product page.\nHow to find and use Rufus\nRight now, Rufus is only being made available to \"select customers when they next update their Amazon Shopping app\". But if you live in the US and are keen to take it for a spin, it's worth updating your iOS or Android app to see if you're one of the early chosen ones.\nIf you are, the bar at the top of the app should now say \"search or ask a question\". That's where you can fire conversational questions at Rufus, like “what to consider when buying headphones?”, or prompts like “best dinosaur toys for a 5-year-old“ or \"I want to start an indoor garden\".\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nThe ability to ask specific questions about products on their product pages also sounds handy, although this will effectively only be a summary of the page's Q&As and reviews. Given our experience with AI shopping chatbots so far, we'd be reluctant to take everything at face value without double-checking with another source.\nStill, with Rufus getting a wider US rollout in \"the coming weeks\", it is a pretty major change to the Amazon app – and could change how we shop with the retail giant. Amazon will no doubt be hoping it convinces us to spend more – maybe we need two chatbots, with the other one warning us about our overdraft.\nYou might also like\nMark is TechRadar's Senior news editor. Having worked in tech journalism for a ludicrous 17 years, Mark is now attempting to break the world record for the number of camera bags hoarded by one person. He was previously Cameras Editor at both TechRadar and Trusted Reviews, Acting editor on Stuff.tv, as well as Features editor and Reviews editor on Stuff magazine. As a freelancer, he's contributed to titles including The Sunday Times, FourFourTwo and Arena. And in a former life, he also won The Daily Telegraph's Young Sportswriter of the Year. But that was before he discovered the strange joys of getting up at 4am for a photo shoot in London's Square Mile."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/amazons-ai-personal-shopper-is-sharing-ads-with-its-advice",
      "text": "Amazon's AI personal shopper is sharing ads with its advice\nInevitable addition to Rufus extends sponsored results into your conversation\nAmazon proclaimed its shopping AI chatbot Rufus as a solution for people overwhelmed by the dizzying array of products on its website. But, since it’s Amazon, that’s now going to include some ads, as Adweek first noted. Rufus (named for a pet corgi owned by early Amazon employees) uses AI to research products and recommend purchases through conversations.\n“To help customers discover more products in Amazon’s generative AI-powered shopping assistant, referred to as Rufus, your ads may appear in Rufus-related placements,” the update to advertisers explains. “Rufus may generate accompanying text based on the context of the conversation.”\nRufus generates results based on Amazon’s vast product catalog, customer reviews, and community Q&As. In some ways, the advertising is just another category of information. The update brings it closer to how the standard Amazon shopping search works. Instead of ‘sponsored’ suggestions for products as links on the page, Rufus will directly highlight advertised products as it answers your questions.\nObviously, Amazon doesn’t want to spam Rufus users with unrelated ads, hence the reference to “context.” So, when you ask Rufus to compare different products or ask for gift ideas, you won’t get nonsensical suggestions. It’s just that anything an advertiser has paid to sponsor will likely join the comparison or be included early in the collection of gift ideas.\nRufus is still technically an experiment, and Amazon has warned that its responses might be inaccurate. What that might mean for sponsored products is unclear, but presumably, Amazon doesn’t want hallucinations to mar the ads it serves for its clients.\nAI Ad Men\nRufus isn't the first to start mixing ads with its AI. Microsoft began testing advertising through its Copilot AI chatbot a year ago. And AI conversational search engine Perplexity has begun including sponsored suggestions for its search results in a way that more closely resembles Google’s business model.\nBut Amazon is the king of e-commerce, and other platforms will likely be watching closely. If Rufus ends up being a real boon for companies advertising on Amazon, you can bet imitators will rapidly roll out elsewhere if they haven't already. The ads may just be a revenue driver for Amazon, but Rufus might be fetching the next iteration of online advertising.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou might also like...\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City."
    },
    {
      "url": "https://www.techradar.com/ai-platforms-assistants/gemini/gemini-live-can-now-coordinate-your-outfit-and-remind-you-in-a-calm-voice-when-its-time-to-leave",
      "text": "Gemini Live can now coordinate your outfit and remind you – in a calm voice – when it's time to leave\nGoogle has added vision to its AI assistant, along with better voice and app options\n- Google Gemini Live now provides visual guidance with real-time cues on your screen when you share your camera\n- The feature is designed to help users solve tasks visually and identify objects by sight\n- Gemini Live has also expanded its app integrations and introduced expressive voice upgrades\nGoogle is continuing its quest to get people to use its Gemini AI assistant at all times and in all places with a new set of upgrades launched alongside the Pixel 10 series of smartphones. The centerpiece of the new and improved Gemini Live is a set of AI eyes, a feature called visual guidance.\nBasically, you can give Gemini Live access to your camera, and it will look at the same things you're looking at and help you figure out things like the right tool to use, the best choices to coordinate an outfit, or other tasks. The solutions will be right on the screen, with arrows or circles around the correct answer. For now, the feature will only be available on the Pixel 10, but other Android phones and even iOS devices will be able to use the feature in the near future.\nVisual guidance might sound like a party trick, but it could prove to be a major draw for Gemini Live. Instead of receiving a flat, spoken answer when you ask Gemini to help assemble a new piece of furniture, you can now show the parts to your camera and have the assistant visually indicate which goes where. It doesn’t require special hardware; it's like showing a friend who's good at DIY what you have and asking for help.\nGoogle clearly sees it as a way to bridge the awkwardness that sometimes happens when you ask an AI for help and it gives you vague or overly generic answers. “Use the blue-handled pliers,” might not help much if your toolbox has three tools with blue handles. A glowing circle over the right one is much more helpful. As someone who has tried to follow a YouTube tutorial while simultaneously wielding a screwdriver, I get the appeal.\nSweet talk and multitasking\nGemini Live will also sound better when it's showing you things, thanks to new speech models capable of adjusting the tone, and even the character of the voice. So, Gemini might use an especially calm voice to talk about a stressful topic, speed up when you're in a hurry, or perhaps tell you a story about pirates in the stereotypical pirate accent.\nGemini Live is also going to be better at multitasking thanks to new links to apps like Google Calendar, Messages, and Maps. So, when you're chatting with Gemini, you could get it to handle your personal appointments and send texts to your friends with directions.\nThe revamp of Gemini Live fits with Google's broader approach to AI, positioning it as an ambient, always-on platform rather than a standalone feature. AI assistance that is flexible enough for any event, while using context to be specifically valuable for individuals, is what Google and other AI developers have promised for a while. And while the visual guidance and other tools aren't going to be perfect, the adaptability could make up for it. You don’t need to learn a new system or talk in commands. You just show Gemini what you see, ask it what you need, and get a reply that’s tuned to the topic.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/i-tried-googles-new-gemini-powered-clothing-app-heres-how-you-can-use-ai-to-find-the-perfect-outfit",
      "text": "I tried Google’s new Gemini-powered clothing app – here’s how you can use AI to find the perfect outfit\nGoogle's AI-powered shopping feature for showing you what you might look like in different outfits has come to mobile devices and can even help you see what you'd look like moving around in them. The new Doppl app uses Gemini AI to take a photo of you and replace your clothes with the outfit in another image you upload. Then, you can ask it to animate you in the outfit.\nI uploaded a full-length, well-lit photo of myself to the app and added a picture of an eye-catching set of orange pants. Less than a minute later, I looked quite comfortable in those pants. A tap on the button to animate the image, and I could even get a sense of what I would look like moving in them.\nIn real life, trying on clothes can be exhausting, not to mention destructive to your self-esteem. And that's before considering if the lighting or mirrors are flattering. Doppl is way less pressure and can at least help you decide if the bold new look for yourself you're considering is at all worth it.\nIt's just you, your digital self, and your imagination. You upload the outfit. The app makes you a little movie. You can save it, share it, delete it, or just sit there watching yourself turn or shift from side to side.\nI tried it again with a white suit to see how going for a more formal look would do. Again, the AI fit me neatly into the outfit. The animation covered almost an entire turn, and the creases in the jacket moved realistically. The video element is what makes Doppl stand out from Google's initial experiment from earlier this year.\nAI clothiers\nNot that it was perfect, of course. The movement is sometimes stilted, and the fabrics can suddenly lose all texture. The avatar sometimes floats slightly off the ground, which is disorienting to see yourself do. And even if you like the look, Doppl doesn’t magically help you afford the fancy Victorian gentleman's suit you think you'd look great in, but for a few seconds of processing, it's pretty impressive and would be a useful starting point for figuring out what kind of clothes to buy.\nDoppl is still in early access and only available in the U.S. for now, but Google’s clearly building toward something bigger. Imagine this plugged into your calendar, recommending outfits based on events. Or syncing with your Google Photos to remind you that yes, you did already wear that shirt to a wedding last year. It’s the beginning of a personal styling assistant that uses your face, your body, and your evolving tastes.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nGoogle touts it as a way to reduce returns and cut down on overbuying, and even as a new way for people to explore style, even if they don’t live near trendy stores or have access to stylists. Will this lead to some kind of AI-influencer-wardrobe dystopia? I'd guess not, but it's hard to tell when it comes to AI what actual positive or negative impact will follow.\nIf you want to try it, it’s free, and it takes about 60 seconds to go from uploading your photo to creating a series of fashion videos to star in. The app may not get everything right, but it is worth trying on as much as any set of clothes. Or perhaps you're just curious if your baby's snow suit, which they look so comfortable and adorable in, would look good on you, too. In my case, the answer is it's not quite as cute.\nYou might also like\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/amazons-new-ai-guides-know-what-you-want-to-buy-before-you-do",
      "text": "Amazon's new AI guides know what you want to buy before you do\nAmazon is infusing AI into a new facet of its online shopping experience with the release of its AI Shopping Guides. The new feature aims to take over the product research part of hunting for a product by employing generative AI models that make personalized companions for your search. You can try it on Amazon’s website and mobile app, though just in the U.S. for now, and see guides for more than 100 categories of products.\nThe AI Shopping Guides start with a standard search for an item. Along with the usual list, you’ll see an AI guide appear if there is one for the category you’re looking at. When you open the guidebook, you’ll see an AI-curated collection of information about the products, including basic information, charts comparing different specs, and reviews from previous purchasers.\nThe AI models create guides that analyze all of the information Amazon has about the products available for sale and how people review them to write their own descriptions. It will even rewrite the descriptions so that you can understand some of the terms you might not know. The AI will then write custom recommendations for you based on its analysis of both the products and your own search and purchase history. Notably, using AI to keep scanning product listings means the AI Shopping Guides will stay up-to-date even as new products come out and old ones are updated or removed.\nRufus Writes In\nThe AI Shopping Guides also act to augment the Rufus AI chatbot, which Amazon deployed to offer AI-powered research and recommendations. Rufus makes the AI Shopping Guides interactive by answering follow-up questions you might have, personalizing your look for a product even further by, for instance, answering a question about two similar products by not only comparing them to each other but to products in a similar category you might have previously bought.\nRufus also includes some suggestions based less on your history and more on what companies have paid to have advertisements relayed by the AI. Amazon has also hinted at plans to further personalize its recommendations by using (with your permission) data from Gmail and YouTube.\nYou might also like...\n- Amazon's AI personal shopper is sharing ads with its advice\n- Amazon’s new AI chatbot wants to be your personal shopper for impulse buys\n- Amazon's new AI feature might be your secret weapon for winning at Prime Day\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City."
    },
    {
      "url": "https://www.techradar.com/computing/artificial-intelligence/if-you-felt-like-amazon-could-eavesdrop-on-you-before-get-ready-to-meet-its-ai-wearable",
      "text": "If you felt like Amazon could eavesdrop on you before, get ready to meet its AI wearable\nAmazon’s newly acquired wrist-worn AI listens to your life in case you want ambient surveillance\nAmazon is looking to make AI part of your daily life and has turned to the world of wearables to help. The tech giant has just acquired Bee AI, the maker of the eponymous device for your wrist or lapel that listens to everything happening around you.\nBee’s microphones and built-in AI transcribe it all in real time and make personalized summaries of your day and your stated upcoming tasks, and then make recommendations to improve your life based not only on what it hears, but the emails, calendar, contacts, photos, locations, and other data you allow it to access.\nPeople already make jokes about how they will be discussing a product with someone else in person and, seemingly by magic, it will appear in their recommended products on Amazon. That can usually be chalked up to coincidence and forgetting previous searches, along with being unaware of your app permissions.\nHowever, this may become part of Amazon's business model, prompting people to wear microphones to listen all day and pay $50, plus a $19 monthly subscription, for the privilege.\nBee listening\nNaturally, Amazon saw potential in Bee. Alexa has mostly been stuck inside the house despite attempts at smart glasses and other wearables. Bee is a chance for Amazon to make its AI a real-world concern, part of your actual conversations and routines, not just what you yell across the kitchen. That might be helpful, but it's impossible not to think about what it might mean in terms of privacy and trust.\nTo be fair, Bee has a mute button you can hold down to pause recording when you need a moment of peace. But that assumes you realize you’re about to say something you might not want permanently archived by Amazon. Bee listens and turns your life into searchable text. Although the company claims it doesn’t retain the raw audio, the transcripts remain unless you delete them.\nI don't know if I want everything I mutter under my breath to be a searchable note. Not to mention whatever it might overhear from when I watch TV or movies at home.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nI get the appeal of a little AI that remembers everything so you don’t have to. Remembering every chore and birthday would be great. But the line between deliberate memory aid and surveillance feels blurry with it. Especially when Amazon already has so much information.\nAlthough Amazon has promised to work with Bee, allowing users to have control over their data, the actual shape of that control remains unclear for now. And control is too often translated into a complex settings menu and paragraph of boilerplate text in the terms and conditions.\nI know plenty of people who would at least try out Bee, especially when it becomes an Amazon device with all the special sales and integration with the e-commerce site that implies. Perfect recall is a tempting commodity, but it has its price. If you're willing to pay it, then I say go for it. Not every microphone is the gateway to Skynet. But skepticism and caution are essential if you want something to sit on your wrist and transform the events of your life into data points that might help sell you products.\nYou might also like\n- Google just announced 5 new Gemini features coming to Android, and it’s good news for fans of foldable smartphones\n- I tried Google’s new Gemini-powered clothing app – here’s how you can use AI to find the perfect outfit\n- Adding Google Gemini to Samsung's Ballie AI robot sounds impressive, but I'm not sure it matters\nEric Hal Schwartz is a freelance writer for TechRadar with more than 15 years of experience covering the intersection of the world and technology. For the last five years, he served as head writer for Voicebot.ai and was on the leading edge of reporting on generative AI and large language models. He's since become an expert on the products of generative AI models, such as OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, and every other synthetic media tool. His experience runs the gamut of media, including print, digital, broadcast, and live events. Now, he's continuing to tell the stories people want and need to hear about the rapidly evolving AI space and its impact on their lives. Eric is based in New York City.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.techradar.com/tag/amazon",
      "text": "Amazon\nLatest about Amazon\nAmazon is giving your camera an AI-powered shopping cart\nBy Eric Hal Schwartz published\nAmazon’s new Lens Live brings real-time visual shopping to your phone.\nPrime Video cancels beloved series with 94% on Rotten Tomatoes, but the crew is ‘optimistic we’ll find a home that believes in the show'\nBy Lucy Buglass published\nPrime Video's latest cancelation has been a sour start to many fans' weeks, but all hope is not lost.\nAmazon says it stopped Russian hackers targeting Microsoft logins as Cozy Bear strikes again\nBy Sead Fadilpašić published\nRussian hackers compromised multiple websites to steal Microsoft logins.\nThe best Kindles in 2025\nBy Sharmishta Sarkar last updated\nThe best Kindle ereaders from Amazon come in different sizes and with different features, from budget ebook readers to premium epaper note takers.\nPeacock’s new ad-free streaming channel on Prime Video is one I'll be keeping my eye on for a great streaming deal\nBy Jasmine Valentine published\nPeacock Premium Plus is now available on Prime Video, and ad-free streaming just got a lot cheaper.\nA shocking lawsuit against Amazon makes me want to cancel my Prime Video subscription immediately\nBy Jasmine Valentine published\nIf you think you own the movies and TV shows you've bought on Prime Video, a new proposed class action lawsuit against Amazon proves otherwise.\nEarly Labor Day deals are live at Amazon – here are 31 offers I'd buy on TVs, vacuums, AirPods, and more\nBy Mackenzie Frazier published\nEarly Labor Day deals are live at Amazon, and I'm rounding up the 31 best deals worth buying on TVs, vacuums, AirPods, kitchen appliances, smart home gadgets, and more.\nAmazon could soon launch an iPad-rivaling Fire tablet powered by Android, but without the bargain price tag\nBy James Rogerson published\nAmazon could replace Fire OS with Android on its next tablet, and the price could increase too.\nSign up for breaking news, reviews, opinion, top tech deals, and more."
    }
  ],
  "argos_summary": "Amazon has launched Lens Live, an AI-powered visual shopping tool that lets users point their iOS phone camera at objects and instantly see similar products with prices and reviews. Integrated with the Rufus AI assistant, it can answer follow‑up questions and provide product details, making impulse buying easier. The feature builds on Amazon’s existing visual search but focuses on quick purchasing, and it is currently rolling out only to iOS devices.",
  "argos_id": "RN990HOG7"
}