{
  "url": "https://www.makeuseof.com/google-easter-eggs-i-love-youve-probably-never-seen/",
  "authorsByline": "Ben Stegner",
  "articleId": "16e39012e10c414491287d22719d05b4",
  "source": {
    "domain": "makeuseof.com",
    "location": null
  },
  "imageUrl": "https://static0.makeuseofimages.com/wordpress/wp-content/uploads/wm/2025/09/google-isaac-newton-eastere-egg-with-egg-on-table.jpg?w=1600&h=900&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T21:00:16+00:00",
  "addDate": "2025-09-03T21:07:06.102342+00:00",
  "refreshDate": "2025-09-03T21:07:06.102345+00:00",
  "score": 1.0,
  "title": "I love these amusing Google Easter eggs, but you've probably never seen them",
  "description": "Little treats to go along with your Google search.",
  "content": "Google features a lot of jokes and fun little secrets, collectively known as Easter eggs, around its products. While you might be familiar with Easter eggs in video games, they’re also present in software and other tech sources.\n\nThese Google Search Easter eggs don’t have any practical use, but they’ll make you chuckle when you search for something that brings up a goofy result. Try entering these into Google and seeing the fun for yourself.\n\nThe Did you mean line appears on the results page when your search has a typo or Google thinks you meant to look up something similar. Some of the best Google Search Easter eggs take advantage of this.\n\nWhen you search “Alex Trebek”, the Did you mean suggestion asks if you meant “Who is Alex Trebek”. This is a reference to his longtime hosting of the game show Jeopardy, where all contestant answers must be in the form of a question, starting with “who is”, to be accepted.\n\nSearching Google for “steamed hams” will result in it asking if you meant \"steamed clams\". If you’re a fan of The Simpsons or internet humor in general, you’ll recognize this.\n\nIt references a short scene where Skinner’s plans to have his boss over for lunch are ruined when he burns the roast. He lies that the smoke in the oven is actually steam from the “steamed clams” he’s preparing, then heads to a nearby fast food place and tries to pass their burgers off as his own cooking. When he’s questioned about this, he clarifies he said “steamed hams”, which he claims are what he called hamburgers where he grew up.\n\nWhile this episode aired in 1996, it became major meme fodder in the late 2010s, when “Steamed hams but…” videos started parodying it in every conceivable way.\n\nIf you’ve been to a wedding lately, you’ll know where this one is going. The Cha Cha Slide is a line dancing song, first released in 2000, that has become a staple at wedding receptions.\n\nGoogling it lets you dance along at home, thanks to the icons to the left of the song name. As you click them, you’ll hear the instructions like “to the left” and “one hop this time!”\n\nContinuing with the pop culture references, Google also has an amusing reference for fans of The Office. Searching “assistant regional manager” will result in Google asking if you meant “assistant to the regional manager”.\n\nThis is a running joke early in the series, where Dwight calls himself “assistant regional manager” but Michael continually corrects this to the lesser “assistant to the regional manager”. Even Google’s AI overview seems in on the joke, though this is likely because the overview is getting its information on this term primarily from content about The Office.\n\nI’ve mostly chosen Easter eggs that were new to me, but this is a long-running one I’ve enjoyed for a while. Searching for “recursion” brings up a Did you mean prompt for the same word, which might lead you to think you spelled it wrong the first time. But each time you click it, the page refreshes, which is the joke.\n\nRecursion is when a process depends on a prior version of itself, like when a programming function calls itself or the “infinity mirror” effect when you share your screen on a video call and create dozens of smaller copies of it.\n\nIf you like this one, try “Groundhog Day” (one of those movies you can watch over and over, if you will) and see what happens!\n\nThe One Ring is the central object of the Lord of the Rings series, and has an Easter egg for anyone searching for more info about it on Google. A search for it will ask if you instead meant “my Precioussss”, which is how the character Gollum refers to the ring after being corrupted by it and becoming obsessed with it.\n\nIt’s one of the most famous lines from an excellent series of movies, so it's well-deserving of this amusing suggestion from Google.\n\nIf you were online during the internet’s early days, you’ll remember many webpages with ugly fonts, scrolling text, and other near-unreadable issues. Searching for “blink tag” lets you relive one of these: the deprecated HTML tag that flashes text.\n\nText disappearing and reappearing is annoying and doesn’t work well with accessibility tools, so we quickly moved on, thankfully. But it’s fun to relive those early days in this small way.\n\nI didn’t realize this until recently: when you search for a font by name, Google displays its results page in that font. Not all are supported, but many common ones are. While this is a fun discovery, it can also be practical (unlike most of these).\n\nIf you’re not sure what a font looks like, or want to see it in use without fumbling around in a document of your own, this lets you easily preview it. Another fun one related to this: searching “best font ever” brings up Comic Sans, the internet’s “favorite” font.\n\nEver feel the desire to see what websites looked like in the past? You don’t need any special tools to do this for Google. Search “google in 1998” and you’ll be treated to a recreation of what the service looked like the year it launched.\n\nIt comes complete with the exclamation point in Google’s early logo, the option to change how many results appear, and links to try your query on other long-gone search tools like AltaVista and Infoseek.\n\nEveryone around my age will remember growing up with DVDs. While their often-unique menus bring a lot of nostalgia, nothing evokes that as much as the classic screensaver. Google lets you relive this by searching “DVD screensaver”.\n\nWait a moment and you’ll see the logo fly around the screen in that predictable pattern. Every time the logo hits an edge, it changes color. And of course, the big moment comes when the logo hits a corner. A small pleasure, but one that brings back simpler times for many of us.\n\nIf you love this bit of nostalgia, the Bouncing DVD Logo site lets you put one up on the screen for as long as you like.",
  "medium": "Article",
  "links": [
    "https://www.google.com/search?q=Google+in+1998",
    "https://www.makeuseof.com/what-are-easter-eggs-in-video-games/",
    "https://www.google.com/search?q=Blink+tag",
    "https://www.makeuseof.com/check-where-google-ai-overview-gets-the-information/",
    "https://www.google.com/search?q=Alex+Trebek",
    "https://www.google.com/search?q=The+One+Ring",
    "https://www.makeuseof.com/movies-i-can-watch-over-and-over/",
    "https://www.google.com/search?q=Cha+Cha+Slide",
    "https://bouncingdvdlogo.com/",
    "https://www.makeuseof.com/tools-view-old-versions-website/",
    "https://www.google.com/search?q=comic+sans+Font",
    "https://www.google.com/search?q=Recursion",
    "https://www.google.com/search?q=DVD+screensaver",
    "https://www.google.com/search?q=Assistant+regional+manager",
    "https://www.google.com/search?q=Steamed+Hams",
    "https://www.makeuseof.com/popular-90s-websites-running/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google Search",
      "weight": 0.07343032
    },
    {
      "name": "Google",
      "weight": 0.07238711
    },
    {
      "name": "Easter eggs",
      "weight": 0.07099221
    },
    {
      "name": "steamed hams",
      "weight": 0.060927555
    },
    {
      "name": "many common ones",
      "weight": 0.057575062
    },
    {
      "name": "the best Google Search Easter eggs",
      "weight": 0.056524668
    },
    {
      "name": "these amusing Google Easter eggs",
      "weight": 0.05599881
    },
    {
      "name": "These Google Search Easter eggs",
      "weight": 0.05528311
    },
    {
      "name": "steamed clams",
      "weight": 0.055097226
    },
    {
      "name": "best font",
      "weight": 0.05365967
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Hobbies & Leisure/Special Occasions/Holidays & Seasonal Events",
      "score": 0.92919921875
    }
  ],
  "sentiment": {
    "positive": 0.10093452,
    "negative": 0.48294452,
    "neutral": 0.41612095
  },
  "summary": "Google has a number of humorous Google Easter eggs, known as \"Google Search Easter eggs,\" which are often found in software and other tech sources. These include a Did you mean line appearing on the results page when a typo is discovered, or Google thinks you meant to look up something similar. Searching for \"Alex Trebek\" will ask if you meant \"Who is Alex Trebek\", a reference to his hosting of the game show Jeopardy. The Office also features an amusing reference to The Simpsons, where fans refer to the character of \"assistant regional manager\" in the series. Search for \"steamed hams\" will result in a prompt for the same word, which may lead to the page refreshes each time you click it.",
  "shortSummary": "Google's Easter eggs are famous for their quirky, often misunderstood products like “Steamed hams” and “Alex Trebek,\" which are often referenced in pop culture and tech.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "946dc99d21bd470ca41b6f93f6b96c6d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.makeuseof.com/check-where-google-ai-overview-gets-the-information/",
      "text": "Quick Links\nSummary\n- Google's AI Overview uses its Gemini AI model to source information from the web for quick searches.\n- You can use a custom script bookmark to view Google AI Overview sources in search results.\n- The script simplifies the process of accessing sources rather than relying solely on generative AI.\nGoogle's AI Overview in search results makes it easy to find what you're looking for using generative AI. But Google's Gemini model, used to power the feature, isn't just making stuff up. It sources information from various sites on the web and pieces it together.\nIf you need to scrutinize the primary sources of information for credibility or other purposes, read on.\nHow to Add a Bookmark in Chrome for Scraping Google AI Overview Sources\nTo source information from Google's AI Overview, we'll use a custom script created by developer James McNulty from pylic—many thanks to James for this. Once added as a bookmark to your browser, it automatically gets the sources used to create AI Overviews in Google Search.\nTo get started, we'll start by adding the custom script as a bookmark.\nOpen Chrome and click the three-dot menu in the top right. Next, select Bookmarks and lists > Bookmark Manager.\nAfter that, click the three-dot menu in the top right of the bookmarks page and select Add new bookmark from the pop-up.\nEnter an appropriate name for the bookmark, then, in the script section, enter the following script:\njavascript:(function(){const links=document.querySelectorAll('div[jsname=\"s2gQvd\"] a');const uniqueUrls=new Set();const extractedInfo=[];links.forEach(link=>{const href=link.getAttribute('href');const ariaLabel=link.getAttribute('aria-label')||'';const divTextElement=link.closest('div[jsname=\"s2gQvd\"]').querySelector('div[style=\"font-family:inherit;-webkit-line-clamp:2\"]');const divText=divTextElement?divTextElement.textContent.trim():%27%27;if(href&&!uniqueUrls.has(href)){uniqueUrls.add(href);const domain=href.startsWith(%27/%27)?window.location.origin:new URL(href).origin;const anchorText=domain;extractedInfo.push({href:href,anchorText:anchorText,ariaLabel:ariaLabel,divText:divText.replace(/^(.*?)(\\u2014|$)/,%27<strong>$1</strong>%27)});}});if(extractedInfo.length>0){const formattedHtml=extractedInfo.map(info=>`<div style=\"font-family:%27Roboto%27, sans-serif;\">\n<a href=\"${info.href}\" target=\"_blank\" style=\"font-family:%27Roboto%27, sans-serif;\">${info.anchorText}</a>: <span style=\"font-family:%27Roboto%27, sans-serif;\">${info.ariaLabel}</span>\n</div>`).join(%27\\n%27);const blob=new Blob([formattedHtml],{type:%27text/html%27});const url=URL.createObjectURL(blob);const newWindow=window.open();newWindow.document.write(formattedHtml);newWindow.document.close();}else{console.log(%27No unique URLs found for <a> elements within <div[jsname=\"s2gQvd\"]> on this page.%27);}})();\nFor the best outcome, you should add the bookmark in the Bookmarks bar for ease of access in the follow-up section. Remember, you don't have to use Google's Chrome browser for this. You can use any browser as long as you find a way to create a bookmark manually.\nHow to Use the Bookmark to See Google AI Overview Sources\nNow that we have the script added to our bookmarks, it's time to use it to scrap Google AI Overview sources.\nFirst, go to Google Search and enter a query, such as \"How to change your name on Facebook.\" If Google search shows you AI Overviews first, you're set; otherwise, if there's an option to generate, click Generate.\nOnce the AI Overview is displayed, click the saved bookmark from your Bookmarks bar. Immediately, a new tab will open, showing a list of all the sources used to generate the AI Overview in search results.\nYou'll notice the order of the sources will be the same as what you'd see on the search results page by clicking the drop-down arrows in the AI Overview. The script makes it easy to view the sources of information if you prefer to go to the source instead of relying on generative AI.\nYou don't have to use this script to get the sources. You can also click the drop-down arrows in the AI Overview to see the various sources individually. If you need a fast and easy way to get the sources, the script has you covered.\nGoogle's AI-powered snapshots can be convenient for getting your questions answered. However, it may not always be accurate, so it's worth checking the sources and scrutinizing the information AI Overviews give you."
    },
    {
      "url": "https://www.makeuseof.com/movies-i-can-watch-over-and-over/",
      "text": "Movies are a linear, narrative-driven, and passive form of entertainment, making them quite challenging to revisit, unlike video games. But some of them defy this trend, making the thrills feel fresh every time. Here are several of my favorites.\n10 I Love You, Man (2009)\nWatch I Love You, Man on Apple TV\nThe journey of Peter Klaven (Paul Rudd), a socially awkward man who needs to find a best man by going on several \"man dates,\" is hilarious. He ends up meeting Sydney Fife (Jason Segel), who encourages him to be more confident and spontaneous. I Love You, Man is infinitely rewatchable due to the great chemistry between Rudd and Segel, as well as its timeless themes of friendship, self-discovery, and boundary-pushing explored through the lens of a mildly toxic bromance.\n9 Die Hard (1988)\nWatch Die Hard on Amazon Prime Video\nAlthough disputed by some, Die Hard is often considered a Christmas movie due to its setting and holiday themes. Bruce Willis plays John McClane, a cop trapped in Nakatomi Plaza, who must single-handedly take down heavily armed terrorists. Die Hard has action, humor, and a memorable villain, Hans Gruber (Alan Rickman)—all of which can be enjoyed over and over, regardless of the season.\n8 Groundhog Day (1993)\nWatch Groundhog Day on Netflix\nGroundhog Day tells the story of a cynical weatherman, Phil (Bill Murray), who relives February 2nd repeatedly. It has since inspired several time-loop movies, but it was unique at the time for blending humor, heart, romance, and existential themes like purpose and redemption (Phil gradually transforms from selfish to selfless). It has become such a cultural phenomenon that people call it \"Groundhog Day\" when life starts to feel repetitive and monotonous.\n7 The Dark Knight Trilogy (2005-2012)\nWatch Batman Begins on HBO Max\nBatman Begins is praised for presenting a grounded and darker version of the Caped Crusader. The Dark Knight gave us one of the most iconic villains in the form of Heath Ledger's The Joker. And The Dark Knight Rises capped off the trilogy with an epic conclusion to the story.\nAt first, I hated The Dark Knight Trilogy because it changed my view of Batman—a highly-trained vigilante who takes down super villains with his fists and wits. The grounded take explores justice, chaos, and heroism in a way that doesn't get old, even with repeat viewings.\n6 Edge of Tomorrow (2014)\nWatch Edge of Tomorrow on Apple TV\nI'm a huge gamer, and Edge of Tomorrow clicked with me because it feels like you're watching a roguelite video game. In the movie, the world is fighting off an alien invasion, and the main character, Cage (Tom Cruise), gains the ability to reset the day every time he dies.\nEdge of Tomorrow rewards multiple viewings as you notice Cage subtly master each scenario through repetition. On top of that, the well-choreographed action, clever humor, and the chemistry between Cruise and Emily Blunt are compelling every time I watch it.\n5 Hereditary (2018)\nWatch Hereditary on Apple TV\nHereditary explores the power of generational curses, as a family deals with a series of sinister events after their grandmother, who was deeply involved with the occult, dies. It's a gritty drama about grief and trauma with a supernatural horror twist, and the subtle details and foreshadowing require you to watch it over and over again to fully grasp and appreciate.\nEven after the shock value has worn off, it's endlessly entertaining to watch the family deal with the horrible legacy their grandmother left behind.\n4 The Lord of The Rings Trilogy (2001-2003)\nWatch The Lord of the Rings: The Fellowship of the Ring on HBO Max\nThe Lord of the Rings movies are considered peak cinema for their epic story, deep lore, memorable characters, and immersive world. You need to watch them again and again to understand the intricate depth, timeless themes (e.g., love, friendship, loyalty, hope, and sacrifice), and richness of the world J.R.R. Tolkien created.\nDirector Peter Jackson displayed cinematic craftsmanship when bringing Middle-earth to life, with the New Zealand landscapes, costume designs, and special effects. Let us also not forget the unforgettable musical score by Howard Shore. The movies are beautiful and exciting, no matter how many times you watch them.\n3 Iron Man (2008)\nWatch Iron Man on Disney Plus\nIt's always fun to watch Iron Man again, especially with hindsight of the events that follow between Phases 1 to 3 of the Marvel Cinematic Universe (MCU). This is where it all started, with a genius, billionaire, playboy, and philanthropist, Tony Stark (Robert Downey Jr.), creating a high-tech suit of armor. The film had a lot going for it, but the performance of Downey Jr., Tony's growth, action scenes, well-aged CGI, and humor keep me coming back to it.\n2 Top Gun: Maverick (2022)\nWatch Top Gun: Maverick on Apple TV\nWhen Paramount Pictures announced the sequel to Top Gun (1986), many of us were skeptical and feared it could ruin the original. But leave it to Tom Cruise to make something better, with thrilling aerial sequences, nostalgic callbacks, and a bit of heart. It grossed over a billion during its theatrical run and continues to be a huge hit on streaming because it's worth seeing more than once or twice.\n1 Fight Club (1999)\nWatch Fight Club on HBO Max\nNo one ever forgets the first rule of Fight Club, which I'm about to break here. Initially a box office flop, but now a cult classic, Fight Club is about a man, referred to as the Narrator (Edward Norton), who co-founds an underground fight club run by Tyler Durden (Brad Pitt) that helps him escape his monotonous corporate life.\nFight Club has a huge twist that will make you admire the psychological depth. But even after you know it, you still want to watch it for the epic fights and intense performances. It's also interesting to see how a club about dudes wailing on each other at the end of the day transforms into an anarchist movement.\nI have found over the years that if I revisit these movies, I tend to forget that I've already watched them before and get engrossed. The emotional impact remains just as powerful, and I don't have that \"I wish I could watch it again for the first time\" feeling because they just get better with subsequent views. I will no doubt watch them all again before the year is up."
    },
    {
      "url": "https://www.makeuseof.com/tools-view-old-versions-website/",
      "text": "Quick Links\nWhether you’re just curious to see old websites or want to find information that no longer exists on the web, knowing how to view old versions of websites can come in handy. While not every single website has been archived for future access, there are still heaps of tools and tricks to go back in time and view old versions where possible.\n1. Wayback Machine\nWayback Machine is the go-to source for finding old web pages. It’s an Internet Archive project, a non-profit library of websites, software, movies, and books.\nFounded in 1996, Wayback Machine captures and saves snapshots of thousands of websites regularly. Currently, the website hosts a mind-boggling 866 billion web pages, illustrating perfectly that nothing gets deleted from the internet.\nTo find an old version of any website, type the URL in the Wayback Machine's search bar. The tool then shows a year-by-year timeline with black lines indicating the time snapshots were taken.\nBelow the timeline, there’s a calendar that shows the exact date and time of the screenshot. To view the snapshot, hover the cursor over the circled date and choose the time.\nThe chances of remembering the exact URL of any web page that existed years ago are quite slim. So, if you've forgotten the URL, you can use Advanced Search and find the web page by keywords. For those who need to go back in time frequently, Wayback Machine has a browser extension and mobile application, too.\nIf you fear losing any webpage (or its current information) in the future, you can ask the Wayback Machine to archive it using the Save Now feature. You can also use this tool to view blurred content on websites.\n2. archive.today\nBehind the simple homepage of archive.today lies a huge library of websites archived over the years.\nTo view an older version of any website, you can search for its URL. archive.today then displays all the snapshots of that website in reverse chronological order. The tool also suggests some search operators for refining your results.\nBest of all, there’s an option to download the webpage as a ZIP file and share the page. Like Wayback Machine, you can also request the tool for capturing and archiving any website for future use.\nThough its library of archived websites is not as huge as the Internet Archive, it can still help you uncover old gems of the internet or find now-unavailable information. It has a handy Chrome extension as well.\n3. OldWeb.today\nOldWeb.today is not just a collection of archived web pages. This website mainly pulls archives from the Internet Archive, but runs them on its emulated old browsers to take you back to the early days of the internet.\nUsing this website, you can also browse the live web through ancient browsers. These browsers include different versions of Navigator, Internet Explorer, Firefox, and Mosaic.\nThe results often take a long time to load, maybe because it vows to bring back the early days of the internet (pun intended). Nevertheless, it’s a good website for viewing archives, reliving the nostalgic 90s websites, or showing your kids how difficult browsing was back in the day.\n4. Library of Congress\nThe Library of Congress is the official US Congress archive that maintains an extensive record of books, newspapers, images, web pages, and other material. Its Web Archive program aims to preserve all the content available on the web, providing researchers with a reliable source to view web archives.\nSearching any URL on its Web Archives page shows a timeline and calendar. The results page is quite similar to Wayback Machine. You can open any old web page in a new window and browse other snapshots by the Previous and Next buttons.\n5. Search Engines Cached Pages\nIf you want to view the relatively newer version of any website, you can view the pages cached by search engines.\nUnfortunately, as of February 2024, Google does not add links to cached pages on its search results page anymore. But if you use Chrome and already know the exact URL whose cached version you want to view, you can append cache: before the URL in the address bar (for example, cache:makeuseof.com). This way, Google will show you the cached website instead of the live version.\nOn other search engines like Bing or Yahoo, search the page you want to see, click the drop-down arrow beside the result’s URL, and click on Cached. The search engine will then display the latest cached version of the page instead of the live one.\nBeware that clicking on any link on the cached page will take you to the live web. You can also use Google Cache viewer tools for this purpose.\n6. Web Cache Viewer\nThis extension makes viewing old website versions much simpler. Just head on to the website whose older version you wish to see, right-click on the screen, and choose Web Cache Viewer. The extension opens a new window showing the last cached page.\nAlthough this extension pulls the snapshots from Internet Archive and Google Cache and has no record of its own, it allows you to view cached websites easily.\nDownload: Web Cache Viewer for Chrome (Free)\n7. Stanford Web Archive Portal\nStanford Web Archive Portal is a simple tool, but has an extensive collection of web pages archived over the years. It lets you find older versions of sites just by pasting the URL. You can also (optionally) specify a date range.\nLike Wayback Machine, the site shows a timeline and calendar, highlighting all the captures. You can select any version of the saved page and use the arrow buttons (in the top-right corner) to view the next/previous capture.\n8. Memento Time Travel\nServing as an aggregator of web archives, Memento Time Travel lets you travel down memory lane and view old websites. Memento asks you to enter any URL and a time in the past.\nIt then searches the requested web page in dozens of online archives, including the ones mentioned above, and shows the snapshot closest to the entered date.\nIn addition to seeing the snapshot, you have the option to embed the web page as HTML. Memento Time Travel has a Chrome extension that lets you view archives by right-clicking on any website.\nThese web archives are doing an impressive job of preserving all web content and making it accessible. However, web archives are still at risk of disappearing.\nSo if you’ve found any old version of a website and want to keep it safe for future reference, it’s best to save the entire web page on your device."
    },
    {
      "url": "https://www.makeuseof.com/popular-90s-websites-running/",
      "text": "From its humble beginnings at CERN, the World Wide Web has come a long way since it was first invented in 1989. It wasn't long after that I got to experience it myself, and yet, there are several sites from the 90s still running today.\n12 CERN\nEstablished in September 1954 in Geneva, Switzerland, CERN is the European Organization for Nuclear Research. It also houses the world's largest particle physics laboratory.\nCERN's website is the first in the world, and therefore, the oldest website online. The site was actually created by Sir Tim Berners-Lee in 1989 while he was working on the World Wide Web at CERN. Visit the page to view a live, recreated version of the original CERN website.\n11 World Wide Web Virtual Library\nAs the name implies, the World Wide Web Virtual Library was a virtual information resource on several subjects. As one of the early 90s websites, it is the world's first index of content anywhere on the World Wide Web.\nIt was also developed by Tim Berners-Lee in 1991. To this day, the website is still up and running and retains its original look, although it was last updated in February 2017.\n10 DrgnSlyr's Star Trek: The Ultimate Links\nI love fan sites. There's nothing sweeter than seeing someone really passionate about a book, movie, or show and want to create a site dedicated to loving it. DrgnSlyr's Star Trek: The Ultimate Links is one such site.\nIt features a bunch of Star Trek resources, like the cast of every series (stopping at Enterprise), pictures of ships, and episode lists. You'll also find a few pages that encapsulate what it was like using the internet back in the 90s through DrgnSlyr's Favorite Links Page.\n9 WebCrawler.com\nJust like ALIWEB, Webcrawler.com was launched in 1994. It was also the first search engine to provide full-text search and is one of the oldest examples of a search engine.\nCreated by Brian Pinkerton, Webcrawler.com is a more robust search engine than ALIWEB, but still not comparable to the likes of Google and Bing. The website still gives off that unforgettable 90s vibe.\n8 The Exploratorium\nThe Exploratorium is a popular museum of art, science, and technology located in Piers 15 and 17 in San Francisco. It was founded by Frank Oppenheimer and was opened in 1969 at the Palace of Fine Arts.\nOne of the first museums to go online and now one of the oldest websites on the internet, the Exploratorium has undergone a total facelift and now features a modern, intuitive website design.\n7 San Francisco FogCam\nMaybe webcams aren't as impressive now as they once were, but try to place yourself in the 90s when the internet wasn't what it is today, and webcams were still finding their footing. So, enter the San Francisco FogCam, which has been running since 1994. It's a year younger than me!\nThe FogCam snaps a photo of the San Francisco University every 20 seconds. And, well, its resolution is a measly 320 by 200 pixels. For comparison, 4K has nearly 8.3 million pixels while the San Francisco FogCam has only 64,000 pixels. Even today's cheapest smartphones take better photos.\n6 Bloomberg\nAs of 1993, there were only a handful of websites available worldwide. Later that year, Bloomberg would join the ranks of innovative companies that owned a corporate website.\nFounded in 1981, Bloomberg went online in 1993, and to this day, it remains online using its website as one of its outlets to provide financial, software, and other enterprise services.\n5 arXiv\narXiv, pronounced archive, is an online distribution service that allows you to freely access more than 2 million scholarly articles in the fields of computer science, economics, electrical engineering and systems science, mathematics, physics, quantitative biology, quantitative finance, and statistics.\nLaunched on August 14, 1991, arXiv is one of the oldest websites still online. Powered by Cornell University, arXiv allows authors to submit their academic works for free. Similarly to Wikipedia, it also welcomes donations from members of the public and organizations to help maintain the site.\n4 IMDb\nThe Internet Movie Database began as a fan-run movie database on the \"rec.arts.movies\" Usenet group. An early 90s website, it is now one of the largest online databases of up-to-date information about films, cast and crew, and so on.\nThe original IMDb website was launched in 1993 during the early days of the internet and was hosted by the computer science department of Cardiff University, Wales. IMDb is now an Amazon company and features a modern website design.\n3 Dole/Kemp Campaign Site\nWhile I was in pull-ups, President Clinton and Senator Bob Dole were racing against one another to be the next president of the US. Ultimately, Bill Clinton was re-elected. However, you can still visit Bob Dole's campaign site. It's a neat slice of American history, considering most links still work.\nThere are press releases, speeches, and even an update that mentions the results of the election. It's too bad the commercials aren't available anymore, but you can still read the synopsis for each one. I bet you could find the campaign commercials on YouTube, though."
    },
    {
      "url": "https://www.makeuseof.com/what-are-easter-eggs-in-video-games/",
      "text": "If you've played video games for any amount of time, you've probably heard of the term \"Easter egg.\" But what exactly is an Easter egg, and how do you find them?\nBelow, we examine Easter eggs in gaming, including their history and some examples.\nWhat Are Easter Eggs?\nEaster eggs are secret bits of media that developers hide inside video games (as well as other mediums, like movies and computer software). They can come in the form of text, images, special scenes, nods to other works, and more.\nGenerally, Easter eggs are hidden and uncovered for their own sake. They are optional, and they don't grant any bonuses to gameplay. This makes them distinct from cheats or in-game collectibles.\nVideo game Easter eggs get their name from the real-life practice of Easter egg hunts, where children search for eggs filled with candy and other treats.\nThe History of Video Game Easter Eggs\nDevelopers have been hiding Easter eggs in their games since the early days of the medium. The first widely recognized Easter egg, which served as the origin of the term, was hidden in the 1980 game Adventure on the Atari 2600. It's one of the first action-adventure game, with its primitive key-collecting and sword combat serving as a precursor to titles like The Legend of Zelda.\nIts developer, Warren Robinett, was frustrated with Atari's policy at the time of not giving credit to its programmers, which the company did to prevent other companies from poaching their talent. He secretly embedded the text \"Created by Warren Robinett\" into the game, accessible only with a method that was difficult to stumble upon.\nThis wasn't discovered until after the game was released, by which point Robinett had left Atari. The company decided to leave this text in the game instead of removing it; Steve Wright, the company's software development director, said that players trying to find this would be like \"hunting for Easter eggs\" and wanted all future Atari games to include them.\nExamples of Easter Eggs in Video Games\nSince Adventure, Easter eggs large and small have appeared in thousands of games. These tend to fall into a few categories. Let's look at some of the most popular, along with some examples from games.\nReferences to Other Games\nSome Easter eggs are nods to other franchises or titles, usually those made by the same developer. These are usually a little treat for fans of the franchise, or observant players who know a lot of games.\nFor example, in Uncharted 3, there's an easily-overlooked newspaper that reads \"Scientists are still struggling to understand deadly fungus.\" This is a reference to the plot of The Last Of Us, also developed by Naughty Dog. Interestingly, the company forgot to remove this reference before the game launched, since The Last Of Us hadn't been announced yet.\nOther examples include Persona 5 making light references to characters from Persona 4, Animal Crossing: New Leaf allowing you to eat a \"Famous Mushroom\" item and grow large like Mario, and Overwatch characters' voice lines referencing dozens of movies and games.\nFun and Silly\nA lot of Easter eggs are simply fun little jokes that last a few seconds and then move on. They often reward players for going out of their way to explore or trying weird combinations of actions.\nFor example, in Crysis 2, interacting with an innocuous panel on the wall in a certain level will open an elevator across the hall. When it opens, you'll see soldiers dancing for a few seconds.\nAnother Easter egg in this vein is being able to move the 64 icon around the screen on the Star Fox 64 title screen while the character's heads follow it. In the case of Grand Theft Auto: Vice City, they hid a literal chocolate Easter egg in the game.\nDevelopers' Room\nA fun pattern of Easter egg is a special room that lets you talk with in-game avatars that represent the game's creators. They might tell you more about the game's background or give you various rewards for finding the room.\nOne of the best-known examples of this is The Dream Project in the SNES RPG Chrono Trigger. In one of the game's many endings, you end up in a room with several of the people behind the game, with the opportunity to chat and hear more about their experiences.\nIn most of the Pokémon games, you're able to speak with characters that represent the designers. Another similar example is the Insomniac Museum in many Ratchet & Clank games. These bonus rooms include scrapped content and developer commentary for a behind-the-scenes look.\nOngoing Jokes\nIf you play many games from the same studio or designer, you might notice Easter egg patterns in their games. One fun case of this is Totaka's Song, a simple melody that Nintendo composer Kazumi Totaka hides in a lot of the games he works on.\nThe melody usually requires waiting for another track to end, making it hard to stumble across. People have a lot of fun trying to find it in each game they play with Totaka's compositions.\nWhy Do Developers Hide Easter Eggs?\nYou might wonder why developers bother to put Easter eggs in their games. After all, they just add more work in a development schedule that's often crunched as it is.\nAs we've seen, Easter eggs can serve as a way for the developer to communicate directly with the player, even if their managers aren't on board with it.\nBut more importantly today, they are simply a way to add some extra flair to games. Developers have fun hiding these secrets, and sometimes it takes players years to dig them up. As a gamer, it's fun to be the first person to discover something like this and share it with the world. Even Easter eggs that are less hidden, like nods to other games, are a neat little \"aha!\" moment for diligent fans of a series.\nEaster eggs inject a lot of fun into games that would otherwise be missing. Having a hidden message just for the sake of it can be refreshing in a lot of games, and keeps them from getting too serious.\nTime for an Egg Hunt\nWe've taken a brief survey of Easter eggs in gaming, including their origins, some common types, and why they exist. Their definition is pretty broad, so you might find other kinds than what we've mentioned here. Next time you play a game, keep an eye out for hidden rooms, nods to other media, or other little goodies. You might be surprised what you find!\nAnd don't forget that video games aren't the only place where you'll find Easter eggs. They exist in software, on websites, and much more."
    }
  ],
  "argos_summary": "Google’s search engine is peppered with playful Easter eggs that pop up when users type certain phrases, such as the “Alex Trebek” and “steamed hams” prompts that reference pop culture. Other fun surprises include the Cha Cha Slide dance instructions, a “recursion” prompt that loops back to itself, and a search that shows Google’s original 1998 layout. While these Easter eggs add entertainment value, they have no practical financial impact and are purely for user amusement.",
  "argos_id": "TBFBY2JJD"
}