{
  "url": "https://nypost.com/2025/09/03/sports/morgan-riddle-tries-to-find-viral-us-open-magic-again-as-taylor-fritz-eliminated/",
  "authorsByline": "Jenna Lemoncelli",
  "articleId": "15fd9fc250ec494a999efc967dfe993c",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-fyxcrncj3-1756909606525.jpg?quality=75&strip=all&1756895277&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T14:28:05+00:00",
  "addDate": "2025-09-03T14:31:27.020336+00:00",
  "refreshDate": "2025-09-03T14:31:27.020337+00:00",
  "score": 1.0,
  "title": "Morgan Riddle tries to find viral US Open magic again as Taylor Fritz eliminated",
  "description": "Morgan Riddle reminisced on happier times after her boyfriend, Taylor Fritz was beaten by Novak Djokovic, 6-3, 7-5, 3-6, 6-4, in the U.S. Open quarterfinals on Tuesday night.",
  "content": "Morgan Riddle reminisced on happier times after her boyfriend, Taylor Fritz was beaten by Novak Djokovic, 6-3, 7-5, 3-6, 6-4, in the U.S. Open quarterfinals on Tuesday night.\n\nTaking to her Instagram Story, the influencer posted snapshots of her and her friends sipping Honey Deuce drinks in the Grey Goose suite at Arthur Ashe Stadium — as well as the image of her that went viral at last year’s Grand Slam.\n\nIt showed her and fellow influencer Brittany Williams, who dated Bills quarterback Josh Allen before his engagement to actress Hailee Steinfeld, having a ball in the Grey Goose suite at the U.S. Open last September.\n\nFritz was the 2024 U.S. Open runner-up, losing to Italy’s Jannik Sinner, 6-3, 6-4, 7-5, in the men’s singles final last year.\n\nOther photos showed Riddle and her friends, including influencer Tessa Brooks and Brigid Duffy, taking in Fritz’s victory over Tomas Machac, 6-4 6-3 6-3, in the Round of 16 on Sunday.\n\n“Had to run it back to the Grey Goose suite for some honey deuces,” Riddle added.\n\nFritz’s winless streak against Djokovic (0-11)) continued with Tuesday’s match that lasted nearly three and a half hours under the lights in Arthur Ashe Stadium\n\nThe No. 4 seed Fritz was the only American remaining in the U.S. Open men’s singles draw.\n\nRiddle, who’s been dating Fritz since 2020, has credited their relationship for furthering her career in fashion and as an influencer.\n\nDjokovic, 38, will face World No. 2 Carlos Alcaraz in the semifinals on Friday.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2024/09/04/sports/josh-allens-ex-brittany-williams-takes-in-us-open-with-morgan-riddle/",
    "https://nypost.com/2025/09/03/sports/astros-ace-framber-valdez-accused-of-intentionally-crossing-up-catcher/",
    "https://nypost.com/2025/09/02/sports/novak-djokovic-fends-off-taylor-fritz-at-us-open/",
    "https://nypost.com/2025/09/02/sports/yankees-jose-caballero-gets-ejected-in-fiery-scene-against-astros/",
    "https://nypost.com/2025/09/02/sports/rafael-devers-homer-sparks-wild-giants-rockies-brawl/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. Open",
      "weight": 0.10359979
    },
    {
      "name": "Taylor Fritz",
      "weight": 0.10293543
    },
    {
      "name": "Fritz",
      "weight": 0.094164
    },
    {
      "name": "viral US Open magic",
      "weight": 0.09278087
    },
    {
      "name": "Grey Goose",
      "weight": 0.0887456
    },
    {
      "name": "US Open",
      "weight": 0.086738385
    },
    {
      "name": "fellow influencer Brittany Williams",
      "weight": 0.08449496
    },
    {
      "name": "influencer Tessa Brooks",
      "weight": 0.0830835
    },
    {
      "name": "Morgan Riddle",
      "weight": 0.08216967
    },
    {
      "name": "Arthur Ashe Stadium",
      "weight": 0.07694794
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.96875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.94970703125
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.61865234375
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.5595703125
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.5458984375
    }
  ],
  "sentiment": {
    "positive": 0.2226264,
    "negative": 0.27833423,
    "neutral": 0.49903935
  },
  "summary": "Morgan Riddle, a fashion influencer, posted photos of her and friends drinking Honey Deuces in the Grey Goose suite at Arthur Ashe Stadium after Taylor Fritz was defeated by Novak Djokovic in the U.S. Open quarterfinals. The photos also showed Riddle and fellow influencer Brittany Williams having a fun time at the Grand Slam. The pair have been dating since 2020 and Riddle credits their relationship for boosting her career as an influencer.",
  "shortSummary": "Morgan Riddle reminisces about life in the Grey Goose suite at the US Open after Taylor Fritz was defeated by Novak Djokovic, highlighting her love for tennis.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bd6dd7c5e10e4f9c91153aacba586275",
  "places": [
    {
      "osmId": "284859611",
      "road": "Roosevelt Avenue",
      "suburb": "Queens",
      "city": "New York",
      "state": "New York",
      "postcode": "11368",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.74989615,
        "lon": -73.84704281162813
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/09/02/sports/rafael-devers-homer-sparks-wild-giants-rockies-brawl/",
      "text": "Rafael Devers’ homer sparks wild, ejection-filled Giants-Rockies brawl\nThe Rockies and Giants might’ve shown the most fight they’ve had all season in the first inning of Tuesday’s game in Denver.\nAfter San Francisco star Rafael Devers hit a towering home run at Coors Field in the Giants’ 7-4 win, the benches cleared with plenty of shoves being thrown on the field in a wild scene.\nDevers watched his homer and began trotting around the bases, and it seemed as if Rockies starter Kyle Freeland took exception, jawing at the slugger as he got past first base. Devers fired back as first base umpire Dan Bellino tried to hold him back.\nAs tensions rose, both dugouts emptied onto the field, with Giants stars Matt Chapman and Willy Adames both throwing shoves at Freeland despite umpires trying to prevent things from escalating.\n“I don’t know why he got like that,” Devers said of Freeland after the game through an interpreter, according to the San Francisco Chronicle. “I didn’t do anything wrong. I mean, I did the same thing I do every time I hit a home run.”\nThings appeared to finally cool down before the teams came close to one another, with cooler heads finally prevailing without more shoving.\nFreeland, Adames and Chapman were all ejected.\nThe Rockies starter called Devers’ home run trot “extremely disrespectful.”\n“Extremely disrespectful to show me up like that in the first inning after hitting a home run. Standing there, watching it, taking your sweet time getting down to first base,” Freeland said, per the Denver Post. “I’ve been in this league quite some time, and I know he has as well. I just find that extremely disrespectful, and I felt that I needed to let him know about that.”\nOnce the Giants cleared the field and Antonio Senzatela took over the pitching duties for Colorado, the umpiring crew made Devers finish rounding the bases after his 30th long ball of the season in what was a bizarre way to start the NL West clash."
    },
    {
      "url": "https://nypost.com/2025/09/03/sports/astros-ace-framber-valdez-accused-of-intentionally-crossing-up-catcher/",
      "text": "Access the Yankees beat like never before\nJoin Post Sports+ for exciting subscriber-only features, including real-time texting with Greg Joyce about the inside buzz on the Yankees.\nTry it freeAn Astros ace is accused of a bush-league maneuver — and this one doesn’t involve a trash can.\nEx-MLB pitcher Dallas Braden and plenty of others allege that Houston lefty Framber Valdez intentionally plunked his catcher, Cesar Salazar, with a pitch after some confusion moments after allowing the game-changing grand slam to Trent Grisham in the Yankees’ 7-1 win Tuesday night.\n“(One hundred percent) intentional,” Braden tweeted above a clip of the controversial pitch. “Absolute trash behavior.”\nValdez denied through a translator that he intentionally plunked his catcher and added that he apologized to Salazar, who said he pushed the wrong button on PitchCom.\n“It was not intentional,” Valdez said after allowing six runs in five innings.\n“I called for a sinker, and that’s the pitch I wanted. There was a lot of noise and that’s what I thought he wanted me to throw, but, no, it was not intentional.”\nThe supposed inflection point for this alleged teammate-on-teammate crime happened in the fifth inning with Grisham at the plate in a 2-0 game with the bases loaded and two outs.\nAs Valdez readied to throw his 1-0 pitch, it appeared he shook his head — as Braden noted in a breakdown — and Salazar then motioned for him to step off the mound.\nValdez, though, committed to the pitch — later saying that he specifically called that offering — and threw a 96-mph sinker that Grisham went the other way with for a game-changing grand slam.\nThe lefty appeared quite ticked after allowing the homer.\nTwo pitches later, Valdez fired a pitch that Salazar clearly did not expect, and it hit off his protector’s chest in a jarring moment, with the ball careening off the catcher.\nBraden noted this should not happen due to PitchCom, which allows the two to be on the same page.\n“This is the era of PitchCom,” Braden said. “You can hear what’s coming, you know what’s coming, if you have any second guesses, you step off.”\nWhen asked about how he communicated to Salazar that he wanted the sinker, Valdez said, “It wasn’t necessary,” before later noting that he did not hear the curveball choice due to the noise.\n“That was just the pitch that I had in mind,” Valdez said. “He called for a curveball, but I was already in mind that I was going to throw a sinker. That’s what I threw, so that’s what happened.”\nValdez did not help himself by immediately turning his back after the pitch hit his catcher, not even checking to see if he was OK.\nSalazar notably started at Valdez for a few moments after the pitch before pushing his mask upward and walking toward Valdez before throwing the ball to him.\nValdez “emphatically” spoke in Spanish with Salazar in the clubhouse after the game, per MLB.com.\n“We just got crossed up,” Valdez said through a translator.\n“I called for that pitch, I threw it and we got crossed up. When we went down to the dugout, I excused myself with him and I said sorry to him and I take full responsibility for that.”\nSalazar didn’t accuse Valdez of any bad behavior, instead noting how many Yankees fans invaded Daikin Park for the important series.\n“No, didn’t get crossed up,” Salazar said. “There was a good amount of Yankees fans, so it was pretty loud after the grand slam. Maybe my PitchCom wasn’t in the right spot, I pressed the wrong button, ya know?”\nTuesday’s outing marked yet another poor showing from the lefty ace while he heads toward free agency, with Valdez now 1-4 with a 5.66 ERA in his last seven starts.\nHe’s 12-8 with a 3.40 ERA spanning 27 starts this season.\nThe Astros still lead the Mariners by three games in the AL West and occupy the No. 3 seed in the AL.\n“Heat of the moment got to us,” Salazar said. “He apologized after, he’s great. There wasn’t anything bad about it, just pressed the wrong button and I was expecting another pitch.”"
    },
    {
      "url": "https://nypost.com/2025/09/02/sports/yankees-jose-caballero-gets-ejected-in-fiery-scene-against-astros/",
      "text": "Access the Yankees beat like never before\nJoin Post Sports+ for exciting subscriber-only features, including real-time texting with Greg Joyce about the inside buzz on the Yankees.\nTry it freeHOUSTON — José Caballero arrived to the Yankees with the reputation of easily getting under opponent’s skin.\nBut he may have the same knack with umpires, which is not nearly as productive.\nCaballero got ejected for the second time in two weeks Tuesday in the fourth inning of the 7-1 win over the Astros at Daikin Park.\nThe utilityman was upset after he was hit on the leg by a bouncing pitch from Framber Valdez, but he went around on his swing, with home plate umpire Ramon De Jesus ruling it a strike. He did not get much leash for arguing before De Jesus gave him a quick hook.\n“At this point, all I’m thinking is I can’t even look at them,” Caballero said. “Not really [warranted], but at this point, I can’t get thrown out there.\n“I was just explaining, ‘How can you see everything happen? You’re paying attention to the strike zone, paying attention to the ball bouncing, paying attention that I’m jumping out of the way, you’re paying attention [to] did the ball hit me, and you also see that I swung? That’s crazy.’ And he tossed me.”\nIt was a brutal spot for Caballero to get his second ejection as a Yankee, on a night when he was starting at third base for his right-handed bat against the lefty Valdez. Caballero, who had doubled and stolen third in his first at-bat, was likely to move to the outfield by the end of the night, too, as a defensive replacement for Giancarlo Stanton. But instead he hit the showers early with lefty-hitting Ryan McMahon replacing him at third base, and Jasson Domínguez eventually replacing Stanton in left field.\nManager Aaron Boone, who did not get out in time to protect his player from getting tossed, said he didn’t “love it,” but added that he was “not as upset” as he was when Caballero got ejected in extra innings against the Rays last month in Tampa and put the Yankees in an even tougher spot with a shorter bench.\n“Look, I don’t want our guys getting ejected from the game,” Boone said. “As much as I can, I try to interject. He’s too important to our team and to this game tonight. So it’s something we got to continue to talk about and work on and hopefully improve on. But I don’t want to put this in the Tampa class.”\nPaul Blackburn gave the rest of the bullpen a breather, pitching the final two innings in relief of Max Fried and striking out four. He also made a nice play to end the game, snaring a soft liner and throwing to first for a double play.\nAustin Slater (hamstring strain) started a third rehab game on Tuesday night with Triple-A Scranton/Wilkes-Barre, going 1-for-3 with a walk and playing seven innings in left field. He figures to return from the IL by this weekend. … Cody Bellinger was named the AL Player of the Week on Tuesday after batting .444 with a 1.278 OPS last week."
    },
    {
      "url": "https://nypost.com/2025/09/02/sports/novak-djokovic-fends-off-taylor-fritz-at-us-open/",
      "text": "Superman has his kryptonite. Sisyphus had his rock. And Taylor Fritz has Novak Djokovic.\nFritz is gone from the U.S. Open, extending the American men’s funk of Grand Slam futility to 22 straight years. And he was defeated once again by the man he’s still never beaten, ousted by Djokovic 6-3, 7-5, 3-6, 6-4 in the quarterfinals.\n“He was the better player second and third set. I got really out of trouble in the second, somehow found a way,” Djokovic said. “I was just trying to survive.\n“In important moments in the fourth, I served well, mixed it up, came to the net. Just tried to give him a different look and waited patiently for my opportunity. … It’s one of those days where you just have to grind. You just have to play with your heart and fight. That’s what really gave me the win in the end.”\nThat win sent the 38-year-old into a celebratory dance from “KPop Demon Hunters” — in honor of his daughter Tara’s birthday Tuesday — and into the semis vs. Carlos Alcaraz. And the loss sent Fritz to a galling 0-11 against his nemesis, wondering just what he’ll have to do to finally break through.\nWell, breaking would be a start. He was 2-of-13 on break points, 0-of-5 just in the final game of the second set. For many moments, Fritz was every bit as good as Djokovic. The Serb won 130 points to his 126 — but Fritz couldn’t get the ones he absolutely, positively had to have, double-faulting to end the match.\n“Realistically, I just can’t come out of those first two sets down two sets to love. I need to play better,” Fritz said. “That’s one of the things that makes the great players great: They win the big points.\n“I’m going to need to go out and take those points from him. He’s not just going to hand them over to me. That’s exactly what happened. … So it was tough for me to go out and take those points.”\nThe night started off-kilter for Fritz, taking the court with his trademark Hugo Boss headband on upside down. When he finally changed it to start the third set, the momentum changed as well. But it was too little, too late.\nWith the crowd desperately wanting to get behind the last U.S. man standing, Djokovic willingly played the villain.\n“I wear my heart on my sleeve for this sport,” Djokovic said. “It still matters.”\nDjokovic had taken a bow after one impossible forehand crosscourt winner, then put his hand to his ear and waved to the crowd after taking the second set. But when he got heated at chair ump Damien Dumusois for not doing the impossible — silencing fired-up New Yorkers — the Frenchman offered him sage advice.\n“It’s not going to help, Novak,” Dumusois warned.\nThe crowd — some of whom paid $10,000 to be in the stands — doubled and tripled down. They got louder, and Fritz got better, breaking to go up 3-1 in the third.\nWith just two aces through the first two sets, Fritz hit seven in the third. He capped a 13-shot rally with a winner to take the set.\nBut he wouldn’t get the fourth.\nFritz is one of tennis’ better servers, with the second-most aces on the tour this season. But after averaging 15, he didn’t have any in the opening set, and was 1-of-11 on his second serve.\nDjokovic is history’s greatest returner, and in the second set Fritz got just 38 percent of his first serves in.\nWith Djokovic serving up 5-3, Fritz had five break points but couldn’t convert any of them. There was a 25-shot rally that saw Djokovic go for the line and point to his ear to troll the crowd en route to taking the set.\nFritz had been the last man to drop the first two sets to Djokovic and force a fifth, four years ago in Australia. But at 5-4 in the fourth, Djokovic stepped back deeper on Fritz’s serve and the American’s double-fault handed him the match.\n“I had so many more chances that you’re not going to see on a stat line,” Fritz said. “I was converting and playing these points just really poorly.\n“Just bad decision-making, because I wasn’t playing as well as I would’ve wanted to.”"
    },
    {
      "url": "https://nypost.com/2024/09/04/sports/josh-allens-ex-brittany-williams-takes-in-us-open-with-morgan-riddle/",
      "text": "“What a night” at the U.S. Open, indeed.\nInfluencer Brittany Williams, who previously dated star Bills quarterback Josh Allen, took in Tuesday’s action in Flushing with Morgan Riddle, the girlfriend of U.S. Open semifinalist Taylor Fritz.\nThe duo was photographed together at Arthur Ashe Stadium, with the tournament’s social media account writing alongside the snap, “When you take a peek at the updated men’s singles draw.”\nFritz, who has been dating Riddle since 2020, advanced to a Grand Slam semifinal on Tuesday for the first time in his career after topping Germany’s Alexander Zverev in the quarterfinal, 7-6 (7-2), 3-6, 6-4, 7-6 (7-3).\nHe will face fellow American Francis Tiafoe, who took down Grigor Dimitrov, 6-3, 6-7, 6-3, 4-1, after the Bulgarian retired in the fourth set.\nFriday’s highly anticipated matchup will mark the first all-American men’s semifinal at a Grand Slam since 2005 when Andre Agassi defeated Robby Ginepri in five sets en route to the final.\nAgassi would lost to Roger Federer in the finals.\nWilliams, who is based in New York City, took to her Instagram Stories on Tuesday to chronicle her evening out at the tournament.\nCaptioning a post, “What a night,” Williams is seen posing in a black top and a matching skirt while holding a Honey Deuce, the U.S. Open’s signature cocktail.\nShe tagged Riddle in a separate slide.\nWilliams dated Allen for years before rumors of an apparent split circulated in early 2023.\nShe spoke about navigating the New York dating scene during a February podcast appearance without mention of Allen’s name.\n“I was with my ex-boyfriend for 10 years,” she said on the “Martinis and Bikinis” podcast. “I would say that coming into the dating world was very, very, very difficult for me at first because I’m just like, I never thought I would be here again. But here I am, I am very happy now. The dating life in New York is absolutely crazy but it’s so much fun. It was so entertaining.”\nPrior to their split, Williams attended Bills games and would frequently post the photos on social media.\nAllen, who is entering his seventh season in Buffalo, has been linked to actress-singer Hailee Steinfeld since May 2023.\nThe Bills host the Cardinals in their season opener on Sunday at 1 p.m."
    }
  ],
  "argos_summary": "Morgan Riddle reflected on happier times after her boyfriend, tennis star Taylor Fritz, was defeated by Novak Djokovic in the U.S. Open quarterfinals. She posted Instagram Stories from the Grey Goose suite at Arthur Ashe Stadium, sharing photos with friends and highlighting Fritz’s earlier victories. The post underscores Riddle’s personal connection to Fritz’s career and the broader context of his recent loss to Djokovic.",
  "argos_id": "TLY4FUB4X"
}