{
  "url": "https://www.inc.com/fast-company-2/executive-coach-introverted-leader-quiet-professional/91234928",
  "authorsByline": "Fast Company",
  "articleId": "b37c0d4320a54002a619091c9e593052",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/09/p-91372716-quiet-to-commanding.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T11:40:33+00:00",
  "addDate": "2025-09-03T11:56:09.530519+00:00",
  "refreshDate": "2025-09-03T11:56:09.530521+00:00",
  "score": 1.0,
  "title": "How to Go From Quiet to Commanding",
  "description": "An executive coach offers introverts five tips for sounding more confident.",
  "content": "If you’re a quiet professional, especially an introvert, you know this feeling well. You’re respected, but not remembered. You stay heads-down, hoping the work will speak for itself. But it doesn’t. The truth? Many high-performing introverts struggle to be heard, not because they lack confidence or ability, but because they rely on their work to speak for itself. In today’s fast-paced, visibility-driven workplace, that’s no longer enough. If you want to be seen as a leader, you have to be heard. I recently coached a senior scientist at a global biotech company. Exceptionally skilled and deeply respected, she quietly disappeared in high-stakes meetings, and it was costing her. Colleagues overlooked her contributions. Leaders began excluding her from key decisions, and she was repeatedly passed over for leadership roles, not because of her ability, but because she wasn’t seen as a strong presence in the room.\n\nHer insights were compelling, but she hesitated to assert them. Some leaders began to misread her silence as a lack of confidence or conviction. What she experienced is common, especially for introverts. Research from Harvard Business Review shows that introverts are often overlooked for leadership roles, not because they’re less effective, but because they don’t actively show up. When they stay under the radar, they risk being underestimated, no matter how valuable their contributions. Great work isn’t enough if no one sees it. You have to make it visible. And that means speaking up.\n\nYou don’t have to be the loudest voice in the room. But you do need to be the one people remember when the meeting ends. That’s what shifts perception. That’s what gets you noticed. The good news? You don’t have to change who you are. You just need a strategy to speak up with clarity, confidence, and impact.\n\n5 WAYS TO SPEAK UP WITHOUT BEING LOUD These five strategies are designed specifically for quiet professionals like you, who want to be heard by adding value, not volume. As an introvert, preparation is your superpower, but don’t overdo it. When preparing for meetings, you don’t need to know everything; you just need to know what matters. Don’t just bring data; bring perspective. Before the meeting ask yourself: What’s the one thing I want leadership to know? What decision are they facing, and how can I help move it forward?\n\nIntroverts often over-qualify their ideas to sound polite or careful, but it comes across as uncertainty. Skip phrases like “This might be silly . . .” or “I’m not sure this makes sense . . .” and say, “Here’s what I see” or “One idea we haven’t explored yet.” If you catch yourself starting with a qualifier, pause. Say it silently, then switch to a more confident version before speaking. Skip the long preambles. Don’t ease in with, “Let me walk you through my thinking . . .” Go straight to the value: “Here’s a risk I see” or “One angle that haven’t been mentioned . . .” The faster you get to your point, the more likely people are to listen and remember it.\n\n5. FOLLOW UP TO EXTEND YOUR INFLUENCE Many introverts find that writing helps them organize and express their thoughts clearly, so use that strength. After the meeting, send a follow-up email summarizing key points or outlining next steps. This reinforces your ideas, keeps your contributions visible, and positions you as someone who drives clarity and action. YOU’RE IN THE ROOM FOR A REASON If you’ve ever stared at a table of senior leaders, or a Zoom screen full of them, and thought, What am I doing here? you’re not alone.",
  "medium": "Article",
  "links": [
    "https://incbestinbusiness.secure-platform.com/bib/",
    "https://hbr.org/2021/01/can-introverts-thrive-in-extroverted-careers"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Many introverts",
      "weight": 0.07789317
    },
    {
      "name": "Introverts",
      "weight": 0.07445255
    },
    {
      "name": "introverts",
      "weight": 0.07445255
    },
    {
      "name": "senior leaders",
      "weight": 0.06839522
    },
    {
      "name": "leadership roles",
      "weight": 0.06774368
    },
    {
      "name": "key points",
      "weight": 0.06352097
    },
    {
      "name": "key decisions",
      "weight": 0.062765904
    },
    {
      "name": "quiet professionals",
      "weight": 0.061550003
    },
    {
      "name": "meetings",
      "weight": 0.059852835
    },
    {
      "name": "Leaders",
      "weight": 0.0556613
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.62744140625
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.583984375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.471435546875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.322265625
    },
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.300537109375
    }
  ],
  "sentiment": {
    "positive": 0.07172141,
    "negative": 0.64709705,
    "neutral": 0.28118145
  },
  "summary": "The article discusses five strategies specifically for introverts who struggle to be heard in the workplace, often due to their lack of confidence or ability. The author suggests that high-performing introverts rely on their work to speak for itself, but this is not enough in today's fast-paced, visibility-driven workplace. Research from Harvard Business Review indicates that introverts are often overlooked for leadership roles due to not being actively present, but because they don't actively show up. The article suggests that if you want to be seen as a leader, speaking up with clarity, confidence, and impact. It also suggests that following up with a follow-up email outlining key points or recommendations for future action.",
  "shortSummary": "Introverts need to adopt five strategies to make their work public, emphasizing strategic communication strategies and emphasizing value, rather than just being quiet.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a0c12c6268d748aaa6b23eef2e495f51",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://incbestinbusiness.secure-platform.com/bib/",
      "text": "National Recognition\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\ndouble-click to edit, do not edit in source\nThe Inc. Best in Business awards celebrate the projects and initiatives that were true business wins for your company over the past year. Whether it is about a new innovation, a standout marketing campaign, a creative use of AI, or a bold move that paid off, we want to hear your story.\nTell us about a successful project or business win and find your company among the winners that will be featured on Inc.com and in the pages of Inc. magazine. Hundreds of companies will be named to the Best in Business list, with even more recognized in several standout categories.\nNow’s your chance to earn national—and global—recognition for the success you’ve had. Submit your project today and let the world see what makes your company the best in business.\nFor over 40 years, Inc. magazine has been devoted to recognizing America’s most dynamic businesses and honoring the great things they do. This year, hundreds of companies will make the cut and be honored in print and online. Honorees in 2025 will enjoy the following benefits:\nEarn distinction from Inc. as one of America’s Best in Business and automatically be considered for Inc.’s prestigious Company of the Year award!\nBe featured in the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\nEvery application will be seen and evaluated directly by Inc.’s editors, who will source stories and articles directly from the honorees and applicant pool.\nShow your current employees that all of their long days and nights of hard work are paying off, and improve recruiting opportunities with prospective employees.\nApplying is simple! Fill out the online application, where you will enter a few details about your company and answer three questions about your company’s achievement:\nDescribe a specific project, initiative, or innovation your organization achieved over the past year that is noteworthy.\nExplain how the outcome of this project is a win for your company, leadership team, or industry, and how it sets you apart from your competitors.\nCite some metrics over the past 12 months, directly related to this project, that show positive business outcomes resulting in a win.\nYou will then select which business categories you’d like to apply for—the more categories you apply to, the higher the chances of being recognized. You can see a list of award categories below. That’s it!\nApply Now\nFinal Deadline: September 12\nAll applicants must first apply to the prestigious Best in Business main list—celebrating hundreds of companies for standout projects and initiatives over the past 12 months. Then, boost your chances for recognition by adding any of our exclusive award categories, with multiple winners honored in each.\nCelebrating AI projects and initiatives that have delivered tangible results—whether through increased efficiency, cost savings, improved customer experiences, or new revenue opportunities— by demonstrating clear, measurable wins for the organization.\nCelebrating successful projects or initiatives built without external funding—highlighting the creativity, resilience, and resourcefulness of founders and teams.\nRecognizing the branding, guerrilla marketing, pop-up, experiential, and social media campaigns of upstart companies that have successfully challenged industry leaders and won devoted communities of customers.\nRecognizing successful projects or initiatives that resulted from the partnership of two or more companies.\nHonoring projects or initiatives that have successfully built new communities or deepened engagement within existing ones—fostering connection, participation, and lasting value for their members.\nRecognizing outstanding projects or initiatives from family-owned businesses.\nRecognizing projects or initiatives that successfully attracted investment or were a direct result of investment.\nRecognizing groundbreaking innovations, inventions, or products of all types that have delivered meaningful outcomes, marking them as true wins worth celebrating.\nCelebrating bold brand marketing and other strategies and campaigns that truly moved the needle. Advertising, brand marketing, digital marketing, and performance marketing will be recognized in this category.\nCelebrating projects or initiatives that have made a measurable, positive impact on society, whether by addressing social challenges, advancing equity, improving well-being, or fostering sustainable change in communities.\nHonoring social media campaigns or innovations that have driven significant results, such as increased engagement, brand awareness, audience growth, or business impact.\nGet recognized as one of the top companies in your region, whether you’re leading in the Mid-Atlantic, Midwest, Northeast, Pacific, Rocky Mountain, Southeast, or Southwest.\nWhether you’re a scrappy startup or a powerhouse enterprise, get recognized for achieving excellence at your scale: Small and Mighty (0-49 employees), Medium (50-99 employees), Large (100-499 employees), Extra Large (500+ employees).\nWhether you’re building momentum or leading your market, get recognized for what you’ve accomplished at your revenue level: Lean and Mean (under $5 million in gross revenue), Prosperous and Thriving ($5 million to $50 million in gross revenue), Robust and Powerful ($50 million and up in gross revenue).\nFrom rising stars to legacy leaders, showcase how your company is making its mark at every stage of growth: On the Rise (0-4 years in business), Established Excellence Companies (5-14 years in business), Legacy Companies (15+ years in business).\nHonoring outstanding leaders who have successfully guided a key project or initiative, delivering significant results for their organization through strategic vision, effective execution, and impactful leadership.\nThe early-rate deadline is Friday, July 18, at 11:59 p.m. PT.\nThe preferred-rate deadline is Friday, August 15, at 11:59 p.m. PT.\nThe final deadline to apply is Friday, September 12, at 11:59 p.m. PT.\nAll applicants will be notified via email if they were chosen for the list.\nWe’ll send you a complimentary honoree toolkit to help you promote this incredible honor.\nAll Inc. Best in Business honorees will appear in the Winter issue of Inc. magazine and on Inc.com\nFinal Deadline: September 12\nThe Inc. Best in Business awards are open to all companies—public, private, nonprofit, U.S.-based, and international. Applicants must apply to the Main List to showcase standout work across industries, and may apply to optional additional categories for more visibility.\nInc. editors will review all entries. Honorees will be announced on Inc.com in December 2025 and in the Winter 2025/2026 issue of Inc. magazine. Applicants will be notified by mid-November 2025 whether they have made the list.\nSee your win immortalized in pages of the Winter issue of Inc. magazine, get a dedicated company profile on Inc.com, and receive national and local media coverage.\n2024 List"
    },
    {
      "url": "https://hbr.org/2021/01/can-introverts-thrive-in-extroverted-careers",
      "text": "Take a look at the following statements. I’d rather email my comments to my boss than say them aloud. Being in a crowd exhausts me. I prefer curling up on the couch to unwind. I gain energy from quiet reflection as opposed to brainstorming with my team. It’s not that I don’t like being around people. I just enjoy working in solitude more. If you’re an introvert, you can probably relate to some or all of these statements, and less to job posts looking for “dynamic, outgoing candidates with exceptional communication skills.” When applying for roles, you might even feel like the business world was not built for you, and in some industries, this may be true. One study found that more extroverted people — those who were more confident, sociable or assertive — had a 25% higher chance of being in a high-earning job. Fields like consulting and investment banking, for example, are fields in which extroverts may thrive. That said, many introverts work, and rise, in all kinds of environments. Like extroverts, introverts have a natural ability to build meaningful connections and communicate gracefully. As a professor and professional coach, I have been studying personality and leadership for over six years. I’ve learned that the central difference between introverts and extroverts is not how well they communicate, but how they respond to stimuli. Extrovert brains are energized by stimulation and seek it out in social situations. Introverts, on the other hand, may equally enjoy being social, but prefer taking breaks to recharge. When it comes to actually communicating and building relationships, however, introverts may have the advantage. Contrary to popular belief, you don’t need a big, loud presence to impress powerful people. A recent study that assessed the performance of more than 900 CEOs found that people with introverted personalities exceeded the expectations of their investors more often than extroverted ones. Further studies show that while highly extroverted people are 25% more likely to land top jobs, introverts often make better leaders. To better understand how introverts have learned to thrive in careers that seem more suited for their opposites, my coauthor and I interviewed 15 recent university graduates and a handful of seasoned industry veterans — all self-identified introverts — who work at some of the most prominent consulting firms and investment banks in North America. Through their stories, we identified a few behavioral patterns that have helped lead to their success. Introverts entering the workforce can use our learnings to your advantage. Knowing what you’re naturally good at, as well as what you’re capable of, and how to leverage those skills, is the first step towards growing in any industry. Introverts are great listeners. Brooke Callaghan, a first-year investment banking analyst at BMO Toronto, told us that, in her experience, introverts bring unique perspectives to the table. As avid listeners, they can capture information that some extroverts might overlook. Unlike extroverts, introverts aren’t known to jump to conclusions, and as a result, they garner more attention and appreciation from an audience when they do speak. Pro tip: If you’re in a meeting know that it’s okay if you’re not the first one to speak. Listen keenly, focus on what the presenter is saying, and take in all the information. Then, process it, integrate it, and make a valuable contribution. The point is not to make a point, but to contribute something that is useful and insightful — a skill many introverts will find easy to master. That said, if you are nervous that you may be asked to speak up before you are ready, study the meeting agenda beforehand and write down your ideas in advance. Documenting your thoughts in this way will help you remember them later on and ease some of the anxiety you may be feeling. Remember that an idea that’s 90% baked is better than one that is never spoken at all. Introverts build deep relationships. Brooke also told us that, as an introvert, her natural tendency to read a room, empathize with others, and think before she speaks helps her gain a deep understanding of the people or situation she is engaging with. As a result, it’s easier for her than most to foster meaningful relationships with her clients and peers. Jeffrey Hayzlett, host of the primetime television show Executive Perspectives, added that introverts tend to rely on their gut feeling rather than seek out external affirmation. They are often autonomous, an attribute that helps them gain the respect of their seniors. Pro tip: If meeting new people makes you feel uncomfortable, start with setting small goals for yourself. Don’t hide in the corner during a networking event or turn off your video during a virtual happy hour. Make an effort to introduce yourself. The first few times may require an extra push, but slowly you’ll gain more courage and feel more comfortable striking up conversations. Use your natural tendency to empathize with others to guide you and help you gain an understanding of your audience. If you don’t want to speak up during events, you can also take time after to write an email to someone you’d like to form a relationship with. Tell them what you thought of a point they made during a meeting or share a report or an article that you think they could benefit from. Introverts are adaptable. Throughout our interviews, we observed that many of the introverts with careers in extroverted industries were able to adapt to their work environments over time. Unlike listening and empathy, this skill wasn’t something that came naturally to them. It was something they had to work towards. Our interviewees were driven by one of two things: a desire to become more extroverted or a desire for success that outweighed their natural personality traits. Both motivations resonated with Daniel Sun, an associate at the Boston Consulting Group’s Toronto office. “Humans are social creatures, and introverts desire social interaction, albeit to a lesser degree than extroverts. Since effective communication is fundamental to success in consulting, us introverts are up for the challenge, and over time, with practice, it becomes second nature,” he said. Daniel is not alone in his sentiments. Brooke, a self-described “not shy but reserved” introvert who enjoys the company of others, decided to go into banking because she was attracted by the dynamic environment. She knew taking on a people-centric role would push her outside of her comfort zone and help her develop the confidence to “speak up” more often. And she was right. To be successful in an industry that favors extroverts, like banking, people who are more introverted need to use both the analytical strengths that come second nature to them and develop the social skills that may not. Robert Chen, a Bachelor of Commerce grad with two years under his belt as an investment banking analyst explained, “Usually, your first five to seven years at the bank as a junior analyst or associate draw heavily on your analytical skills. However, you are generally expected to develop more client-facing communication skills as you progress. This is most distinct as you go from the associate to VP level, where the client-facing and relationship-building aspects of your work really rely on strong communication.” Through our research, we found that the willingness and effort to adapt was a key skill of the most successful introverts. In fact, we found that by the time many introverts reach the C-Suite level, they are more likely to perceive themselves as having a mix of introverted and extroverted tendencies. Pro tip: Take a note from Brooke, who, not only sought the advice from leaders in her industry, but also invested in improving her skills on her own time, outside of work. Brooke studied how introverts can use their strengths to thrive in extroverted fields. Two of the works she found particularly helpful are Professor Francesca Gino’s article, “Introverts, Extroverts, and the Complexities of Team Dynamics,” and author Susan Cain’s Quiet. “All of these leaders will tell you they’ve had to make adjustments,” Cain told the Washington Post in an interview, referring to introverts like Google founder Larry Page and Yahoo CEO Marissa Meyer, among others. “Many have told me that they’ve had to grow more comfortable with public speaking, that’s a very common one. All of it is pushing yourself a bit outside of your comfort zone.” If personality is measured along an introvert-extrovert spectrum, it is evident that the kind of introverts who enter extroverted workplaces are not extreme in their tendencies. They inherently trust in their own ability to assimilate, and at the very least, are up for the challenge. The big takeaway? Before you give up on that sales role because “cold calls seem daunting,” or decide a job in investment banking, marketing, public relations, or any other “extroverted” field is not for you, think about your strengths and how they will add value to that position. As an introvert, you may take more time to voice your ideas, and be less outspoken than your extroverted colleagues. But your success is driven by your ability to be flexible, listen, understand, and make deep connections with the people who surround you. Don’t take those skills for granted. Use them to guide you and rise to the top of any field."
    }
  ],
  "argos_summary": "The article discusses how quiet professionals, especially introverts, often struggle to be recognized in fast-paced, visibility-driven workplaces. It highlights a case of a senior scientist whose valuable contributions were overlooked because she remained silent in meetings, leading to missed leadership opportunities. Drawing on Harvard Business Review research, the piece explains that introverts are frequently underestimated, not due to lack of skill but because they don’t actively assert themselves. It offers five practical strategies—preparing focused points, avoiding qualifiers, cutting preambles, speaking directly to value, and following up with written summaries—to help introverts speak up confidently without being loud. The goal is to make their insights visible and ensure they are remembered as strong leaders.",
  "argos_id": "UUS8RQHPX"
}