{
  "url": "https://www.gamesradar.com/hardware/the-hideous-metal-gear-solid-delta-snake-eater-statue-is-why-i-have-rules-for-collectors-editions/",
  "authorsByline": "Rosalie Newcombe",
  "articleId": "49afb123b59348b9ba9edc6a921701a7",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/gumhyjBKDcty86syfs4taQ.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T12:30:12+00:00",
  "addDate": "2025-09-03T12:36:30.401997+00:00",
  "refreshDate": "2025-09-03T12:36:30.401998+00:00",
  "score": 1.0,
  "title": "The hideous Metal Gear Solid Delta Snake Eater statue is why I have rules for collectors' editions",
  "description": "Not all Collector Editions are made equal",
  "content": "The Metal Gear Solid Delta Snake Eater statue has reminded me why I have one steadfast rule when it comes to collector's editions of games - if a company that's known for their statues and figures isn't involved, I ain't buying.\n\nUnless the statues and figures of my favorite PS5 game characters are from existing catalogues I'm already well-acquainted with, like Good Smile Company, I avoid them at all costs, and my bank account has never been happier.\n\nI'm not advocating that you do the exact same, as there are a few exceptions. However, the next time you splash out over $200 on a collector's edition, I plead that you do a little research first on who is making the statues, so you don't end up with a Temu version of Naked Snake on your shelf.\n\nThe horrendous paint job on Naked Snake, which was brought to my attention by the words of Scott McCrae, really does look pretty \"jank.\" In all honesty, it looks like something I'd produce if anyone were to trust me with Warhammer and some paint pots, not the quality found on a $200 Metal Gear Solid Delta Snake Eater statue.\n\nThese low-quality statues are sadly not new to collectors' editions by any means. Earlier this year, my partner unloaded £169.99 on the Dragon Ball Sparking Zero Collector's Edition and was excited to see the statue of Broly battling it out with Ultra Instinct Goku in person.\n\nHowever, instead of a well-sculpted interpretation of his favorite characters, one that figure brands like Banpresto have been getting spot-on for years, he was instead greeted with one that looked similar to the bootleg figures cluttering up the search results of eBay. I have display cases full of Dragon Ball figures, but it's been relegated to a box somewhere in my house, likely never to be seen again.\n\nI've been a bit luckier. In recent years, one of my best gaming purchases was the AI Somnium Files nirvanA Initiative Collector's Edition for the Nintendo Switch, which features an exclusive 170mm PVC figure of Aiba, my favorite character from the series. It was advertised as a Good Smile Company Pop-up Parade figure, a line I knew all too well, so I wasn't disappointed.\n\nThe depiction of Aiba was adorable, and she looked exactly how she appears in the game. The base was a little lackluster, as it's just an all black hexagon, but that's pretty standard for Pop-up Parade figures of its size. More importantly, no paint was out of line, and as you can see from the images, her face is absent of any Naked Snake statue jank.\n\nRight now, the AI Somnium Files nirvanA Initiative Collector's Edition is marked up at $182.82 at Amazon however, it actually launched for $119.99, which feels entirely justifiable. Typically, Good Smile figures of its size retail for around $49.99 at launch, and when you take into consideration the $59.99 MSRP of the Switch game, that already adds up to the $100 mark. Grabbing the collector's edition was also the only way to purchase the Aiba statue to date, which made it all the more of a must-have for my collection.\n\nGood Smile Company has been producing figures and merchandise since May 2001, with the first Parade figure released back in 2019. In those 6 years, I've accumulated my fair share of Pop-Up Parades, from the standard size (which you can expect with collector edition games) up to the XL size - all of them have been just as high-quality as the last.\n\nThe sculpt and paint job quality are always on point. To this day, I still go out of my way to pre-order Pop-up Parade figures, despite becoming less of a fan of Good Smile's Nendoroid and other lines over the years. I only hope more studios opt for Good Smile quality figures with their collector's editions in the future.\n\nGood Smile isn't the only brand ensuring collector's edition statues and figures are high in quality. Banpresto is also a name you can rely on, which in the past has produced chibi figures for the Tales of Zestiria Collector's Edition back during the PS4 era. Both brands are more known for their anime-inspired products, but can be a reassurance of quality nonetheless.\n\nOf course, my golden rule of avoiding statues unless made by proper figure brands has its exceptions. The Death Stranding 2: On the Beach Collector's Edition launched on June 26, 2025 with a 15-inch statue of the Magellan Man, a creepy tar monster originally shown off in the game's early trailers - and it turned out to be pretty detailed.\n\nThis is thanks to artist Yoji Shinkawa, known for his work, coincidentally, on the Metal Gear Solid series. Game director Kojima stated on X (Twitter) at the time that Shinkawa went as far as to visit the factory where these statues were being produced to keep a watchful eye over the mass production. The end result was a stunning statue that looks like a piece of art in its own right.\n\nI didn't grab for myself as I've yet to finish the first game, but Reddit user ofeliedeceai showed off its \"extremely high quality.\" Judging from the photos alone, I can't argue against that.\n\nIf you're incredibly excited by an upcoming game and want to take the risk of a collector's edition statue, by all means, go for it. In the end, if even Snake's janky face makes you happy, then that's all that matters.\n\nI've been collecting statues and figures since 2001, and you can bet I own some questionable ones with faces only an obsessed nerd like myself can love. However, I can't emphasize enough the importance of doing as much research as you can to ensure you've got your money's worth.\n\nRemember, you can always wait a few months and grab these game statues when they inevitably end up on eBay. Or better yet, follow my advice and just pre-order ones that have statues produced by well-known figure and merchandising brands. Your bank account and game merchandise shelf will thank you later.\n• Slay the Princess - The Pristine Cut: Collector's Edition: $199.99 at Amazon\n\nLove collecting gaming toys and merch? Check out the best Lego sets, which include sets based on everything from Super Mario to Animal Crossing.",
  "medium": "Article",
  "links": [
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Famazon.com%2FTony-HawksTM-Pro-SkaterTM-Collectors-PlayStation%2Fdp%2FB0DYVRQ5Z2%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dgrd-us-8260973784856979696-20",
    "https://www.anrdoezrs.net/click-8150600-13527013?sid=grd-us-1237284689350467539&url=https://electronics.woot.com/offers/like-a-dragon-pirate-yakuza-in-hawaii-collectors-edition-1?ref=w_cnt_lnd_cat_elec_15_3",
    "https://www.gamesradar.com/deals/compare/?model_name=Sony%20PlayStation%205%20Slim&article_id=FoeevzLpvWiA2wQqvpYBz5",
    "https://www.gamesradar.com/games/metal-gear/metal-gear-solid-delta-snake-eaters-usd200-collectors-edition-comes-with-awful-imitation-moss-and-the-jankiest-looking-snake-figure-ive-ever-seen/",
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0DGY63Z2H%3Ftag%3Dhawk-future-20%26linkCode%3Dogi%26th%3D1%26psc%3D1%26ascsubtag%3Dgrd-us-6363129071771801148-20",
    "https://www.gamesradar.com/hardware/accessories/these-top-5-dragon-ball-gaming-accessories-have-me-questioning-if-my-setup-needs-to-have-a-makeover-of-super-saiyan-proportions/",
    "https://www.reddit.com/r/DeathStranding/comments/1lk3d57/collectors_edition_has_arrived_statue_is/",
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Famazon.com%2FAI-SOMNIUM-nirvanA-Initiative-Collectors-Nintendo%2Fdp%2FB0983Y7VV1%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dgrd-us-1046430197230020938-20",
    "https://x.com/HIDEO_KOJIMA_EN/status/1899765161537442270",
    "https://www.gamesradar.com/best-lego-sets-and-kits/",
    "https://www.gamesradar.com/author/scott-mccrae/",
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Famazon.com%2FSlay-Princess-Pristine-Collectors-Nintendo-Switch%2Fdp%2FB0D6Z8Z5FJ%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dgrd-us-1338903971469845085-20",
    "https://www.gamesradar.com/deals/compare/?model_name=Sony%20PlayStation%205%20Pro&article_id=FoeevzLpvWiA2wQqvpYBz5",
    "https://www.gamesradar.com/hardware/the-fact-that-you-can-still-buy-19-inches-of-venom-with-the-spider-man-2-collectors-edition-has-my-spidey-sense-tingling/",
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Famazon.com%2FStreet-Fighter-6-Collectors-PlayStation-5%2Fdp%2FB0BYQQ227P%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dgrd-us-2806104686968540500-20",
    "https://target.georiot.com/Proxy.ashx?tsid=8426&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dps5%2Bcollectors%2Bedition%26crid%3D3RT42VPIRV2SA%26sprefix%3Dps5%2Bcollectors%2Bedition%252Caps%252C181%26ref%3Dnb_sb_noss_2%26tag%3Dhawk-future-20%26ascsubtag%3Dgrd-us-3297443229981505192-20",
    "https://www.gamesradar.com/gaming/death-stranding-2-collectors-edition-is-a-sight-to-behold-and-heres-where-to-pre-order-yours/",
    "https://www.gamesradar.com/best-ps5-games/",
    "https://www.anrdoezrs.net/click-8150600-13502820?url=https%3A%2F%2Fwww.dell.com%2Fen-us%2Fshop%2Fsony-playstation-5-disc-edition-slim-console%2Fapd%2Fac906119%2Fgaming-gaming-accessories%3Ftfcid%3D33163968&cjsku=PS5SMGSSAP&sid=grd-us-5548608000400081394"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Good Smile quality figures",
      "weight": 0.09668309
    },
    {
      "name": "Good Smile figures",
      "weight": 0.09496839
    },
    {
      "name": "collector edition games",
      "weight": 0.09333959
    },
    {
      "name": "statues",
      "weight": 0.08567442
    },
    {
      "name": "Dragon Ball figures",
      "weight": 0.08331087
    },
    {
      "name": "proper figure brands",
      "weight": 0.08324955
    },
    {
      "name": "figures",
      "weight": 0.08311671
    },
    {
      "name": "chibi figures",
      "weight": 0.081825815
    },
    {
      "name": "game merchandise shelf",
      "weight": 0.07032531
    },
    {
      "name": "games",
      "weight": 0.07024129
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.88037109375
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.435302734375
    }
  ],
  "sentiment": {
    "positive": 0.18186808,
    "negative": 0.41895112,
    "neutral": 0.3991808
  },
  "summary": "The article discusses a rule that I prefer statues and figures of my favorite PS5 game characters from companies like Good Smile Company, which are known for their high-quality designs. This rule includes avoiding collector's editions unless they are from existing catalogues. The article highlights the issue of a Metal Gear Solid Delta Snake Eater statue, which was brought to attention by Scott McCrae. One of the few exceptions was the Dragon Ball Sparking Zero Collector's Edition for £169.99. However, the article also notes that companies like Banpresto have been consistently producing high quality figures for collectors' editions for years. Good Smile has been producing figures and merchandise since May 2001, with the first Parade figure released in 2019.",
  "shortSummary": "The MSPs' latest collector's edition of Metal Gear Solid Delta Snake Eater features poorly-quality statues and figures, highlighting the need to ensure high-quality brands like Good Smile Company are present.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e3084df65aec4f6d8ad566672ff1d07f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/games/metal-gear/metal-gear-solid-delta-snake-eaters-usd200-collectors-edition-comes-with-awful-imitation-moss-and-the-jankiest-looking-snake-figure-ive-ever-seen/",
      "text": "Metal Gear Solid Delta: Snake Eater's $200 collector's edition comes with \"awful imitation moss\" and the jankiest looking Snake figure I've ever seen\nYou're... not pretty good\nFans are discovering the collectors edition of Metal Gear Solid Delta: Snake Eater comes with a slightly janky looking Snake.\nCollectors editions are a way for fans who are excited about the game to get their hands on some cool extras. And because these fans are so loyal, collectors editions are definitely always great quality, you definitely don't get cheap plastic eggs when Marvel Vs Capcom Infinite's promised Infinity Stones or a generic red beanie with a denim coat for the game box like with Infamous Second Son. And you definitely wouldn't get a cheap nylon bag from Fallout 76 when a fancy canvas one was advertised.\nAnd when you spend $200 on Metal Gear Solid Delta: Snake Eater you're going to get a nice terrarium with a diorama of Naked Snake after losing his bag at the beginning of the game. Except yeah you see where I'm going with this it's not great.\nThat $200 is feeling way worse from r/metalgearsolid\nAs posted by a user on Reddit who says \"this just feels like a smack in the face,\" the Metal Gear Solid Delta collectors edition was advertised with plastic plants that would stick up, and in reality, it comes with what the user describes as \"awful imitation moss stuff that looks worse in person and does anything but stay upright.\"\nAnd not content with the weird-looking Baldur's Gate 3 minis that released a few months back, taking all the spotlight, you're treated to a miniature figure of Naked Snake with crossed eyes and a really cheap-looking paint job. I'm sure it's nice from a distance, but yeah, this ain't it, especially for $200.\nThis terrarium collectors edition only seems to have been released in the US too, with Japan and the UK getting the Collectors Pack, which includes a vinyl soundtrack and a super detailed looking bust of Naked Snake with a snake coiled round him, which is more expensive, but way better.\nWeekly digests, tales from the communities you love, and more\nScott has been freelancing for over three years across a number of different gaming publications, first appearing on GamesRadar+ in 2024. He has also written for the likes of PC Gamer, Eurogamer, VG247, Play, TechRadar, and others. He's typically rambling about Metal Gear Solid, God Hand, or any other PS2-era titles that rarely (if ever) get sequels.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.anrdoezrs.net/click-8150600-13502820?url=https%3A%2F%2Fwww.dell.com%2Fen-us%2Fshop%2Fsony-playstation-5-disc-edition-slim-console%2Fapd%2Fac906119%2Fgaming-gaming-accessories%3Ftfcid%3D33163968&cjsku=PS5SMGSSAP&sid=grd-us-5548608000400081394",
      "text": "Marketing Information\nThe PS5® console* unleashes new gaming possibilities that you never anticipated.\nExperience lightning fast loading with an ultra-high speed SSD, deeper immersion with support for haptic feedback, adaptive triggers, and 3D Audio**, and an all-new generation of incredible PlayStation® games.\nSlim Design\nWith PS5®, players get powerful gaming technology packed inside a sleek and compact console design.\n1TB of Storage\nKeep your favorite games ready and waiting for you to jump in and play with 1TB of SSD storage built in.***\nUltra-High Speed SSD\nMaximize your play sessions with near instant load times for installed PS5® games.\nIntegrated I/O\nThe custom integration of the PS5® console's systems lets creators pull data from the SSD so quickly that they can design games in ways never before possible.\nRay Tracing\nImmerse yourself in worlds with a new level of realism as rays of light are individually simulated, creating true-to-life shadows and reflections in supported PS5® games.\n4K-TV Gaming\nPlay your favorite PS5® games on your stunning 4K TV.\nUp to 120fps with 120Hz output\nEnjoy smooth and fluid high frame rate gameplay at up to 120fps for compatible games, with support for 120Hz output on 4K displays.\nHDR Technology\nWith an HDR TV, supported PS5® games display an unbelievably vibrant and lifelike range of colors.\nTempest 3D AudioTech\nImmerse yourself in soundscapes where it feels as if the sound comes from every direction. Your surroundings truly come alive with Tempest 3D AudioTech** in supported games.\nHaptic Feedback\nExperience haptic feedback via the DualSense® wireless controller in select PS5® titles and feel the effects and impact of your in-game actions through dynamic sensory feedback.\nAdaptive Triggers\nGet to grips with immersive adaptive triggers, featuring dynamic resistance levels which simulate the physical impact of in-game activities in select PS5® games.\nIncludes ASTRO'S Playroom\nExplore four worlds, each one showcasing innovative gameplay using the versatile features of the DualSense® wireless controller, in this game included for all PS5® console users.\nBackwards Compatibility & Game Boost\nThe PS5® console can play over 4,000 PS4® games. With the Game Boost feature, you can even enjoy faster and smoother frame rates in some of the PS4® console's greatest games."
    },
    {
      "url": "https://www.gamesradar.com/hardware/accessories/these-top-5-dragon-ball-gaming-accessories-have-me-questioning-if-my-setup-needs-to-have-a-makeover-of-super-saiyan-proportions/",
      "text": "These top 5 Dragon Ball gaming accessories have me questioning if my setup needs to have a makeover of Super Saiyan proportions\nSorry dragon balls, I'm on the hunt for some gaming tech instead\nEver since I discovered the existence of the Dragon Ball Z Scouter by Casetify and realized it was not a headset, but an accessory for Apple's AirPods Max headphones, I've been on a journey to find the best Dragon Ball gaming tech.\nIt's been over 40 years since the original manga debuted in 1984, but even in that time, I've only seen a sprinkling of accessories, from headsets, controllers, to keyboards, all ready to hook up alongside the best gaming PCS and create the ultimate anime-inspired setup, which has left me with a Yamcha-sized hole in my heart.\nAs the resident anime nerd of the hardware team, I've taken it upon myself to try and find the best officially licensed Dragon Ball accessories still available to pick up today to fill that void, and fill my house with even more Akira Toriyama goodies, and you can find my favorite tech discoveries down below.\nFRTEC Dragon Ball Z Thumb Grips\nFRTEC Dragon Ball Z Thumb Grips | $20.95 at Amazon\nThese officially licensed thumb grips from FRTEC can give your sticks a 4-star makeover. As a slightly older product, they're designed specifically in mind for the older PS4, however, any controller with similarly sized sticks should be ideal for these adorable super-resistant non-slip thumb grips.\nUK: £11.06 at Amazon UK (King Kai version)\nThe moment I discovered that these adorable 4-star Dragon Ball Z Thumb Grips existed, I went out on an eBay hunt and bought my own pair. Sadly, they haven't arrived in the post yet, so I can't give you a lowdown on exactly how they feel to use while playing the likes of Dragon Ball Sparking Zero on the PS5, or if they 100% even fit the DualSense sticks, as these are originally designed with the PS4 in mind.\nHowever, that hasn't stopped me from wanting to bring them to any Dragon Ball fans' attention. I mean, who wouldn't want to turn their boring old black Sony controller sticks into replicas of the 4-star Dragon Ball?\nWhile I don't have experience with the sticks quite yet, I do have a frame of reference, as I have grips attached to pretty much every controller in my possession, Sony or otherwise. These 4-star designs remind me of my Spider-Man grips, which don't add a huge amount of extra elevation, but their silicon texture makes it easier to grip the sticks, which is especially handy in online games.\nSubsonic Dragon Ball Z XXL Mousepad\nSubsonic Dragon Ball Z XXL Mousepad | $50.00 $47.30 at Amazon\nThis officially licensed Dragon Ball Z Mousepad has a design that isn't subtle, but the imagery of Shenron and the seven dragon balls is so cool and dramatic that I can't help but be a fan. This extra-large mousepad is 90mm x 40mm, and ideal if you want to make your PC setup scream \"rock the dragon.\"\nUK: £19.99 at Amazon UK\nDragon Ball mousepads are by far the easiest gaming accessory to find out in the wild.\nWeekly digests, tales from the communities you love, and more\nThe designs available from brands like Grupo Erik and ABYSTYLE range from everything from subtle silhouettes of Goku and friends on an RGB lit pad, like on the PC Dragon Ball Super MousePad available for £24.99 from Amazon UK by FRTEC, or just key-art from art from series like Dragon Ball Super. However, I'm more partial to this Shenrom design by Subsonic.\nThis officially licensed mousepad is 90mm x 40mm and features Shenron looking as fierce as ever, with the seven dragon balls all splayed out behind him. It's not the most subtle of designs, but I like it more that way. It reminds me of the classic Ocean dub anime opening that starts with that iconic shot of Shenron before the \"Rock the Dragon\" chants chime in, and that kind of nostalgia would be perfect sitting on my desk.\nDragon Ball Kame Nintendo Switch Controller\nDragon Ball \"Kame\" Nintendo Switch Controller | Check stock at Amazon\nThis wireless controller features a stunning orange form factor that matches perfectly with the Dragon Ball aesthetic. The controller is compatible via Bluetooth with the Nintendo Switch, PC, iOS, Android, and the Steam Deck, and is equipped with RGB lighting that glows through its translucent plastic shell. I can't imagine playing the upcoming port of Sparking Zero on the Switch with anything else.\nUK: £39.99 at Amazon\nThis is undoubtedly my favorite piece of official Dragon Ball gaming tech I've found so far, if not one of the best Switch controllers I've ever laid my eyes on.\nJust like the official thumb grips, the wireless controller is another product from FRTEC, who seem to be behind most of the Dragon Ball accessories available on the market today. However, out of every product I've found underneath the FRTEC name, this is the one I want the most.\nIts translucent orange design feels like a nostalgic call-back to the early 00s where I spent my weekends playing on my friend's translucent orange N64, after watching episodes of Dragon Ball Z on Toonami, of course. Outside of the nostalgia, I adore the printed art of Master Roshi and young Goku and Krillin, especially as it's more unusual to find a homage to the original Dragon Ball series - especially where tech is concerned.\nUnfortunately for those of you across the pond, I can only find this from UK retailers, despite FRTEC and its many Dragon Ball products, which are otherwise fairly easy to find on the likes of US Amazon. If you're itching to give your controller a Dragon Ball makeover, you can otherwise grab the Dragon Ball Z Hard Case + Grips + Sticker PS5 combo pack for £25.64 at Amazon, which lets you show off your fandom via your DualSense controller.\nIt's not as cool as a translucent controller, but it's better than nothing.\nFRTEC Dragon Ball Super 24 Storage Case for Nintendo Switch\nFRTEC Dragon Ball Super 24 Storage Case | $24.89 $19.29 at Amazon\nThis officially licensed case can store up to 25 Nintendo Switch (or Switch 2) game carts and two microSD cards and comes decked out with a translucent orange form factor and the kanji characters for 'Go' that Goku wears on his Gi that Goku wears throughout some of the Z anime series and some of Dragon Ball Super movies.\nUK: £16.99 at Amazon\nI tried my hardest not to just pick out FRTEC products, but they really do have the market covered where Dragon Ball accessories are concerned. This Nintendo Switch Game Storage Case is simple but effective, and matches well with the FRTEC controller thanks to its translucent plastic form factor.\nYou can store up to 24 game carts for your gaming handheld in this case (along with two microSD cards), but what I like most about it is the fact that it's compatible with Switch 2 games too. This is a slightly older product, so I don't think it was on purpose, but out of pure luck for Dragon Ball fans, as Switch 2 carts are the same size as the older carts.\nWith Dragon Ball Sparking Zero making its way to the Nintendo Switch 2 on November 14th, this little compact case would be the ideal way to store it, and any older Dragon Ball Switch games you might have in your collection.\nTEKNOFUN Official Dragon Ball Z Gaming Headphones\nOfficial Dragon Ball Z Gaming Headphones | $28.49 at Amazon\nThe wired gaming headset features a black and yellow colorway, with imagery of the 4-star dragon ball on either cup. The headset comes equipped with 50 mm-sized audio drivers, a microphone, and due to its 3.5mm headphone jack connectivity, it can be used with a wide range of gaming platforms, including gaming PCs, the Switch 2, and the PS5.\nUntil brands like Razer (known for their big, anime tech collabs) ever get a hold of the licence to make Dragon Ball gadgets, I doubt we'll see a high-end gaming headset designed with adults in mind. However, this official headset by brand Teknofun is at least better than nothing.\nIts design is a bit more understated than other bits of Dragon Ball tech out there, featuring a black and yellow colorway with the 4-star dragon ball featured on either earcup. As a wired headset aimed towards a young audience (judging by the promotional images), you're likely not going to get the same impressive audio quality as per the SteelSeries Arctis Nova Pro Wireless, but for a $28.49, that's to be expected.\nAt least the wired 3.5mm headphone jack means it'll be compatible with a change of platforms, from the PC, PS5, Nintendo Switch, Switch 2, and even the Steam Deck. Just make sure you're okay being at the mercy of wires before you pick this up.\nThe specs state that the headset comes equipped with 50mm audio drivers, too, so that extra room for the sound to bounce should at least make it sound good enough to make the Switch version of Dragon Ball Kakarot Diama Edition sound pretty decent.\n- View all Dragon Ball gaming deals at Amazon\n- Dragon Ball Sparking Zero - PS5:\n$58.40$53.99 at Amazon - Dragon Ball Kakarot - PS5: $19.99 at Amazon\nIf you're not a Dragon Ball fan, our guides to the best PS5 headsets, best Xbox Series X headsets, and the best PC headsets for gaming are bursting at the seams with high-quality pairs of cups for your gaming platform of choice.\nEver since I first held a NES controller in my hand I've been obsessed with gaming, and the hardware it runs on. I could hook up a NES and SNES to a telly, without instructions, before I could walk. Even now, nothing is more exciting then taking a console, or handheld, out the box for the first time and setting it up. This obsession transformed into a love of games and game music, which lead to my music degree and dream of becoming the Scottish Nobuo Uematsu. After sharing my love of games through music, I began to share my love through words on sites like TechRadar and iMore. This lead to becoming a Hardware staff writer for PCGamesN, and later the Senior Tech Writer for Dexerto, covering all things Steam Deck, PlayStation and Nintendo. With that experience, I was able to level up as Hardware Editor for GamesRadar+, where I'm still just as Nintendo, PlayStation and gaming tech obsessed as ever.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/author/scott-mccrae/",
      "text": "Scott McCrae\nScott has been freelancing for over three years across a number of different gaming publications, first appearing on GamesRadar+ in 2024. He has also written for the likes of PC Gamer, Eurogamer, VG247, Play, TechRadar, and others. He's typically rambling about Metal Gear Solid, God Hand, or any other PS2-era titles that rarely (if ever) get sequels.\nLatest articles by Scott McCrae\nFinal Fantasy Tactics: The Ivalice Chronicles director open to revisiting the series' Game Boy Advance sequels if the remaster does well, but thinks the strategy RPG playerbase is currently a \"bit small\"\nBy Scott McCrae published\nNews Kazutoyo Maehiro is also open to totally new tactics games\nAs Metal Gear Solid turns 27 years old, Hideo Kojima says \"there are only a handful of people who participated\" on the seminal classic who are \"still a part of the new 'Kojima Productions'\"\nBy Scott McCrae published\nNews While the current Metal Gear series producer had a \"Special Thanks\" credit in the game\nIt took 3 years but Xbox has finally delivered on its Silksong promise: Team Cherry's latest hits Game Pass day one, exactly one day after an amazing Metroidvania you shouldn't miss\nBy Scott McCrae published\nNews Who cares, though? Paw Patrol World is coming six days later\nHideo Kojima's overlooked cyberpunk adventure game is one of the three games Atari's CEO would love to remaster: \"I don’t know if it would do well, but I’d probably push it through\"\nBy Scott McCrae published\nNews Konami, please.\nFormer Assassin's Creed director who also worked on Arkham Origins joins Rocksteady, sparking more hopes for a new Batman game\nBy Scott McCrae published\nNews Why doesn't Batman just call the Justice League for help? Is he stupid?\nHollow Knight: Silksong will have a free Nintendo Switch 2 edition upgrade at launch, meaning you don't have to pay extra to get the 120hz mode\nBy Scott McCrae published\nNews SKONG be praised\nBattlefield 6 won't have ray tracing at launch and devs \"don't have any plans in the near future for it either\" because \"our effort was focused on making the game as [optimized] as possible\"\nBy Scott McCrae published\nNews Raymond Tracing was deemed not fit to serve\n10 years later, Metal Gear Solid 5 remains a masterpiece that was never going to live up to its own hype\nBy Scott McCrae published\nOpinion Opinion | Kept me waiting, but it was pretty good\nBorderlands 4 can't even win in its own ads, as WWE has cosplaying wrestlers take the L in their own championship match\nBy Scott McCrae published\nNews It was to harness a brutal side of themselves, as \"Borderlands is an incredibly violent game,\" definitely not next-level product placement\nHideo Kojima will give a \"glimpse into future projects\" at his \"Beyond The Strand\" anniversary event for Kojima Productions' 10th birthday this month\nBy Scott McCrae published\nNews Announced on Metal Gear Solid 5's 10th birthday, no less\nAfter Final Fantasy Tactics' source code was lost, the remaster's devs looked at fan-made websites' preservation efforts: \"We know you guys do such a good job of keeping all of that up to date\"\nBy Scott McCrae published\nNews The code was lost when \"we wanted to do another language, we would keep just stacking on top and overwriting and overwriting.\"\nResident Evil Requiem's director was always curious to return to Raccoon City: \"It was like rice I'd left forgotten in the rice cooker for a week... eventually curiosity makes you lift the lid\"\nBy Scott McCrae published\nNews He also says the game is as much about Raccoon City as it is about Grace\nAfter announcing Escape From Tarkov is finally leaving early access, the extraction shooter dev has confirmed a \"page on Steam will be available soon\"\nBy Scott McCrae published\nNews But fans want to know what will transfer over, if anything\nHideo Kojima used \"an AI machine learning rig\" to painstakingly download his celebrity friends to Death Stranding 2, but he wasn't happy with it: \"I think I want to make it more realistic\"\nBy Scott McCrae published\nNews \"I think it’s okay\"\nTo celebrate Final Fantasy 9's 25th anniversary, Nier producer remembers how he thought \"they should have made the loading faster\"\nBy Scott McCrae published\nNews Yosuke Saito was working on rival RPG Dragon Quest 7, which would release just over a month later\nIndiana Jones and the Great Circle director says gameplay has been one of the most \"challenging aspects\" of development because even Wolfenstein was \"very linear\"\nBy Scott McCrae published\nNews \"The DLC kind of still reflects that\"\nNew Final Fantasy-style action RPG Lost Soul Aside is \"unintentionally one of the funniest games of the year,\" players declare, which takes the sting of its Mixed Steam reviews away somewhat\nBy Scott McCrae published\nNews Lost soul aside, he's a pretty good guy\nMetal Gear Solid Delta: Snake Eater's $200 collector's edition comes with \"awful imitation moss\" and the jankiest looking Snake figure I've ever seen\nBy Scott McCrae published\nNews You're... not pretty good\nBattlefield 6 devs \"were pretty happy\" with the beta's anti-cheat performance, even though it \"really sucks\" that \"it does prevent some players from playing\"\nBy Scott McCrae published\nNews \"Anti-cheat is always a cat-and-mouse game\"\nMetal Gear Solid Delta: Snake Eater already has a mod that \"brings dad back home\" as you can now play as Hideo Kojima\nBy Scott McCrae published\nNews Kojima said he won't be playing the remake, but you can play it as him\nLego Batman: Legacy of the Dark Knight is set in \"a much more immersive city than we were ever able to do before\" thanks to the tech built for The Skywalker Saga\nBy Scott McCrae published\nNews \"We have new opportunities because of new technology\"\nSchedule 1 update adds a shotgun and rival cartel to Steam's viral drug-dealing simulator following a player vote, and I'm sure that doesn't have any harrowing implications\nBy Scott McCrae published\nNews It beat out a police expansion and \"shrooms\"\nAs Xbox fans discover just how brutal Helldivers 2 can be, Arrowhead's CEO thanks \"gigachad\" veterans for being \"being so nice to all the new divers\"\nBy Scott McCrae published\nNews For Super Earth!\nMetal Gear Solid Delta is so faithful that Konami seemingly kept all of the original's assets in the game's files\nBy Scott McCrae published\nNews Still in a dream\nA giant exclamation point appears over Komani's head as it investigates Metal Gear Solid Delta causing some of the weirdest bugs and crashes of 2025, with not one, but two crocodile issues\nBy Scott McCrae published\nNews There's also a crash related to using the radio, which is way more common than the crocs\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/best-ps5-games/",
      "text": "Best PS5 games: The 25 greatest PlayStation 5 games ranked\nFrom Death Stranding 2: On the Beach to Helldivers 2, here's the best PS5 games you need to play in 2025\nThe best PS5 games bring together the most memorable and enjoyable experiences you can play on Sony's current-gen console right now. With plenty of new games landing this year, including PS5 exclusives like the long awaited Death Stranding sequel, our ranking has seen some fresh additions that are well worth trying out.\nAnd happily, we have more upcoming PS5 games to look forward to in the near future, including Ghost of Yotei. But if you're looking for more adventures on PS5 that you can tuck into right now, this is a great place to start. With many also finding a home on the PS5 Pro among the confirmed PS5 Pro Enhanced games, this list brings together the standout highlights we'd recommend.\nWith an eye on our PS5 reviews, we've also considered other aspects such as value for time and the fun factor of each game we've seen arrive. And if you're after yet more recommendations, it's always worth checking out the gems of the last generation with our best PS4 games roundup (which you can comfortably also play on your current-gen machine). Read on below to discover our pick of the best PS5 games around right now.\nThe best PS5 games to play in 2025, ranked\nDeveloper: Sandfall Interactive | Released: 2025 | PS5 Pro Enhanced: Yes\nSandfall Interactive brings to life a unique adventure that's simultaneously succeeds at being a love letter to the JRPG genre, while making it's own distinct mark within its foundations. With Clair Obscur: Expedition 33's take on a turn-based system, every battle you encounter in the world is rewarding to conquer, with action that feels as good as it looks on PS5.\n\"Clair Obscur: Expedition 33 is an outstanding visionary debut from Sandfall Interactive, which isn't merely a love letter to JRPGs but builds on its traditions with a distinctly French identity, making for one of the most exciting and rewarding action and turn-based hybrid battle systems ever devised\", says Alan Wen, author of our Clair Obscur: Expedition 33 review.\nBut what perhaps is one of Clair Obsur: Expedition 33's biggest strength is the high-stakes story that will draw out your emotions and tug at your heartstrings as you go up against difficult odds. With a unquiet concept driving the adventure forward, the JRPG influences can be felt, but it's own identity stands tall, and with PS5 Pro enhancements, it finds a happy home on both of Sony's consoles.\nDeveloper: Warhorse Studios | Released: 2025 | PS5 Pro Enhanced: Yes\nKingdom Come: Deliverance 2 is further evidence that we're living through something of a golden age for RPGs. While Baldur's Gate 3 certainly set a new standard, the latest open-world game from developer Warhorse Studios shows there's still plenty of scope for experimentation. The scope of this adventure is vast, set in a beautifully-realized 15th century Bohemia with an almost overwhelming commitment to historical realism.\n\"Building upon its predecessor's commitment to historical realism, Kingdom Come: Deliverance 2 is an absorbing RPG that immerses you in medieval life. If you have the patience to endure a willfully slow progression system, you'll be richly rewarded with heaps to do in 15th century Bohemia,\" says Alan Wen, author of our Kingdom Come: Deliverance 2 review.\nWhat's so interesting about Kingdom Come: Deliverance 2 is the ways in which it is able to leverage its setting to deliver a truly absorbing RPG that's quite unlike anything else around right now – in a way, it always feels like a throwback to classics of the PS3 and Xbox 360 era. The open-ended quest design is phenomenal, so too is a skill system which rewards persistence and an outlay of inquisitive NPCs who help sell the entire fantasy.\nDeveloper: Capcom | Released: 2023 | PS5 Pro Enhanced: No\nIt's actually quite difficult to pick the best fighting game for PS5. If you want arcade thrills then there's Mortal Kombat 1 just waiting to crush your ribcage. If you're looking for a great 3D brawler, then you needn't look much further than Tekken 8. The thing is, Street Fighter 6 isn't just a fantastic 2D fighting game, it also represents one of the best overall fighting game packages ever put forward.\n\"Street Fighter 6 offers the most flexible, versatile, and expressive combat seen in the series to date. With its fantastic suite of game modes and diverse character roster, Street Fighter 6 has something to offer every type of fighting game fan,\" says Andi Hamilton, author of our Street Fighter 6 review.\nWhat you'll find in Street Fighter 6 is a finely-tuned fighting game with an expressive single-player offering and a mass of modes for multiplayer bouts. Whether you're a hardcore fighting game player or a casual Street Fighter fan, there really is something for everyone in here. The combat system is approachable and flexible, its complexity revealing itself as you sink scores of hours into its action. There's real versatility at the heart of Street Fighter 6 that is worth celebrating.\nDeveloper: Polyphony Digital | Released: 2022 | PS5 Pro Enhanced: Yes\nPlayStation has always positioned its first-party racing games as true system showcases, and that is of course true once again with Gran Turismo 7. It's an absolutely stunning simulation, a monstrously-sized package that'll let you indulge in your favorite vehicle classes and take them out on a vast array of lovingly rendered tracks. There's even a game mode which is designed to let you simply marvel at all of the cars you've collected in the intricate detail they are afforded, and even learn a little about each of their historic significance too.\n\"Gran Turismo 7 builds on everything that made GT Sport so good, and even captures what made the early franchise games so beloved to begin with. It's simply a stunning driving game and a superb showcase of the PS5,\" says Justin Towell, author of our Gran Turismo 7 review.\nWhich is all to say that Gran Turismo 7 is undoubtedly the best racing game on PS5. The game shines on its longer events, where weather conditions can drastically alter the composition of races in real-time, and accelerated day/night cycles shifting the mood of races entirely. The sheer scope of the career throughline, and suite of accompanying modes packaged into the game, make this one of the most expansive racing games PlayStation has ever published.\nDeveloper: Kojima Productions | Released: 2025 | PS5 Pro Enhanced: Yes\nDeath Stranding 2: On the Beach builds on the foundations laid down by 2019's Death Stranding to bring an expanded experience that puts greater emphasis on the action and worldbuilding, and the result is a more refined and more approachable adventure that makes its own mark. Once again leaning into its sci-fi strangeness, the cast of characters you meet as Sam are On the Beach's beating heart as you venture across Australia. The online community aspect is back in full force, too, with the sequel once again allowing you to set down structures that other players can make use of, which creates the sense that you're working towards something together.\n\"There's a lot less friction this time around, and the pacing is different, but I've come to appreciate how Death Stranding 2 stands apart while still being in conversation with Hideo Kojima's prior work, Metal Gear Solid,\" says Oscar Taylor-Kent, author of our Death Stranding 2 review.\nDeath Stranding 2: On the Beach will see you dealing with unexpected events, and explores the theme of connection in its unique paranormal world, which looks beautiful on Sony's console. The impressive performance of the sequel on PS5 and PS5 Pro really can't be overstated. With very fast loading times, incredibly smooth frame rates, and gorgeous graphics, it really is a game to behold, too.\nDeveloper: Giant Squid | Released: 2025 | PS5 Pro Enhanced: No\nSword of the Sea sees you soar your way through an atmospheric journey on a hoversword, with movement that draws from snowboarding and skateboarding. It's all too easy to fall into a flowstate as you glide across sandy dunes and surface across water. As relaxing as it is exhilarating, the fluid controls make it all the more enjoyable as you perform flips and spins, and make your way over ramps and pipes.\n\"Sword of the Sea is an effortless ride. The majesty of Journey, the action of The Pathless, and the tranquility of Abzu are all present here\", says Rachel Watts, author of our Sword of the Sea review.\nComing from the artist behind Journey, Abzu, and The Pathless, all of which can be felt in Sword and the Sea's design and beautiful world, the adventure also carves a path of its own with an evocative story. Taking on the role of Wraith, you're resurrected in a necropolis before setting out on a quest to uncover an ancient sea buried down below. With a lost culture to unearth, it's all too easy to get swept up in the stunning visuals and beautiful music as you surf your way through the adventure.\nDeveloper: Hazelight Studios | Released: 2025 | PS5 Pro Enhanced: Yes\nHazelight Studios has a reputation for building the best co-op games. From the prison break antics of A Way Out to the wild fun of It Takes Two, Hazelight makes video games that are only playable with two controllers to hand – and best enjoyed with players sitting beside one another on the couch. The studio's winning streak continues with Split Fiction, a luxurious adventure that tracks two writers thrown into their own fictional worlds.\n\"Split Fiction is another expertly crafted cooperative game from Hazelight that perfectly straddles two genres simultaneously and consistently introduces one good idea after another,\" says Sam Loveridge, author of our Split Fiction review.\nSplit Fiction is an exceptionally inventive, wildly entertaining co-op experience that never seems to tire as it throws out new ideas, systems, and mechanics between each of its levels. The variety on offer is outrageous, with Split Fiction leaping between fantasy and science-fiction settings with playful ease. Whether you're jumping in with a friend in-person or through online functionality, Split Fiction is essential.\nDeveloper: Ubisoft Quebec | Released: 2025 | PS5 Pro Enhanced: Yes\nIf Assassin's Creed Origins was the beginning of Ubisoft's journey to reconfigure its long-running franchise into an action-RPG, then Assassin's Creed Shadows feels like the culmination of these efforts. What you'll find in this adventure is a lushly presented open-world, both sprawling in its scope and absolutely beautiful to beyond – particularly if you're able to play on PS5 Pro, with ACS representing one of the best upgrades we've seen on the refreshed hardware yet.\n\"Assassin's Creed Shadows thrives on boldness. Its dual protagonists improve on the series' stealth-driven roots and modern RPG leanings, though they're let down by a vague story that fails to make full use of either character,\" says Andrew Brown, author of our Assassin's Creed Shadows review.\nStill, regardless of what model of PS5 you're playing Assassin's Creed Shadows on, it's well worth your time and attention. Dual protagonists Yasuke and Naoe offer wildly different ways to experience the Feudal Japan setting, the former pulling attention on refined combat mechanics and the latter on exceptional advances to Ubisoft's underlying stealth systems. Japan has been a long-requested destination for this series to explore, and Assassin's Creed Shadows doesn't disappoint.\nDeveloper: Capcom | Released: 2025 | PS5 Pro Enhanced: Yes\nMonster Hunter Wilds is some of the most fun you can have with friends on PS5 right now. Capcom started down a path in 2018 to reintroduce its long-running series to western audiences with Monster Hunter World, stripping out some of the more esoteric aspects to its mechanical design to make it more approachable to a wider base of players. Monster Hunter Wilds feels like the inevitable endpoint for that endeavor, and what a delight it is.\n\"With the best combat and narrative in a 20-year series of action RPGs, Monster Hunter Wilds is the new peak of the Monster Hunter series, only further enlivened by a colorful cast of monsters that defies longtime design conventions,\" says Austin Wood, author of our Monster Hunter Wilds review.\nMonster Hunter Wilds has the sharpest game feel in the series to date. Combat is kinetic as you and your pals track, hunt, and battle some astoundingly large monsters, recycling the rewards earned in victory to craft increasingly outrageous weapons and armor. Wilds is undoubtedly the most approachable and accessible entry point into the series to date, something that Capcom has achieved without sacrificing all that much depth. If you've ever wanted to try Monster Hunter, Wilds is the time to do it.\nDeveloper: Studio Zero | Released: 2024 | PS5 Pro Enhanced: No\nAtlus has, in essence, pulled off the impossible with Metaphor: ReFantazio. For players who have grown tired of Final Fantasy's transition away from turn-based combat and complex storytelling towards more action-oriented structures, there's a pretty good chance that discovering Metaphor: ReFantazio will be somewhat revelatory. This monstrous JRPG boasts hundreds of hours of playtime, an incredible world to explore, and a wildly detailed combat system that encourages experimentation. If you've got the time, Metaphor: ReFantazio won't disappoint.\n\"Metaphor: ReFantazio is a triumphant evolution of Atlus' best, and offers a gripping new story supplemented by a loveable cast, dungeons begging to be explored, and a gorgeous art direction that makes you feel like you're wandering the pages of a fairytale book,\" says Catherine Lewis, author of our Metaphor: ReFantazio review.\nThere's a level of quality to the overall production that's hard to ignore as well, with developer Studio Zero delivering exceptional artistic direction and an unforgettable soundtrack to help propel you through the sprawling fantasy setting. That shouldn't come as any surprise either, given that Metaphor: ReFantazio comes from the creative minds responsible for steering the Persona series over the past two decades. Metaphor is a luxuriously crafted RPG with a killer turn-based combat system.\nDeveloper: Housemarque | Released: 2021 | PS5 Pro Enhanced: No\nReturnal was one of the first significant first-party PS5 exclusives released outside of the system's launch window, and the roguelike shooter has lost none of its potency in the last four years. In fact, there's still nothing quite like Returnal available on the platform. It's one of the weirdest blockbusters of the generation, and deliberately challenging – the sort of experience that you'll walk away from in anger after a failed run before crawling back for more a few minutes later.\n\"Returnal is a breakaway from the type of exclusive Sony typically focuses on, using a genre that has only recently come back into fashion as a starting point for a story that makes you work to understand it, offering plenty to chew on without wrapping it up neatly,\" says Ben Tyrer, author of our Returnal review.\nReturnal sees you trying to survive cycles of violence on a strange alien planet. You're trapped in a time loop, the narrative unfurling gradually as you shift deeper into the planet Atropos. It's one of the slickest shooters on PS5, and one of the best looking titles too – a true visual and auditory assault on the senses. Death is but a chance to try again in Returnal, a chance to regroup and reapply lessons learned across your descent into strange territories.\nDeveloper: Square Enix | Released: 2024 | PS5 Pro Enhanced: Yes\nFinal Fantasy 7 Rebirth was always going to be a challenge for developer Square Enix. Its predecessor, Final Fantasy 7 Remake, was a largely faithful reimagining of one of the most iconic RPGs of all-time until it entered its final-phase, engineering a sharp left turn that left more questions than answers. Rebirth takes Final Fantasy veterans into somewhat uncharted territory as a result, retaining key moments of awe and delivering a more layered narrative that'll keep you guessing until the end.\n\"Final Fantasy 7 Rebirth delivers all the charm of Final Fantasy 7 Remake while making the needed improvements to side-content and the active combat systems to ensure the original 1997 game's iconic step-out moment is worth taking once more,\" says Iain Harris, author of our Final Fantasy 7 Rebirth review.\nAs the middle portion of a planned trilogy, you will most-likely want to play Final Fantasy 7 Remake before venturing into this sequel, but no matter how you choose to play you'll find an expansive, expressive RPG adventure waiting for you. Square Enix has carefully refined its open-ended exploration, with hundreds of hours of distractions waiting for you outside of the excellent core narrative. Combat and progression is tighter, a is the way the story interweaves with a truly expansive world.\nDeveloper: Capcom | Released: 2023 | PS5 Pro Enhanced: Yes\nIt's truly astounding how well Resident Evil 4 has stood the rest of time. The iconic survival horror game celebrated its 20th anniversary in 2025, and it's still as potent today as it ever was. But if you're looking for the best way to experience special agent Leon S. Kennedy's mission to rescue the president's daughter from a dangerous cult, you'll want to pick up the stunning Resident Evil 4 Remake – a genuinely spellbinding adventure that never loosens its grip.\n\"Capcom has delivered a great remake of a classic game, one which captures everything that made it so special to begin with. Resident Evil 4 Remake is full of action and variety that's as exhilarating now as it ever was,\" says Leon Hurley, author of our Resident Evil 4 Remake review.\nWhat's so impressive about the Resident Evil 4 Remake is that it doesn't just preserve the spirit of the original, but enhances it for a new generation of players. The core structure remains intact, but Capcom worked plenty of neat tricks into the play experience which work to revitalize the hectic third-person combat and utterly audacious set-pieces. There's no shortage of fantastic horror games on PS5, but few are able to reach such dizzying heights.\nDeveloper: Guerrilla Games | Released: 2022 | PS5 Pro Enhanced: Yes\nIf you're looking to stress test your PS5, you'll want to pick up Horizon Forbidden West. The long-awaited sequel to one of Sony Interactive Entertainment's biggest success stories of the PS4 era tracks Aloy as she enters a lush new open-world expanse, a post-apocalyptic version of the Western United States overrun by competing factions and towering mechanical dinosaurs. The visual fidelity and scope of the expansive world is genuinely awe-inspiring, and remains somewhat unrivaled in this sense all these years after its release.\n\"Horizon Forbidden West is a tweaked, enhanced, and confident sequel from Guerrilla Games that exceeds expectations, delivering an open world full of compelling characters, an intriguing story, and yes, more super awesome robot dinosaurs to battle across a vast open world,\" says Sam Loveridge, author of our Horizon Forbidden West review.\nDeveloper Guerrilla Games made a number of smart tweaks to the mechanical design which so many millions of players fell in love with through Horizon Zero Dawn, with the studio engineering massive improvements to combat, navigation, and quest design. Horizon Forbidden West is a bigger and more refined experience as a result; a well-tempered evolution that never fails to arrest the attention. Prepare to lose hours of your life to this stunning PS5 exclusive.\nDeveloper: Naughty Dog | Released: 2024 | PS5 Pro Enhanced: Yes\nThe Last of Us 2 is a genuine achievement. Naughty Dog has built a reputation for breaking boundaries in the action-adventure genre, but there are few modern video games as starkly all-encompassing as this. A sprawling tale of revenge set across a Seattle wasteland, The Last of Us 2 tracks the intertwining lives of Ellie and Abby – two characters bound spiritually by a hatred for the world around them. An expansive story told in short, sharp shocks of violence.\n\"The Last of Us Part 2 not only justifies its existence as a sequel most didn't think was necessary, supplementing and elevating the timeless qualities of its predecessor, but stands confidently apart as an entirely different beast, one bearing its own fangs that bite with just as much force,\" says Alex Avard, author of our Last of Us 2 review.\nWith The Last of Us Season 2 set to air in April, there's never been a better time to get caught up on the source material. The Last of Us: Part 2 was remastered for PS5 in 2024 (the title was originally released four years before on PS4), bringing visual improvements, faster loading times, and a suite of new gameplay modes and otherwise lost levels. This adventure isn't for the faint of heart, but it's a truly generation-defining experience that set a new standard for play.\nDeveloper: Arrowhead Game Studios | Released: 2024 | PS5 Pro Enhanced: No\nIn what is undoubtedly the best PS5 multiplayer game of the generation, Helldivers 2 takes the Starship Troopers fantasy and turns it into a reality. Whether you are dropping into Automaton-controlled space alone, or pairing up with three other friends to tackle Terminid territories together, Helldivers 2 is a riot . Principally a third-person shooter, your objective is to survive against ever-increasing masses of enemies – thinning hordes with dwindling ammunition supplies as objectives are completed and friendly-fire casualties are recorded.\n\"At a time when the merits of live-service games are being called into question, Helldivers 2 has the potential to turn that conversation around. I never thought I'd be interested in another one again but, against my better judgment, Helldivers 2 has got me doing my part,\" says Rick Lane, author of our Helldivers 2 review.\nDeveloper Arrowhead has done a phenomenal job of maintaining this live-service phenomenon, a Galactic Map tracking playerbase progression on PS5 and PC in real-time. With few attempts to monetize the experience, and a relaxed approach to battle pass progression, it's possible to drop in and out without fear of falling behind. Brilliantly tactile and exceptionally challenging, Helldivers 2 is best enjoyed with a few buddies who will never let you forget that time you misplaced a deadly stratagem.\nDeveloper: Remedy Entertainment | Released: 2023 | PS5 Pro Enhanced: Yes\nIf Hereditary and Midsommar distributor A24 made horror games, I imagine the results would look something like Alan Wake 2. It's a boldly produced, fearlessly creative, and deeply-affecting psychological thriller which tracks one story across two unraveling realities. You take control of horror author Alan Wake as he spirals through the Dark Place, a metaphysical prison of comic-horror proportions; and Saga Anderson, an FBI agent investigating a series of ritualistic murders and their connection to Wake's disappearance a decade earlier.\n\"Whenever I thought I had a handle on where Alan Wake 2 was leading me it upended my expectations. It's an intelligent sequel to a cult classic, driven to new heights by the darker impulses necessitated by the horror story. It's also wonderfully silly, and at times brilliantly imaginative,\" says Josh West, author of our Alan Wake 2 review.\nThe best Remedy Entertainment games are known for their propulsive action, evocative atmosphere, and unmistakable sense of place. Alan Wake 2 feels like the pure distillation of these aspects, and it's quite simply peerless as a resulted. If you're a fan of survival horror games like Resident Evil, or are looking for the latest from the team behind Control, then this has my highest recommendation. At a time where blockbuster horror games are synonymous with remakes, Alan Wake 2 is essential.\nDeveloper: CD Projekt Red | Released: 2020 | PS5 Pro Enhanced: Yes\nIt's honestly astonishing just how far Cyberpunk 2077 has come. When the open-world experience launched in 2020, the PS4 version was in such a rough state that Sony was forced to take unprecedented action: the game was removed from the PlayStation Store, with refunds issued to affected players. What a difference a few years can make. Cyberpunk 2077 can now be considered one of the greatest RPGs of all-time, and a milestone achievement for developer CD Projekt Red – impressive, given the studio is best known for The Witcher 3.\n\"Phantom Liberty is the culmination of CDPR's efforts to right the wrongs of a challenging launch, with this premium expansion combining with Update 2.0 for a total revitalization of Night City. This is Cyberpunk 2077 at its best,\" says Sam Loveridge, author of our Cyberpunk 2077: Phantom Liberty review.\nCyberpunk 2077 has a dazzling sense of scale. It's remarkable how small you feel walking the wide streets of Night City, a towering metropolis that you'll easily sink hours into exploring. The depth of customisation and quality of combat is excellent, while the visual fidelity captured through cinematics and conversations has undoubtedly set a new benchmark for the industry. I recommend that you pick up Cyberpunk 2077: Ultimate Edition, which includes the Phantom Liberty expansion.\nDeveloper: Insomniac Games | Released: 2023 | PS5 Pro Enhanced: Yes\nYou can think of Marvel's Spider-Man 2 as the ultimate reflection of what is possible when talented video game creators are working to squeeze the full potential out of the PlayStation 5. It's a visually ambitious adventure, with expressive character animations and punchy combat packed into a distinctive open world. In many ways we've come to expect nothing less from developer Insomniac Games. But what continues to impress me is just how fluid Marvel's Spider-Man 2 feels in your hands.\n\"Spider-Man 2 improves on its predecessor across the board, while saluting the superhero genre over the last 30 years as a whole. With a captivating narrative and unrivaled spectacle, it's the quintessential superhero game, in story and mechanical terms,\" says Joe Donnelly, author of our Marvel's Spider-Man 2 review.\nThe speed in which Peter Parker and Miles Morales are able to swing around the boroughs of New York City is exceptional, so too is the way you're able to seamlessly transition between the two characters as they do battle against some of the best Spider-Man villains. The more comfortable you become in control, the more you're able to easily build momentum – the resulting action is thrilling, particularly in a package that is otherwise full of heart, humor, and unforgettable set-pieces.\nReleased: Arkane Studios | Released: 2021 | PS5 Pro Enhanced: No\nDeathloop will challenge your expectations every step of the way. A brand new first-person shooter from Arkane Studios is typically cause for celebration, the studio behind such success stories as Prey and the Dishonored series. But Deathloop isn't an immersive sim in the traditional sense, and is all the better because of it. What you have here is a more self-contained adventure that's dripping with style and subversive action, a puzzle that needs to be carefully pieced together over time.\n\"My impression of Deathloop seemed to shift with every passing hour. It's difficult to not be impressed – if not thoroughly enthralled – by what Arkane has achieved here. It's different, it's stylish, and it's new; you won't play anything else quite like Deathloop this generation,\" says Josh West, author of our Deathloop review.\nDeathloop is a murder mystery suspended in a time loop; a first-person shooter that stars a shotgun which can transform into a rifle at the press of a button; and a sci-fi adventure that's stuck in the '70s. And even that description barely scratches the surface. You're charged with eliminating eight targets before the clock strikes midnight, and if you fail the hands of time reset – leaving you with little more than the knowledge of your past successes and failures. Deathloop is a wild ride.\nDeveloper: Larian Studios | Released: 2023 | PS5 Pro Enhanced: No\nI'll admit that I've never historically been the biggest fan of Dungeons and Dragons, but that didn't stop me from falling in love with the latest masterwork from Larian Entertainment. What you get in Baldur's Gate 3 is the best RPG of the generation, an impossibly complex adventure with a staggering amount of depth and complexity. It's honestly staggering how good this game is at generating stories, and at pulling every player who dives in into different directions with ease.\n\"Baldur's Gate 3 is the most successful, authentic take on Dungeons and Dragons in the tabletop franchise's 50-year history. Its complexity and size might be daunting for novices, but the breadth and depth of BG3's world make this a once-in-a-generation achievement,\" says Ali Jones, author of our Baldur's Gate 3 review.\nIf there's any word of caution I could present to you, it's this: prepare for Baldur's Gate 3 to consume your spare time. Whether you're venturing into the wilds alone or partnering up with a friend for co-op, Baldur's Gate 3 has this incredible ability to become the only thing you'll care about. Combat is challenging, you'll fall in love with the characters, and you'll be shocked when even the smallest decision cascades into an unavoidable calamity. Whether you're a D&D newbie or veteran player, you don't want to miss this one.\nDeveloper: Insomniac Games | Released: 2021 | PS5 Pro Enhanced: No\nI honestly believe that Ratchet and Clank: Rift Apart is some of the most fun that you can have on PS5. It captures that playful spirit which defined so many of the best PS1 games like lightning in a bottle – echoing the platformers which once defined the earliest years of Sony's arrival onto the video game market 30 years ago. Developer Insomniac Games outdid itself with this one, an adventure that's just so full of heart, humor, and character that you worry it's going to burst.\n\"Ratchet and Clank: Rift Apart is one of those rare games that brings back the feeling of being up early on a Saturday morning before your parents wake up, binging your favorite cartoons, and high on sugary cereal. It's one cardiac event of excitement after another,\" says Rachel Weber, author of our Ratchet and Clank: Rift Apart review.\nIt certainly doesn't hurt that Ratchet and Clank: Rift Apart is a true PS5 system showcase. The speedy SSD packed inside the system is used to great effect, allowing Ratchet to dynamically cross between worlds and seamlessly leap between encounters which will ignite the imagination. Phenomenal visual fidelity meets haptic combat, packed full of memorable weaponry and character moments that'll leave you delighted. Ratchet & Clank: Rift Apart is pure entertainment for kids of all ages.\nDeveloper: Sony Santa Monica | Released: 2022 | PS5 Pro Enhanced: Yes\nIt's really quite staggering how far developer Sony Santa Monica has taken God of War in two decades. Earlier titles, which still rank among the best PS2 and best PS3 games, are a far cry from what the latest installment has to offer. God of War Ragnarok is a lushly produced, visually expansive, and exceptionally cinematic adventure which tracks Kratos and his teenage son Atreus through increasingly deadly terrain – the unfolding events among some of the best on PS5.\n\"God of War Ragnarok is a great game, with weighty emotional moments, incredibly satisfying puzzles, and combat that's never less than enjoyable. With a beautiful world full of things to discover, this adventure is a fitting close for Kratos' viking excursions,\" says Leon Hurley, author of our God of War Ragnarok review.\nThe nine realms stand on the cusp of destruction as Ragnarok approaches, an eschatological event that concludes the Norse era of the series. Sony Santa Monica pushes a suite of quality-of-life improvements to the fore, combining them with strikingly slick beat-'em-up combat and the sort of cinematic flair that is so rarely captured outside of first-party PlayStation Studios productions. God of War Ragnarok is a must-play; a staggering spectacle that's packed with fantastic, memorable characters.\nDeveloper: FromSoftware | Released: 2022 | PS5 Pro Enhanced: No\nElden Ring captures such an incredible sense of discovery. Where previous FromSoftware developed games – Demon Souls, Dark Souls, and Sekiro: Shadows Die Twice – would leave you stranded at chokepoints, slamming your head against a brick wall until you somehow smashed through, Elden Ring offers complete freedom of movement. It's in that exploration, as you turn away from seemingly insurmountable challenges in search of a distraction, where this adventure excels. There's always something incredible to find, so long as you're daring enough to go out in search of the unknown.\n\"Elden Ring is both an ambitious refinement and careful evolution of the Dark Souls formula, with developer FromSoftware presenting an expansive world that's as hostile as it is inviting. Despite the occasional excess, suffering has never been as much fun as this,\" says Joel Franey, author of our Elden Ring review.\nIt's this aspect which has propelled Elden Ring into being one of the best open world games of the modern era. This dark fantasy isn't going to be for everybody – it can be exceptionally punishing, even when wielding magic or summoning signs – but if you're willing to give Elden Ring the time, it'll give you an adventure of a lifetime in return. With the Shadow of the Erdtree expansion out now, the best Souslike on PS5 only reaches new heights. Trust your abilities and dare to fail, you won't regret it.\nDeveloper: Team Asobi | Released: 2024 | PS5 Pro Enhanced: No\nI've thought long and hard about whether Astro Bot's ascension to the number one position on GamesRadar's ranking of the best PS5 games is recency bias, but the truth of it is that Team Asobi has delivered an absolutely astounding experience. In this charming, dazzling platformer, PlayStation finds itself on equal footing with Nintendo – in Astro Bot, movement is perfectly weighted and challenge carefully calculated. It's a true achievement, and one of the best system showcases that the PS5 has to offer.\n\"Astro Bot doesn't just deliver on the promise and potential displayed in PS5 pack-in demo Astro's Playroom, but soars above and beyond to serve up a near-perfect platformer to rival – and possibly surpass – the best of Super Mario's Mushroom Kingdom romps,\" says Matt Cabral, author of our Astro Bot review.\nThat Team Asobi finds itself in this position is incredible. Astro's Playroom was an accessible entrypoint into this new generation, the freely playable technical demo designed to highlight the unique functionality afforded by the DualSense controller. But in this sequel, the studio settles into new rhythms. Astro Bot is a wondrous celebration of 30 years of PlayStation, a pixel perfect platformer, and proof that this hardware still has plenty more to give – one of the best looking and feeling games on PS5.\nJosh West is the Editor-in-Chief of GamesRadar+. He has over 15 years experience in online and print journalism, and holds a BA (Hons) in Journalism and Feature Writing. Prior to starting his current position, Josh has served as GR+'s Features Editor and Deputy Editor of games™ magazine, and has freelanced for numerous publications including 3D Artist, Edge magazine, iCreate, Metal Hammer, Play, Retro Gamer, and SFX. Additionally, he has appeared on the BBC and ITV to provide expert comment, written for Scholastic books, edited a book for Hachette, and worked as the Assistant Producer of the Future Games Show. In his spare time, Josh likes to play bass guitar and video games. Years ago, he was in a few movies and TV shows that you've definitely seen but will never be able to spot him in.\n- Heather WaldSenior staff writer\n- Sam LoveridgeBrand Director, GamesRadar+\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/gaming/death-stranding-2-collectors-edition-is-a-sight-to-behold-and-heres-where-to-pre-order-yours/",
      "text": "Death Stranding 2 collector's edition is a sight to behold and here's where to pre-order yours\nDeath Stranding 2: On The Beach launches on June 26\nHideo Kojima's games receiving their own collector's editions adorned with merchandise and in-game extras isn't anything new, but Death Stranding 2: On the Beach Collector's Edition was worthy enough to get its very own trailer at SXSW last week.\nDuring the trailer, Kojima Productions revealed that the collector's edition of the game comes with, naturally, a digital copy of the PS5 game, but its pièce de résistance is the 15-inch statue of the Magellan Man - a recreation of the latest creepy tar monster shown off in the trailers. The statue is so detailed that Kojima himself shared insights into the Magellan Man's production on social media, and you can secure yours right now through the PlayStation website.\nPre-orders for the collector's edition launched today, March 17, at 10 am local time in the US, UK, France, Germany, Austria, Spain, Portugal, Italy, Netherlands, Belgium, and Luxembourg. The collector's edition in question is exclusive to the PlayStation website, so I recommend getting in there fast if you're desperate for that statue, and the 3” Dollman figurine, art cards, 48 hours of early access, and all the in-game goodies that come along with it.\nThe Death Stranding 2: On The Beach Collector's Edition officially launches on June 26, 2025, at $229.99 / £219.99. Both the digital Deluxe and digital Standard Editions will launch on the PS5 on the same day for $69.99 / £79.99 respectively.\nDeath Stranding 2: On The Beach Collector's Edition | $229.99 at PlayStation Direct\nThe Collector's Edition of Kojima Productions' Death Stranding 2: On The Beach comes decked out with a digital copy of the PS5 game, along with a 48-hour Early Access to the game and a collector's box featuring a 15” Magellan Man statue, 3” Dollman figurine, art cards, letter from Kojima, and a ton of in-game items, including Machine Gun (MP Bullets) LV1 early unlock, patches and the Quokka Hologram.\nUK: £219.99 at PlayStation Direct\nThe collector's edition for the first Death Standing game is unforgettable, being the only PS4 collector's edition of its kind to come with a 1:1-scale BB pod basically a realistic replica of a baby. At the time, it was as impressive as it was unsettling, but Kojima believes its sequel's unique statue to be the \"product of KJP’s spirit and soul.\"\nTo ensure the statue was up to standard, Kojima stated on X (Twitter) that the Entei Ryu-designed figure was CG modeled, 3D printed, and produced under the full supervision of Yoji Shinkawa. If that name doesn't ring a bell, Yoji Shinkawa is no other than the artist behind the character and mech designs for Kojima's Metal Gear Solid game series.\nStatues packed in with collector's editions aren't always of a high standard, but I have all faith that the Magellan Man will look just like the trailer suggests. Especially after Kojimo shared that the one and only Yoji Shinkawa went as far as to visit the factory to keep a watchful eye over the mass production.\nIf you don't quite have the space for that 15” Magellan Man statue, or just fancy yourself a less pricey version of Death Stranding 2: On the Beach, then Kojima has you sorted. A digital deluxe edition of the PS5 game is also available to pre-order for $79.99 / £79.99, and a standard edition is available to pre-order for $69.99 / £69.99 from selected retailers.\nThe Death Stranding 2: On the Beach Digital Deluxe Edition doesn't come with any physical collector items, however, you still get a digital copy of the game, including 48 hours early access, and those in-game items of a Machine Gun (MP Bullets) LV1 early unlock, Battle Skeleton: Gold (LV1, LV2, LV3), Boost Skeleton: Gold (LV1, LV2, LV3) and a Bokka Skeleton: Gold (LV1, LV2, LV3).\nThe digital standard edition just includes a digital copy of the PS5 game, however, if you pre-order it, or the collector's, digital deluxe, or digital standard versions of the game will also get you access to a Quokka Hologram, Battle Skeleton: Silver (LV1, LV2, LV3), Boost Skeleton: Silver (LV1, LV2, LV3), and a Bokka Skeleton: Silver (LV1, LV2, LV3) to use in-game, too.\nIf you want to prepare your Sony console for Death Stranding 2, picking up one of the best PS5 headsets, the best PS5 controllers and the best SSDs for PS5 will go a long way in giving your Sony gaming setup the perfect boost.\nWeekly digests, tales from the communities you love, and more\nEver since I first held a NES controller in my hand I've been obsessed with gaming, and the hardware it runs on. I could hook up a NES and SNES to a telly, without instructions, before I could walk. Even now, nothing is more exciting then taking a console, or handheld, out the box for the first time and setting it up. This obsession transformed into a love of games and game music, which lead to my music degree and dream of becoming the Scottish Nobuo Uematsu. After sharing my love of games through music, I began to share my love through words on sites like TechRadar and iMore. This lead to becoming a Hardware staff writer for PCGamesN, and later the Senior Tech Writer for Dexerto, covering all things Steam Deck, PlayStation and Nintendo. With that experience, I was able to level up as Hardware Editor for GamesRadar+, where I'm still just as Nintendo, PlayStation and gaming tech obsessed as ever.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/hardware/the-fact-that-you-can-still-buy-19-inches-of-venom-with-the-spider-man-2-collectors-edition-has-my-spidey-sense-tingling/",
      "text": "The fact that you can still buy 19 inches of Venom with the Spider-Man 2 Collector's Edition has my Spidey sense tingling\nThe Marvel's Spider-Man 2 Collector's Edition is still up for grabs\nRight now, you can still buy the Marvel's Spider-Man 2 Collector's Edition set for the PS5.\nYou know the one that comes with a digital copy for one of the best PS5 games, and that massive 19-inch Venom statue, where he's battling it out with Peter Parker and Miles Morales while the creepy symbiote tendrils menacingly lift him into the air? Well, it's available for $229.99 at PS Direct despite the fact that the game launched way back in October 2023, and I'm trying to use all my strength and willpower not to buy it.\nIt's not the price that's putting me off, but the struggle of fitting 19 inches worth of spectacular Spidey goodness into my life. There's only so much shelf space I can spare for more Marvel merch, and that's a whole lot of Venom that I'll need to accommodate, tendrils in all.\nMarvel's Spider-Man 2 Collector's Edition for PS5 | $229.99 at PS Direct\nIf you missed out on the collector's edition the first time around, you can still grab the box full of Marvel's Spider-Man 2 goodies through PS Direct right now, including that glorious 19-inch Venom statue. The collector's box set also includes a digital voucher copy of the game, a steelbook display case, all the pre-order bonus items including an early unlock for the Arachknight Suit for Peter, an early unlock for the Shadow-Spider Suit for Miles, and all the digital deluxe edition in-game content, which includes even more suits for Peter and Miles.\nBuy it if:\n✅ You missed owning the Collector's Edition at launch\n✅ You're a big Spidey fan\n✅ You want 19 inches of Venom in your life\n✅ You want all the exclusive in-game Spidey suits\nDon't buy it if:\n❌ You've already played Marvel's Spider-Man 2\n❌ Venom isn't your favorite Spidey baddie\n❌ You aren't a fan of collector's edition statues\nCollector's Editions don't usually stick around for long. Weeks, and in some cases even days, after a big game's release, you'll only going to find them in the window displays at GameStop amongst other over-priced PS5 accessories. or copies across every second-hand auction site you can imagine in the US. So I'm shocked this is still available to buy.\nShocked but happy, as it's a PlayStation Direct exclusive, I remember the difficulty of finding this edition in stock shortly after launch. Finding the Venom statue anywhere but eBay at the time got so stressful that it's why I stuck with a physical copy of just the game instead.\nIt didn't disappoint, and I have the Platinum trophy to prove it. But as a big Spider-Man nerd, I can't pretend I wasn't thinking about the 19-inch Venom statue, steelbook case, and all the in-game suits and goodies I could have had access to, had I had the collector's edition been available online for a little while longer.\nI'm not sure if PlayStation Studios and Insomniac Games just made an extra batch of Venom statues to appease Spidey fans like me who missed them the first time around, or a fresh box of collector's editions was found by a PS Direct staff member at the back of a warehouse somewhere, but I'm glad they're now more readily available.\nWeekly digests, tales from the communities you love, and more\nCollector's editions of games being this exclusive commodity has never sat right with me. They tend to be pretty pricey, and their short lifespan on the digital shelves makes them even more prone to being exclusive for those with the cash to spare. I've even pre-ordered a collector's edition (the Clock Tower Rewind Collector's Edition by Limited Run Games) purely as I knew I'd not be able to buy it for its retail price in the future - and I still feel gross about it.\nHaving them still in stock years after launch, like with this Spider-Man 2 edition, gives Spidey fans with smaller budgets a chance to save and grab the statue for themselves, with the added bonus of not having to fork money over to greedy resellers, and I'm all for it.\nAn MSRP of $229.99 / £219.99 is still going to be out of a lot of Spider-Man fan's budgets, of course. Especially as I'm sure most fans have a copy of the Insomniac Spidey sequel on PS5 (or even Steam) by now, and don't fancy forking out over $200 for another. However, it is the accessibility that I'm a fan of, and I only wish collector's editions for other big PS5 games were still easy to find in 2025.\nNow Sony, can you please restock the Marvel's Spider-Man 2 DualSense controller too? If the 30th anniversary DualSense controller can get a restock, why not Spider-Man?\n- View all PS5 game deals at Amazon\n- Miles Morales Ultimate Edition:\n$69.99$49.28 at Amazon\nPicking up one of the best PS5 controllers, the best PS5 headsets, and one of the best SSDs for PS5 can help make your web-slinging adventures even better on your Sony console.\nEver since I first held a NES controller in my hand I've been obsessed with gaming, and the hardware it runs on. I could hook up a NES and SNES to a telly, without instructions, before I could walk. Even now, nothing is more exciting then taking a console, or handheld, out the box for the first time and setting it up. This obsession transformed into a love of games and game music, which lead to my music degree and dream of becoming the Scottish Nobuo Uematsu. After sharing my love of games through music, I began to share my love through words on sites like TechRadar and iMore. This lead to becoming a Hardware staff writer for PCGamesN, and later the Senior Tech Writer for Dexerto, covering all things Steam Deck, PlayStation and Nintendo. With that experience, I was able to level up as Hardware Editor for GamesRadar+, where I'm still just as Nintendo, PlayStation and gaming tech obsessed as ever.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/best-lego-sets-and-kits/",
      "text": "Best Lego sets 2025, with expert recommendations from Star Wars to Marvel\nGet the most brick for your buck with these suggestions, chosen through hands-on experience\nIf you're trying to build a collection of the best Lego sets piece by piece, you're not exactly short on choice; there are so many options weighing down shelves at the moment that finding the right one for you can be like searching for a specific brick in a whole haystack of them. That's why the GamesRadar+ master builders and I have rounded up our favorites across a wealth of ranges.\nAll of these choices are based on first-hand experience, and we've personally reviewed each and every kit in this guide to the best Lego sets. As an example, I spent around a week constructing and critiquing our top choice – Rivendell – before putting it in pride of place on my shelf where it still stands today. (You can find out more in the 'how we test' section further down the page.) That's true for all of the models here, actually; I haven't recommended anything that we wouldn't want to buy or display ourselves.\nTo help you narrow things down even more, I've divided this page into sections based on the most popular ranges (like Star Wars and Harry Potter) alongside specs on complexity, time taken, and more. This should point you in the right direction if you're unsure how to choose the best Lego sets. Check back in occasionally, too; this guide will be updated each month with the hottest models as and when they land. There are a lot of upcoming Star Wars sets that caught my eye, for example, and I'm watching out for the teased Game Boy kit with great interest…\nBenjamin has been writing about Lego for GamesRadar+ since 2018, and his bylines stretch back over a decade. He's been an avid Lego fan since he was a child, and is currently building the Great Deku Tree after finishing the Disney Castle (his white whale).\nAugust 27, 2025: A new Animal Crossing section has been added to this guide, with a full critique of the set and an expert opinion from the writer that wrote our original review.\nJuly 22, 2025: New entries have been added to the 'Lego sets to look forward to in 2025' section, including Soundwave and the 3-in-1 Haunted Mansion. A 'currently testing' section has been added too. In addition, extra clarity has been added to the FAQ, how we test, and how to choose portions of this guide.\nJune 25, 2025: This page has been given an additional 'best Lego sets to come out in 2025 so far' section, complete with numerous kits that caught our eye and the reason why they were included here. New entries have been added to the 'Lego sets to look forward to in 2025' as well, because the previous ones have now launched. A 'curated by' section has also been introduced.\nQuick list\nBest overall\nAlthough it looks good in pictures, this kit is jaw-dropping in person. Thanks to an abundance of hidden details and clever engineering choices, it's also a great conversation-starter that's worthy of being in pride of place.\nRead more\nBest Star Wars\nThere isn't a more iconic ship in all the Star Wars galaxy, and this kit does the idea justice at a price most of us will actually be able to afford. It doesn't skimp on detail despite that smaller size, either.\nRead more\nBest Harry Potter\nMany of the best Lego sets are conversation starters, but none more so than the Talking Sorting Hat. Besides looking fantastic, this thing will literally chat with you and sort all would-be wizards and witches into Hogwarts houses.\nRead more\nBest Marvel\nIt's surprisingly tough to find reasonably-priced Marvel sets that include every OG Avenger from the movies, so this one is already winning. However, it also recreates a downright iconic moment whilst being perfect for display or play.\nRead more\nBest Mario\nPremium kits like the Mighty Bowser are all good and well, but this Super Mario set will be a better fit for most people. Affordable yet deeply characterful, the Piranha Plant is the perfect desk or shelf buddy for any fan of the franchise.\nRead more\nBest Animal Crossing\nNew Horizons got many of us through the pandemic, and now you can recreate your island getaway in Lego form. Of all the Animal Crossing sets on offer, this is our favorite; it's the best mix of price, fan-service, and gosh-darn cuteness.\nRead more\nBest retro\nIf you're a Lego fan of a certain age, you may remember putting the original castle together fondly… and this revised version lives up to those memories. The team's passion for its legacy is clear.\nRead more\nBest Lego set overall\nSpecifications\nReasons to buy\nReasons to avoid\nThere's something breathtaking about this kit. Photos don't do it justice; they can't capture how sprawling, intricate, and well-considered Lego Rivendell is. It uses every trick in the company's playbook, and there's a sense of fierce creativity powering it.\nSeriously, I can't get over how good this thing looks. Lord Elrond's home bears a fearsome price tag and takes up a good chunk of real estate, but my god is it beautiful. It feels as if the team poured their collective heart and soul into the design.\n✅ You enjoy hidden details: Lego Rivendell is crammed with Easter eggs, and every inch hides a fun nod to the movies.\n✅ You want one of the prettiest Lego sets: Lego has used every trick and workaround for this kit. More importantly, it's gorgeous - those pastel roof tiles are beautiful, and the numerous trees add an eye-catching splash of autumnal color.\n❌ You don't have much space: This kit is a sprawling build that will happily take up most of a table or shelf.\n❌ You aren't keen on long builds: Even though I've seen some people finish it in around 15 hours, making the set took us something like 25. Be wary if you're low on time.\nFeatures: With more than 6,000 pieces and a width of 29 inches, this is a monstrously big kit that will steal the limelight in any space it occupies. Alongside three distinct dioramas that can be shown off separately or combined for a massive scene, it also comes with 15 minifigures (the Fellowship of the Ring alongside Bilbo Baggins, Elrond, Arwen, elves, and a visiting dwarf).\nBuild: Although it's not for the faint of heart due to its many pieces, 50 bags, and 20-hour build time, Lego Rivendell is all the more satisfying as a result. It's not necessarily difficult, either. Thanks to concise instructions that are incredibly clear, it avoids any kind of confusion as you put the set together section by section (the project is split into three manageable chunks).\nYou'll be kept amused by numerous facts and the daddest of dad jokes dotted throughout these books, too. Indeed, I'm disappointed that we don't see more of this in other kits.\nDesign: Sure, Lego Rivendell is an investment in terms of time and money. But good lord, the outlay is worthwhile. Few other sets are as intricate as this, and it's riddled with secrets that range from tiny maps of Middle-earth to Bilbo's red book.\nIn fact, there are more than a few cubby-holes that serve as cute little dioramas; every time you look at it, there's something new to discover. It's like the ultimate doll's house, and my nerd heart is very happy every time I visit the last homely house in the west on its shelf.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | Thanks to fun asides in the instruction booklets and hidden details that should delight fans, this is a joy to make. | 5/5 |\nAccessibility | It'll take you a while to build Rivendell, so even though it isn't 'complicated,' be prepared for an endurance race. It takes up loads of space, too. | 3/5 |\nInstruction quality | These are easily the best Lego instruction booklets I've ever seen. | 5/5 |\nExtra features | Rivendell is drowning in Easter eggs and hidden details that Lord of the Rings fans should adore. | 5/5 |\n\"If you ask me, Rivendell is one of the best Lego sets. As in, ever. It's a magnificent design that demonstrates everything these kits can be.\" Read more: Lego Rivendell (10316) review\nLoad honorable mentions ↓\nHonorable mentions\nWhy you can trust GamesRadar+\nPremium quality\nThis enormous kit really is one of the most impressive and best Lego sets ever made thanks to its wealth of detail, expansive interior, and numerous minifigures from across the ages. The main downside is its astronomical price.\nIt's magic\nIt's an older and more expensive kit, but this grand rendition of Hogwarts is still one of our favorite sets because of the breath-taking scale and accuracy. The inclusion of microfigures and teeny rooms is a bonus.\nWish come true\nThe Disney World castle is one of the most recognizable landmarks in the world, and it's recreated in perfect detail with this amazing kit. It really does the building justice and adds to it with an interior dedicated to different Disney characters.\nBest Lego sets: Star Wars\nSpecifications\nReasons to buy\nReasons to avoid\nOf the many spaceships flying across a galaxy far, far away, none are more iconic than Han Solo's battered pile of junk. There have been plenty of Millennium Falcon Lego sets before now, but this version of the Corellian YT freighter is much more affordable and easier to display.\nIt still packs an impressive level of detail despite being smaller, though; there's no mistaking its distinctive silhouette, even at a distance.\n✅ You want the most iconic Star Wars ship without breaking the bank: There are other Millennium Falcon sets out there, but this is the most reasonable in price. It doesn't compromise on quality, though.\n✅ You don't have lots of display space: Because this is a smaller kit that won't need an entire table to itself, it'll fit beautifully into most setups.\n❌ You want, or already have, the bigger ones: Even though this is a fantastic kit, the bigger versions obviously boast more detail and come with a host of minifigures to crew them. Want the best of the best? Go for those.\n❌ You're looking for a playset: Any young padawans wanting a toy they can play with will be disappointed with this one – it doesn't come off the stand and is too fragile to be carried around.\nFeatures: This is the smallest of Lego's Millennium Falcon kits at just 921 pieces, but I'd argue that it's the best for most people. For starters, it's not the mammoth undertaking the Lego UCS Millennium Falcon is, nor will it break the bank like that one does. In addition, you won't need a small warehouse to display this thing. It's a reasonable size and won't dominate the space it's in.\nBuild: In contrast to the other Falcon kits, this one isn't going to take you long to construct. You can be showing off your work within a couple of hours, and the process is pretty laid back on the whole. That doesn't mean it isn't satisfying, though. You'll spend a lot of time snapping panels together to make the ship's curves, for example, and the weighty 'click' as you connect them is oddly satisfying.\nIs it perfect? No. Certain portions are fiddly, and the instructions could be a lot clearer – it's not always obvious where you're putting new pieces. But these are niggles in the grand scheme of things. Plus, it gets a lot right; there aren't any stickers in sight, for starters.\nDesign: Even though this is the dinkiest of the four Lego Millennium Falcon sets available at the moment, it's still crammed with detail. As a case in point, there are some welcome but unnecessary Easter eggs which leave an impression precisely because they aren't needed. More specifically, you'll place studs that depict memorable scenes (such as A New Hope's holo-chess game) during the early stages of this build, but they're quickly covered up and never seen again. In much the same way, clever use of 'greebles' lend the kit that recognizably battered look without overcrowding its hull. Lego could have cut corners here, yet it didn't.\nThere are compromises, of course; the set's modest footprint makes that inevitable. There's a weird gap in the cockpit neck, for instance, and it's a shame the cockpit itself doesn't feature plastic windows. You can't display it off the stand, either. But on the whole, this Millennium Falcon achieves a lot in spite of any limitations. It looks fantastic at a distance or up close, and won't dominate your living space like the Ultimate Collector Series or Rise of Skywalker alternatives.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | There's something deeply satisfying about clicking the chassis into place and then covering it in greebles. | 4/5 |\nAccessibility | It's not the hardest Lego set you'll build, nor is it the easiest. There are quite a lot of small and fiddly pieces to contend with, though. | 3.5/5 |\nInstruction quality | The instructions have the thinnest of white lines around the pieces you have to add, so things could be a little clearer. | 3.5/5 |\nExtra features | Like most of the best Lego sets, this kit has lots of hidden details inside (like stud versions of the New Hope crew around the holochess table) that won't ever be seen, so are purely there for the builder's satisfaction. | 4/5 |\n\"Unless you're willing to drop a lot of money and display space, this is comfortably the best Millennium Falcon kit and one of the best Lego Star Wars sets overall. It isn't perfect, but comes pretty damn close – she's got it where it counts.\" Read more: Lego Millennium Falcon (75375) review\nLoad honorable mentions ↓\nHonorable mentions\nBest premium\nWait, that's two mentions for the UCS Falcon in one guide? You betcha. If you have the credits to spare, you'll wind up with one of the most impressive models out there.\nBest cheap\nThis pair of BrickHeadz models is perfect as a gift for loved ones that adore Mando and his super-cute ward, Grogu. Whether it's for display or the toybox, this pair should delight fans.\nFor kids\nAlthough it's a fantastic display piece for adults thanks to its recreation of an iconic scene (plus, it includes a host of awesome minifigs), kids will adore this playset due to the many interactive elements present here.\nBest Lego sets: Harry Potter\nSpecifications\nReasons to buy\nReasons to avoid\nMost of the best Lego sets are conversation starters, but few take that as literally as the Talking Sorting Hat. Push down on the disguised lever to hear it bellow your Hogwarts House at you, with audio taken straight from the movie.\nWhen combined with a classy little stand with plaques for Gryffindor, Slytherin, Ravenclaw, and Hufflepuff, not to mention a minifigure of Harry and a teeny Sorting Hat, this kit is the perfect display piece.\n✅ You want a display piece: If you'd rather something made for display instead of a playset, this is arguably the best Harry Potter kit.\n✅ You want a conversation starter: It's impossible for this set not to impress your guests.\n❌ You'd rather get Hogwarts: If you can only get one Harry Potter kit, and you'd feel glum if you didn't have Hogwarts castle itself, I'd avoid the Talking Sorting Hat.\n❌ You want a playset: As previously mentioned, this is more of a display piece than a playset… even if it is fun to play with.\nFeatures: The main selling point of this kit is right there in the name – it talks. More specifically, it barks out quotes taken directly from the Sorcerer's Stone movie (or Philosopher's Stone, if you're in the UK). It also yells which Hogwarts House you belong in.\nWhile it can be displayed by itself, the Talking Sorting Hat comes with a stand from which to shout its decisions. This features a plaque for each house and a minifigure of Harry from his first year with a little Sorting Hat on his head.\nBuild: This is one of the more straightforward Lego kits I've cobbled together, and it'll only take you an hour or two to finish. Is it slightly tedious to slot in brown block after brown block? Sort of. But there's a thrill in seeing it all come together, and clever yet simple engineering underpins the whole thing.\nDesign: It's always amazing to see how a pile of plastic blocks can look so close to a set's inspiration, and it's no different here. This kit captures the movie version's wonky, battered, and slightly grumpy design perfectly. Even though a few stickers are used to represent patches and stitches, they're mercifully few in number and do a lot to elevate the overall build. The fact that the Talking Sorting Hat's mouth and eyebrows move when you press the top is icing on the cake.\nThe stand is a handsome thing that doesn't overshadow the rest of the set, either; it's a black and gold number with space for each Hogwarts House crest which, thankfully, are printed rather than stickered. When you throw in the Harry minifig (with the adorable little legs!) with his tiny Sorting Hat, this will certainly please fans.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | Because it isn't a massive nor overly complicated kit, you'll have a pretty pleasant time with this one. | 4/5 |\nAccessibility | This is a straightforward build for the most part, but there are some tricky bits when you start working on the inner mechanisms. | 3.5/5 |\nInstruction quality | There are clear red lines surrounding the pieces you have to add, so you won't feel lost. | 4/5 |\nExtra features | You won't find hidden Easter eggs here, but the fact this kit can talk makes it a winner. | 5/5 |\n\"I'd always thought that the Hogwarts kit would be my go-to Harry Potter set, but this is just delightful. It sits in pride of place on my desk.\" Read more: Lego Talking Sorting Hat review\nLoad honorable mentions ↓\nHonorable mentions\nBest display\nThe newer, smaller Hogwarts model is probably a better purchase for most people than its larger cousin, mostly due to the fact it fits on a shelf rather than needing a whole table for display. It's just as accurate and detailed, though.\nBest premium\nIn terms of ambition, I'm not sure any Harry Potter kit comes close to Gringotts. It looks impossible, as if it's about to collapse under its own weight, but the magicians at Lego somehow make it work. It's crammed with detail as well.\nFor kids\nImaginative roleplay is a key component of any set for kids, and Potions Class is arguably best at providing that. It's carrying plenty of interactive little pieces children can use to make their brew, not to mention the likes of Snape and Hermione.\nBest Lego sets: Marvel\nSpecifications\nReasons to buy\nReasons to avoid\nThere are plenty of Avengers-themed kits gracing shelves right now, but few assemble the original six like this. More importantly, it recreates one of the franchise's most iconic shots to display on your shelf or jazz up your kid's toybox.\nThat's because this kit is multitasking. Along with being an interactive set sporting plenty for children to play with (like blasters that fire studs or a bunker Hulk can bust), it's just as good at being a display piece. Transparent pieces hold the Avengers aloft in their iconic poses as they race through the Sokovian forest, giving it kinetic energy despite the minifigures being stock still.\n✅ You want something to display, or for your kids: This set strikes the perfect balance of being a cool display piece whilst also being ideal for kids to play with.\n✅ You're lacking display space: Although bigger and arguably better Marvel kits are out there, they take up a lot of real estate. This is much more manageable.\n❌ You'd prefer the OG Avengers moment: I'm sure we'll eventually get a recreation of that shot in the original Avengers where the team forms a circle to face off against aliens.\n❌ You want a showstopper: This is on the more modest side when it comes to Marvel sets, especially when you take the Sanctum Sanctorum, Avengers Tower, or Daily Bugle into account.\nFeatures: This kit brings us back to a simpler time where the team only has to worry about trickster gods and megalomaniacal robots. Recreating Age of Ultron's opening battle against Hydra, it includes minifigures for all six OG Avengers alongside semi-transparent stands so you can pose them mid-leap.\nIt's not a static piece, though. The blasters held by those Hydra soldiers actually fire, and you can \"Hulk smash\" a plank that hurls the diorama's bunker away.\nBuild: Seeing as it'll only take you two hours or so to build, this is a pretty accessible kit. Although the experience could have been monotonous thanks to the many white and gunmetal pieces, the designers keep switching it up to maintain your interest. I just wish the instructions were clearer.\nBeyond the fiddliness of putting your minifigs on their translucent stands, this is my one complaint.\nDesign: I've got to hand it to team Lego here – this set truly does provide something for everyone. On the one hand, kids will love playing with the core Avengers in their fight against evil thanks to interactive elements. On the other, adults are getting a handsome, dynamic display piece that's instantly recognizable.\nIt's cleverly constructed, too; minifigures are attached to the environment in smart enough ways that you barely notice the stands, and no model obscures another. There's absolutely no wasted space here.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | Putting the minifigures onto the translucent stands can be fiddly, but the build is a satisfying one on the whole. | 4/5 |\nAccessibility | This kit manages to find a balance between complexity and simplicity, but it does provide a challenge here and there. | 4/5 |\nInstruction quality | Unfortunately, most pieces aren't outlined or highlighted in the instruction booklet. This leaves you to play spot-the-difference. | 2/5 |\nExtra features | While you aren't going to find hidden secrets, the Hydra soldiers' blasters fire studs and the bunker can be blown up using Hulk. | 3/5 |\n\"There might be bigger and more impressive sets out there, but this one is arguably the best Marvel kit for most people thanks to how well it balances price with value… and interactivity.\" Read more: Lego The Avengers Assemble: Age of Ultron (76291) review\nLoad honorable mentions ↓\nHonorable mentions\nBest premium\nIt's big and oh boy is it expensive, but you won't find a better premium Marvel kit. With multiple stories stuffed with references to the films alongside an army of minifigures drawn from across the Infinity Saga, this is a sight to behold.\nBest display\nIs there a more infamous glove in all of cinema? I doubt it. The Infinity Gauntlet that snapped away half of all life in the MCU is downright iconic, making it the perfect display piece for fans.\nFor kids\nBecause it includes many beloved heroes from the Infinity Saga, an airport to battle over, and a showstopper in the form of Ant Man's giant form, this ode to Civil War is a fantastic kid's playset - its begging for you to join in the fight.\nBest Lego sets: Super Mario\nSpecifications\nReasons to buy\nReasons to avoid\nI've got a lot of time for showstopper kits like The Mighty Bowser, but sometimes all you need is a plucky little Piranha Plant like this. Mario's iconic foe looks perfect in brick form, and it's oozing character despite being just nine inches high.\nWhile it won't do much good as a toy for kids, grown up fans should look no further than this display piece. It says a lot that numerous members of the GamesRadar+ team snapped it up right away.\n✅ You want an affordable Mario set for adults: The Piranha Plant's middle-of-the-road pricing is greatly appreciated after expensive kits. It's designed as a display piece too, not a playset.\n✅ You want a small but eye-catching display piece: This will look fantastic on a shelf or desk.\n❌ You're looking for a kids' playset: Your Piranha Plant is liable to break if played with, so it's not a good fit for children.\n❌ You want a centerpiece: Got your eye on Mighty Bowser or the Mario and Kart set? This won't impress as much as those would.\nFeatures: This kit is a bit like Lego The Child in that it's an interactive character designed to go on a desk or your shelf. The Piranha Plant's head, mouth, and leaves can be posed as well, providing a touch more ownership over how it looks.\nAside from that, there are also some hidden Mario coins that can be put into a secret compartment, piggy bank-style. It's a cool touch that wasn't necessary, but is appreciated nonetheless.\nBuild: As a small-scale project without too much in the way of technical parts, the Lego Piranha Plant isn't going to tax you. In other words, it's ideal for anyone coming back to – or getting into – Lego as an adult.\nThe instructions aren't too bad either thanks to yellow lines surrounding pieces, and I enjoy the timeline that shows off this memorable enemy through the ages.\nDesign: I adore this cheeky chappy. Even though the set isn't very big, it's full of charm and personality. Just tilting the head to one side can imbue it with character.\nI'm impressed with how well a monster built largely of curves translates into Lego, too. This doesn't feel like a rough, best-effort approximation of a Piranha Plant; it's a faithful recreation even non-Lego fans will be happy to have on display at home.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | This is an easy-going process that won't take you all that long. | 5/5 |\nAccessibility | If you're returning to Lego after years away or are new to the for-adults range, this is the perfect entry-point. | 5/5 |\nInstruction quality | The instructions here are pretty easy to follow and feature a fun look back at the Piranha Plant's history. | 4/5 |\nExtra features | Being able to pose your Piranha Plant, along with the secret compartment, adds to the overall experience. | 4/5 |\n\"The Lego Piranha Plant is a relatively simple build, but one that snaps with personality once it all comes together. Those 500 pieces all work particularly hard in both value and impact on the overall figure, with each stud contributing to the finished product. Surprisingly large for its price, and with its own hidden secrets, this is a must-have for Mario fans.\" Read more: Lego Piranha Plant review\nLoad honorable mentions ↓\nHonorable mentions\nBest premium\nThe King of the Koopas has his own, enormous Lego kit, and he's never looked better. This for-adults display piece shows off Bowser in all his glory with posable arms, eyes, mouth, and tail. In a neat touch, he can even shoot fire from his jaws.\nBest display\nIf you've been a fan of the moustachioed plumber since the SNES era, you'll be hard-pressed to find a better Mario display piece. Besides capturing the blocky look of Super Mario World perfectly, it actually moves if you crank the handle.\nFor kids\nSometimes, simple is best. This beginner box is the only way to get the interactive Mario figure, and he's the lynchpin of the entire range. The kit also has a starter course for kids to make, along with a couple of foes such as Bowser Jr.\nBest Lego sets: Animal Crossing\nSpecifications\nReasons to buy\nReasons to avoid\nOf all the Animal Crossing sets weighing down shelves right now, this might be our favorite. It's a tough decision because they're uniformly cute as a button, but Isabella's House Visit pips the others to the post. This kit is everything you'd want from an adaptation; it's instantly recognizable, features a couple of beloved characters, and hides lots of references to the video game series.\nCrucially, it's perfect for display or play. Regardless of whether you're buying it to go on your shelf or into your kid's toybox, you won't be disappointed.\n✅ You want an iconic set without forking out too much: This kit recreates one of the memorable Villager houses with a couple of well-known characters in tow, so it's a good choice if you want something very 'Animal Crossing' without needing to drop a small fortune on something like Nook's Cranny or the Museum.\n✅ You don't have a lot of display space: Because it's relatively small, Isabelle's House Visit is ideal for those without a lot of room to show sets off.\n❌ You're expecting the full house: Like most Animal Crossing kits, this is a facade that can be turned around to reveal the building's rooms – it isn't the full thing.\n❌ You'd prefer a bigger, more impressive set: It's affordable, but Isabelle's House Visit isn't as eye-catching as the other, bigger models.\nFeatures: Although it plays host to Isabelle herself and Fauna the deer, this kit recreates the default Villager house players are given in each game (complete with some scenery like one of the famed fruit trees to go outside).\nMuch like other Animal Crossing models, Isabelle's House Visit acts like a dollhouse; it's a facade that can be flipped round to reveal the interior, which in this case features a bed, table, cooker, clock, and decorations. The latter includes tools and other items players should recognize.\nBuild: Seeing as it's a relatively small build, it shouldn't take you long to make Isabelle's House Visit. We were able to put it together in around an hour during our own testing, so it's a great option if you're short on time. It's not phenomenally complicated either, which makes it a great choice to build with your kids or for anyone that's new to Lego.\nDesign: There's a Spring-like cheeriness to this Lego set that's present in all Animal Crossing kits, and just looking at it is an instant mood boost. Whether it's the vivid colors, happy-go-lucky minifigures, or delightfully sweet array of tools and household items, Isabelle's House Visit is downright adorable.\nIt's home to many game references, too. While those tools are an obvious one, look closer and you'll find one of the design cards with an acorn on the front, a K.K. Slider poster, and more.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | If you want a chilled-out time, it doesn't get much better than this. The only downside is pieces that can't be fixed in place so sit loose. | 4/5 |\nAccessibility | No matter whether you're returning to Lego after a long time away or are building with your children, this is a great entry point to the hobby. | 5/5 |\nInstruction quality | The instructions are well done and should be straightforward enough for most people. | 4/5 |\nExtra features | It may not be as feature-rich as other, more expensive kits, but there are plenty of cute game references strewn across the model. | 4/5 |\n\"Isabelle's House Visit is the perfect Animal Crossing Lego set. Not too expensive, not too huge (so is ideal for your shelf), and absolutely encapsulates my experience with New Horizons through those long lockdown months. The attention to detail is just spot on too.\" Read more: Lego Isabelle's House Visit (77049) review\nBest Lego sets: Retro\nSpecifications\nReasons to buy\nReasons to avoid\nIf there's a Lego set that deserves a hero's welcome with herald's trumpets and pageantry, it's this one. The Lion Knights' Castle is a throwback to classic kits from decades past, and it combines that nostalgia with modern advancements for the ultimate project… no matter whether you're new to Lego or a veteran of countless brick-based builds.\nThere's no denying that it's expensive. However, you're getting a lot of Lego goodness for your money here (including more minifigures than most sets combined). It is, in a word, magnificent.\n✅ You had the original: For those of you that owned the original Lego castles, it'll be nostalgia in brick form. This stronghold more than honors the sets that inspired it.\n✅ You're a Middle-Ages aficionado: Love visiting castles? Enjoy binging Lord of the Rings, D&D, or Game of Thrones? This is catnip for medieval / fantasy fans.\n❌ You still have one of the original Lego castles: If you've got an OG Lego castle at home, this will obviously feel a bit redundant. It makes quality-of-life changes and features new minifigures, of course, but is an ode to those sets of old nonetheless.\n❌ You're short of space: Like many of the best Lego sets, this one is suitably enormous. It can be a bit of a struggle to display, so bear that in mind before you hit the checkout.\nFeatures: Think of this set like a revival rather than a reboot. It shares a lot of DNA with the 1984 King's Castle, but builds upon it with modern advances. There's an army of 22 minifigures included within the box as well.\nBuild: This set is sizeable, but don't worry - it's not difficult to construct (aside from a drawbridge that may take a few goes to position correctly, anyway). Just because it's simple to put together doesn't mean it isn't clever, though. As per Rivendell, there are cunningly recycled elements used throughout the build.\nDesign: Crammed with hidden nooks and charming details (including a fun Easter egg for the 1978 'Yellow' Castle), this is the sort of project that's just as much fun to look at after it's finished as it is to build. The fact it can be displayed as a sprawling facade - allowing you to peek inside its many rooms and cubby-holes - or as a 'complete' building is another feather in its medieval cap.\nIn addition, there's a charming sense of narrative laced through every brick. Whether it's the varied army of minifigs or lived-in details for each room (including a medieval toilet, complete with a sponge on a stick…), there's very clearly a story being told here. Discovering it as you build or after the castle is finished will delight all but the most cold-hearted soul.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | The wealth of Easter eggs and clever design choices make construction a joy. | 5/5 |\nAccessibility | This is a mighty task even for experienced builders. | 3.5/5 |\nInstruction quality | Thanks to clear examples and plenty of history to make fans feel misty-eyed, the instructions for Lion Knights' Castle strike a chord. | 4.5/5 |\nExtra features | There are more references, hidden details, and secret nooks than I've got time to discuss here. | 5/5 |\n\"The Lego Lion Knight’s Castle is one of my favorite Lego sets to date. It’s a glorious ode to the Lego castles of the '70s and '80s, and I can hardly think of a better way to celebrate Lego’s 90th anniversary. It’s a huge, gorgeous set, with a veritable army of classic-looking minifigs and a sublime interior, complete with a tiny cameo of the 1978 ‘Yellow’ Castle (375) that started it all. When I played with smaller Lego castles as a child, this impregnable Norman keep was the structure in my mind’s eye. But even putting nostalgia to one side, it should be near the top of every Lego fan’s wishlist.\" Read more: Lego Lion Knights' Castle review\nLoad honorable mentions ↓\nHonorable mentions\nBest ship\nThis throwback is inspired by the 1987 model of the same name, but improves on the formula in almost every respect. Whether it's a sleeker body, more detailed panels for the cockpit, or a beefed up buggy, the new Blacktron is flying high.\nRoll out\nThe kit may be relatively new, but it recreates the original version of Optimus Prime from the 1980s cartoon. Lego is the perfect medium to create the Transformer; its blockiness and stark edges work well with Autobots and Deceptions alike.\nBest cheap\nPolaroid cameras have really come back around in popularity, so it's fitting that a Lego version of the beloved device is on the cards too. Along with that instantly-recognizable design, this one features Lego photos. Delightful.\nHow to choose Lego\nThere are more kits these days than anyone could know what to do with, and shopping for the best Lego sets is overwhelming as a result. Not sure where to start, or put off by the countless options? Don't worry, the GamesRadar+ team can help. We've covered sets for years now and have been Lego fans since childhood, so know a thing or two about choosing the right one for you.\nHere's what we'd recommend when hunting down Lego:\n👪 Who are you buying for?\nIt may feel like an obvious question, but asking who you're buying for will help you hone in on the right kit. If you're shopping for a child, prioritize playsets (typically featuring lots of interactive elements) with a younger age-rating that promise imaginative roleplay. If you're shopping for grown-ups, take a look at models rated 18+. These are meant for display rather than play and will usually be more complex on the whole. That's not a one-size-fits-all classification because some kits are great for both audiences, but it's a start.\n🤩 What are you a fan of?\nThere are countless sets based on franchises nowadays from Star Wars to Wicked, so the first thing you should do after deciding who you're shopping for is deciding what you like. Chances are, you'll find a suitable kit from Lego. There are actually well over 20 brands recreated in brick form now, from Harry Potter to Gabby's Dollhouse.\n📐 How much display space do you have?\nThis may be the most important question to answer if you're buying a for-adults set; they can be pretty sizable. Make sure you check the dimensions before clicking 'buy' to avoid disappointment, because many of these models can be big.\n🕜 How long are you willing to spend building?\nThe coolest kits can take a long time to build, so take a look at the estimated time below each entry on this page to get an idea of what you're signing up for. Rivendell took me more than a dozen hours over several evenings, for instance, so wouldn't suit those short on time.\n🏓 Is it going to be played with?\nSome Lego sets aren't made for children (honestly, I'm not just making that up) so won't hold up to play. As a case in point, Optimus Prime has a habit of coming apart at the waist if he's manhandled. Bear that in mind before buying something for your little one, or it's a one-way ticket to frustration.\nHow we test Lego\n- We've written dozens of Lego reviews\n- Our team has reported on Lego for more than six years\n- We visit toy conventions & events each year\nIt's our honor and privilege to test Lego and let you know which sets are worth buying, so we take the matter very seriously.\nTo start with, the GamesRadar+ experts (who have years of experience between them) won't ever recommend a product that they wouldn't be happy buying themselves with their own money. The cost of living is tightening purse-strings everywhere, after all, so knowing what is worth the cash comes in very handy.\nWe approach each listing on this page with distinct sections to help you understand what a kit is like quickly and easily. This includes:\n- Introduction: Our writers and I give you the basics here alongside 'buy if/don't buy if' breakdowns. This provides a TL;DR cheatsheet on whether a kit is worth your time.\n- Features: You'll find the set's elevator pitch here. What does it do differently, and are there any alternatives?\n- Build: What is the kit actually like to construct? Details on the build experience are found in this section, usually with notes on how long the set took to put together based on our first-hand experience.\n- Design: You'll find our thoughts about the look of the finished model here, with any highlights or drawbacks listed clearly.\nOnce that's done, our team uses a clear and easy-to-read ratings table. This breaks the set's individual elements down. Here's an example of what that looks like.\nCriteria | Notes | Score |\n|---|---|---|\nBuild experience | How fun is it to put the kit together? | ?/5 |\nAccessibility | Is it easy to make? | ?/5 |\nInstruction quality | Are the instructions good, bad, or somewhere in the middle? | ?/5 |\nExtra features | What extras are hiding away in there? | ?/5 |\nIf you're curious to know more about our testing process here, be sure to check in on the full GamesRadar+ review policy. This provides details on how we write reviews for all kinds of products.\nCurrently testing\nWe're always making something here at GamesRadar+ HQ, whether it's for review or just for fun. So what are the team and I building this month? Here are our current projects:\nLego Great Deku Tree | View at Lego\nMy current project is this Legend of Zelda set that I've been eagerly awaiting for months. I'm a massive fan of the franchise and have played it since the days of Link to the Past, so any Lego kit taking us to Hyrule is a must-have in my eyes. I'm about a third of the way through at the time of writing (toward the end of July), and have already put Young Link's treehouse on display in my home office. Thus far, it's reminding me of Rivendell with its numerous asides within the instructions - always a good sign.\nBest Lego sets: FAQ\nWhat is the best Lego set of all time?\nIf I had to crown just one kit, it would either be Lego Rivendell - which has the top spot on our list of the best Lego sets overall - or the Ultimate Collector Series Millennium Falcon. The former looks beautiful, but hits the spot because it combines very clever engineering with a smart repurposing of pieces to serve different functions (those chair arms are hot dogs from old kits, for instance). It's also crammed with hidden secrets and cute little scenes, wrapped up in fan service strewn throughout the instructions.\nAs for the Falcon, it's a similar story. This is a phenomenally well-made model and brings to life one of cinema's most iconic ships in painstaking detail.\nWhich Lego sets are good for adults?\nFor those of us that are eager to get into grown-up Lego but don't know where we should start, check out the company's dedicated page. It features a wealth of options that will challenge and entertain you in equal measure. The Technic and Ultimate Collector ranges are great examples.\nI'd recommend starting small, though. Namely, it's worth checking out builds from the 'helmets' line like The Mandalorian or Luke Skywalker's Red Five helm. They're relatively simple yet awesome display pieces that aren't too overwhelming to construct. They don't take up loads of space either, making them easy to find a home for on your desk or shelf.\nWhat is the best Lego set to start with?\nIf you're looking to kick off your Lego journey, there are a couple of kits we'd point you toward. First, though, we've got to work out what you need. Are you buying for a child? If so, it'll depend on how old they are - and their interests. Young tots would do well with either the Classic range (which is essentially a box of bricks for them to do whatever they want with) or the bigger, more toddler-friendly Duplo, while kids that love to dress up as Elsa and co. should look at the Disney range.\nAs for adults, it depends what they're into - but the Botanicals series is a great entry-point. These look incredible on display but aren't a headache to construct. As for something more themed, I'd gravitate toward kits that are relatively small but rated 18+ like the Millennium Falcon, Architecture pieces, Star Wars helmets, or Book Nooks. These are simple but impressive when finished, and the latter models are particularly good for quick, satisfying results.\nWhich Lego sets should I look forward to in 2025?\nWith new kits hitting shelves each and every month, there's always something new you can look forward to when it comes to the best Lego sets. Because browsing the release schedule is a bit like staring down an avalanche, here are the kits I'd suggest keeping an eye out for.\nLego Transformers Soundwave | View at Lego\nWe already had a few Autobot kits on shelves, and these are great... but where have the Decepticons been hiding? Here's our answer. One of the coolest, most '80s Transformer ever is on his way to the Lego collection this August, and it looks fantastic.\n📆 Release date: August 4, 2025\nLego Haunted Mansion | View at Lego\nNot to be confused with the Disney ride or movie, this model is a 3-in-1 kit that can be made into the titular spooky house, a ghostly galleon, or a ghost train. It's more than enough to get me in the Halloween mood, so it's getting a shoutout here.\n📆 Release date: August 1, 2025\nLego Super Mario Prince Florian & Castle Bowser | View at Lego\nI've got a lot of fond memories playing couch co-op on Super Mario Wonder, and this set is pulled straight from the game. It's bizarre and delightful in equal measure. I'd love to see more kits based directly on the video games, so I can't ignore this one.\n📆 Release date: August 1, 2025\nLego Animal Crossing Blathers's Musuem Collection | View at Lego\nOf all the Animal Crossing kits I've seen so far, this is the first one that's made me go \"I need it right now.\" Blathers is one of my favorites, as is hunting down exhibits for his museum, so until my boy Brewster gets a model, this is getting my nod of approval.\n📆 Release date: August 1, 2025\nLego One Piece The Baratie Floating Restaurant | View at Lego\nThere are some great One Piece kits on the way, but the one that impresses me most is this monster kit. It's such a visually interesting design that immediately makes me want to explore and see what secrets I can find inside. For me, that's the sign of a great Lego set.\n📆 Release date: August 1, 2025\nLego Game Boy\nAlthough we don't know what it'll look like yet beyond a glimpse of the buttons, the fact that a Lego Game Boy is on its way was enough to make me lose my damn mind when it was revealed earlier this year. Keep an eye out for this one in October.\n📆 Release date: October, 2025\nThe best Lego sets to come out in 2025 so far\nHundreds of Lego sets arrive each and every year, but which of those can be considered the 'best?' The GamesRadar+ team and I spend a lot of time each month covering all the kits being released, and we always have opinions about them. These are our favorites so far, from January to now.\nLego How to Train Your Dragon: Toothless | View at Lego\nIs there a more adorable Lego set? I'm not sure there is. This Toothless model (released to tie in with the new live-action movie) is as cute as a goshdarn button, and I can see it selling like hotcakes. I'd be surprised if it wasn't under a lot of Christmas trees this Holiday season.\n📆 Released in: July, 2025\nLego Nike Dunk | View at Lego\nIf you're into your fashion, this should immediately be on your radar. Nike brought out a Lego trainer (non-wearable, I'm afraid) in 2025, and the design is straight fire. It's a fun display piece or gift for the Nike fans in your household.\n📆 Released in: July, 2025\nLego The Simpsons Krusty Burger | View at Lego\nAs a lifelong Simpsons fan that could probably spend the best part of a day quoting old episodes, I was psyched to see an all-new Lego kit based on the franchise for the first time in... well, years. Honestly, I don't know what took Lego so long to bring this back.\n📆 Released in: June, 2025\nLego Book Nook: Hogwarts Express | View at Lego\nThe new Book Nook range that Lego's started has been one of the best in a long time; it's a neat idea that's also refreshingly novel. My favorite of the bunch would have to be the Hogwarts Express, as it feels perfect for the long and narrow format. It really does feel like you've got a little window into a scene.\n📆 Released in: June, 2025\nLego Star Wars Jango Fett's Firespray-Class Starship | View at Lego\nIt was tricky choosing just one kit from May's release schedule, but if we had to only select a single entry, it'd be this. The Firespray hasn't been seen in Lego form for years, and this Ultimate Collector Series version does that legacy justice with a model that's as intricate as you'd hope.\n📆 Released in: May, 2025\nMario & Standard Kart | View at Lego\nThis is a kit I honestly didn't expect to work (there are way too many curves to Mario for it to work as a Lego model, surely), but I'm happy to eat my words. Mario has never looked better than he does here, and it's a fabulous nod to the plumber that'd go nicely with Mighty Bowser and the Piranha Plant display kits.\n📆 Released in: May, 2025\nLego The Lord of the Rings The Shire | View at Lego\nThis kit had been rumored for a long time, so it was great to finally go over hill and under hill to build Bag End in all its glory. Although it's smaller than the previous Lord of the Rings kits and your mileage on the neon green grass pieces may vary, there's no denying that it's an eye-catching kit with oodles of detail.\n📆 Released in: April, 2025\nHogwarts Castle: The Main Tower | View at Lego\nIt's taking time, but Lego's attempt to make a full, minifigure-scale Hogwarts is coming to fruition. This is by far the most impressive kit of the bunch to date, with numerous iconic locations squirrelled away inside the most distinctive part of the castle.\n📆 Released in: June, 2025\nLego Twilight The Cullen House | View at Lego\nThis ode to the the big-screen vampire saga caught plenty of us off guard thanks to its sudden announcement, and the build is certainly impressive. A wealth of Easter eggs and plenty of minifigures (to say nothing of a werewolf...!) made this February's standout kit by a mile.\n📆 Released in: February, 2025\nLego Jurassic World Dinosaur Fossils: Tyrannosaurus rex | View at Lego\nThe Jurassic World fossil head display pieces have been going down a treat over the past year, so it was probably just a matter of time until a full-on skeleton hit shelves. The result is tremendously impressive, looks magnificent on display, and comes with some fan-favorite minifigures too.\n📆 Released in: March, 2025\nLego Mario Kart Baby Peach & Grand Prix Set | View at Lego\nThe Lego Super Mario range has always been a favorite of ours, and the addition of Mario Kart double dash's down on what makes it so special - the baked-in interactivity, and the way it encourages you to create your own courses. The Grand Prix was the centerpiece of this first wave, and it gave 2025 a good start.\n📆 Released in: January, 2025\nWhat is Lego's best-selling set?\nEven though it's hard to say exactly what the best-selling Lego set is without breaking into the company's accounts, we wouldn't be surprised to find that the winner is from a major franchise. More specifically, Star Wars and Harry Potter kits dominate Lego's own bestsellers page. These fan-favorites create a lot of buzz... and understandably so.\nHowever, it's not all about pop-culture. Recreations of world monuments are always popular too, and vehicles (including those in the Technic range) have an enormous following. In fact, cars and ships make up more than a dozen entries on the bestsellers list we mentioned above.\nIt's entirely possible that something simple like the Classics Bricks and Animals pack beats the competition, though. This tried-and-tested option offers a wealth of building materials for your own designs, so it's perfect no matter whether the customer is a child or master builder.\nWant some present ideas? Be sure to drop in on these must-have gifts for gamers. As for more toys, don't miss the best Nerf blasters or the best water guns.\nWeekly digests, tales from the communities you love, and more\nI've been writing about games in one form or another since 2012, and now manage GamesRadar+'s tabletop gaming and toy coverage. You'll find my grubby paws on everything from board game reviews to the latest Lego news."
    }
  ],
  "argos_summary": "The author laments the poor quality of the Metal Gear Solid Delta Snake Eater collector’s edition statue, calling it a jank, and warns readers to only buy statues from reputable manufacturers like Good Smile Company or Banpresto. He shares personal experiences with other collector’s editions, praising those with high‑quality figures and noting the rare exception of Death Stranding 2’s 15‑inch Magellan Man statue supervised by Yoji Shinkawa. The piece advises researching the maker before spending over $200 on a collector’s edition to avoid low‑quality replicas.",
  "argos_id": "V48KJOXGZ"
}