{
  "url": "https://www.foxnews.com/politics/dem-squad-member-lashes-out-pro-israel-movement-fiery-speech",
  "authorsByline": "Peter Pinedo",
  "articleId": "5289c4b61d1d4bbca1557590026561ae",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/931/523/AP23310718061139.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T09:41:10-04:00",
  "addDate": "2025-09-03T13:52:32.979794+00:00",
  "refreshDate": "2025-09-03T13:52:32.979796+00:00",
  "score": 1.0,
  "title": "House Dem lashes out at pro-Israel 'motherf---ers' during fiery speech: 'We ain't going anywhere'",
  "description": "Democratic Squad member Rep. Rashida Tlaib, D-Mich., unleashed on the U.S. and pro-Israel politicians in a fiery, expletive-filled speech at pro-Palestinian conference.",
  "content": "Democratic member of \"the Squad,\" Rep. Rashida Tlaib, D-Mich., unleashed on the United States and pro-Israel politicians in a fiery, expletive-filled speech at the \"People’s Conference for Palestine\" in Detroit on Sunday.Tlaib, who is the first person of Palestinian descent to be elected to Congress, railed against Israeli leaders and supporters of Israel, shouting, \"I want to say to all of them, every genocide enabler, look at this room motherf---ers, we ain’t going anywhere.\"  \"They thought they could rape us, kill us, violently uproot us from our olive tree farms, starve our children to death, and we would disappear. Well, guess what, now we’re in Congress, and we’re in every corner of the United States,\" she said, adding, \"We are just getting started.\"Tlaib also drilled into the United States as an \"empire in Washington, D.C.,\" saying, \"the political structures that I have to work in, that we all are surrounded by, was built on slavery and genocide and rape and oppression.\"AOC CAMPAIGN DENIES LINK TO WOMAN CHARGED WITH 'TERRORISTIC THREAT' AGAINST SCHOOL OVER JEWISH STUDENTSTaking aim at the Trump administration, Tlaib claimed that \"what’s been tested on the killing fields of Gaza is already being deployed right here in the streets of America.\"\"What our government is willing to do to Palestinians, they are willing to do to all of you,\" she asserted. \"It is no surprise to me, as the daughter of Detroit, that I see our government, that has supplied the bombs and excuses Israel from destroying literally every single day hospitals, communities in Gaza, and manufacturing mass starvation, is also the same government that’s defunding healthcare and food assistance programs here in our country.\"\"Gaza is the compass in this country,\" said Tlaib.Tlaib previously came under bipartisan criticism after sharing a video on social media that included the phrase \"From the river to the sea,\" a pro-Palestinian liberation slogan.'SQUAD' MEMBERS 'DECIDE TO LIE AND TWIST FACTS' ABOUT ISRAEL'S HISTORY, SAYS PROMINENT ARAB ACTIVISTIn 2023, the House of Representatives voted to censure Tlaib for anti-Israel comments made in the wake of the Jewish nation's war against Hamas. The People’s Conference for Palestine, organized by a dozen pro-Palestinian groups, began Friday and ran through Sunday. Even before it started, the event drew scrutiny for featuring speakers with extremist views, including two former prisoners of Israel released in a Hamas deal.The conference opened on Friday afternoon with an elaborate ceremony, in which a speaker, after leading the crowd in chants, invited attendees to rise for \"our national anthem\" as a band began playing a song in a foreign language. People wearing keffiyehs proceeded in, holding Palestinian flags.During a panel at the conference, another speaker, Sachin Peddada, a Ph.D. student in economics and research coordinator at Progressive International, called the U.S. \"evil\" and repeatedly ripped on the country as an \"empire\" motivated by greed.'SQUAD' ERUPTS IN FURY AS TRUMP TAKES BOLD ACTION AGAINST IRANIAN NUCLEAR THREATPeddada urged the pro-Palestinian movement to \"destroy the idea of America in Americans’ heads so that they can see the humanity of everybody outside the warping of American exceptionalism and imperialism and all these evil things.\"  \"To obfuscate that point or beat around the bush there does not serve us; we live in an evil country, that’s just what’s happening,\" he said as the crowd broke into applause.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/us",
    "https://www.foxnews.com/world/squad-members-decide-lie-twist-facts-about-israels-history-says-prominent-arab-activist",
    "https://www.foxnews.com/video/6378272209112",
    "https://www.foxnews.com/category/politics/the-squad",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/category/us/detroit",
    "https://www.foxnews.com/category/politics/house-of-representatives",
    "https://www.foxnews.com/politics/squad-erupts-fury-trump-takes-bold-action-against-iranian-nuclear-threat",
    "https://www.foxnews.com/category/person/donald-trump",
    "https://www.foxnews.com/us/aoc-campaign-denies-link-woman-charged-terroristic-threat-against-school-jewish-students",
    "https://www.foxnews.com/politics/house-votes-censure-rashida-tlaib-over-anti-israel-comments",
    "https://www.foxnews.com/politics/meet-radical-anti-israel-activists-joining-squad-dem-tlaib-detroit-confab",
    "https://www.foxnews.com/politics/pro-palestinian-conference-panelist-calls-us-evil-urges-destroying-idea-america",
    "https://www.foxnews.com/category/world/world-regions/israel"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "pro-Palestinian",
      "weight": 0.09041881
    },
    {
      "name": "pro-Israel politicians",
      "weight": 0.08135653
    },
    {
      "name": "anti-Israel comments",
      "weight": 0.07074521
    },
    {
      "name": "Palestinian descent",
      "weight": 0.061500598
    },
    {
      "name": "Rep. Rashida Tlaib",
      "weight": 0.061426956
    },
    {
      "name": "Rashida Tlaib",
      "weight": 0.06022045
    },
    {
      "name": "Palestinian flags",
      "weight": 0.05910957
    },
    {
      "name": "Palestinian",
      "weight": 0.058094233
    },
    {
      "name": "a dozen pro-Palestinian groups",
      "weight": 0.05631964
    },
    {
      "name": "Tlaib",
      "weight": 0.056225482
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8857421875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.8212890625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.4345703125
    }
  ],
  "sentiment": {
    "positive": 0.054640025,
    "negative": 0.75760424,
    "neutral": 0.18775569
  },
  "summary": "Democratic Rep. Rashida Tlaib, the first person of Palestinian descent to be elected to Congress, delivered a fiery speech at the \"People’s Conference for Palestine\" in Detroit. She accused Israeli leaders and supporters of Israel of being \"genocide enablers\" and accused the United States of being an \"empire in Washington, D.C.\" The conference, which was attended by speakers with extremist views, was criticized for featuring speakers with extreme views, including two former prisoners of Israel released in a Hamas deal. In 2023, the House of Representatives voted to censure Rep. R.Tlaib for anti-Israel comments made during the Jewish nation's war against Hamas.",
  "shortSummary": "Rep. Rashida Tlaib criticized Israeli leaders and politicians in a fiery speech at the \"People’s Conference for Palestine,\" calling them \"genocide enablers.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b2104ad612124ab9bbac6c0cbeb9e189",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/us",
      "text": "Senate 1 min ago 'English isn't optional': Senate GOP bill takes aim at illegal immigrant truckers after Florida crash Sen. Ashley Moody threatens federal funding for states that don't enforce English proficiency requirements for commercial driver's licenses following death of three in Florida.\nU.S. 4 mins ago Kentucky athlete who allegedly hid dead newborn in closet once posted about wanting babies An athlete at the University of Kentucky accused of hiding her dead newborn baby inside a closet once dreamed of becoming a mother, according to a social media post.\nTravel 9 mins ago High tourist tax in Hawaii designed to raise funds for climate change challenged by lawsuit The Cruise Lines International Association filed a lawsuit challenging Hawaii's \"Green Fee\" bill that will raise tourists' hotel taxes to 11% for climate mitigation funding.\nVIDEO 42 mins ago Chicago business owners react to Trump’s crime crackdown announcement FOX Business correspondent Kelly Saberi has the latest on Chicago business owners’ responses to President Donald Trump’s crime crackdown; then the ‘Fox & Friends’ co-hosts discuss.\nHomeland Security 43 mins ago New ICE detention facility 'Louisiana Lockup' opens at notorious prison ICE opens \"Louisiana Lockup\" at Angola prison to detain criminal illegal migrants, including murderers, rapists and gang members, as part of deportation efforts.\nVIDEO 47 mins ago New Louisiana migrant detention center opens Fox News correspondent Brooke Taylor has the latest on a new migrant detention center opening in Louisiana on ‘America’s Newsroom.’\nHealth 52 mins ago Viral wellness trend has customers paying $130 for professional back scratches Professional back-scratching therapy gains popularity in Miami, as Scratcher Girls promotes mood-enhancing relaxation services despite mixed reactions.\nThe Squad 1 hour ago House Dem lashes out at pro-Israel 'motherf---ers' during fiery speech: 'We ain't going anywhere' Democratic Squad member Rep. Rashida Tlaib, D-Mich., unleashed on the U.S. and pro-Israel politicians in a fiery, expletive-filled speech at pro-Palestinian conference.\nVIDEO 1 hour ago Police searching for suspected wedding crasher The man is accused of stealing approximately $60,000 in cash and checks from a California wedding. (Credit: Nadeen Farahat)\nJeffrey Epstein 1 hour ago Epstein victims set to break silence amid bipartisan push to release files: 'People are going to be outraged' Bipartisan lawmakers advocate for transparency in Epstein case as victims prepare to speak publicly for first time, demanding accountability for powerful men involved in abuse."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    },
    {
      "url": "https://www.foxnews.com/politics/house-votes-censure-rashida-tlaib-over-anti-israel-comments",
      "text": "The House of Representatives has voted to censure Rep. Rashida Tlaib, D-Mich., in a 234 - 188 vote on Tuesday night.\nThe punishment, while largely symbolic, was a formal public rebuke of her most recent anti-Israel comments made in the wake of the Jewish nation’s war against terror group Hamas.\nTwenty-two Democrats voted with 212 Republicans to censure Tlaib. Four GOP lawmakers voted against the measure. Four lawmakers voted present. The measure was introduced by freshman Rep. Rich McCormick, R-Ga., on Monday.\n\"If this is not worthy of censure, what is? When you can call for the annihilation of a country and its people, if that’s not worthy of a censure, what is?\" McCormick said on the House floor Tuesday.\nIn the text of his resolution, the Georgia Republican accused Tlaib of \"promoting false narratives regarding the October 7, 2023, Hamas attack on Israel and for calling for the destruction of the state of Israel.\"\nTlaib, the only Palestinian American in Congress, has come under bipartisan criticism after sharing a video on social platform X that included the phrase \"From the river to the sea,\" a pro-Palestinian liberation slogan.\nHer critics have pointed out that the rallying cry implicitly calls for the destruction of Israel as a state. Hamas has also co-opted the phrase.\n\"It is fundamentally a call for a Palestinian state extending from the Jordan River to the Mediterranean Sea, territory that includes the State of Israel, which would mean the dismantling of the Jewish state,\" the Anti-Defamation League’s website says. \"It is an antisemitic charge denying the Jewish right to self-determination, including through the removal of Jews from their ancestral homeland.\"\nTLAIB ACCUSES BIDEN OF SUPPORTING ‘GENOCIDE’ OF PALESTINIANS, WARNS: ‘WE WILL REMEMBER IN 2024’\nTlaib has remained unrepentant over her use of the phrase.\n\"It is important to separate people and governments,\" she said on the House floor earlier in the day. \"The idea that criticizing the Israeli government is antisemitic sets a dangerous precedent.\"\nCLICK HERE TO GET THE FOX NEWS APP\nThe House voted to advance McCormick’s resolution earlier on Tuesday, when a vote to kill the measure was defeated 208 to 213, with one lawmaker voting \"present.\"\nA resolution to censure Tlaib, brought by Rep. Marjorie Taylor Greene, R-Ga., failed to advance to a vote last week."
    },
    {
      "url": "https://www.foxnews.com/world/squad-members-decide-lie-twist-facts-about-israels-history-says-prominent-arab-activist",
      "text": "Members of the \"Squad\" are undermining coexistence between Arabs and Jews in the Middle East, Israeli-Arab activist Yoseph Haddad told Fox News Digital.\n\"Representatives of the Squad are trying to harm the coexistence and partnership that exist in the region between Arabs and Jews,\" Haddad said. \"I think it was [Alexandria] Ocasio-Cortez herself who said she had no idea about the geopolitics of this region—she’s right. Ilhan Omar and Rashida Tlaib know exactly what’s going on here, but they decide to lie and twist the facts.\"\nHaddad, the CEO of Together Vouch for Each Other — an organization founded in 2018 by young Israeli Arabs to bridge cultural and religious divides — has emerged as a prominent voice in Israel’s public diplomacy efforts following Hamas’ Oct. 7, 2023 massacre.\nSince the attack, Jewish communities across the United States and Europe have faced a sharp rise in antisemitic incidents, with pro-Hamas demonstrations appearing on college campuses as early as October 8.\nLAWSUIT ALLEGES ANTI-ISRAEL GROUP LEADERS ARE 'HAMAS' FOOT SOLDIERS IN NEW YORK CITY'\n\"The first group is what I call the useful idiots — people who have no idea what’s going on but joined because it felt like the cool thing to do,\" Haddad said. \"Then there are the paid protesters. You see the same faces at different rallies holding different signs — sometimes it’s about LGBTQ issues, sometimes it’s pro-Palestinian, sometimes it’s about internal American problems.\"\n\"It’s always the same person, just a different outfit and a different sign,\" he continued. \"And the third group — the most dangerous—are the extremists who’ve come from the Middle East. Those are the ones we should be most concerned about.\"\nHaddad traced the rise of extremist voices in the West to waves of immigration and population displacement from conflict zones in the Middle East. While the majority of Muslim immigrants fled persecution in search of a better life, he said, a vocal minority brought with them the ideology of the Muslim Brotherhood, effectively holding their communities hostage.\n\"When you have so many immigrants all around the world, it’s enough for 10 or 20 percent of them to be extremists — and suddenly, you’re dealing with millions of extremists,\" he said.\n\"Ostriches, when there is a danger and there is a problem, what they do is they stick their head in the sand thinking the problem will just pass because nobody will notice them,\" he added. \"And this is what the weak governments are doing right now, becoming like an ostrich. The only problem is that no one will skip them over, it will make it easier to chop their heads off.\"\nAddressing accusations that Israel enforces an apartheid system between Jews and Arabs, Haddad rejected the comparison outright.\nHARVARD DEAN'S COUNCIL MEMBER RESIGNS FROM POST AFTER LAWSUIT CLAIMS HE 'AIDED AND ABETTED' HAMAS\n\"In real apartheid, like in South Africa, everything was segregated — transportation, hospitals, courts, sports, even walking on the sidewalks,\" Haddad said. \"But if you actually come to Israel and see life here, it’s the complete opposite — 180 degrees different.\"\n\"Stop speaking from a place of emotion — that’s exactly what The Squad is doing,\" he continued. \"Start talking about facts. Then you’ll realize that anyone who concludes Israel is an apartheid state is an imbecile.\"\nHe also mentioned a run-in he had with a protester, who he refers to as \"the useful idiots.\"\nThey have no clue … One time, I read the charter of Hamas to some pro-Palestinian useful idiot, I read it to them, and I said you agree to this, and they said no, no, no I didn’t know that. And I said yes, but this is what you are supporting, and he had the headband of Hamas on his head. You understand that this is what you are supporting.\n\"He literally took the band off after that. Such useful idiots like this you have a lot, not just in the United States, you can see it in Europe as well.\"\nWhen asked what he believes the Palestinians ultimately want, Haddad pointed to slogans often heard at anti-Israel and antisemitic protests, such as \"From the river to the sea, Palestine will be free\" and \"There is only one solution: Intifada revolution.\"\n\"The majority of Palestinians do not want to live side by side with Israel,\" Haddad said. \"So when people talk about a two-state solution and question Israel’s commitment, I say: Don’t ask the Israelis — ask the Palestinians. You’ll be shocked to find that many of them aren’t willing to accept it.\"\nHaddad pointed out that history can be approached in multiple ways — through religious texts like the Torah for Jews, the Bible for Christians and the Quran for Muslims. Even those who are atheists can look to history books for evidence of the deep-rooted connection of the Jewish people to the land of Israel.\nHaddad argued that the Torah explicitly mentions the presence of Jews in Israel, tracing their presence back thousands of years. He also highlighted the Biblical reference to the birthplace of Jesus in Jewish Bethlehem, challenging the notion that Palestinian Muslims have a historical claim to the land before the Jews.\nHaddad noted that while Jerusalem is never mentioned in the Quran, the term \"sons of Israel\" appears more than 43 times. He also emphasized that the name \"Palestine\" was imposed by the Romans as a punishment for the Bar Kokhba revolt.\nCLICK HERE TO GET THE FOX NEWS APP\nHaddad highlighted that in 1947, Arabs had the opportunity to establish a Palestinian state through the U.N. Partition Plan, which the Jews accepted despite receiving less land and fewer resources. However, the Arabs rejected the plan and opted to wage war. When the Jews emerged victorious, 156,000 Arabs remained within what became Israel. Sharing his personal connection to this history, Haddad explained that his grandfather was one of those Arabs who stayed and eventually became part of the Arab Israeli identity.\n\"It’s either you accept the fact that Israel exists and is here to stay, or you continue with this cycle of bloodshed and death that we are trying to escape,\" said Haddad. \"But the ones who will suffer the most are you, the Palestinians, whether in the West Bank or Gaza.\"\nSeveral requests for comment sent to Reps. Ocasio-Cortez, Tlaib and Omar were not returned."
    },
    {
      "url": "https://www.foxnews.com/politics/squad-erupts-fury-trump-takes-bold-action-against-iranian-nuclear-threat",
      "text": "Members of the congressional \"Squad\" unleashed sharp criticism of President Donald Trump after he ordered a barrage of missile and bomb strikes on Iranian nuclear sites late Saturday.\nRep. Rashida Tlaib, D-Mich., was the most vocal of all, tweeting several times about the offensive.\nResponding to cryptocurrency exchange CEO Arjun Sethi’s comment about U.S. \"elites\" being most united by war \"especially against Muslims in the Middle East,\" Tlaib remarked, \"Yep and it’s so f---ing sick.\"\n\"President Trump sending US troops to bomb Iran without the consent of Congress is a blatant violation of the Constitution. The American people do not want another forever war,\" Tlaib added in a separate message.\nUS MILITARY TROOPS IN MIDDLE EAST COULD FACE INCREASED THREATS AMID IRAN CONFLICT\n\"Instead of listening to the American people, Trump is listening to War Criminal Netanyahu who lied about Iraq and is lying once again about Iran. Congress must act immediately to exert its war powers and stop this unconstitutional war.\"\nShe also retweeted right-wing Rep. Thomas Massie, R-Ky., who had commented \"this (strike) is not constitutional.\"\nSquad Rep. Delia Ramirez, D-Ill., echoed Tlaib’s concerns about \"endless war,\" and called Trump and Netanyahu \"warmongers.\"\n\"It is the people who suffer the illegal & irresponsible actions of authoritarian leaders,\" she said. \"Only Congress has the power to declare war. We must act to protect our safety and shared humanity.\"\nRep. Gregorio Casar, D-Texas, a newer member of the far-left congressional group, claimed it is \"illegal\" for Trump to act as he did.\n\"Congress should immediately pass a War Powers Resolution to block Trump from carrying out an unconstitutional war,\" the Austin lawmaker said.\n\"My entire adult life, politicians have promised that new wars in the Middle East would be quick and easy. Then they sent other people’s children to fight and die endlessly. Enough.\"\nThe most recognizable Squad member, Rep. Alexandria Ocasio-Cortez, D-N.Y., called Trump’s decision \"disastrous\" and said striking Iran without congressional authorization \"a grave violation of the Constitution and Congressional War Powers.\"\n\"He has impulsively risked launching a war that may ensnare us for generations,\" Ocasio-Cortez went on, adding that Trump has established clear \"grounds for impeachment.\"\nThough not a member of the Squad, Rep. Sean Casten, D-Ill., also made an impeachment call Saturday.\nRep. Ilhan Omar, D-Minn., reiterated other Squad members’ criticisms, adding Trump \"reckless(ly) escalate(ed)\" the conflict between Israel and Iran.\n\"Congress must vote immediately on Rep. Thomas Massie and Sen. Tim Kaine’s War Powers resolutions when we return to session.\"\nOmar also shared a quote from Bill Clinton, saying prior to the strike that Trump should \"diffuse\" the situation and that Netanyahu has \"long wanted to fight Iran.\"\n'WAR CRIMINAL NETANYAHU': 'SQUAD' MEMBERS ERUPT OVER ISRAEL'S 'RECKLESS' STRIKE ON IRAN\nRep. Ayanna Pressley, the Boston lawmaker who also identifies with the Squad, said Trump violated the Constitution and risking innocent lives.\nIn Pittsburgh, Rep. Summer Lee said Trump is \"acting fully outside of his authority and is once again trampling on the Constitution.\"\n\"This is an illegal and terrifying escalation. Dropping bombs on Iran brings us closer to war, not peace, and he is putting millions of lives at stake. Congress must immediately pass our War Powers Resolution to rein him in.\"\nLee mocked Trump as \"your hypocritical ‘anti-war’ president who just illegally struck Iran and is putting countless lives at risk.\"\nCLICK HERE TO GET THE FOX NEWS APP\nLater Saturday, Sen. Markwayne Mullin, R-Okla., said the Squad and others crying out about the War Powers Act, saying that courts have ruled it refers to deploying troops, not what Trump has done.\n\"If we are attacked, the commander-in-chief has the authority and ability to protect Americans at home and abroad if we feel threatened or attacked,\" Mullin said.\n\"He’s keeping America safe,\" he told \"Hannity.\""
    },
    {
      "url": "https://www.foxnews.com/category/politics/house-of-representatives",
      "text": "House Of Representatives 7 hours ago House Oversight Committee releases thousands of Epstein documents The House Oversight Committee is releasing thousands of files on Jeffrey Epstein in a surprise Tuesday evening document dump.\nSenate 7 hours ago Senate advances defense bill boosting service member pay, Pentagon reforms The Senate teed up debate on the $925B National Defense Authorization Act on Tuesday, a bill focused on Pentagon reforms rather than gutting “woke\" policies.\nWashington DC 8 hours ago Member of Congress says she was assaulted by gang of youth before Trump DC takeover Rep. Julie Fedorchak, R-N.D., condemned “out of control\" violence in the nation’s capital city. She said she was assaulted by a gang of youth in the streets of Washington, D.C.\nHouse Of Representatives 9 hours ago Massie fires back after Johnson calls his Epstein records push 'meaningless' The fight over how to pursue transparency in Jeffrey Epstein's case continues to consume Congress as Rep. Thomas Massie pushes a measure to end-run House leaders on the matter.\nHouse Of Representatives 14 hours ago Government shutdown, Epstein files, DC crime: Congress returns to mountain of drama Republican leaders will have to navigate a series of deadlines and issues, including averting a partial government shutdown, the simmering discontent over Jeffrey Epstein and President Donald Trump's control of D.C.'s police force.\nPolitics 15 hours ago Congress returns with Democrats refusing to negotiate as Oct 1 shutdown deadline looms Congress returns from summer recess facing an Oct. 1 government funding deadline, with Epstein files potentially complicating spending bills and ongoing oversight hearings.\nJeffrey Epstein 1 day ago Khanna, Massie to hold news conference with Epstein victims: 'People are going to be outraged' Bipartisan lawmakers advocate for transparency in Epstein case as victims prepare to speak publicly for first time, demanding accountability for powerful men involved in abuse.\nVIDEO 2 days ago Rep. Carter warns of possible ‘Schumer shutdown’ as lawmakers return to Capitol Hill Rep. Buddy Carter, R-Ga., discusses lawmakers' return to Congress, President Donald Trump's D.C. crime crackdown and more on ‘Fox News Live.’\nVIDEO 3 days ago Trump uses tariffs as a ‘national defense strategy,’ Rep. Darrell Issa says Rep. Darrell Issa, R-Calif., discusses the appeals court that struck down most of President Donald Trump’s tariff policies and more on ‘Fox Report.’\nVIDEO 3 days ago Republicans will ‘carry the weight’ of trying to avoid a government shutdown: GOP lawmaker Rep. Bryan Steil, R-Wis., discusses the potential of a government shutdown and Federal Reserve Governor Lisa Cook’s alleged mortgage fraud on ‘Fox News Live.’\nPolitics 3 days ago 'Worst thing I've ever seen': 4 years later, GOP veterans say Biden's Afghanistan withdrawal still haunts them House Republicans who served in the Middle East spoke with Fox News Digital about how they felt in the wake of the Biden administration's disastrous 2021 withdrawal from Afghanistan.\nVIDEO 4 days ago There is no comparison between Trump and this 'complete loser,' GOP congresswoman argues Rep. Anna Paulina Luna, R-Fla., argues Democrats need a 'complete rebrand' and advocates for going 'back to the basics' on 'Jesse Watters Primetime.'\nVIDEO 4 days ago 'I'm a rookie again': Former MLB all-star announces congressional run, defends Trump's 'America first' agenda Former MLB All-Star Mark Teixeira explains why he is ready to defend the 'conservative principles' of President Donald Trump's agenda in his run for Congress and gives advice on playing baseball on 'America Reports.'\nPolitics 4 days ago House investigators nix Mueller testimony in Epstein probe over health concerns Former FBI Director Robert Mueller was set to appear before the House Oversight Committee, but the panel intends to withdraw its subpoena over \"health issues that preclude him from being able to testify.\"\nVIDEO 4 days ago Mike Johnson rips Newsom over response to Minneapolis shooting: 'Should enrage conservatives' House Speaker Mike Johnson, R-La., joins 'America's Newsroom' to discuss MSNBC host Jen Psaki and California Gov. Gavin Newsom's responses to the Minneapolis shooting and President Donald Trump's efforts on a 'comprehensive crime bill.'\nPolitics 4 days ago Top Republican points finger at Walz's trans agenda after Catholic school shooting House Majority Whip Tom Emmer is criticizing Minnesota Gov. Tim Walz over pro-transgender state policies in the wake of a deadly Catholic school shooting.\nOpinion 4 days ago Here's the pathway for President Trump to receive his much-deserved Nobel Peace Prize Examination of Trump's Nobel Peace Prize prospects based on his conflict resolution work, and comparing his case to previous winners like Teddy Roosevelt and Barack Obama.\nVIDEO 5 days ago Republican strategist sounds off on ‘weak, whiny' Democrats for rebranding attempt Republican political strategist Katie Zacharia discusses the Democratic Party’s political strategy before the 2026 midterm elections and more on ‘Fox & Friends.’\nUS Navy 5 days ago Navy accused of neglecting brain injuries among pilots in new House probe House panel leaders are accusing the Navy of failing to fully understand or address the psychological toll of flight operations.\nMidterm Elections 5 days ago House GOP recruits candidates in Ohio, Michigan Trump districts held by Democrats House Republicans recruit candidates for crossover districts in Ohio and Michigan, where President Donald Trump won but Democrats maintained congressional seats in 2024.\nPolitics 6 days ago SCOOP: House Republicans ready slew of DC crime bills as Trump promises end to city violence The House Oversight Committee is preparing to advance a slew of Washington, D.C., crime-related bills when Congress returns in September.\nSenate 6 days ago 'Weapons of war': Dem lawmakers call for gun control after Minneapolis school shooting Senate Minority Leader Chuck Schumer, D-N.Y., called for more to be done \"to stop gun violence in America,\" while Rep. Shri Thanedar, D-Mich., demanded that lawmakers should pass \"sensible gun control.\"\nPolitics 6 days ago Trump, House GOP allies eye pathways to extend White House crime crackdown in DC President Donald Trump's congressional allies are working on legislation to help extend his grip on D.C.'s police force.\nCrime 6 days ago 81% of Americans see crime as a 'major problem' in big cities, new poll shows President Donald Trump federalized the Washington, D.C. Metro Police Department, leading to 12 days without a homicide and 1,173 arrests as majority of Americans support his approach.\nMike Johnson 6 days ago Mike Johnson hits iconic Nashville bar, blasts Dems for 'lying' about Trump's agenda House Speaker Mike Johnson visited Nashville Palace to discuss the GOP's tax bill with tipped workers, who expressed enthusiasm about keeping more of their earnings.\nPolitics 6 days ago Nancy Mace blasts 'lunatic rage' after sparring with protesters at rowdy town hall South Carolina Congresswoman Nancy Mace spoke with Fox News Digital after she clashed with activists at her Greenville town hall, telling attendees \"some of you do hate our country.\"\nDonald Trump August 26 Trump claims 'we're against crime. Democrats like crime' President Trump says crime will be major 2026 election focus while touting the success of his 12-day federalization push in Washington, D.C. with the National Guard.\nVIDEO August 26 Nancy Mace sounds off on protesters who disrupted town hall Rep. Nancy Mace spoke with Fox News Digital about her gubernatorial bid and her recent raucous town hall in Greenville, South Carolina.\nPolitics August 26 Fight over policing DC moves to Congress as parties split on control The battle over federal policing in Washington D.C. heads to Congress, with Republicans seeking expanded presidential control and Democrats defending local authority.\nCalifornia August 26 House Republicans give California medical schools two-week deadline in antisemitism probe House Republicans demanded internal documents from UCLA and UCSF as part of an antisemitism investigation on Monday, issuing a two-week deadline."
    },
    {
      "url": "https://www.foxnews.com/category/politics/the-squad",
      "text": "The Squad 55 mins ago House Dem lashes out at pro-Israel 'motherf---ers' during fiery speech: 'We ain't going anywhere' Democratic Squad member Rep. Rashida Tlaib, D-Mich., unleashed on the U.S. and pro-Israel politicians in a fiery, expletive-filled speech at pro-Palestinian conference.\nFox News Flash 4 hours ago Former Biden aide accuses ‘Squad’ Rep. Tlaib of abandoning constituents for 'activist' agenda Former Biden aide Yemisi Egbewole accuses Rep. Rashida Tlaib of abandoning her constituents in favor of activist rhetoric on Palestinian issues.\nPolitics August 22 Ilhan Omar erupts at own party for reneging on socialist candidate's endorsement: 'Inexcusable' Rep. Ilhan Omar blasted her own state party on Thursday night for revoking the endorsement of Minneapolis mayoral hopeful Omar Fateh.\nNew York August 10 AOC campaign denies link to woman charged with 'terroristic threat' against school over Jewish students Iman Abdul, reportedly a former AOC campaign organizer, arrested for allegedly making terroristic threats against a Brooklyn high school.\nHomeland Security August 8 Cuban-born congressman calls for 'Squad' member’s removal over ‘Guatemalan before American’ remark Cuban-born congressman files resolution against Rep. Delia Ramirez for Homeland Security Committee removal following her controversial remarks about Guatemalan identity in Mexico.\nAntisemitism Exposed July 15 'Squad' members 'decide to lie and twist facts' about Israel's history, says prominent Arab activist Israeli Arab activist Yoseph Haddad criticizes the \"Squad\" for undermining Arab-Jewish coexistence and explains how extremist ideologies spread through Middle East movements.\nHouse of Representatives Democrats July 3 Dem ignites showdown after declaring GOP is only pro-life so kids can grow up and 'get shot in school’ Gen Z Congressman Maxwell Frost faces backlash after controversial remarks about Republicans' pro-life stance during a House hearing that resulted in a tense exchange with Virginia Foxx.\nAlexandria Ocasio-Cortez July 1 AOC's childhood nickname revealed amid 'Bronx girl' claims Rep. Alexandria Ocasio-Cortez’s tough Bronx persona is under fresh scrutiny with a resurfaced childhood nickname from her suburban upstate New York upbringing casting doubt on that publicly portrayed image.\nOpinion June 28 BROADCAST BIAS: Networks shield NYC socialist Mamdani from 'extreme' label they apply to conservatives Liberal media's double standard exposed as ABC, CBS, and NBC frame socialist mayoral candidate Mamdani as 'charismatic' while ignoring his controversial positions\nPolitics June 24 'I'm just a silly girl': AOC fires back after Trump calls her 'stupid' AOC and Trump exchange heated words after Iran strikes, with the Democrat calling for impeachment and the president questioning her intelligence while daring her to \"make my day.\"\nIran June 22 'Squad' erupts in fury as Trump takes bold action against Iranian nuclear threat Far-left Squad members call Trump's strategic missile strikes on Iranian nuclear facilities 'illegal' and grounds for impeachment\nPolitics June 18 Ilhan Omar claims no one has 'attacked Americans,' but Iran's deadly history tells different story Fox News Digital report refutes Rep. Ilhan Omar's claim that 'no one is attacking Americans' by documenting Iran's pattern of targeting U.S. personnel through direct and proxy attacks.\nPolitics June 18 'Squad' members, GOP lawmaker join forces to reject US involvement in Israel-Iran war Bipartisan coalition forms as Reps. Massie and Khanna introduce resolution requiring congressional approval for military action against Iran amid escalating Middle East tensions.\nHouse Of Representatives June 13 'War criminal Netanyahu': 'Squad' members erupt over Israel's 'reckless' strike on Iran House \"Squad\" members are criticizing Israel's military action against Iran as U.S. officials warn Tehran not to respond to what Israel described as a preemptive strike.\nHouse Of Representatives May 15 Far-left congresswoman revives ousted 'Squad' Dem's reparations push for Black Americans: 'We are awake' House progressives are reviving their push for reparations payments to descendants of slavery, saying, \"Reparations are a necessary step towards true equity in our country.\"\nHouse of Representatives Democrats April 23 'Squad' Dem says Trump may jail people 'for practicing diversity' after visiting ICE-detained students Rep. Ayanna Pressley and other Democrats spoke to the media after visiting a Louisiana ICE facility to meet with detained college students.\nThe Squad April 8 Rep. Jasmine Crockett suggests the United States needs illegal immigrants because 'we done picking cotton' Rep. Jasmine Crockett, D-Texas, a member of the far-left group of progressive lawmakers known as \"the Squad,\" told congregants at a historically Black church that America needs robust immigration because \"we done picking cotton.\"\nMedia March 26 Former Squad members claim Democrats wanted $10 trillion Build Back Better bill Former congressmembers Jamaal Bowman and Cori Bush said President Biden's doomed Build Back Better Act was originally $10 trillion dollars.\nThe Squad March 13 ‘Squad’ member rails against alleged Trump healthcare cuts: ‘We ain’t stupid’ Leading Democrats railed against DOGE’s “cruel\" cuts at a healthcare rally outside the Capitol, demanding the Trump administration not make “even a minor cut to Medicaid.\"\nMedia February 21 Former 'Squad' members announce new podcast after losing primaries in 2024 Former Reps. Cori Bush, D-Mo., and Jamaal Bowman, D-N.Y., have announced their new podcast with progressive pundit Mehdi Hassan's media company Zeteo on Thursday.\nIllegal Immigrants February 13 AOC's office advises migrants on how to avoid deportations in live webinar The office of Rep. Alexandria Ocasio-Cortez, D-N.Y., hosted a live webinar advising migrants in her district about their rights if they come face to face with ICE agents looking to deport them.\nElon Musk February 5 'Squad' Dem Ayanna Pressley trashes Elon Musk, calling him a 'Nazi nepo baby' Rep. Ayanna Pressley trashed business tycoon Elon Musk, calling him a \"Nazi nepo baby,\" and a \"godless, lawless billionaire.\"\nThe Squad December 26 Ousted Rep Cori Bush thinks she'll seek office again: 'I will always be Squad' Rep. Cori Bush says she thinks she will run for office again in the future, as she prepares to leave her post following a 2024 primary defeat.\nPolitics December 3 AOC's 'Red Light District' plagued by crime as Democrat who helped her rise to power says she 'disappeared' Ramon Ramirez Baez, a Democrat official who says he played a key role in Rep. Alexandria Ocasio-Cortez's first election win, says she has abandoned and “betrayed\" her constituents.\nMedia November 29 'Squad' member shares anti-Israel Thanksgiving message about indigenous killed by settlers for their land Rep. Rashida Tlaib used Thanksgiving to declare \"solidarity with all Indigenous people as they fight for freedom on their own land,\" specifically including Palestinians.\nElections November 6 The 'Squad,' Warren and Sanders among prominent political figures who cruised to re-election victories The House members of the \"Squad\" and Senators Elizabeth Warren and Bernie Sanders are some of the prominent figures who have been re-elected to office.\nMigrant Crime October 22 Groups rallying against police crackdown on prostitution in AOC's 'Red Light' district A rally is taking place in \"Squad\" member Rep. Alexandria Ocasio-Cortez’s district on Tuesday, when pro migrant and pro sex worker groups will call for police to stop clamping down on prostitution and illegal vendors in the area.\nCRIME October 18 State troopers, NYPD descend on AOC's 'Red Light' neighborhood to clamp down on rampant prostitution, crime New York state troopers were deployed to help the NYPD tackle rampant crime and prostitution in a Queens neighborhood, part of which is represented by Rep. Alexandria Ocasio-Cortez, D-N.Y.\nHOUSE OF REPRESENTATIVES August 21, 2024 Moderate who unseated 'Squad' member Jamaal Bowman says Dem voters want a pro-Israel party Westchester County Executive George Latimer discussed what his race against incumbent U.S. Rep. Jamaal Bowman means about the Democratic Party.\nThe Squad August 7, 2024 'Squad' Rep Cori Bush's loss cheered by right, left sounds off on AIPAC spending Reactions poured in after \"Squad\" member Rep. Cori Bush, D-Mo., lost her primary to St. Louis County prosecutor Wesley Bell in one of the most expensive races in congressional history."
    },
    {
      "url": "https://www.foxnews.com/category/world/world-regions/israel",
      "text": "What to know about the State of Israel\nIsrael is a country in the Middle East predominantly composed of Jewish individuals. It is home to many holy sites and has deep religious roots dating back to biblical times. Bordered by Egypt, Jordan, Lebanon, and Syria, Israel is roughly the size of New Jersey.\nBenjamin Netanyahu, from the right-wing Likud party, is the longest-serving prime minister of Israel. He previously served as prime minister from 1996 to 1999 and later from 2009 to 2021, before returning to the role in 2022.\nThe State of Israel was established in 1948 and was officially admitted to the United Nations (UN) in 1949. Israel has a long-standing conflict with Arab states and the Palestinians, characterized by years of violence and terrorist attacks against the Jewish state.\nOn Oct. 7, 2023, Hamas terrorists launched a deadly attack on Israel, prompting Israel to formally declare war on Hamas. In June 2025, Israel launched strikes aimed at Iran's nuclear facilities and top military leaders. On June 13, 2025, Israel initiated strikes targeting nuclear sites in Iran, marking the beginning of fire exchanges between the two nations and the start of the Israel-Iran war. In retaliation for U.S. strikes against its nuclear program, Iran launched at least 14 missiles toward Al Udeid Air Base in Qatar. According to President Donald Trump, the United States carried out strikes on three of Iran’s nuclear facilities in Operation Midnight Hammer on June 22, 2025."
    },
    {
      "url": "https://www.foxnews.com/us/aoc-campaign-denies-link-woman-charged-terroristic-threat-against-school-jewish-students",
      "text": "The campaign of Rep. Alexandria Ocasio-Cortez, D-N.Y., condemned \"appalling\" antisemitic remarks of a woman arrested for allegedly making threats against a Brooklyn public high school attended by Jewish students, and denied a report that the suspect once worked for them.\nIman Abdul, 27, of Brooklyn, was arrested Friday on charges of making a terroristic threat, endangering the welfare of a child, aggravated harassment and making a threat of mass harm, a New York City Police Department (NYPD) spokesperson confirmed to Fox News Digital.\nThe NYPD said it was reported to police on Thursday afternoon that Abdul \"made a terroristic threat through social media\" towards the Leon Goldstein High School for the Sciences, located in Manhattan Beach, within the confines of the 61st Precinct.\nCUOMO SUPPORTERS LOOK TO WEALTHY ENCLAVE TO TAKE DOWN MAMDANI: REPORT\nThe New York Post was first to report on the case. The outlet obtained screenshots of posts purportedly shared from Abdul’s since-deactivated Instagram account.\n\"If anyone needs a public school in NYC to attack for whatever reason… Lexus driving Israhell [sic] loving Zionisits [sic] all attend here,\" Abdul allegedly wrote, sharing a screenshot from Google Maps of the high school's location.\nThe group Stop Antisemitism and Jewish advocate Uri Cohen both posted Abdul’s photo and a screenshot of the post to X, demanding that she be prosecuted over the threats.\nOnline court records show Abdul was arraigned on one count of making a terroristic threat and one count of making a threat of mass harm, pleading not guilty.\n\"A map. A pin. A call to harm Jews, fellow New Yorkers, children, teachers. This isn’t just dangerous. It’s evil. Jew-hatred doesn’t stop with a threat. It escalates. We need immediate and unequivocal action,\" Tova Plaut, a Department of Education pre-K staffer and Jewish activist, reportedly told The Post. \"I am outraged and horrified that a NYC school was publicly marked for attack simply because of its Jewish population.\"\nMAMDANI'S FORMER INTERN CALLED ACTIVISM 'JIHAD' AND CONFRONTED POLICE OFFICERS AS 'PIGS'\nIn a direct message to Stop Antisemitism, Abdul reportedly defended the post before her account was deactivated.\n\"I never called for an attack on the school in the sense of mass organization or not even individual people attacking individuals, that’s literally stupid,\" she wrote, according to the Post. \"I called for an attack on the school, the Zionist institution funded by our public dollars … we have every right to verbally attack the school.\"\nFox News Digital reached out to the Brooklyn District Attorney’s office seeking more information on Sunday but did not immediately hear back.\nThe Post was also first to identify Abdul’s connection to Ocasio-Cortez’s campaign. According to the outlet, Abdul worked on the \"Squad\" member’s Democratic primary campaign as a youth organizer in the summer of 2018. State Sen. Julia Salazar reportedly told the Post that Abdul also worked on Salazar's campaign during that timeframe as a paid canvasser.\nOcasio-Cortez's campaign office denied that Abdul was ever a campaign staffer.\n\"This person was never staff on the campaign and any representation of such is false,\" the campaign said in a statement. \"Their comments are appalling and we condemn threats of violence without hesitation.\"\nCLICK HERE TO GET THE FOX NEWS APP\nReached by Fox News Digital, Abdul's attorney, Geoffrey St. Andrew Stewart, declined to comment on the case."
    },
    {
      "url": "https://www.foxnews.com/category/us/detroit",
      "text": "The Squad 1 hour ago House Dem lashes out at pro-Israel 'motherf---ers' during fiery speech: 'We ain't going anywhere' Democratic Squad member Rep. Rashida Tlaib, D-Mich., unleashed on the U.S. and pro-Israel politicians in a fiery, expletive-filled speech at pro-Palestinian conference.\nHomicide 3 hours ago College student gunned down by ex-boyfriend after months of stalking: report Twenty-year-old Sarah Carroll was killed by her ex-boyfriend in a murder-suicide at a Michigan apartment while she was reportedly seeking a restraining order against him.\nVIDEO 6 days ago Crime by the numbers: Results of Trump's crackdown in DC and where homicide rates are highest Fox News chief political anchor Bret Baier breaks down the results of President Donald Trump's National Guard deployment in Washington, D.C., and the cities with the highest murder rates on 'Special Report.'\nCrime August 15 Teen's body found under suspicious circumstances at Detroit area cemetery prompts investigation Detroit police investigate homicide after discovering body of missing 15-year-old Lawrence Dowl at local cemetery wearing gloves and ski mask.\nDetroit August 6 Detroit mayoral race is set: councilmember vs. pastor Detroit city council president Mary Sheffield and pastor Solomon Kinloch advance to November general election for mayor after primary victory.\nImmigration July 29 Alleged ‘serial criminal’ nabbed in Michigan traffic bust after Biden administration released him into US Border Patrol agents in Michigan captured an alleged member of the Tren de Aragua gang with an active warrant from Denver, highlighting efforts to remove criminal threats.\nIndiana Fever July 1 Sophie Cunningham criticizes WNBA's new expansion cities: 'Not so sure what the thought process is' Sophie Cunningham criticized the WNBA's decision to add two teams in the midwest by 2030, saying players won't be excited to play in Detroit or Cleveland.\nChina June 11 Chinese student arrested for allegedly smuggling undeclared biological materials seen in new mugshot Federal authorities charged Chengxuan Han with allegedly smuggling biological samples from China to the University of Michigan and lying to customs officials during inspection.\nJustice Department June 7 FBI arrests Michigan man who allegedly called in phony bomb threat after missing Spirit Airlines flight A Spirit Airlines flight at Detroit Metro was evacuated Thursday after a Michigan man allegedly called in a bomb threat that prompted K-9 searches and passenger rescreening.\nVIDEO June 5 Bomb threat grounds Spirit Airlines flight at Detroit Metro Airport Sources tell FOX 2 Detroit that K-9s searched the grounded plane for explosives, which was originally bound for LAX. (Credit: WJBK)\nDetroit March 20 Michigan hospital shooting injures 1, suspect in custody, police say One person has been shot and a suspect has been caught following a shooting at Corewell Health Beaumont Troy Hospital parking garage on Thursday morning.\nDetroit February 12 2 homeless children freeze to death while sleeping in van with family in Detroit: police Police in Detroit said that two homeless children froze to death while they slept in a van with their family on Monday, while the city’s mayor revealed that their mother had reached out to homeless services a few months ago.\nImmigration February 10 ICE arrests homeless illegal immigrant who asked to be detained or else he would 'go out and commit crimes' U.S. Immigration and Customs Enforcement arrested an illegal immigrant who reportedly walked into an ICE office and threatened to \"commit crimes.\"\nMedia January 30 Detroit mayor gets blowback from migrant groups for using the 'i-word' for illegal immigrants Detroit mayor Mike Duggan faced backlash from groups that work with migrants for using what they called the \"i-word,\" or \"illegal,\" to describe immigrants here illegally.\nUS January 28 Plus size rapper sues Lyft claiming driver canceled ride over her weight: ‘Burst his tires’ A Michigan woman is suing Lyft, claiming her driver refused her a ride because of her weight.\nMedia January 23 Detroit pastor Lorenzo Sewell slams bishop who lectured Trump for 'theological malpractice' Detroit pastor Lorenzo Sewell of 180 Church slammed Bishop Mariann Edgar Budde for calling out President Trump during the National Prayer Service.\nTravel January 14 Major US city's latest tourist tax hike could affect hotel guests: Travel expert weighs in A new bill passed in Michigan that would allow hotels to raise the tourism tax to 3.5% in an effort to grow promotion and advertising of the Detroit area. A travel expert weighs in.\nUS Crime January 14 Investigators search landfill site for Michigan mother who vanished 10 days ago Police looking for missing Michigan mother-of-two Ashley Elkins are searching through a landfill for evidence in relation to her disappearance. Elkins has not been seen since Jan. 2.\nDetroit January 5 Detroit police officer killed in hit-and-run crash, person of interest at large A Detroit police officer was killed on Sunday in a hit-and-run crash while driving home from work, and a person of interest remains at large.\nPolitics December 17 Swing state governor's race gets curveball as top Dem runs independent, sparking calls for Buttigieg to enter Democrats may be turning to former South Bend, Ind. Mayor Pete Buttigieg as a standard bearer in Michigan after Detroit Mayor Mike Duggan became an independent.\nMedia October 31 Detroit autoworkers on Kamala Harris struggling with blue-collar workers: 'She hasn't done anything for us' Detroit, Michigan autoworkers speak out against electric vehicle mandates and tell Fox News Digital which presidential candidate they are supporting this election.\nDetroit Lions October 29 Lions' Jameson Williams confronted by police for carrying gun in car just 2 weeks before PED suspension Roughly two weeks before Jameson Williams of the Detroit Lions was suspended, he was handcuffed in the back of a police cruiser during a traffic stop.\nMedia October 24 Eminem campaigns for Kamala Harris. Will it sway Detroit voters? Before Eminem spoke at a campaign event for Kamala Harris, Detroit voters shared with Fox News Digital whether celebrity endorsements have any influence on elections.\nIMMIGRATION October 23 Obama claims Trump 'did not solve' immigration 'problem.' The numbers tell a different story Former President Obama claimed that former President Trump \"did not solve\" the immigration problem, but the numbers show illegal immigration got worse under President Biden.\nMedia October 22 Black men call out Kamala Harris' 'disingenuous' messaging as reason she is struggling in the polls Black men reacted to the Harris campaign struggling with Black men in the polls at a rally held at Huntington Place by former President Donald Trump in Detroit, Michigan.\nDetroit October 21 Bullets fly at Detroit apartment complex as two shot, one fatally, in drive-by shooting A drive-by shooting on the east side of Detroit on Monday claimed the life of an 18-year-old, while also injuring a 19-year-old who was taken to the hospital in stable condition.\nBoxing October 18 Boxing Hall of Famer Thomas 'Hitman' Hearns joins Trump on stage at Detroit rally: 'This can't be real' Thomas \"Hitman\" Hearns joined Donald Trump at the former president's rally in Detroit. Hearns, a Detroit native, went 61-5-1 during his Hall of Fame career.\nHomicide October 14 Manhunt in deadly suburban home invasion spans US after phony utility workers target upscale neighborhood Carlos Hernandez allegedly posed as a utility worker to break into a suburban Detroit home, killing Hussein Murray and tying up his wife; a manhunt is underway for second suspect.\nCrime October 12 Doorbell video shows murder suspects pose as energy workers before allegedly killing jewelry store owner Chilling footage has been released showing two fake energy workers calling a house in Detroit before they allegedly murdered a 72-year-old jewelry store owner in the basement while his wife was duct-taped.\nDetroit Lions October 10 Democrat Detroit Mayor Mike Duggan says Lions are going to Super Bowl 'without Trump's help' Democrat Detroit Mayor Mike Duggan says the Detroit Lions will be in the Super Bowl while discrediting the impact of former President Trump."
    },
    {
      "url": "https://www.foxnews.com/politics/meet-radical-anti-israel-activists-joining-squad-dem-tlaib-detroit-confab",
      "text": "A controversial pro-Palestinian gathering in Detroit is drawing scrutiny for featuring speakers with extremist views—including two former Israeli prisoners released in a Hamas deal—alongside Rep. Rashida Tlaib, D-Mich., a prominent anti-Israel congresswoman.\nThe second annual \"People's Conference for Palestine\" conference, which is being organized by a dozen different pro-Palestinian groups, will begin Friday afternoon and will end on Sunday.\nRep. Tlaib will speak alongside several individuals accused of espousing antisemitic rhetoric, including a professor who has compared Jews to Nazis, a journalist who quipped about Hamas kidnapping \"several dozen hipsters\" at \"some sort of rave\" on Oct. 7, 2023, and a high-profile activist who once said Israel is \"built on the idea that Jews are supreme to everyone else\" and lost her position on the board of a major philanthropic organization amid antisemitism complaints.\nDNC SUMMER MEETING DERAILED AFTER TENSIONS FLARE OVER DUELING RESOLUTIONS: ‘LOSING OUR FUTURE’\nTlaib, herself, has been no stranger to criticism about her anti-Israel views either. She was censured in 2023 by her colleagues in Congress over alleged inflammatory rhetoric about the Israel-Hamas war. The censure followed several comments from Tlaib that drew backlash, including her use of the phrase \"From the river to the sea,\" a slogan that many Israel supporters consider a call for the destruction of Israel.\nTlaib also came under fire in 2023 for being part of a secret Facebook group for many years that glorified terrorists following the attacks on Israel on October 7, 2023.\nThe congresswoman will be joined at the conference by two former prisoners held by Israel who gained their freedom through an Israeli prisoner swap with Hamas. One of those individuals, Hussam Shaheen, was sentenced by Israeli authorities to almost 30 years in prison during the early 2000s for murder and conspiracy to commit murder.\nThe other former prisoner, Omar Assaf, was formerly an official of the Democratic Front for the Liberation of Palestine (DFLP). The DFLP is not a U.S.-designated terror group, but it has been targeted by U.S. sanctions.\nWHITE HOUSE DEMANDS ALL GAZA HOSTAGES RETURN HOME ‘THIS WEEK’ AMID STALLED TALKS\nOther attendees of this weekend's conference include Raja Abdulhaq, who is listed on the conference's website as the co-founder of the Quds News Network (QNN), which was suspended from Twitter in 2019 for alleged ties to terrorism, a company spokesperson reportedly told the Times of Israel. Subsequently, other major social media platforms, like Instagram, Facebook and TikTok, all took steps to restrict QNN's presence on their platforms.\nWesam Ahmed, another speaker, is listed as a \"human rights advocate\" with Al-Haq, an entity accused by the Israeli government of having ties to the Popular Front for the Liberation of Palestine (PFLP).\nMeanwhile, Michigan-area activist and former candidate for Congress, Huwaida Arraf, is also slated to speak. Arraf is known for being a co-founder of the International Solidarity Movement (ISM), which has previously been investigated by the FBI for possible ties to terrorists. In 2021, Arraf also penned an article which promoted using violent tactics against Israelis.\n\"The Palestinian resistance must take on a variety of characteristics — both nonviolent and violent,\" she wrote at the time. \"But most importantly it must develop a strategy involving both aspects.\"\nHowever, when reached for comment, Arraf shot back at criticism that she may be antisemitic, arguing any accusations of such are \"meant to smear and silence Palestinians and anyone who dares to speak up for their rights.\"\n\"My record is clear,\" she added. \"I have spent my life opposing all forms of racism, discrimination, and oppression. Conflating criticism of a government with hatred of a people is dishonest and dangerous—it weaponizes antisemitism instead of confronting it.\"\nA Michigan high school principal was forced to apologize to students and parents in 2023 after Arraf went off script at a \"diversity assembly\" and reportedly attacked Israel.\nTRUMP ADMINISTRATION DEMANDS $1B SETTLEMENT FROM UCLA OVER CAMPUS ANTISEMITISM CLAIMS\nMultiple university professors accused of antisemitism will also be at the event with Tlaib. One of them, Hatem Bazian, came under fire by his university, the University of California – Berkley, in 2017 after he shared an anti-Israel cartoon that drew widespread backlash for comparing Jews to Nazis, among other tropes.\n\"Mom, look! I is chosen! I can now kill, rape, smuggle organs & steal the land of Palestinians yay #Ashke-Nazi,\" read the caption of a political cartoon shared by Bazian, the chairman of American Muslims for Palestine and the co-founder of Students for Justice in Palestine.\nThe caption was layered over an image of an orthodox Jewish individual who was juxtaposed next to an image of North Korean leader Kim Jong-Un wearing a kippah and other traditional Jewish garb. That photo was also layered with its own caption: \"Donald Trump: Now my nukes are legal & I can annex South Korea & you need to start paying me 34 billion a year in welfare.\"\nIn 2015, Bazian, whose SJP group has fueled anti-Israel riots on college campuses, raised alarm bells when he called for an \"intifada in this country that changes fundamentally the political dynamics in here,\" which is widely interpreted as calling for violence against Jews. He went on to say, \"They're gonna say some Palestinian being too radical – well, you haven't seen radicalism yet.\"\nCLICK HERE TO GET THE FOX NEWS APP\nAnother speaker at the event, journalist Eugene Puryear, has been slammed for trivializing Hamas's Oct. 7, 2023, attacks that killed over a thousand innocent Israelis.\n\"As you might have seen, there was some sort of rave or desert party where they were having a great time, until the resistance came in electrified hang gliders and took at least several dozen hipsters,\" Puryear said on Oct. 8, one day after the attack, according to a report from the Anti-Defamation League.\nLinda Sarsour, who had to walk-back her remarks after stating Israel \"is built on the idea that Jews are supreme to everyone else,\" and lost her seat on the board of the Women's March amid allegations of antisemitism, will make an appearance as well on Friday afternoon. Sarsour previously denied the allegations of antisemitism that came during her time with the Women's March.\n\"Ask them this, how can you be against white supremacy in America and the idea of being in a state based on race and class, but then you support a state like Israel that is based on supremacy, that is built on the idea that Jews are supreme to everyone else,\" Sarsour asked a crowd in 2019, according to Israeli news outlet Haaretz.\nMahmoud Khalil, the former Columbia University student who the Trump administration tried to deport for allegedly inciting anti-Israel violence on his campus, will also be in attendance.\nIn addition to the speakers, the organizers added special programming geared for kids. \"We're proud to introduce a two-day Children’s Program for ages 6–12, featuring engaging activities and an educational curriculum that explores Palestinian history, culture, and resistance,\" the conference's website says.\nFox News Digital reached out to the conference for comment on its list of speakers, but did not immediately receive a response. Fox News Digital also reached out to several of the speakers for comment but, with the exception of Arraf, did not immediately hear back.\nFox News' Cameron Cawthorne and Andrew Mark Miller contributed to this report"
    },
    {
      "url": "https://www.foxnews.com/politics/pro-palestinian-conference-panelist-calls-us-evil-urges-destroying-idea-america",
      "text": "A panelist speaking at the \"People's Conference for Palestine\" in Detroit on Friday called the United States \"an evil country\" and expressed a need to \"destroy the idea of America in Americans’ heads.\"\nSpeaking on a panel titled \"No Weapons for Genocide: The People Demand an Arms Embargo,\" Sachin Peddada, a Ph.D. student in economics and research coordinator at Progressive International, repeatedly ripped on the United States as an \"empire\" motivated by greed.\nIn response to a question about how Americans can get more involved, Peddada paraphrased a quote by deceased Palestinian author Bassel al-Araj, saying, \"The average American will never understand the plight of the Palestinian person because the state of Israel is a carbon copy of the United States.\n\"And, therefore, the thing to do is to destroy the idea of America in Americans’ heads so that they can see the humanity of everybody outside the warping of American exceptionalism and imperialism and all these evil things.\"\nAs Peddada said these words, the crowd broke into applause.\nWHITE HOUSE DEMANDS ALL GAZA HOSTAGES RETURN HOME 'THIS WEEK' AMID STALLED TALKS\nPeddada continued, saying, \"We have to dismantle this idea of American exceptionalism, of supremacy, of being beyond reproach.\n\"I think it’s very important that we normalize criticism as a healthy process and learn from our experiments in the world to push the boundaries of what is possible, to continue to fight for more and more and to see how the empire responds to us, to continue to push farther and harder.\"\nAt another point during the panel, Peddada declared, \"We live in an evil country.\"\nHe said that, since Oct. 7, 2023, \"We can say with certainty that the U.S. has been the most complicit country — complicit is not even the right word to use — but the most responsible country for what is happening not only in Gaza but also the West Bank and also all over the global south.\"\nPeddada claimed that the U.S. is a country that has \"functionally for decades been the sole superpower of the world\" and has \"an agenda that is driven primarily by the accumulation of profit at the expense of human lives.\nCOLUMBIA PROFESSOR WHO CALLED OCT. 7 HAMAS ATTACKS 'AWESOME' TO TEACH COURSE ON ZIONISM\n\"To obfuscate that point or beat around the bush there does not serve us; we live in an evil country, that’s just what’s happening,\" he said as the crowd again broke into applause.\n\"That doesn’t mean we’re all evil,\" he added. \"But it does mean we have a unique responsibility. We have a unique position here in the heart of the empire to act in solidarity with all of our siblings in Gaza and in the West Bank, all around the world.\"\nCommenting on the remarks, one user on X posted, \"As an American, I find this galling.\"\n\"My culture and history have already been relentlessly attacked — statues of Washington, Jefferson, and other Founders torn down as ‘controversial,’\" he said. \"Now we have conference speakers openly talking about ‘destroying the idea of America.’\"\nSQUAD MEMBERS SUED FOR 'INCITING' COLUMBIA ANTI-ISRAEL ENCAMPMENT\nThe People’s Conference for Palestine, organized by a dozen pro-Palestinian groups, began Friday and will run through Sunday. Even before it started, the gathering drew scrutiny for featuring speakers with extremist views, including two former prisoners of Israel released in a Hamas deal, alongside Rep. Rashida Tlaib, D-Mich., a prominent anti-Israel congresswoman.\nCLICK HERE TO GET THE FOX NEWS APP\nThe conference opened Friday afternoon with an elaborate opening ceremony, in which a speaker, after leading the crowd in chants, invited attendees to rise for \"our national anthem\" as a band began playing a song in a foreign language. People wearing keffiyehs proceeded in, holding Palestinian flags.\nFox News Digital reached out to Progressive International and the People's Conference for Palestine for comment but did not immediately receive a response.\nFox News Digital's Alec Schemmel contributed to this report."
    }
  ],
  "argos_summary": "Rep. Rashida Tlaib delivered a fiery, profanity‑laden speech at a pro‑Palestinian conference in Detroit, calling pro‑Israel politicians \"genocide enablers\" and asserting that the U.S. is complicit in the Gaza conflict. She reiterated her longstanding anti‑Israel stance, including the slogan \"From the river to the sea,\" and warned that the U.S. government is defunding aid to Palestinians while supporting Israel’s military actions. The speech has intensified criticism of Tlaib, who was already censured by Congress in 2023 for similar remarks, and has drawn attention to the broader debate over U.S. foreign policy and domestic political polarization.",
  "argos_id": "XV3AVKBDB"
}