{
  "url": "https://www.newsweek.com/student-visa-holders-contribute-438b-us-economyreport-2123891",
  "authorsByline": "Billal Rahman",
  "articleId": "576e256cd00b4c888be764e5a701c2ca",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2715172/students.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T13:08:53-04:00",
  "addDate": "2025-09-03T17:15:58.451165+00:00",
  "refreshDate": "2025-09-03T17:15:58.451169+00:00",
  "score": 1.0,
  "title": "Student visa holders contribute $43.8B to US economy—Report",
  "description": "The data from the 2025 Boundless report reflects the 2023–2024 academic year and marks a 9.5% increase from the previous year.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nInternational students studying at U.S. colleges and universities contributed $43.8 billion to the U.S. economy, according to a new report.\n\nThe data, from the 2025 Boundless Immigration report, reflects the 2023–2024 academic year and marks a 9.5 percent increase from the previous year.\n\nThe Trump administration has adopted a tougher stance on student visas, with officials stating that they have revoked more than 6,000 student visas since January.\n\nThe State Department links the actions to overstays and alleged criminal conduct. The administration frames the measures as part of efforts to tighten vetting and curb perceived abuses of the student-visa system, including expanded social media screening and a proposed DHS rule to limit the duration of stay for certain visa categories.\n\nOfficials say roughly 4,000 revocations were for alleged lawbreaking, such as assaults, DUIs, and burglary, and a smaller number, reported at about 200 to 300, for alleged \"support for terrorism.\"\n\nWhat To Know\n\nThe number of international students in the U.S. reached 1.58 million in 2024, a 5.3 percent increase from 2023, according to the report.\n\nXiao Wang, founder and CEO of Boundless Immigration, told Newsweek that the international student population and its economic contributions are likely to decrease next year due to the current administration's policies. He attributes this to the revocation of thousands of student visas, restrictions on schools like Harvard and their recent graduates' work opportunities, as well as stricter admissions rules.\n\n\"If prospective students aren't clear about if they can enter the country, graduate, or work, they will look elsewhere,\" Wang told Newsweek.\n\nInternational students supported 378,175 jobs across various sectors, including education, retail, and services, according to the report.\n\nInternational students are concentrated in specific states, with California, New York, Texas, Massachusetts, and Florida hosting nearly half the total population. California alone accounted for 14.6 percent of international students in 2024.\n\nMore than 70 percent of international students in the U.S. come from Asia, with India (422,335) and China (329,541) accounting for the largest shares. Combined, students from these two countries made up nearly half (47.5 percent) of all active Student and Exchange Visitor Program records in 2024.\n\n\"The top students from around the world want to come study in the U.S., get instilled with American values, and are encouraged to achieve the American dream,\" Wang said.\n\nA significant portion of international students pursue degrees in science, technology, engineering, and mathematics (STEM) fields. In 2024, 194,554 international students obtained work authorization through the Optional Practical Training program, with 95,384 receiving STEM OPT authorizations, a 54 percent increase from the previous year. Major tech companies, including Amazon, Google, Microsoft, Meta, and Apple, were among the top employers of these graduates.\n\nInternational students in the U.S. are considered \"nonimmigrants,\" a category that applies to foreign nationals who enter the country temporarily for a defined purpose, such as education. Their study programs fall under the Student and Exchange Visitor Program (SEVIS), which is administered by the Department of Homeland Security. Most are admitted on F-1 visas for academic study, M-1 visas for vocational training, or J-1 visas for exchange programs.\n\nMeanwhile, the Trump administration is proposing new four-year limits for holders of student, exchange, and media visas as part of efforts to tighten immigration regulations.\n\nIn a proposal published in the Federal Register on August 27, the Department of Homeland Security (DHS) outlined plans to revise the F, J, and I visa categories.\n\nWhat People Are Saying\n\nXiao Wang, founder and CEO of Boundless Immigration, said in a statement: \"Fewer international students will have a ripple effects to the local community around the schools, but more worrisome, will actively suppress the next generation of researchers and entrepreneurs. If students decide to go to Canada, the UK, or Australia instead, we are losing more than in-year revenue, we are losing brainpower and the energy that fuels the next generation of innovation in America.\"\n\nWhat Happens Next\n\nThe Trump administration could continue to take a hard-line stance toward student visa holders as it looks to curb migration and carry out widespread deportations.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/topic/department-of-homeland-security",
    "https://www.newsweek.com/topic/amazon",
    "https://www.newsweek.com/topic/meta",
    "https://www.newsweek.com/topic/apple",
    "https://www.newsweek.com/student-exchange-visa-changes-proposal-trump-administration-2120179",
    "https://www.newsweek.com/foreign-student-visa-holders-loss-us-economy-impact-2119494",
    "https://www.newsweek.com/topic/google",
    "https://www.newsweek.com/topic/microsoft"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "student visas",
      "weight": 0.119622566
    },
    {
      "name": "International students",
      "weight": 0.115366444
    },
    {
      "name": "international students",
      "weight": 0.115366444
    },
    {
      "name": "Student visa holders",
      "weight": 0.11505291
    },
    {
      "name": "student visa holders",
      "weight": 0.11505291
    },
    {
      "name": "Fewer international students",
      "weight": 0.10837923
    },
    {
      "name": "students",
      "weight": 0.10176922
    },
    {
      "name": "prospective students",
      "weight": 0.09796929
    },
    {
      "name": "certain visa categories",
      "weight": 0.0764094
    },
    {
      "name": "F-1 visas",
      "weight": 0.07559631
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.8056640625
    },
    {
      "name": "/Jobs & Education/Education/Colleges & Universities",
      "score": 0.76416015625
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.6220703125
    },
    {
      "name": "/News/Other",
      "score": 0.5546875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.432373046875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.39697265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.33740234375
    }
  ],
  "sentiment": {
    "positive": 0.069717586,
    "negative": 0.7303864,
    "neutral": 0.19989602
  },
  "summary": "International students studying at U.S. colleges and universities contributed $43.8 billion to the US economy in 2025, a 9.5 percent increase from the previous year, according to the 2025 Boundless Immigration report. The report also revealed that the Trump administration has taken a tougher stance on student visas, with over 6,000 revoked since January due to overstays and alleged criminal conduct. The measures are part of efforts to tighten vetting and curb perceived abuses of the student-visa system. The number of international students in the US reached 1.58 million in 2024, a 5.3% increase from 2023. International students supported 378,175 jobs across various sectors, including education, retail, and services. The Department of Homeland Security (DHS) has proposed new four-year limits for holders of student, exchange, and media visas in an effort to tighten immigration regulations.",
  "shortSummary": "International students contribute $43.8 billion to the US economy annually, despite stricter visa policies and job restrictions, according to Boundless Immigration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "419e07541ee84e05a7ad335506c30068",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/topic/amazon",
      "text": "Amazon announces major change to Prime benefits\nAmazon has announced it is ending a program that allowed its Prime members to extend free shipping to people living outside their household.\nIs there mail on Labor Day? USPS, UPS, FedEx and Amazon Delivery Hours\nMail delivery services will be affected by the Labor Day holiday this year.\nTV\nWhat's on Prime Video in September 2025? Full List of New Movies, Shows\nGen V, Novocaine, and every single release on Prime Video throughout September 2025.\nNationwide recall for products sold on Amazon: Risk of death warning\nConsumers were urged to stop using two specific battery chargers and carabiners sold on Amazon due to life-threatening defects.\nList of companies being boycotted in September\nThe People's Union USA has announced a list of companies it is calling on the public to boycott next month.\nAmazon Facing Lawsuit Over Prime Video Movie Purchases\nA lawsuit alleges that Amazon misleads Prime Video users by labeling digital rentals as \"purchases.\"\nTV\nThe Summer I Turned Pretty Season 3 Episode 9 – Release Date, How To Watch\nWe have all the information on when, where, and how to watch episode nine of The Summer I Turned Pretty.\nCustomer places Amazon order—shock at when receipt says it will arrive\nEzekiel told Newsweek: \" It's probably just a glitch, and the tea bags will arrive sometime before 2037...hopefully!\"\nLaughter at what mailman hears while delivering parcel: \"window was open\"\nLauren Barnes told Newsweek that she \"wanted the earth to swallow me up\" when she realized what had happened.\nChipotle announces major food delivery update\nChipotle has announced that certain customers in Texas will now be able to have their orders delivered by drone.\nTV\nThe Summer I Turned Pretty Season 3 Episode 8 – Release Date, How To Watch\nEverything you need to know about how, when, and where to watch episode eight of The Summer I Turned Pretty season three.\nStreaming\n'Fallout' Season 2 Teaser Trailer Gives First Look at Greatest Villain\nThe new \"Fallout\" season 2 trailer has dropped, giving fans a first look at the video game's greatest villain.\nAmazon recall update nationwide as customers told \"stop using\" products\nSeveral products sold by Amazon have been recalled because of a range of serious safety hazards.\nNationwide recall for product sold at Walmart, Amazon\nRoughly 11,200 fuel bottles have been recalled due to a violation of multiple mandatory standards that could cause serious injury.\nAmazon to issue refunds as Appstore closes on Android: What to know\nThe company said discontinuing the Appstore is part of an \"ongoing effort to streamline and improve our services and programs.\"\nTV\nThe Summer I Turned Pretty Season 3 Episode 7 – Release Date, How To Watch\nWe've got all the details on how, when, and where to watch episode seven of The Summer I Turned Pretty season three.\nAmazon announces major change for groceries\nThe new service will provide same-day grocery delivery across the U.S. after pilot projects in major cities.\nDonald Trump gives major China tariff update\nPresident Donald Trump has reportedly signed an executive order granting a 90-day extension to the China tariff deadline.\nNationwide deodorant recall update as FDA sets risk level\nMore than 67,000 Power Stick deodrants were recalled across the United States.\nHow To Protect Users' Privacy from Tech Corporations | Opinion\nThe reality is that if Big Tech companies cared about user privacy, they would protect it.\nThe \"stealth tax\" eroding your wallet\nAccording to a recent survey, Americans are spending $12.2 billion more per month since the start of the year.\nAmazon customer left stunned by \"secure location\" her parcel was left in\nThe Reddit user told Newsweek that she \"was flabbergasted\" by the delivery notification, and she's never seen anything like it.\nAmazon recall update nationwide over risk of death for several products\nConsumers are urged to stop using the products immediately and follow specific recall instructions.\nTV\nThe Summer I Turned Pretty Season 3 Episode 6 – Release Date, How To Watch\nHow, when, and where to watch episode six of The Summer I Turned Pretty season three.\nAmazon-Linked 'Project Blue' rejected amid water fears\nThe city of Tucson has blocked the implementation of the data center, citing public opposition and the project's high water use.\nNationwide economic blackout on August 9: What to know about boycott\nThose organizing the boycott have urged Americans to refrain from making any purchases for 24 hours.\nJeff Bezos' dream of Amazon drone deliveries gets huge boost\nA proposed new federal rule would allow drones to be flown longer distances out of the operators line of sight\n4-year-old to wait \"one minute\"—no one prepared for what he does next\n\"When kids are little, it does not matter what we say in these situations because they do not have a concept of time,\" an expert told Newsweek.\nAmazon recall update nationwide as fatal warning issued\nFour products sold online have been recalled due to serious safety hazards.\nTV\nNew on Prime Video: Full List of Movies, Shows Hitting Platform in August 2\nEverything new coming to Prime Video throughout August 2025."
    },
    {
      "url": "https://www.newsweek.com/student-exchange-visa-changes-proposal-trump-administration-2120179",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe Trump administration is proposing new four-year time limits on student, exchange and media visa holders, as part of plans to tighten up immigration rules.\nIn a proposal filed in the Federal Register on Wednesday, the Department of Homeland Security (DHS) announced its intention to modify the F, J, and I visa categories.\n\"If enacted, this rule would create additional uncertainty, intrude on academic decision-making, increase bureaucratic hurdles and risk deterring international students, researchers and scholars from coming to the United States,\" Miriam Feldblum, president and CEO of the Presidents' Alliance on Higher Education and Immigration, told Newsweek.\nWhy It Matters\nStudent visa holders have been a focus of immigration enforcement under the second Trump administration, with many having their legal status revoked and interviews for new applicants paused for several weeks. This latest proposal revisits a plan from President Donald Trump's first term.\nWhat To Know\nThe DHS said that, unlike many other visa types, F, J, and I visas currently do not have time limits; instead, they require holders to adhere to the rules of their respective visas. Under the new plan, four-year limits would be imposed, aimed at stopping lengthy visa overstays.\nThe three categories cover foreign students, exchange visitors—such as summer workers, au pairs, and medical students—and those in foreign media.\nThe DHS memo stated that part of the reason for seeking the new limits was due to the \"dramatic rise\" in these visas, with F visas (used by international students) increasing from 260,000 in 1981 to 1.6 million in 2023.\nJ visas (used by some students, academics, medical professionals, au pairs and other such visitors) experienced a 250 percent increase between 1985 and 2023, rising from 141,200 to approximately 500,000, while I visas (for media) also doubled during the same period.\nThe DHS stated that this posed a challenge to its agencies when it came to monitoring individuals in the U.S. with such visa types, and that a fixed-term approach would be more effective in managing immigration numbers.\nFor student visa holders, under the new proposal, they would have to either apply for a change in status at the end of their term (i.e., for an H-1B or other work-based visa) or ask for an extension of their F-1 visa if they have not completed their studies. Similar parameters would apply to I and J visa holders.\nThe Trump administration's efforts to withdraw legal status for students and hold up interviews at the embassy stage have faced and lost to legal challenges in recent months, with student and exchange visitor advocates arguing that these programs deliver significant benefits to the U.S. economy.\nWhat People Are Saying\nMiriam Feldblum, president and CEO of the Presidents' Alliance on Higher Education and Immigration, told Newsweek: \"The proposed rule is yet another unnecessary and counterproductive measure targeting international students and scholars. It would require them to repeatedly submit additional applications just to remain in the country and fulfill requirements of their academic programs—imposing significant burdens on students, colleges and universities, and federal agencies alike.\"\nA DHS Spokesperson, in a statement shared with Newsweek: \"For too long, past Administrations have allowed foreign students and other visa holders to remain in the U.S. virtually indefinitely, posing safety risks, costing untold amount of taxpayer dollars, and disadvantaging U.S. citizens. This new proposed rule would end that abuse once and for all by limiting the amount of time certain visa holders are allowed to remain in the U.S., easing the burden on the federal government to properly oversee foreign students and history.\"\nWhat Happens Next\nDHS will now welcome comments and feedback on the proposals. When the idea was floated in 2020, over 32,000 comments were submitted, many of which were against the idea, which was subsequently scrapped by the Biden administration.\nUpdate 8/27/25, 1:45 p.m. ET: This article was updated with comment from Miriam Feldblum.\nAbout the writer\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. ... Read more"
    },
    {
      "url": "https://www.newsweek.com/topic/microsoft",
      "text": "Video Games\nThe 10 best games on Xbox One\nThe Xbox One is home to thousands of incredible games, and most of them are available via backwards compatibility on current-gen consoles.\nThese Billionaires Pledged To Give Away Wealth. Most Are Getting Wealthier\nAt 15 years old, the Giving Pledge shows we can't rely on the best intentions of billionaires to win a fairer economy.\nEye-popping electric bills come due as price of AI revolution\nEven if you've never used ChatGPT or generated an AI image, chances are you're already paying for it.\nTop 40 jobs most likely to be impacted by AI\n\"As AI adoption accelerates, it's important that we continue to study and better understand its societal and economic impact,\" Kiran Tomlinson told Newsweek.\nMicrosoft responds to H-1B visa criticism\nThe tech giant denied that layoffs were connected to its use of the H-1B visa program.\nMicrosoft releases urgent patch to counter server attacks: What to know\nThe attacks exploit a previously unknown vulnerability in Microsoft's document-sharing system.\nMicrosoft issues alert after critical SharePoint Server attacks\nMicrosoft warned of active zero-day attacks on SharePoint servers used by government and businesses, with FBI investigating.\nMicrosoft's H-1B visa applications questioned amid mass layoffs\nThe tech giant has laid off more than 15,000 people this year, while still awaiting approval for thousands of foreign workers.\nVideo Games\nPlayStation game Helldivers 2 is coming to Xbox next month\nOver a year after a wildly successful launch on PS5 and PC, the PlayStation-published third-person shooter is making its way to Xbox.\nCEO explains why he's ending \"unlimited\" time off for employees\nRyan Breslow called the idea \"totally broken\" and said it resulted in inconsistent vacation use and burnout among top performers.\nVideo Games\nXbox games cancelled as Microsoft slashes 9000 jobs\nProjects such as Rare's Everwild have been cancelled amid mass layoffs at Xbox parent company Microsoft.\nList of companies laying off employees in July\nAmerican consumers are \"being a little bit more careful\" and looking for promotions and sales, a retail expert told Newsweek.\nMicrosoft AI health research edges towards 'medical superintelligence'\nNew research from Microsoft AI offers a promising glimpse of AI's diagnostic potential.\n'Always On,' how workers are suffering from 'infinite' work\nJuliet Schor told Newsweek \"American workers are stressed out, burning out, and disengaged from their jobs.\"\nHundreds of layoffs hit Silicon Valley\nThe layoffs reflect a growing and concerning trend across California, a state long regarded as the nation's leading tech hub.\nMicrosoft reports mixed progress toward ambitious 2030 carbon negative goal\nMidway to its 2030 goal, Microsoft's total emissions were lower in 2024 compared to the previous year but still about 23 percent above the 2020 baseline.\nMass layoffs hit Microsoft\nThousands of employees may be impacted by the latest round of layoffs at Microsoft.\nVideo Games\nEvery game coming to Xbox Game Pass in May 2025\nXbox Game Pass is getting a brand-new DOOM game in May, as well as a few fantastic indie titles.\nVideo Games\nElder Scrolls Oblivion remake seemingly confirmed through developer leaks\nDeveloper Virtuos uploaded images to its website suggesting an announcement for The Elder Scrolls IV: Oblivion Remastered is imminent.\nDonald Trump's tariff exemptions raise eyebrows—\"Almost getting comical\"\n\"If tariffs are so great, why so many exemptions?\" a former Republican congressman asked on social media.\nWoman's theory about what proves you \"truly love\" something strikes a chord\nShe called it the \"ultimate final form of affection and passion towards a topic.\"\nVideo Games\nXbox Games Showcase announced for June, The Outer Worlds 2 Direct to follow\nMicrosoft is set to show off the second half of its 2025 releases in a big livestream later this year.\nTechnology\nAverage health system audit finds 70 \"quiet\" AI applications, CEO says\nHealth care organizations may be unknowingly running dozens of AI applications, according to exclusive data Newsweek obtained from Prompt Security.\nWhat data does Microsoft actually use to train its AI?\nOnline rumors suggest Microsoft uses your Word data to train its AI. Here's what Microsoft says it actually uses.\nVideo Games\nPREVIEW: Steel Hunters is World of Tanks with Mechs\nWargaming goes sci-fi in its thunderously destructive online extraction shooter.\nWork\nMicrosoft head of HR Kathleen Hogan moves into new executive role\nThe software and technology giant named a new CHRO on Wednesday and elevated its former CHRO into a new leadership position.\nTechnology\nSuki AI is everywhere—and aims to be invisible\nHow did Suki become a dominating force in health care AI? Newsweek connected with its CEO to find out.\nWhen is Skype shutting down? What to know and do before it closes\nLearn how to transition from Skype to Microsoft Teams before the service shuts down on May 5, 2025, including steps to export messages and contacts.\nWhy Microsoft is Shutting Down Skype—And 5 Chat Alternatives\nMicrosoft is retiring Skype in May 2025, urging users to migrate to Microsoft Teams Free. Here are some alternatives video communication tools.\nVideo Games\nXbox exclusive Fable delayed into 2026\nPlayground Games' Fable was originally announced to be coming in 2025, but it needs a little more time in the oven."
    },
    {
      "url": "https://www.newsweek.com/topic/apple",
      "text": "Husband realizes wife left phone behind—his plan has internet in stitches\nOne commenter sarcastically congratulated the man on a \"smart move,\" but another replied admitting: \"I'd rather not say how long it took me to get this post.\"\nMovies\nF1 The Movie Gets New Digital Release Date – How To Watch\nHere's when, where, and how you can watch F1: The Movie from home.\nApple users get update on how their private data is being used\nDirector of National Intelligence Tulsi Gabbard said that the UK would drop its mandate for Apple to provide an encrypted data \"back door.\"\nWarren Buffett's \"mystery stock\" revealed in new filing\nBerkshire Hathaway has built up sizable investments in a handful of companies, according to a filing released on Thursday.\nTech mishap sends man into panic for whole flight\n\"At first when I got the notification I was nervous and rather confused,\" the traveler told Newsweek.\nWarren Buffett may soon reveal mysterious new investment\nBerkshire Hathaway's secret stock holding could be valued at nearly $5 billion, according to Barron's.\nHow To Protect Users' Privacy from Tech Corporations | Opinion\nThe reality is that if Big Tech companies cared about user privacy, they would protect it.\nTV\nThe Buccaneers Season 2 Episode 8 – Release Date, Schedule, How To Watch\nHow, when, and where to watch the season finale of The Buccaneers season two.\nWorld's largest iPhone maker sparks speculation with rare move\nHon Hai is Apple's largest manufacturing partner and is instrumental to the assembly of iPhones and other devices.\nTV\nThe Buccaneers Season 2 Episode 7 – Release Date, Schedule, How To Watch\nAll details you need on how, when, and where to watch episode seven of The Buccaneers season two.\niPhone users are more likely to fall for scams than Android users\nThe survey highlighted a consistent pattern of riskier online behavior among iPhone owners.\nYour smartwatch could carry a hidden health risk\nSmartwatches are a widely worn accessory—with around one in five Americans wearing either a smartwatch or wearable fitness tracker, according to one survey.\nTV\nThe Buccaneers Season 2 Episode 6 – Release Date, Schedule, How To Watch\nThe Buccaneers season two continues, and here's how, when, and where to watch episode six.\nBig Tech's Catastrophic TikTok Gamble | Opinion\nCorporate America has long prided itself on sophisticated risk management and legal compliance. The TikTok episode suggests that when political pressure mounts, even the most sophisticated corporations can make decisions that defy basic business logic.\nApple drops $500M million on rare Earth magnets—why iPhones depend on them\nThe magnets, which are crucial for powering components like iPhone vibration motors, will be produced at MP's Fort Worth, Texas plant.\nTV\nThe Buccaneers Season 2 Episode 5 – Release Date, Schedule, How To Watch\nWe prepare for Lizzy's wedding in the next episode of The Buccaneers, but here's when, where, and how you can watch it.\nTV\nThe Buccaneers Season 2 Episode 4 – Release Date, Schedule, How To Watch\nWe are soaking in the sun in episode four of The Buccaneers season two, and here's when, where, and how you can tune in.\nMillennial finds dad's 1981 work pass—jaws drop as she realizes what it is\n\"When Apple threw parties—they threw parties, man. It was the 80s in South Florida. Let your imagination go wild,\" his daughter told Newsweek.\nTV\nNew on Apple TV+: Full List of Movies, Shows Hitting Platform in July 2025\nEverything new coming to AppleTV+ throughout July 2025.\nTV\nThe Buccaneers Season 2 Episode 3 – Release Date, Schedule, How To Watch\nSeason two of The Buccaneers is in full swing. Find out when, where, and how to watch episode three.\nApple accused of losing shareholders billions of dollars\nApple Shareholders say the company downplayed the time needed to integrate advanced AI features into Siri.\nRacing\nApple CEO Tim Cook Confirms New Documentary on Lewis Hamilton\nTim Cook has announced a new documentary on Lewis Hamilton, inspired by the F1 icon's path to becoming a seven-time world champion.\nTV\nThe Buccaneers Season 2 Episode 2 – Release Date, Schedule, How To Watch\nHow, when, and where you'll be able to tune into episode two of The Buccaneers season two.\nRacing\nLewis Hamilton and Apple CEO Open Up About 'F1' Movie Collaboration\nWith a few days to go before the release of 'F1' the movie, Lewis Hamilton and Apple CEO Tim Cook explain the crucial roles they played.\nMade-in-America Trump phones could cost double the advertised price\nDespite its proposed $499 price tag, experts told Newsweek that a truly made-in-America smartphone would likely cost far more.\nRacing\nShark Reveals F1 Movie Tech Ahead of Release\nIn collaboration with the upcoming \"F1\" movie, SharkNinja released an entire lineup of cleaning, hair, and kitchen products inspired by the film.\nTV\nThe Buccaneers Season 2 Episode 1 – Release Date, Schedule, How To Watch\nFind out how, when, and where you can watch the season two premiere of The Buccaneers.\nTV\nMurderbot Season 1 Episode 7 – Release Date, Schedule, How To Watch\nAll the information you need on how, when, and where you can watch episode seven of Murderbot.\nTV\nMurderbot Season 1 Episode 6 – Release Date, Schedule, How To Watch\nAll the information you need for how, where, and when to watch episode six of Murderbot.\nApple and Google face accusations of enabling thieves with device policies\nThieves reportedly find crimes easy to commit when they involve Apple and Google devices."
    },
    {
      "url": "https://www.newsweek.com/topic/department-of-homeland-security",
      "text": "Kristi Noem fires FEMA employees accused of accessing porn at work\nSecretary Kristi Noem fired FEMA workers after probes found porn—including bestiality—on agency computers at a key site.\nDeSantis teases new immigration facility as Alligator Alcatraz winds down\nThe Trump administration was handed a legal blow after a judge ruled that Alligator Alcatraz could not accept any new detainees and banned any site expansion.\nTrump administration will pay local law enforcement to help ICE\nStarting Oct. 1, DHS said participating agencies will receive full coverage for the salary and benefits of trained 287(g) officers.\nGreen card holder convicted of murder deported\nOrville Etoria held a green card that was revoked after being convicted of multiple serious felony offenses, including murder.\nICE detains woman with green card who passed US citizenship exam—spouse\nLos Angeles shop owner Hooshang Aghdassi said ICE detained his wife, Sharareh Moghadam, after she finished her citizenship exam.\nRed state cities under consideration for troop deployments: Kristi Noem\nThe DHS secretary said Sunday that some GOP-led cities may see troop deployments, denying political bias amid scrutiny over the administration's crime strategy.\nTrump admin says 70% of ICE detainees do not have criminal convictions\nThe Trump administration has insisted that the majority of immigrants being detained by ICE are known criminals.\nICE detains dad with green card for over 3 months after return from funeral\nA man returning from his sister's funeral overseas was apprehended at O'Hare airport in June over a decades-old crime.\n\"Anxious\" FEMA staffer put on leave warns \"incalculable loss\" looms\n'There are families burying loved ones who could have been saved,' worker tells Newsweek in exclusive interview as 34 protest letter co-workers are sidelilned\nWife of green-card holder detained by ICE speaks out—\"lots of tears\"\n\"I never thought that I would have to try to be a single mom,\" said Kelli Heath, whose husband's final immigration hearing is next week.\nTrump admin plans new time limit for foreign students in US\nThe changes would also affect exchange visitors and foreign media with temporary visas.\nICE detains dad of four \"awaiting green card interview\"\nThe family of a Russian immigrant claims that Interpol is behind efforts to return him to his native country. The U.S. says he never tried to get a green card.\nFEMA staff being put on leave after criticizing Trump sparks fury\nMore than 180 staff signed an open letter warning that FEMA's capacity to respond to a major disaster was dangerously diminished.\nTrump admin making major change to US citizenship application process\nImmigrants face neighborhood checks under a policy long unused by the Department of Homeland Security.\nNational Guard mobilization plans across states: What we know\nUp to 1,700 National Guard troops could be deployed in 19 states including Texas, Florida and Utah.\nMore than 2M petition for clemency for trucker in fatal Florida crash\nThe petition, created by \"Collective Punjabi youth,\" asks Florida Governor Ron DeSantis to reduce Singh's potential sentence if convicted.\nDHS responds to backlash over ICE facilities at internment camp site\nFort Bliss in Texas served as an internment facility during World War II, holding Japanese, German and Italian civilians.\nAre there 55 million visa holders in the US? What to know\nAnti-immigration campaigners suggested 55 million people could be deported from the U.S. after \"continuous vetting\" as announced for visa holders.\nH-1B Visas Face Major Change Under DHS Plan\nDHS seeks to rank H-1B visas by wages, a shift that could alter hiring incentives and tilt access toward higher-paying roles.\nJudge hands Trump admin major legal loss on Alligator Alcatraz\nThe injunction orders that construction be paused and bans officials from bringing additional people to the Everglades immigrant detention facility.\nGreen card applicants face new vetting procedures: What to know\nUSCIS will now consider whether green card applicants have expressed any \"anti-Americanism.\"\nDonald Trump scores court win as protections blocked for 60,000 migrants\nThe Trump administration has already ended Temporary Protected Status for more than a million immigrants.\nTrump administration strips security clearance from 37 officials\nDirector of National Intelligence Tulsi Gabbard said the individuals had \"abused the public trust by politicizing and manipulating intelligence.\"\nHigh schooler detained by ICE couldn't shower for a week, teacher says\nBenjamin Marcelo Guerrero-Cruz was detained in the street in Los Angeles while walking his dog.\n\"Cornhusker Clink\" becomes latest Trump immigration detention center\nSome of the new centers have already drawn lawsuits and community backlash over conditions, environmental compliance and transparency.\nSix-year-old detained by ICE agents in New York\nThe girl attends PS 89, the Jose Peralta School of Dreamers in Queens, according to local media.\nGirlfriend says teen soccer star detained by ICE on second day of school\nRoberto Itzep-Caba was reportedly detained by ICE after a traffic stop on the second day of school in Georgia.\nKristi Noem celebrates as 'massive' number leave U.S. population\nExperts told Newsweek that the figures cited by the Department of Homeland Security (DHS) should be treated with caution.\nGOP Rep: Let's Recognize the Patriots Who Defend Our Border | Opinion\nPresident Donald Trump won the popular vote in large part because he promised to end the immigration chaos and return to sanity.\nGreen Card lawsuit against Trump admin heads to new judge as visas run out\nCourt proceedings on Friday could have widespread implications on foreign nationals after Trump's travel ban went into effect in June."
    },
    {
      "url": "https://www.newsweek.com/topic/google",
      "text": "Woman finds home on Google Earth, realizes it \"captured my heart in 2007\"\n\"Google had captured not just my house, but a moment in time,\" Kimberly Burleson, from Texas, told Newsweek.\nHackers issue ultimatum to Google after data breach warning\nThe group's warning comes after one of the company's business partners suffered a data breach in August.\nGoogle issues worldwide Gmail data breach warning\nShinyHunters, the attacker group behind the breach, gained access by impersonating an IT help desk to a Google employee.\nWant to see more of Newsweek in your Google searches? Here's how\nGoogle released a feature allowing users to have more control over their search results algorithm. Here's what it means for you.\nAmazon to issue refunds as Appstore closes on Android: What to know\nThe company said discontinuing the Appstore is part of an \"ongoing effort to streamline and improve our services and programs.\"\nHow To Protect Users' Privacy from Tech Corporations | Opinion\nThe reality is that if Big Tech companies cared about user privacy, they would protect it.\nEye-popping electric bills come due as price of AI revolution\nEven if you've never used ChatGPT or generated an AI image, chances are you're already paying for it.\nRevolutionary 'virtual satellite' shows Earth in detail never seen before\n\"This breakthrough enables scientists to do something that was impossible until now,\" according to the system's creators.\nAuthor shocked by lengths treasure hunter goes to get book unpublished\n\"Realized that I met one of the crazies that lurk in the Superstition Mountains.\"\nYes, Chrome Really Can Survive Without Google | Opinion\nThe idea that only Google can run Chrome is false.\nGoogle Maps media controls go missing—'Working to fix'\nGoogle said that it was working to fix the issue, which left Android users without key features.\nYour smartwatch could carry a hidden health risk\nSmartwatches are a widely worn accessory—with around one in five Americans wearing either a smartwatch or wearable fitness tracker, according to one survey.\nBig Tech's Catastrophic TikTok Gamble | Opinion\nCorporate America has long prided itself on sophisticated risk management and legal compliance. The TikTok episode suggests that when political pressure mounts, even the most sophisticated corporations can make decisions that defy basic business logic.\nDonald Trump's Epstein problem not going away: \"Massive unforced error\"\nOnline searches for Jeffrey Epstein increased by 1,900 percent within a week.\nFriends spot Google Street View car, they know exactly what to do\nLiz Aldridge told Newsweek that she and her friend thought they had \"missed our opportunity to do something crazy.\"\nCEO explains why he's ending \"unlimited\" time off for employees\nRyan Breslow called the idea \"totally broken\" and said it resulted in inconsistent vacation use and burnout among top performers.\nGoogle ordered to pay out millions of dollars to Californians\nA larger Google Android user data case is due to go on trial in April 2026.\nList of companies laying off employees in July\nAmerican consumers are \"being a little bit more careful\" and looking for promotions and sales, a retail expert told Newsweek.\nMillennial 'crumbles'—realizes Gen Zers didn't know ancient Gmail fact\n\"I get random emails intended for people with a slight tweak to it,\" shared one user.\nGoogle bets on nuclear fusion for next generation of clean power\nIn a first-of-its-kind agreement, Google will purchase electricity from a nuclear fusion power plant. But the technology remains years from commercial scale.\nTrump Wants To Control Google's Search Results | Opinion\nPresident Donald Trump stands to gain unprecedented influence over the world's most powerful information tool.\nGoogle issues \"high alert\" warning for insurance sector\nGoogle's Threat Intelligence Group says a prominent hacker group may have already targeted insurance firms in the U.S.\nPentagon pizza monitor appeared to predict Israel attack\nIsrael launched a series of attacks on Iranian nuclear facilities and other targets in the early hours of June 13.\nMajor platforms including Spotify, Google and more suffer outage\nMultiple online platforms are experiencing service disruptions.\nGoogle buyouts offered amid tech industry layoffs\nThe buyout comes as many other Silicon Valley companies are looking to lighten their teams.\nApple and Google face accusations of enabling thieves with device policies\nThieves reportedly find crimes easy to commit when they involve Apple and Google devices.\nNetflix password theft leads to payback across world: \"VPN'd to Australia\"\n\"Maybe if it costs him something he'll get the idea.\"\nElon Musk's robotaxi threatens Uber\nTesla's robotaxi launch could pose a challenge to Uber's progress in the autonomous ride-sharing market, according to analysts.\nHundreds of layoffs hit Silicon Valley\nThe layoffs reflect a growing and concerning trend across California, a state long regarded as the nation's leading tech hub.\nIran issues new threat against Google over Persian Gulf name\nGoogle has faced a similar backlash in Mexico and China, often using multi-labels"
    },
    {
      "url": "https://www.newsweek.com/topic/meta",
      "text": "Horror at \"weird looking\" thing man finds while cleaning attic: \"Nightmare\"\n\"I'm kind of obsessed with it.\"\nTears at how mini dachshund escorts owner's boyfriend to elevator every day\n\"This is just the cutest thing ever,\" one viewer said. \"The way I would be late for work every day,\" another added.\nWoman couldn't wait to \"snuggle\" with her husband, but there's a problem\n\"Every night he weasels his way in between us shoving me to the side of the bed,\" the poster told Newsweek.\nOwner leaves bird cage open, dogs' unexpected reaction caught on pet cam\n\"Trusty and Arthur blow me away sometimes with how gentle and patient they are,\" the pet owner wrote.\nCat owner walks into kitchen, no one prepared for what she sees in cabinet\nLoki's owner Danielle, from New York, told Newsweek: \"There is no cabinet too high for him to find his way into.\"\nTears as dog who has been in shelter for 915 days still hasn't \"lost hope\"\n\"He's SO sweet, especially given the shelter environment. Imagine him in a safe home with kind, caring people\", one user commented.\n17-year-old dog can't chase squirrels anymore, hearts melt at what siblings\n\"Every day, I am so deeply moved by their empathy and goodness,\" the owner of Amba and the other dogs told Newsweek.\nPiotr Szczerek's company flooded with negative reviews after US Open furore\nThe Polish millionaire's paving company has been hit with negative reviews after footage showed him snatching a hat from a child.\nFrightened cat found abandoned in Trader Joe's bag given second chance\n\"He was quite terrified and confused when he first came in,\" a spokesperson for the charity told Newsweek.\nMan buys marble table for $100 in thrift—then learns what it's really worth\nA Brooklyn thrift shopper waited nearly an hour for a price tag—what he left with has left jaws dropping.\nDog uses Alexa to play his favorite songs—and it's all captured on pet cam\nA mix-up from Alexa connected the dog owner to her \"new favorite artist.\"\nTaylor Swift, Travis Kelce score big win after engagement\nThe \"So High School\" singer and Kansas City Chiefs star sent the internet into a frenzy on Tuesday.\nBorder collie learns one specific thing from cat sibling, viewers obsessed\n\"Like siblings, with the younger one copying everything the older one does,\" one person observed. \"And older sibling is not impressed or amused.\"\nTaylor Swift announces engagement: What we know about her ring\nTravis Kelce and Taylor Swift announced their engagement on Instagram.\nFamily get kitten thinking Doberman will \"protect\" it—then get a surprise\n\"I'm not sure if he would actually fight or choose flight—I'll let the viewers decide!\" the owner told Newsweek.\nMan refuses to hold wife's hand—their cat knows what to do\n\"Girls don't need boyfriends, we just need boy cats\", one user said in the comments section.\nInternet can't cope with what cat owner makes out of its fur: \"Would buy\"\nLabubus rose in popularity thanks to celebrities, fashion trends and social media.\nHow dachshund gets downstairs in house has internet in stitches: \"genius\"\nThe idea is \"amazing,\" one viewer said, while another added: \"You literally built a roller coaster for your dog.\"\nOwner forgets to lock crate at night, cam reveals dog's unexpected reaction\nThe golden retriever pup chose his \"beauty sleep\" over freedom to explore the house.\nShelter rescues cat—Stunned by what they discover on microchip\nThe cat escaped after a windstorm blew the door opened six months ago.\nBulldog owners install cat flap—who they find in pet's bed goes viral\n\"Oliver has a better social life than me,\" said one user. Another added: \"You installed a cat door just for him. So sweet.\"\nMan buys video camera at yard sale, disbelief at what he finds on tapes\nWhen Kurt watched the tapes, he told Newsweek he could never have predicted the footage he would find—and the journey to come.\n30 dogs left at home in \"deplorable\" state, shelter acts fast to save them\n\"Hoarders report relying on animals during childhood; pets provided attachment, security, and companionship without fear of rejection,\" an expert told Newsweek.\nGAP's new jeans ad goes viral after Sydney Sweeney, American Eagle drama\nFans say Gap's joyful, dance-filled denim ad breaks from rage-bait trends—praising its diversity, celebs and style.\nDiver captures incredibly rare moment 12-foot octopus comes straight at him\nIt may have looked like the octopus was going in for a \"hug\" but something much more fascinating was taking place.\nFriends driving along road come face-to-face with \"huge\" escaped python\n\"The snake probably was a pet that got too large to keep and too expensive to feed,\" Sheriff Lee Foster told Newsweek.\n\"Confused\" shelter puppy returned after 36 hours in new home breaks hearts\nThis is the small dog's third time being returned by his adopter.\nRescue cat meets new kitten sibling, what happens next melts hearts\n\"A match made in heaven,\" one viewer on social media said, while another added: \"THIS is what the Internet was made for.\"\nCelebrity therapist's eye-opening theory on Taylor Swift and Travis Kelce\nThe couple is engaging in an important connective act, according to acclaimed psychotherapist Esther Perel, who specializes in human relationships.\nMom finally has 'rainbow' baby, unprepared for how two older sons react\n\"When I say they love this baby, it's even deeper than it looks,\" Ashleigh Ferguson told Newsweek."
    },
    {
      "url": "https://www.newsweek.com/foreign-student-visa-holders-loss-us-economy-impact-2119494",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe loss of foreign students will impact the United States' economy, new data shared with Newsweek on Tuesday revealed.\nWith international students spending an average of $35,000 per year in their local communities, a 10 percent drop in this spending could lead to a $3.4 billion dent in U.S. GDP, data from economic analysis platform Implan found.\n\"This is not a college town problem and it's not an education state problem. It's an effect that is going to ripple through the broader economy,\" Bjorn Markeson, academic divisional director at Implan, told Newsweek.\n\"It's not going to be immediate. It's going to take some time. But it's a sizable amount of economic activity that is associated with international students, and those ripple effects are going to be felt both in communities that have colleges and universities and in the economy as a whole.\"\nNewsweek reached out to the U.S. Department of Commerce for comment via email Tuesday morning.\nWhy It Matters\nThe Trump administration has taken a tougher stance on F-1 student visa holders in recent months, with more than 6,000 revoked since January for a variety of reasons, including alleged immigration law violations. Colleges and internation student advocates have warned that the loss of thousands of temporary immigrants could negatively impact schools and the communities they sit within.\nWhat To Know\nThe data released by Implan looked at the potential monetary impact of losing new students, which may not fully be seen until next school year.\nAcross the country, about 26,800 jobs could be lost, along with $1.8 billion in labor income for every 10 percent drop in spending by foreign students who choose to stay at home or go elsewhere.\nAs Newsweek previously reported, more than 1.5 million foreign students were enrolled in schools across the country in fiscal year 2024, up 5 percent on the previous year. The majority came from China and India, countries whose immigrants are seeing increasing pushback from those on the right concerned about high levels of immigration.\nAmid concerns in college campus protests around the Israel-Hamas conflict, the Trump administration began revoking student visa holders' legal status in the spring. Only a few hundred saw their visas revoked for allegedly being pro-Hamas, with the vast majority picked up on minor offenses, such as traffic violations.\nThe Presidents Alliance on Higher Education and Immigration previously warned that the efforts would deter future international students, leading the U.S. to lose at least $44 billion in economic activity annually.\nImplan's data reflected similar potential losses, finding that four states would likely see the biggest impact of the White House's policies:\n- Texas: 2,500 jobs and $300 million in GDP\n- Massachusetts: 1,800 jobs and $260 million in GDP\n- North Carolina: 600 jobs and $70 million in GDP\n- Wisconsin: 400 jobs and $44 million in GDP\nWhen it comes to the sectors likely to be affected, Implan predicted that every 10 percent drop in student visa holder spending would lead to job losses in these key sectors:\n- Food service workers: 2,800\n- Retail sales: 2,400\n- Office support roles: 2,300\n- Health care support staff: 1,700\n- Material movers: 1,600\nMarkeson told Newsweek that it would take time for all the effects to be felt, depending on how many students decide to return or avoid applying for student visas in the first place.\n\"It'll hit first in retailers, restaurants, local service providers, and then it'll slowly ripple through the economy to warehousing, to transportation, to manufacturers,\" Markeson said. \"That's going to take a little more time because it takes time for those dollars to flow through and for businesses to make those kinds of decisions.\"\nUncertainty was a key word in this, Markeson said, as the shifts in immigration policy happened so rapidly and the new school year arrived already. However, the readily available data on F-1 visa holders did mean that this immigrant group was a helpful indicator of how Trump's policies were playing out more widely.\n\"The broader shifts in policy around immigration are a little harder to wrap your hands around in terms of numbers and spending and locations, but a similar principle is going to follow,\" he said. \"That with a networked economy, the effects, the economic effects may hit specifically in given geographic areas that have high proportions of immigrants living there, but their expenditure patterns ripple through the economy and are going to touch it in a lot of different places much further afield.\"\nWhat People Are Saying\nMiriam Feldblum, president and CEO of the Presidents Alliance on Higher Education and Immigration, told Newsweek in June: \"We have close to 400,000 international students participating in some form of training that directly benefits American employers, industry, research across the country.\n\"This is, again, beyond thinking about the $44 billion, but thinking about the actual work, talent, skills that could be lost if we do not ensure that international students want to come here. Our premier destination role is not assured, it is fragile.\"\nA State Department spokesperson told Fox News Digital on August 18: \"Every single student visa revoked under the Trump administration has happened because the individual has either broken the law or expressed support for terrorism while in the United States. About 4,000 visas alone have been revoked because these visitors broke the law while visiting our country, including records of assault and DUIs.\"\nWhat Happens Next\nThe Trump administration said it has placed all U.S. visa holders—including students—under continuing review, while there have also been moves to increase vetting at U.S. embassies and consulates when international students apply for the first time. It is yet to be seen what impact these policies will have on student visa arrivals in the coming year.\nAbout the writer\nDan Gooding is a Newsweek reporter based in New York City. His focus is reporting on immigration and border security. ... Read more"
    }
  ],
  "argos_summary": "International students contributed $43.8 billion to the U.S. economy in the 2023‑24 academic year, a 9.5% rise from the prior year. The Trump administration has revoked more than 6,000 student visas, tightening vetting and raising uncertainty for future enrollment. A 10% decline in student spending could cut U.S. GDP by $3.4 billion and eliminate roughly 26,800 jobs, especially in retail, food service and support roles. States such as Texas, Massachusetts, North Carolina and Wisconsin would feel the largest impact. The policy shift threatens the STEM talent pipeline and could erode U.S. competitiveness in high‑growth sectors.",
  "argos_id": "Y43LVY6MW"
}