{
  "type": "add_article",
  "timestamp": "2025-09-03T00:47:07",
  "processed": false,
  "inputs": {
    "source_article_id": "068EVL5LD",
    "status": "failed"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: tax; UK inheritance tax threshold freeze until 2030 and 2027 pension inclusion will drive demand for trusts and affect property tax planning.",
      "existing_ids": [],
      "new_names": [
        "uk_inheritance_tax"
      ]
    },
    "category": {
      "type": "regulation",
      "motivation": "The article discusses a regulatory change regarding inheritance tax thresholds and the 2027 pension‑tax raid, which constitutes a regulatory or legal development."
    },
    "impact": {
      "priority": 1,
      "motivation": "The article discusses UK trusts and inheritance tax, but without a specific node reference, relevance is uncertain."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "The article highlights long‑term structural shifts in estate planning driven by upcoming tax reforms (2027 pension‑tax raid, frozen inheritance‑tax thresholds) and the growing use of trusts among the wealthy, indicating a fundamental change in wealth‑management behavior."
    },
    "article_node": {
      "id": "068EVL5LD",
      "title": "Should YOU copy Angela Rayner and put your house in a trust?",
      "summary": "Deputy Prime Minister Angela Rayner has split ownership of her £650,000 constituency home into a trust, sparking speculation that the move may be aimed at reducing inheritance tax or safeguarding a special‑needs child, though she cites a court order and a court‑ordered transfer of her ex‑husband’s interest.  The case has highlighted a surge in demand for trusts among the wealthy, as wealth managers warn that the 2027 pension‑tax raid and frozen inheritance‑tax thresholds will push more families toward estate‑planning tools.  However, the article notes that trusts are complex, costly, and may be subject to future tax changes, and that similar property‑tax manoeuvres, such as stamp‑duty avoidance, are under scrutiny by tax authorities and the public.",
      "source": "https://www.dailymail.co.uk/money/mailplus/article-15058603/Should-YOU-copy-Angela-Rayner-house-trust-new-tactic-reduce-inheritance-tax-bill.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
      "published_at": "2025-09-02T22:16:32+01:00",
      "vector_id": null,
      "type": "regulation",
      "temporal_horizon": "fundamental",
      "priority": 1,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 0
    }
  },
  "id": "068EVL5LD"
}