{
  "type": "add_article",
  "timestamp": "2025-08-23T15:45:44",
  "processed": false,
  "inputs": {
    "source_article_id": "3JR35PMNT",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: equity; M&T Bank’s dividend hike signals robust earnings and low payout risk, supporting its stock valuation and income appeal.",
      "existing_ids": [
        "us_10y"
      ],
      "new_names": []
    },
    "category": {
      "type": "company_update",
      "motivation": "The article reports M&T Bank's 11% dividend hike, a company news item not related to earnings, fitting the company_update category."
    },
    "impact": {
      "priority": 3,
      "motivation": "The article reports a significant 11% dividend hike for M&T Bank, directly impacting its financial performance and investor outlook."
    },
    "time_frame": {
      "temporal_horizon": "medium",
      "motivation": "The article highlights a dividend hike and projected earnings growth over the next three years, indicating a medium‑term outlook for M&T Bank."
    },
    "article_node": {
      "id": "3JR35PMNT",
      "title": "M&T Bank (NYSE:MTB) Is Increasing Its Dividend To $1.50",
      "summary": "M&T Bank Corporation announced an 11% hike in its quarterly dividend to $1.50, raising its yield to 2.7% and maintaining a low payout ratio of about 35%, which analysts view as sustainable amid projected earnings growth of 11% over the next three years. The bank’s long‑term dividend track record shows steady increases, with a 6.8% annual growth since 2015 and a history of stable payments. The article also highlights the growing role of artificial intelligence in healthcare, noting that 20 AI‑driven companies—ranging from diagnostics to drug discovery—are under $10 billion in market cap and could offer early investment opportunities. Together, the piece presents M&T Bank as a reliable income play while underscoring the broader AI‑healthcare trend as a potential growth area.",
      "source": "https://finance.yahoo.com/news/m-t-bank-nyse-mtb-122634783.html",
      "published_at": "2025-08-23T12:26:34+00:00",
      "vector_id": null,
      "type": "company_update",
      "temporal_horizon": "medium",
      "priority": 3,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 1
    }
  },
  "id": "3JR35PMNT"
}