{
  "type": "add_article",
  "timestamp": "2025-09-03T04:19:54",
  "processed": false,
  "inputs": {
    "source_article_id": "3RNFBK90T",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: rates; US high‑yield savings rates reflect Fed policy stance and influence short‑term rates.",
      "existing_ids": [
        "fed_policy"
      ],
      "new_names": []
    },
    "category": {
      "type": "market_commentary",
      "motivation": "The article provides a market overview of high-yield youth savings account rates offered by various credit unions and banks, describing product features and competitive returns, which constitutes a market commentary on deposit products."
    },
    "impact": {
      "priority": "hidden",
      "motivation": "The article discusses youth savings account APYs, which does not map to any of the canonical market handles (indices, rates, FX, commodities, credit/vol) and lacks a specific catalyst window, so it is not relevant to the graph’s focus."
    },
    "time_frame": {
      "temporal_horizon": "current",
      "motivation": "The article focuses on current product offerings and short‑term promotional rates for youth savings accounts, describing specific banks and eligibility criteria."
    },
    "article_node": {
      "id": "3RNFBK90T",
      "title": "The Surprising Accounts Where Kids Can Earn 7%, 8%—Even Above 10%",
      "summary": "Kids can earn unusually high APYs—up to 10.38%—on youth savings accounts offered by select credit unions and banks, but the premium rates apply only to balances up to $1,000 (or $500 in some cases) and require a joint account with a parent or guardian. The article lists top providers such as Spectra Credit Union, Chevron Federal Credit Union, and Neighbors Credit Union, noting that membership often involves a free one‑year term with a nonprofit organization. While adult high‑yield savings accounts top out around 5%, the article also highlights that CDs and other deposit products can offer competitive returns for longer‑term investors.",
      "source": "https://www.investopedia.com/the-surprising-accounts-where-kids-can-earn-7-8-even-above-10-percent-11802146",
      "published_at": "2025-09-03T01:15:23+00:00",
      "vector_id": null,
      "type": "market_commentary",
      "temporal_horizon": "current",
      "priority": "hidden",
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 1
    }
  },
  "id": "3RNFBK90T"
}