{
  "type": "add_article",
  "timestamp": "2025-08-16T00:59:54",
  "processed": false,
  "inputs": {
    "source_article_id": "GXNHAI9N9",
    "status": "success",
    "topic_id": "federal_reserve"
  },
  "details": {
    "node_mapping": {
      "motivation": "The article matches the federal_reserve node.",
      "existing_node_ids": "federal_reserve",
      "new_node_dicts": null
    },
    "category": {
      "type": "other",
      "motivation": "No article summary provided, unable to determine relevant category."
    },
    "impact": {
      "priority": 1,
      "motivation": "Unable to assess impact due to lack of article content."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "Unable to assess time frame due to missing article summary; defaulting to fundamental"
    },
    "article_node": {
      "id": "GXNHAI9N9",
      "title": "Sean Kingston is sentenced to 3½ years in prison after mom got 5 years for fraud scheme",
      "summary": "Sean Kingston, the 35-year-old singer known for his hit song \"Beautiful Girls\" and \"Eenie Meenie,\" has been sentenced to three and a half years in prison for his involvement in a months-long scheme that defrauded luxury goods businesses of more than $1 million. The sentence comes after a Florida court convicted Kingston and his mother, Janice Turner, of conspiracy to commit wire fraud and four counts of wire fraud each. Kingston's attorney, Zeljka Bozanic, expressed satisfaction that the court opted for a shorter prison sentence and stated that most of the restitution in this case was paid back before these charges were brought. Prosecutors accused Kingston and Turner of swindling over $480,000 worth of jewelry from one person and, from others, a Cadillac Escalade worth nearly $160,000 and furniture costing upwards of $86,500.",
      "source": "https://www.latimes.com/entertainment-arts/story/2025-08-15/sean-kingston-sentenced-fraud-scheme",
      "published_at": "2025-08-15T21:43:36.274000+00:00",
      "vector_id": null,
      "type": "other",
      "temporal_horizon": "fundamental",
      "priority": 1,
      "relevance_score": null
    }
  },
  "id": "GXNHAI9N9"
}