{
  "type": "add_article",
  "timestamp": "2025-08-22T10:05:03",
  "processed": false,
  "inputs": {
    "source_article_id": "P4UF7DLVM",
    "topic_discovery_motivation": "Article discusses the performance of a top golfer in a major championship, which may relate to sports investment trends and market sentiment around sports events.",
    "status": "failed"
  },
  "details": {
    "multi_topic_discovery": {
      "total_topics_found": 3,
      "existing_ids": [],
      "new_names": [
        "2025 Tour Championship",
        "Scottie Scheffler",
        "PGA Tour"
      ]
    },
    "category": {
      "type": "other",
      "motivation": "The article discusses a sports event, which does not fit any of the predefined categories."
    },
    "impact": {
      "priority": 3,
      "motivation": "The article reports a major event involving the node, detailing a top-ranked athlete’s performance in a high-profile tournament, which is highly relevant to the node’s significance."
    },
    "time_frame": {
      "temporal_horizon": "current",
      "motivation": "The article focuses on the ongoing 2025 Tour Championship and Scheffler’s immediate performance, detailing current round results and upcoming play."
    },
    "article_node": {
      "id": "P4UF7DLVM",
      "title": "Tour Championship: Second round tee times, how to watch, leaderboard today",
      "summary": "Scottie Scheffler, the World No. 1 golfer, is competing in the 2025 Tour Championship, having started strong with a 7-under 63 in the first round, placing him just behind leader Russell Henley. Due to expected rain, the second round will begin earlier than usual, with tee times starting at 8 a.m. ET. Scheffler is already the top FedEx Cup points leader and aims to secure his position in the final event of the PGA Tour season.",
      "source": "https://www.usatoday.com/story/sports/golf/2025/08/22/tour-championship-fedex-cup-playoffs-live-updates-standings/85768408007/",
      "published_at": "2025-08-22T07:01:50+00:00",
      "vector_id": null,
      "type": "other",
      "temporal_horizon": "current",
      "priority": 3,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 1,
      "successful": 0
    }
  },
  "id": "P4UF7DLVM"
}