{
  "type": "add_article",
  "timestamp": "2025-09-01T12:48:07",
  "processed": false,
  "inputs": {
    "source_article_id": "QH2DA7YYD",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: rates; tech layoffs raise US unemployment claims, tightening the labor market and likely dampening US 10Y yields.",
      "existing_ids": [
        "us_unemployment_claims",
        "ust10y"
      ],
      "new_names": []
    },
    "category": {
      "type": "company_update",
      "motivation": "The article reports workforce reductions at major tech companies (Microsoft, Google, Amazon), which constitutes a company-level update on employment changes."
    },
    "impact": {
      "priority": "hidden",
      "motivation": "The article focuses on an individual layoff and general tech hiring slowdown, which does not directly impact macro market handles or canonical themes."
    },
    "time_frame": {
      "temporal_horizon": "current",
      "motivation": "The article centers on immediate events—Mody Khan’s December 2024 layoff and the current hiring slowdown in tech—directly impacting his personal situation and the sector’s labor market."
    },
    "article_node": {
      "id": "QH2DA7YYD",
      "title": "He once earned 6 figures at Microsoft. Now he's unemployed, burning through savings, and at risk of losing his home.",
      "summary": "Mody Khan, a former Microsoft cloud solution architect, was laid off in December 2024 after a series of performance concerns and is now facing financial hardship with limited savings and a looming mortgage default. His job search has been hampered by age bias, perceived lack of startup experience, and possible regional discrimination, despite completing an AI certification. The article highlights broader tech layoffs—Microsoft, Google, Amazon, and others have cut thousands of jobs amid a hiring slowdown—illustrating the sector’s tightening labor market and the challenges mid-career tech professionals face in securing new roles.",
      "source": "https://www.businessinsider.com/former-microsoft-worker-job-hunt-money-struggles-2025-9",
      "published_at": "2025-09-01T07:46:02+00:00",
      "vector_id": null,
      "type": "company_update",
      "temporal_horizon": "current",
      "priority": "hidden",
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 2,
      "successful": 2
    }
  },
  "id": "QH2DA7YYD"
}