{
  "type": "add_article",
  "timestamp": "2025-08-16T00:36:39",
  "processed": false,
  "inputs": {
    "source_article_id": "R1GZFQBST",
    "status": "success",
    "topic_id": "treasury_debt_issuance_strategy"
  },
  "details": {
    "node_mapping": {
      "motivation": "The article matches the treasury_debt_issuance_strategy node.",
      "existing_node_ids": "treasury_debt_issuance_strategy",
      "new_node_dicts": null
    },
    "category": {
      "type": "other",
      "motivation": "Article summary not provided, unable to determine relevant category for treasury_debt_issuance_strategy."
    },
    "impact": {
      "priority": 1,
      "motivation": "Unable to assess impact due to missing article summary."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "Unable to assess due to missing article summary"
    },
    "article_node": {
      "id": "R1GZFQBST",
      "title": "Chiefs’ Chris Jones on Micah Parsons saga: ‘I think Jerry Jones will get it worked out’",
      "summary": "The article covers the stalled contract negotiations between the Dallas Cowboys and star pass rusher Micah Parsons, who requested a trade on August 1 and has remained largely silent. Chiefs All‑Pro Chris Jones expresses confidence that Parsons will stay in Dallas, noting mutual frustration but optimism that a deal will be reached. Cowboys owner Jerry Jones explains that talks have not restarted, emphasizes the importance of keeping Parsons on the field during training camp, and highlights the team's broader contract strategy. The piece also details training‑camp developments, player reactions, and the Cowboys’ handling of other contract situations. Overall, it paints a picture of a tense but potentially resolvable negotiation amid a busy preseason.",
      "source": "https://www.dallasnews.com/sports/cowboys/2025/08/15/dallas-cowboys-micah-parsons-chris-jones-trade/",
      "published_at": "2025-08-15T21:32:37.131000+00:00",
      "vector_id": null,
      "type": "other",
      "temporal_horizon": "fundamental",
      "priority": 1,
      "relevance_score": null
    }
  },
  "id": "R1GZFQBST"
}