{
  "type": "add_article",
  "timestamp": "2025-08-23T20:34:11",
  "processed": false,
  "inputs": {
    "source_article_id": "R7S3BNLSI",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: equity; ADAS reliability concerns may weigh on automotive stocks.",
      "existing_ids": [
        "ford_ai_quality_assurance",
        "ai_evaluation_monitoring"
      ],
      "new_names": []
    },
    "category": {
      "type": "company_update",
      "motivation": "The article discusses multiple company product updates (Tesla, Apple, EZVIZ) and new features, which is a company update."
    },
    "impact": {
      "priority": 3,
      "motivation": "The article discusses frequent malfunctions of advanced driver assistance systems, directly affecting the node's relevance."
    },
    "time_frame": {
      "temporal_horizon": "current",
      "motivation": "The article focuses on recent product releases, beta testing, and immediate industry developments such as Tesla’s FSD rollout, Apple’s upcoming iOS 26 feature, and current ADAS malfunctions."
    },
    "article_node": {
      "id": "R7S3BNLSI",
      "title": "This is why I don't trust my car's driver assist tech",
      "summary": "The article discusses the growing prevalence of advanced driver assistance systems (ADAS) and their frequent malfunctions, highlighting lane‑keeping, emergency braking, blind‑spot monitoring, and adaptive cruise control failures that can cause driver frustration and accidents. It then shifts to Tesla’s latest Cybertruck Full Self‑Driving rollout, noting the subscription model and ongoing beta testing, and contrasts it with Tesla’s broader Autopilot tiers and the need for driver supervision. Additionally, the piece covers Apple’s upcoming iOS 26 Adaptive Power Mode, a subtle battery‑saving feature, and reviews the EZVIZ C8W Pro pan‑and‑tilt security camera’s AI tracking capabilities. Finally, it touches on the decline of manual transmissions in modern vehicles and lists affordable new cars that still offer stick‑shift options.",
      "source": "https://www.pocket-lint.com/this-is-why-i-dont-trust-my-cars-driver-assist-tech/",
      "published_at": "2025-08-23T16:00:17+00:00",
      "vector_id": null,
      "type": "company_update",
      "temporal_horizon": "current",
      "priority": 3,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 2,
      "successful": 2
    }
  },
  "id": "R7S3BNLSI"
}