{
  "type": "add_article",
  "timestamp": "2025-09-04T17:16:10",
  "processed": false,
  "inputs": {
    "source_article_id": "RJLD2PCQR",
    "status": "success"
  },
  "details": {
    "multi_topic_discovery": {
      "topic_discovery_motivation": "Impact: commodities; Gold and copper exploration progress at GoldHaven's Magno Project may tighten supply expectations, potentially supporting prices in the near term.",
      "existing_ids": [
        "copper",
        "gold"
      ],
      "new_names": []
    },
    "category": {
      "type": "company_update",
      "motivation": "The article reports progress on a company's exploration project, which is a company update."
    },
    "impact": {
      "priority": 1,
      "motivation": "The article reports progress on a specific mining project, which is a company‑level event with limited macro‑financial implications beyond the company’s own valuation."
    },
    "time_frame": {
      "temporal_horizon": "medium",
      "motivation": "The article reports on progress of a 2025 exploration program, indicating developments that are expected to unfold over the next few years rather than immediate market moves or long‑term fundamentals."
    },
    "article_node": {
      "id": "RJLD2PCQR",
      "title": "GoldHaven Resources Provides Exploration Update on Magno Project",
      "summary": "GoldHaven Resources reports progress on its Magno Project in British Columbia, highlighting systematic sampling and detailed mapping that confirm structurally controlled skarn and CRD-style mineralization, including high-grade silver and potential indium and gallium. The 2025 exploration program is halfway complete, with new extensions to historic samples and evidence of extensive skarn horizons up to 2 km long. The company anticipates that upcoming laboratory results will guide deeper target definition and unlock the property’s polymetallic potential.",
      "source": "https://finance.yahoo.com/news/goldhaven-resources-provides-exploration-magno-130000552.html?.tsrc=rss&_guc_consent_skip=1756992858",
      "published_at": "2025-09-04T13:00:00+00:00",
      "vector_id": null,
      "type": "company_update",
      "temporal_horizon": "medium",
      "priority": 1,
      "relevance_score": null
    },
    "multi_topic_results": {
      "total_topics": 2,
      "successful": 2
    }
  },
  "id": "RJLD2PCQR"
}