{
  "type": "add_article",
  "timestamp": "2025-08-15T18:32:13",
  "processed": false,
  "inputs": {
    "source_article_id": "WBWY51VXB",
    "status": "success",
    "topic_id": "eurusd"
  },
  "details": {
    "node_mapping": {
      "motivation": "The article matches the EURUSD node.",
      "existing_node_ids": "eurusd",
      "new_node_dicts": null
    },
    "category": {
      "type": "other",
      "motivation": "No article summary provided, cannot determine relevant category for the node 'eurusd'."
    },
    "impact": {
      "priority": 1,
      "motivation": "Article summary not provided, cannot assess impact on EUR/USD."
    },
    "time_frame": {
      "temporal_horizon": "fundamental",
      "motivation": "Insufficient article summary to determine time frame."
    },
    "article_node": {
      "id": "WBWY51VXB",
      "title": "Meet A Couple Restaurant MVPs Who Fly Under The Radar",
      "summary": "The piece profiles several Seattle culinary figures and venues, beginning with Sean Hartley’s journey from physics to restaurant operations, his role as facilities manager for Tom Douglas Restaurants, and his recent work on the Mr. Fish re‑launch. It then highlights Deni Reilly’s partnership with her husband at The Majestic Grill, emphasizing their team‑building culture and post‑pandemic staff retention. The article also spotlights Cafe Juanita’s tasting menu offerings, reservation policies, and dining etiquette, alongside a brief history of Seattle’s long‑standing Café Lago and its Tuscan‑inspired cuisine. Additionally, it covers Duke Moscrip’s advocacy for wild Alaskan salmon, his restaurant’s focus on sustainable fish, and his foundation’s fundraising efforts. Finally, the narrative touches on local favorites such as Sea Wolf bakery, the 1 Hotel’s dining and lodging experiences, and a quick guide to nearby attractions and eateries in Seattle’s waterfront and downtown areas.",
      "source": "https://www.forbes.com/sites/lesliekelly/2025/08/15/meet-a-couple-restaurant-mvps-who-fly-under-the-radar/",
      "published_at": "2025-08-15T15:23:27+00:00",
      "vector_id": null,
      "type": "other",
      "temporal_horizon": "fundamental",
      "priority": 1,
      "relevance_score": null
    }
  },
  "id": "WBWY51VXB"
}