{
  "type": "add_article",
  "timestamp": "2025-08-15T04:12:26",
  "processed": false,
  "inputs": {
    "source_article_id": "XQNS5HFZ0",
    "status": "success",
    "topic_id": "us_china_trade_relations"
  },
  "details": {
    "node_mapping": {
      "motivation": "The article discusses ongoing U.S.-China trade negotiations, particularly regarding rare earth minerals, which aligns with the existing focus on U.S.-China trade relations.",
      "existing_node_ids": "us_china_trade_relations",
      "new_node_dicts": null
    },
    "category": {
      "type": "geopolitical",
      "motivation": "The article discusses the state of trade relations between the US and China, which is a significant geopolitical event affecting global markets."
    },
    "impact": {
      "priority": 3,
      "motivation": "The article discusses developments in US-China trade relations, which directly affects this node."
    },
    "time_frame": {
      "temporal_horizon": "medium",
      "motivation": "The article addresses ongoing developments and trends in US-China trade relations, suggesting a focus on both immediate impacts and longer-term implications."
    },
    "article_node": {
      "id": "XQNS5HFZ0",
      "title": "California Asks Court to Stop LA Troop Deployment",
      "summary": "Trade talks between the U.S. and China are ongoing in London, with Treasury Secretary Bessent leaving to testify before Congress while his colleagues continue negotiations. The talks, which have lasted over two days, focus on easing export controls and gaining access to China's rare earth minerals. Meanwhile, President Trump has deployed U.S. Marines and National Guard troops to Los Angeles amid protests, blaming outside agitators for the violence, while California's governor seeks to block this military presence, raising concerns about federal overreach and state sovereignty.",
      "source": "https://www.bloomberg.com/news/videos/2025-06-11/balance-of-power-late-edition-6-10-2025-video",
      "published_at": "2025-06-11T00:04:37.904000+00:00",
      "vector_id": null,
      "type": "geopolitical",
      "temporal_horizon": "medium",
      "priority": 3,
      "relevance_score": null
    }
  },
  "id": "XQNS5HFZ0"
}