{
  "url": "https://www.foxbusiness.com/politics/white-house-economist-backs-trump-firing-labor-stats-head-hits-partisan-pattern-jobs-data-propaganda",
  "authorsByline": "Danielle Wallace",
  "articleId": "5fcafb4d89574eb484f60496c2167618",
  "source": {
    "domain": "foxbusiness.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/07/0/0/gettyimages-2222161773-1-scaled.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T14:56:15-04:00",
  "addDate": "2025-08-03T19:07:09.599111+00:00",
  "refreshDate": "2025-08-03T19:07:09.599112+00:00",
  "score": 1.0,
  "title": "White House economist backs Trump firing Labor stats head, hits 'partisan pattern' in jobs data: 'Propaganda'",
  "description": "National Economic Council Director Kevin Hassett supports President Trump firing Bureau of Labor Statistics head, citing unreliable job data and revisions.",
  "content": "National Economic Council Director Kevin Hassett on Sunday backed President Donald Trump’s decision to fire the head of the Bureau of Labor Statistics (BLS), citing an alleged \"partisan pattern\" in U.S. job data reporting.\n\nIn an appearance on \"Fox News Sunday,\" Hassett referenced the timing of a preliminary benchmark revision released in August 2024 – shortly after former President Joe Biden dropped out of the 2024 presidential race. The revision revealed that job gains from March 2023 through March 2024 had been overstated by 818,000 jobs. Hassett said it represented the \"biggest data revision in 50 years.\"\n\n\"Look, the fact is that when the data are unreliable, when they keep being revised all over the place, then there are going to be people that wonder if there's a partisan pattern in the data,\" Hassett told \"Fox News Sunday\" host Shannon Bream. \"And so, if you look back to just a year ago, for example, there was another massive revision from the BLS, almost a million jobs, a million jobs down, that said that the Joe Biden jobs record was a lot worse than people thought. But we didn't get the downward revision until after Joe Biden had dropped out. And so once again, it made people think, what are they doing?\"\n\nHassett accused the BLS of a lack of transparency, saying the bureau did not provide any detailed explanation of the August 2024 revision.\n\nTRUMP NAYSAYERS WHO PREDICTED ECONOMIC DOOM AGAIN PROVEN WRONG AFTER LATEST JOBS REPORT\n\n\"Instead, they have this little black box that moves the numbers around and makes people wonder, sometimes with partisan patterns. And so I think what we need is a fresh set of eyes at the BLS, somebody who can clean this thing up,\" Hassett said.\n\nThe White House economic adviser made reference to his speech at the 2015 BLS symposium where he spoke about modernization on the 100th anniversary of the Consumer Expenditure Survey.\n\n\"I talked about how the data can't be propaganda,\" Hassett said. \"The data has to be something that you can trust because decision makers throughout the economy trust that these are the data, that they can build a factory because they believe, or cut interest rates because they believed. And if the data aren't that good, then it's a real problem for the U.S. And right now, the data have become very unreliable with these massive revisions over the last few years.\"\n\nThe BLS reported on Friday that , well below the 110,000 estimate of economists polled by LSEG. The report also revised job growth in May and June downward. May's gains were pared back by 125,000 to just 19,000 jobs created, while the June figures were revised down by 133,000 to just 14,000 jobs added that month.\n\nAccording to the BLS, the last time a revision was down more than 133,000 was in March 2021, when it was revised down by 146,000 one year into the COVID-19 pandemic.\n\nTrump claimed that the country's job numbers \"are being produced by a Biden Appointee, Dr. Erika McEntarfar, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala's chances of Victory.\" McEntarfar was appointed by Biden but received bipartisan support in the Senate earlier in 2024, with current Vice President JD Vance among Republican senators who supported her before he earned a place on Trump's presidential ticket.\n\nDespite the \"disappointing\" jobs report, Hassett pointed to how the Bureau of Economic Analysis (BEA) reported on July 30 that GDP increased at an annual rate of 3.0% in the second quarter.\n\n\"It's really important to keep our eyes on the horizon and the eyes on the horizon are seeing really smooth sailing ahead,\" Hassett said. \"When I first saw the big revisions, which, by the way, were the largest revisions going all the way back for 50 years, if we exclude the COVID years, when I saw those revisions I thought it must be a typo. That I've never seen a revision like this.\"\n\nHassett argued that Trump's \"big, beautiful bill\" would offset any impacts of tariffs on the U.S. economy and boost average family income by $10,000.\n\n\"The Congressional Budget Office has said that we're looking at about three trillion in new tariffs in the United States. That's something that's really going to help us balance the budget. And all inflation numbers are lower than they've been in five years,\" he said.\n\nHe also further backed the president's call for new leadership at the bureau.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"They have to get back to ground zero and look at why the numbers have started to be so unreliable. And, you know, why did the numbers not really pick up the gig economy and so on,\" Hassett said. \"So right now we've got BLS numbers that aren't really a lot better than they were during COVID, and we need to understand why. And so I think that the president's right to call for new leadership. I think Erika is a terrific person, but I think that it's time for someone to get in there and fix this because these numbers are so crucial. \"",
  "medium": "Article",
  "links": [
    "https://www.foxbusiness.com/economy/us-jobs-report-july-2025",
    "https://www.foxbusiness.com/video/6376511037112",
    "https://www.foxbusiness.com/apps-products",
    "https://www.foxbusiness.com/economy/us-economy-created-818000-fewer-jobs-than-previously-reported",
    "https://www.foxbusiness.com/politics/trump-orders-termination-labor-statistics-official-after-jobs-report-downward-revisions",
    "https://www.foxnews.com/politics/trump-naysayers-who-predicted-economic-doom-again-proven-wrong-after-latest-jobs-report",
    "https://www.foxnews.com/opinion/lefts-tariff-doomsday-predictions-fall-flat-trumps-america-thrives"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "jobs data",
      "weight": 0.093572535
    },
    {
      "name": "U.S. job data reporting",
      "weight": 0.0878463
    },
    {
      "name": "BLS numbers",
      "weight": 0.08694616
    },
    {
      "name": "job gains",
      "weight": 0.08012729
    },
    {
      "name": "LATEST JOBS REPORT",
      "weight": 0.07957799
    },
    {
      "name": "job growth",
      "weight": 0.077754855
    },
    {
      "name": "Kevin Hassett",
      "weight": 0.071735285
    },
    {
      "name": "Hassett",
      "weight": 0.070684284
    },
    {
      "name": "former President Joe Biden",
      "weight": 0.06803648
    },
    {
      "name": "National Economic Council Director Kevin Hassett",
      "weight": 0.06696395
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9658203125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.91259765625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.67578125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.4990234375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.3076171875
    }
  ],
  "sentiment": {
    "positive": 0.032562256,
    "negative": 0.81396484,
    "neutral": 0.15307617
  },
  "summary": "National Economic Council Director, Kevin Hassett, has supported President Donald Trump's decision to fire the head of the Bureau of Labor Statistics (BLS) due to an alleged \"partisan pattern\" in U.S. job data reporting. Hassett cited a preliminary benchmark revision in August 2024, which revealed that job gains from March 2023 through March 2024 had been overstated by 818,000 jobs. This was the \"biggest data revision in 50 years,\" according to Hassett. He also accused the BLS of a lack of transparency and provided no detailed explanation of the August 2024 revision. The BLS reported that job growth in May and June was below the 110,000 estimate of economists polled by LSEG. Despite these setbacks, Hassett remains hopeful about the future of the economy and the potential impact of tariffs on the economy.",
  "shortSummary": "National Economic Council Director Kevin Hassett supports President Donald Trump's decision to fire the BLS head citing a partisan pattern in job data revisions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a8889d20070d4660a3c6fdc877265b40",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxbusiness.com/economy/us-economy-created-818000-fewer-jobs-than-previously-reported",
      "text": "US economy created 818,000 fewer jobs than previously reported\nLabor Department releases key payroll data\nU.S. job growth during much of the past year was significantly weaker than previously reported, according to new data published Wednesday.\nThe Bureau of Labor Statistics revised down its total tally of jobs created in the year through March by 818,000 as part of its preliminary annual benchmark review of payroll data. That suggests the economy added an average of 174,000 jobs per month during that time period — below the previous 242,000 estimate. On a monthly basis, that amounts to about 68,000 fewer jobs.\nIt marks the largest downward revision since 2009.\n\"The labor market appears weaker than originally reported,\" said Jeffrey Roach, chief economist at LPL Financial. \"A deteriorating labor market will allow the Fed to highlight both sides of the dual mandate and investors should expect the Fed to prepare markets for a cut at the September meeting.\"\nUS JOB GROWTH SLOWS TO 114K IN JULY WHILE UNEMPLOYMENT UNEXPECTEDLY JUMPS\nThe revised data is mostly derived from state unemployment tax records that employers are required to file. The figure, which is preliminary, may be updated when the government releases the final figure in February 2025.\nProfessional and business services accounted for nearly half of the downward revision. There were also large downward revisions in other sectors including manufacturing, leisure and hospitality and information.\nFederal Reserve policymakers are closely watching for signs that the labor market is starting to crack in the face of high interest rates.\nINTEREST RATE CUTS ARE ON THE HORIZON, BUT HIGH MORTGAGE RATES COULD BE HERE TO STAY\nMarkets started to grow concerned about the state of the labor market after the worse-than-expected July jobs report, which showed that employers added just 114,000 jobs last month and the jobless rate unexpectedly climbed to 4.3%.\nThe rise in unemployment triggered the so-called Sahm rule, an indicator that is used to provide an early recession signal. The rule stipulates that a recession is likely when the three-month moving average of the jobless rate is at least a half-percentage point higher than the 12-month low.\nOver the past three months, the unemployment rate has averaged 4.13%, which is 0.63 percentage points higher than the 3.5% rate recorded in July 2023. The Sahm rule has successfully predicted every recession since 1970.\n\"The Fed will see the revisions as another reason to pull forward plans to reduce interest rates,\" said Bill Adams, chief economist at Comerica Bank. \"The June dot plot, which showed most FOMC members thought only one or two quarter percentage point cuts would likely be appropriate by year-end, looks quite stale after this release.\"\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nInvestors widely expect the Fed to cut rates at its next meeting on Sept. 18. About 67% think the Fed will make a standard 25-basis point reduction, while 32.5% are bracing for a bigger half-point cut."
    },
    {
      "url": "https://www.foxbusiness.com/politics/trump-orders-termination-labor-statistics-official-after-jobs-report-downward-revisions",
      "text": "Trump orders termination of labor statistics official after jobs report and downward revisions\nEconomy added just 74,000 jobs in July, well below 110,000 estimate, with major downward revisions to prior months\nPresident Donald Trump on Friday lashed out at the Bureau of Labor Statistics (BLS) and said he will fire its labor statistics chief after the U.S. economy added fewer jobs than expected in July and large downward revisions were made in the prior two months, which suggests the economy and labor market are weaker than previously believed.\nThe BLS reported on Friday that 74,000 jobs were added in July, well below the 110,000 estimate of economists polled by LSEG. The report also revised job growth in May and June downward. May's gains were pared back by 125,000 to just 19,000 jobs created, while the June figures were revised down by 133,000 to just 14,000 jobs added that month.\nAccording to the BLS, the last time a revision was down more than 133,000 was in March 2021, when it was revised down by 146,000 one year into the COVID pandemic.\nUS JOB GROWTH COOLED IN JULY AMID GROWING ECONOMIC UNCERTAINTY\nTrump took to his Truth Social platform and wrote, \"I was just informed that our Country's 'Jobs Numbers' are being produced by a Biden Appointee, Dr. Erika McEntarfar, the Commissioner of Labor Statistics, who faked the Jobs Numbers before the Election to try and boost Kamala's chances of Victory. This is the same Bureau of Labor Statistics that overstated the Jobs Growth in March 2024 by approximately 818,000 and, then again, right before the 2024 Presidential Election, in August and September, by 112,000. These were Records – No one can be that wrong?\"\n\"We need accurate Jobs Numbers. I have directed my Team to fire this Biden Political Appointee, IMMEDIATELY. She will be replaced with someone much more competent and qualified,\" Trump continued.\n\"Important numbers like this must be fair and accurate, they can't be manipulated for political purposes,\" the president wrote. \"McEntarfer said there were only 73,000 Jobs added (a shock!) but, more importantly, that a major mistake was made by them, 258,000 Jobs downward, in the two prior months. Similar things happened in the first part of the year, always to the negative.\"\n\"The Economy is BOOMING under 'TRUMP' despite a Fed that also plays games, this time with Interest Rates, where they lowered them twice, and substantially, just before the Presidential Election, I assume in the hopes of getting 'Kamala' elected – How did that work out? Jerome 'Too Late' Powell should also be put 'out to pasture.' Thank you for your attention to this matter!\"\nFED'S FAVORED INFLATION GAUGE SHOWS CONSUMER PRICES ROSE AGAIN IN JUNE\nIn an ironic twist, McEntarfar was confirmed in the Senate in January 2024 by a vote of 86-8. One of those voting for her confirmation was then-Senator JD Vance.\nThe labor force participation rate was 62.2%, having changed little from a month ago – though it has declined by 0.5 percentage point in the last year.\nThe number of people considered to be long-term unemployed, defined as being jobless for 27 weeks or more, increased by 179,000 to 1.8 million. The long-term unemployed accounted for 24.9% of all unemployed people in July.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nWorkers who were employed part-time for economic reasons changed little in July, coming in at 4.7 million. These workers would've preferred full-time jobs but were working part-time because their hours were reduced, or they were unable to find full-time jobs."
    },
    {
      "url": "https://www.foxbusiness.com/economy/us-jobs-report-july-2025",
      "text": "US job growth cooled in July amid growing economic uncertainty\nDepartment of Labor releases closely watched July jobs report\nThe U.S. economy added jobs in July – though it was at a slower pace than in the last several months as uncertainty over economic conditions mounted.\nThe Labor Department on Friday reported that employers added 73,000 jobs in July, a figure that was cooler than the 110,000 gain that was the estimate of economists polled by LSEG.\nThe unemployment rate ticked slightly higher to 4.2%, in line with LSEG economists' estimate.\nJob gains in the prior two months were both revised, with job creation in May revised downward by 125,000 from a gain of 144,000 to 19,000; and June job gains were revised down by 133,000 from a gain of 147,000 to 14,000. Taken together, employment in May and June was 258,000 lower than previously reported, which the Bureau of Labor Statistics noted were \"larger than normal\" revisions.\nFED'S FAVORED INFLATION GAUGE SHOWS CONSUMER PRICES ROSE AGAIN IN JUNE\nPrivate sector payrolls rose by 83,000 in July, below the 100,000 job gain projected by LSEG.\nGovernment payrolls declined by 10,000 in July. The decrease was driven by a reduction of 12,000 jobs in the federal government, which has seen payrolls decline by 84,000 since its January peak. Employees on paid leave or receiving ongoing severance pay are counted as employed in the BLS' establishment survey.\nState government added 5,000 jobs and local government had employment decline by 3,000 jobs in July.\nThe manufacturing sector shed 11,000 jobs in July, a steeper drop than the decline of 3,000 jobs estimated by LSEG.\nHealthcare employment rose by 55,000 jobs in July, above the average monthly gain of 42,000 over the past 12 months. Most of July's gains occurred in ambulatory healthcare services (+34,000) and hospitals (+16,000).\nSocial assistance added 18,000 jobs last month amid continued job growth in individual and family services (+21,000).\nFEDERAL RESERVE HOLDS KEY INTEREST RATE STEADY FOR FIFTH STRAIGHT MEETING DESPITE TRUMP'S PRESSURE\nThe labor force participation rate was 62.2%, having changed little from a month ago – though it has declined by 0.5 percentage point in the last year.\nThe number of people considered to be long-term unemployed, defined as being jobless for 27 weeks or more, increased by 179,000 to 1.8 million. The long-term unemployed accounted for 24.9% of all unemployed people in July.\nWorkers who were employed part-time for economic reasons changed little in July, coming in at 4.7 million. These workers would've preferred full-time jobs but were working part-time because their hours were reduced, or they were unable to find full-time jobs.\nMultiple jobholders decreased by 523,000 jobs in July and represented 5.1% of the labor force, the lowest level in the past year.\nTRUMP ESCALATES CANADA TARIFFS TO 35% WHILE SETTING NEW TARIFF RATES FOR DOZENS OF OTHER COUNTRIES\nThe weaker-than-expected jobs report comes amid elevated levels of economic uncertainty stemming from trade policy, including the impact of tariffs on inflation and consumer prices. The Federal Reserve has held off on interest rate cuts again this week due to signs that tariff costs are starting to push inflation higher and further away from the central bank's 2% target rate.\nFed Chair Jerome Powell previously noted that the central bank likely would've cut earlier this year but for concerns about tariffs fueling inflation and pushing consumer prices higher. On Wednesday, the June personal consumption expenditures (PCE) index, the Fed's preferred inflation gauge, showed headline PCE rose from 2.3% in May to 2.6% in June, while core PCE ticked higher to 2.8%.\n\"What had looked like a Teflon labor market showed some scratches this morning, as tariffs continue to work their way through the economy,\" said Ellen Zentner, chief economic strategist for Morgan Stanley Wealth Management. \"A Fed that still appeared hesitant to lower rates may see a clearer path to a September cut, especially if data over the next month confirms that trend.\"\nAlexandra Wilson-Elizondo, global co-CIO of multi-asset solutions at Goldman Sachs Asset Management, noted that the weaker job growth in July coupled with the large revisions to the past two months' gains \"drops us below the critical 80K-100K replacement level, flashing warning signs as the labor market cools – the U.S. slowdown is starting to take shape.\"\n\"Importantly, the underlying deterioration is grabbing our attention: cyclical employment has flatlined while falling participation rates are somewhat masking unemployment weakness,\" she continued. \"While overall levels are not flashing red, the trend is cause for concern. This print is just one number in a week filled with important economic data releases, but the miss directly challenges the Fed's hawkish posture from this week's FOMC meeting.\"\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nThe market's expectations surrounding a September rate cut by the Federal Reserve rallied in response to the weaker-than-expected July jobs report after they were dampened by rising inflation data and the Fed's hawkish stance earlier in the week.\nThe probability of the Fed leaving interest rates at its current range of 4.25% to 4.5% in September fell from 62.3% a day ago to 26.4% on Friday in the wake of the jobs report, according to the CME FedWatch tool. The chance of a 25-basis-point rate cut rose from 37.7% to 73.6% as well."
    },
    {
      "url": "https://www.foxnews.com/politics/trump-naysayers-who-predicted-economic-doom-again-proven-wrong-after-latest-jobs-report",
      "text": "Predictions of President Donald Trump bringing economic doom to the U.S. fell flat once again with the release of the latest jobs report Thursday.\nThe Labor Department reported that employers added 147,000 jobs in June, a figure above the estimate of economists polled by LSEG, who projected 110,000 jobs would be added. The strong and growing economy comes after months of Democrats painting a gloomy picture of America's economic future under Trump.\n\"The Trump recession is on its way,\" Sen. Jeff Merkley, D-Ore., declared in March.\n\"Donald Trump is ruining the economy on purpose,\" complained Sen. Brian Schatz, D-Hawaii, in April.\nLOEFFLER: TRUMP’S ‘ONE BIG, BEAUTIFUL BILL’ COULD CEMENT ECONOMIC LEGACY FOR DECADES\n\"We'll be paying more for everything – groceries, food, cars, homes, toys, electronics, everything that you buy,\" he predicted at the time.\nMerkley and Schatz did not respond when asked by Fox News Digital whether they stand by their comments.\nTRUMP WAGERS US ECONOMY IN HIGH-STAKES TARIFF GAMBLE AT 100-DAY MARK\nRep. Pramila Jayapal, D-Wash., accused Trump of being \"irresponsible about the economy\" in March, referring to his tariff plan that has since led to trade deals with countries across the globe.\nEchoing that sentiment was Sen. Ed Markey, D-Mass., blasting the tariff plan as \"ham-handed.\"\nJayapal and Markey also did not respond when asked about the current performance of the U.S. economy.\nTRUMP, SOUTH KOREA'S NEW PRESIDENT AGREE TO MAKE A DEAL ON TARIFFS THAT WOULD SATISFY BOTH COUNTRIES\nMeanwhile, the Trump administration wasted no time in gloating over June's jobs report on Thursday.\n\"For the FOURTH month in a row, jobs numbers have beat market expectations with nearly 150,000 good jobs created in June. American-born workers have accounted for ALL of the job gains since President Trump took office and wages continue to rise,\" White House press secretary Karoline Leavitt said in a statement.\nCLICK HERE TO GET THE FOX NEWS APP\n\"The economy is booming again and it will only get better when the One, Big, Beautiful Bill is passed and implemented,\" she added."
    },
    {
      "url": "https://www.foxnews.com/opinion/lefts-tariff-doomsday-predictions-fall-flat-trumps-america-thrives",
      "text": "In April, President Donald Trump followed through on a campaign promise and implemented tariffs on the majority of the United States’ trading partners. Predictably, the left lost their collective minds and giddily spoke of the coming collapse of the American economy, higher inflation and massive unemployment.\nPerhaps no one on the left stoked fear more than the Democrat senator from Hawaii, Brian Schatz. Schatz lamented that, \"Donald Trump is ruining the economy on purpose … we'll be paying more for everything – groceries, food, cars, homes, toys, electronics, everything that you buy. This is about the ability for people to pay for college. This is about the ability for people to retire with dignity and comfort. Trillions of dollars of wealth are being demolished. These are everyday people panicked about how much more expensive their next trip to Walmart or Costco will be, or when they'll lose their job.\"\nSchatz may be a liberal senator from the Rainbow state, but he is apparently no Nostradamus. The American economy is doing quite well and shows no signs of slowing down.\nUS IS IN A ‘SUPER PLACE,’ SAYS COMMERCE SECRETARY ON CHINA TRADE TALKS\nThe United States added nearly 140,000 new jobs in May 2025, beating forecasts and the unemployment rate remained at 4.2%. Since February 2025, the first full month of Trump’s second term, the United States has added more than 515,000 jobs, despite shrinking the size of the Federal Government.\nInflation remains low as well.\nThe Consumer Price Index (CPI), a measure of inflation, was 2.4% for the 12 months ending in May 2025, slightly up from the 2.3% number in April. Core inflation was at 2.8% for the third straight months, growing at the slowest pace since inflation surged in the spring of 2021.\nTRUMP SUPPORTERS FEAR $36T DEBT YET BACK PRESIDENT'S AGENDA\nInflation was held down by declines in airfare, new and used cars, clothing and energy costs.\nThe positive job news and low inflation have caused consumer confidence to surge.\nConsumer confidence rose 12.3 points in May to a reading of 98, the Conference Board said in its latest survey, the first monthly gain since November and the biggest monthly increase since March 2021. The reading of 98 was significantly higher than economists’ prediction of 88.\nAnd it isn’t just consumer confidence that is improving. Small business confidence is also on the rise.\nTRUMP, SOUTH KOREA'S NEW PRESIDENT AGREE TO MAKE A DEAL ON TARIFFS THAT WOULD SATISFY BOTH COUNTRIES\nU.S. small-business confidence improved in May. The National Federation of Independent Business said on June 10 that its Small Business Optimism Index increased three points to 98.8 last month, rising for the first time since December 2024.\nCLICK HERE FOR MORE FOX NEWS OPINION\nIn other positive economic news, consumer debt is finally decreasing.\nAfter reaching a historic peak in the last quarter of 2024, credit card balances are improving across the nation. Credit card balances \"fell to $1.18 trillion in the first quarter of 2025, according to the latest Household Debt and Credit Report from the Federal Reserve Bank of New York … down $29 billion, or 2.4% from the previous quarter,\" according to CBS News.\nPerhaps credit card debt is decreasing because it is costing Americans less to fill their cars with gas. The average regular gas price in the United States, as of June 10, was \"$3.121 per gallon, according to AAA, down from $3.445 a year ago. Gas prices are currently below $3 in 29 states,\" reported Nerdwallet.\nSo no, Senator Schatz, Trump has not destroyed the economy. The economy is adding jobs. Inflation is lower under Trump than under former President Joe Biden. Consumer and small business confidence is increasing, and Americans are even starting to pay down their credit card debt.\nAnd it isn’t just consumer confidence that is improving. Small business confidence is also on the rise.\nCLICK HERE TO GET THE FOX NEWS APP\nGiven the June 11 announcement of a trade deal between the United States and China, we should expect to see confidence improve, continued investment in the country by businesses, and more jobs to be created.\nThe United States’ economy is robust and resilient. It will remain so as long as Trump’s economic policies remain in place."
    }
  ],
  "argos_summary": "National Economic Council Director Kevin Hassett supported President Trump's decision to fire the head of the Bureau of Labor Statistics (BLS) due to concerns over alleged partisan bias in job data reporting, particularly following a significant downward revision of 818,000 jobs in August 2024. Hassett criticized the BLS for a lack of transparency and called for new leadership to restore trust in the data, which he claimed has become unreliable. The recent jobs report indicated a slowdown in job growth, with only 74,000 jobs added in July, raising concerns about the labor market's strength amid economic uncertainty.",
  "argos_id": "0CSTSH98X"
}