{
  "url": "https://venturebeat.com/ai/why-the-ai-era-is-forcing-a-redesign-of-the-entire-compute-backbone/",
  "authorsByline": "Google, Amin Vahdat",
  "articleId": "5a4c33c657b044359d7b954d066b8306",
  "source": {
    "domain": "venturebeat.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://venturebeat.com/wp-content/uploads/2025/08/Rethinking-the-internet.webp?w=1024?w=1200&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:05:00+00:00",
  "addDate": "2025-08-03T18:11:14.453743+00:00",
  "refreshDate": "2025-08-03T18:11:14.453746+00:00",
  "score": 1.0,
  "title": "Why the AI era is forcing a redesign of the entire compute backbone",
  "description": "Guest Want smarter insights in your inbox? Sign up for our weekly newsletters to get only what matters to enterprise AI, data, and security leaders. Subscribe Now The past few decades have seen almost unimaginable advances in compute performance and efficiency, enabled by Moore’s Law and underpinned by scale-out commodity hardware and loosely coupled software. This […]",
  "content": "The past few decades have seen almost unimaginable advances in compute performance and efficiency, enabled by Moore’s Law and underpinned by scale-out commodity hardware and loosely coupled software. This architecture has delivered online services to billions globally and put virtually all of human knowledge at our fingertips.\n\nBut the next computing revolution will demand much more. Fulfilling the promise of AI requires a step-change in capabilities far exceeding the advancements of the internet era. To achieve this, we as an industry must revisit some of the foundations that drove the previous transformation and innovate collectively to rethink the entire technology stack. Let’s explore the forces driving this upheaval and lay out what this architecture must look like.\n\nFor decades, the dominant trend in computing has been the democratization of compute through scale-out architectures built on nearly identical, commodity servers. This uniformity allowed for flexible workload placement and efficient resource utilization. The demands of gen AI, heavily reliant on predictable mathematical operations on massive datasets, are reversing this trend.\n\nWe are now witnessing a decisive shift towards specialized hardware — including ASICs, GPUs, and tensor processing units (TPUs) — that deliver orders of magnitude improvements in performance per dollar and per watt compared to general-purpose CPUs. This proliferation of domain-specific compute units, optimized for narrower tasks, will be critical to driving the continued rapid advances in AI.\n\nBeyond ethernet: The rise of specialized interconnects\n\nThese specialized systems will often require “all-to-all” communication, with terabit-per-second bandwidth and nanosecond latencies that approach local memory speeds. Today’s networks, largely based on commodity Ethernet switches and TCP/IP protocols, are ill-equipped to handle these extreme demands.\n\nAs a result, to scale gen AI workloads across vast clusters of specialized accelerators, we are seeing the rise of specialized interconnects, such as ICI for TPUs and NVLink for GPUs. These purpose-built networks prioritize direct memory-to-memory transfers and use dedicated hardware to speed information sharing among processors, effectively bypassing the overhead of traditional, layered networking stacks.\n\nThis move towards tightly integrated, compute-centric networking will be essential to overcoming communication bottlenecks and scaling the next generation of AI efficiently.\n\nFor decades, the performance gains in computation have outpaced the growth in memory bandwidth. While techniques like caching and stacked SRAM have partially mitigated this, the data-intensive nature of AI is only exacerbating the problem.\n\nThe insatiable need to feed increasingly powerful compute units has led to high bandwidth memory (HBM), which stacks DRAM directly on the processor package to boost bandwidth and reduce latency. However, even HBM faces fundamental limitations: The physical chip perimeter restricts total dataflow, and moving massive datasets at terabit speeds creates significant energy constraints.\n\nThese limitations highlight the critical need for higher-bandwidth connectivity and underscore the urgency for breakthroughs in processing and memory architecture. Without these innovations, our powerful compute resources will sit idle waiting for data, dramatically limiting efficiency and scale.\n\nToday’s advanced machine learning (ML) models often rely on carefully orchestrated calculations across tens to hundreds of thousands of identical compute elements, consuming immense power. This tight coupling and fine-grained synchronization at the microsecond level imposes new demands. Unlike systems that embrace heterogeneity, ML computations require homogeneous elements; mixing generations would bottleneck faster units. Communication pathways must also be pre-planned and highly efficient, since delays in a single element can stall an entire process.\n\nThese extreme demands for coordination and power are driving the need for unprecedented compute density. Minimizing the physical distance between processors becomes essential to reduce latency and power consumption, paving the way for a new class of ultra-dense AI systems.\n\nThis drive for extreme density and tightly coordinated computation fundamentally alters the optimal design for infrastructure, demanding a radical rethinking of physical layouts and dynamic power management to prevent performance bottlenecks and maximize efficiency.\n\nTraditional fault tolerance relies on redundancy among loosely connected systems to achieve high uptime. ML computing demands a different approach.\n\nFirst, the sheer scale of computation makes over-provisioning too costly. Second, model training is a tightly synchronized process, where a single failure can cascade to thousands of processors. Finally, advanced ML hardware often pushes to the boundary of current technology, potentially leading to higher failure rates.\n\nInstead, the emerging strategy involves frequent checkpointing — saving computation state — coupled with real-time monitoring, rapid allocation of spare resources and quick restarts. The underlying hardware and network design must enable swift failure detection and seamless component replacement to maintain performance.\n\nToday and looking forward, access to power is a key bottleneck for scaling AI compute. While traditional system design focuses on maximum performance per chip, we must shift to an end-to-end design focused on delivered, at-scale performance per watt. This approach is vital because it considers all system components — compute, network, memory, power delivery, cooling and fault tolerance — working together seamlessly to sustain performance. Optimizing components in isolation severely limits overall system efficiency.\n\nAs we push for greater performance, individual chips require more power, often exceeding the cooling capacity of traditional air-cooled data centers. This necessitates a shift towards more energy-intensive, but ultimately more efficient, liquid cooling solutions, and a fundamental redesign of data center cooling infrastructure.\n\nBeyond cooling, conventional redundant power sources, like dual utility feeds and diesel generators, create substantial financial costs and slow capacity delivery. Instead, we must combine diverse power sources and storage at multi-gigawatt scale, managed by real-time microgrid controllers. By leveraging AI workload flexibility and geographic distribution, we can deliver more capability without expensive backup systems needed only a few hours per year.\n\nThis evolving power model enables real-time response to power availability — from shutting down computations during shortages to advanced techniques like frequency scaling for workloads that can tolerate reduced performance. All of this requires real-time telemetry and actuation at levels not currently available.\n\nSecurity and privacy: Baked in, not bolted on\n\nA critical lesson from the internet era is that security and privacy cannot be effectively bolted onto an existing architecture. Threats from bad actors will only grow more sophisticated, requiring protections for user data and proprietary intellectual property to be built into the fabric of the ML infrastructure. One important observation is that AI will, in the end, enhance attacker capabilities. This, in turn, means that we must ensure that AI simultaneously supercharges our defenses.\n\nThis includes end-to-end data encryption, robust data lineage tracking with verifiable access logs, hardware-enforced security boundaries to protect sensitive computations and sophisticated key management systems. Integrating these safeguards from the ground up will be essential for protecting users and maintaining their trust. Real-time monitoring of what will likely be petabits/sec of telemetry and logging will be key to identifying and neutralizing needle-in-the-haystack attack vectors, including those coming from insider threats.\n\nThe rhythm of hardware upgrades has shifted dramatically. Unlike the incremental rack-by-rack evolution of traditional infrastructure, deploying ML supercomputers requires a fundamentally different approach. This is because ML compute does not easily run on heterogeneous deployments; the compute code, algorithms and compiler must be specifically tuned to each new hardware generation to fully leverage its capabilities. The rate of innovation is also unprecedented, often delivering a factor of two or more in performance year over year from new hardware.\n\nTherefore, instead of incremental upgrades, a massive and simultaneous rollout of homogeneous hardware, often across entire data centers, is now required. With annual hardware refreshes delivering integer-factor performance improvements, the ability to rapidly stand up these colossal AI engines is paramount.\n\nThe goal must be to compress timelines from design to fully operational 100,000-plus chip deployments, enabling efficiency improvements while supporting algorithmic breakthroughs. This necessitates radical acceleration and automation of every stage, demanding a manufacturing-like model for these infrastructures. From architecture to monitoring and repair, every step must be streamlined and automated to leverage each hardware generation at unprecedented scale.\n\nThe rise of gen AI marks not just an evolution, but a revolution that requires a radical reimagining of our computing infrastructure. The challenges ahead — in specialized hardware, interconnected networks and sustainable operations — are significant, but so too is the transformative potential of the AI it will enable.\n\nIt is easy to see that our resulting compute infrastructure will be unrecognizable in the few years ahead, meaning that we cannot simply improve on the blueprints we have already designed. Instead, we must collectively, from research to industry, embark on an effort to re-examine the requirements of AI compute from first principles, building a new blueprint for the underlying global infrastructure. This in turn will result in fundamentally new capabilities, from medicine to education to business, at unprecedented scale and efficiency.\n\nAmin Vahdat is VP and GM for machine learning, systems and cloud AI at Google Cloud.",
  "medium": "Article",
  "links": [
    "https://bit.ly/3GuuPLF",
    "https://venturebeat.com/ai/when-progress-doesnt-feel-like-home-why-many-are-hesitant-to-join-the-ai-migration/",
    "https://venturebeat.com/ai/why-ai-is-making-us-lose-our-minds-and-not-in-the-way-youd-think/",
    "https://venturebeat.com/programming-development/stop-vetting-engineers-like-its-2021-the-ai-native-workforce-has-arrived/",
    "https://cloud.google.com/",
    "https://venturebeat.com/terms-of-service/",
    "https://venturebeat.com/ai/rethinking-ai-deepseeks-playbook-shakes-up-the-high-spend-high-compute-paradigm/",
    "https://venturebeat.com/newsletters/",
    "https://venturebeat.com/ai/why-open-source-ai-became-an-american-national-priority/",
    "https://venturebeat.com/ai/forget-the-hype-real-ai-agents-solve-bounded-problems-not-open-world-fantasies/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "compute performance",
      "weight": 0.07401364
    },
    {
      "name": "AI compute",
      "weight": 0.072442435
    },
    {
      "name": "ML compute",
      "weight": 0.06502114
    },
    {
      "name": "new hardware",
      "weight": 0.06357599
    },
    {
      "name": "specialized hardware",
      "weight": 0.06159151
    },
    {
      "name": "identical compute elements",
      "weight": 0.061473384
    },
    {
      "name": "unprecedented compute density",
      "weight": 0.060650352
    },
    {
      "name": "advanced ML hardware",
      "weight": 0.06049622
    },
    {
      "name": "traditional system design",
      "weight": 0.060059372
    },
    {
      "name": "compute",
      "weight": 0.059684396
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.970703125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.7666015625
    }
  ],
  "sentiment": {
    "positive": 0.41235352,
    "negative": 0.14343262,
    "neutral": 0.4440918
  },
  "summary": "The rise of AI technology is forcing a redesign of the entire compute backbone, driven by advances in performance and efficiency enabled by Moore's Law and the internet era. The shift towards specialized hardware, including ASICs, GPUs, and tensor processing units (TPUs), is crucial as these systems increasingly require predictable mathematical operations on massive datasets. These systems require “all-to-all” communication, with terabit-per-second bandwidth and nanosecond latencies approaching local memory speeds. The rise of specialized interconnects will enable these systems to scale workload across vast clusters of specialized accelerators, bypassing the overhead of traditional layered networking stacks. The need for high-bandwidth connectivity and advanced processing and memory architecture is crucial for efficient scaling of AI. The focus on high-performance computing is also crucial to overcome communication bottlenecks and scaling the next generation of AI efficiently. High-capacity memory (HBM) is essential to reduce latency and power consumption, but HBM's limitations limit energy constraints. The emphasis on high bandwidth memory is on efficient coordination and power efficiency, leading to significant energy constraints and higher-capacity storage. The industry is also calling for a radical rethinking of physical layouts and dynamic power management.",
  "shortSummary": "The AI era demands a radical rethink of compute architecture, necessitating specialized hardware and higher-bandwidth connectivity to meet massive data storage demands.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "878415999a08425fbdd939c500b7f5f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://venturebeat.com/terms-of-service/",
      "text": "THIS SITE AND RELATED SERVICES ARE PROVIDED SUBJECT TO THESE TERMS AND CONDITIONS. PLEASE READ THE FOLLOWING INFORMATION CAREFULLY. YOUR CONTINUED USE OF THIS SITE WILL INDICATE YOUR AGREEMENT TO BE BOUND BY THE TERMS AND CONDITIONS SET FORTH BELOW. IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS, PROMPTLY EXIT THIS SITE.\nThese Terms of Service (the “Terms”) govern each website, mobile site, application, and/or other service, regardless of how distributed, transmitted, published, or broadcast (each, a “Site” or “Service”) provided by VentureBeat, its parent, subsidiaries and/or affiliates (“we,” “us,” or “our”) that links to this User Agreement and Privacy Policy, which is binding on all those who access, visit and/or use the Service, whether acting as an individual or on behalf of an entity, including you and all persons, entities, or digital engines of any kind that harvest, crawl, index, scrape, spider, or mine digital content by an automated or manual process or otherwise (collectively, “you” or “your”). As a condition of your use of this Site and Services, you warrant that you will not use the Site and Services for any purpose that is unlawful of prohibited by these Terms.\n1. Copies of Terms and Changes\nVentureBeat may occasionally change these Terms, so we encourage you to review them regularly. The most current version of the Terms (along with their effective date) will be linked from each of the Site and Services. If you continue to use the VentureBeat Site and Services after we change the Terms, you accept any and all changes. You may print a copy of these Terms using the print button or feature in your browser. We suggest retaining a copy for your future reference.\n2. Privacy Policy; Additional Terms\nOur Privacy Policy describes what we do with all the data that you provide or that we may collect about you through the Site and Services, and you consent to our use of data in compliance with our Privacy Policy.\nAdditional terms may apply to your use of specific parts of our Site and Services. If so, we will provide these terms to you or post them on the Site and Services to which they apply; they are incorporated by reference into these Terms. If there is any conflict between these Terms and any additional terms that apply to a particular Site or Service, the additional terms will control.\nContests or promotions on the VentureBeat Site and Services may also have additional rules and requirements, such as age or geographic restrictions, and you are responsible for understanding and complying with these rules and requirements.\n3. Registration and Access Controls\nYou are responsible for maintaining the confidentiality of your login names and passwords and you accept responsibility for all activities, charges, and damages that occur under your account. If you have reason to believe that someone is using your account without your permission, you should contact us immediately. We will not be responsible for any loss or damage resulting from your failure to notify us of unauthorized use.\nIf we request registration information from you, you must provide us with accurate and complete information and must update the information when it changes. You are responsible for updating the registration information to ensure it continues to be current, complete, and accurate. We may accept or reject registration requests for the Site and Services in our sole discretion and may revoke registration and accounts at any time, without cause or prior notice.You may not access any age-restricted Services unless you are above the required age.\n4. Intellectual Property; License\nThe content, information, data, designs, code, and all materials associated with the Site and Services (“Content”) are protected by intellectual property and other laws. You must comply with all laws and applicable copyright, trademark, or other legal notices or restrictions. All trademarks, service marks, icons, and logos used in this Site and in the Content are our trademarks, service marks or logos or those of their respective owners.\nSubject to these Terms, you agree to access and use the Site and Services only for your personal, non-commercial use. We reserve all other rights to the Content, and you may not otherwise copy, reproduce, distribute, publish, display, perform, or create derivative works of the Site and Services or Content without our permission. You also may not transfer or sublicense this limited right, or resell the Site and Services. Finally, you must keep intact all copyright, trademark, and other proprietary notices on or associated with the Site, Services, and Content.\na. Viral Distribution\nWe may choose to specifically authorize you to redistribute certain items of the Content, only for personal, non-commercial use. We will expressly identify the Content that you are authorized to use and describe ways you may redistribute it (such as via email, blogs, or embedded players, or mash-ups). We may revoke this authorization at any time. If you are authorized and do choose to redistribute Content, you must be able to edit or delete publicly posted Content and you must agree to edit or delete it promptly upon our request.\nb. Commercial Licenses\nYou must obtain written permission for commercial use of VentureBeat Content or the Site and Services. If you wish to license Content from the Site and Services, please contact us at repub@venturebeat.com.\n5. Legal Complaints\nIf you believe that Content on the Site and Services infringes your copyright or the rights of any third party, please contact us at copyright@venturebeat.com. If you have a legal complaint other than a copyright claim, please contact us at legal@venturebeat.com.\n6. User Submissions\nSome areas of the Site and Services allow you to submit audio, video, text, or other materials (collectively, “User Submissions”). When you provide User Submissions, you grant to VentureBeat, its parent, subsidiaries, affiliates, and partners a non-exclusive, worldwide, irrevocable, perpetual,royalty-free, fully sublicenseable license to use, distribute, edit, display, archive, publish, sublicense, perform, reproduce, make available, transmit, broadcast, sell, translate, and create derivative works of those User Submissions, and your name, voice, likeness and other identifying information where part of a User Submission, in any form, media, software, or technology of any kind now known or developed in the future, including, without limitation, for developing, manufacturing, and marketing products. You waive any moral rights you have in your User Submissions.\nWe respect your ownership of User Submissions.\nIf you owned a User Submission before providing it to us, you will continue owning it after providing it to us, subject to any rights granted in the Terms and any access granted to others. If you delete a User Submission from the Site and Services, our general license to that User Submission will end after a reasonable period of time needed for the deletion to take complete effect. However, the User Submission may still exist in private backup copies. If your User Submission is shared with third parties, those third parties may have retained copies of your User Submissions. And, if we made use of your User Submission before you deleted it, we will continue to have the right to make, duplicate, redistribute, and sublicense those pre-existing uses, even after you delete the User Submission.\nTerminating your account on a Service will not automatically delete your User Submissions.\nWe may refuse or remove a User Submission without notice. However, we have no obligation to monitor User Submissions, and you agree that neither we nor our parent, subsidiaries, affiliates, employees, or agents will be liable for User Submissions or any loss or damage resulting from User Submissions. Except as provided in the Privacy Policy, we do not guarantee that User Submissions will be private, even if the User Submission is in a password-protected area. You should not provide User Submissions that you wish protected from others.\nYou represent and warrant that you have all rights necessary to grant to VentureBeat the license above and that none of your User Submissions are defamatory, violate any rights of third parties (including intellectual property rights or rights of publicity or privacy), or violate applicable law.\n7. Accuracy of Information; Third-Party Content\nAlthough we attempt to ensure the integrity and accurateness of the Site, Services and Content, we make no guarantees whatsoever as to the correctness or accuracy of the foregoing. It is possible that the Site, Content, and Services could include typographical errors, inaccuracies or other errors, and that unauthorized additions, deletions and alterations could be made to them by third parties. In the event that an inaccuracy arises, please inform us so that it can be corrected. We may change or discontinue the Site, Content, and Services without notice.\nWe sometimes offer third party content or link to third party websites on the Site and Services. We do not endorse or evaluate third party content and websites, and we do not assume responsibility for them. All third party content is provided completely as-is, without warranties of any kind. Your sole remedy in the event of any issue with the third party content is to cease using it.You should review their terms of use and privacy policies before you use their services.\n8. Fee-Based Services\nIf you purchase fee-based products or features, you agree to the terms and conditions governing all such purchases, including all requirements to pay applicable fees. We will notify you of any changes to charges.\nWe may offer trial subscriptions to paid services for free or at special discounted prices. Unless otherwise stated, trial subscriptions and any other subscription services we provide will be automatically renewed at the current subscription rate if you do not cancel before the end of the trial period. You may need to cancel your subscription at least 10 days prior to its renewal date in order to avoid further charges.\nUnless otherwise stated, all fees and charges are non-refundable, including for unused portions of cancelled subscriptions. We do not provide price protection.\n9. Acceptable Use\nThe Site and Services have been designed to present VentureBeat Content in a unique way. You agree not to access the Site and Services using any interface other than ours, unless we give you express permission.\nWithout limiting any other provision in these Terms, you may not use or help others to use the Site and Services to do the following:\n- Threaten, defame, stalk, abuse, or harass other persons or engage in illegal activities;\n- Link to the Site and Services from a site that is inappropriate, profane, vulgar, offensive, false, disparaging, defamatory, obscene, illegal, sexually explicit, racist, or that promotes violence, racial hatred, or terrorism, or that we deem, in our sole discretion, to be otherwise objectionable;\n- Transmit any material that is inappropriate, profane, vulgar, offensive, false, disparaging, defamatory, obscene, illegal, sexually explicit, racist, or that promotes violence, racial hatred, or terrorism, or that we deem, in our sole discretion, to be otherwise objectionable;\n- Frame the Site and Services, display the Site and Services in connection with an unauthorized logo or mark, or do anything that could falsely suggest a relationship between VentureBeat and any third party or potentially deprive us of revenue (including, without limitation, revenue from advertising, branding, or promotional activities);\n- Engage in unauthorized spidering, “scraping,” or harvesting of the Site or Content, or contact or other personal information, or use any other unauthorized automated means to compile such information;\n- Violate any person’s or entity’s legal rights (including, without limitation, intellectual property, privacy, and publicity rights), transmit material that violates or circumvents such rights, or remove or alter intellectual property or other legal notices;\n- Transmit files that contain viruses, spyware, adware, or other harmful code;\n- Defeat any access controls, access any portion of the Site and Services that we have not authorized you to access (including password-protected areas), link to password-protected areas, attempt to access or use another user’s account or information, or allow anyone else to use your account or access credentials.\n- Advertise or promote goods or services without our permission (including sending spam);\n- Interfere with others using the Site and Services or disrupt the Site and Services; or,\n- Transmit, collect, or access personally identifiable information about other users without the consent of those users and VentureBeat;\n- Impersonate any person or entity or otherwise misrepresent your affiliation or the origin of materials you transmit.\n10. Site Access; Account Deletion\nWe may take any of the following actions in our sole discretion at any time for any reason without giving you prior notice:\n- Restrict or terminate your access to the Site and Services;\n- Change or discontinue the Site and Services;\n- Deactivate your accounts and delete all related information and files in your accounts;\n- Provide information concerning you and your activities to comply with applicable laws or respond to court order, subpoenas, or other lawful requests, or if we believe doing so would protect your safety or that of another person or protect the security of the Site and Services, or as otherwise described in the Privacy Policy.\nWe will not be liable to you or any other third party for taking any of these actions and we will not be limited to the remedies above if you violate any of these Terms.\nIf you do not agree to the Terms listed here, you should immediately stop using the VentureBeat Site and Services. If you want to delete your account on a Service, please use the instructions posted on the Service at which you obtained the account. Any User Submissions you made while using the Site and Services will continue to be governed by Section 6 of these Terms. Sections 6 and 11-15 of these Terms will survive any termination of your access to the Site and Services, whether we terminate your access or you voluntarily discontinue your use.\n11. Indemnification\nYou will defend, indemnify, and hold harmless VentureBeat, its parent, subsidiaries, affiliates, and the directors, officers, employees, shareholders, vendors, partners, contractors, agents, licensors, suppliers, or other representatives of each of them and all of their successors and assigns (collectively, the “VentureBeat Parties”) with respect to all claims, costs (including attorney’s and experts’ fees and costs), damages, liabilities, fines, sanctions, and expenses or obligations of any kind, arising out of or in connection with your use or misuse of the Site and Services (including, without limitation, any breach of these terms or use of your account, whether or not authorized by you, and claims arising from User Submissions). VentureBeat retains the right to assume the exclusive defense and control of any claim subject to indemnification, and in such cases you agree to cooperate with us to defend such claim. You may not settle any claim covered by this Section 11 without VentureBeat’s prior written approval.\n12. Governing Law, Venue, and Jurisdiction\nThese Terms and all claims arising from or related to your use of the Site and Services will be governed by and construed in accordance with the laws of the State of California.\nWith respect to any disputes or claims not subject to arbitration (as set forth below), you agree to exclusive jurisdiction in the state and federal courts in San Francisco, California. Notwithstanding any other provision of these Terms, we may seek injunctive or other equitable relief from any court of competent jurisdiction.\nRegardless of any statute or law to the contrary, you must file any claim or action related to use of the Site and Services or these Terms within one year after such claim or action accrued. Otherwise, you will waive the claim or action.\n13. Arbitration\nWe may elect to resolve any controversy or claim arising out of or relating to these Terms or the Site and Services by binding arbitration in accordance with the commercial arbitration rules of the American Arbitration Association. Unless we establish a different location, arbitration hearings will be held in San Francisco, California. The arbitrator’s award will be binding and may be entered as a judgment in any court of competent jurisdiction.\n14. Miscellaneous\nWe may be required by state or federal law to notify you of certain events. You hereby acknowledge and agree that such notices will be effective upon our posting them on our sites or delivering them to you via email. You may update your email address by visiting the Site and Services where you have provided contact information. If you do not provide us with accurate information, we will not be responsible for failure to notify you. Our failure to exercise or enforce any right or provision in these Terms will not constitute a waiver of such right or provision. These Terms, including all additional terms, conditions, and policies on the Site and Services, constitute the entire agreement between you and us and supersede all prior agreements.\n15. Disclaimers; Limitation of Liability\nVENTUREBEAT PARTIES DO NOT WARRANT: (1) THAT the Site, Services, and Content, ANY OF the Site and Services’ FUNCTIONS OR ANY CONTENT OR SOFTWARE CONTAINED THEREIN WILL BE UNINTERRUPTED OR ERROR-FREE; (2) THAT DEFECTS WILL BE CORRECTED; (3) THAT the Site, Services, Content, OR THE SERVERS HOSTING THEM ARE FREE OF VIRUSES OR OTHER HARMFUL CODE; OR (4) THAT the Site, Services, Content OR INFORMATION AVAILABLE THROUGH the Site and Services WILL CONTINUE TO BE AVAILABLE. VENTUREBEAT PARTIES DISCLAIM ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, NONINFRINGEMENT, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND TITLE. the Site and Services, INCLUDING, WITHOUT LIMITATION, ALL CONTENT, SOFTWARE, AND FUNCTIONS MADE AVAILABLE ON OR ACCESSED THROUGH OR SENT FROM the Site and Services, ARE PROVIDED “AS IS,” “AS AVAILABLE,” AND “WITH ALL FAULTS,” WITHOUT WARRANTIES OF ANY KIND.\nVENTUREBEAT PARTIES WILL NOT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY LOSS OR DAMAGES OF ANY KIND (INCLUDING, WITHOUT LIMITATION, FOR ANY SPECIAL, DIRECT, INDIRECT, INCIDENTAL, EXEMPLARY, ECONOMIC, PUNITIVE, OR CONSEQUENTIAL DAMAGES) IN CONNECTION WITH the Site, Content, and Services OR YOUR USER SUBMISSIONS, EVEN IF FORESEEABLE OR EVEN IF ONE OR MORE OF VENTUREBEAT PARTIES HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES (INCLUDING, WITHOUT LIMITATION, WHETHER CAUSED IN WHOLE OR IN PART BY NEGLIGENCE, GROSS NEGLIGENCE, OR OTHERWISE, BUT EXCLUDING WILLFUL MISCONDUCT). VENTUREBEAT PARTIES’ LIABILITY IN CONNECTION WITH the Site, Content, and Services OR YOUR USER SUBMISSIONS FOR WILLFUL MISCONDUCT WILL NOT EXCEED THE AMOUNT, IF ANY, PAID BY YOU TO VENTUREBEAT FOR THE SPECIFIC SERVICE AS TO WHICH THE LIABILITY ARISES IN THE THREE MONTHS IMMEDIATELY PRECEDING THE FIRST EVENT GIVING RISE TO THE CLAIM.\nYOUR ACCESS TO AND USE OF the Site, Content, and Services IS AT YOUR RISK. IF YOU ARE DISSATISFIED WITH the Site, Content, and Services OR ANY OF THE CONTENT, YOUR SOLE AND EXCLUSIVE REMEDY IS TO DISCONTINUE ACCESSING AND USING the Site, Content, and Services.\nYOU ACKNOWLEDGE AND AGREE THAT IF YOU INCUR ANY DAMAGES THAT ARISE OUT OF VENTUREBEAT PARTIES’ ACTS OR OMISSIONS, THE DAMAGES, IF ANY, ARE NOT IRREPARABLE AND ARE NOT SUFFICIENT TO ENTITLE YOU TO AN INJUNCTION OR OTHER EQUITABLE RELIEF RESTRICTING EXPLOITATION OF ANY WEBSITE, PROPERTY, PRODUCT, PROGRAM, TELEVISION SHOW, MOTION PICTURE, OR OTHER AUDIO/VISUAL CONTENT OWNED OR CONTROLLED BY VENTUREBEAT PARTIES, INCLUDING WITHOUT LIMITATION the Site and Services (INCLUDING THOSE INCORPORATING USER SUBMISSIONS).\nYOU ACKNOWLEDGE THAT YOU MAY BE WAIVING RIGHTS WITH RESPECT TO CLAIMS THAT ARE UNKNOWN OR ARE UNSUSPECTED. ACCORDINGLY, YOU AGREE TO WAIVE THE BENEFIT OF ANY LAW, INCLUDING, TO THE EXTENT APPLICABLE, CALIFORNIA CIVIL CODE § 1542 OR SIMILAR LAWS OF OTHER JURISDICTIONS, THAT OTHERWISE MIGHT LIMIT YOUR WAIVER OF SUCH CLAIMS.\nSOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES, SO SOME OF THE ABOVE LIMITATIONS AND EXCLUSIONS MAY NOT APPLY TO YOU."
    },
    {
      "url": "https://cloud.google.com/",
      "text": "Build with the cloud platform designed for developers and AI\nTry Google Cloud with free usage of over 20 products, plus new customers get $300 in free credits on signup.\nBuild AI agents and generative AI applications with our fully managed AI platform, Vertex AI—enhanced by Gemini, over 200 foundation models, and ecosystem of AI partners\nImprove customer service with virtual agents and conversational AI products like Speech-to-Text\nGet AI-powered code generation, recommendations, and completion from Gemini Code Assist\nExplore our ecosystem of Gemini products for businesses and developers to help you get the most out of Google AI\nCreate and run customizable virtual machines with Compute Engine. For general-purpose workloads, Axion C4A instances offer up to 65% better price-performance than current-generation x86 instances\nAutomatically deploy, scale, and manage containers with Google Kubernetes Engine or Cloud Run\nMigrate your apps at your own pace by moving directly to virtual machines or automatically modernizing to containers—without rewriting code\nStore any type of data, any amount of data, and retrieve it as often as you’d like with object storage\nTransfer data with online and offline transfer solutions, including Storage Transfer Service and Transfer Appliance\nPersistent Disk block storage is fully integrated with Google Cloud products like Compute Engine and GKE\nReduce MySQL, PostgreSQL, and SQL Server costs with Cloud SQL, a fully-managed database service\nScale your enterprise workloads and build generative AI apps with AlloyDB for PostgreSQL\nGet high performance, a 99.999% availability SLA, and virtually unlimited scale with Spanner\nRun analytics at scale with 26%–34% lower three-year TCO on BigQuery compared to cloud data warehouse alternatives\nIngest, process, and analyze event streams in real time to make data more useful\nReveal the true power of your data and bring clarity to every situation with Looker and Google Cloud\nHelp protect your applications and websites against denial of service and web attacks with Cloud Armor\nQuickly and securely scale web and video content delivery with Cloud CDN\nExplore hybrid connectivity options, including VPN, peering, and enterprise support\nWrite, debug, and run cloud-native applications, locally or in the cloud—quickly and easily with Cloud Code\nWith Cloud Build, continuously build, test, and deploy software across all languages and in multiple environments\nDeploy pre-built solution templates—with an active Google Cloud account—including dynamic websites, load balanced VMs, and three tier web apps.\nUnderstand threat actors and potential attack vectors with Google Threat Intelligence and Mandiant Consulting Services\nDetect, investigate, and respond to threats faster with Google Security Operations\nProtect your workloads and meet digital sovereignty requirements with our full suite of security products and services\nGet up to $350,000 in Cloud credits through the Google for Startups Cloud Program to continue building and scaling\nCustomize and embed foundation models with Vertex AI and access models on Model Garden with additional credits for AI startups\nAccess key resources including key startup reports, click-to-deploy solutions, and hands-on labs focused on AI\nBuild and scale generative AI apps with Vertex AI and Gemini Code Assist\nUse Vertex AI to deploy and manage AI applications and Gemini Code Assist for task and code assistance.\nAI innovation happens on Google Cloud\nSnap deployed Gemini’s multimodal capability in their “My AI” chatbot, boosting US engagement by 2.5x\nVolkswagen uses Gemini to power its virtual assistant in the myVW app, surfacing helpful information from the owner’s manual\nPUMA uses Imagen to customize product photos on their website, saving time and ensuring they are locally relevant\nPODS and their agency partner, Tombras, created a “smart billboard” using a custom model trained on their data in Vertex AI\nBest Buy helps their customer service agents generate summaries for every customer interaction with Customer Engagement Suite\nEstée Lauder uses Vertex AI and Gemini to simplify internal processes, including language translations and writing ad copy\nHackensack Meridian Health uses Vertex AI to build and train AI models to help with risk prediction and disease detection\nThe Home Depot uses computer vision to help store associates manage inventory and connect customers to products\nResistant AI uses Document AI to help prevent fraud from infiltrating document automation workflows\nGE Appliances uses Gemini to help customers meal prep, save offline recipes, and keep their appliances in tip-top shape\nZSL uses Google Cloud data and AI to process acoustic data rapidly and identify wildlife species along railway lines\nWayfair uses Gemini Code Assist to help devs set up environments faster and increase code testing coverage\nSolve your business problems with our industry solutions\nFrom improving retail product discovery to detecting bank fraud, our industry solutions tackle your biggest challenges.\nAvoid vendor lock-in and speed up development with Google Cloud’s commitment to open source, hybrid, and multicloud.\nGive anyone on your team access to business insights with advanced machine learning and analytics.\nHelp defend your data and apps against threats and fraudulent activity with the same security technology Google uses.\nIntegrate video calling, email, chat, and document collaboration in one place."
    },
    {
      "url": "https://bit.ly/3GuuPLF",
      "text": "Autonomous Workforces: Architecting & Governing Multi-Agent AI at Enterprise Scale\nJoin us in San Francisco for an exclusive event focused on Autonomous Workforces: Architecting & Governing Multi-Agent AI at Enterprise Scale, hosted by VentureBeat and SAP.\nThis event is designed for a select group of forward-thinking enterprise leaders exploring how to deploy and govern multi-agent AI systems in real-world environments.\nSingle copilots are yesterday’s news. The next competitive edge is a network of specialized agents that collaborate, self-critique and call the right model for every step, all while staying inside your cost, latency and compliance guardrails.\nHear from the teams already putting autonomous workforces into action:\nBrad Axen, Tech Lead, AI & Data Platform, Block\nHow Goose, Block’s open-source agent framework, grew to 15K GitHub stars and now routes across LLMs and internal stacks, serving 5,000+ weekly users.Kim Branson, SVP, Global Head of AI & ML, GSK\nHow multi-agent reasoning and test-time scaling are transforming drug discovery and reducing hallucinations in high-stakes use cases.Yaad Oren, Global Head of SAP Research & Innovation, SAP\nand Raj Jampa, SVP & CIO, Agilent Technologies will share insights from real-world deployments of agentic AI across complex enterprise environments - focusing on what it takes to move from experimentation to impact. The session will also explore challenges around scale, security, integration, and governance, as well as lessons learned from building AI agents that operate reliably within critical business workflows.\nWhy attend:\nGet practical strategies to go beyond copilots and build autonomous processes\nLearn scalable architectures for orchestrating multi-agent systems\nHear lessons from real deployments and where the biggest opportunities lie\nClaim your spot and help shape the next chapter of enterprise AI."
    }
  ],
  "argos_summary": "The article discusses the need for a radical rethinking of computing infrastructure to support the next generation of AI, driven by the demands of generative AI and specialized hardware. It highlights the shift from scale-out architectures to specialized systems like ASICs and TPUs, which require advanced interconnects and high-bandwidth memory to meet performance needs. Additionally, it emphasizes the importance of integrated security measures, efficient power management, and the necessity for rapid, homogeneous hardware rollouts to enable efficient AI operations at scale.",
  "argos_id": "19FSMBQOY"
}