{
  "url": "https://www.slashgear.com/1925936/how-fast-is-the-yamaha-r7-top-speed/",
  "authorsByline": "Travis Langness",
  "articleId": "b57e1a074b9949e1becb64d758009e8b",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/yamaha-r7-top-speed-how-fast-is-the-motorcycle-and-is-it-good-for-beginners/l-intro-1753854769.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:35:00+00:00",
  "addDate": "2025-08-03T18:39:51.242501+00:00",
  "refreshDate": "2025-08-03T18:39:51.242503+00:00",
  "score": 1.0,
  "title": "Yamaha R7 Top Speed: How Fast Is The Motorcycle And Is It Good For Beginners?",
  "description": "Third-party tests suggest that the Yamaha R7 has a top speed of 130 mph or so. Combined with its 65 hp, the R7 is likely too powerful for beginner riders.",
  "content": "Sleek looks, full fairings, and great performance make the R7 an appealing choice in its class. It's as powerful as four-cylinder sportbikes we've recently tested, like the Kawasaki ZX-6R and the Honda CBR600RR, but it's not as expensive as either, so could it potentially be a good bike for beginners? Unfortunately, even without a four-cylinder engine, the R7 is likely a bit too powerful for newbies. Its 689cc two-cylinder engine made 64.8 hp and 44.5 lb-ft of torque on Cycle World's dyno, which is a hearty amount for a two-wheeled machine.\n\nYamaha doesn't list the R7's top speed, but third-party sources peg it at 130 mph or so. Similarly, owner videos show the bike hitting top speeds slightly over 130 mph. The R7 is not faster than the four-cylinder R6 that it replaced, but anything that can crack 130 mph is fast enough that new riders might have a hard time getting acclimated.\n\nI've been riding motorcycles for decades with experience on bikes of various shapes and sizes. If you're looking for a beginner bike based on its top speed, I think you're taking the wrong approach. Finding something that's affordable and relatively low on power is a better, lower-risk way to learn proper riding techniques. Getting started on a smaller, less powerful, and cheaper bike will be a much better experience.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/1586594/yzf-r7-engine-yamaha-all-about-motorcycle-faster-r6/",
    "https://www.slashgear.com/1900013/2025-kawasaki-ninja-zx-6r-review-specs-pricing-performance/",
    "https://www.slashgear.com/1722175/2024-honda-cbr600rr-review-speed-specs-price-details/",
    "https://www.cycleworld.com/yamaha/yzf-r7/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Yamaha R7 Top Speed",
      "weight": 0.12584962
    },
    {
      "name": "top speeds",
      "weight": 0.11294425
    },
    {
      "name": "bikes",
      "weight": 0.09745417
    },
    {
      "name": "R7",
      "weight": 0.089523815
    },
    {
      "name": "proper riding techniques",
      "weight": 0.07223703
    },
    {
      "name": "great performance",
      "weight": 0.07087142
    },
    {
      "name": "full fairings",
      "weight": 0.070818126
    },
    {
      "name": "new riders",
      "weight": 0.07013327
    },
    {
      "name": "various shapes",
      "weight": 0.06301883
    },
    {
      "name": "experience",
      "weight": 0.060124263
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.55078125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Motorcycles",
      "score": 0.318359375
    }
  ],
  "sentiment": {
    "positive": 0.50439453,
    "negative": 0.077697754,
    "neutral": 0.4177246
  },
  "summary": "The Yamaha R7 motorcycle is considered a good choice in its class for beginners due to its sleek looks, full fairings, and great performance. However, the R7 may be too powerful for newbies due to the 689cc two-cylinder engine, which made 64.8 hp and 44.5 lb-ft of torque on Cycle World's dyno, which is a significant amount for a two-wheeled machine. The top speed for new riders may be high, but it's not faster than its predecessor, the replacement R6. Experts suggest that finding a smaller, less powerful bike is a better way to learn proper riding techniques.",
  "shortSummary": "Yamaha's R7, featuring sleek looks and high-speed performance, may not be ideal for beginners, but it can perform at 130 mph without a four-cylinder engine.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9dd7421814624717b2372ac2497eed1c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1586594/yzf-r7-engine-yamaha-all-about-motorcycle-faster-r6/",
      "text": "What Engine Is In Yamaha's YZF-R7 Motorcycle & Is It Faster Than The R6?\nThere are some big differences between Yamaha's R-Series motorcycles, as each model is made for a specific purpose. Some are super fast, while others offer better handling. The R3 is great for beginners, but the R1 is a Yamaha motorcycle better suited for expert riders. Then, there's the R7, which is the perfect balance between the two.\nYamaha introduced the R7 in 2022. It's a sport bike, so it won't contribute to the company's street bike competition with Suzuki, but it still carries an impressive engine on its frame. The R7 has an advanced CP2 engine, but what does that entail? Well, it's a 4-stroke, liquid-cooled engine with 689cc of displacement. It has dual overhead camshafts (DOHC), inline twin-cylinders, and four valves per cylinder.\nThat information is all well and good, but what kind of power does the advanced CP2 engine bring to the Yamaha R7? The R7 has a 270-degree crankshaft, delivering linear torque and impressive acceleration. In their test of the sport bike, Cycle World recorded 66 horsepower and 45 pound-feet of torque. MotoMachines reported similar power outputs, with 72 horsepower and 49 pound-feet of torque. But, how do those numbers compare to its predecessor, the Yamaha R6, and what is the Yamaha R7 top speed?\nHow fast is the Yamaha R7 compared to the R6?\nIf you find the performance numbers of the Yamaha R7's advanced CP2 engine a bit lackluster, you might find the R6 more interesting. The R7 is a nice middle ground within the R-series, so it won't be as fast as some of the sport bikes Yamaha built with speed in mind — like the R6. While the R7 is Yamaha's more balanced approach to a sport bike, think of the R6 as its quicker and more nimble sibling. It has a 599cc Inline-4 DOHC engine that generates 117 horsepower and 50 pound-feet of torque. So, while the R6 takes a dip in the engine displacement, it puts the R7 to shame in practically every other category.\nIt doesn't take a motorcycle enthusiast to figure out what those performance numbers mean for each sport bike's speed. With its 72 horsepower, the 2023 Yamaha R7 is capable of reaching a top speed of 143 mph. Unsurprisingly, the R6 puts its higher horsepower to use, reaching an even higher top speed of 165 mph. So no, the Yamaha R7 isn't faster than the R6, but it's not that far off.\nUnfortunately, Yamaha discontinued the R6 due to stricter regulations in the European Union, so you're out of luck if you were debating a purchase between it and the R7. However, Yamaha adapted the R7 to meet those new regulations, so it's regularly available for purchase, with a retail price starting at $9,199."
    },
    {
      "url": "https://www.cycleworld.com/yamaha/yzf-r7/",
      "text": "Skip to content\nMenu\nCycle World\neicma 2024\nten best motorcycles\nnew motorcycles\nreviews\ncomparison tests\nbuyer's guide\nask kevin\nmotorcycle dyno\nphoto galleries\ngear and products\ndirt bikes\nracing\nthe wire\nnewsletter\nyoutube\nfacebook\ninstagram\nx\nYamaha\n2024 Yamaha YZF-R7\nYamaha’s sporty middleweight twin.\nBy\nCycle World Staff\nJuly 31, 2024\nLatest\nBikes\nBSA Bantam First Look\nBikes\nIndian’s 2025 Forged Series Features New Chieftain PowerPlus\nTriumph\n2024 Triumph Scrambler 1200 X and XE\nBikes\nSuzuki Upgrades the 2026 GSX-R1000 and GSX-R1000R\nNews\nKTM CEO Gottfried Neumeister Interview\nHusqvarna\n2024 Husqvarna 701 Supermoto\nAsk Kevin\nThe Cost of Vibration\nThe Wire\nJonny Walker 2nd at Romaniacs on Tiger 900 Rally Pro\nBMW\n2024 BMW R 1300 GS\nThe Wire\nJonny Walker 2nd at Romaniacs on Tiger 900 Rally Pro\nTriumph\n2024 Triumph Scrambler 1200 X and XE\nHusqvarna\n2024 Husqvarna 701 Supermoto\nBMW\n2024 BMW R 1300 GS\nBMW\n2024 BMW R 1250 R\nBMW\n2024 BMW F 900 GS and F 900 GS Adventure\nBMW\n2024 BMW F 800 GS\nReviews\nIs the Panigale V2 S Really Better Than the 955 It Replaces?\nNews\nMV Agusta CEO Luca Martin Lays Out Plan for Growth\nRacing\nJoe Roberts Back on Track\nThe Wire\nAct Now: Youth OHVs at Risk in California\nKawasaki\n2025 Kawasaki KLX300R\nThe Wire\nTotal Domination by Aprilia Tuareg Racing at the Ro Rally Marathon\nNews\nVoge RR500S Officially Revealed\nRacing\nMarc Márquez Makes It Five in a Row\nThe Wire\nPecco Bagnaia and the Ducati Lenovo Team visit the Brembo Headquarter\nNews\nCFMoto Folding Sportbike Winglets\nThe Wire\nBriar Bauman Races Harley-Davidson XG750R to Fifth Mission AFT SuperTwins Season Victory\nBikes\nTop Cruisers of 2025 for Beginner Riders\nBikes\nHow Much Power Does the 2025 Yamaha Ténéré 700 Make?\nRacing\nJorge Martín Answers Tough Questions\nNews\nZXJC 820RR Inline-Triple Sportbike\nRacing\nPedro Acosta Gets Real\nNews\nAprilia’s XGP Most Extreme Limited Edition Yet"
    },
    {
      "url": "https://www.slashgear.com/1900013/2025-kawasaki-ninja-zx-6r-review-specs-pricing-performance/",
      "text": "2025 Kawasaki Ninja ZX-6R Review: The Goldilocks Sportsbike\nFor me, there's always been something very Goldilocks and the Three Bears about 600cc sportbikes: they're just right in almost every way. They're lightweight enough to feel sharp and athletic around corners. They're powerful enough for the kind of outright speed you expect from a sportbike. They're reasonably priced, too, especially when you compare them to their 1,000cc siblings.\nSure, liter bikes like the newest Ninja ZX-10R we just tested get all the latest tech, and in the proper hands they'll get you going down a racetrack straightaway at wild speeds, but 600cc's are where it's at for me. And even though it has a bit more displacement than the average 600cc bike, the Kawasaki Ninja ZX-6R offers the exceptional balance between size and performance that many riders are looking for, without breaking the bank in the process. The ZX-6R is like porridge that's the ideal temperature, a chair that has proper padding, and a bed that fits just right.\nA larger-than-average powerplant\nI recently rode the latest Kawasaki ZX-6R for a few weeks, living with it in regular commuting scenarios and taking it for blasts through the canyons on the weekends, and I was never disappointed with the power. The ZX-6R gets its thrust from a 636cc inline four-cylinder engine that produces 127 horsepower and 52.1 lb-ft of torque. One of the high points of riding this middleweight Ninja is where that power shows up. According to Kawasaki, peak power is reached at 13,000 rpm and peak torque comes up at 10,800 rpm, but where this bike lives, and where it's the most joyous to ride, is in the middle of the rev range.\nThe Kawi's displacement is somewhat rare for a four-cylinder bike in this class, with rivals like the Honda CBR600RR and the Suzuki GSX-R600 both still using 599cc engines. Where the CBR and the Gixxer rev to the moon and seem to make most of their power near redline, however, the ZX-6R has a hearty helping of thrust between 6,000 and 9,000 rpm. You don't get quite the same screaming redline performance from the Kawasaki as you do from its 599cc rivals, but for most riders, that trade-off will only make it a more livable machine for daily riding.\nQuick throttle response and quick shifting\nIt liked hanging out in the middle of the rev range, but the ZX-6R had plenty of power down low, too. There are multiple power modes that allow for the adjustment of power, but leaving it in full-power mode, the throttle response was like pulling on an already-taut string. The ZX-6R's throttle is sensitive to respond to inputs, in an urgent, but not snappy or over-sensitive way. There's virtually no slack in the throttle and power is delivered immediately when you twist your wrist. Both the brake and clutch lever are adjustable directly from the factory, with lots of range to place them right where they make sense for your hands.\nThe quick shifter worked well during my test too, with only the lightest touch required from my left foot for a properly-timed upshift, though it only works on upshifts. There's no down-shift quick shifter here; that's one of those bits of tech that's saved for the larger, more-expensive ZX-10R. Even with some enthusiastic canyon riding through three tanks of gas, the ZX-6R averaged about 35 mpg during my test. I could probably coax even better numbers out of it on longer highway commutes with just a small amount of effort.\nLight on the scales and light through the corners\nDepending on which trim level of the ZX-6R you go with, and which state you live in, curb weight is between 430 and 436 lbs. That's right on par for the class and it's just the right size for maneuvering the Kawasaki through stitched-together corners on your local b-road. Lean on the handlebars just a little bit and it turns in quickly, eager to attack the next corner. The Pirelli Diablo Rosso tires provide a lot of confidence and more than enough grip for the kind of street riding I typically do. They'd likely be right at home at a track day too.\nRight at the top of the brake lever's travel, the front brakes bite with confidence. Clamp your right hand down a little bit harder on the lever and the rear tire gets light, confirming that you are indeed, on a sportbike that's prepared to stop on a dime. Just like its 600cc competitors from Honda and Suzuki, the ZX-6R gets 310mm floating discs with 4-piston calipers up front, paired with 220mm brake discs in the rear with a single-piston caliper. Standard fare for the class, you'll have a hard time getting brake fade from this setup at anything less than racetrack-levels of speed.\nA cramped seating position\nSportbike riding position is a tough nut to crack. For my riding style, I want the bike to feel aggressive, but I also want it to be comfortable enough for a bare-minimum of 100-200 miles of riding in a single day. The ZX-6R was almost able to strike that balance, but I did have a few gripes I had along the way.\nNaturally, as you'd expect with a sportbike, the handlebars are low and require a bit of weight to be placed on your wrists. The foot pegs, however, were a bit too high for my frame. Even at a mild tuck, my elbows and knees were making contact. That's not typical for me, especially when you consider that I tip the short-king scales at just 5-foot-9. The high perch meant it was easy to move my body around and change body position quickly before a corner, but my squished knees took a bit of abuse on longer rides.\nThe ride is softer than you might expect\nIf you sit on a ZX-6R at your local dealership without taking it out for a test ride, you might expect it to be a firm and unforgiving bike. The aggressive looks don't exactly inspire confidence in the middleweight Ninja's plushness. Thankfully, the seat is well-padded enough that after a few hours in the saddle I didn't feel much discomfort. The seat height of 32.7 inches is a bit tall for the class, but with a narrow seat I could still flat-foot both feet at stop lights.\nUp front, the ZX-6R gets 4.7 inches of suspension travel, while the rear gets 5.9 inches of travel. With adjustable preload in both the front and the rear and a decent amount of travel, the Ninja soaked up most small and road imperfections, but larger stuff gave it some significant bounces. Overall, the ZX-6R was comfortable and it didn't beat me up, but like most sport bikes, it's not the kind of bike I'd recommend for long, daily commutes.\nLeading tech for the class\nWhen it comes to on-board tech, the 600cc class isn't typically on the cutting edge, but the ZX-6R bucks that trend and gets some modern equipment worth mentioning. The aforementioned quick shifter, even though it only allows for upshifts, is a relative rarity in the segment (the CBR and the Gixxer don't get one). The 4.3-inch TFT is a nice touch for the class too, and I don't lament the lack of traditional gauges.\nThe ZX-6R's display is bright, with impressive resolution and easy-to-read fonts. Spotting it in bright sunlight is easy so you're not likely to miss the analog tachometers equipped to other bikes either. Smartphone connectivity is also available via Kawasaki's Rideology App which is relatively easy to download and connect. It has features like a riding log, vehicle odometer and maintenance schedule, instrument settings, and it can even set up your riding mode before you set off for a ride.\nPriced among mid-range bikes\nThe ZX-6R is priced directly in line with its rivals, so there's not much of a distinct advantage for any of the 600cc sport bikes when it comes to the hit on your wallet. It has an MSRP of $12,064 (including $665 destination fee) for the non-ABS model, and another $1,000 for ABS. Line that up with the 600cc bikes from Honda and Suzuki and it's a near-perfect match. The standard Honda CBR600RR recently got a price drop of $700, and the 2026 model has an MSRP of $12,099 (including $600 destination fee); the ABS version of the CBR adds another $1,000 to the price tag. That makes it much more competitive with the standard ZX-6R in terms of price, even if it doesn't have the same level of tech.\nThe Suzuki GSX-R600 has a starting price of $12,529 (including $530 destination fee), giving it the tiniest disadvantage in the pricing department. Yamaha offers both the R7 and the R9, which flank the ZX-6R in terms of price, but I'd cross-shop the R7 based on price alone. Sure, it has an inline twin-cylinder engine instead of a four-banger, but the R7 is priced significantly lower. The R7 has an MSRP of $10,499 (including $600 destination fee and $700 supply chain surcharge), which could give it a significant edge for price-conscious buyers.\n2025 Kawasaki Ninja ZX-6R Verdict\nThe 2025 Kawasaki Ninja ZX-6R is a properly fast sport bike. It's thrilling to ride, it has excellent handling characteristics, and the baritone nature of the inline four-cylinder engine will be satisfying for thousands of miles. It doesn't have the same high-revving nature of some other 600cc bikes, but the Ninja's mid-range power makes it extremely likable once you've gotten used to it. The styling is aggressive and the KRT Edition I was riding had the attractive Lime Green paint, so it got attention everywhere it went. And with class-leading tech, it will likely feel modern for years to come.\nIt's a purpose-built machine, though. The riding position is best suited to aggressive street or track riding and you'll remember that every time you take it out for a long, relaxed ride. The windscreen, much like the one on Kawasaki's Ninja 1100 SX that I rode earlier this year, is also a bit of a let down. It's positioned too low to block any real wind, so I'd likely go shopping for a taller aftermarket windscreen if I purchased a ZX-6R. If I were in the market for a middleweight sport bike, though, I'd toss those small gripes aside and the ZX-6R would be right near the top of my shopping list."
    },
    {
      "url": "https://www.slashgear.com/1722175/2024-honda-cbr600rr-review-speed-specs-price-details/",
      "text": "2024 Honda CBR600RR Review: So Outdated Yet Still So Good\nSometimes in this industry, automakers and motorcycle manufacturers only allow journalists a few hours to experience the latest and greatest creations to leave factory floors. The logistics of pre-production testing, marketing, and sales dictate such inconveniences, but long-term loaners provide a much better opportunity for deep thoughts to begin forming—and I'm not just writing this in the hopes of convincing PR professionals to hand out the goods on a more reasonable schedule.\nInstead, after spending seven months this year with a 2024 Honda CBR600RR that spanned plenty of riding on city streets, highways, and canyons, plus two separate track days at two separate stages of my training, this resulting review can hopefully better distill everything that the 600RR offers.\nAt this point, I must reveal that over those seven months, I also bought a 2002 Honda CBR954RR. I set out on the search earlier this summer, originally looking for a stock bike to start a street-legal track build. And without a doubt, time on the 600RR helped to inspire the purchase. Tracing that lineage through-line of Honda's Fireblades, which today go so far overboard in power and performance, helps to provide a better picture for whom, exactly, the CBR600RR might just be the perfect bike.\nInline-four for the win\nFrom the very first rev of that 599cc engine, I started to fall in love with the torquey power of a Honda inline-four. Sure, a 2023 CBR100RR-R Fireblade SP that I rode in 2023 absolutely thumps out of the gate, but the 600RR still delivered a surprising sense of urgency despite the mid-tier displacement. The smooth, eager four-cylinder zooms right up to the 15,000-RPM redline with ease, even if the path leading to such stratospheric rotations lacks some of the lumpy brawn of my Ducati Monster S2R 1000's throaty twin.\nThe CBR600RR's peak rating of 113 horsepower probably matters less than that broad rev range, in reality. And even if the curb weight of 434 pounds with fluids filled, ready to ride, seems a bit hefty for a 600, this CBR somehow seems so much lighter and nimbler than the \"Triple R\" Fireblade.\nPerfect posture for a compact sport bike\nAlmost as importantly, I fit. Reminiscing back on that top-spec Fireblade, I can certainly lament the lack of 200-plus horsepower insanity, but on the 600 I rode more comfortably, feet high on the pegs rather than low-squatting like a frog on a log, plus the distance from the seat to the windshield cramped my torso and neck less. And the seat itself actually kept me in place, rather than sliding fore and aft egregiously on the 1000RR-R.\nI also thought back to the Aprilia RS 660, one of my favorite bikes of all time, which delivered the perfect positioning for my body at 6'1\" with long limbs. My wrists and shoulders never started to ache after long rips through Malibu on either bike. The Aprilia nonetheless nails a slightly more exotic appeal, but that's a tradeoff that Honda probably hopes buyers will make willingly. Chalk the weight difference up to Honda build quality, perhaps—the CBR600RR initially tamps down any light squiggles and trembles from the road or body positioning, and the engine simply outclasses the RS 660 at both low and high revs. Just don't ask about the soundtrack, but more on that later.\nAdjusting to older technology\nSpeaking of tracks, I only rode the CBR600RR a few times before heading out for a track day, actually. Nonetheless, those short stints helped me adjust to the bike's potential more quickly, since hopping onto a new bike and getting acclimated to new controls, new posture, new balance, and new tires—potentially on a new track—always takes a bit of time, not to mention sapping precious ounces of concentration. Luckily, after countless laps around Streets of Willow, I knew at least somewhat, or somehow, how to ride the 600RR.\nOr so I thought, until surprising brake sensitivity at track pace left me repeatedly locking up the rear tire after the two longer straights at Streets. Then I realized that the cable clutch, which works just fine with enough positive engagement for street riding, requires a bit more finesse while pushing harder into the tires. A hydraulic actuation setup can help to smooth out the clutch release, as might an aftermarket slipper clutch for the CBR600RR. And of course, quickshifters used by the world's most expensive sport bikes, on which I spend most of my track time, left me absolutely spoiled rotten.\nValuable lessons learned\nThe cable clutch provided an opportunity for me to hone my skills all the better, though, while serving as a reminder that this bike essentially came out way back in 2013. Over a decade later, Europe and Japan already received a more modern version years ago, with more power, more tech, and improved styling.\nSo here we sit in the United States, just waiting for that updated 600RR to arrive. Yet as a track training tool, this current (for us) CBR therefore serves quite well. The cable clutch and lack of a quickshifter forced a reset of my mentality, and the passive suspension at the factory settings kept the bike's weight transfer entirely predictable, enhancing my ability to note how much subtle shifts in my own body positioning affected lean angles, front and rear-end grip while braking, the shift rearward under acceleration, and how much my tuck affected aero on the straights.\nStepping down (or up) in class\nBetween my two track days on the CBR600RR, I also rode Kawasaki's latest and greatest Ninja ZX-4RR at Streets of Willow, too. At a lower rung in terms of power and displacement, the ZX-4RR nonetheless weighs almost exactly as much as the Honda, but adds a bit of modern tech into the equation. A ram air intake system helps the diminutive 399cc inline-four crank out up to 79 horsepower, though the power output varies wildly depending on market and any massaging from aftermarket goodies. The quickshifter works for up and down gearshifts, while a stock slipper clutch helps make up for the similar use of cable actuation. And unlike the Honda, the ZX-4RR also features adjustable traction control and ABS settings, plus a lap timer.\nA day on the Kawasaki revealed how much less total weight matters than a bike's dynamics. Somehow, the Ninja reacted much more to my every movement, revealing exactly where I needed to focus on smoothing out inputs—from shifting my hips from side to side without brushing the seat, to softening my wrists and countersteering more gently.\nThe details come into play\nThen, I jumped back on the CBR600RR for another day, again at Streets of Willow. And everything that the ZX-4RR taught me carried over even further, as I settled into awesome lean angles, tearing up the tires right through the chicken band, building up confidence to hit speeds I never even approached the previous day out. The brakes never faded, either, as I committed deeper and deeper into nosedives, though I still needed to focus on that smooth clutch release.\nI noticed a few thoughts creeping in, though. Slightly louder exhaust, mostly, might help my brain keep track of revs better when wind noise starts to overwhelm engine vibrations. And that's despite switching over to the new Alpinestars Supertech R-10 helmet, which I swear reduces wind buffeting by about half at any speed. And of course, after jumping from the 399cc to the 599cc inline-four, I just wanted more power more of the time. Greedy boy.\nBack out onto public roads, however, and the CBR600RR's displacement, power delivery, and wide rev range work wonders. I found myself riding with personality, as always the track time contributing to confidence in both the bike and myself, so much so that I spent more time paying attention to the road and traffic around me rather than where I needed the engine to sit in the power band, or which gear to stay in up the tight hairpins of Las Flores Canyon. I still wanted more exhaust note, though.\nOld meets new\nWay back in 2002, Honda built an absolute behemoth of a bike. For the time, of course, because technology marches along steadily as usual leaving everything and everybody in the lurch. But just imagine the turn of the millennium, when Ducati's iconic 996 managed 112 horsepower in a bike that weighed 437 pounds dry. Then along comes Honda with a 954 rated for 154 horsepower, that can reportedly rev to redline for 24 hours straight without causing engine damage, and comes in a package that weighs less wet. Okay...\nSold on that purported reliability, since I need a bike that fires up consistently after potentially long periods sitting, I jumped at a 24,000-mile CBR954RR on Craigslist. Back at the garage after a tentative ride home on decade-old tires, I immediately parked the two Hondas side-by-side for a quick comparison. Somehow the older bike looked more compact, and riding the two back-to-back reveals how much the 2002's character creates more of the cruise missile disposition than the 2024—akin to if the RS 660's size and shape added a bit of bulking muscle mass.\nEvolutionary step, or leap?\nYet similarities shone through across the decades, especially from the inline-four engine. The 954 \"only\" revs to 11,500 but after the low-RPM cruiser torque starts to build, racing toward the full-throttle 154 horsepower snaps the weight rearward as time almost begins to melt. Only full-gas on current superbikes over 200 horsepower matches this 22-year-old Honda, thanks to a building sensation that I almost compare to a turbo spooling up into boost. Not even the outgoing Panigale V2, which delivers an almost identical horsepower figure, matches the fury.\nBack to CBR600RR comparisons, though. The 954's bars cant a little lower and narrower, albeit in relation to a seat that's a third of an inch lower, too—the former of which the road cyclist in me certainly appreciates, the latter not so much. Similar footpeg height therefore leads to just a slight additional bend of the knee, but not enough to leave my long legs under too much pressure. And my bike's slightly wider waist combines with a different tank design to create a bit more leverage for crooking my uphill knee in as a hook to hang off while leaned over.\nComparison shopping the CBR954RR\nParked next to each other, the 600 certainly looks lighter, with a lithe and athletic presence the 954's additional mass lacks. But from a stylistic perspective, I prefer the 1990's aesthetic with a hint more angularity up front. Glancing from cockpit to cockpit also reveals how little difference in terms of tech divide the two, with surprisingly similar handlebar switchgear, tachometer, and digital dash layouts. The rearview mirrors might even bear the same part number.\nSo while shopping, I figured, if I wanted to skip over modern adjustable dampers and a quickshifter and selectable ride modes, why not go for the used 954 at half again the power for less than half the price? But of course, my bike needs an aftermarket exhaust setup ASAP—despite the cubic centimeters of additional displacement, the massive muffler simply drowns the 954's engine. Even more than the undertail exhaust of the 600, believe it or not.\nWhy did Honda skip out on special editions?\nSpeaking of undertails, my 954 needs a tail tidy, too. Such modifications and maintenance costs obviously factor into the decision of whether to buy a current CBR600RR, for daily commuting or weekend canyon carving or track time alike. I keep everything crossed my CBR954RR lives up to Honda's legendary reliability, but every time I pull out for a ride, I do keep an ear out for any strange noises or grinding or rumbling or or or...\nThen again, buying a 2024 CBR600RR essentially equates to buying a 2013 model year, just without the deleterious effects of time (not to mention other riders not necessarily riding well on a used bike). And to me, I cannot fathom the fact that Honda kept this generation underway in the United States market for so long without at the very least offering some kind of up-spec package—an SP or Triple R with better forks, or Brembo brakes, or a spicy exhaust system, maybe. Just to stay a little more relevant among the competition.\n2024 Honda CBR600RR Verdict\nStill, as I handed back the key to the CBR600RR after living with such an excellent option in my garage for so long, part of me wanted to keep ahold for longer. Of course I anthropomorphize all my babies, and the 954 needs my attention, too. But the emotional aftereffects of taking in such a solid sport bike as a stepchild, one on which I enjoyed so much time in almost every riding scenario (other than rain) pull at the gut strings (if gut strings exist).\nGreat on track, great, on road, not too awful in traffic, and a ton of fun in the canyons, this bike somehow still works for me, and for Honda, more than a decade later. Which only raises the question of how much of a step forward the next generation — already available in RoW markets — can actually take. And, indeed, whether adding more tech might in reality take anything away from such a spectacular motorcycle."
    }
  ],
  "argos_summary": "The Yamaha R7, introduced in 2022, features a 689cc two-cylinder engine that delivers impressive performance, making it a strong contender in the sportbike category. While it offers a balance between power and handling, its 64.8 hp and top speed of around 130 mph may be too much for beginner riders. In comparison, the Kawasaki ZX-6R and Honda CBR600RR provide higher performance with their four-cylinder engines, but the R7 is priced lower, making it appealing for budget-conscious buyers. However, the CBR600RR, despite being older, remains a solid choice for those seeking a reliable sportbike experience.",
  "argos_id": "4IS0837WL"
}