{
  "url": "https://www.theguardian.com/education/2025/aug/03/willie-jones-obituary",
  "authorsByline": "Martin Wainwright",
  "articleId": "50324d04cb064310aa14af289afa9a12",
  "source": {
    "domain": "theguardian.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.guim.co.uk/img/media/218775ec18ba7437e6934748014ad5ca4b51a4e3/0_0_993_794/master/993.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0b23520554250611920f32913e3d12ab",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-03T18:53:11+00:00",
  "addDate": "2025-08-03T18:58:04.255869+00:00",
  "refreshDate": "2025-08-03T18:58:04.255871+00:00",
  "score": 1.0,
  "title": "Willie Jones obituary",
  "description": "Other lives: English teacher at Shrewsbury school in Shropshire who emigrated to Japan and taught at Hokkaido University",
  "content": "My former English teacher Willie Jones, who has died aged 94, was an inspirational guide to thousands of students in the UK and, later, Japan. He combined a passion for texts with a warmth and patience that made the analysis of writing an adventure.\n\nHe could have become a students’ guru but shrank from leadership; his talent was a gentle helping hand. He wrote voluminously but suffered agonies over clarity and precision. His eyes welled when reciting Shakespeare.\n\nBorn in Hereford, Willie was the eldest of the three children of Alice (nee Morris), who dreamed of teaching but was apprenticed to a dressmaker at 14, and Bill Jones, a butcher. Bill had left school at 11; Willie’s parents and some perceptive teachers at Hereford high school for boys helped him to gain a place to study English at St Catharine’s College, Cambridge.\n\nBefore university, two years’ national service, including a commission as a second lieutenant, widened his world. He corresponded with army friends and pupils for the rest of his life. In 1956 he taught on placement at Shrewsbury school in Shropshire, returning in 1959 after a spell at St Bees school in Cumbria and becoming head of English before setting off across the world to teach at Hokkaido University in Sapporo in 1979.\n\nWillie was loved at Shrewsbury, where he galvanised drama classes, was an outstanding pastoral teacher and a long-distance runner, but Japanese culture brought out his best. It led to the flowering of a fascination with craftsmanship, dating back to his father’s skill, which was the opposite of “butchery” in the pejorative sense.\n\nWriting was his craft, and he applied it to studies of the relationship between English and Japanese, and essays on the craftsmen and craftswomen of Hokkaido. These became a book, while he continued to teach as an emeritus professor, the first foreigner to hold the title, until a few months before his death. Watching a Zoom class last year on As You Like It instantly brought back 1960s Shrewsbury for me.\n\nWillie was looked after in his last years by a devoted family in Sapporo after the state system was unwilling to maintain support for a foreign citizen. Masa and Ai Ikeda and their children, Hina and Sora, became his second family as well as carers and took his ashes be scattered on Coles Tump in Herefordshire, where he had played as a boy. He had called the area “that in-between border-land which is not quite one thing, not quite the other, from which I have always needed to take my own liminal bearings”.\n\nHe is survived by his brother, Robert, sister, Rosemary, and nieces, Gwen and Emma.",
  "medium": "Article",
  "links": [
    "https://www.theguardian.com/uk-news/herefordshire",
    "https://www.theguardian.com/world/japan",
    "https://www.theguardian.com/uk-news/shropshire"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Willie Jones",
      "weight": 0.076409854
    },
    {
      "name": "Shrewsbury school",
      "weight": 0.07392998
    },
    {
      "name": "St Bees school",
      "weight": 0.07366887
    },
    {
      "name": "Willie Jones obituary",
      "weight": 0.07290569
    },
    {
      "name": "Hereford high school",
      "weight": 0.07136841
    },
    {
      "name": "last year",
      "weight": 0.06693299
    },
    {
      "name": "Willie",
      "weight": 0.065384835
    },
    {
      "name": "English",
      "weight": 0.06328894
    },
    {
      "name": "school",
      "weight": 0.061611816
    },
    {
      "name": "Bill Jones",
      "weight": 0.05867846
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.861328125
    }
  ],
  "sentiment": {
    "positive": 0.1763916,
    "negative": 0.39672852,
    "neutral": 0.4267578
  },
  "summary": "Willie Jones, a former English teacher, has passed away at the age of 94. Born in Hereford, Jones combined a passion for texts with patience and passion to guide students in the UK and Japan. He studied English at St Catharine’s College, Cambridge and taught at Shrewsbury school in Shropshire before moving to Hokkaido University in Sapporo in 1979. He continued teaching as an emeritus professor, the first foreigner to hold this title. His last years were cared for by a devoted family in Hokoro after the state system was unwilling to support a foreign citizen. Willie's ashes will be scattered on Coles Tump in herefordshire where he had played as a boy.",
  "shortSummary": "Willie Jones, an inspirational English teacher known for his warmth and patience, died at 94; he taught Japanese and English literature together.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "501547a49852414193e3e7b6135e2b46",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.theguardian.com/uk-news/shropshire",
      "text": "Other lives: English teacher at Shrewsbury school in Shropshire who emigrated to Japan and taught at Hokkaido University\nJune 2025\nAt last, a victory for rivers over megafarms: now councils can’t treat toxic waste as someone else’s problem\nCharles Watson\nWe won a high court case against Shropshire council’s plans for a new polluting poultry unit. Now a precedent has been set, says River Action founder Charles Watson\nPoultry megafarm in Shropshire halted over river pollution concerns\nPlanning permission quashed by high court after officials failed to consider impact of spreading manure on land\nGordon Baldwin obituary\nBritish potter and ceramic sculptor fascinated by the ‘vessel’, which he used as a metaphor for imaginary terrains and travel\nApril 2025\nChicken megafarm in Shropshire must not be built, clean river group tells court\n‘Huge volumes of chicken muck’ entering rivers are harmful to fish and plants, campaigners argue at Cardiff high court\nMarch 2025\nFor whom the bell tolls: hunt for missing piece of Shrewsbury’s industrial history\nOther lives\nPeter Starbuck obituary\nFebruary 2025\nCountry diary\nCountry diary: Daffodil buds have appeared out of a memory of spring\nThe Marches, Shropshire: On a windswept day with wild energy in the skies, something is happening out on the heath\nJanuary 2025\n‘We stand by Jess’: Telford survivors criticise Musk’s attack on Phillips\nExclusive: Victims of male violence sign letter praising minister for devoting life to ‘fighting for women and girls’\nDecember 2024\nCountry diary\nCountry diary: Quieter days around the solstice\nShropshire Wildlife Trust raising funds to buy 50-hectare nature-rich site\nNovember 2024\n‘The sores on the fish are nasty’: what’s behind the changes in the River Severn?\nUK’s intensive farming hotspots have 79 times more chickens than people, data shows\nSeptember 2024\nA new start after 60\nA new start after 60: I became a foster carer at 75 – and it has helped keep me young\nPatricia Swan thought she might be considered too old to care for young children. But now she and her husband are looking after three siblings under seven\nEscaped capybara Cinnamon returned to Shropshire zoo\nDaring breakout by 25kg rodent, found in nearby woods, made headlines around the world\nShropshire zoo seeks runaway ‘beloved’ capybara\nTelford’s Hoo Zoo and Dinosaur World urges public to report sightings of Cinnamon and not approach her\nJuly 2024\nCountry diary\nCountry diary: Life is hanging on at this heavenly crossroads\nArchaeological survey detects Roman villas and iron age farmsteads in Shropshire\nJune 2024\nCountry diary\nCountry diary: The grass is up – and so is the pollen count\nWest Mercia police in ‘chaos’ after failure to find new chief constable"
    }
  ],
  "argos_summary": "Willie Jones, a beloved English teacher who passed away at 94, inspired countless students in the UK and Japan with his passion for literature and warm teaching style. After serving in the military, he taught at various schools before becoming the first foreign professor at Hokkaido University in Japan, where he explored the relationship between English and Japanese cultures. He is remembered for his dedication to education and the profound impact he had on his students, as well as for his close ties with a family in Sapporo who cared for him in his later years.",
  "argos_id": "8P0MABGWS"
}