{
  "url": "https://www.inc.com/reuters/white-house-officials-defend-firing-of-labor-official-as-critics-warn-of-trust-erosion/91222558",
  "authorsByline": "Reuters",
  "articleId": "84918edfde564e89bde958e4a05d30af",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/08/TrumpFiring.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:04:51+00:00",
  "addDate": "2025-08-03T18:14:44.362924+00:00",
  "refreshDate": "2025-08-03T18:14:44.362926+00:00",
  "score": 1.0,
  "title": "White House Officials Defend Firing of Labor Official as Critics Warn of Trust Erosion",
  "description": "Trump allegedly has 'concerns' about Bureau of Labor Statistics data.",
  "content": "U.S Trade Representative Jamieson Greer told CBS that Trump had “real concerns” about the data, while Kevin Hassett, director of the National Economic Council, said the president “is right to call for new leadership.” Hassett said on Fox News the main concern was Friday’s BLS report of net downward revisions showing 258,000 fewer jobs had been created in May and June than previously reported. Trump accused BLS Commissioner Erika McEntarfer of faking the jobs numbers without providing any evidence of data manipulation. The BLS compiles the closely watched employment report as well as consumer and producer price data.\n\nThe BLS gave no reason for the revised data but noted that “monthly revisions result from additional reports received from businesses and government agencies since the last published estimates and from the recalculation of seasonal factors.” McEntarfer’s firing added to growing concerns about the quality of U.S. economic data published by the federal government and came on the heels of a raft of new U.S. tariffs on dozens of trading partners, sending global stock markets tumbling as Trump presses ahead with plans to reorder the global economy. “I think what we need is a fresh set of eyes at the BLS, somebody who can clean this thing up,” Hassett said on “Fox News Sunday.”\n\nIn an interview with CBS’ “Face the Nation,” Greer acknowledged there were always revisions of job numbers, “but sometimes you see these revisions go in really extreme ways.” Critics, including former leaders of the BLS, slammed Trump’s move and called on Congress to investigate McEntarfer’s removal, saying it would undermine trust in a respected statistical agency. There was no way a commissioner could rig the jobs numbers, said William Beach, a former BLS commissioner and co-chair of the group Friends of the BLS.\n\n“Every year we’ve revised the numbers. When I was commissioner, we had a 500,000 job revision during President Trump’s first term,” Beach said on CNN’s “State of the Union. “And why do we do that? Because firms are created or firms go out of business, and we don’t really know that during the course of our of the year, until we reconcile against a real full count of all the businesses.” Democrats and at least two Republican senators also criticized the firing.\n\n“This is a preposterous charge. These numbers are put together by teams of literally hundreds of people following detailed procedures that are in manuals,” former Treasury Secretary Larry Summers said Sunday on ABC’s “This Week.” “What does a bad leader do when they get bad news? Shoot the messenger,” Senate Minority Leader Chuck Schumer said in a speech on the Senate floor on Friday. The firing came amid a flurry of economic upheaval last week.\n\nJust hours before the tariff deadline on Friday, Trump signed an executive order imposing duties on U.S. imports from countries including Canada, Brazil, India and Taiwan, in his latest round of levies as countries attempted to seek ways to reach better deals. Greer and Hassett said on Sunday the bulk of those tariffs are likely to stay in place rather than be cut as part of continuing negotiations. India pushed back on Trump’s threats of an additional penalty if it kept purchasing oil from Russia, two Indian government sources told Reuters on Saturday. Trump imposed a new 25 percent tariff on Indian goods.",
  "medium": "Article",
  "links": [
    "https://incpowerpartners.secure-platform.com/a"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "job numbers",
      "weight": 0.07275788
    },
    {
      "name": "BLS Commissioner Erika McEntarfer",
      "weight": 0.07264054
    },
    {
      "name": "U.S. economic data",
      "weight": 0.07236201
    },
    {
      "name": "new U.S. tariffs",
      "weight": 0.07195777
    },
    {
      "name": "Trump",
      "weight": 0.07017046
    },
    {
      "name": "BLS",
      "weight": 0.068069
    },
    {
      "name": "net downward revisions",
      "weight": 0.05916624
    },
    {
      "name": "monthly revisions",
      "weight": 0.05842821
    },
    {
      "name": "additional reports",
      "weight": 0.057780493
    },
    {
      "name": "Fox News Sunday",
      "weight": 0.0572704
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9658203125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.4990234375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.46875
    }
  ],
  "sentiment": {
    "positive": 0.026641846,
    "negative": 0.8520508,
    "neutral": 0.121276855
  },
  "summary": "The White House defended the firing of BLS Commissioner Erika McEntarfer, accusing her of faking the jobs numbers without providing evidence of data manipulation. Critics, including former leaders of the BLS, have called for new leadership and called for Congress to investigate McEnterfer's removal, arguing that it would undermine trust in a respected statistical agency. The BLS gave no reason for the revised data, but noted that it resulted from additional reports received from businesses and government agencies and from recalculation of seasonal factors. The firing of McEntarfen adds to concerns about the quality of U.S. economic data published by the federal government and comes amid a flurry of economic upheaval following a series of new tariffs imposed by President Trump.",
  "shortSummary": "White House officials defended the firing of BLS Commissioner Erika McEntarfer amid concerns over job revisions and global economic turmoil.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f58812630e23491fbcd7b5d8dec1fdca",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://incpowerpartners.secure-platform.com/a",
      "text": "Worldwide Recognition\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\ndouble-click to edit, do not edit in source\ndouble-click to edit, do not edit in source\nExtended Deadline: August 8 (Fee: $1,295)\nBe Recognized as the Force Behind Business Success\nAre you the engine that helps businesses grow, scale, and thrive? Whether you deliver game-changing software, essential logistics, cutting-edge marketing, or top-tier customer service, your company could be recognized as an Inc. Power Partner—the ultimate honor for B2B excellence.\nInc.’s Power Partner Awards celebrate and promote the companies that entrepreneurs and small businesses trust the most—the partners that truly move the needle. This prestigious list highlights the very best B2B providers in the United States and around the globe.\nIf your company has a proven track record of helping others win and happy clients who can back you up, apply today to become an Inc. Power Partner—and let the world know you're a B2B powerhouse.\nLet Inc. show the world that your company is devoted to providing entrepreneurs with the tools and resources they need to start, run, and grow their businesses. Here’s what to expect if your company makes this year’s list:\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\nAll honorees will be featured on Inc.com and receive a custom profile page touting your firm's recognition as a top B2B partner.\nYou’ll receive the Inc. seal of approval that your firm has an impressive track record of helping entrepreneurs and owners of small to medium-size businesses.\nInc.’s validation will help you land new clients to continue growing your business.\nBe proud of the business you’ve created. Take a few minutes to apply and let Inc. magazine declare your company one of the best to partner with.\nEvery application will be reviewed directly by Inc. editors. You may apply to as many of the below categories as fit your company, creating multiple opportunities for recognition in Inc. magazine and on Inc.com. Multiple honorees will be named in each category.\nOpen to all companies, in any industry, that help business owners start, run, or grow their businesses.\nCompanies based in the United States that have exceptionally empowered their partners to start, run, and grow their businesses at all levels\nCompanies that help organizations grow through strategic campaigns, lead generation, market research, and more.\nCompanies based outside the U.S. that are power partners to local businesses, or have helped companies source, distribute, sell, market, and build internationally.\nBusinesses that provide products and services exclusively to other businesses.\nFirms that help businesses build and develop brand identities and create compelling assets, from website design to corporate branding.\nCompanies that provide the physical infrastructure and services that keep businesses running, including maintenance, cleaning, office management, workspace solutions, and more.\nFirms that provide essential financial services to organizations—from accounting to investment—or legal expertise for compliance, litigation, and more.\nCompanies that support hiring, training, benefits management, compliance, and employee engagement.\nCompanies that keep businesses operating smoothly and efficiently through supply chain management, logistics solutions, fulfillment services, and more.\nFirms that create and maintain a positive public image for the individuals, groups, or organizations they represent.\nCompanies that deliver services through the internet, including data storage, servers, databases, networking, and software.\nCompanies that provide tech expertise, from software development to IT infrastructure to digital transformation.\nSmall businesses that thrive at powering other businesses, often without the resources of their larger peers or competitors. These are the companies that have done the most with the least.\nEstablished businesses that have significantly grown in size while never losing their focus on serving the best products and services to other businesses.\nMidsize companies that have started growing in size but haven’t let that growth distract from their top priority of addressing the unique needs of other businesses.\nApplications are open to small-to-midsize companies, in all industries and locations, including government-funded agencies. Public, private, non-profit, subsidiary, U.S.-based, and international companies are all encouraged to apply.\n1. Complete Your Short Application: Complete the short application here by filling in basic information about your company and selecting the categories you’d like to apply for.\nExtended Deadline: August 8 (Fee: $1,295)\n2. Provide Customer References: In the application, you'll provide Inc. with at least three, and up to 10, companies that have used your products or services over the past year. Inc. will send a survey containing four straightforward questions asking how likely your customer is to recommend your product or service. Inc. will score these results and combine them with our own research to produce a list of hundreds of winners. See our full methodology here.\nImportant Note: Past honorees may renew their Inc. Power Partner seal of approval each year without providing additional customer references. Simply complete the application and Inc. will vet your company to ensure it is still in good standing.\n3. Watch for Our Announcement of the 2025 Inc. Power Partners: The list goes live on Inc.com in late-October 2025. Whether or not you make the list, you will be notified via email in September, before it is released to the general public.\nExtended Deadline: August 8 (Fee: $1,295)\nFor full application details see our FAQs here.\nQuestions? Email Inc. at PowerPartners@inc.com."
    }
  ],
  "argos_summary": "U.S. Trade Representative Jamieson Greer and National Economic Council director Kevin Hassett expressed concerns over recent job data revisions by the Bureau of Labor Statistics (BLS), which showed a significant downward adjustment of 258,000 jobs for May and June. President Trump accused BLS Commissioner Erika McEntarfer of manipulating the numbers, leading to her firing, which has drawn criticism from former BLS leaders and lawmakers who argue it undermines trust in economic data. Amidst this turmoil, Trump also imposed new tariffs on imports from several countries, further impacting global markets.",
  "argos_id": "B58CASBRS"
}