{
  "url": "https://www.forbes.com/sites/estherchoy/2025/08/03/genuine-executive-presence-3-surprising-steps-to-actually-develop--it/",
  "authorsByline": "Esther K. Choy",
  "articleId": "20588340d6f249e49e1d80344b8fe6e6",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/688e14a95a6734eee34b99e3/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:30:00+00:00",
  "addDate": "2025-08-03T18:37:29.115907+00:00",
  "refreshDate": "2025-08-03T18:37:29.115908+00:00",
  "score": 1.0,
  "title": "Genuine Executive Presence: 3 Surprising Steps To Actually Develop  It",
  "description": "We recognize executive presence when we see it, but the path to achieving it is elusive for most of us. These 3 steps will help us get there.",
  "content": "In her book Executive Presence, Sylvia Ann Hewlett argues that executive presence is defined by three pillars: How you act, speak, and look. She gives concrete tips on how to achieve executive presence, including, “minimize signs of age and downplay any infirmity.\" Executive presence is often described as an intangible quality like “grace under fire” expressed through physical attributes — having good posture, speaking in a commanding voice, projecting confidence during a contentious board meeting. That’s because we recognize executive presence when we see it, but the path to achieving it is fuzzy and elusive for most of us.\n\nBut authentic executive presence is not simply about appearances. To achieve executive presence, we must cultivate inner habits that transform the way we interact with the people we lead from the inside out. The following three steps to improving executive presence are not going to teach you how to learn to love the limelight or how to appear confident when you are nervous. Rather, they will help you improve your relationships and understanding of others and yourself in powerful ways. These inner habits will, in turn, allow you to develop authentic executive presence.\n\nA good listener does more than lean forward in their seat and nod their head. Though habits like this can help a person know you are paying attention, a truly good listener draws out the speaker by demonstrating curiosity and interest through the use of open-ended questions. When your team feels seen, heard and understood, trust and goodwill will flourish. A leader can't be truly effective if her teams don't trust her.\n\nTo be able to inspire and lead your team with confidence you have to understand them. And to develop an authentic understanding of the people you are leading, .\n\n“How you think is how you lead,” CEO of a manufacturing technology, Bob Chapman explained when he adopted the Truly Human Leadership style. “If you view each of [your employees]\n\nas the human beings that they are—as someone’s precious child whom you are helping to become all they were meant to be, empowering them becomes easy because they feel cared for and valued and they want to contribute their gifts to the shared purpose.”\n\nAt the center of this approach is listening. For this reason, Barry-Wehmiller requires its executive leaders to take courses in empathetic listening. Chapman continued: “The conventional wisdom is that leaders tell people what to do and how to act. We believe that the most powerful thing a leader can do is to truly and deeply listen.”\n\nPeople with executive presence are often caught telling the right story at the right moment. A brief, brilliant story can turn a run-of-the-mill interaction into a meaningful and memorable one. But having the right story ready to tell when the moment arises requires that you understand your own stories. Therefore you must for stories. When you understand the experiences you’ve been through and how they demonstrate your character, it not only helps you understand who you are, it also helps you trust that you are in the right place at the right time – and that the stories you have to tell are the right stories.\n\n, Manager for Continuous Improvement & Sustainability at Kiswire Europe, recalled that learning how to make sense of his life experiences was transformational for him. He said, “I learned to make a sculpture out of the rocks at a crucial transitional point in my career. I thought of the separate experiences of my life and work as rocks—separate moments that were not connected.” Through storytelling coaching, “I was able to look back on these rocks and see how they fit together. Our sessions forced me to think and reflect on the moments of my life. As a result, I was able to create a sculpture out of the rocks: a cohesive story that now welds these experiences together.”\n\nXenos’s experience captures the power of being able to trust your story. It helps you to uncover and comfortably articulate your character — the reasons you do what you do. Trusting your story builds trust with others.\n\nPeople with executive presence are memorable. When you have to give a presentation or when you meet someone new, have fun and make it memorable by using word play. Word play is both fun for you as the leader and for your audience. Word play is memorable because it's unexpected and snappy. Here are some examples:\n• Flip Flop Words: When you change the position of words, it changes the meaning. Example: People don’t care how much you know until they know how much you care.\n• Contradiction: When you contradict commonly held beliefs, you make people stop and think, because it's not what they expected you to say. Example: \"Be brave enough to suck at something new.”\n• Lean On The Little Ones: Use the power of \"to be\" verbs and prepositions in commonly heard phrases, such as “Progress makes perfect” vs. “Progress over perfection” vs. “Progress is perfection.”\n\nA sales leader at Moore, a constituent experience management company for leading nonprofits, Leigh Janis uses word play to make an impression while networking. Instead of simply stating her name and title, she calls herself a \"Rejection Therapist\" to call attention to the complex and human side of sales. Like mining your life stories, using word play takes some thoughtfulness and prep work beforehand. You must ask what you want your audience to remember and why. The answers to those questions will inform what phrase you want to highlight in your on-stage moment with word play.\n\nTaking these three steps toward executive presence requires some bravery. Most of us are not used to intentionally employing the power of being a good listener, trusting our own stories, or using word play at work. But if we build up these new habits, we will transform our relationships with ourselves and the people we lead. So why not be brave enough to try something new!",
  "medium": "Article",
  "links": [
    "https://www.barrywehmiller.com/home",
    "https://www.linkedin.com/in/leigh-janis-130a19a/",
    "https://www.forbes.com/sites/estherchoy/2019/11/03/3-listening-skills-from-storycorps/",
    "https://www.leadershipstorylab.com/testimonials/page/2/",
    "https://www.forbes.com/sites/estherchoy/2020/05/03/how-leaders-identify-good-stories/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Executive presence",
      "weight": 0.091716155
    },
    {
      "name": "executive presence",
      "weight": 0.091716155
    },
    {
      "name": "authentic executive presence",
      "weight": 0.08926806
    },
    {
      "name": "Word play",
      "weight": 0.072706655
    },
    {
      "name": "word play",
      "weight": 0.072706655
    },
    {
      "name": "stories",
      "weight": 0.06368922
    },
    {
      "name": "words",
      "weight": 0.057283346
    },
    {
      "name": "leaders",
      "weight": 0.05444905
    },
    {
      "name": "leading nonprofits",
      "weight": 0.052272115
    },
    {
      "name": "separate moments",
      "weight": 0.050004218
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.61962890625
    },
    {
      "name": "/People & Society/Self-Help & Motivational",
      "score": 0.607421875
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.505859375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.489501953125
    }
  ],
  "sentiment": {
    "positive": 0.22070312,
    "negative": 0.33911133,
    "neutral": 0.44067383
  },
  "summary": "Sylvia Ann Hewlett, author of Executive Presence, has outlined three key steps to achieve authentic executive presence. These include avoiding signs of age and downplaying any infirmity, and improving your relationships with others and yourself. These steps are not just about appearances but transform the way leaders interact with their team from inside out. The CEO of a manufacturing technology company, Bob Chapman, believes that an authentic understanding of the people you lead can make an impact. The company requires its executive leaders to take courses in empathetic listening. To achieve this, focus on understanding your own stories and building trust in the team.",
  "shortSummary": "Three key steps, including listening, can enhance executive presence by developing authentic leadership through engaging, self-confidence-influenced storytelling and trust, enhancing relationships and trustworthiness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "00a129ffaa1b465d9986e31a905f97a1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.leadershipstorylab.com/testimonials/page/2/",
      "text": "What Our Clients Are Saying\nWe have enjoyed working with these clients and would love to work with you! See how we can make a difference.\nBrad Eshgh, Brand Manager, RB\n“A couple of years on from Business School and on the cusp of starting a new job, I wanted to thank you for your help ~5 years ago. Since business school, I’ve consistently received compliments for being able to communicate compelling business stories and I owe a lot of the fundamentals to your coaching and key tenants of storytelling. I have no doubt many people have expressed similar sentiment to you, but let me be the latest.”\n- Brad Eshgh, Brand Manager, RB\nKavita Lobo, Associate Certified Coach (ICF), Life & Executive Coach, Corporate Facilitator, Storyteller\n“You were open and free, and poured out nuggets to help me reach closer to my destination of becoming a storyteller. Every day in every way I am getting better and better, especially when beautiful souls like yourself extend themselves to lift fellow travelers. ”\n- Kavita Lobo, Associate Certified Coach (ICF), Life & Executive Coach, Corporate Facilitator, Storyteller\nTina Peters, Senior Learner Experience Manager Wiley Education Services\n“I appreciated the reflective nature of the coaching. It made me dig into the ‘whys’ of my life in ways I hadn’t considered before. I loved that Esther shared the big picture first, so I had a clear understanding of what business storytelling was and why it’s essential. Along the way, I applied bits and pieces of what I was learning right away in my real-world context. I loved brainstorming and collaborating with Esther.”\n- Tina Peters, Senior Learner Experience Manager Wiley Education Services\nSharon d’Amore, Educational Leadership Consultant, Educational Answers\n“Esther has increased my confidence. She is excellent, and listens to your issues and challenges. She’s a quick study, very solution oriented, and provides tools for life when it comes to storytelling for business and/or personal conversations.”\n- Sharon d’Amore, Educational Leadership Consultant, Educational Answers\nLuawanna Hallstrom, Principal, Collaborative Communications\n“Regardless of whether it’s my story or my client’s story, the IRS model of intriguing beginning, riveting middle, and surprise ending has become a mantra for me. I just got a call from a large contractor who needed help to win a very critical vote. They needed to tell a story that voters could identify with. I’m living all of these things that I’ve learned through the story facilitators’ certification process, and I believe that together we can change the world, one story at a time.”\n- Luawanna Hallstrom, Principal, Collaborative Communications\nMelissa Graham, Head Spear, Founding CEO, Purple Asparagus\n“Esther is a skilled teacher in the art of storytelling. She instills confidence and coaxes out details to use in crafting compelling stories that are well suited to convince and persuade in the business setting. Personally, she helped me reengage with storytelling, an art that I had set aside as child’s play when I went into the legal profession. My only wish is that I had met Esther earlier in my non-profit career.”\n- Melissa Graham, Head Spear, Founding CEO, Purple Asparagus\nYalexis Barr, Partnership Manager, Partners International Canada\n“Thanks for facilitating such a great workshop! I left feeling confident and capable of crafting a good story that would create interest around my organization and our cause!”\n- Yalexis Barr, Partnership Manager, Partners International Canada\nCarol Semrad, Principal, C. Semrad & Associates\n“Reena’s leadership storytelling session for Chicago SHRM’s Breakfast Bites was engaging, enlightening and fun! I learned, very quickly, how to craft a story that is compelling for the listener, clearly communicates my message and is fun to tell. It was wonderful to have new learning to use immediately. It was not complicated or difficult to remember and was delivered in a setting where I could meet new colleagues and begin to build relationships. Thank you Reena!”\n- Carol Semrad, Principal, C. Semrad & Associates\nHari Xenos, Former Continuous Improvement Manager, ArcelorMittal\n“The coaching forced me to “make a sculpture out of the rocks” at a crucial transitional point in my career. Before Esther’s coaching, I thought of the separate experiences of my life and work as “rocks” or “rubble”—separate moments that were not connected. Through Esther’s coaching, I was able to look back on these rocks see how they fit together. Our sessions forced me to think and reflect on the moments of my life. As a result, I was able to create a sculpture out of the rocks: a cohesive story that now welds these experiences together.”\n- Hari Xenos, Former Continuous Improvement Manager, ArcelorMittal\nElizabeth Gordon, Vice President of Analytics, Edge Direct\n“The storytelling training showed me how 65 pages of data slides can be reduced to 30 words! I will use these storytelling techniques when teaching new concepts to my team and when expressing complicated data sets in ways that drill down to their essence.”\n- Elizabeth Gordon, Vice President of Analytics, Edge Direct\nDeirdre Harrison, COO, Eighth Blackbird\n“During a stellar, fun, two-day Executive Education course at Kellogg’s Center for Nonprofit Management, Esther Choy’s sessions on storytelling in philanthropy were as much about listening and creating space for others’ stories as they were about how to craft a persuasive story quickly and effectively. We all left with an immediately actionable toolbox just in time for end of year giving season. Her book is a story recipe book for the holidays!”\n- Deirdre Harrison, COO, Eighth Blackbird\nHeather Gardner, Financial Institutions Business Development, William Blair\n“Esther makes storytelling look effortless. Her coaching took me to a new, elevated level by teaching me a formula I can use to create stories again and again. She challenged me and made me dig deep, especially with the self-discovery process of writing stories. I will be able to put these new tools into action throughout my career and my life. If you have the opportunity to go through the process with Esther, it is well worth your time and energy. I highly recommend Leadership Story Lab!”\n- Heather Gardner, Financial Institutions Business Development, William Blair\nSteve Silzer, Marketing Director, Tyson Foods\n“We worked with Leadership Story Lab to revamp our external talent marketing materials as we were heading on campus to connect with MBA students. Leadership Story Lab did a fantastic job of understanding our objectives and where we were on our journey. They helped us create a customized scope of work that unveiled several untapped themes. With Esther’s guidance, we wove these themes into our new Tyson story, and created an entirely new communication approach which fostered strong connections to potential candidates. The proof is in the pudding, so to speak, since we saw a spike in conversion of more than 20 percentage points vs. historical standards, which is why we are repeating the approach again this year. I highly recommend Esther and team!”\n- Steve Silzer, Marketing Director, Tyson Foods\nAli Barnes, Multichannel Engagement Manager, Eli Lilly and Company\n“I believe in the power of a good story and how that can lead to great employee engagement. Leadership Story Lab afforded our large marketing team not only the opportunity to refine our storytelling capabilities, delivering technical information to nontechnical audiences, but it also served as a phenomenal team builder. Leadership Story Lab provided us with resources that we can use to keep this time of learning and reflection alive throughout our daily work. Leadership Story Lab is a professional organization that leaves complex, corporate working teams with actionable goals and tools. We have already recommended them to over a dozen other working groups within our organization.”\n- Ali Barnes, Multichannel Engagement Manager, Eli Lilly and Company\nMike Maiorisi, Sr. Business Operations Associate, athenahealth\n“I’ve been delivering presentations for years but after reading this book, I felt a change in the way I built and prepared my story. The end result was a deck that features little text, heavy pictures and mostly speaker notes…and it was extremely effective. The audience was engaged, asked questions and was generally excited over the content. I would recommend this book to anyone that delivers presentations or further, talks to people – the lessons are applicable to anything!”\n- Mike Maiorisi, Sr. Business Operations Associate, athenahealth\nMarisa Bono, Senior Integration Design Manager, athenahealth\n“This has been the best professional development workshop I’ve attended at athenahealth. It has taught me to reframe my thinking and communication to be more compelling.”\n- Marisa Bono, Senior Integration Design Manager, athenahealth\nLu Cheng via Google Reviews\n“Esther is such as inspiring speaker. I was able to build my own story that is true to myself and unique. Got lots of positive feedback from attendees, including ‘It was fascinating to understand what others found interesting in my story vs. what I care about.'”\n- Lu Cheng via Google Reviews\nClaudia Gamboa, Sr. Program Manager, Ziploc, Global RD&E, SC Johnson\n“One of the benefits of moving from a presentation-style to a story-telling style is that we’ve had much better conversations, much more feedback from everyone in the room, and greater learning for our project team.”\n- Claudia Gamboa, Sr. Program Manager, Ziploc, Global RD&E, SC Johnson\nJames Allison, Vice President, Brookfield Investment Management.\n“Once I began telling friends and family the good news about my new job, everyone wanted to know the secret: how did I go from French Literature and Retail to Finance and Real Estate? The key for me was Esther’s coaching, guidance and perspective. I left my Leadership Story Lab workshop knowing how to craft a more compelling story. How my past experience would help me navigate my future career path. How to turn my nontraditional background from a liability into an asset. And how to convince others to believe in me as much as I now believe in myself.\n- James Allison, Vice President, Brookfield Investment Management.\nGlenn Hollister, Principal and Practice Leader, ZS Associates.\n“I have hired Esther twice for my firm. The first time she ran a workshop for our office leadership to help them improve how they introduce themselves, especially in selling situations. The second time was to help me craft a compelling story for an important public speaking event. In both cases Esther had a significant impact how how my team and I communicate. I fully intend to hire her again.\n- Glenn Hollister, Principal and Practice Leader, ZS Associates."
    },
    {
      "url": "https://www.forbes.com/sites/estherchoy/2019/11/03/3-listening-skills-from-storycorps/",
      "text": "Conversation patterns reinforce relational roles. A manager with 20 years more industry experience than her average team member will likely default to “expert” role, doling out work-related advice (maybe even life-related advice) while non-experts listen. From colleagues to friends to family members, we tend to lock into these roles.\nPatterns offer comfort, letting us know how to act. But what should we do when relationships feel stuck?\nListen.\nStudies have shown that feeling understood not only strengthens relational bonds but also enhances life satisfaction. People more quickly warm up to strangers who “get” them. And, when listened to, people’s attitudes become “less extreme,” as researchers Guy Itzchakov and Avraham N. Kluger write in Harvard Business Review. They found that people who feel listened to become less “one-sided.” Being listened to helps bridge divides, thereby “unsticking” stubborn relationship dynamics.\nBut how can we cultivate listening in modern life, when time and patience are often in short supply?\nBusy leaders can create space for engaging, informative. inspiring, and even life-altering conversations by using some of the listening techniques the American nonprofit StoryCorps teaches.\nStoryCorps has recorded over 100,000 conversations so far, some of these through their Great Thanksgiving Listen project, where school children around the U.S. record an interview with an elder.\nWhether you want to have quality conversations with friends and family during the holidays or colleagues and customers at work year round, replicating the StoryCorps process can improve those conversations.\n1. Deliberately want to have a conversation and regard that conversation as historic.\n“People take it very seriously,” StoryCorps CEO Robin Sparkman says of the time people spend having a conversation in a StoryCorps recording booth. “It’s 40 minutes, the lights are low, the trained facilitator is there to help prompt the conversation.....”\nEach StoryCorps conversation is archived in the Library of Congress, so the conversation literally goes down in history.\nWhat if we treated our own meaningful conversations as historic moments? We’d think about their impact. We'd consider the weight and intended meaning of our words. We'd reflect on how the other person will remember us.\n2. Prepare curiosity-driven questions, with respect.\nIn ten years of speaking on business storytelling, it amazes me how often I meet people who work alongside each other for years, but hardly know more than superficial facts about each other.\nStoryCorps provides a long list of possible questions you can use to change this, including:\n- “Tell me about how you got into your line of work.”\n- “Do you have any favorite stories from your work life?”\nI’ve also developed this series of questions that is particularly suited to business contexts.\nAs you begin to deepen your conversations, tailor the number of questions carefully. When her own children were preparing to interview their grandmother for StoryCorps, Sparkman considered the kind of person their grandmother is. Concluding that “she’s a pretty modest woman,” Sparkman told her kids that asking too many questions would make her self-conscious. She advised them to “think very carefully about your questions for her, and line them up in order of priority.”\n3. Listen.\nSince StoryCorps’s goal is to facilitate listening, Sparkman has pondered what makes a good listener. “You have to really try to genuinely connect with the person who is telling the story to you. Even if they are a stranger, or you feel like, ‘God, there’s nothing in common,’” it’s a matter of “just quieting yourself and connecting with something the person is telling you, and trying not to interrupt.”\nSparkman adds that it’s important to be conscious of whether, “if you make a comment, are you redirecting the conversation back to yourself or something that you’re comfortable with?” Good listening, she says, stretches beyond this. “To be a good listener, you’re staying on the topic with that person.”\nStaying on topic takes disciplined listening. “It’s not that bringing the conversation back to yourself is so terrible,” Sparkman says, it’s that hearing what people want to open up to you about requires “being very mindful of whether your input in the conversation is shifting the topic away from what your storyteller is trying to say.”\nIn other words, disciplined listening is patient listening. “Patience is really in short supply these days,” Sparkman notes. “Being patient and letting someone finish what they were trying to say...it’s a gift!” It’s an “aggressive listening” that includes body language, mental state and clarifying questions.\nWhen you give others this gift, you can free yourself from relational ruts. You might even increase the other person’s life satisfaction. And you can potentially change their minds about something you've been trying to persuade them about!\nFor even more guidance on how to reinvigorate your conversations, check out my article, “Break Out Of Unproductive Conversation Patterns.”"
    },
    {
      "url": "https://www.forbes.com/sites/estherchoy/2020/05/03/how-leaders-identify-good-stories/",
      "text": "In 2015, Neha Agrawal, a marketing executive at a global medical company, was selected as one of the opening speakers at her company’s multi-day leadership off-site. She needed to set the tone for the day as she spoke with peer senior executives on the topic of leadership. She had about 45 minutes to speak, with no other specific guidelines.\nShe needed to find a good story fast.\nUltimately, she chose one not from the realm of business but from her personal life. She told her audience of managers the story of climbing Mount Kilimanjaro in 2008 with her parents, sister, husband, and three children—nine people representing three generations and ranging in age from seven to seventy. Not a single one was an outdoor-adventurer type. “We’re more like eaters and strollers,” Agrawal said.\nSo Agrawal did everything she could to prepare everyone for the trip. For example, she packed everything each person needed each night in a separate Ziploc bag with a clear label, to avoid confusion on the mountain. Of course, they still faced plenty of obstacles, including challenges posed by her seventy-year-old parents’ health, and the fact that her children weren’t allowed past the second climbing station.\nFor 45 minutes at the leadership off-site, Agrawal regaled her audience with the riveting tale of this extraordinary family journey, with humility and humor. Given the event’s theme, she ended with a list of leadership lessons, like “prepare your team well” and “recognize all the different forms of leadership you will need.”\nMany leaders find themselves in Agrawal’s shoes. They know they want to tell stories but are left scratching their heads about how to go about it. Sometimes they even tell themselves, “But I don’t have any stories!”\nEveryone has stories. Each and every leader is sitting on top of a goldmine called life. It just takes some digging to find the right story. Keep in mind that it doesn’t have to be work-related. Rather, it can be from your personal life, just like Agrawal’s story. It can even be from your childhood—as long as you make it relevant.\nThere are two important questions to ask when searching for an effective leadership story.\n1. Is It A Story, Or Is It A Leadership Story?\nLike any story to be shared with a wide audience, a leadership story has to be a good one. It doesn’t have to be a story about how you saved the world, or even a story about how you saved a project. And it doesn’t have to be a story about an impressive feat like climbing Mount Kilimanjaro (though if you’ve done so, by all means share it!).\n“Given the choice between trivial material brilliantly told versus profound material badly told,” says screenwriter and story consultant Robert McKee, “an audience will always choose the trivial told brilliantly.”\nA leadership story must be more than just a “good story.” Yes, a riveting story is the baseline, but it also has to meet two other criteria:\n- Your audience has to know right away why you are telling it.\n- They have to feel something and do something about it.\nStart with these two criteria when you are searching for the right leadership story. Consider the change you want to see and find the story that inspires emotions that will motivate people to act.\nTo find out if your audience will understand why you’re telling the story, what they’ll feel and what they’ll want to do about it, ask them! Specifically, ask them these three questions:\n- What info do you recall from my story? (People forget quickly. In seeking feedback, what your audience remembers matters more than what you feel compelled to share.)\n- How does my story make you feel? (Emotion is the engine behind action. Assessing how your story makes audiences feel will guide you towards the desired action.)\n- After listening to my story, what questions do you have for me? (Are their questions aligned with what you most want to talk about? What you most want them to do with this information?)\n2. Is It A Pitch, Or Is It Truly A Story?\nThe meaning of “story” can easily get stretched, so that it’s difficult to differentiate between a pitch and a story.\nA pitch is a litany, while a story is a journey. A pitch lists your qualifications, credentials and competence without giving your audience a sense of progress, challenges or obstacles. A story, on the other hand, takes the audience from point A to point B, whether that takes one minute or one hour. A story is about change. If challenge is the nerve center of the story, then change is the soul of it.\nConfused about whether you’re working on a pitch or a story? Test your audience’s reaction.\nIf it’s a pitch, it will lead to more questions, and then a ‘yes’ or ‘no’ on whether they want to work with you.\nIf it’s a story, the audience will want to tell you their own story, or ask questions about various points in your story, or tell you about similar experiences that have happened to them. This is a really good sign! It means they have fully heard your story and will remember it!\nSo test your material. Ask close friends or colleagues for feedback on what you will be sharing, and decide from their response whether it is a pitch or a story.\nHere’s an example:\nI'm a recovering investment banker who now works in corporate philanthropy and social responsibility. My career has always focused on helping the world and the people in it. Our corporate program was recently overhauled, and we would love to work with you to help solve problems that face our community.\nIs it a pitch, or a story?\n“Recovering” is an excellent, creative touch. But don’t be fooled. This paragraph doesn’t take us on a journey yet, but rather lists reasons the audience should work with this person, so it is still a pitch, not a story.\nHere’s another example:\nI am the middle child with an older brother and younger brother. I grew up in a family and time when girls were told they should take care of boys.\nI was only encouraged to go to college so I could find a husband and take care of him, but not only did I complete an engineering degree, I got a PhD in electrical l engineering. Because a sense of fairness and justice were what encouraged me to keep taking the next steps in my career, I am careful to uphold both values when I work with my teams, and I would love to work with teams at your company.\nThis one has a beginning, middle and end: a journey from childhood to accomplished adulthood in a matter of a few sentences. This one is a genuine story.\nIf you’ve been able to categorize your own message as a story, the next question of course is… is it a good story?\nIf it’s a good story, your audience will feel closer to you. They don’t have to like you, but they have to feel like they know you better. For instance, I am currently taking Malcolm Gladwell’s MasterClass, and from the first session, I have felt like he’s my friend. His stories make me feel an affinity for him.\nI felt like he was talking with me, not speaking at me, and definitely not presenting to me. He was really \"into it.\" There’s also the occasional head scratching and nose rubbing that some fellow students criticize as unpolished. But it made me feel like he was at home, comfortable and talking like how my friends would talk with me. This is how your audience should feel too.\nTwo Prompts To Generate Effective Leadership Stories\nNeed a prompt to get your leadership story started? These two have consistently launched high-quality leadership stories for my clients.\nThink of a time when you’ve changed your mind or realized something you used to believe was wrong. Why did you change? What did you learn?\nA few years ago I hosted a newly admitted MBA students’ dinner. I asked them about a time they’d changed their minds. One responded by talking about how his views on Obamacare evolved. The dinner was designed as a “reverse-sell” and networking event, so he definitely took a risk by disclosing his views on a controversial subject among strangers! He said he used to be against Obamacare, but as he talked with those who supported or benefited from it, he realized his blindspots. He was not converted, necessarily, but he was able to see the holes in his argument. His story— and especially the risk he took in telling it—gained respect!\nHow does this story meet the criteria for leadership stories? This story could be used to change others’ minds. In searching for the right story, ask yourself first, “what do I want people to do about my story?” In this case, a leader might work with people who are very single-minded, and perhaps a little too stubborn. If the leader is thinking, “I want them to be more adaptive,” he or she could start with a story like this. It works well because it shows that you can, in the words of Gandhi, “be the change you want to see in the world.” You show that you, yourself, have had blindspots but have learned to embrace new perspectives.\nTell the story of a challenge you’ve faced and never expected you’d have to face.\nOne of my clients shared the following story of a humorous challenge:\nI was on a business trip from Geneva to another European city. I was chatting with my colleague, enjoying the food and company. When it was time to get off, I couldn't find my suitcase. My colleague was surprised by my reaction. Instead of panic, I was laughing. I had travelled for business for 25 years, and this was the first time I didn't have my suitcase. I considered myself extremely lucky!\nThis leader didn’t expect the challenge that came his way, but he overcame it with humor and a healthy perspective. And he was able to tell his story right away. When he showed up to his meetings the next day wearing jeans, he was able to share a humorous tale that illustrated his character.\nThis week, take a moment to sift through your life—your goldmine—and find stories with a clear central purpose that motivates your audience to action."
    }
  ],
  "argos_summary": "Sylvia Ann Hewlett's book 'Executive Presence' outlines that true executive presence is built on three pillars: how one acts, speaks, and looks, emphasizing the importance of inner habits over mere appearances. Key strategies for developing executive presence include becoming a good listener, understanding one's personal story, and using word play to create memorable interactions. By fostering authentic relationships and effectively communicating through storytelling, leaders can inspire trust and engagement within their teams.",
  "argos_id": "JYUZNBQ5R"
}