{
  "url": "https://finance.yahoo.com/news/ex-trump-lawyer-says-trump-183131207.html",
  "authorsByline": "Bibhu Pattnaik",
  "articleId": "5a8afad843bd42ee8f428789d86d34f7",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/Benzinga/9956736d2f3852827b859974648dee55",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:31:31+00:00",
  "addDate": "2025-08-03T18:37:00.973216+00:00",
  "refreshDate": "2025-08-03T18:37:00.973217+00:00",
  "score": 1.0,
  "title": "Ex-Trump Lawyer Says Trump Could Set Sights on Musk's Billions: 'It Bothers Him That He Is the Richest Man'",
  "description": "President Donald Trump‘s former personal attorney Michael Cohen has predicted that Trump might set his sights on the fortune of tech magnate Elon Musk following their recent spat. What Happened: Cohen thinks Trump’s jealousy of Musk’s position as the wealthiest man in the world could drive him to target Musk’s wealth. Musk, who is the CEO of Tesla Inc. (NASDAQ:TSLA), had earlier contributed $250 million to Trump’s 2024 campaign and was chosen to spearhead a cost-reduction initiative under the De",
  "content": "President Donald Trump‘s former personal attorney Michael Cohen has predicted that Trump might set his sights on the fortune of tech magnate Elon Musk following their recent spat.\n\nWhat Happened: Cohen thinks Trump’s jealousy of Musk’s position as the wealthiest man in the world could drive him to target Musk’s wealth.\n\nMusk, who is the CEO of Tesla Inc. (NASDAQ:TSLA), had earlier contributed $250 million to Trump’s 2024 campaign and was chosen to spearhead a cost-reduction initiative under the Department of Government Efficiency (DOGE).\n\nEarlier speaking with MSNBC, Cohen said, \"I said from the very start that this bromance was going to come to an end. I'm going to go one step even further, again, and I'm going to say Trump will ultimately go after Elon's money next because it bothers him that he is the richest man in the world.\"\n\nCohen, now a prominent critic of Trump, speculates that Trump could utilize DOGE to probe how Musk and his businesses “exploited the United States of America” and try to “reclaim” government subsidies given to Tesla.\n\nAlso Read: Ex-Trump Lawyer Sent This Message To Elon Musk After Feud With Donald Trump Erupted\n\nHowever, White House communications director Steven Cheung dismissed Cohen’s forecasts, describing him as a “deeply disturbed” person spreading “falsehoods and deception”.\n\nWhy It Matters: The conjecture by Cohen, if it materializes, could lead to a significant shift in the dynamics between Trump and Musk.\n\nThe latter’s wealth, largely attributed to his leadership at Tesla, has been a subject of public interest. Musk’s contribution to Trump’s campaign and his role in DOGE further intertwine their professional relationship.\n\nAny action by Trump targeting Musk’s fortune could potentially impact Tesla’s operations and its standing in the market. However, these are mere predictions at this point, and it remains to be seen how the situation unfolds.\n\nEx-Trump Family Attorney Raises Alarms Over Trump's Actions as President: ‘I Have Never Been As Concerned'\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nGet the latest stock analysis from Benzinga?\n\nThis article Ex-Trump Lawyer Says Trump Could Set Sights on Musk's Billions: 'It Bothers Him That He Is the Richest Man' originally appeared on Benzinga.com\n\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
  "medium": "Article",
  "links": [
    "http://finance.yahoo.com/q?s=TSLA",
    "https://www.benzinga.com/news/politics/25/08/46817700/ex-trump-lawyer-says-trump-could-set-sights-on-musks-billions-it-bothers-him-that-he-is-the-richest",
    "https://www.youtube.com/watch?v=9iKpUAYcdQQ",
    "https://www.benzinga.com/news/politics/25/07/46266380/ex-trump-lawyer-sent-this-message-to-elon-musk-after-feud-with-donald-trump-erupted?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=46817700",
    "https://www.benzinga.com/news/politics/25/07/46264859/ex-trump-family-attorney-raises-alarms-over-trumps-actions-as-president-i-have-never-been-as-concerned?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=46817700",
    "https://www.benzinga.com/quote/TSLA?getReport=1",
    "https://www.benzinga.com",
    "https://www.benzinga.com/premium/ideas/benzinga-edge-checkout/?t=be8be9spja3yaad1&utm_source=yahoo"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ex-Trump Lawyer",
      "weight": 0.11364141
    },
    {
      "name": "Donald Trump",
      "weight": 0.11227099
    },
    {
      "name": "Trump",
      "weight": 0.1103528
    },
    {
      "name": "Ex-Trump Family Attorney",
      "weight": 0.10778802
    },
    {
      "name": "Elon Musk",
      "weight": 0.10170388
    },
    {
      "name": "tech magnate Elon Musk",
      "weight": 0.09445877
    },
    {
      "name": "Musk",
      "weight": 0.09253094
    },
    {
      "name": "Michael Cohen",
      "weight": 0.07722191
    },
    {
      "name": "Cohen",
      "weight": 0.073720396
    },
    {
      "name": "Tesla Inc.",
      "weight": 0.070574544
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.92578125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.68896484375
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.467041015625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.323486328125
    }
  ],
  "sentiment": {
    "positive": 0.05871582,
    "negative": 0.6948242,
    "neutral": 0.24682617
  },
  "summary": "Michael Cohen, President Donald Trump's former personal attorney, has predicted that President Trump may target the fortune of tech magnate Elon Musk following a heated dispute. Cohen believes that Trump's jealousy of Musk's position as the wealthiest man in the world could motivate him to target Musk's wealth. He also suggested that Trump could use his influence to investigate how Musk and his businesses exploited the United States of America and try to reclaim government subsidies given to Tesla. However, White House communications director Steven Cheung dismissed Cohen's forecasts, describing him as a \"deeply disturbed\" person spreading \"falsehoods and deception\". Cohen's predictions could significantly impact Tesla's operations and its standing in the market.",
  "shortSummary": "Ex-Trump Lawyer Michael Cohen predicts that President Donald Trump may target Elon Musk’s billions due to his jealousy about being the world's richest man.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "41ead159ac9b46febfd06210d7e6411e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/premium/ideas/benzinga-edge-checkout/?t=be8be9spja3yaad1&utm_source=yahoo",
      "text": "While Wall Street panics, Edge members stay one step ahead of the chaos. With real-time portfolio alerts, actionable stock ideas, and pro-grade tools…you get the complete investor’s arsenal — ready to help you profit in any market, starting now.\n“After months of feeling like a deer in headlights, Edge finally gave me the conviction to make a move—and it was the right one.”\n“I was juggling so many newsletters and software subscriptions I lost count… now I just use this! Way more effective. And way easier to manage.”\n“I check Edge before I check the news. Before emails. It’s that important. Especially in this market.”\nForget endless market noise. We’ll give you what actually matters -clear signals, actionable opportunities, and the tools you need to invest with confidence.\nGo beyond information overload, and get powerful trade ideas delivered straight to your inbox. We’re talking 5 hidden gems weekly, pre-market setups daily, and instant rankings on any ticker. Plus, two ‘done for you’ portfolios crushing the market so far in 2025.\nEdge gives you the same powerful research tools the pros use — track what politicians are trading, detect insider moves, and spot breakout signals before they hit the news. No $10K Bloomberg terminal required.\nEvery morning we zero in on ONE stock flashing clear technical signals...\nthen hand you a confusion free chart setup with high profit potential.\nGain unfiltered access to what politicians are buying and selling. Our Government Trade Tracker allows you to invest alongside the Washington elite. Because why should Nancy and co. have all the fun? (and make all the money.)\nNever be caught off-guard by market-moving moments. Access 10+ critical event calendars to track earnings, FDA decisions, product launches, and other pivotal events that can dramatically impact stock prices.\nUncover near endless opportunities with this advanced Stock Screener. It includes 100+ customizable filters. Target precise metrics from fundamentals to technical indicators. Save hours of research while discovering what other traders miss.\nEliminate guesswork with our powerful Smart Calculators. They make it easy to map your potential profit zones for margins, options, and forex. Save hours of manual work while maximizing returns and reducing costly errors.\nMonitor elite market moves with our real-time Insider Trading Tracker. Spot exactly when executives buy or sell their own company stock. Follow the smart money when insiders put their personal wealth on the line.\nSpot big-money options bets that often signal coming price moves. See what the pros are targeting before major market swings happen. The Unusual Options Activity tool shows you exactly when someone makes a huge options bet.\nWall Street Ratings: Tap directly into the minds of Wall Street's top 1000 analysts. See which stocks are gaining favor, losing appeal, or catching fresh attention—all with proven accuracy metrics that separate signal from noise.\nDiscover what’s really moving markets… get actionable intelligence on hidden drivers, and upcoming profit triggers most investors are missing.\nSpot tomorrow’s market leaders, today…uncover the stocks that will shape the future – before they hit mainstream news.\nTrack where billionaires and Wall Street insiders are putting their personal fortunes…then see how to profit alongside them.\nMost just give you more content – Edge gives you a complete investing advantage in three powerful ways:\n1) Exclusive Research – We uncover the real stories driving markets before they become common knowledge, so you’re always a step ahead of the crowd.\n2) Expert Vetted Stock Picks – Instead of vague recommendations, you get specific trades with proven track records from analysts who put their reputation on the line.\n3) Professional-Grade Tools – Access the same institutional-level trading technology to spot opportunities and analyze market moves.\nNot at all. Whether you’re just starting out or investing for decades for, Edge translates Wall Street complexity into clear opportunities. Every insight comes with straightforward action steps, so you always know exactly what to do next. Advanced traders particularly value our institutional-grade tools and deep market intelligence.\nThink of Edge as your personal market filter. Instead of drowning in data, you get only what drives profits: key market moves, actionable trade ideas, and critical alerts for your watchlist. Every feature is designed to cut through the noise, delivering exactly what you need to know – nothing more, nothing less. Plus, your welcome email shows you exactly how to use each tool for maximum profit potential.\nFor annual memberships at regular price, we offer a 7-day money-back guarantee. However, the special 43% New Member Discount is non-refundable due to its significant savings. That’s why most new members choose the New Member Discount – it’s simply too valuable to pass up. You get instant access to everything Edge offers at our lowest possible rate."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/07/46266380/ex-trump-lawyer-sent-this-message-to-elon-musk-after-feud-with-donald-trump-erupted?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=46817700",
      "text": "- Michael Cohen offers a helping hand to Elon Musk in his escalating battle with Donald Trump.\n- Musk's public denouncement of Trump's policies stirs potential upheaval in tech and political circles.\n- The next correction is closer than you think. Find out how Tom Gentile plans to trade it, live on Wednesday.\nIn the midst of a public spat with President Donald Trump, Elon Musk, CEO of Tesla Inc., has received an unexpected offer of support from Michael Cohen, Trump’s former personal attorney.\nWhat Happened: Last month Cohen reached out to Musk following a series of heated exchanges between the Tesla CEO and President Trump on social media.\nMusk, who was once a strong supporter of Trump and even headed the Department of Government Efficiency, publicly denounced Trump’s “One Big Beautiful Bill.”\nMusk’s criticism of Trump, which included allegations of the president’s involvement in the Epstein files, and his claim that the Republicans would not have won the 2024 elections without his support, could have far-reaching effects on the tech industry, the business world, and American politics, considering the significant influence wielded by both Trump and Musk.\nCohen, who had his own public disagreement with Trump and served a prison sentence for various charges, has since become a vocal critic of the president.\nHe reached out to Musk on X, with a message: “@elonmusk I told you this would happen. If you want to know how to fight political guerrilla warfare, DM me! Otherwise, you lose.”\nIn a subsequent Substack post, Cohen cautioned Musk that Trump has “the full weight of the federal government behind him,” and that Musk “made the classic mistake of believing he was untouchable.”\n“Let me make something crystal clear: no one; not Bannon, not Jared, not Rudy, not me, and definitely not Elon, has ever been more important to Trump than Trump. The ‘bromance’ is never about you. It’s about what he can extract from you. Your loyalty. Your power. Your credibility. Your money. And when it’s over, it’s not just over; it’s scorched earth,” he wrote in the Substack.\nThe public feud between Musk and Trump is not just a personal disagreement. It has the potential to impact the tech industry and the broader business sector, given the substantial influence both individuals have.\nCohen’s offer to assist Musk in navigating this political minefield could signal a shift in alliances and power dynamics, with potential implications for future political and business developments.\nRead Next\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com",
      "text": "España\nItalia\n대한민국\n日本\nFrançais\nMy Account\nBenzinga Edge\nBenzinga Research\nBenzinga Pro\nLogin\nSPY\n621.23\n1.72%\nQQQ\n553.05\n2.12%\nBTC/USD\n114665.88\n1.9025%\nDIA\n436.79\n1.03%\nGLD\n309.74\n2.24%\nTLT\n87.79\n1%\nGet Benzinga Pro\nData & APIs\nEvents\nPremarket\nAdvertise\nContribute\nEspaña\nItalia\n대한민국\n日本\nFrançais\nLogin\nRegister\nOur Services\nNews\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nLegal\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nForex\nCommodities\nBinary Options\nBonds\nFutures\nCME Group\nGlobal Economics\nMining\nPreviews\nSmall-Cap\nReal Estate\nPenny Stocks\nDigital Securities\nVolatility\nOptions\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nIdeas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nFrom The Press\nJim Cramer\nRumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nCrypto\nNews\nEarnings\nGuidance\nDividends\nM&A\nBuybacks\nLegal\nInterviews\nManagement\nOfferings\nIPOs\nInsider Trades\nBiotech/FDA\nPolitics\nHealthcare\nMarkets\nPre-Market\nAfter Hours\nMovers\nETFs\nForex\nCommodities\nBinary Options\nBonds\nFutures\nCME Group\nGlobal Economics\nMining\nPreviews\nSmall-Cap\nReal Estate\nPenny Stocks\nDigital Securities\nVolatility\nOptions\nRatings\nAnalyst Color\nDowngrades\nUpgrades\nInitiations\nPrice Target\nIdeas\nTrade Ideas\nLong Ideas\nShort Ideas\nTechnicals\nFrom The Press\nJim Cramer\nRumors\nWhisper Index\nStock of the Day\nBest Stocks & ETFs\nBest Penny Stocks\nBest S&P 500 ETFs\nBest Swing Trade Stocks\nBest Blue Chip Stocks\nBest High-Volume Penny Stocks\nBest Small Cap ETFs\nBest Stocks to Day Trade\nBest REITs\nMoney\nInvesting\nCryptocurrency\nMortgage\nInsurance\nYield\nPersonal Finance\nForex\nStartup Investing\nReal Estate Investing\nProp Trading\nCredit Cards\nStock Brokers\nCrypto\nResearch\nMy Stocks\nTools\nFree Benzinga Pro Trial\nCalendars\nAnalyst Ratings Calendar\nConference Call Calendar\nDividend Calendar\nEarnings Calendar\nEconomic Calendar\nFDA Calendar\nGuidance Calendar\nIPO Calendar\nM&A Calendar\nSPAC Calendar\nStock Split Calendar\nTrade Ideas\nFree Stock Reports\nInsider Trades\nTrade Idea Feed\nAnalyst Ratings\nUnusual Options Activity\nHeatmaps\nFree Newsletter\nGovernment Trades\nPerfect Stock Portfolio\nEasy Income Portfolio\nShort Interest\nMost Shorted\nLargest Increase\nLargest Decrease\nCalculators\nMargin Calculator\nForex Profit Calculator\n100x Options Profit Calculator\nScreeners\nStock Screener\nTop Momentum Stocks\nTop Quality Stocks\nTop Value Stocks\nTop Growth Stocks\nRecent\nMarkets\nSPY\n621.23\n1.72%\nQQQ\n553.05\n2.12%\nBTC/USD\n114665.88\n1.9025%\nDIA\n436.79\n1.03%\nGLD\n309.74\n2.24%\nTLT\n87.79\n1%\nTrending\nLatest News\nStock Ideas\nBriefs\nExclusives\nBenzinga TV\n0\nWill Bitcoin Reach $500,000 Or Even $1 Million In 2025? — Exploring Over-Ambitious BTC Forecasts For 2025\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nTrump's Trade Deals, Tariffs, The Tumbling Labor Market And More: This Week In Economy\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nTrump's Trade Deals, Tariffs, The Tumbling Labor Market And More: This Week In Economy\nFed Stays Put On Rates, But Jobs Report Signals It May Regret It: This Week In Markets\nFord's EV Tease, Tesla's Legal Woes, Boeing's Negligence Lawsuit And More: This Week In Mobility\nQuick links\nBRK.A\nBRK.B\nNOVO\nTSLA\nUPS\nElon Musk\nDonald Trump\nTop Stories\nNuclear Threats, Trump Fires Labor Statistics Chief, Fed Governor Resigns And More: This Week In Politics\nABBV\nAMGN\nAnalysts Say $127.3 Trillion Liquidity Surge Could Be Rocket Fuel for Bitcoin\nBTC/USD\nWarren Buffett's Advice: 'If You Aren't Willing To Own A Stock For Ten Years, Don't Even Think About Owning It For Ten Minutes'\nMark Cuban's Secret To Launching Successful Business: 'It Doesn't Matter How Many Times You Fail, You Only Have To Be Right One Time'\nLoad more\nLatest\nAll News\n|\nMy Watchlist News\nJim Cramer Has Blunt Message for Fed Chair Powell After July Job Numbers Tanked\nTrump's Disapproval Rating Soars Amid Economic Woes, Epstein Drama\nWarren Buffett's Advice: 'If You Aren't Willing To Own A Stock For Ten Years, Don't Even Think About Owning It For Ten Minutes'\nApple's New 'Answers' Team Developing ChatGPT Rival, iPhone 17 Pro Spotted In San Francisco\nAAPL\nFB\nExclusives\nSee more\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nEXCLUSIVE: July's 20 Most-Searched Tickers On Benzinga Pro — Where Do Opendoor, Nvidia, Apple Stock Rank?\nArcher Aviation CEO Calls Time 'Most Valuable Asset,' Says eVTOL Company Will Help Move Athletes & Fans At 2028 Summer Olympics\nEXCLUSIVE: Archer CEO On Competition, Commercialization Goals – 'I Wouldn't Trade Our Positioning Here With Anyone Else'\nEXCLUSIVE: Archer CEO Says Trump's eVTOL Push Is A Game-Changer\nEXCLUSIVE: Vivakor Sheds Water Transport Business To Refocus On Oil, Slashes $59 Million Debt\nEXCLUSIVE: Draganfly Sells Heavy Lift Drones To Fortune 50 Giant For Emergency Missions\nBenzinga's 'Stock Whisper' Index: 5 Stocks Investors Secretly Monitor But Don't Talk About Yet\nEXCLUSIVE: Wix Adds PayPal, Venmo And Pay Later Options To Help Merchants Boost Sales, Simplify Checkout\nEXCLUSIVE: Intelligent Bio Solutions' New Data Confirms Ability To Detect Trace Sweat Volumes At Ultra-Micro Level\nBloomZ Stock Spikes 36.51% After Hours as Due Diligence Begins for Idealize Deal\nGlobavend Holdings Rallies 37.99% in After-Hours Trading Following Reverse Stock Split\nAlternative Investments\nSee more\nAmerican Home Sellers Retreat as Buyers Push Back Against Record Prices\nWarren Buffett Once Called Mortgages A 'Terrific Deal' — Now Zillow Analyst Says Even 0% Rates Can't Make Homes Affordable In America\nZ\nBRK\nFannie, Freddie Set Stage For Mortgage Credit Overhaul With VantageScore 4.0, But Lenders Urge Caution\nSteve Eisman of 'The Big Short' Fame Calls 3128% Opendoor Price Target 'Gutsy, Nuts, or Plain... Manipulative'\nDNUT\nGPRO\nKSS\n2 others\nOPEN\nZ\nOptions\nSee more\nOptions Corner: Why Trump's Policy Backflip Gifts A Discount For Southern Copper\nSCCO\nSmart Money Is Betting Big In REGN Options\nREGN\nWhat the Options Market Tells Us About Accenture\nACN\nCheck Out What Whales Are Doing With NCLH\nNCLH"
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/08/46817700/ex-trump-lawyer-says-trump-could-set-sights-on-musks-billions-it-bothers-him-that-he-is-the-richest",
      "text": "- Michael Cohen anticipates Trump's potential play for Elon Musk's fortune post-government stint.\n- Tesla CEO's previous campaign support and government role could face scrutiny under Trump's directive.\n- Get special access to three exclusive \"Top 10 Stocks\" power lists today, updated daily.\nPresident Donald Trump‘s former personal attorney Michael Cohen has predicted that Trump might set his sights on the fortune of tech magnate Elon Musk following their recent spat.\nWhat Happened: Cohen thinks Trump’s jealousy of Musk’s position as the wealthiest man in the world could drive him to target Musk’s wealth.\nMusk, who is the CEO of Tesla Inc. TSLA, had earlier contributed $250 million to Trump’s 2024 campaign and was chosen to spearhead a cost-reduction initiative under the Department of Government Efficiency (DOGE).\nEarlier speaking with MSNBC, Cohen said, \"I said from the very start that this bromance was going to come to an end. I'm going to go one step even further, again, and I'm going to say Trump will ultimately go after Elon's money next because it bothers him that he is the richest man in the world.\"\nCohen, now a prominent critic of Trump, speculates that Trump could utilize DOGE to probe how Musk and his businesses “exploited the United States of America” and try to “reclaim” government subsidies given to Tesla.\nAlso Read: Ex-Trump Lawyer Sent This Message To Elon Musk After Feud With Donald Trump Erupted\nHowever, White House communications director Steven Cheung dismissed Cohen’s forecasts, describing him as a “deeply disturbed” person spreading “falsehoods and deception”.\nWhy It Matters: The conjecture by Cohen, if it materializes, could lead to a significant shift in the dynamics between Trump and Musk.\nThe latter’s wealth, largely attributed to his leadership at Tesla, has been a subject of public interest. Musk’s contribution to Trump’s campaign and his role in DOGE further intertwine their professional relationship.\nAny action by Trump targeting Musk’s fortune could potentially impact Tesla’s operations and its standing in the market. However, these are mere predictions at this point, and it remains to be seen how the situation unfolds.\nRead Next\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/news/politics/25/07/46264859/ex-trump-family-attorney-raises-alarms-over-trumps-actions-as-president-i-have-never-been-as-concerned?utm_campaign=partner_feed&utm_source=yahooFinance&utm_medium=partner_feed&utm_content=site&nid=46817700",
      "text": "- Abbe Lowell raises alarm over potential damage Trump's actions could pose to U.S. institutions.\n- Lowell & Associates attracts key figures in fight to uphold constitutional checks and balances.\n- The market’s back, and these 3 income stocks are thriving. See them here→\nAbbe Lowell, a prominent lawyer who has represented members of President Donald Trump‘s family, expressed serious concerns about the potential harm that the current administration could cause to the country’s institutions.\nWhat Happened: Lowell, who defended Jared Kushner and Ivanka Trump during Robert Mueller‘s Russian investigation, has voiced concerns about the pressure the White House is putting on the nation’s institutions.\nLowell fears that these institutions may not be able to withstand the current strain. Speaking with the Financial Times, Lowell said, “I have never been as concerned as to whether our system can withstand the pressure it is being put to.\"\nHe also said that the White House is \"pushing the tree to the point that it could break,\" noting that during Trump's first term, critics of the president said democracy was \"tested but didn't break.\"\nLowell, who has also represented prominent Democrats like Bill Clinton and Hunter Biden, was hired by Kushner and Ivanka in 2017 as the Russia investigation escalated. He is now warning that Trump’s actions in his second term could break the constitutional “wall” that separates the courts from executive power.\n\"The crack you put in the wall today becomes the gash tomorrow,\" Lowell told Congress back in 1998. Reflecting on that now, he told the outlet, \"That wasn't a bad prophecy—the structure is more than cracked, though not yet crumbled.\"\nLowell has established Lowell & Associates to fight against what he calls government “over-reach,” and has already attracted several defectors from other law firms.\nHis clients include New York Attorney General Letitia James and former DHS official Miles Taylor, who are both hoping that Lowell’s aggressive approach can counter a series of executive orders targeting various institutions.\nWhy It Matters: Lowell’s concerns highlight the increasing tension between the executive branch and the nation’s institutions.\nHis strategy of building cases on First Amendment grounds, rather than presidential authority, could be crucial in challenging the administration, especially given a Supreme Court that “believes in an executive branch with broad power.”\nLowell’s new firm, Lowell & Associates, could play a significant role in this battle, especially with high-profile clients like Letitia James and Miles Taylor on board.\nAs the pressure on the nation’s institutions continues to mount, the legal strategies employed by Lowell and his team could have far-reaching implications for the balance of power in the U.S.\nRead Next\nImage: Shutterstock\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    }
  ],
  "argos_summary": "Michael Cohen, former personal attorney to Donald Trump, speculates that Trump may target Elon Musk's wealth due to jealousy over Musk's status as the richest man in the world. Cohen suggests that Trump could use his position to investigate Musk's business dealings and reclaim government subsidies given to Tesla. This prediction comes amid a public feud between Trump and Musk, which could significantly alter their professional dynamics and impact Tesla's market standing.",
  "argos_id": "LXOVHW7X7"
}