{
  "url": "https://www.pocket-lint.com/buy-now-pay-later-is-quick-and-easy-but-part-of-the-system/",
  "authorsByline": "Philip Gelderblom",
  "articleId": "87b14b2649844b9b8fa458e3b83d79bc",
  "source": {
    "domain": "pocket-lint.com",
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static1.pocketlintimages.com/wordpress/wp-content/uploads/2025/08/buy-now-pay-later.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T19:00:18+00:00",
  "addDate": "2025-08-03T19:10:57.962772+00:00",
  "refreshDate": "2025-08-03T19:10:57.962774+00:00",
  "score": 1.0,
  "title": "I used to work in finance and this is what really happens when you use buy now, pay later apps",
  "description": "A deep drive into what happens behind the scenes when you apply for a buy now, pay later account.",
  "content": "Buy now, pay later (BNPL) is great. It only takes a minute to set up your account on the app, and there you go. You can afford the nice stuff you want, because you can pay for it over four months. As long as you keep up the payments, it is an easy, interest-free loan. This is true.\n\nBNPL is also great, and because it is so quick, you're only dipping your toe in the credit swimming pool. Nobody knows you're doing it, and as long as you pay on time, nobody cares. The deal is between you and the app, and it stops there. Right? Nope, wrong.\n\nThe moment you start talking to the app, you go into the system. And you stay there. Let me tell you what happens in that minute it takes to open a BNPL account.\n\nWhy BNPL is so quick\n\nMost users think, because BNPL involves small amounts over a short time, the risk is low, and that is why the process is so quick. The reality is that for the lenders, the risk lies in the $176 billion dollars currently spent on BNPL, and the collective risky behavior of the total number of people using these loans.\n\nSaying yes to massive trade\n\nThe $176 billion spent on BNPL is expected to balloon to $380 billion in 2030, and that's just too much money to say no to. But 10% bad debt of $176 billion today is $17.6 billion, so the trick is to evaluate new BNPL clients thoroughly to bring the risk down. But the valuation has to happen very quickly, otherwise those customers are one click and gone.\n\nFriction and the need for speed\n\nMost BNPL transactions -- 70 to 80% -- happen online, and online is the wild west in retail terms. If the fintechs doing the BNPL applications could take their time, they would. But anything longer than a minute or two is too long, and the customer will click away to someone else.\n\nThe 90% of good debt in the example above is $158 billion, and who will let that slip through their fingers? The hassle and time it takes to transact online is called friction in the trade, and the amount of friction an online client is willing to tolerate is very low. One click.\n\nHow BNPL happens so quickly\n\nAll at once, all in the background\n\nWhen you apply for BNPL, you have to provide ID, a driver's license or passport, as well as a credit card or bank account details. You may be asked for a selfie where you do something like touch your ear, but that is just to guard against deep fakes. The rest of the stuff happens simultaneously, very quickly, and in the background. You won't even know about it, unless your details get flagged.\n\nAn optical character reader is used to extract all the information from the identity document you provide and this is run against vast identity databases. It will immediately pick up if you are you, and if you have been naughty or nice. If nice, you will go on a new database for BNPL applicants whose ID checks out. Data is gold, and they never throw anything away.\n\nNobody looks like their driver's license picture, but facial recognition measures your facial features and the size, distance, and relationship between your eyes, or eyes and ears and nose. The resulting digital compilation identifies your facial features as uniquely as a fingerprint, and this digital 'faceprint' is sent through other databases to check for suspicious matches. If it's good, it's cool -- but your face will still sit in a database of good faces.\n\nAll online transactions, including BNPL applications, involve the use of a device -- your phone, tablet, or computer. Each device has a unique signature, and no, anonymous VPNs will not work. Your device will be identified and run through more databases and other diagnostics to check if it has ever been stolen, involved in fraud or illegal activities, bad loans, or crimes like money laundering.\n\nChanges such as SIM swapping will be picked up, and your geolocation will be verified. Once verified, your device will join your identity on a database in the cloud somewhere.\n\nYour banking details will be verified to make sure they are linked to your identity. While they are at it, it will most likely also be run through other databases to check for suspicious transactions, other bank accounts linked to your ID, and so on.\n\nBNPL is currently seen as a soft credit check, which means it won't affect your credit record as things stand. That will probably change later in the year, but your details will nonetheless be run through the BNPL datasets to see how many other such loans you currently have and how these may affect the affordability of your application.\n\nNo need to worry yet\n\nYour data is out there, anyway\n\nIf you plan on staying financially sound and on the right side of the law, none of the stuff described above should concern you. Credit bureaus are discreet and will probably not sell your data. The fintechs who run the BNPL apps will use your data and buying patterns to inform you of deals you can take advantage of, but this is described on their websites, and you can probably opt out if you wish.\n\nAs long as you use BNPL responsibly, it's a good way to buy goods that would otherwise be beyond your budget. The companies involved are generally fairly responsible in their actions, although they will probably encourage you to spend more if they think your finances can handle it. So stay smart, be safe. A little bit of paranoia is not necessarily a bad thing.",
  "medium": "Article",
  "links": [
    "https://www.pocket-lint.com/why-you-should-avoid-using-free-vpns/",
    "https://www.consumerfinance.gov/about-us/newsroom/cfpb-research-reveals-heavy-buy-now-pay-later-use-among-borrowers-with-high-credit-balances-and-multiple-pay-in-four-loans/",
    "https://www.pocket-lint.com/apps/news/apple/161418-what-is-apple-pay-later-and-how-does-it-work/",
    "https://www.pocket-lint.com/what-is-paypal/",
    "https://www.affirm.com/shopping/2025-back-to-school?utm_source=google&utm_medium=paid_social&utm_campaign=20250722_PM_MCH_Bau_Brand_PP_ams-bts&utm_content=Multi&utm_term=multi-pmax&utm_id=3665&gclsrc=aw.ds&gad_source=1&gad_campaignid=22814053806&gbraid=0AAAAACjQJ__MUqRwya81A3ZfPbE_myXPt&gclid=CjwKCAjwqKzEBhANEiwAeQaPVYRhRaLv-e2WNSKwBEwLDHKRQdMx1_yhBe5GcxPNSGoMUxfPrV0wTxoCM9YQAvD_BwE",
    "https://www.pocket-lint.com/apps/news/158101-what-is-klarna-and-how-does-it-work-monthly-payments-no-interest-financing/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "BNPL applications",
      "weight": 0.095003136
    },
    {
      "name": "Most BNPL transactions",
      "weight": 0.09250745
    },
    {
      "name": "BNPL",
      "weight": 0.09223865
    },
    {
      "name": "new BNPL clients",
      "weight": 0.091652796
    },
    {
      "name": "BNPL applicants",
      "weight": 0.09018907
    },
    {
      "name": "other databases",
      "weight": 0.07262407
    },
    {
      "name": "vast identity databases",
      "weight": 0.068145886
    },
    {
      "name": "more databases",
      "weight": 0.06683188
    },
    {
      "name": "other bank accounts",
      "weight": 0.06457981
    },
    {
      "name": "bad loans",
      "weight": 0.061971184
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.59521484375
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.50341796875
    },
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.48291015625
    },
    {
      "name": "/Finance/Financial Planning & Management/Other",
      "score": 0.385009765625
    }
  ],
  "sentiment": {
    "positive": 0.07446289,
    "negative": 0.5800781,
    "neutral": 0.34594727
  },
  "summary": "The article discusses the process process of buying now, pay later (BNPL) using an app that allows users to pay for an easy, interest-free loan without delay. The author points out that the $176 billion currently spent on BNPL is expected to rise to $380 billion in 2030, which is too much for lenders due to the projected 10% bad debt of $176bn. The process involves a minute or two of the process, with the user being set up and staying there, but the risk is low. Most of the 70 to 80% of BNP transactions, including those of 70 to80% of online transactions, occur online. The article discusses how fast the process takes to open a BNPP account and how the risk of this is assessed quickly. The cost of BPPL is high, with lenders valuing new BNPE clients at a premium of $17.6 billion. The Author suggests that while BNPS applications are relatively easy, the process requires a thorough evaluation and a significant amount of friction, the speed of this time is low, as is the need for speed. The book also discusses the implementation of biometric applications and changes to the system, which are often made in the background.",
  "shortSummary": "BNPL, or buy now, pay later apps, are easy to use but riskier, with high risk factors and frequent payment patterns, highlighting the need for speed to avoid identity and fraud.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9ff30ab19bdf47f29f66379da3cafc55",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.consumerfinance.gov/about-us/newsroom/cfpb-research-reveals-heavy-buy-now-pay-later-use-among-borrowers-with-high-credit-balances-and-multiple-pay-in-four-loans/",
      "text": "CFPB Research Reveals Heavy Buy Now, Pay Later Use Among Borrowers with High Credit Balances and Multiple Pay-in-Four Loans\nMore than 60 percent of users had simultaneous loans, borrowers held higher balances on other credit lines, and most loans went to consumers with subprime or lower credit scores\nWASHINGTON, D.C. – Today, the Consumer Financial Protection Bureau (CFPB) released a study of Buy Now, Pay Later (BNPL) borrowers, finding that more than one-fifth of consumers with a credit record used BNPL loans in 2022, with most of those consumers having subprime or deep subprime credit scores. The CFPB research also revealed that more than three-fifths of BNPL borrowers held multiple simultaneous BNPL loans at some point during the year, and one-third had loans from multiple providers. BNPL borrowers were also more likely than other consumers to have higher balances on other unsecured credit lines such as credit cards. Because lenders do not typically report BNPL loans to nationwide consumer reporting companies, data about BNPL use—especially about borrowers with multiple loans and on total consumer debt balances—is limited. Today’s study helps fill the data gap by pairing a matched sample of BNPL applications from six large firms with deidentified credit records.\nBNPL credit is a type of deferred payment option that generally allows the consumer to split a purchase into smaller installments, typically four or fewer, often with a down payment due at checkout. The application process is quick, involving relatively little information from the consumer, and the product often comes with no interest. Lenders have touted BNPL as a safer alternative to traditional credit card debt, along with its ability to serve consumers with limited or subprime credit histories.\nTo better understand the emerging BNPL market, the CFPB issued market monitoring orders in March 2023 to collect information from several companies offering no-interest, pay-in-four BNPL loans, including Affirm, Afterpay, Klarna, Paypal, Sezzle, and Zip. The CFPB matched the loan-level and deidentified consumer information it received with consumer credit records to study the prevalence of BNPL use. Today’s report finds that, in 2022:\n- More than one-fifth of consumers used BNPL: Among consumers with a credit record, 21.2 percent financed at least one purchase with a BNPL loan, up from 17.6 percent in 2021. About 20 percent of borrowers in 2022 were heavy users originating more than one BNPL loan on average each month, an increase from 18 percent in 2021. The average number of originations per borrower increased from 8.5 to 9.5.\n- Most BNPL borrowers took out multiple simultaneous BNPL loans: Approximately 63 percent of borrowers originated multiple simultaneous loans at some point during the year, and 33 percent took out loans from multiple BNPL lenders.\n- Nearly two-thirds of BNPL loans went to borrowers with lower credit scores: Among these applicants with subprime or deep subprime credit scores, BNPL lenders approved 78 percent of loans in 2022.\n- BNPL borrowers were more likely to hold higher balances on other credit accounts: These borrowers held higher balances of other unsecured consumer debt, including personal loans, retail loans, student loans, credit cards, and subprime alternative financial services lenders. Before first-time BNPL use, consumers’ average credit card utilization rates increased, suggesting that less available credit card liquidity may encourage consumers to use BNPL.\n- Younger borrowers held more BNPL debt as a percentage of their total consumer debt: Among borrowers ages 18-24, BNPL purchases made up 28 percent of total unsecured consumer debt compared to an average of 17 percent among borrowers of all age groups, during the months in which they borrowed.\nRead today’s report, Consumer Use of Buy Now, Pay Later and Other Unsecured Debt.\nToday’s report builds on previous CFPB work related to BNPL lending. In May 2024, the CFPB issued an interpretive rule confirming that BNPL lenders must provide consumers some key legal protections and rights that apply to conventional credit cards. Previously, in March 2023, the CFPB published research about BNPL borrowers based on CFPB survey data, and in September 2022, the CFPB released findings based on an earlier market monitoring inquiry of BNPL lenders.\nConsumers can submit complaints about financial products and services by visiting the CFPB’s website or by calling (855) 411-CFPB (2372).\nEmployees who believe their company has violated federal consumer financial protection laws are encouraged to send information about what they know to whistleblower@cfpb.gov. To learn more about reporting potential industry misconduct, visit the CFPB’s website.\nThe Consumer Financial Protection Bureau is a 21st century agency that implements and enforces Federal consumer financial law and ensures that markets for consumer financial products are fair, transparent, and competitive. For more information, visit www.consumerfinance.gov."
    },
    {
      "url": "https://www.pocket-lint.com/apps/news/158101-what-is-klarna-and-how-does-it-work-monthly-payments-no-interest-financing/",
      "text": "Multiple retailers have started offering flexible financing and monthly installment payment plans through third-party 'buy now, pay later' apps such as Klarna, Affirm, Afterpay, and even PayPal has its own solution called Pay in 4. In this guide, Pocket-lint is specifically covering how Klarna works, which sites and stores accept it, what you can buy with it (like AirPods or Apple Watches), and whether it has any credit requirements, hidden fees, and interest.\nWhat is Klarna?\nKlarna is a 'buy now, pay later' service (or a point-of-sale financing service) founded in Sweden in 2005. It's available in nearly 20 countries and used by approximately 90 million shoppers. With Klarna, you can secure small loans at checkout for both online and in-store purchases through the Klarna mobile app. It works with popular retailers, such as Apple, Macy’s, Etsy, Foot Locker, and Sephora, allowing you to make affordable payments on big-ticket items.\nHow does Klarna work and is a credit check required?\nFirst, download the Klarna app from the Apple App Store or Google Play Store.\nHow to get started\n- Open the latest version of the Klarna app. You will see the option to create an account.\n-\nSelect 'create account' and enter your email address.\n- You will be asked to verify your identity with a code sent to your email.\n-\nKlarna will then ask for a phone number to connect to your account.\n- Again, it will send you a code to verify your identity.\n- Klarna will then ask for your permission to track you. You can deny it.\n- You will be directed to a page to find stores that accept in-store Klarna payments.\n- Tap the back button to get to the Home screen and start exploring the Klarna app.\nHow to navigate the Klarna app\n- When you open the Klarna app, you will land on the Klarna home screen.\n-\nFrom the home screen, you will see several buttons to different pages:\n- Shop online\n- In-store\n- One-time cards\n- Payments\n- Purchases\n- Deliveries\n- Everything saved\n- Deals\n- Rewards\n- My Store\n- History\n- Invite Friends\n- Inbox\n- And More, which leads to CO2 emissions, Help, and Settings\n- A search bar is at the top and a navigation bar is at the bottom of the home screen.\n- The navigation bar has tabs for Home, Saved, and My Klarna.\nHow to shop online with the Klarna app\n- From the home screen, tap Shop online option.\n-\nSearch a retailer you'd like to buy from online, such as Amazon or Walmart.\n- You may be asked to sign in to your account at the retailer.\n- When you have all the items you want to buy in your cart, press the pink Klarna button.\n-\nKlarna will then create a secure one-time card.\n- Approve the amount and other details like shipping and taxes. Hit continue.\n- Klarna may perform a soft credit check that doesn't affect your credit score.\n- Klarna will also ask your permission to add extra to cover shipping and tax.\n-\nEnter your details for Klarna, like name, birth date, and address.\n- Agree to terms and hit confirm and continue.\n-\nYou will also need to select the payment plan you prefer. For instance, you may see:\n- 4 payments every two weeks at 0% APR\n- 6 monthly payments with interest.\n-\nOnce you pick a plan and hit continue, add your bank or credit card info for Klarna.\n- Save your card info, review your plan, and hit confirm and continue.\n-\nKlarna will then let you copy the details of your Klarna one-time card.\n- When done, exit out of the pop-up in the Klarna app to go back to the retailer.\n- Keep in mind all the steps you're performing are done directly in the Klarna app.\n- From the retailer's checkout screen in the Klarna app, add a new payment method.\n- Klarna will then offer to paste/apply your one-time card info, or you can do it manually.\n- Whichever you choose, add the card, choose your billing address, and place the order.\n- That's it!\nHow to shop in-store with Klarna\n-\nFrom the home screen in Klarna, tap the In-store option.\n- Keep in mind all the steps you will perform are done directly in the Klarna app.\n-\nYou will be asked to set up your in-store card.\n- This is a one-time process that requires a valid debit or credit card.\n- Your card needs at least 25% of the total amount you're hoping to spend.\n- Amex and prepaid cards are not accepted.\n- Once set up is complete, your in-store card will be available in Apple Wallet.\n- You can then shop at any terminal that accepts Apple Pay.\n- Hit the Yes, I'm ready to start button.\n-\nEnter the amount you wish to spend and then continue.\n- Klarna may perform a soft credit check that doesn't affect your credit score.\n- Klarna will also ask your permission to add extra to cover shipping and tax.\n-\nKlarna will offer its \"Pay in 4\" payment plan option with a link to see more details.\n- You may be asked to enter your bank or credit card info for Klarna.\n- If you already have, then just review your plan and hit confirm and continue.\n-\nKlarna will create your in-store card and let you add it to your Apple Wallet.\n- Hit Next and agree to terms.\n-\nKlarna will show you how to use Apple Pay and it will tell you how long the card is valid.\n- Most cards are only valid for 24 hours.\nWhat are the differences between Klarna's US payment plans?\nKlarna offers four payment options, but the thousands of retailers that offer Klarna financing have the discretion to decide which can be available to their customers. Here's a handy chart that breaks down the differences between each US plan, including the terms, amount due at checkout, interest, and late fees.\n|\nPayment plans |\nTerms |\nDue at checkout |\nInterest |\nLate fee |\n|\nPay in 4 |\nPay four equal installments - due every two weeks. See legal terms. |\nYour first installment is due. It's the balance divided by four. |\nNo interest. |\nUp to $7 |\n|\nPay in 30 |\nPay nothing for 30 days, and then pay the full balance. See legal terms. |\n$0 |\nNo interest. |\nNo late fee. But if you don’t make the full payment, you might go into default. |\n|\nFinancing |\nPay with a small loan ranging from 6 months to 36 months. See legal terms. |\n$0 |\n0% to 29.99%; 19.99% for standard purchases. |\nUp to $35 |\n|\nPay Now |\nPay with your debit or credit card through the Klarna app. See legal terms. |\nFull balance. This option is ideal when you have extra funds and want to close out your loan. |\nNo interest. |\nNot applicable. |\nDoes Klarna require a minimum credit score?\nKlarna is often easier to qualify for than a credit card because although it performs a soft credit check, there’s no minimum credit score required.\nDoes Klarna automatically bill you?\nYes, which is perfect if you have a hard time keeping track of your balance or bills. When you choose a plan, Klarna automatically bills your debit or credit card.\nWhat are the pros and cons to Klarna?\nHere's a quick breakdown of the pros and cons to consider:\n|\nPros |\nCons |\n|\n|\nWhich stores accept Klarna?\nPhysical stores\nKlarna is available to use in-store at more than 60,000 shops, like Sephora, H&M, Macy’s, and more. Go here to see all the stores that offer Klarna financing.\nOnline stores\nKlarna is available at just as many, if not more, online retailers, like Amazon, Walmart, and Apple. Go here to see all the stores that offer Klarna financing.\nAre there alternatives to Klarna?\nThere sure are - such as Affirm, Afterpay, and PayPay Pay in 4.\nIs Klarna right for you?\nKlarna can help you purchase something you want but can’t pay for upfront. For instance, you can use it at Apple, Best Buy, and other stores that sell the latest tech and electronics. Want an iPad Pro? No problem. Its Pay in 4 or Pay in 30 plans are likely your best bet, too, as they don't charge interest."
    },
    {
      "url": "https://www.pocket-lint.com/why-you-should-avoid-using-free-vpns/",
      "text": "Summary\n- Free VPNs may compromise security with weaker encryption protocols and data caps.\n- Speeds on free VPNs can be slower due to limited servers and high user traffic.\n- Free VPNs may collect and sell user data to third parties, compromising privacy.\nGetting something for nothing is the best, right? It's got to be something special if the company is sharing it for free. You may think this way when you're walking around the grocery store and getting free samples, but the point of that is to get you to pay for the actual food if you like it. Typically, the underlying idea is to sell you something by just giving you a little taste.\nThink of how many free apps you have on your phone. There are usually ads on those free apps, which try and get you to purchase other items. It's either that or the free version of the app has limitations, and you have to pay to get access to the real features you want. Just because something is free doesn't mean you need to use it, and this is especially true for keeping your computer safe.\nUsing a virtual private network (VPN) can not only can it protect your computer, but also give you faster speeds for gaming, surfing the web, and more. But, you should be leery of free VPNs. While they may seem enticing, there is a lot that can go wrong by using one.\nExpressVPN\nExpressVPN is a VPN service that offers both a paid and a free version.\n1 They may not be as secure\nSecurity usually comes with a price\nIf you're using a VPN, it's likely because you want to encrypt your data. VPNs hide your IP address and encrypt the traffic from your computer, which allows you to surf and search without having your information hacked or tracked. It keeps your information private and funnels the traffic into its own area, making it harder to trace and find if someone is trying to hack you.\nYou're more vulnerable to threats with weak encryption.\nWhen you use a free VPN, it's not to say that your VPN is not secure. I've used free VPNs before and have enjoyed the safety features. But they aren't as secure as paid ones. The encryption protocols may not be as up-to-date as the ones that you pay for. It's not your fault that these free versions don't have the capabilities to keep up with safety protocols -- the manufacturers are likely putting more resources into their versions that make them money, so the free options fall a bit by the wayside. You're more vulnerable to threats with weak encryption.\n2 Your data is likely to be capped\nYou don't get to use this for an unlimited amount of time\nYou aren't going to be able to do everything that you want with a free VPN. Most of them put limits on the amount of data you can transfer. These data caps suppress transfers and make it so they don't go through if they are above the limit. This has a direct impact on people who want to do a lot with their VPN, including gaming, streaming, torrenting, and more.\nThe quality of the videos you can stream will also be affected. With lower-quality videos, data consumption might not be as significant, but for higher-quality videos, you might not even be able to watch them at all or may be restricted to watching shorter clips. The annoying thing is that the data cap usually resets monthly, meaning you're going to have to watch your data usage like a hawk and try not to use it up before the end of 30 days.\n3 The server options are limited\nThis is a huge issue for many users\nPeople like to use VPNs because they can get access to servers around the world. This makes it easier not only to stream content from different countries if you're at home, but also to stream content from your own country if you are elsewhere. Imagine being away for March Madness -- you'd need to use a VPN to stream basketball games while abroad.\nUsing a free VPN often means you'll have access to fewer servers, which can be a pretty big limitation if you're trying to bypass geo-restrictions. For example, you might not be able to stream a Netflix show exclusive to Spain while you're in the states, or access a Prime Video show from the US while you're in Spain. This is also a huge issue for gamers who want to switch to a less congested server to avoid lag caused by heavy traffic.Your connections may be limited and, even when you do connect, they may be slower.\n4 The speeds are slower\nEven when you get on, you're not going as fast\nWhether you're using your VPN on your smart TV, streaming device, laptop, or phone, you want the speeds to be fast enough to handle whatever you're throwing at it. With free VPNs, they are inherently throttled by the number of people using them at the same time. As I said before, there aren't as many servers to connect to, so more people are going to be spread out across different servers. This means that they're going to start to drag.\nUsing a VPN often means accepting some level of slowdown, but the extent can range pretty widely. I've dealt with slow VPNs before, and it made me quickly turn to a paid one. I realized it wasn't even going faster than my regular Wi-Fi. While that's expected any time you're using a VPN, how much slower it got was incredibly noticeable. You're going to be sitting around and waiting for your content to buffer more often than not with a free VPN, especially at night when more people may be using VPNs for higher data purposes, like streaming video.\nUsing a VPN slows down your data because it has to put it through an additional server for security purposes. It is normal to experience some delay.\n5 The VPN might be taking note of your data\nAs we said, free things might not be free\nBecause you aren't paying for the service, a free VPN must be supported somehow. They often do this by collecting your data and selling it to third-party distributors and advertisers. If you use a free VPN, you may notice more spam emails or calls start to come your way. I'm sick enough of all the spam calls I receive, so knowingly adding more of them to my life seems insane. You'll also notice more targeted ads for the things that you're searching for within your VPN, which is so frustrating -- and eerie.\nDespite the reasons for using a secure network, the network itself is what sells your data in some cases. If you're going to have your data sold, you might as well not use the VPN at all. This was a sticking point for me when I decided to use a trusted VPN that I paid for. If you're considering using a free VPN, your data may be at risk."
    }
  ],
  "argos_summary": "Buy Now, Pay Later (BNPL) services allow consumers to make purchases and pay in installments, often without interest, but they come with hidden risks. The rapid growth of BNPL, projected to reach $380 billion by 2030, raises concerns about consumer debt, especially among those with subprime credit scores. A recent Consumer Financial Protection Bureau (CFPB) study found that many BNPL users hold multiple loans simultaneously and have higher balances on other credit lines, indicating potential financial strain. While BNPL can be a useful tool for responsible spending, users should be aware of the implications for their credit and financial health.",
  "argos_id": "QC1TTRV8A"
}