{
  "url": "https://www.nytimes.com/athletic/6529806/2025/08/03/tottenham-palhinha-transfer-signing-news/",
  "authorsByline": "The Athletic Staff",
  "articleId": "dccba6917ed54e3c98f7bc8e2f8e5dba",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/01082129/GettyImages-2227847984-scaled-e1754051117690.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T19:08:06+00:00",
  "addDate": "2025-08-03T19:12:51.674662+00:00",
  "refreshDate": "2025-08-03T19:12:51.674664+00:00",
  "score": 1.0,
  "title": "Tottenham complete loan signing of Joao Palhinha from Bayern Munich",
  "description": "The deal includes an option to make the transfer permanent for €30million (£25.9m, $34.2m) at the end of the season.",
  "content": "Tottenham Hotspur have completed the loan signing of Joao Palhinha from Bayern Munich.\n\nThe Athletic reported the midfielder was set to undergo a medical in Germany on Friday ahead of joining the north London club. The deal includes an option to make the transfer permanent for €30million (£25.9m, $34.2m) at the end of the season, and Spurs will cover his wages in full.\n\nPalhinha was made available by the German champions this summer, a year after he arrived from Fulham in deal worth €51m ($58.3m).\n\nHe impressed over two seasons at Craven Cottage but only started 10 matches for Vincent Kompany’s side during the 2024-25 campaign, and made a further 15 appearances from the bench. Bayern further bolstered their midfield options with the signing of Tom Bischof from Hoffenheim this summer after the move was agreed in January.\n\nPalhinha played 79 times for Fulham over two years, winning player of the season in his debut campaign at in west London, having previously spent his entire career with Sporting CP and various loan spells to Portuguese clubs. His move to Spurs marks a second piece of business between the Premier League club and Bayern this summer, after Mathys Tel’s loan was made permanent for €35m, plus €10m in potential bonuses, with the French striker signing a six-year deal.\n\nThe 30-year-old becomes Spurs’ fifth signing of the summer transfer window following the £55m arrival of Mohmammed Kudus from West Ham, alongside defenders Luka Vuskovic and Kota Takai from Hajduk Split and Kawasaki respectively.\n\nTottenham will compete in the Champions League next season after winning the 2024-25 Europa League and appointed Thomas Frank as their new head coach following the dismissal of Ange Postecoglou.\n\nHad Joao Palhinha moved to Bayern Munich when he first expected to, in the final hours of the transfer window in the summer of 2023, his time at the club might have been different. They were crying out for a player of his profile — an ornery, physical ball-winner — and would surely have been a better side for his inclusion.\n\nAs it was, the year’s delay in the transfer worked very much against him. By the time he arrived at Sabener Strasse, Joshua Kimmich had moved back into midfield from right-back, Aleksandar Pavlovic had properly emerged as a first-teamer, and the coach who had supported his signing — Thomas Tuchel — had been replaced by Vincent Kompany.\n\n It had also been expected that Leon Goretzka would leave the club, or at least remain on the squad’s fringes. As it was, Goretzka was unexpectedly rehabilitated during Palhinha’s first season under Kompany, and became a further obstacle to a starting position.\n\nEven if he rarely played well for Bayern and never established a proper rhythm, it’s fairer to describe Palhinha as the wrong player, in the wrong place, at the wrong time, rather than just as a midfielder who was not good enough. Spurs, essentially, are profiting from a muddled situation, rather than snapping up an inferior product.",
  "medium": "Article",
  "links": [
    "https://twitter.com/SpursOfficial/status/1952082669199581410?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6077613/2025/01/21/bayern-munich-transfers-tom-bischof-contract/",
    "https://www.nytimes.com/athletic/6499420/2025/07/25/the-real-thomas-frank-tottenham-denmark/",
    "https://www.nytimes.com/athletic/connections-sports-edition",
    "https://t.co/aTAYVaujyU",
    "https://www.nytimes.com/athletic/6483767/2025/07/10/mohammed-kudus-tottenham-west-ham-transfer/",
    "https://www.nytimes.com/athletic/6426232/2025/06/15/tottenham-confirm-mathys-tel-transfer/",
    "https://www.nytimes.com/athletic/6527051/2025/08/01/joao-palhinha-tottenham-transfers-bayern/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "loan signing",
      "weight": 0.08488506
    },
    {
      "name": "Joao Palhinha",
      "weight": 0.07724852
    },
    {
      "name": "Bayern Munich",
      "weight": 0.07177238
    },
    {
      "name": "next season",
      "weight": 0.07010376
    },
    {
      "name": "Palhinha",
      "weight": 0.067532055
    },
    {
      "name": "Portuguese clubs",
      "weight": 0.06344049
    },
    {
      "name": "Bayern",
      "weight": 0.06323525
    },
    {
      "name": "Vincent Kompany",
      "weight": 0.062421363
    },
    {
      "name": "year",
      "weight": 0.059000928
    },
    {
      "name": "Spurs",
      "weight": 0.058949623
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97705078125
    }
  ],
  "sentiment": {
    "positive": 0.3894043,
    "negative": 0.08660889,
    "neutral": 0.5239258
  },
  "summary": "Tottenham Hotspur has signed midfielder Joao Palhinha from Bayern Munich on a loan deal worth €30m ($34.2m) and includes an option to make the transfer permanent at the end of the season. The deal includes Spurs' financial cover and a provision that Spurs will pay his wages in full. This comes after Bayern Munich made an offer to buy midfielder Tom Bischof from Hoffenheim for €51m ($58.3m). This move comes as Tottenham's fifth signing of the summer transfer window, following the £55m arrival of Mohmammed Kudus from West Ham and defenders Luka Vuskovic and Kota Takai from Hajduk Split and Kawasaki respectively. Palinha played 79 times for Fulham over two years and was named player of the year in his debut season.",
  "shortSummary": "Tottenham Hotspur signed 30-year-old Bayern Munich midfielder Joao Palhinha on a season-long loan with an option to make the deal permanent.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3af7cb077fb84e8a98b1e874bcb416f2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6483767/2025/07/10/mohammed-kudus-tottenham-west-ham-transfer/",
      "text": "Tottenham Hotspur have completed the signing of Mohammed Kudus from West Ham United.\nThe Athletic reported on Wednesday that a deal worth around £55million ($74.7m) had been agreed between the two clubs, with Kudus set to sign a six-year contract. Spurs had an initial bid of £50m rejected by West Ham, as reported by The Athletic on July 5.\nAdvertisement\nThe agreed fee is less than the buyout clause inserted in Kudus’ West Ham contract, which was active only for the first 10 days of July. The clause set a price of £80million ($108m) for teams on the continent, £85m for those in the Premier League and £120m for those in Saudi Arabia, while his deal at the London Stadium was valid until the summer of 2028.\nThe 24-year-old has been a key player for West Ham since he joined the club from Ajax in a deal worth €41m plus €3m in add-ons in 2023. He scored 14 goals — eight in the league — for the club in his debut season, alongside nine assists.\nHis output slowed in the subsequent campaign, with five goals and four assists in 35 matches as he played across multiple position’s in West Ham’s attack. Two of his goals came under Graham Potter, after the former Chelsea head coach succeeded Julen Lopetegui in January.\nKudus becomes Spurs’ first addition to the squad since the appointment of Thomas Frank as head coach last month. Prior to his arrival, Mathys Tel signed for the club permanently for a fee worth up to €45m following a six-month spell during the second half of the 2024-25 campaign. The Athletic reported on Thursday Nottingham Forest midfielder Morgan Gibbs-White is to undergo a medical at Spurs as Frank looks to bolster his new squad.\nTottenham have been actively looking to strengthen their attack, having shown interest in reuniting Brentford forward Bryan Mbeumo with head coach Frank, but the 25-year-old informed the north London club of his preference to join Manchester United. Spurs also made an inquiry for Bournemouth’s Antoine Semenyo, but the winger extended his contract with the South Coast club until 2030.\n‘A significant coup’ for Spurs\nAnalysis from Tottenham correspondent Jay Harris\nSpurs have spent the first few weeks of the transfer window trying to sign a right winger. However, Bryan Mbeumo has made it clear he wants to join Manchester United and Antoine Semenyo signed a new long-term contract with Bournemouth. Kudus might not have been their first-choice target but he is still a significant coup for new head coach Thomas Frank.\nAdvertisement\nFrank loves players who are positionally versatile. Kudus has spent the majority of his time with West Ham United on the right wing but he operates as a No 10 for Ghana. Frank could use the 24-year-old as a threat cutting inside onto his stronger left foot or as a powerful and dynamic dribbler in tight central areas.\nTottenham’s squad struggled to cope with the demands of the Premier League and the Europa League last season so it was crucial that they boosted their numbers this summer. Mathys Tel arrived permanently, after spending the second half of last season on loan from Bayern Munich, but he only turned 20 in April and is still raw. Kudus has a lot of room for growth but is far more experienced and proven.\nIt will be interesting to see how Kudus’ arrival impacts Brennan Johnson and Dejan Kulusevski. Johnson was Tottenham’s top scorer in all competitions last season and he scored the winning goal in the Europa League final. Johnson primarily plays on the right and Frank tried to sign him when he was in charge of Brentford. Will Kudus replace Johnson as the first-choice right winger or will he take over Kulusevski’s playmaking responsibilities in the middle of the pitch? Spurs have a lot of attacking talent at their disposal and it will be fascinating to see how Frank will effectively combine them.\n(Bryn Lennon/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6077613/2025/01/21/bayern-munich-transfers-tom-bischof-contract/",
      "text": "Bayern Munich have announced the signing of midfielder Tom Bischof from Hoffenheim on a pre-contract agreement.\nThe 19-year-old German youth international will join the club on a free transfer in the summer.\nHe has signed four-year deal that will see him stay at the Allianz Arena until 2029.\n“Tom Bischof is one of the biggest German talents, who’s also attracted international interest,” Bayern sporting director Christoph Freund said.\nAdvertisement\n“At the age of just 19, he’s already gained a lot of experience in professional football, in the Bundesliga as well as in the DFB Cup and Europa League. Tom is an ideal fit for our philosophy as a technically gifted midfielder.\n“We’re pleased he’s decided to take his next steps at FC Bayern. Tom has all the attributes to establish himself at the highest level.”\nNew arrival for 2025/26 season: #FCBayern sign Tom Bischof. 🔴⚪\nAll information: https://t.co/vMfnYLP5Us pic.twitter.com/X6kRH29EOe\n— FC Bayern (@FCBayernEN) January 21, 2025\nBischof has made 24 appearances in all competitions for Hoffenheim this season, including 16 in the Bundesliga where he has scored two goals.\nWho is Bischof and why is he so highly rated?\nA Hoffenheim academy graduate who made his Bundesliga debut at 16, Bischof has represented Germany at U16, U17 and U18 level.\nThe watchable, left-footed central midfielder has started 15 Bundesliga games for TSG this season and has also been ever-present during the club’s Europa League campaign.\nHe has shone in a team that have struggled and has been the outstanding performer in a side that sit 15th in the Bundesliga, one place above the relegation playoff place.\nNo surprise, because Bischof is generally considered one of the country’s biggest prospects of the coming generation. A tenacious but talented all-round midfielder, he won the Fritz Walter Gold Medal in the U19s — given to the best German player in their age group — and is also a set-piece expert.\nIn completing the transfer, Bayern will feel that they have potentially constructed a central midfield to last most of the next decade. Munich-born Aleksandar Pavlovic, 20, is already a full German international and an integral part of Vincent Kompany’s side, and a potential partnership with Bischof feels both balanced with and without the ball and capable of providing outstanding support to the attacking part of the team.\nAdvertisement\nBayern already have a clutch of talented young players around whom their new era will be build. Jamal Musiala (21) is already a star, of course, and Michael Olise (23) has had a terrific first season in Germany. Mathys Tel (19) will surely realise his enormous potential in attack at some point, while Alphonso Davies — still 24 — is likely to sign a new contract and commit his future to the club in the coming days.\nBischof can be added to that group as soon as he arrives, with Bayern looking increasingly well-stocked for the years ahead.\n(Alex Grimm/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6527051/2025/08/01/joao-palhinha-tottenham-transfers-bayern/",
      "text": "Joao Palhinha is to have a Tottenham medical in Germany on Friday ahead of a season-long loan move from Bayern Munich.\nThe deal includes the option to make the transfer permanent for €30million (£25.9m, $34.2m) at the end of the season, and Spurs will cover his wages in full.\nThe Athletic reported on Thursday that Tottenham were in talks with Bayern over a proposed loan move for Palhinha. The Portuguese midfielder was made available by the German champions this summer, but the Premier League club favoured a loan move over a permanent deal.\nAdvertisement\nPalhinha joined Bayern last summer in a deal worth €51million ($58.3m) following a successful two years at Fulham but he made just 25 appearances for Vincent Kompany’s side, of which 10 were starts.\nThe 30-year-old was often behind Joshua Kimmich, Leon Goretzka, Aleksandar Pavlovic and Konrad Laimer in Kompany’s selection, and the German champions have signed another midfielder, Tom Bischof, this summer.\nTottenham and Bayern have already done business this summer, after the north London club signed Mathys Tel permanently, following his loan spell in the second half of 2024-25.\nPalhinha was Fulham’s player of the season in his debut campaign at Craven Cottage and made 79 appearances in total for the club. Before his move to the Premier League, he had spent the entirety of his senior career in Portugal with Sporting CP and had several loan spells elsewhere.\nThe Portugal international could become Tottenham’s fifth new arrival of the summer. Mohammed Kudus joined Spurs from West Ham United earlier in July in a deal worth £55million ($74.7m), alongside defenders Luka Vuskovic and Kota Takai from Hajduk Split and Kawasaki respectively, while Tel joined permanently from Bayern.\nNottingham Forest midfielder Morgan Gibbs-White was set to undergo a medical to join Tottenham but later signed a new contract at the City Ground.\n‘Spurs profiting from a muddled situation’ – analysis\nBy The Athletic’s German Football Correspondent Sebastian Stafford-Bloor\nHad Joao Palhinha moved to Bayern Munich when he first expected to, in the final hours of the transfer window in the summer of 2023, his time at the club might have been different. They were crying out for a player of his profile — an ornery, physical ball-winner — and would surely have been a better side for his inclusion.\nAs it was, the year’s delay in the transfer worked very much against him. By the time he arrived at Sabener Strasse, Joshua Kimmich had moved back into midfield from right-back, Aleksandar Pavlovic had properly emerged as a first-teamer, and the coach who had supported his signing — Thomas Tuchel — had been replaced by Vincent Kompany.\nIt had also been expected that Leon Goretzka would leave the club, or at least remain on the squad’s fringes. As it was, Goretzka was unexpectedly rehabilitated during Palhinha’s first season under Kompany, and became a further obstacle to a starting position.\nAdvertisement\nEven if he rarely played well for Bayern and never established a proper rhythm, it’s fairer to describe Palhinha as the wrong player, in the wrong place, at the wrong time, rather than just as a midfielder who was not good enough. Spurs, essentially, are profiting from a muddled situation, rather than snapping up an inferior product.\n(Photo: Alex Grimm/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6426232/2025/06/15/tottenham-confirm-mathys-tel-transfer/",
      "text": "Tottenham Hotspur have confirmed the signing of forward Mathys Tel from Bayern Munich on a permanent basis.\nThe 20-year-old spent the second half of the season on loan at Tottenham, with the club possessing the option to buy Tel in the summer.\nThe fee in the deal was set at €55million, but following new negotiations between the clubs, the deal is now worth €35m, plus €10m in potential bonuses, with Tel signing a contract until 2031.\nWe are delighted to announce the permanent signing of Mathys Tel from Bayern Munich on a contract that will run until 2031 ✍️\n— Tottenham Hotspur (@SpursOfficial) June 15, 2025\nTel made 20 appearances for Tottenham, scoring three goals in all competitions and was part of the side that won the Europa League in May, ending the team’s 17-year wait for a trophy.\nThe Frenchman is the first official permanent signing under Thomas Frank, who replaced Ange Postecoglou this month after the Australian was sacked.\nAdvertisement\nPostecoglou insisted earlier this year that he expected Tel to stay at the club longer than his initial half-season loan spell.\n“He’ll be a Tottenham player,” Postecoglou said in February. “I think he’ll show everyone he’s going to be a Tottenham player in the next six months. I didn’t bring him here for six months.”\nAfter joining Bayern in 2022 from French team Rennes, Tel went on to play 83 times for the Bavarian club, recording 16 goals and seven assists. He became Bayern’s youngest ever goalscorer in August 2024 aged 17 years and 126 days, scoring in a 5-0 win over Viktoria Cologne to beat Jamal Musiala’s previous record.\n“Mathys Tel came to Bayern as a very young player and took his first steps into top-level international football here,” said Bayern board member for sport Max Eberl. “He was a popular figure in our team, always giving his all for the club and the team. It has become clear that the move to Tottenham was the right one for his development.”\nManchester United were interested in Tel during the winter window, while Chelsea also enquired about him.\nTel has made eight appearances for France’s under-21 side and is currently representing the team at the European Under-21 Championship. He scored from the penalty spot in France’s 3-2 group stage win over Georgia on Saturday.\n(Glyn Kirk/AFP via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6499420/2025/07/25/the-real-thomas-frank-tottenham-denmark/",
      "text": "To reach Thomas Frank’s hometown of Frederiksvaerk, around 50 kilometres north of Copenhagen and where his mother still lives, The Athletic caught two trains and a bus from the Danish capital. The bus cuts through forests and fields, before it trundles past the glittering water of the Roskilde Fjord. It stops at the side of a motorway, and from there, the clubhouse of Frederiksvaerk (FFK) is accessed through a small tunnel.\nAdvertisement\nIt is a place still very much close to Frank’s heart. When the new Tottenham Hotspur head coach returns to Denmark, he runs past the club’s pitches.\n“The last time he was here in March, I was sitting upstairs in the office,” Martin Holm Jensen, a senior figure at FFK, tells The Athletic. “I could hear somebody walking on the stones outside the front gate. He was standing down there looking onto the pitch and knocking on the window, so he came up and said hello.”\nFrank has not forgotten any of his friends from Frederiksvaerk. When he turned 50 in October 2023, he took a group of 35 of them to the Spanish island of Mallorca to celebrate, some he had known since childhood. They played padel, drank cocktails and reminisced about the roles they had all played in Frank’s coaching career, which started in the remote Danish town with a population of just over 10,000.\n“Thomas does everything he can to be the same person,” says Anders Bay, who has known Frank for over a decade. “At the start of every year, he always texts me to arrange to meet up when the season has finished. If you were a typical top manager, you would want to sit in a room by yourself or be with your family in your spare time but that’s not Thomas. He remembers everybody.”\nFrank has spent the majority of the last seven years in charge of Brentford but has accepted the biggest challenge of his career. In June, he signed a three-year contract to replace Ange Postecoglou at Tottenham.\nFrank earned £100 ($130) from his first coaching job. Now, he is on a multi-million-pound salary at Spurs, who have a 60,000-seater stadium and will play in the Champions League next season.\nThe Athletic has been to Denmark to trace the earliest steps in Frank’s journey to north London.\n“Frederiksvaerk is a small town with a harbour but not many jobs, so most people leave to work in the city,” says Jensen.\nTheir football club, FFK, was formed in November 2004 when Frederiksvaerk Boldklub (FB) and Brederod merged. They compete in the seventh tier of Danish football.\nFrank progressed through FB’s youth ranks and played in midfield for their first team in the 1990s. When he was 20, he was encouraged to become a coach by Jesper Olsen — no relation to the former Manchester United and Ajax winger of the same name. He was given a tracksuit and 1,000 Danish kroner, which amounts to just over £100.\nAdvertisement\n“My father was part of the board and became youth-team chairman,” says Jacob Olsen, Jesper’s son. “My father tried to recruit senior players to become coaches. Thomas volunteered because he wanted to help young people and give something back.”\nFrank worked alongside Jacob Hansen, with whom he remains close, and Lis Westberg Pedersen. The latter captained Denmark to victory at the 1971 Women’s World Cup in Mexico.\nFrank studied for a sports degree at the University of Copenhagen, where he wrote about his experiences coaching FB’s under-eights and under-12s. Frank coached Jacob, who describes him as “human, ambitious and with his heart in the right place”. They still keep in touch and the Olsens visited him in London in December.\n“He used the experiences he gained from university to develop us,” says Olsen. “He focused on everyone. Thomas and Lis were two fantastic people who created joy and a well-functioning team. He introduced the ‘trick of the week’, which the players loved.\n“Thomas says the two biggest games of his career were the billion-dollar match for promotion to the Premier League at Wembley against Swansea in 2021 and the match for the Zealand Championship between Frederiksvaerk and Brondby. We beat Brondby 2-0. It was a joke but he remembers people. It was as if nothing had changed when we saw him. We enjoyed our trip to Brentford but it was clear he appreciated it too.”\nThe pitches where Frank started his coaching career no longer exist as they were left behind when FFK was created. The grass has overgrown and is covered with trees and bushes.\nFrank left Frederiksvaerk in 1999 to join Hvidovre, a club in the Copenhagen suburbs who won the Danish top flight three times between 1966 and 1981. Peter Schmeichel represented them before he went on to play for Brondby, Manchester United and the national team.\nFrank was recruited by Ebbe Bay, the youth team chairman at the time. He worked alongside Kim Hallberg, who now holds a senior role at the Danish Football Association (DBU), and Brian Riemer, who went on to become Frank’s assistant at Brentford and is now Denmark’s head coach.\nAdvertisement\nTeddy Hebo is Hvidovre’s chairman and has been associated with them for more than 60 years. When Frank first joined, Hebo watched training one evening.\n“There was almost no light on the pitch but Thomas was training with the players and it fascinated me,” Hebo says after taking The Athletic on a guided tour of the club’s facilities, pointing out the pitches where Frank spent so many hours. “He had this infectious energy that he transferred to the squad. He was dynamic, engaged and dedicated.\n“He came over to me and asked, ‘Who are you?’. We talked and established a good relationship. Then he started training my son Thomas and we became even closer.”\nFrank spent five years with Hvidovre and juggled coaching duties with a degree in psychology. He went travelling to New Zealand and Australia with his wife Nanna before they became parents for the first time. Money was tight and there were moments when he had to consider if full-time coaching was the right option for his family.\n“Thomas got paid so little you wouldn’t believe it,” Hebo says. “Around £1,000 a year. I would invite Thomas and Kim over for red meat and red wine because that was a way to recognise their work.\n“Thomas and Nanna were young people who worked hard. She studied to become a psychologist and then worked for a children’s association. The success of Thomas is his wife. She has been his strongest supporter but challenges him. When he goes a little bit wild, Nanna brings him back on track.”\nFrank left Hvidovre in 2004 to become an integrated talent development (ITU) coach at second-division side B93. The ITU scheme was created by the DBU, which agreed to pay part of a coach’s salary at some of the best academies in Denmark. That coach would then focus on individual player development. It is similar to the newly created role of an individual development coach at Spurs.\nAdvertisement\nJohan Lange was a coach at B93, after he had spent time in their academy as a child, and has had a big say in Frank’s career. In November 2023, Lange was appointed as Tottenham’s sporting director. The 45-year-old played a crucial role in the process of hiring Frank from Brentford. Over 20 years after they first crossed paths at a small club near the centre of Copenhagen, they have been reunited. Frank only spent 12 months with B93 but made a significant impact.\n“Thomas had to be creative because we didn’t have a lot of money or the right clothing and equipment,” Frank Nielsen, B93’s sports manager, tells The Athletic in a building next to their clubhouse, which is being renovated. “He helped us to structure the way we trained players and developed what we call the ‘red line’. You sit down with all the coaches of the different age groups and make sure you are coaching them in the same way and are all heading in the right direction.”\nFrank’s work with Hvidovre and B93 caught the attention of Birger Jorgensen at second-tier side Lyngby. The first time Jorgensen met Frank was at a meeting of Denmark’s coaches that the DBU hosted every summer in Vejle.\nLange moved to Lyngby in 2005 and Frank followed shortly after. They worked together alongside future Denmark head coach Kasper Hjulmand and Niels Frederiksen, who has just won the Polish top flight with Lech Poznan. They all shared a small office on the bottom floor of the clubhouse, which is now where the media and communications staff are based.\n“Lygnby went bankrupt in 2001 and we had to rebuild it,” says Jorgensen, who is leading Lyngby’s stadium redevelopment. “After that, this club was like a laboratory. Kasper moved into the first team, Johan Lange had the reserves and then Thomas became the ITU coach. Kenneth Weber, who is now an assistant with the Danish national team, was here too.”\nLyngby’s crop of talented coaches would watch Champions League games together and took inspiration from Barcelona. Jorgensen visited Frank at Brentford’s training ground in May and there was a chart on the wall in the canteen which measured how many chances they were creating and conceding from set pieces.\n“In that period, we didn’t think set pieces were part of football,” Jorgensen says. “We wanted to have the ball all the time. It’s Thomas’ personality that catches you but he has progressed tactically. He is clever to take the next level and follow how football has developed. He can adapt to different clubs.\nAdvertisement\n“It’s incredible that (Frank and Lange) have joined Spurs. I texted them both: ‘It is crazy that you guys were here and are now there. I can’t advise you anymore, but my final piece of advice is, “Win every weekend”‘.”\nDuring Frank’s time at Lygnby, Andreas Bjelland was a talented centre-back in their academy. They remain close and this year Bjelland called Frank for advice when he considered retiring.\n“Thomas is a kind person,” Bjelland, who is now an assistant coach at Lyngby, says after accidentally interrupting The Athletic’s conversation with Jorgensen. “He has an interest in you as a person, not just as a player. He knows how to get the best out of you.\n“He was good at challenging me and making me grow. When I was younger, I didn’t have a dream. He pushed me and gave me direction.”\nBjelland went on to play for Nordsjaelland, Twente and moved to Brentford in 2015. Within a year, he had been reunited with Frank, who had been appointed as an assistant to head coach Dean Smith.\n“I was happy to see him,” Bjelland says. “The English culture was about fighting and winning duels. Thomas came in and made tactical adjustments. We played shape games of 11 v zero to see the patterns in play, to understand if I have the ball, then we want to go here, which way to turn my body… we had never done that before.”\nAfter three years with Lyngby, Frank was interested in becoming the head coach of Denmark’s under-16s and under-17s. Hallberg, his former assistant at Hvidovre, had moved to the DBU and recommended him to then-general secretary Jim Stjerne Hansen.\nFrank impressed Hansen during a meeting at their offices. The negotiations between the DBU and Lyngby were over a modest fee compared to the £10million ($13.5m) Spurs paid to take Frank and his backroom staff from Brentford.\n“I asked Thomas for a copy of his employment contract and he said it didn’t exist,” says Hansen, who was general secretary from 1988 until 2014. “He just got paid every month and that was it. Somebody from Lyngby called me and said: ‘Jim, you have to pay £15,000 for Thomas’. I replied, ‘Can you send me a copy of his contract?’. I never heard from them again.”\nAdvertisement\nDenmark topped their group at the Under-17 European Championship in 2011 with victories against Serbia, France and an England side that included Raheem Sterling and Jordan Pickford. They lost against Germany in the semi-finals.\nLater that year, they played in the Under-17 World Cup for the first time, but finished bottom of a group containing Brazil, Ivory Coast and Australia. Brazil’s captain was future Paris Saint-Germain defender Marquinhos, while Souleymane Coulibaly scored a hat-trick for Ivory Coast against Frank’s team. That name may ring a bell among Spurs fans: Coulibaly finished as the tournament’s top goalscorer, which led to a move to Spurs. Sadly, he never made an appearance for the first team.\nFrank helped to develop future Spurs midfielders Christian Eriksen and Pierre-Emile Hojbjerg, as well as Arsenal’s new signing Christian Norgaard. He worked with a lot of the Danish squad that lost to England in the semi-final of the senior European Championship in 2021.\nFrank had a close relationship with Hansen. He would regularly visit his boss at home and “loved” eating the platters of cheese Hansen’s wife prepared. He took over the under-19s and asked about stepping up to the under-21s. Yet, he still had a lot to learn.\n“He was a little bit naïve because he wanted to play like Barcelona,” Hansen says. “Thomas has a close friendship with Albert Capellas, the former director of Barcelona’s academy, who then became his assistant at Brondby.\n“Thomas was in favour of possession, possession and possession. He came back from a game against Norway and said, ‘Jim, we had 65 per cent of the ball’. But they lost 2-1.\n“When Thomas then worked with me at Brondby, he said, ‘I admit that this is about results and nothing else matters’.”\nWhile Frank was in charge of Denmark’s youth teams, Bay contacted him about working as a pundit for the television company Channel Nine. Frank made multiple appearances on their shows and developed a relationship with Bay.\nBay worked alongside Aldo Petersen, who became Brondby’s chairman in 2013. That summer, Frank was appointed as their head coach. Bay was their new head of communications and marketing. Hansen released Frank from his contract with Denmark without a fee.\nAdvertisement\n“People were saying he was just a youth-team coach,” Bay, who is now the head of sport for the Walt Disney Company in Denmark, says. “But he likes to be challenged and get new things into his head. He is curious, empathetic and attentive.\n“He is interested in other people. He had one-on-one meetings with all the members of staff. He is so open-minded and being with people inspires him. He is very good at getting people around him — staff, players and the board.\n“He wants to feel what’s going on in a player’s life. We had Johan Elmander playing for us. Johan lost his father and Thomas said, ‘Whatever you need, time off, prioritise your family’. But he is not just a nice guy. He wants to win.”\nBay experienced Frank’s relentless desire to win on a trip to Dubai in 2014. Brondby’s staff competed against each other in a three-v-three beach football tournament where they were split into four teams. Bay was paired with Frank and then sporting director Per Rud. They won the competition but Bay was unhappy with their approach.\n“I went to the bar in the evening and I was thinking about what happened because there were times when I was free but they didn’t pass the ball to me,” Bay says. “I confronted Per and Thomas and said, ‘Guys, what the f*** was going on?’. They laughed and said, ‘We wanted to win!’.\n“He is ambitious and has a lot of self-confidence but is reflective. There were some tough times at Brondby. He didn’t win any of his first seven games. But he just worked harder. He might have a difficult start at Spurs but he is a survivor.\n“It’s important that people remember you for who you are and not what you are, but Thomas prefers to be remembered as a successful manager rather than a great human being.”\nBrondby only finished in ninth, five points above the relegation zone, the season before Frank joined. He guided them to back-to-back top-four finishes but left towards the end of his third season in charge. Brondby’s chairman, Jan Bech Andersen, had criticised Frank on an online forum using the alias Oscar, his son’s name. Frank held a press conference after the news broke and resigned. Andersen stepped down but remained on the board. The Athletic contacted Andersen for this piece but he did not want to comment.\nAdvertisement\nA year after leaving the DBU, Hansen joined Brondby’s board and was there when Frank left. “We made two mistakes at Brondby with the coaches — one was Kent Nielsen and the other was Thomas,” he says. “But the pressure at Brondby is always tough. When the results are not there, the first thing they look at is the coach. What happened with Thomas and the owner is a sad end to the story.”\n“People see Thomas as a nice and inclusive person but if you take advantage of him once or you don’t respect him then you are out,” Bay says.\n“Thomas is not someone who compromises his values,” according to Hebo. “He hates bulls*** and is not afraid of speaking up. It is about hard work and humbleness for Thomas. It’s not just words. He lives with it.”\nSeven months after resigning from Brondby, Frank became an assistant at Brentford following a meeting in a hotel with then co-directors of football Phil Giles and Rasmus Ankersen. The long-term plan was for him to succeed Smith but nothing was guaranteed.\n“Thomas moved his family from Copenhagen to London for a job which I’m sure did not pay that well,” Hansen says. “I met him in London and we had a cup of coffee together. He said, ‘It’s tough with a wife and kids who are going to school here in a different system from Denmark but we will give it a try and see how it develops’. I admire that he took a risk and it has taken him to Tottenham.”\nWhen Frank became Brentford’s head coach in October 2018, he got back in touch with Hebo, now the former managing director of the Danish and Norwegian division of Eli Lilly, an American pharmaceutical company. He was senior vice president for corporate human Eli Lilly at Danish firm Lundbeck, where he was responsible for talent development, and has written books about leadership.\nAfter losing eight of his first 10 games in charge, Frank started to ring Hebo every Friday evening to discuss his challenges. Hebo encouraged Frank to set career goals and they came up with the acronym PATH — purpose, ambition, togetherness and hard work.\n“Thomas has invested so much in leadership,” Hebo says. “One of the areas we worked on is called ‘constructive cynicism’. When you’re in a top job, you need to make difficult decisions and you need to deliver them in the right way. He has developed that significantly. He always asks for input before he makes decisions but is not afraid of making tough calls.\nAdvertisement\n“He is still the same person he was when we worked at Hvidovre but he needs to manage his energy levels. He keeps going but sometimes you need to slow down. Thomas likes to chase lots of rabbits but sometimes you need to choose just one that you want to catch.”\nFrank has only come close to running out of energy on one occasion. Towards the end of the 2019-20 season, Brentford won eight matches in a row to boost their chances of automatic promotion from the Championship but lost their final two games. They reached the play-off final but lost after extra time to west London rivals Fulham.\n“A couple of days later, he was having breakfast with me by the sea and he was crushed,” Bay says. “It was devastating. He has this huge capacity and he can manage so many things but the lights went out. You cannot convince the players, staff and fans if you are not energised. But then, 10 days later, he was back. He was more idealistic about how to play football 10 years ago and now it’s about winning. He doesn’t care if they play amazing football if they lose.”\nBrentford won the play-off final at the second attempt under Frank to achieve promotion to the Premier League. They memorably beat Arsenal 2-0 on the opening day of the 2021-22 season, their first game in the top flight for 74 years, and went on to finish 13th.\nFrank recorded two top-half finishes in four seasons with Brentford. He missed out on the Chelsea job last summer to Enzo Maresca and was a potential replacement for Erik ten Hag at Manchester United. Now he has got his opportunity at a bigger club thanks to Spurs.\n“It’s probably one of the biggest jobs a Danish coach will ever have,” Bjelland says. “I’m so happy for him and proud of what he has done. He has earned it.”\n“I contacted him when he was working at Brondby because I work with underdeveloped kids and one of them was a big fan,” Nielsen says. “Thomas made sure I could take him to see the facilities and watch the team train. He has never forgotten where he comes from. He is humble but it will be interesting to see how Tottenham will change him because the environment is much bigger.\n“But it is unbelievable how he has gone from coaching at our little club to one of the biggest teams in the world.”\n(Top photos: Nick Potts, Naomi Baker/Getty Images; design: Kelsea Petersen/The Athletic)"
    }
  ],
  "argos_summary": "Tottenham Hotspur has secured the loan signing of Joao Palhinha from Bayern Munich, with an option to make the deal permanent for €30 million at the end of the season. Palhinha, who struggled for playing time at Bayern after joining from Fulham, becomes Spurs' fifth signing of the summer, following the acquisition of Mohammed Kudus from West Ham. The club is actively strengthening its squad under new head coach Thomas Frank, who aims to enhance their performance in the upcoming Champions League season.",
  "argos_id": "XO8API1B7"
}