{
  "url": "https://www.ajc.com/news/2025/08/israel-minister-who-led-prayers-at-a-controversial-holy-site-has-a-record-of-provocative-actions/",
  "authorsByline": "MELANIE LIDMAN",
  "articleId": "f18af78e4ac24176854947186804077a",
  "source": {
    "domain": "ajc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "GA",
      "county": "Fulton County",
      "city": "Atlanta",
      "coordinates": {
        "lat": 33.7489924,
        "lon": -84.3902644
      }
    }
  },
  "imageUrl": "https://www.ajc.com/resizer/v2/XXCUHWMSTVGHBAEE7CA2XZA54I.jpg?auth=b00c06ecd2fb2052f0b804929c35788d5333c76de37a45566aec518df30a52d4&width=1200&height=630&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T18:52:25.967000+00:00",
  "addDate": "2025-08-03T19:14:48.547807+00:00",
  "refreshDate": "2025-08-03T19:14:48.547809+00:00",
  "score": 1.0,
  "title": "Israel minister who led prayers at a controversial holy site has a record of provocative actions",
  "description": "Israel's far-right national security minister, Itamar Ben-Gvir, has led prayers at Jerusalem's most sensitive holy site, sparking international condemnation",
  "content": "It was the latest act of defiance by the 49-year-old ultranationalist settler leader who transformed himself over the decades from an outlaw and provocateur into one of Israel’s most influential politicians.\n\nHere is a closer look at Ben-Gvir:\n\nWhy was the visit considered a provocation?\n\nSince Israel captured the site in 1967, Jews have been allowed to visit but not pray there. Palestinians consider the mosque a national symbol and view visits by Jewish leaders as provocative and as a potential precursor to Israel seizing control over the compound. Most rabbis forbid Jews from praying on the site, but there has been a growing movement in recent years of Jews who support worship there. Ben-Gvir has long called for greater Jewish access to the holy site.\n\nBen-Gvir was visiting to mark the Jewish holiday of Tisha B’Av, a day of mourning and repentance when Jews reflect on the destruction of the First and Second Temples, key events in Jewish history.\n\nVisits like Ben-Gvir’s are legal. Israeli media said the visit was the first time that a sitting minister actively and vocally led prayers. Ben-Gvir also called for Israel to conquer and declare sovereignty over all of the Gaza Strip and encourage “voluntary” migration from Gaza in order to end the war and bring the hostages back. Palestinians say the migration plan is a disguise for forced expulsions.\n\nIn response to Ben-Gvir's visit, Prime Minister Benjamin Netanyahu said the status quo at the site had not changed and would not change to allow Jewish prayer.\n\nBen-Gvir has been convicted eight times for offenses that include racism and supporting a terrorist organization. The army banned him from compulsory military service when he was a teen, deeming his views too extreme.\n\nBen-Gvir gained notoriety in his youth as a follower of the late radical rabbi Meir Kahane. He first became a national figure when he broke a hood ornament off then-Prime Minister Yitzhak Rabin’s car in 1995.\n\n“We got to his car, and we’ll get to him too,” he said, just weeks before Rabin was assassinated by a Jewish extremist opposed to his peace efforts with the Palestinians.\n\nTwo years later, Ben-Gvir took responsibility for orchestrating a campaign of protests, including death threats, that forced Irish singer Sinead O’Connor to cancel a concert for peace in Jerusalem.\n\nThe political rise of Ben-Gvir was the culmination of years of efforts by the media-savvy lawmaker to gain legitimacy. But it also reflected a rightward shift in the Israeli electorate that brought his religious, ultranationalist ideology into the mainstream and diminished hopes for Palestinian independence.\n\nBen-Gvir is trained as a lawyer and gained recognition as a successful defense attorney for extremist Jews accused of violence against Palestinians.\n\nWith a quick wit and cheerful demeanor, the outspoken Ben-Gvir also became a popular fixture in the media, paving his way to enter politics. He was first elected to parliament in 2021.\n\nBen-Gvir has called for deporting his political opponents. In an episode in 2022, he brandished a pistol and encouraged police to open fire on Palestinian stone-throwers in a tense Jerusalem neighborhood. In his Cabinet post, Ben-Gvir oversaw the country’s police force. He used his influence to encourage Netanyahu to press ahead with the war in Gaza and recently boasted that he had blocked past efforts to reach a ceasefire.\n\nAs national security minister, he has encouraged police to take a tough line against anti-government protesters.\n\nBen-Gvir secured his Cabinet post after 2022 elections that put Netanyahu and his far-right partners, including Ben-Gvir’s Jewish Power party, into power.\n\n“Over the last year I’ve been on a mission to save Israel,” Ben-Gvir told reporters before that election. “Millions of citizens are waiting for a real right-wing government. The time has come to give them one.”\n\nBen-Gvir has been a magnet of controversy throughout his tenure — encouraging the mass distribution of handguns to Jewish citizens, backing Netanyahu’s contentious attempt to overhaul the country’s legal system and frequently lashing out at U.S. leaders for perceived slights against Israel.\n\nBen-Gvir temporarily resigned from Prime Minister Netanyahu's cabinet earlier this year to express his disapproval of the Gaza ceasefire deal.\n\nThe ceasefire ran from Jan. 19 to March 1. Hamas released 25 Israeli hostages and the bodies of eight others in return for nearly 1,800 Palestinian prisoners, including senior militants serving life sentences for deadly attacks. Israeli forces pulled back to a buffer zone, hundreds of thousands of Palestinians returned to what remained of their homes, and there was a surge of humanitarian aid.\n\nBen-Gvir's resignation did not stop the ceasefire, but it did weaken Netanyahu’s governing coalition. Ben-Gvir rejoined the cabinet when Israel ended the ceasefire and returned to active combat in Gaza in March 2025.\n\nLast week, the Netherlands banned Ben-Gvir and far-right Finance Minister Betzalel Smotrich from entering the country. Britain, Australia, Canada, New Zealand and Norway imposed financial sanctions on the two men last month.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/israel-palestinian-prisoner-release-hamas-ceasefire-hostage-3a20774bb4b519e852273ec559687b3b",
    "https://apnews.com/article/middle-east-elections-israel-benjamin-netanyahu-tel-aviv-65155b743a5a8e73eb4b4f50eff9229a",
    "https://apnews.com/article/sinead-oconnor-itamar-bengvir-jerusalem-concert-e08c0903f413e8fb56663cf2adb0c0ef",
    "https://apnews.com/article/itamar-bengvir-resigns-gaza-ceasefire-netanyahu-d63bc4ac1e4f741cafa6fab4d932f891",
    "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-netanyahu-ff48f081b069e484955a72bc68261364",
    "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
    "https://apnews.com/article/israel-palestinians-gaza-war-returning-home-3845051eda5c3f481f5ed8783efc4cbf",
    "https://apnews.com/article/netherlands-israel-gaza-entry-ban-ministers-a5351f28ce17fb79a5800d21bbfb6f12",
    "https://apnews.com/article/israel-palestinians-britain-settlements-sanctions-e9ab86f5561af8afbdbf34709efe504e",
    "https://apnews.com/article/israel-gaza-hamas-hostages-ceasefire-ad6b3d9fe8077c7c012437e86b5af187",
    "https://apnews.com/article/israel-middle-east-violence-religion-0dcc4073d660003f4e3fa8d4ed0a9a6a",
    "https://apnews.com/article/middle-east-religion-jerusalem-prayer-dcbe5cf8313db3291df71e6e015cc0c8"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gvir",
      "weight": 0.08792031
    },
    {
      "name": "Ben",
      "weight": 0.0813385
    },
    {
      "name": "Prime Minister Benjamin Netanyahu",
      "weight": 0.06641862
    },
    {
      "name": "Jewish leaders",
      "weight": 0.06560403
    },
    {
      "name": "Israel minister",
      "weight": 0.063054584
    },
    {
      "name": "Jewish prayer",
      "weight": 0.061306536
    },
    {
      "name": "Jewish citizens",
      "weight": 0.061238658
    },
    {
      "name": "Ben-Gvir",
      "weight": 0.059887253
    },
    {
      "name": "Israel",
      "weight": 0.057096183
    },
    {
      "name": "Jewish",
      "weight": 0.056680355
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.9375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.93505859375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.837890625
    },
    {
      "name": "/People & Society/Other",
      "score": 0.77587890625
    },
    {
      "name": "/News/Other",
      "score": 0.56201171875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.5146484375
    }
  ],
  "sentiment": {
    "positive": 0.071899414,
    "negative": 0.67285156,
    "neutral": 0.2553711
  },
  "summary": "Israel's Minister, Yitzhak Ben-Gvir, has a history of provocative actions, including leading prayers at a controversial holy site. Since Israel took control of the site in 1967, Jews have been allowed to visit but not pray there. This was seen as a provocation by Palestinians who consider the mosque a national symbol and a potential precursor to Israel seizing control over it. This is not the first time a sitting minister has led prayers at the site. Ben-gvir has previously advocated for greater Jewish access to the holy site and has been convicted eight times for offenses including racism and supporting a terrorist organization. He also advocated for Israel to conquer and declare sovereignty over all of the Gaza Strip and encourage voluntary migration from Gaza to end the war and bring hostages back.",
  "shortSummary": "Israel's Benjamin Ben-Gvir, a controversial ultranationalist leader, led controversial Jewish prayers at a controversial site, sparking controversy and calls for Israeli sovereignty.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "48513552a0b94f99ba3f28e8e21fe981",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/israel-palestinians-britain-settlements-sanctions-e9ab86f5561af8afbdbf34709efe504e",
      "text": "UK and others sanction 2 far-right Israeli Cabinet ministers for ‘inciting extremist violence’\nUK and others sanction 2 far-right Israeli Cabinet ministers for ‘inciting extremist violence’\nJERUSALEM (AP) — Britain, Australia, Canada, New Zealand and Norway said Tuesday they have imposed sanctions on two far-right Israeli government ministers for allegedly “inciting extremist violence” against Palestinians in the Israeli-occupied West Bank.\nThe decision by Western governments friendly to Israel was a sharp rebuke of Israel’s settlement policies in the West Bank and of settler violence, which has spiked since Hamas’ Oct. 7, 2023, attack ignited the war in the Gaza Strip.\nNational Security Minister Itamar Ben-Gvir and Finance Minister Bezalel Smotrich, key partners in Prime Minister Benjamin Netanyahu’s coalition, are champions of Israeli settlement who support continuing the war in Gaza, facilitating what they call the voluntary emigration of its Palestinian population and the rebuilding of Jewish settlements there.\nThey could now face asset freezes and travel bans.\nIn a joint statement, the foreign ministers of the five countries said Ben-Gvir and Smotrich “have incited extremist violence and serious abuses of Palestinian human rights. Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous.”\nU.K. Foreign Secretary David Lammy said the two men “have been inciting violence against Palestinian people for months and months and months” and “encouraging egregious abuses of human rights.”\n“These measures are directed at individuals who directly contribute to extremist settler violence,” said Canadian Foreign Minister Anita Anand. “The measures are not directed against the state of Israel itself.”\nNew Zealand’s Foreign Minister Winston Peters said Wednesday that Smotrich and Ben-Gvir “have severely and deliberately undermined” prospects for peace and security while “inciting violence and forced displacement.”\n“Our action today is not against the Israeli people, who suffered immeasurably on October 7 and who have continued to suffer through Hamas’ ongoing refusal to release all hostages,” Peters said in a statement. “Nor is it designed to sanction the wider Israeli government.”\nSmotrich wrote on social media that he learned of the sanctions while he was inaugurating a new West Bank settlement. “We are determined to continue building,” he said.\nBen-Gvir, also writing on social media, said “we overcame Pharoah, we’ll overcome Starmer’s Wall,” referring to British Prime Minister Keir Starmer.\nIsrael’s government condemned the announcement, which came as traditional allies of Israel escalate denouncements of Israel’s actions in Gaza, from the high civilian death toll to a monthslong blockade that led to famine warnings.\nIsrael’s Foreign Minister Gideon Saar called the sanctions decision “outrageous.” He said he had discussed it with Netanyahu and they would meet next week to discuss Israel’s response.\nHe said that the move threatened to harden Hamas’ stance in ongoing negotiations to end the war in Gaza and to cut short Israel’s operation in Gaza before it achieves its goals.\nBenny Gantz, an centrist Israeli lawmaker and political rival to Netanyahu, wrote that he “vehemently” disagreed with Smotrich and Ben-Gvir, but said the move was a “profound moral mistake and sends a dangerous message to terrorists around the world.”\nNetanyahu is the target of an arrest warrant issued by the International Criminal Court last year over alleged war crimes in Gaza, part of a global wave of outrage at Israel’s conduct during its 20-month war against Hamas. Netanyahu has denied the allegations and accused the court of being biased against Israel.\nThe Biden administration took the rare step of sanctioning radical Israeli settlers implicated in violence in the occupied West Bank — sanctions that were lifted by President Donald Trump.\nEitay Mack, an Israeli human rights lawyer who spent years campaigning for the sanctions on Smotrich and Ben-Gvir — along with violent West Bank settlers — described Tuesday’s move as “historic.”\n“It means the wall of immunity that Israeli politicians had has been broken,” he said. “It’s unbelievable that it took so long for Western governments to sanction Israeli politicians, and the fact that it’s being done while Trump is president is quite amazing.”\nMack added: “It is a message to Netanyahu himself that he could be next.”\nIsrael captured the West Bank, along with east Jerusalem and the Gaza Strip, in the 1967 Mideast war. The Palestinians want all three territories for a future state.\nSuccessive Israeli governments have promoted settlement growth and construction stretching back decades. It has exploded under Netanyahu’s far-right coalition, which has settlers in key Cabinet posts.\nThere are now well over 100 settlements across the West Bank that house more than 500,000 settlers. The settlers have Israeli citizenship, while the territory’s 3 million Palestinians live under Israeli military rule, with the Palestinian Authority administering population centers.\nMost of the international community considers the settlements illegal, and Palestinians see them as the greatest obstacle to an eventual two-state solution, which is still seen internationally as the only way to resolve the conflict.\n___\nLawless reported from London. Associated Press writer Rob Gillies contributed from Toronto.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/israel-middle-east-violence-religion-0dcc4073d660003f4e3fa8d4ed0a9a6a",
      "text": "Radical rabbi’s followers rise in Israel amid new violence\nRadical rabbi’s followers rise in Israel amid new violence\nJERUSALEM (AP) — In the 1980s, Rabbi Meir Kahane’s violent anti-Arab ideology was considered so repugnant that Israel banned him from parliament and the U.S. listed his party as a terrorist group.\nToday, his disciples march through the streets by the hundreds, chanting “Death to Arabs” and assaulting any they come across. This week, they took part in a wave of communal violence in Jerusalem and mixed cities across Israel in which Arabs and Jews viciously attacked people and torched cars.\nOn Thursday evening, there was more ethnic strife. In Tel Aviv, two Jewish men attacked a journalist covering a gathering of ultranationalists. In the central Israeli city of Lod, a Jewish man was shot and seriously wounded by an Arab man. In Jaffa, an Israeli soldier was attacked by a group of Arabs and was hospitalized in serious condition.\nIsraelis shocked by the violence have cast the right-wing extremism as a nasty aberration or a reaction to Palestinian violence. But to Arab citizens, who make up 20% of Israel’s population, the heirs of Kahane are a natural outgrowth of a discriminatory system — normalized by some mainstream leaders who largely share their views.\nAdmirers of Kahane were elected to parliament in March as allies of Prime Minister Benjamin Netanyahu’s Likud party, and one of the most prominent has become a fixture on Israeli TV.\nTheir resurgence has injected another element of volatility to the conflict. It’s also part of a broader shift to the right in Israel, where Kahane’s disciples are hardly alone in adopting a hard line toward the Palestinians and trafficking in anti-Arab rhetoric.\nRight-wing parties that support Jewish settlements and oppose Palestinian independence won a large majority of seats in March, and Netanyahu and other right-wing leaders have often cast Israel’s Arab minority as a fifth column — unless they needed their votes.\nDuring his lone term in parliament in the mid-1980s, before he was banned, Kahane was shunned by colleagues, including the Likud, and frequently gave speeches to an empty chamber. His racist agenda called for banning intermarriage between Arabs and Jews, stripping Arabs of their Israeli citizenship, and the mass expulsions of Palestinians. At one point, he was suspended for waving a noose at an Arab lawmaker.\nKahane was banned from running in 1988, and two years later, he was assassinated by an Egyptian-American in New York. But his hate-filled ideology has remained influential in Israel.\nIn 1994, Kahane follower Baruch Goldstein opened fire in a holy site in the occupied West Bank city of Hebron, killing 29 Muslim worshippers and wounding over 100. That led both Israel and the U.S. to label his Kach movement and an offshoot, Kahane Lives, as terrorist groups.\nIn March, another admirer of the late rabbi, who for years had hung a picture of Goldstein on his living room wall, was elected to Israel’s parliament.\nItamar Ben-Gvir joined the Knesset as part of Religious Zionism, a bloc of far-right parties that came together at Netanyahu’s prodding so none would fall below the electoral threshold.\nSince then, Ben-Gvir has made frequent media appearances, displaying a cheerful demeanor and a knack for deflecting criticism as he banters with TV and radio hosts.\nIt’s working: Ifat, a research firm, says Ben-Gvir is the third most interviewed politician on Israeli TV and radio, behind Netanyahu and Naftali Bennett, another right-wing politician.\n“He’s a good speaker and he knows how to play the game,” said Shuki Friedman, an expert on Israel’s far right at the Israel Democracy Institute. “On one hand, he is addressing his supporters. ... On the other hand, he knows not to make mainstream Israelis too angry.”\nHe has staged provocative visits to Arab areas and been a near-constant presence on the sidelines of recent clashes, rallying ultranationalist supporters to confront Palestinians and assert “Jewish Power” — the name of his party.\nLast week, he set up an outdoor parliamentary “office” in an Arab neighborhood of east Jerusalem where Jewish settlers are trying to expel Palestinians from their homes, setting off a melee. He later called for police to use live fire against Palestinian protesters at the Al-Aqsa Mosque compound, a site sacred to Jews and Muslims.\nA long-range Hamas rocket, fired at Jerusalem on Monday, disrupted the Jerusalem Day parade, which celebrates Israel’s annexation of east Jerusalem.\nThe mob violence erupted the next day. A Telegram channel displaying the Kahanist emblem — a yellow fist inside a black Star of David — swelled from a few hundred members to more than 6,000.\nIt was used to organize a crowd in the Tel Aviv suburb of Bat Yam on Wednesday that pulled an Arab from his car and beat him severely. The attack horrified Israelis and was widely condemned, including by far-right politicians. Israeli media reported the country’s police chief blamed Ben-Gvir for inciting a Jewish “intifada,” the Arabic term used to refer to two Palestinian uprisings.\nAs a lawyer with a long history of defending Jewish extremists accused of attacking Arabs, Ben-Gvir has been careful not to run afoul of laws against incitement. He calls Kahane “righteous and holy,” but has tried to distance himself by saying he doesn’t agree with everything the rabbi said.\nBen-Gvir first became a national figure when he famously broke a hood ornament off then-Prime Minister Yitzhak Rabin’s car in 1995.\n“We got to his car, and we’ll get to him too,” he said, just weeks before Rabin was assassinated by a Jewish extremist opposed to his peace efforts with the Palestinians.\nIsrael has shifted even more to the right since then, driven by the failure of peace efforts, repeated rounds of violence and demographic shifts. Ben-Gvir’s supporters are largely religious and ultra-Orthodox Jews, who tend to have large families.\nNetanyahu hoped to tap into that by assembling a far-right bloc with Ben-Gvir and Bezalel Smotrich, another ultranationalist. Ironically, they foiled Netanyahu’s plan by blocking his outreach to a small Arab party needed to secure a parliamentary majority.\nDan Meridor, a former justice minister and Likud heavyweight who helped lead efforts to ban Kahane from parliament in 1988, believes Netanyahu made a grave error in rehabilitating his followers.\n“You can just see the dramatic and very harmful change the Likud went through when they legitimized the Kahanists,” he said. “It changed very tragically to me.”\nPalestinian citizens of Israel, on the other hand, view Ben-Gvir as the latest in a long line of Israeli politicians — including Netanyahu — who have treated them as second-class citizens, if not enemies of the state. It’s one of many grievances they point to in explaining the recent protests and clashes with police.\nDiana Buttu, a lawyer and analyst who is a Palestinian citizen of Israel, says it’s easy for Israelis to dismiss the Kahanists as a fringe group.\n“But if you step back and look at this country through the eyes of a Palestinian, you see that at every single political level, in every single political party, there’s been some form of anti-Palestinian racism.”\n—-\nAssociated Press writer Ilan Ben Zion in Jerusalem contributed."
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-gaza-war-returning-home-3845051eda5c3f481f5ed8783efc4cbf",
      "text": "Northern Gaza is shattered. The spirit of returning Palestinians is not\nWatch live from Rashid Street in Wadi Gaza as Palestinians return to northern Gaza.\nWADI GAZA, Gaza Strip (AP) — They walked for hours loaded with whatever clothes, food and blankets they could carry. Many smiled, some hugged loved ones they hadn’t seen for months. Hundreds of thousands of Palestinians filled Gaza’s main coastal road as they streamed back to homes in the north.\nThe mood was joyous, even though many knew their homes had been destroyed in Israeli offensives against Hamas that leveled large parts of Gaza City and the surrounding north.\nThe important thing was to go back, they said, to prevent what many had feared would be a permanent expulsion from their homes.\n“By returning, we are victorious,” said Rania Miqdad, who was heading back to Gaza City with her family.\nIsmail Abu Mattar returned with his wife and four children to the ruins of their Gaza City home, which was partially destroyed by Israeli bombardment early in the war. Like many others whose houses are damaged, he planned to set up a tent nearby and start clearing the rubble.\n“A tent here is better than a tent there,” he said, referring to the vast, squalid tent camps that arose in central and southern Gaza where he and much of the territory’s population have lived for months.\n“We had thought we wouldn’t return, like our ancestors,” said Abu Mattar. His grandparents were among the hundreds of thousands of Palestinians driven from what is now Israel during the 1948 war surrounding its creation.\nA mass return on foot and by car\nUnder the ceasefire deal between Israel and Hamas, Palestinians were allowed starting Monday to return north. U.N. officials estimated that some 200,000 people made their way back over the course of the day. The scenes of celebration were a sharp contrast to the misery and fear during the war as more than 1 million people fled south on the same routes to escape Israel’s assaults.\nAssociated Press photos, videos and drone footage showed huge crowds heading north on foot along Gaza’s main coastal road. On one side was the Mediterranean Sea; on the other stretched a landscape of destroyed buildings and bulldozed land left behind by withdrawing Israeli forces. Armed Hamas fighters were visible in some spots, a sign of the militant group’s continued power in Gaza despite Israel’s vows to eliminate it.\nFamilies carried bags of belongings and rolled up blankets. On their shoulders, men carried young children — or sacks of food and metal cannisters of cooking gas. Women balanced infants in their arms with satchels of clothes and jugs of water.\nA little girl dressed in teddy-bear pajamas held her younger sister’s hand as they trailed their mother. A teenager strapped a pet carrier to his chest with his cat inside.\nOthers returned in cars and trucks piled high with mattresses and other belongings via a second route, Salah al-Din Road.\nMany were smiling. A child waved a “V-for-victory” sign. People tearfully hugged relatives and friends they’d been separated from for months.\nOne old woman being pushed in a wheelchair sang a traditional Palestinian song of perseverance dating back to 1948.\n“Stand by each other, people of Palestine, stand by each other. Palestine is gone, but it has not bid you a final farewell,” she sang with a smile on her face. Then she added, “Thank God, we’re returning to our homes, after suffering so much ruin and hunger and disease.”\nThe joy was tempered by war’s cost and future’s uncertainty\nThose returning crossed through the Netzarim corridor, a swath of land bisecting the Gaza Strip that Israeli forces turned into a military zone to seal off the north. The north saw some of the most intense Israeli offensives, aimed at eliminating Hamas fighters operating in densely populated areas.\nThroughout the war, Israel repeatedly ordered civilians to evacuate the north – for their safety, it said – but barred their return. Under the ceasefire’s terms, Israeli troops pulled back from the main routes to allow returns and are eventually to pull out completely from the corridor.\nFor some, the joy of return was blemished by the deaths of loved ones.\nKamal Hamadah was returning to Gaza City, where his eldest son, his daughter and her children were killed by bombardment early in the war. Their bodies were left buried under rubble in the streets, even as the rest of the family fled south, he said.\nThen just over a month ago, another of his sons who fled with him was killed.\n“When his mother learned we were going back home, she was struck by a great sadness that she was returning without the boy,” he said.\nReturning home, Yasmin Abu Amshah had a happy reunion with her younger sister, Amany, who had stayed in Gaza City throughout the war. “I thought it wouldn’t happen, and we wouldn’t see each other again,” the 34-year-old mother of three said.\nHer four-story building was damaged but not destroyed, so she and other members of her extended family will stay there.\nThose returning face an uncertain future. If the ceasefire collapses, they could face new Israeli offensives. If peace lasts, it’s not clear when Palestinians will be able to rebuild homes, leaving much of the population in temporary housing.\nIbrahim Hammad, his wife and five children walked five hours back to their neighborhood in Gaza City – knowing their house there had been destroyed by an airstrike in December 2023. His family will stay at his brother’s house until he can clear a space in the ruins of his house to set up a tent.\n“We had to return, even to the rubble,” the 48-year-old told the AP. “Here we don’t have a house, but our family is here, and we will help each other.”\n___\nMagdy reported from Cairo. AP video journalist Mohammed Jahjouh in Wadi Gaza contributed to this report.\n——\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/middle-east-religion-jerusalem-prayer-dcbe5cf8313db3291df71e6e015cc0c8",
      "text": "Jewish prayers held discreetly at contested Jerusalem shrine\nJewish prayers held discreetly at contested Jerusalem shrine\nJERUSALEM (AP) — As police protected them, three Jewish men stepped forward, placed their hands out at chest level and began reciting prayers in low tones in the shadow of Jerusalem’s golden Dome of the Rock.\nJewish prayers at Jerusalem’s most sensitive holy site, known to Jews as the Temple Mount and to Muslims as the Noble Sanctuary, were once unthinkable. But they have quietly become the new norm in recent years, flying in the face of longstanding convention, straining a delicate status quo and raising fears that they could trigger a new wave of violence in the Middle East.\n“What is happening is a blatant and dangerous violation of the status quo,” said Sheikh Omar al-Kiswani, a top official with the Waqf, the Jordanian-backed Islamic trust that administers the site. “The Israeli police must stop providing protection to extremists.”\nThe hilltop compound is the holiest site for Jews, revered as the location of two ancient temples destroyed in antiquity. Three times a day for 2,000 years, Jews have turned to face it during prayers. It also is home to the Al-Aqsa Mosque, the third-holiest site in Islam.\nIsrael captured the hilltop, along with the rest of east Jerusalem and the walled Old City, in the 1967 Mideast war and later annexed it, a move that was not recognized by most of the international community. The Palestinians seek east Jerusalem as capital of a future independent state.\nThe flashpoint site is the emotional epicenter of the Israeli-Palestinian conflict. Many rounds of deadly fighting in the decades-long conflict have erupted around it. The most recent was in May, when an Israeli police crackdown on stone-throwing Palestinian protesters inside the mosque helped precipitate an 11-day war between Israel and Hamas in the Gaza Strip and violent upheaval in Israeli cities.\nSince 1967, a loose set of rules known as the “status quo” have governed day-to-day operations at the site. Any actual or perceived changes to the status quo has the potential to ignite violence.\nFor decades, Jews avoided worship at the site for religious reasons. Many leading rabbis, including the country’s Chief Rabbinate, ruled after the 1967 war that Jews “should not enter the entire area of the Temple Mount” out of concern for ritual impurity and uncertainty over the exact location of the ancient Temple’s holy of holies.\nBut attitudes are changing, particularly among Israel’s hard-line, religious nationalist right wing.\nAmnon Ramon, a senior researcher at the Jerusalem Center for Policy Research, said the issue of Jewish prayer has transformed in recent decades “from a matter that was on the fringe to a subject in the mainstream for the religious nationalist public.” Most in that community appears to support some degree of Jewish worship there, as do a growing number of ultra-Orthodox Jews.\nNew Prime Minister Naftali Bennett, who leads a small, hard-line religious party, caused an uproar last month on the Jewish fast day of Tisha B’Av when he said Israel was committed to protecting “freedom of worship” for Jews at the compound. His office quickly issued a clarification stating there was “no change whatsoever” in the status quo.\nRabbi Eliyahu Vebr, head of the Temple Mount Yeshiva, said that for over a year, he has entered the site daily, most of the time with at least 10 Jewish men necessary for a group prayer.\n“So long as things are not conspicuous, in a way that disturbs, the police allow it,” he said. Some days there is friction with Muslim worshippers and authorities, he said, but mostly there isn’t. Palestinian media, including those of the Islamist militant group Hamas, publish videos almost daily of “Jewish settlers storming the Al-Aqsa Mosque.”\nFlanked by a detachment of paramilitary Border Police troopers, a quorum of 10 men entered the shrine on a recent morning and made their way to a secluded area of the eastern side of the compound. They prayed discreetly in hushed tones while a handful of guards from the Waqf watched from a distance.\nKiswani, who is the Waqf’s director of the Al-Aqsa Mosque, said Muslim authorities have strongly protested the Jewish prayers, both to Israeli police and to the Jordanian government.\nBut he said Israeli police forcibly prevent Waqf personnel from approaching Jewish worshippers and in some cases, arrest or expel them. “The mosque is a pure right for Muslims alone, and there is no prayer in the mosque except for Muslims,” he said.\nIsraeli police said its forces operate “in accordance with the terms of visitation customary at the site,” while maintaining public order. It said the regulations for visitors are determined by the government and court decisions.\nAkiva Ariel, a spokesman for Beyadenu, a Jewish activist group advocating for Jewish prayer at the site, said things began to change under the government of former Prime Minister Benjamin Netanyahu, who led the country for 12 years before he was ousted in May.\n“The police turn a blind eye” to the worship, so long as it’s done inconspicuously, Ariel said. During the recent visit, the men conducted the ancient blessing, in which priests make V’s with each hand, spreading their ring and middle fingers, and quietly recited a special benediction, while others performed surreptitious bows while praying. But they did not don prayer shawls or phylacteries — small cases holding slips inscribed with passages of Scripture bound to the head and arm— that are customarily worn during morning prayers.\nFor many Jewish Temple Mount activists, the main aim is a place for Jewish worship at the site, Ariel said. “This is our holiest place. We aren’t demanding that Muslim be evicted from here, heaven forbid,” he said.\nPalestinians have long feared that Israel may change routines at the Al-Aqsa Mosque compound, such as partitioning the site, similar to a holy site in Hebron revered by Muslims as the Ibrahimi Mosque and by Jews as the Tomb of the Patriarchs.\nRamon said that Palestinians fear that if they give an inch, Israel may take a mile.\n“It’s hard to know how and when it will explode,” he said. “But it definitely can happen.”"
    },
    {
      "url": "https://apnews.com/article/netherlands-israel-gaza-entry-ban-ministers-a5351f28ce17fb79a5800d21bbfb6f12",
      "text": "Netherlands bans far-right Israeli ministers as EU considers sanctions over Gaza\nTHE HAGUE, Netherlands (AP) — The Netherlands has banned two far-right Israeli ministers from entering the country and the European Union has proposed suspending Israel from a lucrative tech investment program as frustration mounts over worsening conditions in Gaza.\nThe ban targets hard-line National Security Minister Itamar Ben-Gvir and Finance Minister Bezalel Smotrich, key partners in Prime Minister Benjamin Netanyahu’s coalition.\nIt was announced in a letter sent late Monday by Dutch Foreign Minister Caspar Veldkamp to lawmakers along with other measures, declaring “The war in Gaza must stop.”\nThe pair are champions of the Israeli settlement movement that supports continuing the war in Gaza, facilitating what they call the voluntary emigration of its Palestinian population and building Jewish settlements.\nBritain, Australia, Canada, New Zealand and Norway imposed financial sanctions on the two men last month.\nEU considers sanctions on Israel’s science and tech access\nThe European Commission on Monday proposed partially suspending Israel’s access to a lucrative science and technology program.\nThe European Parliament could call a vote to cut off Israel’s access to the investment arm of the European Innovation Council. To pass, the vote would need 55% of the bloc’s 27-member nations.\nThe €900 million investment program is focused on small businesses and “disruptive innovations” that have “potential dual-use applications, such as in cybersecurity, drones, and artificial intelligence,” the commission said in a statement.\nIt said the partial suspension of Israeli companies from applying for grants or equity investments worth €200 million annually is a targeted and reversible action and keeps intact Israel’s access to roughly two-thirds of the program that is for civilian use.\nThe commission found Israel’s military campaign in Gaza breached terms of a bilateral deal between Brussels and Israel known as an Association Agreement, according to senior officials tasked with communicating for the commission who were not authorized to speak publicly.\nEuropean countries pressure Israel to let in more aid\nEurope has widely soured on Israel over Gaza. Countries including Ireland, Spain and the Netherlands have sought to aggressively pressure Israel to let in more aid and cease military operations.\nIsrael has yet to reach the six points agreed in a new aid deal with the EU, which include adequate amounts of daily trucks allowed or newly opened border crossings, according to senior officials. EU aid teams have been prevented from entering Gaza despite recent humanitarian pauses.\nThe suspension is one of 10 options presented by the commission to member states. Other steps could be suspending an aviation agreement, blocking imports from settlements and curtailing travel for Israelis in the visa-free zone known as Schengen, according to a leaked document seen by The Associated Press and verified by two EU diplomats.\nLike the Netherlands, other nations could act on their own to sanction specific companies or individuals in Israel or the occupied West Bank.\nPressure has been mounting on the Dutch government, which is gearing up for elections in October, to change course on Israeli policy. Last week, thousands demonstrated at train stations across the country, carrying pots and pans to signify the food shortage in Gaza.\nThe government also will summon the Israeli ambassador to the Netherlands to urge Netanyahu to change course and “immediately take measures that lead to a substantial and rapid improvement in the humanitarian situation throughout the Gaza Strip,” Veldkamp wrote.\nBen-Gvir and Smotrich remained defiant. In a statement on social media, Smotrich said European leaders were surrendering to “the lies of radical Islam” and Jews may not be able to live safely in Europe in the future.\nBen-Gvir said in Europe “a Jewish minister from Israel is unwanted, terrorists are free, and Jews are boycotted,” but he will continue to act.\nIsrael says Hamas is the reason aid isn’t reaching Gaza\nAfter international pressure, Israel over the weekend announced humanitarian pauses, airdrops and other measures meant to allow more aid to Gaza, but Palestinians say little or nothing has changed on the ground. The U.N. has described it as a one-week scale-up of aid and Israel has not said how long the latest measures would last.\nIsrael asserts Hamas is the reason aid isn’t reaching Palestinians in Gaza and accuses its militants of siphoning aid to support its rule in the territory. The U.N. denies aid looting is systematic and says it lessens or ends entirely when enough aid is allowed to enter Gaza.\nNetanyahu and his former defense minister, Yoav Gallant, are wanted by the International Criminal Court over allegations of crimes against humanity. They are accused of using “starvation as a method of warfare” by restricting humanitarian aid and of intentionally targeting civilians in Israel’s campaign against Hamas in Gaza. Member states of the ICC are obliged to arrest the men if they arrive on their territory.\n___\nMcNeil reported from Brussels. Melanie Lidman in Tel Aviv contributed to this report."
    },
    {
      "url": "https://apnews.com/article/sinead-oconnor-itamar-bengvir-jerusalem-concert-e08c0903f413e8fb56663cf2adb0c0ef",
      "text": "His campaign forced Sinead O’Connor to scrap a 1997 Jerusalem concert. Now he is a Cabinet minister\nHis campaign forced Sinead O’Connor to scrap a 1997 Jerusalem concert. Now he is a Cabinet minister\nJERUSALEM (AP) — Death threats forced Irish pop singer Sinead O’Connor to call off a peace concert in Jerusalem in the summer of 1997. At the time, a young man named Itamar Ben-Gvir took credit for the campaign against her.\nToday, he is Israel’s national security minister.\nThe transformation of Ben-Gvir from a fringe Israeli extremist trying to take down O’Connor’s coexistence-themed concert to a powerful minster overseeing the Israeli police force reflects the dramatic rise of Israel’s far-right.\nO’Connor, a spirited singer and frequent source of controversy who rocketed to fame in 1990, died on Wednesday in London. While most people remember the star for her hit cover of Prince’s ballad “Nothing Compares 2 U” or the uproar that followed her ripping up a photo of Pope John Paul II on live TV, many Israelis on Thursday recounted an open letter she wrote castigating Ben-Gvir.\nIncensed after hearing Ben-Gvir, who was then 21, boast in a radio interview that he had succeeded in scaring her away from Jerusalem, she sent the letter to The Associated Press and other news organizations.\n“God does not reward those who bring terror to children of the world,” O’Connor wrote in a message addressing Ben-Gvir. “So you have succeeded in nothing but your soul’s failure.”\nOn June 16, 1997, O’Connor — worried for her safety and her children — backed out of the concert organized by Israeli and Palestinian women’s groups that had sought to promote Jerusalem as a capital for both people. Named “Sharing Jerusalem: Two Capitals for Two States,” the event was set to take place just a few years after the signing of the Oslo Accords, which created the foundation for the Mideast peace process.\nPeace in the Holy Land was as controversial then as it is now, and hard-liners like Ben-Gvir oppose any division of Jerusalem. The Palestinians claim east Jerusalem, captured by Israel in 1967, as their capital.\nAhead of her summer concert, British and Irish embassies in Tel Aviv reported receiving death threats against O’Connor. After her cancellation, fans and fellow peace activists expressed anger, surprise and dismay — some sealing their lips with black tape and protesting in the streets against Ben-Gvir and his allies.\nBack in 1997, Ben-Gvir was an activist in the Ideological Front, an offshoot of the racist Kahanist movement. Rabbi Meir Kahane’s violent anti-Arab ideology was considered so repugnant in the 1980s that Israel banned him from parliament and the United States listed his party as a terrorist group.\nWhile Ben-Gvir did not take responsibility for threatening O’Connor, he told Israeli radio that his efforts had compelled her to drop out.\n“Due to us she is not arriving,″ he said at the time. ″We are calling the pressure we put on her not to arrive a success.”\nOn Thursday, as Israeli media remembered Ben-Gvir’s campaign against O’Connor, his office denied that he had ever threatened her.\n“Indeed, Minister Ben-Gvir said he would protest against the show,” his office acknowledged. “The show was canceled due to the work of thousands of demonstrators.”\nHis office also noted that despite his criticism of O’Connor’s conversion to Islam and support for Palestinians, he would try to remember her “favorably because of the difficult life she lived.”\nPrime Minister Benjamin Netanyahu’s government — in which Ben-Gvir is a leading member — is the most right-wing and religiously conservative in Israeli history.\nThis week, the coalition passed the first part of its deeply contentious program to weaken the Supreme Court, a plan that has prompted mass street protests and plunged the country into its worst domestic crisis in years.\nOn Thursday, Ben-Gvir visited Jerusalem’s most sensitive holy site — a contested hilltop compound revered by both Jews and Muslims. The visit, while permitted under longstanding arrangements, was seen by Palestinians and Muslim countries as a provocation given Ben-Gvir’s history.\nBen-Gvir, now 47, was convicted in his youth of inciting racism against Arabs and barred from serving in the Israeli army because he was considered too extremist. Until recently, he hung a portrait in his home of an Israeli gunman who killed 29 Palestinians in a West Bank mosque in 1994.\nAs national security minister, Ben-Gvir has repeatedly sparked backlash over his anti-Arab rhetoric and stunts. He has pushed for the creation of a national guard that critics fear could endanger Israel’s Palestinian minority, toughened measures against Palestinian prisoners and ramped up home demolitions in the contested capital.\nO’Connor’s relationship to Israel only become more fraught following the botched concert. She became a supporter of the Palestinian-led campaign that calls for boycotts, divestment and sanctions against Israeli businesses, cultural institutions and universities. After the 2014 Gaza war, O’Connor heeded the campaign’s calls to pull out of a concert near Tel Aviv.\nBut the cancellation of her 1997 Jerusalem concert was remembered the most in Israel — a country in turmoil as Netanyahu and Ben-Gvir press ahead with their divisive, far-right agenda.\nIn her open letter to Ben-Gvir, O’Connor described being haunted by televised images of Israelis and Palestinians beating each other in the streets of the holy city of Jerusalem.\n“I felt saddened and frightened,” she wrote. “I asked God then ‘How can there be peace anywhere on earth if there is not peace in Jerusalem?’”\nShe then added: “I ask you that question now Mr. Ben Gvir.”"
    },
    {
      "url": "https://apnews.com/article/israel-palestinian-prisoner-release-hamas-ceasefire-hostage-3a20774bb4b519e852273ec559687b3b",
      "text": "Who are the Palestinian prisoners released in exchange for Israeli hostages?\nWho are the Palestinian prisoners released in exchange for Israeli hostages?\nJERUSALEM (AP) — Israel released about 600 prisoners overnight, including the longest-serving prisoner and a man convicted of killing an American peace activist, in the latest exchange for Israeli hostages held by Hamas.\nThey were supposed to have been released last weekend after Hamas freed six living hostages. But Israel delayed the release to protest Hamas’ practice of parading the captives before crowds during handovers. Hamas handed over the remains of four hostages overnight without any public display.\nIsrael released the 600 prisoners, but the Palestinian prisoners club, a group representing current and former prisoners, said Israel held back the release of 24 Palestinians detained in Gaza after the Hamas attack on Oct. 7, 2023 that sparked the war. They include 23 teenagers and men aged 15 to 19 and a woman who is 35. The group were set to be released later on Thursday, along with 22 more minors and one woman whose names were subsequently added to the list.\nIsrael views the prisoners as terrorists. Palestinians often see them as freedom fighters resisting a decades-long Israeli military occupation.\nNearly every Palestinian has a friend or family member who has been jailed by Israel for militant attacks or lesser offenses such as rock-throwing. Most are convicted in military trials that rights advocates say often lack due process. Some are incarcerated for months or years without trial in what is known as administrative detention. Israel says it’s needed to prevent attacks and avoid sharing sensitive intelligence.\nAmong those being released overnight into Thursday, 151 had been sentenced to life or long sentences for involvement in deadly attacks against Israelis. Forty-three were to be returned to the occupied West Bank and east Jerusalem, while 97 were to be sent into exile.\nAround 500 others had been detained in Gaza after Hamas’ attack on Oct. 7, 2023, which sparked the war.\nIsraeli forces have arrested hundreds of people in Gaza and held them without trial. As part of the ceasefire, Israel committed to releasing more than 1,000 detainees who hadn’t participated in the Oct. 7 attack.\nA look at some prominent prisoners released since the truce took effect on Jan. 19:\nNael Barghouti, 68\nBarghouti, 68, from the West Bank village of Kobar, has spent over 45 years in Israeli prison and was serving a life sentence. Guinness World Records has called him the world’s longest-serving political prisoner. Israel says he is affiliated with Hamas.\nFirst arrested in 1978 for his role in an attack that killed an Israeli bus driver, he was among more than 1,000 prisoners released in 2011 in exchange for an Israeli soldier held by Hamas in Gaza. Israel re-arrested Barghouti in 2014 and says his offenses include intentional manslaughter, membership in an illegal organization, producing a bomb, possessing explosives and conspiracy. He will be deported.\nBilal Abu Ghanem, 31\nGhanem, 31, from east Jerusalem, was serving three life sentences and 60 years for a bus attack in 2015 that killed three Israelis. One of those killed was Richard Lakin, an American educator who marched for civil rights and coexistence between Muslims and Jews.\nGhanem, who Israel says is affiliated with Hamas, will be deported. Israel says his offenses include intentional manslaughter, membership in an illegal organization, building a bomb, possession of explosives and conspiracy to commit a crime.\nAmmar Al-Ziben, 50\nAl-Ziben, 50, is from Nablus, in the West Bank. He was sentenced to 27 life terms for planning a bombing in a Jerusalem market in 1997 that killed 16 people, including a U.S. citizen.\nIsrael says he is affiliated with Hamas and his offenses include possession of firearms, incitement, forgery, throwing firebombs and attempted murder. He will be deported.\nAhmed Barghouti, 48\nHe is a close aide of militant leader and political figure Marwan Barghouti, who is still imprisoned. The two aren’t closely related.\nAhmed Barghouti was given 13 life sentences for dispatching assailants to carry out attacks that killed Israeli civilians during the second intifada, or Palestinian uprising, in the early 2000s. As a commander in Al-Aqsa Martyrs’ Brigades, an armed offshoot of the secular Fatah Party, he was also convicted of possession of firearms and attempted murder.\nHe was sent to Egypt.\nThe Sarahneh brothers\nThree brothers from east Jerusalem were released after more than 22 years in prison for their involvement in suicide bombings that killed Israelis during the second intifada. Israeli authorities brought Ibrahim, 55, and Musa, 63, to their homes in the West Bank.\nThe third brother, Khalil, 45, who was convicted of attempted murder and sentenced to life in 2002, was sent to Egypt.\nIbrahim Sarahneh’s Ukrainian wife, Irena, had been sentenced to life in prison in 2002 for organizing with her husband a suicide bombing that killed two people in the Israeli city of Rishon Lezion. She was released in 2011 as part of a swap for Gilad Shalit, an Israeli soldier captured by Hamas.\nThe Aweis brothers\nHassan Aweis, 47, and Abdel Karim Aweis, 54, from the occupied West Bank, were released on Saturday after nearly 23 years in prison.\nHassan Aweis was sentenced to life in 2002 on charges of voluntary manslaughter, planting an explosive device and attempted murder. He was involved in planning attacks during the second intifada for the Al-Aqsa Martyrs’ Brigade.\nAbdel Karim Aweis — sentenced to the equivalent of six life sentences for throwing an explosive device, attempted murder and assault, among other charges — was transferred to Egypt.\nIyad Abu Shakhdam, 49\nAbu Shakhdam was sentenced to the equivalent of 18 life sentences over his involvement in Hamas attacks that killed dozens of Israelis during the second intifada. They included a suicide bombing that blew up two buses in Beersheba in 2004, killing 16 Israelis, including a 4-year-old.\nAbu Shakhdam was arrested in the West Bank in 2004 following a gunfight with Israeli security forces in which he was shot 10 times.\nDuring 21 years in prison, his family said, he finished high school and earned a certificate for psychology courses. He was released on Feb. 8.\nJamal al-Tawil, 61\nAl-Tawil, a prominent Hamas politician in the occupied West Bank, spent nearly two decades in and out of Israeli prisons, in part over allegations that he helped plot suicide bombings.\nMost recently, the Israeli military arrested al-Tawil in 2021, saying he had participated in riots and mobilized Hamas political activists in Ramallah, the seat of the semiautonomous Palestinian Authority, Hamas’ main rival. He was held without charge or trial.\nToo weak to walk, al-Tawil was taken to a hospital after his release in Ramallah on Feb. 8.\nMohammed el-Halabi, 47\nThe Palestinian manager of the Gaza branch of World Vision, a Christian aid organization, was arrested in 2016 and accused of diverting tens of millions of dollars to Hamas in a case that drew criticism from rights groups. He was freed on Feb. 1.\nEl-Halabi and World Vision denied the allegations and independent investigations found no proof of wrongdoing.\nZakaria Zubeidi, 49\nA prominent militant leader in the Al-Aqsa Martyrs’ Brigade during the second intifada, Zubeidi later became a theater director in the Jenin refugee camp, where he promoted what he described as cultural resistance to Israel.\nHis jailbreak in 2021 — when he and five others used spoons to tunnel out of one of Israel’s most secure prisons and remained at large for days before being caught — thrilled Palestinians and stunned the Israeli security establishment.\nIn 2019, after Zubeidi had served years in prison for attacks in the early 2000s, Israel arrested him again, accusing him of being involved in shooting attacks that targeted buses of Israeli settlers but caused no injuries.\nZubeidi had been awaiting trial when he was sentenced to five years in prison for his jailbreak. He was released on Jan. 30 into the West Bank.\nMohammed Odeh, 52, Wael Qassim, 54, and Wissam Abbasi, 48\nThey hail from east Jerusalem and rose within the ranks of Hamas. Held responsible for deadly attacks during the second intifada, they were handed multiple life sentences in 2002.\nThey were accused of plotting a suicide bombing at a pool hall near Tel Aviv in 2002 that killed 15 people. Later that year, they were found to have orchestrated a bombing at Hebrew University that killed nine people, including five American students.\nAll were transferred to Egypt on Jan. 25.\nMohammad al-Tous, 67\nAl-Tous held the title of longest continuously held prisoner in Israel until his release on Jan. 25, Palestinian authorities said.\nFirst arrested in 1985 while fighting Israeli forces along the Jordanian border, the Fatah party activist spent a total of 39 years behind bars. Originally from the West Bank, he was sent into exile.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-01-16-2024-dc0ef64dd52db395c5a54328518e8efd",
      "text": "Netanyahu says deal to release hostages held in Gaza has been reached after last minute snags\nNetanyahu says deal to release hostages held in Gaza has been reached after last minute snags\nTEL AVIV, Israel (AP) — Prime Minister Benjamin Netanyahu said Friday a deal to return hostages held in the Gaza Strip has been reached, after his office said earlier there were last minute snags in finalizing a ceasefire that would pause 15 months of war.\nNetanyahu said he would convene his security Cabinet later Friday, and then the government to approve the long-awaited hostage deal.\nNetanyahu’s pre-dawn statement appeared to clear the way for Israeli approval of the deal, which would pause the fighting in the Gaza Strip and see dozens of hostages held by militants in Gaza released in exchange for Palestinian prisoners held by Israel. The deal would also allow hundreds of thousands of displaced Palestinians to return to the remains of their homes in Gaza.\nIsraeli airstrikes, meanwhile, killed at least 72 people in the war-ravaged territory on Thursday.\nNetanyahu said he had instructed a special task force to prepare to receive the hostages returning from Gaza, and that their families were informed the deal had been reached.\nIsrael had delayed a vote Thursday on the ceasefire, blaming a last-minute dispute with Hamas for holding up approval as rising tensions in Netanyahu’s government coalition raised concerns about the implementation of the deal just a day after U.S. President Joe Biden and key mediator Qatar announced it was complete.\nNetanyahu’s office had accused Hamas of reneging on parts of the agreement in an attempt to gain further concessions. In a briefing Thursday, David Mencer, an Israeli government spokesman, said Hamas’ new demands dealt with the deployment of Israeli forces in the Philadelphi corridor, the narrow strip bordering Egypt that Israeli troops seized in May.\nHamas denied the claims, with Izzat al-Rishq, a senior Hamas official, saying the militant group “is committed to the ceasefire agreement, which was announced by the mediators.”\nThe ceasefire agreement has drawn fierce resistance from Netanyahu’s far-right coalition partners, which the Israeli prime minister depends on to remain in power. On Thursday, Israel’s hard-line national security minister, Itamar Ben-Gvir, threatened to quit the government if Israel approved the ceasefire. There was no immediate comment from Ben-Gvir following Netanyahu’s announcement Friday.\nAP correspondent Karen Chammas reports on last minute issues with an Israel-Hamas ceasefire deal.\nEgyptian Foreign Minister Badr Abdelatty called on Israel and Hamas to implement a Gaza ceasefire plan “without any delay” in an exclusive interview Thursday with The Associated Press. Egypt has been a key mediator between the enemies for years and a leading player in ongoing ceasefire negotiations.\nThe deal announced Wednesday would pause the fighting with a view to eventually winding down a 15-month war that has destabilized the Middle East and sparked worldwide protests.\nHamas triggered the war with its Oct. 7, 2023, cross-border attack into Israel that killed some 1,200 people and took 250 others hostage.\nIsrael responded with a devastating offensive that has killed over 46,000 Palestinians, according to local health officials, who do not distinguish between civilians and militants but say women and children make up more than half of those killed.\nThe military campaign has leveled vast swaths of Gaza, and pushed about 90% of Gaza’s population of 2.3 million from their homes. Hundreds of thousands are struggling with hunger and disease in squalid tent camps on the coast.\nNetanyahu faces heavy internal pressure\nThe Israeli prime minister has faced great domestic pressure to bring home the hostages, whose families have pleaded with Netanyahu to prioritize the release of their loved ones over politics.\nBut Israeli divisions over the deal were on stark display Thursday, as Ben-Gvir threatened to resign, saying the ceasefire was “reckless” and would “destroy all of Israel’s achievements.”\nThe departure of Ben-Gvir’s Jewish Power party would reduce the number of the ruling coalition’s seats in the Israeli parliament, or Knesset, from 68 to 62 — leaving Netanyahu’s government with just the slimmest of majorities. Ben-Gvir said his party would return to the coalition if Israel resumes its war.\nBen-Gvir’s resignation would not bring down the government or derail the ceasefire deal. But the move would destabilize the government at a delicate moment and could lead to its collapse if Ben-Gvir were joined by other key Netanyahu allies.\nFinance Minister Bezalel Smotrich, for instance, is vehemently opposed to the agreement and has demanded that Netanyahu promise to resume the war against Hamas after the first phase of the ceasefire as a condition of his party staying in the coalition.\nA night of heavy Israeli strikes\nPalestinians in Gaza reported heavy Israeli bombardment Thursday. In previous conflicts, both sides have stepped up military operations in the final hours before ceasefires as a way to project strength.\n“We were expecting that the (Israeli) occupation would intensify the bombing, like they did every time there were reports of progress in truce talks,” said Mohammed Mahdi, who was sheltering in Gaza City.\nGaza’s Health Ministry said the toll of 72 from Thursday’s strikes only included bodies brought to two hospitals in Gaza City and the the number killed was likely higher.\n“Yesterday was a bloody day, and today is bloodier,” said Zaher al-Wahedi, a Health Ministry official.\nThe Israeli military said it had struck approximately 50 militant targets across the Gaza Strip over the past day, including weapons storage facilities and rocket launch sites.\nAnxiety spread across Gaza on Thursday with the news of last-minute quarreling between Hamas and Israeli officials.\n“We ask our brothers in Hamas to communicate with mediators to end the war,” said Omar Jendiya, in Deir al-Balah. “Enough with the destruction and killing.”\nA phased withdrawal and hostage release with potential pitfalls\nUnder the deal reached Wednesday, 33 of some 100 hostages who remain in Gaza are set to be released over the next six weeks in exchange for hundreds of Palestinians imprisoned by Israel. Israeli forces will pull back from many areas, hundreds of thousands of Palestinians would be able to return to what’s left of their homes, and there would be a surge of humanitarian assistance.\nThe remainder of the hostages, including male soldiers, are to be released in a second — and much more difficult — phase that will be negotiated during the first. Hamas has said it will not release the remaining captives without a lasting ceasefire and a full Israeli withdrawal, while Israel has vowed to keep fighting until it dismantles the group and to maintain open-ended security control over the territory.\nCeasefire leaves questions about Gaza’s future unanswered\nU.S. President-elect Donald Trump’s Mideast envoy joined the talks in the final weeks, and both the outgoing administration and Trump’s team took credit for the breakthrough.\nLonger-term questions about postwar Gaza remain, including who will rule the territory or oversee the daunting task of reconstruction.\nIsrael has come under heavy international criticism, including from its closest ally, the United States, over the civilian toll in Gaza. It also blames Hamas for the civilian casualties, accusing it of using schools, hospitals and residential areas for military purposes.\nHamas has come under overwhelming pressure from Israel’s invasion of Gaza’s largest cities and towns and seizure of the border between Gaza and Egypt. Its top leaders, including Yahya Sinwar, who was believed to have helped mastermind the 2023 attack, have been killed.\nBut its fighters have regrouped in some of the hardest-hit areas after the withdrawal of Israeli forces, raising the prospect of a prolonged insurgency if the war continues.\n___\nShurafa reported from Deir al-Balah, Gaza Strip, and Magdy from Cairo. Associated Press reporter Melanie Lidman in Tel Aviv, Israel, contributed.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-hamas-war-ceasefire-hostages-netanyahu-ff48f081b069e484955a72bc68261364",
      "text": "Why did Netanyahu end the Gaza ceasefire?\nWhy did Netanyahu end the Gaza ceasefire?\nThe wave of Israeli strikes that killed hundreds of Palestinians across the Gaza Strip early Tuesday was the culmination of Prime Minister Benjamin Netanyahu’s efforts to get out of the ceasefire with Hamas that he agreed to in January.\nSince the start of the war, Netanyahu has faced dueling, possibly incompatible pressures: Families of the hostages want him to cut a deal with Hamas to free them, while his far-right coalition partners want to continue the war with the aim of annihilating the militant group.\nOn Tuesday, he appeared to cast his lot with the latter — and U.S. President Donald Trump’s administration has backed Netanyahu’s decision to unilaterally walk away from the ceasefire it took credit for brokering.\nBoth Israel and the United States blame the renewed hostilities on Hamas’ refusal to release more hostages before negotiations on ending the war proceed — which was not part of the ceasefire agreement. Israel has accused Hamas of preparing for new attacks, without providing evidence. The militant group has denied those allegations.\nHamas — which has yet to respond militarily to the Israeli strikes — has spent weeks calling for serious talks on the ceasefire agreement’s second phase, which calls for the release of the remaining living hostages in exchange for more Palestinian prisoners, a full Israeli withdrawal from Gaza and a lasting ceasefire.\nThose talks were supposed to begin in early February. Now they may never happen.\nWhat did the ceasefire agreement say?\nThe agreement reached in January, under pressure from the outgoing Biden administration and the incoming Trump one, called for a phased ceasefire aimed at freeing all the hostages abducted in Hamas’ Oct 7, 2023, attack and ending the war it caused.\nUnder the first phase, which ran from Jan. 19 to March 1, Hamas released 25 Israeli hostages and the bodies of eight others in return for nearly 1,800 Palestinian prisoners, including senior militants serving life sentences for deadly attacks. Israeli forces pulled back to a buffer zone, hundreds of thousands of Palestinians returned to what remained of their homes, and there was a surge of humanitarian aid.\nEach side accused the other of violations, and Israeli strikes killed dozens of Palestinians the military accused of engaging in militant activities or entering no-go zones. But the truce held.\nStill, the second phase was always seen as far more difficult.\nThrough months of negotiations, Netanyahu had repeatedly cast doubt on it, insisting Israel was committed to returning all the hostages and destroying Hamas’ military and governing capabilities — two war goals that many believe are irreconcilable.\nIn a TV interview last June, Netanyahu cast doubt on the possibility of a lasting ceasefire before Hamas is destroyed. “We are committed to continuing the war after a pause, in order to complete the goal of eliminating Hamas. I’m not willing to give up on that,” he said.\nOn Jan. 18, the eve of the ceasefire, he said “we reserve the right to return to war if necessary with the backing of the United States.”\nWhy did Netanyahu back out of the ceasefire?\nAgreeing to a permanent ceasefire would almost certainly plunge Netanyahu into a political crisis that could end his nearly uninterrupted 15-year rule.\nFar-right Finance Minister Bezalel Smotrich had threatened to leave the coalition if Netanyahu progressed to Phase 2 instead of restarting the offensive. Opposition parties have promised to support him in any agreement that brings back hostages, but his coalition would still be severely weakened, making early elections likely.\nBy resuming the fighting, Netanyahu ensured Smotrich’s continued support. After the strikes, the Israeli leader regained another far-right partner, Itamar Ben-Gvir, whose party had bolted in January over the ceasefire but returned to the coalition Tuesday.\nBeyond the political jockeying, Netanyahu’s stated goal of annihilating Hamas would have almost certainly eluded him had he stuck with the ceasefire agreement.\nHamas survived 15 months of Israeli bombardment and ground operations that killed over 48,000 Palestinians, according to local health officials, and destroyed much of Gaza. When the truce took hold, the militant group immediately reasserted its rule.\nThere’s no agreement on who should govern Gaza after the war, and even if the Western-backed Palestinian Authority were granted nominal control, Hamas would have strong influence on the ground and could rebuild its military capabilities.\nFor many Israelis, especially Netanyahu’s hawkish base and far-right allies, that would look like defeat. It would add to the criticism he already faces over security failures surrounding the Oct. 7 attack, in which Hamas-led militants killed some 1,200 people, mostly civilians, and abducted 251.\nHow did Netanyahu end the truce?\nAfter the first phase ended, Netanyahu said Israel had agreed to what he described as a new U.S. proposal in which Hamas would release half the remaining hostages in return for a seven-week extension of the truce and a vague promise to launch negotiations over a lasting ceasefire.\nHamas refused, pointing out that the new proposal was different from the one they had agreed to in January and again called for the immediate launch of talks on Phase 2.\nIt even offered to return an America-Israeli and the bodies of four other hostages to get the talks back on track, an offer dismissed as “psychological warfare” by Israel. Trump’s Mideast envoy, Steve Witkoff, said Hamas was claiming flexibility in public while making “entirely impractical” demands.\nIn an attempt to impose the new arrangement on Hamas, Israel halted the import of all food, fuel and other humanitarian aid to Gaza. It later cut off electricity, affecting a vital desalination plant. Israel also said it would not withdraw from a strategic corridor on Gaza’s border with Egypt, as stipulated in the agreement.\nIn recent days, Israel stepped up strikes across Gaza, targeting people it said were planting explosives or engaging in other militant activities. On Tuesday, at around 2 a.m., it launched one of the deadliest waves of strikes since the start of the war.\nWhat has Trump said about the ceasefire?\nTrump took credit for brokering the ceasefire in January, but since then has appeared to sour on it. He has warned that “all hell” will break loose if Hamas does not immediately release the hostages, while saying that’s a decision for Israel to make.\nTrump has also proposed that Gaza’s roughly 2 million Palestinians be permanently relocated so the U.S. can take ownership of Gaza and develop it as a tourist destination. Netanyahu has embraced the plan, which has been universally condemned by Palestinians, Arab countries and human rights experts, who say it would violate international law.\nThe White House said it was consulted ahead of Tuesday’s strikes and supported Israel’s decision.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/israel-gaza-hamas-hostages-ceasefire-ad6b3d9fe8077c7c012437e86b5af187",
      "text": "Who are the hostages released by Hamas?\nWho are the hostages released by Hamas?\nJERUSALEM (AP) — Hamas handed over the remains of four more Israeli hostages early Thursday in exchange for hundreds of Palestinian prisoners as part of the ceasefire in the Gaza Strip.\nThey are the last four to be released during the first phase of the truce, which is set to end Saturday. Israel and Hamas have yet to negotiate the next phase, and dozens of hostages are still held in Gaza.\nHamas transferred the four bodies to the Red Cross early Thursday and they were brought back to Israel for forensic testing. Prime Minister Benjamin Netanyahu’s office confirmed their identities and said that three of the four hostages were killed in captivity, without elaborating. The fourth was killed on Oct. 7, 2023, and Hamas militants kidnapped the body, Netanyahu’s office said.\nUnder the first phase of the truce, 25 Israeli hostages and the remains of eight others were handed over in exchange for almost 2,000 Palestinian prisoners held by Israel. Five Thai citizens abducted while working in Israel on the day of the attack were freed last month in a separate deal.\nHamas-led militants took 251 hostages during their Oct. 7, 2023, attack that launched the war in Gaza. Fifty-nine hostages remain in Gaza, roughly half of whom are believed to be dead. The others were released in previous agreements, rescued, or their bodies were recovered.\nIsrael’s military campaign has killed over 48,000 Palestinians, according to Gaza’s Health Ministry, which does not say how many were fighters but says more than half were women or children.\nHere’s a look at the hostages released so far:\nOhad Yahalomi, 49 when kidnapped\nOhad Yahalomi was shot in the leg as he and his family were taken from Kibbutz Nir Oz. His wife and two daughters, one 10 and the other almost 2, escaped from a moped attempting to take them into Gaza and got away after running through fields for hours. Ohad and his oldest son, Eitan, then 12, were taken into Gaza but held separately. Eitan was released as part of a ceasefire in November 2023.\nYahalomi, who also had French citizenship, was a dedicated runner and swimmer and loved traveling across Israel, according to the hostage forum. Netanyahu’s office said Yahalomi was killed in captivity.\nItzhak Elgarat, 68 when kidnapped\nElgarat was taken from Kibbutz Nir Oz and was wounded in his hand, according to his brother, who spoke with him that morning.\nHis brother, Danny Elgarat, told Israeli media in July 2024 that they had received information from the Israeli military that Itzhak had likely been killed at some point in early 2024, though there was no official confirmation of his death. Netanyahu’s office said Elgarat was killed in captivity.\nHostages who were returned in the 2023 ceasefire said they had seen Itzhak in captivity in the early months of the war, his brother told Israeli media.\nElgarat also had Danish citizenship. He loved to travel and was a passionate supporter of the Maccabi Tel Aviv soccer team.\nShlomo Mantzur, 85\nMantzur was taken from Kibbutz Kissufim, while his wife of 60 years, Mazal, escaped. He was one of the founders of the kibbutz and had managed the chicken coops for many years. He had five children and 12 grandchildren. He loved working with his hands and studied jewelry-making and carpentry. Born in Iraq, he survived riots against Jews as a child and moved with his family to Israel as a young teenager, according to the Hostages and Missing Families Forum.\nMantzur was the oldest person taken hostage. Earlier this month, the Israeli military confirmed that Mantzur was killed on Oct. 7, 2023, and his body was taken to Gaza.\nTsachi Idan, 49 when kidnapped\nIdan was taken from Kibbutz Nahal Oz. His eldest daughter, Maayan, was killed as militants shot through the door of their saferoom. Hamas militants broadcast themselves on Facebook live holding the Idan family hostage in their home, as his two younger children pleaded with the militants to let them go. Only Tsachi was taken to Gaza.\nIdan worked in tech and loved playing soccer, volleyball and tennis, according to the hostages forum. Netanyahu’s office said Idan was killed in captivity.\nOmer Wenkert, 23\nWenkert, a restaurant manager known for his love of dancing and sports, was taken captive from the Nova music festival in southern Israel.\nSince his abduction, his family was concerned that Wenkert — from the southern Israeli town of Gedera — wasn’t getting the medication necessary to treat his colitis, an inflammation of the large intestine.\nThey had not received a sign of life from him since November 2023, when Hamas published footage of Wenkert tied in the back of a pickup truck in his underwear.\nOmer Shem Tov, 22\nShem Tov, from the Israeli city of Herzliya, was abducted from the Nova music festival with his friends Maya and Itay Regev, former captives who were released in November 2023. He’s a passionate musician and DJ, according to the hostage forum.\nOn the day of the Hamas attack on Israel, Shem Tov crammed into a car full of people trying to flee, but the militants shot at them. His family later saw footage of Shem Tov held by militants and bound in the back of a truck.\nTal Shoham, 40\nTal Shoham, from the northern Israeli village of Ma’ale Tzviya, was visiting his wife’s family on Kibbutz Be’eri when Hamas militants burned the house where they were hiding, forcing them outside.\nShoham, who also has Austrian citizenship, was taken along with his wife, Adi Shoham; his daughter, Yahel, 3; son, Naveh, 8; mother-in-law, Shoshan Haran; his wife’s aunt, Sharon Avigdori; and her daughter, Noam, 12. Three members of their extended family were killed during the attack.\nThe six extended family members were freed in November 2023. His wife, Adi, is a psychologist specializing in trauma.\nThe hostage forum said Shoham volunteered with Israel’s emergency paramedic service and used to be a manager at Kibbutz Be’eri’s printing house.\nEliya Cohen, 27\nCohen was at the Nova musical festival when he was taken hostage while hiding in a bomb shelter. His fiancé, Ziv Abud, avoided capture by hiding under a pile of bodies.\nCohen is from Tzur Hadassah, a town north of Jerusalem. He works in marketing and real estate.\nHostages who have been released in the past weeks said they were held with Cohen, and he had lost more than 20 kilograms (44 pounds) and had a bullet in his leg that did not receive medical attention. He was held in tunnels, chained for most of the time, and was unaware Abud had survived, she said earlier this month.\nAvera Mengistu, 38\nMengistu had been held in Gaza since entering on his own in 2014. Mengistu is from Ashkelon, a city in southern Israel. His family had no idea if he was alive for nine years, until Hamas released a video of him in January 2023.\nMengistu, a member of Israel’s Ethiopian minority, entered the territory by crossing a barbed wire fence into Gaza. After he crossed into the Gaza Strip, he was abducted by Hamas. The family told Israeli media he has struggled with mental health issues and he had gone missing within Israel previously.\nHisham Al-Sayed, 36\nAl-Sayed crossed on his own into Gaza in 2015 and had been held since. He grew up in Al-Sayed, a small Bedouin Arab village near the city of Hura in the Negev Desert. In 2022, Hamas published a video showing him lying in bed with an oxygen mask, though he was conscious.\nHis father told Human Rights Watch that Al-Sayed had run away from home on many occasions. His family told Israeli media he was diagnosed with schizophrenia.\n“No other hostages should face a decade in captivity,” his family said in a statement shortly before Al-Sayed’s release.\nThe Bibas family\nThe bodies of Ariel and Kfir Bibas were returned Thursday and the remains of their mother, Shiri Bibas, were returned Friday. Hamas said the three were killed in an Israeli airstrike, while Israel says forensic testing showed the boys were killed in captivity in November 2023. Shiri’s husband, Yarden, was also abducted from Kibbutz Nir Oz on Oct. 7, 2023, and was released earlier this month.\nA video of the family’s abduction showed a terrified Shiri Bibas swaddling her two redheaded sons in a blanket as armed militants surrounded her. The footage ricocheted around the world in the hours after the attack.\nAriel was 4 years old at the time and Kfir was 9 months old, making him the youngest captive taken by Hamas. Ariel Bibas loved Batman and family photos showed the four Bibases dressed as the character.\nKfir, the infant with red hair and a toothless smile, became a symbol across Israel for the feelings of helplessness and anger over the hostages’ captivity.\nOded Lifshitz, 84\nl\nThe body of Oded Lifshitz, one of the oldest hostages held by the militants, was returned Thursday. He was taken captive from his home in Kibbutz Nir Oz, along with his wife, Yocheved Lifshitz, who was freed before the first ceasefire agreement.\nHis family said in a statement they had “hoped and prayed so much for a different outcome.”\n“Now we can mourn the husband, father, grandfather, and great-grandfather who has been missing from us since October 7,” they said. “Our family’s healing process will begin now and will not end until the last hostage is returned.”\nOded and Yocheved Lifshitz are among the founders of Nir Oz. Oded, a journalist, campaigned for the recognition of Palestinian rights and peace between Arabs and Jews. In retirement, he drove to the Erez border crossing on the northern edge of the Gaza Strip once a week to ferry Palestinians to medical appointments in Israel as part of a group called On the Way to Recovery.\nOded took pride in his work helping the traditionally nomadic Bedouin people of the Negev Desert, his daughter told The Associated Press, describing a case that went to Israel’s High Court and resulted in the return of some of their land.\nSagui Dekel Chen, 36\nAn Israeli-American, Chen was working outside on his pet project, bus conversions, when militants stormed his kibbutz. He instructed his wife, Avital, to hide in the safe room with their two daughters. Chen, one of the first people to raise alarm of the infiltration on the kibbutz, was taken captive.\nAvital was seven months pregnant at the time of the attack; she gave birth to a third daughter, Shachar Mazal, in December 2023.\nChen is an avid tennis player who co-founded an arts center for young people in southern Israel, according to the hostage forum.\nIair Horn, 46\nHorn is an Israel-Argentinian who was taken captive along with his brother, Eitan Horn, who was staying with him at the time. Eitan Horn remains in captivity and is not included in the ceasefire’s first phase.\nIair Horn managed the kibbutz pub and is a fan of the local soccer team in Beersheba, according to the hostage forum.\nAlexander (Sasha) Troufanov, 29\nSasha Trufanov, an Israeli-Russian, was taken hostage along with three members of his family: grandmother Irena Tati, mother Yelena (Lena) and girlfriend Sapir Cohen. His father, Vitaly Trufanov, was killed on Oct. 7, 2023. The rest of his family was freed during a weeklong ceasefire in November 2023.\nSasha Troufanov works as an engineer for Amazon, according to the hostage forum. His family immigrated to Israel from the Soviet Union 25 years ago.\nHe was held by Palestinian Islamic Jihad, another militant group in Gaza, which has released multiple videos of him in captivity, including one just hours before his release.\nEli Sharabi, 52\nEli Sharabi was taken captive by the militants from Kibbutz Beeri, a communal farm that was one of the hardest hit in the Hamas attack. His British-born wife, Lianne, and their teenage daughters, Noiya and Yahel, were killed by militants while hiding in their safe room. His brother, Yossi Sharabi, who lived next door, was killed in captivity. Hamas militants are holding his body, according to the hostage forum.\nEli Sharabi’s home bore marks from the attack months later. AP journalists saw bullet holes in the walls and the shattered oven and TV screens. Nearby homes were torched by militants and their roofs blasted off during fighting on Oct. 7.\nOhad Ben Ami, 56\nOhad Ben Ami, a father to three, was taken captive with his wife, Raz, from Kibbutz Beeri, where he was an accountant. Raz Ben Ami was released during the weeklong ceasefire in November 2023.\nThe hostage forum described Ohad Ben Ami as a “passionate nature enthusiast” and the “cornerstone of his family.”\nOr Levy, 34\nOr Levy was pulled out of a bomb shelter by militants near the Nova music festival in southern Israel. His wife, Einav Levy, was killed during the attack. Their son, Almog, now 3, has been in the care of relatives since the assault.\nLevy was taken captive alongside American-Israeli Hersh Goldberg-Polin as well as two other hostages — Eliya Cohen and Alon Ohel. Goldberg-Polin, whose parents staged a high-profile campaign for his release, was killed in Hamas captivity.\nOr Levy is from the city of Rishon Lezion, where he worked as a computer programmer for a startup.\nKeith Siegel, 65\nKeith Siegel, from Chapel Hill, North Carolina, was abducted with his wife, Aviva Siegel, from Kibbutz Kfar Aza, a farming community heavily damaged by the attack. She was freed during the November 2023 ceasefire deal, and has campaigned across the world for the release of her husband and other hostages.\nAviva Siegel said that she was held hostage with her husband during her 51 days in captivity. She said she took comfort from having her husband by her side as they were moved from tunnel to tunnel, the two given almost no food or water. Her parting words to him were, “Be strong for me.”\nOfer Kalderon, 54\nOfer Kalderon, a French-Israeli hostage, was taken captive from Kibbutz Nir Oz. His teenage children, Sahar and Erez, were also abducted and freed during the weeklong ceasefire in 2023.\nArbel Yehoud, 29\nArbel Yehoud was taken hostage with her boyfriend, Ariel Cunio, from Kibbutz Nir Oz. A third-generation resident of the kibbutz, she loves science and space, and her friends held a public star gazing to mark her birthday in captivity.\nHer brother, Dolev Yehoud, was killed on Oct. 7.\nAgam Berger, 20\nIn videos of Agam Berger’s abduction, her face is covered in blood, though it’s unclear if it is from her own wound or those of other soldiers.\nBerger is a violin player from a suburb of Tel Aviv who enlisted in the army just two months before the attack. Berger was released after other female soldiers taken from the Nahal Oz military base.\nGadi Moses, 80\nGadi Moses was one of the oldest hostages who remained in captivity in Gaza.\nHe was taken from his home on Kibbutz Nir Oz, one of the communities hardest-hit in the Hamas-led attack. The hostage forum described Moses as an expert agronomist who lectured on agriculture and helped maintain the kibbutz’s vegetable garden.\nMoses’ partner, Efrat, was killed during the attack.\nWatchara Sriaoun, 33\nIn the Oct. 7 attack, militants overran the compound where agricultural workers lived on Kibbutz Nir Oz. Out of the 16 Thai workers living there, 11 were killed and five, including Watchara Sriaoun, were abducted.\nThey were among at least 31 Thai workers taken in the assault. In the November 2023 ceasefire, 23 were released in a deal negotiated between Thailand and Hamas, with assistance from Qatar and Iran.\nSathian Suwannakham, 35\nSathian Suwannakham was also taken from Nir Oz. The kibbutz has continued to advocate for the release of the Thai workers by posting regularly about them on social media, in addition to the Israeli hostages.\nSurasak Rumnao, 32\nSurasak Rumnao was abducted from the town of Yesha, located near the southern Gaza Strip.\nHis mother, Khammee Lamnao, said the Thai Embassy in Israel called her to let her know her son would be released.\nPongsak Thaenna, 36\nPongsak Thaenna was also taken from the town of Yesha. Thais make up the largest group of foreigners held in Gaza.\nIn the early days after the Oct. 7 attack, then-Thai Prime Minister Srettha Thavisin pressed Israeli Prime Minister Benjamin Netanyahu in phone conversations to assist the Thai hostages.\nBannawat Saethao, 27\nBannawat Saethao was also abducted from the town of Yesha.\nLiri Albag, 19\nLiri Albag, who was among those abducted from the Nahal Oz military base, was featured in a video Hamas released in early January, filmed under duress. Her family said the video was “difficult to watch” because of Albag’s clear emotional distress. They were particularly active in the protest movement pushing for a deal with Hamas to bring the hostages home.\nKarina Ariev, 20\nKarina Ariev was also taken from Nahal Oz.\nJust before she was abducted, she she sent a message to her family, saying: “If I don’t live, take care of mom and dad all their lives. Don’t give up, live,” according to Israeli media. Her family said she loves to cook, sing, dance and write poetry.\nDaniella Gilboa, 20\nAlso taken from Nahal Oz, Daniella Gilboa was originally named Danielle. Her parents changed it after she was taken captive, in line with a Jewish tradition that is believed to bring God’s protection.\nGilboa, from Petah Tikva, a suburb of Tel Aviv, played piano and studied music in high school. She dreams of being a singer, according to Israeli media.\nNaama Levy, 20\nThe footage from Naama Levy’s abduction, in which she is wearing gray sweatpants covered in blood, was shown around the world.\nLevy, among those taken from Nahal Oz, is a triathlete. When she was younger, she participated in the “Hands of Peace” delegation, which brings together Americans, Israelis and Palestinians to work on coexistence.\nRomi Gonen, 24\nRomi Gonen was taken from the Nova music festival in southern Israel on Oct. 7, 2023. She spoke to her family for nearly five hours as militants marauded through the festival grounds. She told them that roads clogged with abandoned cars made escape impossible and that she would seek shelter in some bushes.\nHer father, Eitan Goren, said she survived in part by learning Arabic, as it was the only way to communicate with her captors. “I just enjoy being with her even in silence, touching, hugging, watching her,” he said, a week after her release. “I missed it so much.”\nEmily Damari, 28\nEmily Damari is a British-Israeli citizen abducted from her apartment on Kibbutz Kfar Aza. She lived in a small apartment in a neighborhood for young adults, the closest part of the kibbutz to Gaza. Militants broke through the border fence of the kibbutz and ransacked the neighborhood.\nThe day after her release, Emily’s mother, Mandy, said her daughter was “in high spirits and on the road to recovery.”\nDoron Steinbrecher, 31\nDoron Steinbrecher is a veterinary nurse who loves animals, and a neighbor to Damari in Kibbutz Kfar Aza. Steinbrecher holds both Israeli and Romanian citizenship.\nSteinbrecher was featured in a video released by Hamas in January 2024, along with two female Israeli soldiers. Her brother said the video gave them hope that she was alive but sparked concern because she looked tired, weak and gaunt.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "url": "https://apnews.com/article/itamar-bengvir-resigns-gaza-ceasefire-netanyahu-d63bc4ac1e4f741cafa6fab4d932f891",
      "text": "Who is Itamar Ben-Gvir, the far-right minister who resigned from Netanyahu’s Cabinet?\nWho is Itamar Ben-Gvir, the far-right minister who resigned from Netanyahu’s Cabinet?\nTEL AVIV, Israel (AP) — Israel’s far-right national security minister resigned from Prime Minister Benjamin Netanyahu’s Cabinet on Sunday to express his disapproval of the Gaza ceasefire deal.\nThe resignation of Itamar Ben-Gvir does not threaten the ceasefire, but it does weaken Netanyahu’s governing coalition. If other far-right lawmakers leave the government — as Ben-Gvir has encouraged them to do — the prime minister could lose his parliamentary majority, potentially forcing early elections.\nIt was the latest act of defiance by the 48-year-old ultranationalist settler leader who transformed himself over the decades from an outlaw and provocateur into one of Israel’s most influential politicians.\nHere is a closer look at Ben-Gvir:\nWhy did Ben-Gvir oppose the ceasefire deal?\nThe ceasefire will pause the war and free dozens of hostages held by militants in Gaza. Ben-Gvir opposed the deal because it requires Israel to free hundreds of Palestinian prisoners and to withdraw troops from Gaza’s southern border with Egypt — and because it leaves open the possibility of Hamas staying in power in Gaza.\nAhead of the resignation, he said the ceasefire was “reckless” and would “destroy all of Israel’s achievements.”\nIn his Cabinet post, Ben-Gvir oversaw the country’s police force. He used his influence to encourage Netanyahu to press ahead with the war in Gaza and recently boasted that he had blocked past efforts to reach a ceasefire.\nHe also has paid multiple visits to Jerusalem’s most sensitive holy site — the contested hilltop compound that houses the Al-Aqsa Mosque — including last month. In one such visit in July, he said he came to pray for the return of the hostages “but without a reckless deal, without surrendering.”\nThe move, while legal, was seen as a provocation, violated a longstanding ban on Jewish prayer there, and threatened to disrupt months of sensitive negotiations. The site is revered by Jews as the Temple Mount.\nRun-ins with the law\nBen-Gvir has been convicted eight times for offenses that include racism and supporting a terrorist organization. As a teen, his views were so extreme that the army banned him from compulsory military service.\nBen-Gvir gained notoriety in his youth as a follower of the late racist rabbi Meir Kahane. He first became a national figure when he broke a hood ornament off then-Prime Minister Yitzhak Rabin’s car in 1995.\n“We got to his car, and we’ll get to him too,” he said, just weeks before Rabin was assassinated by a Jewish extremist opposed to his peace efforts with the Palestinians.\nTwo years later, Ben-Gvir took responsibility for orchestrating a campaign of protests, including death threats, that forced Irish singer Sinead O’Connor to cancel a concert for peace in Jerusalem.\nMoving to the mainstream\nThe political rise of Ben-Gvir was the culmination of years of efforts by the media-savvy lawmaker to gain legitimacy. But it also reflected a rightward shift in the Israeli electorate that brought his religious, ultranationalist ideology into the mainstream and diminished hopes for Palestinian independence.\nBen-Gvir is trained as a lawyer and gained recognition as a successful defense attorney for extremist Jews accused of violence against Palestinians.\nWith a quick wit and cheerful demeanor, the outspoken Ben-Gvir also became a popular fixture in the media, paving his way to enter politics. He was first elected to parliament in 2021.\nBen-Gvir has called for deporting his political opponents, and in the past has encouraged police to open fire on Palestinian stone-throwers in a tense Jerusalem neighborhood, while brandishing a pistol. As national security minister, he has encouraged police to take a tough line against anti-government protesters.\nControversial minister\nBen-Gvir secured his Cabinet post after 2022 elections that put Netanyahu and his far-right partners, including Ben-Gvir’s Jewish Power party, into power.\n“Over the last year I’ve been on a mission to save Israel,” Ben-Gvir told reporters before that election. “Millions of citizens are waiting for a real right-wing government. The time has come to give them one.”\nBen-Gvir has been a magnet of controversy throughout his tenure — encouraging the mass distribution of handguns to Jewish citizens, backing Netanyahu’s contentious attempt to overhaul the country’s legal system and frequently lashing out at U.S. leaders for perceived slights against Israel.\nIn May, Ben-Gvir criticized Joe Biden when the U.S. president threatened to withhold certain military aid if Israel invaded Rafah. Ben-Gvir, using a heart emoji in a post on the social media platform X, wrote that Hamas loves Biden.\nPolitical fallout\nBen-Gvir’s departure does not endanger the ceasefire, and Netanyahu still has a narrow parliamentary majority needed to keep power.\nBut if other hard-liners follow suit, Netanyahu’s government could collapse, which would trigger early elections.\n“It’s probable that he has less survival time,” said Shmuel Rosner, a senior fellow at the Jewish People Policy Institute and analyst for Israeli public television station Kan News.\nOpposition leader Yair Lapid has said he will provide a political safety net to Netanyahu to ensure the government will not fall over the deal.\nBut such a partnership is unlikely to last beyond the ceasefire because the two men do not get along and would have a difficult time working together, said Mairav Zonszein, a senior analyst on Israel with the International Crisis Group."
    },
    {
      "url": "https://apnews.com/article/middle-east-elections-israel-benjamin-netanyahu-tel-aviv-65155b743a5a8e73eb4b4f50eff9229a",
      "text": "Extremist lawmaker surges ahead of elections in Israel\nExtremist lawmaker surges ahead of elections in Israel\nTEL AVIV, Israel (AP) — Israeli lawmaker Itamar Ben-Gvir calls his Arab colleagues “terrorists.” He wants to deport his political opponents, and in his youth, his views were so extreme that the army banned him from compulsory military service.\nYet today, the populist lawmaker who was once relegated to the margins of Israeli politics is surging ahead in the polls ahead of November elections. He has received the blessing of former Prime Minister Benjamin Netanyahu and is poised to emerge as a major force that could propel the onetime premier back to power.\nBen-Gvir’s stunning rise is the culmination of years of efforts by the media-savvy lawmaker to gain legitimacy. But it also reflects a rightward shift in the Israeli electorate that has brought his religious, ultranationalist ideology into the mainstream and all but extinguished hopes for Palestinian independence.\n“Over the last year I’ve been on a mission to save Israel,” Ben-Gvir recently told reporters. “Millions of citizens are waiting for a real right-wing government. The time has come to give them one.”\nBen-Gvir, 46, has been a fixture of Israel’s extreme right for more than two decades, gaining notoriety in his youth as a disciple of the late radical rabbi, Meir Kahane. He first became a national figure when he famously broke a hood ornament off then-Prime Minister Yitzhak Rabin’s car in 1995.\n“We got to his car, and we’ll get to him too,” he said, just weeks before Rabin was assassinated by a Jewish extremist opposed to his peace efforts with the Palestinians.\nKahane’s violent anti-Arab ideology -- which included calls to ban Jewish-Arab intermarriage and for the mass expulsion of Palestinians -- was considered so repugnant that Israel banned him from parliament and the U.S. listed his party as a terrorist group. Kahane himself was assassinated by an Arab assailant in New York in 1990.\nBut in recent years, his followers and some of his ideas have made their way to the Israeli mainstream — in large part thanks to Ben-Gvir.\nHe transitioned into politics last year after a career as a lawyer defending radical Jewish West Bank settlers. His intimate knowledge of the law has helped him test the boundaries of the country’s incitement laws and avoid sanctions that have prevented some of his closest associates from running in elections.\nBen-Gvir, for instance, calls Kahane “righteous and holy” but also says he doesn’t agree with everything his former mentor said. He’s careful to limit his own calls for expulsion to those who engage in violence and lawmakers — Jewish or Arab — who he says undermine the state.\nBefore entering politics, he removed a photo of Baruch Goldstein -- a Jewish militant who gunned down 29 Palestinians in a mosque in 1994 -- from his living room. He no longer allows his supporters to chant “Death to Arabs” at political rallies. Instead, they are told to say, “Death to terrorists!”\nSupporters say Ben-Gvir has changed, been misunderstood, or wrongly painted an extremist.\n“People mature. People develop,” said Nevo Cohen, Ben-Gvir’s campaign manager. “They stuck a label on Ben-Gvir that is totally wrong.”\nBen-Gvir’s office turned down an interview request. But he makes frequent appearances on Israeli TV and radio, displaying a cheerful demeanor, quit wit and knack for deflecting criticism as he banters with his hosts.\nHe also has tapped into a wave of anti-Arab and nationalist sentiment driven by years of violence, failed peace efforts and demographic changes. Ben-Gvir’s supporters are largely religious and ultra-Orthodox Jews, who tend to have large families, and also come from the influential West Bank settler movement. Ben-Gvir himself lives in a hard-line settlement next to the West Bank city of Hebron, home to more than 200,000 Palestinians.\n“He is a populist demagogue. He plays on the sentiments of hate and fear of Arabs,” said Shuki Friedman, an expert on Israel’s far right at the Jewish People Policy Institute. “He interviews well, he is good on camera and he has had plenty of screen time that has given him legitimacy.”\nIn the opposition over the past year, Ben-Gvir has positioned himself as a rabble rouser against the government -- the first ever to have an Arab party as a member. He publicly quarreled with Arab lawmakers in scenes captured on camera and widely broadcast.\nIn the tense run-up to last year’s Gaza war, he staged provocative visits to Arab neighborhoods, rallying ultranationalist supporters to confront Palestinians and assert “Jewish Power” — the name of his party.\nHe set up an outdoor parliamentary “office” in an Arab neighborhood of east Jerusalem where Jewish settlers are trying to expel Palestinians from their homes, setting off a melee. He later called for police to use live fire against Palestinian protesters at a flashpoint holy site.\nHis surge in the polls has made him a central figure in Netanyahu’s comeback strategy.\nNetanyahu is on trial for corruption, and the public is again torn over his fitness to rule. After four consecutive inconclusive elections, Netanyahu and his Likud party hope to break the logjam with Ben-Gvir’s support.\n“Yes, Ben-Gvir is someone very militant and yes, sometimes a little provocative, but he is someone who cares about Israel,” said Likud lawmaker and Netanyahu confidant Miki Zohar, who insisted Ben-Gvir would fall in line under a Netanyahu-led government.\nLast week, Netanyahu personally brokered a deal between Ben-Gvir and a rival far-right leader, Bezalel Smotrich, to ensure they run together. If they hadn’t, Smotrich might not have made it into parliament, depriving Netanyahu of a critical source of support.\n“Joining forces is the order of the day,” Netanyahu said.\nOne recent poll forecast Ben-Gvir’s alliance with 12 seats, which would make it parliament’s fourth-largest. That means Netanyahu almost certainly would make Ben-Gvir a Cabinet minister if he can form a government.\nBen-Gvir has said his first order of business would be to pass a law allowing deportations of those who allegedly subvert the country and its security forces. He has proposed imposing the death penalty for “terrorists” and granting immunity to soldiers accused of committing violent crimes against Palestinians.\nThabet Abu Rass, the Arab co-director of the Abraham Initiatives, which promotes Jewish-Arab coexistence, said the mainstreaming of figures like Ben-Gvir is not only a threat to Israel’s Arab citizens, but to the country as a whole.\nBy branding Arab members of parliament as traitors who should be expelled, Ben Gvir delegitimizes the political participation of Arab citizens — who make up around 20% of Israel’s population — and the possibility of Jewish-Arab partnerships, Abu Rass said.\n“It’s very dangerous for the whole Israeli society,” he said. “It’s going to bring about the collapse of democracy.”"
    }
  ],
  "argos_summary": "Itamar Ben-Gvir, Israel's far-right national security minister, has become a significant political figure, known for his ultranationalist views and controversial actions, including leading prayers at the contested Al-Aqsa Mosque site. His recent visit during the Jewish holiday of Tisha B'Av was seen as provocative by Palestinians, who fear it signals a potential shift in control over the site. Ben-Gvir's political rise reflects a broader rightward shift in Israeli politics, diminishing hopes for Palestinian independence and leading to international sanctions against him and fellow ministers for inciting violence.",
  "argos_id": "Y8JOQBZFG"
}