{
  "url": "https://www.foxbusiness.com/technology/kia-issues-recalls-loose-parts-creating-possible-roadway-hazards-300k-vehicles-impacted",
  "authorsByline": "Danielle Wallace, Bonny Chu",
  "articleId": "566d3640a93c420b85b74dc84de3c3f0",
  "source": {
    "domain": "foxbusiness.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2025/08/0/0/kia-back-logo.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-03T14:43:56-04:00",
  "addDate": "2025-08-03T19:02:04.552627+00:00",
  "refreshDate": "2025-08-03T19:02:04.552630+00:00",
  "score": 1.0,
  "title": "Kia issues recalls over loose parts creating possible roadway hazards, over 300K vehicles impacted",
  "description": "Kia is recalling 2023-2025 K5 sedans and Telluride SUVS over the potential detachment of window garnish panels and door belt moldings, according to NHTSA.",
  "content": "Kia America issued two recall notices within a week for more than 300,000 vehicles over loose parts near the doors and windows that can fall off and pose a potential hazard to other drivers.\n\nThe recalls affect 201,149 Telluride models from 2023 to 2025 over faulty door belt moldings and 100,063 K5 models from 2023 to 2025 over window trim detachment issues, according to two separate July 28 notices from the National Highway Traffic Safety Administration (NHTSA).\n\nDetached trim pieces can create \"a road hazard for other vehicles, increasing the risk of a crash,\" NHTSA said in both notices.\n\nThe recalled Telluride models may experience loosening and eventual detachment of its door belt molding trims – the long, narrow strip located along the top edge of the vehicle’s door where the glass window meets the metal frame of the door, according to NHTSA.\n\nThe K5 models recalled may also experience the same issue with its C-pillar garnish face plates – decorative panels located near the left and right rear windows, NHTSA said in the second notice.\n\nDue to a supplier quality issue, the C-pillar garnish face plate and door belt molding face plate \"may progressively delaminate and become loose from the base of the molding,\" Kia North America Safety Office said in additional notices posted on July 29.\n\n\"If the vehicle continues to be driven in this condition, the face plate may eventually fall off,\" Kia added. \"A face plate that detaches from the vehicle while in motion may create a road hazard for other road users, increasing the risk of a crash.\"\n\nOwners can bring their vehicles to a Kia dealership for a free inspection and replacement of the C-pillar trim assemblies as well as the belt molding trim assemblies, NHTSA said in the notices.\n\n\"Dealers will replace the affected C-pillar garnish assembly(ies) not previously replaced under warranty with an improved one,\" NHTSA said. \"Kia will reimburse owners for repair expenses already incurred pursuant to Kia’s General Reimbursement Plan filed May 1, 2024.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nNotification letters to vehicle owners of the K5 and Telluride models are expected to be mailed on Sep. 26, NHTSA said. For more information, owners may contact Kia customer service at 800-333-4542 and reference recall number SC346 for the K5 recall and SC347 for the Telluride recall, according to the agency.\n\nVehicle owners can check if their car is affected by visiting the NHTSA recall website, where they can search by make, model, license plate number, or Vehicle Identification Number.\n\nNHTSA and Kia did not immediately respond to a request for comment from FOX Business.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/tech/luxury-mercedes-electric-van-65-inch-screen-42-speakers",
    "https://www.foxnews.com/category/auto/make/kia",
    "https://www.foxbusiness.com/category/auto",
    "https://www.foxbusiness.com/category/transportation",
    "https://www.foxnews.com/auto/us-safety-agency-opens-investigation-into-tesla-model-s-electric-car-fires",
    "https://www.foxbusiness.com/apps-products",
    "https://www.foxnews.com/category/health/healthy-living/product-recalls",
    "https://www.foxbusiness.com/video/6318871473112"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "door belt molding face plate",
      "weight": 0.10688687
    },
    {
      "name": "Vehicle owners",
      "weight": 0.09692986
    },
    {
      "name": "vehicle owners",
      "weight": 0.09692986
    },
    {
      "name": "other vehicles",
      "weight": 0.09084441
    },
    {
      "name": "faulty door belt moldings",
      "weight": 0.09005084
    },
    {
      "name": "Kia America",
      "weight": 0.087133095
    },
    {
      "name": "window trim detachment issues",
      "weight": 0.086961195
    },
    {
      "name": "Kia North America Safety Office",
      "weight": 0.084814124
    },
    {
      "name": "Kia customer service",
      "weight": 0.083408155
    },
    {
      "name": "Kia",
      "weight": 0.082462266
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.8017578125
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.5302734375
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.368896484375
    },
    {
      "name": "/Autos & Vehicles/Vehicle Codes & Driving Laws/Other",
      "score": 0.360595703125
    }
  ],
  "sentiment": {
    "positive": 0.053588867,
    "negative": 0.67626953,
    "neutral": 0.27026367
  },
  "summary": "Kia America has issued two recall notices for over 300,000 vehicles due to loose parts near the doors and windows that can potentially fall off and pose a potential hazard to other drivers. The recalls affect 201,149 Telluride models from 2023 to 2025 due to faulty door belt moldings and 100,063 K5 models from 2025 over window trim detachment issues. The National Highway Traffic Safety Administration (NHTSA) stated that these detached trim pieces can create a road hazard for other vehicles and increase the risk of a crash. Owners can bring their vehicles to a Kia dealership for free inspection and replacement of the affected C-pillar trim assemblies. Kia will reimburse owners for repair expenses already incurred under its General Reimbursement Plan filed May 1, 2024.",
  "shortSummary": "Kia America is recalling over 300,000 vehicles due to potential road hazard caused by loose trimings and C-pillar garnish face plates, with owners eligible for repair.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e87c94ddb5b64b33a8f574acc4d176d0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/auto/us-safety-agency-opens-investigation-into-tesla-model-s-electric-car-fires",
      "text": "DETROIT – The U.S. government's auto safety watchdog has opened an investigation into battery fires in Tesla Model S electric cars.\nThe National Highway Traffic Administration says fires broke out in two of the cars in the U.S. after the undercarriage hit metal road debris. The debris pierced the batteries and caused a thermal reaction and fires. In each case, the car warned the driver of the damage, and both escaped without getting hurt.\nThe probe affects more than 13,000 cars from the 2013 model year that were sold in the U.S. Tesla has sold about 19,000 of the cars worldwide. They start at $70,000 but often run more than $100,000.\nTesla's batteries are located beneath the passenger compartment and protected by a quarter-inch-thick metal shield. Experts say that if the batteries are damaged, that can cause arcing and sparks and touch off a fire.\nNHTSA, in documents posted on its website Tuesday, said it opened the preliminary evaluation \"to examine the potential risks associated with undercarriage strikes\" on the Tesla cars. The investigation could lead to a recall, but a decision likely is months away.\nTesla CEO Elon Musk said in a blog posting that the company asked the government to investigate, even though its cars catch fire at a far lower rate than gas-powered vehicles.\n\"While we think it is highly unlikely, if something is discovered that would result in a material improvement in occupant fire safety, we will immediately apply that change to new cars and offer it as a free retrofit to all existing cars,\" Musk wrote.\nHe also wrote that Tesla has done an over-the-air software update to give the car more ground clearance at highway speeds.\nMusk wrote that at first, a NHTSA investigation didn't seem like a good use of the agency's time given the higher frequency of gasoline-powered car fires. But he changed his mind. \"If a false perception about the safety of electric cars is allowed to linger, it will delay the advent of sustainable transport and increase the risk of global climate change, with potentially disastrous consequences worldwide. That cannot be allowed to happen,\" Musk wrote.\nHe has said previously that the car won't be recalled.\nPalo Alto, Calif.-based Tesla's stock rose more than 400 percent earlier in the year as the Model S won accolades from Consumer Reports and other magazines. But it has fallen 37 percent since news of the first fire was reported on Oct. 2.\nIts shares fell almost 4 percent, or $4.38, to $117.20 in premarket trading Tuesday.\nThe first U.S. fire occurred along a freeway in Kent, Wash., near Seattle when a Model S struck a curved metal object which pierced the shield and the battery. In the second case, a Model S caught fire Nov. 6 near Smyrna, Tenn., after the driver struck a trailer hitch in the road. Another fire was reported Oct. 17 in Mexico when a Model S burned after a high-speed crash.\nTESLA - TSLA STOCK QUOTE ON FOX BUSINESS\n___\nNational Highway Traffic Administration report: http://www-odi.nhtsa.dot.gov/acms/cs/jaxrs/download/doc/UCM446471/INOA-PE13037-1867.PDF"
    },
    {
      "url": "https://www.foxbusiness.com/category/auto",
      "text": "Kia issues recalls over loose parts creating possible roadway hazards, over 300K vehicles impacted\nKia is recalling 2023-2025 K5 sedans and Telluride SUVS over the potential detachment of window garnish panels and door belt moldings, according to NHTSA.\nTesla ordered to pay millions in damages after jury finds automaker partly responsible for fatal 2019 crash\nTesla has been found partly responsible for a deadly 2019 crash, and a federal jury ordered the automaker to pay more than $242 million in damages.\nGM Corvettes shatter American speed records at legendary racetrack\nChevrolet Corvettes become fastest American cars at Nürburgring as engineer Drew Cattell posts 6:49.275 lap time in 1,250-horsepower ZR1X on Germany's famous track\nGM's Corvettes break record on world famous track\nGM Corvettes shatter American speed records at legendary German Nürburgring racetrack\nJaguar CEO steps down after 'woke' rebrand sparked massive social media firestorm\nAdrian Mardell is resigning as Jaguar CEO months after the automaker's polarizing ad campaign featuring androgynous models drew comparisons to Bud Light's controversy.\nFord recalls 312K trucks and SUVs over brake failure risk that increases crash danger\nNHTSA announces Ford recall affecting 312,120 vehicles with faulty power brake assist that can extend stopping distance and cause unexpected braking issues.\nTrump's $500B economic windfall: Japan trade deal 'largest in history'\n'The Big Money Show' panel breaks down President Donald Trump's latest trade deal.\nFox Business Briefs 7/22\nGM profit shrinks despite stronger sales; Coca-Cola will launch a new version of Coke using cane sugar; Target Announces \"Back-to-School-idays\" savings event.\nGM profit shrinks despite stronger sales\nAutomaker General Motors posted a 12% sales gain through the first half of year while working to mitigate the effects of President Donald Trump's tariffs.\nBet on Elon Musk to successfully pivot to robotics, expert says\nCircle Squared Alternative Investments founder Jeff Sica analyzes Tesla and Alphabet on 'Varney & Co.'\nFord issues recall for more than 694,000 Bronco Sport, Escape vehicles for fuel injector defect\nA recall is underway for over 694,000 Ford Bronco Sport and Escape vehicles due to a potential issue with their fuel injectors that could pose a fire risk.\nUber partners with Chinese tech giant to roll out driverless vehicles across multiple global markets\nUber and Baidu join forces in the self-driving taxi market, combining Uber's network with Baidu's Apollo Go robotaxi fleet that has completed over 11 million rides across 15 cities.\nThe 'big, beautiful, bill' includes a car loan interest tax deduction. Do you qualify?\nThe Republicans' tax cut and spending package, dubbed the \"big, beautiful bill,\" includes a tax deduction for car loan interest of up to $10,000 annually for qualified vehicles.\nTesla vehicles to get Grok AI chatbot starting next week, Musk says\nBillionaire Elon Musk announced that Grok, a generative artificial intelligence chatbot, will be available in Tesla vehicles starting next week \"at the latest.\"\nFord and Lincoln recall over 850K cars, trucks and SUVs over potential fuel pump failure\nA recall is underway for over 850,000 Ford and Lincoln vehicles that could have an issue with their low-pressure fuel pump that could cause engine stalls.\nNissan issues massive recall as faulty part threatens engine failure\nNissan is recalling nearly 443,900 vehicles across certain models under its namesake and Infiniti brands in the U.S. over a faulty part that could cause their engines to fail.\nFox Business Briefs 6/30\nNissan seeks to delay supplier payments to free up cash; Fed: banks well-positioned to withstand economic downturn; Cruise passengers will be charged $5 fee at Mexican ports; Analysts at Jeffries are more optimistic about Disney.\nChrysler recalls more than 250K minivans over potential air bag issue\nStellantis’ Chrysler is recalling more than 250,600 minivans from the model years 2022-2025 over the risk they may have a problem with their side curtain air bags.\nGeneral Motors recalls 62,500 Chevy Silverados over brake fire risk\nGeneral Motors is recalling nearly 62,500 Chevrolet Silverado pickup trucks because their brake pressure sensor assembly could potentially leak and pose a fire risk.\nTesla's newly launched robotaxi service experiences driving issues, traffic problems: report\nSince Tesla's recent launch of its robotaxi service in Austin, videos have emerged showing driving problems including speeding, sudden braking and driving over a curb."
    },
    {
      "url": "https://www.foxnews.com/category/auto/make/kia",
      "text": "LIFESTYLE June 29, 2024 Reddit user who refuses to help 'obese cousin' at wedding is not wrong, therapist insists A Reddit user who refuses to push an obese cousin around at an outdoor wedding due to the cousin's large size did not do anything wrong, a therapist told Fox News Digital.\nVIDEO June 16, 2023 Review: 2024 Kia Seltos The 2024 Kia Seltos is an updated version of the subcompact SUV that has more power and features than before. Fox News Digital Autos Editor Gary Gastelu reviews.\nElectric June 14, 2023 Kias and Lucids are faster than Teslas at this Electric Kias and Lucids can charge their batteries with more miles' worth of electricity in 10 and 20 minutes, respectively, than the Tesla Model S.\nAuto Safety May 11, 2023 Kia and Hyundai 'TikTok' thefts still rising despite efforts to stop them Reports of Kia and Hyundai thefts have continued to rise in several cities nationwide as videos showing how to steal them with an easy method continue to spread on social media.\nVIDEO April 5, 2023 The 2024 Kia EV9 is the brand's biggest electric vehicle Kia Senior Design Manager Kurt Kahl enters The Fox Garage to talk about the EV9, the brand's new three-row all-electric SUV, which has a driving range of 300 miles between charges.\nKia April 5, 2023 The Kia EV9 is an electric SUV: Sleep Utility Vehicle The 2024 Kia EV9 will have a range of up to 300 miles per charge when it goes on sale later this year and will be made in USA starting in 2024.\nAuto Safety March 28, 2023 Here's how that Kia driver survived being flipped into the air The Kia Soul has a stronger than average roof compared to other small vehicles, which allowed one to protect its driver as it was flipped in the air by a runaway tire.\nKia March 15, 2023 Huge Kia EV9 electric SUV revealed with swiveling seats The Kia EV9 electric SUV has been revealed with three rows of seating including second row captain's chairs that can swivel to face the rear seats.\nNew York Auto Show February 23, 2023 What is the best car in the world? The World Car of the Year award will be announced at the New York International Auto Show in April and the 10 finalists have been revealed.\nAuto Safety February 14, 2023 Hyundai and Kia issuing software update that prevents TikTok challenge car thefts Hyundai and Kia have developed a software fix for their vehicles that are easily stolen using a technique that was shared on TikTok and other social media.\nKia February 13, 2023 Traffic report: Kia's Binky Dad won the Super Bowl car commercial game Kia's \"Binky Dad\" Super Bowl commercial generated the most interest in its vehicles on Cars.com among the four automakers that advertised during the game.\nMaintenance February 9, 2023 Lexus named most-dependable automaker by J.D. Power ... again Lexus received the highest score on the J.D. Power U.S. Vehicle Dependability Study for 2023, ahead of Kia and Genesis on the benchmark list.\nMaintenance February 7, 2023 Consumer Reports says these are the most and least satisfying vehicles The Chevrolet Corvette has been named the most satisfying vehicle to own in a Consumer Reports survey that asks owners if they'd buy their model again.\nFox News Car Reviews February 3, 2023 Review: The 2023 Kia Telluride X-Pro rides higher than ever The 2023 Kia Telluride is now available in an X-Pro trim that adds rugged styling and features that make it a better performer on unpaved surfaces.\nVIDEO February 2, 2023 Review: 2023 Kia Telluride The 2023 Kia Telluride has been updated with new styling and a new X-Pro trim, which adds off-road capability. Fox News Digital Autos Editor Gary Gastelu reviews.\nFord January 11, 2023 2023 North American Car, Truck and Utility of the Year revealed The Ford F-150 Lightning, Acura Integra and Kia EV6 were named 2023 North American Truck, Car and Utility Vehicle of the year by a panel of journalists.\nInnovations January 11, 2023 St. Louis Hyundai/Kia dealer invents security device for cars being stolen through TikTok challenge A Hyundai and Kia dealer in St. Louis has developed a Bluetooth ignition immobilizer to address a wave of car thefts targeting the brands' vehicles.\nKia December 29, 2022 This type of car is going extinct in 2023 The Kia Stinger Tribute Edition marks the end of production for the rear-wheel-drive four-door, one of the last mainstream models available with an internal combustion engine.\nFox News Car Reviews November 25, 2022 Review: The 2023 Kia Niro Hybrid is rationality on wheels The 2023 Kia Niro Hybrid delivers up to 53 mpg in a package that's roomy, practical and provides a quiet and comfortable ride for its price and size class.\nAuto Safety September 22, 2022 Hyundais and Kias stolen nearly twice as often as other vehicles, national study finds A new report from the Highway Loss Data Institute found that Hyundais and Kias were stolen at nearly twice the rate of other models in 2021.\nBudget September 5, 2022 These are the only new cars left for under $20,000 There are only five car models left that you can buy for less than $20,000 in the U.S. as more automakers discontinue their lowest-priced offerings.\nKia August 26, 2022 Camouflaged Kia EV9 supersize electric SUV revealed The 2024 Kia EV9 has been shown undergoing testing ahead of its official reveal early next year. The three-row SUV is set to be the brand's largest EV.\nHyundai August 11, 2022 Hyundai has a new way to prevent its cars from getting stolen Hyundai will begin offering a security system for its older models that have been targeted by thieves due to the ease in which they can be started without keys.\nCRIME August 7, 2022 Video catches group of teens crash stolen Kia, take off running on Minnesota highway Video from traffic cameras on a Minnesota highway shows a group on teenagers crash a stolen Kia and take off running.\nHyundai August 2, 2022 Kias and Hyundais continue to be stolen at alarming rates, police warn Thieves continue to steal certain Kia and Hyundai models due to an easy ignition switch hack that has been shared on social media, police warn.\nFox News Car Reviews July 30, 2022 Review: The 2022 Kia Sportage Hybrid lives up to its high price hype The 2023 Kia Sportage Hybrid is the first hybrid version of the compact SUV and is so popular that some dealers have been marking up its list price by 30%.\nMaintenance May 19, 2022 These 5 used cars' trade-in values are skyrocketing Car dealers are paying 20% more for trade-ins than they were two years ago and consumers are getting much larger payouts than expected amid the new car shortage.\nBudget April 18, 2022 Buyer beware: These are the 10 worst deals on new cars The Kia Telluride has been selling at an average of 21% over MSRP, according to a new study from Consumer Reports that rounds up the worst deals on new cars today."
    },
    {
      "url": "https://www.foxbusiness.com/category/transportation",
      "text": "Delta flight diverted to Minneapolis after severe turbulence, leaving 25 people on board hospitalized\nDelta said 25 people were hospitalized after a flight from Salt Lake City made an emergency landing in Minneapolis due to severe turbulence.\nTrump will make America's air traffic control system 'the best in the world': Sean Duffy\nTransportation Secretary Sean Duffy, in an appearance on 'Varney & Co.,' discusses the rise in flight delays and announces new findings that his predecessor, Pete Buttigieg, cut corners on safety recommendations.\nAmerican Airlines passengers caught on camera evacuating smoky plane on Denver tarmac after landing gear issue\nPassengers were evacuated Saturday from an American Airlines aircraft that was about to take off from Denver International Airport because there was an issue with landing gear.\nKansas City ends free bus program over budget concerns while NYC dem-socialist pushes for no-fare transit\nAs Kansas City moves to reinstate bus fares for most riders over budget concerns, NYC mayoral candidate Zohran Mamdani is pushing for the Big Apple to make all bus fares \"free.\"\nKansas City working-class is worse-off after government-run grocery stores: Better Cities Project co-founder\nBetter Cities Project co-founder Patrick Tuohey explains the ways that government-run grocery stores and transportation have negatively impacted the people of Kansas City on 'The Bottom Line.'\nUber announces feature allowing women to select female preference for riders, drivers\nUber announced a \"Women's Preferences\" to allow women riders and drivers in the U.S. to only be connected with other women for their trips through the ride-sharing service.\nSelf-driving truck company to expand operations, combatting nationwide trucking shortage\nThe American Trucking Association says the country needs about 60,000 more drivers. Gatik's self-driving freight trucks could help combat that shortage.\nAlaska Airlines lifts ground stop for all mainline aircraft: FAA\nAlaska Airlines' operations resumed late Sunday after it had asked for a ground stop for all the airline's mainline aircraft, according to the airline and the FAA.\nCalifornia sues over billions lost in high-speed rail funds as Newsom battles Trump administration\nCalifornia Gov. Gavin Newsom sues the Trump administration for canceling $4 billion in funding for the state's high-speed rail project, calling it political retribution.\nTrump terminates California's troubled high-speed rail dream with decisive move\n'The Big Money Show' panel discusses President Donald Trump's decision to pull the plug on California's high-speed rail project after 16 years of not laying one track.\nTrump admin pulls plug on $4B for California's 'train to nowhere' project\nU.S. Transportation Department cancels $4 billion for California's high-speed rail after review found zero miles of track laid in 10 years and ballooning costs.\nAirlines scramble to check Boeing jets after investigation reveals potential reason for Air India plane crash\nInternational airlines from South Korea and India are preparing to inspect its Boeing fleets following findings from the Air India crash investigation.\nDoomed Air India flight lost engine fuel mid-flight, cockpit chaos revealed in report\nCockpit recordings from the Air India crash reveal pilot confusion after fuel cutoff switches mysteriously flipped during takeoff, causing engines to lose power in the disaster.\nFOX Business Briefs 7/10\nDelta’s upbeat outlook dimmed by economic turbulence; Costco sales jumped in June; Volkswagen’s EV bus is a flop; FIFA opens office in Trump Tower; MLB to use robot umpires during All-Star game on FOX.\nChallenges loom for trucking industry with end of Trump's tariff pause\nPresident Trump’s 90-day pause on tariffs could be ending early this month. For truckers at Southern California’s ports, that could mean even more economic uncertainty.\nAirline giants rally behind Trump admin's 'critical' plan to overhaul outdated air traffic systems\nUS airline CEOs support $12.5 billion air traffic control overhaul in the \"One Big Beautiful Bill Act,\" as Secretary Duffy pushes for modernization to improve safety\nNTSB Chairman says there's only one reason why Alaska Airlines flight avoided catastrophe following door blowout\nNTSB Chairman Jennifer Homendy said on Tuesday that the Alaska Airlines door blowout incident in January 2024 was caused by \"multiple system failures,\" adding that the crew was the sole reason why the aircraft avoided complete catastrophe.\nFederal judge orders Trump admin to release EV funds signed by Biden to states\nA judge said President Trump exceeded constitutional authority by freezing former President Joe Biden's $5 billion electric vehicle infrastructure program.\nNTSB issues urgent safety bulletin about engines found in some Boeing 737 Max jets\nThe National Transportation Safety Board warned that certain CFM engines installed in some Boeing 737 Max jets may feed smoke into the cockpit or cabin after a bird strike.\nJudge blocks Trump admin's move to withhold certain federal funding from Denver\nA federal judge moved to grant a preliminary injunction blocking the Trump administration from pulling federal grants from local governments that did not meet certain conditions."
    },
    {
      "url": "https://www.foxnews.com/category/health/healthy-living/product-recalls",
      "text": "Health June 16 Gummy vitamins sold at major retailers recalled by FDA due to health concerns The FDA has announced a recall of some vitamin B12 gummy products from various brands nationwide due to a potential peanut allergen, with specific lot numbers identified.\nProduct Recalls June 11 Dr. Pepper Zero Sugar recall upgraded as FDA warns of serious health risk for diabetics Mislabeled Dr. Pepper Zero Sugar cans affect over 19,000 cases with full sugar content, creating potential health concerns for consumers with sugar restrictions.\nFood-Drink May 27 Deli meat, cucumbers top list of 'really risky foods' you might have in the fridge A 41% rise in food recalls in 2024 highlights the risk of salmonella, E. coli and listeria in common foods such as deli meats, cucumbers, raw milk and eggs, says Consumer Reports.\nFood-Drink May 16 Public health alert issued for chicken and bacon ranch wraps over listeria concerns A public health alert has been issued for some chicken and bacon ranch wraps sold in three northeastern states because of listeria concerns, according to the USDA's FSIS.\nProduct Recalls May 13 Yogurt products sold nationwide recalled due to undeclared almonds Low-fat yogurt parfaits sold in stores nationwide have been recalled because they contain almonds that weren't listed on the label, according to the U.S. Food and Drug Administration.\nProduct Recalls May 12 Undeclared eggs, soy, milk prompts recall of gluten-free baked goods A gluten-free bakery has recalled 16 products because they may contain undeclared eggs, soy and milk, according to the U.S. Food and Drug Administration. Here are details.\nProduct Recalls May 9 Jumbo pumpkin seeds from Canada could be contaminated with salmonella Organic jumbo pumpkin seeds made in Canada have been recalled because they could be contaminated with salmonella, the U.S. Food and Drug Administration said.\nProduct Recalls May 7 Snack food recalled amid undeclared presence of almonds and sesame The U.S. Food and Drug Administration said New England Village Foods has recalled its 19th Hole Snack Mix because the product may contain undeclared almonds and sesame.\nProduct Recalls May 6 Baked beans inspired by popular TV series recalled for undeclared allergen A total of 4,515 cases of baked beans from a food line inspired by a popular television series have been recalled because of an undeclared allergen. Here are details.\nFood-Drink May 4 Vine-ripe tomatoes recalled due to salmonella risk: 'Do not consume' An Indiana company is recalling vine-ripe tomatoes because of the potential that the items have been contaminated with salmonella. The tomatoes were sold in 11 states.\nProduct Recalls May 1 Over 2 million pressure cookers recalled after dozens of consumers suffer injuries In response to numerous injury reports, a leading appliance manufacturer is recalling more than 2 million units of its Ninja Foodi OP300 Series Multi-Function Pressure Cookers.\nProduct Recalls April 30 Ready-to-eat meat and poultry recalled after consumer complaints about taste, color Smith Packing LLC has recalled 18,792 pounds of ready-to-eat sausage and sliced meat and poultry products, which exceeded the regulatory levels of sodium nitrite, the USDA's FSIS said.\nProduct Recalls April 28 Chocolate-covered snack product sold in 16 states recalled for potentially undeclared almonds and cashews A sweet-and-salty snack has been recalled because of potentially undeclared almonds and cashews. It's the second such recall for Mauna Loa's products this year.\nProduct Recalls April 25 Apple juice recalled in 28 states due to toxic substance, FDA says Martinelli's is recalling some four packs of its 10-ounce glass apple juice bottles due to potential patulin contamination, according to the FDA. Here's what to know.\nProduct Recalls April 21 Public health alert issued for budget-friendly Mexican meal: 'Should be thrown away' The FSIS recently issued a public health alert for Aldi's pork carnitas, warning that the 16-ounce packages may be contaminated with metal as of April 19.\nProduct Recalls April 19 Enoki mushroom packages recalled for possible listeria contamination A brand of enoki mushrooms has been recalled because of possible listeria contamination. The U.S. Food and Drug Administration said the mushroom packages were distributed nationwide.\nProduct Recalls April 16 Food sold at Target is recalled due to elevated lead levels A Miami-based company that makes baby food sold under a Target store brand is recalling over 25,000 packages of a product that may contain elevated levels of lead.\nProduct Recalls April 14 Men's multivitamins recalled due to undeclared allergen: FDA A men's multivitamin brand has been recalled because it contains an undeclared allergen that could be fatal to certain consumers.\nProduct Recalls April 14 Food health alert issued for soups, bowl products after wood found in recalled ingredient The USDA's Food Safety and Inspection Service (FSIS) has issued a public health alert for various soups and bowl products that could be contaminated with wood.\nProduct Recalls April 13 'Bubbling' teriyaki sauce recalled after shelf-stable bottles began to swell: FDA A Japanese cooking sauce has been recalled because bubbling bacteria caused the bottles to swell, showing signs of micro growth, according to the FDA.\nProduct Recalls April 9 'Extra creamy' butter recalled due to stomach-churning bacterial contamination A batch of Cabot Creamery butter, distributed by Agri-Mark, was recalled because of coliform bacteria, prompting concerns about potential fecal contamination.\nProduct Recalls April 9 Peanuts distributed in 2 states recalled after customer experiences allergic reaction: FDA An Ohio nut company is recalling over 140 cases of its honey roasted peanuts because they might contain cashews, according to a notice from the FDA.\nFood-Drink April 5 Hot sauces recalled in 10 states due to undisclosed sulfites and other issues Due to bottling and labeling issues, two types of Texas Pete hot sauces have been recalled in 10 states, the T.W. Garner Food Company said this week. Some bottles may have undisclosed sulfites.\nProduct Recalls April 3 Fruit juice sold across 12 states is recalled for botulism concerns A fruit juice sold to at-home winemakers and commercial wineries in 12 states has been recalled amid botulism concerns, according to the FDA. Botulism is a rare but serious illness.\nProduct Recalls April 1 Food health alert issued for Costco chicken product imported from Canada The U.S. Department of Agriculture's Food Safety and Inspection Service issued a public health alert for a Costco product that is no longer available on store shelves.\nProduct Recalls April 1 Type of Trader Joe's salad dressing recalled for 'labeling error' amid possible undeclared allergens A salad dressing sold at Trader Joe's locations in 17 states and Washington, D.C., has been recalled because of a \"labeling error,\" the FDA announced on its site.\nProduct Recalls March 31 Chicken salad sandwich sold in vending machines recalled, plus brioche bread, too A chicken salad sandwich that is primarily sold in vending machines in two states has been recalled. Also recalled are hundreds of cases of a Texas company's brioche bread products.\nFood-Drink March 29 Liquid egg food products are recalled, may have been distributed nationwide Over 212,000 pounds of liquid egg products that were possibly distributed nationwide are being recalled, the U.S. Department of Agriculture’s Food Safety and Inspection Service said.\nProduct Recalls March 27 Tortilla chips sold in 13 states recalled for 'undeclared milk allergen' The chips are down: Some Tostitos tortilla chips sold in 13 states are being recalled because of an \"undeclared milk allergen.\" The recall affects fewer than 1,300 13-ounce bags.\nHealth March 26 Shampoo recalled for bacteria contamination that could cause infection A consumer brands manufacturer recalled more than 1,000 units of Tec Italy Totale Shampoo due to potential bacteria contamination, which can cause serious infection and health complications."
    },
    {
      "url": "https://www.foxnews.com/tech/luxury-mercedes-electric-van-65-inch-screen-42-speakers",
      "text": "This isn't your run-of-the-mill minivan, far from it. The Mercedes Vision V is shaking things up as a concept that gives us a sneak peek at what luxury vans could look like when they hit production in 2026.\nMercedes-Benz is on a mission to make you forget everything you thought you knew about family haulers. If you picture vans as boxy, practical and a little bit boring, the Vision V is here to flip that script with its bold looks, jaw-dropping tech and the kind of comfort that makes road trips feel like first-class flights.\nSign up for my FREE CyberGuy Report\nGet my best tech tips, urgent security alerts, and exclusive deals delivered straight to your inbox. Plus, you’ll get instant access to my Ultimate Scam Survival Guide free when you join.\nA striking exterior: Chrome, lights, iconic design\nFrom the moment you see the Vision V, it's clear Mercedes wants to turn heads. The exterior features sculpted lines and chrome accents, giving it a modern yet unmistakably Mercedes look.\nAt the front, you'll spot an ornate LED light bar connecting the headlights, just beneath a glowing three-pointed-star hood ornament. The grille has been completely reimagined, combining chrome and illuminated elements for a futuristic touch. Massive 24-inch wheels with illuminated details and a wraparound rear taillight ensure this van stands out on any road.\nCHEVY MAKES HISTORY AT DAYTONA 500 WITH FIRST ELECTRIC PACE CAR\nStep inside the Vision V: Lounge-inspired luxury\nClimb inside, and you're met with an interior that feels more like a private jet than a van. Mercedes uses rich wood trim, white Nappa leather, white silk, and polished aluminum to create an atmosphere that's both tranquil and glamorous. The seats are designed for ultimate comfort, featuring flexible tubular cushions that can recline completely flat, transforming into beds for long journeys or restful stops.\nEntering the Vision V feels special, thanks to a large, automatically opening portal door and an illuminated retractable running board. For privacy, a smart glass partition between the driver and rear passengers can shift from transparent to opaque with just a touch.\nImmersive technology: A digital experience like no other\nMercedes has packed the Vision V with technology that turns every ride into an event. The centerpiece is a massive 65-inch retractable 4K cinema screen that rises from the floor, instantly transforming the rear cabin into a private theater. The 42-speaker Dolby Atmos surround sound system, including four glass-encased speakers, delivers an audio experience that rivals top home cinemas.\nSeven hidden projectors in the roof and floor, along with windows that double as projection surfaces, allow for a 360-degree viewing experience. Ambient lighting can sync with your music, and a fragrance diffuser adds another layer of sensory delight.\nFLYING CAR WITH 620-MILE RANGE SCHEDULED FOR UPCOMING LAUNCH\nSeven digital environments: Personalize every journey\nMercedes has created seven unique \"digital environments\" for passengers to enjoy. In Entertainment mode, you can relax and watch movies or listen to music. Relax mode reclines your seat and fills the screen with soothing landscapes and sounds. If you're in the mood for gaming, there's a controller tucked away, and you can even simulate driving while being chauffeured.\nWork mode lets you take video calls and access productivity tools, while Shopping mode brings a virtual storefront right to your seat. Discovery mode uses augmented reality to let you explore your surroundings in 3D, and Karaoke mode is perfect for those moments when you want to sing along with friends.\nHOW SECURE IS MY PASSWORD? USE THIS TEST TO FIND OUT\nBuilt on the VAN.EA platform: The future of electric luxury vans\nThe Vision V is built on Mercedes' new VAN.EA electric platform, which will support a lineup of high-end electric vans starting in 2026. This new architecture means a spacious, flat-floor design and the flexibility to include all the advanced features that make the Vision V unique. Mercedes plans to launch production models with names like VLS and VLE, targeting the premium end of the market.\nCompeting in a new segment: Luxury vans for private owners\nWith the Vision V, Mercedes is targeting a growing trend of luxury vans for private ownership. While this segment has been popular in Asia, it's now making its way to the U.S. The Vision V is set to compete with high-end minivans like the Lexus LM and Volvo EM90, but it goes even further with its focus on digital experiences and personalized luxury.\nGET A FREE SCAN TO FIND OUT IF YOUR PERSONAL INFORMATION IS ALREADY OUT ON THE WEB\nCost and pricing expectations for the Mercedes Vision V\nWhile Mercedes-Benz has not officially announced the price for the production version of the Vision V, early reports and industry speculation suggest that this luxury van could cost around $200,000, especially for models equipped with all the high-end features seen in the concept.\nFor context, the current V-Class starts at about $60,000 in Germany and can exceed $100,000 with options, so it's reasonable to expect the Vision V to command a significant premium, positioning it well above existing luxury van offerings. As with most high-end vehicles, the final price will likely depend on customization and selected features, but the Vision V is clearly aimed at buyers seeking exclusivity and the ultimate in automotive luxury.\nSUBSCRIBE TO KURT’S YOUTUBE CHANNEL FOR QUICK VIDEO TIPS ON HOW TO WORK ALL OF YOUR TECH DEVICES\nKurt's key takeaways\nThe Mercedes Vision V is a clear signal that the luxury van market is about to get a serious upgrade. With its bold design, high-tech features, and focus on comfort, this van is set to offer a travel experience that feels truly special, whether you’re heading to a meeting or taking the family on a weekend getaway. While we don’t know the exact price yet, it’s safe to say the Vision V will be a premium choice for those who want something different from the usual luxury SUV. If you’re looking for space, style, and a bit of wow factor in your next ride, the Vision V is definitely one to watch.\nIf money were no object, would you choose to ride in ultimate comfort and style, even if it meant swapping your dream car for a luxury van like the Vision V? Or does practicality still win out, no matter how tempting the tech and features? Let us know by writing us at Cyberguy.com/Contact.\nFor more of my tech tips and security alerts, subscribe to my free CyberGuy Report Newsletter by heading to Cyberguy.com/Newsletter.\nAsk Kurt a question or let us know what stories you'd like us to cover.\nFollow Kurt on his social channels:\nAnswers to the most-asked CyberGuy questions:\n- What is the best way to protect your Mac, Windows, iPhone and Android devices from getting hacked?\n- What is the best way to stay private, secure and anonymous while browsing the web?\n- How can I get rid of robocalls with apps and data removal services?\n- How do I remove my private data from the internet?\nNew from Kurt:\n- Try CyberGuy's new games (crosswords, word searches, trivia and more!)\n- CyberGuy's exclusive coupons and deals\nCopyright 2025 CyberGuy.com. All rights reserved."
    }
  ],
  "argos_summary": "Kia America has issued two recalls affecting over 300,000 vehicles, including 201,149 Telluride models and 100,063 K5 models from 2023 to 2025, due to potential hazards from loose parts near doors and windows. The National Highway Traffic Safety Administration (NHTSA) reported that detached trim pieces could pose a road hazard, increasing crash risks. Owners are advised to bring their vehicles to Kia dealerships for free inspections and replacements, with notification letters expected to be mailed on September 26.",
  "argos_id": "YHS1G1OZB"
}