{
  "url": "https://www.forbes.com/sites/timlammers/2025/08/23/marvels-thunderbolts-arrives-on-disney-this-week/",
  "authorsByline": "Tim Lammers",
  "articleId": "16568feeea6f46c78d4e6a380989517b",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68aa46d6896353af29412c79/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T23:02:10+00:00",
  "addDate": "2025-08-23T23:08:27.028178+00:00",
  "refreshDate": "2025-08-23T23:08:27.028181+00:00",
  "score": 1.0,
  "title": "Marvel’s ‘Thunderbolts*’ Arrives On Disney+ This Week",
  "description": "Disney and Marvel Studios’ “Thunderbolts*” — starring Florence Pugh and Sebastian Stan — begins streaming on Disney+ this week. Find out when the latest Marvel Cinematic Universe adventure debuts on the streamer.",
  "content": "Disney and Marvel Studios’ Thunderbolts* — starring Florence Pugh and Sebastian Stan — begins streaming on Disney+ this week.\n\nRated PG-13, Thunderbolts* opened in theaters on May 2 and made its debut on digital streaming on July 1. The summary for Thunderbolts* reads, “Marvel Studios assembles an unconventional team of antiheroes — Yelena Belova (Pugh), Bucky Barnes (Stan), Red Guardian (David Harbour), Ghost (Hannah John-Kamen), Taskmaster (Olga Kurylenko) and John Walker (Wyatt Russell).\n\n“After finding themselves ensnared in a death trap set by Valentina Allegra de Fontaine (Julia Louis-Dreyfuss), these disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts. Will this dysfunctional group tear themselves apart, or find redemption and unite as something much more before it’s too late?”\n\nThunderbolts*, aka The New Avengers, will begin streaming on Disney+ on Wednesday, Aug. 27, per a recent announcement by the streaming platform.\n\nFor viewers who don’t have Disney+, the streaming platform offers various subscription options. Disney+ has an ad-based Disney+ Basic plan for $9.99 per month and an ad-free Disney+ Premium plan for $15.99 per month or $159.99 per year.\n\nDisney+ also offers a bundling package with fellow streaming platforms Hulu and Max, which costs $16.99 per month with ads and $29.99 per month without ads.\n\nIn addition to all of the action and adventure in Thunderbolts*, the film also tackles how people cope with depression — which is a message that Florence Pugh got totally behind.\n\n\"Really, I was just so impressed that Marvel wanted to do this version of the movie,” Pugh told Variety in an interview prior to the release of Thunderbolts* in theaters. “They’ve made some amazing films with amazing stunt sequences, but how cool to be able to say that we’ve made a movie that is about something that we all struggle with.”\n\nAs such, Pugh is confident that Thunderbolts* “will help a lot of people.”\n\n“The underlying message is that we need to be there for each other,” Pugh told Variety. “We need to open up. We need to connect. Like that, to me is, that would be an impressive movie anyway, let alone it being a Marvel movie that thousands of people are gonna go and watch.”\n\nDirected by Jake Schreier, Thunderbolts* arrives on Disney+ on Wednesday.",
  "medium": "Article",
  "links": [
    "https://variety.com/2025/film/features/florence-pugh-thunderbolts-interview-1236385097/",
    "https://www.forbes.com/sites/timlammers/2025/08/23/eminem-music-documentary-stans-new-on-streaming-this-week/",
    "https://www.forbes.com/sites/timlammers/2025/08/22/superman-set-to-pass-600-million-at-global-box-office-this-weekend/",
    "https://www.forbes.com/sites/timlammers/2025/08/22/peacemaker-season-2-why-does-argus-agent-sasha-look-so-familiar/",
    "https://www.forbes.com/sites/timlammers/2025/04/29/thunderbolts-reviews-do-critics-think-new-marvel-movie-has-zap/",
    "https://www.forbes.com/profile/florence-pugh/",
    "https://www.forbes.com/sites/timlammers/2025/05/02/hannah-john-kamen-on-rematerializing-as-ghost-in-thunderbolts/",
    "https://www.forbes.com/sites/timlammers/2025/08/21/peacemaker-season-2-release-schedule-when-do-new-episodes-come-out/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Thunderbolts",
      "weight": 0.09124601
    },
    {
      "name": "Florence Pugh",
      "weight": 0.08835292
    },
    {
      "name": "Pugh",
      "weight": 0.08029793
    },
    {
      "name": "Disney+",
      "weight": 0.080215
    },
    {
      "name": "Marvel Studios",
      "weight": 0.076343216
    },
    {
      "name": "fellow streaming platforms",
      "weight": 0.07197089
    },
    {
      "name": "Marvel",
      "weight": 0.06574263
    },
    {
      "name": "John Walker",
      "weight": 0.06251339
    },
    {
      "name": "amazing stunt sequences",
      "weight": 0.0596097
    },
    {
      "name": "Sebastian Stan",
      "weight": 0.058573086
    }
  ],
  "topics": [
    {
      "name": "TV"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.94384765625
    },
    {
      "name": "/Arts & Entertainment/Movies/Action & Adventure Films",
      "score": 0.74267578125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.5146484375
    },
    {
      "name": "/Arts & Entertainment/Movies/Science Fiction & Fantasy Films",
      "score": 0.447265625
    },
    {
      "name": "/Arts & Entertainment/Comics & Animation/Comics",
      "score": 0.42236328125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.41259765625
    }
  ],
  "sentiment": {
    "positive": 0.42586374,
    "negative": 0.22004698,
    "neutral": 0.35408932
  },
  "summary": "Disney and Marvel Studios' \"Thunderbolts*,\" starring Florence Pugh and Sebastian Stan, is set to begin streaming on Disney+ this week. The film, which opened in theaters on May 2 and debuted on digital streaming on July 1, is about an unconventional team of antiheroes led by Pugh, Stan, Yelena Belova, Bucky Barnes, Red Guardian, Ghost, Taskmaster, and John Walker. The streaming platform offers various subscription options, including an ad-based Disney+ Basic plan for $9.99 per month and an ad free Disney+ Premium plan for either $15.99 or $159.99.",
  "shortSummary": "Disney and Marvel Studios' Thunderbolts*, starring Florence Pugh and Sebastian Stan, is streaming on Disney+, offering various subscription options.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d7c74a1153d74856a311929a27d6d7b3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/04/29/thunderbolts-reviews-do-critics-think-new-marvel-movie-has-zap/",
      "text": "Thunderbolts* — Marvel’s antihero adventure starring Florence Pugh, Sebastian Stan and David Harbour — is opening in theaters Friday. What do critics have to say about the new film?\nThe official summary for Thunderbolts* reads, “Marvel Studios assembles an unconventional team of antiheroes — Yelena Belova (Pugh), Bucky Barnes (Stan), Red Guardian (Harbour), Ghost (Hannah John-Kamen), Taskmaster (Olga Kurylenko) and John Walker (Wyatt Russell).\n“After finding themselves ensnared in a death trap set by Valentina Allegra de Fontaine (Julia Louis-Dreyfuss), these disillusioned castoffs must embark on a dangerous mission that will force them to confront the darkest corners of their pasts. Will this dysfunctional group tear themselves apart, or find redemption and unite as something much more before it’s too late?”\nRated PG-13, Thunderbolts* is directed by Jake Scheier (Netflix’s Beef) and also stars Lewis Pullman, Geraldine Viswanathan, Chris Bauer and Wendell Pierce.\nThe review embargo for Thunderbolts* was lifted on Tuesday afternoon.\nThunderbolts* so far has earned an 88% “fresh” rating from Rotten Tomatoes critics based on 96 reviews. The RT Critics Consensus and Popcornmeter score is still pending.\nWhat Do Individual Critics Have To Say About ‘Thunderbolts*’?\nDavid Rooney of The Hollywood Reporter is among the top critics on RT who gives Thunderbolts* a fresh review, writing, “There’s a disarming freshness to this first-time assembly, not to mention something even more unexpected: heart. That’s due to an appealing ensemble cast but also to the new blood of a creative team with a distinctive take on the genre.”\nNicolas Barber of the BBC also praises Thunderbolts* in his “fresh” review on RT, noting that Thunderbolts* is so much better than most of Marvel's post-Endgame films. It's not just because it's a rough-edged, big-hearted spy thriller about lovably clueless anti-heroes. It's because it has an actor as charismatic as [Florence] Pugh at its center.”\nAlison Wilmore of New York Magazine/Vulture also praises Florence Pugh in her review on RT, writing, “Pugh, in particular, gives the movie an emotional tangibility that makes it feel realms more solid than the last few years of Marvel product.\nWilliam Bibbiani of The Wrap in one regard knocks Thunderbolts* but still gives the film a “fresh” review on RT, noting, “Although it’s hard to shake the sense that on a practical level this studio is just scraping the bottom of the barrel, desperately hoping their minor characters can be converted into headliners, they’ve done a damn good job of it.”\nIn his “fresh” review on RT, Peter Debruge of Variety compares the team members in Thunderbolts* to another famous band of MCU misfits, noting, “As with the Guardians of the Galaxy films, what works here is the uneasy tension within a team that comes together out of necessity, rather than any natural sense of affinity.”\nRobbie Collin of the U.K.’s Daily Telegraph is the sole top critic on RT who gives Thunderbolts* a “rotten” review to date, writing, “Despite its notionally spiky tone, moroseness is the film’s root chord.”\nThunderbolts* plays in Thursday previews before opening in theaters nationwide on Friday."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/21/peacemaker-season-2-release-schedule-when-do-new-episodes-come-out/",
      "text": "James Gunn and John Cena’s hit series Peacemaker is back with Season 2 after a three-year break. When will the new episodes be released?\nPeacemaker, aka Christopher Smith, was a role originated by Cena in Gunn’s 2021 DC Studios antihero movie The Suicide Squad, where he starred opposite Margot Robbie, Idris Elba, David Dastmalchian, Daniela Melchior, Joel Kinnaman and Viola Davis.\nSome of Cena’s castmates who played supporting roles in The Suicide Squad — including Jennifer Holland and Steve Agee — joined the actor for the first season of Peacemaker in 2022 and are back again for Season 2.\nAlso back from Peacemaker Season 1 are stars Danielle Brooks, Steve Agee, Freddie Stroma and Robert Patrick. Peacemaker Season 2 follows the events of Gunn’s summer movie sensation, Superman.\nThe logline for the new season of Peacemaker reads, “In Season 2, Peacemaker discovers an alternate world where life is everything he wishes it could be. But this discovery also forces him to face his traumatic past and take the future into his own hands.”\nJoining Peacemaker for Season 2 are Frank Grillo, David Denman, Sol Rodriguez and Tim Meadows.\nPeacemaker Season 2 consists of eight episodes, which were all written by Gunn. The filmmaker — who is the co-CEO of DC Studios with longtime collaborator Peter Safran — directs three of the eight episodes, including Episode 1.\nWhen Will The New Episodes For ‘Peacemaker’ Season 2 Be Released?\nPeacemaker Season 2 debuts Thursday on streaming on HBO Max at 9 p.m. ET/6 p.m. PT and on cable on HBO at 9 p.m. ET/PT with Episode 1. Below are the release dates for all eight episodes of Peacemaker Season 2.\nAug. 21: Episode 1 — The Ties That Grind\nAug. 28: Episode 2 — A Man Is Only as Good as His Bird\nSept. 4: Episode 3 — Another Rick up My Sleeve\nSept. 11: Episode 4 — Need I Say Door\nSept. 18: Episode 5 — Back to the Suture\nSept. 25: Episode 6 — Title TBA\nOct. 2: Episode 7 — Title TBA\nOct. 9: Episode 8 — Title TBA\nApart from James Gunn, episodes for Peacemaker Season 2 will be directed by Greg Mottola, Peter Sollett and Althea Jones. Gunn, who created Peacemaker and is the series’ showrunner, executive-produced Season 2 with Peter Safran and John Cena."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/23/eminem-music-documentary-stans-new-on-streaming-this-week/",
      "text": "Stans — a music documentary about iconic rapper Eminem and how his songs have resonated with his enormous fan base — is coming to streaming this week.\nStans opened in theaters in limited release on Aug. 7. The title of the feature-length documentary was inspired by the name of Eminem’s legendary song released 25 years ago.\n“Released in 2000, Eminem’s song ‘Stan,’ about an obsessive, unstable fan, remains iconic — so iconic that the term stan was officially added to the Oxford English Dictionary in 2017,\" reads the official summary of Stans from Paramount+. \"The song and its storyline serve as a guiding light for this unconventional and fully authorized feature, which follows a cast of real-life stans whose deep personal connections to Eminem mirror some of the many themes found throughout his lyrics.\n“More than just an exploration of fandom, Stans examines the complicated relationship between one of the world’s most private artists and his massive public persona. Through stylized recreations, rare archival footage and intimate original interviews, it offers a raw, loud and revealing journey across Eminem’s career and the passionate audience that has grown with him.”\nStans will make its streaming premiere on Tuesday, Aug. 27, on Paramount+.\nThe streaming platform has two tiers. Paramount+ Essential is an ad-based tier that costs $7.99 per month, while Paramount+ Premium is an ad-free tier and costs $12.99 per month. Both tiers offer a free seven-day trial.\nDirector Says One Line In ‘Stan’ Song Echoes Through ‘Stans’ Movie\nIn addition to being featured in Stans, Eminem — whose real name is Marshall Mathers III — produces the documentary. Stans is directed by Emmy Award-winning writer, director and investigative journalist Steven Leckart.\n“'Stan' is one of the most unconventional songs ever written, where the story is mostly told from a fan's perspective, so this film was an incredible opportunity to find a unique approach,” Leckart said in the Paramount+ press release announcing the streaming date of Stans.\n“We kept coming back to one lyric from the song: 'I’m just like you.’ Fans who echo that same sentiment carry much of the film,\" Leckhart added. \"But like the song, Marshall's perspective was also essential to the movie. I'm grateful for just how candid, sincere and frequently hilarious he was.\"\nStans was a huge hit with Rotten Tomatoes critics, who gave the film a 93% “fresh” review based on 14 reviews. Stans also received a 94% “fresh” score on RT’s Popcornmeter based on 100-plus verified user ratings.\nStans debuts on streaming on Paramount+ on Tuesday."
    },
    {
      "url": "https://variety.com/2025/film/features/florence-pugh-thunderbolts-interview-1236385097/",
      "text": "Florence Pugh might have daredevil in her DNA.\nAt last summer’s San Diego Comic-Con, Pugh revealed that she had a major stunt in “Thunderbolts”: jumping off the second tallest building in the world, Merdeka, a 118-story skyscraper in Kuala Lumpur, Malaysia. It’s the type of terrifying feat that would freak most grandparents out, but Pugh’s grandmother, affectionately called “Granzo Pat,” didn’t seem to bat an eyelash during the London premiere of the Marvel movie.\n“She loved the movie. She said, ‘Brilliant, darling. Very thrilling,’ but I didn’t ask her what she thought of the jump,” Pugh tells Variety in Los Angeles a few days later. “She’s also crazy, like she’s someone that does some pretty mad stuff, so maybe she just thought that was a walk in the park.”\nPopular on Variety\nWith the once-in-a-lifetime stunt, Pugh adds “Guinness World Record holder” to her already impressive resume, but she didn’t do it for the personal glory. “I wanted to do that stunt because I knew that it meant that we all got to do it. Like, yes, I got to jump off the second-tallest building in the world, but so did we all,” Pugh says of sharing the record with longtime Marvel stunt coordinator Heidi Moneymaker and base jumper Katie Hansen. “That day in Malaysia was an achievement for all of us. We all got to say that we worked on that stunt, and what an impressive and powerful way to start a movie!”\nIndeed, the freefall underscores the idea that “Thunderbolts*,” in theaters now, is a totally different kind of Marvel movie — one that uses its action to alert the audience that Pugh’s kick-ass mercenary Yelena Belova is not really enjoying her job. That’s the early vibe of director Jake Schreier’s superhero team-up movie, which assembles a crew of antiheroes — Black Widow agent Yelena Belova (Florence Pugh); Bucky Barnes, a.k.a. the Winter Soldier (Sebastian Stan); Russian super soldier — and Yelena’s adopted dad — Red Guardian (David Harbour); the disgraced former “Captain America” John Walker (Wyatt Russell); the invisible spy Ghost (Hannah John-Kamen); and combat expert Taskmaster (Olga Kurylenko) — to face their darkest sides of themselves.\nThat beginning makes quite a powerful statement, because this movie is about depression and grappling with shame — things you wouldn’t have expected from a summer blockbuster. What was it like to delve into those themes?\nReally, I was just so impressed that Marvel wanted to do this version of the movie. They’ve made some amazing films with amazing stunt sequences, but how cool to be able to say that we’ve made a movie that is about something that we all struggle with.\nThis movie will help a lot of people. And the underlying message is that we need to be there for each other. We need to open up. We need to connect. Like that, to me is that would be an impressive movie anyway, let alone it being a Marvel movie that thousands of people are gonna go and watch.\nYou’ve described Yelena as a very raw character, but she’s also very empathetic and very lonely. What was it like getting a chance to take her on this journey where she’s finally finding her team, that family that she’s looking for?\nOne of the things that I love about her is that she’s always trying to help the person that maybe isn’t as strong, or maybe needs a bit of love. She did that with Kate Bishop [in “Hawkeye”]; she did that with Bob. She saved the hamster — she adopted Fanny Longbottom. Like she’s someone that really understands what it feels like to need help.\nBecause she was left when she was younger and because she had that open-wounded relationship with her sister, it meant that she’s very sympathetic to people, and even though she’s going through her own trauma in this movie, like that’s still there. She still wants to save the hamster, and she still wants to help Bob, and that’s a really beautiful thing to play. So yes, she is raw, but she is also very loving. And even when she is feeling low, she is loving. And I love that about her.\nIt’s beautiful to watch her realize that suppressing her pain is not the right answer. Then, you and David have a heart-tugging scene where Yelena breaks down over all her regrets. What did you make of that when you read it on the page? What did you want to explore with that father-daughter relationship?\nIt wasn’t there on the page — there was a version of it, and it was fine, but it didn’t allow us to shout about the important things.\nIn the original script, there wasn’t anything to do with Natasha; it was all about them just finding each other annoying and that was just something that David and I were so adamant about. Like, we can’t not have these characters discuss the elephant in the room. We can’t have these two people be pretending as if the last however many years, didn’t happen. They have to shout at each other. That’s what they’re angry about. They haven’t communicated with each other; they haven’t been in each other’s lives.\nAnd grief sometimes does that. Grief is a painful, embarrassing and horrible hole that you get stuck in. They are both flawed, and they need a moment to just like, fucking shout at each other and tell each other they love each other. So, we were very passionate about that — and Jake was so excited that we were — and we just went through versions of what we wanted to say to each other.\nThen on that day, when we got to do it, I love working with David. He’s so big and he’s so loud and emotional – both of those characters are such impressive personalities — that it was really, really cool to be able to have a fight. Basically, they just need to have a cuddle.\nExactly, that would solve it. I was thinking back to Comic Con, when you and I found out — and freaked out — over the fact that Robert Downey Jr. was going to be in “Avengers: Doomsday.” Now, there’s even more people.\nLoads of people.\nWho else did you freak out over finding out they were going to be in it, too? I screamed when I saw Sir Patrick Stewart and Sir Ian McKellan were announced.\n100%! Oh, god, there’s too many people in it [to choose]! Pedro Pascal, obviously, always and forever. Paul Rudd, yes, so funny. Genuinely, the idea that all of those people are going to be in the same movie is nutso sauce.\nAs you move on to make that film, Yelena will now be in that “front-facing role” that she asked for. What are you looking forward to most about getting a chance to explore a new side of her?\nI hope that she’s happy now. I hope that she feels fulfilled, like she has purpose. And I hope that we get to see some of her light and her charm and her color again, because I loved playing that before."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/22/peacemaker-season-2-why-does-argus-agent-sasha-look-so-familiar/",
      "text": "James Gunn and John Cena’s Peacemaker” Season 2 adds new characters, including ARGUS Agent Sasha Bordeaux, played by Sol Rodriguez. What else has Rodriguez starred in?\nPeacemaker Season 2 premiered Thursday night on streaming on HBO Max and cable on HBO. The logline for the second season reads, “In Season 2, Peacemaker (Cena) discovers an alternate world where life is everything he wishes it could be. But this discovery also forces him to face his traumatic past and take the future into his own hands.”\nPeacemaker Season 2 finds Peacemaker’s ARGUS black ops team in ruins, with Gen. Rick Flag Sr. (Frank Grillo) replacing the team’s former director, Amanda Waller (Viola Davis). Bordeaux is one of Flag’s top agents, and she supervises Agent John Economos (Steve Agee) and the newly transferred Agent Langston Fleury (Tim Meadows).\nBorn April 17, 1990, in Buenos Aires, Argentina, Rodriguez made her screen debut in one of the lead roles in Grachi, a supernatural fantasy series produced by Nickelodeon Latin America from 2011-2013.\nFrom there, Rodriguez had starring roles in the telenovelas Marido En Alquiler from 2013-2014 and Tierra de Reyes from 2014-2015, which both aired on Telemundo.\nAfter that, Rodriguez had a starring role in the Univisión Network mystery thriller series Demente Criminal in 2015. Rodriguez made her American television debut in 2016 and went on to star in such projects as the TV movie remake of Urban Cowboy (2016) and had a recurring role in the reboot of the TV series Party of Five, which ran for one season in 2020.\nMore recently, Rodriguez starred opposite Danny Trejo in the supernatual horror comedy Seven Cemeteries.\nBelow are some of the screen projects that Rodriguez starred in, which may explain why she looks so familiar in Peacemaker Season 2.\n‘Devious Maids’ (2016)\nFollowing the success of his hit series Desparate Housewives, producer Marc Cherry created Devious Maids, which ran for four seasons on Lifetime from 2013-2016. The comedy-drama-mystery series followed four Latina women who worked for the rich and shameless in Beverly Hills, Calif.\nSol Rodriguez joined Devious Maids as a regular cast member in Season 4, where she played Daniela Mercado, an aspiring singer and daugher of one of four “devious maids,” Carmen Luna (Roselyn Sanchez).\n‘Star Trek: Picard’ (2022)\nSol Rodriguez starred in a recurring role of Dr. Teresa Ramirez in Season 2 of the Patrick Stewart series Star Trek: Picard on Paramount+ in 2022.\nRodriguez appeared in seven of the 10 episodes in Star Trek: Picard Season 2, where Ramirez runs Clinica Las Mariposas in Los Angeles in 2024.\n‘Holiday In The Vineyards’ (2023)\nSol Rodriguez and Josh Swickard starred in the lead roles of Valentina Espinoza and Carter Baldwyn in the Netflix movie Holiday in the Vineyards.\nIn the romantic comedy drama, Valentina is a widowed mother of two children who is struggling to keep her vineyard open as a potential new romance begins to develop with Carter.\nSol Rodriguez stars as ARGUS Agent Sasha Bordeaux in James Gunn’s Peacemaker Season 2, new on streaming on HBO Max and cable on HBO."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/05/02/hannah-john-kamen-on-rematerializing-as-ghost-in-thunderbolts/",
      "text": "With the new Marvel movie Thunderbolts*, Hannah John-Kamen is getting a rare opportunity for any actor in any type of movie.\nStarting out as the main villain, Ava Starr/Ghost, in 2018’s Marvel Cinematic Universe hit Ant-Man and the Wasp, John-Kamen’s character has turned away from being an out-and-out villiain into an antihero in Thunderbolts*.\nAs such, Ghost is part of a group of bad guys taking on the worse guys, where she, Yelena Belova (Florence Pugh), Bucky Barnes (Sebastian Stan), Red Guardian (David Harbour) and John Walker (Wyatt Russell) have the propensity to do good things despite their checkered pasts.\nWhile Thunderbolts* has all the action, intensity and suspense that fans of the MCU have come to know and love since Iron Man kicked off the sprawling movie series in 2008, it fully embraces an antihero ideology, which to date has largely been about superheroes.\nBut being a hero who does good things isn’t fully out of the depth of the members of the group in Thunderbolts*.\n“What this movie does is it forces us not to just to be a team, but gives the ability look at ourselves and ask for forgiveness so we can actually dream bigger than what we thought we could … that the idea of being a hero isn't so ridiculous,” John-Kamen said in a Zoom conversation Friday. “We’ve been trained into a routine to think that we don't deserve it otherwise. I think this movie gives us so more depth for our characters and so much more of a journey to go on.”\nHannah John-Kamen Loved The Opportunity To Play A New And Improved Ava/Ghost\nOpening in theaters worldwide on Friday, Thunderbolts* is set not long after the events of the previous MCU chapter Captain America: Brave New World. At the beginning of the film, Yelena is sent by CIA Director Valentina Allegra de Fontaine (Julia Louis-Dreyfus) to eliminate a target at a secret O.X.E. facility where superhuman experiments are being conducted.\nWhen Yelena arrives at the facility, she encounters Ghost, John Walker and Taskmaster (Olga Kurylenko), who have also been sent to the facility with similar orders from Valentina to essentially eliminate one another. To survive politically, Valentina needs to wash her hands of any illegal covert government activities. If her dirty secrets are exposed, Valentina faces orders of impeachment from U.S. Congress.\nHowever, when the group of would-be assassins survives Valentina’s attempt at their across-the-board elimination, they make like the old Avengers and assemble a team — along with Bucky and the Red Guardian — to apprehend the CIA director and thwart her plans to introduce a new and very dangerous superhuman to the world dubbed “The Sentry.”\nSince Ava/Ghost’s story in Thunderbolts* is dictated by Eric Pearson and Joanna Calo’s script — as well as filmmaker Jake Schreier’s direction — Hannah John-Kamen said she didn’t necessarily try to enhance who Ava/Ghost was in 2018’s Ant-Man and the Wasp.\nEffectively, Thunderbolts* signals a new day for Ava/Ghost, which means she was happy to leave who her character was in Ant-Man and the Wasp in the rear-view mirror.\n“Jake and I really discussed this because it’s a different Ava. I've really wanted to leave the other Ava behind in a way because in [Ant-Man and the Wasp], I played a girl who was completely riddled with pain and death,” John-Kamen explained. “That was the driving force behind her bad decision-making. Her uncontrollable, naive and immature ways of trying to deal with her survival was to kill other people, so she lost her way and lost her control completely.”\nNow, John-Kamen said, Ava/Ghost — who has an unstable molecular composition that allows her to move through objects like a specter — “has matured and is all grown up and in control of her powers.”\n“She’s got a very hard exterior … and she doesn’t depend on anyone,\" John-Kamen said. \"She doesn't need anyone, and she’s in a different rhythm completely, not the rhythm in the original movie.”\nAnother big change for Ava/Ghost is a whole new outfit, which has is jet black and has a commando feel — the polar opposite of her white, ghostlike attire in Ant-Man and the Wasp.\n\"The new costume is insanely detailed and beautiful,” John-Kamen enthused. “It’s really a big part of your day in Marvel Universe when we’re filming because when we block the scenes, we’re all in our undergarments and leggings with Ugg boots on set. As soon as we all get suited up — which is a good 25-minute process — and we return to set, it feels like we have different powers. Your posture changes. Everything you do feels elevated.”\nOn top of that, John-Kamen’s costumes in Ant-Man and the Wasp and Thunderbolts* define who Ava/Ghost is in dramatically different ways.\n“The original Ghost costume was interesting because it was so badass before, but it was also functional,” John-Kamen explained. “The idea was that Ava and Bill Foster (Laurence Fishburne) had created this costume for her to not flicker away to death. It was more of a practical thing because it was a chamber that she was in.\n“In Thunderbolts*, Ava is in a costume that was made for Ghost’s abilities,” John-Kamen added. “It’s elevated and has a different power and energy and a different control. It’s scarier and it's more warrior.”\nRated PG-13, Thunderbolts* also stars Lewis Pullman, Geraldine Viswanathan, Chris Bauer and Wendell Pierce. Thunderbolts* opens in theaters worldwide on Friday.\nNote: Some quotes in this interview feature for “Thunderbolts*” were condensed and edited for clarity."
    },
    {
      "url": "https://www.forbes.com/sites/timlammers/2025/08/22/superman-set-to-pass-600-million-at-global-box-office-this-weekend/",
      "text": "James Gunn’s Superman, starring David Corenswet as the Man of Steel, is ready to pass another box office milestone this weekend.\nSuperman — the first film released under Gunn and Peter Safran’s reign as co-CEOs at Warner Bros.’ DC Studios division — opened in theaters on July 11, earning $125 million in its first weekend domestically.\nThe film held the domestic box office crown in its second weekend with a $58.3 million take, but was knocked down to No. 2 in its third weekend by Disney and Marvel Studios’ The Fantastic Four: First Steps, which earned $117.6 million in its opening frame in North American theaters. Since then, Superman’s box office run has held steady while The Fantastic Four has taken a nose dive.\nHeading into its seventh weekend of release, Superman was expected easily top the $600 million mark worldwide once Friday’s box office numbers rolled in and it did. Through Thursday, Superman had a tally of $343.5 million in North American ticket sales and $256 million at the international box office for a running worldwide tally of $599.5 million.\nOn Friday, Superman earned $955,000 domestically and $400,000 internationally to boost the film’s worldwide tally to $600.9 million.\nDespite reaching the $600 million benchmark, only time will tell if Superman will become profitable during its theatrical run. According to Variety, Superman had a production budget of $225 million and a worldwide marketing spend of $125 million.\nIf the standard rule applies where theaters keep 50% of the ticket sales, that means Superman — not counting any residuals or miscellaneous payouts — still has some financial ground to cover. However, in additon to its ticket sales, Superman just opened another revenue stream on Aug. 15 when the film debuted on digital streaming via premium video on demand.\nThe release of the film on PVOD compliments the release of Gunn’s Peacemaker Season 2, which debuted with Episode 1 on HBO Max on Thursday. Set after the events of Superman, Peacemaker’s new season includes characters from Superman as the John Cena-led series continues to build out Gunn and Safran’s new DC Universe.\nAnother Warner Bros. Release Just Reached A Box Office Milestone\nThere’s no question that it’s been a great year at the box office for Warner Bros., which prior to the release of Superman, scored huge hits with A Minecraft Movie, Sinners, Final Destination Bloodlines and now, Weapons (F1: The Movie could be counted among Warner Bros.’ wins, too, but the studio is only on board as distributor of the movie, which is an Apple Original Films production).\nOn Thursday, the Julia Garner and Josh Brolin horror thriller made $2.4 million in North American ticket sales, boosting its domestic tally to $100.2 million.\nVariety said passing the $100 million domestic box office milestone is a win for Warner Bros., considering that the Weapons had a $38 million production budget before prints and advertising.\nCoupled with the film’s international take of $72.3 million, Weapons to date has a worldwide tally of $172.5 million.\nWeapons — which took the domestic box office crown in its opening weekend and nabbed it again in its second weekend frame — is facing tough competition in its third weekend when the sing-along version of the Netflix streaming sensation KPop Demon Hunters hits theaters for a special weekend release.\nKPop Demon Hunters is projected by Deadline to earn $15 million-plus domestically this weekend, so Weapons will need to top that tally to keep its box office crown. As of Friday, Deadline is projecting that Weapons will earn $13.5 million in its third weekend frame.\nThis weekend also sees the release of some notable indie titles, including Ron Howard’s survival thriller Eden, Ethan Coen’s crime comedy Honey Don’t and the English language dub of the worldwide box office blockbuster Ne Zha 2."
    }
  ],
  "argos_summary": "Disney+ is launching the Marvel film Thunderbolts this week, a PG‑13 anti‑hero ensemble that has earned an 88% fresh rating on Rotten Tomatoes and features Florence Pugh’s take on depression and redemption.  The article also covers the film’s subscription options, Pugh’s interview with Variety, and the release of the documentary Stans on Paramount+ that explores Eminem’s fan culture.  In addition, it lists the weekly release dates for Peacemaker Season 2 on HBO Max, and notes the box‑office milestone of Gunn’s Superman, which has crossed the $600 million mark worldwide.  Together, the piece highlights new streaming content, critical reception, and current box‑office highlights across Disney, Paramount, and Warner Bros. studios.",
  "argos_id": "0VNAVEXWU"
}