{
  "url": "https://www.cnbc.com/2025/08/23/morgan-stanley-says-market-and-economy-are-telling-diverging-stories-.html",
  "authorsByline": "Brian Evans",
  "articleId": "e05afcdfbf304edabf426e338c633f14",
  "source": {
    "domain": "cnbc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Bergen County",
      "city": "Englewood Cliffs",
      "coordinates": {
        "lat": 40.8853773,
        "lon": -73.9523597
      }
    }
  },
  "imageUrl": "https://image.cnbcfm.com/api/v1/image/108189145-17557897802025-08-21t151957z_1233588085_rc2pbgay5zhg_rtrmadp_0_usa-stocks.jpeg?v=1755789916&w=1920&h=1080",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T11:44:07+00:00",
  "addDate": "2025-08-23T11:49:02.772021+00:00",
  "refreshDate": "2025-08-23T11:49:02.772023+00:00",
  "score": 1.0,
  "title": "Why Morgan Stanley says the market and the economy are telling 'diverging' stories",
  "description": "U.S. stocks have proven resilient even as the Trump administration haphazardly implements  policy changes, according to Morgan Stanley.",
  "content": "U.S. equities have proven resilient even as the Trump administration haphazardly implements policy changes, according to Morgan Stanley. The S & P 500 has risen almost 10% so far in 2025, while the Nasdaq Composite is higher by more than 11% and the Dow Jones Industrial Average is ahead more than 7%. Stocks have climbed even as policy changes, from President Donald Trump's higher tariffs to his extension of tax cuts from his first term to immigration limits, have spurred concern over the health of the economy and the state of consumer spending. Hiring has slowed meaningfully in recent months, while inflation has remained stubbornly above the Federal Reserve's 2% target . \"The economy and markets have been telling diverging stories: macroeconomic data point to an incrementally weakening environment, while the S & P 500 has posted positive year to date performance after April's significant low,\" strategists and economists led by Ariana Salvatore wrote in a report earlier this week. The Morgan Stanley strategists attributed the diverging paths for the economy and the market to the varying impacts that the specific policy changes have had on different sectors of the market, and those segments' differently weighted share of the total S & P 500 market capitalization. Their conclusion is that while the policy shifts have added macroeconomic concern, stock investors are assessing the impacts on a company-by-company and sector-by-sector basis rather than keying on broad brush concerns. Limited market cap weight \"For example: tariffs are a clear headwind to margins for certain industries, but the overall market cap weight of these groups is limited,\" Salvatore wrote. \"In short, the negative impacts (e.g., tariffs, immigration) are concentrated in sectors that do not represent a significant portion of S & P market cap, while the tailwinds (e.g., taxes, deregulation) are more dispersed among a broader cohort that drives index-level performance.\" The broad picture implies an \"incrementally weaker\" macroeconomic environment in the future, but without a recession, Salvatore said. In that climate, equities as a whole should continue to outperform, with the brunt of the negative impacts from policy shifts concentrated in consumer discretionary stocks, Morgan Stanley said. Sectors that ought to remain resilient include industrials, driven by artificial intelligence tailwinds, as well as semiconductors. \"Although the on-again-off-again tariff policies on the surface appear volatile, the economy is in the middle of an expansion and company fundamentals are solid with one notable exception, health care,\" where there's an existential threat to profit margins, said Eric Teal, chief investment officer at Comerica Wealth Management. Stocks have slowed as of late, with Microsoft, Netflix, Walmart and Apple all retreating this past week, and the S & P 500 sliding for five straight days through Thursday. On Friday, investors were encouraged by remarks by Federal Reserve Chair Jerome Powell at the central bank's annual economic symposium signaling that the central bank could lower interest rates as soon as next month. \"The recent activity is starting to play out true to seasonal and technical form – August and September have been the two worst performing and most volatile months over the last 20 years,\" said Jay Woods, chief global strategist at Freedom Capital Markets. \"It may prove to be that way again. The recent price action is a normal digestive phase in a secular bull market and is setting the stage for a great year-end rally.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Limited market cap weight",
      "weight": 0.07596641
    },
    {
      "name": "markets",
      "weight": 0.07277377
    },
    {
      "name": "policy changes",
      "weight": 0.07243571
    },
    {
      "name": "policy shifts",
      "weight": 0.06740571
    },
    {
      "name": "chief global strategist",
      "weight": 0.061946303
    },
    {
      "name": "macroeconomic concern",
      "weight": 0.06101191
    },
    {
      "name": "S & P market cap",
      "weight": 0.060138576
    },
    {
      "name": "recent months",
      "weight": 0.05943169
    },
    {
      "name": "Federal Reserve Chair Jerome Powell",
      "weight": 0.059224796
    },
    {
      "name": "different sectors",
      "weight": 0.059132908
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9921875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91015625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.8310546875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.79296875
    }
  ],
  "sentiment": {
    "positive": 0.10883519,
    "negative": 0.7208706,
    "neutral": 0.17029421
  },
  "summary": "U.S. equities have remained resilient despite the implementation of policy changes by the Trump administration, according to Morgan Stanley. The S & P 500 has risen almost 10% so far in 2025, while the Nasdaq Composite is higher by more than 11% and the Dow Jones Industrial Average is ahead more than 7%. This has led to concern over the health of the economy and state of consumer spending. However, employment has slowed and inflation has remained above the Federal Reserve's 2% target. The diverging paths for the economy, attributed to differing policy impacts on different sectors of the market. While policy shifts have caused concern, stock investors are now assessing the impacts on a company-by-company basis rather than broad-scale concerns.",
  "shortSummary": "Despite chaotic Trump administration policy changes, US equities have risen despite concerns over economic health and consumer spending, driven by different sectoral factors like tariffs and inflation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "911ed2caafbb479683517191cfef0507",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Morgan Stanley reports that the S&P 500 has risen nearly 10% in 2025 despite Trump’s tariff hikes, tax extensions, and immigration limits, citing sector‑level analysis that shows negative impacts are confined to a small market‑cap portion of the index. The firm argues that AI tailwinds and semiconductor growth keep industrials and tech resilient, while consumer discretionary stocks bear the brunt of policy headwinds. Economists warn of an incrementally weaker macro environment but no recession, suggesting equities should continue to outperform. Recent market pullbacks are framed as a normal seasonal correction ahead of a potential year‑end rally, with the Fed hinting at possible rate cuts next month.",
  "argos_id": "51977HQR5"
}