{
  "url": "https://www.foxnews.com/media/democrats-urged-ditch-privilege-latinx-dozens-other-terms-alienating-voters",
  "authorsByline": "Kristine Parks",
  "articleId": "b279cba6708e4a9990694c8f707e0469",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/white-privilege-protest-sign-1.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T09:00:33-04:00",
  "addDate": "2025-08-23T13:10:08.700812+00:00",
  "refreshDate": "2025-08-23T13:10:08.700815+00:00",
  "score": 1.0,
  "title": "Democrats urged to ditch 'privilege,' 'Latinx' and dozens of other terms 'alienating' voters",
  "description": "Democratic think tank Third Way released a blunt memo Friday urging the party to abandon \"therapy-speak\" and \"seminar room language\" that alienates voters.",
  "content": "A blunt memo circulated Friday urges Democrats to ditch \"elitist\" jargon that is alienating to voters if they want to defeat President Donald Trump's agenda.In the message titled, \"Was It Something I Said?,\" Democratic think tank Third Way warned Democratic officials against using language packed with progressive framing, labeling such terms as \"therapy-speak,\" \"seminar room language,\" and \"organizer jargon,\" among others.The memo highlighted 44 words and phrases seen as divisive, including \"privilege,\" \"safe space,\" \"existential threat,\" \"the unhoused,\" \"birthing person,\" \"Latinx,\" and \"incarcerated people.\" Third Way argues these terms make Democrats appear like radical \"enforcers of wokeness\" to the average American.OBAMA BROS CONFRONTED ON DEMOCRATIC PARTY'S INTOLERANCE PROBLEM, HISTORY OF ‘EXCLUDING PEOPLE’Third Way stressed it is not policing language. The group even admitted using some of these terms in its own papers. However, it urged Democratic officials to reflect before using such terms.\"Before you draft your angry tweet thread, think about conversations with persuadable voters in your own life—especially friends, family, and co-workers—and consider whether the use of the language above would help or hurt your case,\" the Third Way memo said. The group argued that these terms raise red flags for many Americans, not because they are bigoted, but because they fear cancellation for speaking freely around liberals who use these terms.Matt Bennett, Third Way's executive vice president of public affairs, told Fox News Digital the memo was intended for \"everyone in Democratic politics who has a public-facing role.\"CARVILLE SAYS DEMS 'BETRAYED' WORKING-CLASS VOTERS BY NOT INCLUDING THEM IN 'TOO-COOL-FOR-SCHOOL' COALITION\"When elected officials, candidates, and high-profile spokespeople use this kind of language, it is deeply alienating. And while it might be well-intentioned, by empowering the right, it ends up hurting the very people it’s intended to shield,\" he said.The group adds its messaging push stems from frustration with what they view as \"damaging, self-defeating language being weaponized against our allies.\"\"Even after the terrible losses in November, too many on the left have not gotten the message that they live in a bubble and that folks outside of that bubble think that kind of language is somewhere between silly and offensive,\" Bennett added.The memo aligns with broader concerns raised by prominent Democrats since the November election.Former Democratic Chicago Mayor Rahm Emanuel warned in June that Democrats needed to stop worrying about identity politics and become a big-tent party again if they wanted to win elections.\"Why do Democrats have a problem?\" he told \"The Bulwark\" host Tim Miller. \"Because we're punks, and we not only talk like punks, we talk down to people, we get caught up in a set of issues that aren't relevant.\"On \"Inside Politics\" on Friday, CNN's John King said that Third Way had a point about Democratic messaging resonating with voters.\"A lot of people used to be Democrats who are now Trump voters,\" King said. \"They do think the Democratic Party speaks a different language.\"King said politicians and journalists should talk about things that are relevant to most of America, not just those in \"New York or San Francisco.\"\"But I do think people in middle America think that the elitists have lost their way and speak a language that they don’t understand,\" he continued.",
  "medium": "Article",
  "links": [
    "https://www.thirdway.org/memo/was-it-something-i-said",
    "https://www.foxnews.com/media/jimmy-kimmel-admits-repulsive-liberal-scolds-driving-people-away-from-democratic-party",
    "https://www.foxnews.com/media",
    "https://www.foxnews.com/media/rahm-emanuel-warns-dems-have-become-party-punks-who-talk-down-people-fret-over-identity-politics",
    "https://www.foxnews.com/media/bill-maher-admits-he-still-fears-getting-canceled-despite-cultural-vibe-shift-after-election",
    "https://www.foxnews.com/media/carville-says-dems-betrayed-working-class-voters-not-including-them-too-cool-for-school-coalition",
    "https://www.foxnews.com/media/obama-bros-confronted-democratic-partys-intolerance-problem-history-excluding-people",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/video/6369604103112",
    "https://www.foxnews.com/video/6377264687112"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Democratic think tank Third Way",
      "weight": 0.08065571
    },
    {
      "name": "language",
      "weight": 0.0753236
    },
    {
      "name": "Third Way",
      "weight": 0.07297984
    },
    {
      "name": "Democratic officials",
      "weight": 0.07287958
    },
    {
      "name": "Democratic politics",
      "weight": 0.07149876
    },
    {
      "name": "Democratic messaging",
      "weight": 0.069575235
    },
    {
      "name": "such terms",
      "weight": 0.069228165
    },
    {
      "name": "prominent Democrats",
      "weight": 0.068446666
    },
    {
      "name": "Trump voters",
      "weight": 0.06759362
    },
    {
      "name": "other terms",
      "weight": 0.06611568
    }
  ],
  "topics": [
    {
      "name": "Voters"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9873046875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.93359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7783203125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.41552734375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.3427734375
    }
  ],
  "sentiment": {
    "positive": 0.046198197,
    "negative": 0.7351177,
    "neutral": 0.2186841
  },
  "summary": "A memo by Democratic think tank Third Way has urged Democrats to abandon \"elitist\" jargon that is alienating voters to defeat President Donald Trump's agenda. The memo highlighted 44 words and phrases seen as divisive, including \"privilege,\" \"safe space,\" \"existential threat,\" \"birthing person,\" \"Latinx,\" and \"incarcerated people.\" The think tank argues these terms make Democrats appear like radical \"enforcers of wokeness\" to the average American. It also urges Democratic officials to reflect on conversations with persuadable voters before using such terms. The letter aligns with broader concerns raised by prominent Democrats since the November election, with former Democratic Chicago Mayor Rahm Emanuel suggesting Democrats need to become a larger-tent party if they want to win elections.",
  "shortSummary": "Third Way urges Democrats to avoid \"elitist\" jargon, including \"privilege\" and \"Latinx,\" to defeat President Donald Trump's agenda.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4d2cccf02d384926bc38f94f6a810fe4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/media/jimmy-kimmel-admits-repulsive-liberal-scolds-driving-people-away-from-democratic-party",
      "text": "Late-night host Jimmy Kimmel admitted \"repulsive\" liberal voices are scaring people away from the Democratic Party during an appearance on the \"Sarah Silverman Podcast\" on Thursday.\nThe comedians discussed cancel culture persisting on the left since President Donald Trump returned to office. They criticized those who continue to shun Trump voters who are now expressing regret for supporting the president.\nSilverman brought up how podcast host Joe Rogan has been attacked online for criticizing Trump's second term after supporting him in the 2024 election. She called it \"ironic\" that the party of \"inclusivity\" was \"incredibly elitist.\"\nAnti-Trump Kimmel, who campaigned for Democrats in the 2024 election, defended his party while agreeing that some progressive figures have turned people away.\nTRUMP REPEATS CLAIM KIMMEL, FALLON ARE 'NEXT' AFTER STEPHEN COLBERT CANCELLATION\n\"Yes. But it's not- it's not the party. It's not the majority. It's the loud voices that scare people from saying what they believe and make you think twice about a joke or whatever,\" he responded.\n\"You know, a lot of their points are valid, but a lot of them are also just repulsive, in that they repel people,\" Kimmel continued. \"They go like, 'Oh, you're no fun. I don't want to be around you.' And I think that if you had to boil it down to one thing, that's kind of what it is.\"\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nIn April, Kimmel blamed humorless liberal scolds trying to cancel comedians for Trump's rise to power.\n\"I think a lot of the outrage is completely manufactured, and it’s like, a lot of these people who are angry aren’t really angry. I think these liberals who’ve done such a good job of viciously attacking comedians are a big part of the reason why Trump is the president right now,\" he said.\nAfter \"Late Show\" host Stephen Colbert's show was canceled in July, Trump predicted this week that Kimmel and fellow late-night host Jimmy Fallon would be \"next\" to go off the air.\nCLICK HERE TO GET THE FOX NEWS APP\nFox News' Hanna Panreck contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/media/carville-says-dems-betrayed-working-class-voters-not-including-them-too-cool-for-school-coalition",
      "text": "Veteran Democratic Party strategist James Carville warned on Thursday that Democrats need to acknowledge how they took part in the decades-long betrayal of White, working-class voters.\nSince the Democratic Party’s historic loss in November, many have been trying to chart a path forward to reclaiming their coalition. While some have doubled-down on controversial far-left identity politics, some have worked to reclaim working-class men they alienated in recent years, particularly White men.\nOn the Politics War Room podcast, hosts Carville and Al Hunt addressed a comment from a listener, who suggested that rather than being reconciliation, MAGA supporters deserve to be \"beaten badly at the voting booth and then told just to suck it up.\"\n\"Oh God, who doesn’t have that instinct?\" Carville responded, but nonetheless warned that politics comes down to winning elections, and that means persuading voters.\n\"It is not the most satisfying way, but what in the end are we trying to do? We're trying to do one thing, win elections.\" He proceeded to warn against the \"temptation that says ‘I can't believe how godd--n stupid you were.\"\nWhile he said he has no temptation for the \"corporate a—wipes\" who voted for Trump to become richer, the strategist nicknamed the Ragin’ Cajun expressed some sympathy for working-class Whites he says have been betrayed by both parties.\n\"I have an iota of sympathy for somebody whose life hadn't turned out right,\" he said. \"The brilliant thing about MAGA is it gives you an explanation other than yourself of why your life didn't turn out the way you wanted it, and we should say to these people ‘We kind of understand what you were trying to say but you were betrayed.’\"\n\"Let's also face it, Democrats acted like these people didn't exist alright? They just did, and don't come back and say-We acted like working-class, particularly working-class non-college Whites were not part of our too-cool-for-school group,\" he continued. \"There were some real high-end people that kind of bought in to that s---.\"\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nCLICK HERE TO GET THE FOX NEWS APP\nHe returned to the listener’s question and reasserted his point that it’s better to reconcile with working-class White voters, even if he understands being frustrated with them.\n\"I can see it, but the best thing to do is not punch him in the mouth but to say, ‘You know man I could hear where you're coming from you just got betrayed, and we betrayed you somewhat, and we now have learned our lesson,'\" he said."
    },
    {
      "url": "https://www.foxnews.com/media/obama-bros-confronted-democratic-partys-intolerance-problem-history-excluding-people",
      "text": "Two former Obama staffers admitted Tuesday that intolerance within the Democratic Party was a \"huge problem\" that needs to be addressed if the party hopes to win future elections.\nTommy Vietor and Jon Favreau, Obama alumni and hosts of \"Pod Save America,\" joined the \"Flagrant\" podcast for a wide-ranging discussion on President Donald Trump's campaign promises, political hypocrisy and the internal purity tests plaguing the Democratic Party.\n\"In my lifetime, I’ve never seen a political party as obsessed with excluding people,\" \"Flagrant\" co-host Akaash Singh told Vietor and Favreau.\n\"And the irony is, Democrats seem to love talking about inclusivity. Ad nauseam. Inclusivity, inclusivity, inclusivity. But if somebody steps out of line from what we want them to say, ‘F--- you forever.’ You have no chance of redemption.\"\nOBAMA TELLS DEMOCRAT BIG WIGS TO ‘TOUGHEN UP,’ START BACKING CANDIDATES THAT CAN ACTUALLY WIN\n\"How do Dems fix that?\" co-host Andrew Schulz posed to the former Obama officials.\nVietor acknowledged there was \"a huge problem\" over the past few years with liberals being unwilling to engage in conversation with people they disagree with. But he believes that the Democratic Party is now adopting a more open attitude.\nVietor recounted how he had once been invited to a Barstool Sports show but declined the request, fearing at the time that his podcast audience would get \"upset\" with him because of things Barstool Sports founder Dave Portnoy had said.\n\"I think back to that, and I'm embarrassed, and I'm mad at myself,\" he confessed.\nFORMER OBAMA SPEECHWRITER ADMITS SHUNNING CONSERVATIVE IN HIS FAMILY WAS A MISTAKE\nVietor said he’s since changed his attitude and believes the party at large is \"course correcting\" and \"learning from those mistakes.\"\nHe cited how Bernie Sanders welcomed podcast host Joe Rogan’s endorsement in the 2020 election as a sign there was willingness for the party to be a \"big tent\" party again.\nHe also pushed back on the idea that viewpoint diversity was largely a Democratic Party problem.\n\"Democrats can be annoying. We can be scold-y. But I think sometimes it's online mobs more than the party,\" he said of left-wing cancel culture.\nVietor went on to praise Trump as a \"genius\" for inviting Democrats like HHS Secretary Robert F. Kennedy Jr. onto his cabinet and conceded that Democrats could learn from that.\n\"Democrats, you're right, sometimes we have like a laundry list of things, and you don't check all the boxes, we don't allow you in the tent,\" he said.\nVietor advocated for the party to return to \"Obama-era politics\" where he argued leaders in the party had respectful engagement with voters they disagreed with on hot-button issues.\nCLICK HERE TO GET THE FOX NEWS APP\nAt another point in the podcast, Favreau responded to a question from the co-hosts about Democrats' \"morally superior\" attitude.\nHe conceded that lecturing Trump supporters about racism and his \"horrible\" policies wasn't a winning strategy to expand the Democratic Party coalition.\n\"Is our ultimate goal to just be, like, right on the internet? Or is the goal to, like, pass policies that we deeply believe in that are going to improve people's lives? Because if that's the goal, then we're going to need to have a bigger coalition than a bunch of White liberals,\" he said."
    },
    {
      "url": "https://www.foxnews.com/media/bill-maher-admits-he-still-fears-getting-canceled-despite-cultural-vibe-shift-after-election",
      "text": "Liberal comedian Bill Maher admitted he fears getting canceled for the remarks he’s made in private on Monday's episode of his \"Club Random\" podcast.\nDuring a conversation about free speech with actress Drew Barrymore, Maher said it had become less \"dangerous\" to speak out on controversial issues as there had been a cultural \"vibe shift\" against woke-ism over the past two years. But he confessed he still feared that his everyday conversations in public could be used against him to end his career.\n\"We did have a vibe change because the Democrats lost so badly in 2024. The blush is off the rose on left-wing censorship and ‘Oh my God, you can’t say that.’ Stop telling me what I can do. What I can say. What I can think. Who my heroes are supposed to be. Just get the f--- off me. That is what’s viscerally going on with me when I have issues with the left,\" Maher said.\nBarrymore praised him for his boldness and asked him if there was anything that still \"scares\" him.\nMAHER CALLS OUT SNL FOR 'ZOMBIE LIE' THAT REPUBLICANS ARE RACIST, WARNS THEY ARE 'NOT HELPING'\n\"Oh, what scares me is... at any moment, you can like say something that, really in private conversation, wouldn't upset anybody. Yes. But these snitches and b----es will be able to use it to attack and end you, which they did once on ‘Politically Incorrect,’\" he said.\n\"When I go out… it’s unlikely anything is going to happen that would end my career, but it is possible.\"\nMaher explained how he carried this \"paranoia\" with him constantly. Although it wasn’t as severe as other problems people face, he said it wasn’t insignificant.\n\"I'm always... and now it's like a running joke because you know, 'Did anything bad happen?' Like that sort of paranoia. No. Is it as bad as things other people go through? No. But living with that paranoia is not nothing,\" he lamented.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\n\"I don’t feel guilty saying that’s a complaint I have about life. Everybody has their complaints. That's one of mine. Is it as bad as starving? No. But it’s not nothing. It kind of sucks that you can’t pull into the driveway without having a peaceable night at dinner without thinking, ‘Did anything bad happen?’\"\nThe \"Real Time\" host previously opened up about his worries about getting canceled in a 2023 CNN interview.\n\"It just makes me laugh when people say to me, ‘You know, you’re uncancellable.’ Are you kidding? In two seconds, I could get canceled. Anybody could,\" he told the news outlet.\nMaher faced backlash for controversial remarks following 9/11, and ABC canceled \"Politically Incorrect\" the following year amid declining advertiser support.\nCLICK HERE TO GET THE FOX NEWS APP\nDays after the terrorist attack, Maher insisted it was \"cowardly\" for the U.S. to use cruise missiles overseas, while the terrorists who flew planes into the World Trade Center were \"not cowardly.\"\nThe liberal comedian faced intense backlash from viewers and advertisers at the time and ABC pulled the plug on his show the following year. In 2003, he launched \"Real Time with Bill Maher,\" which continues to air on HBO.\nFox News’ Joseph A. Wulfsohn contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/media/rahm-emanuel-warns-dems-have-become-party-punks-who-talk-down-people-fret-over-identity-politics",
      "text": "Former Democratic mayor of Chicago Rahm Emanuel argued on Wednesday the Democratic Party needs to completely overhaul its approach in order to win elections again.\n\"The Bulwark\" podcast host Tim Miller confronted Emanuel with a viral clip from an interview where the politician offered his advice to the Democratic Party shortly after the election, saying, \"Here’s my view. You have a Yeti cup? You fund WBEZ, NPR? Sit down, listen, and say you’re sorry, and I include myself in the same mistakes,\" and \"If you have a Yeti cup, be quiet, sit in the corner and listen. Stop talking.\"\n\"I have a podcast, Rahm, you gonna make me sit in the cuck chair with my Yeti cup and stop talking?\" he asked jokingly.\n\"Yeah, I do, I say that,\" Emanuel later replied, after noting he has given this Yeti cup spiel about coastal elites multiple times. He then lamented that the Democrats once were a big tent party until it became college-educated intellectuals \"sitting around telling everybody how to live their lives, and they were coastal, etc.\"\n\"You guys have run this car straight into a wall,\" Emanuel said as he addressed such leaders rhetorically. \"Sit down, shut up, and actually you have a moment to learn something. And stop telling people how to live their lives because you don't know squat and nobody's had the balls to tell you that, and I just did.\"\nThe former Chicago mayor, who has criticized recent Democratic Party leadership multiple times, went on to suggest the key reasons why they have alienated many of their former voters.\n\"Now to the core question, why do Democrats have a problem? Because we're punks, and we not only talk like punks, we talk down to people, we get caught up in a set of issues that aren't relevant,\" he said. \"Think about all this about transgender in sports, etc. There's hundreds of thousands of NCAA athletes and there's 10 transgender athletes in sports in their website. This is crazy. As I said in education, we have the worst reading scores and math scores in 30 years, and we're arguing about bathrooms and locker rooms and not the classroom?\"\nAfter warning Democrats against fighting over pronouns, using the term \"Latinx\" and calling to defund the police, he argued that their understanding of \"kitchen table issues\" needs to go far beyond economic concerns.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nCLICK HERE TO GET THE FOX NEWS APP\nThe former Chicago mayor also warned that Democrats hitching their wagon to identity politics is an unpopular issue, particularly when they appear to end up losing male Black and Hispanic voters.\n\"If you do identity, the other side gets to do identity,\" he warned, \"and I'm going to break the news to the Democrats, the other side has more identity than you do. Just do the math.\""
    }
  ],
  "argos_summary": "A memo from the Third Way think tank warned Democrats to avoid “elitist” progressive jargon that alienates voters, listing 44 divisive terms and urging officials to speak in plain language. The memo sparked commentary from figures like James Carville, who urged Democrats to acknowledge past betrayals of working‑class voters, and from late‑night hosts Jimmy Kimmel and Stephen Colbert, who noted that cancel culture and overly woke rhetoric are pushing Trump supporters away. Former Obama staffers on Pod Save America acknowledged a party-wide intolerance problem and called for a more inclusive, big‑tent approach. The article also highlighted Bill Maher’s concerns about cancelation and the broader debate over how the Democratic Party should communicate to win elections in 2024.",
  "argos_id": "58KSI8LPN"
}