{
  "url": "https://nypost.com/2025/08/23/entertainment/dolly-partons-broadway-bound-musical-gets-vicious-reactions-in-nashville-drag-bar-in-vegas/",
  "authorsByline": "Johnny Oleksinski",
  "articleId": "f86b65eb2fd541cbbc284c86bf47f6ad",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-dt8kla0si-1755890225905.jpg?quality=75&strip=all&1755875909&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T12:57:42+00:00",
  "addDate": "2025-08-23T12:59:51.277766+00:00",
  "refreshDate": "2025-08-23T12:59:51.277768+00:00",
  "score": 1.0,
  "title": "Dolly Parton’s Broadway-bound musical gets vicious reactions in Nashville: ‘Drag bar in Vegas’",
  "description": "Working 9 to 5? Dolly Parton’s new musical is going to need to be worked on 24/7, 365 to be remotely ready for its planned Broadway bow next year.",
  "content": "From what I hear, Dolly Parton’s new musical is going to need to be worked on 24/7, 365 to be remotely ready for its planned Broadway bow next year.\n\nCalled “Dolly: A True Original Musical,” the show, which is produced by Parton, her frequent collaborator Danny Nozell and Ambassador Theatre Group, opened earlier this month in her home state of Tennessee.\n\nThe opening-night Nashville audience’s teeth were gnashing, all right.\n\nBut not those of national critics. We were barred from reviewing “Dolly,” which tells the beloved 79-year-old country singer’s life story from her poor Appalachian upbringing to global superstardom.\n\nI was crushed. I had to unpack my cowboy boots and blond wig.\n\nBut thankfully my spies stumbled outta bed and tumbled to the theater for me.\n\n“Instead of Broadway, the better move is for it to run in a drag bar in Vegas,” said one unimpressed wag.\n\n“Granted, they’d still have to cut two hours.”\n\nWord is that the show is very long and includes too many of Parton’s songs that are sung in full. And some obscure ones at that.\n\nThree women play Dolly at different stages — Katie Rose Clarke (eldest), Carrie St. Louis (middle) and Quinn Titcomb (young) — which is the same recycled format that “Tina: The Tina Turner Musical,” “The Cher Show,” “The Donna Summer Musical” and “MJ” all used.\n\nClarke apparently fares best of the trio. She opens Act 2 with “Jolene.” And when she sings “I Will Always Love You” as she bids farewell to Porter Wagoner, it’s said to be very moving.\n\nOffstage, sources say director Bartlett Sher, better known for classy Lincoln Center musicals such as “The King and I” and “South Pacific,” and a recent pileup of lousy plays, is a bad fit for honky-tonk Dollywood.\n\n“He can’t do new musicals,” one said. “Stick with revivals.”\n\nReactions to the book, meanwhile, range from “bland” to “terrible.”\n\nIt’s co-written by Parton and Maria S. Schlatter, who also wrote Parton’s syrupy holiday movie “Christmas On The Square,” which, to state the obvious, ain’t “Gypsy.”\n\nEveryone I talked to who’s seen the show agrees the script needs to be scrapped and redone by an experienced theater hand.\n\nThe consensus? If book should stay, book would only be in the waaaaay!\n\nI found one kind-hearted audience member who gave me an optimistic review.\n\n“It has good bones,” he said. “It just isn’t finished.”\n\nIndeed, “Dolly” will likely not make it to Broadway by the spring.\n\nThe show mulled heading to either the Al Hirschfeld Theatre, where “Moulin Rouge” is still running, and the August Wilson Theatre after “Cabaret” closes.\n\nBut a source said Stephen Adly Guirguis’ new play “Dog Day Afternoon” with “Walking Dead” star Jon Bernthal and “The Bear”’s Ebon Moss-Bachrach is going in the Wilson instead.\n\nA few industry viewers went so far to say the show is unfixable. Well, they’ll have plenty of time to try.\n\nI’m told Sher is reluctant to make changes. But gung-ho Parton is greatly invested in her bio-musical being a winner.\n\n“There is an undeniable magic in the air when Dolly’s in that building, and there’s nobody better at rallying the troops and executing an artistic vision,” a production source said.\n\n“You give her five minutes with any cynic, and they will walk away a true believer. She’s going to lead the team to a giant success.”\n\nBack in 2009, when Parton was putting on the stage version of “9 to 5” at the Marquis, she was reportedly very willing to throw out songs and write new ones as needed.\n\nOf course, that musical closed a flop and lost more than $10 million.\n\nBroadway — what a way to make a livin’!",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Parton",
      "weight": 0.069476195
    },
    {
      "name": "Dolly",
      "weight": 0.06218122
    },
    {
      "name": "new musicals",
      "weight": 0.057758957
    },
    {
      "name": "Broadway",
      "weight": 0.055001654
    },
    {
      "name": "new ones",
      "weight": 0.054289073
    },
    {
      "name": "Ambassador Theatre Group",
      "weight": 0.05419116
    },
    {
      "name": "Christmas On The Square",
      "weight": 0.05014116
    },
    {
      "name": "classy Lincoln Center musicals",
      "weight": 0.050069258
    },
    {
      "name": "Katie Rose Clarke",
      "weight": 0.04893503
    },
    {
      "name": "lousy plays",
      "weight": 0.04818874
    }
  ],
  "topics": [
    {
      "name": "Theater"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97900390625
    },
    {
      "name": "/Arts & Entertainment/Performing Arts/Broadway & Musical Theater",
      "score": 0.66064453125
    },
    {
      "name": "/Arts & Entertainment/Performing Arts/Acting & Theater",
      "score": 0.64697265625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Event Ticket Sales",
      "score": 0.64306640625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.414794921875
    }
  ],
  "sentiment": {
    "positive": 0.08238305,
    "negative": 0.60134745,
    "neutral": 0.3162695
  },
  "summary": "Dolly Parton's Broadway-bound musical, \"Dolly: A True Original Musical,\" has received mixed reviews in Nashville. The musical, produced by Parton, Danny Nozell and Ambassador Theatre Group, opened earlier this month in her home state of Tennessee. However, national critics were barred from reviewing the show. Critics suggested that it should be held in a drag bar in Vegas instead of Broadway. The show is long and includes too many of Parton’s songs, which are sung in full. Critics also criticized the book and director Bartlett Sher, known for his work at Lincoln Center and \"South Pacific,\" is a bad fit for honky-tonk Dollywood. Despite these reviews, some believe the script needs to be scrapped and redone.",
  "shortSummary": "The new musical \"Dolly Parton: A True Original Musical” debuted in Nashville to mixed reviews, requiring extensive work, and likely not being ready for Broadway by spring.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "17de263e6fcc47259fd4aaf8ff98fb4e",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Dolly Parton’s new musical, \"Dolly: A True Original Musical,\" opened in Nashville but has been criticized for its length, excessive use of Parton’s songs, and a weak book. Critics and industry insiders say the show’s director, Bartlett Sher, is ill-suited for the honky‑tonk material and that the script needs a rewrite. While some see potential, many believe the production is unlikely to reach Broadway in its current form, and it may need significant changes before it can succeed.",
  "argos_id": "5Q1A2SF21"
}