{
  "url": "https://www.zdnet.com/home-and-office/home-entertainment/i-tested-these-viral-crush-proof-bluetooth-speakers-and-theyre-not-your-average-portables/",
  "authorsByline": "Jada Jones",
  "articleId": "3589432088f84e4891d7c89665fb6732",
  "source": {
    "domain": "zdnet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.zdnet.com/a/img/resize/3f050c7e483ff035bb33d5146b154b0034ca82f5/2025/08/21/1d56d543-4891-4b45-b689-2f83444d0977/turtlebox-2.jpg?auto=webp&fit=crop&height=675&width=1200",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T11:15:19+00:00",
  "addDate": "2025-08-23T11:19:53.596798+00:00",
  "refreshDate": "2025-08-23T11:19:53.596799+00:00",
  "score": 1.0,
  "title": "I tested these viral 'crush-proof' Bluetooth speakers, and they're not your average portables",
  "description": "If your other Bluetooth speakers can't keep up with your rugged lifestyle, Turtlebox has two durable speakers that dare you to do your worst.",
  "content": "I often skip outdoor activities considered staples during the hot Georgia summer -- mudding, fishing, hunting, or lake days. If it's not lying out by the pool or going down to the Gulf for a beach trip, I'll pass.\n\nAlso: The best Bluetooth speakers of 2025: Expert tested and reviewed\n\nBut my friends and family who like these excursions often ask to borrow one of my Bluetooth speakers, and I don't love the idea of my pretty Beats, Bose, or JBL speakers being slung through the elements, even if they can withstand it. So when I saw some outdoor living TikTok creators praising their \"ultra rugged\" Turtlebox speakers, I had to try one for myself.\n\nIf you've seen these speakers, you know their marketing is geared toward outdoor enthusiasts searching for a speaker that won't quit. I tried the Original Gen 3 and the Ranger speakers, and here's my take.\n\nThe Gen 3 is Turtlebox's flagship Bluetooth speaker. It sports a boombox-style form factor, a handle for portability, 25 hours of playtime, an IP67 water and dustproof rating, and reverse USB-C charging capabilities.\n\nI've seen people online dislike Turtlebox's sound profile, mostly critiquing a seemingly hollow bass response. And I'll agree; I've heard smaller speakers produce deeper bass. But believe it or not, Turtlebox's sound makes for a great outdoor soundscape. It's already harder to achieve a considerably deep bass response in an open-air environment, and you may want to focus more on singing along than being overwhelmed by bass.\n\nAlso: I'm bringing this portable JBL speaker to all my summer festivities - here's why\n\nIf you're looking for deep, boomy bass, you won't get it with the Gen 3 speaker. However, it does have great mids and gets plenty loud, which helps you hear your music clearly -- especially the lyrics -- when outdoors.\n\nA major drawback is that Turtlebox doesn't have a dedicated app or any physical controls on the speaker for EQ settings. So, you're stuck with its out-of-the-box sound. However, this speaker is built for a true outdoorsman, and you're likely to be less concerned about bass and treble when you're trying to catch catfish or win a game of cornhole.\n\nAlso: I take this Sony speaker to the beach every summer - for one obvious reason\n\nAt $430, Turtlebox asks a steep price for a speaker that has the same features as its competitors from Bose, JBL, or Marshall, but its extremely tough design sets it apart. Turtlebox's speakers are made from stainless steel coated in ABS, a polymer known for its toughness. It also features a UV inhibitor for discoloring protection and rubber feet for non-slip properties. And despite its size, the Gen 3 floats in water.\n\nThe Ranger is Turtlebox's most portable speaker, and the one I would recommend to most people. It's more affordable, sporting a $250 retail price. It's just as rugged as the Original Gen 3, but it's much easier to lug around.\n\nMy favorite thing about it is the strong magnetic side mounts, which are perfect for people who would stick the Ranger to a golf cart, truck, or four-wheeler. Its lighter frame is also more suitable for hiking, walking, biking, or fishing and hunting with a small group.\n\nAlso: Sonos' cheapest smart speaker is also the one I use the most. Here's why\n\nDue to the Ranger's smaller size, it has less room for a larger battery and internal audio components. It promises 12 hours of playtime, an IP67 dust and waterproof rating, stainless steel tie-downs and rubber feet, and reverse USB-C charging. Again, the Ranger stacks up equally to its similarly-specced competitors from Bose and JBL, but the extra dollars are in the more durable build materials.\n\nBoth the Gen 3 and Ranger speakers are equipped with Party Mode, Turtlebox's proprietary audio grouping technology. You can pair multiple Gen 3 and Ranger speakers together for synced audio, or use true wireless mode for left/right stereo sound.\n\nAnother complaint I noticed online is that some customers noticed a breakdown in performance after putting their Turtlebox speaker through mud, saltwater, sand, or dirt. Although these speakers promise to handle the elements, like all other rugged speakers, they require some aftercare. However, Turtlebox speakers need a little more love after a long day outdoors.\n\nAlso: 6 gadgets that take my backyard parties up a notch (and why they make such a big difference)\n\nYou may need to wash your speakers -- all rugged speakers, for that matter -- with freshwater after exposing them to saltwater, chlorinated water, sand, or mud. Leaving the chemicals and particles inside your speaker can affect its performance over time.\n\nIf you spend a lot of time outdoors and haven't found a Bluetooth speaker that can withstand the elements, the Turtlebox Gen 3 or Ranger are solid choices. However, if better wireless sound quality or an outdoor speaker that works just as well indoors are your must-haves, these speakers aren't for you.\n\nIf you define \"being in the outdoors\" as lounging by the pool or at a patio table, you can get by with the Bose SoundLink Plus or JBL Charge 6.",
  "medium": "Article",
  "links": [
    "https://go.shopyourlikes.com/pi/5510b53bb4b070c3ceeb3b411a337c342e394360?afId=614548&afCampaignId=subid_value&afCreativeId=2993&afPlacementId=2",
    "https://www.anrdoezrs.net/click-9041660-15734609?url=https%3A%2F%2Fwww.bose.com%2Fp%2Fspeakers%2Fbose-soundlink-plus-portable-speaker%2FSLP-SPEAKERWIRELESS.html&sid=subid_value",
    "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
    "https://www.zdnet.com/home-and-office/home-entertainment/i-take-this-sony-speaker-to-the-beach-every-summer-for-one-obvious-reason/",
    "https://www.dpbolvw.net/click-9041660-17048116-1741806054000?sid=subid_value",
    "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
    "https://www.amazon.com/dp/B0CDGKRX4X?tag=zd-buy-button-20",
    "https://www.zdnet.com/home-and-office/home-entertainment/sonos-cheapest-smart-speaker-is-also-the-one-i-use-the-most-heres-why/",
    "https://assoc-redirect.amazon.com/g/r/https://www.amazon.com/dp/B0F22HTHMJ?tag=cnet-api-20&linkCode=ogi&th=1&psc=1",
    "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/",
    "https://www.zdnet.com/article/this-200-android-phone-with-a-paper-like-display-made-my-pixel-look-overbearing/",
    "https://www.zdnet.com/home-and-office/yard-outdoors/6-gadgets-that-take-my-backyard-parties-up-a-notch-and-why-they-make-such-a-big-difference/",
    "https://www.zdnet.com/home-and-office/home-entertainment/im-bringing-this-portable-jbl-speaker-to-all-my-summer-festivities-heres-why/",
    "https://go.shopyourlikes.com/pi/07b812b666a8799cf23abcf880c5f62a7e76466d?afId=614548&afCampaignId=subid_value&afCreativeId=2993&afPlacementId=2",
    "https://www.zdnet.com/home-and-office/home-entertainment/best-bluetooth-speakers/",
    "https://go.shopyourlikes.com/pi/017aed83ae366a9d8f0c8dcce04f10941691fb3f?afId=614548&afCampaignId=subid_value&afCreativeId=2993&afPlacementId=2"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Turtlebox speakers",
      "weight": 0.12729497
    },
    {
      "name": "smaller speakers",
      "weight": 0.114426635
    },
    {
      "name": "Turtlebox",
      "weight": 0.0708309
    },
    {
      "name": "Turtleboxs flagship Bluetooth speaker",
      "weight": 0.07070711
    },
    {
      "name": "Turtleboxs speakers",
      "weight": 0.067508355
    },
    {
      "name": "their Turtlebox speaker",
      "weight": 0.067508355
    },
    {
      "name": "this portable JBL speaker",
      "weight": 0.06654785
    },
    {
      "name": "the Ranger speakers",
      "weight": 0.06452963
    },
    {
      "name": "all other rugged speakers",
      "weight": 0.06414524
    },
    {
      "name": "an outdoor speaker",
      "weight": 0.062774435
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.96435546875
    }
  ],
  "sentiment": {
    "positive": 0.22703756,
    "negative": 0.30962828,
    "neutral": 0.46333417
  },
  "summary": "TikTok creators have been praising Turtlebox's \"ultra rugged\" Bluetooth speakers, which are marketed towards outdoor enthusiasts seeking a portable Bluetooth speaker that can withstand rough weather. The company's flagship Bluetooth speaker, the Gen 3, has a boombox-style form factor, a handle for portability, 25 hours of playtime, IP67 water and dustproof rating, and reverse USB-C charging capabilities. The Ranger is more portable, with a $250 retail price, and is more affordable. Despite some criticism about the sound profile, the Ranger's waterproof design and rugged build materials set it apart. Despite the price tag, the rugged design sets it apart from competitors from Bose, JBL, or Marshall. The speakers are also equipped with Party Mode, Turtlebox’s proprietary audio technology, which allows them to synced audio or use wireless mode for syncced audio. However, some customers have noticed some breakdowns in their performance after putting their speaker through mud, salt, sand, or saltwater, and saltwater.",
  "shortSummary": "Turtlebox's rugged Bluetooth speakers, the Ranger and Original Gen 3, are ideal portable Bluetooth speakers for outdoor enthusiasts and tech enthusiasts, but limited in sound and design features.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bb177a7f2ca94a41872931d3f17fc5a1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.zdnet.com/article/finally-an-ultraportable-windows-laptop-id-use-at-the-office-even-though-its-for-gamers/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nFinally, an ultraportable Windows laptop I'd use at the office (even though it's for gamers)\nMSI Stealth 16 AI\nZDNET's key takeaways\n- The MSI Stealth 16 AI is on sale at Best Buy for $2,030.\n- It's a gaming laptop with powerful hardware and a vibrant OLED display that's ideal for both gaming and graphic design.\n- However, like its predecessor, it has a hungry battery and runs hot.\nThe 2025 MSI Stealth 16 is the latest entry in the tech company's sleek gaming laptop series. I'm pretty familiar with the Stealth line, having reviewed several models in the past. This version doesn't reinvent the wheel. In fact, it shares many similarities with its predecessor, the Stealth A16 AI+, to its benefit and to a fault.\nAlso: The best laptops for graphic designers: Expert tested\nFirst off: on the surface, I genuinely can't tell the difference between this model and the previous generation. The Stealth 16 measures 14\"x 10.22\"x 0.85\" inches -- the exact same dimensions as the A16. It even weighs the same at 4.63 pounds.\nWhat's funny is I used to think that was really heavy, but after carrying around chunky laptops, MSI's device feels lightweight. Even with the power adapter, I didn't mind carrying it around town. By the way, I factor that adapter into the overall weight because you will need it on hand. More on that later.\nBringing back the classics\nA few other great design elements make their triumphant return. Going down the list, you have a full-size gaming keyboard. Each button has a 1.5mm travel distance, ensuring a comfortable typing feel. Six surround sound speakers are located at either end below the keyboard for immersive audio.\nOne of my favorite moments testing this laptop came from listening to \"Doomsday\" by MF Doom. The lyrical flow from Doom sounded crystal clear and powerful through the laptop's speakers, filling my entire room with his supervillainy.\nAbove the keyboard is the 16-inch OLED display. At QuadHD+ (2,560 x 1,600 pixels) resolution, it's not quite 4K, but it's close enough -- the screen still delivers impressive visual output. Colors are vibrant, the high resolution delivers detailed images, and the 240Hz refresh rate ensures smooth on-screen motion.\nPower boost\nOne of my favorite things about MSI laptops is how easy it is to tweak their performance. On many Windows 11 laptops, all you can really do is change the Power mode in the Settings, but MSI Center, its internal settings program is actually pretty robust. Here, you can adjust the computer's output on the fly. For example, enabling Extreme Performance and Discrete Graphics Mode delivers the best hardware results.\nAlso: I tested Dell's XPS successor, and it beat my $3,000 Windows laptop in almost every way\nInside my review unit was an Intel Core Ultra 9 285H, an Nvidia GeForce RTX 5070 graphics card, and 32GB of RAM. It's a pretty good configuration, if I say so myself, and it shows in the performance numbers.\nBelow is a list comparing MSI's Stealth 16 with its predecessor, the Stealth A16 AI Plus, and the Dell Premium 16. You'll notice that the newer model has better raw processing and rendering power than the others, indicating it excels at handling heavy workloads and rendering complex 3D graphics.\nThere is a bit of a gap between the Stealth 16 and the A16 on PCMark 10, suggesting that the older model has better general performance; it's able to hop between web pages and apps without much issue. However, I didn't experience any slowdown. This laptop ran great everywhere.\nPCMark 10 | Geekbench 6 | Cinebench 2024 | Cinebench R23 | |\nMSI Stealth 16 AI | 7,693 | 15,883 | 1,129 | 21,656 |\nMSI Stealth A16 AI+ | 7,913 | 14,196 | N/A | 18,336 |\nDell Premium 16 | 6,865 | 14,763 | 726 | 17,522 |\nHaving Dell's machine may seem random, but you need to understand that the Stealth 16 isn't just a solid gaming computer. It's also a powerful graphic design laptop, too. For testing, I installed Blender, a free 3D creation app, and edited images on Pixlr. I'm not much of an artist, but I did manage to create and render simple scenes starring Blender's complex monkey model.\nI had a similar experience with Pixlr, as I was able to edit 4K photographs without any major hiccups. The entire process went smoothly. MSI's laptop is a powerhouse in almost every sense of the word.\nAlso: I switched to the Dell 14 Premium for a week, and it makes even the XPS feel outdated\nAs powerful as the laptop may be, it has its limits. I ran multiple 4K YouTube livestreams as part of my usual 50-tab Chrome browser test. Everything ran fine when there were only three livestreams, although once I hit six, I noticed a slowdown. Livestreams were slow to load. It took a few seconds before the Stealth 16 could play the video as normal.\nStaying cool\nHeavy workloads do cause the Stealth 16 to heat up a bit, but high temperatures were never an issue. Heat vents are strategically placed above the keyboard, on the side of the laptop, and on the bottom, so your hands are never at risk of touching a hot keyboard. In fact, the keys stayed nice and cool the entire time. Unfortunately, this means you can't place the computer on your lap; otherwise, your legs will be blasted by hot air.\nThis ability to stay cool under duress is thanks to the Cooler Boost 5 cooling system, which consists of two large fans and five heat pipes directing hot air out through the vents. This system is also on the vastly more powerful MSI Raider 18 HX.\nUnsurprisingly, MSI's Stealth 16 is not designed to be away from its charger for long. You can push its endurance by enabling ECO-Silent and Integrated Graphics Mode in the MSI Center app, and Best Power Efficiency in Windows, but even then, it will last around six hours on a single charge, depending on what you're doing.\nLike many gaming laptops with this kind of hardware, it may have power, but it lacks in stamina. For that reason, I'd suggest this for users who don't need an all-day battery kind of laptop, but are fine with a few hour stints throughout the day.\nZDNET's buying advice\nThe MSI Stealth 16 AI is on sale at Best Buy for $2,030, which is a good price for a laptop with this kind of hardware. I recommend this device to anyone looking for an affordable gaming laptop that can also be used as a work machine. If you like this laptop but want to save some cash, its predecessor, the Stealth A16 AI+, is very similar and still relevant in 2025, retailing for $1,800.\nIf you want a more powerful graphic design computer, I suggest the Alienware 18 Area-51. It is a much more powerful gaming laptop that leaves every laptop I mentioned so far in the dust. I think it's one of the best for the year. It is, however, very expensive; my review unit cost $3,200."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/yard-outdoors/6-gadgets-that-take-my-backyard-parties-up-a-notch-and-why-they-make-such-a-big-difference/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\n6 gadgets that take my backyard parties up a notch (and why they make such a big difference)\nWhether you're hosting the annual family cookout, throwing a summer birthday party, or just want to invite friends over, it's important to make sure your backyard is prepped and ready to handle a crowd.\nFrom Bluetooth speakers for pumping high-energy playlists and grills for hassle-free outdoor cooking to string lights and other gadgets that set the mood, I've rounded up a list of my favorite outdoor tech and equipment to help you build the best outdoor entertainment space and throw killer parties all summer long.\nAlso: Why I'm ditching Bluetooth speakers in favor of this outdoor wired system - and don't regret it\nI got my Blackstone griddle grill as a gift, and it has quickly become my favorite way to cook outdoors, whether it's just for my family or for a big barbecue crowd. The model I have features a 28-inch cooktop, which is large enough to handle everything from hot dogs and hamburgers to steaks, chicken, veggies, and even things like tortellini (try it, trust me). The cast iron cooktop does require some fussy maintenance, like seasoning before first use, careful cleaning, and proper protection, but the results are hard to argue with when you can whip up enough fajitas to feed an army in under 30 minutes.\nI've had my Auking M8-F mini projector for a couple of years now. It was originally a birthday gift from my wife so I could host Mario Kart parties for friends and not have to crowd around our living room's 50-inch Samsung TU8000. But after about three years of road trips, Halloween movie marathons, and the aforementioned Mario Kart tournaments, the Auking mini projector remains a great, affordable option for streaming media outdoors.\nThe LED lamp has a life expectancy of up to 55,000 hours so you never have to worry about replacing lamp bulbs. You can also adjust the screen from 35 to 200 inches, perfect for projecting onto an exterior wall of your home, a dedicated screen, or a blank interior wall. It connects to your laptop or game console via HDMI, and while it's not the brightest projector, you still get great colors and sharp detailing with 1080p HD resolution.\nRead also: The best outdoor TVs you can buy\nThe built-in speaker is also great for when you don't want to set up extra sound equipment in the yard, and it has surprisingly clean audio quality if you don't crank the volume too high. It's handled everything: God of War Ragnarok on the PS5, Overcooked on the Switch, and even one night in the woods when my friends and I watched the Blair Witch Project. The Auking mini projector is a great addition to any outdoor entertainment space, and I can't recommend it enough.\nIf you're looking for a Bluetooth speaker that can handle pumping out the jams for a backyard barbecue or beach day, the Sony SRS-XB23 is a great option. It features a compact, cylindrical design that's great for tucking away on a shelf, in a corner, or hanging.\nThe upward and downward-firing subwoofers give you enhanced bass for your favorite playlists while also giving you consistently clear audio quality, even at high volume, and you won't have to worry about bothered neighbors as the XB23 gets loud enough to enjoy at a party, but not loud enough to warrant any noise complaints. It has up to a 12-hour battery life and plenty of playtime for a weekend party, beach day, or cookout at the park. And with IP67 water and dust resistance, you won't have to worry about a little rain, ocean spray, sand, or dirt ruining your good time.\nRead more: I'm taking this portable Sony speaker to the beach\nAs party host, you're going to need a way to not only play DJ, but also try to control the vibes around you. That includes any smart lighting or Wi-Fi cameras to keep an eye on off-limits areas or prevent any mishaps. The Google Pixel Tablet can be used in a similar way as the Google Nest or Echo Hub, letting you set up a custom smart home network control center for setting mood, lighting colors, and intensity, queueing up the perfect party playlists, and keeping an eye on security camera feeds.\nRead the review: How I used the Pixel Tablet as my smart home display (and key things to consider)\nZDNET's Maria Diaz used the Google Pixel Tablet as her smart home display and said she loved that it worked well with both Android and iOS devices for a better user experience. Plus, she complimented the improved Google Assistant voice controls over Siri alone. But she noted that some product brands didn't play well with the tablet, like Nanoleaf, and that the built-in microphone left something to be desired when making video calls.\nAccent lighting like string bulbs, walkway laps, and wall sconces can do wonders for your backyard's atmosphere. My wife and I picked up two sets of the Addlon 48-foot Edison bulb-style string lights for our deck and backyard two summers ago, and they're still going strong.\nRead also: Everything you need to build out a smart home\nWe chose them because, first, they're solar-powered, so we don't have to worry about remembering to change batteries or taking up the single outlet on the deck. Second, they come with both clamp and ground stake options for placement, which makes it easy to set up along railings, shepherd's crooks for hanging garden baskets, and whatever else you want illuminated. The bulbs aren't very bright, but they add a nice, soft, sodium-orange glow to the yard after sunset that perfectly complements a bonfire.\nFire pits are almost a must-have for any backyard party, especially if you plan on an evening event. I've had my eye on the Solo Stove Yukon 2.0 for a while now to replace our current fire pit because of its stainless steel construction, which will stand up better to humid Cleveland summers. It also features a unique airflow design that makes your campfires burn hotter, which means there will be virtually no smoke. It also has a removable ash pan and base plate for removing leftover ash, charcoal, and debris.\nWhy should you trust me?\nAs a long-time tech journalist, I never buy anything for myself unless I am absolutely certain that it's worth the money. I've chosen products for this list that I've either been using for years in various iterations or have been researching and reading about as I plan to improve my outdoor spaces. I spent hours reading both positive and negative verified customer reviews as well as testing various tech to find the very best on-offer and help you find the right setup for your next outdoor party.\nWhat sort of furniture do I need for an outdoor party?\nAnything that's comfortable and can seat a lot of people. If you have a 4-, 5-, or 7-piece patio set, like the Royalcraft rattan set from Walmart, you should be set for a typical backyard party as most guests will be up and mingling. You'll want to choose furniture with materials meant to be outdoors and exposed to the elements: rattan, treated lumber, and composite materials are all great choices. Metal is also a good option, but make sure you choose furniture that has been properly painted with powder-coat to prevent rusting.\nWhat are the downsides of having a fire pit in my backyard?\nA big downside to having a fire pit is trying to mow around it and your firewood supply, and then dealing with a bare patch of dirt and regrowing grass if you move it. Another downside is dealing with smoke that can annoy party guests as well as neighbors if they're close by. And if your fire pit is made of metal, you'll have to invest in an all-weather cover to prevent rusting and weather damage.\nAre propane fire pits worth it?\nIf you don't have a yard that's big enough to have both a fire pit and a decent fire wood pile, a propane option can work. There are even models that are small and safe enough to use on a deck or table top. With a propane fire pit, you won't have to worry about annoying smoke, cleaning up ashes and coals, or dealing with bugs and rodents that decide to call your wood pile home.\nHowever, the trade-off is that you'll have a propane tank to maintain, which can get pricey if you use it often. Propane also carries its own risks, so make sure that your tanks are always in good working order and filled properly. Also do visual checks of your fire pit's connections and hoses to avoid accidental explosions and uncontrolled fires."
    },
    {
      "url": "https://www.zdnet.com/article/i-replaced-my-samsung-oled-tv-with-this-sony-mini-led-model-for-a-week-and-didnt-regret-it/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI replaced my Samsung OLED TV with this Sony Mini LED model for a week - and didn't regret it\nSony Bravia 5 TV (98-inch)\nZDNET's key takeaways\n- Enhanced color, contrast, and clarity make this TV live up to its hype.\n- It handily delivers upscaled HDR content and high-speed footage.\n- A soundbar will complement its size, and its off-angle viewing can be less than perfect.\nSony recently sent us the 2025 Bravia 5 TV, this one with a 98-inch screen and weighing in at 158 pounds. It goes without saying that this TV is a beast -- an expensive one. And the Bravia 5 is not even considered the company's flagship model (you can look to the Bravia 8 II and Bravia 9 for that). But this TV is impressive, and after testing it for a week, I'll explain why.\nAlso: You should turn off this default TV setting ASAP - and why even experts recommend it\nThe Bravia 5 is a Google TV, so setting up the UI was fairly easy using the remote and the Google Home app on my phone. But be prepared for a series of screens requiring you to check boxes for privacy disclaimers. The era of streaming content has become very complicated.\nOtherwise, the interface is intuitive, offering quick access to a vast selection of streaming services, apps, and voice control capabilities via Google Assistant. The personalization features are also a plus for helping you discover new content.\nThis behemoth of a display comes with a relatively small remote control. It's slender and lightweight, and if you have fat fingers like me, you might accidentally press enter when you meant to press a navigation button.\nAlso: Your TV's USB port has an underrated feature that can revitalize an old system for free\nI appreciate the downsizing of remotes across most brands these days. Yet despite all the streamlining, Sony (and most others) insist on including dedicated app buttons. You know, for Netflix, YouTube, Disney+, and whatever other platforms the manufacturer contracts with. These buttons take up a lot of real estate and make the remote seem almost \"disposable\" because brands get bought, sold, and sometimes change names.\nFor example, I have a Roku TV with a Vudu button. Who or what is Vudu? That platform still exists, but it's now known as Fandango Media (a joint venture between NBC Universal and Warner Bros.).\nI don't mean to make an example of Sony; its engineers are simply abiding by the current trend. Yet, I haven't met anyone who says they use these dedicated app buttons. When you have a smartly designed home screen, you don't need them.\nThat is one of my two peevish critiques of the Sony Bravia 5. Second is the fact that this remote is not backlit. Come on, Sony. If I'm buying a $6,000 TV, I envision a home cinema experience in the dark (just like in a movie theatre). This means I don't want to turn on my phone to aim a light source at the \"magic wand\" just so I can pause the thing when my DoorDash order arrives. To me, backlighting on remotes seems like a simple ask for anything above a budget model television.\nApologies for my digressionary rant on remote control design. Despite these minor gripes, it became clear to me that the Bravia 5 has plenty to shout about.\nAlso: The next big HDMI leap has arrived - how the 2.2 standard is shaking things up\nFor one thing, Sony's prowess in display technology is impressive. Its proprietary Cognitive Processor XR upscales images beautifully, ensuring motion is slippery smooth with minimal blur. From fast-paced action scenes in the 2023 Mission: Impossible rendition to 2025 NBA highlights, the Bravia 5 delivered 4K resolution with exceptional clarity, vibrant colors, and impressive contrast. HDR content truly pops, showcasing deep blacks and brilliant highlights.\nWhile 4K content looks phenomenal, lower-resolution content (like older cable broadcasts) tends to reveal imperfections more noticeably on such a large screen, even with the XR processor's excellent upscaling.\nThe Sony Bravia 5 can display up to a 120Hz refresh rate with VRR and ALLM enabled, which means the TV dynamically adjusts to match the frame rate of the content being displayed. This is especially good news for gamers. With those kinds of specs, playing Fortnite on a display of this size is an electrifying experience. The Bravia 5 showed no sign of screen tearing, with exquisitely responsive gameplay.\nAlso: The best Sony TVs of 2025: Expert tested and reviewed\nAlready impressed by the images on this behemoth TV, I ran a few tests at the lab for dirty screen effect, burn-in, and blooming. I clocked no degradation, even close to the edges. The color test was consistent; the subtitle test yielded no visible blooming, and the scrolling text motion was liquid.\nHaving said that, viewing the Bravia 5 from side angles was not the best. It's fair to assume that, with the same build and technology in a smaller Bravia 5, this would also be the case. With a 98-inch screen, though, you probably won't get many complaints from someone sitting on the far edge of your couch. And while Sony TVs generally handle reflections well, a screen this large can still be susceptible to glare in brightly lit rooms, so strategic placement and light control are important factors. (You might consider getting some blackout curtains.)\nAlso: I changed 12 settings on my Apple TV to instantly improve the performance\nThis Mini LED TV bears a peak brightness of around 800 nits. That isn't eye-popping OLED-level brightness, but in a dark room, you might want to lower the brightness on a Bravia 5 to prevent eye strain. Trust me, the TV is plenty bright, and it can accommodate seating from any conceivable home theater.\nWhat about sound? The Sony Bravia 5 uses Sony's Acoustic Multi-Audio system, and it's worth some praise. It combines two down-firing X-Balanced speakers for bass and midrange with a pair of Sound Positioning tweeters on the top corners of the back panel to handle mids and highs. The result is a well-balanced listening experience, with clear dialogue and vocals complemented by ambient effects that fill the space nicely.\nFor the ultimate audio experience, though, the Sony Bravia 5 could use a companion soundbar to round things out. Again, if you're investing this much in a giant screen, then your budget might not be too far stretched to install a comprehensive surround sound system as well.\nAlso: This is the soundbar I recommend for deeply immersive audio - and now it's $300 off\nThe Bravia 5 has an impressive array of connectivity options, including Wi-Fi 6E and Bluetooth 5.3 on the wireless side, and several physical ports. I really like how Sony included an infographic panel (of sorts) right next to each port to make it clear which cables go where. It comes with four HDMI ports -- one of them eARC (for that soundbar you should buy), another being 4K at 120Hz (for your online gaming needs).\nBest test deals of the week\nZDNET's buying advice\nThe 98-inch Sony Bravia 5 is a formidable piece of home entertainment technology. Its stunning picture quality, immersive scale, and excellent smart features make it a dream display for any cinephile or gaming enthusiast.\nGrand proportions notwithstanding, Sony's quality will shine through on any smaller-sized Bravia 5 screen. This one runs for about $5,999, whereas you can get an 85-inch Bravia 5 for less than half that price or a 75-inch for one-third the cost.\nEven if it's not about the money, not every home can accommodate a colossal 98-inch panel. So, if your home's parameters aren't suitable for something this big, you'll arguably be getting a better value by downsizing a step or two on screen size.\nIf you have the budget and space, the Bravia 5 delivers on its promise of a magnificent viewing experience. And if you're seeking the ultimate home cinema experience, pair this TV with a high-end soundbar to match the visual grandeur with equally powerful and nuanced audio.\nHow we test TVs\nWhile testing and researching the TVs featured on this list, I and other ZDNET experts kept these criteria in mind:\n- Price: Not all budgets are created equal. And if you're working with a limited budget, that shouldn't mean you have to settle for a sub-par TV.\n- Screen size: The most important factor to consider, after price, when shopping for a new TV is whether or not it will fit into your space.\n- Picture and audio quality: A new TV doesn't mean much, even if it costs an arm and a leg, if it doesn't provide a great picture and clear audio. The best TVs we test have often been ensured to support various HDR codecs, including HDR10+ and Dolby Vision, as well as enhanced audio software like Dolby Atmos, Dolby Digital Plus, and object-tracking sound.\nFor a more detailed look, check out our extensive TV testing methodology."
    },
    {
      "url": "https://go.shopyourlikes.com/pi/5510b53bb4b070c3ceeb3b411a337c342e394360?afId=614548&afCampaignId=subid_value&afCreativeId=2993&afPlacementId=2",
      "text": "Original (Gen 3)\nThe Gen 3 is our newest flagship speaker, offering premium, powerful sound that just won’t quit. Engineered for the outdoors, now with Party Mode.\nOriginal (Gen 3)\nThe Gen 3 is our newest flagship speaker, offering premium, powerful sound that just won’t quit. Engineered for the outdoors, now with Party Mode.\nPARTY MODE\nWith Party Mode you can pair an infinite number of Original Gen 3’s, Rangers, & Grandes for an unbeatable surround sound experience (Party mode does NOT work with the Gen 2’s).\n(Gen 3 does NOT pair with the Gen 2)\nAdd-Ons\nAll-Mesh Camo Hat\n$30\nTHE NEW STANDARD\nIN OUTDOOR AUDIO\nTRIED, TRUE,\n& RUGGED\nThe Gen 3 is our mid-size, flagship speaker, and reliable as they come. It’s insanely rugged, and creates premium, powerful sound that just won’t quit.\nBUILT TO BUMP\nOn top of it’s durability, the Gen 3 features next-level audio quality and performance. It’s built to bump, cut through your surroundings, & play for hours on end.\nCONNECT INFINITELY\nWith Party Mode, pair as many Rangers, Gen 3’s, & Grandes as you want for a mind-blowing surround sound experience. There’s truly nothing like it!\nRatings & Reviews\nExplore what our customers are saying about this product.\nI bought the gray gen 3 had it for a day water damage then go the second one had this one not even a month buttons stopped working again talked to them on the phone they will be sending me out a white one so hopefully doesn’t happen again but great speakers and experience with employees\nHad some water damage and got sent a new one within a week. Other than that I can pair up with my buddies, play loud ass music, and go as far away as I want\nOriginal (Gen 3)\nLoud but also crispy audio, battery lasts forever and it’s very durable.\nMonogram (+$30)\nMonogram will appear on the back of the speaker. Max of 3 characters.\nBase Color:\nHandle & Feet Color:\nMonogram:\nShips: 2-4 business days"
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/sonos-cheapest-smart-speaker-is-also-the-one-i-use-the-most-heres-why/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nSonos' cheapest smart speaker is also the one I use the most. Here's why\nIn addition to a pair of trusty headphones for private listening when you're out in public, you need a portable speaker to keep the music bumping when you're outside grilling, swimming, or walking. A speaker to have inside for jamming out while you're cleaning, cooking, or hosting friends is a bonus, and one that's stylish enough to go from your outdoor hike to your indoor dinner party is a rarity.\nAlso: Here's how a free software upgrade made the Sonos Ace worth their price tag\nAlthough smart home speakers and portable Bluetooth speakers are a dime a dozen -- and I've tested plenty to know -- few are a blend of both. The Sonos Roam 2 is the one I reach for, even a year after its release.\nHere's why it's still my favorite.\nIt's a perfect blend of style and functionality\nThe Roam 2 has an IP67 rating, meaning it can withstand tumbles in the dusty outdoors and brief drops in water. Like all Sonos products, it sports a sleek, nondescript design, an outlier in the sea of rugged speakers with angular edges, loud color combinations, and flashy branding.\nAlso: I replaced my JBL speaker with this unlikely alternative. Here's why it's my new favorite\nSonos' Move 2 speaker is also water-protected, but it's not built for accidental submersion in water and is harder to carry on the go. Plenty of Bluetooth speakers, like Sony's Ult Field 3, JBL's Charge 6, and Bose's SoundLink Max, are waterproof, but nothing beats the simple yet easily recognizable Sonos design that's modern and elegant enough to display around the home. Not to mention, the Move 2 is cheaper than them all.\nSonos' toned-down design elements and waterproof rating make the Roam 2 stylish enough to sit on your countertops while you cook dinner and durable enough to venture outdoors with you.\nWhy don't more speakers have AirPlay?\nBuilding on the Roam 2's functionality, it supports two ways to connect to your iPhone wirelessly. You can use Bluetooth while out and about and Apple AirPlay over Wi-Fi for at-home listening.\nAirPlay uses your home Wi-Fi network to transfer information from your iPhone to the Roam 2 rather than Bluetooth, which uses a direct wireless connection. Streaming music via Wi-Fi to the Roam 2 means only the music plays from the speaker, and not every other noise your phone makes. Notifications, a TikTok video, and haptic sounds are limited to the phone, keeping the noise out of the speaker.\nAlso: This Marshall Bluetooth speaker I tested sounds better than audio systems twice the price\nAirPlay is typically reserved for home speakers that require a power source, tethering them to the outlets in your house -- and they're typically more than $200. It's hard to come across a portable AirPlay-enabled speaker that's less than $200, which is why the Roam 2 wins in my eyes.\nVersatile smart speakers for the win\nThe Sonos Roam 2 has all the smart speaker fixings: voice control, AirPlay, Alexa compatibility, in-app music streaming service diversity, and automatic tuning. Plus, you don't need to keep it plugged into the wall. But if you already reside in the Sonos ecosystem, there are two more features to discover.\nAlso: The best Bluetooth speakers of 2025: Bose, Sonos, JBL, and more\nIf you have other Sonos speakers or soundbars, you can group the Roam 2's audio with them. I like to use this feature when doing chores around the house, so I always have music playing no matter what room I'm in.\nYou can also swap audio from the Roam 2 to your nearest Sonos speaker, which is handy if you're moving rooms but other people in your house want to listen to something else. Then, when you're done listening inside, you can easily carry the Roam 2 with one hand to the patio for outdoor listening.\nWhat Sonos could improve in the next generation\nThe Sonos Roam 2 is a practical portable speaker, particularly for dedicated Sonos fans who want a Sonos product that isn't fixed to the indoors. The speaker could be louder, but that could make it less portable.\nFor its small size, the Roam 2 has a small battery to accompany it. This speaker only delivers around 10 hours of playtime, which is relatively short and not an improvement from its predecessor. Hopefully, the next generation could have one to two more hours of juice.\nIf the Roam 2's short battery isn't a deal-breaker, it's a great option for Sonos fans and those outside the ecosystem, especially if you're searching for a portable speaker to keep around the house and take outside."
    },
    {
      "url": "https://www.anrdoezrs.net/click-9041660-15734609?url=https%3A%2F%2Fwww.bose.com%2Fp%2Fspeakers%2Fbose-soundlink-plus-portable-speaker%2FSLP-SPEAKERWIRELESS.html&sid=subid_value",
      "text": "-\nBold, resonant audio with booming bass\n-\nPremium portable design\n-\nWater and dustproof (IP67)\n-\nUp to 20 hours¹ of battery life\nBose SoundLink Plus Portable Speaker\n-\nBold, resonant audio with booming bass\n-\nPremium portable design\n-\nWater and dustproof (IP67)\n-\nUp to 20 hours¹ of battery life\n-\nBold, resonant audio with booming bass\n-\nPremium portable design\n-\nWater and dustproof (IP67)\n-\nUp to 20 hours¹ of battery life\nPrice is: $269.00\nProduct details\n- SoundLink Plus Portable Speaker\n- USB-C® (C to C) cable\n- Safety Sheet\n| Microphones | No Microphone |\n|---|---|\n| Sound Options | Party Mode (When Enabling Two Speakers) |\n| Audio cable included | No |\n| Water Resistant | IP67 |\n| Entire Product System | 4.114\" H x 11.169\" W x 3.402\" D (3.373 lb) |\n| Product Material | Silicone, Polycarbonate, Steel, Nylon |\n| Battery Life | 20 hours |\n| Battery Charge Time | 5 hours |\n| Charging Interface(s) | USB-C In/Out |\n| Wireless Connectivity | Bluetooth |\n| Bluetooth Version | 5.4 |\n| Bluetooth Range | 30ft |\n| Bose App | Bose App |\nNo. There are no microphones in the SoundLink Plus.\nYes. SoundLink Plus can link with other compatible Bose speakers that have a shortcut button. There are two listening options when a SoundLink Plus Speaker is linked with another Bose speaker:\n- Party Mode\n- Stereo Mode (only available when both speakers are SoundLink Plus)\nParty Mode lets you connect two Bose Bluetooth speakers to play audio in perfect sync. This feature requires two Bose Bluetooth speakers with a shortcut button (may be a combination) from the following list: SoundLink Micro (2nd Gen), SoundLink Flex (2nd Gen), SoundLink Plus, or SoundLink Max. When using two different speaker models, the only option available may be Party Mode. Party Mode can be initiated via product controls. The volume of the speakers can be controlled independently.\nNote: You can only link to one other speaker at a time.\nStereo Mode allows you to unlock a stereo audio experience where the left and right speakers play separately. To use Stereo Mode with a SoundLink Plus Speaker, a second SoundLink Plus is required. When connecting two SoundLink Plus speakers via the shortcut button, Stereo Mode will be the default. You can switch between Stereo Mode and Party Mode via one product press of the shortcut button or in the Bose app via the toggle.\nShortcuts are managed through the Bose app. Shortcuts allow you to configure settings for the programmable shortcut button on SoundLink Plus. When your SoundLink Plus is new, the factory default shortcut is set to linking, allowing you to use the button to link two Bose speakers with a shortcut button together.\nYou can change your shortcut button to be connected to your Spotify account to begin music at the press of a button, access your voice assistant, or other options that may become available with future firmware updates through the Bose app.\nSoundLink Plus can have up to 6 devices paired in its memory. To clear the paired devices list, turn on the speaker and press and hold the Bluetooth button for 15 seconds. You can also remove paired devices in the Bose app from the product settings.\nYes. SoundLink Plus floats but is not designed to be used while in water. SoundLink Plus is designed to withstand accidental drops in water for up to 30 minutes. If SoundLink Plus is directly exposed to salt or chlorinated water, rinse with fresh water and allow it to dry thoroughly before use.\nTwo things to keep in mind when the speaker gets submerged:\n- If the product is playing when it gets submerged (e.g. you drop it in a pool), the Bluetooth connectivity will be lost almost immediately. It’s possible that the product will reconnect automatically to the Bluetooth device it was connected to when you pull it out of the water, but it’s not a guarantee\n- If the product is completely saturated with water, the audio may sound crackled or distorted at first. It will eventually clear itself either with shaking it, blowing on it, or playing audio at a loud enough level\nThe Bose SoundLink Plus Portable Speaker supports Bluetooth profiles A2DP, AVRCP, SPP, iAP, and BLE.\nYes. You can charge other devices using the SoundLink Plus USB-C charge-out feature. SoundLink Plus supports charging out at 15W (5V/3A), which will charge typical mobile phone and tablet devices. Larger devices, such as laptops and power banks, may not charge due to their power input requirements. Please consult the device manual to understand if your device can charge from a 15W USB-C supply.\nWhile the loop is designed for durability, in the event it is damaged, please contact us for support.\nIf debris gets into the charging port or other parts of SoundLink Plus, gently rinse with fresh water or compressed air. Be sure charging ports are thoroughly dry before charging. For the larger exterior surfaces, wipe clean with a soft cloth. Avoid using cleaning detergents and let SoundLink Plus dry before operating.\nSound that sparks the moment\nSay hello to SoundLink Plus Portable Speaker — big enough to bring booming bass, portable enough to plus up the energy of any get together.\nBold, resonant audio\nDesigned to bring the bass without too much bulk, SoundLink Plus is engineered for an ideal size-to-sound ratio.\nTake it up a notch\nConnect two SoundLink Plus Speakers or pair to another compatible Bose portable speaker to up the group’s vibe even further. Stereo Mode lets you hear balanced, leveled sound from each source while Party Mode powerfully plays the same audio simultaneously.\nEasily tweak your sound to your liking with Adjustable EQ via the Bose app. Up the bass, balance the treble, and listen how you want.\nVibes at the ready\nThe SoundLink Plus withstands weather and falls, and has the battery life to play through any circumstance. The speaker’s portable size means you can toss it in a backpack and shift the mood whenever the moment calls.\nReady for anything\nThe SoundLink Plus’ tough, ready-for-anything exterior is dust- and waterproof (rated IP67), plus shock and rust resistant. And a powder coated steel grille with soft-touch silicone means this speaker is ready to bring the music to any moment, anywhere.\nFeatures\n-\nSound that sparks the momentPlus up the energy of any group hang with bold, resonant audio and booming bass.\n-\nPremium portable designBig enough to bring the bass and portable enough to up any vibe. Toss it in a backpack or clip it via its carrying loop.\n-\nReady-for-anything exteriorWithstands all weather and survives fumbles, tumbles, and falls. Dust- and waterproof (rated IP67), and shock and rust resistant.\n-\n20-hour fuelBoasts up to 20 hours of battery life so it’s always ready to keep the vibes going.\n-\nStay powered upKeep your phone charged by plugging directly into your speaker’s USB-C charging port — so staying powered isn’t a problem.\nWhy buy from Bose\n-\n90-day return policy\nTry it for 90 days to make sure it’s right for you.\n-\nPrice match promise\nShop confidently. We’ll match a lower price.\n-\nComplimentary shipping & returns\nOn all in-stock orders.\n-\nMy Bose perks\nMy Bose members receive welcome and birthday offers, exclusive experiences, and more.\nFind your speaker\nSound for any occasion\nWhether you're breaking the ice or running the party. Shop portable speakers that hit different. Now in limited-edition colors.\n¹ Using Bluetooth A2DP audio at 65% volume and between 68° F – 77° F (20° C – 25° C), with default EQ using a mix of Top 50 Global tracks as of November 2024 and no charging of external devices. Battery life outcomes vary based on a number of factors including settings, environment, usage, product age, feature usage and impact of software updates."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/i-take-this-sony-speaker-to-the-beach-every-summer-for-one-obvious-reason/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI take this Sony speaker to the beach every summer - for one obvious reason\nSony Ult Field 1\nZDNET's key takeaways\n- The Sony Ult Field 1 is a portable speaker available for $130 (but on sale for $98)\n- The speaker prioritizes crystal-clear sound and pronounced bass, with vibrant audio that sounds like it's coming from a much more expensive device\n- It doesn't boast as long a battery life as its predecessor, but what it lacks in battery, it makes up for in stellar sound.\nAmazon is discounting this Sony Ult Field 1 speaker by $30 right now, bringing the price of the speaker down to $98.\nMy roommates and I have been blessed with a New York apartment that can hold more than three people at once (a rarity in the metropolitan housing market), so we have become chronic party throwers because of this. We've put on weeknight dinner parties, birthdays, anniversaries. We have everything needed for a successful party, except a good speaker -- and that's not without trying.\nIt's a familiar scene: my roommate pulls out her years-old Bose speaker, which requires a cord connection. Unsurprisingly, it gets no mileage. We ask friends to bring their speakers, but rarely do theirs win the battle against a crowded apartment of 20 to 30 people.\nAlso: The best smart speakers\nSo, when I tested out Sony's brand new Ult Field 1 speaker at our 15-person dinner party, I was half expecting the bustle of guests to overpower this portable speaker's sound. Boy, was I wrong.\nThis speaker filled the room with rich audio that sounded like it was coming from a far more expensive device. In fact, this speaker exceeded my expectations in a few key ways. It's easily become my summer party and beach day companion because I am impressed with the sound, build, and battery.\nSony is known for naming its devices like airplanes: The Ult Field 1's predecessor, which shares the same price tag, is the SRS-XE200. That doesn't quite roll off the tongue, does it?\nThe company is changing its ways as the crowd cheers. This new lineup of audio equipment has much more pronounceable names, including the Ult Field 1. As a Sony spokesperson explained, Ult is for \"ultimate\" and Field for its portability.\nThe new speaker is the smallest of the Ult Field model lineup and comes in four colors: off-white, forest gray, black, and orange. It's about as long as your forearm and has the circumference of a soda can. Alongside its IP67 waterproof, shockproof, and dustproof ratings, Sony added a rustproof rating, catering to those who take the speakers to the beach, where they're weathered by salty ocean water.\nYou can position the speaker right-side up or on its side, like with its predecessor. The Ult Field 1 improves on the SRS-XE200's sound with more power and balance -- it doesn't prioritize one orientation, whether horizontal or vertical, over another. My songs sounded just as vibrant in both orientations.\nListening to music on this speaker has been such a joy. On average, I've spent about an hour a day listening to music through the speaker, and the battery life lasted around a week and a half. That's in line with the 12-hour battery life that Sony advertises. The SRS-XE200 had a 16-hour battery life, but what the Ult Field 1 loses in battery life, it makes up for in improved sound.\nAlso: The best sound systems\nIn a side-by-side demo of the SRS-XE200 and the Ult Field 1, the distinction in sound and clarity was night and day: the already-clear SRS-XE200 sounded tinny in the presence of the Ult Field 1's crystal-clear sound.\nConnectivity is a breeze: the speaker paired nearly instantly with my phone and my friend's phone as we swapped DJ shifts at dinner.\nThe Ult lineup, which includes the $130 Ult Field 1, the $500 Ult Field 7, the $1,200 Ult Tower 10, and the $200 Ult Wear headphones, prioritize big, booming bass. When I wanted to engulf myself in the bass of one of my favorite songs, Dijon's Talk Down, I pressed the Ult button on my speaker, and it immediately transformed the song into a pulsing anthem that reverberated in my living room.\nYou don't need to listen to booming bangers to be impressed by the clarity of this speaker, either. When I played my classical music playlist, the violins and strings sounded so close in proximity and undeterred by the speaker's build that it was as if I had just walked into the New York Philharmonic for a concert.\nAlso: Best Bluetooth turntables\nWhile I was testing it, I spent two hours of my Saturday afternoon in bed, doing nothing else but listening to music solely because of how clear it sounded. The Ult Field 1 speaker plays sound as it should be, true to how its creators intended.\nNot only can the speaker project a rich, bass-heavy sound, it can also get loud. When I powered up the Ult Field 1 at my recent 15-person party, it held its own, shocking me with its large power despite its compact size. Since my initial tests, I've taken the speaker everywhere -- to the beach a few times, to the park, to other friends' parties.\nBest test deals of the week\nZDNET's buying advice\nAfter a few weeks of listening to every song, album, and playlist on my phone, I'm confident to recommend this new speaker to anyone looking for a sub-$150 sound system that punches well above its price point. Plus, a $30 deal takes the Sony speaker down from $128 into sub-$100 territory. The Ult Field 1 is perfect as a speaker for a small apartment or anyone who wants to be surrounded by juicy bass and transparent sound.\nWhen will this deal expire?\nWhile many sales events feature deals for a specific length of time, deals are on a limited-time basis, making them subject to expire anytime. ZDNET remains committed to finding, sharing, and updating the best offers to help you maximize your savings so you can feel as confident in your purchases as we feel in our recommendations. Our ZDNET team of experts constantly monitors the deals we feature to keep our stories up-to-date. If you missed out on this deal, don't worry -- we're always sourcing new savings opportunities at ZDNET.com."
    },
    {
      "url": "https://www.zdnet.com/article/this-200-android-phone-with-a-paper-like-display-made-my-pixel-look-overbearing/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nThis $200 Android phone with a paper-like display made my Pixel look overbearing\nTCL 60 XE Nxtpaper 5G\nZDNET's key takeaways\n- TCL's 60 XE Nxtpaper 5G is on sale on Amazon for $222.\n- It has a unique display, and a feature set that promotes minimalism and digital well-being.\n- I just wish the camera system and general performance were better.\nBeing glued to your smartphone's screen all day can do a number on your eyes, and I definitely can feel it. TCL's Nxtpaper technology offers a paper-like screen that's made for tired eyes like mine. The TCL 60 XE Nxtpaper 5G is the company's affordable attempt at relieving some of the stress that comes from modern smartphone screens.\nAlso: Changing this Android setting instantly doubled my phone speed (Samsung and Google models included)\nIt's a unique trick for a very inexpensive smartphone that needs to be seen to be understood. While far from perfect, and definitely a device built to a price, it brings a differentiator that will matter for some users looking to give their eyes a rest while they scroll or read.\nA unique multi-faceted display\nThe display is what immediately sets the 60XE apart. TCL's Nxtpaper 3.0 matte coating gives the glass an undeniably unique finish that I quite like. On-screen content looks a bit like E-ink depending on the mode the phone is in, but underneath that hazy layer is a standard 1080p, 120Hz LCD panel.\nThe coating addresses a slew of common downsides of modern displays. It reduces blue light, cuts reflections to nearly nothing, and even eliminates most fingerprints. There's also a nice texture that feels a bit like paper, which is a nice departure from a sea of glossy, reflective displays.\nBeneath the power and volume buttons is a physical Nxtpaper Key, a plastic switch that feels a bit cheaper than I'd like. Flipping the switch offers up a menu of distinct modes that change how the display operates.\nTCL clearly wants users to notice and appreciate this feature because every toggle results in a five-second full-screen animation complete with an obnoxious serenade. I made sure to set my volume to mute so I could avoid the theatrical effect.\nEach mode provides its own twist on usability and comfort. Color Paper Mode, my favorite, mutes the colors while retaining a standard Android interface that's easier on the eyes for all-day use. I even enjoyed watching YouTube videos in this mode, though everything feels a bit flatter than my eyes are used to.\nInk Paper Mode goes one step further, stripping color from icons and text for a no-frills grayscale approach, while still delivering the full unencumbered Android experience. Max Ink Mode is the most dramatic change, stripping all color while also limiting apps to a small subset of essentials and suspending certain background processes.\nAlso: iOS 26 envy? 5 iPhone features you can already use on your Android (Samsung included)\nThe result is an ultra-minimal, battery-saving mode that can last more than a week on a single charge. I enjoyed this mode for reading ebooks and could see it as a great solution for users looking to cut back on smartphone use entirely.\nThe display does come with a major caveat. On the brightest days, the matte finish would all but wash out on-screen content, often making it unusable in direct sunlight. If you spend time outside reading or working, you'll be looking for shade like I was.\nPerformance and battery\nPerformance is modest but serviceable, with a MediaTek Dimensity 6100+ processor inside paired with 8GB of RAM. In use, this is not a phone for hardcore users who push their devices to the limit. I noticed many actions have a slight delay attached to them. Launching the camera often takes a few seconds to negotiate.\nGeneral tasks like web browsing, email, and messaging are responsive enough to keep me happy, but things never felt snappy.\nOn the software front, the 60 XE runs Android 15, with a promise from TCL of just one upgrade to Android 16 and two years of security patches. As someone who always decries the poor state of Android OS update promises, this is a weak point, and TCL needs to step up its game. Anyone hoping to get long-term value should consider other options.\nAlso: I spent a week in New York City with the Samsung Z Fold 7 - and it spoiled me the entire time\nI found battery life to be a highlight, which isn't that surprising given the 5,010mAh battery hidden inside. I routinely made it through the day with around 20-30% capacity to spare at bedtime. Wired charging tops out at a slow 18 watts, so quick daytime top-ups will take some time, but it's fine for plugging in overnight.\nFor the truly battery paranoid, there's the Max Ink Mode that considerably jumps battery life to more than a week if you are willing to cut down on much of what the phone is capable of.\nStay for the display, but not the camera\nThe plastic marble-like backplate surrounds a large circular camera array that's hard to miss and perhaps even more premium-looking than its price point. One pet peeve of mine is an off-center camera module, and this phone has a notable wobble when placed on a tabletop as a result.\nThe camera system itself is one area where the low-end cutbacks really show. The main sensor does its best outdoors in very bright conditions and needs a lot of light to help shots taken indoors. The camera performance is mediocre with soft output that lacks punch and definition most of the time.\nLow-light conditions easily demonstrate the camera system's baseline capability, and the ultrawide lens often results in grainy images. The 32MP front camera works, but that's about it. Let's just say that this is not the phone for the discerning camera buff.\nZDNET's buying advice\nWhat the TCL 60 XE Nxtpaper 5G offers is a key standout feature: a unique matte display. At $250, the 60XE offers something that you really can't find anywhere else, in this price category and beyond, and the benefits of that might matter a lot for certain users. For everyone else, consider phones like the CMF Phone 2 Pro, which offers better imaging, better speed, and its signature modular design approach.\nFollow my latest tech reviews and projects across social media. You'll find me on YouTube at YouTube.com/@JasonHowell, on X (formerly Twitter) at @JasonHowell, and on Instagram at Instagram.com/thatjasonhowell."
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/best-bluetooth-speakers/",
      "text": "I found the best Bluetooth speakers of 2025: Options for indoor and outdoor listening\nWhy you can trust ZDNET\n'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nBest bluetooth speaker deals of the week\n- $100 (save $30)\n- $130 (save $20)\n- $400 (save $100)\n- $120 (save $20)\nBluetooth speakers can be an important part of any tech collection, allowing you to listen to your favorite tunes wherever you go. Whether you're barbequing in the backyard, hiking with a friend, or lounging by the pool, a Bluetooth speaker can enhance the experience. Thankfully, there are tons of options, and the best of them have solid battery life, versatile connectivity, and even a water-resistant design.\nBluetooth speakers connect to a source via Bluetooth, making it easy to connect them to any device, whether it be an Android phone, an iPhone, a laptop, or something else. Given that there are so many options to choose from, it can be hard to find the perfect speaker for your needs. Whether you're looking for an ultra-portable speaker that you can clip onto your backpack or something a bit bulkier with deep bass, there should be something for you. We've tested dozens of Bluetooth speakers, and these are the best you can get right now.\nWhat's the best Bluetooth speaker right now?\nAfter testing dozens upon dozens of Bluetooth speaker models, we've selected the Anker Soundcore Boom 2 as the best Bluetooth speaker overall. That's thanks to its durable build, solid audio quality, helpful app, and affordable price. That said, it's not the only option out there. You might be willing to pay more for something higher-end or want something smaller for better portability.\nOur other picks, like the Sonos Move 2, are just as great, especially for people who want a Bluetooth speaker with wonderful sound and a sleek design. It's a portable speaker optimized for indoor and outdoor listening, but it offers valuable smart speaker features like Apple AirPlay and Amazon Alexa.\nThe best Bluetooth speakers in 2024\nWhy we like it: The Anker Soundcore Boom 2 may be built from plastic, but its rugged design and IPX7 water resistance make it suitable for outdoor adventures. The design also includes a range of buttons and controls on the top of the speaker that make it easy to connect devices, tweak volume, and play and pause media as needed. If you want a bit of a bass boost, there's a bass boost button on the top that will give a little more oomph to those bass synths and kick drums. It may not be as portable as some others on this list, but with a large handle on the top, it's easy to carry around the backyard at your next BBQ.\nOne of the best things about Soundcore speakers is that they work with the Anker Soundcore app, which offers access to a range of controls where you can tweak lighting effects, manage connectivity, and EQ the audio to your preferences with an impressive nine-band EQ. That's better than what even many more expensive speakers offer in their own apps.\nAlso: This portable Bluetooth speaker from Anker is so good, I forgot how affordable it was\nThe sound quality offered by the Anker Soundcore Boom 2 is good for a speaker in this price range, though if you're willing to spend more, you can get a speaker that sounds a lot better. Its bass response is decent, while its high-frequency response is only fine, and it has decently natural mids. Regardless, if you're looking for a great Bluetooth speaker with a range of helpful features and don't want to spend an arm and a leg, the Anker Soundcore Boom 2 is excellent.\nWho it's for: The Anker Soundcore Boom 2 is for those who want a reliable Bluetooth speaker that can pump out loud audio without breaking the bank. If you're not overly picky about audio quality and instead prefer longer battery life and a durable build at a reasonable price, the Soundcore Boom 2 is perfect for your needs.\nWho should look elsewhere: Those with high standards for audio quality and the willingness to spend a little extra should go for a different option. Additionally, those who want something as portable as possible or something that can at least fit neatly in a backpack should look for something smaller and lighter, as while the Soundcore Boom 2 might fit in a larger backpack, it's not really built for that kind of portable use.\nAnker Soundcore Boom 2 tech specs: IP rating: IPX7 | Battery life: 24 hours | Charging port: USB-C\nWhy we like it: If you are willing to spend a little more cash on a portable speaker, then the Sonos Move 2 is the way to go. As you would expect, the Move 2 integrates with the Sonos ecosystem through Wi-Fi, and when you're listening at home, it can be used as one speaker in a multi-room setup in the Sonos app, controlled through voice, and so on. Over Wi-Fi, it supports AirPlay 2, allowing it to stream audio from Apple devices. Then, when you want to take it on the road, simply connect to it through Bluetooth from your phone, and you're good to go.\nIt's not just smart, though. The Move 2 promises 24 hours of playback and an IP56 water resistance rating that protects it from water exposure. You can connect to it through a wired connection, though to do so, you'll need to buy the sold-separately Sonos Line-In Adapter.\nAlso: Why Sonos' cheapest smart speaker is one of my favorites - even a year after its release\nThe best thing about the Sonos Move 2 is how excellent it sounds. The speaker delivers deep and powerful bass, natural mids, and clear, detailed highs. It'll make tracks of any genre sound great, whether they lean on deep sub-bass or tend toward a slightly more natural tone. Seriously, it's one of the better-sounding Bluetooth speakers we've tested.\nWho it's for: The Sonos Move 2 is perfect for those willing to spend a bit of cash on a great overall speaker. Those who want high-quality audio and versatile connectivity features will love what the speaker offers, as will those already deep in the Sonos ecosystem or those who want something that works with AirPlay 2 and Bluetooth. Although the Move 2 is pricey, if you do have the budget for it, you'll find it to be well-rounded and versatile.\nWho should look elsewhere: If you want a speaker that doesn't cost too much, the Move 2 may not be the best option for you. Additionally, if you're looking for something highly portable, you'll want to keep looking. The Move 2 is portable, in that it'll fit fine in the trunk of your car or even a backpack, but it'll be heavy, and you certainly won't want to take it hiking.\nSonos Move 2 tech specs: IP rating: IP56 | Battery life: 24 hours | Charging port: USB-C\nWhy we like it: JBL's Charge speakers have long been a go-to option for those looking for a great Bluetooth speaker, and the latest generation model is no exception to that rule. The JBL Charge 6 offers modern features, a helpful design, and solid audio quality that anyone can appreciate.\nThe JBL Charge 6 has an IP68 water resistance rating, which means it can easily be submerged and survive to tell the tale. In addition to the water resistance rating, JBL markets the speaker as drop-proof, and it has rubber bumpers on the edges that keep it safe in the event of a fall.\nReview: JBL Charge 6\nWhile the speaker isn't ultra-portable like some others, it's still built to be taken on the road. It can fit in a backpack, and it has an included strap that makes it easy to carry around. It's not very heavy either, given that it's larger than ultra-portable models. If you don't want to listen through Bluetooth, it supports USB audio that lets you plug in your phone or another device for lossless wired listening.\nColor options are perhaps not as important as features, but the Charge 6 also comes in a range of bright and vibrant colors, including purple, pink, and red. For those who want a more understated look, you can still get it in blue, black, or white – so there should be an option for everyone.\nWho it's for: The JBL Charge 6 is perfect for those who want something more rugged than a typical Bluetooth speaker. The speaker has an IP68 water resistance rating and rubber bumpers that keep it safe if it has to endure a fall. It also happens to sound great and works with a great app. It's not necessarily cheap, but it's also not over the top in price, so if you're willing to pay $200 or so, the JBL Charge 6 is absolutely worth the cash.\nWho should look elsewhere: If you want the highest-quality audio you can get in a Bluetooth speaker, then the JBL Charge 6 probably isn't for you. It sounds great, to be sure, but not as great as the Sonos Move 2. Additionally, while the speaker is very portable, if you want the most portable speaker you can find, you should probably go for a different option. Lastly, if you're on a tight budget, there are cheaper Bluetooth speakers out there.\nJBL Charge 6 tech specs: IP rating: IP68 | Battery life: 28 hours | Charging port: USB-C\nWhy we like it: There are plenty of ultra-portable speakers out there that you won't even feel in your backpack or that you can clip onto a belt or strap when you're on the go. The best of these is the JBL Clip 5, which gets its name from the clip that's built into it and that allows you to connect it to all kinds of different straps and belt loops. One of the best things about this speaker is that it works with the same app as JBL's other speakers, which is more than many other ultra-portable options can say.\nReview: JBL Clip 5\nOn top of being highly portable, the JBL Clip 5 is also rugged, thanks to its IP67 water resistance, allowing the speaker to withstand bouts in the rain or drops in the pool. It supports Bluetooth multipoint, which lets you connect the speaker to multiple sources at a time, and it works with Auracast, which allows you to use it in tandem with other compatible JBL speakers. That's all to say that while the speaker is small, that doesn't mean it's low tech.\nThe speaker's overall audio response is pretty good. The simple fact is that smaller speakers can't produce bass that's as deep as larger ones, so don't expect to get great sub-bass response or incredibly powerful kick drums. That said, the bass response and volume are better than you'd assume for a speaker this small.\nAs you might expect, you can't fit a huge battery in a speaker this small, so don't expect days of use from the Clip 5. However, it offers 12 hours of playtime, better than many other ultra-portable options.\nWho it's for: The JBL Clip 5 is perfect for those who want something as portable as possible or who want to spend a little less on a speaker that still has decent smart features like the ability to work with an app and Bluetooth multipoint.\nWho should look elsewhere: If you want the best audio quality you can get, or at least decent bass response, and don't mind dealing with a speaker that's a little larger, then it's probably worth going for something else. Additionally, if you have a tight budget, there are cheaper ultra-portable speakers out there, but they don't offer the same level of features or the same helpful design as the JBL Clip 5.\nJBL Clip 5 tech specs: IP rating: IP67 | Battery life: 12 hours | Charging port: USB-C\nWhy we like it: The Bose SoundLink Home is one of the better-looking Bluetooth speakers out there, thanks to its stylish design with a frame that wraps around the edges and a textile covering that ensures it'll look great in any home environment. It is largely built for home environments rather than for use on the go, since it lacks an IP rating, meaning that you'll want to avoid it getting wet entirely. It doesn't have a strap or handle that will make it easy to carry around.\nThe SoundLink Home has deep and rich bass, well-tuned mids, and good clarity and detail in the high ends. It can be paired with a second SoundLink Home for stereo listening, and playback and media are easily controlled through the built-in buttons.\nReview: Bose SoundLink Home\nThe SoundLink Home excels where it counts, and that's in audio quality and style. It is a little pricey for a speaker with its limited features, but given its premium design and great audio quality, you may be willing to spend the cash for it.\nWho it's for: The Bose SoundLink Home is perfect for those who want something that will look and sound great in their home. Its premium design sets it apart from the huge range of plastic and cheap-looking speakers out there, and it still sounds great too. It's also ideal for people who want a speaker for at-home listening, but don't care for the bells and whistles found in smart home speakers.\nWho should look elsewhere: If you want all the latest and greatest features from your Bluetooth speaker, then you probably want something that works with a smartphone app. As such, the Bose SoundLink Home isn't necessarily for you. Additionally, the SoundLink Home is a little expensive, so if you're on a budget, then it's probably worth going for something else.\nThe SoundLink Home has a limited battery life, clocking nine hours of playtime. However, given that it's built for home use, that may not be as big of a deal. Still, you should get through average-length listening sessions without running out of juice as long as you keep it topped up regularly.\nBose SoundLink Home tech specs: IP rating: N/A | Battery life: 9 hours | Charging port: USB-C\nWhat is the best Bluetooth speaker?\nWhile the Anker Soundcore Boom 2 is our current top pick, here's how the rest of our favorites stack up against it.\n| Speaker | Price | Battery life | Water resistance |\n| Anker Soundcore Boom 2 | $130 | 24 hours | IPX7 |\n| Sonos Move 2 | $449 | 24 hours | IP56 |\n| JBL Charge 6 | $200 | 28 hours | IP68 |\n| JBL Clip 5 | $80 | 12 hours | IP67 |\n| Bose SoundLink Home | $229 | 9 hours | N/A |\nWhich is the best Bluetooth speaker for you?\nChoose this Bluetooth speaker... | If you want... |\nAnker Soundcore Boom 2 | An easy-to-use speaker with big bass, party lights, and an intuitive companion app. |\nSonos Move 2 | A hybrid smart and Bluetooth speaker that can perform as well indoors as it does outdoors and look good doing it. |\nJBL Charge 2 | A loud and goos-sounding Bluetooth speaker that can survive drops, tumbles, and dips in water. |\nJBL Clip 5 | An ultra-portable Bluetooth speaker that delivers sound bigger than you'd expect. |\nBose SoundLink Home | A stylish Bluetooth speaker with a smooth sound and simple controls. |\nFactors to consider when choosing a Bluetooth speaker\nA Bluetooth speaker is a vital element of your tech arsenal, but you don't typically upgrade it often. Therefore, it's imperative to buy a speaker that best matches your needs and use cases. We tested speakers that thrive in different environments, and these are the key elements to consider before you buy.\n- Battery life: Like any other rechargeable product, battery life is important to consider based on your power needs. Power users will want speakers with longer continuous playtime, while infrequent users can get by with fewer hours.\n- Durability: Some speakers are more durable than others regarding how well they can handle exposure to water. Some can withstand splashes and spills, while others can survive accidental submersion into a pool or the ocean. If you plan to often take your speaker to the lake, beach, or pool, you'll want a stronger durability rating. If you will mostly use your speaker for entertaining guests, cooking out, or lounging at the park, you can get away with a weaker durability rating.\n- Special features: Some Bluetooth speakers do more than play music from your Bluetooth-enabled device. Speakers like the JBL Charge 6 offer reverse charging, allowing the speaker to charge your USB-C devices, while the Sonos Move 2 offers Apple AirPlay.\nBluetooth speaker vs. smart speaker\nAs Bluetooth speakers become more advanced, they include more features typically reserved for smart speakers, like Apple AirPlay, Alexa voice controls, and Wi-Fi streaming. Still, one feature usually separates smart speakers from Bluetooth speakers: the need for a power source.\nSmart home speakers like Apple's HomePod and Sonos' Era 300 offer all of the smart speaker bells and whistles, but they always need to be plugged into an outlet, tethering them to your house. On the other hand, Bluetooth speakers may omit most smart speaker features, but their rechargeable battery allows you to take them on the go.\nWhat does an IP rating mean?\nIP stands for \"Ingress Protection,\" a rating used to evaluate how much dust and water an electronic device can withstand before severe damage occurs. Each number following IP has a specific meaning, with the first representing dust resistance and the second measuring water resistance. The higher each number, the greater its resistance will be. For example, a speaker with an IP54 rating has weaker dust and water resistance than a speaker with an IP68 rating.\nAre there alternative best Bluetooth speakers worth considering?\nWe've tested dozens of Bluetooth speakers, and although we've shared our top picks, these are worth considering, too."
    },
    {
      "url": "https://www.zdnet.com/article/i-fell-in-love-with-a-2000-mirrorless-camera-that-puts-design-and-simplicity-over-everything-else/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI fell in love with a $2,000 mirrorless camera that puts design and simplicity over everything else\nSigma BF\nZDNET's key takeaways\n- Sigma's BF is a $2,200, 35mm full-frame, mirrorless digital camera that radically changes the mode of operation by replacing the gaggle of buttons with an elegant click-wheel.\n- It's a great first camera but also has tons of pro features\n- A future upgrade to a higher-resolution 60-megapixel sensor would be a welcome enhancement.\nTaking pictures with a digital camera hasn't changed much in thirty years. The electronics have improved, but the basic act of operating a digital camera has remained mostly the same. Cameras are a gaggle of buttons that are a cryptic arrangement to anyone but the initiated.\nThe real innovation in the picture-taking experience has been the smartphone, which has made picture-taking an always-available tool for documenting everything with relative ease.\nThere is still an audience, however, for innovation beyond what smartphones offer. Young consumers keep buying digital cameras, and a new generation is always interested to learn more about photography as an art.\nAlso: The best vlogging cameras of 2025: Expert tested and reviewed\nInto the void steps lens and camera maker Sigma Corp., based in Kanagawa, Japan, just outside Tokyo. The company this spring introduced a radical redesign of the digital camera's basic mode of use.\nThe Sigma BF, as it's called, reduces the mass of buttons to a small set of touch-sensitive controls. All the functions of digital photography are still there to be experimented with and exploited -- shutter speed, lens aperture, or \"f-stop,\" and \"ISO,\" the level of light that can be recovered from a scene -- but they are under your command in a radically simplified user interface.\nI've been testing the BF for some weeks now, and I'm smitten with the changes. The hardware's design is beautiful, and the new user interface is very thoughtful. The name \"BF\" stands for \"beautiful foolishness,\" and you could say this kind of redesign is crazy, but I love it.\nA camera for a new age of photographers\nSigma, a sixty-three-year-old company, makes most of its money from lenses for all camera brands. As a result, its cameras have tended to be somewhat experimental, never selling in the same volume as Sony, Canon, or Nikon. That means that the company takes chances. Often, the results are wild and beautiful.\nThe BF is really meant for a new age of prosumers who want to up their game in photography. At a retail price of $2,199, the price is not insignificant, but it is on the low end for what you'd pay for a very good 35mm digital camera these days. Lenses, which have to be bought separately, run from about $600 for a fixed focal length \"prime\" lens to $1,300 or more for zoom lenses. The BF uses what's called an \"L-mount,\" which means you're not limited to Sigma's lenses; it's also compatible with lenses from Leica, Panasonic, Samyang, and Sirui.\nAlso: Eufy's latest security camera has AI-powered color night vision - and no monthly fees\nThe premise of stepping up your game from the smartphone camera is pretty simple, to my mind: You will never, ever, get as good a picture with any smartphone camera as you will with a camera that has a real lens. The lens is the key. The optics are just so superior to the optics on a smartphone.\nI tested the BF with a 50mm prime lens from Sigma, the same kind I already use for most of my photography.\nNo matter what you are photographing, there are immediate benefits to using a real camera versus a smartphone camera.\nOne benefit is the detail you get. Here's a picture of a butterfly landing on some vegetation in a vivarium. When cropping the image to see the butterfly up close, you'll get a level of detail that is clean rather than the murky detail you get even with a smartphone's optical zoom:\n(None of these photos have been edited. They are all straight out of the camera. In some cases, the file size has been compressed to accommodate the publishing system.)\nNot only detail but also control of the depth of field via the aperture dial on the lens provides control over the selective blurring of objects, the \"bokeh.\"\nSmartphones will give you fake bokeh that is generated in software rather than the actual bending of the light via the lens elements. Rarely will fake bokeh give you a really complex, thrilling effect where both foreground and background elements are selectively blurred, leading to a more sophisticated image, such as this cypress I snapped in New York's Central Park:\nAnd even when fake bokeh works, I don't think you'll achieve the almost holographic, floating beauty you get with a real lens while preserving all the detail of the foreground subject, as with this thistle:\nThe second advantage is that a real lens will give you more real proportions than a smartphone lens that has a lot of barrel distortion. Like a building architectural shot or this bank vault:\nYou can get a nice, crisp skyline shot at twilight as the light changes:\nA swing to simplicity\nWhere the BF departs from other cameras is in the simplicity of design and user interface.\nThe hardware is, very simply, a solid shell milled from a block of aluminum and then filled with electronics. It's a gorgeous manufactured object with a super solid feel. (Sigma cameras always feel super solid, but this is on a new level.)\nThe BF's body is one of the lightest full-frame mirrorless cameras on the market, at just under a pound, compared to devices such as the Sony a7 IV, which weighs nearly a pound and a half.\nFor non-camera users, the weight of any real camera is something of a surprise compared to a smartphone such as an Apple iPhone Pro, which weighs half a pound. Holding 15 ounces worth of an unfamiliar object prompted some people to whom I handed the BF to remark, \"It's so heavy!\"\nAlso: First look at iPhone 17 Pro? Public images seemingly confirm big design and camera changes\nThe total weight of the camera is the combination of the 15 ounces and the 12 ounces of the 50mm Sigma lens. That kind of heft is typical of full-frame lenses because they have a lot of glass inside them. (And this particular Sigma lens is not very heavy as 50-millimeter lenses go.)\nThe real adjustment for a novice photographer is getting used to the balance of weight between camera and lens versus carrying a slab of a smartphone with uniform weight distribution.\nThe camera comes in two finishes, a striking silver color and a deep black. I chose to try the black as I like to use the camera often in discreet settings such as a jazz club, so I wanted something less flashy than the silver.\nThe sensor is a full-frame, 35mm Sony chip with just under 25 megapixels, less than the 60 megapixels in some 35mm cameras. Despite a lower pixel count, I found the sensor produced rich detail, certainly enough for Instagram pictures and possibly good enough for wall-sized prints depending on the exposure. Sony is a very reliable name for sensors, so it makes sense for Sigma to go with the market leader.\nImages are stored in the internal 230-gigabyte flash memory, which I found to be more than enough for my purposes. I usually offloaded the pictures onto my iPad or MacBook after each photo-taking session via USB-C and then cleared the BF's memory.\nAlso: Why the best fix for headless server frustration might be a little box named Comet\nOn the software side, the radical simplification of the user interface is striking -- it's even something of a revelation.\nI've been a user of Sigma cameras for over a decade, my main camera these days being the Sigma fp-L, a 60-megapixel model introduced a couple of years ago. I love that camera, but I would be very happy to see the changes in the BF user interface become standard on Sigma cameras going forward.\nThe main innovation is removing a lot of shooting information from the LCD screen. Instead of seeing the aperture or shutter speed and other settings constantly on the display, each setting on the BF occupies a separate, tiny LCD -- it's called a \"status monitor\" though I tend to think of it as simply a \"mini-LCD\" -- to the right of the main display.\nA click wheel just below the mini-LCD, formally called the \"dial pad,\" reminiscent of the first Apple iPod's click wheel, lets you rotate through the values of shutter speed, etc. The changing values are displayed on the mini-LCD as you do so, and you click the center button of the click wheel to select the setting you want.\nThere's also a touch-sensitive playback button, so you can peek at what you just snapped with a soft touch, and a touch-sensitive menu button, which is a quick way to peek at the camera's settings. And a power button at the bottom of all this, of course.\nThe effect is that the main display screen is a pristine window into what you're capturing in the real world, while the mini-LCD and the click-wheel are your controls. It's a nice division that elegantly separates the gaze from the adjustments.\nThe main LCD is a 2.1 megapixel model and is terrifically responsive for things such as selecting the focus area by tapping with your finger, or using pinch and swipe when looking through the photos you've taken.\nAlso: Stanford's holographic AI glasses are coming for your clunky VR headset\nIf you half-press the shutter button, the display momentarily shows the key settings before you fully commit to the shutter release. If you press on the center button of the click-wheel, or dial pad, extra settings come up for the function that's in focus, such as shutter speed.\nStreet photography delight\nThe BF's light weight and simplified user interface made for nice street photography, one of my favorite pastimes.\nI tended to carry the camera at my waist in one hand, holding onto the lens, sometimes with the camera body flipped upside-down, with my pinky finger on the shutter button. That way, I achieved a kind of nonchalant pose that did not draw attention to my picture-taking.\nAlso: I used Google's photo-to-video AI tool on my selfie - and it made me do the tango\nSometimes, I looked at the LCD to see what I was snapping, but oftentimes, I just took a picture in the general direction to see what chance would produce.\nThe autofocus function of the BF was super fast, notably faster than the response time of the fp-L, probably because of the BF's lower-megapixel-count sensor. That made for excellent motion capture, such as this basketball game:\nOne of the BF's shortcomings is having an electronic shutter: Instead of mechanical blades opening and closing, the sensor chip controls in software when the exposure happens. The common knock against an electronic shutter is that it can lead to blurring of fast motion. In the case of the basketball game, in late afternoon daylight, I saw no issue.\nAnother potential drawback is that indoors, in artificial light, the electronic shutter can produce dark bands across the image if the shutter speed is too fast. That can require you to take the picture at a slower shutter speed. In practice, I found it not to be much of a problem.\nImproved electronics\nIn addition to autofocus speed, Sigma has done a very good job with the BF's low-light support, which was already quite good on the fp-L.\nOne of my favorite low-light picture tests is a diorama in the North American mammals hall of the American Museum of Natural History in Manhattan. This is one of the darkest exhibits in the museum, and it's challenging to photograph if you don't have the camera resting on a tripod to allow for a long exposure.\nAlso: Why ads are coming to your favorite AI bots and you've only got yourself to blame\nTwo taxidermy wolves run on a painted landscape of the Michigan countryside. To the naked eye, the diorama is very, very dark because it is meant to suggest nighttime on the prairie. Here's what it typically looks like, taken with minimal low-light support by the BF:\nMost museum visitors who view the diorama turn on their smartphone camera's flash to take a souvenir shot. But, to my mind, flooding the scene with flash spoils the effect.\nInstead, I cranked up the BF to its highest ISO setting, 102,400 -- fairly high up there for any digital camera. The result is that the wolves emerge in beautiful detail from the darkness -- not as sharp or clean as if the scene were well-lighted, but that's the point:\nIn practice, the BF does a very nice job in darkly lit spaces where you might actually want a picture, such as a jazz club.\nWhen set on a tripod with professional lighting and a backdrop, the BF is also excellent for formal portraits, far better than what you'll get using a smartphone camera for your headshots.\nEven without using a macro lens, the 50mm will allow you to get pretty good closeup shots of something like your favorite toy, from a minimum distance of 18 inches, which you can then crop and still have lots of vivid detail.\nOf course, you could also add a macro lens to the BF and get even closer.\nA gentle introduction to pro features\nSigma has simplified some of the functions for newbies so that the same technical effects are present but in a more inviting fashion. For example, on the Sigma fp-L, a separate button is for \"tone control\" that lets you adjust the light across the scene by degrees for shadows and highlights to make a scene have more or less contrast.\nOn the BF, there's no button for tone control, but when selecting colors with the click-wheel, you can bump up or down values of \"highlight,\" \"shadow,\" and \"fade,\" to alter the degrees of lights and darks. That works in both still images and videos.\nAlso: What Zuckerberg's 'personal superintelligence' sales pitch leaves out\nThere's also an option called \"look effect,\" where you can dial up or down how vivid or how flat a given color filter is, which is a nice, obvious way to understand making your pictures or videos more striking or more sedate.\nIn practice, the BF does a great job with tone and exposure on automatic. A street scene at sunset, for example, nicely balances the vivid highlights of the sky with the street detail without blown highlights or detail lost in the shadows.\nWhen you review photos, the main LCD display gives you all the information on the tone adjustments you made, which is helpful for determining what works and what doesn't.\nSome things that are typically buried in sub-menus on digital cameras are brought forward in the BF's UI.\nSo, for example, when filming a movie, you have the option to turn on \"constant AF,\" which does a better job of grabbing hold of a new subject entering the frame. That is now an option from the click-wheel rather than being buried as a sub-menu option.\nOf course, there are trade-offs to simplicity. Other functions that were accessed directly via dedicated buttons on digital cameras become things you have to hunt for.\nFor example, auto-exposure lock forces the camera to keep the amount of light in the scene the same as you move it, rather than altering the exposure. This allows you to find the right balance of light and dark and hold onto it while you shift your focus.\nAlso: The 10 apps I can't live or work without - on Windows, Mac, and mobile\nOn the fp-L, auto-exposure lock has its own button. In the BF, you have to move the click wheel to the exposure section of the menus and then turn on auto-exposure lock by tapping on the icon. This extra step is fine if you don't use auto-exposure lock much.\nAnother example is a feature of most digital cameras called fill light, the ability to lighten up dark parts of a picture. On most cameras, you have an option to turn on the fill light while you're taking pictures. On the BF, fill light is something you adjust after the fact by editing the DNG, \"digital negative,\" or \"RAW,\" image in the camera.\nSigma's suggestion overall is to use color and filter adjustments to achieve a similar effect to fill light. In other words, the user interface consolidates traditional operations such as fill light and auto-exposure lock into a simpler set of choices that can be more centrally manipulated.\nAnd some things are just different. On the fp-L, and most cameras, when recording a video, you can take a still image as you're recording. On the BF, if you want a still image as well, you do it when replaying the video, by selecting \"save as JPEG.\"\nHow it performs with video\nSpeaking of video, I found the results were very satisfying. You can take 6K video (6,016 x 3,384) that looks great even without electronic stabilization turned on.\nI took this shot of a woman having her personal photo shoot in front of the Plaza Hotel. Although it's jerky and not cinematic, it was a wonderful spontaneous moment in great quality:\nWhen you turn on the electronic stabilization feature, video is reduced from 6K to \"ultra-high-def\" (3,840 x 2,160) because the camera needs to crop each frame to line up frames and make the shakiness disappear.\nIn a low-light setting, such as this video at Small's jazz club in Greenwich Village, I thought it produced a wonderful-looking film without a tripod.\nHere's where we see an example of the click-wheel at its best. I had the fun of rotating through the different color filters to change up the color from moment to moment while filming, something I would never do when color choices are a single button.\nAlthough my use of the feature is rather gimmicky here, I can see all kinds of possibilities with the click wheel, enabling new ways of controlling the camera during filming.\nLike all cameras, the sound you record with the built-in microphone video is never as good as if you had a dedicated mic attached, especially for something like music. But I thought the result here was very good in a space with challenging acoustics.\nAlso: This hidden Pixel camera setting gave my photos the pop they've been missing\nEven in low light, using the camera hand-held, you can get a nice video like this one taken in a darkened tango hall. In a dark place like a dance hall, with swaying bodies moving to and fro, with the camera in your hand and no stabilization turned on, it can be challenging to capture motion in a way that's satisfying. I love what the BF did with the color and the lights in this scene while managing to shift autofocus from one couple to the next:\nBattery life\nBattery life was fine for my purposes. I got as much as six hours of shooting on a single charge, including intermittent shooting and periods of intense activity. That meant in some cases over 500 exposures in DNG+JPEG format. That's better than the official specification by Sigma for approximately 260 images on a charge. Of course, your results may vary.\nIn my experience, plugging the BF into an iPad via USB-C for forty minutes will charge the camera from zero back to a third of its battery life. You can also bring along a spare battery and swap it in via the latched compartment on the bottom of the BF.\nZDNET's buying advice\nThe complaints I've seen about the Sigma BF from seasoned photographers seem to be mostly about the reduction of controls to the click wheel and the mini-LCD. Consolidating controls in that way, they argue, robs the pro photographer of their muscle memory. Some pros also wish the touch screen did more to control the functions rather than just serving as a very good display.\nAlso: I tried Google's new agentic IDE, and it blows away the popular VS Code - here's how\nIn essence, pros have a hard time adjusting to a radically simplified UI. It's a fair point of view, but this is something of a Steve Jobs moment. You have to break a few eggs to make an omelette, and you may have to break habits to reinvent how photography is done.\nI think the BF is a terrific option for a beginning photographer or even an experienced pro. The touch-screen display is intuitive in a smartphone age, the electronics are just as fast as you'd expect based on smartphone picture-taking, and the output is very Instagram-worthy.\nAnd your envious friends will immediately want to know, What is that wild-looking camera you've got?"
    },
    {
      "url": "https://go.shopyourlikes.com/pi/017aed83ae366a9d8f0c8dcce04f10941691fb3f?afId=614548&afCampaignId=subid_value&afCreativeId=2993&afPlacementId=2",
      "text": "Ranger\nBuilt for life-on-the-go, the Ranger is our most portable speaker, delivering bold sound & endless versatility. Engineered for the outdoors, featuring party mode.\nRanger\nBuilt for life-on-the-go, the Ranger is our most portable speaker, delivering bold sound & endless versatility. Engineered for the outdoors, featuring party mode.\nPARTY MODE\nWith Party Mode you can pair an infinite number of Original Gen 3’s, Rangers, & Grandes for an unbeatable surround sound experience (Party mode does NOT work with the Gen 2’s).\n(Ranger does NOT pair with the Gen 2)\nAdd-Ons\nCarabiner\n$20\nThe Ultimate\noutdoor sidekick\nSMALL, BUT MIGHTY\nThe Ranger is our smallest speaker, but don’t let its size fool you. It’s tough as nails and delivers bold sound for your most active pursuits.\nBUILT TO ROAM\nOn top of it’s size, the Ranger features strong magnetic side mounts and a top-handle for maximum portability and versatility. Just pack it, clip it, or mount it.\nCONNECT INFINITELY\nWith Party Mode, pair as many Rangers, Gen 3’s, & Grandes as you want for a mind-blowing surround sound experience. There’s truly nothing like it!\nRatings & Reviews\nExplore what our customers are saying about this product.\nGreat sound. Love being able to connect it to my Gen 3. I like the versatility of the magnet. Can place it on fridge for cooking time or slap it on my kayak for tunes while yaking.\nFor a small speaker it has a large amount of bass, especially if its magnetized to something that will amplify the sound. The magnets are super convenient and allow for placement almost anywhere. The range on the blutooth is ridiculously long so it doesnt disconnect easily\nAbsolutely love this little guy! Great sound from a little unit like this. Will be purchasing a larger speaker from Turtlebox soon!\nWe are a major music family, and The Ranger is just so easy to grab and go to keep the tunes rockin. I love the magnets. It allows for more space on my desk, tables, counters, you name it. A awesome yet practical feature!\nBumper Color: Gray\nMonogram (+$20)\nMonogram will appear on the side of the speaker. Max of 3 characters.\nBase Color:\nHandle & Feet Color:\nBumper Color:\nMonogram:\nShips: 2-4 business days"
    },
    {
      "url": "https://www.zdnet.com/home-and-office/home-entertainment/im-bringing-this-portable-jbl-speaker-to-all-my-summer-festivities-heres-why/",
      "text": "'ZDNET Recommends': What exactly does it mean?\nZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing.\nWhen you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers.\nZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form.\nI'm bringing this portable JBL speaker to all my summer festivities - here's why\nZDNET's key takeaways\n- The JBL Charge 6 is available for $199 in Black, Blue, White, Red, Camo, and Purple.\n- The Charge 6 offers great sound, durability, battery life, and in-app features.\n- Although it's waterproof, constant, untreated exposure to salt and chlorine can incur internal damage, just like any other Bluetooth speaker.\nBest test deals of the week\nWhile there are plenty of Bluetooth speakers on the market, only a few strike the balance of durability and sound quality. Bose's SoundLink Max was one of the first I tested to bridge the gap, but JBL's latest Charge 6 is here to compete with it - and for $200 less.\nAlso: Sonos' cheapest smart speaker is also the one I use the most. Here's why\nI spent an early spring weekend toting the JBL Charge 6 to a family cookout around Atlanta's busiest outdoor space and between rooms while I completed some weekend chores. If you're looking for a souped-up portable speaker, you'll want to hear how it went.\nThe Charge 6 debuts with JBL's proprietary AI Sound Boost, which uses an algorithm to analyze your music as it plays in real time to tweak the speaker's EQ. According to JBL, this feature delivers maximum acoustics and decreases distortion.\nAlso: I replaced my JBL speaker for this Bose model, and it'll be hard to give it up\nDecreasing distortion is exceptionally important, considering the Charge 6 packs a heavy bass response. At loud volumes, the bass can cause the speaker to rumble, muddy the bass, and overpower the other frequencies. Although the Charge 6 isn't the smallest Bluetooth speaker I've tested, its loudness is still impressive for its frame.\nIf the bass gets too heavy for your liking, you can adjust the speaker's EQ settings in the JBL Portable app. You can choose from preset EQs or create your own. The Charge 6 promises 28 hours of playtime on a single charge, four more hours than its predecessor.\nTwo of those extra hours are attributed to a feature called Playtime Boost, which decreases the bass strength to conserve battery. This feature was handy at my parents' weekend cookout since I'm constantly tasked with bringing the latest speaker I'm testing for everyone to hear. However, on this particular weekend, I brought the speaker when it was on 30% battery, and I needed to keep the party going.\nThe Charge 6 gets its name from its device charging capabilities; if your or your buddy's smartphone has a low battery, you can whip out your USB-C cord and plug your phone into the speaker to keep it alive.\nAlso: This Marshall Bluetooth speaker I tested sounds better than audio systems twice the price\nJBL trumpets the Charge 6's IP68 durability rating as it's stronger than the Bose SoundLink Max, Beats Pill (2024), and Sony ULT Field 1's IP67 ratings. At IP68, the Charge 6 is fully protected from dust and can survive submersion in almost five feet (1.5 meters) of water for up to 30 minutes.\nAlthough an IP68 is impressive, all Bluetooth speakers have caveats surrounding their waterproof rating. The industry standard is to test a product's waterproofing capabilities with fresh water, not salt or chlorinated water. Although your speaker can withstand bouts in the pool or ocean, its dips in the pool should occur by accident if you can help it.\nThe chemicals in the ocean or pool water could erode the speaker's internal components, coloring, and the seals holding it together. JBL asserts that the Charge 6's IP rating applies to salt and chlorinated water, but users should thoroughly rinse and dry off the speaker after contact. It's imperative that the speaker is dry before plugging your phone into it, so the Charge 6 will blink red if the port is still wet.\nOn the contrary, the Bose SoundLink Max also has reverse charging and a weaker IP rating. However, it will float and orient itself, grille face down, to avoid internal water damage if you accidentally drop it in the ocean or pool. Still, Bose also suggests you wait until the speaker is dry to use or plug your phone into it.\nAlso: This tiny Bluetooth speaker delivers loud, distortion-free sound\nYou can orient the Charge 6 horizontally or vertically; the added carrying strap provides more portability. Compared to its predecessor, the Charge 6 offers more continuous playtime, an enhanced Bluetooth version for more stable connections and efficient power consumption, Auracast compatibility, and faster reverse charging.\nThe Charge 6 is a worthy upgrade from the Charge 5, showing that JBL wisely used the Charge lineup's four-year hiatus. It is more affordable than competitors with similar features and more advanced than competitors in the same price category.\nZDNET's buying advice\nIf you want a new Bluetooth speaker packed with features and practical durability, the JBL Charge 6 is an excellent choice. It sounds great, has a lengthy battery life, and includes Auracast, which allows you to connect the speaker to an unlimited number of other Auracast-enabled speakers for the ultimate party.\nIf you want a durable speaker with reverse charging and a more stylish and nondescript design, consider the Bose SoundLink Max, but be prepared to pay a premium for it.\nLooking for the next best product? Get expert reviews and editor favorites with ZDNET Recommends."
    }
  ],
  "argos_summary": "The author, who usually avoids outdoor activities, tests Turtlebox’s rugged Gen 3 and Ranger Bluetooth speakers for outdoor use, noting their durable build, IP67 rating, long battery life, decent mids and bass but limited EQ control, and Party Mode for multi‑speaker setups. He compares them to other outdoor‑friendly options such as Sony’s Ult Field 1, JBL Charge 6, and Bose SoundLink Max, highlighting each brand’s strengths and drawbacks in sound quality, durability, and price. While briefly touching on other tech reviews (MSI laptop, Sigma camera), the focus remains on evaluating rugged speakers for outdoor use.",
  "argos_id": "67IYLKTQT"
}