{
  "url": "https://www.howtogeek.com/smartphone-upgrades-are-getting-boringand-thats-not-a-bad-thing/",
  "authorsByline": "Arol Wright",
  "articleId": "e7d1fd4b714d4cbf834f4dd0204d404e",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/03/1000069503.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T21:00:15+00:00",
  "addDate": "2025-08-23T21:02:51.735404+00:00",
  "refreshDate": "2025-08-23T21:02:51.735406+00:00",
  "score": 1.0,
  "title": "Smartphone Upgrades Are Getting Boring—And That's Not a Bad Thing",
  "description": "Do you really need a brand-new design every time?",
  "content": "You've probably noticed a trend with recent smartphone launches that not everyone loves. The new Google Pixel 10 series looks almost identical to last year's Pixel 9 series, and the Samsung Galaxy S25 series looked very, very similar to last year's Galaxy S24 series. I don't think that's a big deal—let me explain.\n\nNew phones look the same as their predecessors, and this is a trend with pretty much every major OEM at this point. The just-announced Pixel 10 has the same camera bump and curves as the Pixel 9, with the only major noticeable difference being the addition of an extra camera sensor in the base Pixel 10—we went from having two to getting three, as it now has a similar camera setup to that of the Pixel 10 Pro. Sometimes, you don't even get that. The Samsung Galaxy S25 is visually completely unchanged from the Galaxy S24, and you can barely notice changes, and barely with the S25 Ultra, which has slightly rounded corners compared to the Galaxy S24 Ultra's sharp edges.\n\nThis isn't a problem unique to the Android side. As I mentioned earlier, this is something Apple has been doing for a while, as the new iPhones tend to have very minor outside design changes and stick to just internal hardware changes, camera upgrades, and a couple of minor additions such as the Action Button and a Camera Control slider.\n\nThis brings me to my next point. Why change it if it's already fine?\n• The Pixel 10 Pro offers an upgrade over the base model with the powerful Google Tensor G5 chip, more RAM, and more storage (if you need it).\n• Need a bigger phone? The Pixel 10 Pro XL offers just that. While you largely get the same experience as the 10 Pro, you'll get a bigger screen and bigger battery—so you won't be missing out on anything over the standard-sized 10 Pro.\n\nThis is the problem I have with some OEMs, such as OnePlus, that enjoy doing wild design changes every single year. Personally, I see it as changing things for the sake of changing them. If you have a design that works, doesn't look outdated, and it's not something users actively dislike, the best approach—the way I see it, at least—is not to devote a lot of resources to actually changing it every single time. You can iterate on it and improve on top of it, but there's not much of a need for actually changing it every single time.\n\nFor OEMs, it's probably cheaper to reuse the same frame and design for their new smartphones. This way, they can actually deliver on changes that actually matter for users—more on this later. And for users, they can already settle in with a design they're already familiar with, and they will feel right at home, especially if they're upgrading from their direct predecessor or a couple of generations later. It's basically the same phone, except faster.\n\nIn many cases, you can even reuse the same accessories you already own, including cases, chargers, and other things. I say \"many\" and not \"all\" because some actually do the tiniest of design changes so the phone is changed enough that it feels like the same phone, but you can't re-use the cases because of ever-so-tiny design changes—looking at you, Apple.\n\nThey're Giving You Upgrades Where It Actually Matters\n\nThe fact that a lot of OEMs don't do design changes actually has an upside, and it's the fact that the company can devote more resources towards internal changes. The new-generation phones often come with higher-specced SoCs, more powerful batteries, better internal features and software capabilities, and, overall, better performance.\n\nOf course, many times, an upgrade is not worth it from one year to another since it's basically a minor SoC upgrade and maybe one or two changes to the camera or the battery. But if you wait two or three years and then upgrade, you'll be in for what's basically a very improved version of the phone you already have. Even if the difference isn't immediately noticeable when you unbox the phone, you'll feel the difference once you actually turn it on and start using it. A design change makes it more evident that you're getting an upgraded phone, but that doesn't mean that you're not getting an upgrade nonetheless.\n\nAnd I'm not saying smartphone OEMs shouldn't do design changes. I'm all for phones looking modern, and I'm all for phones updating their design over time so they continue looking modern every year. But it's one thing to do that, and it's another thing to not settle for one design language and changing your flagship phone's design every single year. It's costly, and in my opinion, it's ultimately pointless.\n\nDon't shy away from smartphone upgrades just because they look the same. You'll be surprised to find that the new phone might be packing a lot more changes than you'd expect.",
  "medium": "Article",
  "links": [
    "https://www.howtogeek.com/google-pixel-10-series-announcement/",
    "https://amazon.com/dp/B0FFTT2J6N?tag=hotoge-20&ascsubtag=UUhtgUeUpU2015822&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fsmartphone-upgrades-are-getting-boringand-thats-not-a-bad-thing%2F&asc_campaign=Feed",
    "https://store.google.com/product/pixel_10_pro?hl=en-US",
    "https://www.howtogeek.com/thpixel-10-missing-pro-camera-feature/",
    "https://amazon.com/dp/B0FFTTL4V3?tag=hotoge-20&ascsubtag=UUhtgUeUpU2015822&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fsmartphone-upgrades-are-getting-boringand-thats-not-a-bad-thing%2F&asc_campaign=Feed"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "design changes",
      "weight": 0.11106116
    },
    {
      "name": "wild design changes",
      "weight": 0.105114475
    },
    {
      "name": "internal changes",
      "weight": 0.088844694
    },
    {
      "name": "New phones",
      "weight": 0.08848555
    },
    {
      "name": "design",
      "weight": 0.08410962
    },
    {
      "name": "changes",
      "weight": 0.0824741
    },
    {
      "name": "camera upgrades",
      "weight": 0.07843236
    },
    {
      "name": "phones",
      "weight": 0.077034965
    },
    {
      "name": "Smartphone Upgrades",
      "weight": 0.07526541
    },
    {
      "name": "smartphone upgrades",
      "weight": 0.07526541
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8505859375
    },
    {
      "name": "/News/Technology News",
      "score": 0.8134765625
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.7373046875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.65380859375
    }
  ],
  "sentiment": {
    "positive": 0.11767363,
    "negative": 0.52583385,
    "neutral": 0.35649252
  },
  "summary": "The article discusses the trend of smartphone upgrades becoming more predictable, with the Google Pixel 10 series appearing almost identical to last year's Pixel 9 series and the Samsung Galaxy S25 series appearing similar to the Galaxy S24 series. The article suggests that while new phones look the same as their predecessors, there is a lack of noticeable changes. This is not a problem unique to the Android side, as Apple has been doing this with minor outside design changes. The author argues that it's cheaper to reuse the same frame and design for new smartphones to deliver on changes that actually matter for users. However, he also acknowledges that many upgrades are not immediately noticeable due to minor SoC upgrades and minor changes to the camera or the battery.",
  "shortSummary": "Despite the trend of new smartphone launches being relatively predictable, many OEMs are opting for incremental design updates, often making unnecessary changes that actually enhance user experiences and functionality.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3fe4de93e81c42768ece9a6c6ffea5b6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.howtogeek.com/thpixel-10-missing-pro-camera-feature/",
      "text": "As someone who prefers smaller phones, it’s always been a bummer that Google reserves certain cameras for the bigger Pixel “Pro” models. That’s finally changing with the Pixel 10, and I’m very excited.\nThe first time Google included a “Pro” model was back in 2021 with the Pixel 6 and Pixel 6 Pro. They both had a 50MP main camera and a 12MP ultrawide camera, but the Pro had one extra camera: a 48MP telephoto. It was the same story with the Pixel 7/7 Pro in 2022, the Pixel 8/8Pro in 2023, and the Pixel 10/10 Pro in 2024.\nThe non-Pro model has always been one camera behind. Dual cameras are nothing to scoff at, of course. A 50MP main camera is awesome, and ultrawide cameras can be useful too. However, I have found that an optical telephoto camera is much, much more valuable to me. I’ve been using the Pixel 9 Pro XL for nearly a year, and I barely ever use the ultrawide camera, but the telephoto camera gets used all the time.\nThe Pixel 10 Breaks the Mold\nGoogle has finally given the base Pixel a third camera, a telephoto for the Pixel 10. This is an awesome upgrade for the most affordable phone in the series. Now, it’s not the same telephoto camera that can be found on the Pixel 10 Pro and 10 Pro XL, but it’s still an optical zoom camera, and that’s what matters.\nThe lack of telephoto cameras in the base models of smartphones has bothered me for a long time. Manufacturers are more than happy to toss in an ultrawide or macro camera to go alongside the main shooter, but they’re stingy with telephoto cameras. Those are reserved for the biggest and best phones, and I’m tired of it. I’m glad Google is finally giving the base Pixel some zoom love.\nGoogle Pixel 10\n- Brand\n- SoC\n- Google Tensor G5\n- Display\n- 6.3-inch Actua OLED, 20:9\n- RAM\n- 12 GB RAM\n- Storage\n- 128 GB / 256 GB\n- Battery\n- 4970mAh\nLooking to upgrade to a Pixel but not sure if you need all the bells and whistles of the more expensive models? You won't be disappointed with the standard Pixel 10 model. Coming in striking colors, Gemini features, and seven years of updates, you can't go wrong with this purchase.\n- Operating System\n- Android 16\n- Front camera\n- 10.5 MP Dual PD selfie camera\n- Rear camera\n- 48 MP wide with Macro Focus | 13 MP ultrawide | 10.8 MP 5x telephoto lens\n- Connectivity\n- Wi-Fi 6E, Bluetooth v6\n- Dimensions\n- 6.0-inches x 2.8-inches x 0.3-inches\n- Colors\n- Indigo, Frost, Lemongrass, Obsidian\n- Charge speed\n- Up to 55% in about 30 minutes\n- IP Rating\n- IP68\nThe Importance of Telephoto\nIn my opinion, telephoto cameras are the most useful cameras to have. Typically, when you take a photo with your phone, things will always look farther away than they do to you in real life—that's just how lenses work. I’ve found that I need at least a 2X zoom to bring subjects closer and more accurately match my perspective. But most things that I take a photo of are not right in front of me, which makes the 5X zoom equally as useful.\nThe Pixel 10’s telephoto camera is 5X, just like the Pixel 10 Pro and 10 Pro XL, but it’s only 10.8MP. The Pro models have 48MP telephoto cameras. Another difference in the telephoto cameras is Quad PD autofocus for the Pro models, whereas the Pixel 10 has Dual PD autofocus. So, the Pixel 10 is still clearly not on the same level, but it’s much closer than previous generations.\nUltimately, it's a huge step in the right direction. Google has been holding back on its affordable phones for a long time, and a telephoto lens on the base Pixel 10 is a sign that things are changing. Yes, it's not the same sensor as the Pro model, and that's okay. You're getting a phone that's $200-400 less expensive than the Pro models, but still gets you some real zoom capabilities.\nObviously, it’s never been an issue of Google not thinking people would want a zoom lens on the base model. They need to reserve some things for the more expensive models. For whatever reason, Google has let up on that just a bit, and I’m hoping this is just the beginning of a new trend for Google's phones."
    },
    {
      "url": "https://www.howtogeek.com/google-pixel-10-series-announcement/",
      "text": "Summary\n- New Google Pixel 10 series features Google Tensor G5 chip for enhanced AI functions.\n- Magic Cue offers personalized intelligence by anticipating user needs and suggesting relevant info.\n- Pixelsnap technology allows magnetic attachment of accessories to the back of the phone.\nGoogle's new Pixel 10 series is here, and it's powered by a new chip and a whole lot of AI. This year, the biggest updates might be with the non-Pro model. However, as usual, the big emphasis is on how these phones will change the way you interact with your device.\nAt the heart of the new Pixel 10, Pixel 10 Pro, and Pixel 10 Pro XL is the new Google Tensor G5 processor, which Google claims is the most significant upgrade to its custom chip for Pixel phones. The G5 processor is designed for the \"Gemini era\" and includes a TPU that is up to 60% more powerful than the Tensor G4. This new chip is what's behind features like Magic Cue, Pro Res Zoom, and Auto Best Take.\nSpeaking of Magic Cue, this is a new feature that aims to bring more personalized intelligence to the Pixel series. It's designed to anticipate your needs and proactively suggest relevant information and actions (sound familiar?). Google gives the example of being on a call with an airline, and Magic Cue automatically surfaces your flight details. Another example is a friend asking for your Airbnb address, and it pulls up the information for quick sharing.\nAI aside, the Pixel 10 series is made from “spacecraft-grade” aluminum and Corning Gorilla Glass Victus 2. They also have an IP68 rating, as per usual. The actual design of the hardware hasn’t changed much, but Android's fresh “Material Expressive” design language makes up for it. Google is also promising seven years of OS, security, and Pixel Drop updates for all Pixel 10 phones.\nOne of the most exciting additions to the Pixel series is a new magnetic technology called “Pixelsnap.” For all intents and purposes, this is the long-awaited MagSafe for Android. It allows you to attach wireless chargers, stands, grips, and thousands of other accessories magnetically to the back of the phone. The Pixelsnap system is compatible with Qi2 wireless charging.\nGoogle is releasing the Pixel 10 series with a handful of Pixelsnap accessories to get started. There's a case that extends the magnetic connection, a wired charger, a stand that turns the wired charger into a dock, and a \"Ring Stand\" that acts as a kickstand.\nCameras are obviously a big deal for the Pixel series, and this time the non-Pro model gets the best upgrades. The Pixel 10 Pro and Pixel 10 Pro XL are very similar to last year—50MP, 48MP ultrawide, 48MP zoom—but the Pixel 10 finally gets an optical zoom lens as well. It’s the same 5x optical zoom as the other two phones, but a smaller 10.8MP. It’s joined by a 48MP main sensor and a 13MP ultrawide.\nThe Pro phones also have a Super Actua display that Google claims is the brightest ever on a Pixel with 3,300 nits of peak brightness. The Pixel 10 Pro comes in two sizes—a 6.3-inch and a 6.8-inch model—and both have batteries that can last for more than 30 hours (or so Google claims).\nPricing starts at $799 for the Pixel 10, then $999 for the Pixel 10 Pro, and $1199 for the Pixel 10 Pro XL with 256GB of storage. The Pixel 10 is available in Obsidian, Indigo, Frost, and Lemongrass, while the Pro models come in Obsidian, Moonstone, Porcelain, and Jade. Google did not provide a release date.\n-\nGoogle Pixel 10\n- SoC\n- Google Tensor G5\n- Display\n- 6.3-inch Actua OLED, 20:9\n- RAM\n- 12 GB RAM\n- Storage\n- 128 GB / 256 GB\n- Battery\n- 4970mAh\n- Operating System\n- Android 16\nLooking to upgrade to a Pixel but not sure if you need all the bells and whistles of the more expensive models? You won't be disappointed with the standard Pixel 10 model. Coming in striking colors, Gemini features, and seven years of updates, you can't go wrong with this purchase.\n- Front camera\n- 10.5 MP Dual PD selfie camera\n- Rear camera\n- 48 MP wide with Macro Focus | 13 MP ultrawide | 10.8 MP 5x telephoto lens\n- Dimensions\n- 6.0-inches x 2.8-inches x 0.3-inches\n- Colors\n- Indigo, Frost, Lemongrass, Obsidian\n- IP Rating\n- IP68\n-\nGoogle Pixel 10 Pro\n- SoC\n- Google Tensor G5\n- Display\n- 6.3-inch Super Actua, 20:9\n- RAM\n- 16 GB RAM\n- Storage\n- 128 GB / 256 GB / 512 GB with Zoned UFS / 1 TB with Zoned UFS\n- Battery\n- 4870mAh\n- Operating System\n- Android 16\nThe Pixel 10 Pro offers an upgrade over the base model with the powerful Google Tensor G5 chip, more RAM, and more storage (if you need it).\n- Front camera\n- 42 MP Dual PD selfie camera\n- Rear camera\n- 50 MP wide | 48 MP ultrawide with Macro Focus | 48 MP 5x telephoto lens\n- Dimensions\n- 6.0-inches x 2.8-inches x 0.3-inches\n- Colors\n- Moonstone, Jade, Porcelain, Obsidian\n- IP Rating\n- IP68\n-\nGoogle Pixel 10 Pro XL\n- SoC\n- Google Tensor G5\n- Display\n- 6.8-inch Super Actua, 20:9\n- RAM\n- 16 GB RAM\n- Storage\n- 128 GB / 256 GB / 512 GB with Zoned UFS / 1 TB with Zoned UFS\n- Battery\n- 5200mAh\n- Operating System\n- Android 16\nNeed a bigger phone? The Pixel 10 Pro XL offers just that. While you largely get the same experience as the 10 Pro, you'll get a bigger screen and bigger battery—so you won't be missing out on anything over the standard-sized 10 Pro.\n- Front camera\n- 42 MP Dual PD selfie camera\n- Rear camera\n- 50 MP wide | 48 MP ultrawide with Macro Focus | 48 MP 5x telephoto lens\n- Dimensions\n- 6.4-inches x 3.0-inches x 0.3-inches\n- Colors\n- Moonstone, Jade, Porcelain, Obsidian\n- IP Rating\n- IP68\nSource: Google"
    },
    {
      "url": "https://store.google.com/product/pixel_10_pro?hl=en-US",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    }
  ],
  "argos_summary": "The article discusses the trend of smartphone OEMs keeping external designs largely unchanged year over year, arguing that this allows resources to focus on internal upgrades like better processors, batteries, and camera improvements. It highlights Google’s Pixel 10 series, noting the new Tensor G5 chip, the addition of a third telephoto camera to the base model, and the introduction of Pixelsnap magnetic accessories. Samsung and Apple are cited as examples of minimal design changes, while OnePlus is criticized for frequent redesigns. The piece concludes that users should not be deterred by similar looks, as significant functional upgrades often accompany new releases.",
  "argos_id": "6AXELITYS"
}