{
  "url": "https://www.fool.com/investing/2025/08/23/wall-street-warns-popular-ai-stock-could-fall/",
  "authorsByline": "Rich Smith",
  "articleId": "fed7f2b95000443d93b77117d3be2fd4",
  "source": {
    "domain": "fool.com",
    "location": {
      "country": "us",
      "state": "VA",
      "city": "Alexandria",
      "coordinates": {
        "lat": 38.8051095,
        "lon": -77.0470229
      }
    }
  },
  "imageUrl": "https://g.foolcdn.com/editorial/images/830362/semiconductor-computer-chip-with-the-letters-ai-in-the-middle.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T22:15:00+00:00",
  "addDate": "2025-08-23T22:20:02.000901+00:00",
  "refreshDate": "2025-08-23T22:20:02.000907+00:00",
  "score": 1.0,
  "title": "Wall Street Analysts Expect This Popular AI Stock Could Face Challenges Ahead",
  "description": "Nvidia's a terrific company, but it faces near-term challenges in China -- and there's a terribly high price tag on Nvidia stock.",
  "content": "Nvidia's a terrific company, but it faces near-term challenges in China -- and there's a terribly high price tag on Nvidia stock.\n\nIn just a little under one week, Nvidia (NVDA 1.65%) will report its earnings for Q2 2025.\n\nFor the most part, analysts are optimistic about the report, due out after the close of trading on Aug. 27. Consensus forecasts have the semiconductor company growing earnings 48.5% year over year, to $1.01 per share, as insatiable demand for artificial intelligence (AI) chips drives a near-53% rise in revenue to almost $46 billion.\n\nThat's a lot of money Nvidia will be raking in for a single quarter. This is one of the primary reasons why a staggering 58 analysts polled by S&P Global Market Intelligence give Nvidia stock either a \"buy\" or an \"outperform,\" or an equivalent rating -- versus only one single analyst who says \"sell.\"\n\nOne reason why two analysts are worried about Nvidia\n\nAnd yet, not everything's unicorns and rainbows for Nvidia stock. As the final countdown to earnings day begins, two separate Wall Street analysts chimed in Wednesday morning to raise reservations about Nvidia stock and the challenges that lie ahead for it.\n\nFirst up was Deutsche Bank, where analyst Ross Seymore set a price target of $155 that implies the stock could fall 12% over the next 12 months. Ordinarily, the prospect of a 12% near-term loss in a stock would inspire an analyst to recommend selling that stock. But perhaps fearing to deviate too far from the herd on this popular AI stock, Seymore only reiterated a \"hold\" rating on Nvidia. (Seymore is still one of only a half-dozen analysts with neutral ratings on Nvidia).\n\nNo matter. Whether any one analyst thinks Nvidia is a \"buy\" or just a \"hold\" probably shouldn't concern us as much as why he rates the stock as he does. And in Seymore's case, the answer couldn't be clearer:\n\nWriting on StreetInsider.com on Wednesday, Seymore warns that U.S. trade restrictions on semiconductor exports to China will cost Nvidia about $8 billion in \"foregone\" revenue in Q2. True, a resumption of shipments upon receiving export licenses from the Trump administration should help rectify this situation by Q3. But there's a cost to that solution -- specifically, the Trump Administration's requirement that, to obtain export licenses, Nvidia must fork over 15% of any revenue it generates in China to the IRS.\n\nWith China accounting for roughly $17 billion of Nvidia's revenue over the last 12 months, that could amount to a $2.6 billion drag on Nvidia's profits over the next 12 months.\n\nInvestment bank KeyBanc shares Deutsche Bank's concerns about Nvidia and China. On the one hand, KeyBanc anticipates Nvidia could book $2 billion to $3 billion in revenue from selling H20 and B40 chips in China next quarter. On the other hand, the banker believes this revenue is unreliable and dependent upon the receipt of export licenses from Washington.\n\nFor this reason, KeyBanc warns Nvidia may \"exclude direct revenue from China\" when giving revenue guidance next week, potentially creating a kind of guidance miss that could send Nvidia shares lower.\n\nKeyBanc also cites the \"potential 15% tax on AI exports\" from the U.S. side as a risk, and adds that \"pressure from the [Chinese] government for its AI providers to use domestic AI chips\" could dampen Nvidia's China revenues even further -- adding a third risk that Deutsche didn't mention!\n\nNow, I hope I haven't painted too bleak a picture for you here. Fact is, despite his reservations, Deutsche analyst Seymore still expects Nvidia to report a \"typical\" earnings beat next week, exceeding the company's $45 billion revenue forecast by about $2 billion. Blackwell revenue is ramping, says Seymore, more than doubling sequentially between Q4 2024 and Q1 2025, to $24 billion.\n\nWith the prospect of an imminent earnings beat, it makes sense that Seymore would hesitate to recommend selling Nvidia stock -- even if he does feel it's a bit overpriced.\n\nFurthermore, KeyBanc agrees that Blackwell production is ramping, and a new Blackwell Ultra (B300) chip is on the way, potentially boosting revenue even more in Q3. For these and other reasons, KeyBanc not only still rates Nvidia stock \"overweight\" (i.e., buy). KeyBanc actually raised its price target on the stock to $215 on Wednesday.\n\nSo, is Nvidia stock a buy or not?\n\nThat's the real question, isn't it? Wall Street's confident Nvidia will \"beat\" on Q2 next week. It's just worried that Nvidia will \"miss\" on guidance for Q3. Longer-term, though, is Nvidia stock a buy or isn't it?\n\nHere's how I look at it, and I'll keep this really simple:\n\nValued at 4.28 trillion dollars, earning nearly $77 billion in annual profit, and backing that up with roughly $72 billion in annual free cash flow, Nvidia stock costs about 55 times trailing earnings and about 59 times free cash flow. For Nvidia stock to be a clear-cut buy, I'd want to see the stock growing earnings at least 50% annually over the next five years.\n\nThe best that Wall Street analysts expect Nvidia to do, however, is 30% annual growth -- even with nine out of 10 analysts polled saying Nvidia stock is a buy.\n\nThe math here isn't hard. Nvidia stock is not a buy at this price -- but it might be if it sells off after earnings.",
  "medium": "Article",
  "links": [
    "http://marketintelligence.spglobal.com/",
    "https://www.fool.com/investing/stock-market/upcoming-earnings-reports/",
    "https://www.fool.com/terms/s/what-is-a-sell-side-analyst/",
    "https://www.fool.com/investing/how-to-invest/stocks/when-to-sell-stocks/",
    "https://www.fool.com/terms/p/price-target/",
    "https://www.fool.com/investing/how-to-invest/stocks/why-stocks-go-up-and-down/",
    "https://www.fool.com/terms/p/price-to-free-cash-flow/",
    "https://www.fool.com/investing/stock-market/market-sectors/information-technology/semiconductor-stocks/",
    "https://www.fool.com/investing/stock-market/market-sectors/information-technology/ai-stocks/",
    "https://www.fool.com/quote/nasdaq/nvda/",
    "https://www.fool.com/investing/2025/08/11/nvda-stock-china-ai-chips/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Nvidia stock",
      "weight": 0.12874651
    },
    {
      "name": "Nvidia",
      "weight": 0.1114078
    },
    {
      "name": "Nvidia shares",
      "weight": 0.10921949
    },
    {
      "name": "Deutsche analyst Seymore",
      "weight": 0.09722716
    },
    {
      "name": "analyst Ross Seymore",
      "weight": 0.09190124
    },
    {
      "name": "Wall Street Analysts",
      "weight": 0.086400904
    },
    {
      "name": "Wall Street analysts",
      "weight": 0.086400904
    },
    {
      "name": "analysts",
      "weight": 0.08057048
    },
    {
      "name": "revenue guidance",
      "weight": 0.07798276
    },
    {
      "name": "Blackwell revenue",
      "weight": 0.07688676
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9677734375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.955078125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.88427734375
    },
    {
      "name": "/News/Technology News",
      "score": 0.876953125
    }
  ],
  "sentiment": {
    "positive": 0.09664113,
    "negative": 0.62131876,
    "neutral": 0.28204012
  },
  "summary": "Nvidia, a popular AI stock, is expected to face challenges in China ahead of its Q2 2025 earnings report due to a 48.5% year over year increase in revenue to almost $46 billion. However, two separate Wall Street analysts have raised reservations about the company's prospects. Deutsche Bank analyst Ross Seymore warned that U.S. trade restrictions on semiconductor exports to China could cost Nvidia about $8 billion in \"foregone\" revenue in Q2, which could result in a $2.6 billion drag on Nvidia's profits over the next 12 months. Investment bank KeyBanc also expressed concerns about Nvidia's potential to book $2 billion to $3 billion in revenue from selling H20 and B40 chips in China next quarter, but also noted that this revenue is unreliable and dependent on the receipt of export licenses from Washington. The potential 15% tax on AI exports from the US side could also dampen Nvidia's China revenues even further. KeyBanca raised its price target to $215 on the buy-out price tag on the stock.",
  "shortSummary": "Nvidia faces near-term challenges due to China and potential US trade restrictions, despite high earnings and revenue expectations, with some analysts maintaining holds.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5a4106be74aa43ea94f42bb4e19602fe",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/terms/p/price-target/",
      "text": "If you're trying to figure out if a particular stock is worth buying, you might consider using the price target as a metric. It isn't a very precise method of evaluating stock values, but it can help you see how other analysts feel about the future of your favorite companies.\nDefinition\nWhat is a price target?\nA price target represents an analyst's estimate of the future price of a stock or other security. For stock analysts, the timeline is generally 12 to 18 months, but technical traders also use price targets.\nFor stock analysts, the purpose is to help advise investors as to where their stocks might be headed and to highlight stocks that could be very good values (or very bad ones) in the future. These analysts often work for large firms that may also give buying guidance.\nTechnical traders, on the other hand, may calculate price targets for any reason. Many times, they calculate price targets for buying and for selling, configuring their trading bots to buy at certain points and sell at others based on short-term pricing models that could be measured in as little as hours or days.\nWhat they tell you\nWhat do price targets tell you?\nPrice targets, like weather forecasts, are influenced by a lot of factors outside of anyone's control. So, if you're worried that a price target for a favored stock is lower than you expect, you may really be stressed for no reason.\nPrice targets are an attempt to predict future prices based on current information. That information is often incomplete since companies tend to keep anything they're not required to disclose close to their chests until it's time to show investors how well they're doing. And rightfully so -- the daily drama of the balance sheets might get to be too much if we had to hear about it more than once every few months.\nUltimately, the goal of price targets is to predict the future, but it's often through a foggy crystal ball. A 2006 study showed that share prices met or exceeded the price target at some point over the following year for just 53% of observations and only met or exceeded the price target in 30% of cases at the end of those same 12 months.\nHow to calculate\nHow do you calculate price targets?\nThere are many different ways to calculate a price target, but a common method involves using price-to-earnings ratios. If you divide the current P/E by the forward P/E and then multiply by the current price, you should have a reasonable prediction for the price target a year from now.\nThe current P/E gives you the earnings for the last 12 months as a ratio of the current market price to the average earnings of the prior 12 months. The forward P/E does the same but is calculated by dividing the market price by the average estimated earnings for the next 12 months. Using both balances the equation so that it's (theoretically) not relying too much on either ratio (although the forward P/E is calculated based on past performance to some extent).\nThe formula looks like this:\nCurrent Market Price x (Current P/E / Forward P/E) = Price Target\nRemember that this is only an estimate, and there are a lot of other factors that should be taken into consideration when you're trying to decide whether to buy, sell, or continue to hold any financial instrument in your portfolio.\nRelated investing topics\nWhy they matter\nWhy are price targets important to investors?\nNeither investors nor analysts are always at the forefront of everything all the time. That's why there are thousands of analysts who crunch piles of data to create price targets for companies. Even though price targets aren't always accurate, that doesn't mean they have zero value.\nA price target is good for telling you where analysts think that companies' stocks are going to be in a year or so. You'll always see a range of prices from them since analysts are hardly a hive mind. That should give you some idea of how to plan for the future, assuming nothing serious changes between now and the point where you plan to rebalance.\nIt's just one of many metrics you should be watching as a DIY investor, and if you have the time, calculating for yourself, if only to better understand how it really works."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/upcoming-earnings-reports/",
      "text": "Earnings reports are some of the most important sources of information available to stock investors. They give important details about the current state of a business, reveal important financial information, and may include forward earnings and revenue projections, as well as commentary by the CEO or other company leaders.\nIf you're invested in a particular stock, reading its quarterly and year-end earnings reports is one of the smartest things you can do to ensure your investment is still a good one. If you aren't invested in a company, reading through its recent earnings reports can help you analyze profitability, growth, financial conditions, and other important information to make educated decisions about whether a company would be a good fit for your portfolio.\nWhat are they?\nWhat are earnings reports?\nEarnings reports are (usually) quarterly releases that provide important details on a company's business operations and updated financial statements.\nPublicly traded companies in the United States are generally required to issue earnings reports once per quarter to disclose and discuss their quarterly and full-year business results to the investing community. They must be issued in a timely manner after the end of the period being reported.\nMost (but not all) companies release their earnings reports within three to seven weeks after the end of the fiscal quarter. This period that occurs after each calendar quarter is often referred to as earnings season.\nIn a company's earnings report, you can find information on its revenue (also known as top line) and earnings (bottom line) and how specific parts of the company performed.\nMost companies provide commentary from senior leadership on the results and valuable context about future growth initiatives. These typically come both in the form of comments in the written earnings report and in an earnings conference call, which usually occurs within a day or so after the earnings report is released. Many provide forward projections, or guidance, which tell investors how management expects the business to perform in the coming quarter or for the full year.\nUpcoming reports\nUpcoming critical earnings reports in 2025\nThousands of stocks trade on the New York Stock Exchange (NYSE) and Nasdaq exchanges in the United States, and thousands more trade on over-the-counter (OTC) markets and on international stock exchanges. So, it's impossible for us to discuss all of them. However, here's a list of some of the most closely followed companies when it comes to earnings reports and when investors can expect to hear from them next.\n| Name (Ticker Symbol) | Market Cap |\nUpcoming Earnings Date |\n|---|---|---|\n|\nAmazon (NASDAQ:AMZN) |\n$2.30 trillion | 7/30/2025 |\n|\nTesla (NASDAQ:TSLA) |\n$1.06 trillion | 7/21/2025 |\n| Microsoft (NASDAQ:MSFT) | $3.56 trillion | 7/28/2025 |\n| Berkshire Hathaway (NYSE:BRK.A)(NYSE:BRK.B) | $1.06 trillion | 8/1/2025 |\n| Nvidia (NASDAQ:NVDA) | $3.54 trillion | 8/27/2025 |\n| Alphabet (NASDAQ:GOOGL)(NASDAQ:GOOG) | $2.13 trillion | 7/21/2025 |\n| Shopify (NYSE:SHOP) | $142 billion | 8/5/2025 |\n| Block (NYSE:XYZ) | $40 billion | 7/30/2025 |\n| Meta Platforms (NASDAQ:META) | $1.77 trillion | 7/29/2025 |\nIt's important to note that most companies don't announce their earnings release date until a few weeks before it happens. In many cases (including in the table above), earnings dates that are a month or more in the future are approximate and based on the company's previous earnings release activity.\nRecent reports\nRecent important earnings reports\nFor the nine stocks in the earnings calendar chart above, here's a rundown of how things went the last time they reported earnings.\n1. Amazon\nAmazon reported its first-quarter earnings on May 1, 2025, and the results were generally strong. Revenue surpassed analysts' expectations, and the company's cost-cutting efforts resulted in excellent profit margin growth. In fact, Amazon's net income increased by more than 60% year-over-year.\nAmazon Web Services (AWS) was an especially strong point, with revenue up 17% year over year. One thing to keep an eye on is Amazon's capital expenditures, which have accelerated recently due to AI-related investments in data centers and related equipment. Management has said that the company expects capital expenditures to increase to $100 billion in 2025 (compared to $83 billion in 2024), so this is definitely something to keep an eye on.\n2. Tesla\nIn the first quarter of 2025, Tesla reported a 20% year-over-year decrease in automotive revenue, which missed analysts' expectations by a significant margin. The EV maker missed expectations on the bottom line, as well. The biggest drag was reduced vehicle selling prices, which weighed on margins, while increased selling incentives and preparations for a refreshed Model Y also held earnings down.\nPlus, Tesla reported a 71% year-over-year net income decline, which was a big disappointment to investors.\n3. Microsoft\nIn its fiscal third quarter of 2025 (its fiscal year ends June 30), Microsoft reported $70.1 billion in total revenue, which topped expectations. Plus, the company's forward guidance was significantly more than analysts had expected for the fourth fiscal quarter, led by strong growth in Azure.\nOn the bottom line, Microsoft's earnings came in better than expected, with $3.46 per share in net profit. Azure revenue grew 33% year-over-year, with about half of the increase directly associated with artificial intelligence (AI) demand.\n4. Berkshire Hathaway\nBerkshire Hathaway is one of the few companies that always reports earnings on Saturdays, as management wants the market to have time to digest it before trading opens on Monday. In the first quarter of 2025, Berkshire reported a 14% year-over-year earnings decline in its operating businesses, mainly due to weaker underwriting profits from insurance.\nWarren Buffett and his team continue to be net sellers of stock, and as a result, Berkshire reported an all-time high cash and short-term investments balance of about $348 billion, giving the company tremendous financial flexibility going forward.\n5. Nvidia\nFor the first quarter of its 2026 fiscal year, graphics chipmaker Nvidia reported both revenue and earnings that handily surpassed expectations. It generated $44.1 billion in revenue and expects this to swell to $45 billion in the second fiscal quarter. Nvidia's revenue continues to grow rapidly, with 69% year-over-year growth in the first quarter, thanks to the continued surge in demand for AI chips.\nNvidia has been a major beneficiary of the surge in AI investment, and this has been fueling rapid growth in recent quarters. However, there are some concerns about the company's ability to sustain its growth. On the other hand, the industries it serves are expected to get significantly larger over the next decade, so there could be plenty of profit growth in the years ahead.\n6. Alphabet\nIn the first quarter of 2025, Alphabet (better known for its main subsidiary, Google) reported both revenue and earnings that exceeded analysts' expectations.\nLooking a little deeper, revenue from the fast-growing Google Cloud business slightly missed expectations, as did YouTube advertising revenue. It's also important to mention that Alphabet expects $75 billion in capital expenditures in 2025, mainly having to do with its AI growth strategy. This is far more than investors had been expecting, so it will be important to watch and see if the company can achieve a strong return on its investment.\nHowever, it's important to note that the board authorized another $70 billion in stock buybacks, so the company's leaders appear to think the stock is still attractive.\n7. Shopify\nE-commerce service platform Shopify issued mixed results and relatively weak guidance. Shopify guided for second-quarter gross profit growth at a \"high-teens\" percentage, less than the roughly 20% analysts had been expecting.\nManagement said that some of the Trump administration's policies, such as de minimis tariffs, aren't having much of an impact on Shopify, so there was some good news. There are still some ongoing concerns about discretionary spending, but Shopify is doing a great job of setting itself up for long-term success regardless of short-term headwinds.\n8. Block\nDespite fears of lower consumer spending, fintech giant Block (formerly Square) reported solid first-quarter 2025 results throughout its business. Gross profit increased by 9% year over year, and while revenue came in a bit light, the business has become far more profitable than it was a year ago.\nOn the other hand, the company provided soft profit guidance for the second quarter due to economic uncertainty, so it will be interesting to keep an eye on the company for the rest of 2025. Block's Cash App Card is a particularly interesting point to watch, as it is growing its active user base rapidly and creating many opportunities to cross-sell new products.\n9. Meta Platforms\nMeta Platforms, better known by its former name, Facebook, reported first-quarter 2025 earnings that handily beat expectations on both the top and bottom lines. Revenue in the fourth quarter increased by 16% year-over-year, and net income reached $16.6 billion -- 35% more than the same quarter a year ago.\nMeta increased guidance for its (mostly) AI-related capital expenditures, now projecting they will be in the range of $64 billion to $72 billion for the full year 2025, up $5.5 billion at the midpoint of the range. There are 3.43 billion daily active users on the company's platforms, which also exceeded analyst expectations.\nRelated investing topics\nTheir importance\nWhy are earnings reports important?\nEarnings reports are important because they provide lots of important insights into the current state of the companies you invest in and clues about where those companies could be heading. Among other things, earnings reports can help you spot growth trends, profit margin growth or contractions, balance sheet health, and how management expects the business to perform going forward.\nIt's also important to note that earnings reports generally coincide with a conference call with the company's management team and analysts who cover it (also known as an earnings call). These can also be worth listening to, as the company's key executives can provide context and commentary about the numbers you read in their earnings reports.\nEarnings Call\nWith most U.S. companies, earnings reports are the most up-to-date look investors will get at a company's business and financials. Reading the most recent earnings report is an important part of doing ongoing due diligence as a buy-and-hold investor and can help you find new investment opportunities.\nHow to identify potential concerns in a company's earnings report\nThere's no perfect way to identify red flags in a company's earnings report, and it's important to evaluate any concerning information in context with the industry conditions, macroeconomic environment, etc.\nHaving said that, here are a few things to watch out for:\n- Slowing earnings growth.\n- Missed guidance (revenue or earnings).\n- Reduced guidance.\n- Margin compression that isn't for some valid reason.\nFAQ\nEarnings reports FAQ\nHow do investors use earnings reports?\nAside from the obvious use of seeing how a company's business performed over the past three-month period, there is plenty of valuable information in earnings reports. For example, the company's balance sheet gives an updated look at the financial condition of the business. Management's guidance gives you a look at where things might be heading in the future. And investors can use the numbers to spot trends, such as accelerating or slowing growth rates, margin trends, etc.\nWhat time are earnings reports released?\nThere's no specific rule governing the timing of earnings reports, but most companies choose to release their results within a few hours before the stock market opens or after it closes. Most earnings reports are released in the 6 a.m. to 8:30 a.m. ET or 4 p.m. to 5 p.m. ET windows, but there certainly are exceptions.\nWhere can I find earnings reports?\nThere are a few places where you can find earnings reports. The easiest place is typically on the company's investor relations page, but you can also look at the company's filings with the Securities and Exchange Commission (SEC). Alternatively, if you have a brokerage account, you can typically see all recent news (including earnings releases) in a company's news feed.\nHow much do earnings reports affect stock prices?\nEarnings reports can certainly influence stock prices, but this isn't always the case. If a company misses expectations on earnings or revenue, reports an unexpectedly strong or weak quarter, or issues future guidance that is either worse or better than expected, its stock price could move sharply in one direction or another. On the other hand, if a company's earnings report is completely lacking in surprises, it's entirely possible for a stock to barely budge after earnings."
    },
    {
      "url": "https://www.fool.com/terms/p/price-to-free-cash-flow/",
      "text": "There are so many different metrics that you can use to evaluate a potential stock investment, including price to free cash flow (sometimes abbreviated as P/FCF). Price to free cash flow tells a particular story about how the market values a company vs. how much money it earns.\nOverview\nWhat is price to free cash flow?\nPrice to free cash flow is a ratio that compares the market capitalization of a company to its free cash flow. It's considered a fairly good metric because it shows how well or poorly a company is priced on the market compared to its operating cash flow.\nSince operating cash flow is where many businesses derive most of their day-to-day value, comparing the two figures makes sense. Basically, it answers the question, \"What do shareholders think this company is worth compared to its cash production?\"\nHow to calculate\nHow do you calculate price to free cash flow?\nPrice to free cash flow is very easy to calculate. Simply find the free cash flow on the cash flow statement and the current market capitalization after the closing bell from your favorite stock reporting resource. (Don't try to do this with numbers during an active trading day, or you'll drive yourself mad.)\nNow, divide market capitalization by free cash flow, and you'll get price to free cash flow. The equation looks like this:\nPrice to free cash flow = Market capitalization / Free cash flow\nP/FCF vs. P/CF\nPrice to free cash flow vs. price to cash flow\nThere's another, similar metric that's easy to confuse with price to free cash flow, and that's price to cash flow (P/CF). They sound very similar, and they measure things that are somewhat similar, but they are definitely not the same.\nPrice to Free Cash Flow\nPrice to free cash flow compares the shareholder's equity against the actual cash flow of the company, free of capital expenditures, working capital, and dividends. Price to cash flow, on the other hand, looks at shareholder's equity compared to all cash on hand, even if it's cash that's going out, like those dividends. Many consider price to free cash flow to be the better metric.\nRelated investing topics\nWhy it matters\nWhy should price to free cash flow matter to investors?\nPrice to free cash flow can tell an investor how the stock they're considering is priced compared to the actual money the company is making. Of course, this isn't a metric that's useful by itself, but when you compare price to free cash flow of your target company against its competition, a picture can emerge.\nCompanies with low price to free cash flow compared to their nearest competitors are often undervalued and may even be in value stock territory. Companies with high price-to-free cash flow ratios compared to their competitors may be at or near their price peaks, which is not the right time to buy anything.\nOf course, this is just one metric that you should be thinking about -- definitely not a metric that can tell you if you should buy or sell a stock on its own. Instead, do the calculation and consider why the price to free cash flow is what it is. A low number is generally pretty good, but not if there's a scandal brewing or a recent recall has cropped up that may cost the company a lot of money in the upcoming months and years.\nSince free cash flow is a backward-looking metric, any significant changes in the business's operations will take time to be reflected in the price-to-free cash flow ratio, which can create a false sense of security."
    },
    {
      "url": "https://www.fool.com/investing/how-to-invest/stocks/when-to-sell-stocks/",
      "text": "There are right and wrong reasons to sell a stock. While it's generally a bad idea to sell a stock simply because its price increased or decreased, other situations perfectly justify placing one or more sell orders.\nLet's delve into several good reasons for selling a stock, when to sell stock for a profit or loss, and which circumstances do not justify selling a stock.\nReasons to sell\nReasons to sell a stock\nHere's a rundown of five scenarios that can justify selling a stock:\n1. Your investment thesis has changed\nThe reasons why you bought a stock may no longer apply.\nExamine why you bought a stock in the first place and ask yourself if those reasons are still valid. You should have a reason -- or an investment thesis -- for each of your stock investments, other than just wanting to make money.\nIf something fundamental about the company or its stock changes, that can be a good reason to sell. For example:\n- The company's market share is falling, perhaps because a competitor is offering a superior product for a lower price.\n- Sales growth has noticeably slowed.\n- The company's management has changed,\n- Managers are making reckless decisions, such as assuming too much debt.\nOf course, this list isn't exhaustive. But the point is that if something substantially changes that contradicts your investment thesis, that's one of the best reasons to sell.\n2. The company is being acquired\nAnother potentially good reason to sell is if a company announces it has agreed to be acquired.\nAfter an acquisition is announced, the stock price of the company being acquired typically rises to a level close to the agreed-upon purchase price. Since further upside potential can be quite limited, it may be wise to lock in your gains shortly after the acquisition announcement.\nSpecifically, the way the company is being acquired affects whether selling your stock is the right decision. A company can be acquired in cash, stock, or a combination of the two:\n- For all-cash acquisitions, the stock price typically quickly gravitates toward the acquisition price. But if the deal is not completed, then the company's share price could come crashing back down. It's rarely worth holding on to your shares long after the announcement of an all-cash acquisition.\n- For stock or cash-and-stock deals, your decision to hold or sell should be based on whether you have any desire to be a shareholder in the acquiring company. For example, real estate brokerage Redfin (NASDAQ:RDFN) agreed in March 2025 to be acquired by mortgage giant Rocket Companies (RKT 9.47%) in an all-stock deal. Redfin shareholders who didn't want to become Rocket investors would have had a good reason to sell.\n3. You need the money, or soon will\nIt's generally a best practice not to invest in the stock market with any money you expect to need within the next few years. But if you need the money, that's certainly a valid reason to sell.\nPerhaps you want to purchase a house and sell some stock to cover the down payment. Or you may have children who plan to attend college in a few years, and you want to convert your stock holdings into more secure investments, such as certificates of deposit (CDs).\n4. You need to rebalance your portfolio\nYour investment portfolio can become unbalanced in one or more ways. That is why periodically rebalancing your portfolio -- which may involve selling some stock -- is necessary for most investors. These are two of the most common circumstances preceding a stock sale:\n- Owning a high-performing stock: If you own shares that have significantly increased in price, your position in the company may represent a large portion of the value of your portfolio. While this is a good problem to have, you may not be comfortable with having so much of your money invested in a single company and choose to sell part of your stock.\n- Seeking to reduce your stock exposure: As you get closer to retirement, it's smart to gradually reduce your portfolio's stock holdings in favor of safer investments such as bonds. One popular rule of thumb (known as the Rule of 110) is to subtract your age from 110 to determine the percentage of your portfolio that should be invested in stocks. If your portfolio seems too stock-heavy, then selling some stock to reallocate your resources can be a good decision.\n5. You identify opportunities to better invest your money elsewhere\nIn a perfect world, you'd always have spare cash to invest every time you identify an attractive investment opportunity. Since that's probably not the case, you may decide to sell stock to invest the cash differently.\nLet's say you notice an incredible buying opportunity for one of your favorite stocks and decide you want 10% of your portfolio to be allocated to this investment. If you don't happen to have 10% of your portfolio sitting in cash, you may decide to sell some shares of other stocks or exchange-traded funds (ETFs) you own to free up some capital.\nEven if there is nothing wrong with the other stock or ETF, recognizing an excellent long-term opportunity elsewhere can be a valid reason to sell.\nJust be aware that there's a fine line between selling to take advantage of an opportunity and overtrading.\nSelling for profit\nWhen to sell stocks for profit\nAny of the above are good reasons to sell a stock for a profit. Having earned a profit from an investment can further justify selling the stock to pay for a major purchase, your living expenses in retirement, or as part of your portfolio allocation strategy.\nBut don't sell a stock for profit just because the share price has increased. Doing that would be falling into the trap of believing that it's a good idea to \"take some money off the table\" if a stock gains value.\nTo be perfectly clear, selling just because a stock went up is a terrible reason.\nSelling at a loss\nWhen to sell stocks at a loss\nSimilarly, it's usually a bad idea to sell a stock only because its price decreased, if none of the reasons listed above apply.\nHaving said that, selling losing investments (especially if you see better opportunities elsewhere) can help you save money on your taxes. Investment losses can be used to offset capital gains.\nAs legendary investor Warren Buffett says, \"The most important thing to do if you find yourself in a hole is to stop digging.\" If your original reason for buying a stock no longer applies, or if you were just plain wrong about the company, then selling at a loss rather than continuing to hold may be your best option.\nWhen not to sell\nWhen not to sell a stock\nIt's important to clearly know when not to sell a stock. Here's a list of some of the situations in which it's inadvisable to sell your shares:\n- Don't sell a stock just because its price increased. Winning stocks often increase in price for a reason, and they also tend to keep winning.\n- Don't sell a stock just because its price decreased. Every investor wants to buy low and sell high. Selling a stock just because its price fell, if the reasons you bought it still apply, is literally doing the exact opposite.\n- Don't sell stock just to save money on taxes. While the tax strategy discussed earlier, which is known as tax loss harvesting, can reduce your taxable capital gains by incurring losses on unprofitable stock positions, it's nonetheless a bad idea to sell stocks just to lower your taxes. Tax loss harvesting can be a smart tax-saving strategy, but only if you are choosing to sell a losing stock for other valid reasons.\nRelated investing topics\nThe Motley Fool sells stock regularly, too\nWhile The Motley Fool always approaches investing with a long-term perspective, that doesn't mean we only suggest stocks to buy.\nWe regularly give \"sell\" recommendations to our members, often for one of the reasons described above. There can be several valid reasons to sell a stock, and many long-term-focused investors frequently have reasons to offload parts of their holdings.\nFAQ\nWhen to sell stocks FAQ\nHow do you know when to sell your stock?\nThere are several good reasons to sell a stock, including but not necessarily limited to:\n- Your investment thesis has changed.\n- The company is being acquired.\n- You need the money for a specific purpose.\n- You want to rebalance your portfolio.\n- You see better investment opportunities elsewhere.\nWhat is the 3-5-7 rule in stocks?\nThe 3-5-7 rule is a stock trading guideline that says that you should limit risk to 3% of your account balance on any single trade, temporarily pause trading if your account value falls by 5%, and taking a step back and examining your trading strategy if your account falls 7% in a week.\nWhat is the right time to sell stocks?\nThere's no perfect time to sell stocks, but it can make sense to sell a stock if certain factors apply. These include, but are not limited to, if your investment thesis has changed, the company is being acquired, you need the money, or if you see better investment opportunities elsewhere.\nAt what percent increase should I sell a stock?\nIt is generally not a great idea to sell a stock just because it went up. But if a stock is higher and there's another valid reason for selling -- such as needing to rebalance your portfolio -- it could be a good idea to sell some of a winning stock position."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/information-technology/semiconductor-stocks/",
      "text": "Semiconductor stocks are shares of companies that produce the microchips and electronic components used in everything from smartphones to cars.\nThey are part of the technology sector but are also manufacturing businesses, which means their businesses are cyclical, like any industrial business.\nSemiconductor\nPicking top-performing semiconductor stocks in the industry can be tricky, and their performance is highly volatile since sales volumes ebb and flow.\nBut the semiconductor sector is growing rapidly as the world rapidly embraces its critical role in artificial intelligence (AI) development and applications.\nSome of the best-performing stocks throughout 2023-25, like Nvidia (NVDA 1.65%), have hailed from the semiconductor industry.\nDifferent types of semiconductor stocks\nDifferent types of semiconductor stocks\nThe Global Industry Classification Standard (GICS), a system used by investors and index providers to categorize public companies by sector and industry group, places semiconductor stocks under the information technology sector. Within this sector, GICS breaks down semiconductor-related firms into two main categories.\nSemiconductor equipment\nThese companies provide the tools, machines, and services required to manufacture chips. This includes firms that make lithography systems, wafer inspection tools, or etching equipment used by chipmakers. These companies tend to be critical suppliers for the production process, but don’t produce chips themselves.\nSemiconductor companies\nThese are the ones that actually design and manufacture the chips that power computers, smartphones, cars, appliances, and more. These chips can range from basic memory to high-performance processors or specialized sensors.\nOther classification methods\nBeyond this GICS classification, semiconductor stocks can also be sorted by geography, such as U.S.-based versus international companies, or by business model.\nSome are fabless, meaning they design chips but outsource the manufacturing to third-party foundries. Others operate fabs, or fabrication plants, and handle the manufacturing process in-house.\nEach of these distinctions can affect how the company earns revenue, manages costs, and scales operations.\nTrends\nWhat trends drive semiconductor stocks?\nComputer chips have many uses, but up-and-coming semiconductor companies will likely focus on two areas of growth in the decade ahead:\n1. The Internet of Things (IoT)\nThe Internet of Things (IoT) refers to the network of interconnected devices that communicate and exchange data with each other.\nThis technology is set to revolutionize various industries by enabling smarter homes, cities, and consumer goods.\nSemiconductors are crucial in IoT devices since they provide the processing power and connectivity needed for these devices to function.\nAs IoT applications expand, the demand for advanced, energy-efficient chips that can handle the diverse and high-volume data processing requirements will surge.\nEmerging semiconductor companies focusing on IoT will need to innovate to create smaller, more efficient, and more powerful chips to meet the evolving needs of this market.\n2. Generative AI\nGenerative AI, which includes technologies like machine learning and neural networks, is another significant growth driver for semiconductor companies.\nThese AI systems require immense computational power to process complex algorithms and vast amounts of data.\nAs generative AI becomes more integrated into applications such as search engines, autonomous vehicles, and advanced robotics, the demand for high-performance chips will increase.\nSemiconductor companies that develop graphics processing units (GPUs) and other specialized AI hardware are poised to benefit immensely from this trend. Innovations in chip architecture to improve speed, efficiency, and processing capabilities will be essential to support the growing AI industry.\nAnother important long-term catalyst to watch in the U.S. is the CHIPS and Science Act, signed into law in August 2022. The legislation was designed to significantly bolster domestic semiconductor manufacturing and research via billions in funding and significant tax credits.\nSemiconductor stocks\nBest semiconductor stocks to buy in 2025\nHere are two top picks for semiconductor industry secular growth trends:\n1. Qualcomm\nQualcomm (QCOM 2.53%) is the longtime leader in mobile chip design. Historically, Qualcomm has been a key Apple (AAPL 1.21%) supplier, having profited from the smartphone boom and Apple's ecosystem over the past decade.\nRecently launched flagship Android devices powered by Qualcomm's Snapdragon 8 Gen 3 are seeing strong demand globally, especially in China.\nIn premium and high-tier smartphones, Qualcomm's Snapdragon Mobile platforms are also enabling generative AI capabilities.\nToday, Qualcomm has also pivoted to a strong automotive focus via its Snapdragon X platforms. These platforms aim to transform vehicles with advanced connectivity and autonomous driving features.\nIn the PC market, Qualcomm has expanded its computer portfolio with the Snapdragon X Plus Platform, tailored towards upcoming launches of next-generation AI PCs.\n2. Nvidia\nNvidia (NVDA 1.65%) has positioned itself as the platform for all types of AI, largely thanks to its portfolio and the powerful H100 Tensor Core GPU, putting it in a leading position to pursue new markets and expand revenue.\nIn 2024, Nvidia clocked new revenue records, driven largely by growth in their data center segment, which CEO Jensen Huang terms \"AI factories.\"\nHuang believes AI is increasingly becoming a commodity, and these AI factories are pivotal in accelerating demand for generative AI training and inference. They are essential for consumer internet companies, automotive industries, healthcare sectors, and many other fields that require complex infrastructure to run their models on.\nBeyond their GPUs and data centers, Nvidia also offers a variety of platforms to cater to the evolving AI landscape. Blackwell, for instance, is designed for trillion-parameter-scale generative AI. Spectrum-X is a new market offering aimed at scaling AI to Ethernet-only data centers.\nAdditionally, Nvidia's NIM (Nvidia Infrastructure Management) is a software solution that delivers enterprise-grade, optimized generative AI capable of running on CUDA (Compute Unified Device Architecture) everywhere.\nCUDA is Nvidia's parallel computing platform and application programming interface (API) model, which allows developers to utilize Nvidia GPUs for general-purpose processing (an approach known as GPGPU, general purpose computing on graphics processing units).\nSemiconductor ETFs\nBest semiconductor ETFs to buy right now\nIf you prefer not to pick single stocks, you can also buy a semiconductor exchange-traded fund (ETF) to gain exposure to the overall sector\nTwo top semiconductor ETFs in terms of overall assets under management (AUM) are:\n1. iShares Semiconductor ETF (SOXX)\nThe iShares Semiconductor ETF (SOXX 2.78%) tracks 30 market cap-weighted U.S. semiconductor stocks via the NYSE Semiconductor index. This ETF sported more than $13 billion in assets under management (AUM) in mid-2025, charging a 0.35% expense ratio.\n2. VanEck Semiconductor ETF (SMH)\nThe VanEck Semiconductor ETF (SMH 2.15%) tracks 25 market cap-weighted, U.S.-listed semiconductor stocks via the MVIS US Listed Semiconductor 25 index. It had more than $26 billion in assets in mid-2025 and charged a 0.35% expense ratio.\nKey factors\nKey factors to understand before investing in semiconductors\nWhen looking for the best chipmakers and long-term undervalued semiconductor stocks to buy, consider these four key factors before you buy:\n1. Sustainable revenue growth\nCompanies that gradually increase their sales over time are the best investments, but overall revenue growth matters even more for semiconductor stocks.\nRevenue\nMany companies in this sector struggle to cope with the industry's cyclical nature. Hardware, such as PC and laptop chips, tends to become a commodity as the years progress and more advanced chips come out. If a new market is growing quickly, other chipmakers might pile on with similar products. Supply swells, prices fall, and individual company sales decline.\nIf a semiconductor chip company isn't constantly innovating and finding new outlets or developing a robust pipeline for its hardware tech, weathering the cycle can be unsustainable.\nThat being said, some chip designers are able to protect their work with patents that are not easy to replicate by other means. This can create a type of competitive moat for the company's long-term growth, although it doesn't completely prevent up-and-down sales cycles.\n2. Above-average profit margins\nSales need to translate to profits. Companies that cannot control their expenses have low profit margins, and companies with high profit margins have a greater ability to reinvest in research and improve their operations. High gross profit, operating profit, and free cash flow generation are also positive indicators that the company is operating efficiently.\nBecause of the very high amount of expense needed to get into the semiconductor business, established companies tend to be able to ramp up profit margins as revenue increases over time.\n3. Attractive returns on invested capital\nA company's return on invested capital (ROIC) indicates how well it's able to generate profit from the cash it raises via debt and equity it receives. A high ROIC means the company is likely innovating strategically, improving operations to increase efficiency, and targeting secular growth trends with new chip designs.\n4. Strong balance sheet\nSemiconductors are arguably the most complex things ever developed by humankind. Manufacturing chips is very expensive, so it's especially important to understand how semiconductor companies obtain the necessary financial resources to expand.\nFor example, take chip manufacturers such as the world's largest, Taiwan Semiconductor Manufacturing (TSM 2.49%). For a chip business, the company has above-average debt compared to its revenue. However, it also has more cash and investments than it does debt, which signifies a healthy and profitable business that has no problems getting funding.\nA company's balance sheet that has more cash than debt and low debt relative to operating profit is a key element to watch. Plenty of cash relative to debt means that a company is well positioned to pay interest and principal payments, even in a pinch. It can also mean the return of excess cash in the form of dividends and stock repurchases.\nRelated investing topics\nFAQ\nFAQ: Best semiconductor investments\nWhat stock is the best for semiconductors?\nThe best stock depends on your investment objectives and risk tolerance, but Nvidia was one of the best-performing and largest semiconductor stocks in 2025.\nWhat is the best chip stock to buy?\nThe best chip stock depends on your targeted market (e.g., smartphones, PCs, data centers, gaming, etc.). For general exposure, a large company like Nvidia will provide broad coverage.\nAre semiconductors a good investment?\nSemiconductors can be a good investment, offering strong returns but also experiencing high volatility. This year has shown their potential for significant gains, but it's important to remember that they are highly cyclical. Investing in semiconductors requires a willingness to handle these fluctuations.\nWhere can I buy semiconductor stocks?\nYou can buy semiconductor stocks on most major exchanges, including the New York Stock Exchange (NYSE) and Nasdaq. These stocks are available for purchase through most brokerage apps.\nWhy are semiconductor stocks going up?\nSemiconductor stocks are rising due to a mix of sector-specific tailwinds and broader economic trends. On the industry side, strong demand for high-performance computing and increased investment in AI infrastructure have all played a role. At the macro level, easing interest rate concerns and improving global growth expectations have also helped lift investor sentiment toward cyclical tech stocks like semiconductors.\nWhat are the top semiconductor companies?\nThe three most prominent semiconductor companies are Nvidia, Taiwan Semiconductor Manufacturing, and ASML Holding NV (NASDAQ:ASML). Together, they represent the design, production, and tooling ecosystem. Nvidia designs the most in-demand AI chips on the market. TSMC is the leading third-party chip fabricator. ASML builds the advanced lithography machines required to produce cutting-edge chips.\nWhich semiconductor stock is undervalued?\nWhich semiconductor stock is undervalued depends on how you define value, but one notable candidate is Micron Technology Inc. (NASDAQ:MU), a memory chip manufacturer that produces DRAM components used in servers, PCs, and smartphones. As of July 2025, Micron was trading at 10.02x forward earnings, well below the 33.47x forward earnings multiple of the iShares Semiconductor ETF, suggesting the stock may offer relative value within the sector."
    },
    {
      "url": "https://www.fool.com/investing/how-to-invest/stocks/why-stocks-go-up-and-down/",
      "text": "In the short term, stocks go up and down because of the law of supply and demand. Billions of shares of stock are bought and sold each day, and it's this buying and selling that sets stock prices.\nImagine there are 1,000 people willing to buy one share of stock XYZ for $10, but there are only 500 people willing to sell one share of XYZ for $10. The first 500 buyers each snag a share for $10. The other 500 buyers who were left out then raise their offer price to $10.50. This higher offer price persuades some owners of XYZ who didn't want to sell at $10 to sell at $10.50. The stock price is now $10.50 instead of $10 since that was the price of the latest transaction.\nWhat affects stock price?\nWhat affects stock price?\nHigh demand for a stock drives the stock price higher, but what causes that high demand in the first place? It's all about how investors feel:\n- Market sentiment toward the stock.\n- Market sentiment toward the industry.\n- Market sentiment toward the stock market.\n- Confidence in the economy.\nThe more confident investors are about a company's prospects or the potential for positive developments, the more likely they are to want the stock. Conversely, a loss of confidence can lead investors to sell, pushing down the stock price.\nFactors that can affect sentiment toward a stock include quarterly earnings reports beating or falling short of expectations, analyst upgrades or downgrades, and positive or negative business developments.\nDemand for a stock can also be affected by sentiment toward a particular industry. An electric vehicle company, for example, may see its stock price soar as investors snap up shares because those investors are confident in the future of the EV industry. A rising tide can lift all boats.\nThis goes both ways. If investors sour on an industry, every stock in that industry could suffer -- regardless of how each individual company is doing.\nConfidence in the stock market can also push up demand and prices for individual stocks. If investors believe that stocks are a good investment, either because valuations are attractive or because the stock market has been trending upwards, an increase in demand for stocks can push up prices across the board.\nThe opposite is also true. A declining stock market can zap investor confidence and lead to more selling and lower stock prices, and high valuations can prompt some investors to buy fewer stocks or sell their holdings.\nOpinions about the trajectory of the economy also play a role in setting stock prices. Investors may sell some stocks in anticipation of an economic slowdown. The widespread belief in a recovering or booming economy, on the other hand, can lead to an increase in demand for stocks.\nPattern Day Trader\nWhy do stock prices change every second?\nWhy do stock prices change every second?\nStock prices are driven up and down in the short term by supply and demand, and the supply-demand balance is driven by market sentiment. But investors don't change their opinions every second. So why, then, do stock prices change so fast?\nThe current stock price is nothing more than the price at which the last transaction took place. For many stocks, transactions are occurring every second the stock market is open.\nInvestors trade an average of 50 million shares of Apple (AAPL 1.21%) each day. Every time a block of shares is bought and sold, the stock price changes to reflect the latest transaction price. The sheer number of transactions ensures that the stock price fluctuates every second, even if there's been no change in market sentiment.\nRelated investing topics\nThe big picture is what matters\nThe big picture is what matters\nLong-term investors, like those of us at The Motley Fool, don't much care about the short-term developments that push stock prices up and down each trading day. When you have years or even decades to let your money grow, analyst reports and earnings beats are often fleeting and irrelevant. What matters is where a company will be five, 10, or 20 years from now.\nIn the long term, the value of a stock is ultimately tied to the future cash flows generated by the company. Investors who believe a company will be able to increase its earnings in the long run or who believe a stock is undervalued may be willing to pay a higher price for the stock today, regardless of short-term developments. This creates a pool of demand undeterred by day-to-day news, which can push the stock price higher or prevent big declines.\nWhile a lot of ink is spilled about daily fluctuations in stock prices, and while many people try to profit from those short-term moves, long-term investors should be laser-focused on a company's potential to increase its profits over many years. Ultimately, rising profits push stock prices higher.\nFAQ\nWhat Makes a Stock Price Go Up FAQ\nWhat helps stocks go up?\nStocks tend to increase when there's strong demand and positive investor sentiment, and companies show strong earnings growth and future prospects.\nHow do you know when a stock will go up?\nPredicting stock price movements is inherently difficult, but investors often look at a company's fundamental performance, market trends, and technical analysis to gauge potential upward movement.\nHowever, timing the market is a difficult and often unprofitable approach to investing. Rather than investing solely based on share prices, it is wise to put cash in businesses that you believe are solid investments over the long run.\nWhat is the 7% rule in stocks?\nThe 7% rule is a risk management strategy suggesting you sell a stock when it falls 7% or 8% from your purchase price, regardless of the reason for the decline. The 7% rule is designed to help investors cut losses quickly and prevent larger losses from developing.\nHowever, it is important to look beyond share price movements and at the underlying business. You shouldn't buy or sell shares simply because a stock is up or down. But if you own a stock and your thesis about the business has changed, that could be a good reason to sell shares."
    },
    {
      "url": "https://www.fool.com/investing/2025/08/11/nvda-stock-china-ai-chips/",
      "text": "Nvidia (NVDA 1.65%) and fellow graphics processing unit (GPU) maker Advanced Micro Devices, or AMD, have agreed to give the U.S. government 15% of their revenue from sales of their respective artificial intelligence (AI) data center chips designed for the China market in exchange for obtaining export licenses for these chips, according to the Financial Times, which first reported the story on Sunday night.\nThe 15% AI chip revenue deal\nThe U.S. Commerce Department began issuing export licenses for Nvidia's H20 chip and AMD's MI308 chip on Friday, the Financial Times (FT) reported on Friday.\nNvidia provided a statement to the FT after it broke the government deal story on Sunday night that included the following: \"We follow rules the U.S. government sets for our participation in worldwide markets.\"\nBackground on Nvidia's H20 chip\nNvidia had designed the H20 AI-enabling GPU specifically for the Chinese market after earlier U.S. export controls, enacted under the administration of President Joe Biden, meant it couldn't sell its more advanced data center AI chips to China.\nIn mid-April, the Trump administration expanded the restrictions to include the H20. Nvidia immediately halted its sales and took a charge of $4.5 billion on its Q1 results for H20 inventory and purchase commitments.\nThen in mid-July, Nvidia emailed investors who subscribe to the company's news and said it was \"filing applications to sell the Nvidia H20 GPU again. The U.S. government has assured Nvidia that licenses will be granted, and Nvidia hopes to start deliveries soon.\"\nAt the time, there was no mention of giving the government a 15% cut of H20 revenue as a condition for obtaining export licenses.\nHow will Nvidia's revenue be affected by this deal?\nWe can get an estimate as to how this deal will affect Nvidia's financial results by looking at the company's fiscal first quarter, which ended on April 27.\nIn that quarter, Nvidia sold $4.6 billion in H20 chips to China prior to the start of the export controls in mid-April. It said it was unable to ship $2.5 billion in H20 chips that it had already produced due to the export controls. So, had the restrictions not existed, Nvidia would have sold $7.1 billion in H20 chips to China customers in Q1. This amounts to 15.2% of $46.6 billion, which is what its total revenue would have been, absent the export controls.\nOver 15% of its total revenue is significant, so you can see the importance of Nvidia's China data center business.\nFor its fiscal Q2 (which ended July 27), investors should expect Nvidia to report no sales of its H20 chip, because the export restrictions were in place the entire quarter. However, H20 sales should fully rebound in fiscal Q3 (late July to late October).\nWhen Nvidia provided Q2 guidance, it estimated that it would lose about $8 billion in H20 chip sales due to the export controls. So, keeping with roughly the same sequential quarter growth, let's assume Q3 H20 sales will be about $9 billion. In this case, Nvidia would pay the U.S. government $1.35 billion, which is 15% of $9 billion.\nWhile $1.35 billion seems like a huge number, it's only a small percentage of Nvidia's overall quarterly revenue. In Q1, Nvidia's total revenue was $44.1 billion -- and it would have been $46.6 billion, had it not \"lost\" sales of $2.5 billion due to the export restrictions. That $1.35 billion is only 2.9% of $46.6 billion. But the actual Q3 percentage will be smaller because Nvidia's revenue will be higher in Q3 than Q1.\nA revenue loss of somewhere between 2% to 3% of total sales is a very minor speed bump. Moreover, it's a much better situation than having no H20 sales.\nHow will Nvidia's profitability be affected by this deal?\nGiving the government a 15% cut of H20 sales revenue should also negatively affect Nvidia's bottom line. But it should be an extremely minor dent, because Nvidia's data center platform is amazingly profitable. On that note, Nvidia overall is amazingly profitable.\nNvidia doesn't break out its profitability by platform, so we'll have to use its overall numbers. In Q1, Nvidia's adjusted gross margin (gross profit divided by revenue) absent the $4.5 billion H20-related charge was 71.3%. The company provided its adjusted earnings per share (EPS) absent the charge, so I could calculate adjusted net income absent the charge and then from that calculate adjusted net profit margin (net income divided by revenue) absent the charge -- which would have been 56.1%.\nIn other words, Nvidia converts more than half of its revenue into adjusted profits in a typical quarter, which is just phenomenal. It can easily absorb slightly less profitability on its H20 chips, which, again, account for roughly 15% of its total revenue in a typical quarter.\nIn short, Nvidia stock's strong upward trajectory should not be hurt by the company having to give the government a slice of its H20 sales."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/information-technology/ai-stocks/",
      "text": "Computers excel at crunching numbers but not at tasks that many people do with ease, like language processing, visual perception, object manipulation, reasoning, planning, and learning. Artificial intelligence (AI), including its offshoots of deep learning and machine learning, uses computers to perform tasks that typically require human intelligence, such as language generation and facial recognition.\nAI stocks are shares of companies that are developing or employing AI technology as part of their business. AI stocks span sectors like semiconductors, software, and even beyond tech, representing companies that are using AI in ways that set them apart from their peers.\nHow AI is used\nHow do companies use artificial intelligence?\nArtificial intelligence, or AI, is created through machine learning, which involves training a system on vast amounts of data. It then uses the trained system to make inferences about data it's never seen.\nThe simplest example is a system designed to detect objects in images. Images containing those objects are provided to the system, which \"learns\" how to detect them in other images. The more objects it detects in images, the more accurate the detection system becomes.\nCompanies employ AI in two main ways. Many tech companies use it to make their existing operations more powerful through high-profile applications like robotics, self-driving cars, and virtual assistants.\nFor instance, AI is used by Alphabet (GOOGL 3.1%) (GOOG 2.98%) subsidiary Google to filter spam in Gmail, by Amazon (AMZN 3.12%) to recommend products to customers, and by Netflix (NFLX -0.2%) to guide content creation and recommendations.\nMore recently, OpenAI's ChatGPT has shown how far generative AI -- a division of artificial intelligence capable of generating texts, images, sounds, and ideas -- has come. It can answer questions directly, write poems, and has even passed bar and medical exams.\nIt has spawned a wave of new generative AI chatbots, including Anthropic's Claude, Alphabet's Gemini, and Meta Platforms' (META 2.04%) Meta AI. The potential is enormous.\nThe next frontier for generative AI is AI agents or agentic AI. This technology allows AI to perform and complete whole tasks without being prompted. For instance, an automated customer service agent that could handle a request without needing human assistance would be agentic AI. Salesforce's (CRM 0.91%) AgentForce is one example of a new agentic AI tool.\nSome companies also profit directly from AI by selling hardware, software, services, or expertise that the technology requires. These are true AI stocks and include those listed and described below.\n5 top AI stocks\n5 AI stocks to buy in 2025\n| Company | AI Focus |\n|---|---|\n| Nvidia (NASDAQ:NVDA) | Data center GPUs and superchips |\n| Alphabet (NASDAQ:GOOG) (NASDAQ:GOOGL) | Generative AI and self-driving cars |\n| Microsoft (NASDAQ:MSFT) | Memory chips for data centers and generative AI tools |\n| CoreWeave (NASDAQ:CRWV) | Generative AI-focused cloud infrastructure platform |\n| Meta Platforms (NASDAQ:META) | AI chatbots, LLMs, and wearable devices |\n1. Nvidia\nLeading graphics processing unit (GPU) company Nvidia has taken advantage of the AI boom, with its GPUs becoming the de facto standard in data centers worldwide. Generative AI's training phase demands a lot of computing power; the phase that follows, the inference phase, typically requires less.\nGPU chips, which were once used primarily for rendering video games, support both phases well. Nvidia's ambitions have gone beyond GPUs, as the company now aims to build AI factories or data centers full of Nvidia components to run AI applications and programming.\nNvidia's data center business now makes up the vast majority of the company's revenue, thanks to the emergence of generative AI. Because it sells the building blocks for AI infrastructure, Nvidia became the first major company to see a significant revenue boost from AI.\nRevenue surged through 2023 and 2024, and the stock has soared as well. It's been the most valuable company in the world on several occasions and was No. 1 in July 2025. It also became the first company to reach a market cap of $4 trillion. In 2024, full-year revenue jumped 114% to $130.5 billion, driven by the surge in data center demand, and growth is expected to be strong in 2025 as well.\nNvidia's chips are popular for running demanding workloads that applications like large language models (LLMs) require. The pure-play chip stock is now selling its new Blackwell platform, which major cloud infrastructure services are deploying in 2025, and demand is outstripping supply.\nSelf-driving cars and \"physical AI\" are other areas of focus. Nvidia develops hardware and software platforms that can power driver-assistance features and fully autonomous driving, which could be a significant source of revenue if that industry takes off. Automotive revenue is only a small fraction of the company's revenue, but that could change.\nWith Tesla (TSLA 6.18%) having launched its robotaxi network in Austin, the autonomous vehicle race appears to be heating up, and that should be good news for the semiconductor sector.\nA self-driving car must process massive amounts of data from multiple sensors and cameras in real time, detect objects such as pedestrians and other vehicles, and make complex decisions. They require tremendous computing power, which is exactly what Nvidia's platform delivers.\nIts professional visualization segment, which includes its omniverse, also has potential in AI. Nvidia's chipsets could someday be supplanted by more specialized processors designed for AI, but the company is in an enviable position for now.\n2. Alphabet\nAlphabet has been preparing for the AI revolution for years, acquiring the AI research lab DeepMind in 2014. It's also among the leaders in autonomous vehicles through its Waymo subsidiary, which is now ferrying passengers in its driverless cars in cities such as San Francisco and Phoenix.\nAlphabet launched Gemini -- its own AI chatbot and the latest iteration in its competition with ChatGPT -- which some see as a threat to Google Search. So far, concerns about a challenge to its search dominance seem to have been overblown, as Alphabet's ad revenue continues to grow steadily.\nThe company said that its Gemini 2.5 has been \"widely recognized as the best model in the industry.\" New features, like AI assistant and AI mode, have helped Google Search defend its market share against AI-based challenges.\nWith information at the heart of its business, it's unsurprising that the company has prioritized AI. It's rolled out AI tools for Google Cloud and Google Workspace, including a generative AI assistant that helps write emails. Even its customer acquisition strategy in the cloud is based around AI -- the company has targeted AI start-ups for its cloud infrastructure service.\nAI also plays a role in improving its search engine and YouTube, where it can pinpoint a relevant section of a video and direct users straight to it. Finally, Alphabet is ramping up spending on capital expenditures, with plans to spend $75 billion on AI infrastructure and related needs in 2025.\n3. Microsoft\nMicrosoft has gotten lots of buzz lately, thanks to its partnership with OpenAI. The tech giant began investing in the tech start-up in 2019 and invested another $10 billion in OpenAI following the launch of ChatGPT.\nMicrosoft has incorporated GPT features across its product portfolio, including its Azure cloud infrastructure service, Edge web browser, Office productivity software suite, and Copilot for Microsoft 365. Azure OpenAI has seen a particularly strong uptake, now counting more than 65% of the Fortune 500 as customers.\nCEO Satya Nadella has repeatedly said that he sees AI as the next major computing platform. The reported $13 billion investment in OpenAI is a sign of the company's conviction in AI and its belief that it needs to lead that transition or get left behind, as it did with mobile.\nMore recently, Microsoft has begun diversifying away from OpenAI. It has been adding both internal and third-party models to products like Microsoft 365 Copilot and Azure, including DeepSeek's R1.\nThe long-term implications for its relationship with OpenAI are unclear, but Microsoft seems to think it's wise to hedge its bets in the AI race. The relationship continues to evolve, but Microsoft sees the start-up's technology as critical for its AI strategy.\nMicrosoft is harnessing the power of AI in other ways, too, including automated clinical documentation in healthcare to reduce paperwork and administrative needs. It's also using Azure to allow customers to build custom AI tools. It launched Azure AI Foundry in November 2024, enabling its customers to create and manage AI apps and agents. As of April 2025, developers at more than 70,000 companies are using it.\n4. CoreWeave\nCoreWeave, which had its initial public offering (IPO) in March 2025, may be the closest thing to a pure-play AI stock on the market, and it launched the first major AI IPO. Its cloud infrastructure platform was designed specifically for AI, and it counts customers like Nvidia, OpenAI, Meta Platforms, and Microsoft as part of its core customer base. Nvidia and OpenAI are both investors in the company.\nCoreWeave has grown at an incredible pace over the last three years, going from generating almost no revenue in 2022 to $1.9 billion in 2024. Between 2022 and 2024, revenue grew by more than 100 times.\nCoreWeave's business is risky since Microsoft accounts for 62% of its revenue, meaning the business would suffer significantly if Microsoft were to pull back on spending with the platform. In its first-quarter 2025 report, CoreWeave said that no single company accounted for more than half of its backlog, a sign that its customer concentration is improving.\nThe company announced plans for a $6 billion data center in July. It's also acquiring Core Scientific, which will bulk up its AI infrastructure with 1.3 gigawatts (GW) in power capacity.\nIf you're looking for direct exposure to AI, CoreWeave is a good option since essentially all of its revenue is driven by demand for computing power to run generative AI programs. However, the stock is risky, as CoreWeave has a high debt burden, large capital expenditures, and is deeply unprofitable on a generally accepted accounting principles basis (GAAP).\n5. Meta Platforms\nUnlike the other big tech companies on this list, Meta Platforms doesn't have a cloud computing business, but it's investing just as much in AI as peers like Alphabet. Meta AI, the company's chatbot, is available on its apps (e.g., Facebook, Instagram, and WhatsApp) and had 1 billion monthly active users as of May. Meta continues to update its Llama large language model, which is now up to Llama 4.\nIt's also allowing its advertisers to use AI creative tools for things like background and video generation and ad copy. AI is involved in ad targeting as well, and the company aims to fully automate advertising with AI by 2026.\nAdditionally, the company is incorporating AI in its hardware division, including its Ray-Ban smart glasses, which offer a built-in camera, open-ear audio, and a range of hands-free features. Its Meta Quest headsets are also connected to Meta AI, allowing users to tap into the power of AI through the devices.\nIn June, it acquired 49% of data-labeling specialist Scale AI for $14.8 billion and brought Scale CEO Alexandr Wang on to run an AI research lab at Meta. The tech giant has also made a number of smaller acquisitions in AI. Management sees AI at the core of its business and driving its transformation across areas such as advertising, experiences, and devices.\nMachine learning\nMachine learning stocks\nAll the stocks above use machine learning technologies. However, if you're looking for even more options, here are two others worth considering:\nPalantir\nPalantir (PLTR 1.6%) has been one of the top-performing AI stocks. The company provides cloud software and specializes in data fusion that helps its customers make important insights by connecting disparate pieces of information hidden in data.\nIt also launched its AI Platform (AIP) in 2023, which has helped accelerate its growth. Palantir deploys machine learning models on top of data foundations and continuously improves them to ensure they become more useful.\nTesla\nTesla is best known for its electric vehicles (EVs). CEO Elon Musk sees AI as the future of the company, and machine learning and neural networks are very much at the center of the company's autonomous vehicle and Optimus autonomous robot projects.\nTesla introduced its driverless Cybercab in October 2024, and the company hopes to begin producing the vehicles by 2026. It launched its robotaxi network in June, though with just a handful of vehicles, and Musk envisions the company expanding to other cities in the near future. Musk has said Tesla's automation technology could make it the most valuable company in the world.\nDeep learning\nDeep learning stocks\nDeep learning is a subset of machine learning that uses artificial neural networks inspired by the human brain. It's the most advanced kind of AI and is crucial in technologies like self-driving cars. Deep learning is advancing in areas such as preventive healthcare, where predictive algorithms are necessary. It differs from machine learning in that it doesn't require human input.\nNvidia is among the companies closely associated with deep learning. Its GPU chips use deep learning to power data centers and enable autonomous driving and cloud computing, among other functions.\nAlphabet has exposure to deep learning through a number of its businesses, including its autonomous vehicle start-up, Waymo. It also owns DeepMind, a deep learning platform that can diagnose eye diseases, predict the shapes of proteins, and accelerate the scientific discovery process.\nRelated investing topics\nA growth business\nAI is a growth business\nAccording to International Data Corporation, the global artificial intelligence market is expected to grow from $235 billion in 2024 to more than $631 billion in 2028. While the AI market is already large and still growing quickly, plenty of companies can profit from AI. Although picking stocks in a growth industry comes with a lot of uncertainty, these top AI stocks are all worth considering.\nFAQ\nArtificial intelligence stocks: FAQ\nWhat is the best AI stock to buy?\nArtificial intelligence is a fast-moving technology, and AI stocks will likely be volatile as the sector evolves. AI stocks that have attracted the most attention include Nvidia, Microsoft, and Alphabet, but finding the best stock to buy is also a matter of price and valuation, which changes quickly.\nIs it good to buy Nvidia stock?\nNvidia has jumped into the lead among semiconductor companies in making AI chips and accelerators, and it has the competitive advantages to help it stay there. The semiconductor sector can also be highly cyclical, and pricing can change rapidly.\nAdditionally, there's the potential for unexpected surprises, such as the DeepSeek launch, which sent AI stocks like Nvidia plunging. If Nvidia can maintain its lead in AI chips, the stock should continue to be a winner, but it will likely be volatile since the AI landscape is still developing.\nWhat is the biggest AI company?\nCurrently, the biggest company that has made AI central to its business model is Nvidia, with a market cap that has soared past $4 trillion. The tech giant is at the center of the AI revolution, with components that are fueling AI applications and in high demand by major cloud infrastructure companies and others.\nIs AI good for investing?\nArtificial intelligence is likely to shake up the economy and the business world, creating opportunities in the stock market. Whether AI is good for investing will depend on the company, but there will be winners from the new technology.\nWhat company is No. 1 in AI?\nCurrently, Nvidia is broadly considered the leader in AI technology. The company has a monopoly-like market share in the data center GPU market, and its revenue has more than tripled since ChatGPT launched. Nvidia isn't guaranteed to remain the leader, though. Competition is on the way, and new technologies can change quickly.\nWill AI start-ups challenge tech giants?\nTech giants aren't feeling a significant threat from start-ups yet, but there are some signs that competition is on the rise. Alphabet stock, for example, fell when Apple said it was considering making AI search engines available on Safari, directly competing with Google.\nThe tensions between OpenAI and Microsoft also show that start-ups could begin to pose more of a threat to the \"Magnificent Seven\" stocks, though they are unlikely to derail their growth."
    },
    {
      "url": "https://www.fool.com/terms/s/what-is-a-sell-side-analyst/",
      "text": "There are two types of Wall Street analysts who research stocks and provide educated opinions on them. They are known as buy-side and sell-side analysts, and many investors don't know the difference (or even that there is one).\nIn this article, we're going to dive into what sell-side analysts are, what they do, and why they matter to investors like you and me.\nWhat is a sell-side analyst?\nWhat is a sell-side analyst?\nA sell-side analyst is an investment analyst whose job is to follow a list of companies, conduct research, and provide reports to their firm's clients on a regular basis. They might analyze competition, conduct fundamental analysis, or examine industry trends.\nThe goal of a sell-side analyst is to produce a research report, estimate their company's financial results, and determine whether the stock is a good one for clients. They often come up with price targets that can also be useful.\nWhen you see stock analysts on the news, or hear that \"Analyst XYZ raised their price target on[company],\" these are usually sell-side analysts. Sell-side analysts are employed by investment banks and brokerages -- places that sell financial services to clients.\nThis is in contrast to buy-side analysts, who work for mutual funds, hedge funds, and other firms that manage money and therefore buy investments.\nWhy they are important\nWhy are sell-side analysts important in investing?\nYou may have heard commentators on the financial news say things like \"analysts are projecting $1.00 in earnings per share from Bank of America.\" Analyst estimates are a product of sell-side analysts that follow a company. Earnings and revenue (and other metric) estimates from several sell-side analysts who cover the same stock are averaged to come up with a number known as the consensus estimate.\nAnalysts can also move stocks based on their opinions. And this comes in a few forms. Specifically:\n- If an analyst increases or decreases their price target on a stock, that stock can move higher or lower in reaction to the new target.\n- Analysts often assign ratings to the stocks they cover to convey their overall opinion. For example, many sell-side analysts use the traditional \"buy, sell, hold\" designations, while others add extreme categories like \"strong buy\" or \"strong sell\" to convey when they have a particularly high level of conviction. If a rating is increased, you might hear that an analyst \"upgraded\" a stock, and it can often move higher. Conversely, if a stock gets \"downgraded,\" especially by a closely followed analyst, it can cause the share price to take a hit.\n- If a stock misses the consensus estimate of analysts when it reports quarterly earnings, it can be a negative catalyst. On the other hand, if it reports earnings that exceed the consensus, it can cause a stock to move higher.\nHow investors benefit\nHow can investors benefit from sell-side analysts?\nIt's generally not a good idea to buy, sell, or short a stock just because of a sell-side analyst's opinion. However, sell-side analysis can be a great tool that investors can use to read different opinions on a stock, and to find points of view they haven't considered. Many brokers offer third-party research reports to their clients, and these are examples of sell-side analysis that can be extremely useful in finding attractively priced stocks to invest in.\nRelated investing topics\nReal-world examples\nSell-side analysts in the real world\nSell-side analysts provide some valuable functions in the real world. For one thing, their research is often used by investors of all experience levels and financial means. It is also often used by buy-side analysts to help make investment decisions for their firms.\nSell-side analysts often plan a big role in merger and acquisition (M&A) deals since they conduct unbiased assessments of a target company on behalf of another company interested in acquiring them. They can also help analyze the industry, as well as provide valuable insights on the competition."
    }
  ],
  "argos_summary": "Nvidia is set to report a strong Q2 earnings beat, with analysts forecasting a 48.5% YoY earnings growth and revenue near $46 billion, driven by AI chip demand. However, U.S. export restrictions on its H20 GPU to China could cost the company about $8 billion in foregone revenue and a 15% revenue cut to the U.S. government, raising concerns about China‑related revenue guidance and potential tax liabilities. Despite these headwinds, most analysts maintain a buy/overweight stance, citing robust Blackwell platform ramp‑up and a projected $215 price target from KeyBanc, while Deutsche Bank keeps a hold rating with a $155 target. The article also contextualizes Nvidia’s valuation—55× trailing earnings and 59× free cash flow—against expected 30% annual growth, suggesting the stock may be overvalued unless a post‑earnings dip occurs.",
  "argos_id": "6XLJB7SWQ"
}