{
  "url": "https://www.foxnews.com/sports/patriots-coach-mike-vrabel-seeks-out-rats-after-leaked-injury-report-well-figure-out",
  "authorsByline": "Paulina Dedaj",
  "articleId": "30cedd62276a4524860de367983349d3",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/patriots-mike-vrabel-001.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:44:05-04:00",
  "addDate": "2025-08-23T17:52:19.232164+00:00",
  "refreshDate": "2025-08-23T17:52:19.232167+00:00",
  "score": 1.0,
  "title": "Patriots coach Mike Vrabel seeks out 'rats' after leaked injury report: 'We’ll figure that out'",
  "description": "New England Patriots coach Mike Vrabel won't rest until he finds the \"rats\" that leaked information about Ja'Lynn Polk reportedly needing season-ending shoulder surgery.",
  "content": "It’s hunting season for the and head coach Mike Vrabel is on the lookout for \"rats.\"\n\nSpeaking to the media Thursday, Vrabel was asked about reports that second-year receiver Ja'Lynn Polk would miss the entire season with a shoulder injury that requires surgery.\n\nVrabel initially declined to add anything to the rumors, before taking a swipe at the media and their \"sources.\"\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\n\"No, other than I’d like to find out where some of these come from. You know, some of these rats around here. So, we’ll figure that out.\"\n\nPolk, a second-round pick in 2024, was injured during the Patriots' preseason opener when he was tackled on a short run by defensive back Noah Igbinoghene, ESPN reported.\n\nPolk left the game bracing his right arm, and has been sidelined since.\n\nNFL insider Jordan Schultz that after seeing multiple specialists, it was determined that Polk would have to undergo surgery and was expected to miss the entire 2025 season.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSources that the length of Polk’s absence would be determined after surgery.",
  "medium": "Article",
  "links": [
    "https://twitter.com/FoxNewsSports_",
    "https://www.foxnews.com/category/sports/nfl/new-england-patriots",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/video/6360647968112",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.espn.com/nfl/story/_/id/46042812/source-patriots-wr-jalynn-polk-undergo-shoulder-surgery",
    "https://www.foxnews.com/sports/patriots-coach-mike-vrabel-clashes-media-over-stefon-diggs-uncertain-season-opener-status",
    "https://www.foxnews.com/category/sports/nfl/washington-commanders",
    "https://www.foxnews.com/sports",
    "https://x.com/Schultz_Report/status/1958582419008770541",
    "https://www.foxnews.com/sports/patriots-mike-vrabel-calls-out-abuse-handicap-parking-starbucks-lot-slash-tires"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Patriots coach Mike Vrabel",
      "weight": 0.11397308
    },
    {
      "name": "head coach Mike Vrabel",
      "weight": 0.11057736
    },
    {
      "name": "Mike Vrabel",
      "weight": 0.104907826
    },
    {
      "name": "JaLynn Polk",
      "weight": 0.10217858
    },
    {
      "name": "Polk",
      "weight": 0.09602762
    },
    {
      "name": "leaked injury report",
      "weight": 0.090470664
    },
    {
      "name": "defensive back Noah Igbinoghene",
      "weight": 0.09011222
    },
    {
      "name": "Vrabel",
      "weight": 0.08940233
    },
    {
      "name": "hunting season",
      "weight": 0.081237726
    },
    {
      "name": "NFL insider Jordan Schultz",
      "weight": 0.08082453
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.98388671875
    },
    {
      "name": "/News/Sports News",
      "score": 0.98095703125
    }
  ],
  "sentiment": {
    "positive": 0.057361305,
    "negative": 0.6753224,
    "neutral": 0.26731625
  },
  "summary": "The New England Patriots' head coach, Mike Vrabel, has responded to reports that second-year receiver Ja'Lynn Polk will miss the entire season due to a shoulder injury that requires surgery. Vrab responded to the rumors, stating that he would investigate the source of these reports and will work with the team to determine the length of Polk's absence.",
  "shortSummary": "New England Patriots coach Mike Vrabel is hunting for \"rat\" amid reports Ja'Lynn Polk will miss the season due to a shoulder injury.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "87ae16f3c8674f7f9e31f2785b44b8f2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.espn.com/nfl/story/_/id/46042812/source-patriots-wr-jalynn-polk-undergo-shoulder-surgery",
      "text": "EAST RUTHERFORD, N.J. -- New England Patriots wide receiver Ja'Lynn Polk, the 2024 second-round pick who is hoping to rebound from a challenging rookie season in which he was limited to 12 receptions for 87 yards, will undergo shoulder surgery that could threaten his 2025 season, a source confirmed to ESPN.\nHow long the injury ultimately sidelines Polk, and if he could potentially return at some point later in the season, will be contingent on what doctors find in surgery, a source said.\nThe injury occurred in the Patriots' preseason opener Aug. 8 when Polk was tackled on a 1-yard run around left end by Washington Commanders defensive back Noah Igbinoghene and landed on his right side. Polk immediately came out of the game, holding his right arm, and hasn't practiced since.\nThe Patriots selected Polk 37th last season, having traded down from No. 34 with the Los Angeles Chargers, who selected receiver Ladd McConkey -- an exchange that has dramatically favored the Chargers after McConkey totaled 82 receptions for 1,149 yards and seven touchdowns.\nUnder former coach Jerod Mayo and former offensive coordinator Alex Van Pelt, the 6-foot-1, 203-pound Polk appeared in 15 games (seven starts) last season, totaling 45% of the offensive snaps, before being placed on injured reserve in the final week of the regular season due to a shoulder injury.\nPolk was eyeing a fresh start under the new regime of coach Mike Vrabel and offensive coordinator Josh McDaniels, but even before the injury he faced an uphill climb to secure a roster spot behind Stefon Diggs, Kayshon Boutte, DeMario Douglas, Mack Hollins and 2025 third-round pick Kyle Williams.\nDespite passing his initial physical upon reporting to training camp, Polk had been held out of the first four practices this summer after experiencing muscle tightness, according to a source.\nUpon his return, he worked mostly with the reserves leading up to the injury in the preseason opener.\nNFL reporter Jordan Schultz first reported Polk's status."
    },
    {
      "url": "https://www.foxnews.com/sports/patriots-mike-vrabel-calls-out-abuse-handicap-parking-starbucks-lot-slash-tires",
      "text": "New England Patriots head coach Mike Vrabel is not afraid of confrontation — especially in a Starbucks parking lot.\nThe 50-year-old NFL coach explained in a recent podcast appearance that he tends to confront people that use accessible parking spaces when they don’t have a permit.\n\"The people at Starbucks that park in a handicap spot and go in there and try to get their order from the mobile order … (who are) by no means handicapped,\" Vrabel said during an appearance on The Athletic’s \"Scoop City.\"\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nVrabel said he looks for a parking permit that would allow someone to park in the accessible space, and if he doesn’t see one, he waits for the person to come out and approaches them.\n\"When I didn’t have a job, I had nothing else to do,\" Vrabel said. \"I could sit here for 15 minutes, wait for this person to come out and actually see if they’re handicapped.\"\n\"I say things like, ‘Why did you park here?’ One person would be like, ‘I’m with DoorDash.’ I’m like, ‘I don’t care. That’s unacceptable,’\" Vrabel said. \"And there’s the mom that’s going to yoga and she’s rushing because she’s late and I’m like, ‘This is ridiculous.’\"\nNFL STAR CHOOSES SIDE IN PEYTON MANNING VS TOM BRADY DEBATE\nThe former Tennessee Titans coach admitted he \"accosts\" people and even wishes he could slash their tires.\n\"I’d slash their tires, that’s how much it bothers me,\" he said.\nThe Athletic’s Dianna Russini suggested using a boot as punishment, and Vrabel was all for it.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I would boot their car. Like a mobile boot that said, ‘I parked in a handicap spot, and I’m not handicapped,’\" Vrabel said.\nWhen Vrabel isn’t venting about bad parking, he’s focused on turning around the Patriots in his first season as head coach. New England went 4-13 last season and finished last in the AFC East.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl/washington-commanders",
      "text": "The Washington Commanders are a professional American football team that compete in the National Football League (NFL) as a member of the National Football Conference (NFC) East division.\nFormerly known as the Washington Redskins, the Redskins name and logo was viewed as controversial and was retired in 2020. The franchise played under the name the Washington Football Team for two seasons before rebranding as the Commanders in 2022.\nThe franchise earned three Super Bowls in 1982, 1987, and 1991 and had the NFL’s first marching band, radio network, and first fully televised season.\nQuarterback Jayden Daniels, No.2 overall pick in the 2024 NFL Draft, 2024 NFL Offensive Rookie of the Year, Pro Bowler, and Heisman Trophy winner, has headlined the Commanders’ offense."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/sports/patriots-coach-mike-vrabel-clashes-media-over-stefon-diggs-uncertain-season-opener-status",
      "text": "Mike Vrabel, who played linebacker for the New England Patriots for eight seasons and won three Super Bowls with the team, is tasked with turning the once proud franchise around.\nBut the first-year Patriots head coach's attention recently turned to a reporter who raised a question about star receiver Stefon Diggs' availability for the team's season opener. Vrabel took issue with the line of questioning.\n\"Did you really believe that, Phil?\" Vrabel responded when asked about Diggs. \"You’re a smart guy. I don’t know where you went to school. It wasn’t Ohio State. Do you really believe that, Phil, or are you just trying to bait me into something?\"\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nDiggs appeared in eight games with the Houston Texans last season and tore an ACL during a game in October. He recently received medical clearance to return to practice.\nHowever, the four-time Pro Bowler was not in uniform for Saturday's preseason game against the Minnesota Vikings. He also sat out last week's preseason opener due to what was described as a \"coach's decision.\"\nVrabel said the team is taking a wait-and-see approach for Week 1.\n\"I don’t know the context of which he said it. You’d have to help me. He’s been here almost every day. I’m excited where he’s at, and we’ll see when Week 1 comes,\" Vrabel said.\nDiggs was noncommittal when asked earlier this week if he would suit up Sept. 7.\n\"We’ll see. Everybody’s excited, man. I’m just taking it day by day. I feel great,\" Diggs said during a sitdown on the \"Scoop City\" podcast.\nDiggs suggested the Patriots coaching staff was not optimistic about the prospect of him taking the field when the team opens its season against the Las Vegas Raiders.\n\"I mean, I'm pushing the needle always,\" Diggs said. \"I'm always doing more than less, and we’ll see about Week 1. I don’t know how I feel about it. We’ll see. The coaches aren’t too excited. I’m not too excited. I’m just trying to take it day by day, so we’ll see. We just don’t know where it’s gonna go.\"\nCLICK HERE TO GET THE FOX NEWS APP\nDiggs agreed to a three-year deal with the Patriots in March. He recorded at least 1,000 receiving yards in six consecutive seasons leading up to his injury-shortened run with the Texans.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl/new-england-patriots",
      "text": "New England Patriots: What to know about the NFL team\nThe New England Patriots are one of the most successful teams in the NFL, tied with the Pittsburgh Steelers for the most Super Bowl wins in history, with six. All six of the Patriots' Super Bowl victories were achieved with Bill Belichick as the head coach and Tom Brady as the quarterback.\nThe Patriots were one of the original teams in the American Football League (AFL), founded as the Boston Patriots in 1959. They became the New England Patriots in 1971. The team's home base is in Foxborough, Massachusetts, where they play their home games at Gillette Stadium.\nThe Patriots' dynasty lasted many years, with Belichick and Brady leading the team to become the one to beat. The team holds the record for the most Super Bowl appearances, with 11. Since Brady left for the Tampa Bay Buccaneers\nand retired shortly thereafter, the Patriots have been working to rebuild.\nThe team has been owned by Robert Kraft since 1994. They are coached by former Patriot player Mike Vrabel, and the young Drake Maye is the team's quarterback."
    }
  ],
  "argos_summary": "New England Patriots head coach Mike Vrabel dismissed rumors that rookie receiver Ja'Lynn Polk would miss the entire 2025 season, calling the sources \"rats\" and saying he would investigate them. Polk suffered a shoulder injury in the preseason opener, will undergo surgery, and is expected to miss the rest of the 2025 campaign depending on the outcome. Vrabel also used the opportunity to criticize the media’s reporting style while the Patriots continue to rebuild under his leadership.",
  "argos_id": "70GKWU213"
}