{
  "url": "https://www.yahoo.com/news/articles/russia-claims-more-ukraine-land-195604660.html?_guc_consent_skip=1755979471",
  "authorsByline": "AFP",
  "articleId": "9980e2a1982c46829f8c9bda4396ddd9",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/afp.com/c36c5a7b655c456c25a13e3c46342403",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T19:56:04+00:00",
  "addDate": "2025-08-23T20:07:03.960844+00:00",
  "refreshDate": "2025-08-23T20:07:03.960845+00:00",
  "score": 1.0,
  "title": "Russia claims more Ukraine land as hopes for summit fade",
  "description": "Russia on Saturday said its forces had taken two villages in eastern Ukraine's Donetsk region, increasing the military pressure as world leaders struggle to broker an end to the conflict.On Saturday, Ukrainian military officials said its forces had stopped a Russian advance and recaptured the village of Zeleny Gai in the Donetsk region in a post to Telegram.",
  "content": "Russia on Saturday said its forces had taken two villages in eastern Ukraine's Donetsk region, increasing the military pressure as world leaders struggle to broker an end to the conflict.\n\nSouth Africa added its voice to those calling for a summit between Ukraine and Russia.\n\nRussian forces are slowly advancing in the embattled eastern region of Donetsk, grinding closer to Kyiv's key defensive line in costly metre-for-metre battles.\n\nMoscow's defence ministry said on Telegram that its forces had captured the villages of Sredneye and Kleban-Byk.\n\nThe taking of Kleban-Byk would mark a further advance towards Kostiantynivka -- a key fortified town on the road to Kramatorsk, where a major Ukrainian logistics base is located.\n\nOn Friday, Russia said its troops had captured three villages in the Donetsk region it claimed to have annexed in September 2022.\n\nOn Saturday, Ukrainian military officials said its forces had stopped a Russian advance and recaptured the village of Zeleny Gai in the Donetsk region in a post to Telegram.\n\nIn July, Russia claimed the capture of the village, on the border with Dnipropetrovsk, adding that it was an important stronghold used by Ukraine to protect the area.\n\nThe latest Russian advances come as hopes dim for a summit between Russian and Ukrainian presidents -- a solution championed by US President Donald Trump as part of his efforts to end the conflict.\n\nSouth African President Cyril Ramaphosa on Saturday added his voice to calls for a Russia-Ukraine summit during a telephone conversation with Ukrainian President Volodymyr Zelensky.\n\n\"President Ramaphosa stressed the urgency of holding bilateral and trilateral meetings between the leaders of Russia and Ukraine and the United States as key to signal a firm commitment to ending the war,\" said a statement from his office.\n\nRamaphosa, who currently chairs the G20, also spoke with French President Emmanuel Macron and Finnish President Alexander Stubb, the statement added. He will speak with other European leaders in the coming weeks.\n\nRamaphosa spoke on Monday with Vladimir Putin, whom he described in October at the BRICS summit as a \"dear ally\" and a \"valued friend\".\n\nHowever, for the first time since Russia's attack on Ukraine, South Africa earlier this year backed a UN resolution declaring that Russia had launched a full-scale invasion of Ukraine.\n\nZelensky said he had told Ramaphosa he was ready for any kind of meeting with Putin.\n\n\"However, we see that Moscow is once again trying to drag everything out even further,\" he said on X.\n\nHe called on the Global South to send \"relevant signals and (push) Russia toward peace\".\n\nOn Friday, Russian Foreign Minister Sergei Lavrov said \"no meeting\" was planned as Trump's mediation efforts appeared to stall, while Zelensky accused Russia of trying to prolong the offensive.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Russia",
      "weight": 0.08634299
    },
    {
      "name": "President Ramaphosa",
      "weight": 0.08577625
    },
    {
      "name": "Ukrainian President Volodymyr Zelensky",
      "weight": 0.084317505
    },
    {
      "name": "Russian forces",
      "weight": 0.080028825
    },
    {
      "name": "South African President Cyril Ramaphosa",
      "weight": 0.07803753
    },
    {
      "name": "more Ukraine land",
      "weight": 0.07687947
    },
    {
      "name": "Ukraine",
      "weight": 0.0766451
    },
    {
      "name": "US President Donald Trump",
      "weight": 0.07566429
    },
    {
      "name": "French President Emmanuel Macron",
      "weight": 0.07140814
    },
    {
      "name": "Finnish President Alexander Stubb",
      "weight": 0.07094708
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9892578125
    },
    {
      "name": "/News/World News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.97802734375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.86328125
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.8203125
    },
    {
      "name": "/News/Other",
      "score": 0.544921875
    }
  ],
  "sentiment": {
    "positive": 0.1450704,
    "negative": 0.54137576,
    "neutral": 0.31355384
  },
  "summary": "Russia has claimed that its forces have taken two villages in eastern Ukraine's Donetsk region, increasing pressure on world leaders to resolve the conflict. South African President Cyril Ramaphosa has called for a summit between the two countries, calling for a firm commitment to ending the war. This comes as hopes for a meeting between Russian and Ukrainian presidents are waning. Russia's defence ministry announced that its troops had captured three villages in the Donetsk region it claimed to have annexed in 2022. South Africa has backed a UN resolution declaring Russia's invasion of Ukraine, calling it a \"full-scale invasion\".",
  "shortSummary": "Russia's forces have captured two more villages in eastern Ukraine, increasing pressure on global leaders to broker a peace deal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e6095b99934647a2945673de28132b21",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Russia announced the capture of the villages of Sredneye and Kleban-Byk in eastern Ukraine’s Donetsk region, marking a further push toward Kostiantynivka and the logistics hub at Kramatorsk. Ukrainian forces countered by recapturing Zeleny Gai, while Russia had earlier claimed three villages. Amid these developments, South African President Cyril Ramaphosa urged a Russia‑Ukraine summit, joining calls from other world leaders, but Russian officials denied any meeting plans and the United States’ Trump‑led mediation efforts appear stalled. The conflict continues to intensify as global leaders seek diplomatic solutions.",
  "argos_id": "7YQN9WX3K"
}