{
  "url": "https://www.engadget.com/gaming/assassins-creed-mirage-will-get-fresh-content-later-this-year-and-itll-be-completely-free-163728673.html",
  "authorsByline": "Jackson Chen",
  "articleId": "9d99ef739d6044bd865fb9c9310dd5d0",
  "source": {
    "domain": "engadget.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/boRoF40NjjGHJ.pJ77iGXw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2025-08/ce9f7d70-803b-11f0-afb3-e3b7efb6b51c",
  "country": "jp",
  "language": "en",
  "pubDate": "2025-08-23T16:37:28+00:00",
  "addDate": "2025-08-23T16:43:30.915556+00:00",
  "refreshDate": "2025-08-23T16:43:30.915557+00:00",
  "score": 1.0,
  "title": "Assassin's Creed Mirage will get fresh content later this year and it'll be completely free",
  "description": "Ubisoft is bringing new content and gameplay improvements to Assassin's Creed Mirage for free.",
  "content": "The Assassin's Creed fanbase may be waiting for the first DLC for Assassin's Creed Shadows, but Ubisoft instead confirmed new content for its previous title, Assassin's Creed Mirage. The studio announced on the official Assassin's Creed X account that there will be a new story chapter and missions for protagonist Basim, who will venture into ninth-century alUla. More importantly, the DLC will be free.\n\nAccording to the post, Ubisoft will bring gameplay improvements to both the new content and the base game, which revisits the franchise's roots that emphasize open-world design and stealth combat. The announcement from Ubisoft comes after a Les Echos report earlier in the year said that new content for Assassin's Creed Mirage was created thanks to a partnership between Ubisoft and Savvy Games Group, a gaming and esports company that has backing from the Saudi Arabian government.\n\nThe upcoming DLC sheds more light on what Stephane Boudon, one of the Ubisoft developers for Assassin's Creed Mirage, teased during a Reddit AMA following the game's release in October 2023. In the thread, Boudon said the game was designed \"as a standalone experience without any DLC plan,\" only adding that the team had \"ideas of how we could extend the story of Basim.\" Ubisoft didn't specify exactly when the DLC would drop, only revealing that it would be \"later this year.\" In the meantime, Microsoft updated its included games for the Xbox Game Pass for August, which include Assassin's Creed Mirage.",
  "medium": "Article",
  "links": [
    "https://www.engadget.com/assassins-creed-mirage-review-a-warm-bloody-hug-from-an-old-friend-181918323.html",
    "https://www.engadget.com/assassins-creed-mirage-will-arrive-on-october-12-205552847.html",
    "https://www.reddit.com/r/assassinscreed/comments/1cbvteq/comment/l11etz0/",
    "https://www.engadget.com/gaming/xbox/xbox-game-pass-additions-for-august-include-assassins-creed-mirage-144428943.html",
    "https://x.com/assassinscreed/status/1959169826619875735",
    "https://www.lesechos.fr/tech-medias/hightech/letonnant-deal-dubisoft-avec-larabie-saoudite-2144626"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new content",
      "weight": 0.10412103
    },
    {
      "name": "Ubisoft",
      "weight": 0.091396764
    },
    {
      "name": "fresh content",
      "weight": 0.08223561
    },
    {
      "name": "Assassins Creed Mirage",
      "weight": 0.08149129
    },
    {
      "name": "Assassins Creed X",
      "weight": 0.07501166
    },
    {
      "name": "Assassins Creed Shadows",
      "weight": 0.074877925
    },
    {
      "name": "protagonist Basim",
      "weight": 0.070896715
    },
    {
      "name": "Assassins Creed",
      "weight": 0.070064105
    },
    {
      "name": "Savvy Games Group",
      "weight": 0.06982181
    },
    {
      "name": "Stephane Boudon",
      "weight": 0.06809353
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.97265625
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.8271484375
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.62841796875
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.59521484375
    },
    {
      "name": "/Games/Computer & Video Games/Shooter Games",
      "score": 0.381591796875
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.3525390625
    }
  ],
  "sentiment": {
    "positive": 0.42753056,
    "negative": 0.06028247,
    "neutral": 0.512187
  },
  "summary": "The announcement comes as Ubisoft confirms that new content for its previous title, Assassin's Creed Mirage, will be completely free. The new content will include a new chapter and missions for the protagonist Basim, who will explore the ninth-century alUla. The announcement was made through a partnership between Ubisoft and Savvy Games Group, a gaming and esports company backed by the Saudi Arabian government. The gameplay improvements will be made to both the new content and the base game.",
  "shortSummary": "Ubogracht announced free DLC for Assassin's Creed Mirage will include new story chapters, missions, and gameplay improvements, including in-depth combatability and stealth combat.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "89686d190bd54f3082313e70c57b33dd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.engadget.com/gaming/xbox/xbox-game-pass-additions-for-august-include-assassins-creed-mirage-144428943.html",
      "text": "Xbox Game Pass additions for August include Assassin’s Creed Mirage\nThe Standard tier is getting a bunch more games too.\nMicrosoft has revealed the first batch of Xbox Game Pass additions for August, and there are several tasty options in store over the next couple of weeks. The first one lands today on Game Pass Ultimate, PC Game Pass and Game Pass Standard in the form of Rain World, a difficult survival platform game. In case that’s not your tempo, though, you won’t have to wait long for other things to play.\nOn August 7, Assassin’s Creed Mirage will hit Game Pass Ultimate and PC Game Pass. I enjoyed this tighter, more focused take on the Assassin’s Creed formula quite a bit, especially considering how bloated these games have become in recent years (that said, AC Shadows is one of my favorite games of this year so far). Mirage is worth checking out if you dig the series but haven’t taken a leap of faith with that installment yet.\nSeveral titles are joining the Game Pass Standard tier in the first two weeks of August, including Citizen Sleeper 2 — an acclaimed RPG that debuted earlier this year — on Wednesday. Survival shooter Aliens: Fireteam Elite returns to Game Pass on August 12 as well, while roguelike kingdom builder 9 Kings arrives in game preview on Game Pass Ultimate and PC Game Pass, but only for PC for the time being.\nHere's the full breakdown of the first wave of August Game Pass additions, including the tiers on which they'll be available:\nToday\nRain World (Cloud, Console and PC) — Game Pass Ultimate, PC Game Pass, Game Pass Standard\nAugust 6\nCitizen Sleeper 2: Starward Vector (Xbox Series X/S) — Game Pass Standard, already on Game Pass Ultimate and PC Game Pass\nLonely Mountains: Snow Riders (Xbox Series X/S) — Game Pass Standard, already on Game Pass Ultimate and PC Game Pass\nMechWarrior 5: Clans (Xbox Series X/S) — Game Pass Standard, already on Game Pass Ultimate and PC Game Pass\nOrcs Must Die! Deathtrap (Xbox Series X/S) — Game Pass Standard, already on Game Pass Ultimate and PC Game Pass\nAugust 7\nAssassin’s Creed Mirage (Cloud, Console and PC) — Game Pass Ultimate, PC Game Pass\nEA Sports Madden NFL 26: 10-hour early access trial (Cloud, Console and PC) — Game Pass Ultimate\nAugust 12\nAliens: Fireteam Elite (Cloud, Console and PC) — Game Pass Ultimate, PC Game Pass, Game Pass Standard\nAugust 14\n9 Kings (Game Preview) (PC) — Game Pass Ultimate, PC Game Pass\nAlong with the new additions, there are three titles leaving Game Pass on August 15. Those are Anthem (Console and PC) via EA Play, Farming Simulator 22 (Cloud, Console and PC) and Persona 3 Reload (Cloud, Console and PC). The beleaguered Anthem is shutting down for good this January in any case, and as it's an online-only game, there won't be any way to play it after that time — unless fans find a way to get community servers up and running."
    },
    {
      "url": "https://www.engadget.com/assassins-creed-mirage-review-a-warm-bloody-hug-from-an-old-friend-181918323.html",
      "text": "Assassin's Creed Mirage review: A warm, bloody hug from an old friend\nWe are literally so back.\nEditor's note: This article contains mild spoilers for Assassin's Creed Mirage.\nThe deeper I got into Assassin’s Creed Mirage, the more a sense of warm nostalgia washed over me. It felt like a cozy hug from an old friend. A comforting, bloody embrace.\nThe latest entry in Ubisoft's long-running open-world adventure franchise takes the series back to its roots. Mirage mostly forgoes the RPG approach Ubisoft adopted in the last three main games: Assassin's Creed Origins, Odyssey and Valhalla. I'd only played the latter of those and it didn't click for me, largely because of Ubisoft's propensity to ovestuff its games and partially because it strayed so far away from the earlier titles.\nSome of Valhalla's DNA carries over to Mirage, which shouldn't be surprising as the latest game was originally envisioned as an expansion to the last 100-plus-hour epic. There is some loot to hunt for in the form of swords, daggers and outfits that give protagonist Basim some small upgrades, such as reducing the level of notoriety he gains while carrying out illegal actions or passively regenerating some health. These items are upgradable, as are your tools. One neat, if unrealistic perk, makes an enemy disintegrate after Basim eliminates them with a throwing knife. So, you can tweak your build to fit your playstyle to a certain degree.\nThere are skill trees too, but rather than unlocking things like a slight increase to the damage Basim deals, the abilities here are genuinely impactful. Pinpointing opponents and important items from further away, reducing fall damage and a chain assassination ability are all super useful tools for Basim to have in his belt.\nUbisoft has pulled back quite a bit on the RPG elements of the previous few games. You won’t be using bows, shields or two-handed weapons as you might in Valhalla, for instance. Still, there's just enough customization for folks who want to optimize (or min/max) Basim for the way they like to play.\n\"Just enough\" is a thought I kept coming back to in the 17 hours it took me to beat the main story. Mirage is just the right length. There are just enough collectibles and side-quests to make the world feel rich but not overwhelming. There's just enough to the story, which is fairly by-the-numbers though gets more intriguing in the last couple of hours. There's just enough variety to the enemies.\nThere are only a few enemy types, and I love that Mirage doesn't go down the well-worn and nonsensical path of arbitrarily making them stronger based on their geographical location — an aspect of Dead Island 2 I greatly disliked. Although Basim largely has to make do with his sword and dagger (and, of course, the Hidden Blade), enemies have a variety of weapons. A trio of goons will pose a different threat when they have spears instead of swords. You'll have to navigate that melange of weaponry carefully, especially so when enemies surround you. Putting an onus on that and the level design for encounters helps make Mirage feel like more of a refreshing throwback.\nIn the main missions, I only encountered one traditional boss fight toward the end of the story. Practically every other enemy was susceptible to a single-button slaying. I absolutely made the most of that by sneaking up on assassination targets or distracting them with noise-making devices. The game actually discourages open combat, anyway. You won't gain experience points by killing tons of enemies. Staying stealthy is usually the way to go — unless you're a completionist, since there's a trophy/achievement that requires you to stay in open combat for 10 minutes. Thankfully, the game makes it fairly easy for you to slink around.\nContrary to my first impressions, the guards of Baghdad aren't all that smart. They'll often be briefly puzzled when they encounter the dead body of a colleague they were chatting with seconds earlier before walking away. They'll quickly give up on a hunt for Basim. They'll see a cohort being yanked around a corner and think nothing of it. That breaks the immersion a bit, but it does make it easier to mess with these idiots.\nI took some delight in tormenting my opponents, even if that may not match up to the code of conduct the assassins live by. One larger grunt was trapped in a room alone to guard a chest. I entered, used a smoke bomb to distract him, opened the chest and left, blocking the path behind me. I then made my way around to a gate that kept the guard locked in from the other side and spent a few minutes whistling at him, for no reason other than to annoy him and amuse myself.\nThe real star of the show is the version of ninth-century Baghdad Ubisoft has built. It feels rich and lived-in, with bystanders simply going about their day as a hooded figure darts by them to climb up the side of a building. Unfortunately, that level of detail wasn't reflected in the character models. Main characters and NPCs alike looked far less refined than their surroundings.\nSome Arab critics and reviewers appreciated how Ubisoft represented Baghdad and Muslim culture in the game, and that's a positive sign. In that sense, Mirage seems like a prime candidate for the historical educational modes that Ubisoft has added to recent Assassin's Creed games.\nI can't personally speak to the authenticity of the environment Ubisoft has created. The same goes for the Arabic used in the game, but the developers at least strove to avoid anachronisms. I spent an hour or so playing in Arabic with English subtitles and found it a compelling way to experience the game, though I missed hearing the velvet-voiced Shohreh Aghdashloo's portrayal of Basim's mentor Roshan too much.\nAghdashloo's performance is one of several highlights of a solid game. Developer Ubisoft Bordeaux has achieved what it set out to do in bringing back the format of early Assassin's Creed titles while adding some modern bells and whistles (such as a gameplay option to avoid the turgid pickpocketing minigame) and avoiding some of the old trappings.\nNo part of the game that I've encountered is set in the modern day. That's a wise move, since those parts of previous games pulled me out of the main experience and into some tedious sections that sought to serve a larger story. I didn't hear the word \"animus\" once this time around. Mirage does tie back into the broader Assassin's Creed narrative — Basim makes an appearance in Valhalla, after all — but you won't get sidetracked by Desmond Miles or Layla Hassan. That meant I could spend more of my time roaming the streets and rooftops of this well-crafted city, scouting enemy camps from above and figuring out the best way to approach an assassination mission.\nMirage probably won't be for everyone, including those who appreciated the format of the last three big Assassin's Creed games, but it struck a chord with me. Even though I've wrapped up the main story and have a bunch of other games to play (I'm looking at you, Cocoon and Spider-Man 2), I'll probably spend a little while longer nuzzled up in the comfort of Mirage.\nAssassin's Creed Mirage is out now on PC, PlayStation 4, PlayStation 5, Xbox One and Xbox Series X/S. It's coming to iPhone 15 Pro devices next year."
    },
    {
      "url": "https://www.engadget.com/assassins-creed-mirage-will-arrive-on-october-12-205552847.html",
      "text": "Assassin's Creed Mirage will arrive on October 12\nThe parkour heavy stealth game will be available this fall.\nIf you've been waiting for a game that takes the Assassin's Creed franchise back to its roots, you won't have to wait long: The May PlayStation Showcase just revealed that Assassin's Creed Mirage will release on October 12.\nSet two decades before Assassin's Creed Valhalla, Mirage will put players in the robes of Basim Ibn in the city of Baghdad, 861 CE, and will have a stronger focus on stealth mechanics and parkour-based movement than its predecessor. That makes it look a lot like older games in the series from the trailers we've seen so far, but it hasn't completely abandoned Valhalla's innovations: Basim's pet eagle can scout ahead to spot threats and targets, just like the bird companions in the previous game.\nNaturally, the PlayStation Showcase highlighted the game's release for PS4 and PS5 consoles, but Assassin's Creed Mirage will also be available on Xbox One, Xbox Series X/S, Amazon Luna and PC when it launches later this year."
    }
  ],
  "argos_summary": "Ubisoft announced a free DLC for Assassin’s Creed Mirage featuring a new story chapter and missions set in ninth‑century alUla, with gameplay improvements and a release slated for later this year. The DLC follows a partnership with Savvy Games Group and builds on Mirage’s focus on stealth and open‑world design. Microsoft added Mirage to its Game Pass lineup in August, and the article includes a review that praises the game’s return to classic Assassin’s Creed roots, concise length, and historical setting. Mirage is scheduled for release on October 12 across multiple platforms.",
  "argos_id": "8WJ8ZH5LA"
}