{
  "url": "https://www.nytimes.com/athletic/6564448/2025/08/23/manchester-city-0-tottenham-2-guardiola-frank-trafford-palhinha/",
  "authorsByline": "Jordan Campbell and Elias Burke",
  "articleId": "9c86ac23ee804b9581c46feca95d72d6",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/23085631/PALHINHA-CELE-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:35:01+00:00",
  "addDate": "2025-08-23T13:41:43.377443+00:00",
  "refreshDate": "2025-08-23T13:41:43.377445+00:00",
  "score": 1.0,
  "title": "Manchester City 0 Tottenham 2: Trafford’s howler, Frank’s pressing plan, outstanding Palhinha",
  "description": "Thomas Frank made it two wins out of two as Tottenham head coach with a brilliant away performance - The Athletic analyses the action",
  "content": "Tottenham Hotspur really love their trips to the Etihad Stadium.\n\nHaving won 4-0 there last season under Ange Postecoglou, Thomas Frank’s tactical approach of pressing City high up the pitch worked perfectly this time. Goals from Brennan Johnson and Joao Palhinha did the damage to make it three wins in their last five trips.\n\nCity lost left-back Rayan Ait-Nouri after 23 minutes to an ankle injury, Nathan Ake replacing him. And it got worse for the home team ten minutes before the break when Richarlison beat the tightest of offside calls and Johnson fired beyond James Trafford — the goal given after a VAR check.\n\nThat was nothing compared to what happened in added time in the first period. Trafford had been fortunate when he escaped being penalised after a challenge on Mohammed Kudus but when he attempted a ridiculous pass to Nico Gonzalez in the area it was intercepted by Pape Matar Sarr and Palhinha rammed it home for his first Spurs goal.\n\nRodri returned for City after the break but Spurs were good value to continue Frank’s stunning start at Spurs head coach.\n\nThe Athletic’s Jordan Campbell and Elias Burke analyse the action.\n\nWhat was James Trafford doing?\n\nGuardiola stuck with Trafford after handing him his debut last weekend in the routine win over Wolverhampton Wanderers but he was involved in a calamitous mix-up with Gonzalez to hand Spurs a second goal.\n\nTrafford was put under pressure regularly by Spurs, but in first half added time he panicked. Rather than go long to Haaland, as City had opted to at times, he played a straight pass to Gonzales inside his own penalty area.\n\nSpurs had set the trap, though and Sarr was ready to pounce. He stepped in to intercept and Palinha converted.\n\nAnd for U.S. readers\n\nRuben Dias reacted angrily and Trafford looked to the sky for a moment. It was a tough moment for the 22-year-old in only his second start since returning to the club in a £27 million deal from Burnley.\n\nEderson, who is the subject of interest from Galatasaray, watched on from the bench. It was just over a week ago that Guardiola stated he would start the season as his number one but the speculation has led to the No 1 jersey being up in the air.\n\nTrafford would have hoped to use this window of opportunity to stake his claim for the jersey but this was a costly error that will not have done him any favours.\n\nTottenham’s failed pursuits of Eberechi Eze and Morgan Gibbs-White have left Frank without a natural No 10 in the absence of Dejan Kulusevski and James Maddison, who are out with long-term knee injuries. But, as Spurs proved in the first half, sometimes an aggressive, organised press can be as effective as any playmaker.\n\nFrom the first time Trafford received the ball in open play, it was evident that Frank had directed his players to swarm City’s goalkeeper. The initial demonstration of Spurs’ effective press happened inside the first 10 minutes, with Cristian Romero going man-to-man with Erling Haaland, who had dropped to the edge of the box to receive a pass from City’s defenders.\n\nAs soon as the pass reached the Norway striker, Romero rushed in from behind and won the ball on the edge of the City box, leading to a Spurs free-kick from 20 yards.\n\nThen, with Spurs already 1-0 up through Brennan Johnson, they doubled their lead as Sarr took advantage of a careless pass from Trafford to win the ball in the City box. Palhinha, on his first Premier League start for Spurs, then calmly converted from close range.\n\nFor long periods of last season, Tottenham were arguably the easiest team to counter-attack in the Premier League. Postecoglou tried and failed to find a combination at the base of his midfield to provide the protection he needed to play his attacking style, and Spurs invariably suffered as a result.\n\nIf this performance was anything to go by, Frank has found the answer in Palhinha, who has signed on loan for the season from Bayern Munich.\n\nIn the first half, Frank tasked Palhinha with marking Rayan Cherki out of the game, and the Portugal international thrived under the assignment. By the time Pep Guardiola had taken Cherki off on the 54th minute, he had been dispossessed twice and failed to make a meaningful impact on the game.\n\nMinutes later, it was Palhinha’s tough tackle on Cherki’s replacement, Bernardo Silva, that set Spurs off on a threatening counter-attack that could have put Spurs three in front had Johnson’s touch been better.\n\nPalhinha’s Spurs league debut may be remembered for his goal, but it is his steel and bite in midfield, combined with an underrated ability on the ball, that will make him essential to their success this season.\n\nIt was a common sight in the first half to see Guardiola shaking his head on the touchline as another attempt at building up possession went awry.\n\nCity never looked fully confident under pressure with Rico Lewis and Gonzalez both giving the ball away too often.\n\nGuardiola made two changes from the team that beat Wolves, bringing in Omar Marmoush and Rayan Cherki for Bernardo Silva and Jeremy Doku, but City badly lacked cohesion in the final third.\n\nMarmoush, whose primary position at Eintracht Frankfurt was through the centre, looked awkward at times receiving out wide, while Cherki barely linked with Erling Haaland, if at all.\n\nGuardiola has spoken about playing more direct this season, perhaps an influence of his new assistant Pep Lijnders, but what replaced control was frantic rather than precision.\n\nChanging the profile of attacking players so drastically means City did not have the luxury of consistency but this is what having such a deep squad necessitates.\n\nRotation has been key to his previous title-winning trams but the squad size right now is so big and so diverse in skillset.\n\nIn attempting to keep everyone happy Guardiola has to ensure he does not sacrifice consistency and fluidity.\n\nWhat did Guardiola say?\n\nWe will bring you this after he has spoken at the post-match press conference.\n\nWhat did Frank say?\n\nWe will bring you this after he has spoken at the post-match press conference.\n\nWhat next for City?\n\nWhat next for Spurs?",
  "medium": "Article",
  "links": [
    "https://twitter.com/tntsports?ref_src=twsrc%5Etfw",
    "https://twitter.com/NBCSportsSoccer/status/1959231011952206161?ref_src=twsrc%5Etfw",
    "https://twitter.com/footballontnt/status/1959230109912568135?ref_src=twsrc%5Etfw",
    "https://t.co/HPkufm9Gyn",
    "https://t.co/0WyGTsJMhU",
    "https://twitter.com/discoveryplusUK?ref_src=twsrc%5Etfw"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Spurs",
      "weight": 0.07441619
    },
    {
      "name": "Spurs head coach",
      "weight": 0.07105933
    },
    {
      "name": "first half added time",
      "weight": 0.06838915
    },
    {
      "name": "City",
      "weight": 0.064093806
    },
    {
      "name": "James Trafford",
      "weight": 0.06285626
    },
    {
      "name": "Manchester City",
      "weight": 0.062233534
    },
    {
      "name": "last season",
      "weight": 0.05872517
    },
    {
      "name": "Trafford",
      "weight": 0.057224672
    },
    {
      "name": "Rayan Cherki",
      "weight": 0.05711398
    },
    {
      "name": "Pep Guardiola",
      "weight": 0.05619835
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9853515625
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97607421875
    }
  ],
  "sentiment": {
    "positive": 0.10251532,
    "negative": 0.5469343,
    "neutral": 0.35055038
  },
  "summary": "Tottenham Hotspur defeated Manchester City 2, making it three wins in their last five at the Etihad Stadium. Goals were scored by Brennan Johnson and Joao Palhinha. Thomas Frank's tactical approach of pressing City high up the pitch worked well, with City losing left-back Rayan Ait-Nouri after 23 minutes due to an ankle injury, and Nathan Ake replacing him. James Trafford was criticised for his handling of the ball and a costly mistake in added time. Despite this, the game was marked by an outstanding performance from Palinha, who was instrumental in marking Rayan Cherki out of the game. The loss leaves Manchester City's position in the No 1 jersey under question.",
  "shortSummary": "Tottenham Hotspur defeated Manchester City 2-0 at Etihad Stadium, with goals from Brennan Johnson and Joao Palhinha, despite Trafford's costly error.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d520569aa2d74e72b28eba881cd470d9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Tottenham Hotspur secured a 3-0 victory at the Etihad with goals from Brennan Johnson and Joao Palhinha, underscoring Thomas Frank’s high‑pressing strategy. Manchester City suffered from injuries, tactical missteps, and a lack of cohesion, highlighted by James Trafford’s costly pass and the team's overall disarray. Spurs’ aggressive press and Palhinha’s debut goal demonstrated the effectiveness of their approach, while City struggled with rotation and control. The Athletic’s analysis praised Spurs’ pressing and criticized Guardiola’s adjustments, noting the team's ability to disrupt City’s build‑up play. The match showcased Spurs’ tactical success and City’s challenges in adapting to a more direct style.",
  "argos_id": "98YBYTO77"
}