{
  "url": "https://www.nasdaq.com/articles/oklo-stock-next-nvidia",
  "authorsByline": "The Motley Fool",
  "articleId": "d026c711545f47e8bcf96cdf0a0cfdc4",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T10:45:00+00:00",
  "addDate": "2025-08-23T11:30:12.842113+00:00",
  "refreshDate": "2025-08-23T11:30:12.842115+00:00",
  "score": 1.0,
  "title": "Is Oklo Stock the Next Nvidia?",
  "description": "Key PointsMany of the biggest beneficiaries of the AI revolution so far have been technology stocks.",
  "content": "Key Points\n• None Many of the biggest beneficiaries of the AI revolution so far have been technology stocks.\n• None The energy sector offers an AI-adjacent opportunity due to the sector's heavy power demands.\n• None Oklo stock is one of the most popular names emerging in the field of nuclear power.\n• 10 stocks we like better than Oklo ›\n\nWhen most investors think about artificial intelligence (AI) opportunities, their attention naturally turns to companies in the technology sector. But if you've been following the story closely over the past couple of years, you'll know that one of AI's most critical challenges lies elsewhere: energy storage and power generation.\n\nThe surge in AI computing capacity is placing unprecedented strain on the U.S. power grid, pushing alternative solutions -- particularly nuclear energy -- to the forefront of the conversation.\n\nWhere to invest $1,000 right now? Our analyst team just revealed what they believe are the 10 best stocks to buy right now. Learn More »\n\nOne company gaining traction in the space is Oklo (NYSE: OKLO). Promising breakthroughs in next-generation nuclear microreactors, Oklo has quickly captured the attention of growth investors. The question now: could Oklo become the \"next Nvidia\" and define its industry for decades to come?\n\nWhen Nvidia first introduced the graphics processing unit (GPU) in the late 1990s, few understood the transformative potential of the technology. At the time, GPUs were largely embraced by video game players seeking better and faster graphics performance. But Nvidia's visionary CEO, Jensen Huang, recognized something others didn't -- its parallel processing chips could address other latent needs and handle a broader range of computational challenges.\n\nFast-forward to today, and GPUs have evolved from a niche gaming product into the backbones of generative AI infrastructure -- providing the specific type of processing muscle required for applications ranging from cybersecurity to autonomous vehicles to robotics and beyond.\n\nThe key takeaway here is that while Nvidia's GPU business started with limited traction, it ultimately achieved true product-market fit -- laying the foundation for an empire as the use cases for the chips multiplied and the technology became indispensable.\n\nOklo has quickly captured investor attention thanks to its unique positioning at the intersection of energy and AI. One major catalyst for the company is OpenAI CEO Sam Altman, who previously served as chairman of Oklo's Board. Altman's name recognition and influence have undoubtedly elevated Oklo's profile and helped fuel its narrative as a potential multibagger in the AI energy landscape.\n\nBeyond star power, Oklo also benefits from a growing network of high-profile partnerships. Collaborations with the Department of Energy (DOE), the U.S. military, and private sector infrastructure players such as Vertiv and Liberty Energy underscore the company's credibility. These alliances not only offer some validation to Oklo's technology, but also highlight the strategic importance of its microreactors as potential sources for clean and efficient energy.\n\n...comparing it to Nvidia is a stretch\n\nWhile Oklo has drawn the attention of government agencies and AI sector power players, the company has yet to deliver a tangible product. Unlike Nvidia's GPU business in the late 1990s, which was already mass-producing chips and gaining early adopters, Oklo has not yet built an operational reactor. No power is being generated at scale, and it has no billable customers in place. In other words, Oklo's value proposition to the AI industry is entirely speculative -- a critical distinction when benchmarked against Nvidia's early position.\n\nThe stock chart above illustrates this disconnect. Oklo's shares have surged by nearly 800% over the past year, pushing its market cap to $9.7 billion -- a figure that equals nearly 26 times Nvidia's combined 1999 and 2000 revenue. That type of premium is difficult to justify for a company with no revenue, a hefty capital expenditure budget, and a path forward that will hinge largely on winning regulatory approvals.\n\nOklo stock remains a speculative gamble, and its narrative increasingly resembles what one would expect from a meme stock rather than a sustainable growth story. Its rally over the past year has been largely fueled by hype-driven momentum and enthusiasm from unsuspecting retail investors.\n\nIn my view, Oklo is far from the next Nvidia. If anything, the stock already appears to have priced in most (if not all) of its potential upside. Chasing the stock's current momentum could leave investors holding the bag when reality kicks in.\n\nShould you invest $1,000 in Oklo right now?\n\nBefore you buy stock in Oklo, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Oklo wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $650,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,072,543!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,045% — a market-crushing outperformance compared to 182% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nAdam Spatacco has positions in Nvidia. The Motley Fool has positions in and recommends Nvidia. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://www.fool.com/terms/b/bag-holder/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=bb75ec24-3452-418a-8601-9709305f33d4&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001026%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dtop_incontent_pitch_feed_partner%26ftm_pit%3D17174&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/investing/2025/08/12/this-artificial-intelligence-ai-stock-could-be-the/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://ycharts.com/companies/OKLO/chart/",
    "https://www.fool.com/author/20479/",
    "https://www.fool.com/terms/s/sam-altman/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/investing/stock-market/market-sectors/energy/nuclear/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=74d2f5e3-a605-44dc-acc5-be52894d97ee&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DOklo&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/investing/stock-market/types-of-stocks/meme-stocks/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/terms/g/generative-ai/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=4051efea-df5e-4ab6-bcb6-2602920c5e66&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000069%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17995",
    "https://www.fool.com/terms/c/capital-expenditure/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/terms/r/retail-investor/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/terms/m/multibaggers/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.fool.com/terms/g/gpu/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
    "https://www.nasdaq.com/market-activity/stocks/oklo",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=74d2f5e3-a605-44dc-acc5-be52894d97ee&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Oklo Stock",
      "weight": 0.09790496
    },
    {
      "name": "Oklo stock",
      "weight": 0.09790496
    },
    {
      "name": "AI sector power players",
      "weight": 0.08352341
    },
    {
      "name": "Oklo",
      "weight": 0.081997484
    },
    {
      "name": "technology stocks",
      "weight": 0.074645445
    },
    {
      "name": "generative AI infrastructure",
      "weight": 0.06728365
    },
    {
      "name": "AI",
      "weight": 0.06495172
    },
    {
      "name": "Nvidia",
      "weight": 0.06477287
    },
    {
      "name": "AI computing capacity",
      "weight": 0.06424884
    },
    {
      "name": "stock",
      "weight": 0.063717864
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9580078125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.87353515625
    },
    {
      "name": "/News/Technology News",
      "score": 0.8095703125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.340087890625
    }
  ],
  "sentiment": {
    "positive": 0.60184705,
    "negative": 0.06651095,
    "neutral": 0.331642
  },
  "summary": "Oklo (NYSE: OKLO) is gaining popularity in the field of nuclear power, promising breakthroughs in next-generation nuclear microreactors. However, the company has not yet built an operational reactor and has no billable customers in place. While Oklo's shares have surged by nearly 800% over the past year, its market cap is $9.7 billion, nearly 26 times Nvidia's combined 1999 and 2000 revenue. The company's value proposition to the AI industry is speculative compared to Nvidia's early position in the graphics processing unit (GPU) in the late 1990s. Oklo also has partnerships with the Department of Energy (DOE), the U.S. military, and private sector infrastructure players like Vertiv and Liberty Energy.",
  "shortSummary": "Oklo stock is gaining momentum as a potential AI-adjacent company, driven by strong investor interest in nuclear energy, despite limited commercial opportunities and limited operational capabilities.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "693096f9f917471da3e6e8bb449c85b9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/investing/stock-market/market-sectors/energy/nuclear/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Nuclear energy stocks have become far more compelling to many investors in recent years. Between the implications of climate change, the limits on solar and wind energy and storage technology, the still-high costs of hydrogen energy, and decades of data that support nuclear energy as safe, there are good reasons to support this carbon-free source of energy.\nBut before jumping into the latest hot nuclear energy stock, it pays to know what you're getting into. In this article, we'll break down the nuclear energy industry, opportunities, risks, and what investors need to understand.\nAbout nuclear energy\nUnderstanding nuclear energy\nWithout diving too deep into the science, nuclear energy, in general, refers to fission. Fission is the process of splitting the nucleus of atoms, releasing significant energy (heat and radiation) that starts a chain reaction, continuing as long as there's fuel.\nIt's the release of heat in this reaction that's important. A cooling agent -- almost always water -- is heated by fission, and the steam generated by the heat powers turbine generators. That creates electricity.\nThe fuel for almost all nuclear fission is uranium-235, the isotope that can produce a fission chain reaction. Getting this radioactive material out of the ground and transported safely to customers isn't something just any old mining company does. As a result, most uranium mining companies are fairly specialized.\nHowever, mining is only the first step in getting a product usable by the market. Uranium-235 makes up a tiny portion of the uranium found in nature. More than 99% of the world's supply is uranium-238, which can't produce a fission chain reaction. Instead, it must be \"enriched\" into uranium-235. This is a lucrative business for the small number of companies that do it.\nProducing power from nuclear energy also requires a nuclear power plant, called a reactor. There are only a small handful of companies with the expertise and financial strength to deal with nuclear reactors, and almost all are either private, state-owned, or the subsidiary operation of a large industrial conglomerate. These companies generally build the reactors, as well as provide maintenance and other necessary services for the many decades a nuclear reactor is in operation.\nHistorically, commercial nuclear reactors have been very large in scale to maximize efficiency, since smaller-scale reactors could not compete on efficiency. But that's potentially on the verge of change, with newer innovations making nascent small-scale nuclear reactors more compelling.\nLooking beyond fission, there have been major advances in nuclear fusion in recent years. Long considered the \"holy grail\" of energy, fusion is, to quote the International Atomic Energy Agency, \"the process by which two light atomic nuclei combine to form a single heavier one while releasing massive amounts of energy.\"\nWhat makes it so compelling: Fusion could provide -- again, quoting the IAEA -- \"virtually limitless clean, safe and affordable energy to meet the world's energy demand.\" The problem: It's incredibly hard; we are talking about the equivalent of making miniature suns, after all. But the upside is almost immeasurable, and explains why decades of research and virtual mountains of money have been invested in it. Fusion would be significantly safer and cleaner than any other source of energy under humanity's control today. The question we still don't know the answer to is how many more decades before it's more than just an expensive experiment, much less anywhere close to commercially viable.\nAnd we need more clean energy now. Back to fusion. After many years of negative sentiment, nuclear energy is back on the table -- for good reasons, based on its clean-energy bona fides and a safety record that has been marred by a small number of high-profile events but is far safer than many people think.\nUp next, let's take a closer look at three top nuclear energy stocks.\nTop nuclear stocks\nThree top nuclear energy stocks\n1. Cameco\nOne of the few well-established pure-play companies to invest in nuclear energy stocks, Cameco (CCJ 4.76%) is among the world's largest uranium miners and refiners. This Canadian company's Cigar Lake facility produces the world's highest-grade uranium and has produced more than 155 million pounds since going online in 2015. Its McArthur River/Key Lake was brought back into operation in 2022 after being shut down for several years. Cameco's operations there have produced 567.9 million pounds of uranium from the largest high-grade uranium mine and mill in the world.\nCameco also produces uranium hexafluoride and uranium dioxide, which are used in uranium enrichment and fuel rod production.\nLike many other natural resources companies, Cameco is heavily affected by the cyclical pricing of the underlying commodities it produces and sells. As a result of these commodity swings, it can be a very cyclical stock, going through boom-and-bust periods when its earnings can spike and then fall sharply before recovering again. The good news is that despite this cyclical reality, Cameco has a long track record of generating strong positive operating cash flow. It has generated positive operating cash every year since 2010.\nIn mid-2025, Cameco's share price was riding high on high uranium prices. Like other cyclical, commodity-price-driven stocks, patience is important, as is paying a reasonable valuation. With a strong record of making money, Cameco is a great business, but investors should make sure to buy shares at a good valuation and not get pulled into overpaying when uranium prices are highest.\n2. GE Vernova\nGeneral Electric completed its decade-long restructuring in April 2024. The legacy business was split into its remaining stand-alone entities, with GE Aerospace (GE -0.71%) keeping the stock ticker and CEO Larry Culp, and its energy business now standing on its own as GE Vernova (GEV 0.03%). The new energy-focused company has been good to shareholders so far, and investors interested in nuclear should consider owning it. GE has been in the nuclear power business since the 1950s, and Vernova is one of a handful of companies with significant market share in nuclear reactors.\nThe spinoff of GE Vernova includes GE's nuclear business, part of its Power segment that also includes its gas, steam, and hydroelectric business, its Wind segment, and its Electrification segment.\nThere are a few things that make this future GE spinoff a compelling nuclear energy stock. As a starting point, Vernova's allocation of capital as a standalone, energy-focused company should deliver better results. Beyond GE Hitachi Nuclear Energy, the nuclear reactors and services spinoff, investors will also get exposure to GE's leading gas, hydroelectric, and steam power technologies, and its leading onshore and offshore wind energy business. Combined, that's more than $265 billion in global market GE Vernova can serve today.\nPart of GE Vernova's growth market includes small modular reactors -- also called SMRs -- that are expected to be an important part of a more decentralized and flexible electric grid. The company received permission in mid-2025 to begin construction on an SMR in Ontario that would be the first reactor of its type in the Western hemisphere, capable of powering roughly 300,000 homes.\n3. Brookfield Renewable\nLike GE Vernova, this isn't a pure-play nuclear energy stock. Brookfield Renewable (BEP 2.62%) (NYSE:BEPC) owns, operates, and invests in hydroelectric, wind, solar, and energy storage facilities today. It moved into the nuclear market in November 2023 when it bought a majority share of Westinghouse -- one of the world's largest nuclear services companies -- from Brookfield Business Partners (BBU 2.59%), taking on Cameco as a minority partner in the $8.2 billion deal.\nThis was the first move into nuclear energy for Brookfield Renewable, but it's not the first time it has spread its wings and diversified. Historically focused on hydroelectric, it moved heavily into wind and solar in the mid-2010s and has more recently begun investing in energy storage. With nuclear now on the menu, Brookfield has a long, solid legacy of moving into nascent and formerly out-of-favor technologies when there's a clear path to profits. The latter seems to be the case with its investment in Westinghouse.\nInvestors looking for more pure-play nuclear companies, however, may be disappointed with the Brookfield pick, preferring a company like NuScale (SMR 4.66%), a startup that's trying to take small-scale reactors commercial.\nAnd while NuScale could prove a huge winner, it's still very early in its existence. It went public via a special purpose acquisition company (SPAC) in May 2022 and isn't likely to have its first \"VOYGR\" SMR power plant fully operational in the U.S. anytime soon. NuScale pulled the plug on a Utah reactor project in November 2023. It currently has no new projects announced with a definitive completion date.\nInstead of betting on a very unproven \"next big thing\" so far ahead of commercialization, investors looking to win from nuclear should consider proven winners like Brookfield Renewable first.\nRelated investing topics\nShould you invest?\nShould you invest in nuclear energy?\nThere are certainly reasons why nuclear energy stocks might sound compelling. After decades of being out of favor, nuclear energy is hanging out with the popular kids again. And that's likely to be good for the world since more low-carbon energy should result in more economic opportunity, a better environment, and better health outcomes for billions of people. Nascent technologies like small-scale reactors might be appealing, too.\nBut before piling into nuclear energy stocks, make sure to check your biases and your reasoning. As a cyclical industry that's come back into favor, the headlines (and message boards) can make it feel like a can't-miss opportunity. But that's far from the reality; while the secular trends look favorable, today's profits can turn into losses before you can say, \"But what about last quarter?\" So step lightly and consider the risks before you buy.\nFAQ\nNuclear energy stocks FAQ\nWhat is nuclear energy?\nNuclear energy is the energy that is produced from either the chain reaction of splitting (fission) atoms, or the combining (fusion) of light atoms into heavier atoms.\nFission is the only commercially viable source of nuclear energy to date, and the heat it releases is used to generate steam to power turbines.\nWhat is the leading company in nuclear energy?\nNuclear energy only has a small number of global players, and two companies are major leaders: Cameco is one of the largest producers of uranium and uranium products used to make nuclear fuels, while Westinghouse is one of the largest providers of equipment, parts, and services to the global fleet of nuclear reactors in operation."
    },
    {
      "url": "https://www.fool.com/terms/r/retail-investor/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "A retail investor is a non-professional investor. Also known as individual investors, retail investors have an increasing impact on the market.\nAnyone who doesn't do investing as a career is considered a retail investor. That's a very wide range of skill levels and specialties. Let's go over how the retail investing market works, its size, and the pros and cons of being a retail investor as opposed to an institutional investor.\nUnderstanding retail investing\nUnderstanding retail investing\nRetail investors typically invest in stocks and bonds but mostly in stocks since bonds are notoriously difficult to trade on most trading platforms. Most retail investors use discount brokerages or apps such as Robinhood (HOOD 2.84%) or invest through an employer-sponsored 401(k) or other retirement plan.\nRecent innovations in brokerage technology and business model have made investing far easier for retail investors. A process that was limited to the 1% 40 years ago and to people with the time and energy to fill out endless forms 10 years ago can now be completed in 30 minutes on an app.\nInvestors can now buy and sell stocks, options, and funds with the click of a button. Retail investors can even use margin, or loans, to buy stocks and other assets.\nThe whole process is governed by the U.S. Securities and Exchange Commission (SEC). The SEC sets strict requirements for which investors can day trade, use margin, or invest in asset classes such as hedge funds or private equity. The SEC also regulates the filing process for public companies offering stock to investors.\nPros and cons of retail investing\nPros and cons of retail investing\nHere are a few of the pros and cons of being a retail investor:\n| Pros | Cons |\n|---|---|\n| Concentration | Fees |\n| Stock size | Time |\n| Liquidity | Access |\n| Flexibility | Economies of scale |\n| Circle of competence | Circle of competence |\nConcentration\nInstitutional investors are often required to hold hundreds of stocks. Retail investors can choose the number of stocks they want to buy. The more concentrated you are (to a point since you need some diversification), the higher your potential returns.\nStock Size\nSmall-cap stocks (meaning stocks with a market capitalization of less than $2 billion) generally outperform the market. Many institutions can't purchase these stocks because they have too many assets under management and are restricted in the percentage of a company they can hold.\nLiquidity\nIt's unlikely a single retail investor would ever move the market, but institutions with holdings in the billions of dollars have to be careful when they buy and sell stocks to avoid moving the stock too far in the wrong direction.\nFlexibility\nAs a retail investor, if you want to hold cash for a while, you can. If you want to sell U.S. stocks to buy foreign stocks, you can. If you want to buy gold bars and load them into a safe right before forgetting the combination, you can.\nInstitutions have strict regulations from the SEC and from their own prospectus guidelines. Many funds are created to buy growth stocks only or large-cap stocks only. If those types of stocks are in a bear market, the fund just has to try to work around it.\nCircle of competence\nThis one is both a pro and a con. As a retail investor, it's likely that you have some level of competence in a specific industry.\nIf you work for a construction company, you may understand the supply and demand dynamics for lumber, copper, and other materials. If you work for a bank, you probably have a good handle on current interest rates and credit standards. The problem is that degrees of competence can pigeonhole you.\nInstitutions can hire people to become specialists in every industry. They may not have the local knowledge you have in your industry, and there may be a lag before they know things, but they have at least a basic knowledge of every industry. But if you're a retail investor who works in accounting for a dog food manufacturer, it's more difficult to really be able to understand a biotech stock.\nFees\nThere are fees for everything. You pay a fee when you buy a stock and when you sell it. You pay a higher fee if you do it on margin or if you buy options. You pay annual fees and expenses for any fund you buy. This is even true if you use an app that has no commissions. The way those apps make money is by increasing the bid/ask spread, meaning you pay more for the stock through them than you would through a traditional broker.\nTime\nProfessional investors have the luxury of spending their entire workday analyzing stocks and investing. Retail investors may have to find time to do proper analysis in between lunch and picking kids up from day care.\nAccess\nLarge institutions have access to some transactions that aren't available to the public. This could be a Private investment in Public Equity (PIPE), an investment in an initial public offering (IPO), or even an investment in a private company.\nEconomies of scale\nSometimes the problem of size (as discussed in the liquidity section) is a good thing, at least for institutional investors. When other institutions or even corporations want to buy or sell a huge block of shares, they will often offer a discount or premium to do it all at once. Institutions that can handle that level of transaction can take advantage, while retail investors would always have to pay the market price.\nThe retail investment market\nThe retail investment market\nAccording to Morgan Stanley, retail investors make up about 10% of the daily trading value of the 3,000 biggest U.S. stocks. That's about $38 billion per day! Where retail investors once had little to no influence on the market, they can now move stocks with billion-dollar market caps relatively easily.\nMorgan Stanley also noted that retail investors tend to focus on the consumer discretionary, communication, and technology industries. This goes along with the circle of competence concept. It means that developed competence in a niche sector can lead to outsized gains going forward.\nAccording to Charles Schwab, as many as 15% of retail investors made their first trade in 2020. Being stuck at home during the pandemic (with stimulus checks in hand) with apps like Robinhood made trading a lot easier and cheaper (at least outwardly) and led to a big jump in people interested in investing. You can probably thank Reddit and its \"meme stocks\" for a lot of that growth as well.\nMuch of the boom in retail investing has been good. The 10-plus year boom in technology growth stocks looked to be over as the pandemic started, but it has returned with a vengeance. Many tech stocks have zoomed up in the past two years. But there are negatives, too. Retail investors tend to be oriented more to the short term than institutions, and panic selling has led to a lot of volatility. More than ever, you have to take market movements with a grain of salt.\nRelated investing topics\nInvesting for yourself\nRetail investors likely won't ever be the dominant force in the stock market. But innovations in trading technology, the many pros of investing for yourself, and easy access to websites such as this one to learn about investing make it increasingly easy for everyday people to handle their own stock purchases and sales."
    },
    {
      "url": "https://www.fool.com/terms/g/gpu/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "It's time to peer into the heart of computer hardware to understand an essential component: the GPU. Don't worry; this won't get too technical, but understanding this term could be instrumental for your tech investments.\nWhat is a GPU?\nWhat is a GPU?\nGPU stands for \"graphics processing unit.\" This computer chip is the brain behind every visual element that your computer displays. From the colorful graphs in your stock analysis software to the latest blockbuster movie streaming on your 4k screen, the GPU is hard at work turning digital data into visible pixels.\nYou'll occasionally see the terms GPU and graphics card used as metonyms for one another. That's a useful shorthand, but not exactly right. The two pieces of hardware are closely related, and you can't make a graphics card without a GPU. So when the two terms are conflated into a single concept, it sort of makes sense. Still, they are not the same thing, technically speaking.\nThe GPU is the most important chip on a fully realized graphics card. Besides the GPU, this card also contains memory chips, a cooler, and other components. You'll also typically find them equipped with a few HDMI or DisplayPort connectors, from which the right cable can transfer the generated graphics data to a monitor (or three). Think of the graphics card as a fully functional car with the GPU being the engine powering it.\nWhy should you care about the GPU?\nWhy should you care about the GPU?\nNow, you might wonder why an investor needs to know about GPUs. Well, consider this: The same number-crunching horsepower that makes these chips so good at generating high-quality graphics in real time is also the best solution for many other high-performance computing tasks. The leading GPU designers, Advanced Micro Devices (AMD 2.49%) and Nvidia (NVDA 1.65%), have moved beyond the basic market for graphics cards to explore a wider range of heavy-duty computing opportunities.\nThe hardware used in these applications is usually not consumer-grade graphics cards but specialized computing products with lots of memory and one or more GPU chips but no ports for display output. In this form, GPUs are crucially important in several high-growth technology sectors, from video games and virtual reality to artificial intelligence (AI) and cryptocurrency mining.\nGPUs have become especially essential in the AI market. Unlike CPUs (central processing units) that are great at doing a few things at once, GPUs excel at doing many things simultaneously, making them ideal for training AI models that need to process vast amounts of data quickly.\nTime to take action\nTime to take action\nKnowing about GPUs and their role in driving key technology sectors can be a real game-changer for investors. Pay attention to tech companies that design and manufacture GPUs (like Nvidia and AMD), but also to firms that rely on GPUs in their technology. For example, the GPU is of central importance to AI startups, gaming companies, and some cryptocurrency platforms.\nCrypto mining on GPUs isn't as popular as it once was. Bitcoin (CRYPTO:BTC) miners are better off using special-purpose mining chips instead, and most GPU-based mining moved to Ethereum (CRYPTO:ETH) many years ago.\nBut Ethereum's platform upgrade, completed in the spring of 2023, took mining out of the equation entirely. After that game-changing shift, GPU-powered crypto mining has to work with altcoins such as Ethereum Classic (ETC 14.17%), Ravencoin (RVN 8.83%), Monero (XMR 1.27%), and Zcash (ZEC 3.18%).\nThese alternatives are not as robust as Bitcoin and Ethereum, and it can be difficult to trade the not-so-popular coins you're mining. So mining crypto with a GPU isn't the name of the game anymore, but crypto usage could make a comeback, and you should be aware of this sub-market's interesting history.\nUnderstanding the GPU also empowers you when assessing the effects of market events. For instance, a global chip shortage could affect GPU manufacturers, potentially driving up prices, which would ripple through sectors that rely on GPUs.\nRelated investing topics\nThe GPU in action: Training the ChatGPT system\nThe GPU in action: Training the ChatGPT system\nTo truly illustrate the importance of GPUs, let's turn to the realm of artificial intelligence. In particular, we'll look at OpenAI's large language models, GPT-3 and GPT-4. Both are powered by a large-scale machine learning model trained on a wealth of internet text, and the resulting large language models (LLMs) power the popular ChatGPT application.\nBut what does this have to do with GPUs?\nIt's simple. The training of these colossal models involves processing an astronomical amount of data, a task for which GPUs are uniquely qualified. The right chips can perform thousands of calculations simultaneously, making them crucial in creating these language models in a reasonable timeframe.\nOne of the key players in the GPU market, Nvidia, has been particularly instrumental in this development. The Nvidia A100, V100, and H100 Tensor Core GPUs, for instance, offer incredible acceleration at every scale for AI training and inference. Thanks to the AI training performed on these high-powered GPUs, the GPT-4 AI system can analyze and understand text on a near-human level.\nAMD has its Radeon Instinct accelerators designed specifically for machine learning and AI workloads. Their GPUs are also widely used across the tech industry, powering advancements in AI and machine learning. With just a handful of exceptions to the rule, almost all of the world's most powerful supercomputers were built around either Nvidia or AMD AI-oriented GPUs.\nThe deployment of these GPUs isn't limited to a shadowy server farm either. They are hard at work in everyday applications like ChatGPT, where users interact with the AI models in real time. This practical application of GPU technology shows how integral they are to advancements in AI, affecting both businesses and consumers.\nSo understanding the role of GPUs isn't just a tech concern. This understanding directly relates to evaluating companies that manufacture GPUs, like Nvidia and AMD, and businesses that heavily use them, such as OpenAI. Knowing the basic facts about GPUs will help you make more informed predictions about these companies' performance and their impact on the tech industry."
    },
    {
      "url": "https://www.fool.com/terms/b/bag-holder/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "What is a bag holder?\nWhat is a bag holder?\nA bag holder is a person who holds on to a stock all the way to $0 despite signs along the way that the stock needed to be sold. Bag holder stocks are also known as value traps, meaning that the stock seems like a value when in reality it is worthless.\nHowever, sometimes the stock that everyone else thinks is a dud eventually rebounds and makes investors rich. We'll discuss how you can become a bag holder, a few examples of bag holder stocks, and how to determine whether a stock is a value or a value trap.\nHow do you become a bag holder?\nHow do you become a bag holder?\nMany bag holders simply lost track of their investment. As you change jobs and open accounts with new investment advisors and 401(k) providers, it's possible to lose track of your accounts -- especially if you've moved and no longer get physical statements. In this instance, you could own stocks that go to zero because of bad business economics. The solution to this is simply organizing and checking in on your investments.\nWe'll focus on bag holders who hold a stock all the way to zero because they can't quit it. There is a lot of emotion and behavioral bias in investing.\nWhether you're a beginning investor or a multi-billionaire hedge fund manager, after you buy a stock, all new information is met with confirmation bias. With confirmation bias, all new information is filtered to confirm your prior opinions.\nYou may have seen this type of bias with some of your friends and politics on social media. When you're so enraptured with a value stock that all new information confirms your prior beliefs even as the stock goes to zero, you become a bag holder.\nExamples\nExamples of bag holder stocks\nThere are several bag holder stocks in my personal investing experience. Every single one was a gold mining stock, and I couldn't tell you the name of any of them.\nMany bag holder stocks are originally purchased for the upside potential. The company has a new drug coming out or it's saddled with debt and that's depressing the stock price. In my case, the gold miners were supposed to go up 10X once the old price soared and they found gold. Of course, gold prices didn't soar and none of them found gold.\nNot all bag holder stocks are tiny, however. Value hedge fund managers lost billions on Valeant Pharmaceuticals, now called Bausch Health Companies (BHC -0.13%). It didn't quite go to zero, but peak-to-trough losses were around 90%.\nA few of the same managers followed JCPenney (OTC:JCPN.Q) and Sears Holdings (OTC:SHLDQ) to eventual bankruptcy.\nRelated investing topics\nHow to avoid becoming a bag holder\nHow to avoid becoming a bag holder\nThe first step is to control your own biases. That doesn't mean you study what all the behavioral biases are and try to identify when they're affecting you. You have to create an objective framework through which you evaluate your investments.\nUse a checklist when initially evaluating the investment. Track what management says on conference calls and compare it to actual results. Reevaluate everything at least annually. If sales and returns are falling, debt is rising, and insiders are unloading their shares, there's probably something wrong. Learn when to sell stocks and stick to it.\nOf course, the best way to avoid becoming a bag holder is to skip the value traps in the first place. Stocks with loads of debt, no growth, and bad management can look like great values, but, usually, they aren't. Additionally, think long and hard about investing in a dead industry. For every Best Buy (BBY 4.13%), there are 10 Circuit Cities."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://ycharts.com/companies/OKLO/chart/",
      "text": "Oklo, Inc. (OKLO)\nFundamental Chart\nChoose from thousands of securities and metrics to create insightful and comprehensive visuals, add your firm’s logo for marketing distribution, and share your knowledge with clients and prospects.\nTell a Compelling Story Using Stunning Visuals\nGo beyond price to chart the fundamental levers that impact performance. YCharts enables the comparison of multiple securities based on virtually any performance metric or valuation ratio — plus, layer in macroeconomic indicators to show the “why” behind a security’s performance.\nAccess Large Quantities of Quality Data\nWe source data from Morningstar and S&P Global in addition to mining our own economic indicators and events data. Fundamental Charts can be built off of more than 4,000 metrics and line items, covering 20,000+ securities and 400,000+ economic indicators such as labor statistics, GDP, and more.\nShare your Research to Promote your Brand\nFundamental Charts are brandable with your firm’s logo enabling you to own your research and create additional touch points with prospects and clients. With a simple click, Fundamental Charts can be shared with colleagues, downloaded as images, embedded into emails or blogs, or saved for you to revisit at any time.\nQUESTIONS?\n- Email: support@ycharts.com\n- Call: (866) 965-7552\nREADY TO GET STARTED?\nUnlock My AccessAccess Edit Charts Now\nUnlock access to Edit Charts by registering below. No credit card required.\nUnlock My AccessQUESTIONS?\n- Email: support@ycharts.com\n- Call: (866) 965-7552"
    },
    {
      "url": "https://www.fool.com/terms/c/capital-expenditure/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Understanding financial terms is essential to being a successful investor, and that includes understanding the three financial statements: the income statement, balance sheet, and cash flow statement.\nOn the cash flow statement, one of the most important components is capital expenditures.\nWhat does capital expenditures mean?\nWhat does capital expenditures mean?\nCapital expenditures, often called capex, are often listed on the cash flow statement as payments for property and equipment under cash flows from investing activities.\nAs the name implies, this is spending on capital goods and projects, as opposed to operating expenses.\nWhat qualifies as a capital expenditure?\nWhat qualifies as a capital expenditure?\nCapital expenditures often refers to spending on buildings and maintenance that are essential parts of most businesses. For example, a retailer like Walmart (WMT -1.18%) spends billions on capex to ensure that its stores are clean and up to date. A tech company like Meta Platforms (META 2.04%) or Amazon (AMZN 3.12%) might spend billions on capex, building out new data centers or filling existing ones.\nA capital expenditure is typically depreciated or amortized, as opposed to an operating expense, which is expensed.\nThat's an important distinction that you should be aware of when evaluating a business. Operating expenses typically refer to the direct spending needed to run a business. For example, at a restaurant, operating expenses would refer to labor costs, food costs, and occupancy costs like rent and utilities, as well as things like marketing expenses and even research and development. Capex would refer to spending on items such as building maintenance, new store buildouts, and other infrastructure.\nCapital expenditures don't affect the income statement directly, but they affect the cash flow statement -- the free cash flow statement, in particular, which is operating cash flow minus capital expenditures.\nFree Cash Flow (FCF)\nHow to use capital expenditures\nHow to use capital expenditures\nBecause capital spending isn't \"required\" in the way that operating expenses are, businesses have more flexibility on the timing of capex, so it's worth paying attention to see if businesses are cutting back on spending to conserve cash.\nCapital expenditures also give a sense of how aggressively a business is investing in growth. Comparing capital spending between companies can offer information on which one is spending more on growth. It's worth looking at the percentage of revenue going to capital expenditures, for example. A company that's spending more than its competitors could be preparing to outgrow them, although it could also be spending on capital inefficiently. Still, it's worth investigating why a company is increasing capex since it could be paving the way to a growth opportunity for the company.\nWall Street often punishes stocks for increasing spending on capex since they see it as eating into profits. As long as the money is spent wisely, however, it generally pays off in long-term profits and growth. It's a good idea to look for unloved stocks that are raising capital expenditures.\nRelated investing topics\nWhat's an example of a capital expenditure?\nWhat's an example of a capital expenditure?\nTo explore what capital expenditures look like in a real business, let's take a look at capital expenditures for Walmart in its most recent fiscal year.\nIn fiscal 2023, which ended on Jan. 31, 2023, Walmart spent $16.9 billion on capital expenditures. The company allocated $9.2 billion to the supply chain, including customer-facing initiatives and technology, with another $5 billion for store and club remodels and $2.6 billion for Walmart International. Only $33 million was allocated to new stores; Walmart has essentially stopped opening new stores.\nWalmart said its capex strategy includes improving customer-facing initiatives, creating a seamless omnichannel experience, and improving the supply chain.\nThe retailer has stepped up capex from $10.2 billion in fiscal 2021 to $13.1 billion in fiscal 2022 and $16.9 billion in fiscal 2023 as a result of company goals to become more competitive with Amazon on the e-commerce front and improve its tech capabilities.\nWalmart is able to fund that capex out of its operating cash flow with $28.8 billion in operating cash flow in fiscal 2023, giving it almost $12 billion in free cash flow last year. Walmart spent the remainder on dividends and share buybacks.\nUnderstanding the cash flow statement can give you key insights into a business, and capital expenditures are one of the most important components of the cash flow. It's essential to follow if you want to know how a business is spending its cash."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=bb75ec24-3452-418a-8601-9709305f33d4&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001026%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dtop_incontent_pitch_feed_partner%26ftm_pit%3D17174&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/investing/2025/08/12/this-artificial-intelligence-ai-stock-could-be-the/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Back in 1999, a fledgling semiconductor company called Nvidia invented a chipset called the graphics processing unit (GPU) -- a product that, at the time, few people realized they would one day need.\nTwo decades ago, GPUs were primarily marketed toward gamers and graphic designers. But Nvidia's visionary CEO, Jensen Huang, saw the broad potential of these advanced chips before anyone else.\nWhen the GPU was initially released, AI applications were both niche and barely imagined. But Huang understood that the world's most important problems would be solved by anticipating latent needs -- capabilities that people will demand at some point in the future, even if they can't fully describe them today.\nHuang realized that GPUs could be parlayed for more sophisticated problem solving that traditional CPUs at the time could not handle efficiently, ultimately becoming the foundational layer on which artificial intelligence (AI) modeling, research, and data analytics are built.\nIn a similar fashion, internet and cloud computing juggernaut Alphabet (GOOG 2.98%) (GOOGL 3.10%) has been quietly pushing the envelope in a new pocket of the AI realm that's gaining attention: quantum computing.\nLet's dive into Alphabet's innovative approach to developing quantum applications and explore how the company's progress parallels that of Nvidia's pioneering role in AI before it went mainstream.\nHow is Alphabet building quantum computing applications?\nBack in December, Alphabet unveiled its latest breakthrough in the quantum computing arms race: a processor called Willow. With 105 qubits and enhanced algorithmic features across error correction, Willow might appear as just another incremental improvement over prior generations of quantum chips released by Alphabet and its peers.\nWhere Willow caught the attention of AI enthusiasts was through an experiment in Random Circuit Sampling (RCS), in which its quantum processing was measured against classical supercomputers. In this study, Alphabet claims that Willow solved a sophisticated series of computations in under 5 minutes that would take today's most capable supercomputers an estimated 10 septillion years to complete.\nWhy Alphabet is to quantum computing what Nvidia is to AI\nWhile Alphabet's quantum supremacy may not have ample commercial uses today, the idea here is that the company's innovations and technological breakthroughs are similar to that of Nvidia and the invention of the GPU back in the late 1990s. Willow and the GPU both represent underlying proof that Alphabet and Nvidia have been at the forefront of innovations where conventional approaches are not able to compete at scale.\nSimilar to Nvidia, Alphabet is not building its AI business through a singular lens. Under its umbrella, Alphabet has TensorFlow -- an open-source machine learning platform. In addition, Alphabet's Google Quantum AI team operates an open-source software framework called Cirq, which helps Python developers research and build applications. Lastly, Google DeepMind serves as a research lab spanning various aspects of the AI spectrum, including quantum computing.\nTo me, the formation of Alphabet's AI ecosystem aligns closely with Nvidia's approach. Outside of its hardware specialty, Nvidia also offers software through its CUDA infrastructure. This decision ultimately created a virtuous cycle in which developers building generative AI applications continually demand additional GPU and software capacity -- leading to a self-reinforcing technological moat for Nvidia.\nI think Alphabet is employing a similar strategy, betting that classical computing will eventually become exhausted by increasingly sophisticated AI workloads. When this occurs, Alphabet will have already architected the leap from classical to quantum computing.\nJust as Nvidia has done throughout the AI revolution thanks to its GPUs and software platform, Alphabet could one day be positioned as the main ecosystem on which quantum applications are developed.\nIs Alphabet stock a buy right now?\nThroughout the AI revolution, many of Alphabet's peers have experienced notable expansion in their valuation multiples.\nAt the moment, however, Alphabet is trading roughly in line with its three-year average forward price to earnings (P/E) ratio. Not only is the valuation discount to its peers striking, but I think it's overstated.\nOver the last three years, Alphabet has continued to innovate across several areas of AI, including new capabilities in search, video, e-commerce, cybersecurity, and of course, hardware such as quantum chips. Nevertheless, the upside from these investments do not appear to be fully priced into the company's long-term financial success.\nJust as Nvidia has proven to be one of the most lucrative long-term buys of the decade, I see Alphabet positioned to follow a prolonged breakout period featuring notable valuation expansion as its AI-powered products continue to scale and become a more central part of the company's growth narrative. For these reasons, I think that Alphabet stock is dirt cheap and looks like a compelling opportunity at its current price level."
    },
    {
      "url": "https://www.fool.com/terms/g/generative-ai/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "You have probably heard the term \"generative AI\" tossed around in tech circles or investment discussions. It's one of those buzzwords that seems to be on everyone's lips nowadays, starting when OpenAI released the ChatGPT tool in November 2022. But the name alone doesn't really explain what's going on, and there are many ways to look at this interesting toolkit. So, it's time to demystify this tech jargon.\nWhat is generative AI?\nWhat is generative AI?\nGenerative AI is a subfield of artificial intelligence (AI) where computer systems create new content. It's like a digital Picasso, Shakespeare, or Mozart, generating complete works of creative text, images, music, or even entire virtual worlds.\nThis is the secret sauce behind those eerily realistic images and even videos you see online nowadays. These tools can be quite powerful, but they are not digital magic -- the quality of an AI-generated creative artifact rarely matches the quality of a competent human creator. The AI systems must be trained with the help of creative works created by humans -- adding several ethical and practical wrinkles to computerized semi-creativity.\nWhy should I care?\nWhy should I care about generative AI?\nImagine a world where AI can write a best-selling novel, design a skyscraper, or even create a blockbuster movie. In the long run, that's the potential of generative AI. It's not just about creating content; it's about pushing the boundaries of creativity and innovation. These are the long-term goals of generative AI systems. They have a long way to go before becoming truly creative, and the resulting content often comes with obvious flaws. Still, the AI industry is taking giant steps in this direction.\nGenerative AI is also a potential game-changer for businesses. It can automate content creation and personalize user experiences. With this tool in your pocket, you can create good-looking marketing campaigns from scratch, complete with AI-written text and computer-generated images. Text and images used in conversation-style customer interactions don't always have to be perfect, making today's generative AI efforts good enough for many practical purposes.\nBut like any powerful tool, generative AI has its dark side. It can be used to spread misinformation, create deepfakes, or even commit fraud. It's a double-edged sword that nobody knows exactly how to handle yet. The companies behind high-powered generative AI systems must balance unfettered creative ability against the legal and ethical ramifications of doing the job too well.\nFurthermore, the AI systems are trained with reference to existing works of art, literature, music, architecture, and so forth. It's not always clear how much of the credit for an AI-generated piece belongs to the system and how much is a direct copy of a human artist's original work. Many human content creators don't want computers to rely on their creative works to train their systems and sometimes simply copy the originals.\nAnd the computers still need a fair bit of human hand-holding. The auto-generated output is only as good as the human instinct and analysis that went into the text-based instructions and other inputs. Generative AI content can't compare to the art and craft of human creators yet, and it usually must be reviewed by editors before being used for business purposes.\nThe robots can provide assistance to creative processes or deliver good-enough quick takes. But they're not writing the next great American novel or composing brilliant symphonies.\nCompanies involved with AI\nCompanies involved with generative AI\nAs an investor, you can benefit from generative AI in several ways.\nThe most obvious method is to invest directly in businesses that run generative AI services, such as Adobe (ADBE 2.43%) or Microsoft (MSFT 0.56%). The hardware that makes it possible is another simple option, including AI accelerator specialist Nvidia (NVDA 1.65%) and computer memory maker Micron Technology (MU 1.82%).\nBut you have other options. Companies that leverage generative AI technology to run or enhance their existing business may have a competitive edge, and investing in them could yield significant returns as the market develops. Clear examples of this would include voice command systems developer SoundHound AI (SOUN 2.7%) and media-streaming pioneer Netflix (NFLX -0.2%). SoundHound AI relies on ChatGPT to manage conversations with human customers, while Netflix leverages image and video generators as a production tool.\nConsumers can already enjoy the fruits of generative AI. From personalized recommendations to AI-generated art, this technology can enrich your life in countless ways. But be aware of the potential pitfalls. Always question the source of the information and be critical of what you consume.\nHow generative AI is used\nHow generative AI is used\nSome of the best generative AI systems out there combine the language-processing smarts of a chatbot with powerful image-generation tools.\nThe early leaders in this particular field include OpenAI's DALL-E 3, Adobe's Firefly, the independently developed Midjourney, and the self-funded Leonardo.AI. Each platform has its own benefits, downsides, and quirks, but all can turn plain text instructions into stunning images in just a few seconds.\nRelated investing topics\nLimitations\nLimitations\nHowever, designing the instructions in plain old English is arguably an art form in itself. Computers can't read your mind, and even extremely detailed instructions probably won't generate exactly what you visualize.\nOther issues crop up with generative AI productions, too. Before using generative AI tools for business purposes, you'll need to consider many legal, moral, practical, and ethical problems first. In the end, the computers aren't actually creative and you should consider the makers of the underlying training materials. Companies like IBM (IBM 0.94%) specialize in providing generative AI tools with clear audit trails and specific source materials. Enterprise-class AI users crave that legal clarity."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=4051efea-df5e-4ab6-bcb6-2602920c5e66&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000069%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17995",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/types-of-stocks/meme-stocks/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Meme stocks became all the rage among retail investors during the COVID-19 pandemic. Meme stocks are created when a company's shares catch fire with individual investors on social media platforms such as Reddit and quickly skyrocket in price. But, as many traditional investors and analysts point out, these viral stocks can be very risky since they rely on high interest from small investors to sustain the stock prices' liftoff \"to the moon.\"\nHowever, simply writing off all meme stocks as too risky can be a mistake. For the right person, investing in the right meme stock for the right reasons can make a lot of sense.\nOverview\nWhat are meme stocks?\nMeme stocks are a battleground. More traditional investors decry the lack of business fundamentals and strong performance to justify sharp surges in stock price. On the other hand, as individual investors point out, given enough support from the masses, a climbing stock price (regardless of current fundamentals) can eventually equate to a stronger business. This comes from renewed consumer interest, along with a rebounding share price or the raising of fresh cash through capital markets when the stock price rises.\nHow they work\nHow meme stocks work\nSimply put, meme stocks skyrocket in price in a short period (often hours or days) because of a sudden surge in interest online or on social media and subsequent buying among small individual investors. These short-term surges can often reverse course just as quickly, though, making meme stocks far more volatile than average stock market moves.\nThe word \"meme,\" from the ancient Greek word \"mimema\" -- meaning imitation -- is used to describe information that is imitated and often spread via pop culture references on social media. So a meme stock is a shared investing idea imitated by other investors.\nTop meme stocks\nTop meme stocks right now\nNow in year four of the movement, new meme stocks are being created all the time as individual investors look for new ways to beat the stock market. Here are five to do some more digging on (beyond arguably the two most famous meme stocks — video game retailer GameStop (GME 1.46%) and the world's largest movie theater chain AMC (AMC 4.24%).\n| Company | Market Cap | Company Description |\n|---|---|---|\n| Rivian Automotive (NASDAQ:RIVN) | $11.2 billion | EV company ramping up sales of its electric SUV and pickup trucks. |\n| Blackberry (NYSE:BB) | $1.3 billion | Smartphone darling of the 2000s turned software company. |\n| SoFi Technologies (NASDAQ:SOFI) | $6.8 billion | Fast-growing online banking, lending, and investment services |\n| Palantir (NYSE:PLTR) | $53.4 billion | Software company specializing in big data, AI, and digital transformation. |\n| Virgin Galactic (NYSE:SPCE) | $178.8 million | A former SPAC stock and aspiring pioneer in space tourism and travel. |\n1. Rivian Automotive\nRivian is currently in the midst of \"production hell,\" a phrase coined by Tesla CEO Elon Musk when his company was trying to ramp up factory production to stem cash losses. Rivian has had hiccups scaling its R1T electric truck production, but it's making progress.\nAt this point, it's a race against the clock. Its free cash flow was negative $1.5 billion in the first quarter of 2024. Rivian needs to get itself to breakeven before its cash and short-term investment balance ($6 billion at the end of March 2024) dries up.\n2. Blackberry\nThis Canadian company is known for pioneering the smartphone, but it quickly went by the wayside when Apple revolutionized the space. These days, Blackberry is a software firm that provides endpoint security software and other Internet of Things management products for customers such as the auto industry.\n3. SoFi Technologies\nSoFi's financial services -- all unified together via a singular app -- got its start in the student loan niche of the industry. But since becoming a public company, the fintech stock favorite has gotten aggressive, expanding its reach and has added a few million new customers in recent years. As with other fast-moving businesses, SoFi's biggest hurdle now is how quickly it can focus on breakeven.\n4. Palantir\nA member of the hot 2020 IPO stock class, Palantir quickly gained a large investor following after making its public debut. The company builds enterprise big data and AI software that helps organizations update their operations for a digital era. Palantir has concentrated exposure working for government entities, but it's quickly working to expand further into the private sector.\n5. Virgin Galactic\nVirgin Galactic was the first special purpose acquisition company (SPAC) deal struck by former Meta Platforms (NASDAQ:FB) executive Chamath Palihapitiya. The company, founded by Richard Branson, is part of a new billionaire-backed space race with Jeff Bezos' Blue Origin and Elon Musk's SpaceX. Virgin Galactic is conducting science research flights. It started general commercial \"space tourism\" voyages for a hefty ticket price of $450,000 per seat in 2023.\nWhat started the movement?\nWhat started the meme stock movement?\nThe meme stock movement unofficially started in the summer of 2020, when most people were stuck at home during the first few months of the pandemic. Looking to turn some of that extra free time into money, many people turned to the stock market and social media for ideas.\nVideo game retailer GameStop is recognized as the first meme stock. RoaringKitty (aka, Keith Gill) started sharing his views about GameStop stock on Twitter, YouTube, and Reddit's r/wallstreetbets in 2019, explaining why a combination of high short interest from short-sellers (firms that bet against a company) and an undervalued and underappreciated GameStop business could lead to huge gains. Add in a pandemic, a surge in new investors who grew up online, and the ease of stock trading on new apps such as Robinhood Markets (HOOD 2.84%), and all the right ingredients came together to create a viral meme stock movement.\nPros and cons\nPros of meme stocks\nBecause a surge in buying activity can send a stock price soaring, there are some benefits to owning meme stocks (and potential meme stocks before they rocket higher).\n- A chance for very high returns in a short period.\n- An ownership stake in a new investment idea before the rest of the market gets wind of it.\n- A young generation raised on social media has decades of prime investing ahead, so the meme stock movement could be here to stay.\nCons of meme stocks\nAs with other highly volatile investments (such as the related cryptocurrencies movement), there are drawbacks to betting on meme stocks.\n- As with other moments of viral skyrocketing stock prices, the meme stock trend may not last forever -- especially as some traders return to work and spend more time away from home.\n- Short-term stock prices are driven by supply and demand, so price moves are unpredictable and can lead to quick losses.\n- Some meme stocks don't trade on any fundamentals, and returns can suddenly reverse course, causing the company to lose its luster among individual investors.\nIdentifying long-term meme stocks\nHow to identify a good long-term meme stock\nIf you're an investor looking for a longer-term holding (think years rather than days, weeks, or months), there are some important factors to consider before buying a meme stock. Some business fundamentals and economic trends can go a long way toward balancing out what can be fleeting social media trends or hopes of a short-term short squeeze.\n- A company with great fundamentals such as stable or growing revenue, healthy profit margins, and a solid balance sheet (i.e., more cash and equivalents than debt).\n- Great fundamentals aren't required, but if a business is struggling, an actionable plan to improve its financial results over time can do a lot to help sustain stock price growth.\n- If a company has suddenly reached meme stock status and management has yet to comment on what it will do with its newfound strength, look for a business that can benefit from strong secular growth trends (such as technology).\nRelated investing topics\nShould you invest?\nInvesting in meme stocks and ETFs\nEven with meme stocks, the old adage, \"Don't put all your eggs in one basket,\" still rings true. The good news is that meme stocks come from all nooks and crannies of the stock market, so it's possible to build a diversified portfolio of holdings that can catch a tailwind from various places.\nIf you're not interested in building and managing your own portfolio of meme stocks but still want some exposure to the movement, there are some ETF solutions to help. One example is the VanEck Social Sentiment ETF (BUZZ 3.49%), an actively managed portfolio of 75 stocks that rank high in social media conversations. Top holdings in the portfolio include Robinhood Markets, Microstrategy (MSTR 6.1%), and Palantir. This ETF has an annual expense ratio of 0.75% (meaning it costs $7.50 per year for every $1,000 invested).\nMeme stocks lure investors with the promise of potentially big returns in little time. However, for those seeking sustainable long-term gains (the way real multigenerational family wealth is built up), look to build a portfolio of multiple meme stocks that have more than just a one-off chance of providing returns. Bear in mind that meme stocks can be especially volatile, so plan accordingly and be prepared to continue investing more over time."
    },
    {
      "url": "https://www.fool.com/terms/s/sam-altman/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "If you've been following the stock market over the last year, you probably know that generative artificial intelligence (AI) has taken center stage. Excitement surrounding the new technology behind apps like ChatGPT is a major reason the S&P 500 jumped 24% and the Nasdaq Composite soared 43% in a new tech boom.\nArguably, no other person is more central to the generative AI narrative than Sam Altman.\nWho is Sam Altman?\nWho is Sam Altman?\nSam Altman is the CEO of OpenAI, the company behind ChatGPT and other generative AI apps, including the DALL-E image generator. OpenAI is now in the process of raising funding at a valuation of $100 billion, and its launch of ChatGPT in late 2022 sparked the boom in generative AI, putting OpenAI at the center of it.\nGenerative AI\nAltman, who has run OpenAI since 2019, has driven its push to commercialize its products, unleashing a new AI revolution.\nHis background\nWhat is Sam Altman's background?\nAltman established himself as a fixture in Silicon Valley early in his career, dropping out of Stanford after two years in 2005. He and two classmates founded the mobile app Loopt, which allowed users to share their locations.\nThat company was among the first to be funded by start-up incubator Y Combinator. It was eventually sold for $43 million in 2012 to Green Dot (GDOT 0.07%), a financial company known for prepaid debit cards.\nAltman then started a venture fund called Hydrazine Capital, raising $21 million, which he invested in Reddit, among other companies. He took over as president of Y Combinator, increasing its focus on science and engineering companies.\nIn 2015, he co-founded OpenAI with Elon Musk and others. At the time, OpenAI was a nonprofit company designed to develop AI in a safe, beneficial way.\nAltman stepped down as Y Combinator's president and became OpenAI's CEO in 2019. At the same time, he pivoted the company from a nonprofit to a \"capped profit\" after acknowledging earlier that OpenAI neither had any revenue nor any plans to generate revenue.\nHis first moves as CEO included meeting with Microsoft (MSFT 0.56%) CEO Satya Nadella and raising $1 billion from Microsoft after demonstrating OpenAI's models. OpenAI also pivoted to large language models, which led to the development of ChatGPT. Its launch in late 2022 paved the way for another investment from Microsoft, estimated to be worth $10 billion.\nIn November 2023, he was briefly ousted as CEO of OpenAI but was reinstated after an uproar from employees and investors and after co-founder Ilya Sutskever said he'd made a mistake in voting to remove Altman.\nWhat is his AI philosophy?\nWhat is Altman's AI philosophy?\nAltman has somewhat reluctantly become the face of generative AI. The brouhaha at OpenAI, which led to his brief departure, underscores the stakes of the development of this new technology.\nOpenAI was begun with noble intentions, and that DNA still seems to be part of the company. However, Altman also ran into a cold reality of business. The company needs money to pay its engineers and run its models. That has meant developing a business model that now includes selling a paid version of ChatGPT.\nAltman is known for a democratic approach at his companies, encouraging teamwork and diverse perspectives. Despite his brief ousting from OpenAI, Altman seems to have done a good job navigating and bringing together the different groups of stakeholders in OpenAI. All while guiding the transition from a nonprofit to a closely watched for-profit company at the cutting edge of technology.\nWill Altman take OpenAI public?\nWill Sam Altman take OpenAI public?\nOpenAI has said before that it has no plans to go public. Nonetheless, an initial public offering (IPO) might be inevitable if the valuation continues to grow and the company raises more capital.\nRelated investing topics\nThe shake-up last November allowed Altman to seize more control over the company because OpenAI replaced board members who were philosophically at odds with him and had called for his departure. The company's hybrid corporate structure also poses a challenge to going public, although it could change that model as it has in the past.\nOne thing is clear: It's still early in the AI race, and OpenAI will likely remain a leader, meaning investor interest in an IPO is not going away. Although that doesn't mean an IPO will happen, expect the issue to continue to garner attention in the media and from investors."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=74d2f5e3-a605-44dc-acc5-be52894d97ee&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DOklo&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=74d2f5e3-a605-44dc-acc5-be52894d97ee&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/author/20479/",
      "text": "Adam Spatacco\nAdam Spatacco is a contributing Motley Fool technology analyst covering artificial intelligence, robotics, autonomous driving, e-commerce, and cybersecurity stocks. Previously, Adam was an investment banking analyst specializing in mergers and acquisitions, as well as debt and equity capital raises, for software companies. He later worked in corporate development at venture-backed technology start-ups. He holds a bachelor’s degree in business administration with a concentration in finance from the University of Richmond.\nRecent Articles by Adam Spatacco\nAug 16, 2025\nby Adam Spatacco\nHistory Shows That Palantir Stock's Monster Run Is Speeding Toward an Epic Crash -- and It All Might Come Down to 1 Detail That No One Is Talking About\nPalantir is the top-performing stock in the S&P 500 for two years in a row, but a nasty sell-off could be lurking just around the corner.\nPremium Investing Services\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services."
    },
    {
      "url": "https://www.fool.com/terms/m/multibaggers/?utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=1d6397cd-a2a5-42e9-842e-4d4108456da0",
      "text": "Every investor wants to make money in the stock market, and one of the best ways to do it is investing in growth stocks that can generate huge returns.\nSome investors refer to these stocks as multibaggers, a term that was coined by Peter Lynch, the famed fund manager who generated monster returns while leading Fidelity's Magellan Fund for 14 years. Lynch is also known for sharing his knowledge with retail investors in several books, including One Up on Wall Street. Here, we'll describe multibaggers -- what they are, how to find them, where they come from, and a prime example of one.\nWhat is a multibagger?\nWhat is a multibagger?\nA multibagger refers to a stock that has gained by multiples from its cost basis or from another starting point.\nThe term is used to denote a stock that could deliver returns of 100% or more. In the parlance of multibaggers, a four-bagger would refer to a stock that has quadrupled, and a five-bagger means a stock that has increased by five times its original value.\nHow to find them multibaggers?\nHow do you find multibaggers?\nNow that you know what a multibagger is, the next logical question is how to find them.\nIt's not always easy, of course. If every stock were a multibagger, then investing wouldn't be a challenge.\nThere are some qualities that multibaggers tend to have in common, though.\nThe biggest one is high revenue growth. To deliver multibagging returns over a long period of time, these stocks need to be capable of generating high levels of growth, generally more than 20% for several years.\nAdditionally, multibagging stocks tend to have large addressable markets, giving them a long runway for growth. They tend to have disruptive potential since their ability to generate multibagging returns often comes from their ability to buck the odds and disrupt a large entrenched industry.\nSome examples of these kinds of multibagging stocks include Amazon (AMZN 3.12%), Tesla (TSLA 6.18%), and Netflix (NFLX -0.2%).\nNotably, profit isn't an essential component for a multibagging stock since shares can surge on evidence of strong revenue growth and strengthening competitive advantages, and investors assume that profits can come later.\nWhere will the next ones come from?\nWhere will the next multibaggers come from?\nAlthough multibaggers can come from any sector, one of the best places to look for them in is the tech sector since it tends to offer the growth potential that multibaggers need. Additionally, not many tech stocks pay dividends, and investors tend to buy tech stocks because of their growth potential and ability to become multibaggers.\nDuring the COVID-19 pandemic, there were a large number of tech stocks that had achieved multibagging returns. However, many of them gave up those gains in a 2022 selloff as valuation corrected themselves.\nWith those valuations now normalized, a number of tech stocks look poised for multi-bagging returns. Some of the subsectors worth looking into include software, e-commerce, semiconductors, and artificial intelligence.\nIf you're looking to buy a multi-bagging stock, it makes sense to spread your bets since owning one stock that could turn into a 10-bagger or 20-bagger could mean life-changing returns.\nAs you look for these stocks, it is a good idea to be mindful of valuation. Although that's not the most important component of a multibagger, a high valuation can derail a potential winner and instead cause you to lose money.\nRelated investing topics\nMultibagger example\nWhat a multibagger looks like\nOne of the best-known multibaggers in recent years is Amazon.\nThe tech giant is up 142,000% since its initial public offering (IPO), meaning if you had invested back then, you would be sitting on a 1,400-bagger, roughly. The stock may have struggled over the last couple of years, but it's been a nine-bagger over the last decade.\nThe stock has many of the elements typical of a multibagger. It delivered high revenue growth over a long period of time thanks to its growth in e-commerce and cloud computing. Additionally, the company has consistently invested in long-term growth and convinced investors that doing so has enabled it to establish a wide economic moat.\nAmazon has grown despite skepticism that it would be able to do so, overcoming obstacles along the way and delivering massive returns.\nThe stock is moving higher again as another bull market could be starting, and Amazon stock could soon reach all-time highs.\nAt a valuation of more than $1 trillion, it will be hard for the stock to be a multibagger from here, but the stock is worth studying as you search for the next multibagging stocks to buy."
    }
  ],
  "argos_summary": "The article discusses how AI’s growing compute demands are driving interest in energy solutions, particularly nuclear power, and examines Oklo as a speculative micro‑reactor company that may not yet be a true AI enabler. It contrasts Oklo’s hype‑driven valuation with Nvidia’s proven GPU business, noting that Oklo lacks a commercial product and faces regulatory hurdles. The piece also reviews other nuclear and energy stocks such as Cameco, GE Vernova, and Brookfield Renewable, highlighting their roles in the clean‑energy transition, while touching on broader AI, generative‑AI, and meme‑stock trends.",
  "argos_id": "AJQZAHNXJ"
}