{
  "url": "https://www.cleveland.com/entertainment/2025/08/why-the-nexstar-tegna-merger-matters-in-cleveland.html",
  "authorsByline": "jmorona, Joey Morona | jmorona@cleveland.com, Joey Morona",
  "articleId": "c88903e2a8974a98af9b9edcafba02bd",
  "source": {
    "domain": "cleveland.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Cuyahoga County",
      "city": "Cleveland",
      "coordinates": {
        "lat": 41.4996574,
        "lon": -81.6936772
      }
    }
  },
  "imageUrl": "https://www.cleveland.com/resizer/v2/HBOXFIXWJJAZTPE7MQ46WMVOQM.jpg?auth=ed45d945b1213e5bb50639556790f6d11d8a842582a9aecac04d8c2606462a3c&width=1280&quality=90",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T12:56:24.820000+00:00",
  "addDate": "2025-08-23T13:07:08.430283+00:00",
  "refreshDate": "2025-08-23T13:07:08.430286+00:00",
  "score": 1.0,
  "title": "Why the Nexstar-Tegna merger matters in Cleveland",
  "description": "If approved, the deal would put WJW Fox 8 and WKYC Channel 3 under the same ownership, potentially reshaping the local TV landscape",
  "content": "WKYC Channel 3 parent company Tegna has approved a deal to merge with Nexstar, which owns crosstown rival WJW Fox 8. (File photo: Eustacio Humphrey/The Plain Dealer) The Plain Dealer\n\nCLEVELAND, Ohio -- Nexstar Media Group’s plan to buy Tegna in a $6.2 billion deal could shake up local television as we know it. If approved, the merger would put Cleveland’s WJW Fox 8 and WKYC Channel 3 under the same corporate roof.\n\nHere’s what you need to know:\n\nWhy do Nexstar and Tegna want to merge?\n\nBy adding Tegna’s 64 stations to its portfolio of more than 200, Nexstar would cement its status as the nation’s largest local broadcasting company, helping it better compete with tech giants and legacy media companies for advertising dollars. Both companies frame the deal as a way to “strengthen” their properties and ensure “long-term vitality.” The combined entity could also command higher transmission fees from cable and streaming providers.\n\nNexstar already owns WJW Fox 8, historically the market’s top-rated news station. Tegna owns WKYC, Cleveland’s NBC affiliate. The two have been crosstown rivals since the late 1940s. The deal would bring both under Nexstar’s control.\n\nThe merger is illegal under current regulations — for now\n\nFCC rules prohibit one company from owning two of the top four stations in the same market, but there have been exceptions. In Indianapolis, for example, Nexstar is allowed to own the CBS and FOX affiliates because of nuances of the market, which boasts a plethora of independent stations.\n\nThat precedent likely wouldn’t apply in Cleveland under current regulations. Still, in July, the U.S. Court of Appeals for the Eighth Circuit vacated the FCC’s “Top-Four Prohibition” calling the agency’s rationale “arbitrary and capricious.” The court gave the FCC 90 days to justify the rule or let it expire. Momentum appears to favor the latter. FCC Chairman Brendan Carr, a Trump appointee, applauded the court’s decision, saying the regulation “does not match marketplace realities.”\n\nThe FCC also caps how many households a single broadcaster can reach, which is currently 39% of U.S. households. A merged Nexstar-Tegna would cover roughly 80% — more than double the current limit. However, Nexstar CEO Perry Sook has expressed confidence that the FCC may revise or eliminate the cap amid broader deregulatory efforts.\n\n“The initiatives being pursued by the Trump administration offer local broadcasters the opportunity to expand reach, level the playing field and compete more effectively,” Sook said in a statement.\n\nHow could this affect local news?\n\nFree press advocates warn the merger could mean fewer independent voices and leaner newsrooms. Nexstar’s press release reaffirmed its commitment to “fact-based journalism,” but it also touted “synergy realization,” corporate shorthand for cost-cutting and eliminating redundancies. In other markets where one company controls multiple top stations, operations have been consolidated or co-located, even if each outlet keeps its own brand.\n\nCould that someday mean Russ Mitchell and Tracy McCool anchoring the evening news together on WKYC and WJW? The reality is it’s way too early to predict what a combined newsroom might look like. This much is certain — pending FCC action and shareholder approval — change is coming.\n\nIs another suitor in play?\n\nSinclair Broadcast Group — which doesn’t own a station in Cleveland — has also expressed interest in Tegna, though the board has already approved Nexstar’s offer. Sinclair could conceivably make a higher offer that might sway shareholders.\n\nWhen could this happen?\n\nIf regulators and shareholders sign off, the merger is expected to close in the second half of 2026.",
  "medium": "Article",
  "links": [
    "https://www.tegna.com/",
    "https://www.tvtechnology.com/news/eighth-circuit-vacates-fccs-top-four-station-ownership-rule",
    "https://fox8.com/",
    "https://www.wkyc.com/",
    "https://www.nexstar.tv/",
    "https://www.wsj.com/business/deals/tv-station-owner-sinclair-proposes-merger-with-tegna-4bd3bb86?gaa_at=eafs&gaa_n=ASWzDAigcoQiJDx07D3imtF3YS8VAwVYT6hBioaeTek2o5OU19EEYx4QhMg_hLR09wY%3D&gaa_ts=68a8aa65&gaa_sig=WOAs_BLDfZhL1nNlydbSsTvHPN_-_yA8sQhzBtEqq8xtKBVs2OBBEN8NgJp8N0wses5TllX2lqaJYT7_z2WEOQ%3D%3D",
    "https://www.nexstar.tv/nexstar-media-group-inc-enters-into-definitive-agreement-to-acquire-tegna-inc-for-6-2-billion-in-accretive-transaction/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "FCC rules",
      "weight": 0.075551644
    },
    {
      "name": "Nexstar",
      "weight": 0.073177986
    },
    {
      "name": "Nexstar CEO Perry Sook",
      "weight": 0.0726334
    },
    {
      "name": "FCC action",
      "weight": 0.072559886
    },
    {
      "name": "FCC",
      "weight": 0.069952935
    },
    {
      "name": "FCC Chairman Brendan Carr",
      "weight": 0.06863142
    },
    {
      "name": "multiple top stations",
      "weight": 0.06513551
    },
    {
      "name": "legacy media companies",
      "weight": 0.06511265
    },
    {
      "name": "independent stations",
      "weight": 0.065040454
    },
    {
      "name": "local broadcasters",
      "weight": 0.061161514
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.90869140625
    },
    {
      "name": "/News/Other",
      "score": 0.87841796875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.69580078125
    },
    {
      "name": "/News/Local News",
      "score": 0.5283203125
    }
  ],
  "sentiment": {
    "positive": 0.10014557,
    "negative": 0.51558214,
    "neutral": 0.38427228
  },
  "summary": "Nexstar Media Group is planning to buy Tegna in a $6.2 billion deal, which would see Cleveland's WJW Fox 8 and WKYC Channel 3 under the same corporate roof. The acquisition would cement Nexstar's status as the nation's largest local broadcasting company, helping it compete with tech giants and legacy media companies for advertising dollars. The merger is illegal under current FCC rules, but there have been exceptions to this. The combined entity could command higher transmission fees from cable and streaming providers. Free press advocates warn that the merger could result in fewer independent voices and leaner newsrooms.",
  "shortSummary": "Nexstar Media Group's $6.2 billion merger with Tegna could significantly enhance local broadcasting, potentially leading to fewer independent voices and fewer newsrooms.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cf7d3a25e5c5447493acc6326be1ee1c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nexstar.tv/",
      "text": "Nexstar Media Group, Inc. is a leading diversified media company that produces and distributes engaging local and national news, sports and entertainment content across its television and digital platforms, including more than 316,000 hours of programming produced annually by its business units. Nexstar owns America’s largest local broadcasting group comprised of top network affiliates, with more than 200 owned or partner stations in 116 U.S. markets reaching 220 million people.\nAt A Glance\n201 Total Stations\n70% U.S. Household Reach\n$5.41 billion 2024 Net Revenue\n138 Local Websites\n229 Local Mobile Apps\n116 Television Markets\nA History of Growth\nDuring the last 25+ years, Nexstar has grown from a single station to become the nation’s largest local television and media company. The Company’s record of long-term growth reflects its organization-wide commitment to delivering exceptional service to our communities and outstanding results for our advertising partners.\nA Commitment to Local\nThe Nexstar team is comprised of over 13,000 employees across America united by a common vision, a commitment to localism and a passion for professional excellence. Today, Nexstar delivers unique locally-produced programming and content to more than 70% of U.S. television households, while offering local businesses, advertisers and brands the ability to connect with local consumers through its premium local multi-platform marketing opportunities. Today, Nexstar produces more than 316,000 hours of news, sports, and entertainment programming a year and plans to expand its local programming over the coming year.\nA Dedication to Digital\nNexstar’s leading portfolio of digital products and services deliver the power and reach of digital content publishing, marketing and video advertising to clients and advertisers. Nexstar’s Digital division continues to diversify and expand its offerings with complementary technologies and capabilities including native advertising, social media, ad ops, design, development, and a host of other valuable products and services. Taken together, Nexstar’s digital properties would be among the top ten in the U.S. as ranked by Comscore, Inc. based on online user activity. Nexstar’s television and digital media operations have over 13,000 employees across 116 markets who are committed to delivering superior, trust worthy local news, sports, entertainment programming and content to local viewers while offering businesses and advertisers unparalleled marketing opportunities across screens and devices.\n“Nexstar’s television and digital media operations have over 13,000 employees across 116 markets who are committed to delivering superior local news, sports, entertainment programming and content to local viewers while offering businesses and advertisers unparalleled marketing opportunities across all screens and devices. Our industry-wide leadership in delivering exceptional service to the local communities in our markets continues to be a key component of our success and long-term growth.”\nPerry A. Sook, Chairman and CEO"
    },
    {
      "url": "https://www.wkyc.com/",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://www.tvtechnology.com/news/eighth-circuit-vacates-fccs-top-four-station-ownership-rule",
      "text": "U.S. Appeals Court Vacates FCC’s Top-Four Station Ownership Rule\nNAB, FCC chair Brendan Carr applaud 8th Circuit’s ruling overturning FCC rules that station groups can’t own more than one of the four most-watched TV stations in a market\nWASHINGTON—In an important development in the battle over broadcast ownership regulations, the 8th U.S. Circuit Court of Appeals has vacated the Federal Communications Commission’s rules against a station group owning more than one of the top-four TV stations in audience share in a given market.\nThe St. Louis-based court also vacated an amendment to “Note 11” in the FCC rules that tightened how the top four stations are determined, but declined to undo rules governing radio stations and denied the petition for review of all other issues.\nUnder the Telecommunications Act of 1996, the FCC is required to review its broadcast ownership rules every four years and repeal or modify any that are no longer in the public interest. Following a December 2023 FCC order retaining existing regulations as part of its 2018 quadrennial review, the National Association of Broadcasters and a coalition of local broadcasters challenged the order, arguing that the FCC’s approach ignored the competitive pressures broadcasters face from digital platforms and failed to meet the statutory requirements for review.\nThe 8th Circuit ruling found that the FCC’s rationale for retaining the rules was “arbitrary and capricious,” “unsupported by the record” and relied on “outdated” or insufficient evidence. The court wrote that “in light of the evidence against the Top-Four Prohibition and in the absence of any record-supported reason for keeping the rule,” the Commission failed to justify its continued enforcement of that regulation.\nThe ruling comes at a time when broadcasters have been hopeful that the FCC might significantly revise or eliminate the ownership rules. FCC Chair Brendan Carr has vowed to eliminate rules that make it harder for broadcasters to fund local news and the agency has opened a docket calling for public comment on the rules.\nIn response to the ruling, Carr and the NAB applauded the decision.\n“NAB is extremely pleased with the Eighth Circuit’s decision to vacate the previous FCC’s arbitrary and outdated top-four prohibition,” NAB president and CEO Curtis LeGeyt said. “This is a major step forward for local television broadcasters seeking to compete and thrive in a vastly transformed media marketplace.\nThe professional video industry's #1 source for news, trends and product and tech information. Sign up below.\n“At the same time, we are disappointed that the court stopped short of addressing the decades-old radio ownership restrictions that defy economic reality and weaken broadcasters’ ability to compete, invest in local journalism and serve their communities,” he added. “Fortunately, FCC Chairman Brendan Carr has long been a champion for empowering local stations, and we look forward to working with this FCC to modernize its local radio ownership rules and ensure local broadcasters can thrive in the communities they serve across the nation.”\nWhen Carr was a commissioner, he opposed the 2023 FCC Order.\nIn response to the 8th Circuit ruling, Carr said: “For decades, the FCC’s approach to regulating the broadcast industry has failed to promote the public interest. That has only made it harder for trusted and local sources of news and information to compete in today’s media environment. And that is why I dissented from the Biden-era FCC’s decision to retain a regulation that does not match marketplace realities. I am pleased to see that the court agrees and has vacated that regulation.”\nThe FCC has approved some recent transactions allowing broadcasters to own more than one top-four station. In July, Gray and Scripps also have entered into station swaps that would require a waiver of the rule.\nThe full ruling is available here.\nGeorge Winslow is the senior content producer for TV Tech. He has written about the television, media and technology industries for nearly 30 years for such publications as Broadcasting & Cable, Multichannel News and TV Tech. Over the years, he has edited a number of magazines, including Multichannel News International and World Screen, and moderated panels at such major industry events as NAB and MIP TV. He has published two books and dozens of encyclopedia articles on such subjects as the media, New York City history and economics."
    },
    {
      "url": "https://www.nexstar.tv/nexstar-media-group-inc-enters-into-definitive-agreement-to-acquire-tegna-inc-for-6-2-billion-in-accretive-transaction/",
      "text": "Nexstar Media Group, Inc. Enters into Definitive Agreement To Acquire TEGNA Inc. for $6.2 Billion in Accretive Transaction\nEnhances Nexstar’s Position as a Leading Local Media Company\nPreserves High-Quality Local Journalism and Diversity of Opinion\nStrengthens Ability to Compete with Big Tech and Big Media\nExpected to Drive Increased Profitability and Returns for Nexstar Shareholders\nIRVING, Texas and TYSONS, Virginia (Aug. 19, 2025) – Nexstar Media Group, Inc. (Nasdaq: NXST) (“Nexstar”) and TEGNA Inc. (NYSE: TEGNA) (“TEGNA”) announced today that they entered into a definitive agreement (the “Agreement”) whereby, subject to regulatory approvals, Nexstar will acquire all outstanding shares of TEGNA for $22.00 per share in a cash transaction valued at $6.2 billion, inclusive of TEGNA’s net debt and estimated transaction fees and expenses. The purchase price represents a 31% premium to TEGNA’s average 30-day average stock price ending August 8, 2025, the last closing stock price prior to media reports of a potential transaction. Following completion of the transaction, the combined entity will be a leading local media company, well-positioned to compete in today’s fragmented and rapidly evolving marketplace. The new company will be better able to serve communities by ensuring the long-term vitality of local news and programming from trusted local sources and preserving the diversity of local voice and opinion. Nexstar will also be able to provide advertisers with an even greater variety of competitive local and national broadcast and digital advertising solutions to serve brands and consumers more effectively.\nNexstar’s Chairman and Chief Executive Officer, Perry A. Sook, commented, “The initiatives being pursued by the Trump administration offer local broadcasters the opportunity to expand reach, level the playing field, and compete more effectively with the Big Tech and legacy Big Media companies that have unchecked reach and vast financial resources. We believe TEGNA represents the best option for Nexstar to act on this opportunity. TEGNA is a premier operator with high quality local television stations primarily in the top 75 DMAs. We and TEGNA are similarly dedicated to providing communities of all sizes with the best programming and fact-based local journalism along with innovative digital products and marketing solutions for local viewers and advertisers. The transaction will increase Nexstar’s reach through the expansion of our presence in important DMAs such as Atlanta, Phoenix, Seattle, and Minneapolis, as well as enhance our local presence, enabling us to continue to provide the core local news and programming that is in the public’s interest.”\nMr. Sook continued, “Nexstar has a stellar long-term record of growth through its deals, having completed many well-received transactions since 2011, including the 2019 acquisition of Tribune Media. The playbook we followed to make those transactions successful – improving and increasing local content, executing on identified synergies, and quickly de-leveraging our balance sheet with free cash flow post close – are the same opportunities and strategies we will use in connection with this transaction. With committed financing and a plan for significant synergy realization, we believe the combined entity will be poised for growth, leverage reduction, and the enhancement of shareholder value.”\nHoward Elias, Chairman of TEGNA’s Board of Directors commented, “At TEGNA, we share Nexstar’s commitment to local broadcasting, exemplified by numerous investments and initiatives, industry journalism awards, and the significant expansion of our local news content. This transaction, which will provide premium near-term value to TEGNA shareholders, comes at a time of rapid change in our industry and reflects the fact that policymakers of all perspectives are calling for regulations governing our industry to be modernized. This transaction with Nexstar will further solidify the critical role our stations serve in our communities, preserve their trust, and be better able to compete in today’s highly fragmented media environment.”\nMike Steib, Chief Executive Officer of TEGNA, said, “We are thrilled to have found a partner in Nexstar that will enable TEGNA’s stations to continue doing what we do best: creating outstanding and impactful local content coupled with the delivery of indispensable digital products to the communities we serve around the country. Nexstar and TEGNA both share a rich heritage of commitment to journalistic excellence and technological advancements. Together, we will expand news coverage to serve more communities, across more screens, and ultimately secure the future of local news for generations to come.”\nTransaction Details\n- TEGNA purchase price of $22.00 per share, reflects a 31% premium to TEGNA’s unaffected 30-day average stock price ending August 8, 2025.\n- Transaction has been unanimously approved by TEGNA’s Board of Directors.\n- TEGNA debt will be refinanced and/or assumed at close.\n- Committed financing in place from BofA Securities, J.P. Morgan Chase N.A., and Goldman Sachs & Co. LLC to finance the transaction.\nTransaction Highlights\n- Combines two best-in-class television broadcast companies which share an unwavering commitment to localism, innovation, and superior, trustworthy programming.\n- Increases operational and geographic diversity and scale. Upon closing, Nexstar, together with its partners, will have 265 full-power television stations in 44 states and the District of Columbia and 132 of the country’s 210 television DMAs. The combined company will have stations in 9 of the top 10 DMAs, 41 of the top 50 DMAs, 62 of the top 75 DMAs and 82 of the top 100 DMAs, covering, in total, 80% of U.S. television households.\n- Enhances presence in local DMAs. Nexstar’s station footprint overlaps with TEGNA in 35 of TEGNA’s 51 DMAs, providing improved synergy potential in these markets.\n- Extends footprint to additional contested election DMAs. The addition of strong Big-4 affiliates in key contested election DMAs, such as Phoenix, AZ, Atlanta, GA, Toledo, OH, and Portland, ME, will enhance the political advertising outlook for Nexstar in even-numbered years.\nFinancial Summary and Outlook\n- On a combined basis for the last eight quarters annualized ending June 30, 2025, Nexstar, together with TEGNA, would have combined net revenue (excluding synergies) of $8.10 billion and combined Adjusted EBITDA (excluding synergies) before stock-based compensation of $2.56 billion.\n- Based on our estimates for 2025, Nexstar expects to generate annual net synergies of approximately $300 million from a combination of revenue synergies and net operating expense reductions.\n- Together, the Adjusted Free Cash Flow of TEGNA, the expected synergies on an after-tax basis and the estimated after-tax financing costs related to the transaction, is expected to be more than 40% accretive to Nexstar’s standalone Adjusted Free Cash Flow in the first twelve months after closing.\n- After giving effect to the transaction, the incurrence of transaction-related debt, transaction expenses, and expected synergies, Nexstar expects its net leverage ratio to be approximately 4x at closing with de-leveraging to current leverage levels in 2028. As of June 30, 2025, Nexstar’s total net leverage ratio was 3.19x.\n- Consistent with past transactions, Nexstar initially intends to allocate excess free cash flow to repay debt.\nTiming and Approvals\n- The transaction is subject to customary closing conditions, including TEGNA shareholder and regulatory approvals.\n- The transaction is expected to close by the second half of 2026.\nAdvisors\nBofA Securities, J.P. Morgan Securities LLC, and Goldman Sachs & Co. LLC are acting as financial advisors and Kirkland & Ellis LLP, Wiley Rein LLP, and Morrison Foerster are acting as legal counsel to Nexstar.\nAllen & Company LLC is acting as financial advisor to TEGNA and Wachtell, Lipton, Rosen & Katz, and Covington & Burling LLP are acting as its legal counsel.\nConference Call, Webcast, Investor Presentation\nNexstar will host a conference call today, August 19, at 10:00 a.m. ET to review the transaction and host a question-and-answer session. To access the conference call, interested parties may dial 877-407-9208 or 201-493-6784 (domestic and international callers). The Conference ID Number is 13755507. Participants can also listen to a live webcast of the call from Nexstar’s website at www.nexstar.tv or TEGNA’s website at www.tegna.com.\nDuring the conference call and webcast, management will review a presentation summarizing the proposed transaction which can be accessed at www.nexstar.tv. A webcast replay will be available for 90 days following the live event at www.nexstar.tv. Please call five minutes in advance to ensure that you are connected. Questions and answers will be taken only from participants on the conference call. For the webcast, please allow 15 minutes to register, download and install any necessary software.\nForward Looking Statements\nThis communication includes forward-looking statements. Nexstar and TEGNA have based these forward-looking statements on Nexstar’s and TEGNA’s current expectations and projections about future events. Forward-looking statements include information preceded by, followed by, or that includes the words “guidance,” “believes,” “expects,” “anticipates,” “could,” or similar expressions. For these statements, Nexstar and TEGNA claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. The forward-looking statements contained in this communication, concerning, among other things, the ultimate outcome, benefits and synergies of any possible transaction between Nexstar and TEGNA and timing thereof, and future financial performance, including changes in net revenue, cash flow and operating expenses, involve risks and uncertainties, and are subject to change based on various important factors, including the timing of and any potential delay in consummating the proposed transaction, the risk that the conditions to closing of the proposed transaction (including the necessary regulatory approvals or the approval of TEGNA’s stockholders) may not be satisfied in the anticipated timeframe or at all and the transaction may not close, the risk that a regulatory approval that may be required for the proposed transaction is delayed, is not obtained or is obtained subject to conditions that are not anticipated, the risk of the occurrence of any event, change or other circumstance that could give rise to the termination of the Agreement, the risk that Nexstar fails to obtain the necessary financing arrangements set forth in the debt commitment letters delivered pursuant to the Agreement, the risk that any announcements relating to the proposed transaction could have adverse effects on the market price of Nexstar’s or TEGNA’s common stock, the risk that the disruption from the proposed transaction may make it more difficult to maintain business and operational relationships, including retaining and hiring key personnel and maintaining relationships with Nexstar’s or TEGNA’s customers, vendors and others with whom it does business, the risks related to disruption of TEGNA management’s attention from TEGNA’s ongoing business operations due to the proposed transaction, the impact of changes in national and regional economies, the ability to service and refinance Nexstar’s and/or TEGNA’s outstanding debt, successful integration of TEGNA (including achievement of synergies and cost reductions), pricing fluctuations in local and national advertising, future regulatory actions and conditions in the television stations’ operating areas, competition from others in the broadcast television markets, volatility in programming costs, the effects of governmental regulation of broadcasting, industry consolidation, technological developments and major world news events. Unless required by law, Nexstar and TEGNA undertake no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. In light of these risks, uncertainties and assumptions, the forward-looking events discussed in this communication might not occur. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this release. For more details on factors that could affect these expectations, please see Nexstar’s and TEGNA’s filings with the Securities and Exchange Commission.\nThis press release also includes certain forward-looking non-GAAP financial measures, which Nexstar and TEGNA management believe to be useful to investors and analysts. A reconciliation to historical non-GAAP figures is provided at the end of this release. Nexstar and TEGNA are unable to provide a full reconciliation of the non-GAAP measures used in the forward-looking measures without unreasonable effort because it is not possible to predict with a reasonable degree of certainty the information necessary to calculate such measures on a GAAP basis because such information is dependent on future events that may be outside of Nexstar’s and TEGNA’s control. The unavailable information could have a significant impact on Nexstar and TEGNA’S GAAP financial results.\nAdditional Information and Where to Find It\nThis communication is being made in respect of a proposed business combination involving Nexstar and TEGNA. In connection with the proposed transaction, TEGNA intends to file relevant materials with the U.S. Securities and Exchange Commission (the “SEC”), including a preliminary proxy statement on Schedule 14A. The information in the preliminary proxy statement will not be complete and may be changed. TEGNA will deliver the definitive proxy statement to its shareholders as required by applicable law. This communication does not constitute a solicitation of any vote or approval and is not a substitute for any proxy statement or any other document that may be filed with the SEC in connection with the proposed business combination. INVESTORS AND SECURITY HOLDERS OF TEGNA ARE URGED TO READ THE DEFINITIVE PROXY STATEMENT AND OTHER DOCUMENTS FILED WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. Investors and security holders will be able to obtain these materials (when they are available) and other documents filed with the SEC free of charge at the SEC’s website, www.sec.gov. Copies of documents filed with the SEC by TEGNA (when they become available) may also be obtained free of charge from TEGNA’s website at TEGNA.com.\nThe description of the definitive agreement and the transactions contemplated thereby in this press release is subject to, and is qualified in its entirety by reference to, the full terms of the merger agreement, which Nexstar and TEGNA will each be filing with the U.S. Securities and Exchange Commission on Form 8-K. Upon completion of the transaction, TEGNA’s common stock will no longer be publicly listed.\nParticipants in the Solicitation\nTEGNA and certain of its directors, executive officers and employees may be deemed to be participants in the solicitation of proxies in respect of the proposed transaction. Information regarding TEGNA’s directors and executive officers is available in TEGNA’s proxy statement for the 2025 annual meeting of stockholders, which was filed with the SEC on April 8, 2025 (the “2025 Annual Meeting Proxy Statement”), and in other documents filed by TEGNA with the SEC. Please refer to the sections captioned “Director Compensation,” “Executive Compensation” and “Securities Beneficially Owned by Directors, Executive Officers and Principal Shareholders” in the 2025 Annual Meeting Proxy Statement. To the extent holdings of such participants in TEGNA’s securities have changed since the amounts described in the 2025 Annual Meeting Proxy Statement, such changes have been reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Change in Ownership on Form 4 filed with the SEC: Form 4s, filed by Lynn B. Trelstad on April 11, 2025, August 4, 2025 and August 7, 2025; Form 4s, filed by Scott K. McCune on May 5, 2025 and May 23, 2025; Form 4s, filed by Catherine Dunleavy on May 5, 2025 and May 23, 2025; Form 4s, filed by Gina L. Bianchini on May 5, 2025 and May 23, 2025; Form 4s, filed by Neal Shapiro on May 5, 2025 and May 23, 2025; Form 4s, filed by Howard D. Elias on May 5, 2025 and May 23, 2025; Form 4s, filed by Stuart J. Epstein on May 5, 2025 and May 23, 2025; Form 4, filed by Karen H. Grimes on May 5, 2025; Form 4s, filed by Denmark West on May 5, 2025 and May 23, 2025; Form 4, filed by Melinda Witmer on May 23, 2025; Form 4, filed by Henry Wadsworth McGee III on May 23, 2025; Form 4, filed by Julie Heskett on June 4, 2025; Form 4, filed by Thomas R. Cox on June 4, 2025; Form 4, filed by Clifton A. McClelland III on August 7, 2025. Other information regarding the participants in the proxy solicitation and a description of their direct and indirect interests, by security holdings or otherwise, will be contained in the Proxy Statement and other relevant materials to be filed with the SEC in connection with the proposed transaction when they become available. Free copies of the Proxy Statement and such other materials may be obtained as described in the preceding paragraph.\nAbout Nexstar Media Group, Inc.\nNexstar Media Group, Inc. (NASDAQ: NXST) is a leading diversified media company that produces and distributes engaging local and national news, sports and entertainment content across its television and digital platforms, including more than 316,000 hours of programming produced annually by its business units. Nexstar owns America’s largest local television broadcasting group comprised of top network affiliates, with more than 200 owned or partner stations in 116 U.S. markets reaching 220 million people. Nexstar’s national television properties include The CW, America’s fifth major broadcast network, NewsNation, our national news network providing “News for All Americans,” popular entertainment multicast networks Antenna TV and Rewind TV, and a 31.3% ownership stake in TV Food Network. The Company’s portfolio of digital assets, including its local TV station websites, The Hill and NewsNationNow.com, are collectively a Top 10 U.S. digital news and information property. For more information, please visit nexstar.tv.\nMedia Contact:\nGary Weitman\nEVP and Chief Communications Officer\nNexstar\n972/373-8800 (office) or\ngweitman@nexstar.tv\nInvestor Contact:\nJoe Jaffoni or Jennifer Neuman\nJCIR\n212/835-8500 or\nnxst@jcir.com\nAbout TEGNA Inc.\nTEGNA Inc. (NYSE: TGNA) helps people thrive in their local communities by providing the trusted local news and services that matter most. With 64 television stations in 51 U.S. markets, TEGNA reaches more than 100 million people monthly across the web, mobile apps, connected TVs, and linear television. Together, we are building a sustainable future for local news. For more information, TEGNA.com.\nMedia Contact:\nMolly McMahon\nSenior Director, Corporate Communications\n703-873-6422\nmmcmahon@tegna.com\nInvestor Contact:\nJulie Heskett\nSenior Vice President, Chief Financial Officer\n703-873-6747\ninvestorrelations@tegna.com\nReconciliation of Combined Net Revenue, Net Income and Combined Adjusted EBITDA(1)\n($ in millions, unaudited)\nAnnualized for the Last Eight Quarters Ended June 30, 2025(2)\n| Nexstar | TEGNA | Combined | ||||\n| Net Revenue | $5,153 | $2,948 | $8,101 | |||\n| Net Income | 489 | 449 | 938 | |||\n| Adjusted EBITDA | 1,751 | 807 | 2,558 | |||\n| Net Revenue | Nexstar | TEGNA | Combined | |||\n| Six months ended June 30, 2025 | $2,462 | $1,355 | $3,817 | |||\n| Year Ended December 31, 2024 | 5,407 | 3,102 | 8,509 | |||\n| Year Ended December 31, 2023 | 4,933 | 2,911 | 7,844 | |||\n| Six months ended June 30, 2023 | 2,497 | 1,472 | 3,969 | |||\n| Net Income | Nexstar | TEGNA | Combined | |||\n| Six months ended June 30, 2025 | $188 | $126 | $314 | |||\n| Year Ended December 31, 2024 | 683 | 599 | 1,282 | |||\n| Year Ended December 31, 2023 | 270 | 476 | 746 | |||\n| Six months ended June 30, 2023 | 163 | 304 | 467 | |||\n| Adjusted EBITDA | Nexstar | TEGNA | Combined | |||\n| Six months ended June 30, 2025 | $770 | $298 | $1,068 | |||\n| Year Ended December 31, 2024 | 2,004 | 960 | 2,964 | |||\n| Year Ended December 31, 2023 | 1,477 | 763 | 2,240 | |||\n| Six months ended June 30, 2023 | 749 | 408 | 1,157 |\n- Represents the combined results of Nexstar and TEGNA and are not intended to represent pro forma financial information under Section 11 of Regulation S-X of the Securities Exchange Act of 1934, as amended.\n- Annualized amounts are calculated by dividing the sum of the results during the last eight quarters ended June 30, 2025\nby two.\nReconciliation of Adjusted EBITD\n($ in millions, unaudited)\n|\nNexstar |\nSix Months Ended, 6/30/25 |\nYear Ended, 12/31/24 |\nYear Ended, 12/31/23 |\nSix Months Ended, 6/30/23 |\n| Net income | $188 | $683 | $270 | $163 |\n| Add (Less): | ||||\n| Transaction, other one-time and restructuring expenses(1) | 10 | 12 | 15 | 11 |\n| Stock-based compensation expense | 39 | 78 | 60 | 27 |\n| Depreciation and amortization expense | 402 | 808 | 941 | 511 |\n| (Amortization) of broadcast rights expense | (168) | (324) | (453) | (269) |\n| Goodwill and long-lived assets impairments | – | 24 | 35 | – |\n| Amortization of basis difference of equity method investments | 35 | 70 | 70 | 35 |\n| Interest expense, net | 194 | 444 | 447 | 218 |\n| Pension and other postretirement plans (credit), net | (16) | (27) | (36) | (19) |\n| Income tax expense | 80 | 276 | 131 | 77 |\n| Gain on disposal of an investment | – | (40) | – | – |\n| Other | 6 | – | (3) | (5) |\n| Adjusted EBITDA | $770 | $2,004 | $1,477 | $749 |\n|\nTEGNA |\nSix Months Ended, 6/30/25 |\nYear Ended, 12/31/24 |\nYear Ended, 12/31/23 |\nSix Months Ended, 6/30/23 |\n| Net income | $126 | $599 | $476 | $304 |\n| Add (Less): | ||||\n| Merger termination fee | – | – | (136) | (136) |\n| M&A-related costs | – | 2 | 20 | 20 |\n| Retention costs(2) | 2 | 14 | 8 | – |\n| Workforce restructuring | 3 | 19 | – | – |\n| Octillion earnout adjustment | 2 | (4) | – | – |\n| Stock-based compensation expense(3) | 11 | 29 | 21 | 9 |\n| Depreciation | 31 | 60 | 60 | 30 |\n| Amortization of intangible assets | 18 | 54 | 53 | 27 |\n| Asset impairment and other | – | 1 | 4 | 3 |\n| Interest expense | 84 | 169 | 173 | 86 |\n| Interest income | (16) | (27) | (29) | (16) |\n| Provision for income taxes | 35 | 174 | 130 | 76 |\n| Other non-operating items, net | 2 | (130) | (17) | 5 |\n| Adjusted EBITDA | $298 | $960 | $763 | $408 |\n- Primarily includes severance, legal and other direct expenses associated with our completed or proposed strategic transactions and/or acquisitions, any fees or other direct expenses associated with financing transactions, and severance and other direct expenses associated with restructuring activities.\n- Includes stock-based compensation and cash retention costs.\n- Excludes stock-based compensation expense from TEGNA’s stock 401(k) match contributions."
    }
  ],
  "argos_summary": "Nexstar Media Group has agreed to buy Tegna for $6.2 billion, a deal that would bring Cleveland’s WJW Fox 8 and WKYC Channel 3 under one owner and make Nexstar the largest local TV broadcaster. The merger faces regulatory hurdles, notably the FCC’s top‑four ownership rule, but a recent court ruling vacating that rule may ease approval. The consolidation could boost Nexstar’s reach to about 80 % of U.S. households and generate synergies, though critics warn it could reduce newsroom independence and cut costs. If approved, the transaction is expected to close in the second half of 2026.",
  "argos_id": "B06OKFUWW"
}