{
  "url": "https://www.business-standard.com/amp/pti-stories/national/india-can-explore-alternative-markets-to-offset-us-tariffs-mpeda-chief-125082300714_1.html",
  "authorsByline": "Business Standard",
  "articleId": "3ce32313af0a42b0b1cd5182c38afc87",
  "source": {
    "domain": "business-standard.com",
    "location": {
      "country": "in",
      "city": "New Delhi",
      "coordinates": {
        "lat": 28.6138954,
        "lon": 77.2090057
      }
    }
  },
  "imageUrl": "https://bsmedia.business-standard.com/_media/bs/img/article/2025-07/03/full/1751565059-8053.jpg",
  "country": "in",
  "language": "en",
  "pubDate": "2025-08-23T17:54:39+05:30",
  "addDate": "2025-08-23T12:40:28.457188+00:00",
  "refreshDate": "2025-08-23T12:40:28.457190+00:00",
  "score": 1.0,
  "title": "India can explore alternative markets to offset US tariffs: MPEDA chief",
  "description": "India's seafood industry can explore alternative markets to cushion the impact of higher US tariffs on a range of Indian goods, D V Swamy, chairman of the Marine Products Export Development Authority (MPEDA), said on Saturday.",
  "content": "India's seafood industry can explore alternative markets to cushion the impact of higher US tariffs on a range of Indian goods, D V Swamy, chairman of the Marine Products Export Development Authority (MPEDA), said on Saturday.\n\nSwamy noted that the country's marine products sector has repeatedly shown resilience in the face of crises. He said the Centre has identified Russia, the UK, the European Union, Norway, Switzerland, the Middle East and South Korea as new focus markets for seafood exports.\n\nLet's not call it an obstacle; it's actually an opportunity. We learn from challenges and improve with each of them, Swamy said at a press conference on the eve of MPEDA's 53rd anniversary. The agency is an autonomous body under the Union Ministry of Commerce and Industry, mandated to promote India's seafood exports.\n\nThe MPEDA chief said the sector has been adaptive throughout its five-decade history and stressed the need to diversify both markets and seafood varieties. Ecuador is one country that might give India added competition in the coming years, he noted. According to MPEDA data, the US and China remain India's largest seafood markets, with America topping imports of frozen shrimp at 3,11,948 metric tonnes, followed by China at 1,36,164 MT. In 2024-25, India exported 16,98,170 MT of seafood worth Rs 62,408.45 crore ($7.45 billion). Frozen shrimp continued to dominate exports, accounting for 44 per cent of quantity and value, followed by frozen fish (20%), frozen squid, frozen cuttlefish, and chilled and live items.\n\nAndhra Pradesh led the state-wise export tally with shipments worth $2,536.77 million, followed by Tamil Nadu ($840.11 million), Kerala ($829.42 million), Gujarat ($702.75 million), West Bengal ($518.71 million) and Telangana ($73.44 million). By port share, Visakhapatnam ranked first with 31.52 per cent of exports, followed by Navi Mumbai's JNPT (10.81 per cent), Kochi (9.70 per cent), Chennai (7.75 per cent) and Kolkata (7.49 per cent). Swamy recalled that India had earlier overcome the black tiger shrimp crisis of the early 2000s, when farmed shrimp output collapsed, and said diversification would be crucial going forward. Black Tiger shrimp and Scampi are emerging as growing export varieties, he added.\n\nMPEDA said it has stepped up overseas engagement over the past 11 years, participating in international seafood fairs in the US, Spain, Germany, China, Japan, Korea, Russia and Dubai. In the last five years alone, it organised 92 buyer-seller meets and facilitated 12 exporter delegations abroad. The authority also announced that its flagship annual event, the Seafood Bharat Expo, will be held in Chennai from July 1 to 3, 2026.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "seafood exports",
      "weight": 0.08911885
    },
    {
      "name": "Frozen shrimp",
      "weight": 0.08303205
    },
    {
      "name": "frozen shrimp",
      "weight": 0.08303205
    },
    {
      "name": "seafood varieties",
      "weight": 0.07190337
    },
    {
      "name": "international seafood fairs",
      "weight": 0.07134569
    },
    {
      "name": "growing export varieties",
      "weight": 0.070646144
    },
    {
      "name": "alternative markets",
      "weight": 0.0705714
    },
    {
      "name": "farmed shrimp output",
      "weight": 0.0701423
    },
    {
      "name": "India",
      "weight": 0.06931398
    },
    {
      "name": "higher US tariffs",
      "weight": 0.06931223
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.96142578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.91943359375
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.857421875
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.41357421875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.40576171875
    }
  ],
  "sentiment": {
    "positive": 0.608139,
    "negative": 0.06403481,
    "neutral": 0.32782617
  },
  "summary": "India's seafood industry can explore alternative markets to offset the impact of higher US tariffs on Indian goods, according to chairman of the Marine Products Export Development Authority (MPEDA). The MPEDA has identified Russia, the UK, the European Union, Norway, Switzerland, the Middle East and South Korea as new focus markets for seafood exports. The US and China remain India's largest seafood markets, with America topping imports of frozen shrimp at 3,11,948 metric tonnes and China at 1,36,164 MT. In 2024-25, India exported 16,98,170 MT of seafood worth Rs 62,408.45 crore ($7.45 billion).",
  "shortSummary": "India's seafood industry can explore alternative markets to offset higher US tariffs, emphasizing resilience and diversification, with focus focusing on Russia, UK, and South Korea.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "36a5269afd9847c1aa77717a13432fd2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "India’s seafood sector is looking to diversify its export markets in response to higher US tariffs, with MPEDA’s chairman D V Swamy identifying Russia, the UK, the EU, Norway, Switzerland, the Middle East and South Korea as new targets.  The United States and China remain the largest buyers, with frozen shrimp accounting for 44 % of exports, followed by frozen fish and other products.  Andhra Pradesh leads state‑level exports and Visakhapatnam the port share, while the industry is expanding into varieties such as black tiger shrimp and scampi.  MPEDA has increased overseas engagement, hosting buyer‑seller meets and planning the 2026 Seafood Bharat Expo in Chennai.",
  "argos_id": "DNG58CC09"
}