{
  "url": "https://www.ksl.com/article/51363326/weber-county-attorney-use-of-deadly-force-was-justified-in-5-incidents-dating-back-a-year",
  "authorsByline": "Tim Vandenack, KSL.com",
  "articleId": "a1155980b7f74db688327a402fa4dae5",
  "source": {
    "domain": "ksl.com",
    "location": null
  },
  "imageUrl": "https://img.ksl.com/slc/3106/310688/31068827.jpeg?filter=kslv2/responsive_story_lg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T16:04:17+00:00",
  "addDate": "2025-08-23T16:19:29.517432+00:00",
  "refreshDate": "2025-08-23T16:19:29.517435+00:00",
  "score": 1.0,
  "title": "Weber County attorney: Use of deadly force was justified in 5 incidents dating back a year",
  "description": "Weber County Attorney Christopher Allred determined use of deadly force was justified by police and sheriff's officials in five incidents dating to Aug. 6, 2024.",
  "content": "OGDEN — Weber County Attorney Christopher Allred has determined that law enforcement authorities were justified in the use of deadly force in four fatal shootings in the county dating to August 2024.\n\nAuthorities were also justified in using such force in the shooting last May of a fifth suspect, who survived the incident, the attorney said.\n\nAllred's determinations, not previously reported on and based on reports on each incident by the Weber County Attorney's Force Investigation Team, are outlined in letters from the county attorney to the varied law enforcement agencies involved in the incidents. Some are posted online; two more were supplied to KSL.com in response to a public records request. The most recent decision from Allred was issued earlier this month.\n\nTwo incidents, on Aug. 6, 2024, and Nov. 17, 2024, occurred in West Haven, and two others, on Nov. 24, 2024, and May 13, occurred in Ogden. The fifth took place in Roy on Aug. 17, 2024. KSL.com had previously reported on the investigation into the last deadly police encounter in Weber County prior to the Aug. 6, 2024, incident, a Jan. 14, 2024, encounter in Riverdale that was deemed justified.\n\nHere are details from Allred's determinations on the more recent incidents, in the order of the date they occurred:\n\nAlvaro Uriarte: Two Weber County sheriff's deputies were justified in shooting and killing Alvaro Uriarte on Aug. 6, 2024, at an apartment in the 2200 South block of 1100 West in West Haven because of the threat the man posed to two children, Allred determined. Sheriff's deputies were initially called to the scene because Uriarte \"was acting erratic and threatening to kill himself, and was likely under the influence of meth,\" reads Allred's Feb. 10 letter to Weber County Sheriff Ryan Arbon on his findings.\n\nUriarte, 31, was at the end of a hallway as the two deputies entered the apartment, a knife in his hand, with two young children nearby. \"Alvaro was making strange and unintelligible statements such as 'everyone is dead,' 'this is a dream,' and 'did he kill ... did he eat the girl?'\" Allred wrote.\n\nUriarte was cutting himself with a knife and also threatened to kill the children despite pleas from the officers and his fiancée, also present. The officers subsequently charged toward the man, and Uriarte entered a bedroom with the two children, locking the door behind him. One of the officers kicked a hole through the door, and both officers crouched down to the hole and fired on Uriarte through it, killing him. Neither child was injured.\n\nThe deadly force was justified, Allred determined, \"to prevent death or serious bodily injury to the children.\"\n\nJeremy Lundgreen: Three Roy police officers were justified in shooting Jeremy Lundgreen, a suspect in an \"enticement of a minor case,\" because he had repeatedly fired on them during their confrontation. Neighbors subsequently reported hearing 20 to 30 gunshots during the incident, which occurred in a residential neighborhood. The exchange of gunfire occurred Aug. 17, 2024, and Lundgreen, 46, died two days later of the gunshot wounds he sustained.\n\n\"Under these circumstances, it was reasonable for each officer to believe that the use of deadly force was necessary to prevent death or serious bodily injury to the officer or an individual other than the suspect,\" Allred wrote in his Nov. 12, 2024, letter to Matt Gwynn, chief of Roy police.\n\nRoy police were attempting to arrest Lundgreen stemming from his communications with a detective he thought was a 13-year-old female. \"Lundgreen wanted to meet the girl with the intention of having unlawful sexual intercourse,\" reads Allred's letter.\n\nWhen police attempted to arrest the man, he fled in his truck to a cul-de-sac, then left the vehicle on foot, running into the backyard of a home. Officers gave chase, and Lundgreen, who was armed, fired on one of them in an \"ambush attempt,\" setting up a chaotic exchange of gunfire between the man and the three officers in the residential neighborhood.\n\nLundgreen eventually ran out of bullets, tossed his gun aside and pulled out his cellphone. An officer told Lundgreen to drop the item in his hand, which he thought might be a gun, and fired on him when he didn't.\n\n\"Officers shouted commands at Lundgreen several times throughout the encounter to drop the gun and get on the ground, but he never made any attempt to comply. In fact, at various points throughout, Lundgreen shouted at officers, telling them to shoot him and to kill him. This suggests that Lundgreen was seeking to facilitate a 'suicide by cop,'\" reads Allred's letter.\n\nJames Kudelka: Three Weber County Sheriff's Office deputies shot and killed James Kudelka on Nov. 17, 2024, at a West Haven apartment complex after two \"domestic violence incidents\" that day involving the man and his girlfriend.\n\nOfficers forced open the door to the apartment after being called to the scene following the second incident because neither Kudelka, 30, nor his girlfriend, who was heard arguing inside, would let them in. Once open, Kudelka charged at the officers with a large kitchen knife, and one of them fired at the lunging man after another officer's attempt to stun him with a Taser failed. Kudelka simultaneously closed the door on the deputies.\n\nThey again forced the door open, and two other officers fired on Kudelka, one of them seeing \"a stabbing motion\" from the man, both worried about the safety of Kudelka's girlfriend. The knife was subsequently found about 3 feet from Kudelka's body.\n\nThe first officer to shoot \"had to make a split-second decision when the knife-wielding Kudelka rushed toward them,\" Allred wrote in his June 24 letter to Arbon. Under such circumstances, \"we find that it was reasonable for (the officer) to believe that deadly force was necessary,\" justifying his actions, the county attorney said.\n\nGiven the \"chaotic circumstances,\" including Kudelka's prior attempt to charge at the officers with a knife, Allred said the subsequent decisions of two other officers to fire on the man were also justified. \"With such limited time to process the situation and react, we find that it was reasonable for both deputies, in that moment, to believe that their lives or the lives of their fellow deputies were in danger of death or serious bodily injury,\" he wrote.\n\nAccording to the report, Kudelka sustained 10 gunshot wounds, two of them possibly caused by one bullet.\n\nJeffrey Blue: Ogden police had been called to the Ogden home of Jeffrey Blue on Nov. 24, 2024, to aid the man's wife as she attempted to get some things from the home. Police had been called to the home in 2021 and 2023 on domestic violence complaints, according to Allred's June 10 letter on the case to Ogden Police Chief Jake Sube.\n\nBlue, who had methamphetamine in his system, \"was acting in an unpredictable and aggressive manner\" with responding officers and ultimately stormed away from them to, in his words, \"grab my ... gun.\" Two officers pursued him, their duty weapons drawn, and Blue ultimately retrieved his weapon and turned to them \"in an aggressive stance,\" Allred wrote.\n\n\"Jeffrey then yelled out, 'Count to three ... ' and as he yelled this, he flexed his muscles aggressively and flinched his arm upward. (An officer) fired his weapon in response, striking Jeffrey twice. Jeffrey died of the bullet wounds at the scene,\" Allred wrote. \"The gun was later determined to be a BB gun, but it is manufactured to resemble a Beretta 9mm handgun.\"\n\nAllred said the officer who fired on Blue was justified given the \"tense and rapidly escalating circumstances,\" the \"dangerous\" appearance of Blue's gun and the man's \"unpredictable and aggressive manner.\"\n\nBrady Dupont: Brady Dupont sustained three gunshot wounds in a confrontation with an Ogden police officer on May 13, surviving the incident.\n\nThings started when an officer came upon the man walking on Wall Avenue, a principal thoroughfare in Ogden, about 2 a.m. and stopped to question him. As the conversation proceeded, Dupont, 37, moved toward a grassy area off the street, then pulled two knives from his pocket, putting one in each hand, reads Allred's Aug. 1 report on the confrontation to Sube.\n\nThe man started swinging his arms, ignored the officer's commands to drop the knives and moved toward him, at one point saying, \"You are going to have to shoot me.\"\n\nDupont advanced to within 12 feet of the officer when he fired on the man, striking him three times. When asked at the hospital why he didn't drop the knives, Dupont said \"he wanted the officer to shoot and kill him because he did not want to go back to prison,\" Allred wrote.\n\nThe officer was justified in his actions, given the danger posed by Dupont, armed with two knives and moving forward, and his refusal to obey police orders, according to Allred. \"There is no question that it was reasonable for (the officer) to believe that he was in danger of serious bodily injury or death under these circumstances,\" he wrote.",
  "medium": "Article",
  "links": [
    "https://www.ksl.com/article/51198897",
    "https://ksltv.com/local-news/they-just-started-shooting-him-woman-who-witnessed-deputies-kill-her-boyfriend-calls-for-thorough-investigation/707648/",
    "https://www.ksl.com/article/51091695/deputies-shoot-kill-west-haven-man-holding-2-children-hostage-police-say",
    "https://www.ksl.com/article/51104092",
    "https://ksltv.com/local-news/man-shot-by-officer-after-lunging-at-him-with-knife-in-ogden-police-say/774015/",
    "https://www.ksl.com/article/50875070/weber-county-officials-release-initial-findings-from-deadly-jan-14-shooting-at-convenience-store"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Officers",
      "weight": 0.08464333
    },
    {
      "name": "officers",
      "weight": 0.08464333
    },
    {
      "name": "responding officers",
      "weight": 0.08241421
    },
    {
      "name": "Weber County Attorney Christopher Allred",
      "weight": 0.0734745
    },
    {
      "name": "Allred",
      "weight": 0.071350895
    },
    {
      "name": "Christopher Allred",
      "weight": 0.06996528
    },
    {
      "name": "Weber County attorney",
      "weight": 0.058694616
    },
    {
      "name": "Ogden police",
      "weight": 0.057410344
    },
    {
      "name": "Weber County",
      "weight": 0.055804405
    },
    {
      "name": "Jeremy Lundgreen",
      "weight": 0.055562876
    }
  ],
  "topics": [
    {
      "name": "Murder"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9921875
    },
    {
      "name": "/News/Local News",
      "score": 0.9921875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.984375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.9462890625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.94482421875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.8974609375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.85595703125
    },
    {
      "name": "/News/Other",
      "score": 0.62451171875
    }
  ],
  "sentiment": {
    "positive": 0.06800023,
    "negative": 0.6373405,
    "neutral": 0.29465926
  },
  "summary": "Wegden County Attorney Christopher Allred has ruled that the use of deadly force in four fatal shootings in Weber County, dating back to August 2024, was justified in these cases. Allred also found that authorities were justified in the shooting of a fifth suspect in May, who survived the incident. The decisions were made in letters from Allred to the various law enforcement agencies involved in the incidents. The most recent decision was issued earlier this month by Allred. Two Weber County sheriff's deputies were found justified in shooting and killing Alvaro Uriarte on Aug. 6, 2024, at an apartment in West Haven, due to the threat the man posed to two children. Three Roy police officers were also justified in fatally shooting Jeremy Lundgreen, a suspect in an \"enticement of a minor case\" who had repeatedly fired on them during their confrontation.",
  "shortSummary": "W Weber County Attorney Christopher Allred found that multiple police shootings, including one involving Alvaro Uriarte and Jeremy Lundgreen, were justified.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ca4a789036d84857923f697a84045a1b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://ksltv.com/local-news/they-just-started-shooting-him-woman-who-witnessed-deputies-kill-her-boyfriend-calls-for-thorough-investigation/707648/",
      "text": "‘They just started shooting him’; Woman who witnessed deputies kill her boyfriend calls for thorough investigation\nNov 19, 2024, 9:18 AM | Updated: 5:00 pm\nWEST HAVEN — After a West Haven man was killed by deputy gunfire, his girlfriend is speaking out, demanding a thorough investigation. According to her, the events she witnessed did not match the story officials gave.\nThe man killed in that incident was 30-year-old James Kudelka. Deputies said he barricaded himself inside his apartment with his girlfriend, Shyann Johnson. However, she alleges they were just arguing, and responding officers escalated the situation.\n“I wasn’t being held against my will, he didn’t put his hands on me. We were just arguing,” Johnson said.\nOn Sunday around 5:20 p.m., Johnson said she and her boyfriend of two years were arguing inside their apartment when deputies with the Weber County Sheriff’s Office arrived.\n“The cops knocked on the door,” Johnson said. “He was standing behind the door and we could hear my mom outside the door saying that’s my daughter in there. And he handed me the phone and said please call your mom.”\n“The cop that was at the door turned around and told the other cop, ‘I think he has his back against the door.’ And said, ‘Go get the door breakers.’” Johnson said. ‘The other cop said, ‘Well I’m going to go get my shotgun.’”\nJohnson’s mom, Tammy Marturello, said she arrived around the same time as the responding deputies and was on the phone with Kudelka.\n“I was trying to tell them ‘Look he’s on the phone, can you talk to him? Look he’s on the phone.’ But they weren’t listening to what I had to say at all,” Marturello said.\nMarturello said she was outside and observed the deputies break into the apartment and deploy a taser which caused Kudelka to fall forward before they opened fire.\n“I don’t remember them asking him to get on the ground or put his hands up, they just tased him and he didn’t go down but he stumbled back a little bit. Then they shot him with a shotgun,” Johnson said.\n“The cops yelled gun and they just started shooting him,” Johnson said, through tears. “Over and over and over again.”\nMarturello and Johnson said the situation quickly escalated, alleging that about three minutes transpired between the time deputies first knocked on the door and the shooting.\n“While the deputies attempted contact at the door they heard a disturbance from inside. Concerned for the safety of the female, deputies forced entry into the apartment,” a press release from the Sheriff’s Office said Monday. “The male brandished a knife and began to advance on the deputies, holding the knife. Three deputies fired rounds at the male, resulting in his death. The female was unharmed.”\n“There was no (command to) get down. There was no ‘Get your hands up.’ They just shot,” Marturello said.\nAccording to Johnson, Kudelka was shot about eight times.\nJohnson and her mother are concerned about how the incident was handled.\n“In the press release it said that he barricaded himself inside and that’s not true, he didn’t,” Johnson said.\n“They want to say that he had a knife and a gun, that’s not true,” Marturello said. “It was a phone and a bottle of liquor.”\nTonight Kudelka’s loved ones are demanding a thorough investigation.\n“They didn’t give him a chance, they just shot him,” Johnson said.\n“I think it really needs to be investigated to its fullest,” Marturello said.\nThe three deputies were placed on leave, as per protocol.\nThe Weber County Sheriff’s Office declined to answer our questions citing the investigation into deputies’ use of deadly force. The investigation is being handled by the Weber County Attorney’s Office.\nThere is also a *GoFundMe to support Johnson with funeral expenses for Kudelka.\n*KSL TV does not assure that the money deposited to the account will be applied for the benefit of the persons named as beneficiaries. If you are considering a deposit to the account, you should consult your own advisors and otherwise proceed at your own risk."
    },
    {
      "url": "https://www.ksl.com/article/50875070/weber-county-officials-release-initial-findings-from-deadly-jan-14-shooting-at-convenience-store",
      "text": "Estimated read time: 4-5 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nOGDEN — The killing of an attempted murder suspect by police, during a confrontation at a Riverdale convenience store last month, followed repeated demands by authorities with their guns drawn, that the man comply with their orders.\nWilliam Toon, 28, of Highland, attempted to evade police inside the store, according to video of the Jan. 14 confrontation released by the Weber County Attorney's Office. Four of the officers — three from the Ogden Police Department, and one from the Pleasant Grove Police Department — ultimately fired on Toon, killing him, after he walked behind the counter where two store employees crouched.\n\"He's going to take a hostage! Shoot him!\" one of the officers shouts in the video. The officers fire multiple rounds, killing Toon, though footage of Toon being struck is not included in the video release per the request of a family member that it not be made public, as allowed under state law.\nThe video report, released Friday, offers no conclusion as to whether the officers were justified in their actions as the probe by the Weber County Force Investigation Team continues.\n\"A final report with all of the evidence will be prepared and submitted to the Weber County Attorney's Office for final review,\" reads the narrative in the video.\nThe deadly Jan. 14 confrontation occurred about 3 p.m. that day and came as authorities were trying to locate Toon, 28, who had allegedly stabbed someone in Pleasant Grove with scissors on Dec. 10, according to authorities. Early in the morning of Jan. 14, a South Ogden officer happened upon a man he believed to be Toon in a vehicle and gave chase in snowy conditions, though, the pursuit ultimately ended when the officer slid out on U.S. 89 in Davis County, according to video from the officer's vehicle.\nLater in the afternoon, Pleasant Grove officers, assisted by officers from the Weber Morgan Narcotics Strike Force and the Ogden Metro Gang Unit, located Toon in a vehicle on Riverdale Road, according to the video report. They followed him to the Sinclair gas station on the northeast corner of Riverdale Road and 700 West, preceding the incident inside the convenience store.\nNone of the officers involved in the incident wore body cameras, Ogden Police Chief Eric Young said Jan. 16, at a press conference on the incident. The footage in the report comes from surveillance video inside the convenience store, and as two officers enter, guns drawn, it shows Toon heading toward the restroom in the locale. His left hand is in the pocket of his hoodie and his right hand is holding a black rod with a key, apparently to get into the bathroom.\n\"Hey, hands out of your pocket, hands out of your pocket! You're under arrest! Freeze! Get on the ground!\" one of the officers shouts.\nToon — ultimately found to be unarmed, according to Young — backs away from the officers, left hand still in his pocket, and they continue walking toward him. \"Officers ordered Toon, several times, to remove his hand from his pocket,\" reads the narrative in the report.\nFour additional officers — three with handguns drawn, and one with a long gun of some sort — subsequently enter the store to assist, shouting their own commands. \"Get on the ground! Get on the ground!\" an officer can be heard shouting. A customer in the store exits.\nToon doesn't say anything and ultimately walks behind the counter of the convenience store, where two people, apparent clerks with no way to quickly get out, crouch, likely trying to steer clear of the confrontation. That's when the officers, standing on the other side of the counter, fire, killing Toon, who was subsequently pronounced dead at the scene.\nThe man had $20,000 in an envelope in his waistband, according to the report. A bag \"that had previously been in Toons' possession\" contained \"a large amount of drugs.\" A photo in the report shows several plastic wrapped bags on the hood of a car, but doesn't identify them.\nThe driver of the car in which Toon had been traveling was initially taken into custody and later released, according to the video.\nIn the Jan. 16 press conference, Young said four officers actually fired on Toon. He said none of the Ogden officers involved were wearing body cameras as they belong to the narcotics and gang task forces and don't typically use them."
    },
    {
      "url": "https://www.ksl.com/article/51091695/deputies-shoot-kill-west-haven-man-holding-2-children-hostage-police-say",
      "text": "Estimated read time: Less than a minute\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nWEST HAVEN, Weber County — Weber County sheriff's deputies shot and killed a man Monday after they say he took two children hostage with an \"edged weapon.\"\nDeputies responded to calls from an apartment at 2265 S. 1100 West in West Haven that a family member was \"threatening self-harm and possibly under the influence of drugs,\" the Weber County Sheriff's Office said in a statement.\nThe subject of the call was \"acting erratically\" when deputies arrived in the midst of \"a chaotic domestic scene.\" According to police, the man was holding two children hostage with an \"edged weapon,\" but attempts to deescalate the situation failed.\nWhen the man began making \"statements of harm\" to one of the children, the statement says two deputies fired at the man, killing him.\nThe children were not harmed, and everyone was removed from the apartment while investigators from the Weber County Attorney's Office were on scene conducting their own investigation into the incident.\nBoth deputies who were involved in the shooting are now on administrative leave, as is standard practice in a police shooting.\nSuicide prevention resources\nIf you or someone you know is struggling with thoughts of suicide, call 988 to connect with the 988 Suicide and Crisis Lifeline.\nCrisis hotlines\n- Huntsman Mental Health Institute Crisis Line: 801-587-3000\n- SafeUT Crisis Line: 833-372-3388\n- 988 Suicide and Crisis LifeLine at 988\n- Trevor Project Hotline for LGBTQ teens: 1-866-488-7386\nOnline resources\n- NAMI Utah: namiut.org\n- SafeUT: safeut.org\n- Suicide Prevention Lifeline: www.suicidepreventionlifeline.org\n- American Foundation for Suicide Prevention, Utah chapter: afsp.org/chapter/utah"
    },
    {
      "url": "https://www.ksl.com/article/51104092",
      "text": "Estimated read time: 1-2 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nROY — A 46-year-old man injured in a shootout with police in Roy over the weekend has died.\nPolice identified the man as Jeremy Lundgreen and said he died at the hospital Tuesday morning.\nPolice on Monday released more details of the police shooting that happened Saturday about 7:30 p.m. near 5650 S. 2775 West.\nA vehicle driven by Lundgreen, who was wanted by the state's Internet Crimes Against Children task force in connection with an investigation for enticing a minor, was pulled over by Roy police, according to the department. \"While initially cooperative, the suspect ultimately decided to flee from the traffic stop. The suspect was later located in the area of 5650 S. 2775 West. As soon as officers made contact with the suspect he immediately confronted officers with a firearm and began firing at them,\" according to a statement from Roy police.\nAt that point, officers say there was a \"sustained firefight over several minutes\" during which officers fired back at Lundgreen. Neighbors reported hearing between 20 and 30 gunshots.\nLundgreen was taken to a local hospital to be treated for undisclosed injuries but died Tuesday morning.\nAn undisclosed number of officers have been placed on paid administrative leave pending the outcome of an investigation by the Weber County Attorney's Office.\nContributing: Cassidy Wixom"
    },
    {
      "url": "https://ksltv.com/local-news/man-shot-by-officer-after-lunging-at-him-with-knife-in-ogden-police-say/774015/",
      "text": "Man shot by officer after lunging at him with knife in Ogden, police say\nMay 13, 2025, 6:49 AM | Updated: 5:28 pm\nOGDEN — A man was shot by an officer in Ogden early Tuesday morning after lunging at him with a pair of knives, according to police.\nJust after 2 a.m., an officer saw the 37-year-old man walking in the road near the 2200 block of Wall Avenue, police said. The man pulled out a set of knives he had been hiding in his pockets.\nPolice said despite being told not to, the man lunged, prompting the officer to fire his handgun. The man was taken to a nearby hospital and was in stable condition later Tuesday morning.\nOgden police said the man’s identity would not be immediately released.\nThe Weber County Attorney’s Office is expected to perform an investigation on the shooting, while the officer remains on administrative leave. The Ogden Police Department noted the officer was a two-year veteran of the department, and thankfully he was uninjured.\n“Police officers operate in rapidly evolving and often dangerous situations on a daily basis, consistently placing themselves in harm’s way,” OPD said. “We are proud of the professionalism and composure they demonstrate in the face of such complex and challenging circumstances.”\nThe shooting marked the second in the greater Salt Lake area by police within the span of a few hours, after a different man fled a traffic stop in Salt Lake City."
    },
    {
      "url": "https://www.ksl.com/article/51198897",
      "text": "Estimated read time: 2-3 minutes\n- Ogden Police Chief Jacob Sube said a man shot and killed by police during a domestic call Sunday had a \"replica handgun.\"\n- Jeffrey Allen Blue, 45, was shot at the Ogden residence.\n- One officer is on administrative leave pending the results of internal and external investigations.\nOGDEN — A man who was shot and killed by police on Sunday had a \"replica handgun\" and the situation that led to his death \"escalated quickly,\" Ogden Police Chief Jacob Sube said Tuesday.\nOfficers had been dispatched to the home at 933 E. 1150 North on a \"keep the peace\" request when they encountered 45-year-old Jeffrey Allen Blue.\nA woman who requested police support lives at the house and had left the night before due to \"some sort of disagreement,\" Sube said, adding that the cause of the disagreement remains under investigation. The chief said police have been called to the residence \"numerous times\" — Sube estimated eight times since 2021 for neighbor complaints, keep the peace requests and other reasons.\nAbout noon on Sunday, an officer arrived to help the woman retrieve her belongings from the home but requested backup due to Blue's behavior. When backup arrived, two officers followed the woman into the home, and they were again met by Blue, who was exhibiting \"angry and confrontational behavior,\" the chief said.\nBlue \"made a statement about getting a gun and abruptly turned further into the home, where he retrieved what appeared to be a handgun,\" Sube said. One officer shot the man, but no details have been released on how many rounds were fired.\nBlue died in the home while receiving medical attention from officers and first responders.\nSube said Tuesday that a \"replica handgun\" was found on Blue that day. The photo shared with the public appears to be a CO2-powered BB gun, though Sube did not have specifics on the object.\n\"It happened rapidly, it escalated quickly,\" Sube said. \"The officer had to make a very, very quick decision.\" They were children in the house at the time of the shooting, according to the chief, but he did not have details at hand on the number or the relationship between the different parties.\nDomestic calls are \"some of the most volatile and concerning\" cases that officers handle, Sube said. The Ogden Police Department often responds to requests to keep the peace, the chief says, and it \"does take courage\" to ask for help and support.\nHe called the Nov. 21 incident a \"very rare occurrence,\" that should not deter those looking to escape from domestic violence situations from seeking help. \"Our thoughts remain with those feeling the weight of these difficult circumstances,\" he said.\nThe Weber County Critical Incident Investigation team will continue reviewing the body camera footage that was taken, police reports, and witness statements. One officer was put on paid administrative leave pending the outcome of the external and internal reviews, Sube said.\nDomestic violence resources\nHelp for people in abusive relationships can be found by contacting:\n- Utah Domestic Violence Coalition: Utah's confidential statewide, 24-hour domestic violence hotline at 1-800-897-LINK (5465)\n- YWCA Women in Jeopardy program: 801-537-8600\n- Utah's statewide child abuse and neglect hotline: 1-855-323-DCFS (3237)\n- National Domestic Violence Hotline: 1-800-799-7233"
    }
  ],
  "argos_summary": "Weber County Attorney Christopher Allred ruled that deadly force was justified in five recent fatal shootings in the county, citing threats to children, armed suspects, and chaotic domestic scenes. The incidents involved Alvaro Uriarte (Aug. 6), Jeremy Lundgreen (Aug. 17), James Kudelka (Nov. 17), Jeffrey Blue (Nov. 24), and Brady Dupont (May 13). Allred’s determinations were based on Force Investigation Team reports and formal letters to the involved law‑enforcement agencies. The article also references an earlier Jan. 14 shooting of William Toon and a protest by Kudelka’s girlfriend over the circumstances of his death. These findings are part of ongoing investigations and administrative reviews of the officers involved.",
  "argos_id": "E7CJ9I9IK"
}