{
  "url": "https://www.nytimes.com/2025/08/23/arts/music/lady-gaga-mayhem-ball-review.html",
  "authorsByline": "Lindsay Zoladz",
  "articleId": "7c4d5fc9a04a4ceab6b1ebb680c0e718",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/23/multimedia/23cul-gaga-live-promo-qbvg/23cul-gaga-live-promo-qbvg-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T17:51:52.818000+00:00",
  "addDate": "2025-08-23T18:00:52.998679+00:00",
  "refreshDate": "2025-08-23T18:00:52.998682+00:00",
  "score": 1.0,
  "title": "At Lady Gaga’s Mayhem Ball, a Pop Star Is Reborn",
  "description": "The singer and songwriter proved she’s operating at the peak of her powers during a two-and-a-half-hour set that drew sharp connections between her past and present.",
  "content": "The singer and songwriter proved she’s operating at the peak of her powers during a two-and-a-half-hour set that drew sharp connections between her past and present.\n\nThe singer and songwriter proved she’s operating at the peak of her powers during a two-and-a-half-hour set that drew sharp connections between her past and present.\n\nCan a pop concert be eligible for a Tony nomination for best musical? It was a question repeatedly prompted on Friday night at Madison Square Garden, where Lady Gaga brought the New York debut of her theatrical, spectacular Mayhem Ball, a hit-filled, deliciously campy extravaganza she’ll perform five more times there over the next few weeks. “I’m sure you can tell if you listen to the music that I’m from here,” the New York native, 39, told the sold-out crowd, becoming visibly emotional. “Everything about my artistry, I think, was born in this town.”\n\nIt is now almost de rigueur for an arena pop show to be broken into acts — don’t call them eras — and structured as a kind of epic heroine’s journey. Throughout the Mayhem Ball, Gaga both indulged in such grandiosity and impishly poked fun at it. Before she arrived onstage, a prerecorded image of the pop star hovered above the set in a red Elizabethan collar, writing by hand with an enormous red feather pen. The show’s subtitle soon flashed on the screen in gothic script: “The Art of Personal Chaos.”\n\nBut she sold the show’s overall narrative — incorporating multiple, conflicting aspects of oneself into a gloriously messy whole — with a flair for drama and comedy. Before a punchy rendition of “Poker Face,” one of the 2008 electro-pop anthems that first made her a star, Gaga was confronted onstage by a doppelgänger dressed as she once did in those days: head-to-toe in face-obscuring lace and a pointy, imperial crown. “Ugh,” sighed present-day Gaga with an exaggerated verbal eye roll. “What is she doing here?”\n\nSuch scenery-chewing was a reminder of Gaga’s increasingly busy life outside of music. Since earning an Oscar nomination for her film debut in Bradley Cooper’s 2018 version of “A Star Is Born,” Gaga has proved herself a compelling onscreen presence and continued to pursue a career as an actress. This pivot might have provided an opportunity to pump the brakes on pop stardom. But the Mayhem Ball shows how Gaga has learned to incorporate all of her disparate strengths as an entertainer into a single stage experience, combining impressive live singing with kinetic choreography, bona fide acting chops and well-honed comic timing. Call it the Art of Professional Chaos. The first act was the most impressive: a relentless sensory overload of fiery colors and visual surprises that drew stylistic connections between some of the best tracks on “Mayhem” with the harder-edged material on the 2011 album “Born This Way.” Opening with “Bloody Mary” — a deep cut that got a boost in 2022 after the Netflix horror-comedy “Wednesday” turned it into a TikTok sensation — Gaga emerged from the center of the stage trilling operatic high notes and looking like Klaus Nomi sitting atop a dress fashioned as a two-story crimson birthday cake. Her massive skirt then parted to reveal a cage housing seven dancers ready to launch into the frenetic choreography of her wickedly infectious recent hit, “Abracadabra.”\n\nA transformation of Gaga’s 2009 bop “Paparazzi” into a gorgeously sung piano ballad was a highlight of the second act, tightening the focus just to Gaga; as she lurched down the catwalk that split the arena on metallic crutches, the seemingly endless train of her white gown billowed behind her. When she reached the edge of the stage, the fabric was lit up like a rainbow — the first of several nods to her devoted queer fan base. “Born This Way,” her ally’s anthem, felt extra jubilant, and hit hard during this moment of rollbacks in L.G.B.T.Q. rights.\n\nBut for a show stuffed with such unrelenting excess, it’s impressive what a high percentage of it works: The “Beetlejuice” drag that accompanied the “Mayhem” banger “Zombieboy”; the telenovela-like staging of “Alejandro”; even the Andrew Lloyd Webber-esque moments when several ballads, including the “Star Is Born” blockbuster “Shallow,” become impressionistic duets with Gaga’s shadow self. Still, as ever, Gaga knew when to dial back the maximalism and forge a more direct connection with her fans (many of whom had embraced the album’s macabre, black-and-red dress code). Toward the end of the show, she settled in at a piano perched on the edge of the catwalk and performed a solo rendition of her 2024 Bruno Mars duet “Die With a Smile,” along with a special number she’d chosen for the hometown crowd: “Hair,” a heartfelt and decidedly Broadway-ready song of self-acceptance from “Born This Way,” an album she said was particularly indebted to the city.\n\nFor all its outrageous artifice, one of the most memorable moments of the Mayhem Ball was its most stripped down. During what was less an encore than a post-credits sequence — after innumerable names flashed onscreen, crediting the village it took to put on this show that Lady Gaga directed herself — a camera showed the star backstage in a wig cap and black leotard, wiping off her makeup. As she sang the bubbly “Mayhem” track “How Bad Do U Want Me,” she began to maneuver through the labyrinthine halls beneath the stage, gathering dancers as she went. Still belting the song, and in an oversize jean jacket emblazoned on the back “Born This Way,” she and her troupe came to the surface for one last triumphant curtain call as “Heavy Metal Lover” from “Born This Way” played over the speakers. She was from here, all right — not just New York, but the stage. And she didn’t want to leave.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2018/10/03/movies/a-star-is-born-review-lady-gaga-bradley-cooper.html",
    "https://www.nytimes.com/2025/03/10/arts/music/lady-gaga-mayhem-review.html",
    "https://www.youtube.com/watch?v=Nd_M9A5xFlY",
    "https://www.nytimes.com/2022/01/21/arts/music/meat-loaf-dead-marvin-lee-aday.html",
    "https://www.nytimes.com/2020/05/29/arts/music/lady-gaga-chromatica.html",
    "https://www.nytimes.com/2023/08/05/arts/music/taylor-swift-eras-tour.html",
    "https://www.nytimes.com/2022/06/30/obituaries/klaus-nomi-overlooked.html",
    "https://www.nytimes.com/2011/05/22/arts/music/lady-gaga-has-a-new-album-born-this-way.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Lady Gaga",
      "weight": 0.07755924
    },
    {
      "name": "Gaga",
      "weight": 0.07471451
    },
    {
      "name": "Mayhem Ball",
      "weight": 0.063976765
    },
    {
      "name": "Lady Gaga’s Mayhem Ball",
      "weight": 0.05441933
    },
    {
      "name": "Mayhem",
      "weight": 0.053256083
    },
    {
      "name": "pop stardom",
      "weight": 0.046841864
    },
    {
      "name": "sharp connections",
      "weight": 0.046246618
    },
    {
      "name": "impressive live singing",
      "weight": 0.043878812
    },
    {
      "name": "New York",
      "weight": 0.04373951
    },
    {
      "name": "stylistic connections",
      "weight": 0.043304075
    }
  ],
  "topics": [
    {
      "name": "Reviews"
    },
    {
      "name": "Music"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9873046875
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.7744140625
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Concerts & Music Festivals",
      "score": 0.71826171875
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Event Ticket Sales",
      "score": 0.39990234375
    }
  ],
  "sentiment": {
    "positive": 0.15009238,
    "negative": 0.50220805,
    "neutral": 0.34769952
  },
  "summary": "Lady Gaga performed her theatrical, spectacular Mayhem Ball at Madison Square Garden, New York, on Friday night. The set included a two-and-a-half-hour set that drew sharp connections between her past and present. The performance was the New York debut of Gaga's theatrical, campy extravaganza, which she plans to perform five more times there over the next few weeks. The show, which also included a transformation of Gaga’s 2009 bop “Paparazzi” into a piano ballad, was a highlight of the second act. Since her Oscar nomination for her film debut in “A Star Is Born, Gaga has continued to pursue a successful career as an actress.",
  "shortSummary": "Lady Gaga's stunning Mayhem Ball at Madison Square Garden showcased her immense talent and seamless performances, blending pop-influenced performances with immersive, immersive performances and diverse performances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b0c6422a8847411e8e3cffb3fcc3e161",
  "places": [
    {
      "osmId": "138141251",
      "road": "Pennsylvania Plaza",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10001",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Chelsea District",
      "coordinates": {
        "lat": 40.750512900000004,
        "lon": -73.99351594545152
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Lady Gaga’s two‑and‑a‑half‑hour Mayhem Ball debut at Madison Square Garden showcased her theatrical flair, blending pop hits, theatrical staging, and personal storytelling into a cohesive narrative. The show highlighted her evolution from 2008 pop star to Oscar‑nominated actress, with moments ranging from high‑energy choreography to intimate piano solos. Gaga’s performance celebrated her New York roots and queer fan base while integrating her recent film work, culminating in a stripped‑down backstage moment that underscored her authenticity and connection to the audience.",
  "argos_id": "EKE3JFHOW"
}