{
  "url": "https://www.foxnews.com/world/rescue-effort-halted-stuck-climber-treacherous-mountain-after-climber-dies-trying-help-her",
  "authorsByline": "Brie Stimson",
  "articleId": "94d863c1af4f400abcfa12f0b33dc55e",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/tian-shan-mountain-snow.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T19:06:10-04:00",
  "addDate": "2025-08-23T23:19:48.032457+00:00",
  "refreshDate": "2025-08-23T23:19:48.032458+00:00",
  "score": 1.0,
  "title": "Rescue effort halted for stuck climber on treacherous mountain after climber dies trying to help her: reports",
  "description": "Kyrgyzstan authorities abandon rescue effort for Russian climber Nagovitsina after failed helicopter attempts and death of an Italian rescuer on Victory Peak.",
  "content": "The rescue of an experienced mountaineer has been called off in Kyrgyzstan nearly two weeks after Natasha Nagovitsina, 47, broke her leg not far from the summit of the country’s tallest mountain, according to reports.\n\nNagovitsina, a Russian climber who garnered fame four years ago after she refused to leave her husband after he suffered a stroke, has been stuck at 22,965 feet on Victory Peak since Aug. 12, according to the Daily Mail. Despite her efforts, her husband died.\n\nThe summit of Victory Peak, in the Tian Shan Mountain Range on the border with China, is 24,406 feet. Mount Everest, the world's tallest peak, is 29,032 feet.\n\nThe suspension of the rescue mission comes days after an Italian climber named Luca Sinigaglia died while attempting to help Nagovitsina, Italian newspaper, L’Unione Sarda, reported.\n\nSinigaglia died of hypothermia on Aug. 15, after making it up to where Nagovitsina was stuck, giving her a tent, sleeping bag, food, water and a gas cooker, the Daily Mail reported.\n\nOther attempts to save her both via climbing and twice with a helicopter have failed, including an effort in a defense ministry helicopter that crashed. The crash left four injured, according to the London Times.\n\nTRAGEDY STRIKES AT POPULAR NATIONAL PARK AS CLIMBER MEETS FATAL END ON MOUNTAIN\n\nThe final attempt to rescue Nagovitsina was abandoned some 3,000 feet below where she is after the weather took a turn for the worse.\n\nRescue leader Dmitry Grekov said he didn’t think Nagovitsina could still be alive, according to the Daily Mail.\n\n\"I think not, because she has been there since 12 August - count how much time has passed,\" he said. \"It is unrealistic. It is unrealistic to survive at such an altitude.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA drone that flew over where she was sheltering confirmed she was alive as of Tuesday, but there was no sign of life when the drone flew over on Thursday as temperatures sunk as low as minus 9 degrees Fahrenheit, The Times reported.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/lifestyle/quarry-workers-doing-jobs-prehistoric-discovery",
    "https://www.foxnews.com/us/tragedy-strikes-popular-national-park-climber-meets-fatal-end-mountain",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/sports/olympic-hero-laura-dahlmeier-suffered-severe-injury-missing-after-high-altitude-rockfall",
    "https://www.foxnews.com/video/6376556968112",
    "https://www.foxnews.com/us/hiker-suffers-hypothermia-during-trek-new-englands-highest-peak-amid-east-coast-heat-wave",
    "https://www.dailymail.co.uk/news/article-15027771/Bid-save-woman-stuck-22000ft-mountain-broken-leg-called-off.html",
    "https://www.foxnews.com/travel/fox-news-mike-tobin-completes-risky-everest-climb-details-high-stakes-summit",
    "https://www.thetimes.com/world/europe/article/italian-climber-dies-trying-to-rescue-friend-stuck-on-kyrgyzstan-peak-zwwrjgkqg"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "stuck climber",
      "weight": 0.09442781
    },
    {
      "name": "Natasha Nagovitsina",
      "weight": 0.09094021
    },
    {
      "name": "Nagovitsina",
      "weight": 0.087673075
    },
    {
      "name": "CLIMBER",
      "weight": 0.07774822
    },
    {
      "name": "climber",
      "weight": 0.07774822
    },
    {
      "name": "Rescue effort",
      "weight": 0.073442556
    },
    {
      "name": "Rescue leader Dmitry Grekov",
      "weight": 0.0698632
    },
    {
      "name": "Victory Peak",
      "weight": 0.06534874
    },
    {
      "name": "FOX NEWS APP",
      "weight": 0.0650823
    },
    {
      "name": "Italian newspaper",
      "weight": 0.0624638
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.9580078125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.90869140625
    },
    {
      "name": "/News/Other",
      "score": 0.693359375
    },
    {
      "name": "/News/Local News",
      "score": 0.3291015625
    }
  ],
  "sentiment": {
    "positive": 0.04416338,
    "negative": 0.77482873,
    "neutral": 0.18100786
  },
  "summary": "The rescue of experienced Russian climber Natasha Nagovitsina, who has been stuck on the country's highest mountain for nearly two weeks, has been called off after a broken leg. Despite her efforts, her husband, Luca Sinigaglia, died trying to help her. Other attempts to rescue her have failed, including a defense ministry helicopter crash. The final rescue attempt was abandoned after bad weather worsened and temperatures dropped as low as minus 9 degrees Fahrenheit. Despite reports of her being alive, rescue leader Dmitry Grekov said he doubted she could still be alive.",
  "shortSummary": "Rescuers in Kyrgyzstan halted their attempt to rescue Russian climber Natasha Nagovitsina, stranded at 22,965 feet (70,000 ft) after an Italian climber died.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2365ec9fdce244ddb3ca46b9077acb96",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/us/tragedy-strikes-popular-national-park-climber-meets-fatal-end-mountain",
      "text": "A rock climbing outing turned fatal for one National Park visitor after authorities say a fall resulted in his death.\nOfficials with the National Park Service confirmed that Brian Astle, 42, of Provo, UT fell while descending a steep, off-trail climbing route from the west face of Mount Gould inside Glacier National Park on Wednesday.\nThe accident happened just before 6 p.m. on July 9, when Glacier National Park Dispatch received a report of an individual who had fallen from Mount Gould above the Highline Trail.\nPark rangers worked with aerial search and rescue crews to locate Astle. However, the operation was postponed overnight to ensure Astle's body could be safely recovered.\nThe following morning, park rangers located Astle's body and transported him to a nearby horse corral till he could be moved to the coroner's office.\nOfficials said an investigation is ongoing, and there is no additional information available at this time.\nSKIER PLUMMETS 1,000 FEET DOWN MOUNTAIN\nMount Gould stands at 9,557 feet, making it the highest point along the Garden Wall in Glacier National Park, according to the National Park Service.\n\"The park extends their deepest condolences to the family and asks the public to respect the family’s privacy,\" park officials wrote in a news release.\nEXPERIENCED CLIMBER DIES AFTER 3,000-FOOT PLUMMET FROM NORTH AMERICA'S HIGHEST PEAK\nBack in August 2024, a missing climber was found dead after disappearing from his hiking party.\nThe National Parks Service said Grant Marcuccio, 32, of Whitefish, Montana was found dead after suffering from \"traumatic injuries\" from an \"apparent fall.\"\nOfficials said \"Marcuccio separated from his party to summit McPartland Peak alone and planned to rendezvous at a designated location\" but \"Rangers were alerted by the hiking party that Marcuccio never made it to the rendezvous spot.\"\nCLICK HERE TO GET THE FOX NEWS APP\nGlacier National Park is known for its \"beautiful glacial lakes, waterfalls, valleys, and alpine meadows,\" FOX Weather reports, but it can also \"experience quickly changing and extreme weather.\"\n\"Be aware that mountain weather is unpredictable; always be prepared for a variety of conditions,\" the park's website states.\nFox News Digital's Greg Norman and Pilar Arias contributed to this report.\nStepheny Price is a writer for Fox News Digital and Fox Business. She covers topics including missing persons, homicides, national crime cases, illegal immigration, and more. Story tips and ideas can be sent to stepheny.price@fox.com"
    },
    {
      "url": "https://www.foxnews.com/sports/olympic-hero-laura-dahlmeier-suffered-severe-injury-missing-after-high-altitude-rockfall",
      "text": "Laura Dahlmeier, a two-time Olympic gold medalist, suffered serious injury after she fell while at a high elevation in the remote Karakorum Mountains in northern Pakistan, according to multiple reports.\nDahlmeier was presumed to be missing. German media outlet ZDF reported that data from Tuesday's helicopter flyover concluded that the 31-year-old was at the very least \"seriously injured.\"\nSearch and rescue crews have yet to make contact with the German-born biathlete as of Tuesday morning.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nA Pakistani government spokesperson said she \"was taken away by locals from the landslide site,\" per Reuters. Dahlmeier's reps confirmed she was at an estimated altitude of 18,700 feet at the time of the mountaineering accident.\nSUNI LEE DISCUSSES OLYMPIC RETURN AFTER KIDNEY DISEASE DIAGNOSIS, ESPYS COMEBACK ATHLETE NOMINATION\n\"Laura Dahlmeier was climbing with her mountaineering partner on 28 July when she was caught in a rockfall. The accident took place around noon local time at an altitude of approximately 5,700 metres [18,700 feet],\" Dahlmeier’s management told ZDF in a statement.\n\"Her partner immediately called emergency services, and a rescue operation began immediately. Due to the remoteness of the area, a helicopter was only able to reach the site of the accident on the morning of 29 July.\"\nDahlmeier stepped away from professional competition in 2019. She cited the diminishing of her overall passion for playing sports in her retirement announcement.\n\"After an unbelievably tough season with lots of highs and lows I no longer feel the 100 percent passion that is needed for professional sports. This is why after some long thought I decided to end my active biathlon career,\" Dahlmeier said in 2019.\nShe earned gold medals at the 2018 Winter Olympics in Pyeongchang, where she made history as the first female biathlete to win a sprint and pursuit double at the same Games.\nCLICK HERE TO GET THE FOX NEWS APP\nDahlmeier is also an Olympic bronze medalist. She finished in third place in the 15km individual event at the 2018 Games.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/travel/fox-news-mike-tobin-completes-risky-everest-climb-details-high-stakes-summit",
      "text": "Fox News Senior Correspondent Mike Tobin has completed one of the riskiest feats in the world: climbing Mount Everest.\nAlong with a team, Tobin hiked the mountain in the Himalayas, reaching the highest point on Earth.\nTobin was back on the channel, joining \"America’s Newsroom\" on Friday from China to share the details of his experience.\nEXTREME TRAVEL DESTINATION TO RESTRICT POPULAR MOUNTAIN ACCESS\n\"Some people say weather-wise, it was one of the best summit windows they've seen in like 20 years,\" said Tobin.\n\"And you compare that to the other people who climbed Everest this season — most of them got beat up on the summit.\"\nHe said that his team saw people going down the mountain with \"big black mittens on,\" indicating that \"they were covering up frostbite damage.\"\nTobin shared that when he reached the summit, it was a little bit cloudy.\n\"I'm very well aware that 90% of the accidents happen on the way down and so you're tired, you're a little hypoxic, and it was a moment of concentration for me,\" said Tobin.\nWORLD-TRAVELING COUPLE VISITS 197 COUNTRIES, REVEALS TOP DESTINATIONS\n\"I wanted to make sure that I didn't let up because we still had a long way to get down to advanced base camp.\"\nIn 2023, 12 climbers were reported dead while five went missing following 478 hiking permits issued by Nepal, according to Reuters.\n\"I was just trying to think, 'Keep your head about yourself. Don't make any mistakes, don't turn what's otherwise going to be a celebration into a tragedy.'\"\nAbout 700 to 1,000 climbers attempt the summit each year, with success rates ranging between 60% and 70%, according to Climbing Kilimanjaro.\n\"I was trying to think, 'Keep your head about yourself. Don't make any mistakes.'\"\nTobin said he \"certainly was spooked at different times on the climb,\" sharing that it hit him when he came back down on the second step.\nThe second step is on the northeast ridge of Mount Everest, one of three major obstacles.\nHe said it was a bit \"odd\" as he \"was pretty enthused on the way up,\" but added that other team members shared the moment was spooky for them, too.\nWhile in the \"death zone,\" Tobin participated in the 22 Pushup Challenge to raise awareness about the issue of veteran and first responder suicide.\nFor more Lifestyle articles, visit foxnews.com/lifestyle\n\"The only way you survive the death zone is to get in and out of there as fast as you can before the sand runs out of your hourglass or before the oxygen runs out of your bottle,\" said Tobin.\nThe \"death zone\" is an area above 26,247 ft. on the mountain; the air is too thin to support human life without supplemental oxygen.\n\"It was kind of an add-on to the climb … You've seen some of the different events that people have done as far as the 22 push-ups in recognition of veteran suicide,\" said Tobin.\n\"I hope that a troubled guy out there somewhere who was looking at suicide as a reasonable response to his troubles will realize that someone took the time to do that in a perilous situation and reconsider before he hurts himself,\" he added.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nTobin credited his wife for keeping him on track during his preparation leading up to the hike.\n\"Between work and training for Everest, there really wasn't any time, and she ran the house and made sure I got fed.\"\nHe shared that the training process was pretty \"arduous.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"I did crazy kinds of training, like I’d take the sandbags that our cameramen use, and I put them in a backpack, and I ran up and down the Indiana Sand Dunes for hours at a time,\" said Tobin."
    },
    {
      "url": "https://www.foxnews.com/lifestyle/quarry-workers-doing-jobs-prehistoric-discovery",
      "text": "Workers in Central Asia made a \"mammoth\" discovery earlier this month.\nLaborers came across the bones of an ancient mammoth while quarrying on June 2. In a press release, Kyrgyzstan's Ministry of Culture explained that the remains were found in \"the sandy areas of the ancient floodplain of the Jyrgalang River.\"\nKyrgyzstan is a landlocked country surrounded by Uzbekistan, Tajikistan, Kazakhstan and China. The discovery was found in the Issyk-Kul Region, which borders the Xinjiang Uygur Autonomous Region of China.\nThe officials' statement, which was translated from Kyrgyz to English, explained that archaeologists were promptly called over to the site in order to analyze the remarkable discovery.\nWOMAN OUT FOR WALK STUMBLES UPON ONCE-IN-A-DECADE DISCOVERY\n\"During the inspection, it became known that fragments of a tooth and a lower jaw were found in two different places, 140-150 meters apart, in the sand-gravel deposits of the quarry at a depth of 3-5 meters,\" officials explained. \"A part of the buried bone was found while cleaning the place where the tusks were found.\"\nPictures show the mammoth's gigantic jaw and teeth, which were held in place in the sand. Archaeologists needed to take special care to make sure the bones were preserved.\nMICHIGAN RESEARCHERS DISCOVER EERIE 1909 SHIPWRECK AT BOTTOM OF LAKE SUPERIOR\n\"Exposed bones do not remain in their original state for long and are quickly destroyed by exposure to sunlight,\" the press release added. \"Therefore, archaeologists made a hole from top to bottom and cleaned what was found, which turned out to be the preserved lower part of the skull of a mammoth.\"\n\"Archaeologists were only able to extract part of the skull due to the poor condition of the bones,\" the statement added. \"The teeth and jaw fragments found earlier were cleaned and preserved in situ.\"\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nThe statement added that, while the discoveries of the teeth and the jaw are isolated, \"their presence in two different locations of the same quarry indicates that the quarry area may be promising for future discoveries.\"\n\"We appeal to all citizens of the country to take advantage of this opportunity to ensure the preservation of historical and cultural heritage objects, to inform the state body and archaeologists about the find, to conduct further research and to ensure safety,\" officials added.\nCLICK HERE FOR THE FOX NEWS APP\nFox News Digital reached out to the Ministry of Culture for comment, but did not receive an immediate response.\nFor more Lifestyle articles, visit www.foxnews.com/lifestyle."
    },
    {
      "url": "https://www.dailymail.co.uk/news/article-15027771/Bid-save-woman-stuck-22000ft-mountain-broken-leg-called-off.html",
      "text": "A bid to save a woman stuck 22,000ft up a mountain with a broken leg has been called off after ten days due to bad weather - and one rescuer died trying to help her.\nRussian mountaineer Natalia, also known as Natasha, Nagovitsina, 47, has been trapped at 22,965ft on Victory Peak in Kyrgyzstan, with a summit height of 24,406ft.\nNagovitsina, who is a well-known mountaineer, was reportedly seen moving on drone footage as recently as three days ago.\nShe was injured on August 12, when her climbing partner helped her as best they could before returning further down the mountain to get help.\nBut since then temperatures have sunk to minus 23C and multiple rescue attempts have ended in tragedy.\nItalian climber Luca Sinigaglia, 49, was one of those who attempted to rescue her and managed to deliver a sleeping bag, tent, food, water and a gas cooker to Nagovitsina.\nBut repeated efforts to bring her down failed, both by climbing and using a helicopter.\nMatters escalated after Sinigaglia himself then died on the mountain from prolonged exposure to low oxygen and hypothermia.\nRussian mountaineer Natalia, also known as Natasha, Nagovitsina, 47, has been trapped at 22,965ft on Victory Peak in Kyrgyzstan, with a summit height of 24,406ft\nDrone footage filmed four days ago showed clear movement from the sleeping bag she has been sheltering in\nNagovitsina went viral in 2021 after she refused to leave her husband Sergei (right), after he suffered a stroke at 22,000ft\nToday a final effort to climb to Nagovitsina was abandoned just 3,600ft below where she is stuck, with the weather set to worsen, as the team were ordered to return to base camp.\nPreviously attempts involved two separate helicopters, including a defence ministry Mi-8 helicopter which crashed as it sought to rescue her.\nAnother helicopter, a Mi-17VM, was sent, but zero visibility again forced rescuers to abandon the attempt.\nDmitry Grekov, rescue leader and head of base camp at Victory Peak, said today that experienced mountaineer Vitaly Akimov had led a team seeking to climb to Nagovitsina.\nBut the crew was forced to turn around when started suffering back pain from the helicopter crash and the mission was abandoned.\nSinigagli, who had also been on the helicopter, was hailed a hero on social media after news of his death reached base camp.\n'I turned the whole group around, there were four of them,' said Grekov.\nAsked if Nagovitsina was still alive, he admitted he did not know but said: 'I think not, because she has been there since 12 August - count how much time has passed.\nToday a final effort to climb to Nagovitsina was abandoned just 3,600ft below where Nagovitsina is stuck, with the weather set to worsen, as the team were ordered to return to base\nThe Kyrgyzstan Ministry of Emergency Situations confirmed the rescue mission has been called off\n'It is unrealistic. It is unrealistic to survive at such an altitude.'\nThe Kyrgyzstan Ministry of Emergency Situations confirmed the rescue mission had been called off.\nNagovitsina shot to fame four years ago when she refused orders to leave her husband alone on another mountain after he suffered a stroke at 22,638ft.\nHe died on the mountain, but she somehow managed to survive the incident in 2021.\nHer radio conversion with base camp went viral as she refused to leave husband Sergei Nagovitsin on the mountain, close to the borders of Kazakhstan, Kyrgyzstan, and China.\n'He can't sit up, falls on his side, his speech is confused,' she told rescuers.\n'Natasha, you need to go down yourself. You won't be able to help him in any way. Do you understand me? Over.'\nShe replied: 'I understand everything, but I will not leave him alone.'\nPrevious rescue efforts for the climber failed due to bad weather\nThe team later told her: 'You need to go down, Natasha, the weather is getting worse, it's almost night.'\n'I won't leave my husband, he's completely helpless, I'm giving him something to drink.'\n'So, your decision is to spend the night next to him?'\n'Yes.'\nRescuers eventually reached the pair and two men tried to move Sergey while she went down.\nBut they could not go far, and secured him with ropes, and left all their warm clothing and food, before cutting a route further down the mountain, to get more help.\nWhen they were able to return, he was nowhere to be found.\nA report on the incident ruled: 'Most likely in delirium he broke out of ropes and crashed to his death. His body has never been found.\n'A year later Natalia once again went to Khan Tengri to install a plaque in memory of her husband.\n'But no one in the new group had any idea what this courageous woman had lived through on that summit a year earlier – a woman who showed the whole world what love and self-sacrifice mean.'\nHis body was never found."
    },
    {
      "url": "https://www.foxnews.com/us/hiker-suffers-hypothermia-during-trek-new-englands-highest-peak-amid-east-coast-heat-wave",
      "text": "In a striking contrast to the sweltering heat gripping much of the East Coast, a 55-year-old hiker from Texas was rescued in frigid and treacherous conditions Friday evening from the high peaks of New Hampshire's White Mountains.\nCaroline Wilson, 55, of Austin, Texas, was found hypothermic and unresponsive on the Gulfside Trail, approximately one mile north of the Cog Railway tracks, while hiking Mount Washington, New England’s highest peak, the New Hampshire Fish and Game Department said in a release.\nThe department said Wilson became incapacitated during the hike, prompting her husband to call 911 at 5 p.m. He told authorities that she could no longer move or communicate.\nHIKER DISAPPEARS FROM ‘EDGE OF THE WORLD’ CAMPGROUND ON TRIP WITH FATHER\nConservation Officer Rachael Stocker told Fox News Digital that she assisted in the rescue mission, and said Wilson was wearing cotton base layers during her trek. She said cotton is not the best to wear during hiking because the material is absorbant to sweat.\nShe noted that on Friday, it was raining intermittently, causing the 55-year-old to succumb to the elements and suffer from severe hypothermia.\n\"The White Mountains can be pretty unforgiving,\" she said. \"Weather changes here in a flash.\" Photos from the scene of the rescue captured the misty environment and steep rocky terrain.\nNew Hampshire Fish and Game Department conservation officers, along with volunteers from Androscoggin Valley Search and Rescue, Pemigewassett Valley Search and Rescue, Mountain Rescue Service and personnel from the Mount Washington Cog Railway, mounted a complex response in severe alpine conditions to rescue Wilson.\nDespite a heat wave sweeping cities from Boston to Baltimore, conditions above 5,000 feet in the White Mountains were anything but warm. On the summit of Mount Washington on Friday, temperatures hovered around 20 degrees Fahrenheit, with wind speeds reaching 120 mph and dense cloud cover reducing visibility.\nHIKER FOUND DEAD IN MAINE, SEARCH CONTINUES FOR 28-YEAR-OLD DAUGHTER\nSeveral hikers in the region were reported suffering from hypothermia throughout the day, the department noted.\nThe Cog Railway played a crucial role in the rescue operation, transporting rescue teams up the mountain and sparing them a grueling three-mile ascent via the Jewell Trail, the department said.\nThe first rescue team reached the ridgeline at 7 p.m., with a second team arriving an hour later. Rescuers battled high winds and cold as they built a temporary shelter to stabilize Wilson before carrying her back to the waiting train.\nUpon arrival at the base station, Wilson was handed over to a Twin Mountain ambulance crew and transported to Littleton Regional Healthcare for further treatment, the department said.\nOfficials credited the successful outcome to the tireless efforts of rescue volunteers and the Cog Railway’s continued support in emergency efforts.\nCLICK HERE TO GET THE FOX NEWS APP\n\"The weather was not great and the conditions were potentially life-threatening,\" a department said, \"but each group responded to the call for assistance and endured less-than-hospitable weather conditions to save the life of this hiker.\""
    },
    {
      "url": "https://www.thetimes.com/world/europe/article/italian-climber-dies-trying-to-rescue-friend-stuck-on-kyrgyzstan-peak-zwwrjgkqg",
      "text": "We've tried to contact you several times as we haven't been able to take payment. You must update your payment details via My Account or by clicking update payment details to keep your subscription.\nWe've tried to contact you several times as we haven't been able to take payment. You must update your payment details via My Account, otherwise your subscription will terminate.\nItalian climber dies trying to rescue friend stuck on 7,400m peak\nLuca Sinigaglia has been hailed as a hero after twice risking his life to help Natalia Nagovitsyna who broke her leg near the summit of Pobeda Peak in Kyrgyzstan"
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    }
  ],
  "argos_summary": "The rescue of Russian mountaineer Natasha Nagovitsina on Kyrgyzstan’s Victory Peak has been called off after she broke her leg and remained stuck at 22,965 ft for over a week; Italian climber Luca Sinigaglia died of hypothermia while trying to aid her, and previous helicopter and climbing attempts—including a crash that injured four—failed. The article also reports other mountain incidents, such as a fatal fall in Glacier National Park, a missing climber in the Karakorum Mountains, and a rescue of a hypothermic hiker in New Hampshire, among other unrelated news.",
  "argos_id": "G7ISDIDY8"
}