{
  "url": "https://www.slashgear.com/1943951/hyundai-gm-collaboration-what-know-about-new-vehicles-being-developed/",
  "authorsByline": "Mark Cowley",
  "articleId": "a8da6ab7116b445a80d8956468823847",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/hyundai-gm-collaboration-what-we-know-about-the-5-new-vehicles-being-developed/l-intro-1755574628.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:15:00+00:00",
  "addDate": "2025-08-23T13:22:31.925343+00:00",
  "refreshDate": "2025-08-23T13:22:31.925344+00:00",
  "score": 1.0,
  "title": "Hyundai GM Collaboration: What We Know About The 5 New Vehicles Being Developed",
  "description": "The five Hyundai-GM vehicles are a U.S.-built EV van for North America, with a passenger car, compact SUV, and two pickups for Central and South America.",
  "content": "It's common for automakers to collaborate in order to share expertise and keep development costs as low as possible, with GM in particular having a long history of collaboration. Its joint venture with Toyota, NUMMI, was responsible for turning around the fortunes of the Fremont Assembly plant and producing some of the most reliable GM-badged vehicles of the era. More recently, GM and Honda's ongoing EV tie-up sees both automakers sharing their best ideas in a bid to reduce the cost of electric vehicles.\n\nIn August 2025, GM announced another collaboration, this time with South Korean automaker Hyundai. The two companies will co-develop five new vehicles, four for the Central and South American market and one for the North American market. Together, it's expected that these vehicles will sell around 800,000 units per year once production fully ramps up.\n\nThe sole model designed for North America will be an electric commercial van, which will be manufactured in the U.S., although neither company has decided on a location. According to GM, production is expected to begin in 2028. These Hyundai-GM collaboration vehicles will have different styling inside and out between the two brands, but will use a shared platform.",
  "medium": "Article",
  "links": [
    "https://www.slashgear.com/823206/honda-and-gm-are-teaming-up-on-affordable-evs/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Hyundai GM Collaboration",
      "weight": 0.1299819
    },
    {
      "name": "Hyundai GM",
      "weight": 0.11796704
    },
    {
      "name": "electric vehicles",
      "weight": 0.113521434
    },
    {
      "name": "GM",
      "weight": 0.110128365
    },
    {
      "name": "South Korean automaker Hyundai",
      "weight": 0.10237873
    },
    {
      "name": "collaboration",
      "weight": 0.08289339
    },
    {
      "name": "development costs",
      "weight": 0.08017496
    },
    {
      "name": "South Korean",
      "weight": 0.07935829
    },
    {
      "name": "North America",
      "weight": 0.076498896
    },
    {
      "name": "automakers",
      "weight": 0.07592593
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.88720703125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.7314453125
    },
    {
      "name": "/News/Technology News",
      "score": 0.5751953125
    },
    {
      "name": "/Autos & Vehicles/Vehicle Shopping/Vehicle Specs, Reviews & Comparisons",
      "score": 0.46240234375
    }
  ],
  "sentiment": {
    "positive": 0.63739085,
    "negative": 0.0332243,
    "neutral": 0.3293848
  },
  "summary": "In August 2025, General Motors (GM) will collaborate with South Korean automaker, Hyundai, to develop five new vehicles, four for the Central and South American market, and one for the North American market. The sole model for North America will be an electric commercial van, which will be manufactured in the U.S. The vehicles will have different styling but use a shared platform.",
  "shortSummary": "General Motors will partner with Hyundai on five new vehicles to reduce production costs, aiming to sell more than 800 units per year.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6e0f4d856888459f840de4cc1e1ae88d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/823206/honda-and-gm-are-teaming-up-on-affordable-evs/",
      "text": "Honda And GM Are Teaming Up On Affordable EVs\nHonda is strengthening its partnership with GM and now aims to co-develop millions of electric vehicles five years from now. Starting 2027, the two companies aim to push electric cars in the crossover category, which Honda claims forms the largest segment of cars sold in the world. The focus of the expanded ties between Honda and GM are affordable EVs that deliver world-class quality and will be sold globally. According to a Reuters report, GM's Executive Vice President Ken Morris told reporters that the company is eyeing a price tag of under $30,000 for the upcoming slate of affordable EVs, undercutting its own Chevrolet Equinox SUV and domain leader Tesla's uber-popular Model 3 vehicle. Honda and GM are already working together on two electric cars — Honda Prologue and the first Acura-branded SUV — both of which are slated to launch in 2024.\nThe series of low-cost electric cars that Honda and GM aim to develop will be based on the next-gen Ultium battery technology. Revealed back in March of 2020, Ultium employs pouch-style, large-format cells that can be stacked horizontally or vertically to achieve more flexibility in terms of battery shapes and sizes. The raw output can fall anywhere between 50 kWh and 200 kWh, while the range figures peak at 400 miles for the most powerful configuration.\nThis partnership can disrupt EV market dynamics\nAnother goal of the renewed partnership between the two automobile giants is to standardize vehicle parts and leverage each other's tech to achieve a high output for shipping electric cars worldwide. In the coming years, GM and Honda will work together to boost the performance of EVs and tone down the cost of electrifying vehicles. The two companies first joined hands in 2018 towards the development of battery tech and soon expanded the scope of collaboration to making electric cars together. Honda is already making EVs based on the in-house e:Architecture, but won't say how it will impact the development and marketing of affordable electric cars made in collaboration with GM. Financial details of the deal haven't been made public, but the strengthened ties are touted to help GM achieve its carbon neutrality goals by the year 2035, while Honda aims to accomplish the same in 2050.\nHonda is already a stakeholder in GM's Cruise unit that works on self-driving tech alongside Microsoft. The two companies previously worked together on hydrogen fuel cell tech and are now sharing inputs on solid-state batteries. Honda also inked a deal with Sony earlier this year for making EVs that are slated to hit the roads in 2025. Honda is quite bullish on the EV sales prospects, as the company aims to move roughly 70,000 units of the upcoming Prologue EV once it arrives at dealerships in 2024."
    }
  ],
  "argos_summary": "GM is expanding its global partnership strategy, teaming up with Hyundai to co‑develop five new vehicles—four for Central and South America and a U.S. electric commercial van slated for 2028—while also deepening ties with Honda to produce affordable EVs under $30,000. The Honda‑GM alliance will leverage GM’s Ultium battery platform and aim for millions of crossover EVs by 2027, with the Prologue and an Acura SUV launching in 2024. Both collaborations focus on shared platforms, standardized parts, and cost reductions to accelerate electrification and meet each company’s carbon‑neutral targets. The joint ventures also tap into broader tech synergies, including solid‑state batteries, self‑driving research, and Sony’s EV partnership.",
  "argos_id": "H283QSCOF"
}