{
  "url": "https://www.foxnews.com/politics/ted-cruz-endorses-chip-roy-texas-attorney-general-no-one-better",
  "authorsByline": "Landon Mion",
  "articleId": "ffb9db5b35f54db4846cbfd52b82f812",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/ted-cruz-chip-roy-texas-ag-fox-news-001.png?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T00:42:56-04:00",
  "addDate": "2025-08-24T04:51:31.615683+00:00",
  "refreshDate": "2025-08-24T04:51:31.615685+00:00",
  "score": 1.0,
  "title": "Ted Cruz endorses Chip Roy for Texas attorney general: 'No one better'",
  "description": "Sen. Ted Cruz has endorsed Rep. Chip Roy after the conservative congressman announced his candidacy to become the Lone Star State's next attorney general.",
  "content": "Sen. Ted Cruz, R-Texas, on Saturday endorsed Rep. Chip Roy, R-Texas, after the conservative congressman announced his candidacy to become the Lone Star State's next attorney general.Roy, who announced his run on Thursday, is seeking to replace the state's current attorney general, Ken Paxton, who decided not to run for re-election in 2026 and is instead running for U.S. Senate against Sen. John Cornyn, R-Texas.In his endorsement of Roy, Cruz said there were several excellent candidates running to be the state's next attorney general. Other declared Republican candidates include state Sens. Joan Huffman and Mayes Middleton, as well as former U.S. Assistant Attorney General for the Office of Legal Policy Aaron Reitz.\"There are several excellent candidates right now in the race for Texas Attorney General. All of them are friends of mine, and all of them have been strong supporters of mine for many, many years. Texas is blessed to have an abundance of strong conservatives stepping forward to lead, in such a time as this,\" Cruz said in a statement on Saturday.TEXAS REP CHIP ROY ANNOUNCES RUN FOR STATE ATTORNEY GENERAL TO REPLACE KEN PAXTONCruz said Roy was his first chief of staff and has been a close friend and ally for more than 12 years.\"We have been in more fights together than I can count, and I know Chip will always, always, always fight for conservative values,\" Cruz said.\"With over two decades of dedicated service to Texas, Chip has consistently shown the courage, integrity, and conviction required to defend our great state,\" he continued. \"He is a battle-tested warrior and a fierce defender of the Constitution. I have full confidence that he will stand up for the rule of law, preserve the rights and freedoms of Texans, and hold those who threaten our great state accountable. There is no one better equipped to lead the Office of the Texas Attorney General, and I know that he will ferociously fight and protect the Lone Star State.\"Roy made the announcement in a campaign video shared on X, saying he strives to preserve the state's legacy of \"liberty, freedom and self-determination.\"\"Texas has a long and proud tradition of rising to defend our homes, our freedom, and our communities,\" he wrote in an accompanying message. \"I’m running for Attorney General to carry on that legacy… unafraid to fight, unafraid to win, and unafraid to defend Texas at every turn. #LiveFree.\"Roy said it has been an honor to represent the 21st Congressional District in the U.S. House and that he was particularly proud \"of our work to deliver on President Trump's agenda and fight to drain the swamp.\"LONE STAR STATE RIVALS FOR US SENATE COMPETE TO WRANGLE RUNAWAY DEMOCRATS\"I could do it forever and be fulfilled professionally. But representatives should not be permanent. And my experience watching Texans unite in response to the devastating Hill Country floods made clear that I want to come home,\" Roy said in a statement. \"I want to take my experience in Congress, as a federal prosecutor, and as First Assistant Attorney General to fight for Texas from Texas.\"\"Texas is under assault – from open-border politicians, radical leftists and faceless foreign corporations that threaten our sovereignty, safety and our way of life,\" he added. \"It's time to draw a line in the sand. As Attorney General, I will fight every single day for our God-given rights, for our families and for the future of Texas.\"Roy has served in the U.S. House since 2019.Fox News' Danielle Wallace contributed to this report.",
  "medium": "Article",
  "links": [
    "https://foxnews.com/person/c/sen-ted-cruz",
    "https://foxnews.com/person/r/chip-roy",
    "https://www.foxnews.com/politics/lone-star-state-rivals-us-senate-compete-wrangle-runaway-democrats",
    "https://foxnews.com/person/p/ken-paxton",
    "https://www.foxnews.com/video/6377208106112",
    "https://www.foxnews.com/apps-products",
    "https://www.foxnews.com/politics/texas-rep-chip-roy-announces-run-state-attorney-general-replace-ken-paxton"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Texas Attorney General",
      "weight": 0.091957234
    },
    {
      "name": "Texas attorney general",
      "weight": 0.085181125
    },
    {
      "name": "First Assistant Attorney General",
      "weight": 0.074773215
    },
    {
      "name": "Texas",
      "weight": 0.07357706
    },
    {
      "name": "STATE ATTORNEY GENERAL",
      "weight": 0.0732909
    },
    {
      "name": "Attorney General",
      "weight": 0.0721804
    },
    {
      "name": "state Sens. Joan Huffman",
      "weight": 0.070655316
    },
    {
      "name": "\"LONE STAR STATE RIVALS",
      "weight": 0.070237465
    },
    {
      "name": "Chip Roy",
      "weight": 0.069157876
    },
    {
      "name": "Rep. Chip Roy",
      "weight": 0.06780541
    }
  ],
  "topics": [
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9931640625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.98388671875
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.93505859375
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.8828125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.33740234375
    },
    {
      "name": "/News/Local News",
      "score": 0.319091796875
    }
  ],
  "sentiment": {
    "positive": 0.49503934,
    "negative": 0.15695445,
    "neutral": 0.3480062
  },
  "summary": "Sen. Ted Cruz, R-Texas, has endorsed Rep. Chip Roy for Texas attorney general, stating he is \"no one better\" to replace Ken Paxton, who is running for U.S. Senate. Other declared Republican candidates include state Sens. Joan Huffman and Mayes Middleton, and former U.N. Assistant Attorney General for the Office of Legal Policy Aaron Reitz. Roy has served in the U.P. House since 2019 and is seeking to replace Paxton.",
  "shortSummary": "Sen. Ted Cruz endorsed Rep. Chip Roy for Texas attorney general, praising his leadership and integrity, while other Republican candidates, including himself, also stood.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9d51254cc600421e9a998d5d0f6d1eac",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/politics/lone-star-state-rivals-us-senate-compete-wrangle-runaway-democrats",
      "text": "A super PAC supporting Texas Attorney General Ken Paxton's 2026 primary challenge against longtime Republican Sen. John Cornyn is showcasing the MAGA firebrand's efforts in the Lone Star State's high-stakes redistricting battle.\nIt's the latest example of how the redistricting showdown in Texas is shaping what is likely to be one of the most bruising and expensive Senate races in next year's midterm elections.\nA digital spot by Lone Star Liberty PAC includes a compilation of cable news reports, and it highlights Paxton's efforts to track down Democratic Texas lawmakers who fled the state to prevent the Republican-dominated legislature from voting on new GOP-crafted congressional maps in the red state that would create five more right-leaning congressional districts.\nIt includes a clip of Paxton pushing \"to remove some of these legislators from office\" and conservative media figures praising the attorney general's moves. If also includes a photo of Paxton standing next to President Donald Trump, who remains neutral to date in the GOP primary battle.\nTEXAS ATTORNEY GENERAL PAXTON INVESTIGATING BETO O'ROURKE\nThe Republican push in Texas, which comes at Trump's urging, is part of a broader effort by the GOP across the country to keep control of its razor-thin House majority in the 2026 midterms, when the party in power traditionally faces political headwinds and loses seats.\nTrump and his political team are aiming to prevent what happened during his first term in the White House, when Democrats stormed back to grab the House majority in the 2018 midterms.\nSEN. CORNYN SUCCESSFUL IN URGING FBI TO TRACK DOWN FLEEING TEXAS DEMOCRATIC STATE LAWMAKERS\nWhile the redistricting battle has spread to states across the country as Democratic governors in blue states and GOP governors in red states move toward rare mid-decade gerrymandering pushes of their own, the dispute in Texas is taking center stage in the GOP Senate primary.\nTexas-based veteran Republican strategist Tyler Norris told Fox News Cornyn and Paxton \"are using every tool at their disposal to prove that they're both dedicated to helping the Trump administration gain more seats in Congress for 2026.\"\nCornyn spotlighted his urgent letter asking the FBI for help in tracking down the Democratic state lawmakers who fled Texas. The senator's move resulted in the FBI approving his request to locate the AWOL lawmakers.\n\"I am proud to announce that Director Kash Patel has approved my request for the FBI to assist state and local law enforcement in locating runaway Texas House Democrats,\" Cornyn said in a statement. \"We cannot allow these rogue legislators to avoid their constitutional responsibilities.\"\nBut it remains unclear whether the FBI could actually return the lawmakers to Texas.\nPaxton is also looking into whether two political action committees aligned with former Democratic Rep. Beto O'Rourke of Texas may have violated state laws by assisting the state lawmakers who fled.\n\"Any Democrat coward breaking the law by taking a Beto bribe will be held accountable,\" Paxton said this week during a news conference.\nO'Rourke came close to ousting Sen. Ted Cruz in the 2018 midterms before running unsuccessfully for the 2020 Democratic presidential nomination. He lost to Texas Gov. Greg Abbott in the state's 2022 gubernatorial contest, and is considering jumping into the 2026 Senate race in Texas.\nHe's been visible in his support for the fleeing Texas Democrats.\nAnd O'Rourke has pushed back against Paxton.\n\"The guy impeached for bribery is going after the folks trying to stop the theft of five Congressional seats,\" O'Rourke argued in a social media post Wednesday. \"Let's stop these thugs before they steal our country.\"\nBut Paxton scored a victory over O'Rourke on Friday, as a Texas county judge granted him a temporary restraining order to prevent O'Rourke and his political groups from funding the state lawmakers who left Texas.\nTexas state Sen. James Talarico, who is also moving toward entering the Senate race, is among the Democrats who fled to Illinois to prevent the legislature from voting on the redistricting plan.\nSince arriving in Illinois, Talarico has sat for a couple dozen interviews with media outlets across the country.\nCLICK HERE TO GET THE FOX NEWS APP\nThe only major Democrat who's already announced his candidacy in the Senate race, former Rep. Colin Allred, is also supportive of the fleeing lawmakers.\nBut Allred, who is making his second straight bid for the Senate in Texas, has not been in the media spotlight to the degree of Talarico or O'Rourke."
    },
    {
      "url": "https://www.foxnews.com/apps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/politics/texas-rep-chip-roy-announces-run-state-attorney-general-replace-ken-paxton",
      "text": "U.S. Rep. Chip Roy, R-Texas, announced Thursday that he is running to become the next Texas Attorney General.\nRoy, who represents Texas' 21st Congressional District in the U.S. House, made the announcement in a campaign video shared to X that centered on preserving the Lone Star State's legacy of \"liberty, freedom and self-determination.\"\n\"Texas has a long and proud tradition of rising to defend our homes, our freedom, and our communities,\" he wrote in an accompanying message. \"I’m running for Attorney General to carry on that legacy… unafraid to fight, unafraid to win, and unafraid to defend Texas at every turn. #LiveFree.\"\nLONE STAR STATE RIVALS FOR US SENATE COMPETE TO WRANGLE RUNAWAY DEMOCRATS\nThe race is slated for November 2026 – the same time as Republicans defend a slim minority in the House during the midterm elections. A primary is scheduled for March.\nTexas Attorney General Ken Paxton is eligible for a fourth term but is not seeking re-election as the state's top prosecutor. In April, Paxton announced that he was instead running a 2026 primary challenge to U.S. Sen. John Cornyn, making for a clash between two powerful Republicans that could have state and national implications.\n'NOT A POLITICIAN': FATHER OF YOUNG CANCER SURVIVOR DJ DANIEL RUNS FOR TEXAS 18TH DISTRICT SEAT\nRoy, policy chair of the far-right House Freedom Caucus, said it has been an honor to represent the 21st Congressional District and that he was particularly proud \"of our work to deliver on President Trump's agenda and fight to drain the swamp.\"\n\"I could do it forever and be fulfilled professionally. But representatives should not be permanent. And my experience watching Texans unite in response to the devastating Hill Country floods made clear that I want to come home,\" Roy, who has served the central Texas district since 2019, said in a statement. \"I want to take my experience in Congress, as a federal prosecutor, and as First Assistant Attorney General to fight for Texas from Texas.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"Texas is under assault – from open-border politicians, radical leftists and faceless foreign corporations that threaten our sovereignty, safety and our way of life,\" Roy said. \"It's time to draw a line in the sand. As Attorney General, I will fight every single day for our God-given rights, for our families and for the future of Texas.\"\nThis is a developing story. Check back for updates."
    }
  ],
  "argos_summary": "Sen. Ted Cruz endorsed Rep. Chip Roy for Texas Attorney General after Roy announced his candidacy, praising him as a longtime ally and conservative warrior. Roy’s campaign emphasizes defending Texas’s liberty, freedom, and self‑determination, and he highlights his experience in Congress, federal prosecution, and as former First Assistant Attorney General. The endorsement comes amid a broader Texas political landscape where Attorney General Ken Paxton is leaving the office to challenge Sen. John Cornyn in the 2026 Senate race, and the state is embroiled in a contentious redistricting battle that has drawn national attention.",
  "argos_id": "H2VIEXAYO"
}