{
  "url": "https://www.washingtonexaminer.com/policy/immigration/3780044/homan-vows-continue-ice-arrests-after-alligator-alcatraz-shutdown-order/",
  "authorsByline": "Zach LaChance",
  "articleId": "a057e4a2efee4734bd52a4073935e882",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2025/08/homan-alligator-alcatraz-shutdown-order-response.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T01:27:24+00:00",
  "addDate": "2025-08-24T01:37:53.989774+00:00",
  "refreshDate": "2025-08-24T01:37:53.989775+00:00",
  "score": 1.0,
  "title": "Homan vows to continue ICE arrests after 'Alligator Alcatraz' shutdown order",
  "description": "Homan addressed the decision for the first time on Saturday, largely appearing unconcerned about it potentially hampering the administration's mass deportation plans.",
  "content": "Border czar Tom Homan said U.S. Immigration and Customs Enforcement deportation operations would continue after Florida’s “Alligator Alcatraz” immigration detention facility was ordered to be shut down within 60 days.\n\nThe Trump administration was handed a legal setback on Thursday after a federal judge ordered the shutdown of the large-scale detention facility, saying it violated a federal law that requires an environmental review before any major federal construction project. Florida immediately appealed the decision, which requires the removal of all migrants housed at the facility, as well as generators, fencing, and other construction materials.\n\nHoman addressed the decision for the first time on Saturday, largely appearing unconcerned about it potentially hampering the Trump administration’s mass deportation plans, especially as more facilities like “Alligator Alcatraz” are in the works.\n\n“They’re not going to stop us doing what we’re doing. We’ll follow the judge’s order and we’ll litigate and we’ll appeal it. But [the] bottom line is, we’re going to continue to arrest public safety threats and national security threats every day across this country,” he said in an interview with NewsNation.\n\nHoman added that migrants could simply be moved to another facility, though he did not specify where that would be.\n\n“If we have to send them to another facility. That’s what we’re going to do. That’s why the president has asked for 100,000 beds in the ‘big, beautiful bill.’ So, we’re going to build 100,000 beds, so we’re not going to have a lack of bed space,” the border czar said.\n\nHe also slammed Judge Kathleen M. Williams, who issued the order, as “radical,” echoing other remarks from Florida officials including Gov. Ron DeSantis (R-FL), who blasted Williams as an “activist judge that is trying to do policy from the bench.”\n\nDeSantis has been optimistic that the state’s appeal will succeed, however.\n\n“We’re not going to be deterred; we’re totally in the right on this,” he said on Friday. “This is not going to deter us. We’re going to continue working on the deportations, advancing that mission.”\n\nThe case will play out in the 11th U.S. Circuit Court of Appeals in Atlanta, with a court date not yet set.",
  "medium": "Article",
  "links": [
    "https://www.washingtonexaminer.com/policy/immigration/3778215/florida-judge-order-alligator-alcatraz-shut-down-60-days/",
    "https://www.politico.com/news/2025/08/22/desantis-alligator-alcatraz-ruling-wont-deter-florida-immigration-enforcement-00519721",
    "https://x.com/LibbeyDean_/status/1959380788778008798"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "more facilities",
      "weight": 0.082642935
    },
    {
      "name": "Alligator Alcatraz",
      "weight": 0.0766645
    },
    {
      "name": "Border czar Tom Homan",
      "weight": 0.07470307
    },
    {
      "name": "Judge Kathleen M. Williams",
      "weight": 0.06991846
    },
    {
      "name": "Kathleen M. Williams",
      "weight": 0.06893405
    },
    {
      "name": "bed space",
      "weight": 0.068585396
    },
    {
      "name": "Gov. Ron DeSantis",
      "weight": 0.06752274
    },
    {
      "name": "Florida officials",
      "weight": 0.06591183
    },
    {
      "name": "Tom Homan",
      "weight": 0.065210745
    },
    {
      "name": "other construction materials",
      "weight": 0.065141514
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.9267578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.89453125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.88720703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.705078125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.60498046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.59130859375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.5009765625
    }
  ],
  "sentiment": {
    "positive": 0.036408927,
    "negative": 0.81501985,
    "neutral": 0.14857116
  },
  "summary": "Border czar Tom Homan has stated that U.S. Immigration and Customs Enforcement (ICE) deportation operations will continue following a federal judge's order that Florida's \"Alligator Alcatraz\" immigration detention facility was ordered to be shut down within 60 days. The decision was made by the federal government, which violated a federal law that requires an environmental review before any major federal construction project. Florida immediately appealed the decision, which requires the removal of all migrants housed at the facility and other construction materials. Homan, who addressed the decision for the first time, appeared unconcerned about potential hindering the administration's mass deportation plans, stating that migrants could simply be moved to another facility. The case will be heard in the 11th U.",
  "shortSummary": "Border czar Tom Homan vows to continue ICE deportation operations despite a federal judge's order shutting down Florida’s \"Alligator Alcatraz” detention facility within 60 days.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "84cbbe966da14fa29fddd7dbef4ae1a9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.washingtonexaminer.com/policy/immigration/3778215/florida-judge-order-alligator-alcatraz-shut-down-60-days/",
      "text": "A federal judge late Thursday ordered Florida’s “Alligator Alcatraz” immigration detention facility to be shut down within 60 days.\nDetainees currently housed at the facility must be moved out within the time frame, as well as generators, fencing, and other construction materials.\nJudge Kathleen M. Williams of the Federal District Court in Miami criticized the federal and state governments for not considering the facility’s environmental impacts.\nWilliams said the governments violated a federal law that requires an environmental review before any major federal construction project. She added that it damages the surrounding wetlands and communities that rely on the Everglades for their water supply.\n“The project creates irreparable harm in the form of habitat loss and increased mortality to endangered species in the area,” she wrote.\nThe judge partly granted a preliminary injunction to environmentalists and the local Miccosukee Tribe.\nThe ruling is preliminary, and the state is expected to ask for a stay of the ruling. The Trump administration argued that the National Environmental Policy Act did not apply because the facility houses federal immigration detainees and is run by the state.\nGov. Ron DeSantis‘s (R-FL) administration said some of its authority to operate the center came from the federal government delegating its immigration enforcement powers to the state.\nWilliams concluded that because the center is subject to federal funding, standards, and direction, it is also subject to federal environmental laws. She wrote that the court will “adhere to the time-tested adage: If it walks like a duck, quacks like a duck, and looks like a duck, then it’s a duck.”\nDOZENS OF DEMOCRATS DEMAND INFORMATION FROM DHS ON ‘ALLIGATOR ALCATRAZ’\nDeSantis was pessimistic that Williams would rule in their favor. “It’s pretty clear we’re in front of a judge who is not going to give us a fair shake on this,” he said on Tuesday.\nSeveral other federal immigration camps have cropped up across the nation as the Trump administration seeks housing for its mass deportation agenda."
    }
  ],
  "argos_summary": "A federal judge ordered Florida’s “Alligator Alcatraz” immigration detention center shut down within 60 days for violating environmental law, prompting the Trump administration to appeal and promise continued deportation operations. Border czar Tom Homan said the shutdown would not halt mass deportations and that migrants could be moved to other facilities, citing a planned 100,000-bed expansion. Governor Ron DeSantis criticized the judge as “radical” and said the state’s appeal would succeed, while the case moves to the 11th Circuit. The judge cited damage to wetlands and endangered species, noting the center’s federal funding made it subject to the National Environmental Policy Act. The decision highlights tensions between federal immigration enforcement and environmental regulations.",
  "argos_id": "HE3VGKF20"
}