{
  "url": "https://www.yahoo.com/lifestyle/articles/shopper-outraged-noticing-bizarre-detail-204500634.html",
  "authorsByline": "Joseph Clark",
  "articleId": "1d4572a7accc4a9d83766e76816dcb56",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/oExuEZHhNYBZbeCsTZjf0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02ODg7Y2Y9d2VicA--/https://media.zenfs.com/en/the_cool_down_737/90f39d9dd8e5f052811f84abb29da6c1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T20:45:00+00:00",
  "addDate": "2025-08-23T21:38:54.395878+00:00",
  "refreshDate": "2025-08-23T21:38:54.395880+00:00",
  "score": 1.0,
  "title": "Shopper outraged after after noticing bizarre detail on items at thrift store: 'They should be ashamed'",
  "description": "\"If I worked there and I was pricing, those would go in the trash.\"",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nPeople are paying more for thrift store finds — and sometimes for stuff that shouldn't even be there.\n\nA Reddit user posted in r/ThriftGrift, sharing photos from a Goodwill in Chattanooga, Tennessee, that showed two pairs of worn running shoes, both priced at $13.39. One was made by Adidas, the other by New Balance. The wear and tear made the price feel even less fair.\n\nThe photos show scuffed soles, creased fabric, and flattened heels — not the condition you expect for anything over $10.\n\nOne Redditor said: \"This is every Goodwill now it seems. I used to buy all my jeans from Goodwill but lately I've been going to Ross. They're either cheaper, same price, or slightly higher prices than Goodwill but they're brand new! So sad that the days of thrift shopping are gone for me.\"\n\nThis sparked wider chatter about thrift store pricing. A Yahoo Finance report noted that Goodwill pulls in over $5 billion annually, and critics argue that pricing now mirrors retail more than the low-cost option it once was. That tension plays out in this case: shoppers paying close to retail for items that should've been marked down — or tossed.\n\nAnother user added: \"Oof, I'm organizing a rummage sale and any shoes that are not in excellent condition are getting tossed! No one wants to buy old and dirty shoes and that price is criminal!\"\n\nStill, thrifting remains a smart and sustainable choice. Some shoppers have found vintage dinnerware at major discounts. Others uncovered authentic Japanese kimonos and name-brand tableware at a fraction of the original cost. The money saved is only part of the upside — it also helps keep perfectly usable items out of landfills.\n\nAs one user put it, \"Those look like they were consigned for yard work 20 years ago.\"\n\nShoppers want honesty. If donation bins are doubling as return drop-offs for clearance items, they deserve to know. That transparency affects more than just pricing — it determines trust.\n\n\"If I worked there and I was pricing those would go in the trash,\" one user wrote.\n\nAnother added: \"I sold my practically new barely worn gym shoes for $15 and they're selling dirty old shoes for $13+?? They should be ashamed.\"\n\nJoin our free newsletter for good news and useful tips, and don't miss this cool list of easy ways to help yourself while helping the planet.",
  "medium": "Article",
  "links": [
    "https://guide.thecooldown.com/recording-votes/should-it-be-illegal-to-throw-away-old-clothes/?answer=1&article=rec3YK3LmuDlteaWD",
    "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5icx63/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5ilb3k/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://guide.thecooldown.com/recording-votes/should-it-be-illegal-to-throw-away-old-clothes/?answer=4&article=rec3YK3LmuDlteaWD",
    "https://rb.gy/ivhzmj",
    "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5htogb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://finance.yahoo.com/news/goodwill-becoming-more-expensive-walmart-150225159.html",
    "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5idjeb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://www.reddit.com/r/ThriftGrift/",
    "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5i5cni/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://guide.thecooldown.com/recording-votes/should-it-be-illegal-to-throw-away-old-clothes/?answer=3&article=rec3YK3LmuDlteaWD",
    "https://www.thecooldown.com/future-newsletter/?rec3YK3LmuDlteaWD",
    "https://guide.thecooldown.com/recording-votes/should-it-be-illegal-to-throw-away-old-clothes/?answer=2&article=rec3YK3LmuDlteaWD"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "thrift store pricing",
      "weight": 0.08796389
    },
    {
      "name": "thrift store",
      "weight": 0.07996257
    },
    {
      "name": "thrift store finds",
      "weight": 0.07846187
    },
    {
      "name": "worn running shoes",
      "weight": 0.0727767
    },
    {
      "name": "dirty old shoes",
      "weight": 0.07257235
    },
    {
      "name": "clearance items",
      "weight": 0.07206129
    },
    {
      "name": "Goodwill",
      "weight": 0.07109923
    },
    {
      "name": "thrift shopping",
      "weight": 0.06943321
    },
    {
      "name": "items",
      "weight": 0.065600134
    },
    {
      "name": "authentic Japanese kimonos",
      "weight": 0.05826359
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.84814453125
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.7314453125
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.38427734375
    }
  ],
  "sentiment": {
    "positive": 0.082434095,
    "negative": 0.64839435,
    "neutral": 0.2691715
  },
  "summary": "Yahoo is using AI to generate takeaways from this article, which may not always match what's in the article but helps improve the user's experience. However, the company may face criticism for paying more for items that should've been marked down or discarded. A Reddit user shared photos from a Goodwill in Chattanooga, Tennessee, showing two pairs of worn running shoes, both priced at $13.39 and $11.99, which were not the condition you expect for anything over $10. The photos sparked widespread discussion about thrift store pricing, with critics arguing that it now resembles retail more than the low-cost option it once was. Despite this, thrifting remains a smart and sustainable choice. The money saved is also beneficial as it helps keep perfectly usable items out of landfills.",
  "shortSummary": "A Reddit post about improper thrift store pricing led to outrage among users, highlighting the growing trend of paying exorbitant prices and often in poor condition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5a4439dd713147218c6c599472e7c004",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://rb.gy/ivhzmj",
      "text": "TCD\nMarketplace\nYour go-to resource for helping yourself while\nhelping the planet💡\nMarketplace Spotlight\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nAt The Cool Down, we're all about making it easy to help yourself while helping the planet.\nThe lifestyle solutions we've curated here feature partners we've vetted across a wide range of everyday activities — everything from the way you power your home to the way you buy your food to the way you get rid of your old stuff. Check out the list below, and don't miss the TCD Guide for a deep dive into all the smart choices you can make for yourself and your family.\nPS: We regularly add new partners to our marketplace, so be sure to sign up for alerts below, and please drop us a line at hello@thecooldown.com if you have specific problems you're trying to solve.\nJump to...\n🏠 Upgrade your home and lower your bills\n🍔 Eat better food and save money on groceries\n💸 Declutter your life and make money on your stuff\n🏠 Upgrade your home and lower your bills\nThanks to massive tax credits and rapid innovation, it's never been cheaper or easier to cut your utility bills by upgrading your home and using less energy. Here's how to get started:\n✅ Rewiring America can help you make sense of all the tax incentives available to you.\n✅ EnergySage makes it easy to save thousands on home solar by comparing quotes from trusted installers — and depending on where you live, they can help you save big on a heat pump or take advantage of community solar too.\n✅ Duxtop offers a sleek, affordable induction burner that lets you try the hottest, healthiest cooking technology without tearing out your old stove.\nMore from the TCD Guide\n🍔 Eat better food and save money on groceries\nGrocery bills are officially out of control these days, but there are more options than ever before to save money on delicious food and contribute to waste reduction along the way. These are our favorites:\n✅ Flashfood's free app makes it easy to browse for massive deals at local grocery stores on fresh food that's nearing its expiration date.\n✅ Too Good To Go's free app lets you pick up surprise bags of extra food from local restaurants at ridiculous discounts.\n✅ Martie and Misfits Market both give you ultra-convenient options for steep discounts on home deliveries.\nMore from the TCD Guide\n💸 Declutter your life and make money on your stuff\nIf you're like us, you probably have a closet (or closets) full of old stuff you need to get rid of but feel bad about trashing. Fortunately, the circular revolution means there are plenty of ways to give your stuff a second life and make money in the process:\n✅ GotSneakers will pay you cash every time you send in a free bag of your old shoes.\n✅ Trashie's convenient Take Back Bag can handle everything from clothes to shoes to towels to sheets — and earns you $30 in rewards every time you use it.\n✅ For that junk drawer full of old electronics, Walmart, Best Buy, Target, Costco, and Apple will all give you store credit when you bring in old devices."
    },
    {
      "url": "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5icx63/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "Goodwill in Chattanooga TN area has lost their mind!\nWent to one of their goodwillls today. Apparently they all received the same corporate memo on pricing dirty stuff.\nReddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy."
    },
    {
      "url": "https://www.thecooldown.com/future-newsletter/?rec3YK3LmuDlteaWD",
      "text": "TCD\nNewsletters\nThe coolest tech shaping our cleaner future,\nstraight to your inbox💡\nTCD Marketplace\n💡Connect with these trusted partners to save more, waste less, and upgrade your life\nCooler Future — Straight To Your Inbox\nAt The Cool Down, we're all about keeping you on the cutting edge of a cleaner, cooler future.\nYes, we're facing serious challenges, but there are real solutions to our problems, and the solutions are going to make all of our lives better — they're going to make us safer, richer, healthier, and happier. All we have to do is make the choice to act.\nOur newsletters deliver good news, useful advice, and easy hacks straight to your inbox — and we hope you'll let us be your guide in building a cooler future for yourself and your loved ones."
    },
    {
      "url": "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5ilb3k/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "Goodwill in Chattanooga TN area has lost their mind!\nWent to one of their goodwillls today. Apparently they all received the same corporate memo on pricing dirty stuff.\nReddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy."
    },
    {
      "url": "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5idjeb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "Goodwill in Chattanooga TN area has lost their mind!\nWent to one of their goodwillls today. Apparently they all received the same corporate memo on pricing dirty stuff.\nReddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy."
    },
    {
      "url": "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5htogb/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "Goodwill in Chattanooga TN area has lost their mind!\nWent to one of their goodwillls today. Apparently they all received the same corporate memo on pricing dirty stuff.\nReddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy."
    },
    {
      "url": "https://www.reddit.com/r/ThriftGrift/comments/1mauorr/comment/n5i5cni/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "Goodwill in Chattanooga TN area has lost their mind!\nWent to one of their goodwillls today. Apparently they all received the same corporate memo on pricing dirty stuff.\nReddit and its partners use cookies and similar technologies to provide you with a better experience. By accepting all cookies, you agree to our use of cookies to deliver and maintain our services and site, improve the quality of Reddit, personalize Reddit content and advertising, and measure the effectiveness of advertising. By rejecting non-essential cookies, Reddit may still use certain cookies to ensure the proper functionality of our platform. For more information, please see our Cookie Notice and our Privacy Policy."
    },
    {
      "url": "https://finance.yahoo.com/news/goodwill-becoming-more-expensive-walmart-150225159.html",
      "text": "Thrifters have noticed a significant change in recent years when it comes to Goodwill prices. Instead of finding incredible bargains like $2 tops and $0.50 books, they are encountering higher prices, sometimes even surpassing the prices of new items at Walmart or Target.\nAs thrifting and sustainable shopping have gained popularity, particularly among Gen Z, with thrift hauls flooding TikTok, it begs the question: Why is Goodwill becoming more expensive, and are these rising prices justified?\nLet’s delve into the items where Goodwill might cost you more than mainstream retailers, explore the reasons behind the price hike and discover tips for staying thrifty while shopping secondhand.\nGoodwill Items That Could Cost Less at Walmart and Target\nNobody heads to Goodwill intending to spend more on used items than they would on new ones at Walmart or Target. However, many recent shoppers have been taken aback by overpriced items at the thrift store, making them question whether they should stick to their local mainstream retailers.\nGoodwill has been a go-to for those seeking unique, affordable dishes. But when it comes to basic items like jars and coffee mugs, shoppers don’t want to spend extra money when they could easily find them at Walmart or Target.\n“The other day I saw a freaking spaghetti sauce jar for $2.99. If you bought the actual spaghetti sauce that comes in the same jar? $1.98,” said a Reddit commenter.\nWhile browsing through the funny phrases on old coffee mugs at Goodwill can be amusing, shoppers have noticed that the high prices on these items don’t always align with their value.\n“I can go to Goodwill and buy someone’s old, scratched-up coffee cup for $2.29 or go to Ikea or the dollar store and buy a new one for $1,” another a Reddit user said.\nSoap\nAlthough Goodwill can occasionally offer incredible deals, some of its pricing seems to lack thorough research.\n“So many things at my Goodwill I can get cheaper new,” a Reddit user said. “And some stuff I know they were selling for more than what it cost in the first place. They were trying to sell a normal bottle of soft soap for $3. At Walmart, it is $1.24.”\nClothing\n“I was in Goodwill last week. They had used men’s boxer shorts for $4.99 each. Used! And Hanes, not a fancy designer,” a Reddit commenter said.\nA three-pack of Hanes boxer shorts from Walmart costs only $10.98 (or $3.66 each), making Goodwill’s prices miss the mark for shoppers seeking affordable clothing basics.\n“I could buy threadbare Wrangler or Rustler jeans at Goodwill for $8 a pair or buy the same clothes at Walmart for maybe a few dollars more,” said another Redditor.\nWhy Is Goodwill More Expensive?\nExperienced thrifters who have been loyal to Goodwill for years have noticed the recent price hikes. But what factors are contributing to the increasing costs of items at this once budget-friendly thrift store?\nWhile some Goodwill prices may seem completely unreasonable, there appears to be a general upward trend in prices across all departments.\n“Goodwill’s rising prices can be attributed to several factors,” said Casey Jones, founder and head of marketing and finance at CJ&CO. “Firstly, the cost of operations — including rent, utilities and wages — has increased over time. Secondly, the quality and brand of donated items can also influence pricing. High-end brands or items in excellent condition may be priced higher.\n“Lastly, the demand for thrifted items has grown, especially among environmentally conscious consumers, which can drive up prices.”\nHow Shoppers Can Stay Thrifty at Thrift Stores\nDespite the increasing popularity and prices of secondhand shops, there are still ways for shoppers to find amazing deals while maintaining a thrifty mindset. Here are some tips.\nKnow the Value\nYou’ll want to avoid being the person who unknowingly buys bottled soap for $3 at Goodwill when it costs only $1.24 at Walmart.\n“Understand the retail price of items to ensure you’re getting a good deal,” Jones said.\nShop on Discount Days\nMaximize your savings by shopping on discount days. Visit your local Goodwill to find out which days offer markdowns on specific categories.\n“Many thrift stores, including Goodwill, have discount days where certain items or categories are marked down,” Jones said.\nAdditionally, Goodwill stores often provide military, veteran, student and senior discounts on specific days of the week (discounts vary by store and location).\nExplore Other Thrift Stores\n“Prices can vary greatly between different thrift stores,” Jones said. “Local, non-chain thrift stores often have lower prices.”\nTake a look at St. Vincent De Paul, The Salvation Army, Savers and other boutiques in your area to compare prices and find a thrift store that fits your secondhand budget.\nSecondhand Alternatives to Goodwill\nIn today’s digital age, thrift stores are no longer limited to brick-and-mortar establishments. Online thrift websites, where anyone can buy and sell clothing, have contributed to the rise of online thrift shopping, offering increasing competition to Goodwill.\n“Local thrift stores, consignment shops and online platforms like eBay, Poshmark and ThredUP offer a wide variety of secondhand items,” Jones said. “Garage sales and estate sales can also be great sources of low-cost items.”"
    }
  ],
  "argos_summary": "Goodwill stores are raising prices on used items, prompting shoppers to question whether thrift shopping remains a bargain. Reddit users report worn shoes and other goods priced near retail, while a Yahoo Finance report notes Goodwill’s $5 billion annual revenue and critics argue the pricing now mirrors mainstream retailers. Despite higher prices, many still find vintage and name‑brand items at a discount, and experts suggest shoppers compare prices, shop on discount days, and explore alternative thrift outlets to stay thrifty.",
  "argos_id": "I31IANVAF"
}