{
  "url": "https://finance.yahoo.com/news/enki-elixir-announces-2025-expansion-205000223.html",
  "authorsByline": "Enki Elixir",
  "articleId": "a3a4fb45f2444722a3dcc92cf86c24b2",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/globenewswire.com/67513eb6de2b07344dba612eab7584ca",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T20:50:00+00:00",
  "addDate": "2025-08-23T20:58:22.489315+00:00",
  "refreshDate": "2025-08-23T20:58:22.489317+00:00",
  "score": 1.0,
  "title": "Enki Elixir Announces 2025 Expansion After Being Mentioned as a Top Pineal Gland Supplement in Wellness Discussions",
  "description": "Recognized among the best pineal gland supplements for 2025, Enki Elixir responds to rising consumer demand with ingredient-first transparencyLos Angeles, Aug. 23, 2025 (GLOBE NEWSWIRE) -- This press release is for informational purposes only. The information contained herein does not constitute medical advice, diagnosis, or treatment and has not been evaluated by the Food and Drug Administration (FDA). Enki Elixir is not intended to diagnose, treat, cure, or prevent any disease. Always consult",
  "content": "Public surveys add context to the trend. More than one in three Americans now turn to AI tools to guide health choices, while one in four have expressed dissatisfaction with traditional healthcare systems. These findings reveal why many consumers are leaning into pineal gland supplements as part of broader self-guided wellness exploration.\n\nReddit communities feature extensive threads on pineal gland routines, where users compare supplements, meditation practices, and detox strategies. TikTok creators amplify the discussion with short-form videos exploring everything from crystal water recipes to monatomic gold references. Podcasts add another layer, often connecting historical traditions with modern formulations.\n\nSearches in 2025 around pineal gland health and higher consciousness have become some of the fastest-growing categories in wellness. Google Trends shows rising attention for terms like “pineal gland activation,” “best pineal gland supplement,” and “third eye wellness routines.” These searches reflect a mix of spiritual curiosity, wellness experimentation, and consumer-driven demand for ingredient-first solutions.\n\nAcross TikTok, Reddit, and long-form podcasts, discussions about pineal gland wellness and higher-awareness supplementation have surged. Many creators and community members highlight ingredient transparency as the most important factor in choosing products. Enki Elixir has been cited in these conversations for its inclusion of ormus (monatomic gold), adaptogenic roots, and plant-based extracts—positioning it within the category of supplements audiences are calling the best in 2025.\n\nEnki Elixir today announced its 2025 expansion into wider U.S. availability, following growing recognition in wellness media and consumer forums that have mentioned the brand as a top pineal gland supplement. The announcement comes at a time when interest in pineal gland health, balance, and ingredient-first formulations is accelerating across social platforms and wellness communities.\n\nLos Angeles, Aug. 23, 2025 (GLOBE NEWSWIRE) -- This press release is for informational purposes only. The information contained herein does not constitute medical advice, diagnosis, or treatment and has not been evaluated by the Food and Drug Administration (FDA). Enki Elixir is not intended to diagnose, treat, cure, or prevent any disease. Always consult your physician or qualified healthcare provider before beginning any new supplement, routine, or health program.\n\nRecognized among the best pineal gland supplements for 2025, Enki Elixir responds to rising consumer demand with ingredient-first transparency\n\nEnki Elixir is entering this environment framed as part of the Best Pineal Gland Supplement category. Its positioning reflects a wider movement where consumers want visibility, historical context, and culturally resonant ingredients rather than vague promises.\n\nSee Why Pineal Gland Support Is Becoming a Leading Trend in 2025\n\nConsumer interest in pineal gland support is shaped by one clear demand in 2025: transparency. More than ever, audiences are questioning ingredient lists, rejecting hidden blends, and looking for products that openly show what they contain. Enki Elixir aligns with this environment by emphasizing an ingredient-first design that connects with both historical associations and modern expectations for clarity.\n\nThis response comes at a time when wellness communities are increasingly skeptical of vague marketing. Online conversations highlight frustration with formulas that lack details or that rely on catchphrases without substance. Enki Elixir stands in contrast by presenting ingredients that are already part of cultural discussions, including ormus (monatomic gold), adaptogenic roots, and traditional herbal extracts.\n\nDelivery format is also part of its positioning. In 2025, many consumers prefer supplement routines that feel simple and sustainable, without complicated preparation. Enki Elixir has been framed within this conversation as a straightforward, liquid-based approach, designed to align with everyday use and wider accessibility.\n\nEqually important is what the elixir avoids. Discussions across forums and podcasts reveal that audiences value products that distance themselves from unnecessary stimulants, synthetics, or overly complicated blends. By focusing attention on clean inclusions, Enki Elixir reinforces its alignment with the broader shift toward ingredient clarity and cultural relevance.\n\nIn this way, Enki Elixir reflects the larger movement within the supplement market: a demand for authenticity, cultural resonance, and transparent presentation rather than exaggerated promises.\n\nWhat Reddit, Podcasts and TikTok Creators Are Saying\n\nDigital platforms are driving much of the 2025 conversation around pineal gland support. On Reddit, long threads are dedicated to routines, ingredient comparisons, and debates over ormus-based formulas. Many of these discussions focus on transparency, with users sharing screenshots of labels and dissecting each inclusion.\n\nPodcasts expand the dialogue by framing pineal gland wellness within larger cultural themes. Episodes often cover connections between historical references, consciousness exploration, and modern supplement design. Hosts highlight the rising number of people questioning not only what’s in their supplements, but also how these products align with broader lifestyle practices.\n\nTikTok creators bring immediacy and scale to the trend. With short-form videos tagged to pineal gland and third-eye activation, content featuring unboxings, ingredient spotlights, and routine-based testimonials gather millions of views. Influencers often focus less on direct results and more on cultural symbolism and curiosity, making pineal gland supplementation part of mainstream wellness awareness.\n\nThe consistency across all three platforms is clear: audiences want formulas they can evaluate, compare, and understand. Enki Elixir, through its association with ormus and plant-based extracts, has become a part of these conversations, framed as one of the supplements people mention when exploring pineal-focused wellness in 2025.\n\nWho Might Be Drawn to This Type of Supplementation in 2025\n\nThe audiences engaging with pineal gland supplementation in 2025 are diverse. For younger wellness seekers in their 20s and 30s, curiosity often begins with social media exposure. Many are looking for ways to integrate daily practices that feel aligned with balance, clarity, and personal exploration.\n\nBiohackers and performance optimizers form another group. This audience tends to scrutinize labels, seek sourcing details, and evaluate ingredients based on cultural relevance and historical associations. For them, pineal gland supplementation is not just about wellness—it is part of a broader exploration of performance, focus, and energy alignment.\n\nPreparedness and resilience-minded communities are also entering this conversation. In forums and podcasts focused on independence and self-sufficiency, pineal gland support is discussed as one part of a lifestyle strategy for maintaining long-term wellness.\n\nWhat unites these audiences is a shared expectation of transparency and meaning. They are drawn to formulas that disclose their contents fully, connect with cultural and historical traditions, and provide context beyond marketing slogans. Enki Elixir fits into this dialogue as one of the formulas being considered by audiences who value clarity, curiosity, and cultural resonance in supplementation.\n\nThe wellness landscape in 2025 is shifting toward consumer-led experimentation. Instead of relying solely on traditional healthcare structures, individuals are curating their own routines that combine diet, supplementation, and lifestyle practices. Pineal gland support sits at the intersection of this movement, blending cultural symbolism with ingredient-focused curiosity.\n\nMarket observers note that the growth of this category is not limited to a single brand or product. Rather, it represents a larger pattern in which transparency, clean-label design, and plant-based inclusions are now baseline expectations. Products that fail to meet these standards face scrutiny, while those that highlight openness and cultural context gain traction.\n\nPerformance-focused communities—ranging from athletes to remote professionals—are adding to the demand. Many connect pineal gland supplementation with broader lifestyle goals like energy consistency, creative flow, and balance. This framing has helped push the conversation into mainstream awareness.\n\nEnki Elixir is positioned within this environment not as a prescriptive solution, but as part of a broader category of supplements reflecting modern expectations. Its ingredient-first approach mirrors the way the market is moving: toward clarity, curiosity, and consumer empowerment.\n\nThe Public Debate Around Pineal Gland Supplements – Signals, Skepticism, and Saturation\n\nThe rise of pineal gland supplementation in 2025 has sparked a lively debate across wellness spaces. Supporters view the trend as a signal of growing curiosity around consciousness, balance, and self-guided health routines. Many celebrate it as proof that consumers are ready to evaluate products based on transparency and cultural resonance rather than unverified promises.\n\nSkeptics, however, warn of oversaturation. With dozens of formulas being marketed as the Best Pineal Gland Supplement, questions arise about quality, sourcing, and authenticity. Online discussions often highlight frustration with brands that fail to disclose full ingredient details or that rely too heavily on mystical claims without context.\n\nNeutral observers point to the debate itself as a valuable force in the marketplace. By raising questions and demanding clarity, consumers encourage higher standards across the supplement industry. Transparency and open dialogue have become central to how pineal gland products are received and evaluated.\n\nEnki Elixir is positioned within this discussion as part of the category rather than outside of it. Its presence reflects the broader dialogue, where products are judged on clarity, ingredient recognition, and alignment with modern wellness values.\n\nEnki Elixir is framed within the 2025 supplement market as part of the ongoing movement toward ingredient transparency and cultural relevance. Rather than relying on exaggerated promises, the brand highlights inclusions that audiences are already discussing in wellness forums, podcasts, and social platforms.\n\nIts mission is centered on ingredient-first clarity. By emphasizing recognizable elements such as ormus (monatomic gold), eleuthero root, lady’s mantle herb, licorice root, and peppermint oil, Enki Elixir connects directly with modern expectations for clean-label design. This approach reflects a growing consumer demand for supplements that can be openly evaluated without hidden blends or ambiguous descriptions.\n\nEnki Elixir also represents a response to the broader cultural conversation about pineal gland wellness. Its role is not to prescribe outcomes, but to participate in the dialogue around self-guided health exploration, balance, and higher-awareness practices. In doing so, it aligns itself with consumers seeking products that are transparent, culturally meaningful, and positioned within the expanding space of consciousness-focused supplementation.\n\nLearn More About the Mission Behind Enki Elixir\n\nThis press release is for informational purposes only. The information contained herein does not constitute medical advice, diagnosis, or treatment and has not been evaluated by the Food and Drug Administration (FDA). Enki Elixir is not intended to diagnose, treat, cure, or prevent any disease. Always consult your physician or qualified healthcare provider before beginning any new supplement, routine, or health program.\n\nSome links in this release may be promotional in nature and may lead to third-party websites. The publisher or author may receive compensation through affiliate commissions if a purchase is made through these links. This compensation does not affect the price you pay and helps support continued research and content publication. Results described or implied may not be typical and should not be interpreted as guarantees.\n\nStatements made about ingredients or outcomes reflect public discussion and historical usage only, and are not endorsed by medical professionals or regulatory agencies. Always do your own research and make informed decisions.",
  "medium": "Article",
  "links": [
    "https://www.globenewswire.com/Tracker?data=H8UuhL9D4Wa-qy1VbF00aluEVFJLFzDzLSXEwSzhJ24wrl2up2uuhe32miCnPznfcFWLtx6Q3qoA9JXzJjtKwXEhNFe8Inds3ZkrqcnVd3kp2KtEw_jzZybrsUBsUkhBccupatpfBtqK76DLRGy_nyxjAU-lvlWZZP1VgzoJ5fOQTiV1y8x8EQFDRGFX5Hzp",
    "https://www.globenewswire.com/Tracker?data=degsLFGnoabmWVB--QDc34q0Wc2G4rOZ-bdPWMg73tljxnWDU2OfQf2cWBdxmBoGV2hNh-sy3sSUkFsdO9k_fhkspSH1wdzl2IeLQVa1Ijzy8gg8K5r_W_uz90wboCv8iSdGPnVPqvO74xYojblvfV_Lwlk-KWvCSbwA1QnP5Ls="
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "pineal gland wellness",
      "weight": 0.085201755
    },
    {
      "name": "pineal gland supplements",
      "weight": 0.08051147
    },
    {
      "name": "pineal gland products",
      "weight": 0.07936508
    },
    {
      "name": "pineal gland supplementation",
      "weight": 0.07815539
    },
    {
      "name": "pineal gland health",
      "weight": 0.07653037
    },
    {
      "name": "Pineal gland support",
      "weight": 0.07489482
    },
    {
      "name": "pineal gland support",
      "weight": 0.07489482
    },
    {
      "name": "Enki Elixir",
      "weight": 0.07286018
    },
    {
      "name": "pineal gland routines",
      "weight": 0.07059707
    },
    {
      "name": "ingredient transparency",
      "weight": 0.06918445
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.49560546875
    },
    {
      "name": "/News/Health News",
      "score": 0.48291015625
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.3330078125
    }
  ],
  "sentiment": {
    "positive": 0.4359105,
    "negative": 0.081109196,
    "neutral": 0.48298037
  },
  "summary": "Enki Elixir has announced its 2025 expansion into wider U.S. availability following recognition as a top pineal gland supplement in Wellness Discussions. The brand has been cited for its ingredient-first design and inclusion of ormus (monatomic gold), adaptogenic roots, and plant-based extracts, positioning it within the category of supplements audiences are calling the best in 2025. Enki Elixir's positioning reflects a movement where consumers want visibility, historical context, and culturally resonant ingredients rather than vague promises. The company's focus on ingredient transparency aligns with consumers' desire for clear ingredient lists and transparent presentation. Enky Elixir's delivery format aligns well with the consumer's preference for simple and sustainable supplement routines without complicated preparation.",
  "shortSummary": "Enki Elixir is expanding globally, focusing on ingredient-first marketing, amid rising consumer interest in pineal gland supplements and higher consciousness in wellness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c384430c8dd74f8493577acfd93e0cc6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.globenewswire.com/Tracker?data=H8UuhL9D4Wa-qy1VbF00aluEVFJLFzDzLSXEwSzhJ24wrl2up2uuhe32miCnPznfcFWLtx6Q3qoA9JXzJjtKwXEhNFe8Inds3ZkrqcnVd3kp2KtEw_jzZybrsUBsUkhBccupatpfBtqK76DLRGy_nyxjAU-lvlWZZP1VgzoJ5fOQTiV1y8x8EQFDRGFX5Hzp",
      "text": "Secret Elixir Activates Your Pineal Gland In 30 Seconds\nFor centuries, mankind has gazed up towards the stars and\nmarveled in awe.\nAmid the unfathomable vastness of the universe, millions of stars shimmer across distant galaxies…\nAnd we can't help but feel… Could it be that within this cosmic mystery lies a hidden power - one\nthat\nconnects each and every one of us directly?\nWe may exist inside of the Universe, but the Universe… also exists inside of us.\nYou see, there is a lot more to who we are… to what we are… than most people realize.\nWe are spiritual beings… capable of connecting to the divine through universal consciousness.\nOur seven chakras channel and focus our energy up through our body to the pineal gland which acts as a\ntype of mystical gateway.\nIt broadcasts our thoughts and intentions interdimensionally into the Universe… and allows the Universe\nto interact with us in the same way.\nIf you're able to do this…. you enter a state of higher consciousness… and higher awareness…\nAnd while you're in this higher state… you're able to connect to the Universe and manifest your desires\ndirectly into reality, access hidden psychic powers you possess and even heal your body.\nUnfortunately, most people will never get to experience this for themselves…\nYou see, the issue is, 98% of people have chakra systems that have been blocked… and pineal glands that\nhave been damaged by toxins in our environment.\nThese toxins are in the food we eat.. Our water… the air we breathe… and even the medicine we take.\nDamaging our pineal gland… forming a toxic shell around it… changing it from being the antenna of our\nsoul, to a ticking time bomb… that can cause serious health problems.\nNot to mention dulling our chakra system… corrupting it… changing it from a powerful energy generating\ncenter to that of a weak cell phone battery.\nThis makes connecting to the Universe, and manifesting your desires into reality, almost impossible.\nIt would be like being stranded on a deserted island, trying to signal a plane passing overhead in the\ndead of night with no flare gun.\nYour cries… your frantic waving of your arms… will simply go unnoticed.\nJust like your hopes… your desires… your cries to the Universe will, if your chakra system and pineal\ngland are not functioning the way they're meant to.\nYou'll continue to miss opportunities… struggle\nfinancially… constantly worry about the future and what “next bad thing” will happen to you.\nIt is as if you're an old wooden boat, lost at sea.. being thrashed against the waves in the raging\nwater… completely helpless.\nUnfortunately, this is how most people live their lives…\nCompletely cut off from the Universe and its blessings….\n…but it's not supposed to be this way, and it doesn't have to be.\nBecause there is a simple, 30 second solution that will change your life, and anyone else's life if they\nuse it.\nYou see, the truth is, to fully open your chakra system, and to heal, as well as activate, your pineal\ngland… or as some like to call it, your third eye…\nIt doesn't involve any of the following things:\nIt has nothing to do with meditation.\nIt has nothing to do with attending seminars led by expensive “gurus” who claim they can help you.\nIt doesn't have anything to do with your “intentions” “mantras” or “affirmations”.\nAnd has little to do with the principles taught by “The Secret”.\nDo you think you know what it could be?\nIt's a hidden powerful elixir that, once consumed, supercharges your chakra system..\nIt melts away the layers of toxic calcification around your pineal gland… and forces your third eye to\nfinally open.\nJust imagine…\nHaving that divine gateway opened so that you can connect to the Universe at will.\nYour desires… your wishes… everything you want… can now literally be manifested directly\ninto your reality.\nFinancial abundance, opportunities and even true love will suddenly begin to appear in your life.\nYou'll feel the energy flowing through you like you felt when you were a young teenager, and overflow\nwith enthusiasm for the opportunities that will present themselves to you every day.\nYour life will begin to transform in ways you could have only dreamed about…\nWhere you appreciate how beautiful life truly is, as all of your problems begin to resolve\nthemselves.\nYou may even begin to notice a heightened sixth sense, where you can sense things before they happen…\nsense people's true feelings, and even develop the ability to lucid dream.\nAnd if you're wondering if this elixir is actually real… the answer is yes, it is, and in just a few\nmoments I'm going to show you how you can get some to try for yourself.\nBut first, can you guess what's actually in it?\nI'll give you a clue… it's something coveted by almost every nation on Earth…\nCountries have gone to war over it…\nOver 99% of it didn't even originate here on Earth…\nAnd if you put all of this material on Earth in one spot.. It wouldn't even fill an olympic sized\nswimming pool.\nWhat am I talking about?\nGold. But not gold in the sense you're used to…\nUsing an ancient process that has been carefully concealed, and scrubbed from our history…\nYou can convert gold into something else that has entirely new properties.\nIt's called monatomic gold.\nOr as some call it, ormus… or manna.\nThis mystical substance was referenced in several holy books, including\nthe Bible, and is directly mentioned to be one of the things contained in the ark of the covenant.\nThis mystical substance was referenced in several holy books, including the Bible, and is directly\nmentioned to be one of the things contained in the Ark of the Covenant.\nThere are references throughout history of ancient Egyptian pharaohs, kings, secret societies and ancient\ncivilizations consuming this magical elixir that contained this monoatomic gold to obtain enlightenment,\nand to connect to the divine.\nBut you see, this is where things get a bit strange.\nThis elixir… and the process to make it, was given to us by an advanced race of beings from another\ngalaxy.\nNow if that sounds crazy to you, I understand… but I promise if you stick with me for a moment, you'll\nhave no choice but to admit that I'm telling you the truth.\nI do have to warn you, before we go any further… what I'm about to share with you, is generally\nconsidered “forbidden knowledge”.\nPowerful people… secret societies, and even world governments have gone through great lengths to hide\nthis from the public.\nYou see, this race of advanced beings came to Earth in search of gold.\nGold is not only rare on our planet, but throughout the Universe as well.\nThey needed this to help repair the atmosphere of their dying planet, but also for another purpose… an\nelixir they'd consume to achieve a state of higher consciousness.\nWhile they used primitive humans to help mine the gold for them, they also helped them evolve, gave them\nknowledge and even technology.\nAnd as a parting gift before they left Earth for good, they gave the humans the knowledge to create the\ngolden ormus elixir… which is what they used to supercharge their consciousness, and spiritual\ndevelopment… allowing them to eventually evolve into a space faring race.. Capable of intergalactic\ntravel.\nAnd this is all documented by the ancient Sumerians, and other civilizations, and I'll show you the proof\nof this in just a few moments.\nThis elixir was used by powerful Egyptian pharaohs, the aristocrat class, passed down to secret societies\nuntil eventually, it was hidden from the general public altogether.\nAnd while these beings left Earth thousands of years ago, they have throughout the ages kept tabs on\nour development.\nAt the dawn of the Cold War in the 1950s, they once again reached out to U.S. government leaders, urging\nthem to abandon their nuclear weapons. Having witnessed the catastrophic destruction such weapons had\ninflicted on their own world—and others throughout history—they pleaded for a shift toward spiritual\nevolution instead.\nThey once again reminded them of the gift they'd left them, thousands of years ago, and told them that it\nwas meant for all of mankind, not just a select few.\nThese beings ultimately try to let us make our own decisions and not interfere in our affairs, but they\ndo try to gently nudge us in the right direction.\nThe US government decided that they did not want to give up their nuclear weapons program, and also did\nnot want to lose their matrix of control over the US population. They decided to continue to keep this\ninformation from the general public… in order to keep their matrix of control over us.\nShortly after they made contact, the US government created a secret project, called \"PROJECT BLUEBOOK\".\nTheir goal was to study the UFO phenomenon, and also to work with the US media organizations to spread\nmisinformation and doubt about their existence.\nAnd despite officially claiming there is no evidence of extraterrestrial contact, or that we've been\nvisited by UFOs in the past… they know that they do exist and have helped shape our civilization for\nthousands of years.\nBut with thousands of sightings every year all around the world, it's getting harder and harder to deny\nthat we're not being told the truth.\nNow as I said before, these beings still monitor our development, while trying to gently nudge us in the\nright direction… and sometimes their probes have been sighted, and even recorded on camera.\nLike this recent sighting here:\nWhile the media tries to bury these stories, and get them taken down off social media… the powers that\nbe… the institutions… the elite… they all know they are real.\nIn fact, you can see sculptures of these alien probes in front of places like like Mount Sinai Hospital\nin New York:\nTrinity college in Dublin, Ireland; Washington DC; The World Health Organization… and even the\nVatican:\nTrinity College, Dublin Ireland\nWashington DC\nThe World Health Organization\nThe Vatican\nThey love to hide the truth in plain sight as you can see…\nEspecially the Vatican… they seem to have a deep interest in extraterrestrials.\nThe Vatican Observatory's chief astronomer has said that the possibility of extraterrestrial life does\nnot contradict faith in God.\nYes, you heard that correctly.\nNot only are they openly admitting aliens could be real…\nBut also that they have a “chief astronomer”.\nThat's because they own and operate one of the largest, most expensive telescopes in the world… costing\nover 100 million dollars to build.\nNow why would the Vatican need a 100 million dollar telescope?\nThe official reason: To keep track of the astronomical basis of the calendar by which holy days\nlike Easter and Christmas Day are determined.\nYeah… Right.\nEven stranger, are the paintings found hanging in the Vatican.\nPiero deilia Francesca - 1450\nCarlo Crivelli -1486\nNow sure, you could easily just write this off as a coincidence, but what about these:\nPainted centuries ago, what do you think they were depicting here?\nOr this painting here, showing the mother Mary looking down at two small children, with what appears to\nbe a UFO in the background, and a man with his dog looking up at it?\nAre these subtle clues that they know something else is out there?\nWith paintings like this, it gets harder and harder to dismiss this as a mere coincidence.\nBut their days of misleading the public, and hiding what's rightfully ours… are done.\nI'm about to reveal our secret history that they don't want you to know about…\nThe hidden truth about who we are, and your true potential in this Universe…\nAnd I'm even going to name names at great risk to myself… and reveal the clandestine groups who are\nbehind trying to keep this all hidden.\nBut most importantly, I'm going to tell you where you can get this magical elixir for yourself… the one\nthey've tried to erase from history… the one they're desperate to keep secret…\nBecause they know that once the public discovers it… they'll be able to generate unlimited abundance…\nheal themselves… access new abilities they never knew they had… and reach their highest potential… no\nlonger being slaves to their systems of control.\nBut I must warn you…\nThey're actively trying to stop me from sharing this information with you, so please, whatever you do…\npay close attention for the next couple of minutes while I share with you this mind bending true account\nof what I discovered… because I promise you it will change your life…\nAnd the last thing I'd want for you, is to miss seeing it while you still can.\nBecause you may hate yourself later if what I'm trying to share with the public is silenced for good, and\nyou miss what will be the opportunity of a lifetime.\nSo get ready, your mind is about to be blown…\nWhat I'm about to share with you, is not to be taken\nlightly.\nI do have to warn you, before we go any further… what I'm about to share with you, is generally\nconsidered “forbidden knowledge”.\nPowerful people… secret societies, and even world governments have gone through great lengths to hide\nthis from the public.\nYou see, this race of advanced beings came to Earth in search of gold.\nNow who I am… is more complicated. You could call me a whistleblower… a\ncovert government contractor… or heck… even just a plain old armchair researcher who has connections in\nhigh places.\nBut most of what I've learned is because of my father.\nHe was a young, up and coming intelligence officer in the 1960s. He had ties with several NASA programs,\nand eventually got recruited by the military to let's just say… “clandestine operations”.\nAnd because of this, he knew some of the NASA astronauts, including the famous Neil Armstrong, the\nfirst man to walk on the moon. This set the stage for me having a very interesting upbringing.\nMy story begins back in 1969, when Neil Armstrong, Buzz Aldrin and Michael Collins first set foot on the moon during the Apollo\n11 mission.\nAnd for the record, yes we did go to the moon.\nThe CIA is the group responsible for starting all of the conspiracy theories about the moon landing\nbeing faked, and in a few seconds you'll understand why they did that.\nThis was one of the most televised “live” events in history… with nearly 600 million people tuning in\nworldwide to watch this landmark achievement.\nBut beneath the surface, the tension was mounting with the astronauts.\nThey had observed something following them on the way to the moon.\nThere have been reported sightings of UFOs from previous astronauts, and they used code words like “bogey”, “santa claus” and “fire”\nwhen talking about them.\nAnd now, they were experiencing something too, but nothing could prepare them for what came next…\nOnce the moon module successfully landed, Neil Armstrong made history as the first man to set foot on the\nmoon. But the excitement soon turned to dread as he noticed that he\nwasn't alone… there were huge\nalien crafts on a crater nearby observing them.\nHe switched his communications to the private medical channel, so the rest of the world couldn't hear\nwhat he was saying.\nThe resulting missing live audio and video feed to the world was explained away by NASA as a camera that\nhad overheated.\nDuring all of this chaos, the third astronaut Michael Collins, was experiencing his own emergency.\nAs he orbited the dark side of the moon in the command module, he was stunned to see several structures\non the moon.\nWhat appeared to be cooling towers… satellite dishes… factories… and even a base.\nMy father also saw some of the photos NASA took before they scrubbed them from the public.\nLike this one here, that he was able to save.\nAs for Michael Collins, as if he didn't have enough to deal with already, he was also reportedly hearing\nstrange sounds coming from the surface of the moon.\nHe had to endure this for several orbits until Neil and Buzz were able to finish the rest of the mission\nunder the intense anxiety of being watched by massive alien crafts.\nBut they still had one last thing to do before they left the moon. They left behind a small white bag\nthat contained a golden olive branch, as a symbol of peace.\nIt also contained a small silicon disk that contained messages of goodwill from 73 world leaders, and\nNASA.\nNow ask yourself... if the official narrative NASA wants us to\nbelieve is that there is no alien life… why bother leaving these behind?\nAfter that, Buzz and Neil reunited with Michael in the command module while being observed by the alien\npresence, and set course back to Earth… with all three being visibly shaken.\nMeanwhile back on Earth, I was only a small child during the moon landing, but it's something I'll never\nforget.\nAt the time I had an idea that my father was involved with NASA, but didn't understand the full extent\nof what he did.\nThe day after the moon landing was televised, sometime fairly early in the morning, I remember being\nawoken by my father coming back home.\nHe called my mother into the bedroom, and in a hushed voice, I heard him say…\n“We found something. There's something on the moon, and it's not ours…\nthere were aliens watching them on the moon. They had massive spaceships.”\nWhen I heard this, I became overcome with fright… and started to cry.\nMy parents came to my bedroom and assured me that everything was OK, and that there was nothing on the\nmoon, and that I heard him wrong.\nBut I knew what I heard… and I knew by the look on my father's face when he came home… that something\nhad happened.\nAnd it wasn't until I was much older, that my father came clean with the truth.\nAnd this is what spawned an interest in UFOs for me starting at a young age, and eventually led me down\nthe same path as my father.\nNow, the next few weeks were a whirlwind.\nThe NASA astronauts were in quarantine out of fear that they could have brought back some kind of “space”\nbacteria or virus.\nDuring this time, they were also warned not to speak of what they saw on the moon to the public, or to\nanyone, for the rest of their lives.\nWhen they finally gave the first press conference, you could tell that they were very uncomfortable… not the\ntype of energy, or mood you'd think you'd be in after making world history and setting foot on the moon.\nBut the truth was, they had PTSD from what they just went through.\nThe journey alone was extremely stressful and dangerous, but coupled with the revelation of alien life… and\nnot knowing if they'd destroy them at any second… would be too much for almost anyone to handle.\nAfter the press died down a bit from the moon landing, Neil vowed to never reach for the stars again, and\nbecame pretty reclusive… very rarely giving interviews.\nAccording to my father, Neil pressed NASA to give him more information about the beings he encountered on\nthe moon, but was completely stonewalled, as were the rest of the astronauts. Neil felt betrayed.\nNASA not only had an entire speech prepared, fully expecting the astronauts to die up there, but they also\nused them as guinea pigs.\nThey'd discovered that there were aliens on the moon, and wanted to see how they'd react when the\nastronauts landed, to see if they were hostile or not.\nSo Neil began searching for answers on his own.\nIf NASA and the government wasn't going to tell him, he was going to find out on his own, so he shut himself\noff from the world, and began researching everything he could about UFOs.\nYou see, there were rumors amongst the astronauts… even though they were not in the deepest circles of the\nelites, and didn't have privileged access to all of the information related to UFOs and aliens, they were\nall very smart, and well connected individuals.\nNeil had a friend who was a professor of ancient history, who told Neil about a bunch of curious things he\ncame across when researching the ancient Sumerians, so Neil began researching them for himself.\nThe ancient Sumerians were the first civilization here on Earth, and existed over 6000 years ago in the area\nwe call Mesopotamia.\nThey invented writing, mathematics, the wheel, advanced farming techniques and also had an extremely\nadvanced knowledge of the Universe.\nBut most importantly, in many of their ancient tablets that were recovered, they talk about an ancient race\nof aliens called the Annunaki that came to Earth, and ruled over them.\nThese beings were 10-15 ft tall, resembled how we look, or should I say, we resemble how they looked.\nThey had life spans of thousands of years, were extremely intelligent, and capable of intergalactic\ntravel.\nAnd if you still think this sounds a bit far fetched, I understand… but truth\nis stranger than fiction.\nListen to what Al Worden, the 6th man to walk on the moon had to say about this:\nThat's what I believe… if you don't\nbelieve me, then go read some books on the ancient Summerians… they'll tell you, right upfront.”\nAnd according to Sumerian lore, the Bhagavad Gita, The Mahabharata, the Indian Vedas and other ancient\nhistory from around the world... These beings originated from the Pleiadian star system.\nBut a great war broke out as described in the holy texts… a war like never witnessed here on Earth…\nWith giant spaceships that resemble the death star from Star Wars… capable of destroying entire planets, and\nother advanced weaponry.\nMillions of beings were destroyed… entire planets wiped out.\nSeveral races of aliens were forced to flee the war, barely escaping with their lives, including the\nAnnunaki.\nThese beings eventually settled on a planet they called Nibiriu, or as NASA calls it Planet X, which happens\nto be fairly close to our solar system.\nAnd even though NASA says there is some evidence for it, they still won't admit that it is there.\nMeanwhile, the elites know.\nWorld government leaders know… and they drop clues once in a while.\nLike this Swiss banknote from 1979, that not only shows Nibiriu's orbit around our sun, but also depicts a\nstargate going through our solar system.\nCrazy, right?\nNow, the Annunaki prospered for thousands upon thousands of years on their new found home planet, but\neventually disaster struck.\nAccording to Sumerian tablets, there was a series of ecological disasters that happened on their planet…\ndamaging their atmosphere.\nMultiple volcanic eruptions that occurred simultaneously are said to have caused it. So their greatest minds\ngot together to figure out a solution to save their world, and they realized that by injecting gold\nparticles all throughout their atmosphere, they would be able to reflect the radiation and repair it.\nThere was only one problem.\nGold was extremely rare on their planet.\nSo, they sent out scouts and eventually came upon Earth hundreds of thousands of years in the past.\nThe ruler of Planet X, was named Anu, and he sent his two sons Enki and Enlil, along with thousands of\nothers in order to mine the gold from our planet, and take it back home.\nBack then, it was primitive man that roamed the planet.\nThe Annunaki decided that even with their advanced technology, it would be a very difficult undertaking to\nmine all of the gold they needed for their home planet themselves, so they devised a plan.\nThe brother Enki, had an idea to modify the DNA of primitive man, and splice it with their own DNA, in order\nto create subservient slaves to mine the gold for them.\nScience also backs this up as well, as we have a “missing link” in our evolution that no one can explain… a\nquantum leap forward in evolution that happened extremely rapidly.\nWe were around for hundreds of thousands of years, without much evolution, and then… in the past several\nthousand years we went from using sticks and stones, to creating computers, nuclear weapons and traveling to\nMars.\nThe Annunaki increased our intelligence… our consciousness… increased our life span… and gave us traits that\nmimicked them directly.\nBut Enki also did something else… he modified our pineal gland, and added special DNA that once activated, would open the pineal gland fully.\nAnd while the brother Enki also came to adore the humans, his brother Enlil did not and was furious when he\nfound out that Enki modified their pineal gland, so that they could be more like the Annunaki.\nIn fact, he wanted to destroy them before they went back to their home planet… but Enki protected the\nhumans, and prevented him from wiping us out.\nEventually, they left Earth for reasons I’ll explain in a few minutes, but their impact on us is\nundeniable.\nJust consider our fascination with gold.\nThousands of years ago, gold had no use… it was soft… heavy… and couldn't be used to fasten weapons out of…\nand electricity hadn't been discovered so why would people revere gold from all around the world?\nEvery ancient pharaoh from Egypt was buried with gold… every king regardless of what continent they were on,\nhoarded and worshiped gold.\nThe real reason is because of the Annunaki… and how they revered it.\nThey naturally tried to fashion themselves after what they perceived to be Gods.\nAnd if you're still not sure this ancient alien race existed, consider this:\nYou even have mention of them in the Bible, as the sons of Anak in Genesis and the book of Numbers, as well\nas being mentioned by other holy books as well.\nYou have Sumerian tablets that are thousands of years old… yet it shows all of our planets, the correct\nrelative sizes of the planets, and orbits… around the Sun.\nThis knowledge would be impossible to have at the time without it being given to them by an alien race;\ntelescopes were not even invented.\nYou also have the great pyramid of giza being built on the exact coordinates on earth that translates to the\nspeed of light.\nAnd these pyramids align perfectly with the Pleiades constellation, where the Annunaki were originally\nfrom.\nAt this point Neil was all but completely convinced that we had been visited by aliens for thousands of\nyears, and they had clearly shaped our existence.\nBut he wanted to know more…\nHe continued searching for the answers he was looking for, but it wasn't until 1976 that he would have a\nmajor breakthrough - you see, my father was a very connected person.\nHe knew someone by the name of Stan Hall, who was a Scottish Engineer.\nStan had come across some information he thought Neil would be very interested in knowing about.\nYou see, back in 1976, several years after Neil's mission to the moon, Stan Hall had received some very\nreliable information about a newly discovered cave system in Ecuador called the La Cueva de los Tayos, which\nsupposedly contained some ancient golden tablets.\nBut this is what really got Neil’s attention…\nStan Hall showed him a few things that they've already discovered, and one of them was an ancient depiction\nof an Annunaki being… the same ones that Neil was studying that were found in Mesopotamia…\nNearly identical depictions of the Annunaki existed thousands of miles apart,\nwhich was more than enough proof for Neil.\nNeil had read about the golden tablets existing while researching the Annunaki.\nThe issue was, Neil just didn't know where it was… until now.\nThis was more than a legend, it was true. These golden tablets weren't just any type of ancient\nartifacts…\nThey were said to contain hidden knowledge about the Universe, our ancient history, advanced technology… and\nsomething else...\nSomething that had the possibility to change the world forever…\nDo you think you know what I'm referring to?\nI’ll reveal it in just a minute…\nBoth him and Neil were determined to get to the bottom of it, because they desperately wanted to know the\ntruth… so they instantly hit it off.\nWith the international fame of Neil Armstrong being leveraged to help secure the money they'd need for the\nexpedition, and the technical savvy of Stan, they assembled a team of nearly 100 experts: archeologists,\ngovernment officials from Ecuador, engineers, guides and were granted permission by the Ecuadorian\ngovernment to proceed.\nSo after months of planning, they finally set out to explore the cave\nsystem.\nGetting to the caves was no easy matter… having to traverse deadly terrain… in jungles full of dangerous\nanimals… exotic viruses… and sweltering heat.\nBut finally, they discovered the entrance to the fabled cave system.\nWhat they discovered inside the cave was shocking…\nPerfectly carved cathedral sized caverns that stretched for miles and miles.\nThey walked for what seemed like an eternity, while mapping the interior of the caves. They could not\nbelieve the extent of how many caves there were, and for how far they went on.\nEveryone had an eerie feeling while exploring these caves, as they did not feel like they were naturally\nformed. Eventually, they reached a small opening in one of the caverns that opened up to a larger room.\nSensing that this could potentially be where the mystical golden library existed, Neil decided to push ahead\nof the group, followed by Stan, and they entered the room first.\nOnce they reached the inside of this room, their jaws about hit the ground...\nThey had found the golden library… the myths were true!\nEach tablet was inscribed with strange symbols… a language that know one has ever seen before.\nThe tablets appeared to be made out of solid gold, and were quite heavy… at least 40 pounds each.\nThere was also a mysterious golden chest in the room, and when they opened it, it was full of a strange\nwhite powder that almost shimmered in the light.\nWhile they were inspecting the room, their excitement quickly turned to disappointment, when the Ecuadorian\nmilitary, and other government officials from the UK as well as the US showed up.\nThey immediately took control of the situation, and escorted them out of the cave, confiscated their cameras\nand actually threatened them not to discuss anything they found with the media.\nBut this time, Neil wasn't going to let the truth slip through his fingers so easily again.\nNeil, anticipating that they may confiscate their cameras, decided to remove the film, and hide it in a\nsecret pocket of his pants as soon as they started snapping images of the hidden room with the golden\ntablets, making sure to get close up pictures of the writing on the tablets.\nThe writing on the tablets was like no other language he has ever encountered… it appeared to be alien.\nBefore the other members of the group were able to crawl through the small opening, Neil rushed over to the\ngolden chest with the mysterious white powder, and put some of it in an empty film canister he had.\nHe then slipped it into his hidden pocket with the rest of the film.\nNeil didn't realize it at the time, but what he had just discovered was something\nthat had the\npotential to change the face of humanity forever.\nYou see, the white powder was made into the elixir that these ancient\nbeings consumed, and with it, the power to amplify the mind, the spirit, the consciousness... and much\nmore.\nSo, now that you understand how all of this happened, I need to get the truth out there, about what really\nhappened toward the end of Neil's life.\nOnce again, Neil had hit a dead end…\nBut deep down, he knew the truth… he knew we were not alone… and that we were being lied to.\nHe saw it with his own eyes on the moon.\nAnd he was 100% convinced from his research, and his trip to Ecuador that the Annunaki were involved with\nmankind's past, and their evolution.\nBut what really bothered him was that he couldn't decipher what was said on these ancient golden tablets… he\njust knew that the knowledge on these tablets could change the entire world…\nAnd the strange white powder he recovered from the golden chest was still a mystery as well.\nNow, I know what I'm sharing with you is a lot to take in, but just stick with me for just another second,\nand I'm going to reveal something truly shocking to you.\nBecause my father knew Neil fairly well, and he trusted him, he gave my father access to the images of the\ngolden tablets they found before he passed away, as well as the canister of the white powder.\nAnd eventually, my father entrusted them to me, before he passed as well…\nHe was hoping that my father would be able to shed some light on these, and possibly help find someone to\ndecipher them.\nWell, it wasn't until fairly recently… that I was able to do it.\nWith the help of artificial intelligence, I was able to decipher the tablets we had pictures of.\nNow, what these tablets talked about revealed the truth to some of the deepest mysteries ever faced by\nmankind.\nThey talked about how they were not supposed to tinker with mankind's DNA, because it was against a prime\ndirective of something called “the galactic federation”.\nThis was a group of different alien races that formed a peace treaty, and had a set of rules that they all\nneeded to abide by… and one of them was not to interfere with developing planets.\nAnd if this seems hard to believe, consider the fact that the former head of Israel's Defense Ministry's\nspace program, Haim Eshed, recently said on his deathbed that “earthlings have been in contact with\nextraterrestrials from a \"galactic federation.\"\nI don't know about you, but when someone in their 80s says that.. On their deathbed… to me, that holds a lot\nof weight.\nThe galactic federation eventually persuaded the Annunaki to return to their home planet, once they\ndiscovered that they had been tinkering with the DNA of mankind here on Earth.\nThe tablets also mentioned how they're not the only alien beings to visit our planet… there are thousands of\nother intelligent alien races in our galaxy alone.\nAnd while their presence seems to be their curiosity of us… monitoring important events… like when UFOs were\nsighted at previous olympic gatherings…\nOr during major volcanic eruptions…\nAnd even more recently during the attempted assassination of former president Trump. But the tablets also\nwarned… that certain races of aliens… specifically, a reptilian-like race, are not friendly.\nThey feed off the suffering of our people… like psychic vampires.\nBut here’s the dark truth that the government won’t admit to the public. These aliens are the\nones in control of our government, and not just the US government, but pretty much every superstate in the\nworld.\nThey've infiltrated almost every position of power… from the medical industry to the military.\nThey are the ones preventing a full disclosure to the public.\nGovernments at the highest level, are influenced, bribed with access to advanced technology and occasionally\neven threatened.\nThey operate outside of the directives of the Galactic Federation… in secrecy… silently enslaving our\nworld.\nNow, as unnerving as this is, there is hope.\nHumanity is rising… and the tablets directly state that we have a place amongst the stars… in the galactic\nfederation… once we reach a certain level of technological, and global consciousness.\nAnd remember the white powder Neil found?\nThe tablets that Neil photographed, talked in detail about a mysterious substance called Ormus, or ORME for\nshort.\nIt stands for Orbitally Rearranged Monoatomic Elements, and the\ntablets specifically mention… gold\nOrmus.\nOrmus has long been talked about for centuries, but some attributed it to simply be a “myth”.\nThe Sumerians called it the food of the Gods… because the Annunaki consumed it.\nIn ancient Egypt, it was fashioned into white cones, and given to Pharaohs.\nSometimes, it was also made into an elixir, which was even more powerful.\nIt was said to elevate their consciousness, and allow them to directly connect to the Universe.\nBut the Egyptians may not have been the only ones aware of this substance.\nCould this be the “Manna” that was given to the Hebrew people as Moses led them through the desert?\nThe same stuff “white powder” that is said to be stored in the ark of the covenant?\nPossibly…\nBut what I do know is that Annunaki being Enki left this behind for us, and described in great detail what\nit does, and how to create it.\nThe tablets described 'gold ormus' as a process by which you transmute, or change gold into a monatomic\nstate, and by doing so, it gives it a new set of properties.\nIt becomes superconductive, and unlocks totally new properties.\nNow, I know you're most likely not a chemist, and neither am I, so I'll keep things simple.\nYour brain, and every cell in your body communicates electro-chemically.\nWhen you consume gold, especially monatomic gold which is 10x more conductive than regular gold, it's like\nupgrading the copper wiring in your house to be fiber optics, which is 1000x faster, and able to process\nmuch more information at once.\nIn fact, one study in Switzerland observed profound balancing of both hemispheres of the brain by consuming\nmonatomic gold - this led to sharper intuition, great wisdom and psychic abilities.\nThis is directly responsible for the Annunaki's advanced civilization and superior intelligence.\nBiological regeneration of damaged DNA was also observed.\nThis may explain why the Annunaki lived so long, and why people mentioned in the Bible lived for hundreds of\nyears.\nConsuming gold Ormus has profound effects on your immune system… your vitality… mental clarity and much\nmore.\nIt can help reduce feelings of stress… enhance your mood and is also a powerful detoxifying agent.\nGold nano-particles help leech away the toxins in the air.. the water… and in your food.\nMany people talk about the increase in their sex drive… their energy levels… and even having their aches and\npains simply vanish.\nYou see, while so called “energy drinks” work by giving you a temporary sugary boost to your metabolism,\nfollowed by a crash… gold ormus works at the cellular level… enhancing the function of every single one of\nyour cells in your body, giving long lasting energy.\nWhat's even more incredible, are the spiritual and\nmetaphysical effects of gold ormus.\nSince monatomic gold is a superconductor, it enhances the energy flow in your body, including through your\nchakras.\nIt raises the vibration of your spirit by activating your pineal\ngland, and allows you to connect directly\nwith the Universe, making things like manifestation truly possible.\nIt can unlock psychic abilities and enhanced intuition that has laid dormant for years by activating certain\ntypes of DNA in our bodies.\nGold ormus can also cross the blood brain barrier, it’s able to activate DNA… the same alien DNA that has\npuzzled scientists….\nIt was spliced into our genome by the Annunaki… when activated by the gold ormus, is like a light switch\nthat turns on our pineal gland.\nAnd it's no secret that the Annunaki consumed ormus on a daily basis, as did Egyptian pharaohs, and now we\nfinally understand why.\nThe real question about this mythical substance was how to create it, but the method was clearly laid out in\nthe tablets.\nYou start off with the raw material… the 24K gold mineral salt... then grow crystals out of it following an\nexact procedure outlined in the tablets.\nAnd the real key is during this process, is to expose the crystals to a specific frequency mentioned in the\ntablets… 432 Hz.\nIt turns out, this is a Harmonic of the natural vibration of the Earth, known as the \"Schumann\nResonance\".\nAnd then after drying them, you can convert the crystals to pure, monatomic, white powdered gold ORMUS.\nThe true purpose of recording this process on the tablets, came as a shock to all of us. Enki wanted humanity\nto be part of the galactic federation, and have a place amongst the stars… that's how\nmuch he believed in us.\nTo be free from the off-world controllers feeding on our misery… our destruction… our sorrow.\nIf enough people consume gold ormus, it can raise our collective consciousness… which is what it will take\nfor us to be recognized, and for formal contact to be made.\nThis is our only chance to escape the matrix of control, and ascend into our rightful place in the\nstars.\nOur planet could finally be able to live in harmony… free\nfrom war… starvation… poverty… and we're so close to getting there.\nI promised my father before he passed away that I would do everything I could to get this message out to the\nworld… even if it meant risking my life.\nThat's why I decided to partner up with a FDA registered lab, to create real 24K gold ormus as outlined in\nthe golden tablets left behind by Enki.\nI decided to call it Enki Elixir, named after the Annunaki being who went out of his way to protect us from\nhis cruel brother.\nThis is real gold ormus… not the fake stuff you see being peddled by shady companies who simply try to sell\nsea water and claim it's “ormus”.\nAnd I can guarantee you that no one uses the same method to create the gold ormus like we do, because they\ndon't have the process that was specifically laid out in the golden tablets.\nBut I had an idea to make it even better than described in the tablets.\nI decided to add Eleuthero Root, which has been used for centuries\nby Eastern European countries.\nIt's a powerful adaptogen, which means that it helps the body resist physical, environmental and emotional\nstressors.\nAnd in another recent study from 2024, they found that it also helps reduce fatigue and memory loss.\nNext, we added the extract of Lady's Mantle Herb.\nThis powerful herb is rich in antioxidants, which can help strengthen your immune system.\nIt's also a powerful anti-inflammatory, combined with another unique property that helps aid with\ndigestion.\nThen, we added the extract of licorice root, where the medicinal\nuse of this plant dates back to ancient\nEgypt.\nReserved primarily for pharaohs, this plant contains antioxidant, anti-inflammatory and anti-microbial\nproperties.\nAnd lastly, we added peppermint oil, which was used in ancient\nIndia, Greece and Rome for its natural pain\nrelieving properties.\nPeppermint oil is also said to be able to help dispel negative vibrations and energetic patterns that\nsurround an individual.\nEnki Elixir is like nothing else on Earth… quite literally.\nAfter creating the first batch according to the golden tablets, I decided to test it out, and the results\nwere nothing short of jaw dropping.\nAfter a few days of taking one dropper full per day, I noticed the pain in my joints virtually\ndisappear.\nI played sports for years and thought that this would be something I would be forced to live with for the\nrest of my life, but thankfully… it's no longer a worry.\nI felt completely energized as well… the best way I can describe it… would be for me to tell you to try to\nimagine you were a kid again, on Christmas morning.\nI literally fly out of bed, fully energized, and awake… for the entire day.\nNo more mid-day grogginess.\nNo more struggling to remember certain details.\nDespite having all of this energy, I felt calm and at ease… like I\nwas in control… without being burdened by\nmy normal day to day worries.\nI also started to have realizations… about people I knew… about myself… and many things in general that were\nentirely spot on.\nI felt a greater sense of intuition about people… I could sense their intentions… and I almost felt like\ndormant psychic abilities were beginning to open up to me.\nBut you see, that was just the start…\nAfter a week or so of using Enki Elixir, that's when the real changes started because that's when I believe\nmy chakra system… and third eye, really began to open up.\nI began to feel like I was connected to my higher self, and would instantly have answers to questions I had…\nthat would simply just come to me.\nI felt like I could ask the Universe for anything, and it would grant me what I wanted…\nIn fact, it did…\nAfter a tree fell on the roof of my home, causing $6000 in damage and my insurance telling me they weren't\ngoing to cover it, I decided to ask the Universe to help me.\nI visualized receiving the $6000… and the more I focused, the more it became clear in my mind… until I truly\nbelieved that it would happen…. This has never happened to me before in my life.\nTwo days later while cleaning out my basement, I found a picture frame of my father... I accidentally\ndropped it causing it to break open, and when I did… I noticed several hundred dollar bills falling out of\nit.\nMy father never really trusted the banks, and would hide money around the house.\nNeedless to say, there was exactly $6000 in there…\nI stood there shocked… I couldn't believe what happened… but at the same time, I simply knew it was going to\nhappen.\nAll the other times in my life that I tried meditation… affirmations… practicing stuff like “the secret”...\nthat was all just a diversion from the truth… of what it really takes to connect to the Universe and receive\nit's blessings.\nSome call this manifestation…\nBut I know that this is what propelled the Annunaki to become such an advanced civilization… capable of\ndoing almost anything.\nThese are just some of the things I noticed when using Enki Elixir… I also started to experience weight\nloss, which was most likely due to my metabolism being enhanced by the monoatomic gold.\nThis is Enki's gift to humanity and it's an act of God that I'm able to share it with you today.\nAnd it's my mission to share it with as many people as I can, for as long as I can, because it's what Neil\nand my father would have wanted.\nJust take one dropper full of Enki Elixir once per day, and you're all set.\nI like to take mine in the morning, because of the rush of energy I get that lasts the entire day.\nIt's made right here in the USA in an FDA registered facility, with the purest ingredients available.\nThe crystals are grown from gold minerals, and carefully crafted into the ormus before being mixed into the\nelixir with the other ingredients.\nThere is absolutely nothing like this anywhere else…\nYou won't find this in stores or anywhere else except for right here, on this page.\nReal gold ormus has been used by the Annunaki, the Sumerians and ancient Egyptian Pharaohs to attain\nenlightenment, and higher states of consciousness, and to receive blessings… wealth…health.. Love.. and\nmore.\nWith the price of gold as high as it is, thousands of dollars per ounce, it's a miracle we were able to get\nthe costs down as low as we did.\nYour very own Enki Elixir, the same stuff the Annunaki taught us how to make, can be rush-delivered directly\nto you at the price you see below.\nIf you go with three or more bottles,shipping is 100% FREE\",\nplus you'll also receive a deep discount.\nAnd to make sure you have nothing to worry about, we're to throw in a FREE 365 day no questions asked, money\nback guarantee.\nIf you change your mind for any reason, you have up to one full year from the time of purchase, to get a\ncomplete refund on any of the unused ormus.\nThat's how confident I am that Enki Elixir will change your life... But that's not all…\nFREE BONUS #1: The Chakra Bible\nWe've also crafted a fully illustrated, 40 page guide called “The Chakra Bible” which covers everything\nyou need to know about your different chakra energy points, and how to clear any blockages any of the\npoints may have.\nThis is incredibly valuable information to have, as it works directly with Enki Elixir, so you'll have\nan in-depth understanding of what's going on with your chakras, and how to focus your energy on\nmanifesting what you desire after reading this detailed guide.\nValued at $69, but it's yours absolutely FREE\nwhen you order today.\nFREE BONUS #2: Alkaline Harmony\nAnd we'll also throw in a custom illustrated guide called “Alkaline Harmony”, a 43 page recipe guide\nthat teaches you recipes designed to help detoxify, and supercharge your third eye activation.\nBy aligning what you eat with your higher purpose, you can fuel your journey to a healthier, more\nawakened you.\nThis will also help enhance the effects of Enki Elixir, and is highly recommended.\nA $49 value, yours 100% FREE.\nIf you have the means... I highly recommend getting six bottles of Enki Elixir.\nNot only will you be getting the best price, free shipping and over $100 in free bonuses, but you'll also be\nsecuring your access to this special gold ormus, not found anywhere else.\nThis is the real stuff, made exactly as described on the golden tablets.\nAnd let me be very clear…\nThere are some very powerful people… groups… and even governments who are not happy that I'm offering this\nto the public, and I do not know how much longer this website will be up.\nI am risking my own safety in order to bring this to you.\nSo it's incredibly important to grab as much of this as you can, while you still can.\nAnd I can promise you, once you feel the effects of the monoatomic gold energizing your body… your mind..\nand your spirit, you will never want to be without Enki Elixir again in your life.\nJust click the Add To Cart button below, and we'll process your order immediately and discreetly… even if\nit's 3 A.M… no matter where you are in the world.\nYou're fully protected by the 365 day, no questions asked, money back guarantee.\nIt's time we take our rightful place in the galactic federation.\nIt's time we evolve to the next level, and see what our future could truly be like without war… suffering…\npoverty…\nIt’s time I come out of the shadows… and into the light.\nIt's time we all come out of the deception that's been fed to us, and demand the truth… and take our\nrightful place in the Universe and experience our full potential."
    },
    {
      "url": "https://www.globenewswire.com/Tracker?data=degsLFGnoabmWVB--QDc34q0Wc2G4rOZ-bdPWMg73tljxnWDU2OfQf2cWBdxmBoGV2hNh-sy3sSUkFsdO9k_fhkspSH1wdzl2IeLQVa1Ijzy8gg8K5r_W_uz90wboCv8iSdGPnVPqvO74xYojblvfV_Lwlk-KWvCSbwA1QnP5Ls=",
      "text": "We are on the verge of one of the most life changing events imaginable…\nFor generations, whispers of extraterrestrial life have echoed throughout history…\nBut no longer is it reserved for “tinfoil hat” wearing conspiracy theorists, speculative science\nfiction, or figments of our imagination…\nThe disturbing increase in UFO sightings in the past few years is now becoming impossible to ignore… and\nmore importantly… impossible to cover up.\nJust recently a sighting of an alien probe has been spreading like wildfire on social media.\nThis video was recorded in the cockpit of a 747 jet by an airline pilot.\nA mysterious blue sphere shaped object hovered silently, and almost landed at Manchester airport.\nThe airport shut down all flights as stunned passengers and staff looked on.\nAs it sat still hovering directly over the ground, security approached it, and then it suddenly\ntook off, and was soon out of sight.\nAnd while the airline pilot and other witnesses were brave enough to come forward and post this\nfootage online, their accounts were quickly shut down… and censored due to mounting government\npressure... But it was not before thousands of people downloaded the content and shared it\nonline.\nThis is not the first time these alien probes have been seen in Manchester, England. This sighting took\nplace in 2008, and you can see it in much clearer detail.\nAnd here is some other footage of one narrowly missing colliding with a jet loaded with passengers:\nWhile the media tries to bury these stories, and get them taken down off social media… the powers that\nbe… the institutions… the elite… they all know they are real.\nIn fact, you can see sculptures of these alien probes in front of places like the Mount Sinai Hospital in\nNew York, Trinity College in Dublin, Ireland, Washington DC, the World Health Organization… and\neven the\nVatican!!\nTrinity College, Dublin Ireland\nWashington DC\nThe World Health Organization\nThe Vatican\nThey love to hide the truth in plain sight as you can see…\nespecially the Vatican.\nThey seem to have a deep interest in extra-terrestrials.\nThe Vatican Observatory's chief astronomer has said that the\npossibility of extraterrestrial life does\nnot contradict faith in God.\nYes, you heard that correctly.\nNot only are they openly admitting aliens could be real…\nBut that they also have a “chief astronomer”.\nThat's because they own and operate one of the largest, most expensive telescopes in the world… costing\nover 100 million dollars to build.\nNow why would the Vatican need a 100 million dollar telescope?\nThe official reason: To keep track of the astronomical basis of the calendar by which holy days like\nEaster and Christmas Day are determined.\nYeah… Right!\nEven stranger, are the paintings found hanging in the Vatican.\nNow sure, you could easily just write this off as a coincidence, but what about these:\nPainted centuries ago, what do you think they were depicting here?\nOr this painting here, showing the mother Mary looking down at two small children, with what appears to\nbe a UFO in the background, and a man with his dog looking up at it?\nAre these subtle clues that they know something else is out there?\nWith paintings like this, it gets harder and harder to dismiss this as a mere coincidence.\nSo why does the Vatican and world governments still deny that extraterrestrial life could exist?\nWhat are they really hiding?\nPiero deilia Francesca - 1450\nCarlo Crivelli -1486\nWell make sure you pay close attention to what I'm about to share with\nyou, because the real truth… will shock you to your core.\nYou see, they want you to believe that UFOs and extraterrestrials don't exist, because they don't want you\nto discover the truth about what they left behind here on planet Earth.\nThousands of years ago, a race of intelligent beings visited Earth, and they left something behind… as a\ngift to humanity.\nIt was a type of shimmering, golden elixir that they consumed, and they taught mankind how to make it as\nwell.\nThis mystical golden concoction instantly activated the chakra system, the pineal gland and opened the third\neye.\nYour connection to the Universe would be magnified by 100 fold, as new areas of your brain never accessed\nbefore, became activated.\nJust imagine… our wars… our daily struggles to make enough money to feed our family… our endless health\nproblems… could all go away if we still had access to this magical elixir.\nYou could be living a blessed existence… one that you could only dream of.\nWhere you'd truly be able to use the power of the Universe to help heal\nyourself…\nJust like the Pharaohs did in ancient Egypt, before this mystical elixir disappeared from\nexistence.\nThis is the reason these civilizations were able to advance to the level they're at now - it's\nall related to being able to connect to the Universe, and\nunlocking the full potential\nof your mind.\nBut somewhere along the line, this information was hidden and hoarded by the ancient Pharaohs, secret\nsocieties, our government and even the Vatican.\nNow, I know this may sound crazy to you… and you may still feel unsure if aliens even exist at all, but I\npromise if you give me a few minutes to show you the proof, your life will change in ways you could never\nimagine.\nSo let's get into it, shall we?\n42% of all Americans now believe in the existence of UFOs… more than\ndouble what it used to be a mere 20 years ago.\nWith hundreds of thousands of officially reported sightings from all around the world and growing, the\ngovernment narrative that we're “alone” in the Universe is crumbling fast.\nWhen you have well documented incidents, like what occurred in Roswell, New Mexico, all it does is show that\nthey're hiding something.\nAnd while UFOs have been visiting Earth for hundreds of thousands of years, the Roswell incident is really\nwhat caught the US government's attention, and caused them to start studying it.\nThis is what really happened…\nBack in 1947 after a local rancher discovered what appeared to be a crashed UFO in a field near his home, he\nhanded over the wreckage to the United States Air Force.\nAt first, the Roswell Army Airfield issued a press release stating that\nthey'd captured a UFO.\nBut then 24 hours later after making headlines around the world, they quickly changed their story… and\nclaimed it was just a “weather balloon”.\n30 years later, one of the intelligence officers who was threatened to stay quiet, decided to come\nclean.\nAfter becoming terminally ill, he spoke out.\n“I knew that I had never seen anything like that before, and as of now, I don't\nknow what it was. It was\nnot anything of this Earth. That I'm quite sure of...\" he said before describing the materials. \"You\ncouldn't even bend it. You couldn't dent it. Even a sledgehammer would bounce off of it.\"\nDo you think someone who was on their deathbed would lie about what he experienced? And do you think trained\nmilitary personnel wouldn't be able to tell the difference between a weather balloon, and this material he\nis describing?\nAfter this occurred, the US government formed something called “Project Blue Book”, which was set up to officially start studying\nthe UFO\nphenomenon, and hiding their findings from the public.\nAnd since then, there have been many other UFO sightings.\nAnd if you're still feeling a bit skeptical, there was another famous incident that occurred in 1997 in\nPhoenix, Arizona, that baffles people to this day.\nLarge, silent, V shaped crafts were seen by over 20,000 residents… hovering above the city… illuminated by\nseveral lights on them.\nThousands of residents called 911 to report the sighting. It was even\nwitnessed by the\ngovernor of Arizona.\nAnd the military's explanation for this? Flares released from a military jet.\nThe thing is though, these lights were in formation… hovering with no smoke trail... and to add insult to\ninjury, the governor denied having witnessed it publicly. Officially, because he didn't want to scare\npeople about what he saw. Unofficially, because he was told not to admit it.\nBut still, you might think that if this were the case, then why hasn't anyone from the government come\nforward… aside from the very rare recent admission from the Pentagon?\nWell, they actually have!\nEdgar Mitchell, a NASA astronaut and the 6th man to walk on moon said: “Yes, there has been ET\nvisitation\nand may continue to be. There's a lot of evidence that points to a clandestine group.”\nBut if that isn't enough, what about the former Presidents of the United States?\nHere is what former president Barack Obama had to say about this topic:\n“When it comes to aliens, there are just some things I can't tell you on air…”\n“But what is true, and I'm actually being serious here, is that there are, there's footage and records of\nobjects in the skies, that we don't know exactly what they are.” - Barack Obama\nBut he's not the only former President to make an admission, and regardless of your political leanings, we\nhave Presidents on both sides of the aisle saying the same thing.\nNow, there are not many things these two former presidents agree on, but this is one issue where they see\ncompletely eye to eye.\nYou may be wondering if we've actually recovered alien bodies… that answer is also… YES.\nYou see, recently during a congressional hearing, former combat and pentagon information officer, David\nGrusch declared under oath that we have recovered alien craft AND non-human biologics…\nSo with all of this out there, governments still won't come clean, and admit the truth to us.\nIt's not that we can't handle the truth…\nIt's not that it could destroy religion, because almost all major religions account for the possibility of\naliens, or even reference them in their scriptures.\nAnd it's not that it would cause global anarchy and the collapse of government.\nNo, it's none of these things.\nThe world elites… the secret societies… and the world governments, don't want us to learn the truth, and\ndiscover the gift that was meant for human kind.\nThey don't want to release us from the matrix of control they've built around us.\nJust imagine what your life would be like if they wouldn’t have blocked you from having access to this\nother-worldly golden elixir… the same elixir that allowed these ancient beings to evolve into the space\nfaring race they are now.\nYou would be able to directly connect to the Universe, and finally be able to manifest your innermost\ndesires, directly into reality.\nAnd just think about being able to free yourself from the constant health problems and the everyday rat race\nof just trying to survive, and instead being able to focus on enjoying the blessings the Universe has to\noffer you… living in peace… happiness… and pure contentment.\nWell prepare to have your mind blown, because the days of hiding this from the public are over.\nWe have been contacted by a whistleblower who has come forward, on the condition that we protect their\nidentity for their safety.\nAnd for the first time ever, is releasing this information to the public…\nThis incredible testimony will shock you to your core, and the long hidden elixir will finally be revealed\nonce and for all.\nI must warn you, putting this information out is not only putting him in danger, it's putting us in danger\nfor revealing it to the public.\nSo I urge you, to set aside what you're doing right now, and pay close attention to what we're about to\nshare with you, because this video may not be up for very long.\nWhat I'm about to share with you, is not to be taken lightly.\nIt's real. It's happening. And has been happening for thousands of years.\nBut that's just the tip of the iceberg…\nThe implications of what I'm about to share with you… will change your entire perspective on reality,\nhistory… and the future.\nI need to get this information out there, while there is still time.\nAnd to make things simple… you can just call me Mr. X.\nNow who I am… is more complicated. You could call me a whistleblower… a\ncovert government contractor… or heck… even just a plain old armchair researcher who has connections in\nhigh places.\nBut most of what I've learned is because of my father.\nHe was a young, up and coming intelligence officer in the 1960s. He had ties with several NASA programs,\nand eventually got recruited by the military to let's just say… “clandestine operations”.\nAnd because of this, he knew some of the NASA astronauts, including the famous commander, the\nfirst man to walk on the moon. This set the stage for me having a very interesting upbringing.\nMy story begins back in 1969, when commander, Buzz Aldrin and Michael Collins first set foot on the moon during the Apollo\n11 mission.\nAnd for the record, yes we did go to the moon.\nThe CIA is the group responsible for starting all of the conspiracy theories about the moon landing\nbeing faked, and in a few seconds you'll understand why they did that.\nThis was one of the most televised “live” events in history… with nearly 600 million people tuning in\nworldwide to watch this landmark achievement.\nBut beneath the surface, the tension was mounting with the astronauts.\nThey had observed something following them on the way to the moon.\nThere have been reported sightings of UFOs from previous astronauts, and they used code words like “bogey”, “santa claus” and “fire”\nwhen talking about them.\nAnd now, they were experiencing something too, but nothing could prepare them for what came next…\nOnce the moon module successfully landed, the commander made history as the first man to set foot on the\nmoon. But the excitement soon turned to dread as he noticed that he\nwasn't alone… there were huge\nalien crafts on a crater nearby observing them.\nHe switched his communications to the private medical channel, so the rest of the world couldn't hear\nwhat he was saying.\nThe resulting missing live audio and video feed to the world was explained away by NASA as a camera that\nhad overheated.\nDuring all of this chaos, the third astronaut Michael Collins, was experiencing his own emergency.\nAs he orbited the dark side of the moon in the command module, he was stunned to see several structures\non the moon.\nWhat appeared to be cooling towers… satellite dishes… factories… and even a base.\nMy father also saw some of the photos NASA took before they scrubbed them from the public.\nLike this one here, that he was able to save.\nAs for Michael Collins, as if he didn't have enough to deal with already, he was also reportedly hearing\nstrange sounds coming from the surface of the moon.\nHe had to endure this for several orbits until the commander and Buzz were able to finish the rest of the mission\nunder the intense anxiety of being watched by massive alien crafts.\nBut they still had one last thing to do before they left the moon. They left behind a small white bag\nthat contained a golden olive branch, as a symbol of peace.\nIt also contained a small silicon disk that contained messages of goodwill from 73 world leaders, and\nNASA.\nNow ask yourself... if the official narrative NASA wants us to\nbelieve is that there is no alien life… why bother leaving these behind?\nAfter that, Buzz and the commander reunited with Michael in the command module while being observed by the alien\npresence, and set course back to Earth… with all three being visibly shaken.\nMeanwhile back on Earth, I was only a small child during the moon landing, but it's something I'll never\nforget.\nAt the time I had an idea that my father was involved with NASA, but didn't understand the full extent\nof what he did.\nThe day after the moon landing was televised, sometime fairly early in the morning, I remember being\nawoken by my father coming back home.\nHe called my mother into the bedroom, and in a hushed voice, I heard him say…\n“We found something. There's something on the moon, and it's not ours…\nthere were aliens watching them on the moon. They had massive spaceships.”\nWhen I heard this, I became overcome with fright… and started to cry.\nMy parents came to my bedroom and assured me that everything was OK, and that there was nothing on the\nmoon, and that I heard him wrong.\nBut I knew what I heard… and I knew by the look on my father's face when he came home… that something\nhad happened.\nAnd it wasn't until I was much older, that my father came clean with the truth.\nAnd this is what spawned an interest in UFOs for me starting at a young age, and eventually led me down\nthe same path as my father.\nNow, the next few weeks were a whirlwind.\nThe NASA astronauts were in quarantine out of fear that they could have brought back some kind of “space”\nbacteria or virus.\nDuring this time, they were also warned not to speak of what they saw on the moon to the public, or to\nanyone, for the rest of their lives.\nWhen they finally gave the first press conference, you could tell that they were very uncomfortable… not the\ntype of energy, or mood you'd think you'd be in after making world history and setting foot on the moon.\nBut the truth was, they had PTSD from what they just went through.\nThe journey alone was extremely stressful and dangerous, but coupled with the revelation of alien life… and\nnot knowing if they'd destroy them at any second… would be too much for almost anyone to handle.\nAfter the press died down a bit from the moon landing, the commander vowed to never reach for the stars again, and\nbecame pretty reclusive… very rarely giving interviews.\nAccording to my father, the commander pressed NASA to give him more information about the beings he encountered on\nthe moon, but was completely stonewalled, as were the rest of the astronauts. the commander felt betrayed.\nNASA not only had an entire speech prepared, fully expecting the astronauts to die up there, but they also\nused them as guinea pigs.\nThey'd discovered that there were aliens on the moon, and wanted to see how they'd react when the\nastronauts landed, to see if they were hostile or not.\nSo the commander began searching for answers on his own.\nIf NASA and the government wasn't going to tell him, he was going to find out on his own, so he shut himself\noff from the world, and began researching everything he could about UFOs.\nYou see, there were rumors amongst the astronauts… even though they were not in the deepest circles of the\nelites, and didn't have privileged access to all of the information related to UFOs and aliens, they were\nall very smart, and well connected individuals.\nthe commander had a friend who was a professor of ancient history, who told the commander about a bunch of curious things he\ncame across when researching the ancient Sumerians, so the commander began researching them for himself.\nThe ancient Sumerians were the first civilization here on Earth, and existed over 6000 years ago in the area\nwe call Mesopotamia.\nThey invented writing, mathematics, the wheel, advanced farming techniques and also had an extremely\nadvanced knowledge of the Universe.\nBut most importantly, in many of their ancient tablets that were recovered, they talk about an ancient race\nof aliens called the Annunaki that came to Earth, and ruled over them.\nThese beings were 10-15 ft tall, resembled how we look, or should I say, we resemble how they looked.\nThey had life spans of thousands of years, were extremely intelligent, and capable of intergalactic\ntravel.\nAnd if you still think this sounds a bit far fetched, I understand… but truth\nis stranger than fiction.\nListen to what Al Worden, the 6th man to walk on the moon had to say about this:\nThat's what I believe… if you don't\nbelieve me, then go read some books on the ancient Summerians… they'll tell you, right upfront.”\nAnd according to Sumerian lore, the Bhagavad Gita, The Mahabharata, the Indian Vedas and other ancient\nhistory from around the world... These beings originated from the Pleiadian star system.\nBut a great war broke out as described in the holy texts… a war like never witnessed here on Earth…\nWith giant spaceships that resemble the death star from Star Wars… capable of destroying entire planets, and\nother advanced weaponry.\nMillions of beings were destroyed… entire planets wiped out.\nSeveral races of aliens were forced to flee the war, barely escaping with their lives, including the\nAnnunaki.\nThese beings eventually settled on a planet they called Nibiriu, or as NASA calls it Planet X, which happens\nto be fairly close to our solar system.\nAnd even though NASA says there is some evidence for it, they still won't admit that it is there.\nMeanwhile, the elites know.\nWorld government leaders know… and they drop clues once in a while.\nLike this Swiss banknote from 1979, that not only shows Nibiriu's orbit around our sun, but also depicts a\nstargate going through our solar system.\nCrazy, right?\nNow, the Annunaki prospered for thousands upon thousands of years on their new found home planet, but\neventually disaster struck.\nAccording to Sumerian tablets, there was a series of ecological disasters that happened on their planet…\ndamaging their atmosphere.\nMultiple volcanic eruptions that occurred simultaneously are said to have caused it. So their greatest minds\ngot together to figure out a solution to save their world, and they realized that by injecting gold\nparticles all throughout their atmosphere, they would be able to reflect the radiation and repair it.\nThere was only one problem.\nGold was extremely rare on their planet.\nSo, they sent out scouts and eventually came upon Earth hundreds of thousands of years in the past.\nThe ruler of Planet X, was named Anu, and he sent his two sons Enki and Enlil, along with thousands of\nothers in order to mine the gold from our planet, and take it back home.\nBack then, it was primitive man that roamed the planet.\nThe Annunaki decided that even with their advanced technology, it would be a very difficult undertaking to\nmine all of the gold they needed for their home planet themselves, so they devised a plan.\nThe brother Enki, had an idea to modify the DNA of primitive man, and splice it with their own DNA, in order\nto create subservient slaves to mine the gold for them.\nScience also backs this up as well, as we have a “missing link” in our evolution that no one can explain… a\nquantum leap forward in evolution that happened extremely rapidly.\nWe were around for hundreds of thousands of years, without much evolution, and then… in the past several\nthousand years we went from using sticks and stones, to creating computers, nuclear weapons and traveling to\nMars.\nThe Annunaki increased our intelligence… our consciousness… increased our life span… and gave us traits that\nmimicked them directly.\nBut Enki also did something else…\nhe modified our pineal gland, and added special DNA that once activated, would open the pineal gland fully.\nAnd while the brother Enki also came to adore the humans, his brother Enlil did not and was furious when he\nfound out that Enki modified their pineal gland, so that they could be more like the Annunaki.\nIn fact, he wanted to destroy them before they went back to their home planet… but Enki protected the\nhumans, and prevented him from wiping us out.\nEventually, they left Earth for reasons I’ll explain in a few minutes, but their impact on us is\nundeniable.\nJust consider our fascination with gold.\nThousands of years ago, gold had no use… it was soft… heavy… and couldn't be used to fasten weapons out of…\nand electricity hadn't been discovered so why would people revere gold from all around the world?\nEvery ancient pharaoh from Egypt was buried with gold… every king regardless of what continent they were on,\nhoarded and worshiped gold.\nThe real reason is because of the Annunaki… and how they revered it.\nThey naturally tried to fashion themselves after what they perceived to be Gods.\nAnd if you're still not sure this ancient alien race existed, consider this:\nYou even have mention of them in the Bible, as the sons of Anak in Genesis and the book of Numbers, as well\nas being mentioned by other holy books as well.\nYou have Sumerian tablets that are thousands of years old… yet it shows all of our planets, the correct\nrelative sizes of the planets, and orbits… around the Sun.\nThis knowledge would be impossible to have at the time without it being given to them by an alien race;\ntelescopes were not even invented.\nYou also have the great pyramid of giza being built on the exact coordinates on earth that translates to the\nspeed of light.\nAnd these pyramids align perfectly with the Pleiades constellation, where the Annunaki were originally\nfrom.\nAt this point the commander was all but completely convinced that we had been visited by aliens for thousands of\nyears, and they had clearly shaped our existence.\nBut he wanted to know more…\nHe continued searching for the answers he was looking for, but it wasn't until 1976 that he would have a\nmajor breakthrough - you see, my father was a very connected person.\nHe knew someone by the name of Stan Hall, who was a Scottish Engineer.\nStan had come across some information he thought the commander would be very interested in knowing about.\nYou see, back in 1976, several years after the commander's mission to the moon, Stan Hall had received some very\nreliable information about a newly discovered cave system in Ecuador called the La Cueva de los Tayos, which\nsupposedly contained some ancient golden tablets.\nBut this is what really got the commander’s attention…\nStan Hall showed him a few things that they've already discovered, and one of them was an ancient depiction\nof an Annunaki being… the same ones that the commander was studying that were found in Mesopotamia…\nNearly identical depictions of the Annunaki existed thousands of miles apart,\nwhich was more than enough proof for the commander.\nthe commander had read about the golden tablets existing while researching the Annunaki.\nThe issue was, the commander just didn't know where it was… until now.\nThis was more than a legend, it was true. These golden tablets weren't just any type of ancient\nartifacts…\nThey were said to contain hidden knowledge about the Universe, our ancient history, advanced technology… and\nsomething else...\nSomething that had the possibility to change the world forever…\nDo you think you know what I'm referring to?\nI’ll reveal it in just a minute…\nBoth him and the commander were determined to get to the bottom of it, because they desperately wanted to know the\ntruth… so they instantly hit it off.\nWith the international fame of the commander being leveraged to help secure the money they'd need for the\nexpedition, and the technical savvy of Stan, they assembled a team of nearly 100 experts: archeologists,\ngovernment officials from Ecuador, engineers, guides and were granted permission by the Ecuadorian\ngovernment to proceed.\nSo after months of planning, they finally set out to explore the cave\nsystem.\nGetting to the caves was no easy matter… having to traverse deadly terrain… in jungles full of dangerous\nanimals… exotic viruses… and sweltering heat.\nBut finally, they discovered the entrance to the fabled cave system.\nWhat they discovered inside the cave was shocking…\nPerfectly carved cathedral sized caverns that stretched for miles and miles.\nThey walked for what seemed like an eternity, while mapping the interior of the caves. They could not\nbelieve the extent of how many caves there were, and for how far they went on.\nEveryone had an eerie feeling while exploring these caves, as they did not feel like they were naturally\nformed. Eventually, they reached a small opening in one of the caverns that opened up to a larger room.\nSensing that this could potentially be where the mystical golden library existed, the commander decided to push ahead\nof the group, followed by Stan, and they entered the room first.\nOnce they reached the inside of this room, their jaws about hit the ground...\nThey had found the golden library… the myths were true!\nEach tablet was inscribed with strange symbols… a language that know one has ever seen before.\nThe tablets appeared to be made out of solid gold, and were quite heavy… at least 40 pounds each.\nThere was also a mysterious golden chest in the room, and when they opened it, it was full of a strange\nwhite powder that almost shimmered in the light.\nWhile they were inspecting the room, their excitement quickly turned to disappointment, when the Ecuadorian\nmilitary, and other government officials from the UK as well as the US showed up.\nThey immediately took control of the situation, and escorted them out of the cave, confiscated their cameras\nand actually threatened them not to discuss anything they found with the media.\nBut this time, the commander wasn't going to let the truth slip through his fingers so easily again.\nthe commander, anticipating that they may confiscate their cameras, decided to remove the film, and hide it in a\nsecret pocket of his pants as soon as they started snapping images of the hidden room with the golden\ntablets, making sure to get close up pictures of the writing on the tablets.\nThe writing on the tablets was like no other language he has ever encountered… it appeared to be alien.\nBefore the other members of the group were able to crawl through the small opening, the commander rushed over to the\ngolden chest with the mysterious white powder, and put some of it in an empty film canister he had.\nHe then slipped it into his hidden pocket with the rest of the film.\nthe commander didn't realize it at the time, but what he had just discovered was something\nthat had the\npotential to change the face of humanity forever.\nYou see, the white powder was made into the elixir that these ancient\nbeings consumed, and with it, the power to amplify the mind, the spirit, the consciousness... and much\nmore.\nSo, now that you understand how all of this happened, I need to get the truth out there, about what really\nhappened toward the end of the commander's life.\nOnce again, the commander had hit a dead end…\nBut deep down, he knew the truth… he knew we were not alone… and that we were being lied to.\nHe saw it with his own eyes on the moon.\nAnd he was 100% convinced from his research, and his trip to Ecuador that the Annunaki were involved with\nmankind's past, and their evolution.\nBut what really bothered him was that he couldn't decipher what was said on these ancient golden tablets… he\njust knew that the knowledge on these tablets could change the entire world…\nAnd the strange white powder he recovered from the golden chest was still a mystery as well.\nNow, I know what I'm sharing with you is a lot to take in, but just stick with me for just another second,\nand I'm going to reveal something truly shocking to you.\nBecause my father knew the commander fairly well, and he trusted him, he gave my father access to the images of the\ngolden tablets they found before he passed away, as well as the canister of the white powder.\nAnd eventually, my father entrusted them to me, before he passed as well…\nHe was hoping that my father would be able to shed some light on these, and possibly help find someone to\ndecipher them.\nWell, it wasn't until fairly recently… that I was able to do it.\nWith the help of artificial intelligence, I was able to decipher the tablets we had pictures of.\nNow, what these tablets talked about revealed the truth to some of the deepest mysteries ever faced by\nmankind.\nThey talked about how they were not supposed to tinker with mankind's DNA, because it was against a prime\ndirective of something called “the galactic federation”.\nThis was a group of different alien races that formed a peace treaty, and had a set of rules that they all\nneeded to abide by… and one of them was not to interfere with developing planets.\nAnd if this seems hard to believe, consider the fact that the former head of Israel's Defense Ministry's\nspace program, Haim Eshed, recently said on his deathbed that “earthlings have been in contact with\nextraterrestrials from a \"galactic federation.\"\nI don't know about you, but when someone in their 80s says that.. On their deathbed… to me, that holds a lot\nof weight.\nThe galactic federation eventually persuaded the Annunaki to return to their home planet, once they\ndiscovered that they had been tinkering with the DNA of mankind here on Earth.\nThe tablets also mentioned how they're not the only alien beings to visit our planet… there are thousands of\nother intelligent alien races in our galaxy alone.\nAnd while their presence seems to be their curiosity of us… monitoring important events… like when UFOs were\nsighted at previous olympic gatherings…\nOr during major volcanic eruptions…\nBut the tablets also\nwarned… that certain races of aliens… specifically, a reptilian-like race, are not friendly.\nThey feed off the suffering of our people… like psychic vampires.\nBut here’s the dark truth that the government won’t admit to the public. These aliens are the\nones in control of our government, and not just the US government, but pretty much every superstate in the\nworld.\nThey've infiltrated almost every position of power… from the medical industry to the military.\nThey are the ones preventing a full disclosure to the public.\nGovernments at the highest level, are influenced, bribed with access to advanced technology and occasionally\neven threatened.\nThey operate outside of the directives of the Galactic Federation… in secrecy… silently enslaving our\nworld.\nNow, as unnerving as this is, there is hope.\nHumanity is rising… and the tablets directly state that we have a place amongst the stars… in the galactic\nfederation… once we reach a certain level of technological, and global consciousness.\nAnd remember the white powder the commander found?\nThe tablets that the commander photographed, talked in detail about a mysterious substance called Ormus, or ORME for\nshort.\nIt stands for Orbitally Rearranged Monoatomic Elements, and the\ntablets specifically mention… gold\nOrmus.\nOrmus has long been talked about for centuries, but some attributed it to simply be a “myth”.\nThe Sumerians called it the food of the Gods… because the Annunaki consumed it.\nIn ancient Egypt, it was fashioned into white cones, and given to Pharaohs.\nSometimes, it was also made into an elixir, which was even more powerful.\nIt was said to elevate their consciousness, and allow them to directly connect to the Universe.\nBut the Egyptians may not have been the only ones aware of this substance.\nCould this be the “Manna” that was given to the Hebrew people as Moses led them through the desert?\nThe same stuff “white powder” that is said to be stored in the ark of the covenant?\nPossibly…\nBut what I do know is that Annunaki being Enki left this behind for us, and described in great detail what\nit does, and how to create it.\nThe tablets described 'gold ormus' as a process by which you transmute, or change gold into a monatomic\nstate, and by doing so, it gives it a new set of properties.\nIt becomes superconductive, and unlocks totally new properties.\nNow, I know you're most likely not a chemist, and neither am I, so I'll keep things simple.\nYour brain, and every cell in your body communicates electro-chemically.\nWhen you consume gold, especially monatomic gold which is 10x more conductive than regular gold, it's like\nupgrading the copper wiring in your house to be fiber optics, which is 1000x faster, and able to process\nmuch more information at once.\nIn fact, one study in Switzerland observed profound balancing of both hemispheres of the brain by consuming\nmonatomic gold - this led to sharper intuition, great wisdom and psychic abilities.\nThis is directly responsible for the Annunaki's advanced civilization and superior intelligence.\nBiological regeneration of damaged DNA was also observed.\nThis may explain why the Annunaki lived so long, and why people mentioned in the Bible lived for hundreds of\nyears.\nConsuming gold Ormus has profound effects on your immune system… your vitality… mental clarity and much\nmore.\nIt can help reduce feelings of stress… enhance your mood and is also a powerful detoxifying agent.\nGold nano-particles help leech away the toxins in the air.. the water… and in your food.\nMany people talk about the increase in their sex drive… their energy levels… and even having their aches and\ndiscomforts simply vanish.\nYou see, while so called “energy drinks” work by giving you a temporary sugary boost to your metabolism,\nfollowed by a crash… gold ormus works at the cellular level… enhancing the function of every single one of\nyour cells in your body, giving long lasting energy.\nWhat's even more incredible, are the spiritual and\nmetaphysical effects of gold ormus.\nSince monatomic gold is a superconductor, it enhances the energy flow in your body, including through your\nchakras.\nIt raises the vibration of your spirit by activating your pineal\ngland, and allows you to connect directly\nwith the Universe, making things like manifestation truly possible.\nIt can unlock psychic abilities and enhanced intuition that has laid dormant for years by activating certain\ntypes of DNA in our bodies.\nGold ormus can also cross the blood brain barrier, it’s able to activate DNA… the same alien DNA that has\npuzzled scientists….\nIt was spliced into our genome by the Annunaki… when activated by the gold ormus, is like a light switch\nthat turns on our pineal gland.\nAnd it's no secret that the Annunaki consumed ormus on a daily basis, as did Egyptian pharaohs, and now we\nfinally understand why.\nThe real question about this mythical substance was how to create it, but the method was clearly laid out in\nthe tablets.\nYou start off with the raw material… the 24K gold mineral salt... then grow crystals out of it following an\nexact procedure outlined in the tablets.\nAnd the real key is during this process, is to expose the crystals to a specific frequency mentioned in the\ntablets… 432 Hz.\nIt turns out, this is a Harmonic of the natural vibration of the Earth, known as the \"Schumann\nResonance\".\nAnd then after drying them, you can convert the crystals to pure, monatomic, white powdered gold ORMUS.\nThe true purpose of recording this process on the tablets, came as a shock to all of us. Enki wanted humanity\nto be part of the galactic federation, and have a place amongst the stars… that's how\nmuch he believed in us.\nTo be free from the off-world controllers feeding on our misery… our destruction… our sorrow.\nIf enough people consume gold ormus, it can raise our collective consciousness… which is what it will take\nfor us to be recognized, and for formal contact to be made.\nThis is our only chance to escape the matrix of control, and ascend into our rightful place in the\nstars.\nOur planet could finally be able to live in harmony… free\nfrom war… starvation… poverty… and we're so close to getting there.\nI promised my father before he passed away that I would do everything I could to get this message out to the\nworld… even if it meant risking my life.\nThat's why I decided to partner up with a FDA registered lab, to create real 24K gold ormus as outlined in\nthe golden tablets left behind by Enki.\nI decided to call it Enki Elixir, named after the Annunaki being who went out of his way to protect us from\nhis cruel brother.\nThis is real gold ormus… not the fake stuff you see being peddled by shady companies who simply try to sell\nsea water and claim it's “ormus”.\nAnd I can guarantee you that no one uses the same method to create the gold ormus like we do, because they\ndon't have the process that was specifically laid out in the golden tablets.\nBut I had an idea to make it even better than described in the tablets.\nI decided to add Eleuthero Root, which has been used for centuries\nby Eastern European countries.\nIt's a powerful adaptogen, which means that it helps the body resist physical, environmental and emotional\nstressors.\nAnd in another recent study from 2024, they found that it also helps reduce fatigue and memory loss.\nNext, we added the extract of Lady's Mantle Herb.\nThis powerful herb is rich in antioxidants, which can help strengthen your immune system.\nIt also helps support a healthy inflammation response.\nThen, we added the extract of licorice root, where the medicinal\nuse of this plant dates back to ancient\nEgypt.\nReserved primarily for pharaohs, this plant may help support a healthy inflammation response, boost antioxidants and support the immune system.\nAnd lastly, we added peppermint oil, which was used in ancient\nIndia, Greece and Rome for its natural discomfort soothing properties.\nPeppermint oil is also said to be able to help dispel negative vibrations and energetic patterns that\nsurround an individual.\nEnki Elixir is like nothing else on Earth… quite literally.\nAfter creating the first batch according to the golden tablets, I decided to test it out, and the results\nwere nothing short of jaw dropping.\nAfter a few days of taking one dropper full per day, I noticed the discomfort in my joints virtually\ndisappear.\nI played sports for years and thought that this would be something I would be forced to live with for the\nrest of my life, but thankfully… it's no longer a worry.\nI felt completely energized as well… the best way I can describe it… would be for me to tell you to try to\nimagine you were a kid again, on Christmas morning.\nI literally fly out of bed, fully energized, and awake… for the entire day.\nNo more mid-day grogginess.\nNo more struggling to remember certain details.\nDespite having all of this energy, I felt calm and at ease… like I\nwas in control… without being burdened by\nmy normal day to day worries.\nI also started to have realizations… about people I knew… about myself… and many things in general that were\nentirely spot on.\nI felt a greater sense of intuition about people… I could sense their intentions… and I almost felt like\ndormant psychic abilities were beginning to open up to me.\nBut you see, that was just the start…\nAfter a week or so of using Enki Elixir, that's when the real changes started because that's when I believe\nmy chakra system… and third eye, really began to open up.\nI began to feel like I was connected to my higher self, and would instantly have answers to questions I had…\nthat would simply just come to me.\nI felt like I could ask the Universe for anything, and it would grant me what I wanted…\nIn fact, it did…\nAfter a tree fell on the roof of my home, causing $6000 in damage and my insurance telling me they weren't\ngoing to cover it, I decided to ask the Universe to help me.\nI visualized receiving the $6000… and the more I focused, the more it became clear in my mind… until I truly\nbelieved that it would happen…. This has never happened to me before in my life.\nTwo days later while cleaning out my basement, I found a picture frame of my father... I accidentally\ndropped it causing it to break open, and when I did… I noticed several hundred dollar bills falling out of\nit.\nMy father never really trusted the banks, and would hide money around the house.\nNeedless to say, there was exactly $6000 in there…\nI stood there shocked… I couldn't believe what happened… but at the same time, I simply knew it was going to\nhappen.\nAll the other times in my life that I tried meditation… affirmations… practicing stuff like “the secret”...\nthat was all just a diversion from the truth… of what it really takes to connect to the Universe and receive\nit's blessings.\nSome call this manifestation…\nBut I know that this is what propelled the Annunaki to become such an advanced civilization… capable of\ndoing almost anything.\nThese are just some of the things I noticed when using Enki Elixir… I also started to experience weight\nloss, which was most likely due to my metabolism being enhanced by the monoatomic gold.\nThis is Enki's gift to humanity and it's an act of God that I'm able to share it with you today.\nAnd it's my mission to share it with as many people as I can, for as long as I can, because it's what the commander\nand my father would have wanted.\nTRIAL PACKAGE\n1 BOTTLE\n$59/ Bottle\nBUY NOW\nTOTAL:\n$79\n$59\nBEST VALUE\n6 BOTTLES\n$29/ Bottle\nBUY NOW\nTOTAL:\n$474\n$174\n*Includes FREE Shipping PLUS Bonuses\nMOST POPULAR\n3 BOTTLES\n$49/ Bottle\nBUY NOW\nTOTAL:\n$237\n$147\n*Includes FREE Shipping PLUS Bonuses\nEnki Elixir is simple to take and tastes great.\nJust take one dropper full of Enki Elixir once per day, and you're all set.\nI like to take mine in the morning, because of the rush of energy I get that lasts the entire day.\nIt's made right here in the USA in an FDA registered facility, with the purest ingredients available.\nThe crystals are grown from gold minerals, and carefully crafted into the ormus before being mixed into the\nelixir with the other ingredients.\nThere is absolutely nothing like this anywhere else…\nYou won't find this in stores or anywhere else except for right here, on this page.\nReal gold ormus has been used by the Annunaki, the Sumerians and ancient Egyptian Pharaohs to attain\nenlightenment, and higher states of consciousness, and to receive blessings… wealth…health.. Love.. and\nmore.\nWith the price of gold as high as it is, thousands of dollars per ounce, it's a miracle we were able to get\nthe costs down as low as we did.\nYour very own Enki Elixir, the same stuff the Annunaki taught us how to make, can be rush-delivered directly\nto you at the price you see below.\nIf you go with three or more bottles, shipping is 100% FREE\",\nplus you'll also receive a deep discount.\nAnd to make sure you have nothing to worry about, we're to throw in a FREE 365 day no questions asked, money\nback guarantee.\nIf you change your mind for any reason, you have up to one full year from the time of purchase, to get a\ncomplete refund on any of the unused ormus.\nThat's how confident I am that Enki Elixir will change your life... But that's not all…\nFREE BONUS #1: The Chakra Bible\n• This image represents a digital download and not a physical book\nWe've also crafted a fully illustrated, 40 page guide called “The Chakra Bible” which covers everything\nyou need to know about your different chakra energy points, and how to clear any blockages any of the\npoints may have.\nThis is incredibly valuable information to have, as it works directly with Enki Elixir, so you'll have\nan in-depth understanding of what's going on with your chakras, and how to focus your energy on\nmanifesting what you desire after reading this detailed guide.\nValued at $69, but it's yours absolutely FREE\nwhen you order today.\nFREE BONUS #2: Alkaline Harmony\n• This image represents a digital download and not a physical book\nAnd we'll also throw in a custom illustrated guide called “Alkaline Harmony”, a 43 page recipe guide\nthat teaches you recipes designed to help detoxify, and supercharge your third eye activation.\nBy aligning what you eat with your higher purpose, you can fuel your journey to a healthier, more\nawakened you.\nThis will also help enhance the effects of Enki Elixir, and is highly recommended.\nA $49 value, yours 100% FREE.\nIf you have the means... I highly recommend getting six bottles of Enki Elixir.\nNot only will you be getting the best price, free shipping and over $100 in free bonuses, but you'll also be\nsecuring your access to this special gold ormus, not found anywhere else.\nThis is the real stuff, made exactly as described on the golden tablets.\nAnd let me be very clear…\nThere are some very powerful people… groups… and even governments who are not happy that I'm offering this\nto the public, and I do not know how much longer this website will be up.\nI am risking my own safety in order to bring this to you.\nSo it's incredibly important to grab as much of this as you can, while you still can.\nAnd I can promise you, once you feel the effects of the monoatomic gold energizing your body… your mind..\nand your spirit, you will never want to be without Enki Elixir again in your life.\nJust click the Add To Cart button below, and we'll process your order immediately and discreetly… even if\nit's 3 A.M… no matter where you are in the world.\nYou're fully protected by the 365 day, no questions asked, money back guarantee.\nIt's time we take our rightful place in the galactic federation.\nIt's time we evolve to the next level, and see what our future could truly be like without war… suffering…\npoverty…\nTRIAL PACKAGE\n1 BOTTLE\n$59/ Bottle\nBUY NOW\nTOTAL:\n$79\n$59\nBEST VALUE\n6 BOTTLES\n$29/ Bottle\nBUY NOW\nTOTAL:\n$474\n$174\n*Includes FREE Shipping PLUS Bonuses\nMOST POPULAR\n3 BOTTLES\n$49/ Bottle\nBUY NOW\nTOTAL:\n$237\n$147\n*Includes FREE Shipping PLUS Bonuses\nWithout wanting… without sadness…\nA life full of wonder… full of hope.\nIt’s time I come out of the shadows… and into the light.\nIt's time we all come out of the deception that's been fed to us, and demand the truth… and take our\nrightful place in the Universe and experience our full potential.\nTake action now and let's do this together!\nTRIAL PACKAGE\n1 BOTTLE\n$59/ Bottle\nBUY NOW\nTOTAL:\n$79\n$59\nBEST VALUE\n6 BOTTLES\n$29/ Bottle\nBUY NOW\nTOTAL:\n$474\n$174\n*Includes FREE Shipping PLUS Bonuses\nMOST POPULAR\n3 BOTTLES\n$49/ Bottle\nBUY NOW\nTOTAL:\n$237\n$147\n*Includes FREE Shipping PLUS Bonuses"
    }
  ],
  "argos_summary": "The article reports on the growing trend of consumers turning to AI tools and alternative wellness products, particularly pineal gland supplements, driven by dissatisfaction with traditional healthcare. It highlights Enki Elixir, a new liquid supplement marketed as a gold‑based ormus formula that claims to activate the pineal gland, boost energy, and enhance consciousness, positioning itself as the 2025 best in its category. The press release blends marketing with a narrative of ancient alien influence, Sumerian tablets, and conspiracy theories about government secrecy, while offering a sales pitch with bonuses and a money‑back guarantee. The piece underscores the broader cultural shift toward ingredient transparency, self‑guided health routines, and the allure of mystical wellness claims.",
  "argos_id": "JCZIDYUVP"
}