{
  "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-08-23/relay-review-riz-ahmed-lily-james-sam-worthington-david-mackenzie",
  "authorsByline": "Robert Abele",
  "articleId": "cf6ceb9fca374b7f861ad5e2c5eb157b",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/1de0a43/2147483647/strip/true/crop/7952x4175+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffc%2Fb5%2F193adbd649b9900577af0199d15c%2Frelay-still-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T17:52:25.572000+00:00",
  "addDate": "2025-08-23T17:56:56.040399+00:00",
  "refreshDate": "2025-08-23T17:56:56.040402+00:00",
  "score": 1.0,
  "title": "Review: In 'Relay,' a secret fixer will help you disappear — but what if you get lonely?",
  "description": "An actor of wide range ('Sound of Metal,' 'Nightcrawler'), Riz Ahmed plays a different kind of tech bro, an anonymous helper who shields corporate whistleblowers.",
  "content": "If history has taught us anything, it’s that no one is truly safe. That gathering dread fueled some great ’70s paranoid thrillers, such as “The Parallax View” and “The Conversation,” but it’s been difficult to replicate that eeriness in today’s extremely online world, when our devices explain and obfuscate with abandon, conspiracies are lifeblood and we feel persecuted one day, invincibly anonymous the next.\n\nThe nifty premise of “Relay,” a new white-knuckle ride from “Hell or High Water” director David Mackenzie, is that a certain type of tech-savvy hero can, if not completely ease your anxiety, at least navigate a secret truce with those out to get you. And Riz Ahmed’s solitary off-the-grid fixer, Ash, who hides in plain sight in bustling New York, can do it without ever meeting or talking to you: His preferred mode of traceless communication is the text-telephone service that hard-of-hearing people use in conjunction with message-relaying operators. Like a ready-made covert operation, it keeps identities, numbers and call logs secret.\n\nFor the simple fact that “Relay” is not about an assassin (the movies’ most over-romanticized independent contractor), screenwriter Justin Piasecki’s scenario deserves kudos. Rather, Ash’s broker helps potential whistleblowers escape the clutches of dangerously far-reaching entities — unless, of course, they want to settle for cash. It’s a fascinatingly cynical update: Should we make an uneasy peace with our tormentors? (Hello, today’s headlines.)\n\nBefore those questions get their due, however, “Relay” sets itself up with clockwork precision as a straightforward big-city nail-biter about staying one step ahead. Seeking protection from harassment and a return to normal life, rattled biotech scientist Sarah (Lily James) goes on the run with incriminating documents about her former employer. When she’s rebuffed by a high-powered law firm, she’s provided a mysterious number to call. Ash, armed with his elaborate vetting methods, puts Sarah through the paces with rules and instructions regarding burner phones, mailed packages and a detailed itinerary of seemingly random air travel. It doesn’t just test her commitment, though — it’s also a ploy to scope out the corporate goons on her trail: a dogged surveillance team led by Sam Worthington (who should maybe only play bad guys) and Willa Fitzgerald.\n\nAs the story careens through airports and post offices and New York’s hidey-holes, the cat-and-mouse chase is dizzyingly enjoyable, worthy of a Thomas Perry novel. We wait for the missteps that threaten everything, of course, and they begin with learning that Ash is a failed whistleblower himself, one who is beginning to question his chosen crusade. Another vulnerability, recognizable in the occasional cracks in Ahmed’s commanding stoicism, is the loneliness of the gig. So when a restive Sarah, on one of their protected calls, gently prods for a smidgen of personality from her mysterious unseen helper, one is inclined to shout, “No feelings! Too risky!”\n\nBut that, of course, is the slippery pleasure of “Relay,” which pits individuals against venal institutional might. Flaws are the beating hearts of these movies, triggering the peril that makes the blood pump faster. Some of that effectiveness is undercut by some off-putting music choices, but McKenzie’s command of the material is rock solid, Giles Nuttgens’ cinematography achieves a sleek, moody metallic chill and Matt Mayer’s editing is always fleet. In a year that’s already given us one superlative case of adult peekaboo — Steven Soderbergh’s “Black Bag” — “Relay” proves there’s still more room for smart, punchy cloak-and-dagger options.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/entertainment-arts/tv/story/2022-02-02/lily-james-pamela-anderson-pam-and-tommy-hulu",
    "https://www.latimes.com/archives/la-xpm-2005-mar-06-ca-cinefile_6-story.html",
    "https://www.latimes.com/entertainment/movies/la-et-mn-hell-high-water-review-20160807-snap-story.html",
    "https://www.latimes.com/entertainment-arts/movies/story/2025-08-22/splitsville-review-dakota-johnson-adria-arjona-kyle-marvin-michael-angelo-covino",
    "https://www.latimes.com/entertainment-arts/movies/story/2025-03-12/cate-blanchett-michael-fassbender-black-bag-spy-thriller-steven-soderbergh",
    "https://www.latimes.com/topic/for-la-times-subscribers",
    "https://www.latimes.com/entertainment-arts/movies/story/2025-08-20/lurker-review-archie-madekwe-theodore-pellerin-havana-rose-liu-alex-russell",
    "https://www.latimes.com/entertainment-arts/movies",
    "https://www.latimes.com/entertainment-arts/movies/list/best-movie-theaters-los-angeles",
    "https://www.latimes.com/entertainment-arts/movies/story/2025-08-21/honey-dont-review-ethan-coen-margaret-qualley-aubrey-plaza-chris-evans",
    "https://www.latimes.com/archives/la-xpm-2000-feb-11-me-63315-story.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Relay",
      "weight": 0.062343758
    },
    {
      "name": "rattled biotech scientist Sarah",
      "weight": 0.05378889
    },
    {
      "name": "bustling New York",
      "weight": 0.052635442
    },
    {
      "name": "New York",
      "weight": 0.051041383
    },
    {
      "name": "Ash",
      "weight": 0.04581674
    },
    {
      "name": "Sarah",
      "weight": 0.0447038
    },
    {
      "name": "potential whistleblowers",
      "weight": 0.044177957
    },
    {
      "name": "course",
      "weight": 0.043580394
    },
    {
      "name": "call logs",
      "weight": 0.041718625
    },
    {
      "name": "Justin Piasecki",
      "weight": 0.040390477
    }
  ],
  "topics": [
    {
      "name": "Movies"
    },
    {
      "name": "Reviews"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.92333984375
    }
  ],
  "sentiment": {
    "positive": 0.115948394,
    "negative": 0.49985936,
    "neutral": 0.3841923
  },
  "summary": "The film \"Relay\" is a new thriller from director David Mackenzie and stars Riz Ahmed as a secret fixer who helps potential whistleblowers escape the clutches of far-reaching entities. The film, which is not about an assassin, sets itself up with clockwork precision as a straightforward city nail-biter about staying one step ahead. The main character, Sarah (Lily James), seeks protection from harassment and a return to normal life after discovering incriminating documents about her former employer. The story follows a cat-and-mouse chase through airports and post offices, with an elaborate vetting process involving burner phones, mailed packages and a detailed itinerary of air travel. Despite some minor issues, the film is praised for its ability to depict individuals against institutional might.",
  "shortSummary": "\"Relay” offers a sophisticated, anonymous fixer who helps whistleblowers evade corporate espionage, but suffers from loneliness and some off-field music.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "64bdc9dcf74c4cb7bc9ad82ddc69d75b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-03-12/cate-blanchett-michael-fassbender-black-bag-spy-thriller-steven-soderbergh",
      "text": "- Share via\n1\nIt’s taken a few false starts to get Cate Blanchett and Michael Fassbender on the same Zoom call. She’s been preparing to open a production of “The Seagull” at the Barbican in London, her first time onstage since 2019. He’s been on a much-needed holiday with his family before returning home to Lisbon. Perhaps that’s why, in an hour that finally aligns with everyone’s schedule, it feels genuinely miraculous to hear the two actors share stories of their craft.\nThere’s a lighthearted moment of catching up between them, reuniting after shooting Steven Soderbergh’s spy thriller “Black Bag” last spring. Fassbender wants to know how she feels about the play’s opening night (a bit nervous), and Blanchett is curious if he wrapped his series “The Agency” (yes, in December). They have an easy shorthand that suggests a long history. But in truth, they only shared a handful of encounters before making “Black Bag.”\nThey recall meeting at various awards shows in 2014, when Fassbender was Oscar-nominated as a supporting actor in Steve McQueen’s “12 Years a Slave” and Blanchett won the lead actress award for Woody Allen’s “Blue Jasmine.” A few years later, they were on set in Austin, Texas, for Terrence Malick’s elliptical 2017 drama “Song to Song.”\n“We actually did a scene together in that,” Fassbender remembers.\n“If you can call it that,” Blanchett cracks. She’s sparky but focused as she sits in her home office. “I don’t think it made the film. I don’t think anything I did in that movie ever made the film. It was in that phase where Terry, having come off the back of making one film a decade, made three or four in a row.”\n“He literally did ‘Knight of Cups’ and then straight into ‘Song to Song,’” Fassbender recalls, speaking from what appears to be a very ornate living room with tall ceilings, before asking Blanchett, “Did you do ‘Knight of Cups’ as well?”\n“I did,” she affirms. “But likewise I don’t know whether anything I did was in the movie. But that’s the contract, isn’t it?”\nNot so with their current director, Soderbergh, whose efficiency and command are legendary. “You know that when you work with him, absolutely everything you shoot will be in it,” Blanchett says, with a sense of pride. She grins, adding, “And, in fact, he’s already shot and edited the thing before any of us have shown up.”\nOften the camera operator on his own films, the Oscar-winning director of “Traffic” had an idea for a first-person horror movie, one that required some stamina.\nIn “Black Bag,” Blanchett and Fassbender play a married couple who are both high-level spies in the British government. Soderbergh and Blanchett had been planning to collaborate on a different film, but when that didn’t come to fruition, the director pivoted to screenwriter David Koepp’s wry, unconventional take on an espionage story. He and Koepp had previously collaborated on “Kimi” and the ghost story “Presence,” and Soderbergh liked that the script had broad appeal.\n“It’s hard to find things that are commercial that are also really good,” Soderbergh told me in London earlier this year. “And it had certain challenges in it that were of concern, and I wanted to see if I could pull that off.”\nThere’s a memorable intensity to the filmmaker that can sometimes feel remote. Blanchett admits that, initially, she was “absolutely terrified” of him.\n“He was an enigma,” Blanchett says of making 2006’s “The Good German.” “He was totally present, but I had no idea how to communicate with him. After that experience, we got to know one another.”\nShe compares him to a peregrine falcon because “his frame rate operates at an entirely different speed to everybody else’s.”\n“He is like a sharp-sighted bird,” Fassbender agrees. “When he walks into a room, he clocks everything.”\n“You can’t replicate him,” Blanchett says. “I’ve worked with directors who have tried to imitate that relaxed quality that Steven has on set, but he is like a coiled spring. He’ll cut people off midconversation and just start shooting. He’s always ready.”\n“Black Bag” undercuts traditional spy films by swapping out action in favor of dialogue, notably in the form of two extended dinner party scenes. In the film, Fassbender’s character George Woodhouse is tasked with investigating a mole in the U.K.’s National Cyber Security Centre. He has five suspects, including his elusive, elegant wife, Kathryn St. Jean (Blanchett), one of the organization’s top agents. Both dinner parties are part of an attempt to elicit the truth.\n“I wanted to see if I could get away with a 14-page dinner scene because that’s not supposed to work,” says Koepp, speaking over the phone later from New York. “You’re not supposed to have six people sitting at a table and have it build and erupt and hold your attention. I was trying not to do spy-movie tropes, so rather than a car chase before something explodes, I wanted the climax of the movie to be another dinner at the same table.”\nSoderbergh was admittedly daunted but also enticed by the puzzle being presented. “If you ask any director, ‘What’s your least favorite kind of scene to shoot?’ I guarantee you ‘dinner table’ is going to be right at the top of the survey,” he says. “So I thought, ‘Can I come up with a way to execute this in which I’m invisible to the audience but the scene is still moving?’”\nUsually, Blanchett says, Soderbergh likes to have long restaurant meals with his cast ahead of shooting. This time, she and Fassbender only joined him for one.\n“I think because he knew he was going to be filming dinner scenes, it was making him anxious,” Blanchett deadpans. “His blood pressure was going up.”\n“We should have gone out paintballing or something,” Fassbender suggests.\n“Next time,” she agrees. “He always has to have an impossible challenge for himself as a filmmaker. He loves to not know how to do something. He doesn’t like it to be easy for himself, which is counterintuitive to the atmospheres that he creates on set, which is so relaxed.”\nTypically, Soderbergh doesn’t invite his cast to rehearse. He puts his trust in the casting process and empowers the actors to get the job done. But these dinner table sequences were blocked ahead of time because of the technical challenges — which led Soderbergh to take out the middle of the dining table and get inside the hole with the camera.\n“We did rehearse those, but it was for him, really,” Fassbender explains, himself a veteran of the filmmaker’s process from 2011’s thriller “Haywire.” “What’s kind of terrifying about Steven, which I had forgotten, is you do one take and he’s like, OK, moving on.’ And you’re like, ‘Wait a minute!’ He gives a lot of trust to everybody.”\nUnsurprisingly, the dinner table scenes are taut and dynamic. The camera moves between characters rapidly, resulting in a sense of excitement and unease, and the climatic revelation of the mole is genuinely thrilling. It’s no wonder the actors enjoyed the experience of making “Black Bag” so much, particularly coming off such demanding films as “Tár” and Fassbender’s “The Killer” for David Fincher.\n“The thing with working on film is that you’re always full of regret,” Blanchett acknowledges. Fassbender nods his head: “The drive home,” he says.\nBlanchett continues, “But with Steven, he always keeps the sets open, so if he goes home at the end of the night and looks at the edit and realizes he didn’t get a shot, or we need another line, or a character needs an extra beat, we can go back and do it. You don’t necessarily get that time up front, but he considers all of it as he’s moving through the thing, which is really fascinating.”\n“I’ve become better at letting go lightly. But I do look back on the thing, the object, with a touch of melancholy,” the actor says of moving on from things in her life, like her Oscar-nominated film.\nKoepp conceived “Black Bag” while writing the first “Mission: Impossible” film in the mid-’90s. During his research, he interviewed several CIA advisors about their careers and personal lives.\n“I was struck that many of them felt like it’s really hard to maintain a relationship when you lie for a living,” Koepp recalls. “I carried that in the back of my mind for quite some time. Marriage is the ultimate trust institution. Those of us who are in long-term marriages feel like: This is settled and this is safe. I wanted to do something where there was suspicion and unease but not about whether the person is cheating or not. It’s about whether they are betraying their country or not.”\nAlthough very little of Kathryn and George’s backstory is revealed in the film, they have an unbreakable bond and a clear attraction. They skillfully navigate between their relationship and their jobs — if there’s anything the other can’t know, it goes in a metaphorical “black bag.” That trust is shaken, though, when George begins to suspect Kathryn’s activities.\n“Part of what people find interesting about spies, particularly spies in cinema, is their interiority,” Blanchett says. “That tightrope walk between a deep morality and operating in a totally amoral space. And in a marriage, there are secrets. You do protect your partner from things. There has to be, in order for a relationship to last.”\n“They’re constantly operating from a paranoid perspective on things, which is what keeps them alive and keeps them in the job,” Fassbender adds. “Even in the department they work in, you have to keep an eye over your shoulder. A sociopath does pretty well in this environment, but you don’t want too many sociopaths in the same department.”\n“Black Bag” is Fassbender’s second time playing a spy during the last year. On the series “The Agency,” from Paramount+ with Showtime, he portrays hardened CIA agent Martian, who is working in London after a long deep-cover assignment. Both projects were offered to him within days of each other, although the similarity was not intentional.\n“I’m just doing spies now,” Fassbender jokes. Blanchett, his perfect audience, laughs. He quips, “I just love lying to everyone.” Still, the actor was able to find specifics to “Black Bag’s” George that differed from Martian. It helped that Soderbergh approached the genre with notable warmth.\n“The depressiveness of that job, which you can see in a lot of spy movies, is not there on the screen,” Fassbender says. “It looks sexy. It’s slick. That’s a very smart thing he’s done for this particular story. Usually there’s loneliness and isolation when you see spies who have been through a career for 25 years.”\n“There’s a lot of chutzpah in being a spy,” says Blanchett. “They’re very serious people, but they’re also so much fun. They can’t have boundaries because they don’t know when they’re going to have to cross them. There’s a fluidity to them, but that fluidity is just masking an enormous amount of damage.”\nSoderbergh’s speedy filmmaking style allowed the actors to discover moments together on set, which they both enjoyed. Blanchett describes the director as “incredibly precise, but there’s a flow to him.”\n“He’s totally able to pivot,” she says. “Sometimes you can overthink things. I used to think, coming from the theater, that if you have all the time in the world, you’ll get the perfect moment. And then you just string those perfect moments together. A lot of films, they have all the money and time in the world, and all the life gets leeched out of them, which is not the case for Steven.”\n“Restriction sometimes brings freedom,” Fassbender notes.\n“Yeah,” Blanchett agrees. “Although you don’t want to say that to too many studio heads.”\nHow do they deal with the pressure that still comes, even with all their years of experience?\n“We both get into cold water in the morning,” Blanchett says. She means this literally: On set during “Black Bag,” the two discovered that each begins their day with an ice bath as a way of building focus. Blanchett even took her family to the Arctic Circle over New Year’s and they all leapt into a fjord.\n“I’ll give you the details,” she tells Fassbender, like she’s sharing a state secret, “It was really special.”\nHer conspiratorial air vanishes as the hour comes to an end and her focus shifts back to “The Seagull.” Like spies, actors know how to adapt as they go."
    },
    {
      "url": "https://www.latimes.com/archives/la-xpm-2000-feb-11-me-63315-story.html",
      "text": "Author Opens a New Chapter of Writing Life\n- Share via\nStudio City writer Thomas Perry has just made a professional leap of faith.\nHe has announced that his new book, “Blood Money,” will be the last to feature his popular Native American heroine, Jane Whitefield.\nIt is not as if the fine suspense series of which this is the fifth book were not popular.\nPublished only last month, the book has already sold out a first printing of 33,000 copies, and Random House is furiously printing more to fill back orders.\nMoreover, a New Jersey newspaper, reviewing the book, gushed: “Life is good because the new Thomas Perry is out.” The reviewer went on to describe Perry’s series about a young Seneca Indian woman who helps endangered people disappear as a formula novel “the way chocolate is a formula and champagne is a formula. It’s a formula that’s always great.”\nBut Perry, winner of mystery writing’s top prize, the Edgar, insists “Blood Money” is “the fifth and, theoretically, the final book” about his professional Native American “vanisher.”\nWriting a series compared to chocolate and champagne is great, Perry says, “but it’s not necessarily what you want to do with the rest of your writing career.”\nPerry decided to shelve his critically acclaimed “vanisher” not because he tired of her or because he felt the quality of the books was slipping, but because he wanted to continue to grow as a writer.\n“I could probably keep writing these things for the rest of my life and they wouldn’t get any worse, but I wouldn’t get any better,” he says. And then he adds what so many people forget to their ultimate dismay: “If you can’t do your best work, you’re wasting your life.”\nAlthough Perry plans no further Whitefield exploits, he says, “I’m leaving the door open.” He had originally planned to kill Jane off, but he was acutely aware of the mess writers who murder popular protagonists find themselves in if they ever have to resurrect them.\nRemember the serious tap-dancing Arthur Conan Doyle had to do to explain how Sherlock Holmes survived his tumble off the Reichenbach Falls. Or the tortured explanations the soap-opera writers of the hilarious movie “Soap Dish” had to come up with to explain how character Rod Randall could return after he was decapitated in an earlier episode.\nPerry says he wanted to avoid having to write a scene at some future time in which Jane is in the shower and realizes that she only dreamed that she had died.\nWhen Perry first discussed making “Blood Money” the last Whitefield book, his editor at Random House immediately advised him, “Don’t kill her.” When he asked why, she answered, “As soon as you do, you’ll think of something you can’t bear not to write about her.” That seemed like sound advice to Perry.\nBefore writing the Whitefield books, which are rich with lore about the Senecas of Perry’s native western New York, he published five earlier suspense novels--each distinctive--including the Edgar-winning “The Butcher’s Boy” and “Metzger’s Dog.”\nLiberated from the assumptions about Jane’s nature and behavior that shaped the series, he has already all but completed two new novels.\nHesitant to talk too much about them, Perry says the first, tentatively called “Death Benefits,” is done. It’s about a middle-aged insurance investigator and his younger protege investigating a fraud in the course of which the young man “learns what planet he really lives on.”\nAnd Perry’s currently finishing the last chapter of the second book. It deals with a professional killer and a detective who are both profoundly alike and deeply dissimilar.\n“The fun of the book,” Perry says, “is that these guys are the best, the absolute best, and they lay traps for each other and, then, the other will turn the trap into a weapon.”\nNo one else has read the manuscript yet, he says, not even his wife.\n*\nI greatly enjoyed Thomas Perry’s early work, but I have a special affection for the Jane Whitefield books.\nSeveral years ago, my dearest childhood friend, Toni Flores, was dying of ovarian cancer. As teenagers in Philadelphia, we had had heated, probably nonsensical arguments about Dostoevsky and our other favorite writers. But, as Toni’s illness progressed, this enormously gifted, warm, courageous woman (an anthropologist, poet, college professor, actress, dancer and mother of five) had the great good sense to read for something of almost unimaginable value--for pleasure.\nA month or two before her death on Nov. 3, 1997, she asked if I had a mystery I thought she might enjoy and mentioned how much she liked the Jane Whitefield books (Toni taught in upstate New York and loved both Jane’s valor and the books’ Seneca lore). I think it was Perry’s “Vanishing Act” I gave her.\nIf one measure of a writer is his readers, Perry will surely be proud to know that his admirers included the extraordinary woman who wrote this poem for the youngest of her children, not yet in their teens:\nFOR JOHN AND ANTHONY, in case of an accident\nWait for me. When you feel alone,\nwhen you want to tell me something,\nwhenever you smell the smoke of burning pine,\nright then, stop. Wait.\nWhen you see a pink sky, and say\n“She would say, ‘Look!’ ”\nwait for me. When you kiss someone,\nlook over the edge of a snowmound,\ncut yourself, get a wart, learn\na theorem, wait, wait. Open\nto the waiting. And when the line\nof a roof, or the line of a song,\nor the line of a rabbit’s tracks\nin the first snow wring the breath\nfrom you, wait for me, and you will find\nthat I am already there.\n--Toni Flores, April 1994"
    },
    {
      "url": "https://www.latimes.com/topic/for-la-times-subscribers",
      "text": "Latest\nIn Oklahoma, education officials are requiring teachers from California and New York to take an exam aimed at guarding against ‘radical leftist ideology.’\nIn Oklahoma, education officials are requiring teachers from California and New York to take an exam aimed at guarding against ‘radical leftist ideology.’\nThe Valley is home to the state’s first materia, a Middle Eastern cafe brewing sand coffee and a dedicated margarita bar from an award-winning beverage team, with plenty of neighborhood dives in between.\nOn bustling Western Avenue in the heart of Gardena, Sakura-Ya and Chikara Mochi sit about 250 feet away from each other, frequented by South Bay residents for decades for fluffy mochi and cakey manju.\nA program to lure remote workers to Tulsa, Okla., has attracted hundreds of Californians in the last few years as they look to plant roots where the costs of living are significantly lower.\nExperts are divided: Is any new development in California’s housing crisis welcome, or are certain types of housing more needed?\nWith downtown’s office rental market mired in high vacancies and falling values, stakeholders are clamoring for more city support to convert high-rises to housing that would help address the city’s persistent housing shortage.\nFamily and neighbors said the family appeared to live a quiet life. Yet hundreds of court records reviewed by The Times, including sworn declarations, surveillance footage images and an autopsy report describe a strained marital relationship and contentious divorce.\nFrom AI-native studios to interactive platforms, a new generation of storytellers is challenging Hollywood’s role as the center of the entertainment universe.\nAuthorities say illegal card games hosted at mansions in Encino, Sherman Oaks and the Hollywood Hills bring together Israeli organized crime figures, Latino gang members and gamblers who racked up debts as high as $1.5 million.\nThe Trump administration recently released a cache of classified files on the 1968 assassination of Robert F. Kennedy in California, leaving attorneys for convicted gunman Sirhan Sirhan combing for new evidence in a case that has spawned many conspiracy theories.\nBetween the destination-worthy margarita bar, the matcha martinis, the dives with killer cocktails, and the new Big Easy beverages, the only question is where to begin."
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-08-22/splitsville-review-dakota-johnson-adria-arjona-kyle-marvin-michael-angelo-covino",
      "text": "Mark Olsen writes about all kinds of movies for the Los Angeles Times as both a feature writer and reviewer.\n- Share via\n1\n“Splitsville” lands at a moment when every comedy released to theaters feels like a battle cry, an attempt to defend audiences’ rights to have a good time at the movies.\nDirected by Michael Angelo Covino, who also produces, co-writes and co-stars alongside Kyle Marvin, the film continues the duo’s comic exploration of bad choices, in which men predictably make poor decisions and are depicted as vain, infantile and often motivated by their worst impulses. (It’s funny because it’s true.)\nAs the movie begins, Carey (Marvin) is married to Ashley (Adria Arjona), who tells him she has been seeing other people and wants a divorce. He seeks solace from his best friend Paul (Covino) and his wife, Julie (Dakota Johnson), who tell Carey they are in an open relationship. Soon Carey sleeps with Julie and all sorts of jealousies and complicated feelings arise among the four of them.\n“Splitsville” — the title appears briefly onscreen as the neon sign of a dessert stand — is outwardly a satire of bourgeois aspirations, modern marriage and how no one really understands the dynamics of what goes on with other couples. But the film is actually more concerned with the absurdities of male friendship, to the extent that Covino and Marvin are perennially enamored of themselves and can’t help from centering their own antics.\nOur expectations were set sky high and still we left with an even 10 titles that floored us, including new work from Lynne Ramsay, Jafar Panahi and Nadav Lapid.\nTheir previous movie, “The Climb,” was also about two friends locked into an up-and-down relationship alternating between of moments of betrayal and gestures of support. While they are not playing the same specific characters from “The Climb,” they are very much playing the same type. Covino is seemingly more smooth and together, though riddled with insecurities, while Marvin initially appears hapless and vulnerable, with an emotional intelligence that reveals him to be savvier than he first appears. So they basically meet in the middle.\nThe entire movie has a disappointing air of smug self-regard about it, with an expectation the audience will adore everything about the characters as much as they do. What at moments feels like a nascent interrogation of contemporary masculinity ultimately suffers from the very impulses it seems to want to parody. (We hear numerous times that one of them is generously endowed.)\nBoth Arjona and Johnson are asked to play variations on personas they have depicted elsewhere. Arjona has the same earthy warmth she did in “Hit Man,” while Johnson exhibits a placid air of controlled chaos similar to what she showed earlier this year in “Materialists.” They undoubtedly elevate the movie, though too often their characters feel like game pieces manipulated on a board controlled by the film’s male leads.\nJohnson and Arjona are movie stars, beguiling and captivating. Covino and Marvin seem like a couple of guys who somehow wandered onscreen. The tension is never reconciled and is constantly throwing the story off balance.\nIn “The Climb,” there is a moment where Covino and Marvin briefly wrestle, a ludicrous sight of two grown men tussling on the ground. Here that beat expands into a full-blown fight scene that goes on for more than six minutes, as Paul attacks Carey after learning he slept with Julie. Smashing furniture, breaking drywall, destroying a fish tank (while saving the fish) and somehow singeing off Carey’s eyebrows, the fight scene is the movie’s centerpiece, one of its major selling points and indicative of everything that both works and doesn’t. It is funny, escalating ridiculously, but it is also too outlandish for the characters and the story and only really exists as something that Covino and Marvin simply wanted to do for themselves.\nThey’re good at jokes but much weaker on meaning, stumbling when it comes to making it all add up to something. With a background in advertising, Marvin and Covino are strong on short, punchy ideas conveyed through strong visuals. They may eventually be better served by making work they do not appear in — their performances are the weakest thing about their movies so far. Even as they remain a promising duo, “Splitsville” never quite fully comes together.\n'Splitsville'\nRated: R, for language throughout, sexual content and graphic nudity\nRunning time: 1 hour, 40 minutes\nPlaying: In limited release Friday, Aug. 22"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/list/best-movie-theaters-los-angeles",
      "text": "The 27 best movie theaters in Los Angeles\n- Share via\nIs Los Angeles about to enter a golden age for moviegoing? That’s our optimism showing. But let the evidence speak for itself. Classic movie palaces are reopening. Scrappy new venues are becoming instant neighborhood fixtures. Devoted audiences are selling out repertory screenings. Finally, with pandemic closures and crippling labor issues out of the way, Hollywood may be on the verge of a new bloom. The landscape has changed since we last took stock of L.A.’s best movie theaters. Our film writers and editors seriously approached the task of making an authoritative list, factoring in matters of presentation, comfort, programming and, yes, snacks. Here’s our extremely opinionated pantheon. Join us at these 27 theaters. We’ll be there, often.\nSubscribers get exclusive access to this story\nWe’re offering L.A. Times subscribers special access to our best journalism. Thank you for your support.\nExplore more Subscriber Exclusive content."
    },
    {
      "url": "https://www.latimes.com/entertainment/movies/la-et-mn-hell-high-water-review-20160807-snap-story.html",
      "text": "Review: ‘Hell or High Water’: When the banks steal from you, is it OK to rob them?\n- Share via\n“Hell or High Water” is a gripping heist drama keenly attuned to the outsider politics of our times.\nSet in the desolate sprawl of West Texas, it opens, like many such movies do, with a bank robbery. Outside the building, spray-painted on the wall are the words: “3 tours in Iraq, but no bailout for people like us.” Later, after another holdup, Texas Rangers try to pry information from reluctant witnesses. “Bank been robbing me for 30 years,” a man tells them, explaining why he might be a bit vague on supplying helpful details.\nThe film sports two Robin Hoods, brothers Toby (Chris Pine) and Tanner (Ben Foster), armed with guns, ski masks and a very precise plan. They demand small-denomination bills and hit only branches of one specific bank. You may conclude that they’re crazy or holding a grudge. Both observations turn out to be true, though, of the two, it’s Tanner, one year removed from a 10-year jail stretch, who’s the more volatile of the two.\n“How’d you manage to stay out of prison for a year?” Toby asks his older brother.\n“It’s been difficult,” Tanner replies.\nThat exchange is a nice example of the movie’s sly humor, which is grounded in character between the dissimilar brothers as well as the two mismatched Texas Rangers chasing them, Marcus (Jeff Bridges), an old-timer three weeks from an unwanted retirement, and Alberto (Gil Birmingham), his Native American partner, who suffers through insults and gives back as good as he gets.\nThat “Hell or High Water” makes you empathize with and understand (though not excuse) each member of this disparate quartet is a tribute to the way Taylor Sheridan’s screenplay works equally well as a thriller, character study and pointed social commentary. Sheridan also wrote last year’s taut white-knuckler “Sicario,” which likewise squared its violence with a superb sense of the Southwest and the people who inhabit it.\nDirector David Mackenzie keeps the story moving briskly, striking a nice balance between the jolting robbery sequences and the ruminative conversations between its two pairs of men. Cinematographer Giles Nuttgens’ beautiful widescreen compositions add to the immersive, respectful authenticity, as does Mackenzie’s superb casting that extends to the smallest roles. (The filmmakers have clearly spent their fair share of time in restaurants. The two waitresses in this movie — played by Katy Mixon (“Eastbound and Down”) and Margaret Bowman — are beauts, each in their own particular fashion.)\nPlaying the lawman, Bridges, looking like Kris Kristofferson from “Lone Star,” shines as a plainspoken man grieving the end of his career. Foster and Pine establish a solid connection as siblings from the get-go, with Foster making the most of every big, loose-cannon moment and Pine nicely understated as a man looking to inoculate his sons from the “disease of poverty” that has infected every generation of his family. That, as the movie’s damaged landscapes make clear, is a tall order. Holding up a bank is child’s play by comparison.\n‘Hell or High Water’\nMPAA rating: R for some strong violence, language throughout and brief sexuality.\nRunning time: 1 hour, 42 minutes\nPlaying: In limited release"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/tv/story/2022-02-02/lily-james-pamela-anderson-pam-and-tommy-hulu",
      "text": "- Share via\nWhen she agreed to play Pamela Anderson, Lily James expected she’d eventually receive the “Baywatch” star’s blessing.\n“Pam & Tommy” was, after all, about consent — an exploration of the disturbing privacy violation Anderson and her then-husband, Mötley Crüe drummer Tommy Lee, suffered when their sex tape was stolen in 1995 and subsequently distributed online.\nBut as the start of production on the Hulu series approached last spring, inquiries to Anderson remained unanswered. Not only did the 54-year-old choose not to be involved with the miniseries but she apparently opposed its existence altogether. Tabloid reports, citing sources close to the actor, claimed she found the series “very painful,” calling it a “cheap knockoff” she’d never watch. A month into production, Courtney Love said on Facebook that the tape had “destroyed my friend Pamela’s life,” arguing the show was “further causing her complex trauma.”\n“And shame on lily James,” Love added, “whoever the f— she is.”\nDevastated: That’s who James now was. The 32-year-old had spent the better part of a year transforming into the former Playmate, only to be left wondering: By making a TV program about how Anderson was exploited, was James simply adding to the exploitation?\n“I’m really sensitive to it,” she said, trying to rub out a stain from coffee she’d just spilled on her dress. “I just know that my intentions — our intentions — were good. I would never have come on board if I didn’t think it was a worthy story to look at in order to provoke a conversation about how we treat women.”\nIt’s a thorny topic — one she continues to grapple with. Five days after our interview, James sent an email saying how much the issues raised in the conversation had “been on my mind.” She said she’d only learned that Anderson wouldn’t be involved “quite late in the process,” and though she was “incredibly disappointed,” she’d channeled her feelings into a heightened sense of “responsibility to do absolutely everything I could to try and do her justice.”\nIt’s cast a shadow over what is otherwise the biggest moment in James’ career to date. For the past decade, she has largely played amiable, pleasant types: the lead princess in Kenneth’s Branagh’s live-action “Cinderella,” the younger version of Meryl Streep in the “Mamma Mia!” sequel, the waitress on the run in “Baby Driver.” But though she’s appeared in around 20 films, she’s not uniformly identified with any one performance.\n“Pam & Tommy” should change that. As Anderson, James is both sweet and audacious, embodying the wide-eyed, 20-something Canadian who at once relished an invite to the Playboy mansion and fought to make her collaborators on “Baywatch” and the 1996 film “Barb Wire” see her as more than a body to push and prod.\n“This is a game-changer for Lily,” said Lake Bell, who directed her in two episodes of the series. “I see her ferociousness. She knows how to exercise restraint, and she knows when to release the storm inside. People don’t know that yet about her.”\nJames had been mulling a metamorphosis when she was approached about “Pam & Tommy,” which co-stars Sebastian Stan as Lee. She’d recently gone up for a dark, complex character only to be told by the director that she was “too likable.” She took it as a sign that she needed to mix things up.\n“I was feeling fed up, like I was repeating myself, or boxed in,” she recalled. “‘You’re so likable’ is diminishing, in some way. That’s not a compliment.”\nJames, who was raised in Surrey, England, about an hour from the home she recently bought in north London, was a prototypical theater kid. At her performing arts high school, she wrote out all the lyrics to the songs while watching “Grease” and had a Marilyn Monroe boxed set. After graduating, she studied at the Guildhall School of Music and Drama, whose alumni include Michaela Coel, Daniel Craig and Jodie Whittaker.\nActing was also in her blood. Her grandmother, Helen Horton, was an American-born actor who voiced the “Mother” ship computer in Ridley Scott’s “Alien.” Her father, Jamie Thomson — who died from cancer in 2008 — was a performer too. In the 1970s, he lived on Sunset Boulevard and made ends meet as a waiter. After a car accident left his face scarred, he found a new niche as a character actor playing gangsters.\n“My dad was such an artist — I barely ever heard him speak in his voice. It was always accents, always stories, always songs,” James said. “He was a clown, though. I’m less of a clown. I really want to do a comedy. My dad was freakin’ hilarious. I’m only funny by accident. I feel like when I watch movies I’m in, I’m like, ‘Oh, they cut my joke,’ which can’t be a good sign.”\nJames is prone to taking casual jabs at herself like this, and those who have worked with her say she is often her own harshest critic. To prepare for “Pam & Tommy,” the actor trained with dialect coach Liz Himelstein for six weeks prior to production. She also requested Himelstein’s presence on-set, and the two would run lines and do tongue twisters or consonant drills in James’ trailer while she was having her hair and makeup done.\n“She was very hard on herself,” said Himelstein. “She would say a line and then say, ‘Oh, that doesn’t sound right.’ I said, ‘It actually does.’ And she’d say, ‘Oh, I need it again.’ I said, ‘Fine, let’s do it again.’ But I’d tell her: ‘Oh, my God. My darling, you are nailing it.’”\nJames spent hours watching every interview she could find with Anderson on YouTube, notating her pace, tone and inflection. Then on her iPhone, James recorded herself mimicking the interviews and saved the files for reference.\n“So like this one,” she said, hitting play on one of the clips, “it’s Pam’s main note. I would use these to find her pitch on the piano.”\nDuring the four months that “Pam & Tommy” filmed, James went full Lady Gaga, speaking only in Anderson’s Malibu-influenced cadence. (“Except when I would get a little drunk. That’s when it was like, ‘Oh, that’s what I sound like. Back to my extremely dry sense of English humor.’”)\nReframing of the couple’s sex tape saga has mixed results, but the series’ treatment of culture at the dawn of the internet is stupidly entertaining.\nIn person, James bears little physical resemblance to Anderson. She’s a brunet with a slight frame who rarely tousles her hair or wears heavy eyeliner. So while she spent six months working out with a personal trainer before sporting the blond’s iconic red swimsuit, much of James’ physical transformation was aided by prosthetics. She was cast without having to do a screen test, and the first time production tried out different looks on her, it didn’t go well.\n“I looked Italian,” she said, laughing. “I was panicking, like, ‘I can’t do this.’ I looked nothing like Pamela Anderson.”\nWhen the team nixed a cheap blond wig and stopped shaving James’ eyebrows, she recalled, things started to improve. She wore two prosthetics on her face, but the majority of the Anderson effect was achieved through makeup: shaving down her nose, using contour and shadow to make her cheeks look fuller, adding liner to plump up her lips. To complete the transformation, she wore long fake nails, colored contacts, fake teeth and a chest prosthetic. She also bleached her eyebrows and got weekly spray tans for the entirety of shooting.\nShe found the smoke and mirrors to be both a support and a hindrance.\n“Sometimes it felt like this amazing armor that you could hide [behind] and disappear inside of,” James said. “And other times all I could think was: ‘No, wait, but that doesn’t sound like her.’”\nJames also felt conflicted about watching the sex tape — less explicit parts of which are emulated in “Pam & Tommy.” Asked if she’d viewed the tape in her research, James demurred.\n“It’s not that I don’t want to say — it just makes me feel really uncomfortable because it’s a really difficult subject to talk about because of the damage it caused to their lives,” she said. “The show does so well at exploring the problems and consequences and repercussions of it, so in a way I want the show to explore that rather than me giving any answers that become tricky and uncomfortable.” (Craig Gillespie, a director and executive producer on the project, clarified that after extensive conversations with James, the team decided only to pull from the tape on an “emotional level” and not use it to guide “anything sexual” in the series’ depiction of Anderson and Lee.)\nJames said she gained the deepest understanding of Anderson through reading her 2015 book of poetry, “Raw,” and letters she wrote in support of animal rights. She also related to the ways Anderson was “minimized and patronized” because of her gender and sexuality.\nAs “Pam & Tommy” emphasizes, the dissemination of the sex tape was far more damaging to Anderson’s reputation than to Lee’s. Because Anderson had posed nude in Playboy and wore a bathing suit on television, the tape was used to further characterize her as a sexpot without substance or ambition. Lee, meanwhile, was applauded for his large genitalia and further idolized as a womanizing rock ’n’ roller.\nJames herself has faced public scandal in her personal life. In October 2020, the Daily Mail published paparazzi photos of her and married actor Dominic West, her co-star in the Amazon series “The Pursuit of Love,” intimately embracing in Rome. Days later, West kissed his wife in front of photographers outside his home in London. “Our marriage is strong and we’re very much still together,” read a note the couple tacked to their home.\nAt the time, James said nothing about the incident, and she still isn’t ready to talk about it more than a year later. Asked if she felt she’d been slut-shamed by the media in ways similar to Anderson, she tried to avoid any allusions to herself.\n“I just feel that, sadly, this question and this conversation is ongoing, because it happens to women all the time,” she said. “There aren’t many women in the public arena who don’t feel like their privacy has been violated. And so that was something I really wanted to look at, because it’s incredibly damaging.”\nSo did she take on “Pam & Tommy” in an attempt to explore the issue?\n“No, I signed onto this two years ago,” she clarified. “I worry about not articulating myself properly — especially when things get written down and that’s your statement to the world. I would much rather explore what I feel through my work. Like, even now, we’re talking about my private life when I really want to be talking about work and in a way, that’s what we’re exploring in the show.”\nWithout going into detail, Bell said that she and James — “like most women in our industry” — connected through discussions of the “theft in female image, bodies, and sense of safety and comfort.” In 2014, Bell had nude images of herself stolen and distributed as part of a large-scale celebrity hacking effortreferred to as the Fappening.\nTo accompany the premiere of Hulu’s ‘Pam & Tommy,’ we’ve compiled a timeline of key developments in the saga, with Times coverage.\n“Coming into this story, one of the first things I said was that I felt almost like I was being triggered,” she said. “From one perspective, you could say that the creators of this show are cis, white males, but in the same breath understand that there were strong creative forces who were women who’d been through very similar situations. And we had a responsibility not to exploit Pam once again.”\nBell said she and James have a potential collaboration in the works, and the actor said she’s eager to produce more of her own work in the future. She admires performers like Helena Bonham Carter and Amy Adams, who do not display a particular allegiance to any genre. In college, James said, one of her favorite teachers drummed into her head that “repetition is the death of creativity.” The instructor was so insistent upon the lesson that students were never allowed to sit in the same seat twice.\n“I never want to rely on certain attributes or characters that feel as if they come more easily to me,” she said. “I am happy with the roles I’ve played to date, but I just want to keep going to the opposite ends of the scale now. I’m hooked.”\nShe’s also committed to taking care of herself offscreen. Last year, she began meditating and seeing a therapist and a shamanic healer, with whom she consults over Zoom.\nOne of her main goals was to work on “switching [her] head off,” quieting the voice offering constant criticism. She’s looking for things to root her in a profession where she often feels unmoored — playing someone else, growing close to new people only to leave them, living in a strange place, not seeing friends or family.\nThat’s part of why talking about Anderson feels so tender. She wouldn’t ever want to betray someone who now feels like a part of her.\n“It’s strange and surreal to have spent so long studying and learning from someone and never having met them. I want to be thoughtful and sensitive always,” she said. “However, I’d much rather talk about difficult, nuanced issues in relation to and through my work. That is how I want to express myself.”"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-08-20/lurker-review-archie-madekwe-theodore-pellerin-havana-rose-liu-alex-russell",
      "text": "Amy Nicholson is the film critic of the Los Angeles Times. She is a current on-air voice at LAist and KCRW, and a member of the Los Angeles Film Critics Assn. and the National Society of Film Critics. Her book “Tom Cruise: Anatomy of an Actor” was printed by Cahiers du Cinema/Phaidon Press, and her second, “Extra Girls,” will be published by Simon & Schuster. Nicholson also co-hosts the movie podcast “Unspooled.”\n- Share via\n1\n“Lurker” is a teeth-grittingly great dramedy that insists there’s more tension in the entourage of a mellow hipster than a king. At least imperial courtiers trust in strict codes about curtsies and proper titles. The rules of hanging out with British-born, L.A.-based emo-pop musician Oliver (Archie Madekwe) are vague and fraught. An impulsive, baby-faced charmer on the ascent from Instagram popularity to mainstream icon, Oliver isn’t that rich or that famous (yet), but he’s already surrounded by friends-slash-employees who ferociously guard his fiefdom and their access to it. Oliver thrives on vibes, bro, and these ones are cutthroat.\nFirst-time feature filmmaker Alex Russell brings us into this demi-star’s orbit through a Melrose streetwear sales clerk named Matthew (Théodore Pellerin). The gawky kid is an Oliver obsessive. But he’s clever enough to hide it, negging his hero into giving him a backstage pass. (Here, it’s an insult to be called a fan.) Upon entering the green room, Matthew is hazed by Oliver’s buddies Swett and Bowen (Zack Fox and Wale Onayemi, both inscrutable, funny and terrifying), who order the nervous outsider to pull down his pants as a tribute to their dead homie. He passes that test. There will be more to come.\n- Share via\nRussell sharpened his knives as a writer and producer on “The Bear” and “Beef.” He makes bleak comedies about strivers with shiv-like gags that make you wheeze in pain. Advised to make himself useful, Matthew quickly gets promoted from Oliver’s unofficial dishwasher to his unofficial documentary director. Just as quickly, he makes enemies with Oliver’s somewhat more official music video director, Noah (Daniel Zolghadri), who attempts to give Matthew the royal brush-off, as in “We appreciate your help, but ...” and then patronizingly calls him his “sous-chef.”\nAs Matthew learns when his pal, Jamie (Sunny Suljic), finagles his own party invite, anyone who gets their claws in Oliver attacks their rivals. “Lurker” is too passive a title for this story of competition. “Clinger” or “Leecher” would be more apropos.\nWe came to Park City, Utah, with huge appetites for the 41st annual Sundance Film Festival. But we’re trimming down our top picks to the very best of the best.\nOliver presents as all sunny, breezy love, sporting a trucker cap over a babushka over bleached pink hair. The costume designer Megan Gray outfits the 6’5” Madekwe in floppy sweaters that exaggerate his eagerness to pull people in for a long-limbed hug. Flighty and magnetic, Oliver trills that his clique is “one big happy family,” using his faux-obliviousness to shield himself from being the bad guy. That responsibility lands on everyone else, especially the observant and exhausted Shai (Havana Rose Liu), who might be called Oliver’s manager if anyone had a formal job description.\nMadekwe played a more obviously cruel gatekeeper in “Saltburn” as Jacob Elordi’s snotty American cousin, but he still holds all the keys. In scenes where Madekwe shuts off his character’s warmth, the movie gets 30 degrees colder (and his artificial pep more chilling). Meanwhile, Pellerin’s flinchy smiles and forced guffaws prove how much effort it takes to act effortless. At his most nonchalant, he’s doing an Oliver impression.\n“Lurker” has a casual malevolence, Russell sidling up to his targets before he attacks. He stress-tests our icky, grubby pity for Matthew and, beyond that, the flimsiness of modern fame culture and its fake-it-till-you-make-it inspirational platitudes. In a hilarious bit, one of Matthew’s own fans stops him on the street to gush, “I wanna be like you — but what do you do?”\nWhat Russell really seems to be wondering is what separates a real artist from a fake? If “Lurker” had been made a generation ago, it would have drawn a line along the boundary of authenticity: Is Oliver sincere about his vulnerable anthems? Today, that question is passé. We now recognize the pressure to forge a brand, even if said brand is a pretense of not caring about one’s image.\nAt this point in his career, Oliver likes framing himself as giddy, low-fi and spontaneous. He loves videos of himself crashing his bike into a trash can, frolicking on a beach, prancing around a field with a retro camcorder strapped to a sheep. “Am I tripping or is this sick?” Oliver asks about the farm footage. Since his posse won’t admit the truth, I will: It sucks.\nWe’ve mapped out 27 of the best movie theaters in L.A., from the TCL Chinese and the New Beverly to the Alamo Drafthouse and which AMC reigns in Burbank.\nOliver’s charisma is its own trap. A crib of yes-men limits how big he can grow. The film’s image-first focus doesn’t give it much runway to explore what motivates Oliver as an artist. There are several performance scenes that showcase Madekwe’s ability to croon in a convincing limber lilt but little engagement with his actual music. You sense that Russell is more confident dissecting the qualities of a good steak sandwich than a good song.\nMy impression of the tunes is that Kenny Beats (who had a hand in all of them and also the brilliantly anxious electronic score) has written the bulk to be decent but not dynamite. How a singer vaults up in quality is as mysterious as trying to define cool itself. Only toward the end of the film does Russell tease the question that we, too, have forgotten to ask: Does anyone care whether Oliver is a genuine talent?\nDespite its thorny psychology, “Lurker” strips its characters of everything but a scrap of backstory. We’re aware that Matthew lives with his grandmother, but we don’t know why and we don’t even know her name. That starkness gives the movie the in-the-moment immediacy of a nature doc about a shark and a swarm of remoras. Russell insists we make our own diagnosis about what drives Matthew and Oliver’s hunger for applause — and if their symbiotic dynamic has echoes throughout the entire music industry.\nTwice, Russell cues up the R&B classic “I’m Your Puppet,” which is once too many for my taste. We’re already concentrating on who’s pulling the strings. Elsewhere, there are moments when I wish Russell himself didn’t play things quite so casually. He’s so smart about noting the details — tiny glances, awkward smiles — that it’s head-scrambling when he obscures a major plot point under hasty editing and cryptic dialogue. It’s a key sequence in the script, yet we can’t get a grip on whether it’s horrific luck or a game of six-dimensional chess. The distinction matters.\nStill, Russell has captured us with this tale of a pawn trying to capture a king. We feel for them both. And we understand why castles have moats.\n'Lurker'\nRated: R, for language throughout and some sexual content\nRunning time: 1 hour, 40 minutes\nPlaying: In limited release Friday"
    },
    {
      "url": "https://www.latimes.com/entertainment-arts/movies/story/2025-08-21/honey-dont-review-ethan-coen-margaret-qualley-aubrey-plaza-chris-evans",
      "text": "- Share via\n“Honey Don’t!” is a smutty desert mystery in which the detective, Honey O’Donohue (Margaret Qualley), never gets around to solving the central crime. She’s too busy seducing women and swatting down randy men. I’d call the opening murder a red herring except it’s really more like a fish left to cook in the blinding Bakersfield sun.\nThe second film co-written by Ethan Coen and his collaborator and wife Tricia Cooke (the first was 2024’s “Drive-Away Dolls”), it’s less preoccupied by the challenge of who’s responsible for that corpse than by its own overarching question: Why not? Why not let Margaret Qualley prove she has the electricity to power an audience through any plot? Why not pivot from “The Big Lebowski” and “O Brother, Where Art Thou?” to an announced trilogy of tatty lesbian exploitation pictures? Why not, when a couple has earned the industry clout to shoot the script they want with the cast they want, make exactly the movie they want, even if this pulpy B-picture isn’t very good? Who’s going to tell them, honey don’t?\n- Share via\nTo be clear, there’s enough to like in “Honey Don’t!” to get you through its 89-minute running time. I’d watch Qualley stride around barking at people for twice as long and her supporting cast, which includes Aubrey Plaza as Honey’s latest lover and Chris Evans as an oily pastor, is delivering at top level, i.e., Coen-worthy. (Newer talent Josh Pafchek pockets his scenes as a moronic Australian brute.) The script has several zingers that are so good you want to applaud right in your seat, particularly an insult Honey slings at her estranged daddy (Kale Browne). Even the extended intro credits have a witty energy that makes you forgive that they’re tap dancing to pad the length.\nStill, as with the sillier “Dolls,” which also starred Qualley as a hot-to-trot queer queen, the film is so shaggy that it feels longer than it is. I finished both movies double-checking my watch in astonishment that they really were under an hour and a half.\nThe season looks strong, loaded with the kind of big Hollywood swings, smart indie alternatives and a fair amount of delicious-looking dumb, necessary in every summer diet.\nQualley’s Honey is a headstrong investigator who is so independent, she refuses to let her secretary (Gabby Beans) make her a cup of coffee. Frankly, she’s not that impressive as a private dick. Honey is only passingly curious why a client died before their first meeting and so predominately distracted by tangential side quests — her troubled teen niece (Talia Ryder), her dalliances with Plaza’s husky lady cop — that the resolution doesn’t involve much brilliant deduction. We know from the first scene that Honey needs to keep a close eye on a mysterious stranger named Cher (Lera Abova). Ultimately, the French femme fatale catches her attention for other reasons.\nAcross town, the corrupt Reverend Drew (Evans) is swaying his parishioners to sleep with him in the name of godly submission. “I want to see your bosoms jouncing during fellowship,” he commands a member of his flock. The preacher is one of the biggest sinners in Bakersfield, not merely because both he and Honey may as well be using the phone book as a checklist of conquests. A normal thriller would frame their dynamic as cat versus mouse. Here, it’s more like plague and vaccine. Honey is immune to his sales pitches for heterosexuality and holy salvation.\nHoney is a brazenly preposterous creation: a 21st century woman who insists on using a Rolodex, something that was headed toward extinction before Qualley was even born. Striding through brush in seamed stockings and high heels — and changing wardrobe multiple times a day just because she can — she’s the only character who never breaks a sweat (except in the bedroom).\nQualley keeps her cool from head to toe: eyebrows stern, line deliveries cucumber-crisp. Like a brassy classic dame, she says exactly what she means. When the local homicide officer, Marty (Charlie Day), makes a pass at her, she bluntly replies, “I like girls.” The guy doesn’t listen — he just keeps pestering her — which makes their dynamic play like some sort of clunky runner about how men are dense.\nMarty’s pursuit is that. But Honey’s retort is also how the real-life Cooke shot Coen down the first time her future husband asked her out on a date. More than anything, it’s evidence that “Honey Don’t!” primarily exists as the couple’s own affectionate in-joke. “Tricia’s queer and sweet and I’m straight and stupid,” Coen said last year in an interview with the Associated Press. Both describe their three-decades-plus marriage as “nontraditional.” Both also insist that they’re making these pulp flicks as a unit and don’t care who gets credit for what, claiming that Coen is cited as the director of “Honey Don’t!” simply because he’s the one in the DGA.\nWe’ve mapped out 27 of the best movie theaters in L.A., from the TCL Chinese and the New Beverly to the Alamo Drafthouse and which AMC reigns in Burbank.\nCoen is, of course, half of another twosome with his brother Joel that also enjoys defying labels. Their filmography zigzags between thrillers and comedies, lean exercises and awards heavyweights, never making the same movie twice. It’s as though their guiding compass is to stay ahead of audience expectations. The pair has been on a creative break since 2018’s “The Ballad of Buster Scruggs” and it’s been tempting to use their separate projects as an opportunity to examine who each sibling is as an individual. If you watched Joel Coen’s black-and-white “The Tragedy of Macbeth” in a double feature with “Honey Don’t!” you’d leave convinced that the elder Joel was the stylist and the younger Ethan the wit — that Joel wears a monocle and Ethan a grease-painted John Waters mustache.\nBut they might just be tricking us again. It’s just as valid to say the brains behind those two movies are William Shakespeare and Tricia Cooke, especially the latter as she seems to have had the stronger hand in shaping the two sexy Qualley capers we’ve seen thus far. (The third already has a title: “Go Beavers.”)\nAs sloppy as it is, there’s no denying that “Honey Don’t!” works as a noir with a pleasant, peppery flavor. Yet, there’s a snap missing in its rhythm, a sense that it doesn’t know when and how its gags should hit. When a playboy (Christian Antidormi) swaggers up to a bar and orders a shot of cinnamon schnapps, the line clangs like it landed better on the page. A few scenes later, a low-level drug dealer goes home to his Bolivian grandmother (Gloria Sandoval) who is such a caricature — bowler hat, lap full of dried chile peppers — that you suspect the character was designed to get more of a laugh. I did giggle when Honey visited her sister, a worn-out hausfrau named Heidi (Kristen Connolly), and kids kept popping out of the corners of her home one after another like rabbits from a hat.\nThe majority of the townsfolk that Honey encounters are such incurious mouth-breathers that the humor can feel hostile. The film’s worldview is that most people are, as Coen describes himself, straight and stupid. That’s worked out well enough for him. He’s won four Oscars and, more importantly, the ability to do whatever he darned well pleases.\n'Honey Don't!'\nRated: R, for strong sexual content, graphic nudity, some strong violence, and language\nRunning time: 1 hour, 29 minutes\nPlaying: In wide release Friday, Aug. 22"
    },
    {
      "url": "https://www.latimes.com/archives/la-xpm-2005-mar-06-ca-cinefile_6-story.html",
      "text": "Those paranoid feelings are back\n- Share via\nThroughout the 1970s, a growing fear gnawed at the hearts and uneasy minds of Americans, the suspicion that no one could be trusted -- not big business, not authority figures, not society in general. Especially not the government. And filmmakers -- both emerging and established -- often brilliantly captured the turbulent decade’s paranoia.\nFor the next month, the Los Angeles County Museum of Art’s film department is spotlighting the “Paranoia Films of the ‘70s.” The festival opens Friday with Francis Ford Coppola’s landmark 1974 thriller “The Conversation,” starring Gene Hackman as a secretive San Francisco surveillance expert who believes a young couple he was hired to spy on will be murdered; and Arthur Penn’s 1975 mystery thriller “Night Moves,” with Hackman as a former football player and private eye hired on what he believes is a standard missing-person case.\nOther films included in the retrospective are 1974’s “The Parallax View,” directed by Alan J. Pakula and starring Warren Beatty; Roman Polanski’s 1976 thriller “The Tenant”; Sydney Pollack’s 1975 chiller “Three Days of the Condor,” with Robert Redford; Steven Spielberg’s classic 1971 TV movie “Duel”; Martin Scorsese’s expressionistic 1976 drama “Taxi Driver”; and Sam Peckinpah’s 1971 revenge drama “Straw Dogs,” with Dustin Hoffman.\nChris Horak, curator of the Hollywood Entertainment Museum, traces the paranoia of the ‘70s to a convergence of factors in the previous decade. “It was more than just the John F. Kennedy assassination,” he says. “It was more than Vietnam and more than just the civil rights movement, which you have to take into consideration. During the civil rights movement, a lot of Americans saw government, state governments, breaking the law” and acting on agendas that ignored the best interests of the people. “It was shocking.”\nExtending boundaries\nAlso coming into play was the demise of the Hays Production Code, which had censored Hollywood since the 1930. By 1966, it was basically defunct, and veteran filmmakers found themselves in competition with a freewheeling new group of directors, including Coppola, Scorsese and Spielberg, who were willing and eager to expand the boundaries of film.\n“The filmmakers who are making the films in the series are either complete Hollywood outsiders, like Spielberg, or came from television or had been in the lower level of ‘B’ films, like Peckinpah, but by the late ‘60s and early ‘70s were coming into the fore,” says Horak.\n“This new generation is much more willing to question authority not only in the public form but also how films are to be made -- the films don’t conform to a classical Hollywood narrative in the same way.”\nAnd the actors who starred in these films -- Robert De Niro, Al Pacino and Hoffman -- didn’t look like classic matinee idols. “It was an era where the actors became a lot more like ordinary-looking people,” says LACMA film curator Ian Birnie. “Their own physical appearance and their interest in way-out psychology made it possible to create these kind of characters.”\nThough some of the protagonists in these paranoia films were decent guys who found themselves embroiled in some conspiracy, like Redford in “Condor” and Beatty in “Parallax View,” most were more like Hackman’s dark and unsympathetic Harry Caul in “The Conversation.”\n“He is not nominally somebody who would be the hero of a film,” says Oscar winner Walter Murch, who edited “The Conversation” as well as created the thriller’s landmark sound design. “That is precisely what Francis was interested in -- taking somebody who in a normal murder mystery would have a tangential role and switching lenses and looking at this character exclusively.”\nWhen a film is about an unusual person who has an unusual occupation, says Murch, “and it is told completely from their point of view, you begin, if you stick with the film, to see and in this case hear the world the way this person hears it. Because this person is a professional sound person you begin to become one too. I think that is why people pick up that the sound is so important and critical in the film.”\nThese films, says Birnie, “kind of mark the beginning of our modern world. Our lives kind of got divided into two: Our childhood was lived in a kind of world that wasn’t that much different from ‘Meet Me in St. Louis’ and our adulthood was totally different.”\n*\n(BEGIN TEXT OF INFOBOX)\nParanoia Films of the ‘70s\nWhere: Los Angeles County Museum of Art, Leo S. Bing Theatre, 5905 Wilshire Blvd.\nWhen: 7:30 p.m. Fridays and Saturdays through April 2\nPrice: $6 to $9.\nContact: (323) 857-6000\nSchedule\nFriday: “The Conversation,” “Night Moves”\nSaturday: “The Parallax View,” “Who’ll Stop the Rain?”\nMarch 18: “The Tenant,” “Images”\nMarch 19: “Three Days of the Condor,” “Duel”\nMarch 25: “Klute,” “Cruising”\nMarch 26: “Straw Dogs,” “Taxi Driver”\nApril 1: “Invasion of the Body Snatchers,” “Assault on Precinct 13”\nApril 2: “Blow Out,” “Cutter’s Way”"
    }
  ],
  "argos_summary": "The piece offers a mixed‑bag of film coverage, opening with a review of David Mackenzie’s thriller \"Relay,\" which follows a tech‑savvy fixer who helps a whistleblower evade corporate hunters through covert communication. It then shifts to a behind‑the‑scenes look at Cate Blanchett and Michael Fassbender’s reunion over their shared work on \"Black Bag,\" followed by a critical take on the Hulu series itself. Additional reviews cover the indie drama \"Lurker,\" the Coen‑Cooper comedy‑thriller \"Honey Don’t!\", and a retrospective of 1970s paranoia films at LACMA, underscoring the era’s distrust of authority and its influence on modern cinema.\"}",
  "argos_id": "JHI71JI5N"
}