{
  "url": "https://fortune.com/2025/08/23/hall-of-fame-jockey-ron-turcotte-obituary-secretariat/",
  "authorsByline": "The Associated Press, Stephen Whyno",
  "articleId": "1385c1c4059e4396ac3eee0fd1395472",
  "source": {
    "domain": "fortune.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-1389868189-e1755949304664.jpg?resize=1200,600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T11:43:49+00:00",
  "addDate": "2025-08-23T11:53:13.369998+00:00",
  "refreshDate": "2025-08-23T11:53:13.370000+00:00",
  "score": 1.0,
  "title": "Hall of fame jockey Ron Turcotte, the man who rode Secretariat to the Triple Crown, dies at 84",
  "description": "“The world may remember Ron as the famous jockey of Secretariat, but to us he was a wonderful husband, a loving father, grandfather, and a great horseman.” the family said.",
  "content": "Hall of Fame jockey Ron Turcotte, who rode Secretariat to the Triple Crown in 1973, has died. He was 84.\n\nTurcotte’s family said through his longtime business partner and friend Leonard Lusky that the Canada-born jockey died of natural causes Friday at his home in Drummond, New Brunswick.\n\nHe won the Kentucky Derby, Preakness and Belmont Stakes twice each, most notably sweeping the three with Secretariat to end horse racing’s Triple Crown drought that dated to Citation in 1948.\n\n“Ron was a great jockey and an inspiration to so many, both within and outside the racing world,” Lusky said. “While he reached the pinnacle of success in his vocation, it was his abundance of faith, courage, and kindness that was the true measure of his greatness.”\n\nSecretariat’s record time of 2:24 in the Belmont, winning by 31 lengths at a 1 1/2-mile distance, still stands 52 years later.\n\n“I still had a lot of horse when I passed the wire,” Turcotte said in 2023, nearly 50 years to the day since riding Secretariat in the Belmont. “He was not tired. … It was amazing.”\n\nTurcotte won 3,032 races over a nearly two-decade career that ended in 1978 when he fell off a horse early in a race and suffered injuries that made him paraplegic. Permanently Disabled Jockeys Fund chairman William J. Punk Jr. called Turcotte one of the sport’s greatest champions and ambassadors and praised him for his advocacy and efforts to help fellow fallen riders.\n\n“While his courage as a jockey was on full display to a nation of adoring fans during that electrifying time, it was after he faced a life altering injury that we learned about the true character of Ron Turcotte,” New York Racing Association president and CEO David O’Rourke said. “By devoting himself to supporting fellow jockeys struggling through similar injuries, Ron Turcotte built a legacy defined by kindness and compassion.”\n\nTurcotte was inducted into the National Museum of Racing Hall of Fame in 1979.\n\n“The world may remember Ron as the famous jockey of Secretariat, but to us he was a wonderful husband, a loving father, grandfather, and a great horseman.” the Turcotte family said in a statement through Lusky.\n\nTurcotte was born in Drummond on July 22, 1941, as one of 12 children. He quit school to work as a lumberjack before moving to Toronto to get involved in horse racing, first as a hotwalker and then a jockey, becoming the leading rider at Woodbine Racetrack before rising to the Triple Crown level.\n\nWoodbine chairman Jim Lawson said Turcotte was “a true Canadian icon whose impact on horse racing is immeasurable.”\n\n“Ron carried himself with humility, strength and dignity,” Lawson said. “His legacy in racing, both here at Woodbine and around the world, will live forever.”\n\nTurcotte won the Preakness in 1965 aboard Tom Rolfe and the Derby and Belmont in 1972 with Riva Ridge. But it was his time with Secretariat that made Turcotte a household name in racing, and he called it “love at first ride.”\n\n“He was the type of horse that you’ll never see again,” Turcotte said two years ago. “He was doing something that you’ve never seen before and will probably never see again.”\n\nTurcotte was the last surviving member of Secretariat’s team: The colt died in 1989, groom Eddie Sweat in 1998, trainer Lucien Laurin in 2000, owner Penny Chenery in 2017 and exercise rider Charlie Davis in 2018.\n\n“Ron Turcotte was an icon and will forever be fondly remembered as the trusted partner of legendary Kentucky Derby and Triple Crown winner Secretariat, arguably the most popular thoroughbred in history,” Churchill Downs Racetrack president Mike Anderson said. “Ron’s many accomplishments on the racetrack and his deep passion for horse racing brought countless fans to the sport. He will be greatly missed.”",
  "medium": "Article",
  "links": [
    "https://fortune.com/company/brunswick/",
    "https://apnews.com/article/secretariat-ron-turcotte-triple-crown-50th-anniversary-6efaae78b2f86ff09cca3e55a1bb8c9c",
    "https://www.hotsr.com/news/2017/sep/18/chenery-owner-of-secretariat-dies-20170/",
    "https://apnews.com/article/kentucky-derby-secretariat-50th-anniversary-ee20624bf24be97d8c0de4d87c560c8b",
    "https://www.postandcourier.com/news/sc-groomer-shared-fame-with-kentucky-derby-winner-secretariat-but-he-died-penniless/article_3b8fac9c-6b6d-11e9-872b-27534d40f55c.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ron Turcotte",
      "weight": 0.11129055
    },
    {
      "name": "Turcotte",
      "weight": 0.09413691
    },
    {
      "name": "horse racing",
      "weight": 0.09020938
    },
    {
      "name": "fellow jockeys",
      "weight": 0.07768167
    },
    {
      "name": "Ron",
      "weight": 0.07121818
    },
    {
      "name": "Triple Crown",
      "weight": 0.07100695
    },
    {
      "name": "horse",
      "weight": 0.07013496
    },
    {
      "name": "Secretariat",
      "weight": 0.06937205
    },
    {
      "name": "racing",
      "weight": 0.06508483
    },
    {
      "name": "horse racing’s Triple Crown drought",
      "weight": 0.06308383
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.8671875
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.61376953125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.46630859375
    },
    {
      "name": "/Sports/Animal Sports/Equestrian",
      "score": 0.427978515625
    }
  ],
  "sentiment": {
    "positive": 0.37312898,
    "negative": 0.293745,
    "neutral": 0.333126
  },
  "summary": "Hall of Fame jockey Ron Turcotte, known for his role in the 1973 Triple Crown, has died at the age of 84. His family confirmed that he passed away from natural causes at his home in Drummond, New Brunswick. He won the Kentucky Derby, Preakness and Belmont Stakes twice with Secretariat, ending horse racing's Triple Crown drought. His record time of 2:24 in the Belmont still stands 52 years after his ride. Despite a nearly two-decade career that ended in 1978 when he fell off a horse early in a race and sustained injuries that made him paraplegic, he was praised for his dedication to helping fellow fallen riders.",
  "shortSummary": "Hall of Fame jockey Ron Turcotte, who rode Secretariat to the Triple Crown in 1973, has died at 84; he was an icon in horse racing.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4e0626f5f1be4810903b98a0706342b9",
  "places": [
    {
      "osmId": "983253028",
      "city": "Saint John",
      "county": "Saint John County",
      "state": "New Brunswick",
      "country": "Canada",
      "countryCode": "ca",
      "neighbourhood": "Belmont",
      "coordinates": {
        "lat": 45.28644615,
        "lon": -66.15926549391101
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/kentucky-derby-secretariat-50th-anniversary-ee20624bf24be97d8c0de4d87c560c8b",
      "text": "Triple Crown winner Secretariat still dominant 50 years on\nTriple Crown winner Secretariat still dominant 50 years on\nSecretariat had an unusually large heart, an engine that propelled him to a Triple Crown sweep 50 years ago. The colt nicknamed Big Red remains the heartbeat of an industry that has yet to see such dominance on and off the track replicated.\nHis name recognition, even among those who don’t follow sports, is still strong 34 years after his death, and eight of his descendants will run in the Kentucky Derby on Saturday, including early 3-1 favorite Forte.\n“He’s still the bar to me,” said Bob Baffert, who trained Triple Crown winners American Pharoah in 2015 and Justify in 2018. “I still ask strangers, ‘Who’s the best horse you ever heard of?’ and I’m hoping they say Pharoah. They say Secretariat.”\nSecretariat won the Derby, Preakness and Belmont in record times that still stand, and ended a 25-year Triple Crown drought.\n“It says he was beautifully prepared for each of those races, and his competition was not as good as he was,” said Dave Johnson, track announcer for the 1973 Belmont in which Secretariat won by an astounding 31 lengths. “He was a special animal.”\nBig Red’s path to Triple Crown glory began in the Derby. He was the first horse to cover the 1 1/4-mile distance in under 2 minutes with a time of 1:59.40. It would not be repeated until Monarchos clocked 1:59.97 in 2001.\nTwo weeks later, Secretariat broke last out of the starting gate in the Preakness. Jockey Ron Turcotte made a split-second decision in the first turn to swing Big Red to the outside in a rush to the front. They won by 2 1/2 lengths over Sham, who had also finished second in the Derby.\n“I could make five, six moves with him in a race. A normal horse you could make one or two,” Turcotte told The Associated Press by phone from his home in Canada. “Down the lane I never asked him to run. He just galloped to the wire very easily.”\nThe Pimlico track’s timing device showed Secretariat clocked 1:55 for 1 3/16 miles, but it had malfunctioned. It wasn’t until 2012, at owner Penny Chenery’s request, that the Maryland Racing Commission reviewed video and revised his time to 1:53, another track record.\nSecretariat’s popularity exploded in the three weeks leading up to the Belmont. He became a pop culture phenomenon, appearing on the covers of Time and Newsweek while helping distract a nation dragged down by Watergate and the Vietnam War.\n“He had just about everything,” Turcotte said. “He was a good-looking horse, he was a very strong horse, had a long stride that covered a lot of ground, a very cooperative and generous horse. He would give you whatever you asked of him.”\nIn the Belmont, Secretariat was the 1-10 favorite in the grueling 1 1/2-mile race against just four rivals, including Sham who was back for another try.\nSecretariat went to the early lead along the rail and was soon challenged by Sham, ridden by Laffit Pincay Jr. The two horses were even through a half-mile at a blistering pace in what became a match race with the rest of the field about 10 lengths behind.\nSham poked his head in front around the turn, but soon weakened. Secretariat began distancing himself from the field. He ran the mile in 1:34.20 and reeled off 1 1/4 miles in 1:59, faster than his record time in the Derby.\nBig Red completed the last quarter in a scant 25 seconds. He finished in 2:24, his third record in as many races.\n“The Belmont was such a magnificent display of speed and stamina,” recalled Johnson, who is now 81.\nSham was injured and finished last. He never raced again.\nSecretariat’s legend has only endured. He had his own U.S. stamp and was the subject of a 2010 Disney movie.\n“He was a beautiful horse,” said Pincay, now 76 and retired since 2003. “You never saw him do anything stupid. Some horses jump and down and get nervous. He was very businesslike.”\nSecretariat’s heart — which a 1989 necropsy found weighed 22 pounds, compared to 8 1/2 pounds for the average horse — was the basis for an Audi car commercial in 2017.\n“He could turn air to oxygen much faster than another horse could,” Turcotte said.\nAnd on the 50th anniversary of his history-making triumph, Secretariat is being given another round of celebration. The Kentucky Derby Museum is featuring “Secretariat: America’s Horse,” a new exhibit that uses technology to show how his physique helped make him such a standout. His three Triple Crown victories can be viewed on a 10-foot wall.\nThe National Museum of Racing and Hall of Fame is taking a traveling exhibit to the Triple Crown cities of Louisville, Kentucky, Baltimore and New York — as well as Secretariat’s birth state of Virginia. The exhibit features his Triple Crown trophies and the story of the people who guided him.\nTurcotte is the lone remaining member of Secretariat’s team. Chenery, his owner, died in 2017 at age 95; trainer Lucien Laurin died in 2000; groom Eddie Sweat died in 1998; and exercise rider Charlie Davis died in 2018. Bill Nack, the former Sports Illustrated writer who closely chronicled Big Red’s career, also died in 2018.\nTurcotte, 81, became a paraplegic after a riding accident in 1978. He travels less these days while caring for his wife in his tiny hometown of Drummond, New Brunswick, where there’s a statue of him and Secretariat crossing the finish line.\n“There’s never been a horse like him,” Turcotte said, “and I doubt there will be another one.”\nIn 2015, on his way to the Belmont winner’s circle for American Pharoah in 2015, Baffert shared a celebratory embrace with Chenery.\n“I whispered in her ear, ‘He’s no Secretariat, but he’s as close as I’ll ever get,’” the Hall of Fame trainer said.\n“You’re damn right,” she replied.\n___\nAP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sport"
    },
    {
      "url": "https://apnews.com/article/secretariat-ron-turcotte-triple-crown-50th-anniversary-6efaae78b2f86ff09cca3e55a1bb8c9c",
      "text": "Secretariat’s jockey Ron Turcotte remembers Triple Crown winner who ‘could fly’ on 50th anniversary\nSecretariat’s jockey Ron Turcotte remembers Triple Crown winner who ‘could fly’ on 50th anniversary\nFrom the tiny village of Drummond, New Brunswick, Ron Turcotte rose to the top of horse racing, riding Secretariat to a sweep of the Kentucky Derby, Preakness and Belmont in 1973. Their triumphs ended a 25-year Triple Crown drought. Now 81, Turcotte is the last surviving member of Secretariat’s team as he marks the 50th anniversary of their feat with the Belmont Stakes on Saturday.\nHere are some stories from his life and career, based on a recent interview with The Associated Press:\nFROM LUMBERJACK TO JOCKEY\nTurcotte is one of 12 children, including five brothers who also became jockeys. He grew up speaking French in Drummond, outside Grand Falls.\nHe left school at age 14 to work with his father as a lumberjack. He was slight in stature like his dad, who had him work with the draft horses that hauled the logs instead of doing the more dangerous work in the forest.\nAt 18, Turcotte and a friend headed to Toronto with $50 each in their pockets. He was going to join the roofing trade like his brother, but local carpenters were on strike, so they sought any work they could find.\nThe friends discovered a restaurant that fed them in exchange for washing dishes. To pay for a room, they picked nightcrawlers until the wee hours.\n“We got tired and discouraged,” Turcotte recalled.\nOn the first Saturday in May 1960, the friends emerged from their attic quarters and found a crowd around the television watching the Kentucky Derby. They were cheering on Victoria Park, which finished third as the first Canadian horse to place in a Triple Crown race.\nTurcotte asked a man what the Derby was. “The biggest horse race there is in North America,” he replied.\nThe man asked if Turcotte had found work yet. Told no, he suggested Turcotte try the local racetrack, Woodbine. The teenager made his way there, but got turned away by a guard for not having an entry pass.\nTurcotte was told to try the newer Woodbine track located on the outskirts of Toronto. He hitchhiked there the next day. A trainer driving by picked him up and they were waved through the gate by the guard.\nMAKING CONNECTIONS\nTurcotte made an important connection in 1960 when he met E.P. Taylor, a prominent owner, breeder and businessman regarded as a major force in the development of Canadian racing. He went to Taylor’s farm to learn about thoroughbreds.\n“He handed me the shank and said, ‘Keep turning left,’” Turcotte said of cooling out horses after workouts. “I kept turning left for about 30 minutes.”\nWhat Taylor had yet to discover was that Turcotte had spent five years cutting lumber and driving a team of draft horses. He also knew how to shoe horses.\n“I had never sat in a saddle before,” Turcotte said.\nTo earn a living in the bitter Canadian winters, Turcotte galloped horses on the farm to keep them fit.\nBy 1962, Turcotte had won his first race. He was off and riding on his way to 3,032 career victories.\nCREATING FAMILY\nTurcotte married his childhood sweetheart, Gaetane, in 1964. The couple has four daughters: Tina, Anne, Lynn and Tammy. After his career ended prematurely, he returned to his hometown to live on his farm, where each of his daughters had their own horse.\nBEFORE SECRETARIAT\nIn 1971, Turcotte took note of a colt named Riva Ridge. The horse was bumped in his first start and finished well back. He won his next two races before losing again.\nTurcotte stopped by trainer Lucien Laurin’s barn and told him, “You have the best 2-year-old in North America.”\nLaurin changed jockeys and hired Turcotte for Riva Ridge’s next start. They won despite the colt bolting to the outside after leaving the starting gate.\nTurcotte realized the colt was afraid of close quarters after what happened in his first race. He asked Laurin to give him a month with Riva Ridge away from racing, believing he could help the colt overcome his fear.\n“He didn’t want to give me 30 days but I insisted,” Turcotte said. “I needed to re-school him.”\nTurcotte’s instincts proved correct. Riva Ridge won four straight stakes races in the fall of 1971 and earned honors as that year’s 2-year-old champion. They teamed to win the Kentucky Derby and Belmont Stakes the following year.\nMEETING THE QUEEN\nTurcotte met Queen Elizabeth II in 1970 after riding Fanfreluche to victory in the Manitoba Derby during the province’s 100th birthday. She presented him with the winner’s plate.\nThe mare was sired by Northern Dancer, the first Canadian-bred horse to win the Kentucky Derby in 1964 who went on to become one of the sport’s greatest sires.\n“She was a Northern Dancer fan,” Turcotte said of the horse-loving queen, “so she had a lot of questions about Northern Dancer.”\nFive years earlier, he had met the Queen Mother.\n“My dad and mother were both very impressed,” he said.\nMEETING SECRETARIAT\nTurcotte stopped by the Laurin’s barn one day to visit Riva Ridge.\nTwo stalls down, a chestnut colt stuck his head out. “Who’s that pretty boy you have here?” Turcotte asked.\nLaurin replied, “He’s too good-looking to be a racehorse.”\nStill, the trainer told Turcotte to get on Secretariat and give his opinion.\n“It was love at first sight and first ride,” Turcotte said. “He was so nice. He was like an older horse, he was quiet, very intelligent.”\nTurcotte was soon getting on Secretariat regularly, teaching him to work in the mornings, increase his speed and learn how to break from the starting gate. The jockey was soon calling his new friend “Big Red,” a nickname that has stuck to this day.\n“You’d teach him something one day and he’d come back the next day and he’d do it,” Turcotte said. “Not all horses are that intelligent.”\nA MAN AND HIS HORSE\nDespite a singular focus on the racetrack, Turcotte described Secretariat as a “very kind and loving horse.”\nStill, the colt sometimes had a mind of his own.\nOne morning, Secretariat suddenly reared up and tossed Turcotte over his head. The jockey landed on his feet, unhurt.\n“He looked at me like, ‘What are you doing there?’” Turcotte said. “I walked up to him, grabbed the reins and hopped on him again.”\nThe jockey would visit Secretariat and also greet other horses in the barn.\n“He was a little jealous,” Turcotte said. “If I talked to another horse in the next stall, he’d reach over and grab my jacket and pull me back to him.”\nA special bond existed between man and horse.\n“One time he pinched me a little and I said, ‘Ouch, you hurt me.’ He put his head down like he was so sad,” Turcotte said. “I said to him, ‘It’s OK, you didn’t hurt me.’ His head popped up and his ears were pricked. He was a ham.”\nTAKING A FAMOUS PEEK\nAfter winning the Kentucky Derby and Preakness, Secretariat put away the field early in the 1973 Belmont Stakes, using his long, loping strides to widen the gap to 20 lengths.\nAt that point, the race was against the clock.\nWith 70 yards remaining in the 1 1/2-mile race, Turcotte looked to his left at the infield teletimer.\n“I knew he was setting records all the way down the lane,” he said. “When you’re alone like that, I could hear the announcer very well.”\nSecretariat won by an astonishing 31 lengths and his final time of 2:24 remains a record 50 years later.\nA CAREER CUT SHORT\nTurcotte’s riding career was cut short on July 13, 1978. He fell from his horse, Flag of Leyte Gulf, in his last race of the day at Belmont Park, the site of his Triple Crown triumph. A horse drifted toward the outside, crowding another. Sensing the danger, Turcotte stood in the saddle and yelled to the riders inside of him. His horse clipped heels and stumbled badly, tossing Turcotte over its head.\nHe wasn’t trampled by any horses, but knew he had broken his neck when he couldn’t feel his legs. Later that year, Turcotte sued several parties but the suit was dismissed in 1986 by New York’s highest court, which cited the inherent risks taken by jockeys.\nTurcotte spent many years making appearances at racetracks to raise money and awareness on behalf of the Permanently Disabled Jockeys Fund, which provides help to his fellow injured riders.\nIn 2015, he broke both legs when the van he was driving flipped after hitting a snowbank in New Brunswick. He requested one blue cast and one white cast, the same colors as Secretariat’s silks. Turcotte and Secretariat are immortalized with a bronze statue in his hometown.\nLONE SURVIVOR\nNow 81, Turcotte is the last surviving member of Secretariat’s team. The irony isn’t lost on him.\n“I thought I’d be the first one to go,” he said, having been a paraplegic since his accident.\nOwner Penny Chenery died in 2017 at age 95. Laurin died in 2000.\n“He always told me, ’Use your better judgement,’” Turcotte said. “He relied on me for a lot of things. He didn’t always listen.”\nGroom Eddie Sweat died in 1998 and exercise rider Charlie Davis followed in 2018.\n“Charlie and Eddie were very good horsemen,” he said. “Sweat was beautiful with horses.”\nSecretariat died in 1989. He was euthanized after developing laminitis, a painful and debilitating hoof disease.\n“When it came to running, he could fly,” Turcotte said. “He was everything. Those memories never leave you.”\n___\nAP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    },
    {
      "url": "https://www.postandcourier.com/news/sc-groomer-shared-fame-with-kentucky-derby-winner-secretariat-but-he-died-penniless/article_3b8fac9c-6b6d-11e9-872b-27534d40f55c.html",
      "text": "Before the Belmont Stakes, the race that would make Secretariat a household name, Eddie Sweat looked at the horse and whispered: “You know what I want you to do.”\nSweat’s youngest sister, Geraldine Hollman, overheard the whisper. She recalled that the 3-year-old horse shook his head back at the Holly Hill-born groomer and pressed his hoof into the ground.\n“The last words he said to him before the race were ‘Go get him,’” Hollman said. “That horse understood exactly what he said. He gave that horse a kiss and then he took off like a jet.”\nSecretariat, known by his nickname \"Big Red,\" won the Belmont Stakes in 31 lengths, the fastest 1½ miles in thoroughbred racing history. He won in Louisville at the Kentucky Derby, he won in Maryland at the Preakness Stakes.\nIn 1973, he made headlines for being the first Triple Crown winner in 25 years. The 145th Kentucky Derby is Saturday in Louisville.\nEveryone knows about Secretariat, but few know about Sweat — the horse’s best friend. The groomer fed Secretariat, bathed him and loved him like a son.\nHis legacy was honored in 2006 when a 1,500-pound statue of Secretariat was unveiled at the Kentucky Horse Park in Lexington. In the life-size sculpture, Sweat is leading Secretariat to the winner's circle at the Kentucky Derby with his jockey, Ron Turcotte, on the horse's back.\n\"He was a really good man,\" Turcotte, Secretariat's jockey, told The Post and Courier.\nOne of the last times he saw the groomer was at the statue's dedication ceremony.\n\"He was without a doubt one of the best groomers I worked with,\" Turcotte said. \"He really deserved it.\"\nBut despite having his likeness cast in bronze, Sweat’s family said the groomer died virtually penniless.\n\"Big Red's\" career earnings were more than $1.3 million, but Sweat had to have a charitable organization pay for his funeral.\n“All those people who work on the backside, they never get ahead,” said Bill Doolittle, a horse racing historian and author of several books about the Kentucky Derby. “They live a poor life, they make low wages and they don’t have many prospects for working in another place. It’s not a good reputation for the sport.”\nA vocation\nSweat called Holly Hill, about an hour northwest of Charleston, home. His parents Mary and David Sweat were tenant farmers. Sweat, one of nine children, helped pick crops.\nBut, as a teenager, he would go to look at horses at U.S. Racing Hall of Fame trainer Lucien Laurin’s farm in town. One day, after watching Sweat looking at the horses through the fence line, Laurin offered him a job.\nHollman said her brother didn’t finish school. He left Holly Hill and traveled the horse circuit at a young age. Sweat ended up in New York City, and Hollman grew up thinking she didn’t have an older brother for the first part of her life.\nDoolittle said many groomers, like Sweat, used racing as a way to escape poverty or to fulfill their wanderlust.\n“It was a vocation, a way to get a good life job and get away from whatever their circumstances were,” Doolittle said. “And those guys ended up in New York City.”\nWith his connection to Laurin, Sweat had access to some of the best horses in the field. Secretariat, owned by Penny Chenery, was one of them.\n\"He really was in tune with the horses,” said Leonard Lusky, the president of Secretariat.com and manager of Big Red's merchandising rights for the Chenery family. “They entrusted him with the best horses in the stable. Eddie knew how to handle Secretariat without manhandling him. I think Secretariat adored Eddie.”\nHorse racing has a hierarchy. The owner talks to the trainer, the trainer talks to the jockey. The manual labor, often, speaks directly to the trainer. But Sweat would go out of his way to talk to Turcotte and keep him updated on the horse.\n\"He'd always keep me in the loop,\" Turcotte said. \"He'd tell me if he ate his oats and how his health was. Secretariat could be playful, but Eddie always knew how to handle him.\"\nAs Secretariat's star was rising, Eddie Sweat came back home to Orangeburg County for a visit.\n“One day, there was no school, and this horse truck was coming up and it stopped on the side of the road,” Hollman said. “I couldn’t understand. My mom said ‘Thank you, Lord. This is your brother.’ She started to cry, and she hadn’t seen him in so many years.”\nHe wanted his baby sister to see \"Big Red\" run.\nLosing touch\nSeth Hancock of Claiborne Farm where Secretariat would eventually retire, famously told ESPN the horse transcended reality.\n“You want to know who Secretariat is in human terms?” he told ESPN. “Just imagine the greatest athlete in the world. The greatest. Now make him six-foot-three, the perfect height. Make him real intelligent and kind. And on top of that, make him the best-lookin’ guy ever to come down the pike. He was all those things as a horse. He isn’t even a horse anymore. He’s a legend.”\nWhen Secretariat became famous, so did everyone associated with the horse.\n“Before Secretariat, people around the horse didn’t become immediately famous, as well,” Doolittle said. “There was a great interest in finding out about anyone who was close with the horse. And his name was Eddie Sweat, who couldn’t love it? If you were an editor, you needed his name in the cutline or any quotes from (him).”\nHe was constantly photographed with the horse, often wearing his signature plaid, bell-bottom pants and a bright blazer. He also had no shortage of words about his love for Secretariat and appeared on the covers of Ebony and Jet magazine.\nIn a profile in Sports Illustrated, he recalled the first time he met Secretariat.\n\"People might call me crazy, but that's the way it is,\" Sweat told Sports Illustrated. \"I've been on the racetrack 34 years, and I ain't never gonna give up. I think they'll take me to my grave with a pitchfork in my hand and a rub rag in my back pocket.\"\nSweat made his home in Queens, N.Y., and he worked for Laurin's son Roger for the remainder of his career.\nHe would often send money home, Hollman said, but he never saved much. He lost most of his Secretariat memorabilia in a 1991 fire that wrecked his home in Queens, according to The Baltimore Sun.\nHollman paid him a visit in New York. Sweat was very sick. He told his baby sister that he wanted her to pay for an airline ticket back to South Carolina.\nA couple weeks later, she got a phone call. Sweat had some instructions.\nHe wanted to buried at Rock Hill AME Church Cemetery in Orangeburg County with the rest of his family. He wanted a blue casket. He wanted to wear a blue double-breasted suit and he wanted his shirt and tie to match. And despite being photographed wearing dozens of colorful hats throughout his career, he didn't want one to be left on his head.\nSweat died April 17, 1998, of leukemia at age 58. He was buried just as his baby sister was instructed. His family couldn't afford the expenses, so the Jockey Club Foundation, which helps needy people in racing, paid for the funeral, the Sun reported. Hollman also took on the expenses.\nNo one from Secretariat's inner circle was present. Hollman said there wasn't any financial or emotional support from the Chenery family.\n\"I don't know why those people didn't treat him better than they did,\" Hollman said. \"I'm very angry with that. They didn't even send a flower, none of them showed up.\"\n'He’s the vigilant one'\nLusky, who speaks on behalf of the family since their passing, said the owners never knew about Sweat's situation and didn't know about his death until after the funeral. They lost touch with him after Secretariat's rise to fame.\nLusky said he never knew what Sweat's pay was but suspected that he struggled with substance abuse. Hollman said her brother never used drugs but did drink alcohol.\n“It's true Eddie died relatively poor,” Lusky said. “While he continued to work ... they all really lost touch with each other. They all sort of scattered apart. It was devastating when the family finally found out about Eddie’s death.”\nThere is a modest grave in Holly Hill — a silver plaque that states his name, his date of birth and the day he died. Lusky said the owners always loved Sweat, and said his statue in Lexington is an example of that.\n“(Secretariat's owner) wanted to make sure Eddie was a part of that statue,” Lusky said. “He’s the person who spent the most time with the horse. He’s the vigilant one who stayed with him, protected him. Just like a mother with a newborn baby.”\nSweat was portrayed in the 2010 Disney movie \"Secretariat\" by Nelsan Ellis. He wore Sweat's signature bright clothes and fashionable hats. Hollman said she couldn't finish the movie without crying.\n\"He just managed to make ends meet with his family,\" Hollman said. \"But it didn't matter for him. He just wanted to be with his horses.\""
    },
    {
      "url": "https://fortune.com/company/brunswick/",
      "text": "SEARCH\nHome\nNews\nFortune 500\nFortune Global 500\nFortune 500 Europe\nFortune China 500\nFortune SEA 500\nGreat Place to Work\nTech\nAI\nInnovation\nCybersecurity\nFinance\nPersonal Finance\nReal Estate\nEconomy\nInvesting\nBanking\nCrypto\nLeadership\nSuccess\nFuture of Work\nWorkplace Culture\nC-Suite\nCEO Initiative\nLifestyle\nArts & Entertainment\nTravel & Leisure\nWell\nEducation\nRankings\nAnalytics\nMultimedia\nLive Media\nMagazine\nNewsletters\nVideo\nPodcasts\nHome\nNews\nFORTUNE 500\nFORTUNE 500\nFORTUNE SEA 500\nFortune 500 Europe\nFortune Global 500\nFortune China 500\nGreat Place to Work\nTech\nTech\nAI\nInnovation\nCybersecurity\nFinance\nFinance\nPersonal Finance\nReal Estate\nEconomy\nBanking\nInvesting\nCrypto\nLeadership\nLeadership\nSuccess\nFuture of Work\nWorkplace Culture\nC-Suite\nCEO Initiative\nLifestyle\nLifestyle\nArts & Entertainment\nTravel & Leisure\nWell\nEducation\nRankings\nRankings\nAnalytics\nMultimedia\nMultimedia\nLive Media\nMagazine\nNewsletters\nVideo\nPodcasts\nAsia\nEurope\nAnalytics\nCompanies\nCompanies\nBrunswick\nBrunswick\nBrunswick in Fortune Rankings\nCompany Information\nKey Financials (last Fiscal Year)\nProfit Ratios\nEarnings Per Share (last Fiscal Year)\nTotal Return\nCompany Information\nCompany Information\nKey Financials (last Fiscal Year)\nProfit Ratios\nEarnings Per Share (last Fiscal Year)\nTotal Return\nBrunswick stock chart\nVideos"
    }
  ],
  "argos_summary": "Hall of Fame jockey Ron Turcotte, who rode Secretariat to the 1973 Triple Crown, died at 84 after a life of racing success and advocacy for injured riders. Turcotte’s career included 3,032 wins and a career-ending injury that left him paraplegic, yet he remained a champion ambassador for fellow jockeys. He was the last surviving member of Secretariat’s team, and his legacy is celebrated alongside the enduring legend of the horse. The article highlights Turcotte’s humble beginnings, his partnership with Secretariat, and his post‑career humanitarian work.",
  "argos_id": "JL9LBEHCG"
}