{
  "url": "https://www.foxnews.com/entertainment/jelly-rolls-wife-body-slams-him-playful-tiktok-video-after-singer-sheds-200-pounds",
  "authorsByline": "Lori Bashian",
  "articleId": "aa76e4dc06c44cd39abee26d4c365865",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/jelly-role-bunnie-xo-on-stage.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T10:00:50-04:00",
  "addDate": "2025-08-23T14:09:55.264896+00:00",
  "refreshDate": "2025-08-23T14:09:55.264897+00:00",
  "score": 1.0,
  "title": "Jelly Roll's wife body slams him in playful TikTok video after singer sheds 200 pounds",
  "description": "Following Jelly Roll's 200 pound weight-loss transformation, his wife Bunnie Xo posted a video on TikTok, checking to see if he's still her \"squish.\"",
  "content": "Jelly Roll's wife is making sure her husband hasn't changed too much.In a recent TikTok video, the singer's wife can be seen playfully body slamming him as he leans against a wall, before giving him a kiss on the cheek and falling into a sweet embrace. As the video goes on, Jelly Roll playfully squeezes Bunnie's backside and the two share a kiss.\"When you have to check and make sure he's still your squish after all the weight loss,\" Bunnie wrote over the video.The couple were both dressed in black from head to toe, with Jelly Roll accessorizing with a black baseball cap. Bunnie styled her long blonde hair in braids and had a black and white flannel shirt tied around her waist.JELLY ROLL’S WIFE GRABS COUNTRY STAR’S ATTENTION WITH RISQUÉ MOVE AT HOCKEY RINK\"Bestie #jellyandbunnie,\" Bunnie captioned the post.The \"Save Me\" singer began his weight-loss journey in December 2022. He told Fox News Digital at the 2023 CMA Awards that he was \"starting to find a will to live\" through his health journey, explaining he doesn't have a specific goal, and is only focused on continuing \"to keep doing the right thing and feeling better.\"Just a year later, he made his first red carpet appearance since losing 100 pounds at the 2024 CMA Awards, which he attended with his wife. He told Fox News Digital at the time that he lost \"like 50 to 70-something pounds\" while training for a 5K, which he completed successfully.\"I couldn't walk a mile when I started trying to do this back in January,\" he told Entertainment Tonight at the time. \"So, the fact that we got three-point-whatever it was done today, I felt really, really good about it.\"When speaking with People in November 2024, the singer explained his struggles with his health journey started with his \"food addiction.\"\"The battle was with the food addiction, changing the way I’ve looked at food for the last 39 years,\" he told People magazine. \"I’ve never had a healthy relationship with food, so that was the hard part. But once you get into that discipline and commitment, it’s like an avalanche. Once that little snowball started rolling, it was on its way.\"He also spoke to the outlet about how being on tour has helped him in his weight-loss and health journey, explaining he and his crew are committed to a healthy lifestyle and spend their free time playing basketball and choosing better food options.While reflecting on his past, he couldn't help but compare the life he once lived which \"revolved around alcohol and drugs,\" and his life on tour, explaining the \"culture is around good eating and around exercising and doing emotional check-ins.\"LIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWSIn April 2025, Jelly Roll shared his progress during an appearance on the \"Big Night Aht\" live show, telling host Pat McAfee, he lost nearly 200 pounds and was working on losing more.\"I started at 540 pounds. I'm 357 pounds this morning, baby,\" he told the crowd. \"I'm going to lose another 100 pounds and go skydiving with my wife!\" The Grammy Award-nominated singer was then seen in a video shared by the Tennessee Titans on X earlier this month, speaking to the team at their training camp. During the motivational speech, he shared he \"lost 200 pounds\" and joked that if he lost another 50 pounds he \"told Coach I'm getting a contract\" and joining the team.During an appearance on his wife's podcast, \"Dumb Blonde\" in December 2024, Jelly Roll went into detail about why he chose to go public with his weight loss journey, explaining he \"to be honest about my struggles with it with people.\"CLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\"I think that people that become as big as I became, when they lose the weight, they're kind of ashamed,\" he explained. \"They're so ashamed that they go and hide and lose the weight, and then they come back out, and they don't really know how to interact with the world, looking different or feeling different, you know? And they kind of got to find their whole new way.\" While on the podcast, he expressed his goal of wanting to \"be on the cover of ‘Men’s Health' by March of 2026\" and having \"one of the biggest transformations.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/entertainment",
    "https://www.tiktok.com/@xomgitsbunnie/video/7538977191799835918?embed_source=121374463%2C121468991%2C121439635%2C121749182%2C121433650%2C121404359%2C121497414%2C121477481%2C121351166%2C121811500%2C121487028%2C121679410%2C121331973%2C120811592%2C120810756%2C121819198%3Bnull%3Bembed_blank&refer=embed&referer_url=people.com%2Fbunnie-xo-jelly-roll-still-squish-200-pound-weight-loss-11793472&referer_video_id=7538977191799835918",
    "https://www.foxnews.com/entertainment/jelly-rolls-lost-over-100-pounds-while-fighting-food-addiction-battle",
    "https://people.com/jelly-roll-lost-110-lbs-food-addiction-exclusive-8747888",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/video/6372591884112",
    "https://www.foxnews.com/entertainment/jelly-roll-launches-music-studio-nashville-juvenile-detention-center-once-incarcerated",
    "https://x.com/PatMcAfeeShow/status/1910141375070486975",
    "https://www.foxnews.com/entertainment/jelly-rolls-wife-grabs-country-stars-attention-risque-move",
    "https://www.foxnews.com/entertainment/jelly-roll-training-half-marathon-transforming-himself-after-weight-shaming-forced-off-internet",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/entertainment/jelly-roll-drops-nearly-200-pounds-sets-sights-sky-high-goal",
    "https://www.foxnews.com/entertainment/jelly-roll-shuts-down-concerns-weight-loss-would-destroy-career"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jelly Roll",
      "weight": 0.07392172
    },
    {
      "name": "better food options",
      "weight": 0.057820383
    },
    {
      "name": "playful TikTok video",
      "weight": 0.057576314
    },
    {
      "name": "Fox News Digital",
      "weight": 0.05227808
    },
    {
      "name": "food",
      "weight": 0.051998917
    },
    {
      "name": "singer",
      "weight": 0.05154084
    },
    {
      "name": "Jelly Rolls wife",
      "weight": 0.050684724
    },
    {
      "name": "Bunnie",
      "weight": 0.050470397
    },
    {
      "name": "CMA Awards",
      "weight": 0.04975373
    },
    {
      "name": "his weight loss journey",
      "weight": 0.049071457
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9912109375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.90380859375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.75146484375
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Urban & Hip-Hop",
      "score": 0.669921875
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.64501953125
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/Pop Music",
      "score": 0.4697265625
    },
    {
      "name": "/Arts & Entertainment/Music & Audio/World Music",
      "score": 0.322265625
    }
  ],
  "sentiment": {
    "positive": 0.19859369,
    "negative": 0.42093635,
    "neutral": 0.38047
  },
  "summary": "Jelly Roll's wife, Bunnie, posted a video of her husband's weight loss transformation in a TikTok video after he lost 200 pounds. The video shows Bunnie playingfully body slamming him as he leans against a wall and a kiss. The singer began his weight-loss journey in December 2022 and shared his progress during an appearance on the \"Big Night Aht\" live show in April 2025. He also revealed his struggles with his health journey started with his \"food addiction\" in November 2024. Jelly Roll shared his journey on his wife's podcast, \"Dumb Blonde,\" and expressed his goal of wanting to \"be on the cover of 'Men’s Health' by March 2026\" and having \"one of the biggest transformations.\"",
  "shortSummary": "Jelly Roll's wife, Bunnie, body slams him in a TikTok video after he loses 200 pounds, highlighting his ongoing weight loss and health struggles.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "678313b7af1244dbbaf8a6c2f51bf183",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/entertainment/jelly-roll-shuts-down-concerns-weight-loss-would-destroy-career",
      "text": "Although he's spoken at length about being \"petrified\" of losing his momentum in the industry, country music sensation Jelly Roll says it won't be his weight that dictates the amount of success he has in the future.\nThe Nashville, Tennessee, native, who recently embarked on a public weight-loss journey, says he's confident that his willingness to be open about dropping pounds won't shed him of his fame.\n\"I did this publicly for a reason,\" he told wife Bunnie Xo, on her \"Dumb Blonde\" podcast, released Monday. \"I want to be honest about my struggles with it with people. I wore it for so long.\"\nJELLY ROLL LOST OVER 100 POUNDS WHILE FIGHTING FOOD ADDICTION BATTLE\n\"I think that people that become as big as I became, when they lose the weight, they're kind of ashamed,\" explained the \"Save Me\" singer, who has lost 100 pounds. \"They're so ashamed that they go and hide and lose the weight, and then they come back out, and they don't really know how to interact with the world, looking different or feeling different, you know? And they kind of got to find their whole new way.\"\nJelly Roll, who was born Jason Bradley DeFord, says he took the opposite approach. \"I wanted to lose it in front of everybody. I wanted to talk about it,\" adding that it's a regular topic of conversation in his daily vlogs he records.\n\"This is constantly what I'm putting in the air because I want to bring people along with me.\"\nTo further his point, Jelly Roll brought up a previous conversation with his wife. \"One night you said something to the effect of, ‘Are you worried about the ’fat effect'? And that most Hollywood stars who have lost a large amount of weight ended up not getting placed in their career.\"\n\"What I want the world to know, and I want the people to see, Bunnie, is that I didn't become successful because of my weight, I became successful in spite of it,\" Jelly Roll said definitively. \"I somehow managed to be this successful with carrying 550 pounds. That's insane.\"\nJelly Roll believes his struggle with food surpasses unhealthy habits. \"I used to feel like it was such an injustice to real addicts to call food something you could be addicted to. You know, cause I've seen people fight for their life on heroin,\" the former incarcerated singer shared.\n\"I didn't become successful because of my weight, I became successful in spite of it.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"But, I've seen people fight for their life in their own body. You know what I mean? And I started realizing that the same patterns that I had… toward drugs or alcohol at different times of my life, was small compared to the consistent bad pattern I'd had with food.\"\nOn his horizon, Jelly Roll has set a new goal for himself: being a cover model. \"I wanna be on the cover of ‘Men’s Health' by March of 2026,\" he told his wife, who shared in his excitement. \"That's my new goal. So I wanna have one of the biggest transformations.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/jelly-roll-training-half-marathon-transforming-himself-after-weight-shaming-forced-off-internet",
      "text": "Jelly Roll is training for a half-marathon!\nThe country star, who has dropped 50 to 75 pounds and continues to shed weight, told Fox News Digital that he plans to enter the 13.1-mile race next year after completing a few shorter races first.\n\"I’m training as you can train, it’s an 18-month process,\" the \"Need a Favor\" singer explained. \"I want to do another couple 5Ks first, so the goal is to half-marathon next fall.\"\nThe 39-year-old completed his first 5K (3.1 miles) May 7 at the Rose Bowl after accepting the Bert Kreischer and Tom Segura's 5K By May challenge at the beginning of this year for the 2 Bears 5K.\nJELLY ROLL'S WIFE HITS BACK AT CRITICS AFTER MEETING HER ‘HALL PASS’\n\"I couldn't walk a mile when I started trying to do this back in January,\" he told Entertainment Tonight. \"So, the fact that we got three-point-whatever it was done today, I felt really, really good about it.\"\nHe added that he had lost \"like fifty to seventy-something pounds\" while training for the 5K.\nJelly Roll, whose full name is Jason Bradley DeFord, has been candid about his struggles to lose weight over the years. In 2018, the country star revealed on Instagram that he weighed over 500 pounds in 2015 before he embarked on a health journey and lost 200 pounds.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nHe told Fox News Digital the 5K was \"incredible, man, but I also had the luxury of doing it with friends and family. I had the luxury of walking it with Bert Kreischer and my wife and my whole crew came out to support me. It was like really, really cool, man.\"\nWATCH: JELLY ROLL SETS HIS SIGHTS ON A HALF-MARATHON AFTER RUNNING HIS FIRST 5K\nCOUNTRY MUSIC STAR JELLY ROLL BELIEVES ‘GOD HAD A BIGGER PURPOSE’ FOR HIM\nAs far as the Academy of Country Music Awards on Thursday, he said he was looking forward to playing this new song \"Liar,\" and \"I’m also praying, praying that one of the four times they say my name it gets called! You know what I’m saying, for sure. It’s kind of like that old thing at one like, and I’m having a beer, and then they like their own Instagram post. That’s me. One award and we’re partying, baby.\"\nJelly Roll definitely ended up with a reason to celebrate. By the end of the night in Texas, he had picked up his first ACM for music event of the year for \"Save Me\" with Lainey Wilson.\n\"I never thought I would be standing here!\" he said in an emotional acceptance speech.\n\"I thought I would die and go to jail, and I’m standing here as an ACM award winner! You hear what I’m talking about Texas?! Let’s go, baby!\"\nEarlier in the show, he joked about his \"Beautifully Broken\" tour: \"Who ever thought Jelly Roll would be a family-friendly event?\"\nWATCH: JELLY ROLL WALKS THE ACM AWARDS CARPET WITH WIFE, BUNNIE XO\nLast month, Jelly Roll's wife, Bunny Xo, revealed that the singer was taking a break from social media due to negative comments about his weight.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"My husband got off the internet because he is so tired of being bullied about his f---ing weight,\" she said on her \"Dumb Blonde\" podcast. \"That makes me want to cry because he is the sweetest angel baby.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"My husband doesn't show it to you guys, but I'm going to have a very vulnerable moment here,\" Bunnie Xo told her listeners. \"It hurts him.\"\nFox News' Ashley Hume contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/entertainment/jelly-roll-drops-nearly-200-pounds-sets-sights-sky-high-goal",
      "text": "Jelly Roll is breezing through his weight-loss goals and celebrating his latest milestone.\nDuring the \"Big Night Aht\" live show Wednesday, he told host Pat McAfee and the gathered audience that he's lost nearly 200 pounds.\n\"I started at 540 pounds and I was 357 pounds this morning,\" the 40-year-old said, adding, \"I’m gonna lose another 100 pounds and go skydiving with my wife in Sweden, baby!\"\nEarlier this year, Jelly Roll celebrated not only the lower number on the scale but an improvement in his overall fitness.\nIn February, he told E! News at a pre-Super Bowl party that he \"hiked a mountain the other day. Camelback,\" referring to the Arizona mountains.\n\"There is no way that would have been possible beforehand, so it’s great to see that progress, and we still are going,\" the singer, born Jason Bradley DeFord, said.\nThe \"Son of a Sinner\" singer has been on a weight-loss journey since December 2022 and has seen incredible success, but admitted it hasn’t always been easy.\n\"It isn't always the case where I feel focused or positive,\" he admitted to E! News. \"The things that motivate me and keep me going are the people I have met along the way... The people that come up to me and bravely share their sobriety date, or a story of something that they've dealt with, or someone they’ve lost.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nHe added, \"Seeing the resilience of the human spirit, there is no greater motivation than to keep going.\"\nIn December 2024, he spoke on his wife Bunnie Xo’s \"Dumb Blonde\" podcast about why he decided to be open with his fans about losing weight.\n\"I did this publicly for a reason,\" he said. \"I want to be honest about my struggles with it with people. I wore it for so long.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nJelly Roll continued, \"I think that people that become as big as I became, when they lose the weight, they're kind of ashamed. They're so ashamed that they go and hide and lose the weight, and then they come back out, and they don't really know how to interact with the world, looking different or feeling different, you know? And they kind of got to find their whole new way.\"\n\"I wanted to lose it in front of everybody. I wanted to talk about it… This is constantly what I'm putting in the air because I want to bring people along with me.\"\nCLICK HERE TO GET THE FOX NEWS APP\nHe later told Bunnie, \"I wanna be on the cover of ‘Men’s Health' by March of 2026. That's my new goal. So I wanna have one of the biggest transformations.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/jelly-roll-launches-music-studio-nashville-juvenile-detention-center-once-incarcerated",
      "text": "Jelly Roll is very big on giving back.\nAccording to Entertainment Tonight, the country music star helped launch a music studio inside of Davidson County Juvenile Detention Center in Nashville, Tennessee, where he was once incarcerated.\nThe outlet reported that a portion of the proceeds from Jelly Roll's Bridgestone Arena headlining show in December and the Redemption Songs event earlier this year helped fund the program.\nCOUNTRY STAR JELLY ROLL'S PRIVATE JET FORCED INTO EMERGENCY LANDING\nET included a quote from the press release of the program that read, \"This collaboration, featuring music luminaries Jeffrey Steele and ERNEST, alongside 35 pro/hit songwriters who helped kick off the program launch, embodies the belief in music's role in personal growth and redemption, showcasing the journey from juvenile detention to success.\"\nIn December 2022, the musician spoke to People magazine about creating a music studio in the detention center and how he wants \"to bring hope\" to troubled youths.\n\"It's important, man. I think it's important that we give back, especially [to] our kids,\" he told the outlet at the time. \"Man, our youth are so impressionable and the old quote goes, 'None of them asked to be here.'\"\nJelly Roll continued, \"They were born into just whatever situation it was, and sometimes they can't see past that situation or that neighborhood or that environment. I just hope to bring hope to that and kind of be a beacon and a light for those kids.\"\nAt the time, People shared that Jelly Roll was teaming up with the nonprofit Impact Youth Outreach to create the music studio. He told the outlet that it was during his time serving at the juvenile center that he found his passion for music.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"I was in and out of there for about three, three and a half years. I spent a lot of time there and eventually got charged as an adult for a crime I committed as a juvenile,\" he told the outlet. \"And I just realized that was the most impactful thing that ever happened in my life, and the darkest moments of my life still were being that 15-year-old scared kid spending Thanksgiving away from his family.\"\nJelly Roll continued, \"I knew that I wanted to give back whenever I was in a situation to, and I always knew I wanted to make it really personal. So, I went back to the same juvenile that I started doing music at. I wrote some of my first raps there, had my first big rap battle there.\"\nWATCH: COUNTRY STAR JELLY ROLL SAYS ‘GOD HAD A BIGGER PURPOSE’ FOR HIM\nIn an interview with Fox News Digital ahead of the CMT Music Awards earlier this month, Jelly Roll said \"God had a bigger purpose\" for him.\n\"Faith was a lot of me believing it was going to work out for me,\" he said. \"Could you imagine being a 37-year-old, unsuccessful musician when you told people that was your job?\"\nJelly Roll, who rose to prominence with his 2021 album, \"Ballad of the Broken,\" explained that he had been creating music for years before he got recognition. In 2003, he took a shot at creating hip-hop music with his first release, \"The Plain Shmear Tape,\" but eventually made his way to country and rock music.\n\"It wasn't like something I did on the side. Like, it was my job. And I just always had faith that God had a bigger purpose for what I was trying to do,\" Jelly Roll said.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nThe musician pointed out that his life is evidence \"not everybody has to make a deal with the devil in this business.\"\nJelly Roll had a tumultuous upbringing and was imprisoned before he had the chance to graduate high school. He served time when he was 14 and welcomed his first child, daughter Bailee, while still behind bars.\nCLICK HERE TO GET THE FOX NEWS APP\nThe \"Need A Favor\" singer has since gotten his life on track and has full custody of Bailee and raises her with his wife, Bunnie Xo. Bunnie, a former sex worker, and Jelly Roll tied the knot in 2016."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/entertainment/jelly-rolls-wife-grabs-country-stars-attention-risque-move",
      "text": "Jelly Roll’s wife turned up the heat at an ice hockey rink while supporting her country star husband.\nBunnie Xo, 45, took to social media to share how she playfully grabbed Jelly Roll’s attention in an unexpected way, prompting more than a few double takes.\nThe \"Son of a Sinner\" crooner appeared to be having a photo shoot at an ice hockey rink when his wife lifted her shirt on the sidelines.\nJELLY ROLL SHARES ONE HABIT THAT 'ANNOYS' WIFE BUNNIE XO 'TO NO END': 'I FEEL BAD FOR HER'\n\"When he’s not paying enough attention to you so you have to flop out the honkers,\" she wrote on the Instagram video.\nJelly Roll, 40, had a priceless reaction to his wife, nodding his head and cheering her on. He was all smiles as he laughed and pumped his fist while the two danced together.\nThe couple’s humorous moment comes after Jelly Roll recently revealed one habit that his wife can’t stand.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nLast month, Jelly Roll and \"American Idol\" judge Luke Bryan, 48, appeared on \"The Jennifer Hudson Show,\" where they participated in a rapid-fire question segment with Hudson, 43.\n\"What's one thing you do that drives your wife absolutely crazy?\" the two-time Grammy Award winner asked.\n\"I feel bad for her,\" Jelly Roll, born Jason Bradley DeFord, said.\nJELLY ROLL ADMITS TOUGHEST PART OF LOSING WEIGHT AFTER SHEDDING NEARLY 200 POUNDS\n\"I have this problem I do where I leave a trail of clothes from the front door to the shower,\" he admitted as the audience groaned.\n\"I know. I’ve been trying to break this habit, y’all! It annoys her to no end.\"\nBunnie Xo and Jelly Roll first met in 2015 after the former sex worker watched the rising country star perform at a concert in Las Vegas. A year later, the two eloped after Jelly Roll proposed to Bunnie XO while onstage at a Yelawolf and Deftones concert.\nThe country music star previously shared how he's kept his marriage strong in an interview with Fox News Digital at the 2024 CMT Music Awards.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"Open, real, honest communication,\" Jelly Roll told Fox News Digital. \"We talk about the uncomfortable stuff up front. It's a real important thing in our marriage.\"\nCLICK HERE TO GET THE FOX NEWS APP\nHe pointed out that it helps to have a sense of humor when it comes to love.\n\"And also, we don't take nothing too serious,\" he added. \"Have a short memory. Laugh as much as you can. Laughter is the best medicine.\""
    },
    {
      "url": "https://people.com/jelly-roll-lost-110-lbs-food-addiction-exclusive-8747888",
      "text": "Jelly Roll Gets Candid About His 'Battle' with Food Addiction as He Reveals He's Lost 110 Lbs. and Counting (Exclusive) The country star opens up to PEOPLE in this week's issue about the strides he's made in his fitness journey By Rachel DeSantis Rachel DeSantis Rachel DeSantis is a senior writer on the music team at PEOPLE. She has been working at PEOPLE since 2019, and her work has previously appeared in Entertainment Weekly and the New York Daily News. People Editorial Guidelines Updated on November 20, 2024 01:30PM EST 7 Comments Jelly Roll has made significant strides in his health and fitness goals over the last year — and he’s just getting started. The “Winning Streak” singer, 39, opens up to PEOPLE in this week’s issue about how he’s adjusted his lifestyle to further his weight loss journey, revealing that he’s shed 110 lbs. so far this year. “The battle was with the food addiction, changing the way I’ve looked at food for the last 39 years,” he explains. “I’ve never had a healthy relationship with food, so that was the hard part. But once you get into that discipline and commitment, it’s like an avalanche. Once that little snowball started rolling, it was on its way.” Jelly estimates he’s lost 60 to 70 lbs. on his Beautifully Broken tour, which began in August and will end later this month. Jelly Roll Says He's Lost '70-Something Pounds' as He Prepares for 5K: 'I Feel Really Good' (Exclusive) Jelly Roll. Peter Yang He and his crew play basketball every day on tour to keep fit — the Grammy nominee says he’s completely transformed his behavior on the road by prioritizing physical activity and nutritious food choices. “It’s cool because there was once a time in life that the culture I built on tour was the opposite. It revolved around alcohol and drugs,” he says. “And now our tour culture is around good eating and around exercising and doing emotional check-ins with our crew every day.” Jelly Roll and comedian Bert Kreischer at the 2 Bears 5K in California in May. Charley Gallay/Getty The Grammy nominee says his struggles with food addiction began as a child growing up in Antioch, Tenn. “Nobody in my house ever had [a healthy relationship with food], so that was the hard part, really fighting that demon at first and getting into that discipline and that commitment,” he says. Bunnie XO Shares Rare Snaps with Husband Jelly Roll and 'Bonus Baby' Noah as 8-Year-Old Joins Dad on Tour Jelly Roll cold plunges at the 2 Bears 5K in California in May. Charley Gallay/Getty And he has committed in new ways. In January, Jelly began training for his first 5K race, telling PEOPLE in April that he was running two to three miles a day, four to six days a week, then doing 20 to 30 minutes in a sauna and six minutes in a cold plunge. In May, he completed the 2 Bears 5K, hosted by comedians Bert Kreischer and Tom Segura as part of the Netflix Is a Joke comedy festival. Wife Bunnie Xo was right by his side as a participant. And Jelly says he has no plans to slow down: “I hope I continue to lose this weight.\" For more on Jelly Roll, pick up the latest issue of PEOPLE, on newsstands Friday, or subscribe here. Leave a Comment Read more: Lifestyle Health Weight Loss"
    },
    {
      "url": "https://www.foxnews.com/entertainment/jelly-rolls-lost-over-100-pounds-while-fighting-food-addiction-battle",
      "text": "Jelly Roll proudly walked into the 2024 CMA Awards not only as a nominee, but also having achieved his weight loss goal.\nThe \"Son of a Sinner\" singer appeared at the event with his wife, Bunnie XO, his first since having lost over 100 pounds.\nThey were also accompanied by Jelly Roll’s 15-year-old daughter, Bailee Ann, who was making her CMA debut.\nJELLY ROLL GIVES PRINCE HARRY NECK TATTOO AS ROYAL JOKES HE SHOULD HAVE GOTTEN IT ON HIS A--\n\"We're so excited,\" Bunnie told E! News. \"This is her first CMAs.\"\nIn a recent interview with People magazine, Jelly Roll, born Jason Bradley DeFord, shared new details on how he managed his weight loss over the past year.\n\"The battle was with the food addiction, changing the way I’ve looked at food for the last 39 years,\" he told the outlet. \"I’ve never had a healthy relationship with food, so that was the hard part. But once you get into that discipline and commitment, it’s like an avalanche. Once that little snowball started rolling, it was on its way.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nThe singer estimated he lost about 60 to 70 pounds on his \"Beautifully Broken\" tour, which began in August and will conclude later this month.\nIn addition to the rigors of touring, Jelly Roll said he and his crew also play basketball every day to stay fit.\n\"The battle was with the food addiction, changing the way I’ve looked at food for the last 39 years.\"\n\"It’s cool because there was once a time in life that the culture I built on tour was the opposite. It revolved around alcohol and drugs,\" the 39-year-old said. \"And now our tour culture is around good eating and around exercising and doing emotional check-ins with our crew every day.\"\nJELLY ROLL DROPS 100 POUNDS: HOW THE COUNTRY MUSIC STAR TRANSFORMED HIS BODY\nJelly Roll has been working on his weight-loss goals over the past year.\nIn May, Jelly Roll told Fox News Digital he had lost \"like 50 to 70-something pounds\" while training for a 5K.\nLast month, he went on Instagram with his nutrition coach, Ian Larios, who has been working with him on tour, and confirmed that the country star had lost 100 pounds.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"We just passed the halfway point of the tour, and Jelly’s been crushing it,\" Larios said.\nBack at the 2023 CMA Awards, Jelly Roll told Fox News Digital that his weight-loss journey was giving him the \"will to live.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"I don't even have a goal when it comes to health,\" he said at the time. \"I just want to keep doing the right thing and feeling better. I'm starting to find a will to live, and I want to lean into that. That's it. I just want to be happier.\""
    }
  ],
  "argos_summary": "Jelly Roll, the country‑music star, has publicly documented a dramatic weight‑loss journey that began in December 2022, shedding over 200 pounds and aiming for a Men’s Health cover by 2026.  His wife, Bunnie Xo, has supported him through playful TikTok moments and social media posts, while he shares his progress at events like the CMA Awards and on his podcast.  The singer credits a disciplined diet, regular exercise, and a supportive tour culture for his transformation, and he plans to run a half‑marathon next year.  Beyond his health goals, Jelly Roll has used his platform to give back, including launching a music studio at a juvenile detention center and emphasizing the role of faith and community in his success.",
  "argos_id": "JSHXSDAK0"
}