{
  "url": "https://finance.yahoo.com/news/bojs-ueda-expects-tightening-job-180926912.html",
  "authorsByline": "Howard Schneider and Leika Kihara",
  "articleId": "fc9dac0896944e4cb877b4a6861911c4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters.com/d1a00a42d412bebab81fc57b844532ba",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T18:09:26+00:00",
  "addDate": "2025-08-23T19:07:34.102197+00:00",
  "refreshDate": "2025-08-23T19:07:34.102199+00:00",
  "score": 1.0,
  "title": "BOJ's Ueda expects tightening job market to push up wages",
  "description": "JACKSON HOLE, Wyoming (Reuters) -Bank of Japan Governor Kazuo Ueda said wage hikes are spreading beyond large firms and likely to keep accelerating due to a tightening job market, signaling his optimism that conditions for another interest rate hike were falling into place.  The remarks are likely to reinforce market expectations that the central bank will resume a rate hike cycle, which was put on pause due to concern over the fallout from U.S. tariffs on the export-reliant economy, later this year.  Despite Japan's dwindling working-age population, wage growth remained stagnant for decades due to \"entrenched deflationary expectations\" that discouraged companies from raising prices and pay, Ueda said at a panel held on Saturday during the Federal Reserve's annual conference in Jackson Hole, Wyoming.",
  "content": "JACKSON HOLE, Wyoming (Reuters) -Bank of Japan Governor Kazuo Ueda said wage hikes are spreading beyond large firms and likely to keep accelerating due to a tightening job market, signaling his optimism that conditions for another interest rate hike were falling into place.\n\nThe remarks are likely to reinforce market expectations that the central bank will resume a rate hike cycle, which was put on pause due to concern over the fallout from U.S. tariffs on the export-reliant economy, later this year.\n\nDespite Japan's dwindling working-age population, wage growth remained stagnant for decades due to \"entrenched deflationary expectations\" that discouraged companies from raising prices and pay, Ueda said at a panel held on Saturday during the Federal Reserve's annual conference in Jackson Hole, Wyoming.\n\nNow, wages are rising and labor shortages have become \"one of our most pressing economic issues,\" as global inflation caused by the COVID-19 pandemic served as an external shock that broke Japan out of a deflationary equilibrium, he said.\n\n\"Notably, wage growth is spreading from large enterprises to small and medium enterprises,\" Ueda said.\n\n\"Barring a major negative demand shock, the labor market is expected to remain tight and continue to exert upward pressure on wages,\" he said.\n\nUeda spoke as part of a panel including Bank of England Governor Andrew Bailey and European Central Bank President Christine Lagarde addressing labor market challenges developing in their economies.\n\nJapan has seen three straight years of high wage increases in annual spring wage negotiations between companies and unions.\n\nLabor mobility has also risen from historically low levels as the younger generation in particular searches for better-paying jobs, forcing companies to increase pay as they compete for workers, Ueda said.\n\n\"In sum, demographic shifts that began in the 1980s are now producing acute labor shortages and persistent upward pressure on wages,\" Ueda said.\n\n\"They are also driving significant adjustments on the supply side of the economy - through higher participation, increased mobility, and capital-labor substitution,\" he said.\n\nSuch forces will complicate the relationship between labor market conditions, wages and prices, he added.\n\n\"We will continue to monitor these developments closely and incorporate our assessment of evolving supply-side conditions into the conduct of monetary policy,\" Ueda said.\n\nAfter exiting a massive, decade-long stimulus last year, the BOJ raised interest rates to 0.5% in January on the view Japan was on the cusp of durably achieving its 2% inflation target.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "labor market conditions",
      "weight": 0.10047639
    },
    {
      "name": "labor market challenges",
      "weight": 0.09369196
    },
    {
      "name": "wage hikes",
      "weight": 0.09000337
    },
    {
      "name": "tightening job market",
      "weight": 0.08563867
    },
    {
      "name": "wage growth",
      "weight": 0.0854488
    },
    {
      "name": "high wage increases",
      "weight": 0.08335169
    },
    {
      "name": "labor shortages",
      "weight": 0.08187727
    },
    {
      "name": "annual spring wage negotiations",
      "weight": 0.08122835
    },
    {
      "name": "acute labor shortages",
      "weight": 0.08114926
    },
    {
      "name": "wages",
      "weight": 0.079564944
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97900390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.87744140625
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.51171875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.48291015625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.474853515625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.4599609375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.422119140625
    }
  ],
  "sentiment": {
    "positive": 0.11103774,
    "negative": 0.72193885,
    "neutral": 0.16702347
  },
  "summary": "Bank of Japan Governor Kazuo Ueda has predicted that wage increases are increasing beyond large firms due to a tightening job market. This sentiment is likely to reinforce market expectations that the central bank will resume its rate hike cycle later this year. Despite Japan's declining working-age population, wage growth has remained stagnant for decades due to \"entrenched deflationary expectations\" that discouraged companies from raising prices and pay. Now wages are rising and labor shortages have become a key economic issue, as global inflation caused by the COVID-19 pandemic led to Japan's emergence of global deflationary equilibrium. Ueda also highlighted the increase in labor mobility as the younger generation searches for better-paying jobs, forcing companies to increase pay.",
  "shortSummary": "Bank of Japan Governor Kazuo Ueda expects rapid wage increases due to a tightening job market, boosting market expectations for another interest rate hike.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f237ad8f2a804c6d9f7d300276940fdb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bank of Japan Governor Kazuo Ueda said wage hikes are spreading beyond large firms and are likely to accelerate as the labor market tightens, signaling optimism that conditions for another interest‑rate hike are emerging. He noted that decades of stagnant wages, driven by entrenched deflationary expectations, have been broken by the pandemic‑induced inflation shock, and that wage growth is now rising across small and medium enterprises. Ueda highlighted demographic shifts that are creating acute labor shortages, higher participation, mobility and capital‑labor substitution, which will complicate the link between wages and prices. He added that the BOJ will closely monitor these supply‑side developments and incorporate them into monetary policy, following a pause in rate hikes caused by concerns over U.S. tariffs. The remarks were made alongside other central bank leaders at the Jackson Hole conference, reinforcing expectations of a resumed rate‑hike cycle.",
  "argos_id": "K0WFSW29E"
}