{
  "url": "https://www.newsweek.com/sports/mlb/phillies-get-worst-case-news-surrounding-zack-wheelers-health-2118288",
  "authorsByline": "Andrew Wright",
  "articleId": "5bf23de5549c48d1b8ddb73648f96f1c",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2708551/philadelphia-phillies-starting-pitcher-zack-wheeler.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T15:57:40-04:00",
  "addDate": "2025-08-23T20:02:14.462433+00:00",
  "refreshDate": "2025-08-23T20:02:14.462435+00:00",
  "score": 1.0,
  "title": "Phillies Get Worst-Case News Surrounding Zack Wheeler's Health",
  "description": "While the organization and fans were hoping for the best, the worst-case scenario has now taken place regarding the status of Phillies ace Zack Wheeler.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nUnfortunately for the Philadelphia Phillies, they will be without their ace for the remainder of the season.\n\nThe team announced via the Phillies' official X account that ace Zack Wheeler would need season-ending surgery. Wheeler had previously been diagnosed with thoracic outlet syndrome and surgery was recommended as the best recovery option.\n\nARLINGTON, TEXAS - AUGUST 10: Zack Wheeler #45 of the Philadelphia Phillies looks on in the first inning during a game against the Texas Rangers at Globe Life Field on August 10, 2025 in Arlington,... ARLINGTON, TEXAS - AUGUST 10: Zack Wheeler #45 of the Philadelphia Phillies looks on in the first inning during a game against the Texas Rangers at Globe Life Field on August 10, 2025 in Arlington, Texas.\n\nWheeler was placed on the injured list last week due to a blood clot near his shoulder. It was unclear if he'd be able to return from that, but there was a bit of hope he'd be able to.\n\nWe now know that he will not be able to return and will miss both the remainder of the regular season as well as the postseason.\n\nWheeler was having a Cy Young Award-type season, as he was 10-5 with a 2.71 ERA and 195 strikeouts across 149 2/3 innings. Without the injury, Wheeler was headed toward a second-place finish in Cy Young voting.\n\nEarlier this season, it was reported that Wheeler is intending to retire after his current contract expires in 2027. He will be 37 years old when his contract runs out and it is unclear if those plans will now change after he will be forced to miss what could potentially two more months of baseball for Philadelphia.\n\nWheeler's production every fifth day is nearly irreplaceable, and the rotation will certainly have to step up if it has aspirations of another deep October run.\n\nMore MLB: Phillies Homegrown All-Star Could Ditch Philadelphia in Favor of Blue Jays: Insider",
  "medium": "Article",
  "links": [
    "https://twitter.com/Phillies/status/1959328752405557495?ref_src=twsrc%5Etfw",
    "https://www.newsweek.com/sports/mlb/phillies-homegrown-all-star-could-ditch-philadelphia-favor-blue-jays-insider-2118205",
    "https://www.newsweek.com/sports/mlb/phillies-ace-makes-decision-about-when-his-career-will-over-2085828",
    "https://x.com/Phillies/status/1959328752405557495",
    "https://t.co/JnnEAz4cMZ"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Zack Wheeler",
      "weight": 0.11370844
    },
    {
      "name": "ace Zack Wheeler",
      "weight": 0.11359593
    },
    {
      "name": "Wheeler",
      "weight": 0.10105728
    },
    {
      "name": "Phillies",
      "weight": 0.08433823
    },
    {
      "name": "Philadelphia",
      "weight": 0.07694278
    },
    {
      "name": "Cy Young Award",
      "weight": 0.07655267
    },
    {
      "name": "Cy Young voting",
      "weight": 0.07259454
    },
    {
      "name": "Globe Life Field",
      "weight": 0.071802564
    },
    {
      "name": "thoracic outlet syndrome",
      "weight": 0.06639213
    },
    {
      "name": "last week",
      "weight": 0.064368084
    }
  ],
  "topics": [
    {
      "name": "Philadelphia Phillies"
    },
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.986328125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.9140625
    }
  ],
  "sentiment": {
    "positive": 0.104812495,
    "negative": 0.49408624,
    "neutral": 0.4011013
  },
  "summary": "The Philadelphia Phillies have announced that their ace Zack Wheeler will require season-ending surgery. Wheeler had previously been diagnosed with thoracic outlet syndrome and surgery was recommended as the best recovery option. He was placed on the injured list last week due to a blood clot near his shoulder, but there was hope he could return from this. Despite this, Wheeler will miss both the regular season and the postseason. His production, which was nearly irreplaceable, is crucial for the team's hopes of another strong October run.",
  "shortSummary": "The Philadelphia Phillies face a significant loss with Zack Wheeler requiring season-ending surgery on a severe thoracic outlet syndrome injury.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4d39a039aafb4bdb82280c3e5600ad8f",
  "places": [
    {
      "osmId": "704674261",
      "road": "Stadium Drive",
      "city": "Arlington",
      "county": "Tarrant County",
      "state": "Texas",
      "postcode": "76011",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 32.74760655,
        "lon": -97.08410630166019
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/sports/mlb/phillies-ace-makes-decision-about-when-his-career-will-over-2085828",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nWhen looking around MLB and having conversations about who the best pitchers in the game are, Philadelphia Phillies right-hander Zack Wheeler is at the forefront at most of those conversations.\nUnfortunately for Phillies fans, the days of Wheeler taking the mound every fifth day are coming to an end sooner rather than later.\nAccording to Matt Gelb of The Athletic, Wheeler is planning to step away from baseball after his current contract expires in 2027. Wheeler will be 37 at the end of the season, a reasonable age to step away from the game.\nWheeler has spent all 11 seasons of his career in the NL East, six with the Phillies and five with the New York Mets.\nHe's been one of the most consistent pitchers in the league, making 30-plus starts in three of the last four seasons and five total in his career. He's well on track to get that to number to six -- and four of the last five seasons -- at the end of this year.\n\"That's the plan,\" Wheeler confirmed, adding that it \"doesn't matter\" if he continues to pitch at a dominant level.\nDominant is certainly the way to describe Wheeler's season so far. He is 6-2 with a 2.85 ERA and 101 strikeouts across 13 starts and 82 innings pitched. If not for Paul Skenes, Wheeler may be considered the frontrunner for the National League Cy Young Award.\nFor some, though, stepping away from the game can be a difficult decision. But for Wheeler, it doesn't seem like that will be the case.\n\"It'll be easy to walk away,\" he told Gelb.\nKnowing that Wheeler only has somewhere around 75-80 starts left in his career, Philadelphia needs to do everything in its power to help him accomplish the ultimate goal of a World Series ring before he retires.\nMore MLB: MLB News: Legendary Two-Sport Star Whose Grandson Followed Him to Cardinals Dies\nAbout the writer\nAndrew Wright is a Newsweek contributor based in Lancaster, South Carolina. His focus is MLB content. Andrew has been with ... Read more"
    },
    {
      "url": "https://www.newsweek.com/sports/mlb/phillies-homegrown-all-star-could-ditch-philadelphia-favor-blue-jays-insider-2118205",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThe Philadelphia Phillies' starting rotation for next season is a bit up in the air.\nCertainly, the Phillies hope to have ace Zack Wheeler back by then, and Cristopher Sánchez has proven to be an ace in his own right. But Aaron Nola has struggled in the second year of his big-money deal, and the arrival of top prospect Andrew Painter has to be considered as well.\nThen, there's the free agency case of Ranger Suárez to consider.\nSuárez was signed by the Phillies as an amateur out of Venezuela in 2012, and he's been fantastic at points in his career, even making an All-Star team last year. But with all that other talent just mentioned, plus Jesús Luzardo under contract for one more year, will the Phillies make an earnest attempt to bring Suárez back?\nIf not, MLB.com insider Mark Feinsand proposed an alternative on Thursday: the Toronto Blue Jays, who are slated to lose a bunch of free agents of their own in Chris Bassitt, Shane Bieber, Max Scherzer.\n\"He has struggled since the break (2-3, 5.86 ERA), but Suárez has posted a 3.63 ERA in four full seasons as a starting pitcher, providing solid work over that stretch. He may not be coveted by contenders as a No. 1, but Suárez should score a nice deal as a No. 2 or 3 starter,\" wrote Feinsand.\n\"Potential fits: Angels, Blue Jays, Giants.\"\nSpotrac currently has Suárez's market value at a lofty six years, $156 million. That seems steep given his up-and-down track record, but one never knows if a bidding war might materialize.\nThe Blue Jays have yet to show confirmed interest in Suárez, because free agency talk from clubs themselves is minimal at this time of year. However, it would be no surprise to see them make a strong effort to bring him to a roster they believe can contend for a long time.\nMore MLB: Orioles Could Ditch Former No. 1 Pick In Favor of Top Prospect, Per Insider\nAbout the writer\nJackson Roberts is a Newsweek contributor based in Hoboken, NJ. His focus is MLB content. Jackson has been with Newsweek ... Read more"
    }
  ],
  "argos_summary": "Philadelphia Phillies ace Zack Wheeler will miss the rest of the season and postseason after undergoing season‑ending surgery for thoracic outlet syndrome, following a blood clot near his shoulder. The 37‑year‑old, who was 10‑5 with a 2.71 ERA and 195 strikeouts, was on pace for a Cy Young Award finish and is slated to retire after his 2027 contract ends. His absence will force the Phillies’ rotation to step up as they chase another deep playoff run. Wheeler’s injury also raises questions about his future plans and the team’s strategy for filling the void in the starting rotation.",
  "argos_id": "KTB7G7MQZ"
}