{
  "url": "https://finance.yahoo.com/news/vault-minerals-limited-earnings-missed-231406410.html",
  "authorsByline": "Simply Wall St",
  "articleId": "3ff290a76e0c46d9bc65cef0b2f38815",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/simply_wall_st__316/590bd73c4f469217441156accbe686a8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T23:14:06+00:00",
  "addDate": "2025-08-23T23:31:11.271765+00:00",
  "refreshDate": "2025-08-23T23:31:11.271768+00:00",
  "score": 1.0,
  "title": "Vault Minerals Limited Earnings Missed Analyst Estimates: Here's What Analysts Are Forecasting Now",
  "description": "Shareholders of Vault Minerals Limited ( ASX:VAU ) will be pleased this week, given that the stock price is up 15% to...",
  "content": "Shareholders of Vault Minerals Limited (ASX:VAU) will be pleased this week, given that the stock price is up 15% to AU$0.49 following its latest yearly results. It was not a great result overall. While revenues of AU$1.4b were in line with analyst predictions, earnings were less than expected, missing statutory estimates by 10% to hit AU$0.035 per share. The analysts typically update their forecasts at each earnings report, and we can judge from their estimates whether their view of the company has changed or if there are any new concerns to be aware of. Readers will be glad to know we've aggregated the latest statutory forecasts to see whether the analysts have changed their mind on Vault Minerals after the latest results.\n\nAI is about to change healthcare. These 20 stocks are working on everything from early diagnostics to drug discovery. The best part - they are all under $10bn in marketcap - there is still time to get in early.\n\nTaking into account the latest results, the current consensus from Vault Minerals' nine analysts is for revenues of AU$1.59b in 2026. This would reflect a meaningful 11% increase on its revenue over the past 12 months. Statutory earnings per share are predicted to surge 27% to AU$0.044. Before this earnings report, the analysts had been forecasting revenues of AU$1.60b and earnings per share (EPS) of AU$0.047 in 2026. So it looks like there's been a small decline in overall sentiment after the recent results - there's been no major change to revenue estimates, but the analysts did make a small dip in their earnings per share forecasts.\n\nThe consensus price target held steady at AU$0.61, with the analysts seemingly voting that their lower forecast earnings are not expected to lead to a lower stock price in the foreseeable future. There's another way to think about price targets though, and that's to look at the range of price targets put forward by analysts, because a wide range of estimates could suggest a diverse view on possible outcomes for the business. There are some variant perceptions on Vault Minerals, with the most bullish analyst valuing it at AU$0.75 and the most bearish at AU$0.50 per share. There are definitely some different views on the stock, but the range of estimates is not wide enough as to imply that the situation is unforecastable, in our view.\n\nOf course, another way to look at these forecasts is to place them into context against the industry itself. We would highlight that Vault Minerals' revenue growth is expected to slow, with the forecast 11% annualised growth rate until the end of 2026 being well below the historical 43% p.a. growth over the last five years. Juxtapose this against the other companies in the industry with analyst coverage, which are forecast to grow their revenues (in aggregate) 5.1% per year. Even after the forecast slowdown in growth, it seems obvious that Vault Minerals is also expected to grow faster than the wider industry.",
  "medium": "Article",
  "links": [
    "https://simplywall.st/company/id/4A9FF5A5-A731-439C-8371-DE9447EC6398/future?blueprint=4011864&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
    "https://simplywall.st/company/id/4A9FF5A5-A731-439C-8371-DE9447EC6398?blueprint=4011864&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
    "https://simplywall.st/markets/au/materials/metals-mining?blueprint=4011864&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
    "https://au.finance.yahoo.com/quote/VAU.AX",
    "https://simplywall.st/discover/investing-ideas/434426/us-transformative-artificial-intelligence-ai-healthcare-stocks/global?blueprint=4011864&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=ai-healthcare"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vault Minerals Limited Earnings",
      "weight": 0.115640916
    },
    {
      "name": "Analyst Estimates",
      "weight": 0.115376994
    },
    {
      "name": "Vault Minerals",
      "weight": 0.105290234
    },
    {
      "name": "Vault Minerals Limited",
      "weight": 0.10482776
    },
    {
      "name": "revenue estimates",
      "weight": 0.101778805
    },
    {
      "name": "analyst coverage",
      "weight": 0.097571515
    },
    {
      "name": "analyst predictions",
      "weight": 0.09756431
    },
    {
      "name": "Analysts",
      "weight": 0.09710985
    },
    {
      "name": "analysts",
      "weight": 0.09710985
    },
    {
      "name": "Statutory earnings",
      "weight": 0.09040515
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94970703125
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.58935546875
    }
  ],
  "sentiment": {
    "positive": 0.19345778,
    "negative": 0.37217206,
    "neutral": 0.43437022
  },
  "summary": "Vault Minerals Limited (ASX:VAU) has reported disappointing results, with its stock price increasing by 15% to AU$0.49 following its annual results, which were less than expected and missed statutory estimates by 10%. The company's revenues of AU$1.4b were in line with analyst predictions, but earnings were less expected. The current consensus from nine analysts is for revenues of €1.59b in 2026, reflecting an 11% increase on its revenue over the past 12 months. However, the forecast for this growth is expected to slow, with the forecast 11% annualised growth rate until 2026 being below the historical 43% p.a.",
  "shortSummary": "Vault Minerals' shares rose 15% after its annual results missed analyst estimates, with future growth forecasted at 11% or 12%.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f59d8733a26c425693b67f88b8fbdcb6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://simplywall.st/discover/investing-ideas/434426/us-transformative-artificial-intelligence-ai-healthcare-stocks/global?blueprint=4011864&utm_medium=finance_user&utm_campaign=investing-ideas&utm_source=yahoo&utm_content=ai-healthcare",
      "text": "Results\n27\nArtificial intelligence (AI) is set to transform healthcare by enhancing diagnostics, personalizing medicine, boosting operational efficiency, expanding remote care, and accelerating research. AI outperforms humans in detecting diseases like cancer from scans, tailors treatments using genetic and lifestyle data, and streamlines hospital workflows with tools like predictive analytics and automated transcription. It powers telemedicine, monitors chronic conditions in real-time, and speeds up drug discovery by analyzing vast datasets for insights into complex diseases. Despite challenges like data privacy, bias, and integration costs, AI’s ability to improve accuracy, access, and affordability could save billions and extend lives, marking a seismic shift in healthcare delivery and outcomes.\n27 companies\nRakovina Therapeutics\nMarket Cap: US$10.6m\nA biopharmaceutical research company, engages in the research and development of cancer treatments based on novel series of small-molecule DNA-damage response targets.\nRKVT.F\nUS$0.37\n7D\n-9.8%\n1Y\nn/a\nCosmo Pharmaceuticals\nMarket Cap: US$924.5m\nFocuses on the development and commercialization products for gastroenterology, dermatology, and healthtech worldwide.\nCMOP.F\nUS$75.00\n7D\n0%\n1Y\nn/a\nGubra\nMarket Cap: US$5.8b\nA biotech company, focuses on the pre-clinical contract research and peptide-based drug discovery within metabolic and fibrotic diseases in Europe, North America, and internationally.\nGUBR.F\nUS$60.15\n7D\n0%\n1Y\nn/a\nEvaxion\nMarket Cap: US$19.6m\nA clinical-stage biotech company, develops artificial intelligence-powered immunology vaccines.\nEVAX\nUS$3.25\n7D\n12.8%\n1Y\n-79.3%\nImmunoPrecise Antibodies\nMarket Cap: US$121.4m\nOperates as an AI-driven biotherapeutic research, technology, and scientifically robust life science company.\nIPA\nUS$3.20\n7D\n60.0%\n1Y\n295.1%\nGeneDx Holdings\nMarket Cap: US$3.5b\nA genomics company, provides genetic testing services.\nWGS\nUS$128.67\n7D\n1.8%\n1Y\n259.8%\nEvolent Health\nMarket Cap: US$1.0b\nThrough its subsidiary, provides specialty care management services in oncology, cardiology, and musculoskeletal markets in the United States.\nEVH\nUS$9.60\n7D\n3.2%\n1Y\n-70.9%\nWELL Health Technologies\nMarket Cap: US$1.2b\nOperates as a practitioner-focused digital healthcare company in Canada, the United States, and internationally.\nWHTC.F\nUS$3.56\n7D\n3.1%\n1Y\n1.1%\nSpectral AI\nMarket Cap: US$54.0m\nAn artificial intelligence (AI) company, focuses on predictive medical diagnostics in the United States.\nMDAI\nUS$2.09\n7D\n-0.9%\n1Y\n40.3%\nRevenio Group Oyj\nMarket Cap: US$657.1m\nProvides ophthalmological devices and software solutions for the diagnosis of glaucoma, macular degeneration, and diabetic retinopathy in Finland, the United States, and internationally.\nREVX.F\nUS$31.47\n7D\n0%\n1Y\nn/a\nRadNet\nMarket Cap: US$5.3b\nProvides outpatient diagnostic imaging services in the United States and internationally.\nRDNT\nUS$70.10\n7D\n3.9%\n1Y\n7.8%\nCareCloud\nMarket Cap: US$115.1m\nA healthcare information technology (IT) company, provides technology-enabled business solutions, Software-as-a-Service offerings, and related business services to healthcare providers and hospitals primarily in the United States.\nCCLD\nUS$2.83\n7D\n8.8%\n1Y\n-2.1%\nSimulations Plus\nMarket Cap: US$277.2m\nDevelops drug discovery and development software for modeling and simulation, and prediction of molecular properties utilizing artificial intelligence and machine learning based technology worldwide.\nSLP\nUS$14.57\n7D\n2.3%\n1Y\n-60.4%\nCeriBell\nMarket Cap: US$428.2m\nOperates as a medical technology company focuses on transforming the diagnosis and management of patients with serious neurological conditions in the United States.\nCBLL\nUS$12.06\n7D\n-2.0%\n1Y\nn/a\nHeartSciences\nMarket Cap: US$8.5m\nA medical technology company, focuses on applying AI-based technology to an ECG to expand and improve clinical usefulness.\nHSCS\nUS$3.65\n7D\n8.0%\n1Y\n-1.9%\nGuardant Health\nMarket Cap: US$7.6b\nA precision oncology company, provides blood and tissue tests, and data sets in the United States and internationally.\nGH\nUS$61.40\n7D\n4.3%\n1Y\n111.6%\nNano-X Imaging\nMarket Cap: US$256.4m\nDevelops a commercial-grade tomographic imaging device with a digital X-ray source.\nNNOX\nUS$4.06\n7D\n-8.1%\n1Y\n-42.3%\nPerimeter Medical Imaging AI\nMarket Cap: US$25.6m\nA medical technology company, provides advanced imaging solutions to address unmet medical needs.\nPYNK.F\nUS$0.17\n7D\n-1.4%\n1Y\n-39.1%\nOmniAb\nMarket Cap: US$220.9m\nA biotechnology company, licenses discovery research technology to pharmaceutical and biotech companies, and academic institutions to enable the discovery of therapeutics in the United States, Europe, Japan, China, and Canada.\nOABI\nUS$1.85\n7D\n-8.0%\n1Y\n-56.8%\nXtalPi Holdings\nMarket Cap: US$40.9b\nAn investment holding company, engages in the provision of robotics and drug discovery solutions in Mainland China, the United States, and internationally.\nQNTP.F\nUS$1.20\n7D\n14.3%\n1Y\nn/a\nNeuroOne Medical Technologies\nMarket Cap: US$38.5m\nA medical technology company, provides solutions for continuous electroencephalogram (cEEG) and stereoelectrocencephalography (sEEG) recording in the United States.\nNMTC\nUS$0.78\n7D\n-4.3%\n1Y\n0.1%\nBioXcel Therapeutics\nMarket Cap: US$76.1m\nTogether with its subsidiary, OnkosXcel Therapeutics LLC, operates as a biopharmaceutical company that utilizes artificial intelligence approaches to develop medicines in neuroscience and immuno-oncology in the United States.\nBTAI\nUS$4.98\n7D\n-9.1%\n1Y\n-54.2%\nLantheus Holdings\nMarket Cap: US$4.0b\nDevelops, manufactures, and commercializes diagnostic and therapeutic products that assist clinicians in diagnosis and treatment of heart, cancer, and other diseases worldwide.\nLNTH\nUS$58.21\n7D\n7.4%\n1Y\n-45.7%\nAbsci\nMarket Cap: US$382.8m\nOperates as a data-first generative artificial intelligence (AI) drug creation company in the United States.\nABSI\nUS$2.63\n7D\n-10.2%\n1Y\n-41.4%\nHealwell AI\nMarket Cap: US$372.7m\nA healthcare artificial intelligence company, develops and commercializes clinical decision support systems in Canada, New Zealand, Australia, and the United Kingdom.\nHWAI.F\nUS$0.99\n7D\n4.2%\n1Y\n-34.9%\nVeradigm\nMarket Cap: US$823.7m\nA healthcare technology company, provides information technology solutions to healthcare providers, payers, and biopharma markets in the United States and internationally.\nMDRX\nUS$4.85\n7D\n5.4%\n1Y\n-50.0%\nPersonalis\nMarket Cap: US$413.2m\nDevelops, markets, and sells advanced cancer genomic tests and services in the United States and internationally.\nPSNL\nUS$4.83\n7D\n5.0%\n1Y\n-19.1%"
    },
    {
      "url": "https://simplywall.st/company/id/4A9FF5A5-A731-439C-8371-DE9447EC6398?blueprint=4011864&utm_medium=finance_user&utm_campaign=cta&utm_source=yahoo",
      "text": "Vault Minerals (VAU) Stock Overview\nEngages in the exploration, mine development, mine operations and the sale of gold and gold/copper concentrate in Australia and Canada. More details\n| Snowflake Score | |\n|---|---|\n| Valuation | 6/6 |\n| Future Growth | 1/6 |\n| Past Performance | 3/6 |\n| Financial Health | 6/6 |\n| Dividends | 0/6 |\nRewards\nRisk Analysis\nNo risks detected for VAU from our risk checks.\nVAU Community Fair Values\nCreate NarrativeSee what 53 others think this stock is worth. Follow their fair value or set your own to get alerts.\nVault Minerals Limited Competitors\nPrice History & Performance\n| Historical stock prices | |\n|---|---|\n| Current Share Price | AU$0.49 |\n| 52 Week High | AU$0.50 |\n| 52 Week Low | AU$0.28 |\n| Beta | 0.46 |\n| 1 Month Change | 22.22% |\n| 3 Month Change | 10.00% |\n| 1 Year Change | 41.43% |\n| 3 Year Change | 90.38% |\n| 5 Year Change | 73.68% |\n| Change since IPO | -71.71% |\nRecent News & Updates\nAn Intrinsic Calculation For Vault Minerals Limited (ASX:VAU) Suggests It's 50% Undervalued\nApr 16There's No Escaping Vault Minerals Limited's (ASX:VAU) Muted Revenues\nJan 20Recent updates\nAn Intrinsic Calculation For Vault Minerals Limited (ASX:VAU) Suggests It's 50% Undervalued\nApr 16There's No Escaping Vault Minerals Limited's (ASX:VAU) Muted Revenues\nJan 20Red 5 Limited's (ASX:RED) Price Is Right But Growth Is Lacking\nJun 03Here's Why Red 5 (ASX:RED) Can Manage Its Debt Responsibly\nApr 18Red 5 Limited (ASX:RED) Shares Could Be 46% Below Their Intrinsic Value Estimate\nJan 24Is Red 5 (ASX:RED) Using Too Much Debt?\nOct 31New Forecasts: Here's What Analysts Think The Future Holds For Red 5 Limited (ASX:RED)\nMar 01Is Red 5 (ASX:RED) Using Too Much Debt?\nSep 04An Intrinsic Calculation For Red 5 Limited (ASX:RED) Suggests It's 25% Undervalued\nMay 09We Think Red 5 (ASX:RED) Can Stay On Top Of Its Debt\nMar 15Shareholder Returns\n| VAU | AU Metals and Mining | AU Market | |\n|---|---|---|---|\n| 7D | 15.1% | -0.8% | 0.2% |\n| 1Y | 41.4% | 12.2% | 11.4% |\nReturn vs Industry: VAU exceeded the Australian Metals and Mining industry which returned 12.2% over the past year.\nReturn vs Market: VAU exceeded the Australian Market which returned 11.4% over the past year.\nPrice Volatility\n| VAU volatility | |\n|---|---|\n| VAU Average Weekly Movement | 6.9% |\n| Metals and Mining Industry Average Movement | 11.2% |\n| Market Average Movement | 8.8% |\n| 10% most volatile stocks in AU Market | 18.7% |\n| 10% least volatile stocks in AU Market | 3.2% |\nStable Share Price: VAU has not had significant price volatility in the past 3 months compared to the Australian market.\nVolatility Over Time: VAU's weekly volatility (7%) has been stable over the past year.\nAbout the Company\n| Founded | Employees | CEO | Website |\n|---|---|---|---|\n| 1995 | n/a | Luke Tonkin | vaultminerals.com |\nVault Minerals Limited engages in the exploration, mine development, mine operations and the sale of gold and gold/copper concentrate in Australia and Canada. The company operates through Leonora Operations (King of the Hills and Darlot operations), Mount Monger Operation, Deflector Region (Deflector and Rothsay operations), and Sugar Zone Operation segments. The company was formerly known as Red 5 Limited and changed its name to Vault Minerals Limited in September 2024.\nVault Minerals Limited Fundamentals Summary\n| VAU fundamental statistics | |\n|---|---|\n| Market cap | AU$3.37b |\n| Earnings (TTM) | AU$236.98m |\n| Revenue (TTM) | AU$1.43b |\nIs VAU overvalued?\nSee Fair Value and valuation analysisEarnings & Revenue\n| VAU income statement (TTM) | |\n|---|---|\n| Revenue | AU$1.43b |\n| Cost of Revenue | AU$1.11b |\n| Gross Profit | AU$319.71m |\n| Other Expenses | AU$82.73m |\n| Earnings | AU$236.98m |\nLast Reported Earnings\nJun 30, 2025\nNext Earnings Date\nn/a\n| Earnings per share (EPS) | 0.035 |\n| Gross Margin | 22.32% |\n| Net Profit Margin | 16.55% |\n| Debt/Equity Ratio | 0% |\nHow did VAU perform over the long term?\nSee historical performance and comparisonCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/23 21:03 |\n| End of Day Share Price | 2025/08/22 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2025/06/30 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nVault Minerals Limited is covered by 13 analysts. 9 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Daniel Morgan | Barrenjoey Markets Pty Limited |\n| Tim McCormack | Canaccord Genuity |\n| Reg Spencer | Canaccord Genuity (Australia) |"
    },
    {
      "url": "https://simplywall.st/company/id/4A9FF5A5-A731-439C-8371-DE9447EC6398/future?blueprint=4011864&amp;utm_medium=finance_user&amp;utm_campaign=infographic&amp;utm_source=yahoo",
      "text": "Vault Minerals Future Growth\nFuture criteria checks 1/6\nVault Minerals is forecast to grow earnings and revenue by 4.4% and 2.9% per annum respectively. EPS is expected to grow by 8.1% per annum. Return on equity is forecast to be 14% in 3 years.\nKey information\n4.4%\nEarnings growth rate\n8.12%\nEPS growth rate\n| Metals and Mining earnings growth | 10.9% |\n| Revenue growth rate | 2.9% |\n| Future return on equity | 13.98% |\n| Analyst coverage | Good |\n| Last updated | 22 Aug 2025 |\nRecent future growth updates\nRecent updates\nAn Intrinsic Calculation For Vault Minerals Limited (ASX:VAU) Suggests It's 50% Undervalued\nApr 16There's No Escaping Vault Minerals Limited's (ASX:VAU) Muted Revenues\nJan 20Red 5 Limited's (ASX:RED) Price Is Right But Growth Is Lacking\nJun 03Here's Why Red 5 (ASX:RED) Can Manage Its Debt Responsibly\nApr 18Red 5 Limited (ASX:RED) Shares Could Be 46% Below Their Intrinsic Value Estimate\nJan 24Is Red 5 (ASX:RED) Using Too Much Debt?\nOct 31New Forecasts: Here's What Analysts Think The Future Holds For Red 5 Limited (ASX:RED)\nMar 01Is Red 5 (ASX:RED) Using Too Much Debt?\nSep 04An Intrinsic Calculation For Red 5 Limited (ASX:RED) Suggests It's 25% Undervalued\nMay 09We Think Red 5 (ASX:RED) Can Stay On Top Of Its Debt\nMar 15Earnings and Revenue Growth Forecasts\n| Date | Revenue | Earnings | Free Cash Flow | Cash from Op | Avg. No. Analysts |\n|---|---|---|---|---|---|\n| 6/30/2028 | 1,821 | 400 | 569 | 751 | 7 |\n| 6/30/2027 | 1,812 | 373 | 514 | 721 | 9 |\n| 6/30/2026 | 1,591 | 294 | 336 | 648 | 9 |\n| 6/30/2025 | 1,432 | 237 | 239 | 540 | N/A |\n| 3/31/2025 | 1,224 | 161 | 239 | 445 | N/A |\n| 12/31/2024 | 1,015 | 85 | 239 | 350 | N/A |\n| 9/30/2024 | 818 | 40 | 211 | 278 | N/A |\n| 6/30/2024 | 620 | -5 | 182 | 207 | N/A |\n| 3/31/2024 | 583 | 22 | 156 | 160 | N/A |\n| 12/31/2023 | 546 | 49 | 130 | 113 | N/A |\n| 9/30/2023 | 485 | 20 | 73 | 80 | N/A |\n| 6/30/2023 | 423 | -9 | 16 | 47 | N/A |\n| 12/31/2022 | 245 | -51 | -81 | 29 | N/A |\n| 9/30/2022 | 205 | -50 | -91 | 13 | N/A |\n| 6/30/2022 | 165 | -49 | -101 | -2 | N/A |\n| 12/31/2021 | 156 | -36 | -169 | -6 | N/A |\n| 9/30/2021 | 165 | -22 | -131 | 4 | N/A |\n| 6/30/2021 | 173 | -9 | -93 | 15 | N/A |\n| 12/31/2020 | 193 | 3 | -11 | 36 | N/A |\n| 9/30/2020 | 197 | 7 | 2 | 44 | N/A |\n| 6/30/2020 | 200 | 11 | 15 | 52 | N/A |\n| 3/31/2020 | 194 | 3 | 23 | 53 | N/A |\n| 12/31/2019 | 188 | 1 | 32 | 54 | N/A |\n| 9/30/2019 | 171 | -1 | 20 | 39 | N/A |\n| 6/30/2019 | 154 | -3 | 8 | 23 | N/A |\n| 3/31/2019 | 132 | -4 | N/A | 18 | N/A |\n| 12/31/2018 | 110 | -6 | N/A | 13 | N/A |\n| 9/30/2018 | 94 | -9 | N/A | 16 | N/A |\n| 6/30/2018 | 77 | -12 | N/A | 19 | N/A |\n| 3/31/2018 | 57 | -43 | N/A | N/A | N/A |\n| 12/31/2017 | 50 | -39 | N/A | 15 | N/A |\n| 9/30/2017 | 60 | -119 | N/A | N/A | N/A |\n| 6/30/2017 | 69 | -108 | N/A | 2 | N/A |\n| 3/31/2017 | 94 | -67 | N/A | N/A | N/A |\n| 12/31/2016 | 107 | -60 | N/A | 27 | N/A |\n| 9/30/2016 | 101 | 26 | N/A | N/A | N/A |\n| 6/30/2016 | 97 | 21 | N/A | 54 | N/A |\n| 3/31/2016 | 88 | -39 | N/A | N/A | N/A |\n| 12/31/2015 | 75 | -42 | N/A | 31 | N/A |\n| 9/30/2015 | 51 | -51 | N/A | N/A | N/A |\n| 6/30/2015 | 28 | -59 | N/A | 4 | N/A |\n| 3/31/2015 | 12 | 2 | N/A | N/A | N/A |\n| 12/31/2014 | 0 | -3 | N/A | 0 | N/A |\n| 9/30/2014 | 0 | -6 | N/A | N/A | N/A |\nAnalyst Future Growth Forecasts\nEarnings vs Savings Rate: VAU's forecast earnings growth (4.4% per year) is above the savings rate (3.1%).\nEarnings vs Market: VAU's earnings (4.4% per year) are forecast to grow slower than the Australian market (10.7% per year).\nHigh Growth Earnings: VAU's earnings are forecast to grow, but not significantly.\nRevenue vs Market: VAU's revenue (2.9% per year) is forecast to grow slower than the Australian market (5.4% per year).\nHigh Growth Revenue: VAU's revenue (2.9% per year) is forecast to grow slower than 20% per year.\nEarnings per Share Growth Forecasts\nFuture Return on Equity\nFuture ROE: VAU's Return on Equity is forecast to be low in 3 years time (14%).\nDiscover growth companies\nCompany Analysis and Financial Data Status\n| Data | Last Updated (UTC time) |\n|---|---|\n| Company Analysis | 2025/08/23 21:03 |\n| End of Day Share Price | 2025/08/22 00:00 |\n| Earnings | 2025/06/30 |\n| Annual Earnings | 2025/06/30 |\nData Sources\nThe data used in our company analysis is from S&P Global Market Intelligence LLC. The following data is used in our analysis model to generate this report. Data is normalised which can introduce a delay from the source being available.\n| Package | Data | Timeframe | Example US Source * |\n|---|---|---|---|\n| Company Financials | 10 years |\n| |\n| Analyst Consensus Estimates | +3 years |\n|\n|\n| Market Prices | 30 years |\n| |\n| Ownership | 10 years |\n| |\n| Management | 10 years |\n| |\n| Key Developments | 10 years |\n|\n* Example for US securities, for non-US equivalent regulatory forms and sources are used.\nUnless specified all financial data is based on a yearly period but updated quarterly. This is known as Trailing Twelve Month (TTM) or Last Twelve Month (LTM) Data. Learn more.\nAnalysis Model and Snowflake\nDetails of the analysis model used to generate this report is available on our Github page, we also have guides on how to use our reports and tutorials on Youtube.\nLearn about the world class team who designed and built the Simply Wall St analysis model.\nIndustry and Sector Metrics\nOur industry and section metrics are calculated every 6 hours by Simply Wall St, details of our process are available on Github.\nAnalyst Sources\nVault Minerals Limited is covered by 13 analysts. 9 of those analysts submitted the estimates of revenue or earnings used as inputs to our report. Analysts submissions are updated throughout the day.\n| Analyst | Institution |\n|---|---|\n| Daniel Morgan | Barrenjoey Markets Pty Limited |\n| Tim McCormack | Canaccord Genuity |\n| Reg Spencer | Canaccord Genuity (Australia) |"
    },
    {
      "url": "https://simplywall.st/markets/au/materials/metals-mining?blueprint=4011864&utm_medium=finance_user&utm_campaign=industry&utm_source=yahoo",
      "text": "Last week, the Metals and Mining industry hasn't moved much but Vault Minerals is up 15% in that time. As for the the longer term, the industry is up 12% over the past 12 months. Earnings are forecast to grow by 11% annually.\nHas the Australian Metals and Mining Industry valuation changed over the past few years?\n| Date | Market Cap | Revenue | Earnings | PE | Absolute PE | PS |\n|---|---|---|---|---|---|---|\n| Sun, 24 Aug 2025 | AU$499.6b | AU$204.6b | AU$19.1b | 14.3x | 26.2x | 2.4x |\n| Tue, 22 Jul 2025 | AU$469.6b | AU$204.5b | AU$21.6b | 13.4x | 21.7x | 2.3x |\n| Thu, 19 Jun 2025 | AU$438.6b | AU$205.1b | AU$21.7b | 12.9x | 20.2x | 2.1x |\n| Sat, 17 May 2025 | AU$448.0b | AU$206.6b | AU$22.0b | 11.9x | 20.4x | 2.2x |\n| Mon, 14 Apr 2025 | AU$406.8b | AU$209.5b | AU$22.5b | 11.5x | 18.1x | 1.9x |\n| Wed, 12 Mar 2025 | AU$422.9b | AU$208.9b | AU$22.4b | 11.7x | 18.9x | 2x |\n| Fri, 07 Feb 2025 | AU$458.6b | AU$212.8b | AU$21.4b | 13.5x | 21.4x | 2.2x |\n| Sun, 05 Jan 2025 | AU$439.4b | AU$214.0b | AU$21.7b | 12.3x | 20.3x | 2.1x |\n| Tue, 03 Dec 2024 | AU$454.0b | AU$207.8b | AU$20.8b | 12.1x | 21.9x | 2.2x |\n| Thu, 31 Oct 2024 | AU$477.0b | AU$206.2b | AU$20.7b | 13.4x | 23.1x | 2.3x |\n| Sat, 28 Sep 2024 | AU$481.6b | AU$200.2b | AU$20.0b | 13x | 24x | 2.4x |\n| Mon, 26 Aug 2024 | AU$438.4b | AU$205.4b | AU$20.2b | 13.1x | 21.7x | 2.1x |\n| Wed, 24 Jul 2024 | AU$455.1b | AU$209.1b | AU$20.8b | 13.4x | 21.9x | 2.2x |\n| Fri, 21 Jun 2024 | AU$467.9b | AU$208.8b | AU$20.8b | 13.4x | 22.5x | 2.2x |\n| Sun, 19 May 2024 | AU$512.4b | AU$208.7b | AU$20.9b | 15.2x | 24.5x | 2.5x |\n| Tue, 16 Apr 2024 | AU$509.2b | AU$213.5b | AU$21.7b | 13.4x | 23.5x | 2.4x |\n| Thu, 14 Mar 2024 | AU$473.2b | AU$211.6b | AU$21.7b | 13x | 21.8x | 2.2x |\n| Sat, 10 Feb 2024 | AU$500.2b | AU$210.3b | AU$31.6b | 11.6x | 15.8x | 2.4x |\n| Mon, 08 Jan 2024 | AU$567.6b | AU$220.4b | AU$32.3b | 12x | 17.6x | 2.6x |\n| Wed, 06 Dec 2023 | AU$533.9b | AU$223.7b | AU$32.9b | 10.4x | 16.2x | 2.4x |\n| Fri, 03 Nov 2023 | AU$524.3b | AU$226.6b | AU$33.7b | 10.4x | 15.5x | 2.3x |\n| Sun, 01 Oct 2023 | AU$519.2b | AU$226.9b | AU$33.9b | 10.7x | 15.3x | 2.3x |\n| Tue, 29 Aug 2023 | AU$517.8b | AU$226.9b | AU$36.0b | 10.7x | 14.4x | 2.3x |\n| Thu, 27 Jul 2023 | AU$563.9b | AU$231.4b | AU$48.1b | 9.9x | 11.7x | 2.4x |\n| Sat, 24 Jun 2023 | AU$538.1b | AU$233.0b | AU$48.6b | 10x | 11.1x | 2.3x |\n| Mon, 22 May 2023 | AU$542.9b | AU$233.8b | AU$48.8b | 9.7x | 11.1x | 2.3x |\n| Wed, 19 Apr 2023 | AU$567.0b | AU$231.9b | AU$48.4b | 9.9x | 11.7x | 2.4x |\n| Fri, 17 Mar 2023 | AU$515.6b | AU$229.7b | AU$48.5b | 9.3x | 10.6x | 2.2x |\n| Sun, 12 Feb 2023 | AU$569.7b | AU$225.1b | AU$52.1b | 11.7x | 10.9x | 2.5x |\n| Tue, 10 Jan 2023 | AU$564.0b | AU$225.0b | AU$51.7b | 11.6x | 10.9x | 2.5x |\n| Thu, 08 Dec 2022 | AU$553.1b | AU$229.6b | AU$53.1b | 11.3x | 10.4x | 2.4x |\n| Sat, 05 Nov 2022 | AU$473.6b | AU$239.9b | AU$56.2b | 9.7x | 8.4x | 2x |\n| Mon, 03 Oct 2022 | AU$464.0b | AU$235.9b | AU$55.2b | 8.9x | 8.4x | 2x |\n| Wed, 31 Aug 2022 | AU$497.5b | AU$222.3b | AU$52.9b | 9.5x | 9.4x | 2.2x |\n9.4x\nWhich industries have driven the changes within the Australian Materials industry?\n| AU Market | 0.22% | |\n| Materials | -2.31% | |\n| Metals and Mining | -0.79% | |\n| Aluminum | 0.38% | |\n| Gold | 0.16% | |\n| Precious Metals and Minerals | -0.41% | |\n| Diversified Metals and Mining | -0.64% | |\n| Copper | -1.04% | |\n| Steel | -2.49% | |\n| Silver | -4.99% |\nWhich companies have driven the market over the last 7 days?\n| Company | Last Price | 7D | 1Y | Valuation | |\n|---|---|---|---|---|---|\n| VAU Vault Minerals | AU$0.49 | 15.1% +AU$442.2m | 41.4% | PE14.2x | |\n| BHP BHP Group | AU$42.00 | 0.1% +AU$325.7m | 3.3% | PE15.3x | |\n| EVN Evolution Mining | AU$8.11 | 1.2% +AU$201.4m | 87.3% | PE17.6x | |\n| MAH Macmahon Holdings | AU$0.43 | 16.2% +AU$136.1m | 30.3% | PE12.4x | |\n| WGX Westgold Resources | AU$3.22 | 4.2% +AU$122.7m | 8.4% | PE29.4x |"
    }
  ],
  "argos_summary": "Vault Minerals Limited reported 2024 revenue of AU$1.4 billion and earnings per share of AU$0.035, leading to a 15 % share price rise to AU$0.49. Analysts now project 2026 revenue of AU$1.59 billion and EPS of AU$0.044, a slight downgrade in earnings expectations but unchanged price target of AU$0.61, with a valuation range of AU$0.50–0.75. Forecasts show modest revenue growth of 2.9 % and earnings growth of 4.4 % per year, slower than the broader Australian metals and mining sector but still above the industry average. The article also highlights a list of 27 AI‑driven healthcare companies, illustrating broader market trends in technology‑enabled diagnostics and drug discovery.",
  "argos_id": "LMDWEGA1E"
}