{
  "url": "https://www.forbes.com/sites/everettpotter/2025/08/24/orient-express-corinthian-worlds-largest-sailing-yacht-sets-sail-in-october-2026/",
  "authorsByline": "Everett Potter",
  "articleId": "91a5116e25c241b1991599e200b8fdcf",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://specials-images.forbesimg.com/imageserve/68a35e0a0e5a716eed6a60ec/orientexpress-sailingyachts-corinthian-bonifacio-yacht-rendering-2025/960x0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T05:02:00+00:00",
  "addDate": "2025-08-24T05:05:52.435087+00:00",
  "refreshDate": "2025-08-24T05:05:52.435089+00:00",
  "score": 1.0,
  "title": "Orient Express Corinthian, World’s Largest Sailing Yacht, Sets Sail In October 2026",
  "description": "The Corinthian promises Art Deco design on the high seas, calling at smaller islands and ports in the Caribbean",
  "content": "The Orient Express Corinthian, a 722-foot luxury yacht, sets sail on its inaugural Caribbean season in October 2026. You can think of it as the marriage of a private yacht and a vintage Art Deco train.\n\nWhat’s the train connection? Well, the yacht is the brainchild of Orient Express, the company behind the recently launched La Dolce Vita Orient Express train, which I recently wrote about in Forbes. This is a train that has been thoughtfully designed to recall the splendor of 1960s Italian design as it takes well-heeled guests on jaunts around Italy. That same incredible attention to detail, albeit in a style that recalls the heyday of Art Deco, is also at work here.\n\nFrench yachtmaker Chantiers de l’Atlantique was enlisted to build the Corinthian and its sister ship, Orient Express Olympian, with the latter expected to debut in 2027.\n\nIt’s not that unusual for a luxury company that creates trains and hotels to venture into the world of luxury cruising. After all, hotel companies such as Belmond, Four Seasons, and Aman have also dipped their toes into yachts.\n\nA Ships that Recalls the Art Deo Style of the Normandie\n\nThis 54-suite sailing yacht will offer on board luxury and carefully crafted itineraries through some of the region’s most beautiful destinations. Architect Maxime d’Angeac, Artistic Director of Orient Express, conceived what the company describes in a press statement as “refined interiors that reinterpret the golden age of rail travel with a contemporary sensibility, echoing the grandeur of legendary ocean liners such as Normandie, calling upon the finest French artisans of art and craft.”\n\nThe Corinthian’s 54 suites range in size from 485 square feet to an astonishing 2,476 square feet. All of them feature expansive picture windows or terraces and elevated ceilings. The ship's public areas include eight bars, a Parisian-themed cabaret, and five restaurants, the latter overseen by multi-Michelin-starred chef Yannick Alléno, who is also Executive Chef of both the L’Orient Express train and Orient Express Sailing Yachts.\n\nThere will be a recording studio, two swimming pools, and a marina as well.\n\nThe Corinthian will have three sails that were designed with ‘SolidSail’ technology, encompassing 16,000 square feet of rigid sails, with three masts reaching 328 feet high. The aim is for 100% propulsion based on weather conditions. As a backup, the ship’s engines will have an environmentally friendly propulsion system that uses liquefied natural gas (LNG).\n\nOn October 12th, 2026, the Corinthian will sail from Lisbon on its inaugural 14-night transatlantic voyage to Barbados. The journey will have a wellness theme, and this will commence the ship’s autumn and winter season. From October through March, Orient Express Corinthian will offer two to nine-night Caribbean escapes. With ports of call like Saint-Barth, Moskito Island, the Exumas, and Tobago Cays, the itineraries are mostly off-the-beaten-path stops in the Caribbean.\n\nOrient Express is part of Accor Group’s collection of luxury brands and joined with LVMH in 2024. The company opened its first hotel, Orient Express La Minerva, in Rome this past April. I recently wrote about its second hotel, Orient Express Palazzo Donà Giovannelli, which will debut in Venice in 2026, here in the pages of Forbes.\n\nGo to Orient Express Corinthian for more details.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/everettpotter/2025/04/07/italys-new-luxury-train-la-dolce-vita-orient-express-debuts/",
    "https://sailing-yachts.orient-express.com/en/sailing-yachts",
    "https://www.forbes.com/sites/everettpotter/2025/08/10/venices-newest-luxury-hotel-orient-express-palazzo-don-giovannelli-debuts-in-april-2026/",
    "https://sailing-yachts.orient-express.com/en/sailing-yachts/yachts/orient-express-corinthian"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Orient Express Corinthian",
      "weight": 0.11158852
    },
    {
      "name": "Orient Express",
      "weight": 0.10465268
    },
    {
      "name": "Orient Express Olympian",
      "weight": 0.09968516
    },
    {
      "name": "Orient Express La Minerva",
      "weight": 0.09751723
    },
    {
      "name": "La Dolce Vita Orient Express",
      "weight": 0.093108945
    },
    {
      "name": "Orient Express Sailing Yachts",
      "weight": 0.09297114
    },
    {
      "name": "Orient Express Palazzo Donà Giovannelli",
      "weight": 0.09170644
    },
    {
      "name": "L’Orient Express",
      "weight": 0.08442699
    },
    {
      "name": "hotel companies",
      "weight": 0.06940044
    },
    {
      "name": "The Orient Express Corinthian",
      "weight": 0.06585608
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [],
  "sentiment": {
    "positive": 0.53469795,
    "negative": 0.057132546,
    "neutral": 0.40816948
  },
  "summary": "The Orient Express Corinthian, a 722-foot luxury yacht, is set to sail in October 2026 for its inaugural Caribbean season. The yacht is the brainchild of Orient Express, the company behind the recently launched La Dolce Vita Orient Express train. The Corinthian's 54 suites range in size from 485 square feet to an astonishing 2,476 square feet, and its sister ship, Orient Express Olympian, is expected to debut in 2027. The ship's public areas include eight bars, a Parisian-themed cabaret, and five restaurants overseen by multi-Michelin-starred chef Yannick Alléno. On October 12th, 2026, the Corinthian will sail from Lisbon on its inaugural 14-night transatlantic voyage to Barbados.",
  "shortSummary": "The Orient Express Corinthian, a 722-foot luxury yacht, will sail in October 2026 for Caribbean cruises, inspired by the La Dolce Vita Orient Express train.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "af927a86b54f41c58fad0c3f14e2c050",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/everettpotter/2025/08/10/venices-newest-luxury-hotel-orient-express-palazzo-don-giovannelli-debuts-in-april-2026/",
      "text": "For well-heeled Italophiles, the good news is that bookings have opened for Orient Express Palazzo Donà Giovannelli in Venice, which is welcoming guests from April 2026 onward. Located in a 15th-century Venetian palazzo that reflects both Neogothic and Baroque architectural styles, the hotel has 47 guestrooms, suites, and apartments.\nOrient Express is a partnership between Accor and LVMH, the world’s most prestigious luxury company (and not to be confused with Belmond, the company behind the Venice Simplon-Orient-Express and other trains and luxury hotels).\n“More than a hotel, Orient Express Palazzo Donà Giovannelli is a transformative voyage through centuries of splendor.”\nThis follows two other Orient Express and Accor debuts in 2025: the unveiling of their first hotel, Orient Express La Minerva in Rome, and the rollout of La Dolce Vita Orient Express luxury train, which I recently wrote about here in Forbes.\nOrient Express Palazzo Donà Giovannelli is situated in Cannaregio. This island still feels like the Venice of half a century ago, a quiet place that’s still the lair of residents and thankfully removed from the daily circus of San Marco.\nLocated at the confluence of two canals, the palazzo was a noble residence built in 1436 during the reign of architect Filippo Calendario, the visionary behind the Doge’s Palace.\nFormerly the private residence of the Dona and Giovannelli families,who were great patrons of the arts, it was later gifted to the Duke of Urbino. The Palazzo Dona has a legacy of grandeur and celebration, not to mention gilded ballrooms and hidden passageways.\nThis extraordinary building was restored under the guidance of architect and interior designer Aline Asmar d’Amman. It’s a theatrical space, with period frescoes and mosaic floors. The architecture speaks to Venice as a crossroads of civilizations, blending the Neogothic and the Baroque, and the façade has seven remarkable hand-carved Gothic windows.\n“More than a hotel, Orient Express Palazzo Donà Giovannelli is a transformative voyage through centuries of splendor,” Gilda Perez-Alvarado, Orient Express CEO, said in a press statement. “Rooted in the poetic vision of Orient Express, this Venetian property embodies a heritage in motion where every stay becomes a passage through memory, art, and emotion.”\nA stay at the hotel begins with a dramatic journey. Guests arrive by private boat, arriving through a 15th-century Gothic portal on the canal, pass through a discreet doorway into Santa Fosca’s secret garden, or step off the Strada Nova into the courtyard.\nThe theatrical lobby has a high wooden ceiling and is filled with light. There’s a striking octagonal staircase, a 19th-century addition by Giovanni Battista Meduna, the architect behind Venice’s Ca’d’Oro and the original La Fenice theatre. A celestial stone and glass vault crowns it.\nAt the Piano Nobile, you’ll find a series of storied rooms, including the Baroque-style Vittoria Ballroom, created for the 1548 wedding of Princess Vittoria Farnese. The Library of Cultures is decorated with lapis lazuli pigments and gilded wood, while the Music Room is redolent of Venice’s golden age.\nThere are 47 luxurious rooms, featuring 29 rooms and 16 suites, including six Signature Suites, and two Orient Express Apartments. The six Signature Suites are located on the Piano Nobile and the first floor. At the same time, the first-ever Orient Express Apartments are housed in an adjacent building and offer outstanding canal views.\nThe hotel’s culinary offerings will include an intimate fine dining restaurant with private boat access, an all-day dining space overlooking the courtyard and lush garden – a rarity in Venice – and the iconic Wagon Bar, a nod to the golden age of rail travel.\nThere’s more to come for Orient Express. They have two sailing yachts that will launch in 2026 and 2027. They also plan to bring back the original Orient Express train, which will travel across various routes in Europe.\nFor more details on the new Venice hotel, visit Orient Express Palazzo Donà Giovannelli"
    },
    {
      "url": "https://www.forbes.com/sites/everettpotter/2025/04/07/italys-new-luxury-train-la-dolce-vita-orient-express-debuts/",
      "text": "La Dolce Vita Orient Express, the first Italian-made luxury train, rolled out of Roma Ostiense Station on April 4, 2025, on an inaugural journey that took passengers on a two-day \"Tastes of Tuscan Vineyards\" trip to the town of Montalcino.\nAs I discovered while working on my forthcoming book, National Geographic’s 100 Train Journeys of a Lifetime: The World’s Ultimate Rides (which will be published in October 2025), there’s a growing demand for over-the-top train journeys that cater to small numbers of luxury travelers on trips through some of the world’s most scenic locations, excursions that cater to slow travel, nostalgia, and an appetite for the golden days of rail travel.\nThe Journeys\nThe itineraries have been designed to create exclusive travel experiences, ranging from north to south in Italy, providing glimpses of the Alps as well as the southern coastline. The majority of the journeys will depart from Rome and can include cities such as Milan, Florence, and Venice, as well as the island of Sicily, via the world's only passenger rail ferry. Some trains will travel within Sicily, leaving from Catania and Palermo.\nTwo-night journeys include Rome, Venice, and Portofino, as well as Rome, Venice, and Siena. Themed journeys include Eternal Stones of Matera, The Truffle Route, and Rome to Sicily.\nThe itineraries have been created in tandem with Orient Express’ first hotels, which will also debut in 2025: the Orient Express La Minerva in Rome and the Orient Express Palazzo Donà Giovannelli in Venice.\nOn Board The Train\nLa Dolce Vita Orient Express has 12 carriages, with 31 cabins, including 18 suites, 12 deluxe cabins, and the signature La Dolce Vita Suite. The carriages were originally Z1 Italian model carriages, but they have been reimagined and rebuilt. The train is Italy’s first private luxury rail fleet, with plans to have six such trains in the future. They all feature double beds, a sofa, armchairs, and a private bathroom. All cabins will offer room service, and the restaurant car will provide lunch, dinner, and afternoon tea. The Bar Car will feature live music, an aperitivo and antipasti buffet, after-dinner cocktails, and Italian wines. Chef Heinz Beck, based at the Rome Cavalieri, A Waldorf Astoria Hotel, holds three Michelin stars and oversees the dining program of La Dolce Vita, inspired by the regions it traverses. A new Orient Express Lounge at Roma Ostiense Station, created by artist-architect Hugo Toro, is where guests gather before the journey.\nThe 1960’s Inspired Design\nThe train’s design inspiration is La Dolce Vita, “The Sweet Life,” a name bequeathed to an Italian attitude and lifestyle synonymous with the country’s décor, art, and architecture of the 1960s. It was made famous by Federico Fellini’s film of the same name. Dimorestudio, an architecture and design studio founded by Emiliano Salci and Britt Moran, undertook the design work, drawing inspiration from mid-century Italian design masters such as Giò Ponti, Nanda Vigo, Gae Aulenti, and Osvaldo Borsani. Expect playful geometric patterns and minimalist palettes.\nA La Dolce Vita Orient Express reservation includes the round-trip transfer to and from the train station, accommodation, the table d’hôte, beverages (such as selected wine and spirits, mineral water, soft drinks, tea, and coffee), onboard entertainment, exclusive experiences, as well as all applicable taxes. There are optional off-board experiences for a fee. Prices do not include insurance and gratuities. Fares start at $3,828 per person per night in a deluxe cabin, based on double occupancy.\nThe Orient Express La Dolce Vita is a partnership between the French hotel group Accor and the Italian luxury hospitality group Arsenale S.P.A., with a railway partnership with Trenitalia—Gruppo Ferrovie dello Stato—and the Fondazione FS Italiane. Note that Orient Express is a different company from the Venice Simplon-Orient-Express, which is owned by Belmond, a part of LVMH.\nDetails can be found at La Dolce Vita Orient Express."
    },
    {
      "url": "https://sailing-yachts.orient-express.com/en/sailing-yachts/yachts/orient-express-corinthian",
      "text": "Orient Express Corinthian\n140 years after unveiling its first luxury trains, the legendary Orient Express embarks on an unprecedented new chapter: Orient Express Corinthian, the world’s largest sailing yacht. A revolution in maritime travel, this extraordinary vessel redraws the contours of adventure and elegance.\nWith only 54 exquisitely appointed suites, Orient Express Corinthian distills the heritage of Orient Express into a floating sanctuary of refinement. Each suite offering panoramic sea views, guests are invited to unique journeys through the Mediterranean's most enchanting locales.\nACCOMODATIONS\nAboard Orient Express Corinthian, every detail tells a story. Conceived as a floating palace, the yacht embodies the finest French craftsmanship, infused with influences from the world’s most inspiring cultures. From intricate glasswork to curated art collections, each space is designed for discovery, where elegance unfolds in quiet, effortless harmony.\nLuxury here is more than an aesthetic, it is an experience. The soft glow of vintage-inspired lighting, the tactile beauty of handcrafted materials, the sculptural refinement of bespoke furnishings: every element reflects a devotion to the art of living well.\nInside and out, the yacht surprises and delights, offering a constantly shifting tableau of beauty. Guests are invited into spaces that stir emotion and imagination, where timeless design meets cultural richness.\nMore than a voyage, Orient Express Corinthian is an invitation to travel through both the physical and artistic world in style and comfort.\nInspired by the legacy of Orient Express, Orient Express Corinthian reinterprets the elegance of French craftsmanship for a new era of maritime luxury. From bespoke interiors to meticulously curated cultural experiences, each voyage is a seamless fusion of artistry and exploration.\nMore than a journey, it is a celebration of cultures, seen from an unparalleled vantage point: where heritage and modernity meet in perfect harmony. Every detail is infused with the spirit of discovery, offering guests a timeless connection to the past and present of French excellence.\nAn ode to Orient Express tradition of wonder and refinement, the vessel embodies the grace of classic French aesthetics while embracing contemporary innovation.\nEvery space, every material, every carefully placed detail tells a story, creating an atmosphere where history and design converge, ensuring an unforgettable voyage steeped in culture, elegance and the art of travel.\nRestaurants & Bars\n“Orient Express embodies travel in its noblest essence, and it is an honor to bring my vision of cuisine to this iconic universe steeped in history.”\n“Orient Express embodies travel in its noblest essence, and it is an honor to bring my vision of cuisine to this iconic universe steeped in history.”\nWell-being areas\nAboard Orient Express Corinthian, the sea is your constant companion, offering a rare sense of space, freedom and tranquillity. Here, time slows down, allowing you to reconnect with yourself in an exceptional setting designed for absolute well-being.\nWhether at sunrise or sunset, in motion or at rest, every moment is an invitation to unwind.\nStay active in a fitness or yoga studio overlooking the endless horizon. Dive into adventure with water sports from the marina. Indulge in serenity at Le SPA, where exclusive treatments restore body and mind. Between the leisure pool and the exceptional swimming pools, every space is designed to rejuvenate, recharge, and renew.\nEntertainment\nMAXIME D'ANGEAC\nAt the helm of the creation of the Orient Express as Architect and Creative Director, Maxime D’Angeac directs each project with fervor and passion for thirty years. In his quest for the sublime, he favors purity, detail, the quality of planned and perfect light, and establishes the generics of his projects according to the know-how and talents of the craftsmen.\nOUR SELECTION\nOF ITINERARIES\nOF ITINERARIES\nBe part of the legend\nBe part of the legend\nElevate your next Orient Express Voyage by receiving our newsletter.\nStay Connected\nStay Connected\nYour journey begins here. Whether you seek personalized travel advice, have a special request, or simply wish to learn more about our voyages, we are at your service. Speak to your Travel Advisor or our dedicated team, and allow us to curate your next unforgettable adventure.\n- PhoneUSA & Canada+1 888-595-0930\n- PhoneFrance+33 (0)1 87 21 34 50\n- PhoneWorldwide+44 20 8163 9430\n- Emailreservations.sailingyachts@orient-express.com"
    },
    {
      "url": "https://sailing-yachts.orient-express.com/en/sailing-yachts",
      "text": "THE CARIBBEAN SEASON UNVEILED\nFrom October 2026 through March 2027, Orient Express Corinthian will offer two to nine-night escapes, charting a course through turquoise lagoons, white-sand archipelagos, crystalline bays, kaleidoscopic coral reefs, secret coves and hidden inlets.\nOur selection\nof itineraries\nof itineraries\nThe world's largest sailing yacht\nOrient Express Corinthian stands as a testament to modern naval architecture, harmoniously blending advanced technology with timeless artistry.\nThis exceptional vessel transcends conventional boundaries, embodying visionary craftsmanship and boundless innovation.\nOrient Express Sailing Yachts\nREVOLUTIONARY DESIGN\nThe development of Orient Express Sailing Yachts project presented a unique set of challenges, as contemporary standards for safety, crew, and efficiency differ vastly from those of traditional sailing ships. Designing a 1,500-square-meter (16,145-square-foot) sail posed another formidable task; many sailmakers abandoned the idea due to the immense forces involved. Yet, the engineers at Chantiers de l’Atlantique embraced the challenge, creating a patented sail using carbon fiber-reinforced glass panels instead of standard woven cloth.This innovative sail plan, paired with powerful hull lines, endows Orient Express Corinthian with its unmistakable silhouette and remarkable performance on the open sea.\nInformation\n- 220 Meters / 721 Feet Length\n- 16,000 Metric Tons\n- 1,500 M² / 16,145 Ft² Solid Sails\n- 54 Luxury Suites\n- 110 Guests\nA BESPOKE FLOATING PALACE AWAITS\nAboard Orient Express Corinthian, experience the golden age of travel with refined elegance and impeccable attention to detail.\nSavor Michelin-starred chef Yannick Alléno’s culinary masterpieces, unwind in sophisticated lounges, or indulge in Le SPA. Enjoy water sports from the Marina, live entertainment, an intimate cabaret, or even record music in our onboard studio.\nDesigned for slow sailing and exclusive anchorages, each itinerary immerses you in breathtaking destinations with once-in-a-lifetime experiences—private beach dinners, guided explorations, and gourmet delights. With seamless access to cultural treasures, every voyage transforms travel into an art form.\nBe part of the legend\nBe part of the legend\nElevate your next Orient Express Voyage by receiving our newsletter.\nStay Connected\nStay Connected\nYour journey begins here. Whether you seek personalized travel advice, have a special request, or simply wish to learn more about our voyages, we are at your service. Speak to your Travel Advisor or our dedicated team, and allow us to curate your next unforgettable adventure.\n- PhoneUSA & Canada+1 888-595-0930\n- PhoneFrance+33 (0)1 87 21 34 50\n- PhoneWorldwide+44 20 8163 9430\n- Emailreservations.sailingyachts@orient-express.com"
    }
  ],
  "argos_summary": "Orient Express Corinthian is a 722‑foot luxury sailing yacht that will launch its inaugural Caribbean season in October 2026, blending the Art Deco elegance of the historic Orient Express train with advanced sailing technology. Built by Chantiers de l’Atlantique, the vessel features 54 suites, eight bars, five restaurants led by Michelin‑starred chef Yannick Alléno, a recording studio, two pools, and a marina, and is powered 100 % by 16,000 sq ft of rigid sails with LNG‑powered engines as backup. The yacht will offer 14‑night transatlantic and 2‑ to 9‑night Caribbean itineraries, emphasizing wellness and off‑the‑beaten‑path ports such as Saint‑Barth and the Exumas. Orient Express, a joint venture of Accor and LVMH, has expanded from its iconic train and hotel brands to include this flagship yacht, alongside plans for a second train and additional luxury properties in Venice and Rome.",
  "argos_id": "MC0MHERMU"
}