{
  "url": "https://www.forbes.com/sites/sindiswamabunda/2025/08/24/aboubakar-gakou-solidifies-his-place-among-angolas-basketball-elite/",
  "authorsByline": "Sindiswa Mabunda",
  "articleId": "d55d7d31814d413a8f553b89f423d9bc",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68aa60ec54bce8859e1c3008/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T05:30:49+00:00",
  "addDate": "2025-08-24T05:38:53.644816+00:00",
  "refreshDate": "2025-08-24T05:38:53.644816+00:00",
  "score": 1.0,
  "title": "Aboubakar Gakou Solidifies His Place Among Angola’s Basketball Elite",
  "description": "Aboubakar Gakou’s journey from a late basketball starter to Angola’s star power forward highlights skill, resilience, and a pivotal role in Petro de Luanda’s success.",
  "content": "The arenas in Namibe and Luanda have been electric every time Angola, hosts and now title favourites, took to the court in pursuit of their 12th FIBA AfroBasket Championship. Every rebound, every defensive stop, every shot is magnified, while any touch from their opponents is met with a chorus of boos from the crowd. The semifinal against Cameroon was no different. The game swung back and forth, with nine lead changes and 11 tied scores, each possession ratcheting up the tension. In the final seconds of the game, Angola’s place in the final came down to three free throws, taken by none other than Aboubaker Gakou.\n\n“In my mind, I was like, I just need to make one,” he shared with Forbes.com, recalling the tense moment. “I missed the first, made the second, and the coach told me to miss the third. That’s what happened.” The calm in his words belied the intensity of the situation and the journey it represented.\n\nFor a player who only picked up basketball at 17, Gakou’s ascent has been remarkable. Within a year, he earned a spot with Atlético Petróleos de Luanda, one of Angola’s most storied clubs. Since joining in 2015, he has become a cornerstone for the team, helping them secure six Angolan Basketball League titles, three Angolan League MVP awards, multiple national cups and super cups, and a Basketball Africa League (BAL) championship in 2024. His versatility as a power forward, able to score, rebound, and defend with intensity, has made him indispensable in high-stakes games.\n\n“Sacrifice is the first word that comes to mind,” he said. “It was a tough game, very tough, but we didn’t give up. We were at a very low level at points, but we won by one point. That point was one of the most important of the game.”\n\nAngola’s rich basketball culture provided fertile ground for his rapid development. Growing up surrounded by the energy of packed arenas and inspired by local role models, he dreamed of one day wearing the national jersey. “I’ve dreamed about this since I was a kid,” he shared a day prior, following a tough game against Cape Verde. “It’s all for me, but it’s also for everyone who supported me along the way.”\n\nThe semifinal victory over Cameroon, razor-thin as it was, highlighted the team’s resilience. Despite Cameroon’s high expectations and potent offense, Angola’s defence carried the day. “Defence won us the game,” Gakou explained. “We didn’t let down, we didn’t go down ahead. The last three throws were tough. I missed one, but made the ones that mattered. That’s what won us the game.”\n\nThis mentality, a combination of skill and mental fortitude, has defined Gakou’s career. The game mirrored his journey: late start, rapid progression, and the ability to thrive under pressure. “The lesson we learned today is that to win, we need to play defence hard,” he said. “That’s what happened today. We play defence, we won the game.”\n\nThe semifinal tested nerves as much as skill. In the final seconds, Gakou stood at the free-throw line, every eye in the arena on him, knowing a single shot could decide the outcome. “In my mind, I was like, I just need to make one,” he recalled. “I missed the first, made the second, and the coach told me to miss the third. That’s what happened.”\n\nThe stakes went far beyond the scoreboard. The pressure on Gakou and his teammates reflected the nation’s expectations. Coach José Claros Canals acknowledged the significance of the moment: “Because this country has been waiting for this moment for so long. It’s not only the basketball community that is following the team; it’s absolutely the whole country that is behind us. The support that we are feeling really helps.” For Gakou, the expectation sharpened his focus, turning pressure into fuel.\n\nPlaying at home added another layer of intensity. Angola has only lost one AfroBasket game on home soil, and the packed stands amplified every moment, each cheer a reminder of the shared dream between players and supporters. “The fans have helped us a lot,” he said, glancing toward the crowd. “Tomorrow is the last day. We need 100% of your strength. We will give our 200% to win the AfroBasket.”\n\nThat connection with fans reflects more than support; it embodies community and shared purpose. Basketball in Angola is not just a sport; it is a national celebration, a tradition passed down through generations. For him, performing in front of his home crowd is both surreal and grounding. “It was a tough game, but we didn’t give up,” he said. “We will give our all tomorrow. We want to win, and we will try our best.”\n\nBeyond the court, Gakou’s story resonates because it defies the conventional narrative. Many players are lauded for early talent, but he started late and relied on perseverance and discipline to reach the highest level. “Did I imagine starting basketball at 17 and reaching this level? Not at all,” he reflected. “But now I hope I can be a role model, showing that hard work is just as important as talent.”\n\nThis blend of talent and resilience has helped Angola maintain its status as a continental powerhouse. The national team’s history is one of dominance, and expectations run high whenever the competition comes to Luanda. However, for Gakou, the focus remains on process, not just outcome. “We will suffer again tomorrow,” he said, smiling. “It doesn’t matter if we win or not; we will give our all. We will win tomorrow.”\n\nAs the final buzzer sounded on the semifinal, the arena erupted in celebration, but for Gakou, the moment was about more than victory. It was about the journey: the late nights, the sacrifices, the lessons learned in practice, and the opportunity to perform on the biggest stage at home.\n\nIn a sport often defined by early prodigies and immediate stars, his story is refreshingly different. It is a story of late beginnings, accelerated growth, and the sacrifices required to chase a dream. And as Angola prepares for the final, the combination of personal perseverance, team cohesion, and national pride coalesces into something bigger than a game: a celebration of resilience, dedication, and the enduring spirit of basketball in Angola.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/sindiswamabunda/2025/08/12/your-complete-guide-to-the-2025-fiba-mens-afrobasket/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Angola",
      "weight": 0.06487154
    },
    {
      "name": "Gakou",
      "weight": 0.064331785
    },
    {
      "name": "Aboubaker Gakou",
      "weight": 0.06412154
    },
    {
      "name": "Aboubakar Gakou",
      "weight": 0.06343936
    },
    {
      "name": "packed arenas",
      "weight": 0.055284817
    },
    {
      "name": "multiple national cups",
      "weight": 0.05498488
    },
    {
      "name": "team cohesion",
      "weight": 0.052580193
    },
    {
      "name": "Basketball",
      "weight": 0.051647097
    },
    {
      "name": "basketball",
      "weight": 0.051647097
    },
    {
      "name": "national pride",
      "weight": 0.05130714
    }
  ],
  "topics": [
    {
      "name": "Basketball"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.99609375
    },
    {
      "name": "/Sports/Team Sports/Basketball",
      "score": 0.8984375
    }
  ],
  "sentiment": {
    "positive": 0.3811076,
    "negative": 0.29279447,
    "neutral": 0.326098
  },
  "summary": "Angola's basketball team is preparing for their 12th FIBA AfroBasket Championship, with a semifinal match against Cameroon, where their place in the final came down to three free throws played by Aboubaker Gakou. Gako, a power forward, has been instrumental in Angola's success, helping them secure six Angolan Basketball League titles, three Angolan League MVP awards, multiple national cups and super cups, and a Basketball Africa League championship in 2024. His rapid development has been remarkable for a player who only picked up basketball at 17 and quickly earned a spot with Atlético Petróleos de Luanda, one of Angola’s most storied clubs. Despite a narrow victory over Cameroon, Angola's defence won the game. Coach Claros Canals acknowledged the significance of this moment for the team and their expectations.",
  "shortSummary": "Aboubakar Gakou, driven by intense competition and relentless defensive play, has cemented Angola’s place in the FIBA AfroBasket Championship final, captivating his career progression.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "29814ea069f84bc8854d4f34e6dbf549",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.forbes.com/sites/sindiswamabunda/2025/08/12/your-complete-guide-to-the-2025-fiba-mens-afrobasket/",
      "text": "From August 12th to 24th, 2025, the eyes of the basketball world will turn to Angola as it hosts the FIBA Men’s AfroBasket: the continent’s most prestigious basketball tournament. Bringing together Africa’s best national teams and top talent, AfroBasket is a celebration of the sport’s remarkable growth, rising stars, and enduring rivalries across the continent. This edition promises to be one of the most competitive and exciting in recent memory, reflecting how African basketball has rapidly evolved on the global stage.\nAfroBasket in Context: The Rise of African Basketball\nOver the past decade, African basketball has undergone a transformation driven by several factors: the emergence of the Basketball Africa League (BAL), greater international exposure of African players through the NBA and EuroLeague, and expanded grassroots development programs. AfroBasket has evolved into a highly competitive tournament that not only crowns the continental champion but also serves as a key qualifier for the FIBA World Cup and the Olympic Games.\nTunisia enters this tournament as the reigning champions and will attempt to become the first nation since Angola to claim three consecutive AfroBasket titles. Meanwhile, Angola, a basketball powerhouse with 11 titles, is eager to reclaim the crown on home soil after a decade without winning the trophy. Other nations such as South Sudan, Senegal, Nigeria, Cameroon, and Côte d’Ivoire bring strong rosters featuring NBA and BAL stars, setting the stage for intense battles.\nTeams to Watch: African Basketball’s Best and Brightest\nTunisia: Defending Champions and Continental Heavyweights\nTunisia, ranked fourth in Africa, is the team to beat. Their recent dominance, marked by titles in 2011, 2017, and 2021, reflects a balanced, disciplined squad with solid shooting and defensive intensity. Veterans like Omar Abada, the team’s leader in scoring and assists during qualifiers, are joined by new talent that continues to emerge. Under coach Mehdy Mary, Tunisia’s tactical discipline and efficient ball movement position them as strong favourites.\nAngola: Hosts and Historic Champions\nAngola’s 11 AfroBasket titles make them Africa’s most decorated team, but their last victory came in 2013. Hosting the tournament offers both pressure and motivation. Led by NBA and EuroLeague player Bruno Fernando and domestic league stars Childe Dundao, Aboubakar Gakou, and Jilson Bango, Angola blends experienced rim protection with versatile scoring. Coach Josep Claros Canals has focused on improving perimeter shooting and reducing turnovers, which were challenges in qualifiers. The passionate home crowd will be a vital factor as Angola looks to add a 12th title.\nSouth Sudan: Africa’s Rapidly Rising Force\nSouth Sudan has become a basketball Cinderella story in recent years, rising to become Africa’s top-ranked team in the FIBA Men’s World Ranking. Their aggressive and athletic style of play has garnered international attention, with standout players like 2023 BAL MVP Nuni Omot, Wenyen Gabriel, and versatile big man Jo Lual Acuil leading the way. The Bright Stars combine size, speed, and emerging talent, including Kuany Atem Kuany, who is known for his exceptional three-point shooting. Their upcoming debut at the Paris 2024 Olympics has further boosted their confidence and experience as they aim to establish themselves as serious contenders on the continent.\nCameroon: The Balanced Threat\nCameroon’s team features an exciting mix of youth and experience, spearheaded by Alfred Aboya’s coaching and NBA rookie Yves Missi. With strong rebounding, the best in their qualifying group, and balanced scoring from players like Jeremiah Hill and Williams Narace, the Indomitable Lions have steadily improved. If their shooting efficiency rises and turnovers decrease, Cameroon could challenge the established favourites for a quarterfinal spot.\nNigeria: The Wild Card\nNigeria’s D’Tigers, champions in 2015, possess undeniable talent but face questions about preparation and offensive consistency. Led by NBA guard Josh Okogie and standout Devine Ike, Nigeria is known for aggressive defense and high steal rates, but has struggled with shooting efficiency and turnovers in qualifiers. Their potential to upset stronger teams remains high if they find cohesion early in the tournament.\nSenegal and Côte d’Ivoire: Experienced Contenders\nSenegal, a powerhouse with five AfroBasket gold medals, enters with renewed energy thanks to emerging talents like Jean-Jacques Boissy, Ousmane Ndiaye and Brancou Badio. Despite some shooting inconsistencies, their rebounding and defense remain among Africa’s best.\nCôte d’Ivoire, with a rich basketball history including two continental titles and a recent silver medal in 2021, dominated qualifiers with an undefeated record. Veteran leadership from Solo Diabate, combined with versatile scorers like Matt Costello, has given the Elephants a solid foundation to contend for a podium finish.\nGroup Previews: Battles to Watch\nGroup A: Côte d’Ivoire, DR Congo, Cape Verde, Rwanda\nKey Players: Matt Costello (Côte d’Ivoire), Jordan Sakho (DR Congo), Walter Tavares (Cape Verde), Ntore Habimana (Rwanda)\nCôte d’Ivoire stands as the favourite after a flawless qualifying campaign. DR Congo’s physicality and interior strength, anchored by Sakho, make them formidable challengers. Cape Verde brings elite rim protection with Walter Tavares and a physical defensive style. Rwanda, with a focus on defense and emerging players, aims to surprise.\nGroup B: Tunisia, Cameroon, Nigeria, Madagascar\nKey Players: Omar Abada (Tunisia), Jeremiah Hill & Yves Missi (Cameroon), Josh Okogie (Nigeria), Mathias M’Madi (Madagascar)\nTunisia leads this group, seeking a third consecutive title. Cameroon’s rebounding and rising NBA talent gives them a real shot to join Tunisia in the knockout stage. Nigeria’s defense and star power create potential for surprises, while Madagascar, after a long hiatus, looks to make an impact with disciplined play.\nGroup C: Angola, South Sudan, Guinea, Libya\nKey Players: Bruno Fernando & Jilson Bango (Angola), Nuni Omot & Jo Lual Acuil (South Sudan), Shannon Evans (Guinea), Naseim Ismail Salem Badrush (Libya)\nAngola enters as the favourite on home soil, backed by a passionate crowd and strong interior game. South Sudan’s size and athleticism pose a challenge for the top spot. Guinea and Libya bring tenacity and experience, with Libya’s Sam Vincent coaching bringing NBA insight.\nGroup D: Senegal, Mali, Egypt, Uganda\nKey Players: Jean Jacques Boissy, Ousmane Ndiaye & Brancou Badio (Senegal), Aliou Diarra & Oumar Ballo (Mali), Patrick Gardner (Egypt), Ishmael Wainwright (Uganda)\nSenegal looks to build on their history with a dominant qualifying run. Mali’s defensive grit and size anchored by two-time BAL DPOY Aliou Diarra pose a threat to advancement. Egypt’s rich legacy and emerging talent under new coaching bring optimism. Uganda’s youthful Silverbacks aim to leverage athleticism and energy to upset higher-ranked foes.\nWhy AfroBasket 2025 Is a Must-Watch Event\nShowcase of Africa’s Finest Talent: AfroBasket 2025 brings together a stellar lineup of NBA, BAL and Euroleague stars alongside emerging African basketball phenoms, offering fans a unique opportunity to witness the continent’s best athletes competing at the highest level.\nA Global Launchpad for African Players: More than just a continental championship, AfroBasket acts as a critical springboard for African players aiming to make their mark on the global basketball stage. The tournament continues to elevate Africa’s profile within international basketball, drawing increased attention from scouts, media, and fans worldwide.\nRising Parity Fuels Unpredictable Drama: The gap between traditional powerhouses and rising nations is narrowing, making every game fiercely competitive. This growing parity ensures an electrifying tournament filled with unexpected twists, upsets, and edge-of-the-seat moments from the opening tip-off to the final buzzer.\nVibrant Cultural Celebration and Homegrown Passion: With Angola hosting, AfroBasket 2025 will be infused with rich cultural energy, spirited fanfare, and passionate home crowds, creating an electric atmosphere that celebrates not only basketball but African unity and pride.\nWhat to Expect\nPrepare for fast-paced, physical basketball marked by tactical coaching, emerging stars, and fierce rivalries. The tournament is set to deliver unforgettable moments, surprise upsets, and the crowning of a new or returning African basketball king."
    }
  ],
  "argos_summary": "Angola’s semi‑final against Cameroon was a tense, back‑and‑forth battle that hinged on Aboubakar Gakou’s free‑throw performance, securing a narrow win and a spot in the AfroBasket 2025 final on home soil. Gakou, who began playing at 17, has risen rapidly to become a key player for Atlético Petróleos de Luanda and the national team, exemplifying perseverance and defensive grit. Angola, the most decorated African basketball nation, aims to reclaim its 12th title amid strong competition from Tunisia, South Sudan, Nigeria, and others, while the tournament highlights the growing parity and global visibility of African basketball.",
  "argos_id": "O1VOFJD3B"
}