{
  "url": "https://www.polygon.com/best-roguelikes-play-fair-enter-gungeon-dead-cells/",
  "authorsByline": "Jazz Stewart",
  "articleId": "8a5fb6f8abbe4a5080b80d6d8e7e83e8",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/chorus/uploads/chorus_asset/file/13064987/deadcells01.0.0.1495140370.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T14:00:16+00:00",
  "addDate": "2025-08-23T14:06:22.463273+00:00",
  "refreshDate": "2025-08-23T14:06:22.463278+00:00",
  "score": 1.0,
  "title": "The best roguelike games don't let randomness get in the way of fun",
  "description": "Sometimes random chance feels good, and sometimes it sucks",
  "content": "This article is part of Run, Die, Repeat, Polygon's week-long series exploring roguelikes.\n\nRandom chance is key to the success of any roguelike, but it is easiest to notice when a game feels unfair. We expect games to obey their own rules, even when events are random. Easy successes can make a game feel infantilizing, and too many failures can make a player assume the system is trying to sabotage them. Bad luck clusters tend to feel unfair, even when they’re not. An unlucky streak of rolls during Baldur’s Gate 3 almost made me drop one of the most celebrated games of the decade. That’s because my brain instinctively tries to find a pattern in the randomness.\n\nThe best roguelikes tame randomness by giving players control and providing them with information. Systems that either protect against bad luck or allow the player to prepare for it are key to making a game feel fair and cultivate a sense of mastery — even during a losing streak. Randomness is essential, but it can’t make player choice and skill take a backseat.\n\nEnter the Gungeon, the 2016 bullet-hell shooter, nails this all-important balance. The game is filled with items and opportunities to make your current run a success, and the more you play, the more potential items you can unlock. A Reddit user in the Gungeon community sums it up perfectly: “There are like five shit items in the entire game, all other stuff is an upgrade or sidegrade.” Mastery of mechanics in Enter the Gungeon will supersede its random elements, every single time.\n\nPermanent upgrades and meta-progression can also improve the experience. Dead Cells ​​​​​​is a side-scroller where you traverse an island full of murderous mutants, and each defeated enemy gives you Cells to spend on enhancing your weapons or health. The game provides its players with a large arsenal of options, ensuring that every run is winnable. For instance, the Vampirism skill allows you to steal HP with melee attacks, while also granting a speed boost. It enhances the game’s fundamentals, making every run more engaging. Even a mediocre upgrade, such as the Blood Sword, can become incredibly useful thanks to synergies with other items and status effects.\n\nIn contrast, giving the player too little agency is a surefire path to frustration. Dicey Dungeons has, in my experience, the rage-quitting kind of randomness. As you navigate through the dungeon, your dice rolls determine the strength of your attacks and abilities. Too often, it feels like the game is giving me the opposite of what I need, and rerolls can feel anything but random. Dicey Dungeons isn’t as upfront about the low odds of a successful run as it could be, and it doesn’t go far enough to make a failed run feel rewarding.\n\nIf a game is more candid about its difficulty, that’s a different story. Getting Over It with Bennett Foddy is a 2017 game where you’re a man in a pot attempting to ascend a mountain with a hammer. It is brutally punishing — and it’s clear from the outset that this game is intentionally built to frustrate you. One mistimed swing can mean the erasure of all your upward progress. But when you come in prepared to fail repeatedly, it's easier to accept.\n\nDarkest Dungeon, where you manage various afflictions while navigating a gothic mansion, is also unforgiving in its design. To its credit, though, the game literally tells you that in its opening minutes: “Darkest Dungeon is about making the best of a bad situation.” Perception is everything when it comes to randomness, and when losing is part of the fun, you’re a lot less likely to come away feeling exasperated.\n\nFairness can be boiled down to one word: agency. Randomness can enhance the challenge without overwhelming player choice. You should come away from a losing run with ideas for new ways to meet the challenge next time it comes your way. If a success or failure is linked to your choices, it's easier to accept it as good old-fashioned variance rather than the devs screwing with you. Sure, unfair situations can become opportunities for personal growth. But a game is far more likely to get under your skin if it makes you feel smart, strategic, and tenacious along the way — even if sometimes winning is just a matter of dumb luck.",
  "medium": "Article",
  "links": [
    "https://www.reddit.com/r/EnterTheGungeon/comments/95kvqo/comment/e3tfx9u/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
    "https://www.polygon.com/roguelikes-appeal-why/",
    "https://www.polygon.com/why-roguelikes-are-fun/#how-roguelikes-turn-punishment-into-a-reward-according-to-psychologists",
    "https://www.polygon.com/game/baldurs-gate-3/40577/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "games",
      "weight": 0.0851054
    },
    {
      "name": "player choice",
      "weight": 0.0721872
    },
    {
      "name": "players",
      "weight": 0.06404829
    },
    {
      "name": "Easy successes",
      "weight": 0.05943662
    },
    {
      "name": "other items",
      "weight": 0.058771722
    },
    {
      "name": "Randomness",
      "weight": 0.057856157
    },
    {
      "name": "randomness",
      "weight": 0.057856157
    },
    {
      "name": "The best roguelike games",
      "weight": 0.05414992
    },
    {
      "name": "Bad luck clusters",
      "weight": 0.05242257
    },
    {
      "name": "bad luck",
      "weight": 0.051714994
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.96435546875
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.5869140625
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.5009765625
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.4384765625
    },
    {
      "name": "/Games/Computer & Video Games/Massively Multiplayer Games",
      "score": 0.30859375
    }
  ],
  "sentiment": {
    "positive": 0.25569832,
    "negative": 0.32511264,
    "neutral": 0.41918907
  },
  "summary": "The best roguelike games don't let randomness get in the way of fun, particularly in games like Enter the Gungeon or Dead Cells. The focus is on giving players control and providing them with information to make a game feel fair, even during a losing streak. This balance can be found in games such as Dead Cells, where each defeated enemy gives you Cells to spend on enhancing weapons or health. However, giving too little agency to the player can lead to frustration and frustration. The article also discusses the importance of permanent upgrades and meta-progression to enhance the player's experience.",
  "shortSummary": "The best roguelike games balance randomness with strategic design and player choice, ensuring fairness and complexity, while those who fail often feel less likely to feel frustrated and feel like frustrated.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d91d762bfc3a4cb98c1c1e6b51778faf",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/game/baldurs-gate-3/40577/",
      "text": "In defense of playing 99% of an RPG and then never finishing it\nMaybe I'm just built different\nBaldur's Gate 3 is a Dungeons and Dragons inspired RPG developed and published by Larian Studios. Featuring both a single player and cooperative element, players create their character by selecting a starting class, take on quests, level up, and engage in turn-based combat using the D&D 5th edition rule set.\nMaybe I'm just built different\nWhy It Matters\nBaldur's Gate 3 is almost singlehandedly responsible for reviving the computer RPG genre. Set in the world of Dungeons and Dragons, it's also helped bridge the gap between video gamers and tabletop gamers.\nLarian Studios has shared another round of player data, and it's glorious\nNeil Newbon says human error creates \"happy accidents\" that AI could never replicate\nSamantha Béart tells Polygon they drew on personal experience to bring the BG3 star to life\nSamantha Béart’s latest role sees them voice a protagonist with a wet ‘n wild skillset\nThe minis are melting, and WizKids is trying to put out the fire\nNow’s the time to jump in or make your grand return to Faerûn\nThe best CRPG of the last decade is matching its best price ever for PC and Xbox until April 24\nSolve all of life’s problems with punching\nYour comment has not been saved"
    },
    {
      "url": "https://www.polygon.com/roguelikes-appeal-why/",
      "text": "This article is part of Run, Die, Repeat, Polygon's week-long series exploring roguelikes.\nAh, the roguelike. A genre named after the 1980s game Rogue and one that I’ve tried time and time again to get into – so much so that I actually purchased Rogue a few weeks back to throw myself into it. I’d tried 2011’s The Binding of Isaac, even Slay the Spire when it first released in 2019, and now I thought I’d try the game that birthed this genre. Maybe, just maybe, my mind could be changed.\nI didn’t like Rogue. I tried my best to like The Binding of Isaac. And despite my numerous attempts to get into Slay the Spire and see the fun aspect of it, I left feeling like I had ultimately lost 4 to 5 hours of my life that I was never going to get back.\nSo, roguelike enjoyers, I have but one question: Who hurt you?\nFor those of you who are blissfully unaware of what a roguelike is, let me explain. While the ultimate definition varies greatly depending on who you ask, roguelikes are usually considered a subgenre of role-playing games. Players take on the role of a character and must hack and slash their way through a procedurally generated dungeon – or other such setting – while picking up upgrades for health, weapons, abilities, and so forth. However, if a player dies, they must start over from the beginning with no upgrades, no new fancy weapons and armor, just a brand-new character.\nI’m a fully-grown woman who writes for a living. I’ve got a niece to look after. Two very loud and obnoxious dogs who do not understand the concept of working from home and thus want me to throw ball 24/7. My neighbor does not understand what “a respectable level of noise” is when they blast Mitski at 10 p.m. As you can see, my periods of relaxation are very slim. So the whole concept of a subgenre that requires me to play continuously and, when I die (because I am going to die), have none of it matter makes me want to set myself on fire.\nAnd I get it. There’s something magnetic about the thought of making it to the end and completing a game with an encyclopedia of knowledge sitting in your noggin, which is only possible thanks to your hard efforts and many (many…many…) deaths. It feels a bit like when you go to those restaurants where, if you eat a plethora of food for a challenge, you get the honor of not paying for it. Painful, but worth it. Skillful even. Maybe I would enjoy it if I simply got good. But consider: What if I don’t have time to get good? My niece has managed to install several viruses on her phone, my dogs want to go out for their nightly walk, and they’ve figured out how to open the bathroom door, so there goes my last hiding space for a bit of peace and quiet. I still haven’t cooked dinner yet.\nBut despite my aversion to roguelikes, there is an alternative that I do love: roguelites. Games like Hades and Sword of the Necromancer incorporate roguelike elements, including random dungeons and a death mechanic that sends you back to the start of each run. But these games also allow you to keep the upgrades to your character, so that each new run doesn’t feel so agonizingly pointless. For some people, the difference between the two subgenres probably feels a tad like splitting hairs: What, the only difference is player progression? And to that I’d say yes, but the player progression aspect of roguelites versus roguelikes is incredibly important to me.\nFor gamers who turn their nose up at the thought of “shortcuts” in video games, the idea of player progression in roguelikes might seem like sacrilege. After all, roguelike players, much like soulslike players, get a (well-deserved) ego boost from these games. If you’re not skilled enough to get to the end without any help, the thinking goes, are you truly a gamer? However, this completely ignores just how different each gamer is. I may not be a competitive or even skilled person in the realm of roguelike gameplay, but that doesn't mean I should forego them forever, even if I just so happen to enjoy the story and other aspects that the game has. That doesn’t seem fair.\nThis is why the Hades series, in particular, is such an intriguing roguelite to me. As Zagreus or Melinoe, you fight your way through various realms of the ancient Greek afterlife, and even if you absolutely eat dirt two minutes in and are sent back to the start, the game doesn’t punish you for it. Instead, it leans on its cast of characters, in addition to unlockable features like weapons, locations, and item stores, to encourage you to get back into another run. It rewards you for your efforts, in other words.\nWhile I’ve felt frustrated at dying in a roguelite, in the Hades games (and other games that take on a similar framework), I’ve never felt as though I was the butt of a joke. I felt more like I learned something, could come back stronger, and used the time away from the dungeon to invest in upgrades and explore the main hub area where the main character’s friends, family, and love interests hang out. In my experience, true-to-form roguelikes do not have this sense of connection. Progression is rarely – if ever – reflected on you in a meaningful way.\nTo be frank, the main appeal of roguelites for me is that there’s a chance I actually get to the end. And I do want to progress through the game and get to the end, because to me, not completing something I’ve specifically set out to complete feels like a moral failure. I know, I know, discussion material for my therapist. So, to the game developers out there who know just how vital it can be to feel that progress, I salute you.\nAnd to roguelike enthusiasts, I will never understand you, but if they bring you joy, who am I to judge?"
    },
    {
      "url": "https://www.reddit.com/r/EnterTheGungeon/comments/95kvqo/comment/e3tfx9u/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button",
      "text": "An unofficial home for Enter the Gungeon fans on Reddit. Not affiliated with Dodge Roll or Devolver Digital.\nGuys... Dead cells made me realise something... RNG can be fair... (my probleme with gungeon)\nA roguelike can be hard and fair.\nGungeon is easily on my top 10 favorite list. But the game is a bit unfair.\nSure you could beat the game with a starter weapon, but it's highly unlikely (unless you are really good). But one run i am dodging and rolling and shooting everywhere with my shit weapon, hoping to see lvl 5 (spoiler alert: boss 4 usually kills me).\nAnd on the other hand, i sometimes get insane guns on the first floor. Actually, the only time i beat the game, was when i had this gun that hot black holes (that absorbs bullets and enemies) + some other broken weapon.\nI just played dead cells. The game is hard, but your run doesn't depend on the items you get. You have the tool to beat the game. If you don't: tough shit, git gud. Or have some perma upgrades.\nIn gungeon, if you lose: tough shit git gud. Or try again until you have a broken OP weapon, that does the job for you.\nI think, that the devs should make more changes, in order to give you more tools to beat the game (while still letting hardcore skilled players, tweak the options to get the old difficulty (like they did with the last patch).\nTLDR: At the end of the day, Gungeon doesn't troll you like binding of isaac does (except with the rat that steals your stuff). If you die in gungeon, it's you fault. But it would be great if, instead of having runs with OP item and runs with shit items: you just had fair runs, with a balance between good and shit."
    },
    {
      "url": "https://www.polygon.com/why-roguelikes-are-fun/#how-roguelikes-turn-punishment-into-a-reward-according-to-psychologists",
      "text": "We can't quit roguelikes. Often literally. They drop us into danger with ever escalating powers and then, inevitably, send us back to the start. The possibility of that one perfect attempt keeps us hitting “restart.\"\nThis week, we’re diving deep into the systems and stories that make roguelikes impossible to resist. We’ll celebrate franchise experiments like Pokémon Mystery Dungeon, discover new contenders like Absolum, and investigate why players gravitate toward games that punish failure as much as they reward skill. Yes, there will be Hades talk. Check back all week during our celebration of the particular kind of maddening joy that comes from roguelike loops."
    }
  ],
  "argos_summary": "The article examines how roguelikes balance randomness with player agency, arguing that fairness comes from giving players control and information to mitigate bad luck. It praises games like Enter the Gungeon and Dead Cells for their meta‑progression and item systems that let players adapt to random outcomes, while criticizing Dicey Dungeons for feeling punitive and opaque. The piece also notes that games such as Baldur’s Gate 3, Darkest Dungeon, and Getting Over It embrace difficulty by being upfront about their harshness, making failure feel intentional rather than unfair. Overall, the article stresses that a successful roguelike should let players learn from losses and feel empowered to improve, rather than being frustrated by random variance.",
  "argos_id": "OGMY5BUZA"
}