{
  "url": "https://www.forbes.com/sites/jefffedotin/2025/08/23/andy-reid-office-shooting-gains-notoriety-not-new-police-tips/",
  "authorsByline": "Jeff Fedotin",
  "articleId": "8da96cc9370242d0b750e280db9a3242",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68a8ba10bd11b809e970306b/0x0.jpg?format=jpg&crop=1306,734,x74,y5,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:15:00+00:00",
  "addDate": "2025-08-23T13:21:47.521104+00:00",
  "refreshDate": "2025-08-23T13:21:47.521108+00:00",
  "score": 1.0,
  "title": "Andy Reid Office Shooting Gains Notoriety, Not New Police Tips",
  "description": "A surge in interest, revolving around the shooting in the office of the Chiefs head coach, has not led to an influx of people contacting the police with information.",
  "content": "Since Sam McDowell of The Kansas City Star broke the shocking news on Wednesday night that a bullet entered the office of Chiefs head coach Andy Reid at the team’s facility on May 4, 2024, the story has been reported by countless media outlets, ranging from TMZ to CNN.\n\nBy early morning of Aug. 21, the search of “Andy Reid gunshot” had reached a 100 out of 100 on the maximum popularity scale of Google Trends.\n\nOne would think the surge in interest has led to an influx of people contacting the police with information, potentially boosting the chances of finding the perpetrator. But that has not been the case.\n\n“There has not been an increase in tips generated,” Sergeant Phil DiMartino of the Kansas City Police Department (KCPD) exclusively shared via email.\n\nAccording to the KCPD, there have been no charges or arrests in this case. The investigation, including where the bullet may have been fired from, remains ongoing, and detectives are awaiting further forensic analysis.\n\nA bullet from outside the building broke through the glass, producing a hole through the window and blinds — approximately 15 feet away from the desk of Reid, who was in the office at the time. The bullet lodged in a wall between his bathroom and the entry door to his office, but Reid was not struck or injured by it.\n\nThere is no indication, per the KCPD, that the shooting was a targeted incident at any Chiefs player or staff member.\n\nThe bullet, though, reached Reid’s office, which sits on the second floor of the three-story practice facility overlooking the team’s three practice fields to the north side. The facility resides across the parking lot from GEHA Field at Arrowhead Stadium. That practice area is home to the team’s front office and corporate offices and has a security guard on site 24 hours a day.\n\nMedia didn’t have an opportunity to speak to Reid after The Star story came out because the Chiefs had a day off on Thursday before their final preseason game on Friday.\n\nAfter that 29-27 loss to the Chicago Bears on Friday night, Reid was asked about the incident but mostly deflected the question, saying that Chiefs president Mark Donovan discussed it during Thursday’s Chiefs Kickoff Luncheon.\n\nDonovan stressed that the Chiefs cooperated with the KCPD and worked with security experts and that Reid has not deviated from his office routine, which often begins well before sunrise.\n\nThe Star, however, reported that Reid now works behind bulletproof glass.\n\nIn addition to standing behind Donovan’s comments, Reid addressed the shooting incident with his trademark humility and wit.\n\nThe 67-year-old is reportedly the highest-paid NFL head coach, earning $20 million per year. The fourth-winningest coach in league history has 301 total victories, which are 100 more than any other current NFL head coach.\n\nStarting on Sept. 5, he will try to steer the Chiefs toward a fourth straight Super Bowl appearance — something that hasn’t been accomplished since the Buffalo Bills of the early 1990s — seemingly unperturbed by what could’ve been a tragic incident.",
  "medium": "Article",
  "links": [
    "https://www.kansascity.com/sports/nfl/kansas-city-chiefs/article311767668.html",
    "https://www.si.com/nfl/highest-paid-coaches-2025-andy-reid"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Andy Reid Office Shooting",
      "weight": 0.10996769
    },
    {
      "name": "Chiefs head coach Andy Reid",
      "weight": 0.108776316
    },
    {
      "name": "Andy Reid",
      "weight": 0.09527207
    },
    {
      "name": "Andy Reid gunshot",
      "weight": 0.09203014
    },
    {
      "name": "Reid",
      "weight": 0.08927362
    },
    {
      "name": "Chiefs president Mark Donovan",
      "weight": 0.08087262
    },
    {
      "name": "Chiefs",
      "weight": 0.07699249
    },
    {
      "name": "corporate offices",
      "weight": 0.07686208
    },
    {
      "name": "Chiefs Kickoff Luncheon",
      "weight": 0.07436368
    },
    {
      "name": "KCPD",
      "weight": 0.05955254
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.92919921875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.919921875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.8203125
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.78955078125
    },
    {
      "name": "/News/Sports News",
      "score": 0.76513671875
    },
    {
      "name": "/News/Other",
      "score": 0.61767578125
    },
    {
      "name": "/News/Local News",
      "score": 0.61669921875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.54931640625
    }
  ],
  "sentiment": {
    "positive": 0.07910802,
    "negative": 0.6520943,
    "neutral": 0.2687976
  },
  "summary": "A bullet entered the office of Chiefs head coach Andy Reid on May 4, 2024, causing a hole through the window and blinds. The incident has been widely reported by media outlets, including TMZ and CNN, but no new tips have been made. The Kansas City Police Department (KCPD) stated that there have been no charges or arrests in this case. The investigation is ongoing and detectives are awaiting further forensic analysis. The bullet lodged in a wall between Reid's bathroom and the entry door to his office, but he was not injured. There is no indication that the shooting was targeted at any Chiefs player or staff member.",
  "shortSummary": "The Andy Reid office shooting incident has gained notoriety but remains a mystery, with no arrests or tips generated yet.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6b27a5da79c94fd89cf6a91f8b13398c",
  "places": [
    {
      "osmId": "4587811",
      "road": "Arrowhead Drive",
      "city": "Kansas City",
      "county": "Jackson County",
      "state": "Missouri",
      "postcode": "64129",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 39.04894045,
        "lon": -94.48499381102714
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.si.com/nfl/highest-paid-coaches-2025-andy-reid",
      "text": "Highest Paid NFL Coaches in 2025\nIn 1966, the Kansas City Chiefs signed then-head coach Hank Stram to an extension that was believed to be worth at least $30,000 per year. Nearly 60 years later, current Chiefs coach Andy Reid is making over 600 times what Stram once earned with the team.\nMuch has changed over the decades in the NFL, and that includes salaries for both players and coaches. Here's a look at the current list of the top-five highest-paid coaches in the NFL.\nTop 5 Highest-Paid Coaches in the NFL\n5. Los Angeles Rams' Sean McVay — $15 million per year\nThe Los Angeles Rams took a risk when they hired Sean McVay as the youngest coach in the modern era of the NFL, but that risk has paid off. The offensive genius turned the Rams around, and led them to a Super Bowl appearance in his second season. Three years later, he helped the Rams win the franchise's second Super Bowl, and Los Angeles remains a consistent threat under his tutelage. McVay is already the franchise leader in wins by a coach, and has spurned an impressive coaching tree.\nMcVay most recently signed a four-year extension with the Rams in 2022, which has him signed through the '26 season.\nT-3. Los Angeles Chargers' Jim Harbaugh — $16 million per year\nJim Harbaugh returned to the NFL in 2024 and became one of the highest-paid coaches in the process when he signed a five-year contract with the Chargers. Harbaugh is the league's highest-paid coach that has not won a Super Bowl, but he did lead the San Francisco 49ers to a Super Bowl appearance in 2012–13 and has a College Football Playoff national championship to boast. He has now turned both the 49ers and Chargers into immediately playoff teams, and has made the postseason in four of five seasons as an NFL head coach.\nT-3. Pittsburgh Steelers' Mike Tomlin — $16 million per year\nMike Tomlin is the currently the NFL's longest-tenured active coach, and will enter his 19th season with the Steelers this season. Tomlin most recently signed an extension with Pittsburgh last June, agreeing to a three-year deal that will keep him with the Steelers through at least the 2027 season.\nThough the Steelers have been unable to win a playoff game since 2017, Tomlin remains one of the NFL's most successful coaches. He won a Super Bowl in his second season, regularly has his teams in the postseason and has never finished a season with a losing record.\n2. Denver Broncos' Sean Payton — $18 million per year\nSean Payton came out of retirement from coaching in 2023 to become the head coach of the Denver Broncos. The Broncos had to trade a first-round and second-round pick to the New Orleans Saints to hire Payton, and signed a five-year deal with Denver that's worth about $18 million per year.\nPayton's already delivered, leading the Broncos to the postseason in 2024, their first playoff appearance since 2015. Before joining the Broncos, Payton was also successful for the Saints, leading them to their first ever Super Bowl victory in 2009–10.\n1. Kansas City Chiefs' Andy Reid — $20 million per year\nThere is no active head coach in the NFL that deserves to be the highest-paid more than Andy Reid. Reid is the NFL's most experienced active coach, with the most Super Bowl victories and appearances and the most wins overall. Reid is a surefire Hall of Famer, and ranks fourth on the prestigious all-time coaching wins list with a 273-146-1 record. He has combined for 301 regular season and postseason wins and is second all-time in career postseason wins, only trailing Bill Belichick.\nReid most recently signed a five-year, $100 million deal with the Chiefs in 2024, following his third Super Bowl win.\nHow Do NFL Coach Salaries Compare to Player Contracts?\nThe top NFL head coaches are paid in a similar range to the league's best safeties, linebackers, running backs and tight ends. Even Reid, the NFL's best head coach, makes well below the salary of the league's premier positions—quarterbacks, edge rushers and wide receivers.\nReid's annual salary is just below the NFL's highest-paid running back (Saquon Barkley, $20.6 million), safety (Antoine Winfield Jr., $21.5 million) and above the highest-paid tight end (George Kittle, $19.1 million).\nHow Coaching Salaries Have Changed Over Time\nAs is the case with all NFL salaries, head coaching salaries have certainly gotten much more lucrative over the years. Don Shula, a two-time Super Bowl champion and the NFL's all-time winningest coach, signed a contract with a reported salary of $70,000 per year back in 1970, per The New York Times. Shula coached for over three decades and saw his salary rise almost exponentially to around $1.4 million annually in 1990, according to the Los Angeles Times.\nBy 2012, Bill Belichick became the highest-paid coach in the NFL with a salary of $7.5 million per year. Over a decade later, the league's highest-paid coach is making close to triple Belichick's salary from that period.\nWhich Coach Could Become the Next Highest-Paid?\nIt'd be surprising to see any coach top Andy Reid as the highest-paid in the near future. Reid is the NFL's most experienced coach, as well as it's most successful.\nOne head coach in line for a raise soon is Philadelphia Eagles coach Nick Sirianni. Though Sirianni might not top Reid's salary, Eagles owner Jeffrey Lurie recently indicated that Sirianni could be receiving an extension soon. Sirianni is entering the final year of his current contract, and after winning the Super Bowl, seems likely to get a new deal before the 2025 season begins.\nHighest-Paid NFL Assistants and Coordinators\nLas Vegas Raiders offensive coordinator Chip Kelly is the highest-paid coordinator in the NFL, making $6 million per year. Kelly comes to the Raiders after helping Ohio State win the College Football Playoff national championship. He was previously an NFL head coach for the Eagles and San Francisco 49ers.\nOn the other side of the ball, the Eagles' Vic Fangio is the highest-paid defensive coordinator making $4.5 million per year, according to Front Office Sports. He showed his defensive prowess once again with Philadelphia last season, leading them to a dominant Super Bowl victory over the Chiefs.\nHow NFL Coaching Salaries Compare to Other Sports\nThe highest-paid NFL coaches are making significantly more than the top-paid MLB managers and a little more than the highest-paid NBA coaches. Golden State Warriors head coach Steve Kerr is making $17.5 million annually, a mark that only Reid and Payton top. In MLB, Los Angeles Dodgers manager Dave Roberts is earning $8.1 million per year, a figure that 14 NFL coaches currently top."
    }
  ],
  "argos_summary": "A bullet entered the Kansas City Chiefs’ practice facility office on May 4, 2024, but did not hit head coach Andy Reid, who remains unharmed. Police have not received new tips and no charges have been filed; the investigation into the source of the shot is ongoing. Reid has returned to work behind bulletproof glass and has largely deflected media questions, while Chiefs president Mark Donovan emphasized cooperation with law‑enforcement and security experts. The article also includes a detailed overview of the NFL’s highest‑paid coaches, noting Reid’s $20 million annual salary and his recent five‑year, $100 million contract extension.",
  "argos_id": "P61XSQ5RD"
}