{
  "url": "https://www.popularmechanics.com/science/a65877447/new-william-shakespeare-document-discovered-mystery/",
  "authorsByline": "Tim Newcomb",
  "articleId": "1cc29c1ba1ca484b8ac1567a395a8a8f",
  "source": {
    "domain": "popularmechanics.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://hips.hearstapps.com/hmg-prod/images/william-shakespeare-royalty-free-illustration-1755952497.pjpeg?crop=1.00xw:0.596xh;0,0.0933xh&resize=1200:*",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T12:35:31.949057+00:00",
  "addDate": "2025-08-23T12:40:02.410594+00:00",
  "refreshDate": "2025-08-23T12:40:02.410597+00:00",
  "score": 1.0,
  "title": "A Remarkable Discovery of a Document Shatters One of Shakespeare's Biggest Mysteries",
  "description": "A secret parchment has resurfaced, rewriting the Bard’s sketchy family history.",
  "content": "Here’s what you’ll learn when you read this story:\n• In 1757, a document signed “J. Shakespeare” was found in the Shakespeare family home, long attributed to William’s father, John.\n• A study reveals the document was likely written by William’s sister, Joan, inspired by an obscure 17th-century Italian religious text.\n• Joan’s hidden writings shed light on her secret Catholic beliefs and add a new dimension to the Shakespeare family’s mysterious legacy.\n\nThis story is a collaboration with Biography.com.\n\nIn the annals of William Shakespeare’s legacy, a twist has emerged that’s practically as dramatic as any of the Bard’s plays: the real “Shakespeare” behind a centuries-old family document has been revealed ... and it’s not the man we expected.\n\nIn 1757, a bricklayer found a religious document hidden in the rafters of the Shakespeare House in Stratford-upon-Avon, England. Historians have long attributed the document, which was signed, “J. Shakespeare,” to William’s father, John.\n\nBut a study in Shakespeare Quarterly, from scholars at the University of Bristol, claims John wasn’t actually the writer of the scrutinized document. Instead, the researchers say it was William’s relatively unknown younger sister, Joan Shakespeare Hart, who is mentioned by name in only seven surviving documents from her lifetime, study author Matthew Steggle said in a statement:\n\nIn the tucked-away document, which heavily cites an obscure 17th century Italian religious tract called The Last Will and Testament of the Soul, the writer pledges to die a good Catholic death. If the writer was indeed John Shakespeare, who remained a devout Protestant until his death in 1601, it would have indicated a major shift in his beliefs and suggested a clandestine life during an era when secret allegiance to the Catholic Church in Elizabethan England could have been dangerous. For this reason, many experts have suspected the document to be forged.\n\nBut in the recent study, Steggle used internet archives to track down early editions of The Last Will and Testament of the Soul in Italian and six other languages and concluded the document could have only been written after John Shakespeare’s death. That left Steggle with just one other “J. Shakespeare”: Joan.\n\nJoan, who was five years younger than William, survived for 30 years after her brother’s death, and long resided in the family home where the document was found.\n\n“Even 30 years ago, a researcher approaching a problem like this would have been based in a single big research library, using printed catalogues and even card catalogues to try to find copies of this text,” Steggle said in the statement. “But research libraries have now made many of their resources available digitally, so that it is possible to look across many different libraries in different countries at once, and what’s more, you can look through the whole text, not just at the title and other details.”\n\nSteggle emphasized the importance of this approach in aligning the document’s quotes with the original timing of the composition of The Last Will and Testament of the Soul. Joan, then, who outlived her tradesman husband and had four children in the old Shakespeare family house, had to have been the secret Catholic supporter.\n\nThe mystery flourished for centuries, in part, because William Shakespeare himself was a secretive figure, Biography writes.\n\nShakespeare, who lived from 1564 to 1616, left behind no letters, no handwritten manuscripts, few contemporary accounts, and only six signatures, all spelled differently. It seems almost unbelievable to scholars and critics that the country boy from Stratford-upon-Avon who never attended university wrote 37,000 words for his plays and added roughly 300 words to the English vocabulary.\n\nYet, the scarcity of Shakespeare’s personal artifacts does little to dim the luster of his legacy, which stands in stark contrast to his modest, mysterious origins.\n\nThe early years of Shakespeare’s life are murky. According to Biography, he was born to a father, John, who managed a portfolio as a landowner, moneylender, local official, and glover and leather craftsman. Instead of pursuing higher education, Shakespeare’s knowledge was gleaned from life experiences, absorbing wisdom from his dad’s civic engagements and perhaps gaining insights from his son-in-law, who was a doctor.\n\nThe idea that Shakespeare kept his London-based professional life separate from his personal life in Stratford-upon-Avon plays into the recent findings regarding his sister, Joan. “This secretive attitude,” Biography writes, “may have been because much of his family were known Catholic sympathizers and chose to live quietly in Protestant Elizabethan England. In fact, some believe Shakespeare himself received Catholic communion on his death bed.”\n\nShakespeare wasn’t known to be loud and boisterous; instead, he carried an air of mystery, relishing the relative anonymity provided by Stratford life. Following his marriage to Anne Hathaway and the birth of their children, there’s a seven-year gap in his historical record. These are known as the “lost years.”\n\nSpeculation about William Shakespeare’s “lost years” varies widely; some suggest he may have been in hiding due to accusations of poaching, while more substantiated theories propose he was making a living as an actor and playwright in London. But despite this period of obscurity, Shakespeare’s reputation flourished through his poetry, sonnets, and plays.\n\nAs a prominent member of the Lord Chamberlain’s Men, a renowned London acting company, Shakespeare invested in his craft, and his financial success allowed him to buy New Place, one of the largest houses in Stratford-upon-Avon. Shakespeare’s theatrical endeavors didn’t stop there; in collaboration with fellow actors, he started the iconic Globe Theater, which became synonymous with his celebrated playwriting and solidified his legacy.\n\nAs Shakespeare grew his name in London’s theaters, he simultaneously established himself as a prominent figure in his hometown of Stratford. Acquiring the family estate in 1601 and subsequently purchasing 107 acres the following year, he strategically invested in additional properties. Experts suggest that the income from leasing these lands gave him the financial stability to pursue his writing.\n\nMeanwhile, Joan resided in the Shakespeare family home amidst speculation and secrets. And its rafters served as a vault for her Italian-inspired religious writings—a hidden gem that’s still sparking scholarly intrigue, and revealing new layers to the Shakespeare legacy today.",
  "medium": "Article",
  "links": [
    "https://www.popularmechanics.com/science/health/a46414420/nikola-tesla-longevity-secrets-revealed/",
    "https://www.biography.com/",
    "https://www.popularmechanics.com/science/math/a65678154/hidden-math-inside-da-vinci-vitruvian-man/",
    "https://www.bristol.ac.uk/news/2024/march/joan-shakespeare.html",
    "https://academic.oup.com/sq/advance-article-abstract/doi/10.1093/sq/quae003/7631576?redirectedFrom=fulltext",
    "https://www.biography.com/authors-writers/william-shakespeare",
    "https://www.popularmechanics.com/science/a60453674/henrietta-lacks-and-hela-cells/",
    "https://www.popularmechanics.com/science/a61058879/cia-stargate-project/",
    "https://www.popularmechanics.com/author/2820/tim-newcomb/",
    "https://www.popularmechanics.com/science/a42216404/is-death-revesible/",
    "https://www.popularmechanics.com/science/health/a61207150/young-blood-transfusions/",
    "https://www.biography.com/authors-writers/william-shakespeare-life-mystery",
    "https://www.popularmechanics.com/culture/a61857673/this-man-knows-the-truth-about-amelia-earhart-why-doesnt-anyone-believe-him/",
    "https://www.popularmechanics.com/promotions/a40118846/download-exclusive-pop-mech-digital-issues/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "William Shakespeare",
      "weight": 0.10288193
    },
    {
      "name": "John Shakespeare",
      "weight": 0.100519024
    },
    {
      "name": "Shakespeare",
      "weight": 0.09701042
    },
    {
      "name": "J. Shakespeare",
      "weight": 0.09680068
    },
    {
      "name": "Joan Shakespeare Hart",
      "weight": 0.09404598
    },
    {
      "name": "Shakespeare Quarterly",
      "weight": 0.09371355
    },
    {
      "name": "Stratford life",
      "weight": 0.061886024
    },
    {
      "name": "the old Shakespeare family house",
      "weight": 0.06099808
    },
    {
      "name": "William Shakespeare’s legacy",
      "weight": 0.060016505
    },
    {
      "name": "the Shakespeare family home",
      "weight": 0.05982607
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/Humanities/History",
      "score": 0.8408203125
    },
    {
      "name": "/Books & Literature/Other",
      "score": 0.5703125
    }
  ],
  "sentiment": {
    "positive": 0.0839638,
    "negative": 0.55749416,
    "neutral": 0.35854203
  },
  "summary": "A study from the University of Bristol has revealed that a centuries-old family document, signed \"J. Shakespeare,\" was likely written by William's sister, Joan Shakespeare Hart, inspired by an obscure 17th-century Italian religious text. The document was found in 1757 in the Shakespeare family home in Stratford-upon-Avon, England, and had been long attributed to William's father, John Shakespeare. The study author, Matthew Steggle, used internet archives to track down early editions of The Last Will and Testament of the Soul in Italian and six other languages and concluded that the document could have only been written after John Shakespeare’s death. This discovery reveals Joan's secret Catholic beliefs and adds a new dimension to the family's mysterious legacy.",
  "shortSummary": "A study reveals that a 1757 religious document, attributed to William Shakespeare’s father, was likely by his sister Joan Shakespeare Hart, revealing her hidden Catholic beliefs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "85908c66cf2c4c52884d956b323d9634",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.popularmechanics.com/science/health/a46414420/nikola-tesla-longevity-secrets-revealed/",
      "text": "This story is a collaboration with Biography.com.\nAmidst the relentless pursuit of longevity, one man stands out for merging cutting-edge ideas with the age-old quest for the fountain of youth: Bryan Johnson.\nThe millionaire software entrepreneur has garnered attention for his extreme measures to increase his lifespan, spending about $2 million a year trying to make his 46-year-old body look and function as though it were 18 again. Johnson has transformed his anti-aging efforts into “Project Blueprint,” a subscription-based program that, according to the New York Post, costs $333 a month for those seeking their own path to youthfulness.\nOf course, this portion of Johnson’s health protocol focuses on nutrition and supplements, like his “$99 ready-to-mix blend of nuts, seeds and berries to make Nutty Pudding,” rather than, say, his reliance on inter-generational blood transfusions. But even these supplements are controversial, with longevity expert Dr. Andrew Steele, the author of Ageless: The New Science of Getting Older Without Getting Old, noting that some of the ingredients could “increase risk of death.”\nWhile the secret to immortality remains unsolved, that hasn’t stopped Johnson and other modern longevity experts—authors, geneticists, doctors-turned-podcasters—from providing guidance on how to add years to your life. But long before any of those gurus were even born, a world-famous scientist developed his own longevity protocol that helped him beat the odds and outlive the life expectancy of his time by more than 20 years: Nikola Tesla.\nThe (Delayed) Death of Nikola Tesla\nNikola Tesla didn’t live forever. The inventor died under-appreciated, alone, and in poverty on January 7, 1943, from a coronary thrombosis, according to Biography.\nAt the time of Tesla’s death, his Wardenclyffe laboratory on Long Island had been foreclosed for nearly 30 years. He lived in the Hotel New Yorker in Manhattan, where his behavior became “increasingly eccentric.” Though he reportedly spent “much of his time to the care of wild pigeons in the parks of New York City,” Tesla also tried to develop a “death ray” at the encouragement of the Soviet Union, which naturally drew the attention of the FBI.\nBut while the idea of a great mind squandered on feeding birds and fueling a war machine reads as tragic, there’s a remarkable element to the circumstances of Tesla’s death. Namely, his age.\nNikola Tesla died at 86 years old, a notably ripe old age compared to 1943’s average American life expectancy of just 62.4 years. Even considering the life expectancy in his original homeland, now known as Croatia, which was around 65 years as late as 1960, Tesla’s longevity was quite an achievement.\nThe Foundational Years of Nikola Tesla\nConsidering Tesla’s early years in the village of Smiljan were filled with death (including that of his older brother, Dane, when Nikola was only 5), military conscription, and disease, it would be impressive had Tesla even reached the average age at which a man of his time had died. Yet, it was these early brushes with death that spurred Tesla’s determination to tackle aging with the same methodical approach he applied to his scientific inventions.\nAs Biography notes, Nikola’s father, Milutin Tesla, was a Serbian orthodox priest who strongly urged his son to follow in his footsteps. However, this pressure only drove Nikola to seek answers beyond the Bible. And at least once, that pursuit of knowledge came at great personal cost.\nIn a portion of Nikola’s autobiography, My Inventions, Tesla describes a confluence of his scientific curiosity and innate desire to defy his parochial patriarch:\n“Just as I was making ready for the long journey home I received word that my father wished me to go on a shooting expedition. It was a strange request as he had been always strenuously opposed to this kind of sport. But a few days later I learned that the cholera was raging in that district and, taking advantage of an opportunity, I returned to Gospic in disregard of my parents' wishes. It is incredible how absolutely ignorant people were as to the causes of this scourge which visited the country in intervals of from fifteen to twenty years. They thought that the deadly agents were transmitted thru the air and filled it with pungent odors and smoke. In the meantime they drank the infected water and died in heaps.”\nTesla “contracted the awful disease” on the very day he arrived home, and it rendered him bedridden for nine months. But while he was sick, he cleverly capitalized on his father’s worry to steer his future toward his true passion. Lying ill, he suggested to Milutin that his recovery hinged on being allowed to pursue engineering. Reflecting on this moment, Tesla recalls in his memoirs his father’s grave promise: “You will go to the best technical institution in the world.”\nIndeed, the young Tesla attended several prestigious technical institutions, including the Realschule in Karlstadt, Germany; the Polytechnic Institute in Graz, Austria; and the University of Prague. He initially moved to Budapest, but after his ideas, like the induction motor, didn’t catch on, he relocated to the United States. It was there that he invented a slew of technologies, such as “radar technology, X-ray technology, remote control and the rotating magnetic field.”\nTesla’s early illness also sparked another passion: understanding and maintaining his own body as if it were one of his intricate machines. As he told writer George F. Corners in a 1935 interview for Physical Culture magazine, “I look upon the human body as a machine, and I treat it with the respect which a machine deserves. I keep it properly oiled and properly cleaned, and I see to it that it has no opportunity to gather rust.”\nThat 1935 interview provides the most detailed view into the health habits and strategies that contributed to Nikola Tesla living more than 20 years longer than his contemporaries.\nHow Nikola Tesla Tried to Live Forever\nIn March 1935, Physical Culture ran a feature titled, “NIKOLA TESLA’S YOUTH AND STRENGTH AT 78.” Eight years before his death, Tesla told his interviewer, “Lacking but two years of eighty, I am as fit today as I was at twenty.”\nPhysical Culture was founded by a man named Bernarr Macfadden, who was, in a sense, America’s first fitness influencer. He promoted his health philosophies, emphasizing diet and physical activity, along with unconventional practices such as fasting and non-procreative sexual activity.\nMacfadden’s “healthatoriums” gained popularity in the U.S., promoting exercise to the public. However, his more ambitious projects—establishing a “Physical Culture City” in New Jersey and trying to start a fitness-based religion called “Cosmotarianism”—later relegated him to the margins of American health history.\nMacfadden launched Physical Culture in 1899, the same year Tesla published one of his own theories on health: “High Frequency Oscillators for Electro-Therapeutic and Other Purposes.” Was it destiny that brought the prolific inventor and the fitness publication together? Or was Physical Culture simply the only journal willing to document the eccentricities of a distinguished man who had become fixated on caring for New York’s pigeons?\nRegardless of the cause, this obscure interview from Tesla’s final years reveals that certain aspects of his wellness regimen align with contemporary longevity strategies, while others might be more suitably consigned to the annals of vintage periodicals.\nNikola Tesla’s Longevity Secret #1:\nEat Two Meals a Day\n“The physical law which divides twenty-four hours into day and night also divides man’s life into two periods—one in which he lives and another in which he rests,” Tesla told Corners. “This in itself seems to indicate the desirability of two meals a day in unison with the world rhythm—one meal to give us energy for the day’s work, another to supply the body with the material with which it will replenish itself during sleep.”\nTesla insists he had “...tried everything—six meals a day, like most Europeans; three a day, one a day; I have tried continuous feeding.” Ultimately, “I decided that two meals are most beneficial.”\nWhen Corners inquired about the timing of Tesla’s meals according to his “gastro-culinary scheme of existence,” Tesla responded:\n“We should take breakfast two hours before we start to work, and we should rest two hours afterward. If a man has his breakfast between seven and eight, he should begin work at ten, work continuously for five or six hours, which would mean that his work day ended at three or four; then he should go home, and devote several hours to recreation, rest and exercise, and take his final meal between seven and eight at night.”\nWhile modern longevity specialists may not dismiss lunch as “futile in the economy of the human body” as Tesla did, his approach does appear to echo today’s concept of intermittent fasting, with its emphasis on time-restricted eating.\nThough research touts potential advantages of intermittent fasting, there are also documented risks and drawbacks. As Peter Attia suggests in Outlive: The Science of Art and Longevity, “One not uncommon scenario that we see with [time restricted eating] is that a person loses weight on the scale, but their body composition alters for the worse: they lose lean mass (muscle) while their body fat stays the same or even increases.”\nNikola Tesla’s Longevity Secret #2:\nEat Plenty of Protein and Fat\n“Every meal should have some protein and fat,” Tesla suggested in Physical Culture. “The one for building, the other for burning. Protein builds, fat is a fuel.”\nTesla wasn’t much of a carnivore, insisting, “I eat meat only at rare intervals, possibly only once or twice a year.” Instead, he turned to legumes (“A large amount of protein is contained in pulses or leguminous products, beans, peas, lentils, etc.”), vegetables (“Vegetables are indispensable to any diet”), and fruits (“Fruit, too, is an essential part of any well-regulated diet”).\nThat lines up with a 2022 study from the University of Borgen, which says, “...the optimal diet is one of legumes, whole grains, nuts, vegetables, and fruit.”\nTesla’s food choices got even more granular. “Another excellent ingredient for food is the white of an egg,” Tesla said, anticipating the “no-yolk” trend by several decades. “The yolk contains iron and vitamins which are good, but also uric acid, which I avoid as much as possible.”\nTesla even anticipated our current dairy vs. non-dairy milk debate, while throwing some shade at a fellow industrialist:\n“I believe with Bernarr Macfadden in the miracle of milk. There are two hundred and sixty grains of protein in one pint of milk. It is easily assimilated. Mr. [Henry] Ford, unlike Mr. Macfadden, does not believe in milk. He feels it should be artificially manufactured. Unlike Ford, I believe in milk. Ford should take to milk if he wants to turn out more millions of his 'Lizzies.'”\nNikola Tesla’s Longevity Secret #3:\nWalk 10 Miles Every Day\n“The most stimulating activity, to my mind, is walking,” Tesla proclaimed. “I walk never less than ten miles a day. This has kept me in good health, but it may in the end lead to my destruction, because I am a confirmed jay-walker.” (Interestingly, jaywalking had only recently been deemed illegal when Tesla mentioned it.)\nResearch supports the health benefits of walking. A study from the Journal of the American Medical Association Network Open says people who walked 8,000 or more steps at least once a week had a lower risk of death over the span of a decade compared to those who walked less. But 10 miles a day is excessive, the study suggests, because the “...protective effect of 8,000 daily steps plateaued at three days a week.”\nNikola Tesla’s Longevity Secret #4:\nNo Cigarettes, Coffee, or Sex\nTesla was a man of few vices, purposefully quitting, or entirely abstaining from, anything he thought detrimental to his health. For example, Tesla told his interviewer that he was “strongly addicted to coffee” to the degree that “my heart was subjected to a dangerous over-strain.” So, he cut it out, calling caffeinated drinks “rank poisons.”\nTesla shared comparable thoughts on smoking, recalling, “I did smoke quite a bit, but around the age of twenty, I pledged to quit and indeed, that was the last cigar I had.”\nTesla’s discipline wasn’t limited to just coffee and cigarettes. As a bachelor, unlike contemporaries Thomas Edison and Guglielmo Marconi, he faced questions about his celibacy. While acknowledging the significance of sex in human life, Tesla said he preferred to be “wedded to science.”\n“Before I produced the rotating magnetic field, I concentrated all my powers upon my experiment. The strain would have killed a hundred oxen. I certainly could not have survived it if I had permitted my energies to be diverted into the channels of sex.”\nTesla also gave up alcohol, but only because of the Eighteenth Amendment: “Since prohibition was enacted, I have not touched a drop,” Tesla said.\nSurprisingly, Tesla actually felt booze was beneficial to him. “Alcohol has helped me a great deal in my life,” he claimed, even suggesting his sobriety was shortening his lifespan. “I had previously expected to live 150 years,” he told Physical Culture. “Now that I have given up alcohol, I have reduced my expectancy of life to 135 years.”\nAvoiding tobacco has obviously proven to be the right call, as you won’t find many doctors telling you to start smoking for your health (but that wasn’t always the case).\nRegarding celibacy, research indicates Tesla may have needed to go a bit farther in his commitment to the cause, as studies suggest eunuchs generally live longer. According to Richard Munson’s biography, Tesla: Inventor of the Modern, Tesla’s avoidance of sexual activity was likely more about his fear of disease, influenced by the cholera epidemics he experienced, rather than a focus on his work.\nAnd if you’re choosing between whether to drink a coffee or a beer, don’t base your decision on what Tesla would do. A 2018 study in JAMA Internal Medicine indicates coffee consumption “was associated inversely with all-cause mortality, including in those drinking at least 8 cups per day.”\nAs for booze’s health benefits, some studies tout its virtues. But in a GQ lifestyle interview reminiscent of Tesla’s 1935 interview, David Sinclair, a Harvard longevity expert, offered a dose of reality. Once a proponent of a diet rich in red wine and cheese, Sinclair has now abandoned alcohol altogether, citing new research showing that even moderate consumption can impact brain health.\nNikola Tesla’s Longevity Secret #5:\nBathe in Electricity\nWhen you think of Nikola Tesla, you think of electricity. And so did his interviewer. “It seems curious,” Corners asked Tesla, “that you, who are one of the master minds in electricity, do not use it to recharge your own energies.”\nAnd that’s what prompted Tesla to reveal his most ... unique longevity strategy: “waterless baths.”\n“I believe in what may be called a waterless bath, by which I mean charging of the body to a very high electric potential. It is a bath of fire that rebuilds, rejuvenates, cleans, and exhilarates. It carries off instantly all dust, impurities and microbes, and stimulates the tips of the nerves. While in the bath the body is surrounded by a halo of light, plainly visible in the dark. I am now working on an apparatus which will make this electric bath safe and economically possible, even for a person of average means.”\nSo ... just so we’re all clear here:\nDo NOT electrocute yourself in lieu of a bath.\nDo NOT electrocute yourself in an attempt to live longer.\nIntentionally subjecting yourself to an electric shock, whether in a bathtub or any other setting, based on the claim of an inventor from 90 years ago—who met his end, by the way, in a hotel room while attempting to construct a death ray—that it would eliminate dust is an extremely unwise action, and we *strongly* advise against it.\nWant to live forever? Then sure, feel free to consider other guidance offered by Nikola Tesla, such as enjoying a stroll, moderating your snack intake, or even embracing celibacy if you choose. Just keep the wires out of the bathtub, okay?\nMichale Natale is a News Editor for the Hearst Enthusiast Group. As a writer and researcher, he has produced written and audio-visual content for more than fifteen years, spanning historical periods from the dawn of early man to the Golden Age of Hollywood. His stories for the Enthusiast Group have involved coordinating with organizations like the National Parks Service and the Secret Service, and travelling to notable historical sites and archaeological digs, from excavations of America’ earliest colonies to the former homes of Edgar Allan Poe."
    },
    {
      "url": "https://www.popularmechanics.com/author/2820/tim-newcomb/",
      "text": "Tim Newcomb\nJournalist\nTim Newcomb is a journalist based in the Pacific Northwest. He covers stadiums, sneakers, gear, infrastructure, and more for a variety of publications, including Popular Mechanics. His favorite interviews have included sit-downs with Roger Federer in Switzerland, Kobe Bryant in Los Angeles, and Tinker Hatfield in Portland.\nAn Early Christian Community May Have Run the World’s First Nursing Home\nA mosaic reading “Peace be with the elders” highlighted the Christian society’s intentional care of the oldest in their community.\nScientists Think the Weird Physics of Blood Could Crack Murder Cases Wide Open\nThe ways that a bloodstain behaves could point out the speed and angle at which blood splattered onto a fabric, a helpful tool for forensic investigators.\nAn Archaeology Student Was 90 Minutes Into Her First Dig—and Found a Mysterious Golden Artifact\nYara Souza was too sick to make it to her first excavation a year ago. She made up for it pretty quickly.\nScientists Found 13 Ancient Teeth That May Rewrite Human Evolution\nThe fossilized chompers are evidence of a previously unknown hominin that coexisted with the earliest humans 2.8 million years ago.\nA Couple Renovated Their Kitchen—and Stumbled Upon Buried Treasure From the 17th Century\nWhile digging deeper for more space, this family uncovered relics from a civil war.\nArchaeologists Dug Beneath a Farm—and Found a Smiling Ancient Face\n“We were removing a slab when the head came rolling out at us, and as we turned it around we saw a face looking back at us.”\nItaly Is Building the Longest Suspension Bridge Ever—in an Earthquake Zone\nThe bridge will measure over 2 miles long from end to end, stretching across the Strait of Messina\nScientists Just Found 41,000 Turtles Hiding in Plain Sight\nAs it turns out, deep in the Amazon, there were more than 41,000 endangered turtles just waiting for scientists to find them.\nArchaeologists Used a 327-Year-Old Letter to Find a Lost Maya City in the Jungle\nThe ‘land of the white jaguar’ rises again.\nArchaeologists Found a 1,600-Year-Old Roman Mosaic of Flip-Flops. They Look Weirdly Trendy.\nIt was one of many cool finds in a luxurious residence in Sicily.\nA Scientist Says He’s Solved the Bermuda Triangle, Just Like That\nPretty simple, actually.\nA Massive Earthquake Just Caused a ‘Parade’ of Volcanic Eruptions\nThe Russian Coast’s strongest earthquake since 1952 provided enough energy for six volcanoes adjacent to the Ring of Fire to spout off. Another could be imminent.\nThese Tombs Were Hidden for 2,100 Years. Archaeologists Just Found the Warriors Inside.\nAnd not just the warriors—the archaeologists also found their horses.\nHumans Traveled 31,000 Feet Below the Ocean—and Found a Hidden World of New Life Forms\nThe deepest depths of our planet’s surface do not disappoint.\nArchaeologists Found the Remains of an Ancient Roman Arts District Buried Underground\nThey uncovered an entire street of production-focused buildings.\nA New Obelisk ‘Lifeform’ Is Hiding Inside Humans\nThis strange microscopic structure may whisper ancient evolutionary secrets.\nHumanity Will Reach Its Peak Within Just Decades, Trend Shows\nAnd the impending singularity may spell our end even sooner.\nA 3-Year-Old Was Taking a Family Walk—and Picked Up an Amazing 3,800-Year-Old Amulet\nIt was more than 1,000 times older than her!\nScientists Are Hunting Down Humanity's Earliest Artificial Memories\nThey found evidence of sophisticated cognitive abilities on artifacts from as far back as 70,000 years ago.\nArchaeologists Found a 4,000-Year-Old Handprint That Was Never Meant to Be Seen\nThe hand print was likely left by an Egyptian potter on an ancient structure used in burial practices.\nA New Statue Suddenly Appeared on Easter Island. That Doesn't Make Sense.\nScientists thought they found them all.\nEarth’s Hidden Eighth Continent Is No Longer Lost\nWe’ve finally mapped all of Zealandia.\nA Metal Detectorist Accidentally Found the Ancient Armor of a Trojan War Veteran\nOnly the elite had this kind of protection.\nArchaeologists May Have Discovered the World’s Oldest Burial Ground\nThe 100,000-year-old site contains the remains of both Homo sapiens and Neanderthals.\nA Boy Took a Trip to the Beach—And Found a 247-Year-Old Shipwreck\nThe 12 tons of timber wreckage once made up the HMS Hind, a ship that took part in the Revolutionary War before being repurposed as a whaling ship.\nEarth Has Tilted 31.5 Inches. That Shouldn't Happen.\nCan we fix it back?\nArchaeologists Opened a 2,600-Year-Old Tomb—and Found 4 People Who Time Forgot\nBecause the seal had never been broken, the Etruscan tomb’s grave goods had also gone completely untouched by looters.\nArchaeologists Found an Ancient Fossil That Doubled as a Sacred Roman Amulet\nOr a bracelet. Either way, it was meant to protect.\nArchaeologists Found the Lost ‘Book of the Dead’ Buried in an Egyptian Cemetery\nThey couldn’t get it on Amazon.\nThey Were Supposed to Be Building a Highway. Instead, They Found a Town Full of Treasure.\nThe ruins of a Celtic settlement along the Amber Road trade route were filled with coins,\nArchaeologists Followed a 500-Year-Old Clue—and Found a Lost Town Hiding in Plain Sight\nThe 500-year-old clue got them started, but archaeologists needed more modern georadar techniques to finish the job.\nScientists Found 78,000-Year-Old Neanderthal Footprints That Tell a Story of Survival\nA cliffside dune in Portugal has nearly 80,000-year-old evidence of a neanderthal family hunting a red deer."
    },
    {
      "url": "https://www.biography.com/authors-writers/william-shakespeare-life-mystery",
      "text": "He was the greatest Western playwright of all time. His plays are still burned in our cultural memory and performed the world over. But William Shakespeare (1564-1616), the man, has remained an elusive figure. He left behind little documentation — no letters, no handwritten manuscripts, few contemporary accounts, and only six signatures, all spelled differently. In the words of Charles Dickens: “The life of Shakespeare is a fine mystery, and I tremble every day lest something should turn up.”\nSince Shakespeare’s time, some critics and scholars have been unable to believe that a country boy from Stratford-Upon-Avon, who never went to University, could be the same man who used 37,000 words in his plays and added around 300 words to our vocabulary. Operating under what John Walsh called in The Independent the “snob logic theory,” for centuries scholars have attempted to find more learned men who better fit their noble vision of Shakespeare.\nHowever, numerous allusions and slights to Shakespeare’s humble origins can be found in contemporary references. According to Shakespeare biographer Peter Ackroyd, pamphleteer Robert Green derided Shakespeare as a “country-author.” Shakespeare’s number one frenemy, playwright Ben Jonson, was forever mocking what he saw as Shakespeare’s pretensions to grandeur and playwright Francis Beaumont dissed his parentage:\nAnother payre you shall see, that were heire apparent legges to a Glover, these legges hope shortly to bee honourable.\nEven Jonson’s eulogy of Shakespeare in the First Folio of his plays, published in 1623, made reference to his relatively poor education:\nAnd tell how far thou didst our Lyly outshine,\nOr sporting Kyd, or Marlowe's mighty line.\nAnd though thou hadst small Latin and less Greek,\nFrom thence to honour thee, I would not seek.\nREAD MORE: Was Shakespeare the Real Author of His Plays?\nShakespeare's beginnings are often reported incorrectly\nThese slights have been fueled by basic misconceptions about Shakespeare’s childhood and life. Born in 1564, his father was not an illiterate butcher as is often reported, but a successful glover, landowner and moneylender who held local government offices.\nWhen critics ask how a man who never went to college could know so much about things like the law, court life and medicine, Ackroyd notes that Shakespeare learned as he went. For example, after his daughter Susanna married a doctor, we find many more references to medical practices. Most of his plays were also based on existing stories, which any working actor like Shakespeare would have learned over the years.\nREAD MORE: Shakespeare Wrote Three of His Famous Tragedies During Turbulent Times\nHe kept his professional and home life separate\nIt also seems that Shakespeare offered little information about himself to his contemporaries. He appears to have kept his professional life in London and his home life as a prosperous landowner in Stratford radically separate. This secretive attitude may have been because much of his family were known Catholic sympathizers and chose to live quietly in Protestant Elizabethan England. In fact, some believe Shakespeare himself received Catholic communion on his death bed.\n\"He was, indeed, honest and of an open and free nature,” Jonson wrote of Shakespeare. As Ackroyd notes, Shakespeare was probably affable and vague, not a rabble-rouser or trouble-maker like many of his contemporaries. He seems to have seen himself as a company man — a member of The Lord Chamberlain’s Men, and with them, a part owner of The Globe Theater. A few years before his death, he retired to Stratford where he died in 1616. As Mark Twain noted:\nWhen Shakespeare died in Stratford, IT WAS NOT AN EVENT. It made no more stir in England than the death of any other forgotten theatre-actor would have made. Nobody came down from London, there were no lamenting poems, no eulogies, no national tears – there was merely silence and nothing more. A striking contrast with what happened when Ben Jonson and Francis Bacon, and Spenser and Raleigh, and the other distinguished literary folk of Shakespeare’s time passed from life!\nAll this has led many to believe the “Stratford man” was not the author of Shakespeare’s plays. “The first man explicitly to believe that Shakespeare's works were written by someone else was the Reverend James Wilmot (1726-1808), a Warwickshire clergyman who lived near Stratford,” William Rubinstein writes in History Today. “Wilmot's doubts were aroused by his inability to find a single book belonging to Shakespeare despite searching in every old private library within a fifty-mile radius of Stratford. He was also unable to locate any authentic anecdotes about Shakespeare in or around Stratford.”\nIndeed, it is true that no books were listed in Shakespeare’s will. It is also curious that the First Folio, compiled by his theatrical colleagues, makes no mention of his Stratford family.\nREAD MORE: Did William Shakespeare and Queen Elizabeth I Ever Meet?\nDecades after Shakespeare's death, other candidates were hypothesized as the \"real\" author\nThe first candidate as the “real” author of Shakespeare’s work was the statesman and philosopher Sir Francis Bacon (1561-1626). Subsequent candidates have included Edward De Vere, 17 Earl of Oxford (1550-1604), a Cambridge trained lawyer and successful poet who had his own theater company. Some point to Christopher Marlowe (1564-1593), the rapscallion rebel playwright who the historical Shakespeare no doubt knew. Another choice is Mary Sidney Herbert, Countess of Pembroke, a 17-century poetess and literary grand dame.\nHowever, these choices fall apart upon closer inspection and were all made decades after Shakespeare’s death. “No one in Shakespeare's lifetime or for the next 200 years questioned that he wrote the plays (although this has been disputed by unorthodox biographers),” Rubinstein concedes in History Today, “and several of his contemporaries, most clearly Ben Jonson, appear to have regarded the Stratford man as having written them.”\nREAD MORE: What are Shakespeare’s Most Famous Quotes?\nHowever, the playwright did leave some subtle clues\nShakespeare’s funerary monument, erected shortly after his death in Stratford, offers us some clues that the “Stratford man” and Shakespeare were one and the same. Not only does his likeness look like the etched portrait in the First Folio, but the epitaph is classic Shakespeare wit:\nGood friend for Jesus sake forbeare, To dig the dust enclosed here. Blessed be the man that spares these stones, And cursed be he that moves my bones.\n“Perhaps it’s time to shift our attention from debating who wrote Shakespeare’s works,” historian James Shapiro writes, “to whether it’s possible to discover the author’s emotional, sexual and religious life through them.”\nAnd what would the real Shakespeare think of the mystery that now surrounds his life? He’d probably be amused, and glad he is an enigma. After all, “the play’s the thing.”"
    },
    {
      "url": "https://www.popularmechanics.com/science/a42216404/is-death-revesible/",
      "text": "On December 9, 2013, 13-year-old Jahi McMath was checked in to Oakland Children’s Hospital in California for a routine tonsillectomy. She had sleep apnea and her parents believed that having her tonsils removed would improve her life, her sleep, and her relationships with her classmates. Each year, more than half a million people in the United States get this procedure. The vast majority have no complications. McMath was not so fortunate. About an hour after waking from the surgery, she started spitting up blood. In the middle of the night, her oxygen-saturation levels plummeted. Medical staff started working frantically to intubate her, but McMath’s heart stopped. As Rachel Aviv reported in a chilling 2018 New Yorker story, it would take several more hours to restore her heartbeat and breathing.\nTwo days later, doctors declared McMath brain-dead. But with her body still warm and her skin still soft, her family disagreed. They fought in court to keep her on a ventilator. Eventually they raised enough money through a GoFundMe campaign to airlift McMath to New Jersey, one of the only states that allows families to refuse a death declaration on the basis of their religious beliefs. Nourished through a feeding tube and supplied with supplemental hormones, McMath’s body continued to grow and develop—and even began menstruating.\nIn 2018, Jahi’s family’s attorney announced that she had died of complications from liver failure. Only then, five years after the tonsil surgery, “were all parties in mutual agreement that Jahi had in fact died,” says Michele Goodwin, chancellor’s professor and director of the Center for Biotechnology and Global Health Policy at UC Irvine School of Law. “It was quite the controversial case.”\nAnd it’s not the only such case. Over the last 70 or so years, declaring death has gotten progressively messier. Scientific advances such as ventilators and life support have made it harder and harder to find the line between being a person and being a body. Now, mind-blowing experiments in pigs, and the development of a souped-up life-support system called OrganEx, are reinvigorating a decades-old debate about how our lives end. While OrganEx is not yet available for use in humans, it was able to reverse some of the cellular changes associated with death in pigs. What does that mean? In studies, when pigs were hooked up to the system after being dead for an hour, they looked lifelike, their hearts restarted, and they even moved. But were the pigs still dead? And if a treatment like that ever makes it to humans, what happens to the next Jahi McMath?\nTHE DEAD CONTINUE TO LIVE\nThe technology that kept Jahi McMath looking alive for five years is one of the first threats to death as we know it, the modern ventilator. Ventilators, which started appearing in hospitals in the 1950s, save lives by pushing air into a patient’s lungs when the person no longer can breathe on their own. Their invention also created an ethical dilemma: If bodies could breathe indefinitely without recovering or decaying, when were doctors legally allowed to pronounce them “deceased?”\nIn 1968, a committee of experts met at Harvard Medical School to discuss the matter. The existing criteria for determining death were based on the ways people had died for centuries. When breathing stopped and a person had no pulse, they were no longer alive. Now, the group proposed adding a second criterion, the absence of brain activity. It made sense: The brain holds power over other organs, and controls breathing. There wasn’t, and still isn’t, a way to fix a nonfunctional brain.\nThe timing of this decision wasn’t coincidental. Just one year prior, in 1967, doctors had performed the first heart transplant. In addition to relieving the burden of prolonged, meaningless treatment, the new brain-based approach to defining death could also ward off controversy over when doctors could retrieve transplant organs. If an organ donor’s brain was dead, their organs were fair game.\nA legal entity called the Uniform Law Commission, which is charged with clarifying and stabilizing complicated laws across the country, formalized the brain-death criterion in 1980. Most U.S. states have since adopted it. According to this law, a person is dead if they meet one of two conditions: “irreversible cessation of circulatory and respiratory functions” or “irreversible cessation of all functions of the entire brain, including the brain stem.” Over time, brain death became the more popular definition of biological death, and doctors codified this view in a 2019 position statement by the American Academy of Neurology. Ninety-three percent of the organization’s surveyed members agreed that brain death is the equivalent of circulatory death.\nYet there have been rare cases, most conspicuously Jahi McMath’s, where medical interventions have successfully maintained a person for years after their brain no longer worked. “[Jahi] indeed went through puberty,” says Alex Capron, an expert in health policy and medical ethics at the University of Southern California Gould School of Law and Keck School of Medicine. If that’s true, and some endocrine functions can persist without brain activity, there’s room for critics to argue that the current standards are incomplete. And that was before scientists started trying to reverse the dying process in pigs.\nAN ACCIDENTAL BREAKTHROUGH\nYale neurobiologist Nenad Sestan researches genes that control how neurons grow and form connections in the developing brain. To perform these studies, he orders slices of tissue from brain banks around the world. Eight or nine years ago, a specimen from London missed the plane. The extra day it took to arrive was presumed to be catastrophic: Cells die after several minutes without oxygen. It’s one of the first things Sestan recalls learning in medical school.\nBut Sestan had already noticed that this wasn’t always the case. On several occasions, someone left a brain slab out a few extra hours before moving it into fluid for experiments, yet Sestan had still managed to recover living cells. So when the overdue brain arrived from London, Sestan asked one of his postdoctoral fellows to dissect a piece of it and let it grow in a petri dish containing cellular nutrients. “Maybe something will be there alive,” he said.\nIt worked; some cells grew. And then it worked again on a second brain the researchers sliced and recovered to make sure the results weren’t a fluke. Sestan started to wonder: If living cells could be preserved from a dead brain, why not try to revive the whole organ?\nUsing assorted pumps, heaters, and filters to circulate a custom-made blood substitute, Sestan and his coworkers cobbled together a now-patented perfusion system, which they called BrainEx. They achieved stunning results. In a 2019 paper, the team described how BrainEx revitalized key features of pig brains retrieved from a slaughterhouse. Four hours after the pigs had died, neurons were firing, blood vessels were functioning, and the brain’s immune cells were chugging along.\nAfter the BrainEx paper came out, scientists and physicians inundated Sestan with ideas about what to do next. “Nenad was like, ‘Well, we should try definitely to answer as many questions [as we can] at once by trying to do this on the entire body,’” says David Andrijevic, MD, a research scientist who joined the lab at Yale shortly before Sestan published the BrainEx study.\nExpanding from BrainEx to a whole-body version, which the lab called OrganEx, presented several challenges as the team began the scale-up. In an isolated brain, you don’t have to deal with blood clotting and immune reactions, for example. Revamping the system took about three years.\nAt its core, OrganEx functions like extracorporeal membrane oxygenation, or ECMO, which is also called life support. It has a pump that mimics heart function and an oxygenator to mimic lung function. But OrganEx also includes a blood-filtration unit, plus additional pumps, tubes, and sensors, to make real-time measurements of metabolites, gases, electrolytes, and pressures. Then, there are the mixtures that the system pushes into the body: a priming solution to correct electrolyte and pH imbalances, a cow-derived hemoglobin that carries oxygen, and about a dozen drugs—anti-inflammatories, anti-oxidants, antihistamines, antibiotics, and several neuroprotective agents.\nBasically, OrganEx adds a sort of cellular life support to traditional ECMO. It also revives the body more slowly. When cells have been deprived of oxygen for a while, suddenly connecting them to fresh blood can begin a cycle of stress and damage that kills them, a problem called ischemia-reperfusion injury. What you want instead is a kind of slow reanimation, a gentler process of reviving cells that have already begun to die. If that were possible, doctors might be able to extend the amount of time an animal could be dead before recovering. It might make more organs from more bodies recoverable for transplantation.\nIt’s “ECMO on steroids,” Sestan says. He’s only half joking. OrganEx does contain a steroid, dexamethasone, although it’s not one that bodybuilders would find useful.\nTHE PIGS WERE DEAD\nWhen it came time to test OrganEx on pigs, Sestan and his team at Yale anticipated a long day. It took about five hours to prepare solutions and ready the machines and another seven hours to conduct monitoring and measurements on 10 pigs. They worked on one animal at a time, each sedated and kept fully anesthetized. The scientists put a tiny electrode through a square-inch hole in each animal’s chest and touched its heart to induce cardiac arrest. Two monitors, one for the heart and one for brain activity, showed flat lines. The pigs were dead.\nOne hour passed. Then the real test began, as the scientists connected each motionless animal to the OrganEx system or, as a control, to a standard ECMO. The experiment was set to run for the next six hours, but the first and most obvious changes happened about a half hour in: Heart monitors connected to four out of five OrganEx-treated pigs began to light up. Peaked lines started moving in pulses across the screen. “It was like, whoa, whoa, what should we do now?” says Andrijevic. The hearts’ electrical activity had resumed spontaneously, without chest compressions or other obvious lifesaving measures.\nThe researchers peered into the pigs’ chest holes. “We saw it with our own eyes,” Andrijevic says. In every OrganEx pig that showed electrical activity on the monitor, the heart itself was visibly contracting. (None of the five animals in the ECMO-treated group showed any electrical activity or contractions.)\nAfter six hours of perfusion, the researchers administered a euthanasia drug and disconnected the machine. They examined tissue from the pigs’ vital organs—including the heart, lungs, liver, kidneys, and brain—under a microscope. The cells’ shape and organization looked noticeably better in OrganEx samples compared with the samples from pigs given ECMO. Other tests showed restored activity of specific cellular repair genes after OrganEx treatment.\nOrganEx was so effective that some changes were obvious to the naked eye. Treated pigs lacked typical signs of death such as muscle rigidity (rigor mortis) and purple discoloration (livor mortis). “The animal looks different,” Sestan says. “Trust me. You just see it.”\nWhen asked what else happened during the experiment, Andrijevic paused, then struggled for words: “What has raised a lot of eyebrows is…I’m not sure if you have noticed it, because we have tried, like, not to… We have mentioned it, of course… the ‘movements.’”\nAndrijevic and his coworkers had performed a routine procedure during the perfusion. In preparation for imaging the brain, he says, they snaked a catheter into the pig’s neck and squirted contrast dye into the carotid artery. It’s a procedure that makes it easier to see blood vessels on an x-ray.\nHowever, when the dye shot through the tube, something startling happened: The 70-pound slab of flesh appeared to turn its head. “It was just a few seconds. It was not like the animal was trying to walk out,” Andrijevic says. Yet it was not just a twitch either. Andrijevic calls it a “complex” movement and says it suggests that OrganEx perfusion can restore neuromuscular junctions, where nerves and muscle fibers meet.\n“What does it mean?” he asks. “We’re not sure.”\nLIFE, EXTENDED\nScientists are still puzzling over what the OrganEx results mean. The experiments were performed in animals and have years to go before they could affect human medicine. Still, at a cellular level, they may show that death may not proceed as quickly or as finally as once thought. For the person who collapses from a heart attack and remains on the ground for 10 minutes, the findings raise a key question: How dead are they, really?\nNowadays, if someone’s heart stops beating from disease or from a heart attack, they only have a 10 to 20 percent chance of making it out of the hospital alive, says transplant surgeon Robert A. Montgomery, MD, PhD, who directs the NYU Langone Transplant Institute. He has personally beat those odds. Before receiving a heart transplant at his own hospital in 2018, he needed resuscitation on seven occasions after suffering cardiac arrest from an inherited condition that weakens the heart muscle.\nMontgomery now wonders if death could be “reversible” in situations like his own. One could imagine using OrganEx instead of ECMO to intervene after a cardiac arrest “before restarting the heart and hitting the brain with warm blood,” he says. Without the reperfusion injury that ECMO can cause, survival rates could improve.\nProblem is, the idea of reversibility hits right at the heart of the debate about the medical definition of death. According to a recent article in the Daily Beast, one question that cropped up when the Uniform Law Commission (ULC) met over Zoom to debate death again in March was whether to call it “irreversible” or “permanent.” Seema Shah, JD, a bioethicist at Lurie Children’s Hospital in Chicago, who attended the ULC’s virtual forum, says it can be hard to know what “permanent” means if you can restore function in cells. “That starts to call into question the different practices that we do,” she says.\nLest this all sound like a thought experiment, consider that hospitals must constantly make difficult decisions that depend on whether a patient is really, truly dead. These are life-and-death choices made about your children, your parents, you. How much time, for example, should a doctor spend trying to save a dying patient? Which technologies are they required to try? When are organs available for donation? “If you want to transplant a heart, the longer you wait, the more damage will occur,” Shah says. “But if that heart is removed from one person and put into another, then that raises [another question]: If this heart can work in another body, why couldn’t it have worked in the body from which it was removed?”\nMedical teams must make these decisions quickly, under immense pressure, which means health disparities tied to age and race can surface, as documented in reports by the National Academy of Medicine and similar health organizations. Jahi McMath, for example, was Black, and her parents reported evidence of physician negligence in the hours before her death. “If the hospital had been more compassionate, would we have fought so much?” Jahi’s grandmother told Aviv in the New Yorker article. Part of the reason it was so hard for her family to believe she was dead may have been the amount of effort doctors appeared to put in (or not) to save her while she was alive.\nEven if it were available for use in humans, OrganEx almost certainly would not have mattered in McMath’s case. Still, it’s possible to picture a future in which it is used to preserve organs against the wishes of a family, used too late, or not used at all. Imagine the impact if the system ever caused the kind of head movements in a loved one that the Yale researchers observed in pigs. Ultimately making the right decisions under these circumstances won’t rely on the scientists who develop the new technology, but on philosophers, academics, and the law. As Shah puts it: “Is the way we determine death based on a legal construct, a social determination, or a biological fact?”\nFor now, it’s often based on a lack of brain function, but you don’t have to go far in the history of medicine to know that nothing lasts forever. Maybe not even death."
    },
    {
      "url": "https://www.popularmechanics.com/science/a61058879/cia-stargate-project/",
      "text": "IN 1972, AMERICAN ARTIST AND PSYCHIC INGO SWANN altered the magnetic field inside a thickly shielded vacuum container located underground for several seconds—by simply thinking about it.\nAs Harold Puthoff, a physicist with the Stanford Research Institute, witnessed the output from his magnetometer changing, he was mind-blown. There was no physical explanation for the reading changing the way it did. And as soon as Puthoff asked Swann to stop thinking about the apparatus, the unexplained changes in the magnetic field abruptly stopped.\n“These phenomena are real. Psychic phenomena are real,” Dean Radin, Ph.D., chief scientist at the California-based nonprofit Institute of Noetic Sciences, tells Popular Mechanics. He’s been examining parapsychology, or the study of psychic events, for the past four decades.\nAnd in the early 1970s—in the midst of the Cold War against the Soviet Union—the U.S. government agreed.\nBy the time Puthoff and his colleague Russel Targ, another physicist at the Stanford Research Institute (now known as SRI International), presented their results at an international meeting on quantum physics and parapsychology, the CIA had already begun working with SRI to perform top-secret research on paranormal phenomena—primarily “remote viewing” for intelligence collection. Remote viewing refers to a type of extra-sensorial perception that involves using the mind to “see” or manipulate distant objects, people, events, or other information that are hidden from physical view.\nBy the mid-1980s, the Defense Intelligence Agency (DIA) took the program over, calling it “Stargate.” DIA had three main goals for its research:\n- Determine how to apply remote viewing to intelligence gathering against foreign targets;\n- Figure out how other countries could be doing the same thing and using it against the U.S.; and\n- Perform laboratory experiments to find ways to improve remote viewing for use in the intelligence field\nThe program was about as clandestine as it gets. Radin, who served as a visiting scientist on the Stargate program, says security personnel would brief him and his colleagues about the incredible sensitivity of their highly classified work every two weeks, and ask them if they had any reason to believe that anyone outside of the project knew anything about it.\n“You had to become a professional paranoid, essentially. It was very uncomfortable for me,” Radin says.\nHe remembers asking one of his supervisors what would happen if they had a breakthrough—say, coming up with a drug to make someone super psychic. The response was immediate. “It would disappear and you would never be able to talk about it again,” Radin recalls, “which is antithetical to the whole scientific process, but I also understood why.” Any weapon or intelligence tool developed under Stargate would have presumably been too valuable and too dangerous for public release.\nThe DIA continued the project until the mid-1990s, when the CIA began declassifying its documents on remote viewing research to facilitate an external review of the project, and the DIA quickly followed suit. In June 1995, the CIA asked The American Institutes for Research (AIR)—an Arlington, Virginia-based nonprofit tasked with evaluating and providing technical assistance in behavioral and social science research—to conduct an external review of the Stargate program.\nTo present a balanced review of the scientific credibility of the program, AIR asked two researchers with opposing perspectives on parapsychology to write the report: Jessica Utts, Ph.D., an accomplished statistician and now professor emerita at the University of California, Irvine, who views parapsychology as a promising science; and Ray Hyman, Ph.D., a renowned psychologist and now professor emeritus at the University of Oregon, who is a noted skeptic and critic of parapsychology.\n“They sent us these boxes full of reports and papers and told us we had one summer to write this report,” Utts tells Popular Mechanics. She and Hyman separately reviewed dozens of Stargate experiments while also taking into account data from the broader scientific community at the time.\nThe reviewers’ individual conclusions were as expected. Utts found the statistics compelling, and believed the studies provided strong evidence that remote viewing is a human capability. One of the things she found most convincing was that the results seen across studies in different laboratories were all very similar. “And it was all statistically significant,” she says, “so that’s really hard to explain by chance, or cheating, or coincidence, or fluke.”\nTo that extent, Hyman agreed with Utts, but it wasn’t enough to convince him that remote viewing is real. He found what he considered to be potential flaws in the experimental methods, such as using the same person to judge psychic ability in each trial, and determined that the experimental results were not consistent enough with experiments outside the program. Nonetheless, he wrote in the final report: “The case for psychic functioning seems better than it ever has been. The contemporary findings along with the output of the [Stargate] program do seem to indicate that something beyond odd statistical hiccups is taking place.”\nDespite what may be viewed as an optimistic review, the Stargate program no longer exists, and as far as we know, the U.S. government hasn’t continued such research. “I’m sorry it ended, because I really do think that there’s much more to be discovered there,” Utts says.\nBut maybe it hasn’t ended. Maybe it’s just top secret. Only a true psychic would know.\nKimberly is a freelance science writer with a degree in marine biology from Texas A&M University, a master's degree in biology from Southeastern Louisiana University and a graduate certificate in science communication from the University of California, Santa Cruz. Her work has been published by NBC, Science, Live Science, Space.com and many others. Her favorite stories are about health, animals and obscurities."
    },
    {
      "url": "https://www.popularmechanics.com/promotions/a40118846/download-exclusive-pop-mech-digital-issues/",
      "text": "August / September 2025\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ The Worst Air Disaster in American History Happened in Broad Daylight. Will More Mistakes Keep Happening?\n➡ NASA Has a Plan to Save Earth from Planet-Destroying Asteroids. It Sounds Even Wilder than Science Fiction.\n➡ A Naval Officer Says Underwater UFOs Are Legitimate Threats. The Evidence Is Hard to Ignore.\n➡ When You Die, a Psychedelic Molecule Shapes Your Final Moments of Consciousness, a New Theory Reveals.\nJune/July 2025\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ This Undersea Explorer Found America's Greatest Sunken Treasure. Then Things Got Really Weird.\n➡ Is Bigfoot Hiding in the Swamps of Florida? This Group Says It Has Proof.\n➡ Scientists May Have Gotten the Global-Warming Timeline Seriously Wrong.\n➡ A Third State Now Exists Between Life and Death, Some Scientists Now Believe\nApril/May 2025\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Scientists Successfully Revive a Dead Brain, Redefining the Boundary Between Life and Death\n➡ Fingerprints Keep Leading to Wrongful Convictions. Why Do Courts Still Rely on Them?\n➡ For 80 Years, the North Sea Held a Deadly Killer. Now Scientists Are Racing to Defuse the Threat.\n➡ They Built the Quietest Room in the World. Why Is Everyone So Afraid to Step Inside It?\nFebruary/March 2025\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ This Guy Says He Knows the Truth About UFOs. Should We Believe Him?\n➡ Scientists Are Now One Step Away From Solving Nuclear Fusion—And Unlocking Unlimited Energy.\n➡ A Million-Dollar Heist Rocked the Art World— Then Amateur Sleuths Cracked the Case\n➡ A New Era of Missile Warfare Has Begun—and the U.S. Isn’t Ready\nDecember/January 2025\nThis issue is optimized for mobile/tablet viewing.\nIt's also available on Apple News+.\nFeaturing:\n➡ A Clue Hidden in a 400-Year-Old Map Might Have Just Solved One of America's Greatest Mysteries\n➡ Inside the Deranged Plot to Smuggle Cocaine With an Armed Soviet-Era Submarine\n➡ This Brilliant Engineer Helped Build the B2 Bomber—Then He Sold America's Stealth Secrets to China\n➡ Your Consciousness Can Connect With the Whole Universe\nOctober/November 2024\nThis issue is optimized for mobile/tablet viewing.\nIt's also available on Apple News+.\nFeaturing:\n➡Untold Secrets Reveal How the Castle Bravo Test Became America’s Worst Nuclear Disaster\n➡ This Body Was Found Preserved on a Block of Ice in a Colorado Shed. It Had Been There for 30 Years.\n➡ It Was Supposed to Be America's Greatest Victory in Space—Then It Became NASA’s Worst Nightmare\n➡ The Sidewinder Missile Ruled the Air—Then the Soviets Stole the Design\nAugust/September 2024\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡This Man Knows the Truth About Amelia Earhart. Why Doesn't Anyone Believe Him?\n➡ The Army's Machine Gun Is No Match for Cheap Chinese Body Armor. So It's Making a New One.\n➡ Russia Built a Stunning Rival to the Supersonic Concorde—and Then It Fell From the Sky\n➡ A Navy Admiral Says Underwater UFOs Are a Threat—and the Pentagon is Withholding Secrets\nJune / July 2024\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡4 Black Eggs Have Surfaced From the Depths of the Ocean— and the Mysterious Creatures Inside Are Baffling Science\n➡ A $2 Million Treasure Appeared in a Kentucky Cornfield. No One Knows Where It Came From.\n➡ A Million-Dollar Heist Rocked the Art World— Then Amateur Sleuths Cracked the Case\n➡ A New Era of Missile Warfare Has Begun—and the U.S. Isn’t Ready\nApril May / 2024\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡The Man Who Knows Too Much About Area 51\n➡ How the FBI Took Down the Internet's Most Dangerous Website\n➡ A Staggering New Clue Emerges in the D.B. Cooper Hijacking Mystery\n➡ The Wildest Prison Break in U.S. History\n➡ The Secret to a Perfect Lawn Lies in One of These 10 Electric Lawnmowers\nFebruary / March 2024\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡The Incredible Mystery of NASA’s Missing Moondust\n➡ Inside the Final Fiery Minutes of the East Palestine Train Wreck\n➡ Scientists Believe They’ve Unlocked Consciousness—and It Connects to the Entire Universe\n➡ Why This Unstoppable Stealth Bomber Will Rule the Skies\n➡ America Is Developing a New Nuclear Bomb—But Can’t Test Whether It Works\n➡ The 8 Best, Expert-Recommended Solar-Powered Generators\nSpecial Issue: Nukes\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ How Deadly Nuclear Waste Is Menacing This St. Louis Neighborhood\n➡ The Terrifying History of Russia's Nuclear Submarine Graveyard\n➡ Strange Mutations in Stray Dogs Near Chernobyl Suggest They Are Rapidly Evolving\n➡ America Dumped 56 Million Gallons of Radioactive Material Along the Columbia River—Then It Started to Leak\nDecember 2023 / January 2024\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ A New Clue In Amelia Earhart's Disappearance Emerges From the Ocean\n➡ How an Alleged Water Bandit Stole $25 Million in Water from Thirsty California Farms\n➡ A Coal Mine Exploded and 300 Miners Died. What Went Wrong?\n➡ China Just Built a Terrifying New Aircraft Carrier and May Soon Dominate the Seas\nOctober / November 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ How Rats Took Over Our Cities—And Why We Can't Stop Them\n➡ This Language Is on the Verge of Extinction. Can It Be Saved?\n➡ America's Deadliest Warplane Returns in a New Doomsday Role\n➡ This Amateur Diving Group Kept Solving Cold Cases. Then Its Own Skeletons Surfaced.\n➡ The Scientific Breakthrough That Could Put an End to Gray Hair.\nAugust/September 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Immortality Is in Reach. But It’s Not What We Imagined.\n➡ Your Next iPhone (and Nuclear Subs) Will Be Powered By Space Metal\n➡Scientists Now Think We Can Build a Warp Drive\n➡ China and Russia Have Cracked the Stealth Code. Can the U.S. Regain Air Dominance?\nJune/July 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ The CIA’s Secret Plan to Build a Laser Beam Powered by the Human Mind\n➡ The 747 Ruled the Skies—Then One Slammed Into a Mountain\n➡The Race to Contain AI Before Singularity\n➡ These Florida Homes Aren’t Just Hurricane-Proof—They’re Blueprints for the Future\nApril/May 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ AI Is on the Cusp of Taking Control—This Is How It May All Go Wrong\n➡ There’s No Weapon Russia Fears More Than the HIMARS Rocket Launcher\n➡The Nuclear-Submarine Arms Race Is Getting Intense, and the U.S. Just Took a Massive Leap Forward\n➡ Iran Is Becoming a Drone Superpower—By Stealing American Technology\nFebruary/March 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ The Greatest Treasure Hunt in American History Ended—and Then Things Got Weird\n➡ These Are the High-Powered Weapons Ukraine Needs to Send Russia Running\n➡ The Secret War to Take Out Iran’s Fleet of F-14 Jets\n➡ Russia Is Trying to Intimidate the U.S. with Hypersonic Missiles and Big, Scary Nukes—And It's More Than a Threat\nDecember 2022/January 2023\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Is Death Real?\n➡ China and Russia Are Dominating the Hypersonic Arms Race—And It’s Not Even Close\n➡ When the South Fork Dam Broke, a Pennsylvania City Washed Away. Which Town Is Next?\n➡ The Navy’s New $13 Billion Aircraft Carrier Is Already Obsolete. This Weapon Can Save It.\nOctober/November 2022\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Can America's M1 Abrams Still Compete With China's and Russia's Latest Battle Tanks?\n➡ Inside the Final Minutes of the Concorde Disaster—and How It Doomed Supersonic Travel for Decades\n➡ How the Massive Cargo Ship Felicity Ace Sank, Taking $400 Million Worth of Exotic Supercars With It\n➡ I Turned My Old Gas-Guzzler Into a Zippy EV for $15,000\nAugust/September 2022\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Cosmic Secrets of the 17 Most Powerful Mega-Telescopes on Earth—and Beyond\n➡ Can the Air Force's Secret, Hypersonic Jet Reclaim the Skies From Russia and China?\n➡ For 50 Years, the Zodiac Killer's 340 Cipher Stumped the FBI—Then Three Amateurs Cracked the Code\n➡ America's Most Fearsome Howitzer Has Entered the War in Ukraine\nJune/July 2022\nDOWNLOAD HERE\nThis issue is optimized for mobile/tablet viewing. It's also available on Apple News+.\nFeaturing:\n➡ Every Single Drone Fighting in the Skies Over Ukraine\n➡ How to Buy a New Car in 2022 Without Getting Fleeced\n➡ This Megastructure Could Keep Us Alive Forever\n➡ The Race to Revolutionize EV Batteries"
    },
    {
      "url": "https://www.biography.com/authors-writers/william-shakespeare",
      "text": "1564–1616\nWho Was William Shakespeare?\nWilliam Shakespeare was an English playwright, poet, and actor of the Renaissance era. He was an important member of the King’s Men theatrical company from roughly 1594 onward. Known throughout the world, Shakespeare’s works—at least 37 plays, 154 sonnets, and 2 narrative poems—capture the range of human emotion and conflict and have been celebrated for more than 400 years. Details about his personal life are limited, though some believe he was born and died on the same day, April 23, 52 years apart.\nQuick Facts\nFULL NAME: William Shakespeare\nBORN: c. April 23, 1564\nDIED: c. April 23, 1616\nBIRTHPLACE: Stratford-upon-Avon, England\nSPOUSE: Anne Hathaway (1582–1616)\nCHILDREN: Susanna, Judith, and Hamnet\nASTROLOGICAL SIGN: Taurus\nEarly Life\nThe personal life of William Shakespeare is somewhat of a mystery. There are two primary sources that provide historians with an outline of his life. One is his work, and the other is official documentation such as church and court records. However, these provide only brief sketches of specific events in his life and yield little insight into the man himself.\nWhen Was Shakespeare Born?\nNo birth records exist, but an old church record indicates that William Shakespeare was baptized at Holy Trinity Church in Stratford-upon-Avon, England, on April 26, 1564. From this, it is believed he was born on or near April 23, 1564, and this is the date scholars acknowledge as Shakespeare’s birthday. Located about 100 miles northwest of London, Stratford-upon-Avon was a bustling market town along the River Avon and bisected by a country road during Shakespeare’s time. Today, the city is part of the United Kingdom.\nParents and Siblings\nShakespeare was the third child of John Shakespeare, a glove-maker and leather merchant, and Mary Arden, a local heiress to land. John held official positions as alderman and bailiff, an office resembling a mayor. However, records indicate John’s fortunes declined sometime in the late 1570s. Eventually, he recovered somewhat and was granted a coat of arms in 1596, which made him and his sons official gentleman.\nJohn and Mary had eight children together, though three of them did not live past childhood. Their first two children—daughters Joan and Margaret—died in infancy, so William was the oldest surviving offspring. He had three younger brothers and two younger sisters: Gilbert, Joan, Anne, Richard, and Edmund. Anne died at age 7, and Joan was the only sibling to outlive William.\nChildhood and Education\nScant records exist of Shakespeare’s childhood and virtually none regarding his education. Scholars have surmised that he most likely attended the King’s New School, in Stratford, which taught reading, writing, and the classics, including Latin. He attended until he was 14 or 15 and did not continue to university. The uncertainty regarding his education has led some people question the authorship of his work.\nWife and Children\nShakespeare married Anne Hathaway on November 28, 1582, in Worcester, in Canterbury Province. Hathaway was from Shottery, a small village a mile west of Stratford. Shakespeare was 18, and Anne was 26 and, as it turns out, pregnant.\nTheir first child, a daughter they named Susanna, was born on May 26, 1583. Two years later, on February 2, 1585, twins Hamnet and Judith were born. Hamnet died of unknown causes at age 11.\nShakespeare’s Lost Years\nThere are seven years of Shakespeare’s life where no records exist: after the birth of his twins in 1585 until 1592. Scholars call this period Shakespeare’s lost years, and there is wide speculation about what he was doing during this period.\nOne theory is that he might have gone into hiding for poaching game from local landlord Sir Thomas Lucy. Another possibility is that he might have been working as an assistant schoolmaster in Lancashire. Some scholars believe he was in London, working as a horse attendant at some of London’s finer theaters before breaking on the scene.\nBy 1592, there is evidence Shakespeare earned a living as an actor and a playwright in London and possibly had several plays produced. The September 20, 1592, edition of the Stationers’ Register, a guild publication, includes an article by London playwright Robert Greene that takes a few jabs at Shakespeare:\n“...There is an upstart Crow, beautified with our feathers, that with his Tiger’s heart wrapped in a Player’s hide, supposes he is as well able to bombast out a blank verse as the best of you: and being an absolute Johannes factotum, is in his own conceit the only Shake-scene in a country.”\nScholars differ on the interpretation of this criticism, but most agree that it was Greene’s way of saying Shakespeare was reaching above his rank, trying to match better known and educated playwrights like Christopher Marlowe, Thomas Nashe, or Greene, himself.\nPoems and Sonnets\nEarly in his career, Shakespeare was able to attract the attention and patronage of Henry Wriothesley, the Earl of Southampton, to whom he dedicated his first and second published poems: Venus and Adonis (1593) and The Rape of Lucrece (1594). In fact, these long narrative poems—1,194 and 1,855 lines, respectively—were Shakespeare’s first published works. Wriothesley’s financial support was a helpful source of income at a time when the theaters were shuttered due to a plague outbreak.\nShakespeare’s most well-known poetry are his 154 sonnets, which were first published as a collection in 1609 and likely written as early as the 1590s. Scholars broadly categorize the sonnets in groups based on two unknown subjects that Shakespeare addresses: the Fair Youth sonnets (the first 126) and the Dark Lady sonnets (the last 28). The identities of the aristocratic young man and vexing woman continue to be a source of speculation.\nThe King’s Men: Life as an Actor and Playwright\nIn 1594, Shakespeare joined Lord Chamberlain’s Men, the London acting company that he worked with for the duration of his career. Later called the King’s Men, it was considered the most important troupe of its time and was very popular by all accounts. Some sources describe Shakespeare as a founding member of the company, but whatever the case, he became central to its success. Initially, he was an actor and eventually devoted more and more time to writing.\nRecords show that Shakespeare, who was also a company shareholder, had works published and sold as popular literature. Although The Taming of the Shrew is believed to be the first play that Shakespeare wrote, his first published plays were Titus Andronicus and Henry VI Part 2. They were printed in 1594 in quarto, an eight-page pamphlet-like book. By the end of 1597, Shakespeare had likely written 16 of his 37 plays and amassed some wealth.\nAt this time, civil records show Shakespeare purchased one of the largest houses in Stratford, called New Place, for his family. It was a four-day ride by horse from Stratford to London, so it’s believed that Shakespeare spent most of his time in the city writing and acting and came home once a year during the 40-day Lenten period, when the theaters were closed. However, Shakespeare expert and professor Sir Stanley Wells posits that the playwright might have spent more time at home in Stratford than previously believed, only commuting to London when he needed to for work.\nAlthough the theater culture in 16th century England was not greatly admired by people of high rank, some of the nobility were good patrons of the performing arts and friends of the actors. This notably included Queen Elizabeth I, who was a fan of Lord Chamberlain’s Men by the late 1590s after first watching a performance in 1594, and her successor King James I. Following his crowning in 1603, the company changed its name to the King’s Men.\nGlobe Theater\nBy 1599, Shakespeare and several fellow actors built their own theater on the south bank of the Thames River, which they called the Globe Theater. Julius Caesar is thought to be the first production at the new open-air theater. Owning the playhouse proved to be a financial boon for Shakespeare and the other investors.\nIn 1613, the Globe caught fire during a performance of Henry VIII and burned to the ground. The company quickly rebuilt it, and it reopened the next year. In 1642, Puritans outlawed all theaters, including the Globe, which was demolished two years later. Centuries passed until American actor Sam Wanamaker began working to resurrect the theater once more. The third Globe Theater opened in 1997, and today, more than 1.25 million people visit it every year.\nWilliam Shakespeare’s Plays\nIt’s difficult to determine the exact chronology of Shakespeare’s plays, but over the course of two decades, from about 1590 to 1613, he wrote 37 plays revolving around three main themes: history, tragedy, and comedy. Some plays blur these lines, and over time, our interpretation of them has changed, too.\nShakespeare’s early plays were written in the conventional style of the day, with elaborate metaphors and rhetorical phrases that didn’t always align naturally with the story’s plot or characters. However, Shakespeare was very innovative, adapting the traditional style to his own purposes and creating a freer flow of words.\nWith only small degrees of variation, Shakespeare primarily used a metrical pattern consisting of lines of unrhymed iambic pentameter, or blank verse, to compose his plays. At the same time, there are passages in all the plays that deviate from this and use forms of poetry or simple prose.\nDownload our complete William Shakespeare Study Guide for free to explore the key themes and characters from three of his most important plays.\nHistories\nMany of Shakespeare’s first plays were histories. All three Henry VI plays, Richard II, and Henry V dramatize the destructive results of weak or corrupt rulers and have been interpreted by drama historians as Shakespeare’s way of justifying the origins of the Tudor Dynasty. Other histories include Richard III, King John, the two Henry IV plays, and Henry VIII. With exception of Henry VIII, which was Shakespeare’s last play, these works were likely written by 1599.\nTragedies\nAlthough Shakespeare wrote three tragedies, including Romeo and Juliet, before 1600, it wasn’t until after the turn of the century that he truly explored the genre. Character in Othello, King Lear, and Macbeth present vivid impressions of human temperament that are timeless and universal.\nPossibly the best known of these plays is Hamlet, which explores betrayal, retribution, incest, and moral failure. These moral failures often drive the twists and turns of Shakespeare’s plots, destroying the hero and those he loves.\nJulius Caesar, written in circa 1599, portrays upheaval in Roman politics that might have resonated with viewers at a time when England’s aging monarch, Queen Elizabeth I, had no legitimate heir, thus creating the potential for future power struggles.\nTitus Andronicus, Anthony and Cleopatra, Timon of Athens, and Coriolanus are Shakespeare’s other tragic plays.\nComedies\nShakespeare wrote comedies throughout his career, including his first play The Taming of the Shrew. Some of his other early comedies, written before 1600 or so, are: the whimsical A Midsummer Night’s Dream, the romantic Merchant of Venice, the wit and wordplay of Much Ado About Nothing, and the charming As You Like It.\nSome of his comedies might be better described as tragicomedies. Among these are Pericles, Cymbeline, The Winter’s Tale, and The Tempest. Although graver in tone than the comedies, they are not the dark tragedies of King Lear or Macbeth because they end with reconciliation and forgiveness.\nAdditional Shakespeare comedies include:\n- The Two Gentlemen of Verona,\n- The Comedy of Errors,\n- Love’s Labour’s Lost,\n- The Merry Wives of Windsor,\n- Twelfth Night,\n- Measure for Measure, and\n- All’s Well That Ends Well\nTroilus and Cressida is emblematic of the Shakespearean “problem play,” which defies genres. Some of Shakespeare’s contemporaries classified it as a history or a comedy, though the original name of the play was The Tragedie of Troylus and Cressida.\nCollaborations and Lost Play\nShakespeare is known to have created plays with other writers, such as John Fletcher. They co-wrote The Two Noble Kinsmen around 1613–14, making it Shakespeare’s last known dramatic work. They also collaborated on Cardenio, a play which wasn’t preserved. Shakespeare’s other jointly written plays are Sir Thomas More and The Raigne of King Edward the Third. When including these works, Shakespeare has 41 plays to his name.\nFirst Folio\nAlthough some of Shakespeare’s works were printed in his lifetime, not all were. It is because of the First Folio that we know about 18 of Shakespeare’s plays, including Macbeth, Twelfth Night, and Julius Caesar. John Heminge and Henry Condell, two of Shakespeare’s friends and fellow actors in the King’s Men, created the 36-play collection, which celebrated its 400th anniversary in 2023. It was published with the title Mr. William Shakespeare’s Comedies, Histories and Tragedies in 1623, seven years after Shakespeare died.\nIn addition to its literary importance, the First Folio contains an original portrait of Shakespeare on the title page. Engraved by Martin Droeshout, it’s considered one of the two authentic portraits of the writer. The other is a memorial bust at Holy Trinity Church in Stratford.\nToday, there are 235 surviving copies of the First Folio that date back to 1623, but experts estimate roughly 750 First Folios were printed. Three subsequent editions of Shakespeare’s Folio, with text updates and additional plays, were published between 1632 and 1685.\nDid Shakespeare Write His Own Plays?\nAbout 150 years after his death, questions arose about the authorship of Shakespeare’s plays. Scholars and literary critics began to float names like Christopher Marlowe, Edward de Vere, and Francis Bacon—men of more known backgrounds, literary accreditation, or inspiration—as the true authors of the plays.\nMuch of this stemmed from the sketchy details of Shakespeare’s life and the dearth of contemporary primary sources. Official records from the Holy Trinity Church and the Stratford government record the existence of Shakespeare, but none of these attest to him being an actor or playwright.\nSkeptics also questioned how anyone of such modest education could write with the intellectual perceptiveness and poetic power that is displayed in Shakespeare’s works. Over the centuries, several groups have emerged that question the authorship of Shakespeare’s plays.\nThe most serious and intense skepticism began in the 19th century when adoration for Shakespeare was at its highest. The detractors believed that the only hard evidence surrounding Shakespeare from Stratford-upon-Avon described a man from modest beginnings who married young and became successful in real estate.\nMembers of the Shakespeare Oxford Society, founded in 1957, put forth arguments that English aristocrat and poet Edward de Vere, the 17th Earl of Oxford, was the true author of the poems and plays of “William Shakespeare.” The Oxfordians cite de Vere’s extensive knowledge of aristocratic society, his education, and the structural similarities between his poetry and that found in the works attributed to Shakespeare. They contend that Shakespeare had neither the education nor the literary training to write such eloquent prose and create such rich characters.\nHowever, the vast majority of Shakespearean scholars believe that Shakespeare wrote all his own plays. They point out that other playwrights of the time also had sketchy histories and came from modest backgrounds.\nThey contend that King’s New School in Stratford had a curriculum of Latin and the classics could have provided a good foundation for literary writers. Supporters of Shakespeare’s authorship argue that the lack of evidence about Shakespeare’s life doesn’t mean his life didn’t exist. They point to evidence that displays his name on the title pages of published poems and plays.\nExamples exist of authors and critics of the time acknowledging Shakespeare as the author of plays such as The Two Gentlemen of Verona, The Comedy of Errors, and King John.\nRoyal records from 1601 show that Shakespeare was recognized as a member of the King’s Men theater company and a Groom of the Chamber by the court of King James I, where the company performed seven of Shakespeare’s plays. There is also strong circumstantial evidence of personal relationships by contemporaries who interacted with Shakespeare as an actor and a playwright.\nLater Years and Death\nAround the turn of the 17th century, Shakespeare became a more extensive property owner in Stratford. When his father, John, died in 1601, he inherited the family home. Then, in 1602, he purchased about 107 acres for 320 pounds.\nIn 1605, Shakespeare purchased leases of real estate near Stratford for 440 pounds, which doubled in value and earned him 60 pounds a year. This made him an entrepreneur as well as an artist, and scholars believe these investments gave him uninterrupted time to write his plays.\nA couple years prior, around 1603, Shakespeare is believed to have stopped acting in the King’s Men productions, instead focusing on his playwriting work. He likely spent the last three years of his life in Stratford.\nWhen Did Shakespeare Die?\nTradition holds that Shakespeare died on his 52nd birthday, April 23, 1616, but some scholars believe this is a myth. Church records show he was interred at Holy Trinity Church on April 25, 1616. The exact cause of Shakespeare’s death is unknown, though many people believe he died following a brief illness.\nIn his will, he left the bulk of his possessions to his eldest daughter, Susanna, who by then was married. Although entitled to a third of his estate, little seems to have gone to his wife, Anne, whom he bequeathed his “second-best bed.” This has drawn speculation that she had fallen out of favor or that the couple wasn’t close.\nHowever, there is very little evidence the two had a difficult marriage. Other scholars note that the term “second-best bed” often refers to the bed belonging to the household’s master and mistress, the marital bed, and the “first-best bed” was reserved for guests.\nLegacy\nThe Bard of Avon has gone down in history as the greatest dramatist of all time and is sometimes called England’s national poet. He is credited with inventing or introducing more than 1,700 words to the English language, often as a result of combining words, changing usages, or blending in foreign root words. If you’ve used the words “downstairs,” “egregious,” “kissing,” “zany,” or “skim milk,” you can thank Shakespeare. He is also responsible for many common phrases, such as “love is blind” and “wild goose chase.”\nFor all his fame today, Shakespeare’s reputation as a dramatic genius wasn’t recognized until the 19th century. Beginning with the Romantic period of the early 1800s and continuing through the Victorian period, acclaim and reverence for Shakespeare and his work reached its height. In the 20th century, new movements in scholarship and performance rediscovered and adopted his works.\nToday, his plays remain highly popular and are constantly studied and reinterpreted in performances with diverse cultural and political contexts. The genius of Shakespeare’s characters and plots are that they present real human beings in a wide range of emotions and conflicts that transcend their origins in Elizabethan England.\nQuotes\n- The fool doth think he is wise, but the wise man knows himself to be a fool.\n- This above all: to thine own self be true, and it must follow, as the night the day, thou canst not then be false to any man.\n- There is nothing either good or bad, but thinking makes it so.\n- Cowards die many times before their deaths; the valiant never taste of death but once.\n- Lord, what fools these mortals be!\n- To weep is to make less the depth of grief.\n- In time we hate that which we often fear.\n- Men at some time are masters of their fates: the fault, dear Brutus, is not in our stars, but in ourselves, that we are underlings.\n- What’s done cannot be undone.\n- We are such stuff as dreams are made on, and our little life is rounded with a sleep.\n- Madness in great ones must not unwatched go.\n- The first thing we do, let’s kill all the lawyers.\n- All the world’s a stage, and all the men and women merely players.\n- Give every man thy ear, but few thy voice.\n- I say there is no darkness but ignorance.\n- I wasted time, and now doth time waste me.\n- Some are born great, some achieve greatness, and some have greatness thrust upon them.\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\nThe Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us\nAdrienne directs the daily news operation and content production for Biography.com. She joined the staff in October 2022 and most recently worked as an editor for Popular Mechanics, Runner’s World, and Bicycling. Adrienne has served as editor-in-chief of two regional print magazines, and her work has won several awards, including the Best Explanatory Journalism award from the Alliance of Area Business Publishers. Her current working theory is that people are the point of life, and she’s fascinated by everyone who (and every system that) creates our societal norms. When she’s not behind the news desk, find her hiking, working on her latest cocktail project, or eating mint chocolate chip ice cream."
    },
    {
      "url": "https://www.popularmechanics.com/science/health/a61207150/young-blood-transfusions/",
      "text": "FROM VAMPIRES TO VAMPIRE FACIALS, humans have always been intrigued by young blood—and its potential revitalizing properties. Scientists aren’t immune to this curiosity, going so far as to sew mice together to find out what benefits an infusion of fresh blood might mean for an old body.\nJust last summer, a group of researchers at Harvard Medical School claimed to have extended the lives of old mice by connecting them to the circulatory systems of young mice, using a macabre method called “heterochronic parabiosis.”\nAfter spending three months conjoined with a furry whippersnapper, the old mice lived for an average of 6–9 percent longer than their control peers, and also experienced a kind of “rejuvenation effect,” in which their aging seemed to slow considerably.\nMonths earlier, in a separate study, the same research team had found that during parabiosis, the organs of the young mouse aged dramatically. When the mice—and their blood supplies—were disconnected, the organs of the young mouse seemed to recover, becoming biologically younger. In other words, the younger mouse experienced age reversal.\n“Age-reversing rejuvenation” sounds a lot like the claims myriad skin care products on the market make—and calls to mind the last time a scammy startup tried selling young blood to people desperate to avoid wrinkles.\nIn 2017, an entrepreneur named Jesse Karmazin began making some pretty outrageous claims. His startup, Ambrosia, was offering $8,000 infusions of blood plasma taken from donors as young as 16, touting the procedure as “plastic surgery from the inside out.” Just one infusion could improve a client’s appearance, sleep, and strength—and even treat diseases like Alzheimer’s, he said.\n“It reverses aging,” Karmazin told a reporter at the time. “There’s really no question whether it works or not.”\nIn reality, there were a lot of questions, and just two years later, the U.S. Food and Drug Administration (FDA) would shut it all down.\nTHE AGE-OLD ALLURE OF YOUNG BLOOD\nKarmazin was hardly the first optimist who hoped the blood of the youth might actually be the fountain of youth.\nOne of the earliest documented accounts of consuming blood for rejuvenating purposes comes from ancient Rome, when Pliny the Elder reported of sufferers of epilepsy descending on a wounded gladiator “to draw forth his very life.” More than 1,000 years later, rumor has it Pope Innocent VIII drank the blood of three 10-year-old boys in attempt to stave off his impending demise. (Spoiler alert: It didn’t work.)\nIn the late 16th century, a Hungarian Countess named Elizabeth Báthory was accused of torturing and killing as many as 600 young woman in her massive, hilltop castle. The first victims were the daughters of peasants who had come to the castle to find work as servants or maids. Then, Báthory allegedly moved on to the daughters of gentry sent by their parents to learn courtly etiquette at the castle. The victims were said to be tortured in horrific ways: covered in honey and given over to insects, whipped with stinging nettles, or plunged into ice baths during the dead of winter.\nBut the depravity Báthory is most remembered for today is her supposed obsession with virgin blood, and her belief it could preserve her beauty and vitality. She is rumored to have drunk the blood of her victims as well as bathed in it. The “blood countess,” as she came to be known, is thought to have inspired Bram Stoker’s 1897 novel Dracula.\nFast-forward to the 1920s, when Russian scientist Alexander Bogdanov gave himself many blood transfusions that he argued made him healthier, publishing a book touting the “stimulating” effects of young blood. Ironically, his twelfth and final transfusion led to malaria and tuberculosis, striking him dead at the tender age of 54.\nBogdanov’s grisly end didn’t dissuade tech CEO Bryan Johnson from infusing himself with a liter of his 17-year-old son’s plasma in the summer of 2023. Johnson, who has publicized his extreme wellness protocols (including more than 100 daily pills, a strict diet, and regular lab work) in his quest to live to 200, said on X (formerly known as Twitter) that there were “no benefits detected” from the transfusion.\nA STARTUP’S BLOODY BLUFFS\nBeginning in 2005, scientists started conjoining young mice to old mice to see how the latter might benefit. The resulting studies all seemed to point to the same thing: there was something about the new blood that made an aged rodent feel, act, and look young again. But what that something was—and how long its effects would last—remained a giant question mark.\nRegardless, such experiments excited Karmazin, a Stanford Medical School student who left his residency early to launch his startup, Ambrosia. In the summer of 2016, he announced a clinical trial—well, sort of. While most clinical trials pay their participants, Karmazin charged his. For $8,000, people 35 and older would receive two liters of blood plasma from donors who ranged from 16 to 25 years old. Since plasma transfusions were a well-established practice, Karmazin did not need to get approval from the FDA to administer his trial.\nTo run his study, Karmazin needed blood plasma from young people—at least 80 gallons, according to the startup founder. But blood banks don’t typically store their blood by age—or sell their plasma for age-defying experiments like the one Karmazin was proposing. Where he eventually found all this plasma, Karmazin refused to say.\nHe also refused to release much data following the “clinical trial,” instead bragging about its sensational “findings” once it wrapped in January 2018: that a person in their 60s saw their gray hair turn darker, that a participant with early onset Alzheimer’s showed progress after one treatment, and that many others experienced drastic improvements in inflammation and blood cholesterol levels.\nWhen the startup began offering plasma transfusions—$8,000 for one liter of young blood, or $12,000 for two liters—in five U.S. cities, the FDA stepped in. In early 2019, the agency warned consumers against purchasing young plasma. “There is no proven clinical benefit of infusion of plasma from young donors to cure, mitigate, treat, or prevent these conditions,” it said in a statement. “We strongly discourage consumers from pursuing this therapy outside of clinical trials under appropriate institutional review board and regulatory oversight.”\nAmbrosia announced it would stop its infusions that same day. But just a few months later, Karmazin announced the opening of Ivy Plasma, which also offered transfusions, but not plasma sourced strictly from young people.\nToday, neither business has a web presence.\nKEEPING THE YOUNG BLOOD HOPE ALIVE\n“There is evidence that the aging process is malleable, that we’re able to slow it,” says James P. White, Ph.D., a professor at Duke University and a member of the research team that extended the lives of mice by sewing them together. “Granted, that was in a non-human. But we are slowly starting to understand how aging works.”\nWhite says that while scientists have been conducting parabiosis experiments for decades, the study published last summer was a bit different because the mice stayed conjoined for a long time; twelve weeks for a mouse could equate to eight years for a human. Previous studies had left the mice connected for only five weeks.\n“We wanted to see if there was more permanent change. If the old mouse was continuously receiving young blood, would it reprogram?” he says. “What we were surprised to see was the reduction in aging, but, also, when we detached them, that they didn’t default back to old mice, they preserved their biological age longer than we thought.”\nWhat’s more, White also says that after detachment, the old mice had a new pep in their step, demonstrating more activity in their cages.\nWhile the experiment showed that young blood could slow aging in an old mouse, scientists still don’t know what it is in the blood that’s so beneficial. “There are components of blood—cells and metabolites and soluble factors,” he says. “Something in that cocktail is helping, but what that is, we don’t know.”\nIt could also be possible, he says, that the young blood is merely diluting the old blood, or “that the young mouse is absorbing old toxins.”\nWhatever’s going on, White says it’s a “huge leap,” to translate these results into “a clinic that administers young blood to humans for anti-aging purposes.”\nIf nothing else, it’s logically impossible to replicate the parabiosis process in humans.\n“Parabiosis is a continuous blood exchange. All the time, every day,” White says. “Transfusions 24/7 just aren’t practical.”\nWhile there are a few practical ways people can keep feeling youthful, he doubts you want to hear them: exercise, a good diet, stress relief.\nFor those waiting on something a little more miraculous, “there’s hope,” White says. “All these crazy experiments aside, we’re on the cusp of figuring out the aging process.”\nAshley Stimpson is a freelance journalist who writes most often about science, conservation, and the outdoors. Her work has appeared in the Guardian, WIRED, Nat Geo, Atlas Obscura, and elsewhere. She lives in Columbia, Maryland, with her partner, their greyhound, and a very bad cat."
    },
    {
      "url": "https://www.popularmechanics.com/science/a60453674/henrietta-lacks-and-hela-cells/",
      "text": "This story is a collaboration with Biography.com.\nIn March 2024, Tuskegee University unveiled a monument commemorating Henrietta Lacks\nand her contributions to the fight against polio. Just days later, submissions closed for the Henrietta Lacks Hometown Initiative’s contest to design a memorial in her native Halifax County, Virginia.\nIt’s not surprising that Lacks, whose “immortal” HeLa cells were pivotal in developing treatments for diseases such as polio, HIV/AIDS, and COVID-19, continues to be honored more than 70 years after her death. But Lacks’ legacy is complicated due to the ethical concerns surrounding the use of her special cells.\nLacks, who died of cancer at age 31 in 1951, was never aware that her cells led to significant medical advancements—or that they were taken without her consent. And even now, her strange case raises questions about the the morally dubious methods through which we achieved unquestionably positive breakthroughs in medicine.\nThe Immortal Life of Henrietta Lacks\nThough her cells live on in labs across the world, Henrietta Lacks’ life was short and full of challenges, and she remained largely unrecognized during her lifetime. It wasn’t until author Rebecca Skloot investigated the origins of the famous HeLa cells that Lacks’ story gained widespread attention with the bestselling 2010 book, The Immortal Life of Henrietta Lacks.\nThanks to Skloot and the descendants of Lacks, who have worked to retell her story through initiatives like HeLa100, we now know more about the life of the woman often referred to as “the mother of modern medicine.”\nOn August 1, 1920, Lacks was born in Roanoke, Virginia. According to Biography, following her mother’s death in 1924, Henrietta moved to her grandfather’s log cabin, a former slave quarters on a plantation. There, she lived with her cousin, David “Day” Lacks. At 14, she gave birth to their first child, Lawrence, and the couple married in 1941. Before moving to Maryland, they had a second child, Elsie, in 1939, and later expanded their family with three more children: David Jr., Deborah, and Joe.\nHenrietta had been experiencing “abnormal pain and bleeding in her abdomen” when she visited The Johns Hopkins Hospital in Baltimore on February 1, 1951. Lacks had to travel to Hopkins for treatment because, as Hopkins Medicine’s own website notes, at the time, the hospital “was one of only a few hospitals to treat poor African-Americans.”\nLacks was quickly diagnosed with cervical cancer by physician Howard Jones. She received radium treatments there, and without her consent, doctors extracted two cervical samples. Despite treatment, her condition worsened, leading to her readmission to the hospital on August 8. Lacks passed away on October 4, 1951, and was laid to rest in an unmarked grave in Clover, Virginia, where she spent her early years.\nBut unbeknownst to Lacks, or her family, the cervical samples taken without her consent revealed something extraordinary.\nLacks’ tumor cells were sent to the lab of Dr. George Otto Gey, a prominent cancer researcher. Gey collected cells “from all patients—regardless of their race or socioeconomic status—who came to The Johns Hopkins Hospital with cervical cancer,” according to the hospital’s website. But unlike previous samples that died within a day or two, Lacks’ cells amazingly doubled in number every 20 to 24 hours.\nThat discovery led to a medical revolution. As Biography summarizes:\n“Gey isolated and multiplied a specific cell, creating a cell line. He dubbed the resulting sample HeLa, derived from the name Henrietta Lacks. The HeLa strain revolutionized medical research. Jonas Salk used the HeLa strain to develop the polio vaccine, sparking mass interest in the cells. As demand grew, scientists cloned the cells in 1955.\nSince that time, over 10,000 patents involving HeLa cells have been registered. Researchers have used the cells to study disease and to test human sensitivity to new products and substances. More recently, the cells enabled the development of COVID-19 vaccines.”\nIt took nearly two decades for the Lacks family to learn about their relation to the immortal HeLa cells. During that time, the cells’ origin was mistakenly attributed in the media to fictitious names such as “Helen Lane” or “Helen Larson.”\nIn February 2010, Johns Hopkins addressed ethical concerns about the acquisition of the initial HeLa cells in a statement:\n“It’s important to note that at the time the cells were taken from Mrs. Lacks’ tissue, the practice of obtaining informed consent from cell or tissue donors was essentially unknown among academic medical centers. Sixty years ago, there was no established practice of seeking permission to take tissue for scientific research purposes.”\nBut that’s not quite the full story. Skloot’s research in The Immortal Life of Henrietta Lacksrevealed that additional cell samples were taken from Lacks beyond the initial two.\nLacks’ cells were special, but by the time Gey hoped to collect more samples, she had died. “Though no law or code of ethics required doctors to ask permission before taking tissue from a living patient,” Skloot wrote, “the law made it very clear that performing an autopsy or removing tissue from the dead without permission was illegal.”\nAfter Lacks’ death, doctors sought consent from her husband, Day, to perform an autopsy, but he initially refused. When they approached Day a second time, suggesting that the autopsy could yield test results that might benefit their children in the future, Day relented and gave his permission. Unfortunately, the promised test results were never provided to the Lacks family.\nJohns Hopkins maintains that the obfuscation wasn’t for financial gain. The university says, “Johns Hopkins has never sold or profited from the discovery or distribution of HeLa cells and does not own the rights to the HeLa cell line. Rather, Johns Hopkins offered HeLa cells freely and widely for scientific research.”\nBut other companies have financially benefited from the HeLa cells. Notably, Thermo Fisher Scientific reached a settlement with the Lacks family in 2023 over products related to the HeLa cell line, as reported by NPR. This settlement acknowledges the commercial use and financial gains derived from Lacks’ cells.\nDr. Gey’s actions, which were typical of an era when the potential benefits to many patients took precedence over the rights of individual medical research subjects, could have been driven by the belief that prioritizing consent might impede scientific progress. It wasn’t until 15 years after Lacks’ cells were harvested that a landmark research paper changed that belief.\nThe Evolution of Medical Ethics in America\nEthical standards in American medical science have dramatically evolved over the past century, notably in the attitude toward eugenics, which is the science of promoting desirable qualities in the human race, usually through some kind of controlled breeding.\n“When most people think of eugenics, they think of the unspeakable acts of Adolf Hitler and Dr. Josef Mengele,” Dr. Marilyn M. Singleton wrote in an article for the Journal of American Physicians and Surgeons. “But history tells us that some of America’s best and brightest promoted eugenics as settled science and necessary for the preservation of society.” (For example, Harvard professor W.E.B. DuBois supported selective breeding within the Black community, birth control pioneer Margaret Sanger advocated for “negative eugenics,” and even the NAACP ran “Better Baby” contests to fund its anti-lynching efforts.)\nAfter World War II, the revelation of Nazi medical crimes during the Doctors’ Trials at Nuremberg, including the experiments by Mengele, radically changed American views on eugenics and led to the Nuremberg Code, which prioritized voluntary consent in medical research. But the U.S. didn’t legally adopt the Nuremberg Code, nor immediately recognize the similarities between Nazi human experiments and its own practices, such as collecting Lacks’ cells without her consent.\nIn 1966, two decades after the start of the Doctors’ Trial, and 15 years after the death of Henrietta Lacks, Dr. Henry K. Beecher published a paper in The New England Journal of Medicine titled, “Ethics and Clinical Research.” It’s also known within medical circles today colloquially as “Beecher’s Bombshell.”\nThe paper criticized the use of unwitting patients in experiments that offered no benefit and often harmed them, detailing 22 shocking cases including soldiers given placebos for rheumatic fever based solely on their serial number, and patients being injected with live cancer cells without their informed consent.\nThe experiments chronicled in Beecher’s report rocked the medical world, since these were conducted not by German men on trial, but by respected institutions, prestigious scientists, and the U.S. military. Years later, the Office of Human Research Protections stated that this paper contributed to “the impetus for the first [National Institutes of Health] and [Food and Drug Administration] regulations.”\nBeecher’s paper strongly advocated for informed consent, challenging the prevailing notion among some circles that ethical scrutiny could hinder scientific progress.\nHow We Remember Henrietta Lacks\nThe story of Henrietta Lacks is often framed by the medical breakthroughs that her immortal cells facilitated, with a focus on the collective benefit rather than the ethical missteps that scientists took, and her family’s ignorance and lack of compensation. But decades before Lacks’ story became widely known, Beecher already argued against this idea:\n“An experiment is ethical or not at its inception,\" Beecher concludes, “it does not become ethical post hoc—ends do not justify means. There is no ethical distinction between ends and means.”\nIt’s impossible to say whether Henrietta Lacks would have consented to the use of her cells, especially with the knowledge of the remarkable medical achievements they’d unlock—achievements even the doctors who collected the cells couldn’t have predicted.\nWe know now that those HeLa cells changed medicine forever, and though some tried to obscure their origins, Henrietta Lacks is immortalized in medical history. But we also know now that, regardless of the laws at the time, it should have been Lacks’ choice whether she was immortalized at all. If only someone had thought to ask.\nMichale Natale is a News Editor for the Hearst Enthusiast Group. As a writer and researcher, he has produced written and audio-visual content for more than fifteen years, spanning historical periods from the dawn of early man to the Golden Age of Hollywood. His stories for the Enthusiast Group have involved coordinating with organizations like the National Parks Service and the Secret Service, and travelling to notable historical sites and archaeological digs, from excavations of America’ earliest colonies to the former homes of Edgar Allan Poe."
    },
    {
      "url": "https://www.popularmechanics.com/culture/a61857673/this-man-knows-the-truth-about-amelia-earhart-why-doesnt-anyone-believe-him/",
      "text": "RIC GILLESPIE REMEMBERS being asked over and over: When are you going after Amelia?\nIt was the late 1980s, just a few years after he had established the International Group for Historic Aircraft Recovery (TIGHAR). Gillespie was a former sales rep and investigator in the airplane insurance business. Whenever an airline was having problems—botched landings or outdated parts on aging planes, for instance—Gillespie was brought in to look into the situation and settle claims.\nAfter years of investigating crashes and settling claims, he turned to aviation mysteries like the legendary L’Oiseau Blanc (White Bird), which his brother told him about in 1980. The Levasseur PL.8 biplane was piloted by two French aviators who had hoped to complete the first nonstop trip across the Atlantic Ocean, but it vanished somewhere over coastal North America in 1927. An old hermit, the legend goes, heard a plane sputtering overhead while paddling his canoe; a 12-day search turned up nothing. Gillespie, captivated by the tale, thought he could apply his experience to tracking down the lost plane, an endeavor that still continues.\nGillespie never intended, though, to search for one of the most famous pilots of all time. Like many people, he had believed that on a long flight around the world, Amelia Earhart and her navigator, Fred Noonan, crashed and died. “That was the intuitive answer,” he says. He’d heard of other theories floating around aviation circles and elsewhere. One book, which was later pulled from shelves, posited that Earhart survived and lived out the rest of her life under an assumed identity. Another popular explanation was that Earhart had been captured and killed by the Japanese.\nEarhart’s plane, however, was never found. And as the years went on, Gillespie became more and more intrigued by what might have happened. The questions surrounding her disappearance gnawed at him.\nPlane crashes were common in the early days of aviation as daring pilots pushed the limits of flight. And many, like that of the White Bird, didn’t have a clear cause. But how could Earhart vanish on a round-the-world trip with the expressed support of the U.S. military and millions paying close attention? Skilled and determined, Earhart broke multiple records in the 1930s for speed and distance, including being the first woman to fly solo nonstop across the Atlantic. That wasn’t enough: She wanted to be the first woman to fly around the world. “Here was shining adventure, beckoning with new experiences, added knowledge of flying, of peoples—of myself,” she wrote in a journal entry before embarking in May 1937, according to East to the Dawn, Susan Butler’s definitive biography.\nNewspapers recounted each stop on her odyssey to readers across the globe. But on July 2, at the end of the most arduous leg of her worldwide journey, she failed to find Howland Island, her designated landing point. The Coast Guard and U.S. Navy spent 17 days looking for Earhart and her plane, but found no signs of her and gave up the search on July 19. The theory that emerged in the following weeks, one still endorsed by the U.S. government, is that Earhart exhausted her fuel supply and crashed into the waters of the Pacific Ocean.\nAs his efforts to locate the White Bird drew attention to his work, Gillespie and his nonprofit, TIGHAR, became a nexus for pilots, historians, and aviation enthusiasts. A charismatic fellow and gregarious self-promoter, Gillespie had gained a reputation as something of an Indiana Jones of lost aircraft. (He even says Raiders of the Lost Ark, in part, inspired his desire to search for lost planes.) In 1988, a couple of TIGHAR members approached Gillespie with a theory: Suppose that after failing to find Howland Island, Earhart followed a line of position, trying to find the next closest body of land. She flew north for a bit, found nothing, and backtracked, flying south until she eventually hit Gardner Island (now called Nikumaroro). There, at low tide, she landed her twin-engine plane on an outlying reef and later died as a castaway.\nTo Gillespie, the narrative was compelling. It soon absorbed him. Discovering her plane would be the pinnacle of his investigative work, and although he had no conclusive proof yet, he was gripped by the possibility. He decided to go looking for Amelia Earhart.\nGillespie’s belief that Earhart ended up a castaway has been bolstered by decades of rigorous research that has turned up clues and unearthed fragments of evidence. His theories have crystallized into something more rigid too—hardened by effort, discovery, and defeat, much of it in humid, briny Pacific air during the many costly expeditions that he has taken to Nikumaroro, searching for signs of the famous pilot.\n“I’m absolutely certain,” he told me this spring, brimming with conviction, “we’ve solved the Earhart mystery.”\nWere it only that simple. Gillespie has become a recognized expert on Earhart, regularly appearing on news broadcasts and in documentaries. His account of what happened in the weeks following July 2, 1937, has received international attention. Yet his steadfast adherence to his own narrative is contested by others who have also spent decades preoccupied with Earhart’s disappearance.\nMore than 30 years into his quest, Gillespie remains undeterred. He is certain he’s cracked the case. Now he has a seemingly harder task—convincing the world he is right.\nBY 1937, EARHART was already a celebrity, an icon of the Golden Age of Aviation. The two decades following World War I were a time when ace flyboys demonstrated that a plane could be used for more than killing the enemy. Air racing and aerial exploration came into full effect as metal monoplanes replaced wooden biplanes. Earhart was piloting her own plane in races and on long flights. That, in part, was the foundation of her fame: She was the rare woman among the brave and daring pilots.\n“Women must try to do things as men have tried,” she once wrote to her husband, the publishing scion George Putnam.\nFrom an early age, Earhart preferred bloomers and blouses to dresses and spent summer days playing basketball and climbing trees. At age 7, she built a homemade roller coaster with a ramp. On her first ride, she flipped into the air, crashed with a thud, and cut her lip. “It’s just like flying!” she said to her sister.\nDuring the First World War, she worked at an army field hospital and afterward enrolled in Columbia University with a vague ambition to go into medicine. That plan was derailed when her father took her to an air show in Long Beach, California, in 1920. Edwin Earhart paid $10 for a pilot, the aptly named Frank Hawks, to take his 23-year-old daughter on a 10-minute flight.\n“By the time I had got two or three hundred feet off the ground,” Earhart recalled in her journal, “I knew I had to fly.”\nFlying lessons followed, and in 1923 she became the first woman pilot to be licensed by the National Aeronautic Association. Near the end of the Roaring Twenties, she moved to Boston and scraped together enough money to invest in nearby Dennison Airport, where she became an instructor and even piloted the first flight to take off from the airfield. That caught the attention of Hilton H. Railey, a pilot who helped orchestrate her trip as the first woman to fly across the Atlantic Ocean in 1928—as a passenger. (Another woman, Amy Guest, dropped out to appease her worried family, but she insisted that her replacement be female.) The event catapulted Earhart onto the national stage. She was honored with medal ceremonies in Chicago, New York City, Boston, and Washington, D.C. With the help of Putnam, who at the time was still only her agent, she garnered endorsement deals for the products she used on her transatlantic flight—watches, tomato juice, malted milk tablets—and gave lectures for $300 a pop (about $5,500 in today’s money).\nIn 1932, Earhart embarked on her grandest undertaking yet—a solo transatlantic flight. No one had attempted the crossing since Charles Lindbergh made his historic flight in 1927. Earhart wanted to be the first woman to do it. On May 20, she took off from Newfoundland and aimed her Lockheed Vega 5B toward Paris. A fuel leak over the Atlantic forced her to land in Londonderry in Northern Ireland instead, 15 hours after taking off. She was short of her goal, but she had successfully flown across the Atlantic, touching down on May 21, exactly five years to the day of Lindbergh’s flight.\n“I chose to fly the Atlantic because I wanted to,” proclaimed Earhart in her memoir, The Fun of It, the final chapter of which she wrote just after her successful flight. “It was, in a measure, a self-justification—a proving to me … that a woman with adequate experience could do it.”\nSince her Londonderry detour was unplanned, no photos of Earhart’s landing exist, but one can assume that she was in her classic flight gear: shirt tucked into trousers or breeches, maybe with a scarf around her neck, maybe with a tie, all hidden under a thick leather jacket with her tousled brown hair cut short above the neck.\nWith her latest triumph behind her, Earhart used her increasing fame to seek equality for women in aviation and was fundamental in creating the Ninety-Nines, originally an organization of female pilots that continues today as a nonprofit, providing scholarships and networking opportunities. She served as aviation editor of Cosmopolitan. In 1935 she joined Purdue University in Indiana as career counselor, helping to encourage prospective female pilots.\nGILLESPIE FINDS EARHART’S early life and the circumstances of her final flight spellbinding—he’s drawn to her accomplishments and the influence she had on society. At age 76, with a trim white mustache, he has his own tousled mop of hair, although its color is stark white. And while he’s never tried flying around the world, he was a pilot for years.\nIn high school he earned his student’s pilot license. For six months after graduating college in 1969, he copiloted an old DC-3, flying a semipro hockey team, the Rochester Americans, to their games. Then he went into the U.S. Army; he was commissioned in 1971 but never deployed to Vietnam. In 1973, he mustered out as a First Lieutenant in the Signal Corps, cast about for a few months, and then found his ideal gig: investigating flight accidents for an aviation insurance company. Instead of a company car, he got access to company airplanes, including a Cessna Skyhawk.\nEvidently Gillespie was downright stubborn. He fought with management because he didn’t like that his clients’ insurance rates were going up. He was fired, then hired by a competitor, served as vice president of aviation doing similar work, and then resigned from that job for similar reasons, he says.\nNot long after that, in 1985, Gillespie and his wife, Patricia Thrasher, established TIGHAR, which currently has about 600 members. The organization is run out of several rooms in an old farmhouse in southeastern Pennsylvania, where I traveled to meet Gillespie one afternoon in March. From the front porch you can see the barn and the couple’s two horses.\nThose early years of TIGHAR were focused on searching for the White Bird. But in 1988, when two members—both retired military aerial navigators—suggested to Gillespie that Earhart died a castaway on Nikumaroro Island, the organization changed course. Finding Earhart became a central focus.\nGillespie was hooked. “It looked like a good hypothesis to test, that she might’ve gotten to this island,” he says. “We didn’t know if we’d be able to prove anything.”\nON FEBRUARY 11, 1937, Earhart, then 39 years old, announced her worldwide flight. She told the reporters that she was “tired of flying the Atlantic,” and had decided to become the first woman to fly around the world. She would skim the equator, traveling 27,000 miles in the process.\n“I want to do it because I want to do it,” she told Putnam, whom she’d married in 1931.\nHer famous plane was a Lockheed Model 10E Electra, modified for the long flight. Outfitted with two 600-horsepower engines, the plane also contained extra fuel tanks so it could carry 1,150 gallons and travel 4,000 miles.\nEarhart would not be the only one in the plane. With her was Fred Noonan, joining the flight at her request. Noonan was an experienced navigator who had worked for Pan American Airways guiding planes across the Pacific via celestial navigation, or using the stars and sun to plot a course.\nShe had several communications tools at her disposal, too. One was a radiotelephone. Long before cables had been laid on the oceans’ floors, cross-continent communication relied on shortwave radio waves reflecting against the ionosphere—the atmospheric layer capable of bouncing those waves over great distances in order to transmit voice messages. The other was her direction finder. A transmitter mounted on her plane could zero in on radio frequencies in kilocycles (kilohertz, in modern parlance) sent by receivers on the ground, a sort of homing technology that could tell her if her plane was pointed in the right direction. Radar, GPS, autopilot—all the gizmos that make air travel a virtual certainty today either did not exist or weren’t in regular use.\nIn May, Earhart and Noonan departed. She planned to travel west, starting and ultimately ending in Oakland. The first flight to Honolulu, a trip of a little more than 2,400 miles, went fine. It would be another 1,900 miles from Honolulu to Howland Island. But during takeoff, Earhart ripped the right wheel and undercarriage from the Electra. The plane was shipped back to California and repaired, and on May 21, she took off again, this time flying east to Miami. Earhart kept both her new direction and date of departure a secret. “It seemed sensible,” she recorded in her journal, “to slip away as quietly as we could.” From there she traveled to 21 destinations, crossing over South America and Africa, through the Middle East, Asia, and Australia, before reaching New Guinea on June 29.\nNew Guinea to Howland Island was the long leg over the Pacific Ocean. Waiting off Howland’s shore was the U.S. Coast Guard cutter USS Itasca, equipped with its own radio system and direction finder. The plan was for Noonan to use his celestial navigation tools to keep the Electra on course and close enough to the Itasca to pick up a radio signal. Then Earhart could home in on those signals with her direction finder, leading her and Noonan to Howland Island.\nBut the target itself was impossibly small—the size, approximately, of three golf courses. From the air it would’ve looked microscopic. The distance was immense, too: 2,556 miles. Earhart knew that the task ahead of her was difficult.\n“This evening, I looked eastward over the Pacific,” Earhart journaled on July 1. “I shall be glad when we have the hazards of its navigation behind us.”\nWHEN EARHART AND Noonan take off July 2, the Electra contains roughly 24 hours of fuel for a trip estimated to take 19 hours.\nAt 6:46 a.m. Howland Island time, Earhart messages the Itasca at a frequency of 3105 kilocycles. She’s about 100 miles out, she says, and requests a bearing on her position. In other words, she wants the Itasca to use its direction finder to note her position at 3105 kilocycles.\nBut the Itasca can’t. Its direction finder can only pick up frequencies of 500 kilocycles—which the Electra can’t send. In California, while the Electra was being repaired after Earhart’s crash in Hawaii, Lockheed removed a trailing wire capable of radiating 500 kilocycles. The communication issues are one of the most puzzling elements of her final flight. The Itasca repeatedly tries to explain that it cannot take bearings on 3105 kilocycles, but Earhart is not receiving its messages. They never establish two-way communication, and Earhart and Noonan never find the island.\nAt 7:42 a.m., Earhart transmits over the radio: “KHAQQ [her plane’s call letters] calling Itasca we must be on you but cannot see you but gas is running low been unable to read you by radio we are flying at 1,000 feet.”\nAt 7:58 a.m., more than 19 hours into the flight, she receives the only radio message from the Itasca, and transmits, at 8:04 a.m.: “KHAQQ calling Itasca we received your signals but unable to get a minimum please take bearing on us and answer 3105 with voice.”\nAt 8:44 a.m., 20 hours and 14 minutes into the flight, Earhart radioes: “We are on the line 157-337.” Very shortly thereafter, she transmits again: “We are running on line north and south.”\nShe tells the Itasca that she’s flying a compass line, with 157 meaning southeast and 337 meaning northwest. And then the ship’s radio operators hear nothing more.\nFor 17 days, U.S. ships and planes scoured an area of the Pacific Ocean equivalent to the size of Texas. At $4 million ($87 million in 2024), it’s considered the most expensive search ever for a downed aircraft. The searchers had hoped to find any signs that might lead them to the Electra: an oil slick, a fuel tank, life vests.\nWhen the search yielded no sign of Earhart near Howland Island, it expanded to nearby Gardner Island, about 400 miles southeast of Howland, where Gillespie believes Earhart and Noonan died as castaways. On July 7, the battleship USS Colorado—equipped with three catapult-launched float planes—reached the Phoenix Islands group, which includes Gardner.\n“I’m sure there was no one there in 1937. We saw nothing to lead anyone to think the island was occupied,” Lieutenant John Lambrecht, who flew one of those planes over Gardner, said several decades later. “If we had seen anything on any of the islands that possibly was connected to Earhart, we would have recommended landing and making a ground search.”\nOn July 19, having found no traces of either Earhart or Noonan, the U.S. government suspended the search. Putnam stayed at it longer. With his own money, he put together and directed a charter fleet that swept several islands, including the Phoenix Islands. Finally, in October of that year, he abandoned his search, the words of Earhart possibly echoing in his mind. “When I go,” she had often said to him, “I’d like best to go in my plane. Quickly.”\nA U.S. NAVY REPORT filed the day after the search for Earhart was halted offered an explanation for what happened. Captain J.S. Dowell, in a subsection titled “Assumptions,” wrote that Earhart’s plane “landed on water or an uncharted reef within 120 miles of the most probable landing point, 23 miles northwest of Howland Island.” In another subsection of the 10-page report, he added, “No sign nor any evidence of the Earhart plane was discovered.”\nOver the years, this report formed the basis of the official narrative of what happened after Earhart and Noonan vanished: They crashed in the Pacific Ocean. Still, not a single particle of debris was spotted during the search. Without definitive evidence, people were free to fill in their own details to explain what happened. And many did.\n“If it had been somebody else, people might not even be thinking of it anymore. But she was a woman of consequence,” says Dorothy Cochrane, a curator at the Smithsonian’s National Air and Space Museum.\nIn his 1966 book The Search for Amelia Earhart, San Francisco radio newscaster Fred Goerner, who died in 1994, laid out a case that Earhart had been captured by the Japanese. After failing to find Howland Island, he argued, Earhart and Noonan flew 760 miles in the other direction and crashed on Mili Atoll in the Marshall Islands; they were picked up by a Japanese warship and transported to Saipan, an island in the Northern Mariana Islands. Goerner traveled to Saipan several times, interviewing some 200 people in the process, and seemed satisfied with the idea. So do the Marshallese: In 1987, on the 50th anniversary of Earhart’s voyage, they issued stamps depicting her crash landing.\nThomas E. Devine, an Army sergeant stationed on Saipan after it was secured by the U.S. in 1944, came to a similar conclusion. He claims to have met Marines guarding an airfield hangar containing Earhart’s Electra and then to have witnessed the Electra in the air, its tail number NR16020 legible and unmistakable, before it was burned the same night by U.S. soldiers.\nYears before Gillespie began searching for clues around Gardner Island, someone else had suspected the island as a possible landing sight. Fred Hooven, an engineer and a pioneering radio expert, had met Earhart and even created an advanced direction finder that was installed, and then removed, from the Electra a year before its last flight. Hooven found credible evidence that Earhart and Noonan might have landed on Gardner. In 1982, he presented a paper during a symposium on Earhart held by the National Air and Space Museum, writing that the “evidence strongly supports the hypothesis that … the flyers landed … probably on McKean or Gardner” and then “transmitted signals from there during the next three days.” (Hooven later dismissed that idea, convinced by his friend Goerner that it was implausible.)\nTo Gillespie, however, a Gardner Island landing felt entirely reasonable. There’s little northwest of Howland Island, just huge expanses of open water. But the Phoenix Islands sit to the southeast. An old Navy map used to direct the search in 1937, he says, showed the likelihood of the scenario. TIGHAR members had tracked down the map in archival files in California, and it shows how line 157-337 nearly intersects with Gardner, which is south of the equator.\n“That’s why Noonan had her running up and down that line,” he says, “because he knew that line ran to a specific place.”\nTo truly test his theory, though, Gillespie needed physical evidence. In 1989, he took his first expedition to Nikumaroro, now one of the islands of the Republic of Kiribati. A thin deserted atoll in the South Pacific Ocean, Nikumaroro sits halfway between Australia and Hawaii. Barely five miles long, it’s composed of coral that surrounds an inner lagoon.\nTemperatures on the sun-scorched island can reach 100 degrees. The light reflecting off the ocean can be blinding. Getting on shore requires navigating a skiff through a narrow channel, barely 32 feet wide, that cuts through a reef just beyond the beach on the island’s western coast. The water churns violently. “It’s like a washing machine in there,” he says. “Everything about the place is difficult.”\nOn that first trip, Gillespie and his team looked closely at that reef. Without a suitable landing strip, Gillespie’s theory would have crumbled. Walking the reef, he found it flat and smooth—so level that you could ride a bicycle on it, he says, which was enough for him to believe a landing was possible.\nOn TIGHAR’s second expedition, in 1991, Gillespie made what he considered a huge discovery. Trudging along a reef, poking around the flotsam left from a recent storm, team members spotted the faint shimmer of a bent aluminum sheet. Measuring 19 inches wide by 23 inches long and packed with 103 rivet holes, the unassuming piece of metal might as well have been their Holy Grail. The following year, Gillespie proudly displayed the aluminum shard at a news conference in Washington, D.C. “There’s only one possible conclusion,” wrote Gillespie in an article for Life magazine. “We found a piece of Amelia Earhart’s aircraft.”\nThe evidence was engrossing, if not entirely convincing. Over the years, Gillespie has returned to Nikumaroro an additional nine times, turning up even more bits: pieces of the heel and sole from a shoe, broken glass from a compact mirror, a rusted jackknife, an empty bottle of freckle cream. Each trip is expensive—between $50,000 and $500,000. One visit, in 2012, cost $2 million. Private donors cover most of the costs. (FedEx and Discovery Channel have contributed to past expeditions but have not directly funded them.) On several of these trips, Gillespie and the TIGHAR members who accompany him have flown first to Fiji before boarding a 120-foot vessel for the 1,000-mile passage to Nikumaroro.\nOther evidence kept coming in that seemed to corroborate what Gillespie was finding on Nikumaroro. TIGHAR members who combed through U.S. Navy and Coast Guard reports, newspaper articles, and individual accounts found evidence of 135 messages that Earhart allegedly sent after landing. Of that number, Gillespie says that 57 of those, transmitted over a period of six days, could have been plausibly sent by the Electra.\n“If even one of them is credible,” he tells me, “she didn’t crash at sea.”\nThe 3105-kilocycle frequency, thanks to ionospheric refraction, can broadcast on multiples, or harmonics, of that frequency. Harmonics, in turn, can skip for thousands of miles. One message believed to be sent from Earhart’s Electra was recorded by 16-year-old Dana Randolph in Wyoming. On the morning of July 4, he heard: “This is Amelia Earhart. Ship is on reef south of the equator. Station KH9QQ.” (Randolph, it seems, misspelled the call letters.)\nThose transmissions would’ve been possible only if the propellers could spin to charge the radio batteries. That wouldn’t have worked at high tide, or if the Electra had sunk. Gillespie compared the time of each transmission to the island’s tides. Every message had been sent during low tide.\nBut why hadn’t the planes launched from the USS Colorado spotted the Electra, sitting there on the narrow, treeless reef? According to Gillespie, when Lieutenant Lambrecht reached the island on July 9, he saw signs of recent habitation, but no Electra. By that time the tides had washed the Electra off the reef and into the Pacific, out of sight. Gillespie points to the radio transmissions as evidence: The last recorded one was made on July 7.\nIn 2010, a forensic imaging specialist examined a wallet-size photograph taken in October 1937 during a British expedition to the island. Zooming in to a new high-resolution copy revealed what Gillespie believed to be part of the Electra’s landing gear. In a report published in a TIGHAR newsletter in 2013, Gillespie called the photograph the “best piece of quantifiable evidence suggesting that the Earhart/Noonan flight ended at Gardner Island.” He tempered that assessment at the end of that same bulletin: “Confirmation that the Earhart/Noonan flight ended on Nikumaroro must await the identification of a physical object that can be conclusively linked to the Electra or its crew.”\nEACH NEW CLAIM brought attention to Gillespie’s theory and acclaim for TIGHAR. But skepticism arose, too. One of the most vocal critics is Mike Campbell, a pugnacious U.S. Navy veteran, who wrote a book on Earhart in 2012. “You have no idea how fed up I am after 36 years of listening to this crap,” he told me when I contacted him.\nLike Devine and Goerner, he believes conclusively that Earhart and Noonan were captured by the Japanese. “Too much was involved around the Electra on Saipan for Devine to be mistaken,” he says. He calls the idea that Earhart landed where Gillespie says she did the “Nikumaroro virus.”\nGoerner even claims that Admiral Chester Nimitz, commander in chief of the U.S. Pacific Fleet in World War II, once said to him, “Now that you’re going to Washington, Fred, I want to tell you Earhart and her navigator did go down in the Marshalls and were picked up by the Japanese.”\nAnd don’t say “mystery” to Campbell unless you want a verbal shellacking. It’s no mystery that Earhart and Noonan crashed in the Marshall Islands. The only mystery is how she got that far west of Howland Island in the first place. “We don’t know how she arrived at Mili, or why,” he says.\nGillespie brushes this all off. When we met at his house, he brought up the Japanese-capture idea only to tell me “it’s been so thoroughly debunked that we don’t need to worry about it.”\nBut doubt persists. In all those trips to Nikumaroro, Gillespie has yet to discover evidence that definitively proves Earhart had ever been on the island. The shoes, mirror, and freckle cream that Gillespie found all could have belonged to someone else: While Nikumaroro was uninhabited at the time of Earhart’s disappearance, it was populated by dozens of people from 1939 to 1963. The aluminum sheet? For years, others surmised that it was stamped with letters indicating that it was from another aircraft. Earlier this year, Gillespie acknowledged that the metal panel belonged to a Douglas C-47 cargo plane.\nUndeterred, Gillespie has pressed on. At times he has felt defeated: During TIGHAR’s second trip to the island in 1991, the group received permission to exhume a grave on the eastern edge of the island, only to find that it was the final resting place of an infant. Still, he is relentless in his search and determined in his belief, maybe even to the point of obstinacy. And although he’s not as combative as his detractors, he is no less certain: Earhart died on Nikumaroro.\nMore recently, Gillespie has turned his attention to a set of skeletal remains discovered by a British expedition on the island in 1940: a skull, a humerus and radius of an arm, a tibia, fibula, and two femur bones. The bones had been taken to Fiji shortly after they were found, where a British doctor named D.W. Hoodless concluded that they’d belonged to a short, stocky man, quickly ending most speculation that they were Earhart’s or her navigator’s.\nGillespie, however, has long suspected they belonged to Earhart. In 1998, TIGHAR ran Hoodless’s measurements through an anthropological database. The results were encouraging—the bones were more likely to have come from a woman similar in size to Earhart than from the short, stocky man Hoodless suggested.\nThen, in 2018, a forensic anthropologist at the University of Tennessee, Knoxville, named Richard Jantz learned about the bones from the late Karen Burns, a colleague who’d traveled twice with TIGHAR to Nikumaroro. Jantz is perhaps best known for codeveloping Fordisc, a computer program used by forensic anthropologists worldwide that estimates sex and ancestry from skeletal measurements. Intrigued by what Burns had told him, Jantz reviewed the notes made by Hoodless. He then extrapolated the lengths of Earhart’s humerus and radius from a well-known photograph of the pilot holding a can of fuel. He got the tibia length by measuring the inseam of a pair of her pants housed at Purdue University. He then compared the lengths of the bones found on Gardner to his own estimates, and cross-referenced that data against the bone lengths of 2,777 other individuals kept in a database at his university’s forensic anthropology center. Jantz says the bones found on the island “are more consistent with Amelia Earhart” than all the other bones in the database.\nThis was the piece of evidence Gillespie had been waiting for—a bull’s-eye that erased any remaining doubt in his mind; vindication, even, for years of trying to persuade his critics that Earhart and Noonan had perished on Gardner Island. “How big a stack of coincidences do you want?” he says. “This is where she died. That’s her story. Show me where I’m wrong.”\nDNA evidence could prove Gillespie right, of course. But the bones were discarded decades ago, long before DNA profiling was established.\n“The bones are interesting. I’ll give them that,” says Tom Crouch, curator emeritus of the National Air and Space Museum. Still, he finds the Gardner Island theory dubious at best. “But it seems to me that if they have proven anything in all those trips to that tiny little island, it’s that she’s not there. Because if she had been there, by golly, they would’ve found something.”\nNOT EVERYONE FINDS Gillespie’s take as ironclad as he does. Questions remain. The enduring uncertainty of Amelia Earhart might be likened to a mathematical equation with a missing variable—an unknown that allows an infinite number of answers, each of them potentially right, and each, perhaps, impossible to prove.\nWhat hasn’t been found—the one object that would silence all questions about the fates of Earhart and Noonan, the crucial missing variable—is the plane.\n“What we don’t have is what everyone wants: a Lockheed Electra sitting on the bottom of the ocean that can be recovered and put in the Smithsonian,” Gillespie says.\nA new cohort of explorers is turning to advanced underwater sonar imaging technology in hopes of a breakthrough. One of the first to pioneer the tech was marine explorer Bob Ballard, who discovered the RMS Titanic on the ocean floor in 1985. Like Gillespie, he initially resisted searching for the Electra, but eventually went looking. In 2019 he organized an expedition to search the coast around Nikumaroro. He had been drawn there by TIGHAR’s research and was optimistic. For two weeks, his team used sonar and remote-operated vehicles to scan the depths around the island. But Ballard came up empty-handed. Apparently, he has plans to look off the coast of Howland Island next. In a PBS interview that aired last year, he said, “Stay tuned.” When asked if he’ll be able to find the Electra, he said, “Absolutely.”\nGillespie doubts Ballard will find anything. The Electra, as he has said for years, succumbed to rising tides and surf and was washed into the ocean off Nikumaroro’s coast, too deep for anyone to find.\nMeanwhile, in August 2023, an expedition led by pilot and U.S. Air Force veteran Tony Romeo traveled by ship to an area of the Pacific Ocean about 2,000 miles southwest of Hawaii, where he and several colleagues had determined the Electra might be found. His company, Deep Sea Vision, had purchased a powerful underwater drone from a Norwegian defense contractor for $9 million. Romeo used another $2 million of his own money earned from a career in real estate to fund the trip.\nDuring his own investigation, Romeo became familiar with TIGHAR’s work and says its website is an exceptional source of information on Earhart. “TIGHAR has done excellent research,” Romeo says. “I’ll give it to them.”\nUltimately, however, he chose to search near Howland Island, not Nikumaroro. It took more than three months, at $15,000 a day, but his six-person team eventually uncovered a sonar picture from 16,500 feet below that seemed to depict a fuselage, with two wings up front and two tail fins. Headlines in January trumpeted the find. “An Astonishing Ocean Discovery May Have Just Ended the 86-Year Search for Amelia Earhart,” wrote this magazine. “3 Miles Down, a Potential Clue to Earhart’s Fate” reported the New York Times.\n“It’s, I think, the first real evidence of a man-made object near Howland Island,” Romeo told me. He says Deep Sea Vision made the footage public because his team thinks they have a pretty good idea of what they’re looking at.\n“I’d like to see more engines in the sonar image,” he added. “But I think it’s promising. I’m open to the possibility that it’s not, or it’s a rock formation, or that it’s another plane. But it’s got the same characteristics of the tail that she had on her plane.”\nGillespie, as intransigent as ever, was ready to protest what he believes to be so clearly a false alarm. Four days after the New York Times published its article, Gillespie was on Fox News laying out his suspicions. The wings in the image? Swept back, and the Electra’s, he pointed out, are straight.\n“A couple million dollars buys an awful lot of confirmation bias,” Gillespie told the anchor.\nNo matter what Gillespie uncovers, analyzes, or explains, he still finds himself defending his theory, searching for evidence, and attempting to get the world to buy in. Those who agree with him have all the information they need. Those who disagree will continue to challenge him until irrefutable proof is produced. In September, he’ll publish One More Good Flight, a book that will sew all the threads of his Earhart story together. Will it become the definitive text? Or will it be yet another tome in the vast catalog of Earhart discourse?\n“All we can do is put the truth out there and hope that people who have credibility review my book and say, ‘He’s got a point here,’” Gillespie says.\nThere’s no more convincing he can do. He’s moving on to other things. After all, the White Bird is still out there.\nAndrew Zaleski, a writer based near Washington, D.C., covers science, technology, and business."
    },
    {
      "url": "https://www.popularmechanics.com/science/math/a65678154/hidden-math-inside-da-vinci-vitruvian-man/",
      "text": "Leonardo Da Vinci’s Vitruvian Man has been puzzling scholars for centuries.\nDa Vinci, who was not only a famous artist but also an inventor, engineer, and scientist studying subjects like human anatomy, drew the Vitruvian Man in 1490. The drawing is the epitome of his Renaissance interests, combining art with math. In the artwork, a sketch of an idealized man stands in two iterations: one with his legs and arms forming a T-shape and touching the edges of an inscribed square, and another in a star-shape with arms and legs spread to touch the edges of an inscribed circle. Da Vinci meticulously writes out many details about the proportions of this drawing, including the man’s outstretched arms equaling his total height and the length of his foot equaling one-sixth of his total height.\nBut one aspect he doesn’t clarify is the exact ratio between the circle and square such that an ideal human body can fit perfectly inside both. Scholars have tried to crack this mystery with geometrical methods for more than 500 years. One of the most famous proposed solutions is that da Vinci embedded the Golden ratio in this work. This ratio, about 1.618, can be found when a line is divided into two in a way that the ratio of the whole to the longer segment is the same as the longer is to the shorter. But while the Golden ratio can be found in other places in nature, such as the spiral of a Nautilus shell, its presence in the Vitruvian Man has largely been disproven.\nNow, a dental surgeon from London believes he has found a new solution to this mystery.\nIn a paper published earlier this year in the peer-reviewed Journal of Mathematics and the Arts, Rory Mac Sweeney, who says he is a self-taught mathematician, draws a connection between the shape of the human jaw and an equilateral triangle made by the man’s stretched-out legs in the drawing.\n“The question that’s being asked is about the ratio that Da Vinci uses,” says Mac Sweeney. “Historically, that’s been poised as the Golden Ratio, but there appears to be evidence of an alternative ratio solution in the circle and square.”\nMac Sweeney says this connection could reveal a deeper understanding by da Vinci of biomechanics and the ideal balance of forces in the human body. But is his math adding up?\nRenaissance math\nStudying Renaissance artwork may seem like an unusual hobby for a dentist, but Mac Sweeney says the interest actually began with a question about crooked teeth. Research has found that Neanderthals may have had fewer problems with dental crowding than is typical in the modern human mouth. So what’s going wrong with the modern human jaw, Mac Sweeney thought.\n“Why is there a disproportion between the human jaw and the human dentition?” Mac Sweeney says. “ Well, you’ve got to start with what's the ideal proportion… that’s why I turned to da Vinci, because I’m trying to find a mathematical solution to help me to understand this.”\nMac Sweeney may not have found a solution to crooked teeth, but here’s what he did find: In his paper, he explores a connection between the equilateral triangle described by da Vinci and an “imaginary” triangle called Bonwill’s triangle that connects the points of a human jaw to the tip of the bottom front teeth.\nThis dental triangle is typically used by specialists who study mandible function, and Mac Sweeney says it describes the optimal performance of the human jaw in relation to mechanical stress. Dental theories show that Bonwill’s triangle can also be described as the base of a tetrahedron (a three-dimensional triangular pyramid) and show that optimal jaw function can be achieved by mirroring the triangle six times to form a larger tetrahedron centered around the human skull, Mac Sweeney writes. The ratio of this tetrahedron’s height and edge length is approximately 1.633.\nBecause da Vinci’s and Bonwill’s triangles correspond, Mac Sweeney says, this shows that tetrahedron geometry can also be used to understand da Vinci’s drawing. Doing the same ratio calculation gives nearly the same value, 1.64.\nThis ratio can be found in other places as well, including a type of geometry problem called optimal sphere packing. Because of its ubiquity, Mac Sweeney suggests that this value may be a kind of universal balancing point between tension forces used to maximize efficiency. Instead of an idealized artistic representation of man, Mac Sweeney argues that da Vinci may have intuitively understood a universal mathematical principle and embedded it surreptitiously in his artwork.\nA different perspective\nWhile Mac Sweeney’s analysis is certainly unique for its incorporation of dental anatomy, it’s not necessarily unique in the value it finds. Other geometric methods used to evaluate this ratio have also converged on values roughly 1.65–1.68.\nYet despite coming to a similar conclusion, Mac Sweeney’s methods don’t necessarily have a lot of support from other mathematicians, like Daniel Mathews, Ph.D. an associate professor of math at Monash University in Australia. Mathews writes in an email to Popular Mechanics that, in addition to some errors in mathematical reasoning in the paper, he’s also not convinced this is a question that needs to be answered.\n“Since all these [other] geometric constructions involve techniques that would have been familiar to the ancient Greeks, hence also to Leonardo… and produce relatively close results, they all seem relatively plausible to me,” Mathews writes. “It also seems quite plausible to me that it’s ‘none of the above’—Leonardo might not have had any such elegant geometric construction in mind… Not everything about Leonardo da Vinci has to have a secret code to it!”\nMac Sweeney’s work, Mathews says, has some logical inconsistencies, such as how the Vitruvian Man circle and square actually fit into the tetrahedron described, as well as some mathematical errors with figures and calculations that leave him unconvinced about its conclusions. For example, Mathews says that Figure 5 in the paper misrepresents the close sphere-packing example and illustrates a value closer to 1.67 instead of the proposed 1.633, which undermines the potential connection between these examples that Mac Sweeney is trying to draw.\nThat said, this is likely not the end of Mac Sweeney’s work on the subject. He says this work is just one part of a much bigger puzzle he’s working to solve.\n“I think that really what we might be looking at, almost certainly, is a new organizational principle in nature—and Da Vinci seems to have documented this,” says Mac Sweeney. “It’s going to take at least another paper or two to fully unpack [that].\nSarah is a D.C.-based independent science journalist interested in the philosophical questions of science and technology and how research intersects with our daily lives. Her work has appeared in Live Science, Nature, Popular Science, and Science News Explores, among other outlets, and covers topics ranging from AI to particle physics and space travel."
    },
    {
      "url": "https://www.bristol.ac.uk/news/2024/march/joan-shakespeare.html",
      "text": "The document, a religious tract in which the writer pledges to die a good Catholic death, written at a point in English history when Catholicism was strongly disapproved of, was found by a bricklayer hidden in the rafters of the Shakespeare House in Stratford-upon-Avon in around 1770.\nIt was seen and described by two early Shakespeare experts and then lost. Both thought it must have belonged to Shakespeare’s father John who died in 1601 which would imply that he was a zealous secret Catholic in an Elizabethan world of priest holes where people risked torture for their faith. Subsequent scholars thought it was a forgery designed to give an impression of being a document from John’s lifetime.\nIn fact, the document is actually a translation of an Italian text, “The Last Will and Testament of the Soul”, and Professor Matthew Steggle, from the University’s Department of English, used Google Books and other internet archives to track down early editions of that text in Italian and six other languages, many of which editions survive only in a single copy and are scattered across the libraries of Europe. This proved that it was from several years after John Shakespeare died, and that the author of the manuscript was in fact the only other possible J Shakespeare – Joan – who lived from 1569 to 1646.\nShe was five years younger than her brother William and, in the later years of his life, his only significant living relative other than his wife and daughters. She lived in Stratford-upon-Avon all her life and is thought to have married a penniless tradesman. She had four children and outlived both her husband and her famous sibling by 30 years, living quietly in part of the old Shakespeare family house.\nProfessor Steggle said: “Even thirty years ago, a researcher approaching a problem like this would have been based in a single big research library, using printed catalogues and even card catalogues to try to find copies of this text. But research libraries have now made many of their resources available digitally, so that it is possible to look across many different libraries in different countries at once, and what’s more, you can look through the whole text, not just at the title and other details.\n“There are only seven surviving documents from Joan’s lifetime that even mention her by name. Virginia Woolf wrote a famous essay, “Shakespeare’s sister”, about how a figure like her could never hope to be a writer or have her writing preserved, so she has become something of a symbol for all the lost voices of early modern women. There are hundreds of thousands of words surviving from her brother, and until now none at all, of any description, from her.”\nQuotes from the document include:\n“I, [Joan] Shakespeare, do protest that I will willingly accept of death in whatsoever manner it may befall me, conforming my will unto the will of God; accepting of the same in satisfaction for my sins and giving thanks unto his divine majesty for the life he hath bestowed upon me.”\n“I, [Joan] Shakespeare, do here protest that I do render infinite thanks to his divine majesty for all the benefits that I have received as well secret as manifest… but above all for his so great expectation of me to penance, when he might most justly have taken me out of this life when I least thought of it, yea even then when I was plunged in the dirty puddle of my sins.”\n“I, [Joan] Shakespeare, do protest that I am willing, yea I do infinitely desire and humbly crave, that of this my last will and testament, the glorious and ever Virgin Mary, mother of God, refuge and advocate of sinners, whom I honour specially above all other saints, may be the chief Executrix together with these other saints my patrons, Saint Winifred, all whom I invoke and beseech to be present at the hour of my death that she and they may comfort me with their desired presence and crave of sweet Jesus that he will receive my soul into peace.”\nSt Winifred, claimed as a patron saint in this passage, was a seventh-century Welsh princess who survived being beheaded by a disgruntled suitor and went on to found a nunnery. Winifred, whose story was all about repelling unwanted sexual advances by men, was particularly venerated by women, and this is another sign that the document belongs to Joan.\nPledges of these nature were about taking control of your own death, making a statement about final beliefs before the approach of death impairs any mental capacity. The Joan Shakespeare document is the only known British example and there are only a handful known from the Continent.\nThe research, published in the journal Shakespeare Quarterly, is part of Professor Steggle’s work on a biography of Shakespeare for Reaktion Books which is due to be published later this year."
    }
  ],
  "argos_summary": "A 1757 religious manuscript signed “J. Shakespeare” was long attributed to William’s father, John, but a study in *Shakespeare Quarterly* shows it was actually written by William’s younger sister, Joan Shakespeare Hart.  The text, a translation of an obscure 17th‑century Italian tract, reveals Joan’s secret Catholic faith and her desire to die a good Catholic death.  Joan, who outlived William by 30 years and lived in the family home, is mentioned only in a handful of surviving documents, making this find a rare glimpse into the hidden religious life of the Shakespeare family.  The discovery adds a new layer to the family’s mysterious legacy and challenges assumptions about the religious affiliations of Shakespeare’s relatives.",
  "argos_id": "PEZL2ZNC1"
}