{
  "url": "https://www.businessinsider.com/nick-clegg-meta-uk-deputy-prime-minister-silicon-valley-criticism-2025-8",
  "authorsByline": "Nathan Rennolds",
  "articleId": "9405c2d81ab04ff18debc4acc44f08b4",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68a9d507a17a8c5b40535fca?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T17:02:26+00:00",
  "addDate": "2025-08-23T17:08:43.202262+00:00",
  "refreshDate": "2025-08-23T17:08:43.202264+00:00",
  "score": 1.0,
  "title": "Former Meta executive Nick Clegg calls Silicon Valley 'cloyingly conformist'",
  "description": "Nick Clegg, a former UK deputy prime minister, said the California tech hub was full of \"herd-like behavior.\"",
  "content": "Former Meta executive Nick Clegg has delivered a biting review of Silicon Valley culture and its so-called \"tech bros.\"Speaking with The Guardian to promote his coming book, \"How to Save the Internet,\" Clegg, who was Meta's president of global affairs before announcing his resignation in January, described the California tech hub as \"cloyingly conformist.\"\"Everyone wears the same clothes, drives the same cars, listens to the same podcasts, follows the same fads,\" he said. \"It's a place born of an immense sort of herd-like behavior.\"Before Meta, Clegg was the leader of the UK's Liberal Democrats and the country's deputy prime minister from 2010 to 2015.He joined Meta (then Facebook) in 2018 as vice president of global affairs, before being promoted to the firm's top comms and policy role in 2022. He oversaw content policy, elections, and the company's government interactions, among other things.In the interview, Clegg also had some strong words on Silicon Valley's \"tech bro\" culture.The \"tech bro\" wave hit its peak during Clegg's tenure at Meta, led by his then-boss Mark Zuckerberg, Tesla CEO Elon Musk, and Amazon founder Jeff Bezos.While making it clear he was not referring to Zuckerberg, Clegg said many of the region's wealthiest and most powerful leaders displayed what he called a \"deeply unattractive combination of machismo and self-pity.\"\"You'd think, wouldn't you, that if you were immensely powerful and rich like Elon Musk and all these other tech bros and members of that podcast community, that you'd reflect on your good fortune compared with most other people?\" he said.\"In Silicon Valley, far from thinking they're lucky, they think they're hard done by, they're victims.\"\"It is a cultural thing, from Elon Musk's chainsaw-wielding stuff to any Silicon Valley podcast,\" he added. \"If you're accustomed to privilege, equality feels like oppression.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Former Meta executive Nick Clegg",
      "weight": 0.09989359
    },
    {
      "name": "Silicon Valley",
      "weight": 0.09699493
    },
    {
      "name": "Silicon Valley culture",
      "weight": 0.095686644
    },
    {
      "name": "Nick Clegg",
      "weight": 0.09341499
    },
    {
      "name": "Elon Musk",
      "weight": 0.0864057
    },
    {
      "name": "Tesla CEO Elon Musk",
      "weight": 0.08626119
    },
    {
      "name": "Clegg",
      "weight": 0.08476047
    },
    {
      "name": "global affairs",
      "weight": 0.071775265
    },
    {
      "name": "other things",
      "weight": 0.07091242
    },
    {
      "name": "most other people",
      "weight": 0.07069663
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96240234375
    },
    {
      "name": "/News/Technology News",
      "score": 0.9267578125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.6181640625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5771484375
    }
  ],
  "sentiment": {
    "positive": 0.0734909,
    "negative": 0.693866,
    "neutral": 0.23264308
  },
  "summary": "Former Meta executive, Nick Clegg, has criticised Silicon Valley's culture and its \"tech bros\" in an interview with The Guardian. He described the California tech hub as \"cloyingly conformist,\" with everyone wearing the same clothes, cars, and ideologies. Clegg was the president of global affairs at Meta and oversaw content policy, elections, and government interactions. He also mentioned the \"thirsty\" attitude towards equality and contrasted with the perceived oppression of societal.",
  "shortSummary": "Former Meta executive Nick Clegg criticizes Silicon Valley's conformist culture and \"tech bros,\" highlighting inequality and self-pity.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "13839ea9d5944818a3e74d1f0dd90e08",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Former Meta executive Nick Clegg criticizes Silicon Valley as a conformist, herd‑like culture dominated by ‘tech bros’ who combine machismo with self‑pity. He argues that wealthy leaders such as Elon Musk and others see themselves as victims rather than beneficiaries of privilege, and that equality feels like oppression to them. Clegg, who left Meta in January after serving as president of global affairs, uses his new book to expose these cultural flaws.",
  "argos_id": "QVA3PLCN7"
}