{
  "url": "https://finance.yahoo.com/news/eric-trump-join-metaplanet-meeting-180824307.html",
  "authorsByline": "Anushka Basu",
  "articleId": "9e2ba447529b4ad8a66a6ebb47e434b1",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/thestreet_881/4cab2452abd85311b0f5233683c907a3",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T18:08:24+00:00",
  "addDate": "2025-08-23T19:05:04.617370+00:00",
  "refreshDate": "2025-08-23T19:05:04.617372+00:00",
  "score": 1.0,
  "title": "Eric Trump to join Metaplanet meeting in Japan",
  "description": "Trump's Japan visit highlights the family's growing stake in digital assets, from Metaplanet's $2.1B Bitcoin holdings to new ventures across Asia.",
  "content": "Eric Trump plans to visit Japan next month as the Trump family continues to expand its presence in the cryptocurrency space, people familiar with the matter said.\n\nThe son of the U.S. President is scheduled to attend the September 1 shareholder meeting of Metaplanet Inc., a Japanese Bitcoin treasury company modeled on Michael Saylor's Strategy Inc.\n\nMetaplanet, formerly a hotel operator, pivoted to Bitcoin accumulation in early 2024, using business profits to build its holdings.\n\nThe company says it holds more than $2.1 billion in Bitcoin. Eric Trump was appointed as a strategic adviser to Metaplanet in March.\n\nNews of his planned trip to Tokyo helped Metaplanet shares recover, with the stock reversing earlier losses to gain nearly 2.1% on Friday, according to Bloomberg. Although volatile, the stock has surged almost 800% in the past year, even after falling by more than half from its peak in June.\n\nThe upcoming shareholder meeting will include a vote on new capital-raising measures, with Trump expected to attend. His Tokyo visit will follow closely after his participation in the Bitcoin Asia conference in Hong Kong on August 28–29.\n\nThe move highlights the Trump family's growing involvement in digital assets. A Las Vegas-based firm tied to Trump associates recently announced a $1.5 billion deal to transition into a crypto treasury, including tokens linked to World Liberty Financial, a Trump-affiliated venture.\n\nIn addition, Trump Media & Technology Group, the parent company of Truth Social, disclosed earlier this year that it had accumulated more than $2 billion in Bitcoin.\n\nSeparately, cryptocurrency miner American Bitcoin, backed by Eric Trump and Donald Trump Jr., is pursuing acquisitions in Asia, targeting listed firms in Japan and possibly Hong Kong.\n\nThe developments come as Japan continues to embrace digital assets, marked by regulators approving the country's first yen-denominated stablecoin on August 18 and the upcoming WebX2025 forum, where Finance Minister Katsunobu Kato is expected to speak.\n\nThis story was originally reported by TheStreet on Aug 23, 2025, where it first appeared in the MARKETS section. Add TheStreet as a Preferred Source by clicking here.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/news/trump-media-over-9-buying-172541143.html",
    "https://finance.yahoo.com/news/michael-saylor-senator-lummis-send-224625995.html",
    "https://finance.yahoo.com/news/trump-jr-crypto-stock-pick-195853991.html",
    "https://finance.yahoo.com/news/175-old-payment-giant-strong-194950208.html",
    "https://www.thestreet.com/markets",
    "https://google.com/preferences/source?q=thestreet.com",
    "https://www.bloomberg.com/news/articles/2025-08-22/eric-trump-plans-to-visit-japan-in-september-for-crypto-push?utm_medium=email&utm_source=author_alert&utm_term=250822&utm_campaign=author_18989047",
    "https://roundtable.rtb.io/RTBHOME/community/tech/are-you-suspicious-about-eric-trump-joining-metaplanet-s-boardroom-in-japan",
    "https://www.thestreet.com/crypto/markets/eric-trump-to-join-metaplanet-meeting-in-japan-",
    "https://www.thestreet.com/crypto/tag/bitcoin"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Eric Trump",
      "weight": 0.10652497
    },
    {
      "name": "Trump associates",
      "weight": 0.100033194
    },
    {
      "name": "Trump",
      "weight": 0.099612504
    },
    {
      "name": "Trump Media",
      "weight": 0.09943108
    },
    {
      "name": "Donald Trump Jr.",
      "weight": 0.09609079
    },
    {
      "name": "Bitcoin accumulation",
      "weight": 0.078689285
    },
    {
      "name": "cryptocurrency miner American Bitcoin",
      "weight": 0.07868664
    },
    {
      "name": "American Bitcoin",
      "weight": 0.0776021
    },
    {
      "name": "Metaplanet shares",
      "weight": 0.07611701
    },
    {
      "name": "Metaplanet Inc.",
      "weight": 0.07557835
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.869140625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.79833984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.75537109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.59716796875
    }
  ],
  "sentiment": {
    "positive": 0.44246176,
    "negative": 0.059822228,
    "neutral": 0.49771607
  },
  "summary": "Eric Trump, son of the US President, plans to attend the September 1 shareholder meeting of Metaplanet Inc., a Japanese Bitcoin treasury company modeled on Michael Saylor's Strategy Inc. The company, which holds over $2.1 billion in Bitcoin, has since pivoted towards Bitcoin accumulation using business profits to build its holdings. The upcoming shareholder meeting will include a vote on new capital-raising measures, with Trump expected to attend. This comes as the Trump family continues to expand its presence in the cryptocurrency space. The move reflects the growing family's increasing involvement in digital assets.",
  "shortSummary": "Eric Trump will visit Japan to attend Metaplanet's shareholder meeting, amid growing involvement in digital assets including Bitcoin and American Bitcoin.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "840a8d99b2a3455a8887cc9bbce1547f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/175-old-payment-giant-strong-194950208.html",
      "text": "175-year-old payment giant has a strong message on stablecoins originally appeared on TheStreet.\nOn July 22, Western Union CEO Devin McGranahan announced that the payment giant, founded in 1851, is expanding its offerings to include stablecoins.\nFar from looking at digital currencies as a threat, McGranahan said Western Union sees three major benefits: faster cross-border transfers, the ability to convert stablecoins into local fiat, especially in countries with currencies that are harder to reach, and providing stablecoins to users as a store for value in their volatile economy.\nJoin the discussion with Scott Melker on Roundtable here.\n\"We're already innovating,\" McGranahan said in an interview with Bloomberg. Pointing to conversion efforts taking place in South America and Africa,\" he said that Western Union is seeking partnerships related to on-ramps and off-ramps for the purchase and sale of stablecoins. He added:\n\"Well, we're already innovating in several places in the world on moving money and settling, so both in South America and in Africa, we are innovating our settlement processes to move money quicker and to more easily convert into local currency in partnerships with some of the infrastructure companies you had on this show.\"\nThe move coincides with the increasing importance of digital services to the company's business, believes McGranahan.\nNext evolution\nDigital fund transfers account for $1 billion of Western Union's revenue and are expanding more quickly than its traditional retail segment. Still, retail performance can't be measured only in terms of a cash-based business, McGranahan said.\nJoin the discussion with CryptoWendyO on Roundtable here.\nWith the recent passage of President Donald Trump's ‘the big, beautiful bill,' which increases access to finance, customers frequently fund transactions from bank accounts or cards, said the 55-year-old CEO. He added:\n\"The same is true on the payout side, our payout to account, payout to digital wallet business around the world is growing north of 30% in almost all geographies, so we see the value proposition more about funding and paying out regardless of whether the person wants to do it from their app or they want to do it in a retail location.\"\nWith 60% of business now international, Western Union sees future growth in the Middle East, Asia, and Africa. \"We've been adapting for 175 years,\" McGranahan said. \"Stablecoins are just the next evolution.\"\n175-year-old payment giant has a strong message on stablecoins first appeared on TheStreet on Jul 22, 2025\nThis story was originally reported by TheStreet on Jul 22, 2025, where it first appeared."
    },
    {
      "url": "https://finance.yahoo.com/news/michael-saylor-senator-lummis-send-224625995.html",
      "text": "Michael Saylor and Senator Lummis send a hard-nosed response on 'double taxation' originally appeared on TheStreet.\nStrategy's Michael Saylor and U.S. Senator Cynthia Lummis (R-WY) are actively seeking reform to what Saylor calls the \"unfair\" double taxation of Bitcoin miners and stakers.\nLummis explained how the current tax regime creates a situation where miners suffer taxation twice for the same reward — once when they receive block rewards and again when they sell the rewards.\nBitcoin mining is the process of using computing power to solve cryptographic puzzles in order to verify transactions and secure the Bitcoin network.\nMiners are taxed twice, once when they get new coins as a reward and again when they sell them.\nJoin the discussion with WendyO on Roundtable here.\nOn X, Lummis wrote,\n\"For years, miners and stakers have been taxed TWICE. Once when they receive block rewards, and again when they sell it. It's time to stop this unfair tax treatment and ensure America is the world's Bitcoin and Crypto Superpower.\"\nSoon after, Saylor jumped into the conversation, saying, \"We must end unfair taxes on BTC miners if America is going to be the world's Bitcoin Superpower.\"\nAccording to Cryptoquant, Bitcoin miners are earning the least they have in a year, but the majority still refuse to sell their coins. Miner income fell to $34 million on June 22, the lowest since April 20, as lower transaction fees and a lower Bitcoin price reduced revenues.\nThe slump is attributed to declining Ordinal inscription activity, which had previously raised fees throughout the quarter. The firm's Miner Profit/Loss Sustainability score now classifies miners as \"extremely underpaid.\"\nMichael Saylor and Senator Lummis send a hard-nosed response on 'double taxation' first appeared on TheStreet on Jun 30, 2025\nThis story was originally reported by TheStreet on Jun 30, 2025, where it first appeared."
    },
    {
      "url": "https://finance.yahoo.com/news/trump-media-over-9-buying-172541143.html",
      "text": "Trump Media up over 9% after buying hard asset originally appeared on TheStreet.\nTrump Media & Technology Group or TMTG (Nasdaq: DJT) announced on July 21 that it has added 2 billion worth of Bitcoin to its corporate treasury.\nFollowing the announcement, the company's stock surged by more than 8% a day to trade as high as $20.38.\nPresident Donald Trump-backed media firm announced the development just days after the House of Representatives passed three major crypto bills to oversee the market structure, stablecoin industry, and anti-CBDC stance.\nThe media firm’s latest move aligns with its previously announced Bitcoin treasury strategy plan as it looks to diversify its revenue streams. TMTG controls the social networking app Truth Social, the streaming platform Truth+, and the fintech brand Truth.Fi.\nJoin the discussion with CryptoWendyO on Roundtable here.\nTMTG’s Bitcoin holdings now account for two-thirds of its total liquid assets of roughly $3 billion. Around $300 million has been separately allocated for a bitcoin securities-focused options acquisition roadmap.\n“These assets help ensure our Company’s financial freedom, help protect us against discrimination by financial institutions,” said Trump Media CEO and President Devin Nunes. He further noted that the company plans to rigorously implement its bitcoin strategy and create a utility token to work across the Truth Social ecosystem in the coming future.\nGiven that Trump is the largest shareholder in TMTG, the company is likely to continue engaging with cryptocurrencies moving forward.\nOn July 8, the company indicated its plan to launch the \"Truth Social Crypto Blue Chip\". The firm has already submitted a filing regarding the same to the Securities and Exchange Commission (SEC).\nDuring his presidential campaign last year, Trump vowed to transform the U.S. into \"the crypto capital of the world.\""
    },
    {
      "url": "https://finance.yahoo.com/news/trump-jr-crypto-stock-pick-195853991.html",
      "text": "Thumzup, a small-cap digital marketing firm with ambitions beyond social influence, made waves in the crypto space this week.\nWhile the company has built its brand on rewarding users for posting brand promotions on social media, it is now setting its sights on blockchain infrastructure. The pivot caught the attention of markets and investors alike, especially with one big name surfacing in recent regulatory filings: Donald Trump Jr.\nTrump Jr., whose name only appeared in filings last month, was revealed as a significant shareholder in Thumzup Media Corporation (TZUP), according to the company's July registration statement for a $50 million offering. Though it remains unclear when exactly he took a stake in the firm.\nTrump Jr. linked to sudden drop in Thumzup stock\nShares of Thumzup Media Corporation (TZUP) dropped nearly 46% Tuesday after the company announced it would buy Dogehash Technologies, Inc., a North American crypto miner that is focused on Dogecoin and Litecoin.\nIn the midday session, the stock had plummeted from $8.28 to $4.60 — one of its steepest single-day declines since going public. The market responded harshly to the deal, which will see Dogehash shareholders receive 30.7 million shares of Thumzup in exchange for their holdings.\nThe combined company, to be called Dogehash Technologies Holdings, Inc., will trade on the Nasdaq under the new ticker symbol XDOG.\nDogehash currently operates 2,500 Scrypt ASIC miners, most powered by renewable energy. The company also has plans to expand its output through 2026 and is working on Dogecoin Layer-2 infrastructure and DeFi staking initiatives.\nCEO Robert Steele said the acquisition “accelerates our evolution from a digital-marketing platform into a diversified digital-asset infrastructure and treasury company.\"\nTrump Jr.'s stake adds political weight to Dogecoin pivot\nAlthough Trump Jr. has not publicly commented on the deal, his stake in the company puts a political spotlight on Thumzup’s crypto ambitions. With Dogecoin already tied to meme culture and online personalities, the Trump family connection only amplifies the attention — and scrutiny.\nThumzup's market value has taken a hit, sliding from around $75 million to nearly half that in less than 24 hours. Still, it trades above its 52-week low of $2.06, though well below its $16.49 peak.\nThis story was originally reported by TheStreet on Aug 19, 2025, where it first appeared in the MARKETS section. Add TheStreet as a Preferred Source by clicking here."
    }
  ],
  "argos_summary": "Eric Trump is set to travel to Tokyo next month to attend Metaplanet Inc.’s shareholder meeting, where he serves as a strategic adviser to the Japanese Bitcoin‑treasury firm that now holds over $2.1 billion in Bitcoin.  His visit helped lift Metaplanet’s shares, which have surged nearly 800% in the past year despite recent volatility, and comes after his participation in a Bitcoin Asia conference in Hong Kong.  The trip underscores the Trump family’s expanding footprint in digital assets, with related ventures such as Trump Media & Technology Group adding $2 billion of Bitcoin to its treasury and a Trump‑affiliated firm pursuing crypto‑treasury conversions.  Japan’s supportive regulatory climate—evidenced by the approval of a yen‑denominated stablecoin and the upcoming WebX2025 forum—provides a backdrop for these developments, while other linked stories highlight broader crypto trends, including Western Union’s stablecoin strategy, calls to end double taxation on Bitcoin miners, and Thumzup’s pivot to crypto infrastructure.",
  "argos_id": "RHRO98UVW"
}