{
  "url": "https://nypost.com/2025/08/23/sports/bat-boy-seemingly-ejected-by-minor-league-umpire-in-wild-scene/",
  "authorsByline": "Matt Ehalt",
  "articleId": "95e88329c27c4b01938b07427078c17a",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-znkdsmzyw-1755959039997.jpg?quality=75&strip=all&1755944673&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T15:53:43+00:00",
  "addDate": "2025-08-23T15:55:15.339369+00:00",
  "refreshDate": "2025-08-23T15:55:15.339371+00:00",
  "score": 1.0,
  "title": "Bat boy seemingly ejected by minor league umpire in wild scene",
  "description": "This minor league bat boy apparently crossed the line.",
  "content": "A Single-A ball boy seemingly earned a rare ejection Thursday when the home plate umpire appeared to gave him the boot after he handed him a few balls and did something that surprised the official.\n\nUmpire Richy Arredondo had a mystified look on his face after receiving balls and then seeing the Quad Cities River Bandits’ bat boy look back at him. Arredondo then seemed to eject the individual.\n\nThe crowd watching the Great Lakes Loons’ 7-1 victory roared after the bat boy’s ejection, which marked the third of the inning.\n\n“Wow. Did he throw out the ball boy?” the MILB TV announcer said. “The Bandits’ bat boy may have been ejected from the game, and, if so, that’s the first time I’ve ever seen that.”\n\nThe official box score lists only two ejections from the game, River Bandits catcher Canyon Brown and manager Jesus Azuaje, but the umpire definitely ejected a third person and it seemed to be the bat boy.\n\nIt all unfolded in the seventh inning with the Loons leading, 4-1.\n\nBrown earned an ejection during a conference at the mound following a walk to put two men on, and Azuaje later left early after arguing a passed ball.\n\nThe third ejection came after a balk resulted in a run scoring to give the Loons a 7-1 lead.\n\nAs the crowd booed, the bat boy came out to give Arredondo some new balls.\n\nIt’s hard to tell in the video if the bat boy says anything, but Arredondo looked in the bat boys’ direction when he ejected a third person, holding out his hands in a “Are you serious?” manner.\n\nThe umpire then made some remarks toward the dugout.\n\nThe @MILBEjections X account said the bat boy received the boot “under 6.04(a) trying to incite, by word or sign a demonstration by spectators through his actions.”",
  "medium": "Article",
  "links": [
    "https://x.com/MiLBEjections/status/1958740616604786826",
    "https://nypost.com/2025/08/23/sports/micah-parsons-eats-pregame-nachos-rests-on-medical-table-as-cowboys-contract-drama-takes-wild-turn/",
    "https://nypost.com/2025/08/23/sports/yankees-anthony-volpe-booed-after-strikeout-makes-mental-error/",
    "https://nypost.com/2025/08/22/sports/forfeit-over-trans-high-school-volleyball-player-sparks-emotional-board-meeting-as-parents-clash/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Bat boy",
      "weight": 0.1409913
    },
    {
      "name": "Umpire Richy Arredondo",
      "weight": 0.093625136
    },
    {
      "name": "minor league umpire",
      "weight": 0.08584256
    },
    {
      "name": "balls",
      "weight": 0.085446246
    },
    {
      "name": "River Bandits catcher Canyon Brown",
      "weight": 0.08395035
    },
    {
      "name": "River Bandits",
      "weight": 0.07733183
    },
    {
      "name": "the bat boy",
      "weight": 0.074771926
    },
    {
      "name": "manager Jesus Azuaje",
      "weight": 0.07222208
    },
    {
      "name": "the Quad Cities River Bandits’ bat boy",
      "weight": 0.070118494
    },
    {
      "name": "the ball boy",
      "weight": 0.07002213
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97705078125
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.93017578125
    }
  ],
  "sentiment": {
    "positive": 0.060078662,
    "negative": 0.6912667,
    "neutral": 0.2486546
  },
  "summary": "The home plate umpire, Richy Arredondo, seemed to eject a bat boy from the game after he handed him several balls. The incident occurred during the Great Lakes Loons' 7-1 victory over the Quad Cities River Bandits. The official box score lists only two other ejections from that game, but the umpire ejected a third person. The bat boy was reportedly trying to incite a demonstration by his actions.",
  "shortSummary": "A minor league umpire appeared to eject a bat boy from a game after handing him balls, sparking a crowd uproar.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3de5e7b7cfb743e28b376b87bc945b8c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/23/sports/yankees-anthony-volpe-booed-after-strikeout-makes-mental-error/",
      "text": "Access the Yankees beat like never before\nJoin Post Sports+ for exciting subscriber-only features, including real-time texting with Greg Joyce about the inside buzz on the Yankees.\nTry it freeAnthony Volpe’s rough season got even worse Friday in a 1-0 loss to the Red Sox.\nNot only did the shortstop go hitless again to extend his slump to 1-for-25, he got booed after a strikeout in the eighth and made a mental error at shortstop an inning later.\nVolpe’s miscue at short in the top of the ninth of a one-run game came with Jarren Duran on second.\nCeddanne Rafaela hit a grounder to Volpe and instead of making the routine throw to first, Volpe threw behind Duran to Jazz Chisholm Jr. at second.\nDuran was safe and Rafaela beat Chisholm’s throw to first.\nThe play went as a fielder’s choice, but Volpe’s 16 errors is the highest in the league.\n“It was obviously not the right play, but it was a little bit of a heady play, too,’’ Aaron Boone said, somewhat in defense of his shortstop.\nBoone noted that there was a “gap” between Duran and Chisholm.\nStill, it’s a play that can’t be made at that point.\nVolpe followed with a solid throw home to get Duran at the plate on a contact play later in the inning.\nThe shortstop’s slump is just as alarming.\nHe has 10 strikeouts in his last 25 at-bats and when he whiffed against Garrett Whitlock for the second out in the bottom of the eighth, Volpe heard some relatively loud boos.\n“He hasn’t swung it great the last week,” Boone said. “The last two days, he’s just missed a couple pitches and then he had some confused swings. We’ve got to get him going again offensively.”\nOnly six players have a worse OPS than Volpe’s .680 mark since June 12.\nAnd his .171 average is the worst among 162 qualified hitters in the same span.\nPrior to the game, hitting coach James Rowson said Volpe’s performance at the plate hasn’t been as bad as the recent numbers would indicate.\n“It shows up sometimes as he doesn’t have hits in a certain number of at-bats, but it’s not purely about results,’’ Rowson said. “His at-bats over the last month or so have been really good. The results have to be there, too, and there haven’t been a lot of hits, but he’s not doing much different than when he was locked in earlier in the season.”\nTo Rowson’s point, an argument could be made that Volpe has hit into some bad luck, with a .167 BABIP since Aug. 2, compared to his .272 career mark and .241 number for this season.\nBoone said there was no update on when Aaron Judge may be able to play the outfield as he deals with a right flexor strain that’s limited him to DH duties.\nJonathan Loáisiga is scheduled to see Dr. Keith Meister on Tuesday as the right-hander could be headed toward another elbow surgery. Loáisiga has appeared in 30 games this season, but was on the IL with back tightness prior to the elbow injury.\nFernando Cruz (oblique) gave up a run in 1 ¹/₃ innings in a rehab appearance with Double-A Somerset.\nBoone said he considered pinch-hitting Amed Rosario for Trent Grisham against Aroldis Chapman in the ninth, but decided against it.\nRosario is 3-for-7 with two homers against the lefty, while Grisham is now 0-for-3 with three strikeouts.\n- CHECK OUT THE LATEST MLB STANDINGS AND YANKEES STATS\nAustin Wells has seen his playing time dip recently, a result of his struggles at the plate, as well as the emergence of Ben Rice at catcher.\n“Ben has earned more opportunities there,’’ Boone said of Rice, who was at first Friday. “Wells has gone through struggles the last few weeks… We know what Austin is capable of and it’s a product of Rice pushing in and [having Paul] Goldschmidt at first.”\nWells was coming off a game in which he homered twice against the Rays.\n“Hopefully, Wells gets a little traction offensively,’’ Boone said.\nAustin Slater (left hamstring strain) has started baseball activities and did drills in the outfield Friday, but Boone said there was no updated timeline for his return."
    },
    {
      "url": "https://nypost.com/2025/08/23/sports/micah-parsons-eats-pregame-nachos-rests-on-medical-table-as-cowboys-contract-drama-takes-wild-turn/",
      "text": "Micah Parsons’ contract standoff with the Cowboys took a bizarre turn thanks to his antics at the team’s final preseason game Friday night.\nThe two-time All-Pro was seen walking the hall of AT&T Stadium eating nachos before the Cowboys clashed with the Falcons.\nOne Atlanta fan yelled for him to join their franchise, to which Parsons made the” call me” gesture.\nThings got stranger as Parsons, the only player not in uniform, arrived at the field.\nThe 26-year-old linebacker, who is a hold-in during training camp, dressed in a navy hoodie with gray sleeves and was later seen resting on the medical table as the Cowboys were on offense.\nParsons, who is seeking a lucrative multi-year contract extension, explained his actions on social media after the game in response to a post by Dallas sports anchor Mike Leslie saying he was only lying on the table for a “relatively short portion” of the game in an attempt to add some context.\n“I actually appreciate this. The way media shapes perception and narratives is wild—and if he hadn’t said anything, everyone would’ve just run with it,” Parsons said.\n“I’d never disrespect the guys out there fighting for their lives.”\nCowboys coach Brian Schottenheimer told reporters he was unaware of what Parsons was doing because he was focused on the game, a 31-13 win.\nParsons did not speak to reporters after the game, but cornerback Trevon Diggs put Parsons’ availability for Week 1 in doubt beyond his contract status.\nDiggs revealed Parsons had an MRI on his back.\n“It depends on how his back feels,” Diggs said. “I know he was real sore this morning. He went and got it checked out. That’s the last thing I heard from him.”\nOwner and general manager Jerry Jones has said Parsons’ back issue is just part of the negotiation tactics.\nJones addressed the contract stalemate and Parsons’ trade request Friday.\nHe said they don’t plan on trading Parsons, calling any talk of it “BS.”\nHe put some of the blame on Parsons’ agent David Mulugheta, saying he told the Cowboys to stick their offer “up our ass.”\n“We were going to send it (an offer) over to the agent and the agent said don’t bother because we’ve got all that to negotiate,” Jones said on Michael Irvin’s podcast. “Well, I’d already negotiated. I’d already moved off my mark on several areas. And so, the issue is frankly that we already had the negotiation in my mind, and now the agent is trying to stick his nose in it.”\nMulugheta said that “never happened” to ESPN’s Ryan Clark.\n“This is just another public way to make this situation, which is already ugly, even uglier,” Clark said in a video posted to X. “David Mulugheta in no way has ever told Jerry Jones or any other general manager or owner that. It’s all bull crap. It’s all lies.”\nParsons is set to play on his $24 million fifth-year rookie contract option this season and is likely seeking a deal similar to T.J. Watt’s three-year, $123 million pact with the Steelers.\nThe Cowboys could franchise tag him for the next two seasons to keep him from hitting free agency."
    },
    {
      "url": "https://nypost.com/2025/08/22/sports/forfeit-over-trans-high-school-volleyball-player-sparks-emotional-board-meeting-as-parents-clash/",
      "text": "A school board meeting in California descended into explosive debate after a girls’ volleyball team forfeited to an opponent with a transgender player.\nThe players on the Riverside Poly High School girls’ volleyball team chose to forfeit last Friday’s game against Jurupa Valley High School.\nMultiple parents previously told Fox News Digital the forfeit was in response to the presence of trans athlete AB Hernandez on the Jurupa Valley team.\nLocal parents showed up to the Riverside Unified School District board meeting on Thursday to speak out in support of the girls who forfeited and against the school district for its current gender policies, while others spoke in support of trans athletes in girls’ sports.\nHernandez’s mother, Nereyda Hernandez, showed up to defend AB’s right to play in girls’ sports, and condemned board member Amanda Vickers for previously interviewing with Fox News Digital about the forfeit last week.\n“Amanda Vickers, you interviewed with Fox. You actually entertained and welcomed harassment to my child. You are a board member. You have an oath to protect, to support all children, not just the ones that fit your ideas, your beliefs,” Hernandez said.\n“When you allow or tolerate targeted harassment, whether online, in person or allowing false narratives to be spread at board meetings, you are only failing morally.\n“My daughter is not the problem. The problem is coordinated external efforts often led by individuals that travel from district to district… to spread fear and put parents against each other using religion as a shield for discrimination. This has nothing to do with fairness in sports and everything to do with erasing transgender children.”\nOne mother, Maria Correo, spoke in support of the Riverside Poly players and condemned parents enabling male children to play in girls’ sports.\n“The girls, great job. Poly girls, we stand with you. Keep fighting, because these parents that support their confused child are the problem,” Correo said.\n“If my child was on drugs, I would love him, but guess what? I would tell him the truth; drugs are bad for you. I would not feed him more drugs.”\nRiverside became a hotbed of controversy involving trans athletes in girls’ sports last year during Hernandez’s highly-publicized season and after a lawsuit was filed by two girls at Martin Luther King High School that alleged a trans athlete took one of the girls’ varsity spots on the cross-country team.\nThe students at the school then began wearing the “Save Girls Sports” T-shirts every week in response after school administrators allegedly compared the shirts to swastikas, according to the lawsuit.\nOne mother, who only identified herself as Sandy R., urged the board members to adopt their own resolution to ban trans athletes from girls’ sports, breaking from state law.\nOne school board in California has already done this – the Kern County Board of Education, earlier in August. Sandy R. referenced the lawsuit that had been filed by the two students.\n“I will be so proud and so honored that an RUSD family will be the ones that take down an unlawful and unconstitutional California law,” she said.\nPresident Donald Trump warned California and Gov. Gavin Newsom about the state’s transgender policies in a post on Truth Social on Thursday.\n“Any California school district that doesn’t adhere to our Transgender policies, will not be funded. Thank you for your attention to this matter!” Trump wrote in the post.\nRiverside Unified School District board meetings featured several tense moments that went viral last fall amid the controversy at Martin Luther King High School.\nMeanwhile, AB Hernandez was the focus of a national media firestorm in May during the athlete’s run to a California girls’ track and field championship.\nThe postseason meets that Hernandez competed in were met with protests by female athletes and their families, who often wore the “Save Girls Sports” T-shirts.\nIn July, the Department of Justice filed a lawsuit against the California Department of Education (CDE) and CIF for its policies that have allowed biological males to compete in girls’ sports across the state despite Trump signing an executive order in February to prohibit it.\nA bipartisan survey by the Public Policy Institute of California found a majority of California residents oppose biological male trans athletes competing in women’s sports.\nThat figure included more than 70% of the state’s school parents.\n“Most Californians support requiring transgender athletes to compete on teams matching the sex they were assigned at birth,” the poll stated.\n“Solid majorities of adults (65%) and likely voters (64%) support requiring that transgender athletes compete on teams that match the sex they were assigned at birth, not the gender they identify with. An overwhelming majority of public school parents (71%) support such a requirement.”"
    }
  ],
  "argos_summary": "A minor‑league game saw a ball boy allegedly ejected after a brief exchange with the umpire, a rare incident that sparked cheers from the crowd. In MLB, the Yankees’ Anthony Volpe struggled with a 1‑0 loss to the Red Sox, while the Red Sox’s Aaron Boone discussed the team’s offensive woes and player injuries. The Dallas Cowboys’ contract standoff with linebacker Micah Parsons turned public as he staged a stunt on the field, prompting comments from the team’s management and the NFL’s contract negotiations. Meanwhile, a California school board meeting erupted over a girls’ volleyball team’s forfeit against a school with a transgender player, igniting a broader debate on transgender participation in girls’ sports and prompting political commentary from former President Trump and state officials.",
  "argos_id": "SB5LXRRMS"
}