{
  "url": "https://www.foxnews.com/sports/vikings-male-cheerleaders-seen-same-bathroom-female-counterparts-controversial-social-media-video",
  "authorsByline": "Jackson Thompson",
  "articleId": "cc16cbc5e4024f5384f00d889fba6b75",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/08/931/523/nfl-blaize-sheik-1-081725.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T10:07:32-04:00",
  "addDate": "2025-08-23T14:14:12.233990+00:00",
  "refreshDate": "2025-08-23T14:14:12.233993+00:00",
  "score": 1.0,
  "title": "Vikings male cheerleaders seen in same bathroom as female counterparts in controversial social media video",
  "description": "The Minnesota Vikings male cheerleaders were seen making a TikTok video with two female counterparts, igniting backlash on social media.",
  "content": "The Minnesota Vikings' new male cheerleaders joined two of their female colleagues in a social media video that was filmed in a bathroom. The video, which was originally uploaded to TikTok by Vikings female cheerleader Brianna Putney, showed her and teammate Jenna Kathlyn doing a dance with the two men, Blaze Shiek and Louie Conn, with Lizzo's \"Truth Hurts\" playing in the background.CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COMThe depiction of both the male and female cheerleaders in the same bathroom prompted backlash on social media. Fox News Digital has reached out to the Vikings for a response. Shiek and Conn have been the topic of fierce social media debate after speaking out against critics, as the team has even put out a statement in defense of the two men on the cheer squad. The Vikings are not the first team to employ male cheerleaders. The Los Angeles Rams were the first organization to have male cheerleaders in 2018. The Baltimore Ravens also featured several men on their cheerleading squad. Meanwhile, the Carolina Panthers had the first transgender cheerleader on its squad until this year.ANTHONY RICHARDSON'S AGENT NEEDLES COLTS OVER QB1 DECISION, QUESTIONS 'TRUST'However, the Vikings' situation has become a source of national debate amid Sheik and Conn's recent social media posts.Former Vikings player Jack Brewer and Sen. Tommy Tuberville, R-Ala., spoke out against the organization for having male cheerleaders. Brewer, a former Vikings captain, told Fox News Digital he believes the inclusion of men on the cheerleading squad is an attempt to \"manipulate children.\"\"This is purely an attempt to manipulate young children, to overtake the minds of young children with this spiritual evilness,\" Brewer said. \"The influence on kids is manipulating the mind of the children. They are teaching young boys that it’s okay to have pom-poms and cheer and act like women.\"Tuberville told OutKick’s \"Hot Mic\" on Tuesday that he believes fans could stop buying tickets over the issue. \"People will actually quit buying tickets because this is the narrative they’re trying to push. This is not just about a couple of people being men cheerleaders,\" Tuberville said. \"It is about pushing a narrative that you want to put gender into sports and let everyone know we’re trying to show, ‘Hey, we’re going to take the masculinity out of it a little bit.’\"The team has stood by the two men, affirming the team is \"proud\" to have them on the sidelines for this upcoming season. \"Male cheerleaders have been part of previous Vikings teams and have long been associated with collegiate and professional cheerleading,\" the Vikings told NBC News. \"We support all our cheerleaders and are proud of the role they play as ambassadors of the organization.\"Follow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter.",
  "medium": "Article",
  "links": [
    "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
    "https://www.foxnews.com/newsletters",
    "https://www.outkick.com/shows/hot-mic",
    "https://www.foxnews.com/category/sports/nfl/minnesota-vikings",
    "https://www.foxnews.com/category/sports/nfl/carolina-panthers",
    "https://www.youtube.com/watch?v=wxztOLNyLfI",
    "https://twitter.com/FoxNewsSports_",
    "https://www.foxnews.com/sports",
    "https://www.foxnews.com/sports/vikings-male-cheerleaders-fire-back-critics-amid-social-media-frenzy",
    "https://www.foxnews.com/category/sports/nfl/los-angeles-rams",
    "https://www.foxnews.com/sports/former-vikings-player-speaks-out-against-team-employing-male-cheerleaders",
    "https://www.foxnews.com/video/6377040148112",
    "https://www.foxnews.com/sports/anthony-richardsons-agent-needles-colts-over-qb1-decision-questions-trust"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Vikings male cheerleaders",
      "weight": 0.11425675
    },
    {
      "name": "men cheerleaders",
      "weight": 0.104357794
    },
    {
      "name": "Vikings female cheerleader Brianna Putney",
      "weight": 0.101117276
    },
    {
      "name": "Male cheerleaders",
      "weight": 0.10047768
    },
    {
      "name": "male cheerleaders",
      "weight": 0.10047768
    },
    {
      "name": "previous Vikings teams",
      "weight": 0.09011344
    },
    {
      "name": "Fox News Digital",
      "weight": 0.082425885
    },
    {
      "name": "Former Vikings player Jack Brewer",
      "weight": 0.08030443
    },
    {
      "name": "controversial social media video",
      "weight": 0.077937886
    },
    {
      "name": "Vikings",
      "weight": 0.07777148
    }
  ],
  "topics": [
    {
      "name": "Social Media"
    },
    {
      "name": "Media"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9677734375
    },
    {
      "name": "/News/Sports News",
      "score": 0.896484375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.80810546875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.60791015625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.432861328125
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.353515625
    }
  ],
  "sentiment": {
    "positive": 0.042383343,
    "negative": 0.76495874,
    "neutral": 0.19265783
  },
  "summary": "The Minnesota Vikings' new male cheerleaders, Blaze Shiek and Louie Conn, were seen in a controversial social media video where they were joined by their female colleagues in a bathroom. The video was originally uploaded to TikTok by Vikings female cheerleader Brianna Putney and was viewed as an attempt to \"manipulate children\" by former Vikings player Jack Brewer and Sen. Tommy Tuberville, who believe the inclusion of men on the cheerleading squad is a ploy to instill a narrative about gender into sports. The team has defended the men, stating it is \"proud\" to have them on the sidelines for the upcoming season.",
  "shortSummary": "The Minnesota Vikings faced backlash for featuring male cheerleaders in a bathroom, sparking concerns about gender politics and potential ticket sales.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8883d4ac37ac41d2be77ed9f392844f4",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/sports/former-vikings-player-speaks-out-against-team-employing-male-cheerleaders",
      "text": "The Minnesota Vikings' employment of male cheerleaders for the 2025 season has prompted growing controversy, and now a former player is weighing in.\nThe team's new male cheerleaders, Blaize Shiek and Louie Conn, have been the topic of fierce social media debate after speaking out against critics, as the team has even put out a statement in defense of the two men on the cheer squad.\nFormer Vikings player and current conservative activist Jack Brewer told Fox News Digital he is \"disgusted and embarrassed\" about the new cheerleaders.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"As a former Viking team captain who grew up a Viking fan—my dad’s been a Viking fan since 1972—I’ve never been so disgusted and embarrassed to even have any association with the Minnesota Vikings brand. I think I speak for a lot of other former players and Viking fans when I say that this does not represent this great franchise,\" Brewer said.\n\"Now we’re being represented with men with pom-poms on the sideline. It’s sickening. No man needs to ever have a pom-pom in their hand.\"\nBrewer added that he believes the inclusion of men on the cheerleading squad is an attempt to \"manipulate children.\"\n\"This is purely an attempt to manipulate young children, to overtake the minds of young children with this spiritual evilness,\" Brewer said. \"The influence on kids is manipulating the mind of the children. They are teaching young boys that it’s okay to have pom-poms and cheer and act like women.\"\nBrewer believes that this will particularly impact \"minority\" boys.\n\"This is directly preying on the vulnerable… particularly of minority families, the vast majority of them live with their mamas. They don’t live with their dad, the majority live with their mamas. So you take these kids that are already living with their mama, ain’t got no masculinity around them, and then you war in their mind in what has been known to the world as the most masculine sport, the most masculine team sport in the world, and you’re starting to feminize that in front of these children,\" Brewer said.\nThe Vikings are not the first team to employ male cheerleaders. The Los Angeles Rams were the first organization to have male cheerleaders in 2018. The Baltimore Ravens also featured several men on their cheerleading squad.\nMeanwhile, the Carolina Panthers had the first transgender cheerleader on its squad until this year.\nHowever, the Vikings' situation has become a conversation of national debate amid Sheik and Conn's recent social media posts. The team has stood by the two men, affirming the team is \"proud\" to have them on the sidelines for this upcoming season.\n\"Male cheerleaders have been part of previous Vikings teams and have long been associated with collegiate and professional cheerleading,\" the Vikings told NBC News. \"We support all our cheerleaders and are proud of the role they play as ambassadors of the organization.\"\nANTHONY RICHARDSON'S AGENT NEEDLES COLTS OVER QB1 DECISION, QUESTIONS 'TRUST'\nSen. Tommy Tuberville, R-Ala., weighed in on the controversy during an interview on OutKick’s \"Hot Mic\" on Tuesday.\n\"I would like to ask the ownership of the NFL and the commissioner, what the hell are you doing?\" he said. \"You’ve got the No. 1 sport on planet Earth in terms of people watching it. Your business is growing, it’s getting better and better. There’s some ways you’ve tried to attack it over the last 10-15 years but you’ve been able to withstand that.\n\"But if you’re going to be woke and you’re gonna try to take the men out of men’s sports, which is what you’re doing. They’re trying to take gender and say, ‘OK, we’re going to make it more about gender than we are about masculinity.’ Then, you’re going to have a huge problem. It’s coming.\"\nTuberville warned that fans may stop buying tickets to games if male cheerleaders become more prevalent.\n\"People will actually quit buying tickets because this is the narrative they’re trying to push. This is not just about a couple of people being men cheerleaders,\" Tuberville said. \"It is about pushing a narrative that you want to put gender into sports and let everyone know we’re trying to show, ‘Hey, we’re going to take the masculinity out of it a little bit.’\"\nBrewer praised Tuberville for his recent statements.\n\"Thank God for Tommy Tuberville, who came out with a strong statement standing up against that—one of the greatest college football coaches in the history of the game—because he knows he has a voice. He’s trying to speak out, not just for his perspective, but for the perspective of the vast majority of coaches, players, and even fans. This is not supported by the fans. What do you think a fan comes to an NFL game to watch?\" Brewer said.\nCLICK HERE TO GET THE FOX NEWS APP\n\"Do you think they come to watch men with pom-poms, or do they come to watch hard-nosed football played at a high level with sportsmanship, great plays, great athletes, and actual skillful female cheerleaders on the sideline with some male cheerleaders who are there to pick them up and throw them, catch them, but not to wave pom-poms?\"\nIt is Sheik’s first year as a Vikings cheerleader. He shared a post back in May, celebrating his rookie season. Conn was a part of the Iowa State Cyclones dance team before he joined the Vikings this season.\nFollow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/sports/vikings-male-cheerleaders-fire-back-critics-amid-social-media-frenzy",
      "text": "The Minnesota Vikings came under fire on social media ahead of the start of the preseason schedule because the team had two male cheerleaders on its squad.\nBlaize Shiek and Louie Conn have fired back at critics in social media posts.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"Wait…did someone say our name?\" Shiek wrote in a post on Instagram with Conn ahead of the Vikings’ preseason game against the New England Patriots.\nPictures of Shiek in a Vikings cheerleading uniform sparked a frenzy and a debate about male cheerleaders in the NFL. The Los Angeles Rams were the first organization to have male cheerleaders, which occurred in 2018. The Baltimore Ravens also featured several men on their cheerleading squad.\nThe Carolina Panthers had the first transgender cheerleader on its squad until this year.\nThe Vikings put out a statement in defense of Shiek and Conn.\nRAIDERS' ASHTON JEANTY SENDS MESSAGE TO NFL AFTER BARRELING OVER 49ERS DEFENDER\n\"Male cheerleaders have been part of previous Vikings teams and have long been associated with collegiate and professional cheerleading,\" the team told NBC News. \"We support all our cheerleaders and are proud of the role they play as ambassadors of the organization.\"\nIt is Sheik’s first year as a Vikings cheerleader. He shared a post back in May, celebrating his rookie season.\n\"Excited and honored to share that I am officially a 2025-26 Minnesota Vikings Cheerleader!\" he wrote on social media. \"I am so grateful for this journey, the support, and the opportunity to make a little history along the way. I hope to represent and inspire what’s possible when you stay true to who you are.\"\nCLICK HERE TO GET THE FOX NEWS APP\nConn was a part of the Iowa State Cyclones dance team before he joined the Vikings this season.\nFollow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl/minnesota-vikings",
      "text": "The Minnesota Vikings are a professional American football team that compete in the National Football League (NFL) as a member of the National Football Conference (NFC) North division.\nThe Vikings have the most conference championship appearances of non-winning Super Bowl teams. Minnesota is one of four teams to appear in a conference championship every decade since the 1970s.\nMultiple Pro Football Hall of Famers have played quarterback for Minnesota like Warren Moon, Brett Favre, and Fran Tarkenton. Former Vikings running back, Adrian Peterson, won MVP in 2012 while rushing for 2,097 yards, the second most rushing yards in a season in NFL history.\nWide receiver Justin Jefferson, 2022 NFL Offensive Player of the Year, stars on the Vikings offense."
    },
    {
      "url": "https://www.foxnews.com/sports/anthony-richardsons-agent-needles-colts-over-qb1-decision-questions-trust",
      "text": "Indianapolis Colts quarterback Anthony Richardson will be the backup for Daniel Jones to start the 2025 season, the team announced on Tuesday.\nRichardson was the No. 4 overall pick of the 2023 draft but has struggled with injuries and consistent play, which forced the Colts’ hand just a few weeks before the official start of the regular season. Indianapolis will play the Miami Dolphins on Sept. 7.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nDeiric Jackson, the quarterback’s agent, responded to the Colts’ decision in a statement to ESPN. He suggested that some of the decision-making by Colts head coach Shane Steichen when it came to his client put the player in a bad position and may have damaged the organization’s credibility.\n\"Trust is a big factor and that is, at best, questionable right now,\" Jackson told the network. \"Anthony came back and made the improvements in the areas he needed to improve. And by all accounts, he had a great camp.\"\nESPN STAR STEPHEN A SMITH RIPS BROWNS ROOKIE FOR 'VERY DUMB' COMMENTS ABOUT MEDIA\nHe added that when the team needed a big play in 2024, the ball was put into Richardson’s hands. Despite being benched for two games, he had 1,814 passing yards, eight touchdown passes and was 6-5 in the 11 games he started for the team.\nRegardless, Steichen chose the former New York Giants player instead of Richardson.\nThe ex-Florida Gators standout said there were no hard feelings toward the third-year head coach over the decision.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I guess you could say (I was) somewhat surprised, but at the end of the day we all knew somebody was going to have to be on this end of the stick and, you know, it was me,\" Richardson said. \"I feel like I did improve. My improvement was there, but there are still ways I can improve, still ways I can become a better player, become a starter in the league.\"\nThe Associated Press contributed to this report.\nFollow Fox News Digital’s sports coverage on X and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl/carolina-panthers",
      "text": "The Carolina Panthers are a professional American football team that competes in the National Football League (NFL) as a member of the National Football Conference (NFC) South division.\nIn 1995, Carolina became the first expansion franchise to beat the reigning Super Bowl champions, the 49ers at the time, in its inaugural season.\nIn 2015, the Panthers had their most dominant season going 15-1 in the regular season, tying for the best regular season record in NFC history.\nQuarterback Cam Newton, 2015 NFL MVP and NFL leader in career quarterback rushing touchdowns, competed for 11 seasons under center for Carolina. Bryce Young, Heisman Trophy winner and former No.1 overall pick, headlines the Panthers’ roster."
    },
    {
      "url": "https://www.foxnews.com/category/sports/nfl/los-angeles-rams",
      "text": "Los Angeles Rams: What to know about the NFL team\nThe Los Angeles Rams are a National Football League team that competes in the NFC West division and is based in the Los Angeles, California area.\nThe team originally began as the Cleveland Rams in 1936 before relocating to Los Angeles 10 years later. After the 1994 NFL season, the franchise moved to St. Louis until the end of 2015, when it returned to Los Angeles. As a franchise, the Rams have won three NFL championships: in 1945 in Cleveland, in 1951 in Los Angeles, and their only Super Bowl in 1999 in St. Louis.\nThe team's stadium is SoFi Stadium in Inglewood, California, which they share with the Los Angeles Chargers. Their team colors are yellow and blue, and their mascot is a ram.\nOver the course of their existence, the Rams have had some all-time great players, including Isaac Bruce, Torry Holt, Deacon Jones, Jack Youngblood, Merlin Olsen, Jackie Slater, Kurt Warner, Marshall Faulk, Eric Dickerson, and many others. In the 2025 NFL Draft, the Rams' top pick was tight end Terrance Ferguson from Oregon."
    },
    {
      "url": "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.outkick.com/shows/hot-mic",
      "text": "Hot Mic\nHot Mic with Hutton & Withrow is OutKick’s must-watch daily sports talk show where hosts Jonathan Hutton and Chad Withrow deliver fearless, in-depth analysis of the day’s biggest sports stories. Hutton, a Tennessee native, brings decades of broadcasting experience as a nationally acclaimed radio host and longtime voice on the Tennessee Titans Radio Network. Withrow, also a Tennessee native and University of Tennessee alumnus, made his mark in Nashville sports radio as co-host of Midday 180 and co-founder of ClayNation with Clay Travis, earning national recognition with the Barrett Sports Media Award. He also founded PrepWeekly.com, a respected platform for high school sports coverage. Together, Hutton and Withrow blend insider access, sharp commentary, and a no-nonsense style, making Hot Mic a daily destination—only on OutKick.com.\nWatch Latest Episode"
    }
  ],
  "argos_summary": "The Minnesota Vikings’ decision to add two male cheerleaders, Blaze Shiek and Louie Conn, sparked a social‑media backlash after a TikTok video filmed in a bathroom went viral.  The team defended the men, citing a history of male cheerleaders in the NFL, while former player Jack Brewer and Senator Tommy Tuberville condemned the move as an attempt to manipulate children and erode masculinity.  Brewer and Tuberville warned that the controversy could hurt ticket sales and fan support, but the Vikings remain proud of their diverse cheer squad.  The incident highlights ongoing debates over gender roles in sports entertainment.",
  "argos_id": "T1Y0W71A8"
}