{
  "url": "https://www.thegatewaypundit.com/2025/08/former-secret-service-chief-paid-himself-bonus/",
  "authorsByline": "Guest Contributor",
  "articleId": "da35f1716b3f45efaaa64a39d5dbe259",
  "source": {
    "domain": "thegatewaypundit.com",
    "location": null
  },
  "imageUrl": "https://www.thegatewaypundit.com/wp-content/uploads/2025/02/whitehouse.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T02:00:38+00:00",
  "addDate": "2025-08-24T02:04:48.168563+00:00",
  "refreshDate": "2025-08-24T02:04:48.168564+00:00",
  "score": 1.0,
  "title": "Former Secret Service Chief Paid Himself a Bonus",
  "description": "This story originally was published by Real Clear Wire By Susan Crabtree Former acting Secret Service Director Ron Rowe gave himself a senior leadership “performance” bonus around the holidays in December after previously serving as the second in command of the agency, leading up to the two assassination attempts against President Trump last year, according to multiple knowledgeable sources.",
  "content": "This story originally was published by Real Clear Wire\n\nFormer acting Secret Service Director Ron Rowe gave himself a senior leadership “performance” bonus around the holidays in December after previously serving as the second in command of the agency, leading up to the two assassination attempts against President Trump last year, according to multiple knowledgeable sources.\n\nThe agency pays nearly everyone in senior executive leadership positions bonuses – many worth thousands of dollars – at the end of the year, and that includes Rowe, the sources said.\n\nBecause Rowe was the acting director at the time, he moved forward with giving himself a bonus and then continued to remain on the payroll listed as a “senior advisor” for nearly half of this year – months after Trump tapped Sean Curran as the new director. Rowe could do so by using up all accumulated sick and leave time, sources tell RCP. Rowe has since announced that he had joined the Chertoff Group, the national security consulting firm run by former Homeland Security Secretary Michael Chertoff.\n\nFormer Secret Service Director Kimberly Cheatle, who resigned in disgrace after Trump was nearly killed at the Butler rally and rallygoer Corey Comperatore was murdered, did not receive a bonus last year because she was no longer employed by the agency at the end of the year, these sources confirmed.\n\nMeanwhile, the first quarterly installment of promised retention bonuses for agents who agreed not to jump ship to another government law enforcement job or retire in the aftermath of the morale-sinking assassination attempts has been delayed for weeks. On Wednesday, USSS leaders once again reassured agents in an email that their promised retention bonuses are coming and would be paid by the end of August.\n\nThe information is helping ease some anxiety for agents miffed by multiple retention check delays – an important morale booster as the Secret Service prepares for President Trump’s ride-along tonight with D.C. law enforcement and National Guard troops. Trump wants to see for himself their efforts to crack down on crime in the nation’s capital, but such a hands-on D.C. night tour will pose a complex challenge for the Secret Service, which is charged with the unusual task of protecting a president while accompanying law enforcement officers on patrol.\n\nUSSS leadership sent an email to all agents Wednesday after RealClearPolitics once again inquired about the ongoing delays with the first quarterly installment of their retention bonuses. When the funds are fully disbursed over the next year, the retention incentives will amount to tens of thousands of dollars per employee who agreed to stay on the job and not to leave the agency.\n\nThe new email updated the agents to let them know that all Uniformed Division officers who deserved the retention bonuses had received them, while the agency was paying other agents in alphabetical order – and had disbursed the funds to agents with last names starting with the letter “A” through “F” so far, a source familiar with the matter told RCP.\n\nOnce again, Curran promised that the agency would complete all the retention-bonus payments by the end of the month.\n\nThe nearly month-long delay in receiving the retention bonus was caused by a data-processing glitch, sources said, and exacerbated by DOGE personnel cuts and buyouts to the department in charge of doling out the bonuses.\n\nFor many in the Service, the first installment of the bonus will amount to 15% of their annual salaries and tens of thousands of dollars once fully received. These agents agreed to sign the bonus offer earlier this year as a way to stem the tide of agents retiring or departing to other agencies, such as the Drug Enforcement Agency or the Homeland Security Department.\n\nCongress provided an extra $231 million to the Secret Service after the assassination attempts last year to help the agency deal with budget shortfalls and severe manpower issues.\n\nThe delays in receiving the retention bonuses, coupled with ongoing heavy workloads (European leaders were in town earlier this week, and the agency is preparing for the annual United Nations General Assembly meeting in New York next month), have spurred additional resentment among some rank-and-file, captured by a series of memes circulating among agents and UD officers.\n\nAfter senior leaders received their bonuses last year, some believe there’s been a lack of urgency to deliver the rank-and-file agents their retention bonuses.\n\n“If bosses pay or schedules are affected, things start changing — and that’s about the only way things change,” one insider remarked.\n\nRealClearPolitics first inquired about the missing bonuses on Aug. 5. At the time, an agency spokesman stressed that recruitment and retention are top priorities for Curran and that bonuses would begin to be paid out starting Aug. 11.\n\n“We understand the impact this delay had on our employees and are committed to ensuring it is resolved as quickly as possible,” a spokesman said at the time.\n\nThis article was originally published by RealClearPolitics and made available via RealClearWire.",
  "medium": "Article",
  "links": [
    "https://www.realclearwire.com/",
    "https://gettr.com/share?text=Former+Secret+Service+Chief+Paid+Himself+a+Bonus&url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F",
    "https://www.thegatewaypundit.com/cdn-cgi/l/email-protection#241b5751464e41475019674c41474f0116144b5150011614504c4d5701161443564145500116144556504d4748410116144b4a0116144c505054570117650116620116625353530a504c414345504153455d54514a404d500a474b49024549541f464b405d196c4d0116670116146d011614504c4b51434c500116145d4b51011614494d434c50011614414a4e4b5d011614564145404d4a43011614504c4d570116144556504d4748410116146d0116144e515750011614474549410116144547564b5757011765011614624b56494156011614774147564150011614774156524d4741011614674c4d414201161474454d400116146c4d495741484201161445011614664b4a5157011614011460011465011614011460011465704c4d570116144d57011614504c41011614484d4a4f0117650116144c505054570117650116620116625353530a504c414345504153455d54514a404d500a474b4901166216141611011662141c011662424b564941560957414756415009574156524d474109474c4d41420954454d40094c4d495741484209464b4a5157011662",
    "https://truthsocial.com/share?url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F&title=Former Secret Service Chief Paid Himself a Bonus",
    "http://www.printfriendly.com/print/?url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F",
    "https://www.thegatewaypundit.com/2025/08/tomorrow-cracker-barrel-breaks-silence-takes-shot-critics/?utm_source=website_link_trending1",
    "https://telegram.me/share/url?url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F&text=Former%20Secret%20Service%20Chief%20Paid%20Himself%20a%20Bonus",
    "https://realclearwire.com/authors/susan_crabtree/",
    "https://www.linkedin.com/shareArticle?mini=true&ro=true&trk=EasySocialShareButtons&title=Former+Secret+Service+Chief+Paid+Himself+a+Bonus&url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F",
    "https://gab.com/compose?url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2025%2F08%2Fformer-secret-service-chief-paid-himself-bonus%2F&text=Former+Secret+Service+Chief+Paid+Himself+a+Bonus"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "promised retention bonuses",
      "weight": 0.100065134
    },
    {
      "name": "bonuses",
      "weight": 0.08674878
    },
    {
      "name": "last year",
      "weight": 0.07561997
    },
    {
      "name": "Former acting Secret Service Director Ron Rowe",
      "weight": 0.07442934
    },
    {
      "name": "Secret Service",
      "weight": 0.07430494
    },
    {
      "name": "Former Secret Service Chief",
      "weight": 0.07388817
    },
    {
      "name": "multiple retention check delays",
      "weight": 0.073110245
    },
    {
      "name": "Former Secret Service Director Kimberly Cheatle",
      "weight": 0.07160847
    },
    {
      "name": "other agents",
      "weight": 0.0710624
    },
    {
      "name": "agents",
      "weight": 0.06858356
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97900390625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9560546875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.54638671875
    }
  ],
  "sentiment": {
    "positive": 0.09714239,
    "negative": 0.5852717,
    "neutral": 0.31758586
  },
  "summary": "Former Secret Service Director, Ron Rowe, gave himself a senior leadership “performance” bonus after previously serving as the second in command of the agency. The agency pays bonuses to nearly everyone in senior executive leadership positions at the end of the year, including Rowe. He continued to be listed as a “senior advisor” for nearly half of this year, months after President Trump appointed Sean Curran as the new director. Meanwhile, the first quarterly installment of promised retention bonuses for agents who agreed not to leave the agency following assassination attempts has been delayed for weeks. The delay has been seen as a morale boost as the Secret Service prepares for President Trump's ride-along with D.C. law enforcement and National Guard troops. The delays have exacerbated resentment among rank-and-file agents and some believe the lack of urgency to deliver the bonuses.",
  "shortSummary": "Former Secret Service Chief Ron Rowe received a bonus for his performance, amid delays in retention bonuses and ongoing staff shortages.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7c1308752a0d433ab7f4c5ea288e6eba",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thegatewaypundit.com/2025/08/tomorrow-cracker-barrel-breaks-silence-takes-shot-critics/?utm_source=website_link_trending1",
      "text": "The once-great Cracker Barrel has officially responded to the epic backlash of its CEO dumping the company’s iconic logo, and now, a rival chain is weighing in on the outrage.\nAs The Gateway Pundit reported, Cracker Barrel’s woke CEO Julie Felss Masino sparked a social media uproar after making an infuriating change to an iconic part of the restaurant chain.\nOn Tuesday, the company announced that it was replacing its 47-year-old logo as part of an attempted $700 million rebrand. The old logo shows the restaurant name next to a man sitting on a chair and leaning on a barrel.\nNow, the only thing left is the name. No more man and barrel.\nSocial media’s response was brutal. Users blasted the logo as horrible and noted Masino’s woke past.\nCracker Barrel, however, remains unmoved. A spokesperson told Fox News in a statement on Friday that the company is “very pleased” with not only the logo change but also other aspects of the remodeling.\n“Feedback from both guests and team members has been overwhelmingly positive and enthusiastic about the refreshed dining and shopping experience,” the statement said.\nThe company then attacked those criticizing the changes, dismissing them as “a vocal minority.”\n“All of the elements of our remodels were informed by direct input from our guests and team members alike. These changes are for them,” the statement continued. “There may be a vocal minority who feel differently.”\nMeanwhile, a restaurant chain rival competing for Cracker Barrel’s mostly conservative customer base had a perfect response to what Cracker Barrel going woke.\nAs Fox News noted, Indianapolis-based burger chain Steak n’ Shake noted that only disaster follows when a company angers its most loyal fans and made its own plea for Cracker Barrel fans to visit a restaurant that actually respects them.\n“This is what happens when you have a board that does not respect their historical customers or their brand,” the chain wrote on its official X account. “At Steak n Shake, we have gone back to basics. Our tallow fries are waiting for you.”\n“Oh yeah, you can also now pay with Bitcoin!”\nThis is what happens when you have a board that does not respect their historical customers or their brand.\nAt Steak n Shake, we have gone back to basics. Our tallow fries are waiting for you. Oh yeah, you can also now pay with Bitcoin! https://t.co/F5cBwUBVns\n— Steak ‘n Shake (@SteaknShake) August 21, 2025\nThis statement from Steak n’ Shake is precisely correct, as other companies like Bud Light can attest. We all remember how Bud Light sales plummeted after putting trans activist Dylan Mulvaney on its beer cans.\nNow, it is Cracker Barrel’s turn to get the Bud Light treatment. Companies like Steak n’ Shake are sure to benefit as a result."
    }
  ],
  "argos_summary": "Former acting Secret Service Director Ron Rowe awarded himself a senior‑leadership bonus and remained on payroll as a senior advisor after Trump’s new director was appointed, while the agency has delayed the first installment of promised retention bonuses for agents, citing a data‑processing glitch and staffing cuts. The agency has promised to pay the remaining bonuses by the end of August, with the first tranche amounting to about 15% of annual salaries. In unrelated news, Cracker Barrel’s CEO replaced the company’s 47‑year‑old logo as part of a $700 million rebrand, sparking a social‑media backlash that the company dismissed as a vocal minority. Rival chain Steak n’ Shake seized the moment to promote its own “back‑to‑basics” approach and even offered Bitcoin payments.",
  "argos_id": "T2M26YXDG"
}