{
  "url": "https://www.foxnews.com/media/msnbc-host-says-hes-sick-snowflakes-slamming-cracker-barrel-logo-redesign",
  "authorsByline": "Gabriel Hays",
  "articleId": "145ecbc3003043828f44f647466b26d2",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/cracker-barrel-snowflakes.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T15:57:07-04:00",
  "addDate": "2025-08-23T20:05:15.106168+00:00",
  "refreshDate": "2025-08-23T20:05:15.106171+00:00",
  "score": 1.0,
  "title": "MSNBC host says he’s sick of 'snowflakes' slamming Cracker Barrel logo redesign",
  "description": "MSNBC host Jonathan Capehart slammed critics of Cracker Barrel's redesigned logo as snowflakes getting bent out of shape over the restaurant chain's minimalist rebrand",
  "content": "MSNBC host Jonathan Capehart almost lost his cool on Saturday when discussing the backlash against Cracker Barrel’s redesigned logo.\n\nDuring an episode of MSNBC’s \"The Weekend,\" Capehart and co-host Eugene Daniels criticized those outraged over the restaurant’s recent logo redesign, arguing that the backlash is a waste of time and another excuse for MAGA supporters to play the victim.\n\n\"There are real things people are concerned about, and they’re losing their minds over a redesign. What the — See? I’m trying not to curse,\" Capehart told his co-host.\n\nCRACKER BARREL DISMISSES CRITICS AS 'VOCAL MINORITY' WHILE RIVAL RESTAURANT ADDS TO BACKLASH\n\nThe Tennessee-based restaurant chain angered people on social media last week when it revealed its newly redesigned logo that, for many online critics, removed the charm from the original.\n\nThe new logo does away with the illustration of an old man leaning against a barrel while seated in a chair. Instead, the text-only logo uses a new typeface against the familiar gold background.\n\nIn addition to the new logo and a new menu that includes breakfast, lunch and dinner options, the chain has also remodeled the interior of its restaurants, going for a cleaner, more minimalist theme that has done away with some of the country decor that has become synonymous with the brand.\n\nMany people were furious with the redesign. Conservative commentator Benny Johnson posted that the logo change was \"absolutely horrible,\" and asked, \"When will they learn?\"\n\nRight-wing influencer \"End Wokeness\" commented, \"Cracker Barrel CEO Julie Masino should face charges for this crime against humanity.\"\n\nCRACKER BARREL CUSTOMERS 'HATE' RESTAURANT CHAIN'S NEW LOOK IN VIRAL SOCIAL MEDIA VIDEOS\n\nRival franchise Steak 'n Shake called out Cracker Barrel, stating, \"Sometimes, people want to change things just to put their own personality on things. At CB, their goal is to just delete the personality altogether. Hence, the elimination of the ‘old-timer’ from the signage. Heritage is what got Cracker Barrel this far, and now the CEO wants to just scrape it all away.\"\n\nCapehart voiced his opinion on the logo redesign, calling it fine and saying he’s \"sick\" of the outrage.\n\n\"The logo is fine. Companies go through rebrands all the time. You know what I’m sick of?\"\n\n\"Yeah, manufactured BS, but I’m so sick of the outrage of these snowflakes. There are so many things that offend them, that get them all upset, they’re shooting beer cans and burning hats and stuff like that,\" the co-host replied, referencing conservative-led boycotts, like the one against Bud Light for making a trans person one of the company's spokespeople.\n\nCLICK HERE FOR THE LATEST MEDIA AND CULTURE NEWS\n\nDaniels linked the outrage to MAGA supporters, stating, \"I think the manufactured outrage is also about them pretending to feel attacked. Because when you think about Cracker Barrel, as someone who’s been a lot as a kid in the South, you think about folks in the south. You think about folks who are probably MAGA voters, right? Those two circles are probably very close together.\"\n\nHowever, Trump voters haven’t been the only ones speaking out against Cracker Barrel’s redesign.\n\nThe official X account for the Democratic Party shared a post Thursday that stated, \"We think the Cracker Barrel rebrand sucks too.\"\n\nA representative for Cracker Barrel previously told Fox News Digital in a statement about the new logo that the company's values had not changed.\n\n\"Our values haven't changed, and the heart and soul of Cracker Barrel haven’t changed,\" the company said. \"And Uncle Herschel remains front and center in our restaurants and on our menu. He is the face of ‘The Herschel Way,’ the foundation of how our 70,000-plus employees provide the country hospitality for which we are known.\n\n\"Cracker Barrel has been a destination for comfort and community for more than half a century, and this fifth evolution of the brand’s logo, which works across digital platforms as well as billboards and roadside signs, is a call-back to the original and rooted even more in the iconic barrel shape and word mark that started it all back in 1969.\"\n\nCLICK HERE TO GET THE FOX NEWS APP",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/download",
    "https://www.foxnews.com/media/democratic-party-gavin-newsom-join-online-roasting-new-cracker-barrel-logo",
    "https://www.foxnews.com/video/6369862451112",
    "https://www.foxnews.com/media",
    "https://www.foxnews.com/video/6377298539112",
    "https://www.foxnews.com/politics/conservative-activist-slams-cracker-barrel-company-left-reeling-after-logo-redesign",
    "https://www.foxnews.com/food-drink/cracker-barrel-dismisses-critics-vocal-minority-while-rival-restaurant-backlash",
    "https://www.foxnews.com/food-drink/cracker-barrel-unveils-new-simplified-logo-our-story-hasnt-changed",
    "https://www.foxnews.com/food-drink/cracker-barrel-customers-hate-restaurant-chains-new-look-viral-social-media-videos"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Cracker Barrel logo redesign",
      "weight": 0.113342695
    },
    {
      "name": "Cracker Barrel",
      "weight": 0.10044641
    },
    {
      "name": "Cracker Barrel CEO Julie Masino",
      "weight": 0.08736524
    },
    {
      "name": "Cracker Barrel’s redesigned logo",
      "weight": 0.06983038
    },
    {
      "name": "RIVAL RESTAURANT",
      "weight": 0.06601596
    },
    {
      "name": "co-host Eugene Daniels",
      "weight": 0.06392848
    },
    {
      "name": "MSNBC host Jonathan Capehart",
      "weight": 0.06264564
    },
    {
      "name": "Many people",
      "weight": 0.060934536
    },
    {
      "name": "Cracker Barrel’s redesign",
      "weight": 0.06010356
    },
    {
      "name": "NEW LOOK",
      "weight": 0.059039574
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.8701171875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.78369140625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.68017578125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.54248046875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Networks & Stations",
      "score": 0.50341796875
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.4052734375
    }
  ],
  "sentiment": {
    "positive": 0.041369814,
    "negative": 0.7756519,
    "neutral": 0.18297835
  },
  "summary": "MSNBC host Jonathan Capehart and co-host Eugene Daniels criticized the backlash over Cracker Barrel's redesigned logo, stating that the backlash is a waste of time and an excuse for MAGA supporters to play the victim. The restaurant chain's new logo, which removes the charm from the original image, was criticized for removing the illustration of an old man from the iconic 'old-timer' and replacing it with a new typeface. The company has also updated its interior of its restaurants with a cleaner theme and a new menu. Many people were unhappy with the redesign, with some branding it as \"VOCAL MINORITY\" and \"absolutely horrible.\" However, rival franchise Steak 'n Shake also expressed dissatisfaction with the change. Capehart defended the logo, calling it fine and expressing his sickness at the constant outrage.",
  "shortSummary": "MSNBC host Jonathan Capehart criticized Cracker Barrel’s redesigned logo, calling it \"offensive\" and \"offensive,\" while critics linked it to MAGA supporters.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "233bee99d63841b388a7c2d5bd4fdf6d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/food-drink/cracker-barrel-dismisses-critics-vocal-minority-while-rival-restaurant-backlash",
      "text": "Cracker Barrel Old Country Store customers have been vocal on social media about their disdain for the recent transformation of the Tennessee-based restaurant chain.\nThose voices grew even louder after Cracker Barrel unveiled its new logo this week.\nThe new logo does away with the illustration of an old man leaning against a barrel while seated in a chair. Instead, the text-only logo uses a new typeface against the familiar gold background.\nCRACKER BARREL UNVEILS NEW SIMPLIFIED LOGO: 'OUR STORY HASN'T CHANGED'\nCracker Barrel also rolled out a new menu that includes breakfast, lunch and dinner options and \"refreshed restaurant remodels\" as part of its \"All the More\" campaign, according to a news release.\nAlthough Sarah Moore, Cracker Barrel's chief marketing officer, touted the changes as \"bringing fresh energy, thoughtful craftsmanship and heartfelt hospitality to our guests,\" many people on social media had a far different perspective.\nBenny Johnson, a YouTube content creator and conservative influencer based in Florida, wrote on X that the new logo is \"absolutely horrible.\"\n\"When will they learn?\" he added.\nThe responses were resoundingly negative.\nCRACKER BARREL CUSTOMERS 'HATE' RESTAURANT CHAIN'S NEW LOOK IN VIRAL SOCIAL MEDIA VIDEOS\n\"Not a cracker or a barrel in sight,\" one person wrote.\n\"It's worse than horrible. It's ... generic,\" wrote another.\n\"Massive downgrade,\" someone else noted.\n\"They literally just ruined the entire thing. Change it back!\" another person demanded.\n\"This logo change feels like a war crime,\" said yet another commenter.\nCRACKER BARREL EXECUTIVE INSISTS RESTAURANT REMODELS ARE 'WHAT THE GUESTS ASKED FOR'\nEven Steak 'n Shake had something to say about the Cracker Barrel backlash.\n\"This is what happens when you have a board that does not respect their historical customers or their brand,\" the Indianapolis-based burger chain wrote in part on its official X account.\nFox News Digital reached out to Steak 'n Shake for comment.\nOthers pointed out that Cracker Barrel seems to have lost its focus on food.\n\"They have been changing the menu and ingredients lately. It's not country cooking anymore,\" one person commented.\n\"The food has been substandard for a while,\" another said.\nMoore told Fox News Digital in May that Cracker Barrel has been \"listening to what the guests ask for – and examples of what the guests asked for are things like spaces that feel brighter, that feel less cluttered, more booth seating, more seating options, so our guests are more comfortable while they're dining with us.\"\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nShe said fan favorites like the rocking chairs, peg games and antiquities on the wall aren't going anywhere.\n\"The things you love about us will stay,\" she said.\nA Cracker Barrel spokesperson told Fox News Digital in a statement that the company is \"very pleased with the trajectory of our remodeled stores.\"\nFor more Lifestyle articles, visit www.foxnews.com/lifestyle\n\"Feedback from both guests and team members has been overwhelmingly positive and enthusiastic about the refreshed dining and shopping experience,\" the statement said.\n\"All of the elements of our remodels were informed by direct input from our guests and team members alike. These changes are for them.\"\nCracker Barrel added that \"there may be a vocal minority who feel differently.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"However, the strong performance of these locations affirms that we are moving in the right direction,\" the statement said.\n\"We hope people who haven't yet visited a remodeled store will visit us and experience the country hospitality proudly on display at every table and in every dish.\""
    },
    {
      "url": "https://www.foxnews.com/food-drink/cracker-barrel-unveils-new-simplified-logo-our-story-hasnt-changed",
      "text": "Cracker Barrel debuted its new logo on Tuesday, removing the man resting on a barrel and leaving only the name of the restaurant serving southern-style comfort food.\nThe new design marks the first time in 48 years that the logo only features text.\nThe Old Country Store opened in 1969 with a text-only logo before adding the iconic image of the man sitting against a barrel in 1977.\nCRACKER BARREL EXECUTIVE INSISTS RESTAURANT REMODELS ARE 'WHAT THE GUESTS ASKED FOR'\nCracker Barrel said the new logo \"is now rooted even more closely to the iconic barrel shape and word mark that started it all.\"\n\"Anchored in Cracker Barrel’s signature gold and brown tones, the updated visuals will appear across menus and marketing collateral, including the fifth evolution of the brand’s logo, which is now rooted even more closely to the iconic barrel shape and word mark that started it all,\" the company said in its announcement.\nThe brand also said popular menu items like \"farm fresh scrambled eggs and buttermilk biscuits\" even served as inspiration behind the \"hues of a refreshed color palette.\"\nThe new logo was revealed as part of the company's \"All the More\" campaign that also includes new menu offerings and a collaboration with country music singer Jordan Davis, who starred in a new commercial for the company.\n\"I'm proud to be part of this next chapter.\"\n\"Cracker Barrel has always felt like home to me,\" Davis said in the announcement.\n\"It's where the food hits just right, the people treat you like family, and the pace lets you slow down and take a breath. That’s something I try to bring into my music too; real moments that feel good and bring people together. I'm proud to be part of this next chapter and to celebrate what makes Cracker Barrel so special to so many.\"\nThe company is also offering customers in the U.S. a complimentary Classic Side with any purchase on Aug. 23 and 24 at its nearly 660 locations nationwide.\n\"We believe in the goodness of country hospitality, a spirit that has always defined us,\" Cracker Barrel chief marketing officer Sarah Moore said. \"Our story hasn’t changed. Our values haven’t changed. With 'All the More,' we’re honoring our legacy while bringing fresh energy, thoughtful craftsmanship and heartfelt hospitality to our guests this fall.\"\nCRACKER BARREL CUSTOMERS 'HATE' RESTAURANT CHAIN'S NEW LOOK IN VIRAL SOCIAL MEDIA VIDEOS\nCracker Barrel also said that despite the removal of the man and the barrel from its logo, \"Uncle Herschel remains front and center in our restaurants and on our menu.\"\n\"Our values haven't changed, and the heart and soul of Cracker Barrel haven't changed,\" a company spokesperson said in a statement to Fox News Digital. \"And Uncle Herschel remains front and center in our restaurants and on our menu. He is the face of 'The Herschel Way,' the foundation of how our 70,000-plus employees provide the country hospitality for which we are known.\"\n\"Cracker Barrel has been a destination for comfort and community for more than half a century, and this fifth evolution of the brand's logo, which works across digital platforms as well as billboards and roadside signs, is a call-back to the original and rooted even more in the iconic barrel shape and word mark that started it all back in 1969,\" the spokesperson continued.\nThe new design is just the latest aspect of Cracker Barrel's modern makeover.\nLast year, the company updated the antique Southern feel of its interiors to a brighter modern vibe.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nMoore told Fox News Digital earlier this year that the Tennessee-based restaurant chain has been testing \"various levels of remodels.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"We've been very transparent about our goal of making our stores feel brighter and even more welcoming than they already are, while maintaining that country hospitality and charm that we're known for,\" Moore said at the time.\nPeter Burke of Fox News Digital contributed reporting."
    },
    {
      "url": "https://www.foxnews.com/politics/conservative-activist-slams-cracker-barrel-company-left-reeling-after-logo-redesign",
      "text": "Anti-woke crusader Robby Starbuck released a devastating video takedown of Cracker Barrel's leadership, making the case that the restaurant's logo and decor change are the culmination of a years-long campaign to cater to the far Left and abandon the values of its middle-America customer base.\nStarbuck, who has brought major companies including John Deere, Target, and Harley-Davidson to heel by exposing their woke policies, described Cracker Barrel’s logo makeover as going from \"old American nostalgia\" to something \"cold, dead, lifeless and modern\" in a 15-minute video. He said that, while the Cracker Barrel brand is often associated with American tradition, the company is \"infested with left-wing activists who are more interested in safe spaces, pronouns and virtue signaling than they are in their customers.\"\nIn his video, Starbuck highlights Cracker Barrel’s support for LGBTQ+ organizations and events, such as Nashville Pride, River City Pride and the Human Rights Campaign (HRC).\nCRACKER BARREL CEO SERVES UP LEFTOVER CORPORATE BRANDING TO UNHAPPY CUSTOMERS\nHe also noted that the company displayed rocking chairs with rainbow colors and LGBTQ+ insignia. The company even went so far as to place one in its Tennessee corporate office. Rocking chairs are practically synonymous with Cracker Barrel, with the restaurant’s long porches lined with them at locations nationwide.\n\"The fact that it's located there is important to this story because what's happened here is a microcosm of the parasitic operating procedure of left-wing activists,\" Starbuck said. \"They don't just wanna force their soulless, godless, hedonistic vision of the future onto blue hellscapes that their party controls.\n\"No, it's much more important to them that they shove it down into your towns, into your kids' schools and into your way of life. So, sticking a pro-trans rocking chair into their headquarters in a predominantly conservative town is exactly the type of thing they revel in doing.\"\nStarbuck then pointed to the company’s involvement with HRC and participation in the Out and Equal Workplace Summit. For the Out and Equal conference, Cracker Barrel made rocking chairs in every color of the rainbow, representing the LGBTQ+ flag. Out and Equal even gave Cracker Barrel an award for having 2018’s top LGBTQ+ Employee Resource Group (ERG).\nCRACKER BARREL DISMISSES CRITICS AS 'VOCAL MINORITY' WHILE RIVAL RESTAURANT ADDS TO BACKLASH\nThe restaurant chain previously participated in HRC’s Corporate Equality Index, which measures \"corporate policies, practices, and benefits pertinent to lesbian, gay, bisexual, transgender, and queer employees,\" according to the organization’s website. A company’s score on the index is determined by how inclusive HRC judged it to be toward LGBTQ+ employees.\nCracker Barrel told Fox News Digital on Friday that it \"has not participated in the Human Rights Campaign Index or had any affiliation with HRC in several years.\"\nTwo Cracker Barrel employees are called out by name in Starbuck’s video, Steve Smotherman and Rachel CampBell.\nSmotherman was the head of management training and development at Cracker Barrel for 15 years, Starbuck asserted, showing a screenshot that appeared to be from LinkedIn. Smotherman, who eventually left Cracker Barrel for Out and Equal, serves on HRC's Business Advisory Council in Washington, D.C.\nDEMOCRATIC PARTY, GAVIN NEWSOM JOIN ONLINE ROASTING OF NEW CRACKER BARREL LOGO\nStarbuck describes Smotherman as \"the archetype activist employee that fueled the rise of DEI in corporate America.\" He also slammed CampBell, a manager of training and development at Cracker Barrel, for publicly expressing excitement over the company’s rainbow pride rocking chairs.\n\"And it’s important to note all of this because these types of employees play a critical role in turning companies away from the values of their customers and moving the companies toward wokeness,\" Starbuck said.\nCRACKER BARREL EXECUTIVE INSISTS RESTAURANT REMODELS ARE 'WHAT THE GUESTS ASKED FOR'\nGilbert Dávila, a member of Cracker Barrel’s board of directors, was also referenced in Starbuck’s video. Dávila, who joined Cracker Barrel’s board in 2020, has worked at several major companies, including Disney, Coca-Cola and Procter & Gamble. He’s also the co-CEO of DMI Consulting, which looks to \"infuse cultural relevance and creativity into every solution.\" Starbuck asserted that Dávila, and others like him are responsible for the \"woke advertising push\" seen over the last few years.\nIn the end, Starbuck emphasizes that the controversy around Cracker Barrel’s logo change is about more than the removal of a man in his chair leaning on a barrel.\nCLICK HERE TO GET THE FOX NEWS APP\n\"It's very, very important to understand that the Cracker Barrel story is not about a logo. It's not at all about a logo, it is about a country, it is our heritage, and it is a culture. It's about a power structure built to tell us that we are somehow backwards, embarrassing or bigoted,\" Starbuck said.\n\"A conservative can't give their money to Cracker Barrel. A Christian cannot give their money to Cracker Barrel, and so we won't,\" he added.\nAs Starbuck sees it, the Cracker Barrel debacle is a win-win for conservatives, saying that the company will either have to double down and lose customers or revert back to its 1977 logo to retain its customer base.\nFox News Digital’s Brian Flood and Nikolas Lanum contributed to this report.\nCracker Barrel did not respond Fox News Digital's request for comment in time for publication."
    },
    {
      "url": "https://www.foxnews.com/food-drink/cracker-barrel-customers-hate-restaurant-chains-new-look-viral-social-media-videos",
      "text": "As Cracker Barrel Old Country Store restaurants continue to undergo a physical transformation, more customers are noticing – and they're not embracing the changes.\nCracker Barrel chief marketing officer Sarah Moore told Fox News Digital earlier this year that the Tennessee restaurant chain has been testing \"various levels of remodels.\"\n\"We've been very transparent about our goal of making our stores feel brighter and even more welcoming than they already are, while maintaining that country hospitality and charm that we're known for,\" Moore said. (See the video at the top of this article.)\nCRACKER BARREL FAN'S VIRAL TIKTOK SPARKS BACKLASH OVER RESTAURANT MAKEOVER\nBut some Cracker Barrel lovers on social media have expressed their displeasure with the changes.\nA recent Instagram video shared by Cracker Barrel includes a caption that reads, \"Nothin' a little Cracker Barrel can't fix.\"\nIt elicited several negative responses to the alterations.\n\"The remodel is 🤮,\" one person wrote.\n\"Now this place looks like every other chain restaurant. Bland and boring,\" wrote another person.\n8 SIGNS THAT YOU SHOULD LEAVE A RESTAURANT, EXPERTS SAY\n\"WHAT are you thinking with that interior?!\" someone else said.\nMoore told Fox News Digital that the \"physical guest experience\" is \"rooted in our brand DNA\" and that the changes being made are based on \"guest feedback.\"\nShe continued, \"Items like our rocking chairs, our biscuits, our peg games, antiquities on the wall, none of that is going away. We're just looking at ways to freshen up the experience so that we can open our door a bit wider for more guests.\"\nRachel Love, a content creator living in Tennessee, caught the restaurant chain's attention with her social media video showing off the new interior.\nThe video has been viewed over 2 million times and has fetched nearly 4,000 comments since May.\nAnother eight-second video posted by @CoachDuggs earlier this month shows the interior of a remodeled Cracker Barrel. The caption reads, \"At a remodeled Cracker Barrel. I hate it.\"\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nThe viral video has been viewed more than 6 million times since Aug. 2.\nIt led to a follow-up post directed at Cracker Barrel.\n\"The people have spoken. Stop it,\" @CoachDuggs wrote.\n\"HATE IT,\" one person commented in the post.\n\"What a disaster!!\" another person commented.\nMoore reiterated that Cracker Barrel welcomes the feedback.\nFor more Lifestyle articles, visit www.foxnews.com/lifestyle\n\"We love feedback,\" she said. \"We take feedback from all channels very seriously. So, throughout this past year, when we talk about testing and all the development we've been doing, we have constantly pulsed various guest segments along the way.\"\nShe said that includes loyal customers, lapsed guests and prospective diners.\n\"We truly want to understand how they feel about all the elements, whether it's about the remodels or the menu or the full brand transformation framework,\" she said.\n\"This includes understanding … the social media narrative and really digging deep into what our fan base is saying about us.\"\nCLICK HERE TO GET THE FOX NEWS APP\nBut, she added, \"The things you love about us will stay.\"\n\"The things that make us truly who we are — that's not changing.\""
    },
    {
      "url": "https://www.foxnews.com/media/democratic-party-gavin-newsom-join-online-roasting-new-cracker-barrel-logo",
      "text": "The Democratic Party and California Gov. Gavin Newsom’s press office's X accounts joined the backlash against Cracker Barrel after it released its new text-only logo earlier this week.\nThe company unveiled the new logo on Tuesday as part of its new branding campaign for the Cracker Barrel Old Country Store restaurants. The campaign eliminated the image of a man resting on a barrel in favor of a text-only logo for the first time since 1977.\nWhile conservative critics have piled on the new redesign, both the Democratic Party and the liberal governor’s media team put out tweets Thursday calling out the Tennessee-based restaurant chain for the change.\nCRACKER BARREL'S NEW TEXT-ONLY LOGO IS 'HOW YOU DESTROY A BRAND,' CRITICS CLAIM\n\"WHAT IS WRONG WITH CRACKER BARREL?? KEEP YOUR BEAUTIFUL LOGO!!! THE NEW ONE LOOKS LIKE CHEAP VELVEETA \"CHEESE\" FROM WALMART, THE PLACE FOR ‘GROCERIES’ (AN OLD FASHIONED TERM)!!! ‘FIX IT’ ASAP! WOKE IS DEAD!! THANK YOU FOR YOUR ATTENTION TO THIS MATTER. — GCN,\" Newsom’s press office wrote, mocking President Donald Trump’s caps-heavy writing style.\n\"We think the Cracker Barrel rebrand sucks too,\" the Democratic Party wrote.\nCRACKER BARREL FAN'S VIRAL TIKTOK SPARKS BACKLASH OVER RESTAURANT MAKEOVER\nA representative for Cracker Barrel told Fox News Digital in a statement about the new logo that the company's values had not changed.\n\"Our values haven't changed, and the heart and soul of Cracker Barrel haven’t changed,\" the company said. \"And Uncle Herschel remains front and center in our restaurants and on our menu. He is the face of ‘The Herschel Way,’ the foundation of how our 70,000-plus employees provide the country hospitality for which we are known.\n\"Cracker Barrel has been a destination for comfort and community for more than half a century, and this fifth evolution of the brand’s logo, which works across digital platforms as well as billboards and roadside signs, is a call-back to the original and rooted even more in the iconic barrel shape and word mark that started it all back in 1969.\"\nCLICK HERE TO GET THE FOX NEWS APP\nCracker Barrel Chief Marketing Officer Sarah Moore previously told Fox News Digital that the chain's ongoing transformation incorporated not only customer feedback but also employee input.\nShe said Cracker Barrel is \"listening to what the guests ask for, and examples of what the guests asked for are things like spaces that feel brighter, that feel less cluttered, more booth seating, more seating options, so our guests are more comfortable while they're dining with us.\""
    },
    {
      "url": "https://www.foxnews.com/media",
      "text": "MASTER OF MARGINS Media Bill Maher hammers Dems on how Trump is taking their voters, says he feels people's 'pain in the a--'\n'EXTRAORDINARY SACRIFICE' Fox News Flash Young tycoon drops truth bomb, arguing work-life balance will keep Gen Z 'mediocre'\n'UNTAPPED AUDIENCES' Media Army’s use of social media influencers for recruitment draws mixed reactions online\nLargest Christian university celebrates FTC dropping lawsuit, ending years of 'lawfare' from Biden admin\nBill Maher hammers Dems on how Trump is taking their voters, says he feels people's 'pain in the a--'\nEx-Wisconsin university DEI staffer wins $265K settlement after alleging discrimination for being White\nPolitical activist CJ Pearson says White liberals are starting to fear they're losing 'power' over Blacks\nVirginia Lt. Governor on why her state is at risk of losing federal funding over transgender bathrooms\nMSNBC staffers divided over new name but 'cautiously optimistic' about liberal network's post-NBC future\nTop Democrats peeved over $8B Paramount-Skydance merger, citing Trump influence and canceled Colbert show\nEx-Navy SEAL congressman describes emotional reunion with boy he helped save from near-fatal car crash\nRock star melts down after White House calls him 'washed-up,' rages that Trump is a 'low-life fascist'\nTurley hails Trump’s 'tremendous victory' after civil fraud penalty tossed, blasts 'grotesque' use of NY law\nPentagon officials blast Washington Post for putting 'lives at risk' with report on Pete Hegseth’s security\nChris Matthews tells Dems to abandon 'all this other crap' on open borders and trans issues, focus on economy\nCharlie Kirk applauds Lamar Jackson's 'courage and conviction' after backlash for sharing Christian message\nYosemite National Park ranger reportedly fired after draping massive trans pride flag across El Capitan\n'The View' co-host Ana Navarro rips Melania Trump's Putin letter as 'so hypocritical you can't believe it'\nEx-Obama aide warns Democrats can’t counter Trump because voters don’t know what the party stands for\nTrump didn’t cause Russia-Ukraine war, Stephen A. Smith says, blaming Biden, Obama and Clinton in fiery rant\nShari Redstone breaks silence on 'no-brainer' $16M Trump settlement that preceded Paramount-Skydance merger\nTrump praises Melania’s ‘beautiful note’ to Putin, says Zelenskyy brought letter from wife to first lady\nOmen or harbinger of doom? Fox Nation explores the chilling mystery that turned a small town into a spectacle\nFierce backlash to Matt Rife ad campaign left makeup company 'very surprised,' admits brand executive\nCalifornia pastor leads rally at state capitol warning parents to flee state if 'dangerous' bill passes\nJoy Reid claims 'mediocre White men' like Trump, Elvis can't 'invent anything,' steal culture from other races\nParental rights concerns erupt over California bill that would let nonrelatives make decisions for kids\nVenezuelan refugee who fled persecution warns Mamdani's policies mirror ideas that destroyed his country\nJimmy Kimmel dismisses reports of Stephen Colbert's 'Late Show' losing $40 million a year as 'nonsensical'\nOklahoma's 'America First' test for teachers features questions on gender, freedom of religion: report\nChris Pratt wishes RFK Jr., Trump admin success, advises against being 'mired in hatred' for the president\nTrump administration threatens to pull federal funds from Virginia school districts in gender policy dispute\nEric Swalwell rejects Michelle Obama's 'when they go low, we go high' message, vows to 'bury' Republicans\nEx-Washington Post fact checker hits ‘absentee owner’ Bezos, tells him to commit to saving paper or sell it"
    }
  ],
  "argos_summary": "Cracker Barrel’s new text‑only logo, which drops the iconic man‑on‑a‑barrel image, has sparked a wave of social‑media backlash from conservatives and even some liberals, who accuse the chain of abandoning its heritage. MSNBC host Jonathan Capehart dismissed the outrage as a manufactured “snowflake” reaction and linked it to MAGA voters, while the company insists its values and “Uncle Herschel” remain unchanged. Rival chains like Steak ’n Shake and political figures—including the Democratic Party and California Governor Gavin Newsom—joined the criticism, whereas Cracker Barrel’s marketing team says the redesign reflects customer‑driven updates to its menu and interior. The controversy highlights the tension between brand evolution and nostalgic expectations among the chain’s core Southern‑American customer base.",
  "argos_id": "TNAR71LTW"
}