{
  "url": "https://www.forbes.com/sites/jaymcgregor/2025/08/23/google-pixel-10-discount-code-price-drop-offer/",
  "authorsByline": "Janhoi McGregor",
  "articleId": "ad0c1bbba0a44bfb8867f29c6a0bc412",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68a9bc53c14a9f98adb1b484/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:35:41+00:00",
  "addDate": "2025-08-23T13:41:48.144664+00:00",
  "refreshDate": "2025-08-23T13:41:48.144665+00:00",
  "score": 1.0,
  "title": "Google Emails Huge Discounts To Pixel 10 Buyers",
  "description": "Check your email for this Google Pixel 10 discount code.",
  "content": "Before the new Pixel 10 series landed, Google had promised an “exclusive offer” for people who signed up to the company’s marketing emails (alongside slashing the Pixel 9 price). With the phones here, we now know what that offer is.\n\nSelect Pixel 10 buyers have been sent coupons to use on the Pixel 10, but there doesn’t seem to be any consistency to the size of the discount that is being sent out. On the Google Pixel Reddit sub, some users say they have received a $200 code to use on the new phones.\n\n“I got an email with a $200 promotion code. The title of the email is Introducing Google Pixel 10 phones: Save $200 today. Ends 9/4/25,\" the redditor said. Another got slightly less. “Damn, only $100 off for me. I wonder how they determined the discount amount.”\n\nLooking through several threads, it looks like the discount code ranges between $100 and $200. In some cases, myself included, people who subscribed to Google’s marketing emails got no discount. The Pixel 10 introductory email simply laid out the deals that are available to everyone at the Google Store right now.\n\nWhat is the logic behind offering some subscribers more and others nothing? The original promotion clearly said that the exclusive offer was for “new subscribers only.” In other words, people who haven’t signed up for Google’s marketing emails before that offer went live.\n\nThe offer could also be country-specific. “I registered on [the] Google [Store] to receive their exclusive Pixel 10 offer, what a surprise this evening when I received their €20 promo code,” one French Reddit user complained. Another German buyer said, “got a 20€ code in Germany. After having Pixel 6, 7 and 8. Thanks for nothing I guess,” which was echoed by a U.K. shopper who was offered £20.\n\nThis isn’t the first time Google has sent out coupons to select Google product users that offer discounts to its flagship tech. Back in November, the Search company sent out $150 vouchers to select Google One (now called Google One AI Pro) subscribers in several countries. Like today’s promotion, not all subscribers received one. Before that, the company also emailed $150 store credit coupons to random Google Photos users.\n\nIf you missed out on a code, don’t fret because Google’s hardware doesn’t stay full price for very long. The Pixel 9 series received repeated, almost monthly, discounts from November onwards. Also, Google’s “birthday” is on September 27th, which typically means a sale to mark the event.\n\nLast year, it launched a Pixel 9 promotion that enhanced trade-in prices to celebrate the day. For its 28th birthday this year, I imagine we’ll see a repeat of the current pre-order deals. Keep an eye on Amazon, too, because it won’t be able to match Google’s trade-in pricing, so it may just drop the price of the Pixel 10 instead to compete with the manufacturer.",
  "medium": "Article",
  "links": [
    "https://www.reddit.com/r/GooglePixel/comments/1mvmbmr/psa_check_your_email_for_150_coupon_on_preorders/",
    "https://www.forbes.com/sites/jaymcgregor/2024/11/06/google-pixel-8-pixel-9-black-friday-sale-date-pixel-watch-3/",
    "https://www.forbes.com/sites/jaymcgregor/2025/08/11/apple-iphone-16-pro-max-price-drop-new-deal-at-amazon/",
    "https://www.forbes.com/sites/jaymcgregor/2025/08/05/google-pixel-9-pixel-9-pro-price-drop-discount-pixel-10-release-date/",
    "https://www.forbes.com/sites/jaymcgregor/2024/11/05/google-pixel-9-pro-xl-voucher-deal-discount/",
    "https://www.forbes.com/sites/jaymcgregor/2025/07/22/google-pixel-8-pro-trade-in-deal-google-store-pixel-10/",
    "https://www.forbes.com/sites/davidphelan/2025/07/22/google-teases-surprise-new-free-offer-for-pixel-10-buyers---for-limited-time-only-pixel-9-pro/",
    "https://www.forbes.com/sites/jaymcgregor/2025/08/11/samsung-gives-google-ai-one-pro-to-galaxy-s25-galaxy-z-fold-users/",
    "https://www.reddit.com/r/GooglePixel/comments/1mvpdj5/code_reduction_france/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google product users",
      "weight": 0.120390646
    },
    {
      "name": "Google",
      "weight": 0.11950457
    },
    {
      "name": "Google Photos",
      "weight": 0.11647468
    },
    {
      "name": "random Google Photos users",
      "weight": 0.114067435
    },
    {
      "name": "Pixel",
      "weight": 0.0988065
    },
    {
      "name": "the Google Pixel Reddit sub",
      "weight": 0.08457678
    },
    {
      "name": "Google Pixel 10 phones",
      "weight": 0.082729906
    },
    {
      "name": "Huge Discounts",
      "weight": 0.08094634
    },
    {
      "name": "discounts",
      "weight": 0.078853615
    },
    {
      "name": "Google’s marketing emails",
      "weight": 0.07696818
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8935546875
    },
    {
      "name": "/News/Technology News",
      "score": 0.85205078125
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.78466796875
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.7490234375
    }
  ],
  "sentiment": {
    "positive": 0.25803912,
    "negative": 0.19480784,
    "neutral": 0.54715306
  },
  "summary": "Google has sent out significant discounts to select buyers of the new Pixel 10 series, with some receiving a $200 code for use on the new phones. However, there is no consistency on the size of the discount being sent out. Some subscribers, including myself, who subscribed to Google’s marketing emails, received no discount. The discount code appears to be between $100 and $200. This isn't the first time Google has provided discounts for select Google product users. The company's hardware doesn't stay full price for a long time, with repeated discounts from November onwards.",
  "shortSummary": "Google has been sending out inconsistent discounts for the Pixel 10, including $200 for some users who have not yet received one.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3e77cfbbc9124717a43a32e36d14d7e3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.reddit.com/r/GooglePixel/comments/1mvpdj5/code_reduction_france/",
      "text": "The (un)official home of #teampixel and the #madebygoogle lineup on Reddit. Get support, learn new information, and hang out in the subreddit dedicated to Pixel, Nest, Chromecast, the Assistant, and a few more things from Google.\nCode reduction france\nHello everyone!\nI registered on Google to receive their exclusive Pixel 10 offer, what a surprise this evening when I received their €20 promo code 🤣\nWhat an incredible offer! While Americans have $200 codes 😅\nOn top of that last year they doubled the storage for the same price as a pre-order offer.\nI'm disappointed and you? I might consider the vivo x200 ultra"
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2025/08/05/google-pixel-9-pixel-9-pro-price-drop-discount-pixel-10-release-date/",
      "text": "Following the company’s huge Pixel 8 Pro price drop , and giving away 12 months of Google AI Pro to Pixel 9 owners, Google is back with one last discount before the Pixel 10 lands.\nThis story was updated on August 5th with new Pixel 9a deal details. Update below.\nThis is the company’s deepest discount for the Pixel 9 series yet. There will almost certainly be more after the Pixel 10 officially launches this month, but I don’t see Google dropping the price by much more until next year. With that said, I wouldn’t be surprised if we saw more aggressive trade-in deals, like June’s promotion that paid out hundreds of dollars for years-old phones.\nHere are Google UK’s current Pixel 9 deals.\n- Pixel 9 - £549 ($731), £250 off ($332.88)\n- Pixel 9a - £429 ($571.22), £70 off ($93.21)\n- Pixel 9 Pro - £679 ($904.09), £320 off ($426.08)\n- Pixel 9 Pro XL - £799 ($1063.87), £300 off ($399.45)\n- Pixel 9 Pro Fold - £1,399 ($1862.78), 350 off ($466.03)\nThe star of the show here is the Pixel 9 Pro, which is down to £679 ($904.09). That is a solid price for Google’s most powerful handset (the Pro XL has a bigger screen and battery, but the same ‘pro’ camera features). To quickly compare, Samsung’s Galaxy S25 Ultra costs over £400 more (£1099 / $1463) even with the company’s current £150 ($199.73) discount. Apple’s iPhone 16 Pro remains, predictably, resolutely, at its full $999 price.\nDon’t forget that the Pixel 9 Pro comes with one year of Google AI Pro for free. Google One subscribers also get 10% of the purchase back as store credit. It’s not just Pixel phones, Google has also discounted the Pixel Buds Pro 2 by £30 ($39.95) (down to £189 / $251.65) and the Pixel Watch 3 by £100 ($133.15) (down to £249 / $331.54).\nShould You Wait For The Google Pixel 10?\nThat depends on how patient you are. Google is promising an \"exclusive offer” to people who sign up for marketing emails. I’d guess this is a free accessory or subscription for people who pre-order the phone. But even with pre-order deals, these phones will dramatically drop in price soon after their launch.\nGoogle has run some form of deal for its flagship Pixel phone almost every month since the Pixel 8. The price drops grow the further away the device is from its launch, as you can see with this Pixel 9 deal. Those discounts will start as early as October, especially as Samsung prepares to launch its Galaxy S25 FE and Apple’s iPhone 17 lands.\nUpdate 08/05: U.S. Pixel 9 buyers aren’t so lucky, the main suite of phones isn’t on sale and likely won’t be until after the Pixel 10 officially launches. The Pixel 9a is, however, $100 cheaper, which brings the price down to $399. This deal lasts until August 17th.\nThe Pixel 8 Pro, too, is $400 cheaper, bringing the price down to $599. That $400 discount is a bit of marketing because the Pixel 8 Pro hasn’t been $999 since 2024. Despite the chicanery, $599 is still a decent price for last year’s flagship and it isn’t much a downgrade from the Pixel 9 Pro. Read my story on that here.\nThis is probably one of the last times you will be able to buy the Pixel 8 Pro directly from Google because it will be pushed down the pecking order after the Pixel 10 lands. Don’t let that sway your purchasing decision, though, because Amazon, Best Buy and others will still carry it at even cheaper prices considering it is two generations old."
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2025/08/11/apple-iphone-16-pro-max-price-drop-new-deal-at-amazon/",
      "text": "Unlike Samsung’s repeated Galaxy S25 promotions and Google’s constant Pixel 9 price drops, Apple discounts are rare, which is why Amazon’s latest iPhone 16 deal is worth taking a look at.\nThis story was updated on August 11th with new iPhone 16 deal details. Update below.\nThe retailer has slashed the price of all current iPhone 16 models in the U.K., including the iPhone 16e, a month before the iPhone 17 lands. They’re not the most dramatic price drops, particularly when they’re compared to Samsung’s latest free Galaxy Watch 7 deal. But Apple fans will be happy to see any sort of discount for the resolutely expensive iPhone. All prices below are for the 256GB storage option, with the exception of the 128GB iPhone 16e.\n- iPhone 16 - £698 ($938.74), £101 off ($135.83)\n- iPhone 16 Plus - £798 ($1073), £101 off ($135.83)\n- iPhone 16 Pro - £999 ($1343), £100 off ($134)\n- iPhone 16 Pro Max - £1099 ($1474), £100 off ($134)\n- iPhone 16e - £544 ($731), £55 off ($73)\nThese are obviously not huge discounts, but it is rare to see an unlocked, current-generation iPhone prices cut by more than this. Some extra money can be saved via Amazon’s trade-in platform, which lets you trade in more than one device at a time. The used-phone valuations are almost competitive, which is an improvement on the paltry prices the company has offered in previous sales. Here’s a selection of trade-in valuations against Samsung and Apple’s current pricing.\n- Apple iPhone 13 Pro Max 256GB Amazon price: £277 ($372), Samsung Price: £330 ($443), Apple price: £330\n- Apple iPhone 14 Pro Max 256GB Amazon price: £358 ($481), Samsung Price: £455 ($611), Apple price: £455\n- Samsung Galaxy S22 Ultra 256GB Amazon price: £179 ($240), Samsung Price: £221 ($297), Apple price:n/a\n- Samsung Galaxy S23 Ultra 256GB Amazon price: £274 ($368), Samsung Price: £380 ($511), Apple price:n/a\nSo the first thing is that Apple U.K. only accepts iPhones for trade-in. But the U.S. site has the Galaxy S22 Ultra priced at $160 (£118) and the Galaxy S23 Ultra at $250 (£185), both less than Samsung and Amazon’s respective offers. Apple’s trade-in pricing matches Samsung’s numbers, which isn’t a surprise considering they’re in direct competition. But Amazon’s prices remain significantly below those of Apple and Samsung. That is the price you pay for a cheaper upfront device.\nApple Weighs Price Rises For The iPhone 17\nThere is a decent chance that the iPhone 17 series will be more expensive at launch than the iPhone 16 lineup was. A report from The Wall Street Journal in May stated that Apple was considering increasing prices to offset proposed trade tariffs with China, where the bulk of iPhone manufacturing happens. These price rises would be blamed on new features, with Apple weary of directly blaming any increases on tariffs.\nMore recent rumours suggest that a $50 price hike is likely for the iPhone 17 Pro option, as my colleague David Phelan explains.\n“Regular leaker Instant Digital has claimed, in a post spotted by MacRumors, that the next iPhone 17 Pro will cost $50 more than it does now. This chimes with previous reports that every iPhone will see a $50 price increase compared to current counterparts.”\nThat $50 could be covered by raising the iPhone 16 Pro’s base storage model to 256GB, up from 128GB. Doing this, though, could result in an effective price cut, as MacRumours explains. “It's possible that Apple could increase the iPhone 17 Pro's base storage to 256GB, bringing it in line with the Pro Max, to help justify its $50 price increase. That would represent an effective price cut of $50 over today's iPhone 16 Pro with 256GB of storage and help to simplify the lineup.”\nUpdate August 11th: It’s the season for Apple deals because mobile carrier EE has discounted the entire iPhone 16 series. The price drops are similar to Amazon’s promotion and the phones are also unlocked, so there’s no need to sign up to a lengthy contract.\n- Apple iPhone 16e - £549 ($736), £50 off ($67)\n- Apple iPhone 16 - £699 ($937), £100 off ($134)\n- Apple iPhone 16 Plus - £799 ($1071), £100 off ($134)\n- Apple iPhone 16 Pro - £999 ($1340), £100 off ($134)\n- Apple iPhone 16 Pro Max - £1099 ($1474), £100 off ($134)\nAmazon edges out EE’s deal by a pound or two, but there’s virtually no difference between the two shops on price. There is some daylight in trade-in pricing, though. Amazon has the better trade-in valuations by a decent distance, so if you have a used device to hand over, Amazon will give you more for it.\n- Apple iPhone 13 Pro Max 256GB Amazon price: £277 ($372), EE price: £230 ($308)\n- Apple iPhone 14 Pro Max 256GB Amazon price: £358 ($481), EE price: £304 ($407)\n- Samsung Galaxy S22 Ultra 256GB Amazon price: £179 ($240), EE price: £150 ($201)\n- Samsung Galaxy S23 Ultra 256GB Amazon price: £274 ($368), EE price: £205 ($274)"
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2024/11/05/google-pixel-9-pro-xl-voucher-deal-discount/",
      "text": "This story was updated on November 5th with details of a new Pixel 9 discount.\nGoogle has given the Pixel 9 series its first major discount since the devices launched in August.\nThe company is gifting Google One subscribers a $150 voucher to use when buying a Pixel 9 smartphone, according to Redditors who have received the coupon. The only catch is that the store credit isn’t being sent to all Google One subscribers, with only a handful of Redditors claiming to have received the voucher so far.\n“I got an email for 15% off a P9 Pro or P9 Pro XL in Australia as a Google One Deal” one Redditor said. “Got an email! Just a few minutes ago.” Another said.\nThis is a serious discount that is on par with recent Pixel 8 price cuts. Google is seemingly sending the voucher out randomly to select Google One subscribers (I’m a subscriber and I haven’t received a code). Redditors who have received the emails say the offer ends on November 14th, just before Black Friday.\nThis wouldn’t be the first time Google has gifted people with $150 voucher codes to use on flagship hardware. Last December, the Search company sent out store credit vouchers to some Google Photos users to use when buying the Pixel 8.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nIf you want to check, search your inbox for the phrases “member benefit” and “Pixel 9”. The screenshot below shows what the email looks like.\nGoogle has also boosted trade-in prices when buying a Pixel 9 handset. Combining the two deals could mean some decent savings. Google’s trade-in prices don’t match up with Samsung's, but it is the best place for used Pixel valuations. Here is a snapshot of the best prices I could find.\n- Google Pixel 7 Pro - $540\n- Google Pixel 6 Pro - $450\n- Apple iPhone 13 Pro Max - $440\n- Apple iPhone 14 Pro Max - $635\n$150 off any of the Pixel 9 phones is a good deal, but I suspect Google will have something better up its sleeve for the Black Friday sales. Companies get competitive during the holiday shopping period and considering the depth and consistency of sales over the last 12 months, I expect some big discounts are on the horizon.\nI wouldn’t be surprised if Google knocked between $150 and $200 off the Pixel 9 and Pixel 9 Pro/XL. That will likely be combined with enhanced trade-in prices, the ability to stack the Google One 10% store credit offer, discounted accessories and subscription freebies like months of free YouTube Premium or cloud storage. Don’t forget that Best Buy, Target and other stores will have their own deals too.\nUpdate November 5th: Update: Google is rolling out another major discount for the Pixel 9 series. People with gold status on Play Points can claim a 30% discount on a Pixel 9, Pixel 9 Pro / XL and Pixel 9 Pro Fold, according to redditors who have claimed the deal.\nYou can check your Play Points status by heading to Google Play, pressing on your profile picture in the top right and then tapping “Play Points”. From there tap “perks” and the voucher will be there provided you have gold status. If you don’t have gold status you can up your points by buying apps, games, movies, books or in app purchases.\nRedditors are reporting that the discount isn’t stackable with other vouchers. But it is worth checking if the 10% store credit available to Google One subscribers works with this coupon, because that has historically stacked with other discounts.\nThis 30% off deal runs until 12/02/2024 so it will work during the Black Friday shopping period. We will have to see if it stacks with Black Friday deals, but other freebies, such as discounted (or free) accessories and subscriptions to services like YouTube Premium may still be included. We’ll know more in a couple of weeks."
    },
    {
      "url": "https://www.forbes.com/sites/davidphelan/2025/07/22/google-teases-surprise-new-free-offer-for-pixel-10-buyers---for-limited-time-only-pixel-9-pro/",
      "text": "Google is launching the next series of its Pixel phones in August. In fact, it’s confirmed that Aug. 20 is the day. Now, the Google Store website has unveiled the design of the Pixel 10 alongside a free offer for new (not existing) subscribers which will save money on the new Pixel 10 when it’s released. But there’s a deadline for signing up.\nWhere To Find The New Offer\nWhen you visit store.google.com, you’ll see an animation that transforms from the number 10 to the rear of the Pixel 10 Pro with its distinctive camera bar and three lenses. The headline tells you what you’re looking at: “Google Pixel 10. Coming August 10,” it reads.\nThe image is interesting (it looks a lot like the Pixel 9 Pro but comes in an all-new color) but the words between headline and image are also worth seeing. “Get an exclusive offer on August 20 from Google Store when you sign up for emails. New subscribers only,” they say.\nWith one click, if you haven’t subscribed before, you’ll be greeted by a new message. “You’re subscribed! Check your inbox on Aug. 20,” it advises. Which is when promotional codes with redemption instructions will be emailed to subscribers.\nWhat’s The Offer?\nAll very well, but what, exactly, is this new offer?\nGoogle’s cagey about that right now. What we know is that it’s a promotional code offer and it expires on Sept. 4 2025 at 11.59 p.m. Pacific. The coupon code will only be applicable for Pixel 10 — though this likely means Pixel 10 series, that is, it will work with all phones with Pixel 10 in their names. But it’s limited to a discount on one device only (not several phones).\nExactly how much discount you’ll get on the phone is still to be announced (and indeed may still be to be decided) and it’s limited to one per customer.\nAny Other Conditions?\nYou can read the full terms and conditions on the website but you need to be a new subscriber and sign up before 11.59 p.m. on Aug. 18."
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2024/11/06/google-pixel-8-pixel-9-black-friday-sale-date-pixel-watch-3/",
      "text": "Google’s Black Friday sale will kick off on November 12th the company has announced, with discounts to almost all of its products planned.\nThe announcement only appears on the U.K. shop for now, alongside a countdown to the start of the sale. Google says that the Black Friday shopping period will last from November 12th until December 3rd, which extends way the sale way before and beyond the actual shopping event.\nGoogle hasn’t revealed its new pricing, but it is teasing what shoppers can expect. It looks like almost all devices will be on sale, with the Pixel 8 getting the biggest discounts. Here’s a selection of Google’s teasers.\n- Save £400 ($515.41) on the Pixel 8 Pro\n- Save £70 ($90.20) on the Pixel Watch 3\n- Save £130 ($167.51) on the Pixel 8a\n- Save £100 ($128.85) on the Pixel 9 series\n- Save £300 ($386.56) on the Pixel 9 Pro Fold\nIt’s worth noting that Google isn’t explicitly saying that these devices will be discounted by the named amount. Rather shoppers can “save” on those devices. That could mean better trade-in deals (Google U.S. is running an enhanced trade-in promotion right now) or accessories thrown into smartphone sales for free.\nBest High-Yield Savings Accounts Of 2024\nBest 5% Interest Savings Accounts of 2024\nThere are no details on the U.S. sale yet, but the recent Pixel 9 promotions give us an idea of how Google will discount its flagship handset. Google began sending out $150 vouchers to use when buying the Pixel 9 last week to select Google One subscribers. The company then followed that up with a 30% discount to Google Play users with Gold tier status. Both are likely a good indication of how deeply Google will discount the Pixel 9 series.\nStay on top of the latest deal news by hitting the follow button below, or following me on Facebook."
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2025/07/22/google-pixel-8-pro-trade-in-deal-google-store-pixel-10/",
      "text": "Similar to the company’s Pixel 9 discount before the Galaxy Z Fold 7 debuted, Google’s latest Pixel 8 Pro discount is its best yet, and lands weeks before the official Pixel 10 announcement.\nThis story was updated on July 22nd with new Pixel 9 discounts and details about Google’s Pixel 10 offer.\nGoogle has slashed the cost of the Pixel 8 Pro by $400, bringing the price down to $599. That figure is a bit of marketing because the Pixel 8 Pro hasn’t been $999 for a very long time, and the company runs consecutive deals, so it’s rare to pay full price for a Pixel phone.\nNonetheless, $599 is a very good price for the 2023 Google flagship. The phone also comes with a Pixel Watch 2 and a free case. Alongside the 10% store credit for Google One members.\nThe downside is the poor trade-in pricing. Historically, Google has always been behind Apple and Samsung in valuing your used phone. That changed with a recent Google U.K. deal that raised trade-in prices to heights I haven’t seen before for old handsets, some of which are essentially defunct (including the embattled Pixel 6a). Here is a selection of Google U.K.’s trade-in prices three weeks ago.\n- Google Pixel 7 Pro - £454 ($618.75)\n- Google Pixel 6 Pro - £415 ($565.60)\n- Google Pixel 5 - £377 ($513.81)\n- Apple iPhone 14 Pro Max - £657 ($895.42)\n- Apple iPhone 11 Pro Max - £447 ($609.21)\n- Samsung Galaxy S23 Ultra - £517 ($704.62)\n- Samsung Galaxy S10 Plus - £373 ($508.36)\nIn comparison, the company is now paying far less for the same phones. For example, Google values the Pixel 7 Pro at $145, the Apple iPhone 14 Pro Max at $355, and the Samsung Galaxy S23 Ultra at $224. Those Samsung and Apple handsets will likely net more on the secondary market.\nThe Google Pixel 8 Pro Is Still Worth Considering\nEven without a hefty trade-in discount, this is a solid deal for a phone that isn’t wildly different to its successor, the Pixel 9. AI tools like Magic Editor, Best Take, and Video Boost have made it over to last year’s Google phone. Formerly exclusive Pixel 9 features, such as the Pixel Weather app, have now migrated over to the Pixel 8. Only the updated hardware separates the two phones.\nThe Pixel 8 will likely disappear from the Google store after the Pixel 10 lands in August. This may be one of the last chances to buy the phone directly from Google, if that matters to you. Another distinct possibility is that Pixel 8 Pro prices crash (at other retailers) after it disappears from the Google Store and the Pixel 10 lands because of its age. Being two generations old used to matter pre-2024, but with five years of software updates and security patches left, the risk is reduced.\nUpdate July 22nd: Google has more discounts for Pixel buyers ahead of the now-confirmed Pixel 10 launch. The company has slashed the price of the entire Pixel 9 series in the U.K. before their successor lands next month.\n- Pixel 9 - £679 ($915.16), down £320 ($431.30)\n- Pixel 9 Pro / XL - £549 ($739.94), down £250 ($336.95)\n- Pixel 9 Pro Fold - £1,399 ($1,885.57), down £350 ($471.73)\n- Pixel 8a - £349 ($470.38), down £50 ($67.39)\nU.S.-based Pixel buyers aren’t so lucky. The Google store only has the Pixel 8 Pro, mentioned in the story above, on offer. That will change soon after the Pixel 10 launches, though. The U.K. discounts average out at 33%, which gives us a glimpse into the price drops American shoppers can expect for the Pixel 9 in the coming weeks. That price will slide further as the Pixel 10 takes centre stage.\nInterestingly, Google is also teasing new offers for the Pixel 10. If you sign up for Google’s marketing emails by September 4th, the company will send out a promotional code. There’s no detail on how much the code will discount the Pixel 10 by, or if it triggers a freebie, but it’s worth signing-up for if you plan to buy Google’s 2025 flagship. Read more about Google’s Pixel 10 offer here."
    },
    {
      "url": "https://www.forbes.com/sites/jaymcgregor/2025/08/11/samsung-gives-google-ai-one-pro-to-galaxy-s25-galaxy-z-fold-users/",
      "text": "Google gifted Pixel 9 users with a free year-long subscription to its newly enhanced AI One Pro last month. With the launch of the Fold 7, Samsung made a similar free offer that flew under the radar.\nThis story was updated on August 11th with a new deal Samsung is emailing out to select users.\nGalaxy S25, S25 Plus, Galaxy S25 Ultra, Galaxy Z Fold 7 and Z Flip 7 users qualify for six months of Google AI One Pro, which typically costs $19.99 per month. AI One Pro is essentially Google’s rebranded AI Premium subscription tier, which includes access to Gemini 2.5 Pro, filmmaking tool Flow, Gemini in Workspace apps and 2TB of storage, alongside other AI tools.\nTo redeem the offer, download and sign into the Google One app. You should then be presented with the offer. As I was already a subscriber, Google gave me a six-month payment break until February 2026 and a small refund on what I paid for that month. Just don’t forget to put a note in your calendar to cancel it if you don’t want to pay for the service after the offer ends.\nIn Samsung’s efforts to position the Fold 7 and Flip 7 as the multi-tasking phones, Galaxy foldable phone users are also treated to a selection of other free subscriptions.\n- Two months free of Adobe Lightroom\n- 50% off LumaFusion video editing\n- 30% off Arcsite\n- 30% off Noteshelf\nThis isn’t the company’s first rodeo. Last month it also gifted a 12 month subscription to Perplexity AI Pro to millions of Galaxy phone and tablet users. Read about how to redeem that offer here.\nDon’t Pay For Samsung Or Google’s AI, It’s Free Everywhere\nSamsung and Google have made repeated free AI offers to users of their respective phones. Google bundled Gemini Advanced with the Pixel 9 series when it launched last year, and then extended that offer after rebranding to Google AI One Pro (alongside adding new video generation features).\nSamsung, too, recently gave away a free year’s subscription to Perplexity AI Pro (worth $200), another generative AI chatbot, to Galaxy phone and tablet users in the U.S.\nThe Korean company has also kept its Galaxy AI suite of tools free for the time being. Samsung has repeatedly said that the toolset is free until “the end of 2025,” and refused to elaborate further. I quizzed the company about this at the recent Galaxy Z Fold 7 press briefing, but got no firm answer on pricing plans. I suspect Samsung is waiting to see how popular Galaxy AI is, and to see if people actually use it regularly, before charging.\nI imagine Apple’s troubles with launching its own personalised Siri, which was promised and then delayed to some criticism, is part of Samsung’s (and Google’s) thinking. If their chief smartphone rival is getting some flak for failing to deliver promised AI features, then making your own product free makes it more enticing. Google’s new Pixel 10 ad suggests that is very much the company’s strategy.\nUpdate August 11th: These freebies are only available to Galaxy Z Fold 7, Flip 7 and Galaxy S25 owners. So if you’re looking to claim the free Google One AI Pro subscription via one of these devices, Samsung has just released a new double offer for the Flip 7.\nSamsung has boosted trade-in prices by £150 ($201) if the code “FLIPSIDE” is used at checkout and a device is traded-in. There’s also a second bespoke 15-digit code that has been sent out to registered Samsung users, which knocks an additional £100 off ($134) the 512GB storage option.\nI suspect the second offer was triggered because I’d left the Flip 7 in my basket a few days ago when I was searching for deals. There’s no guarantee this will work for you, but it’s a common sales tactic from online retailers. Give it a go and let me know if works for you. Just make sure you’re signed up to Samsung’s marketing emails.\nIf you’re buying through the Samsung Shop app, don’t forget to use the code “APP5” which knocks 5% off the total cost, and doubles up with the bespoke voucher the Korean company is emailing out. Combined, they discounted the Flip 7 by £152 ($203) for me."
    }
  ],
  "argos_summary": "Google has announced an exclusive offer for new email subscribers that will provide a discount code for the Pixel 10 series, but the amount varies widely—from $100 to $200 in the US, €20 in France, £20 in the UK—suggesting the offer may be country‑specific or randomly distributed. The promotion is limited to one device and expires September 4 2025, and Google has previously used similar tactics for Pixel 9, Google One, and other products. While some users report receiving no code at all, the company’s pattern of staggered discounts and trade‑in deals indicates the offer is part of a broader strategy to drive pre‑orders and maintain price pressure ahead of the Pixel 10 launch.",
  "argos_id": "U7EUJKGRB"
}