{
  "url": "https://www.pymnts.com/news/artificial-intelligence/2025/nasa-and-google-test-ai-space-doctor/",
  "authorsByline": "PYMNTS",
  "articleId": "3910e18e28d14bd391f6b8ce941cf158",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/AI-Space-Doc-Weekender.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T08:00:44+00:00",
  "addDate": "2025-08-23T08:06:17.704964+00:00",
  "refreshDate": "2025-08-23T08:06:17.704966+00:00",
  "score": 1.0,
  "title": "NASA and Google Test AI ‘Space Doctor’",
  "description": "Star Trek’s fictional Dr. “Bones” McCoy may have had a tricorder, but NASA astronauts could soon have something almost as futuristic and real: An",
  "content": "Star Trek’s fictional Dr. “Bones” McCoy may have had a tricorder, but NASA astronauts could soon have something almost as futuristic and real: An artificial intelligence (AI)-powered medical assistant that can diagnose and help treat illnesses millions of miles from Earth.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nGoogle and NASA are testing the “Crew Medical Officer Digital Assistant,” an AI-powered system to help astronauts with their healthcare needs during extended space missions to the moon, Mars or even farther out, according to a Aug. 7 Google blog post. Such long-range missions can experience a lag in communications with those on Earth.\n\n“Currently, low Earth orbit missions such as those to the International Space Station have frequent and relatively robust connectivity to allow for close collaboration with ground-based support teams,” David Cruley, customer engineer of Google Cloud Platform, told PYMNTS. “However, as distance from the Earth increases, so will latency and communication gaps.”\n\nThe communication lag can be as long as 22 minutes one-way on a mission to Mars, according to an April report from NASA, “Assessment of the State of Communication Delay Research in Preparation for Missions Beyond Low Earth Orbit.” Missions to the moon can experience latencies of three to 14 seconds one-way, but Mars missions can have up to a 22-minute one-way delay or 44 minutes round-trip.\n\nSince every second counts in a medical emergency, the AI doctor steps into the gap while the crew waits for connectivity to catch up.\n\nWhile there will be a human medical officer on board the spacecraft, Cruley said more information and support might be needed in diagnosing medical issues, especially for longer-range space missions. Moreover, if the medical officer is the one with the health problem, the rest of the crew would need help from the AI-powered doctor.\n\nThis development comes at a time when NASA is preparing for a new stage of space missions, starting with the Artemis campaign to set up its first long-term presence on the moon. The space agency said on its website that an exploration of the moon will yield scientific discovery, technology advancement and lessons on living and working “on another world as we prepare for human missions to Mars.”\n\nGoogle and NASA said on the Google post they are currently in the initial phases of testing the AI space doctor. It has undergone preliminary trials in which a panel consisting of doctors and an astronaut evaluated its performance in simulated medical scenarios, Cruley told PYMNTS.\n\n“The next step is to continue testing the model with medical doctors to enhance its accuracy and reliability,” he added.\n\nThe AI doctor is trained on spaceflight data and uses natural language processing and machine learning to give astronauts timely, data-driven guidance for managing medical issues during missions.\n\nThe model’s performance is measured using what’s called the Objective Structured Clinical Examination, according to Google. This exam is used to assess the skills of medical students and professionals, according to the National Institutes of Health.\n\nInitial results show the AI could deliver “reliable” diagnoses based on reported symptoms, according to Google. The company and NASA are now working with medical experts to refine the system’s accuracy and decision-making.\n\nCruley says there’s no launch date yet for the AI space doctor. But while the project’s primary mission is to support astronauts, its potential reach is much broader.\n\n“The idea of an AI Digital Health Assistant is portable to Earth-based applications,” Cruley said. “Lessons learned could be applied to providing quality medical care in remote or underserved areas with limited access to healthcare professionals.”",
  "medium": "Article",
  "links": [
    "https://cloud.google.com/blog/topics/public-sector/how-google-and-nasa-are-testing-ai-for-medical-care-in-space",
    "https://pmc.ncbi.nlm.nih.gov/articles/PMC3191703/",
    "https://www.linkedin.com/in/david-cruley-b875874/",
    "https://www.nasa.gov/humans-in-space/artemis/",
    "https://ntrs.nasa.gov/api/citations/20250003885/downloads/NASA%20TM20250003885.pdf?utm_source=chatgpt.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "medical doctors",
      "weight": 0.093930386
    },
    {
      "name": "space missions",
      "weight": 0.08561914
    },
    {
      "name": "medical issues",
      "weight": 0.08213857
    },
    {
      "name": "extended space missions",
      "weight": 0.08211236
    },
    {
      "name": "medical students",
      "weight": 0.08043025
    },
    {
      "name": "medical experts",
      "weight": 0.08025972
    },
    {
      "name": "Mars missions",
      "weight": 0.08001944
    },
    {
      "name": "quality medical care",
      "weight": 0.07847444
    },
    {
      "name": "NASA astronauts",
      "weight": 0.078216344
    },
    {
      "name": "simulated medical scenarios",
      "weight": 0.07745332
    }
  ],
  "topics": [
    {
      "name": "Space"
    },
    {
      "name": "AI"
    },
    {
      "name": "NASA"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.8857421875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.66015625
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.424072265625
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Space Technology",
      "score": 0.31787109375
    }
  ],
  "sentiment": {
    "positive": 0.138872,
    "negative": 0.33574948,
    "neutral": 0.5253785
  },
  "summary": "Google and NASA are testing the “Crew Medical Officer Digital Assistant” for astronauts on extended space missions to the moon, Mars or further. The system uses artificial intelligence (AI) to diagnose and treat illnesses millions of miles from Earth. This could help during long-distance missions that can experience a lag in communications with those on Earth. The AI doctor is trained on spaceflight data and uses natural language processing and machine learning to provide timely data-driven guidance for managing medical issues during missions. Initial results indicate that the AI could deliver reliable diagnoses based on reported symptoms. However, there is no launch date yet for the AI space doctor.",
  "shortSummary": "Google and NASA are testing an AI-powered medical assistant for astronauts, addressing communication delays and medical emergencies during long-range missions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a659c293b9c94069917afad4d9edf047",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://cloud.google.com/blog/topics/public-sector/how-google-and-nasa-are-testing-ai-for-medical-care-in-space",
      "text": "How Google and NASA are testing AI for medical care in space\nJim Kelly\nVice President, Federal Sales - Public Sector\nAs NASA embarks on a new era of human spaceflight, beginning with the Artemis campaign's aim to return to the Moon, preparations are underway to ensure crew health and wellness. This includes exploring whether remote care capabilities can deliver detailed diagnoses and treatment options if a physician is not onboard or if real-time communication with Earth is limited. Supporting crew health through space-based medical care is becoming increasingly important as NASA missions venture deeper into space.\nTo address this challenge, Google and NASA collaborated on an innovative proof-of-concept for an automated Clinical Decision Support System (CDSS) known as the \"Crew Medical Officer Digital Assistant\" (CMO-DA). Designed to assist astronauts with medical help during extended space missions, this multi-modal interface leverages AI. The goal is to potentially support human exploration of the Moon, Mars, and beyond.\nThe CMO-DA tool could help astronauts autonomously diagnose and treat symptoms when crews are not in direct contact with Earth-based medical experts. Trained on spaceflight literature, the AI system uses cutting-edge natural language processing and machine learning techniques to safely provide real-time analyses of crew health and performance. The tool is designed to support a designated crew medical officer or flight surgeon in maintaining crew health and making medical decisions driven by data and predictive analytics.\nInitial trials tested CMO-DA on a wide range of medical scenarios. Outputs were measured using the Objective Structured Clinical Examination framework, a tool used to evaluate the clinical skills of medical students and working healthcare professionals. Early results showed promise for reliable diagnoses based on reported symptoms. Google and NASA are now collaborating with medical doctors to test and refine the model, aiming to enhance autonomous crew health and performance during future space exploration missions.\nThis innovative system isn't just about supporting space exploration; it's about pushing the boundaries of what's possible with AI to provide essential care in the most remote and demanding environments. This tool represents an important milestone for AI assisted medical care and our continued exploration of the cosmos. It holds potential for advancing space missions and could also benefit people here on Earth by providing early access to quality medical care in remote areas.\nAt Google Public Sector, we’re passionate about supporting your mission. Learn more about how Google’s AI solutions can empower your agency and register to attend our Google Public Sector Summit taking place October 29, 2025, in Washington, D.C. There, you will have an opportunity to hear from public sector leaders and industry experts, and get hands-on with Google’s latest AI technologies."
    },
    {
      "url": "https://www.nasa.gov/humans-in-space/artemis/",
      "text": "The Moon is a 4.5-billion-year-old time capsule\nArtemis\nWith NASA’s Artemis campaign, we are exploring the Moon for scientific discovery, technology advancement, and to learn how to live and work on another world as we prepare for human missions to Mars. We will collaborate with commercial and international partners and establish the first long-term presence on the Moon.\nThe Latest on Artemis\nRead Updates at the Artemis BlogLearn More about Artemis Missions\nArtemis\nWhy We Are Going To The Moon\nWe’re going back to the Moon for scientific discovery, economic benefits, and inspiration for a new generation of explorers: the Artemis Generation. While maintaining American leadership in exploration, we will build a global alliance and explore deep space for the benefit of all.\nLearn More About the Moon about Why We Are Going To The MoonOur success will change the world.\nWhat more can we learn at the Moon?\nThe Moon is a treasure trove of science.\nEarth’s Moon is a 4.5-billion-year-old time capsule, pristinely preserved by the cold vacuum of space. The lunar samples returned during the Apollo Program dramatically changed our view of the solar system, and scientists continue to unlock new secrets from those samples. Yet, we are just scratching the surface of knowledge about the Moon. Future samples from Artemis missions will continue to advance our knowledge of the history and formation of our solar system including Earth and the Moon.\nHow much water is on the Moon, and why is that important for future exploration?\nWater is a critical resource for long-term exploration.\nPermanently shadowed regions of the Moon, including craters at the South Pole, are rich in frozen water. Finding it on the Moon, extracting it, and converting it means water for drinking, oxygen for breathing, and rocket fuel to power missions farther into the solar system. Finding and using resources in space makes exploration more affordable when we do not have to send everything from Earth. This is also important to help NASA get ready for our next giant leap – human exploration of Mars.\nHow can we grow a lunar economy?\nFor the Artemis missions, American innovation is leading the way, and the future at the Moon holds promise for a robust lunar marketplace.\nNASA’s strategy stimulates the commercial space industry, which drives new ideas, brings down costs, and grows the business opportunities that can foster a lunar economy and serve other customers for the benefit of humanity.\nHow We Explore the Moon\nTogether, the Orion spacecraft, SLS rocket, Gateway, human landing systems, and advanced spacesuits represent the core of NASA’s infrastructure for long-term human exploration at the Moon.\nGetting to the Moon\nLearn about the rockets and spacecraft that carry astronauts to the Moon.\nOn the Lunar Surface\nLearn about systems enabling humans to live and work on the surface of the Moon.\nCommercial Lunar Payload Services\nNASA is supporting the creation of a lunar economy through commercial deliveries of NASA science that will help prepare for the next generation of explorers.\nLearn MoreArtemis Accords\nWe go together.\nThe Artemis Accords are grounded in the Outer Space Treaty of 1967, outlining the vision and principles for a safe, transparent environment that facilitates exploration, science, and commercial activities for all of humanity to enjoy. To date, 56 countries have joined the accords and are committed to establishing a peaceful, prosperous future in space. More countries will sign the Artemis Accords in the months and years ahead to ensure the entire world can benefit from our journey of exploration and discovery.\nMore About the Artemis Accords about Artemis AccordsAll that we build, all that we study, all that we do, prepares us to go.\nJoin Artemis\nMake, launch, teach, compete and learn. Find your favorite way to be part of the Artemis mission.\nLearn MoreArtemis\nDecorate Your Work 'Space' with Artemis\nRelive the awe-inspiring moments of Artemis I and glimpse the bright future that lies ahead as the Artemis campaign enables humans to live and work on the Moon.\nLearn MoreBeyond the Moon\nHumans to Mars\nLike the Moon, Mars is a rich destination for scientific discovery and a driver of technologies that will enable humans to travel and explore far from Earth.\nMars remains our horizon goal for human exploration because it is one of the only other places we know where life may have existed in the solar system. What we learn about the Red Planet will tell us more about our Earth’s past and future, and may help answer whether life exists beyond our home planet.\nLearn More about Humans to Mars"
    }
  ],
  "argos_summary": "NASA and Google are testing an AI-powered medical assistant, the Crew Medical Officer Digital Assistant, to help astronauts diagnose and treat health issues during long‑range missions where communication delays can reach up to 22 minutes. The system, trained on spaceflight data and evaluated with the Objective Structured Clinical Examination, has shown reliable diagnostic performance in simulated scenarios and will be refined with medical experts. While a human medical officer will still be aboard, the AI can provide real‑time guidance when the crew must act before ground support arrives. The technology also has potential Earth‑based applications, such as delivering quality care in remote or underserved areas. The project is part of NASA’s Artemis campaign to establish a long‑term lunar presence and prepare for future Mars missions.",
  "argos_id": "UHTZ6GGR3"
}