{
  "url": "https://www.businessinsider.com/review-is-gordon-ramsay-pub-grill-worth-it-for-couple-2025-8",
  "authorsByline": "Erin McDowell",
  "articleId": "c7df9c10dd8e4d7c9f4c090835cc89c2",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68a78740194a2d49b8aef7ea?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:20:02+00:00",
  "addDate": "2025-08-23T13:25:47.390706+00:00",
  "refreshDate": "2025-08-23T13:25:47.390707+00:00",
  "score": 1.0,
  "title": "I spent $160 on dinner for 2 at Gordon Ramsay Pub & Grill. It was a great value, but I'd skip the burger next time.",
  "description": "The British-themed atmosphere at Gordon Ramsay Pub & Grill in Atlantic City was fun, and the appetizers blew us away.",
  "content": "I grew up in the United Kingdom, so I know my way around a classic British pub.When I learned that Gordon Ramsay has his own pub in the heart of Atlantic City, New Jersey, I'll admit I was a bit skeptical about how authentic the experience could be.Could it truly capture the smell of cheap beer, rustic interiors, and classic pub grub I'm used to?Still, I was eager to see for myself on a recent girls' trip.Gordon Ramsay Pub & Grill has two locations, one in Las Vegas and one in Atlantic City. With a big celebrity name and reputation as one of Britain's most famous chef exports, we had high expectations leading up to our meal.We left feeling satisfied and downright charmed by the British-themed atmosphere and jolly-good appetizers, but I left royally disappointed in my burger entrée.Here's what our experience was like dining at Gordon Ramsay Pub & Grill in Atlantic City.",
  "medium": "Article",
  "links": [
    "https://www.businessinsider.com/review-gordon-ramsay-steak-compared-with-historic-steakhouse-value-2025-7",
    "https://www.businessinsider.com/british-phrases-slang-confusing-2021-6",
    "https://www.businessinsider.com/gordon-ramsay-steak-las-vegas-review-worth-it-2025-1",
    "https://www.businessinsider.com/review-same-meal-applebees-tgi-fridays-and-chilis-2025-1"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gordon Ramsay Pub",
      "weight": 0.12247926
    },
    {
      "name": "Gordon Ramsay",
      "weight": 0.11278747
    },
    {
      "name": "classic pub grub",
      "weight": 0.109287724
    },
    {
      "name": "Atlantic City",
      "weight": 0.09734872
    },
    {
      "name": "Gordon Ramsay Pub & Grill",
      "weight": 0.08110908
    },
    {
      "name": "rustic interiors",
      "weight": 0.07740062
    },
    {
      "name": "cheap beer",
      "weight": 0.07725071
    },
    {
      "name": "high expectations",
      "weight": 0.074675456
    },
    {
      "name": "Grill",
      "weight": 0.072529875
    },
    {
      "name": "New Jersey",
      "weight": 0.07205581
    }
  ],
  "topics": [
    {
      "name": "Reviews"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.92919921875
    },
    {
      "name": "/Food & Drink/Restaurants/Restaurant Reviews & Reservations",
      "score": 0.87060546875
    },
    {
      "name": "/Food & Drink/Cooking & Recipes/Cuisines",
      "score": 0.62548828125
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Bars, Clubs & Nightlife",
      "score": 0.39453125
    },
    {
      "name": "/Reference/Geographic Reference/Other",
      "score": 0.387939453125
    },
    {
      "name": "/Food & Drink/Restaurants/Fine Dining",
      "score": 0.359130859375
    }
  ],
  "sentiment": {
    "positive": 0.4333369,
    "negative": 0.18592142,
    "neutral": 0.38074163
  },
  "summary": "The article discusses the controversy surrounding Gordon Ramsay's pub, where he has two locations in North Carolina, North Carolina. The article also mentions the cost of the restaurant, which was reviewed by the author. The restaurant is described as \"cheating,\" but the reviewer found it more pleasant than anything else. The food is served up for dinner at the restaurant by the restaurant.",
  "shortSummary": "Gordon Ramsay's Gordon Ramsay Pub & Grill in Atlantic City offers a welcoming, authentic British atmosphere with its British-themed menu, but disappointing burger experience.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ebc2598ffb4243279092053961fbda8a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.businessinsider.com/gordon-ramsay-steak-las-vegas-review-worth-it-2025-1",
      "text": "- I had dinner at Gordon Ramsay Steak, located inside the Paris Las Vegas Hotel and Casino.\n- The wagyu filet was cooked perfectly, and the mac and cheese was full of flavor.\n- I'd definitely recommend dining at the Gordon Ramsay restaurant for great food and an upscale vibe.\nAs someone who has been living in Las Vegas for almost 20 years, I'm always asked about the best places to eat.\nRecently though, I decided to take a chance on a restaurant I'd never been to — Gordon Ramsay Steak at the Paris Las Vegas Hotel and Casino.\nThe steakhouse chain, which now has six locations in cities like Baltimore, Vancouver, and Kansas City, first opened in Las Vegas in 2012. Here's what our experience at the celebrity-chef-owned restaurant was like.\nI visited the restaurant on a Thursday evening.\nAfter making a reservation on the restaurant's website, I visited Gordon Ramsay Steak for dinner on a Thursday.\nOnce I arrived, I was seated almost immediately. As I walked through the red, neon tunnel into the restaurant, the hostess explained that the entrance was meant to be an artistic representation of the Channel Tunnel connecting England to France.\nThe restaurant's interior was trendy and elegant.\nThe steakhouse is laid out in a two-story tiered design. My table was on the second floor and had an amazing view of the rest of the restaurant, including the iconic Union Jack flag painted on the ceiling and a neon-red chandelier.\nI later learned the red lighting fixture was designed to represent Chef Ramsay's hands as he cooks.\nI started with the warm breads and spreads.\nAlthough all the starters sounded incredible, I decided to try the warm breads and spreads ($17). The dish came with a baguette, a triangle of crunchy lavash bread, and a fluffy roll that was half honey whole wheat and half French onion.\nIt also came with chimichurri oil, English butter, and another butter made with beef fat and red wine. Both butters were topped with Hawaiian lava salts.\nI loved the variety of breads and tried them all with each spread. The baguette, however, was my favorite.\nFor my entrée, I ordered the wagyu filet, which was cooked perfectly.\nEverything on the menu sounded delicious, but there was no way I was going to a steakhouse and ordering anything but a steak. So, I opted for the wagyu filet.\nThe presentation was beautiful, with a swirl of red-wine reduction and a pyramid of mustard seeds on the plate.\nThe filet was seared perfectly on the outside and was cooked to a buttery-soft rare temperature on the inside. In my opinion, the 8-ounce filet was well worth the hefty $105 price tag.\nThe mac and cheese made a delicious side.\nAlong with my steak, I ordered the mac and cheese, which the waitress said was the most popular side.\nThe description on the menu sounded delicious, and it also felt like the most robust choice, since all the sides were $19 each.\nThe amount of flavor in the dish blew me away. Mac and cheese is usually on the heavier side, but it was surprisingly light despite having bacon, smoked jalapeño cream, onion jam, smoked Gouda, and white cheddar packed in with the noodles.\nThe bacon added texture to the dish, and the jalapeño cream and onion jam added bursts of flavor. The breadcrumbs on top gave it just the right amount of crunch, making the dish immensely satisfying.\nI would highly recommend dining at Gordon Ramsay Steak.\nFrom start to finish, my experience at Gordon Ramsay Steak was top-notch. The staff was friendly, attentive, and knowledgeable about the menu and the restaurant.\nI would definitely go again, if for no other reason than to make sure I save room for the delicious-looking sticky toffee pudding for dessert.\nIn my opinion, Gordon Ramsay Steak is the perfect choice if you're looking for an upscale restaurant with a trendy edge."
    },
    {
      "url": "https://www.businessinsider.com/review-same-meal-applebees-tgi-fridays-and-chilis-2025-1",
      "text": "- I compared the same meal at Applebee's, TGI Fridays, and Chili's.\n- I ordered Buffalo bone-in wings and a classic cheeseburger at each chain.\n- Applebee's impressed me with its juicy burger but I thought Chili's served the best overall value.\nIn the casual-dining \"value wars,\" Applebee's, TGI Fridays, and Chili's are three of the biggest competitors.\nTo determine which of these chains should be crowned the winner, I ordered the same meal — a drink, an order of Buffalo wings, and a classic cheeseburger — at all three and compared them on taste and value.\nWhen it comes to performance, Applebee's, TGI Fridays, and Chili's are faring differently.\nTGI Fridays filed for Chapter 11 bankruptcy in November and Reuters reported the chain is facing $37 million in debt. In November, Applebee's also reported a 5.9% decline in same-restaurant sales in the third quarter compared to the year before.\nChili's, meanwhile, has been gaining momentum. In January, the chain's parent company reported a 31% growth in same-restaurant sales from October 2023 to December 2024 and a nearly 20% increase in traffic year over year.\nIn a conversation with Business Insider, Chili's CMO George Felix said the chain's rise has been propelled by simplifying restaurant menus, changing the chain's approach to marketing and social media, and focusing on value, quality, and hospitality at restaurants.\n\"You're seeing a lot of competitors throwing different combo meals and meal deals out there at different price points. But I think what's really hard to replicate is we're delivering all of that, combined with a really excellent experience,\" Felix said.\nHere's how the same meal compared at Applebee's, TGI Fridays, and Chili's.\nI visited a locally owned TGI Fridays in Massachusetts.\nThis location is locally owned and operated, so it is not included in the larger company's bankruptcy filing.\nTGI Fridays Inc. owns 39 locations in the US, but there are 122 franchised locations in the US and 316 franchised international locations that are not included in the bankruptcy filing.\nI ordered a diet soda at all of the chains I visited.\nThe soda at TGI Fridays was roughly the same size as the drink from Chili's and Applebee's. It cost $3.29, plus tax.\nTGI Fridays also offered a cocktail menu, but it didn't seem as central to the brand as the margaritas for Chili's and Applebee's.\nChili's and Applebee's both advertised their drinks on prominently placed menus on the dining table, while TGI Fridays just had the regular cocktail section inside its standard menu.\nChili's and Applebee's also emphasized new, seasonal cocktails. Chili's offered a seasonal margarita of the month for $6, making the restaurants feel more playful.\nI ordered an eight count of Buffalo wings.\nThe wings at TGI Fridays didn't come in a house Buffalo sauce but rather were tossed in Frank's Red Hot Buffalo sauce.\nThe order of eight wings cost $12.19, plus tax, which was cheaper than the wings from Chili's and Applebee's. These wings also came with a side of sliced celery sticks.\nThese wings were large and the meat was extremely tender.\nI was given a selection of drumsticks and flats in the order. However, while these wings were perfectly meaty and crispy on the outside, the sauce didn't blow me away.\nThese wings tasted like standard Frank's Red Hot sauce, just like countless others I've had before, with nothing unique or exciting to set them apart.\nThe burger from TGI Fridays was just OK.\nThe cheeseburger includes all the classic toppings: tomato, lettuce, American cheese, red onion, and pickles.\nWhile there's no sauce on the burger by default, ketchup is available on every table, and you could easily ask for mustard or ketchup to be added if you prefer.\nThe burger was priced at $12.49, before tax.\nTGI Fridays is also offering a value meal deal that sells its classic cheeseburger with fries and a drink for $9.99, plus tax, which was the most affordable offer out of the three chains.\nI thought the TGI Fridays burger needed more sauce.\nThe bun was dry and untoasted, setting the tone for what turned out to be an overall burger experience that lacked a lot of flavor and moisture.\nAlthough I requested my burger medium, it leaned toward well-done and lacked juiciness. While I appreciated the flavor of the meat itself and the toppings tasted fresh, my praise for this burger ended there.\nI reminded myself that this is the chain's simplest burger, so perhaps it's only fair to expect a straightforward flavor profile without much pizzazz.\nMy second favorite meal came from Applebee's.\nI arrived at an Applebee's in Brooklyn on a busy weeknight with two other people and was seated promptly.\nI also expected to pay slightly more at this restaurant than at the Chili's and TGI Fridays restaurants I visited since they were both located in Massachusetts, not New York City. However, I found that the prices didn't differ greatly between the two states.\nI ordered a drink and nine classic bone-in Buffalo wings to start.\nAt my local Applebee's in Brooklyn, an order of nine classic bone-in wings costs $18.99, excluding tax and fees. They came with celery sticks and sides of ranch and blue cheese.\nI also ordered a diet soda. It cost $3.29, plus tax.\nThe wings were crispy and the largest out of the three chains.\nThe wings were tender and juicy, with the sauce delivering a rich, buttery flavor. The Buffalo sauce struck a great balance between its spicy kick and savory, buttery notes, creating a well-rounded flavor.\nThe Applebee's burger really impressed me.\nI ordered the burger as part of the chain's \"2 for $2X\" deal, which also allowed me to get an order of boneless wings and a chicken tender basket for about $30.\nHowever, the burger typically costs $16.99, excluding tax, at the location I visited in Brooklyn, New York.\nThe cheeseburger came with two slices of American cheese, lettuce, tomato, red onion, and pickles on a brioche bun.\nThe exterior of the burger patty was quite dark, which initially made me worry it had been overcooked past the medium level I requested.\nTo my surprise, the burger turned out to be incredibly juicy and leaned slightly toward medium-rare.\nThe melted, tangy cheese enveloped the entire burger, creating a perfectly balanced bite. The thick slices of red onion added a bold flavor, while the lettuce and tomato were fresh.\nAlthough this burger lacked a sauce, it remained far from dry, thanks to the melted cheese and a buttery bun.\nDespite having similar ingredients to the TGI Fridays burger, this one tasted juicier and more flavorful.\nMy favorite meal in terms of taste and value came from Chili's.\nI visited a Chili's in Massachusetts, but I've also been to the location in Queens, New York, before.\nChili's has always impressed me with its portion sizes, value-focused meals, and its famous Triple Dipper, which the company said is popular among younger customers. CNN reported in October that it accounts for 11% of Chili's sales.\nLike at the other two chains, I got a diet soda.\nIt cost $3.29, plus tax.\nI got an order of eight Buffalo wings to start.\nChili's offers boneless and bone-in wings in several flavors, including honey chipotle, barbecue, and Nashville hot.\nThe order of eight wings cost $14.99, plus tax.\nThe wings were coated in buttery Buffalo sauce.\nThe wings came in a selection of drumsticks and flats. Though they were a little on the smaller side compared to the wings from Applebee's, they were piping hot when I picked them up and fried to a golden crisp.\nThey also packed much more flavor than the other wings I tried, and the chicken meat inside was moist and juicy.\nThe wings paired well with the chain's signature ranch and decadent blue cheese dressing.\nI also ordered a classic cheeseburger.\nThe Oldtimer burger, which I ordered with cheddar cheese, comes topped with pickles, lettuce, sliced tomato, diced red onions, and mustard.\nIt cost $13.29, plus tax, and was the largest burger I tried when it came to overall size.\nI also could have ordered this burger as part of the chain's \"3 For Me\" menu and gotten an appetizer, the burger with fries, and a non-alcoholic drink, for $10.99, plus tax. This made me feel like Chili's was really serving up value.\nThe cheddar cheese was perfectly melted, and the other ingredients tasted extremely fresh.\nThe only downside was the generous serving of mustard smeared onto the burger patty. The mustard had a strong, sharp flavor, and while I do like mustard, it was a bit overpowering for me.\nBut the rest of the burger was impressive. The char on the slightly smashed patty was wonderfully crispy, and the other ingredients were incredibly fresh. The red onion added a nice punch of flavor, while the bun held everything together perfectly.\nOverall, I liked my experience and meal at Chili's the most.\nThe food tasted high-quality, and I enjoyed the vibe and more youthful, playful atmosphere of both the restaurant and the menu.\nThe overall cost of the meal was pretty similar across all three chains, though, as I had expected, the Applebee's in New York was slightly more expensive than the two restaurants I visited in Massachusetts.\nEven though the meal from Chili's wasn't the cheapest — the meal from TGI Fridays cost less — I thought it provided the best value when I considered the experience and taste of the food.\n\"I think a lot of brands mistake the lowest price point for being [the best] value, and I don't think that's giving consumers enough credit,\" Chili's CMO George Felix told Business Insider. \"So for us, we believe value is the entire holistic experience of what you pay for what you get.\"\nUltimately, when it came to the most flavorful meal with the highest-quality-tasting ingredients, Chili's was the winner for me."
    },
    {
      "url": "https://www.businessinsider.com/british-phrases-slang-confusing-2021-6",
      "text": "- From \"chockablock\" to a \"full Monty,\" the Brits have a wide range of interesting slang words.\n- You don't want to be described as \"dim,\" \"a mug,\" or \"a few sandwiches short of a picnic.\"\n- If you're \"zonked\" or \"cream crackered,\" you might want to take a nap.\nAmericans might want to mind the gap when it comes to discerning what these British phrases actually mean.\nSome terms, like \"dim,\" \"a mug,\" or \"a few sandwiches short of a picnic,\" can be used as colorful insults, while some British slang words like \"cheeky\" can be either negative or positive, depending on the context.\nIn a business setting, you might want to avoid certain words or phrases while conversing with Brits so as not to offend them, or incorporate their terms into your presentations or marketing materials if you want to relate with British clients or customers.\nHere are 60 British phrases that will confuse anybody who didn't grow up in the UK.\nA few sandwiches short of a picnic\n\"A few sandwiches short of a picnic\" means someone who lacks common sense. The phrase was first documented in the BBC's \"Lenny Henry Christmas Special\" in 1987.\n\"She's great fun, but she's a few sandwiches short of a picnic.\"\nAnorak\n\"Anorak\" refers to someone who's a little bit geeky, with strong interests or expertise in a niche area.\nAlthough it's more often used as a synonym for raincoat, an anorak is something slightly different in playground slang. This word probably originates from the \"uncool\" appearance of anorak coats and the people wearing them.\n\"Thomas is such an anorak when it comes to train trivia.\"\nBagsy\n\"Bagsy\" is the British equivalent of calling \"shotgun\" or \"dibs\" when something, like the front seat of the car or food, is offered up to a group. School kids might call \"bagsy\" on items in their friends' pack lunches, like an apple or a cereal bar, that the friend isn't going to eat.\n\"Does anyone want thi—\"\n\"Bagsy!\"\nBee's knees\n\"Bee's knees\" refers to something at the \"height of cool.\" This phrase became mainstream in the USA in the 1920s despite its British origins, but its popularity has dwindled since the turn of the century.\nWhen first documented in the 18th century, the \"bee's knees\" referred to small or insignificant details. Since then, the phrase has evolved and now refers to something popular or cool.\n\"The Beatles are the bee's knees.\"\nBender\nA \"bender\" is an extended period of drinking, usually in excess. Someone on a spree of excessive drinking and mischief is \"on a bender.\" Benders can last over 24 hours, and so you might say that someone is on \"a weekend bender,\" or a \"three-day bender.\"\n\"I bumped into him towards the end of his four-day bender. He was a wreck.\"\nBird\nA \"bird\" is an informal word for a girl or young woman.\nWhile the phrase can be interpreted as misogynistic, it's still commonly used. It's usually used to describe a woman between the ages of 18 and 50, particularly one who is attractive.\n\"Look at that bird over there. She's fit.\"\nPull a blinder\nTo \"pull a blinder\" involves achieving something difficult faultlessly and skillfully. The phrase is most commonly used when the individual has been lucky and the person saying it is in disbelief that the first person has managed to pull it off.\n\"And did you see that equalizing goal in the last minute of injury time? He pulled a blinder there.\"\nBloody\n\"Bloody\" or \"bleeding\" is used to add emphasis to adjectives, similar to how \"wicked\" is used in New England. The origins of the word are widely disputed. Some believe it's derived from the Dutch word \"blute,\" meaning \"bare.\" Others believe the word is a contraction of the 17th-century phrase \"by our lady,\" and is blasphemous.\nThis second theory has been disproved, however, by the slang's first documentation predating the widespread use of the phrase \"by our lady.\"\nNowadays, \"bloody\" is used widely — it's even used in children's films such as \"Harry Potter\" — and is arguably one of the most quintessentially British words on the list.\n\"That was bloody good.\"\nBob's your uncle\n\"Bob's your uncle\" is the very British equivalent to \"hey presto!\" or \"et voilá!\" This phrase is often used to describe a process that seems more difficult than it actually is.\n\"Press down the clutch, put it into gear, then slowly ease off the clutch again. Bob's your uncle — you're driving!\"\nBog-standard\nSomething that is \"bog-standard\" is completely ordinary with no frills, embellishments, or add-ons. Its origins are somewhat unclear, but a \"bog\" is another word for a toilet in British slang, adding to the connotations that something \"bog-standard\" is unglamorous and unspecial.\n\"How was the hostel?\" \"Oh, nothing exciting to report. Just your bog-standard dorm, really.\"\nBoot\nThe \"boot\" of a car is the trunk in American English. A popular pastime in the United Kingdom is attending or having your own \"car boot sale,\" in which people usually sell knickknacks and old personal items out of the back of their cars.\n\"Shove the shopping in the boot.\"\nBotch job\nA \"botch job\" is a repair job that's been completed in a hurry and will probably fall apart reasonably soon. A \"botch job\" can also refer to anything that's been done haphazardly, like a work assignment.\n\"Sam did a botch job on these shelves — they're wonky!\"\nBrolly\nA \"brolly\" is a shortened word for an umbrella. On a rainy day in London, you would definitely want a brolly on hand.\n\"Grab your brolly, it's drizzling outside.\"\nBudge up\n\"Budge up\" is similar to \"scoot over\" or \"move over.\" An informal way of asking someone to make room where they are sitting for you to sit down, too, would be asking them to \"budge up.\"\n\"Hey, there's loads of room on that bench. Budge up and make some room for us, too!\"\nBuilder's tea\n\"Builder's tea\" is the name of a strongly brewed cup of English breakfast tea with milk and sugar.\nIt's common courtesy to offer a laborer or builder working on your house a builder's tea while they're working — especially if they're working out in the cold. This is probably how the term came about.\n\"A bacon sandwich and a builder's tea. Now that's a proper breakfast.\"\nButcher's hook\n\"Butcher's hook\" is Cockney rhyming slang for \"look.\" Therefore, if you're \"having a butchers,\" you're having a look at something.\n\"Would you take a butchers at this broken bike for me?\"\nCheeky\n\"Cheeky\" refers to an act that could be deemed impolite or shameless but, for some reason, comes across as funny or endearing to others. \"Being cheeky\" means being funny or humorous, but slightly mischievous at the same time.\n\"Joe's children are absolute rascals — they tied my shoelaces together last week!\"\n\"Those cheeky monkeys.\"\nChinwag\nA \"good old chinwag\" is a good chat, catch-up, or gossip with someone.\nThe action of chatting away — with the jaw bobbing up and down — resembles a chin \"wagging\" like a dog's tail.\n\"Those two are having a proper chinwag — I haven't been able to get a word in edgeways for half an hour!\"\nChockablock\n\"Chockablock\" could be used to describe something that's full to the brim or rammed. This is sometimes shortened to \"chocka.\" The phrase is most often used to describe heavy road traffic.\n\"We should've taken the other route. This road is chocka!\"\nChuffed\n\"Chuffed\" means overjoyed and full of pride. If you get a promotion or meet someone special, you might describe yourself as \"chuffed.\"\n\"I heard you got the promotion. Congratulations! You must be chuffed.\"\nCodswallop\n\"Codswallop\" means something untrue, often made up for dramatic effect.\nAlthough no one is completely sure of the word's origins, it could derive from the words \"cod\" and \"wallop,\" which historically meant \"imitation\" and \"beer\" respectively — implying that \"codswallop\" is the kind of rubbish you make up when drunk.\n\"Oh, what a load of codswallop!\"\nCream crackered\n\"Cream crackered\" is Cockney rhyming slang for \"knackered,\" or incredibly tired.\nThe term probably came about because it rhymes with \"knacker.\" A \"knacker\" was the person who slaughtered worn-out horses in the 19th and 20th centuries for their meat, hoofs, and hides. So, if you're \"ready for the knacker's yard,\" you're exhausted beyond relief.\n\"This week's done me in already, and it's only Tuesday. I'm cream crackered.\"\nDench\n\"Dench\" is an adjective used to advocate something that is impressive or agreeable. Dench is also the equivalent of \"solid\" or \"cool\" when used in response to someone else.\nIts reported creator, British rapper Lethal Bizzle, elusively told The Guardian that the word \"means anything you want.\"\n\"I'm going to make us spaghetti carbonara for dinner.\"\n\"Dench.\"\nDim\n\"Dim\" refers to someone who lacks common knowledge. On the other hand, someone who's intelligent might be described as \"bright.\"\n\"She's a bit dim.\"\nDoddle\nA \"doddle\" is an easy task. The word could be a variation of \"toddle\" — like a young child's first steps.\n\"This will be a doddle.\"\nDog's dinner\nA \"dog's dinner\" is a mess or fiasco. It is also sometimes referred to as a \"dog's breakfast.\"\n\"You've made a dog's dinner of that paint job.\"\nFaff\nTo \"faff\" or \"faff about\" is to waste time doing very little. \"Faff\" comes from the 17th-century word \"faffle,\" which means to flap about in the wind.\n\"What did you do on your day off from work?\"\n\"We were just faffing about.\"\nFit\n\"Fit\" is used to describe someone physically attractive, usually referring to their physique. If you see someone you find attractive, you would call them \"fit.\"\n\"He's fit.\"\nFlog\nTo \"flog\" means to sell something, usually quickly and cheaply.\n\"Flogging\" also refers to whipping a racehorse in order to make it move faster, so there is some speculation into whether you flog goods in order to make them shift faster, too. However, there is no proof for this theory.\n\"I'm trying to flog my old sofa. Do you know anyone who might be interested?\"\nFull Monty\nA \"full Monty\" refers to pursuing something to the absolute limits.\nAfter \"The Full Monty\" film was released in 1997, there was some international confusion over the phrase, which was taken as a euphemism for stripping. However, \"the full Monty\" now usually refers to taking something as far as it can go, similar to \"the whole nine yards.\"\n\"The full Monty\" historically refers to an old tailor called Sir Montague Burton. Going \"the full Monty\" meant purchasing a full three-piece suit, a shirt, and all of the trimmings.\n\"Our Christmas dinner had everything from sprouts to Yorkshire puddings. If you're going to have a roast, have the full Monty!\"\nFull of beans\n\"Full of beans\" can be used to describe someone who's energetic, lively, or enthusiastic. This phrase could be a reference to coffee beans, although these claims have been disputed.\n\"Goodness, you're full of beans this morning!\"\nGaff\n\"Gaff\" is an informal word for \"home.\" Although the origins of this phrase are largely unknown, a gaff in the 18th century was a music hall or theater, and so it's believed to derive from this.\n\"What are you up to this weekend? We've got a party at our gaff, if you fancy it?\"\nGeezer\nA \"geezer\" is a man who could be described as \"suave\" or \"dapper,\" and is often suited and booted. Men from east London are also commonly referred to as \"geezers,\" where the term is more interchangeable with \"lad.\"\nGeezer is thought to stem from the 15th century \"guiser,\" which meant well-dressed.\n\"That guy's got such swagger — he's a proper geezer.\"\nGutted\n\"Gutted\" means devastated or extremely upset. If your favorite football team were to lose, you'd be \"gutted.\"\n\"I was absolutely gutted.\"\nInnit\n\"Innit\" is an abbreviation of \"isn't it,\" most commonly used among teenagers and young people. This phrase is used to confirm or agree with something that another person has just said.\n\"It's really cold today.\"\n\"Innit.\"\nKip\nA \"kip\" is slang for a short sleep or nap. The term is usually used to refer to a nap, but it can also mean a long sleep.\n\"What a long day. When we get home, I'm going to take a quick kip.\"\nLeg it\n\"Leg it\" means to make a run for it, run away, or escape. It's used most commonly when you're trying to get out of a situation by physically running away.\n\"That's when all of the lights came on, and so we legged it.\"\nMiffed\n\"Miffed\" means slightly irritated or annoyed and possibly derives from the German \"muffen,\" meaning \"to sulk.\"\n\"I was a bit miffed, I can't lie.\"\nMint\n\"Mint\" might be used when referring to something of the highest caliber. It's derived from \"mint condition,\" which refers to something pre-owned that retains its pristine condition — although something that's just \"mint\" doesn't have to be pre-owned.\n\"Those shoes are mint!\"\nMortal\n\"Mortal\" describes someone highly intoxicated or drunk in a sloppy manner. Derived from the Newcastle sociolect, \"mortal\" became widely known across the country in 2011 by the reality TV show \"Geordie Shore.\"\n\"Did you see Scott last night? He was mortal.\"\nMug\nA \"mug\" is someone who has been made a fool of. \"Mug\" likely originated in London with Cockney slang. It means a stupid, often gullible, person who is easily taken advantage of.\n\"You signed that contract? You're such a mug.\"\nMug off\nIn the same vein, to \"mug off\" someone is to make a fool of them, usually by deceiving or cheating on them. The phrase is common on the hit British reality show \"Love Island.\"\n\"He's going on a date with Amber? I feel so mugged off right now.\"\n\"You're mugging me off.\"\nNick\nTo \"nick\" something means to steal it. \"The Nick\" can refer to a prison. The origins of the phrase are largely debated online, however, it's believed that \"to nick\" as in to steal influenced the slang term for prison, as being imprisoned is similar to being \"stolen\" away.\n\"Did you just nick that?\"\n\"Don't get caught, or you'll end up in the Nick!\"\nOn the pull\nSomeone who's \"on the pull\" has gone out, usually on a night out, with the intention of attracting a sexual partner. \"Pull\" can also be used as a verb. If you've \"pulled,\" you've kissed someone.\n\"You look nice. Are you going on the pull?\"\nPants\n\"Pants\" means something is rubbish, trash, or garbage. It's most often used to say something is unsatisfactory, like \"blows\" or \"reeks,\" rather than actual trash.\n\"That is pants.\"\nPea-souper\nA \"pea-souper\" is a thick fog, often with a yellow or black tinge, caused by air pollution. The idiom was first used to describe the thick, choking smog that settled over London as early as 1200 c.e., caused by many people burning fossil fuels in close proximity.\nThe smogs were compared to pea soup due to their color and density.\n\"Be careful when you're driving — it's a pea-souper out there.\"\nPop your clogs\nTo \"pop your clogs\" means to die. This cheery phrase is widely believed to originate from Northern factory workers during the Industrial Revolution. When they worked on the factory floor, employees had to wear hard clogs to protect their feet.\nThe idea is when someone popped or cocked their clogs, the toes of the clogs pointed up in the air as they lay down dead.\n\"Did you hear what happened to John's old man? He popped his clogs, didn't he...\"\nPoppycock\n\"Poppycock\" means something that is nonsense, rubbish, or simply untrue. This quintessentially British idiom does not refer to actual poppies. It derives from the Dutch \"pap\" and \"kak,\" which translate as \"soft\" and \"dung.\"\n\"What a load of poppycock!\"\nQuids in\n\"Quids in\" means investing in something, sometimes — but not always — financially. Someone who's \"quids in\" has invested in an opportunity that will probably benefit them massively.\n\"Quid\" is British slang for \"pounds.\" For example, \"five quid\" means £5.\n\"If it all works out as planned, he'll be quids in.\"\nShirty\n\"Shirty\" could be used to describe someone who is short-tempered or irritated. The meaning of this slang has been debated at length.\nThe word \"shirt\" is derived from the Norse for \"short,\" hence short-tempered. However, other people believe that \"shirty\" has connotations of being disheveled.\n\"Don't get shirty with me, mister.\"\nSkew-whiff\n\"Skew-whiff\" means askew. It means literally tilted on one side rather than slightly off or uneasy, as askew can mean in the US.\n\"Is it just me or is that painting a bit skew-whiff?\"\nSkive\nTo \"skive\" is to avoid work or school, often by pretending to be ill. \"Skive\" is derived from the French \"esquiver,\" meaning \"to slink away.\"\n\"He skived off school so we could all go to Thorpe Park on a weekday.\"\nSmarmy\n\"Smarmy\" is used to describe someone who comes across as scheming or untrustworthy.\nAlthough the adjective's origins remain largely unknown, early documented uses seem to use the word as synonymous with \"smear,\" further suggesting that someone who is \"smarmy\" is also \"slick\" or \"slippery.\"\n\"Don't trust him — he's a smarmy geezer.\"\nTake the biscuit\n\"Take the biscuit\" is used similarly to \"take the cake and is the equivalent of taking the nonexistent medal for foolishness or incredulity.\nIf someone has done something highly irritating or surprising in an exasperating fashion, you might say that they've \"taken the biscuit.\"\n\"I could just about deal with the dog barking at 5:30 a.m., but the lawnmower at 3 a.m. really takes the biscuit.\"\nTake the Mickey\nTo \"take the Mickey\" means to take liberties at the expense of others. It can be used in both a lighthearted and an irritated fashion.\n\"Take the Mickey\" is an abbreviation of \"taking the Mickey Bliss,\" which is Cockney rhyming slang for \"take the p***.\"\n\"Hey! Don't take the Mickey.\"\nWaffle\nTo \"waffle\" means to talk at length while not getting to the point. When someone makes a great speech while skirting around a subject or saying little of any value, you might say that they're talking \"waffle \" or \"waffling.\"\nIn the 17th century, to \"waff\" meant to yelp, and that quickly evolved to mean to talk foolishly or indecisively.\n\"I wish he'd stop waffling on.\"\n\"What a load of waffle!\"\nWally\nA \"wally\" is someone silly or incompetent. Although its origins are largely debated, the term's meaning has evolved over the last 50 years alone. In the 1960s, someone who was unfashionable might be nicknamed a \"wally,\" Dictionary.com reported.\n\"Don't put down a leaking mug on top of the newspaper, you wally!\"\nWhinge\nTo \"whinge\" means to moan, groan, and complain in an irritating or whiny fashion. It is often deemed as unnecessary or over-the-top.\n\"Quit whinging.\"\nWind your neck in\n\"Wind your neck in\" means to mind your own business. If you want to tell someone to not concern themselves with issues that don't directly affect them, you might tell them to \"wind their neck in.\"\nThis classic phrase is another way of telling someone that their opinion is not appreciated in the given scenario.\n\"Wind your neck in and stop being so nosy!\"\nZonked\n\"Zonked\" means exhausted or tired. It can also refer to someone already asleep or under the influence of drugs or alcohol.\n\"I was going to go out tonight, but when I finished work, I was absolutely zonked.\"\n\"When I got home, he was already zonked.\"\nAn earlier version of this story was written by Bobbie Edsor."
    },
    {
      "url": "https://www.businessinsider.com/review-gordon-ramsay-steak-compared-with-historic-steakhouse-value-2025-7",
      "text": "- I had dinner for two at Gordon Ramsay Steak and a 113-year-old steakhouse in Atlantic City.\n- The Knife and Fork Inn in Atlantic City offered a better experience and value.\n- I would go back to both, but would recommend the historic steakhouse over the celebrity-chef chain.\nI dined at Gordon Ramsay Steak and an iconic, century-old steakhouse in Atlantic City, and the contrast between them was as sharp as a steak knife.\nGordon Ramsay's celebrity-chef steak restaurant delivered on classic steakhouse favorites, from its wedge salad to the sleek, elevated decor you'd expect from a high-class steakhouse.\nBut once the bill arrived, I couldn't help but wonder if the experience was worth the steep price tag, especially when it came down to the steak I ordered.\nI also ate at the 113-year-old Knife and Fork Inn, which felt like stepping into a time capsule of old-school steakhouses, with its wood-paneled walls, white tablecloths, and decadent yet well-priced steaks and sides.\nHere's how the experiences at Gordon Ramsay Steak and the Knife and Fork Inn compared, and which one was a better value.\nIt was relatively easy to get a reservation at Gordon Ramsay Steak.\nWe made our reservation about a week ahead of time for 7 p.m. on a Wednesday. Since it was midweek and booked decently in advance, we had no trouble securing a prime dinner slot for two.\nThe restaurant was located on the second floor of Harrah's Resort. Thanks to the multiple neon signs outside the restaurant, it was easy enough to spot.\nWe waited a few minutes for our table to be ready, then were shown inside by one of the hostesses.\nIt was pretty quiet in the dining room, but we were also eating there during the week.\nWe were seated at a spacious booth, giving us plenty of room for two.\nThe dining room blended cozy and modern touches, with earth-tone greens and blues accented by pops of red.\nLuxe leather seating and candlelit tables added a romantic feel, while ample overhead lighting ensured the space was bright enough to easily read the menu.\nWe both ordered drinks from the specialty cocktail menu.\nI ordered the Supersonic G&T ($18), which is Ramsay's version of a classic gin and tonic.\nMy cocktail featured yuzu, grapefruit syrup, and grapefruit juice, giving it a slightly sweeter, more vibrant twist on the classic cocktail. I found it light and refreshing, and it paired well with everything we ate.\nMy friend went with the British Culprit ($18), the restaurant's rum-based spin on an espresso martini. It was sweet without being creamy — exactly how she prefers it. After a long day of traveling from New York to Atlantic City, she called it the \"perfect pick-me-up.\"\nWe started with two complimentary house rolls and butter.\nThe rolls arrived warm with a light sprinkle of salt, and the butter was perfectly softened for easy spreading.\nThe bread had a hint of sweetness, and while the butter itself was less than flavorful, we appreciated having something to nibble on while we waited for the rest of our meal.\nWe consulted with our waiter on the most popular appetizers. He recommended the smoked wagyu beef tartare.\nOur waiter mentioned that the beef tartare ($30) was smoked to enhance its flavor even further. As a big fan of this classic French dish, I couldn't resist ordering it to see how it compared to others I've tried.\nThe tartare, made with lemon zest, red onion, capers, and a quail egg yolk, was served with Yukon Gold potato chips.\nThis was easily one of the best beef tartares I've had — and that includes trips to Paris. The high-quality beef was packed with flavor: salty, savory, and infused with just the right amount of smoke.\nAt $30, though, the portion felt small. It was enough for two to share, but likely underwhelming for a larger group. The potato chips added some nice crunch, but felt a bit out of place alongside such a refined dish. I would've preferred crispy bread instead.\nFor our second course, we split the wedge salad.\nThe market wedge salad ($18) was beautifully presented. Two baby iceberg heads were generously coated in a creamy Stilton blue cheese dressing and topped with red onions.\nThe plate was also smeared with extra dressing underneath, so every bite was packed with flavor.\nThe crisp iceberg lettuce paired perfectly with smoky applewood bacon, while the heirloom tomatoes and English cucumber added fresh, bright contrast to the rest of the dish.\nIf you love blue cheese, this salad is a must-order.\nMy friend ordered the branzino as her main dish.\nThe pan-seared branzino ($59) was served with rock shrimp, artichokes, Kalamata olives, shaved fennel, sun-dried tomatoes, and lemon broth.\nThe branzino stood out with its strong Mediterranean influence, a refreshing contrast to the restaurant's British classics like beef Wellington and roast chicken.\nServed over a flavorful mix of Kalamata olives, artichokes, and sun-dried tomatoes, the dish was bold yet light. The fish had perfectly crisp skin and tender flesh, resting atop a stew-like base that could easily be eaten with a spoon.\nAs my friend put it, it tasted like a delicious \"ecosystem\" of Mediterranean flavor. It was satisfying without being too heavy.\nFor my entrée, I ordered the most expensive steak à la carte on the menu.\nI ordered the 8-ounce American wagyu filet. At $120, it's both the most expensive cut of steak and the most expensive item on the restaurant's menu.\nThere's also a triple-seared Japanese A5 steak on the menu, which was priced per ounce, but I ordered the most expensive based on the à la carte price listed on the menu.\nI ordered my steak medium-rare, which the waiter recommended.\nThe steak wasn't what I expected for the high price.\nThe steak was incredibly tender and flavorful, with a bold peppered crust and buttery, melt-in-your-mouth center, but it wasn't quite what I expected from a wagyu cut, especially in terms of marbling.\nAt over $100, it came solo, aside from a bit of jus and whole-grain mustard. While undeniably delicious, I think I would've been just as satisfied with a more affordable cut like the New York strip ($80) or filet ($70).\nI'm not sure I'd order it again at that price.\nWe finished our meal with two more cocktails.\nKeen to sample more cocktails from the menu, we both ordered spicy margaritas to gear up for a night out in Atlantic City.\nThe Mayahuel margarita ($18) combined Patron silver tequila, Cointreau, fresh lime, passion fruit, and jalapeño, delivering a spicy, salty kick. It was the perfect finish to our meal and the ideal primer for a night out in the casino.\nAfter tax and tip, our bill at Gordon Ramsay Steak totaled $320 for two appetizers, two entrées, and four cocktails.\nThough more expensive than our usual dinner, I chose one of the priciest steak cuts, and the quality of the food definitely justified a return visit.\nHowever, after dining at a local steakhouse, I couldn't help feeling that I was really paying for the celebrity name at Gordon Ramsay Steak.\nWe compared our experience at Gordon Ramsay Steak to the Knife and Fork Inn, a historic steakhouse in Atlantic City.\nThe Knife & Fork Inn has been an Atlantic City institution since 1912, albeit with a somewhat scandalous history.\nIt was originally opened by former Atlantic City mayor William Riddle and politician Louis Kuehnle as a private men's club and hangout for the two men and their cronies, the restaurant's website states. A \"ladies' lounge\" upstairs provided plenty of opportunity for sordid activities to happen.\nDuring Prohibition, the establishment continued to serve alcohol under the protection of notorious political boss Enoch \"Nucky\" Johnson, until a federal raid shut it down.\nMembership declined after the raid, and in 1927, the Latz family bought and transformed it into a public restaurant, hosting stars like Frank Sinatra and Bob Hope.\nAfter a brief closure in the late '90s, the Dougherty family — who also own the local seafood restaurant Dock's Oyster House — restored the restaurant and brought back its Prohibition-era charm.\nWe made our reservation for dinner on a Saturday night.\nWhen I tried to book the reservation about a week in advance, there were fewer times available than at Gordon Ramsay Steak. We ended up booking our table for two at 8:30 p.m., which is slightly later than prime dinner time.\nIf you want to try The Knife and Fork Inn, you might want to book further in advance.\nWhen we arrived, the restaurant was filled with people waiting for tables or dining in one of its many dining rooms. Each dining room exuded a cozy, historic charm, enhanced by vaulted ceilings, elegant chandeliers, stained-glass windows, and murals that lined the walls.\nWe started with two signature martinis.\nWe both ordered the Tangled Up in Blue ($16), which is made with Stoli blueberry, Rockey's botanical liqueur, Dr. Mixer's blueberry elixir, limoncello, and sour.\nThe cocktails were sweet with a strong blueberry flavor. For a girls' night out, they were also perfect for photos.\nWe were also given two house rolls and butter.\nThe bread rolls were warm and heartier than the ones from Gordon Ramsay Steak, and the butter was much creamier and easier to spread.\nThey tasted more homemade, with a rich, grainy flavor that impressed us, especially for a complimentary house bread.\nTo start, we ordered the cornmeal-crusted calamari.\nThe cornmeal-crusted calamari ($13) came with pickled peppers and a Calabrian chili aioli.\nThough a totally different dish from the beef tartare at Gordon Ramsay's restaurant, we couldn't help but remark on how much we enjoyed it comparatively, and for more than half the price.\nThe calamari was crunchy and packed with flavor.\nWe absolutely devoured this appetizer. The cornmeal added a slightly sweet flavor, while the peppers added a brininess to the dish's overall flavor profile. The accompanying sauce added just the right amount of spice, taking this calamari to the next level.\nAs a New Englander, I've had plenty of fried calamari in my day — and this was by far one of the best.\nWe also split a classic wedge salad.\nThe restaurant split the classic wedge salad ($13) into two, so we each received a half portion.\nEach of our portions was brimming with toppings, which included housemade blue cheese dressing, chopped tomato, and applewood bacon.\nWe preferred this wedge salad over the one at Gordon Ramsay Steak.\nNot only was it an added level of service that the kitchen divided our salads into two, but we thought the classic wedge salad at The Knife and Fork Inn surpassed the celebrity chain in terms of flavor and value.\nFor $13, we were blown away by this salad. Each portion was slightly smaller than the one at Gordon Ramsay Steak — this one appeared to only come with one full lettuce head compared to two — but it was still more than enough to fill us up.\nWe also received way more toppings on this salad than the one at Gordon Ramsay Steak, and found them to be more flavorful.\nThe bacon was crisp and smoky, and the dressing — which was plentiful — added a balanced yet savory tang to the dish. There were actual crumbles of blue cheese in the dressing, adding even more pungent flavor.\nWe split one of the restaurant's 16-ounce steaks.\nRather than ordering an 8-ounce steak each, we decided to order the 16-ounce prime sirloin ($54). It came with a side of sautéed Broccolini.\nThe steak was unbelievably tender and cooked medium-rare, with a warm pink center. It had less of a crust than the filet, but we didn't mind that — it only added to how moist each bite was.\nAs we sliced into it, we were immediately struck by how juicy it was — each cut released a burst of rich, savory juices that pooled onto the plate. It wasn't long before the steak was practically swimming in its own juices, making every bite moist and indulgent.\nFor less than half the price of my steak at the celebrity-chef chain, this steak fed two people and was more flavorful.\nWe saved money by splitting a steak instead of each ordering our own entrées, and both agreed we were absolutely stuffed.\nWhen it came down to the flavor and value of both steaks, I had to give the win to the cheaper cut.\nSure, I'm no steak connoisseur, and I'm sure the wagyu steak I ordered from Gordon Ramsay's steakhouse was of a higher quality.\nThat said, if all you're after is a tender, delicious steak, I'm not convinced you need to spend over $100 to get it. Great flavor and texture don't have to come with a triple-digit price tag.\nThanks to the money we saved on the steak, we also ordered a side of goat cheese au gratin potatoes.\nThe goat cheese au gratin potatoes ($8) were served in three perfectly portioned squares and dusted with chives.\nThey were also made with onion, rosemary, and thyme, which gave the dish a distinct herbal flavor.\nThe potatoes were creamy and a perfect accompaniment to the steak.\nThe goat cheese flavor came through with a slightly sour edge, while the crispy, golden-brown outer layer provided a textural balance. When dragged through the steak's juices, it was a truly mouthwatering experience.\nThis side dish felt both comforting and refined. As someone who loves to make au gratin potatoes for the holidays, it instantly transported me back to family meals and gave me a hit of nostalgia.\nThe potatoes were a thoughtful twist on a classic that stood out, without overshadowing the main course or other appetizers.\nThoroughly stuffed, we finished our meal with a second round of cocktails.\nWe had to agree that the cocktails didn't quite measure up to the ones we were served at Gordon Ramsay Steak. I got the Ooo-Mami ($16), which is made with tequila blanco, Mamma Bella grapefruit cello, rose syrup, grapefruit soda, and lime.\nIt was refreshing but a little too sweet. I preferred the spin on the gin and tonic at the other steakhouse.\nMy friend ordered the Boardwalk Oaxacan ($16), made with Banhez mezcal, wild elderflower liqueur, sour, hot honey, and sparkling rosé. She said it was a touch too smoky and bitter for her tastes.\nWith tip and tax, the total cost of our meal came to $201 for two appetizers, one entrée, a side dish, and four cocktails.\nWhile we only ordered one main dish to share, we felt it was more than enough food for two people — and at more than $100 less than the cost of our meal at Gordon Ramsay Steak, it was also the better deal.\nBetween the tender, well-portioned steak, delicious apps, and luxurious but never stuffy atmosphere, I'm eager to book my next Atlantic City dinner reservation at The Knife and Fork Inn."
    }
  ],
  "argos_summary": "The article recounts the author’s visits to Gordon Ramsay’s venues in Atlantic City and Las Vegas, noting the pub’s British‑themed charm but a disappointing burger, and praising the steakhouse’s high‑quality wagyu and upscale atmosphere. It also compares casual chains Applebee’s, TGI Fridays, and Chili’s, concluding Chili’s offers the best value and taste. Finally, a detailed comparison between Gordon Ramsay Steak and the historic Knife and Fork Inn shows the latter provides superior value and a more satisfying experience.",
  "argos_id": "W7BM9ZPFN"
}