{
  "url": "https://finance.yahoo.com/news/3-unstoppable-dividend-stocks-buy-104500089.html?_guc_consent_skip=1755947615",
  "authorsByline": "Keith Speights, David Jagielski, and Prosper Junior Bakiny, The Motley Fool",
  "articleId": "cd217207c9aa4b9388aa2f29d3c98c37",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/_duwnrg9QsrpTiXEgXIOIw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NDg-/https://media.zenfs.com/en/motleyfool.com/d42b0144aec0f09277ce281eb52cc335",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T10:45:00+00:00",
  "addDate": "2025-08-23T11:14:04.322694+00:00",
  "refreshDate": "2025-08-23T11:14:04.322697+00:00",
  "score": 1.0,
  "title": "3 Unstoppable Dividend Stocks to Buy Right Now",
  "description": "Investors will get great dividends and more with these stocks.",
  "content": "• Pfizer offers an ultra-high-yield dividend that appears to be sustainable.\n• 10 stocks we like better than AbbVie › How does getting paid to own a stock sound to you? That's exactly what dividends do. Even if you don't need extra income, reinvesting dividends can significantly increase the total returns you achieve over the long run. Three Motley Fool contributors think they've found unstoppable dividend stocks to buy right now. Here's why they picked Abbott Laboratories (NYSE: ABT), AbbVie (NYSE: ABBV), and Pfizer (NYSE: PFE). Prosper Junior Bakiny (Abbott Laboratories): Despite the threat from tariffs that could affect its financial results, Abbott Laboratories, a medical device specialist, has performed well this year. While we can't guarantee it will maintain that momentum through the end of 2025, the healthcare giant has plenty of qualities that make it a top stock to own, particularly for income-seeking investors. Abbott Laboratories has a diversified business across four main therapeutic segments: medical devices, established pharmaceuticals, diagnostics, and nutrition. The company also has a significant presence across much of the world. The company's diversified business allows it to weather the storm when one of its segments isn't performing well. And it has several important long-term opportunities. The most lucrative might be its FreeStyle Libre, a series of continuous glucose monitoring systems that enable people with diabetes to track their blood glucose levels. It has been Abbott's key growth driver for some time, but there is still significant white space in this market. Beyond that, the company routinely innovates and earns clearances for newer devices. Some of the other units within the medical devices sector, including structural heart and heart failure, have also performed well. Lastly, Abbott Laboratories has a remarkable streak of 53 consecutive years of dividend increases, earning it the title of Dividend King. No company can achieve a feat of this caliber without having a rock-solid underlying business -- and that's exactly what dividend investors should focus on, rather than passing on the stock because of its unimpressive 1.8% forward dividend yield (the S&P 500's average is 1.3%). Investors shouldn't buy Abbott Laboratories' shares because of its strong performance this year. The company's excellent prospects and impressive dividend program are much better reasons.\n\nDavid Jagielski (AbbVie): Drugmaker AbbVie is a terrific blue chip dividend stock that looks poised not only for higher future payouts, but also for tremendous growth. The company has a robust portfolio of assets that can help grow its business in the long run and pave the way for significant dividend increases along the way. AbbVie, which is already a Dividend King when you count the time that it was part of Abbott Laboratories, has been raising its payouts at generous rates in the past few years. Since 2020, when its quarterly dividend was $1.18 per share, the healthcare company has boosted its payout by 39%, to $1.64 today. That averages to a compound annual growth rate of 6.8% -- well above the usual rate of inflation. Its payout ratio is over 100%, and that could make its dividend look risky. But in reality, there's plenty of room for AbbVie to still boost its dividend even higher. Its free cash flow over the trailing 12 months has totaled $18.2 billion, which is far higher than how much it has paid in dividends over that stretch ($11.3 billion). Through the first six months of the year, the company's net revenue has risen organically by 8%, to $28.8 billion. And what's impressive is that it's doing that even as it isn't firing on all cylinders. While its immunology and neuroscience segments grew by double digits over the past two quarters, oncology revenue has grown organically by only 5%. And aesthetics, which includes its Botox cosmetic business, has declined by 9%. There are still many opportunities for AbbVie to increase its top and bottom lines in the future, which is why this is an exciting stock to own. It already offers a great above-average yield of 3.2%, which is more than double the S&P 500 average. For income investors, this is an unstoppable-looking stock to hang on to for the long haul. An ultra-high yield you shouldn't have to worry about Keith Speights (Pfizer): When investors see an ultra-high dividend yield of over 5%, they might be tempted to worry about its sustainability. However, Pfizer's forward dividend yield of roughly 6.7% should be quite safe. The big drugmaker isn't a member of dividend royalty like Abbott and AbbVie. But Pfizer has increased its dividend for 16 consecutive years and has paid a dividend for an impressive 347 quarters in a row. Could those streaks be in jeopardy because of Pfizer's looming patent cliff? I don't think so. Sure, the company faces losses of exclusivity (LOEs) over the next three years for several top drugs, including blood thinner Eliquis, breast cancer drug Ibrance, and autoimmune disease drug Xeljanz. But these LOEs are only one side of the story. Pfizer also has multiple products in its lineup that should be key growth drivers for years to come. Eczema drug Cibinqo, multiple myeloma drug Elrexfio, and bladder cancer drug Padcev especially stand out. The company's pipeline is also promising, with 108 programs in clinical development. Experimental lung cancer drug sigvotatug vedotin and breast cancer candidate atirmociclib could especially be big winners in the future. In addition to a juicy dividend, Pfizer offers investors an attractive valuation. The stock's forward price-to-earnings ratio is a super-low 8.3. Should you buy stock in AbbVie right now? Before you buy stock in AbbVie, consider this: The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and AbbVie wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years. Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $650,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,072,543!* Now, it’s worth noting Stock Advisor’s total average return is 1,045% — a market-crushing outperformance compared to 182% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor. David Jagielski has no position in any of the stocks mentioned. Keith Speights has positions in AbbVie and Pfizer. Prosper Junior Bakiny has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends AbbVie, Abbott Laboratories, and Pfizer. The Motley Fool has a disclosure policy. 3 Unstoppable Dividend Stocks to Buy Right Now was originally published by The Motley Fool",
  "medium": "Article",
  "links": [
    "https://www.fool.com/author/2035/",
    "https://www.fool.com/investing/stock-market/types-of-stocks/dividend-stocks/how-to-invest-in-dividend-stocks/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
    "https://www.fool.com/author/20111/?page=1&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1096d10-8c6f-41b8-afdb-c40e266ab07c&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
    "https://www.fool.com/investing/2025/08/23/3-unstoppable-dividend-stocks-to-buy-right-now/",
    "https://www.fool.com/author/20105/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e1559fca-cd5c-454a-9409-7cbd3393f996&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18006&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e1559fca-cd5c-454a-9409-7cbd3393f996&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D18006%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DAbbVie&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://www.fool.com/author/20111/"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "unstoppable dividend stocks",
      "weight": 0.098206595
    },
    {
      "name": "dividend investors",
      "weight": 0.090218544
    },
    {
      "name": "impressive dividend program",
      "weight": 0.08370372
    },
    {
      "name": "dividends",
      "weight": 0.08321683
    },
    {
      "name": "dividend increases",
      "weight": 0.08280601
    },
    {
      "name": "significant dividend increases",
      "weight": 0.082442254
    },
    {
      "name": "dividend royalty",
      "weight": 0.08110043
    },
    {
      "name": "Abbott Laboratories",
      "weight": 0.07265692
    },
    {
      "name": "stock",
      "weight": 0.06836905
    },
    {
      "name": "several top drugs",
      "weight": 0.06318461
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.96875
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.8408203125
    }
  ],
  "sentiment": {
    "positive": 0.8642784,
    "negative": 0.023509456,
    "neutral": 0.11221212
  },
  "summary": "Three Motley Fool contributors have identified three unstoppable dividend stocks to buy. Abbott Laboratories (ABbott Laboratories), AbbVie (AbbV), and Pfizer (Pfizer). The contributors highlighted Abbott's diverse business, diversified business, and strong underlying business. Abbott has a streak of 53 consecutive years of dividend increases, earning it the title of Dividend King. However, Abbott Laboratories' 1.8% forward dividend yield is an underperformant compared to the S&P 500's average of 1.3%. Pfizer's ultra-high-yield of roughly 6.7% is also considered a strong indication that its future growth is solid. Despite these setbacks, the company's net revenue has risen organically by 8%, to $28.8 billion.",
  "shortSummary": "Abbott Laboratories, AbbVie, and Pfizer are three unstoppable dividend stocks with strong financial prospects and strong dividend prospects, despite concerns over its long-term growth prospects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5ef450012e5748b3beb9fcf3a4eb55d5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e1559fca-cd5c-454a-9409-7cbd3393f996&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_yahoo%26ftm_pit%3D18006&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/investing/stock-market/types-of-stocks/dividend-stocks/how-to-invest-in-dividend-stocks/?utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
      "text": "Dividend investing can be a great investment strategy. Dividend stocks have historically outperformed the S&P 500 with less volatility. That's because dividend stocks provide two sources of return: regular income from dividend payments and capital appreciation of the stock price. This total return can add up over time.\nDividends Per Share\nBecause of their lower volatility, dividend stocks often appeal to investors looking for lower-risk investments, especially those in or nearing retirement. But dividend stocks can still be risky if you don't know what to avoid. Here's a closer look at how to invest in dividend stocks.\nHow they work\nHow dividend stocks work\nLet's look at an example. Say you buy 100 shares of a company for $10 each, and each share pays a dividend of $0.50 annually. If you invested $1,000, you would receive $50 in dividend payments over the course of a year. That works out to a 5% dividend yield -- not too shabby. What you choose to do with your dividends is up to you. You can:\n- Automatically reinvest them to buy more shares of the company through a dividend reinvestment plan (DRIP).\n- Buy stock in a different company.\n- Save the cash.\n- Spend the money.\nWhether the company's stock price goes up or down, you will receive those dividend payments as long as the company continues to disburse them. The beauty of stocks that pay dividends is that part of your return includes predictable quarterly payments.\nNot every company offering dividend stocks can maintain a dividend payout in every economic environment, but a diversified portfolio of dividend stocks can produce reliable income, rain or shine. Combine those dividends with capital appreciation as the companies you own grow in value, and the total returns can rival and even exceed those of the broader market.\nExamples\nExamples of dividend stocks\nHere are some well-known companies with a long history of paying dividends, along with their dividend yields at recent stock prices and the per-share amount of each dividend:\n| Company | Industry | Dividend Yield | Quarterly Dividend Amount |\n|---|---|---|---|\n| Chevron (NYSE:CVX) | Energy | 4.11% | $1.71 |\n| Procter & Gamble (NYSE:PG) | Consumer defensive | 2.47% | $1.006 |\n| Lowe's (NYSE:LOW) | Consumer cyclical | 1.95% | $1.15 |\nBoth Procter & Gamble and Lowe's have increased their stock dividends for more than 50 consecutive years, placing them in an elite group of companies known as the Dividend Kings. They're also part of the Dividend Achievers, a trademarked property owned by Nasdaq. Dividend Achievers are S&P 500 index companies with more than 10 years of consecutive dividend increases.\nChevron has a 38-year streak of dividend growth. Dividend stocks can come from just about any industry, and the amount of the dividend and percentage yield can vary greatly from one company to the next.\nKey metrics\nDividend yield and other key metrics\nBefore you buy any dividend stocks, it's important to know how to evaluate them. These metrics can help you understand how much in dividends to expect, how reliable a dividend might be, and -- most importantly -- how to identify red flags.\nDividend yield\nThe dividend yield is the annualized dividend represented as a percentage of the stock price. For instance, if a company pays $1 in annualized dividends and the stock costs $20 per share, the dividend yield would be 5%.\nYield is useful as a valuation metric when you compare a stock's current yield to its historical levels. A higher dividend yield is better, all other things being equal, but a company's ability to maintain the dividend payout -- and, ideally, increase it -- matters even more. An abnormally high dividend yield could be a red flag.\nDividend payout ratio\nThis is the dividend as a percentage of a company's earnings. If a company earns $1 per share in net income and pays a $0.50-per-share dividend, the dividend payout ratio is 50%. In general terms, the lower the payout ratio, the more sustainable a dividend is.\nCash dividend payout ratio\nThis is the dividend as a percentage of a company's operating cash flows minus capital expenditures, or free cash flow (FCF). This metric is relevant because GAAP (generally accepted accounting principles) net income is not a cash measure.\nVarious noncash expenses can cause a company's earnings and FCF to vary significantly from one period to the next. This variability can cause a company's payout ratio to be misleading at times. Investors can use the cash dividend payout ratio, along with the simple payout ratio, to better understand a dividend's sustainability.\nTotal return\nThis is the increase in stock price (known as capital gains) plus dividends paid. For example, if you pay $10 for a stock that increases in value by $1 and pays a $0.50 dividend, then that $1.50 you've gained is equivalent to a 15% total return.\nEarnings per share (EPS)\nThe EPS metric normalizes a company's earnings to the per-share value. The best dividend stocks are companies that have shown that they can regularly increase earnings per share over time and thus raise their dividend. A history of earnings growth is often evidence of durable competitive advantages.\nPrice-to-earnings (P/E) ratio\nThe price-to-earnings (P/E) ratio is calculated by dividing a company's share price by its earnings per share. This metric, along with dividend yield, can be used to determine whether a dividend stock is fairly valued.\nHigh yield\nHigh yield isn't everything\nInexperienced dividend investors often make the mistake of buying stocks with the highest dividend yields. While high-yield stocks aren't bad, high yields can be the result of a stock's price falling due to the risk of the dividend being cut. That's called a dividend yield trap. Here are some steps you can take to avoid falling for a yield trap:\n- Avoid buying stocks based solely on dividend yield. If a company has a significantly higher yield than its peers, that's often a sign of trouble, not opportunity.\n- Use the payout ratios to gauge a dividend's sustainability.\n- Use a company's dividend history of payout growth and yield as a guide.\n- Study the balance sheet, including debt, cash, and other assets and liabilities.\n- Consider the company and industry. Is the company's business at risk from competitors, weak demand, or some other disruption?\nSadly, a yield that looks too good to be true often is. It's better to buy a dividend stock with a rock-solid lower yield than to chase a high yield that may prove illusory. Moreover, focusing on dividend growth -- a company's history and ability to raise its stock dividend -- often proves more profitable.\nTaxes\nHow are dividends taxed?\nMost dividend stocks pay qualified dividends, which are taxed at a 0%, 15%, or 20% rate, depending on your tax bracket. The range is significantly lower than the ordinary income tax rates of 10% to 37% or more. (An additional 3.8% tax is levied on certain investment income for the highest earners.)\nMost dividends qualify for the lower tax rates. However, some are classified as \"ordinary\" or nonqualified dividends and are taxed at your marginal tax rate.\nSeveral kinds of stocks are structured to pay high dividend yields and may come with higher tax obligations because of their corporate structures. The two most common are real estate investment trusts (REITs) and master limited partnerships (MLPs).\nOf course, this extra tax burden doesn't apply if your dividend stocks are held in a tax-advantaged retirement plan such as an individual retirement account (IRA). However, investing in MLPs can sometimes leave you owing taxes, even on your IRA.\nStrategies\nDividend investment strategies\nThere's a misconception that dividend stocks are only for retirees or risk-averse investors. That's not the case. When you start investing, you should consider buying dividend-paying stocks to reap their long-term benefits.\nDividend stocks, especially those in companies that consistently increase their dividends, have historically outperformed the market with less volatility -- expressed in a measure called beta. Because of that, dividend stocks are a great fit for almost every investor. They can help you create a diversified, wealth-building portfolio.\nBeta\nThere are a few dividend strategies to consider. The first is to build a dividend portfolio as part of your overall portfolio. When building a dividend portfolio, it's important to remember that paying dividends isn't obligatory for a company in the same way that companies must make interest payments on bonds. So, if a company has to cut expenses, the dividend could be at risk.\nYou can't completely eliminate the risk of a dividend cut, but you can lower the risk. Focus less on a company's dividend yield and more on its ability to increase its dividend consistently. Look for a company with a sound financial profile focused on a growing industry.\nRelated investing topics\nAnother aspect of a dividend investing strategy is determining how you want to reinvest your dividends. Some investors opt to reinvest their dividends manually, while others use a dividend reinvestment plan (DRIP).\nThis powerful tool will take every dividend you earn and automatically reinvest it -- without fees or commissions -- into shares of that company. This simple set-it-and-forget-it tool is one of the easiest ways to use the power of time and compounding value to your advantage.\nAnother dividend investing strategy is to invest in a dividend-focused exchange-traded fund (ETF) or mutual fund. These fund options enable investors to own diversified portfolios of dividend stocks that generate passive income.\nExchange-Traded Fund (ETF)\nNo matter which dividend strategy you use, adding dividend stocks to your portfolio can be beneficial. They can help reduce volatility and boost your total returns so you can reach your financial goals a little faster."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d1096d10-8c6f-41b8-afdb-c40e266ab07c&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D8867%26source%3Disaedikp0000053%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_yahoo%26ftm_pit%3D17670",
      "text": "5 Years From Now, You'll Probably Wish You Grabbed These Stocks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to find out how to get access to these stocks.\nReturns are updated during market hours. The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=e1559fca-cd5c-454a-9409-7cbd3393f996&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001138%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D18006%26ftm_veh%3Darticle_pitch_feed_yahoo%26company%3DAbbVie&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c619ec8-4876-49be-ae43-2fce54a23bb7",
      "text": "Get Access to The Motley Fool's Top 10 Stock Picks\nDon't miss your chance to get in on the top 10 stocks we think are the best buys now inside our flagship online investing service Stock Advisor.\nThe average stock pick inside Stock Advisor is up 1,045% vs. just 182% for the S&P.\nLooking back five years from now, you'll probably wish you'd grabbed these stock picks.\nIf you want to take advantage of this buying opportunity, simply enter your email address below to access our secure sign-up page.\nReturns are updated during market hours.The Motley Fool has a disclosure policy.\nThe Motley Fool respects your privacy and strives to be transparent about our data collection practices. We use your information to customize the site for you, to contact you about your membership, provide you with promotional information, and in aggregate to help us better understand how the service is used.\nPast performance is not a predictor of future results. Individual investment results may vary. All investing involves risk of loss."
    },
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    },
    {
      "url": "https://www.fool.com/investing/2025/08/23/3-unstoppable-dividend-stocks-to-buy-right-now/",
      "text": "How does getting paid to own a stock sound to you? That's exactly what dividends do. Even if you don't need extra income, reinvesting dividends can significantly increase the total returns you achieve over the long run.\nThree Motley Fool contributors think they've found unstoppable dividend stocks to buy right now. Here's why they picked Abbott Laboratories (ABT 0.45%), AbbVie (ABBV 0.38%), and Pfizer (PFE 0.33%).\nA steady, reliable dividend payer\nProsper Junior Bakiny (Abbott Laboratories): Despite the threat from tariffs that could affect its financial results, Abbott Laboratories, a medical device specialist, has performed well this year. While we can't guarantee it will maintain that momentum through the end of 2025, the healthcare giant has plenty of qualities that make it a top stock to own, particularly for income-seeking investors.\nAbbott Laboratories has a diversified business across four main therapeutic segments: medical devices, established pharmaceuticals, diagnostics, and nutrition. The company also has a significant presence across much of the world. The company's diversified business allows it to weather the storm when one of its segments isn't performing well.\nAnd it has several important long-term opportunities. The most lucrative might be its FreeStyle Libre, a series of continuous glucose monitoring systems that enable people with diabetes to track their blood glucose levels. It has been Abbott's key growth driver for some time, but there is still significant white space in this market. Beyond that, the company routinely innovates and earns clearances for newer devices.\nSome of the other units within the medical devices sector, including structural heart and heart failure, have also performed well.\nLastly, Abbott Laboratories has a remarkable streak of 53 consecutive years of dividend increases, earning it the title of Dividend King. No company can achieve a feat of this caliber without having a rock-solid underlying business -- and that's exactly what dividend investors should focus on, rather than passing on the stock because of its unimpressive 1.8% forward dividend yield (the S&P 500's average is 1.3%).\nInvestors shouldn't buy Abbott Laboratories' shares because of its strong performance this year. The company's excellent prospects and impressive dividend program are much better reasons.\nA fantastic business with a fast-growing dividend\nDavid Jagielski (AbbVie): Drugmaker AbbVie is a terrific blue chip dividend stock that looks poised not only for higher future payouts, but also for tremendous growth. The company has a robust portfolio of assets that can help grow its business in the long run and pave the way for significant dividend increases along the way.\nAbbVie, which is already a Dividend King when you count the time that it was part of Abbott Laboratories, has been raising its payouts at generous rates in the past few years. Since 2020, when its quarterly dividend was $1.18 per share, the healthcare company has boosted its payout by 39%, to $1.64 today. That averages to a compound annual growth rate of 6.8% -- well above the usual rate of inflation.\nIts payout ratio is over 100%, and that could make its dividend look risky. But in reality, there's plenty of room for AbbVie to still boost its dividend even higher. Its free cash flow over the trailing 12 months has totaled $18.2 billion, which is far higher than how much it has paid in dividends over that stretch ($11.3 billion).\nThrough the first six months of the year, the company's net revenue has risen organically by 8%, to $28.8 billion. And what's impressive is that it's doing that even as it isn't firing on all cylinders. While its immunology and neuroscience segments grew by double digits over the past two quarters, oncology revenue has grown organically by only 5%. And aesthetics, which includes its Botox cosmetic business, has declined by 9%.\nThere are still many opportunities for AbbVie to increase its top and bottom lines in the future, which is why this is an exciting stock to own. It already offers a great above-average yield of 3.2%, which is more than double the S&P 500 average. For income investors, this is an unstoppable-looking stock to hang on to for the long haul.\nAn ultra-high yield you shouldn't have to worry about\nKeith Speights (Pfizer): When investors see an ultra-high dividend yield of over 5%, they might be tempted to worry about its sustainability. However, Pfizer's forward dividend yield of roughly 6.7% should be quite safe.\nThe big drugmaker isn't a member of dividend royalty like Abbott and AbbVie. But Pfizer has increased its dividend for 16 consecutive years and has paid a dividend for an impressive 347 quarters in a row.\nCould those streaks be in jeopardy because of Pfizer's looming patent cliff? I don't think so. Sure, the company faces losses of exclusivity (LOEs) over the next three years for several top drugs, including blood thinner Eliquis, breast cancer drug Ibrance, and autoimmune disease drug Xeljanz. But these LOEs are only one side of the story.\nPfizer also has multiple products in its lineup that should be key growth drivers for years to come. Eczema drug Cibinqo, multiple myeloma drug Elrexfio, and bladder cancer drug Padcev especially stand out.\nThe company's pipeline is also promising, with 108 programs in clinical development. Experimental lung cancer drug sigvotatug vedotin and breast cancer candidate atirmociclib could especially be big winners in the future.\nIn addition to a juicy dividend, Pfizer offers investors an attractive valuation. The stock's forward price-to-earnings ratio is a super-low 8.3."
    }
  ],
  "argos_summary": "The Motley Fool highlights Abbott Laboratories, AbbVie, and Pfizer as strong dividend stocks, citing each company’s solid track record of dividend increases and attractive yields—1.8% for Abbott, 3.2% for AbbVie, and 6.7% for Pfizer. Abbott’s diversified medical device and diagnostics business, along with its 53‑year dividend streak, makes it a reliable income play, while AbbVie’s robust pipeline and high free cash flow support future dividend growth. Pfizer’s 16‑year dividend history and low P/E ratio, despite upcoming patent expirations, suggest a sustainable high yield, positioning all three as appealing options for income‑focused investors.",
  "argos_id": "WISLWAJ15"
}