{
  "url": "https://www.howtogeek.com/want-an-affordable-linux-desktop-pc-just-buy-a-steam-deck/",
  "authorsByline": "Goran Damnjanovic",
  "articleId": "7b19bf9c2b6540e08599cd8328ff7e14",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2025/08/steam-deck-mini-pc-featured.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:30:16+00:00",
  "addDate": "2025-08-23T13:34:14.219886+00:00",
  "refreshDate": "2025-08-23T13:34:14.219887+00:00",
  "score": 1.0,
  "title": "Want an Affordable Linux Desktop PC? Just Buy a Steam Deck",
  "description": "Linux-based, more portable than any mini PC, and just as affordable, the Steam Deck is great as a Linux desktop.",
  "content": "Thinking about getting a mini PC with Linux preinstalled and are a gamer? Instead of getting a regular mini PC, you could snag a Steam Deck, pair it with a dock, and end up with a versatile device that works great as an affordable Linux desktop while doubling as a nifty portable gaming device.\n\nSteamOS Works Like Any Other Linux Distro in Desktop Mode\n\nWhile everyone talks about Steam Deck’s Game Mode, which more or less works as a more versatile Steam Big Picture mode, the good news for anyone who wants to use Steam Deck as a regular Linux PC is that the most popular handheld gaming PC also features Desktop Mode.\n\nSteamOS Desktop Mode is based on the KDE Plasma desktop environment wrapped around an Arch Linux core. This combo works pretty much like regular Arch Linux (with some limitations), with the added benefit of having KDE Plasma preinstalled.\n\nYou can install and use most apps and tools compatible with Arch Linux, all while navigating the OS with a well-designed graphical user interface I, a long-time Windows user, got used to in about half an hour.\n\nYou can use preinstalled apps (Firefox browser, Dolphin file manager, Konsole terminal tool, and so on), install additional apps, or replace preinstalled ones via the Discovery store or Konsole, Flathub, Homebrew (you can install Homebrew on the Steam Deck), or by downloading supported installation packages from the web.\n\nSteam Deck plays nice with handheld PC docks and USB-C hubs, meaning you can turn it into a tiny Linux desktop workstation in no time. I highly recommend this because, even if you use Bluetooth peripherals, you will be limited by the Deck’s sole USB-C port.\n\nEver since I switched to an ASUS ROG Ally as my primary gaming handheld, I’ve been using my Steam Deck mostly in Desktop Mode. My dock of choice is the UGREEN 9-in-1 Steam Deck dock.\n\nAside from fiddling with some monitor-related options (making the external display primary and changing its refresh rate) and adjusting desktop scaling the first time I hooked the Deck up to an external monitor, the Steam Deck docked experience has been pretty much plug-and-play. The said dock has all the ports needed to turn the handheld into a proper desktop machine, including an Ethernet port.\n\nThe setup’s footprint is similar to a larger mini PC, and I can undock the Deck in a jiff and then dock it back in just as swiftly. While I usually switch from Game to Desktop Mode before docking it, you can make SteamOS boot directly into Desktop Mode if you so desire, practically turning the handheld PC into a full-fledged Linux desktop.\n\nI work as the PC handheld reviewer for another outlet, where I test PC handhelds but also benchmark games on popular PC handhelds. My usual workflow includes benchmarking a game on the Deck along with grabbing in-game screenshots, and then docking the device and switching to Desktop Mode to upload screenshots to the CMS and cobble together initial drafts for said game tests.\n\nI’m writing this piece on my docked Deck, and the overall experience is as snappy as on my high-end gaming desktop (a 5700X3D paired with an RX 9070 XT) and my M4 Mac Mini. I even do some light photo editing (mostly cropping or resizing screenshots) on occasion and can say that the humble handheld has enough horsepower for most productivity workloads.\n\nThe Steam Deck can be a great everyday machine for light productivity or general computing. You can even run a media server off it if you want, and use it for everything you’d use a regular Linux PC for. With all that said, though, SteamOS does entail certain limitations compared to most other Linux distros.\n\nArguably, the most pivotal limitation of SteamOS is that it is, unlike most other Linux flavors, immutable. In other words, SteamOS has a read-only file system, the primary purpose of which is to prevent Steam Deck owners from inadvertently nuking the operating system.\n\nThis means that any change you make to the system gets rolled back with each system update. This can be pretty annoying if your everyday workflow includes using tools that make changes to the system partition or configuration files or if, for instance, you like to tinker with Hyprland.\n\nA couple of other downsides include the lack of full disk encryption, delayed updates compared to regular distros (e.g., SteamOS gets KDE Plasma updates much later than a regular distro), and limited multi-monitor support (it works fine but has limited options, especially when you connect more than two monitors).\n\nLuckily, you aren't limited to SteamOS. The best SteamOS alternative for Steam Deck owners is Bazzite, a gaming-friendly distribution that comes with full-fledged Game and Desktop modes. Now, Bazzite also has a read-only file system, but since it uses an overlay file system, you can make changes to the system that won’t disappear after a reboot or system update.\n\nAnother advantage of Bazzite is that it comes with full disk encryption, available as an option during setup. Bazzite also works better with multi-monitor configurations made of more than two displays than SteamOS, and offers a choice between KDE Plasma and GNOME desktop environments.\n\nWhile Bazzite is more than a decent SteamOS replacement, I don't recommend daily driving it on a Steam Deck unless you really need some of the features it offers that aren't available on SteamOS, since the latter is built from the ground up for Steam Deck.\n\nNote that Valve's handheld PC can work with other distros (like Linux Mint, for instance), but they entail various limitations compared to using them on a regular PC. Also, installing most Linux distros on a Steam Deck can be quite a challenge. Lastly, opting for a popular Linux flavor will usually result in losing access to Game Mode, unless you opt for a gaming-focused distro that includes Game Mode (Bazzite or ChimeraOS, for example).\n\nIf a traditional, mutable Linux distro is a must for you, just get a regular mini PC and install Linux on it (there's a diverse lineup of distros that work great with mini PCs) or opt for a mini PC that comes preinstalled with Linux.\n\nSteam Deck’s Great for People Who Want a Linux Mini PC for Work and Gaming\n\nI wholeheartedly recommend the Steam Deck to anyone looking for a Linux mini PC who’s a gamer and would regularly use said Steam Deck in handheld form.\n\nHonestly, it’s a great mixed-use PC that excels as a versatile machine you can take with you anywhere you go, or dock in a jiff and use as a desktop. It’s compact, comes with a well-made carrying case, and can be used as a desktop PC by pairing it with a relatively inexpensive dock.\n\nOn the flip side, if you’re someone who doesn't play games on a regular basis and are looking for a Linux mini PC to use for work and entertainment that excludes gaming, get a regular Linux mini PC instead. But if you’re a gamer and can appreciate Steam Deck’s versatility, knock yourself out.\n\nValve’s Handheld is as Affordable as a Regular Linux Mini PC\n\nStarting at $399 for the 256GB LCD model (even lower if you don't turn up your nose at a refurbished unit), Valve’s handheld PC is more affordable than many mini PCs that come with Linux preinstalled. Even when you add the $50 or so you’ll spend on a dock, a Steam Deck will set you back less than a similarly powerful Linux mini PC.\n\nFor the price, you get a quite capable (for a mini PC) four-core Zen 2 CPU, more than a decent RDNA 2-based iGPU, 16GB of LPDDR5 memory, and 256GB of storage, which you can easily expand with a microSD card. You can even replace the internal SSD, which is a reasonably straightforward procedure.\n\nIts biggest advantage over regular mini PCs is that it is a full-fledged PC in a handheld form factor, making it more portable than any mini PC on the market. Its 7-inch screen is large enough to use the device in Desktop Mode only with Bluetooth peripherals, like you’d use a regular PC, even without a dock. Get a handheld dock, and you can turn it into a regular desktop PC you can undock in a second and play your favorite games anywhere you want.\n\nOn the flip side, SteamOS is an immutable Linux flavor and doesn’t support full disk encryption, two drawbacks that can be deal-breakers for advanced users but shouldn’t be an issue for anyone looking for an everyday mini PC they can also use for gaming on the go.\n\nAt the end of the day, the Steam Deck can be a fantastic, affordable Linux mini PC for gamers looking for a device they can game on and use docked as a proper desktop replacement, or someone who often travels and is looking for a gaming handheld they can also get some work done on.\n\nBut Valve's handheld PC simply isn’t suited for non-gamers. Sure, it’s versatile, compact, and portable, but if you won’t play games on it, just get a regular Linux mini PC instead.",
  "medium": "Article",
  "links": [
    "https://www.howtogeek.com/what-is-an-immutable-linux-distro/",
    "https://www.howtogeek.com/what-is-arch-linux/",
    "https://www.howtogeek.com/781784/what-is-integrated-graphics/",
    "https://brew.sh/",
    "https://amzn-adsystem.com/?aid=123257&dest=https://www.amazon.com/UGREEN-Docking-Foldable-Ethernet-Compatible/dp/B0CR6JND4M",
    "https://www.reddit.com/r/SteamDeck/comments/192wus7/the_steam_deck_runs_linux_mint/",
    "https://www.howtogeek.com/how-to-use-your-steam-deck-as-a-linux-pc/#:~:text=The%20Steam%20Deck%20also%20features,Arch%2Dcompatible%20application%20you%20like.",
    "https://www.howtogeek.com/these-are-the-best-linux-distros-to-install-on-a-mini-pc/",
    "https://gist.github.com/uyjulian/105397c59e95f79f488297bb08c39146",
    "https://www.howtogeek.com/apple-mac-mini-m4-review/",
    "https://www.howtogeek.com/886225/how-to-upgrade-your-steam-decks-ssd/",
    "https://hypr.land/",
    "https://www.howtogeek.com/more-mini-pcs-with-linux-preinstalled/",
    "https://www.howtogeek.com/gnome-vs-kde-plasma-top-linux-desktops-compared/",
    "https://www.howtogeek.com/what-is-bazzite-linux/",
    "https://www.howtogeek.com/mini-pcs-you-can-buy-with-linux-preinstalled/",
    "https://flathub.org/",
    "https://www.howtogeek.com/asus-rog-ally-review/",
    "https://www.howtogeek.com/best-steam-deck-docks/",
    "https://www.amazon.com/UGREEN-Docking-Foldable-Ethernet-Compatible/dp/B0CR6JND4M?tag=hotoge-20&ascsubtag=UUhtgUeUpU2015831&asc_refurl=https%3A%2F%2Fwww.howtogeek.com%2Fwant-an-affordable-linux-desktop-pc-just-buy-a-steam-deck%2F&asc_campaign=Feed",
    "https://www.howtogeek.com/best-microsd-cards/",
    "https://www.reddit.com/r/SteamDeck/comments/wirkk7/is_there_a_way_to_always_start_steam_deck_in/",
    "https://www.howtogeek.com/reasons-to-replace-steamos-with-bazzite-and-reasons-not-to/",
    "https://store.steampowered.com/steamdeck"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "regular mini PCs",
      "weight": 0.100740075
    },
    {
      "name": "Steam Deck",
      "weight": 0.09565886
    },
    {
      "name": "mini PCs",
      "weight": 0.09372185
    },
    {
      "name": "Steam Deck owners",
      "weight": 0.09104112
    },
    {
      "name": "handheld PC docks",
      "weight": 0.089928016
    },
    {
      "name": "regular Arch Linux",
      "weight": 0.08876108
    },
    {
      "name": "many mini PCs",
      "weight": 0.08753211
    },
    {
      "name": "most Linux distros",
      "weight": 0.084941916
    },
    {
      "name": "most other Linux distros",
      "weight": 0.08424732
    },
    {
      "name": "PC handhelds",
      "weight": 0.0839982
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.6015625
    },
    {
      "name": "/Computers & Electronics/Consumer Electronics/Game Systems & Consoles",
      "score": 0.431640625
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.406982421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.372314453125
    }
  ],
  "sentiment": {
    "positive": 0.31605557,
    "negative": 0.1476268,
    "neutral": 0.5363176
  },
  "summary": "The Steam Deck, a mini PC with Linux preinstalled, can be purchased as an affordable Linux desktop while simultaneously being a portable gaming device. The most popular handheld gaming PC also features Desktop Mode, which is based on the KDE Plasma desktop environment wrapped around an Arch Linux core. SteamOS can install and use most apps and tools compatible with Arch Linux, while navigating the OS with a well-designed graphical user interface. The Steam Deck can also be used as a daily workstation or media server. However, SteamOS does face some limitations, including a read-only file system that can be accidentally rolled back with each system update. The best-friendly version of SteamOS is limited to two monitors and limited support for gaming.",
  "shortSummary": "The Steam Deck offers a versatile Linux desktop and gaming device, compatible with handheld PCs, with features like Game Mode and USB-C ports.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "34facd959d294b589fed409b2ae856cd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.howtogeek.com/these-are-the-best-linux-distros-to-install-on-a-mini-pc/",
      "text": "Quick Links\nMini PCs are versatile computing devices, thanks to their compact design, low power consumption, and often quiet operation. However, you can significantly enhance their capabilities by pairing them with a solid Linux distribution.\nOne of the biggest advantages of Linux is that it is not limited to just a couple of versions, unlike proprietary platforms. There are numerous distros to choose from, each with its own unique strengths and capabilities.\nWith the right Linux distro, you can precisely tailor your Mini PC for its intended role, whether that's a simple workstation for everyday computing or a discrete home theater PC for your entertainment needs. So, here are some of my top picks for six of the most common use cases of a Mini PC.\n6 For Workstations: Ubuntu\nUbuntu is an excellent choice for transforming your Mini PC into a capable daily workstation. It makes the most sense due to its excellent stability, impressive hardware support, and general user-friendliness. It also benefits from its massive community and popularity, as you will have no trouble getting resources for any help that you may need.\nBesides online resources, its popularity helps in terms of software availability. By default, it doesn't come with much pre-installed. However, you can access a large selection of compatible apps through its App Center, which offers DEB and Snap packages. Snap packages are favored by the App Center, which some people dislike. One easy solution for this is GNOME Software, which allows you to choose whether you want the DEB or Snap package of an app, if available.\nIf your Mini PC hardware isn't very powerful or is on the older side, there are several excellent lightweight distros, many of which are based on Ubuntu, that you can consider as alternatives.\nWhich Linux Distro is Right for You? A Beginner’s Guide\nFind the perfect Linux distro for your needs.\n5 For Running a Server: Debian\nIt's hard to go wrong with Debian as the distro for a Mini PC that's going to be used as a home server or NAS. Its exceptional stability and solid security make it pretty reliable for a machine that's going to run around the clock. More importantly, Debian's release model allows for long-term deployment, meaning you won't be forced into regular maintenance or re-installs and can continue to upgrade your original install for years.\nAnother advantage of using Debian is its low resource footprint, allowing your server apps to take full advantage of the Mini PC hardware.\nMoreover, Debian has established a strong reputation for security throughout its long history, and its stable releases are supported by thorough testing. You may not get the latest flashy features, but the result is fewer bugs and surprises.\nThese Are My Top 6 Linux Distros for Running a Server\nYes! You can set up your own Linux server. Here's how!\n4 For Modern Gaming: Pop!_OS\nAlthough System76, the creator of Pop!_OS, doesn't highlight the Linux distro as gaming-oriented, it's an excellent choice for modern gaming. It's based on Ubuntu, meaning you get a reliable and stable foundation. Moreover, its Cosmic desktop environment, which is a custom version of GNOME, is easy to use and beginner-friendly. To simplify the installation process, System76 offers a version of the Pop!_OS ISO that is bundled with NVIDIA drivers crucial for many gaming PC builds.\nWhile it doesn't come with any of the gaming-specific software pre-installed, the included Pop!_Shop offers seamless access to Steam, Heroic, Lutris, and GameHub. As a result, you'll have no trouble playing your favorite games on the distro.\nAlthough you shouldn't have trouble with AMD GPUs on Pop!_OS, ChimeraOS is an excellent alternative to consider for Mini PCs with AMD hardware. It's optimized for AMD GPUs and can be configured to turn your PC into a gaming console, booting directly into Steam's Big Picture Mode.\n15 Popular Games You Can Surprisingly Play on Linux\nYou don't need Windows to enjoy blockbuster games!\n3 For Retro Gaming: Batocera\nLooking to give your Mini PC a retro gaming console makeover? Batocera is a solid choice. It supports a wide range of retro consoles and arcade systems, and depending on your Mini PC's hardware, you can emulate even the more demanding systems, such as older PlayStation consoles.\nIt typically boots directly into a user-friendly interface that you can easily navigate with your controller. Speaking of controllers, there is plug-and-play support for USB and Bluetooth gamepads, arcade encoders, Wiimotes, Sinden light guns, and various racing wheels.\nIn addition to the core game emulation, Batocera provides a range of supplementary features to enhance your gaming experience. There is support for retro-achievements and automatic downloading of game artwork. You can also save your game at any point. Moreover, you can even install Steam onto Batocera and play modern titles.\nThe installation process is relatively straightforward, and you should be able to get the hang of Batocera quickly.\nBatocera vs. RetroPie vs. Lakka: Which Retro Gaming OS Should You Use?\nWe look at three of the most popular retro gaming OS options available and what makes them different.\n2 For Home Theater PCs (HTPCs): LibreELEC\nIf you plan to set up your Mini PC for Home Theater use, LibreELEC is an easy choice. It's built solely to be a platform for HTPCs. It's ultralight and boots directly into Kodi, which functions as your media center. Thanks to its lightweight footprint, it can deliver smooth performance on less powerful Mini PCs.\nAnother advantage of using LiberELEC is its read-only file system, which makes the platform more resilient and provides better stability than general-purpose distros.\nIf you aren't familiar with Kodi, you'll need to learn the app, as it's the primary way to interact with the platform. Kodi is pretty customizable and allows you to extend its functionality through add-ons, including integrating support for streaming services, video sites, and more. While its official repositories offer a wide range of add-ons, there is a vibrant ecosystem of third-party add-ons that can be sideloaded. However, not all third-party add-ons are actively maintained.\nAs LibreELEC is limited to Kodi, it may not be suitable for everyone. Any good general-purpose workstation distro will better serve folks who want access to more than just Kodi on the HTPC.\nHow to Build an HTPC With Linux and a Mini PC\nWant to build your own mini HTPC with Linux? This guide will get you started.\n1 For Home Automation Hub: Home Assistant OS\nHome Assistant OS is your best bet for converting your Mini PC into a dedicated home automation hub. As the name suggests, it's built to run the Home Assistant ecosystem and strips away any unnecessary components to deliver a lean and efficient system. It's easy to install and maintain.\nIt also has very low idle power consumption, which is helpful in terms of electricity costs, as your Mini PC will be running continuously.\nWhile most people rely on Raspberry Pis for home automation needs, using a Mini PC gives you more performance headroom, which will come in handy when you extend the OS's functionality through add-ons. There is no dearth of excellent add-ons that can take the Home Automation OS to the next level.\nI Found the Best Way to Install Home Assistant\nSometimes, I forget I even have Home Assistant running because it's so reliable now.\nAs I have explored, it's not hard to find a Linux distro that will suit your Mini PC use case. Once you have settled on the one you want, our handy \"how to install Linux\" guide can help you put that on your machine. However, if you aren't completely sure about your choice, you can take it for a test drive before rushing into an installation. This will give you an idea of how a particular distro functions and whether it can do what you want."
    },
    {
      "url": "https://gist.github.com/uyjulian/105397c59e95f79f488297bb08c39146",
      "text": "(See also installing Distroboxm, which is included in SteamOS 3.5 and newer: https://distrobox.it/ )\n(See also installing Nix package manager: https://determinate.systems/posts/nix-on-the-steam-deck )\nYou can install Homebrew (a package manager for macOS and Linux) without disabling the read-only partition with sudo steamos-readonly disable\n.\nThe package manager can be used alongside Flatpaks. Some software is only available on Flathub, and some software is only available on Homebrew.\n- Switch to desktop mode (hold power button until a menu appears, then select \"Switch to desktop mode\")\n- Click the logo at the bottom left, go to System, then go to Konsole\n- Set a password (needed for sudo access):\npasswd\n- Install Homebrew using the steps here: https://brew.sh/\nDon't install any additional libraries frompacman\norbrew\nyet. Also, do not append to.bash_profile\nyet, otherwise it will break Steam. - Add to\n.bash_profile\nwith a check to make sure it is running in Konsole:echo 'if [ $(basename $(printf \"%s\" \"$(ps -p $(ps -p $$ -o ppid=) -o cmd=)\" | cut --delimiter \" \" --fields 1)) = konsole ] ; then '$'\\n''eval \"$(/home/linuxbrew/.linuxbrew/bin/brew shellenv)\"'$'\\n''fi'$'\\n' >> ~/.bash_profile\n- In Konsole's menu bar, go to Settings -> Manage Profile\n- Press \"New\"\n- Check \"Default Profile\"\n- Set \"Command\" to\n/bin/bash -l\n(that is a lowercasel\n, not a number1\n) - Click OK twice\n- Add brew environment to current context:\neval \"$(/home/linuxbrew/.linuxbrew/bin/brew shellenv)\"\n- Install glibc (the important thing is headers).\nThis is needed in order to compile software.\nbrew install glibc\n- Install GCC:\nbrew install gcc\nThanks for this, it was super helpful!\nIs step 5 supposed to end with\n>> .bash_profile\nso that the string gets appended to the file?"
    },
    {
      "url": "https://www.howtogeek.com/gnome-vs-kde-plasma-top-linux-desktops-compared/",
      "text": "Summary\n- GNOME favors minimalism with a focus on virtual desktops, while KDE Plasma offers a traditional, feature-rich Windows-like experience.\n- GNOME requires extra tools for customization with limited theming capabilities, whereas KDE Plasma has extensive built-in customization options.\n- GNOME is more laptop-friendly, whereas KDE Plasma caters to heavy desktop users.\nWhile GNOME and KDE Plasma stand as Linux's most popular desktop environments (DEs), they couldn't be more different. Let's compare the desktop experience, customizability, and performance to give you a better idea of what each has to offer.\nApproach to the Desktop\nThe biggest point of difference between GNOME and KDE Plasma is how they approach the desktop. While KDE Plasma provides a more traditional experience by default with tons of features under the hood, GNOME takes a different route, aiming to reinvent the desktop with a focus on minimalism.\nGNOME: Minimal and Non-Traditional\nGNOME's focus on simplicity, minimalist design, and a streamlined workflow culminates in an extremely unique and one-of-a-kind desktop experience. Unlike traditional desktops, GNOME strips away common elements like a bottom taskbar (or dock), desktop icons, folders, and widgets by default. Instead, you get a clean desktop designed to house only your active windows.\nThere’s a thin top bar, somewhat similar to the menu bar in macOS, where you’ll find system settings on the right, a date and time indicator in the center (which opens the Notification Area when clicked), and the Activities button on the left.\nThe Activities button opens the Activities Overview, which serves as GNOME's central hub. It zooms out from the desktop to provide a quick view of all active windows, a universal search bar at the top, and a dock at the bottom for pinned and running applications.\nYou can access the Activities Overview by pressing the Super (Windows) key once. Alternatively, you can double-tap the Super key to open the Applications Overview, which features a virtual desktop switcher and a drawer containing all installed apps. You can drag and drop apps from the drawer or dock into virtual desktops, making it super fast to open multiple apps in an organized fashion.\nAs you can see, this approach is a complete departure from the traditional desktop experience you might be accustomed to on macOS or Windows.\nThere are clear benefits to this direction. First, you gain more screen space by ditching the active taskbar or dock at the bottom. The absence of a taskbar also discourages a minimize-maximize workflow for managing multitasking. Instead, GNOME encourages setting up multiple virtual desktops, each housing different apps, to keep everything better organized.\nI must also highlight that GNOME has excellent touchpad support, which complements this design philosophy. Instead of using the Activities Overview, you can swipe with three fingers left or right to switch between virtual desktops. This feature set makes GNOME ideal for laptops with built-in touchpads and smaller screens, where multitasking with a multi-window setup can be extremely counterproductive.\nKDE Plasma: Familiar and Powerful\nKDE Plasma ships with the traditional Windows desktop paradigm, which you’re bound to love if you’re a fan of Windows 7 or XP. You get a bottom taskbar with an application launcher on the left (similar to the Start Menu), a dedicated section for pinned and running apps in the middle, and a quick settings area on the right. Additionally, you have free rein over the desktop, allowing you to populate it with folders, app shortcuts, and even widgets.\nYou also have robust window management functionalities, including a built-in tiling window manager that lets you snap windows to specific regions on the desktop. The virtual desktop experience is top-notch, with a clean overview area—similar to Windows 11—from which you can easily switch between virtual desktops or create new ones.\nOther than this, KDE Plasma offers access to KDE Activities, which function like virtual desktops but on steroids. They allow you to create dedicated workspaces, each with its own set of desktop shortcuts, wallpaper, widgets, and panels.\nThe best part is that you can transition between these activities as seamlessly as switching virtual desktops, making them a godsend for heavy multitaskers.\nCustomizability\nWhile you can customize both GNOME and KDE Plasma, the overall scope and accessibility vary significantly. GNOME favors a more restricted environment that’s beginner-friendly, but advanced users can unlock additional customization options using extra tools. KDE Plasma, on the other hand, throws in everything—including the kitchen sink—making it incredibly powerful but potentially overwhelming for beginners.\nGNOME: Additional Setup Required\nBy default, GNOME’s customization options are limited to changing the wallpaper, accent colors, and a few basic settings. To unlock its full potential, you need to install two additional apps: GNOME Tweaks and GNOME Extensions.\nGNOME Extensions act as a plugin system, allowing you to install new extensions to add more features or gain enhanced customization control. GNOME Tweaks, on the other hand, lets you adjust system fonts, icons, cursor styles, and install different themes to change the look and feel of the desktop. With these tools, you can dramatically alter GNOME's appearance and functionality—even making it resemble Windows 11 or macOS.\nThat said, recent changes to GNOME’s architecture—specifically with GTK4 and Libadwaita for system applications—have made theming more challenging. While you can find plenty of custom themes for GNOME, most won’t affect these newer system applications. The good news is that Libadwaita applications look clean and polished by default, and we may see better theming solutions in the future as the ecosystem adapts.\nKDE Plasma: Made for Tuning\nKDE Plasma stands out as arguably the most customizable desktop environment. The customization freedom here is virtually limitless, and unlike GNOME, everything you need comes built-in. The System Settings hub serves as your central configuration center, providing easy access to download and install different themes, window decorations, fonts, icon packs, wallpapers, and more. Two standout features are Desktop Effects and KWin Scripts, which give you enhanced control over the desktop and its windows.\nEven the panel—the taskbar at the bottom—is highly customizable. For instance, you’re not limited to just one. You can add multiple panels and position them wherever you like.\nYou can also adjust their length and width and populate them with various widgets to enhance their functionality. For instance, you can have a full-width panel at the top for different system settings and a smaller panel at the bottom, centered, to house pinned and running apps. This approach is what Garuda Linux uses to recreate the macOS desktop experience.\nPerformance and Resource Usage\nTo get a fair assessment of resource usage between GNOME and KDE Plasma, I tested both desktop environments on Fedora, which ships with a relatively vanilla setup of both environments. This ensures that the base system remains constant, with the desktop environment being the primary variable.\nNow, after a fresh install and clean boot, Fedora Workstation running GNOME consumes approximately 2GB of RAM at idle, with 1-2% CPU usage spread across cores. The total storage space taken up by the system is around 4GB.\nIn contrast, Fedora KDE Plasma Desktop consumes slightly above 2GB of RAM at idle after a fresh boot, with CPU usage at 5-6%. The total storage space for the system is around 5GB.\nHowever, there’s an important caveat to consider—GNOME is the default desktop environment for Fedora, while the Plasma version is a spin. As such, you might expect better optimization for GNOME on Fedora. To account for this, I also tested KDE Neon—the flagship distro for showcasing KDE Plasma—and found it uses only 1.4GB of RAM and minimal CPU resources at idle after a fresh boot.\nThis variation highlights how the underlying distribution can significantly impact performance metrics, making it challenging to definitively label one desktop environment as more resource-intensive than the other. What we can conclude, however, is that both GNOME and KDE Plasma are remarkably efficient with system resources, despite their minor differences, especially when compared to Windows.\nWhether you choose GNOME's minimalist workflow or KDE Plasma's feature-rich flexibility ultimately depends on your needs. In my opinion, GNOME excels for focused laptop use with its touchpad-friendly design, while KDE Plasma offers unmatched customization for power users who want complete control over their desktop experience."
    },
    {
      "url": "https://flathub.org/",
      "text": "Search apps\n/\nOpen Menu\nPublish\nForum\nAbout\nLog In\nConstrict\nCompress videos to target sizes\nPlanify\nForget about forgetting things\nFractal\nChat on Matrix\nAudio Player\nPlay audio files\nPins\nCreate and edit app shortcuts\nPrevious slide\nNext slide\nApp of the Day\nXpano\nEasy panorama stitching\nFlathub is the App Store for Linux\nGet the latest versions of all your favorite apps, for any Linux distribution\nSet Up Flathub\nTrending\nTrending\nPopular\nNew\nUpdated\nGitter\nCommunication product for communities and teams on GitHub.\nWaycheck\nShow Wayland compositor details\nDiscord\nTalk, play, hang out\nTranslation Editor\nTranslate and localize applications and libraries\nText Compare\nText snippet comparison\nSquiid\nAdvanced algebraic & RPN calculator\nPlaylifin Voyager\nTransfer playlists to/from Jellyfin\nNewsflash\nKeep up with your feeds\nErrands\nManage your tasks\nSecrets\nManage your passwords\nScriptorium\nDesign and write manuscripts\nBinary\nConvert numbers between bases\nMore Trending\nProductivity\nText Compare\nText snippet comparison\nApostrophe\nEdit Markdown in style\nLibreOffice\nThe LibreOffice productivity suite\nTime Tracker\nTrack and sync time, local-first\nKleverNotes\nTake and manage your notes\nTangent\nRecord and connect your thoughts\nMore Productivity\nGraphics & Photography\nPhotos\nAccess, organize and share your photos on GNOME\nXpano\nEasy panorama stitching\nCurtail\nCompress your images\nBoxy SVG\nScalable Vector Graphics editor\nXL Converter\nConvert images\nUpscaler\nUpscale and enhance images\nMore Graphics & Photography\nAudio & Video\nVideo Trimmer\nTrim videos quickly\nOBS Studio\nLive stream and record videos\nCamera\nTake pictures and videos\nAudio Player\nPlay audio files\nHaruna\nMedia player\nFrescobaldi\nWrite beautiful music sheets\nMore Audio & Video\nOn the go\nApps for your Linux phones and tablets\nMore mobile apps\nPlaylifin Voyager\nTransfer playlists to/from Jellyfin\nNewsflash\nKeep up with your feeds\nErrands\nManage your tasks\nSecrets\nManage your passwords\nDosage\nKeep track of your treatments\nHitori\nPlay the Hitori puzzle game\nMore mobile apps\nEducation\nGraphs\nPlot and manipulate data\nFretboard\nLook up guitar chords\nRetro\nCustomizable clock widget\nSpelling Bee\nLearn new English words\nGameeky\nPlay, create and learn\nMemorize\nStudy flashcards\nMore Education\nNetworking\nDiscord\nTalk, play, hang out\nNewsflash\nKeep up with your feeds\nVaria\nDownload files, videos and torrents\nVideo Downloader\nDownload web videos\nGeopard\nBrowse Gemini pages\nRclone Shuttle\nUpload your files to anywhere\nMore Networking\nWe ♥ Games\nGames and apps to run your favorite titles\nGames\nGames\nEmulators\nGame Launchers\nGame Tools\nHitori\nPlay the Hitori puzzle game\nTiny Crate\nCrate-chucking action puzzler\nGame of Life\nPlay Conway's Game of Life\nMahjongg\nMatch tiles and clear the board\nSemantiK\nFind the secret word\nGNOME Sudoku\nTest yourself in the classic puzzle\nCandy Wrapper\nScreen-wrapping arcade action\nFlood It\nFlood the board\nCrosswords\nSolve crossword puzzles\nROTA\nGravity bends beneath your feet\nHnefatafl\nPlay the game\nTunneler\nTank digging battle game\nMore Games\nDeveloper Tools\nTranslation Editor\nTranslate and localize applications and libraries\nAurea\nFlatpak metainfo banner previewer\nTwine\nTwine is an open-source tool for telling interactive, nonlinear stories\nD-Spy\nAnalyze D-Bus connections\nTurboWarp\nMake games, animations, and stories\nAndroid Studio\nIDE for Android app development\nMore Developer Tools\nScience\nGaia Sky\nExplore the universe in 3D\nPhotometry\nView photometric files\nCitations\nManage your bibliography\nCoulomb\nElectronic circuit simulator\nSpace Launch\nRocket launches tracker\nPoMiDAQ\nView and record videos from UCLA Miniscopes\nMore Science\nSystem\nWarehouse\nManage all things Flatpak\nBouncer\nKeep the riffraff out!\nFootage\nPolish your videos\nPtyxis\nContainer-oriented terminal\nJunction\nApplication chooser\nBoxes\nVirtualization made simple\nMore System\nUtilities\nGitter\nCommunication product for communities and teams on GitHub.\nWaycheck\nShow Wayland compositor details\nSquiid\nAdvanced algebraic & RPN calculator\nPlaylifin Voyager\nTransfer playlists to/from Jellyfin\nErrands\nManage your tasks\nSecrets\nManage your passwords\nMore Utilities"
    },
    {
      "url": "https://www.howtogeek.com/apple-mac-mini-m4-review/",
      "text": "Summary\n- The M4 Mac Mini boasts impressive performance, fantastic build quality, and a minuscule footprint.\n- The base model's $599 price tag offers immense value, but steep memory and storage upgrade costs are major drawbacks.\n- After two months of usage, my M4 Mac Mini is as snappy as it was on the first day, and while macOS does have its share of quirks, its stability is praiseworthy.\nThe M4 Mac Mini is tiny, mighty, and whisper quiet. After using it for about two months, I've fallen in love with this wee machine despite macOS-related quirks. While it's a perfect entry point for Apple newcomers, it does have a few dings that, luckily, don't imperil its excellence.\nApple Mac Mini (M4)\n- Brand\n- Apple\n- Storage\n- 256GB\n- CPU\n- Apple M4 10-Core\n- Memory\n- 16GB\nPowered by an impressive M4 chip, the redesigned Mac Mini starts with 16GB RAM, 256GB SSD, a 10-core CPU, and a 10-core GPU.\n- Praiseworthy build quality\n- The M4 chip offers lots of performance for virtually any task while sipping power\n- A decent selection of speedy USB-C and Thunderbolt ports\n- The built-in speaker is usable in a pinch\n- 16GB of memory in the base model\n- Zero USB-A ports and SD card reader\n- Non-upgradable RAM and storage\n- Awkward placement of the power button\nPrice and Availability\nThe base M4 Mac Mini variant costs $599/£599/€699. For that amount of money, you're getting the M4 chip, which has four performance cores and six efficiency cores, a 10-core GPU, 16GB of LPDDR5X memory running at 7500MT/s, and a 256GB SSD. The total memory bandwidth is 120GB/s, and the built-in SSD provides PCIe 3.0-like performance.\nOther features you're getting with the base M4 Mac Mini variant include a Gigabit Ethernet port, two USB 3.2 Gen2 ports running at 10Gbps, and three Thunderbolt 4 ports topping out at 40Gbps. You can upgrade to 10 Gigabit Ethernet for $100, which is a bit pricey but nowhere near the insanely overpriced storage and memory upgrades.\nSpecifications\n- Brand\n- Apple\n- Storage\n- 256GB\n- CPU\n- Apple M4 10-Core\n- Memory\n- 16GB\n- Operating System\n- macOS Sequoia\n- Ports\n- USB-C 10Gbps x 2, Thunderbolt 4 x 3, HDMI 2.1, Gigabit Ethernet, 3.5mm Audio Jack\n- Graphics\n- 10-Core M4 GPU\n- Dimensions\n- 2in (H) x 5in (W) x 5in (D)\n- Weight\n- 1.6lbs\n- Audio\n- Built-in Speaker\n- Wireless\n- Wi-Fi 6E, Bluetooth 5.3\nRAM and Storage Are Insanely Expensive\nThe M4 chip also includes a dedicated, 16-core neural engine that offers 38TOPS of performance, which is a bit anemic compared to, for instance, the NPU found in the Qualcomm Snapdragon X Elite and Plus, which achieves 45TOPS.\nIt's great to see 16GB of memory on a base Apple Mac model. We've got Apple Intelligence to thank for this upgrade, which is probably Apple Intelligence's greatest feature by a long shot.\nOnce you start adding more memory and storage, the price balloons to comically high amounts. Apple's upgrade tax is ridiculously exorbitant. For instance, adding 8GB of extra memory or bumping up storage to 512GB will cost you $200 each.\nIn this day and age, when you can get a great 1TB PCIe 4.0 SSD for $55, such as the TeamGroup MP44L, charging $200 for 256GB of relatively slow SSD storage is preposterous.\nThat said, if you're mulling over whether to get a base or an upgraded model, I strongly suggest opting for more memory over more storage. You should get an external SSD instead.\nA fully specced M4 Mac Mini (32GB of RAM, 2TB of storage, and 10 Gigabit Ethernet) will set you back $1,899. If you're ready to pay that price, I suggest opting for the M4 Pro version instead, which packs a much more powerful CPU and GPU.\nThe M4 Pro Mac Mini's base model starts at $1,399. It includes the M4 Pro chip (8 performance and 4 efficiency cores, 16-core GPU, 16-core NPU), 24GB of memory, 512GB of storage, and a 10 Gigabit Ethernet port. The M4 Pro Mac Mini variant also includes three Thunderbolt 5 ports instead of the Thunderbolt 4 ports.\nOne of the Best Mini PCs\nThe Mac Mini had sported the same design for 15 years. Back in the day, the machine looked futuristic and sleek as heck. But over the years the SFF (small form factor) PC niche has begotten some seriously compact designs. In the last few years, the rise of the Mini PC form factor has made the Mac Mini look a bit chonky, despite its objectively compact dimensions.\nThe M4 Mac Mini changes that, and I've got to say that Apple nailed the redesign. While it's not groundbreaking, the new M4 Mac Mini is super compact, giving the current crop of mini PCs a run for their money.\nThe visual design is modern Apple to a T. It is minimalistic without any detail sticking out, yet attractive and well-suited for virtually any milieu. The rounded corners and the flat top featuring sharp edges give the machine a pleasant contrast between the two opposite tactile experiences.\nWhen you hold it, you realize just how dense the M4 Mac Mini is, despite its rather humble weight. The high density makes the machine feel extra sturdy and well-made. Talking about build quality, it's superb. The aluminum chassis has a splendid finish, the ports that are seamlessly cut into the body augment the feeling of a well-made device, and the bottom, made of high-quality plastic, is tightly connected to the rest of the body.\nThe bottom features a slightly elevated central surface encircled with air intakes. At its center, you've got an imprinted Mac Mini logo with the power button placed in the top right corner, which moves to the rear left corner when you place the machine on a surface.\nThe placement of the power button raised eyebrows, and for good reason. Not only do you have to reach for the rear of the device when you want to turn it on, but you also have to pick it up, which is a pain if you keep the Mini under your desk or any other hard-to-reach place.\nThat said, while it is a nuisance, it's minor. In the two months I've been using the device, I've only reached for the power button two times, not counting turning it back on after taking photos for this review. I usually keep it on 24/7 since it sips just a few watts of power and is inaudible on standby.\nThe new chassis is 5 inches long, 5 inches deep, and 2 inches tall (12.7 x 12.7 x 5.1cm), making the Mac Mini as compact as any mini PC. This allows you to place the machine virtually anywhere: on a desk, next to or in front of your monitor, on a shelf under the desk, behind or under the TV, or inside a cabinet. As long as you've got at least 5 inches of free space, you're golden.\nPersonally, I keep the Mini on a shelf below my desk, and it fits its surroundings perfectly. Its unimposing yet cold, gray metal finish is perhaps a tad too sterile. However, the visual design, especially the embossed Apple logo on top, is distinct enough that the Mac Mini doesn't just feel like a plain, gray box at a glance. In other words, it's tucked away below the desk but still a distinct part of my desk setup.\nPorts-wise, the front has two USB-C 10Gbps ports, a 3.5mm audio jack, and a small LED light that emits white light when the Mac Mini is turned on.\nThe rear of the device houses three Thunderbolt 4 ports with 40Gbps bandwidth, a Gigabit Ethernet port, and an HDMI 2.1 port. The M4 Mac Mini supports up to three monitors—two 6K@60Hz and one 5K via Thunderbolt or 4K via HDMI. Alternatively, you can run two monitors, one 8K and one 5K@60Hz. My 34-inch, 1440p, 100Hz ultrawide monitor has been working perfectly over the HDMI port.\nWhile having even a single port on the front is new for the Mac Mini, I'd love it if Apple placed a couple of USB-A ports on top of the two USB-C ports or if a couple of USB-A ports on the back replaced one Thunderbolt port. After all, every previous Mac Mini featured USB-A ports; having them gone is a clear downgrade. USB-C is great, but considering that most keyboards and mice use USB-A ports, you'll have to use dongles, which is never an optimal solution.\nAnother omission I'm annoyed with is the lack of an SD card slot. I understand that the Mac Mini lineup ditched the SD card slot back in 2018, but it's baffling that a device popular among creatives and professionals doesn't come with one.\nI use both a USB-A mouse dongle and a USB-A card reader, so I had to get two USB-C-to-USB-A adapters and hook them on the front of the device, which looks rather messy, as you can see in the photo below. I could've placed the mouse dongle on the rear of the device, but since I need the SD card reader on the front for easy access, I decided to hook both to the front USB-C ports.\nAdding an external SSD makes the setup even more ugly, but hey, it's form before function and all that jazz. Besides, I keep the Mini below the desk, so I don't have to look at the dismal sight while working.\nServiceable Thermals and Boatloads of Performance\nThe M4 chip in the latest Mac Mini impressed me during the first few days of ownership, and it continues to dazzle me. It's an outstandingly efficient powerhouse. The four performance and six efficiency cores combo give you boatloads of performance no matter the use case.\nIt's exemplary under heavy loads, like when editing photos or videos or running benchmarks, and phenomenal during everyday use. Browser tabs open instantly, I switch between open apps in the blink of an eye, and I've never encountered a stutter or a freeze.\nAs you can see from the benchmark numbers below (higher is better), the M4 outperforms both the Ryzen 5 5600X powering my desktop PC and the Z1 Extreme inside my ASUS ROG Ally.\n|\nApple M4 |\nAMD Ryzen 5 5600X |\nAMD Ryzen Z1 Extreme |\n|\n|---|---|---|---|\n|\nCinebench 2024 Multi-Core |\n960 |\n646 |\n731 |\n|\nCinebench 2024 Single-Core |\n173 |\n94 |\n97 |\n|\nGeekbench 6.4 Single-Core |\n3668 |\n2204 |\n2502 |\n|\nGeekbench 6.4 Multi-Core |\n14852 |\n9547 |\n10674 |\n|\nBlender Monster |\n113 |\n66 |\n79 |\n|\nBlender Junkshop |\n73 |\n48 |\n55 |\n|\nBlender Classroom |\n50 |\n33 |\n40 |\nWhile both CPUs are far from the flagship, even high-end, category, they're still fairly capable processors offering lots of power. The most striking aspect of the M4 is its single-core performance, thanks to which the M4 Mac Mini feels so snappy during regular use.\nRegarding the GPU, it's not as outstanding as the CPU, but considering its humble design, the numbers are far from disappointing.\n|\nApple M4 GPU |\nNVIDIA RTX 3070 |\nRadeon 780M (Z1 Extreme) |\n|\n|---|---|---|---|\n|\nCinebench GPU |\n3898 |\n9992 |\nN/A |\n|\nGeekbench GPU |\n57373 (Metal) |\n129479 (OpenCL) |\n32901 (Vulkan) |\n|\nBlender Monster |\n523 |\n1435 |\n133 |\n|\nBlender Junkshop |\n235 |\n892 |\n60 |\n|\nBlender Classroom |\n294 |\n814 |\n67 |\nI got 45 frames per second on average in the Shadow of the Tomb Raider benchmark at 1080p and with the High preset applied. Nothing to write home about, but more than solid for integrated graphics that uses about 15W when running demanding 3D games.\nIn the two months I've been using the M4 Mac Mini, I've heard the fan only on a couple of occasions. The first time was during the first week of ownership when I tortured it with all kinds of benchmarks, with only Cinebench being able to push the fan enough to make it audible. While I had thought that the fan didn't spin at all during light usage, I've found out that it always runs at about 1,000 RPM, but I simply cannot hear it even when I put my head right next to the chassis.\nThat said, my workflow doesn't include extremely heavy loads. I use Google Docs to write articles, keep Chrome and Firefox open at all times, each with at least a couple of dozens of tabs open, and edit photos in Lightroom and (very rarely) Photoshop. If this is similar to your day-to-day workflow, you can rest assured that you won't hear a peep from the M4 Mac Mini.\nLast but not least, thermals are fine but far from impressive. That is understandable, considering the thing's size and the cooling fan's dimensions. I saw the CPU temperature reach about 85 degrees Celsius during the Cinebench multi-core benchmark, with the hot spot usually staying below 95 degrees Celsius. It's a bit high for my taste but inside the safe range.\nI noticed that the thermals were lower when I ran Cinebench and Blender at the same time, showing that the fan can keep the M4 under 90 degrees Celsius when it ramps up, but it looks like Apple favors silent operation over lower thermals. I don't mind it. I'm fine with lower fan speed and whisper-quiet fan performance as long as the CPU doesn't go above 100 degrees Celsius.\nRegarding other components, the SSD reaches PCIe 3.0-like read and write speeds. It is far from exceptional but more than fast enough for daily tasks.\n16GB of memory is enough for my workflow. For instance, I usually keep Chrome and Firefox open at the same time with 50+ tabs across the two browsers, with Finder, Lightroom Classic, Spotify, and a couple of other apps also open in the background, and I've never lacked memory.\nAs you can see below, the amount of memory used sits at around 12.5GB. This gives me a fair amount of breathing room when batch-editing photos in Lightroom, during which the Mac Mini can use almost 15 gigs of memory. This, luckily, doesn’t cause hiccups, freezes, or performance issues.\nThe Wi-Fi 6E chip functions perfectly, and I've not encountered any Wi-Fi-related issues. I regularly get about 400Mbps in Google Speed Test. This aligns with the numbers I'm getting on my ROG Ally and S21 FE, which come with Wi-Fi 6E and Wi-Fi 6, respectively.\nAs for the Ethernet port, I maxed out my 500Mbps connection during testing, and I didn't have any problems when my Mac Mini was connected to the web via cable. That said, I prefer using Wi-Fi because I don't need a wired connection on the Mac Mini, unlike on my Windows PC, where I need Ethernet for gaming and local game streaming.\nBluetooth performance has been near-perfect during the last two months. I have my keyboard (Lofree Flow84) and speakers (Edifier R1700BT) connected via Bluetooth to the Mac Mini, and I've yet to encounter issues. The sound quality isn't inferior to that of my Windows PC, which has the same pair of speakers connected via cable. I can also say that the audio lag is low enough not to notice it when watching videos.\nLast but not least, the Mac Mini's built-in speaker is tinny with just a teeny hint of bass, but it's surprisingly loud and useful in a pinch. Any decent pair of computer speakers will best it, but if you don't have any, the built-in speaker is more than usable.\nWindows Users: Be Not Afraid\nNow, the hardware here is exemplary, but as a veteran Windows user, macOS was the biggest hurdle I had to surmount in order to keep enjoying this tiny powerhouse. Which I did, after I \"broke in\" macOS.\nI switched to macOS because I wanted a stable OS for work, and while macOS has its share of quirks, it's as stable as a fortress. That said, the first few weeks of using it were a bit rocky, but after I accepted that it wasn't Windows, my experience started to improve.\nAfter I realized that I don't have to close apps when I'm done with them, that the Dock is more useful when hidden, that Mission Control is a killer feature once you map it to a hot corner, and that I don't have to minimize every app I'm not actively using, I started to get less frustrated with my new work OS and even began to enjoy it.\nCompared to Windows, macOS is in another league in terms of stability. I've encountered zero restarts and freezes over a period of two months, during which I've had about five or six restarts on my Windows PC I use for gaming and during off-work hours.\nAlso, virtually every app I've used has been bug-free, with only Finder and Preview giving me regular troubles. The former does crash occasionally and sometimes refuses to let me select any of the tabs on the left side. The latter occasionally refuses to close the Adjust Color tab and has issues saving my edits.\nI still game on my Windows PC and switch to it after work because I want to continue using the Mac Mini and macOS as my dedicated work machine and OS. It might sound silly, but using macOS only for work did improve my productivity.\nMore Value Than Any Windows Mini PC\nRegarding the competition, the Windows mini PC market is in a great place right now, with a nice selection of mini PCs. You can get a similarly powerful mini PC running Windows (or Linux, if you prefer) for about $600. The kicker is that those PCs come with more memory and storage, but you cannot get a Windows mini PC for around $600 that matches or surpasses the M4 Mac Mini in performance or power efficiency.\nThe Beelink SER8 is probably the best Windows alternative. It offers more RAM and storage and a Ryzen 7 8745HS CPU that's slightly slower in multicore loads and has noticeably inferior single-core performance. The SER8 is also louder under load, and the 8745HS uses much more power during heavy workloads (more than 60W). The SER8 also has a poorer port selection and needs an external power brick.\nThe GMKtec M2 Pro is another $600 Windows Mini PC, but this one packs a much less potent Intel Core i7-1195G7 and has less impressive build quality, higher power usage and noise, and fewer ports. Lastly, there's the Minisforum UM690 Slim, which also comes with an inferior CPU, guzzles more power, is louder, and can't match the M4 Mac Mini in terms of build quality.\nOn the other hand, mini PCs featuring the latest and greatest mobile CPUs from Intel and AMD are much pricier. For instance, both the GMKTec EVO-X1 and the Beelink SER9 Pro pack the excellent Ryzen AI 9 HX370 but also cost north of $1,000.\nYou should also keep in mind that the M4 Mac Mini goes on sale on third-party sites, such as Amazon (it's discounted to $569 on Amazon while writing this review), and you can also snag it for $499 with a student discount. In other words, the M4 Mac Mini provides more value at $600, let alone at $500, than similarly priced Windows mini PCs.\nShould You Buy the Apple M4 Mac Mini?\nI find the M4 Mac Mini a wondrous machine for daily use. It has a tiny footprint, performance to spare, and whisper-quiet operation. It's not perfect, but it provides tons of value and can tackle anything you throw at it.\nmacOS took a couple of weeks to get used to, but once the adjustment period ended, I found that I quite liked Apple's OS. It's ridiculously stable and performs near-flawlessly. While it's got its share of quirks and bugs, I've managed to fix and circumvent most of them with third-party apps and some tinkering in Terminal.\nI can wholeheartedly recommend the latest Mac Mini to everyone looking for a powerful and efficient mini desktop computer suitable for light use but also for heavier loads such as photo and video editing. My only advice is to avoid paying for more storage and get an external SSD instead. It's better to spend your cash on more memory since an NVMe SSD packed inside a Thunderbolt M.2 enclosure can give you a similar level of performance to the built-in SSD for less cash.\nApple Mac Mini (M4)\n- Brand\n- Apple\n- Storage\n- 256GB\n- CPU\n- Apple M4 10-Core\n- Memory\n- 16GB\nPowered by an impressive M4 chip, the redesigned Mac Mini starts with 16GB RAM, 256GB SSD, a 10-core CPU, and a 10-core GPU."
    },
    {
      "url": "https://www.howtogeek.com/what-is-an-immutable-linux-distro/",
      "text": "Quick Links\nSummary\n- Immutable Linux distributions are read-only operating systems that don't allow writing to the root file system.\n- These distros are more secure, reliable, and stable than ordinary Linux distros but also more complex to use.\n- Servers, container environments, and handheld devices benefit from immutable operating systems.\nThe Linux world is always evolving. There's one recent concept that's causing quite a stir: immutable distros. Imagine a Linux distribution that's unchangeable. Sounds like a limitation? What if that brings actual benefits for you as a Linux user?\nLet's delve deeper into the world of immutable operating systems and discuss whether they're the right choice for you.\nWhat Is an Immutable Linux Distribution?\nAn immutable Linux distribution is an operating system (OS) that is read-only at its core. That means you can't easily modify the OS. This includes the file system, directories, applications, and even configurations. Even as an administrator, you can't make any modifications to the distribution.\nIf something gets changed in an immutable distro, it's only temporary and reverts when you reboot. That's why these OSes are called \"immutable.\"\nWhat Are the Advantages of Immutable Distros?\nWhy should someone consider an immutable Linux distribution over regular ones? That's because these distros come with some extra perks due to their immutable nature. Let's discover some of them.\n1. Enhanced Security\nOne of the reasons many regular users prefer Linux to other operating systems is due to its security. But that doesn't mean your Linux system is immune to vulnerability (especially if you're not following the best security practices).\nImmutable Linux distributions offer an additional layer of security by preventing unauthorized modifications to the system, making them more resistant to attacks.\nSuppose the wrong person gets administrative privileges on your system. Now they can tamper with it as much as they want, if it's a normal Linux system. But in immutable distros, even the administrator can't modify the system files.\nThis reduces the attack surface for malicious people since they can't install malware or compromise the system. Your computer becomes more secure and resists unauthorized changes.\n2. Easier Maintenance\nImmutable distros are easier to manage and deploy. You don't need to take care of complex upgrade processes, dependency issues, or managing system state.\nUpdates don't work on the live system and only work after you reboot. This reduces the chance of messing something up during an update, which is a common occurrence.\n3. Atomic Updates\nThese distributions follow a different approach when updating the OS. Instead of treating the updates package-wise, updates are done throughout the whole OS. In other words, the entire OS is treated as a single indivisible unit. If there is any kind of failure during the update, the system rolls back to the previous state.\nAnother interesting aspect is the image-based upgrade process. During the update, the system creates a new image in a separate partition. All the updates take place in that new image while you're using the existing image. In the next boot, you're booted into the new and updated image instead of the old one.\n4. Improved Reliability\nYou or others can't modify the file system. So unlike a normal Linux distribution, you can't permanently break these operating systems easily. Even if you accidentally or purposefully break something, it gets fixed in the next reboot. Third-party programs can't tweak anything behind your back or erase any important system element that could make your system unstable.\nThis also means that you can't run any dangerous Linux commands, such as the sudo rm rf /*\ncommand, that would harm your system. Overall, immutable distros are way more reliable.\nHow Does Software Installation and Updates Work on Immutable Distros?\nIf immutable distros are read-only, how do you install applications or update them? Most, if not all, immutable distros use Flatpak, AppImages, or Snaps for managing software, which are self-contained package systems. You can install and run these packages without modifying the file system.\nThese universal package formats come packed with all the necessary dependencies and libraries so that they don't have to rely on system libraries. They are also isolated from your operating system.\nSome immutable distributions use a technique known as \"layering\" to install packages. In this method, you install applications on a dedicated layer on top of the read-only base system.\nThis means you have access to the distro's package repositories to install the packages. But instead of using traditional package managers like APT or DNF, you use specialized tools to manage packages within the layering system. These layered packages are kept when you update your system and then get added to the updated image after you reboot.\nAnother option on some operating systems is installing apps through containers such as Distrobox. You install your software in the container on top of the main distro. This allows you to install and use programs not available in the official repositories.\nBest Use Cases for Immutable Distros\nImmutable distros are not as rare as you might expect. In fact, Steam Deck uses an immutable Arch Linux-based distribution called SteamOS. Likewise, a lot of handheld devices make use of immutable distros due to atomic updates.\nBut these aren't the only use cases for these distros. Organizations requiring high security and reliability often opt for immutable distros. Especially in server environments where you need to ensure that the server configurations remain stable and secure, these distros can help you achieve that.\nDevelopers can make great use of these systems to create isolated and reproducible testing environments. DevOps engineers can also deploy software in a consistent environment, reducing overheads in continuous integration/continuous deployment (CI/CD) pipelines.\nImmutable Linux distros are often used for containerized environments (like Docker and Kubernetes) to make sure you can maintain and scale applications in a predictable and consistent container runtime environment.\nDrawbacks of Immutable Linux Distros\nOkay, maybe you're convinced about using immutable distros, or maybe you aren't. You've only seen the good so far. Let's see some of the complexity issues that come up with these operating systems.\nThe first thing is, of course, the learning curve. Learning Linux can be a bit difficult on its own. Even if you're already experienced with Linux systems, you still need to learn about things that immutable distros do differently. You'll also need to refine some of your workflow, which can be a bit time-consuming at the beginning. And if you're coming from Windows or macOS? That can be a daunting experience.\nUpdates not taking place on your active system and only applying after a reboot can be reliable. But that also means you must reboot the system to get the updated packages. However, some distros do allow you to apply the updates to your live running system. Another problem you face is juggling between several systems since these distros create a separate bootable system for updates.\nInstalling software also doesn't work the same as using traditional package managers. If you want to install apps not available as Flatpaks or other universal formats, you need to install a whole new distro in a container just to use a single app. That doesn't sound so good.\nIn addition, you can't write anything to the system. That includes editing the configuration files. But what if that's a necessity for you? You still can't do that. Some distros allow writing to the /etc\ndirectory, but that's about it.\n4 Immutable Linux Distributions to Get You Started\nIf you'd like to get your hands on an immutable Linux distribution to test the waters yourself, here are four you can try right now:\n1. NixOS\nNixOS is a completely reproducible immutable Linux distro. You use a configuration file that includes all the services, options, packages, partition layout, and other stuff you need to build your system. You can then use this config file to create as many NixOS systems as you like, replicating your choices every time.\n2. Vanilla OS\nWhat if you could run multiple Linux distros on a single system? That's Vanilla OS for you. You can access different subsystems like Arch, Fedora, openSUSE, or Alpine to install specific software available in those distros. For that, you use the container for the particular distro. Every time you launch the software, the system runs the container and opens the app.\n3. Fedora Silverblue\nThis is Fedora Workstation's immutable spin. Most of the experience is identical to the regular Fedora version. With every new Fedora release, you also get a new release for Silverblue. This version is more suited for testing and development in a container-based OS.\n4. blendOS\nblendOS is an Arch-based distro that supports multiple package managers, such as APT, Pacman, DNF, YUM, and Yay. You can either use its own package manager, blend, or the other ones you're familiar with using container systems.\nIs an Immutable Distro Right for You?\nSo should you use an immutable distro? That depends on whether you actually need it or not.\nFor scenarios that require high security, reliability, and stability, such as cloud infrastructures, containerized environments, and servers, these make a lot of sense. Systems not meant for customization and tweaking (appliances, for example) can benefit from these distros.\nBut for regular desktop use, immutable distros may not be a good choice. Some of the simple stuff like installing software is much more complex than in a regular distro. You need special workarounds since you can't access the root file system.\nSome of the advantages that immutable distros come with are also available in regular Linux distros. You can use Btrfs to roll back to the previous state of a package or even the whole operating system. Installing universal package formats on any Linux flavor is also possible. While more secure in certain ways, these distros are still vulnerable to cyberattacks and malware.\nConsidering all the pros and cons, you might as well try one of the immutable Linux versions for yourself in a virtual machine to see if you like them.\nMore Security and Reliability but With More Responsibility\nAre immutable Linux distributions the future of Linux? Not likely. They aren't going to replace regular Linux systems any time soon. Not for regular users at least. But with numerous advantages, these are definitely suited for certain niche users and IT organizations.\nIf you're a Windows user interested in Linux, it's easy to try Linux without actually leaving Windows."
    },
    {
      "url": "https://www.howtogeek.com/mini-pcs-you-can-buy-with-linux-preinstalled/",
      "text": "Ready to ditch the setup headaches and jump straight into Linux? With a mini PC that has Linux preinstalled, you can skip the technical fuss and start exploring right away.\nThink of a mini PC as a desktop computer that's been shrunk down to about the size of a thick book. Despite their small size, they pack enough power for everyday computing tasks like web browsing, office work, and media streaming.\nWhether you're a newbie or a pro, these five mini PCs with Linux preinstalled will have you up and running in no time.\nWe haven't reviewed all of these products ourselves, so do your due diligence in shopping. Read independent reviews and research manufacturer warranty and return policies before making a purchase.\nSystem76 Meerkat\nSystem76's Meerkat is a tiny powerhouse, built specifically for Linux, that comes with your choice of two Linux distributions (often called \"distros\"—different versions of Linux with their own unique features): Pop!_OS or Ubuntu. Pop!_OS is System76's own version of Linux, designed to be beginner-friendly.\nThe Meerkat offers impressive performance in a compact package, backed by System76's excellent customer support. However, it's on the pricier side, with a starting price of $799.\nPurism Librem Mini\nIf privacy is your priority, the Librem Mini has you covered with its robust security features. It runs PureOS, a security-focused version of Linux, and comes with physical kill switches for your camera, microphone, Wi-Fi, and Bluetooth. These switches act like master power buttons for each component.\nWhile the privacy features shine, the Intel Core i7-10510U processor (the computer's brain that handles all calculations and tasks) is showing its age, and the integrated graphics (built-in hardware for handling visual tasks) aren't great for anything beyond basic use.\nPureOS is also quite strict about only using open-source software (programs whose code is freely available for anyone to view and modify), which might limit your options.\nWhat Is a Physical Kill Switch, and Does Your PC Need One?\nA physical kill switch puts a hard barrier between your hardware and hackers.\nTUXEDO Nano Pro Gen 13\nThe TUXEDO Nano Pro GEN 13 comes with modern AMD Ryzen processors and plenty of room for expansion. You can add up to 96GB of DDR5 RAM. DDR5 is the newest generation of RAM (Random Access Memory) technology that's faster and more energy-efficient than previous generations. It also has two M.2 slots for SSD storage.\nThe main drawback? It's not exactly budget-friendly, and since TUXEDO is based in Germany, shipping times to other countries can test your patience.\nTUXEDO Computers has also developed its own Linux distro, TUXEDO_OS, a modified version of Ubuntu, to provide an operating system (OS) specifically optimized for its hardware. It features a customized Linux kernel (the core part of the OS that controls how hardware and software interact) designed to improve performance, power efficiency, and compatibility on their machines. This makes it a great choice if you want to have the most optimized experience on their hardware, knowing that your OS was made for your machine.\nHowever, if you prefer a more widely supported Linux distro with a larger community and broader software compatibility, sticking with standard Ubuntu or another mainstream distro might be a better option.\nBeelink Mini S12 Pro\nThe Beelink Mini S12 Pro proves you don't need to break the bank for a capable Linux mini PC. It features an Intel Alder Lake N100 processor with 16GB of RAM and 500GB of storage on an SSD.\nOne nice feature is its ability to drive two 4K displays (ultra high-resolution screens) at the same time, perfect for multitasking or entertainment. To keep things cool, it uses a combination of a quiet fan and a heat pipe system (think of it like a tiny radiator that moves heat away from sensitive components). The whole thing measures just 115x102x39mm—about the size of a small book, and weighs only 280g, making it perfect for tight spaces.\nShould You Replace Your Laptop With a Mini PC?\nA mini PC could save you money and provide a more productive environment compared to a laptop.\nBeing a lesser-known brand comes with some trade-offs though. Linux support isn't as polished as with more established names, and some users have reported Wi-Fi issues that require extra setup to resolve. While the build quality is decent, it reportedly doesn't quite match the premium feel of pricier options.\nBOSGAME E2\nThe BOSGAME E2 strikes a solid balance between features and affordability. It’s powered by an AMD Ryzen 5 3550H processor and comes with 16GB of RAM, paired with a 512GB NVMe SSD (a type of SSD that connects directly to the motherboard for even faster speeds). You can also connect up to three displays using its HDMI and USB-C ports. On top of that, it supports Wi-Fi 6E, giving you access to the 6 GHz band for faster speeds and less interference compared to older standards. It isn't as cutting-edge as Wi-Fi 7, but it's still new enough to future-proof you for a while.\nHowever, the processor is a few generations old, meaning it might struggle with the most demanding tasks. Similar to some of the other mini PCs on this list, the BOSGAME E2 is a lesser-known brand, which means it also suffers from weaker customer support compared to more established names like System76. Additionally, its cooling fan can get quite noisy under heavy loads.\nChoosing a Linux mini PC? Prioritize your needs. Love the compact size but unsure whether to choose a mini PC or a laptop? Find out which is right for you here. Also, consider which included Linux distro is right for you—Ubuntu suits beginners, while others may require more expertise,"
    },
    {
      "url": "https://www.howtogeek.com/asus-rog-ally-review/",
      "text": "Quick Links\nSummary\n- The ASUS ROG Ally is a powerful handheld gaming PC with access to a wide range of PC games, impressive screen and audio, and comfortable controls.\n- However, it suffers from poor battery life, typical Windows 11 PC gaming issues, and concerns about thermal failures with the SD card.\n- Despite its flaws, the Ally is readily available in the US and overseas, making it a viable option for those unable to get the Valve Steam Deck.\nThe ASUS ROG Ally is the first serious contender to the Valve Steam Deck's handheld PC gaming crown. While ASUS is no spring chicken in the hardware business, and the Ally looks good on paper, is it actually any good?\nAsus ROG Ally\n- Dimensions\n- 28.0 x 11.1 x 2.12 ~ 3.24 cm (11.02\" x 4.37\" x 0.83\" ~ 1.28\")\n- Number of Games Included\n- 1 + Game Pass Ultimate Voucher\n- Playing Time\n- 45 mins to 3 hours (tested)\n- Brand\n- ASUS\nUnleash portable power with the ASUS ROG Ally! This premium handheld gaming PC delivers AAA gaming performance, stunning visuals, and seamless compatibility with your favorite platforms. Play anywhere, anytime.\n- Weight\n- 608g (1,34lbs)\n- Chipset\n- AMD Ryzen™ Z1 Extreme APU\n- RAM\n- 16GB LPDDR5\n- Storage\n- 512GB PCIe® 4.0 NVMe™ SSD\n- Wireless Connectivity\n- Wi-Fi 6E(802.11ax) (Triple band) 2*2 + Bluetooth® 5.2\n- Display\n- 7-inch, FHD (1920 x 1080) 16:9, 120Hz, IPS\n- Graphics\n- AMD Radeon™ Graphics (AMD RDNA™ 3, 12 CUs, up to 2.7 GHz, up to 8.6 Teraflops)\n- Ports\n- ROG XG Mobile Interface and USB Type-C combo port, 3.5mm Combo Audio Jack, UHS-II microSD card reader\n- Battery\n- 40WHrs\n- Incredible performance\n- Access to any PC game that runs on Windows 11\n- Amazing screen and audio\n- Comfortable with great controls\n- Borderline unusable battery life\n- Typical Windows 11 PC gaming issues\n- SD card thermal failure concerns\nPricing & Availability: Surprisingly Easy to Find\nThe ROG Ally with the Z1 Extreme APU is priced at $699 in the U.S., with the upcoming Z1 priced at $599, albeit with a significantly weaker GPU. It's available both online and in retail stores. This includes ASUS' own online store and brick-and-mortar outlets such as Best Buy.\nUnlike the Valve Steam Deck, and more in line with the Nintendo Switch, the Ally seems to be readily available in the US and in overseas territories. That isn't too much of a surprise given that ASUS is an established global hardware brand. It does mean that for some folks the popular handheld from Valve isn't an option while ASUS' Ally is freely available.\nSpecifications: Getting to Know the Ally\nThe ROG Ally is a handheld PC that runs Windows 11. The model under review here has the AMD Z1 Extreme APU at its heart, with eight CPU cores and a GPU based on the latest AMD Radeon architecture—RDNA 3. Yes, this little handheld packs a more advanced generation of GPU technology than the Xbox Series or PlayStation 5 consoles. As standard, it offers a 512GB SSD (the one in my unit is made by Micron) and 16GB of RAM. At the time of this review, the Ally is the most powerful handheld PC you can buy, although slightly more powerful hardware is just around the corner, as you might expect. A future cheaper Ally model using a non-extreme version of the Z1 is on its way, so depending on when you read this, you should be mindful to make sure you buy the right model!\nApart from promising substantially more performance than its main competitor, the Valve Steam Deck, the Ally's other major selling point is that it's a modern Windows 11 system. This means that any game that runs on a Windows 11 gaming PC should run on the Ally, at least in principle. You don't have to worry about Linux compatibility layers, having access to game launchers other than Steam, or anything over and above the typical troubles that can rear up on any Windows gaming PC.\nThe Setup Experience: It Could Be Better\nUnboxing the Ally is uneventful, and frankly uninteresting. That's a good thing since despite what some brands might want you to believe, the unboxing experience is just a once-off impediment between you and your gadget. The box uses the minimum amount of material and paper, and it essentially contains the Ally itself and its 65W USB-C power adapter. The adapter has a generously long cable, which is an important feature.\nThe trouble starts once the Ally is plugged in and powered on. It's the same familiar Windows 11 onboarding and setup you get with any new laptop or other pre-loaded Windows device, except you have no mouse and keyboard and have to do everything on a 7-inch screen using touch input. Of course, if you do have a mouse and keyboard you can hook them up using a USB dock or hub and shave a substantial amount of time from the setup experience. I wanted to limit the setup experience to what's provided out of the box as a complete product, and the truth is that it was rather painful. There were numerous updates to do, and all of ASUS' custom software needed to deploy as well. Despite having access to gigabit fiber, I still had to set aside the entire afternoon, checking in on the Ally periodically to see if any input was needed from me. Mercifully, this is something you only have to do once. At least, until you need a factory reset or upgrade the SSD, but either way, it's a relatively small bump in the road.\nBuild Quality, Screen, Speakers, and Controls\nThe Ally is larger and thicker than a Nintendo Switch, and comparable to the size and weight of a Steam Deck. Actually holding it in my hands, the device was comfortable to the point where I never stopped to think about my comfort while playing, even during a four-hour session. The device felt neither cheap nor over-engineered. Overall, ergonomically, it was a pretty pleasant place to be. The rumble (or haptic feedback, if you prefer) was middling compared to the standard rumble you get in a Series X controller, but it still added decent texture to games like \"Forza Horizon 4.\"\nThe speakers left me speechless. Even without the excellent Dolby sound enhancements activated, it didn't seem possible for such small front-firing speakers to have such a wide sound stage or to reproduce so much of the audible sound range. While bass is limited by the laws of physics, of course, the soundscape taken as a whole was impressive, and thanks to the virtually silent cooling system, I never felt the need to use headphones if no one else was around to be bothered by the sound. With the Dolby enhancements on, the audio became literal black magic. While riding my camel through a crowd in \"Assassin's Creed Origins\" I could clearly hear the chatter of the villagers to the left and right of me. The immersion of the built-in speakers was perhaps the Ally's best party trick, and I haven't heard anything quite like it.\nThe final puzzle piece was the gorgeous display. It's a bright LCD 1080p panel with a 120Hz refresh rate and AMD Freesync, which means it can adapt to any arbitrary frame rate without tearing or stuttering.\nThe display offers LFC (Low Framerate Compensation) so that even if your FPS dips down into the high 20s you'll still have a smooth stutter-free experience. This turned out to be a genius move on the part of ASUS, since often the performance of games on the Ally would fluctuate within a narrow band (e.g. 45-60 FPS) without it being perceptible to me. It elevated the entire handheld gaming experience and made performance compromises more tolerable.\nThe Gaming Experience: It's Complicated\nI tried a lot of games on the ROG Ally. Between Steam, Epic Game Store, Ubisoft Connect, EA Play, Xbox Game Pass, GoG Galaxy, and more I have access to literally thousands of video games. I played classic DOS games like \"Jazz Jackrabbit\" through DOSBox (with some mild keyboard mapping) up to modern current-generation games like \"Cyberpunk 2077.\" With the existence of the Xbox Series S, I'm quite confident that no game that will run on this generation's base console configuration will be unplayable on the Ally, which does offer some assurances that the money you spend on one will last a few years.\nOlder games and even some newer games had no issue hitting the 120Hz limit, with many games from the PS3 era meeting or exceeding 60FPS. However, it's clear that the synthetic benchmarks and on-paper theoretical performance of the Z1 Extreme don't quite pan out in real-world gameplay. For example, using the PS4-equivalent \"Original\" settings (using 1080 reconstructed from a lower resolution, just like the PS4 version) in \"Horizon Zero Dawn\" in the 15W performance mode, the Ally struggled to match the 30FPS target of the original console. However, using the max-performance turbo mode pushed me comfortably into the 40-55 FPS range. Nonetheless, it's clear there's more performance to be had from this hardware, and ASUS' updates since release have improved performance on that front. However, so-called \"auto TDP\" mods in the ROG Ally community have shown that with smarter power management the performance and power usage of the Ally can be improved dramatically. We can only hope that ASUS is paying attention.\nWhile you can find optimized settings for many popular games online for the Ally, my approach was mainly to set games to their \"high\" preset, bump the texture quality up to fill the 4-6GB of VRAM you can currently allocate, and see what performance I could get in the performance and turbo modes. Based on the many games I played, you'll get a very playable experience with almost any games this way, so you can leave the fine-tuning for when you feel like it, if ever.\nASUS Software: Almost There\nOne of the things the Steam Deck is truly lauded for is its custom operating system and software that give you finely-grained control over the system. Unfortunately, ASUS' hands are tied in many ways when it comes to Windows 11, where the best they can do is to put some custom software on top of that vanilla Windows cake. For the most part, this worked really well. By pressing a dedicated hardware button, you can quickly bring up quick settings and change performance modes, control modes, the refresh rate, and other useful stuff. That panel is also completely customizable, which is great. Overall, ASUS' add-on software offers an amazing amount of customization, and if you put in the time you can craft exactly what you want with per-game control profiles and various other custom settings.\nUnfortunately, operating all these bells and whistles can be less than intuitive, and so I had to resort to checking every menu and sub-menu in ASUS' software to get a good handle on what was possible, or where some settings were hidden. It's a tinkerer's paradise, but if you just wanted to pick up and play it's not quite there. There are rumors of Windows 11 getting a future interface update specific to handheld gaming PCs, and of course, ASUS is still working on their own software, but as of this review, things are more than a little rough around the edges when you aren't actually playing a game.\nTechnical Difficulties\nWhile, for the most part, everything worked as expected with my Ally, some things didn't. In what must be a record for a Windows computer, I only saw one Blue Screen of Death (BSoD) in the time I spent with the machine and could not reproduce it. However, some features of the ROG Ally just didn't work as advertised, specifically, the frame limiter toggle in the quick settings simply did nothing. The only game it worked in for me was \"Horizon Zero Dawn,\" with all other games simply ignoring it and running at whatever frame rate they liked.\nMost worrying, however, was the apparent failure of my Ally's SD card reader. You may have read that some devices seemed to be frying SD cards or even the reader itself. Directly after the last firmware update, my Ally stopped being able to write to my 400GB SD card. At first, I thought the card had been baked as described, but putting it into other devices showed that it worked perfectly, and putting a fresh SD card into the Ally produced the same disk writing errors. I don't know if my unit has fallen victim to the hardware issue ASUS said can kill the reader, or if the update itself is causing issues, but be warned that if you plan on using SD cards at all, you may end up having to send your unit in for repairs. Mine had the (apparent) SD card reader failure in less than two weeks out of the box.\nBattery Life: The Dealbreaker?\nWhile I've been mightily impressed by the Ally overall and the general gaming experience and flexibility it provides, the elephant in the room is its 40Wh battery. With all the bells and whistles cranked in its 25W turbo mode, you'll get 45 minutes to an hour out of the Ally. Of course, as mentioned above, the 15W mode is the performance sweet spot, but even then a full battery only means about two hours of gaming time. That's not much, especially given the mild bit of friction in getting games started and configured. Playing older games like \"The Elder Scrolls Oblivion\" is perfectly viable in the 10W mode, where the total system draw seemed to hover around 13W, or in other words around three hours of gaming time. That's the range you're working with here: one to three hours.\nIf you're using the 10W Silent Mode and hear audio crackling, open the Dolby companion app, navigate to \"more settings\" and disable all Dolby enhancements. This relieves the power-starved CPU of that audio processing overhead, and makes games like Fallout New Vegas playable at the lowest power draw.\nMy way to get around battery limitations was to use a power bank. You need a model that offers at least 65W of USB-C Power Delivery (PD) and so I picked up a model that offers just under 80Wh of power. That's four hours of typical gameplay, or an additional two hours in turbo mode. The Ally can charge rapidly, so if you're playing in shorter sessions while on the go, a power bank can juice the unit up during your breaks. The ROG Ally supports bypass charging which means if it's plugged into a power source that delivers enough power, it bypasses the battery altogether, assuming it's fully charged. Playing directly from a power bank (or the wall) won't add to the wear and tear of the internal battery. I also chose to activate the Ally's \"Battery Care\" mode, which limits the charge to 80%. This will further extend the life of the internal battery, shifting the wear to the power bank.\nThe 40Wh battery here is definitely out of its depth, and you need to perform some fine-tuning of your game and power settings to find a usable balance. Unless I was actually out of the house and away from a power outlet, my Ally was plugged into the nearest outlet, whether I was on the couch or in bed. Using internal battery power should be a last resort, with external solutions like power banks offering the best option away from the mains.\nShould You Buy the ASUS ROG Ally?\nThe ASUS ROG Ally is a solid handheld gaming PC as of this review and offers broad compatibility with Windows games and class-leading performance. If you're already a Windows PC gamer, you won't be deterred by the usual set of difficulties. If you're looking for a console-like experience, the Steam Deck is a better bet, or perhaps hold out for the successor to the Nintendo Switch. However, neither of those options gives you access to the sheer number of games that are playable on a Windows PC.\nThe battery life is a genuine issue, and you should have realistic expectations around it. Investing in a suitable power bank is a good way to mitigate this. All-in-all, as long as you understand what the Ally is and is not, it's easy to recommend as a product in its own right.\nHowever, I can't ignore the fact that my unit fried its SD card reader in less than two weeks. Sure, I put the device through a lot to test it for this review, but that's likely only hastened the issue where it may have happened a few weeks later, based on my hours of play at the highest performance levels. ASUS has confirmed there's a thermal design issue, and they are working on a software fix that will essentially ramp up the fans. The problem is that the issue seems to be an inherent flaw of the SD card reader's position, and so ramping up fans (with more noise), (potentially) cutting performance to reduce temperatures, or physically fitting the reader with more thermal protection, may all just be ways to kick the can down the road. Not to mention, that in some cases it seems that SD cards themselves are being damaged by high temperatures, and the 400GB card I was using in my Ally was not exactly cheap.\nSo who should buy the ROG Ally? If you accept the rather dismal internal battery life, don't care about using SD cards, or are happy to roll the dice in that regard, then the ROG Ally is an easy recommendation. However, I can't shake the feeling that this is a device that needs a hardware revision to deal with a slightly under-baked (or is that over-baked?) design.\nAsus ROG Ally\n- Dimensions\n- 28.0 x 11.1 x 2.12 ~ 3.24 cm (11.02\" x 4.37\" x 0.83\" ~ 1.28\")\n- Number of Games Included\n- 1 + Game Pass Ultimate Voucher\n- Playing Time\n- 45 mins to 3 hours (tested)\n- Brand\n- ASUS\nUnleash portable power with the ASUS ROG Ally! This premium handheld gaming PC delivers AAA gaming performance, stunning visuals, and seamless compatibility with your favorite platforms. Play anywhere, anytime."
    },
    {
      "url": "https://www.howtogeek.com/how-to-use-your-steam-deck-as-a-linux-pc/#:~:text=The%20Steam%20Deck%20also%20features,Arch%2Dcompatible%20application%20you%20like.",
      "text": "Summary\n- Steam Deck can function as more than a gaming device, doubling as a PC with extensive customization and third-party tweaks.\n- Switch between Game Mode and Desktop Mode to get PC functionality for web browsing, office tasks, and more complex software.\n- Peripherals like a mouse and keyboard, along with a USB-C hub, provide a more productive and comfortable desktop-like experience.\nYour Steam Deck can do more than just play games. Valve effectively crammed a laptop into a handheld form factor, threw Linux on it, and left the system wide open for anyone to fiddle with.\nThe upshot of this approach is that you can use your Steam Deck like a regular PC, to browse the web, install third-party tweaks and tools, and even get some work done (if you’re not too busy playing games).\nThe Steam Deck Is a PC\nWhen you first turn on your Steam Deck, it boots SteamOS and enters Game Mode. SteamOS is a Linux distribution that’s authored and maintained by Valve, based on another distribution called Arch Linux. While Valve is bringing SteamOS to other devices (like the Steam-ified version of Lenovo’s Legion Go S), you can’t just download SteamOS like you can Debian, Ubuntu, or Arch.\nWith Linux under the hood, Game Mode serves as a touch- and controller-friendly way of interacting with the handheld, but it’s not the only way. The Steam Deck also features Desktop Mode, which allows you to use the handheld like any other PC running Linux.\nThis mode features a proper desktop environment with a taskbar, file explorer, and the freedom to install just about any Arch-compatible application you like. It also gives you free rein to make changes to SteamOS so that you can customize the way your handheld behaves with the use of third-party tweaks.\nTo enter Desktop Mode, press and hold the power button while in Game Mode. Select “Switch to Desktop” and wait a few seconds. Your Steam Deck will load for a few seconds, and then you’ll see a wallpaper, taskbar, and some desktop icons.\nUsing SteamOS in Desktop Mode\nTo get around, use your Steam Deck’s right trackpad or right thumbstick to move the mouse cursor. You can either apply pressure to “click” the trackpad or use the right trigger to click the mouse. To access the right-click context menu, use the left trigger.\nIf at any time you need to bring up the on-screen keyboard, hit Steam+X. You can use touchscreen, touchpad, or mouse-based typing to do things like enter web addresses, rename files, and search your drive. You can scroll through webpages, menus, and folders using the right trackpad.\nAt the bottom of the screen, you’ll notice a taskbar, which SteamOS refers to as the Task Manager. To the far left is effectively a Start menu, indicated by the SteamOS logo. Clicking on it will reveal a large catalog of preinstalled applications, sorted into categories. Use the right-click menu on any of these applications to add desktop icons, add them to your favorites, or pin them to the taskbar at the bottom of the screen.\nYour pinned items will appear to the right of the SteamOS menu, allowing you to quickly launch applications. Right-click on them to remove them. In the right-hand corner of the screen is the system tray which shows useful information like the time, charge state, and offers quick access to apps that are open.\nTo get back to Game Mode, use the “Return to Game Mode” desktop icon or click the SteamOS menu to click the arrow next to “Shut Down” and select “Log Out.”\nEssential SteamOS Applications\nSteamOS comes with a file manager called Dolphin, which provides quick access to handy locations in the sidebar and allows you to explore files and folders. It has a handy “Split” button at the top of the screen that places two locations side-by-side, perfect for moving or copying files from one place to another. You can use the right-click menu in Dolphin to do things like create compressed archives, open the Terminal in a specific location, or set images as your wallpaper.\nThe Discover application is the easiest way to install applications on your Steam Deck. It’s a graphical front-end for a package manager that allows you to quickly install a huge range of applications that will “just work” on SteamOS. You’ll find browsers like Firefox, utilities for transferring files, and even whole games in the Discover store.\nIf you want to install an application on your Steam Deck, we recommend checking the Discover store first (even if you’re following an online guide). The database is always growing.\nRegular old Steam is also available within Desktop mode, and it takes the same form that you’re used to seeing on a PC. It can be a little more reliable for doing things like finding and transferring screenshots and can even resolve compatibility issues with some games that refuse to load in Game Mode. You’ll find a handy shortcut to Steam in the system tray.\nWhat you regard as essential ultimately depends on what you’re using your Steam Deck for. A few other apps you might want to keep in mind include:\n- Screenshot utility Spectacle for screengrabs in Desktop Mode.\n- Terminal tool Konsole for running console commands.\n- System monitoring apps System Monitor and btop++\n- Text editors KWrite and Kate.\nFor more apps that could quickly become essential, check out our list of non-Steam apps that you should install on your Steam Deck. This includes wireless file transfer utility LocalSend, third-party launcher Lutris, and Game Mode tweak tool Decky.\nHow to Wirelessly Transfer Files Between Windows, macOS, Linux, and Mobile\nThis AirDrop killer works with anything.\nPeripherals Make Life Easier\nWhile you can do pretty much everything with your Steam Deck using trackpads, thumbsticks, and the on-screen keyboard, you’re going to have an easier time if you use some proper peripherals. The most obvious of these are a mouse and keyboard.\nFor best results, Bluetooth is your friend. Since the Steam Deck has a single USB-C port, using Bluetooth peripherals offers an easy, wire-free solution to typing and controlling the cursor.\nYou can connect a Bluetooth peripheral using the Bluetooth icon within the system tray while in SteamOS desktop mode. Put your mouse and keyboard into pairing mode and then click “Add Bluetooth Device” plus icon in the Bluetooth window that appears. Find your device in the list, click “Next” and wait. You may need to enter a PIN.\nWhile 2.4GHz dongles are another solution, the vast majority of them still use USB-A and require the use of the sole USB port. A wired USB connection will also work, but it has the same problem. The best remedy here is to grab a USB-C hub (also known as a dock) that can pass power through to your Steam Deck and provide access to a greater range of ports.\nWith a hub, you can connect a myriad of different devices using the single port on top of your Steam Deck. This allows you to connect an external monitor via HDMI, hook your handheld up to a wired Ethernet network connection, and add card readers or external NVMe drives (depending on the hub). It’s a great way to expand your device’s base storage, though it does tie your Steam Deck down somewhat.\nWe’d recommend a dock that’s built specifically for handhelds like the Steam Deck, since these are designed to hold your handheld upright in a manner that’s more conducive to desktop usage. Alternatively, you could always mount a hub on the back of your device and use pretty much any kind of stand to hold your Steam Deck in place.\n/best-steam-deck-docks/\nThe Best Steam Deck and ROG Ally Docks of 2024\nSometimes you just want to play your PC games on the big screen.\nDoes Desktop Mode Have Real Utility?\nIf you want to do more than “just” buy games from Steam and play them on your Steam Deck, you’ll need to use Desktop Mode in order to do it. While Game Mode is somewhat restrictive with a focus on user-friendliness, Desktop Mode opens the platform up to all kinds of things.\nFor example, you can install a full range of emulators on your Steam Deck relatively easily using the EmuDeck installer. This turns your Steam Deck into what is possibly the best portable emulation machine on the market.\nYou can also install the Xbox remote play app Greenlight to stream games from your console or Xbox Cloud Gaming. There’s an equivalent app for streaming gameplay from your PlayStation 5 to you Steam Deck. If you want the best possible remote play performance for playing PC games on your Steam Deck, you’ll want to install Moonlight on your Steam Deck so that you can stream with the aid of Sunshine on a PC.\nOn top of this, your Steam Deck is a portable PC. It can basically do anything a PC can, including running full-fat web browsers like Chrome to use web apps, stream services like YouTube or Netflix, and run office software like LibreOffice. These activities work best when paired with an external monitor and a set of peripherals, but they’re not a prerequisite (though I wouldn’t want to type at length using Valve’s keyboard).\nTo get a little more complex, you could even use your Steam Deck to do things like run a Jellyfin server to stream media. You can use both the Steam Deck’s internal display and an external monitor at the same time for more efficient multitasking. The Deck is powerful enough to run creative software like Reaper or Audacity to record instruments or podcasts.\nIt’s a full-blown PC, you just have to keep the main limitations in mind: it runs Linux, it’s battery-powered, there’s a single USB-C input, and using a traditional desktop environment without the use of additional peripherals isn’t ideal. On the flipside, it’s probably more powerful than your smartphone, and there’s no need to “jailbreak” anything to get started.\n-\nSteam Deck\n- Dimensions\n- 298mm x 117mm x 49mm\n- Playing Time\n- 2-8 hours of gameplay (content-dependent)\nThe Steam Deck LCD is, hands down, the best budget handheld gaming PC you can get, thanks to its phenomenal price, top-notch build quality, excellent software support, and pretty solid gaming performance.\n-\nSteam Deck OLED\n- Power Source\n- 50Whr battery\n- What's Included\n- Console, charger, carrying case\nElevate your gaming experience with the Steam Deck OLED. Immerse yourself in stunning visuals on the vibrant OLED display, while enjoying powerful performance and portability.\n-\nValve Steam Deck Docking Station\nValve Steam Deck Docking Station: Transform your gaming experience with the Valve Steam Deck Docking Station. Designed for seamless integration with the Steam Deck, this dock offers a range of connectivity options, including USB, HDMI, and Ethernet ports.\nIf you want a portable PC, you should probably buy a laptop. The Steam Deck isn’t going to win any awards for being a productivity-focused workhorse. The display is small, and the form factor is limited.\nBut if you want something for playing games and emulating retro titles on the go that you can also put to use as a “real” PC, the Steam Deck has some serious potential. Even just sitting on a desk, docked, as a secondary PC that runs Linux; Valve makes it worth your time to explore what’s possible."
    },
    {
      "url": "https://www.howtogeek.com/781784/what-is-integrated-graphics/",
      "text": "Quick Links\nIntegrated graphics refers to a GPU (Graphics Processing Unit) that's built into the same package as the CPU (Central Processing Unit.) In enthusiast computer circles integrated graphics is often derided, but this approach to GPU design has many important advantages.\nGraphics Needs Specialized Hardware\nModern computer graphics, with high-definition video and detailed 3D rendering in video games and professional applications, is a demanding job. While a CPU can create (\"render\") graphics, it lacks the right type of architecture to do it quickly and efficiently.\nThis is why we have GPUs, which are built from the ground up to be great at the sort of math you need to calculate the correct values of millions of pixels dozens or hundreds of times every second. Every computing device, from PCs to smartphones, has a GPU in it.\nThe only computers that don't have GPUs are usually \"headless\" servers that are remotely operated and only do work suited to CPUs. However, even that's changing, since GPUs are now being used to do things other than graphics, but that's a story for another day! Any computer that outputs to a display today almost certainly has a specialized GPU inside it.\nIntegrated vs. Dedicated Graphics\nWhen you buy a laptop or desktop computer, the specification sheet will often say that the computer comes with \"integrated\" or \"dedicated\" graphics. There's a big difference between these two approaches to including a GPU in a computer.\nA dedicated GPU means that the GPU has its own independent processor package. It has its own separate cooling solution. Dedicated GPUs also have their own power management hardware and memory. A dedicated GPU is like its own self-contained computer!\nIn a desktop computer, dedicated GPUs come on their own circuit board, generally known as a graphics card. The card slots into the computer's motherboard and often needs more power than can be provided through the card slot. So it may also have its own dedicated power connections from the computer's power supply.\nDedicated graphics in laptop computers sometimes come as a removable package, such as the (now discontinued) MXM laptop GPU modules. More commonly, they are soldered directly to the mainboard, but they are still dedicated as separate components from the CPU. With their own cooling, memory, and power.\nAn integrated GPU, on the other hand, has to share everything with the CPU. This is why it's often called an onboard GPU. It sits in the same processor package, is cooled by the same heatsink and heat spreader, and shares the same system memory as the CPU. The motherboard provides the display output hardware that allows you to hook up a monitor, but all the \"brains\" of the GPU are inside the CPU's package.\nThe Advantages of Integrated Graphics\nWith the exception of high-end CPUs, virtually all computer CPUs today have an integrated GPU. It's probably fair to say that the integrated GPU model is the most common GPU type out in the wild. There are a few good reasons why it's so popular, but as always there's a relatively short list of important ones.\nThe first is cost. It doesn't add that much cost to a CPU to also etch a GPU into your silicon real estate. Including a GPU in every GPU reduces costs in other parts of the system by far more than it increases the cost of the GPU itself. So systems that use integrated GPU are significantly cheaper than those with a dedicated solution.\nThe second major reason is complexity. This is especially relevant to laptop computers, where every cubic millimeter of volume matters. By integrating the GPU into the CPU package, laptops can be dramatically smaller, since you don't need all the extra supporting hardware to cool, power, and connect an entirely separate chip package.\nThe third pillar of integrated GPU design is power efficiency. It's much easier to manage the power draw of a single integrated chip than to balance the needs of two separate ones. Since the GPU and CPU are tightly integrated, they can make sure they fit neatly into the TDP (Thermal Design Power) of the CPU package.\nLaptops with dedicated GPUs usually also have integrated GPUs, the operating system will dynamically switch between the two depending on the application you're using. So you aren't burning through battery power by using a high-performance GPU while doing spreadsheets.\nThe Disadvantages of Integrated Graphics\nIf integrated graphics are such a good idea, why do we use dedicated graphics at all? The short answer is that dedicated cards have far more performance potential.\nA dedicated GPU can be physically bigger, has a much larger power budget, and can safely reach higher temperatures in operation. It also has access to specialized, high-performance memory designed specifically for the needs of graphics applications.\nFor a long time, integrated GPUs have been synonymous with poor performance, only good enough to use for basic productivity tasks, and limited multimedia. Gaming? Totally out of the question!\nThat's not really true anymore in 2022, since GPU technology has improved integrated graphics performance to the point where most users, including casual gamers, really don't need dedicated GPUs. However, it's still true that dedicated GPUs today are much faster than integrated ones.\nIntegrated Graphics and System-On-a-Chip Devices\nAnother type of integrated GPU is found in SoCs or System-on-a-Chip devices. SoCs don't just integrate the CPU and GPU into the same package, they also integrate the system memory, and often even storage!\nSince SoCs are designed with specific total performance targets in mind, the GPUs in them can be quite beefy. The Apple M1 SoC, for example, has more graphical power than a Playstation 4, while the CPU still manages to compete with high-end laptop CPUs.\nModern consoles like the PlayStation 5 and Xbox Series X integrate high-performance CPUs and GPUs into the same package, but they are designed to dissipate the massive amount of heat this causes from the ground up.\nWhich GPU Design Is Right for You?\nIf performance is the most important thing for you when it comes to graphics, then there's no doubt that you should buy a desktop computer with dedicated graphics. If battery life, cost, heat, and noise matter most to you, an integrated solution is likely what you need.\nDesktop users have the option to add a dedicated GPU to their system at a later date, assuming your motherboard has the correct slot and your power supply and chassis are up to it. So you can try out the integrated GPU on your CPU to see if it's good enough for your needs.\nUltimately, the most important thing is that you do some research about the performance capabilities of the integrated GPU your prospective CPU has. You may be surprised at just how much power is packed into that tiny processor."
    },
    {
      "url": "https://www.reddit.com/r/SteamDeck/comments/wirkk7/is_there_a_way_to_always_start_steam_deck_in/",
      "text": "The Unofficial Subreddit for the Valve Steam Deck! Find discussions, games running on Deck, hardware / software mods and much more! (Please read the rules and check megathreads before posting!)\nIs there a way to always start Steam deck in desktop mode?\nHi, sorry if this has been asked before, I searched on google and Reddit but didn't find any answers. My question is, is there a way to have the steam deck always boot to desktop mode without first going through big picture mode?\nI don't have any other OS installed.\nEDIT\nAfter some more digging I think I've found the solution, it unfortunately does require running a command instead of toggling a setting switch.\nPlease note, this breaks the ability to go back to gaming mode from desktop shortcut on my deck but there's a command to fix this as well.\nI ran the following command through ssh on the steam deck and it loads into desktop from shutdown and restart. This command most likely can be run directly on the steam deck terminal (Konsole) if you don't want to bother with ssh.\nto boot into desktop mode by default\nsteamos-session-select plasma-persistent\nto boot into gaming mode by default (and to fix inability to go back to gaming mode from desktop)\nsteamos-session-select gamescope\nI've stored the above 2 commands as bash executable files in ~/Desktop/ so I can easily click from desktop mode if needed without having to type them in Konsole.\nI don't know if this will persist through a system update."
    },
    {
      "url": "https://hypr.land/",
      "text": "July 28, 2025\nModern compositor\nwith the looks\nHyprland provides the latest Wayland features, dynamic tiling, all the eyecandy, powerful plugins and much more, while still being lightweight and responsive\nTLDR\nFeatures\nSmooth\nSmooth transitions. Eye-pleasing animations. Great performance. Highly responsive.\nEasy to configure\nLive reloading config. Easy configuration format. Sensible defaults. Great documentation.\nDynamic tiling\nAutomatic tiling that just works. Supports multiple fine-tuneable layouts, with even more as plugins.\nMemorials of the ricing legends\nHall of Fame\nJoin a great\ncommunity\nGet help from Distro Hoppers, Haiku writers,\nHydrohomies, and human_(probably)\nA huge thank you!\nOur sponsors\nHyprperks\nSubscribe for first-party configurations, priority support and to support the development. Fully optional, but crafted with love\nFirst-class support\nAlways working, actively developed, one-click-update\nEasy\nDesigned to stay out of your way, and let you do your thing.\nBeautiful\nCustomizable, with automatic theming for everything. Crafted with love from the Hyprland team\nRead while it's fresh!\nLatest news\nInstall now\nFor your favourite distro"
    },
    {
      "url": "https://www.howtogeek.com/more-mini-pcs-with-linux-preinstalled/",
      "text": "Mini PCs are awesome because of their versatility, and when you marry them with an open-source operating system like Linux, the possibilities are endless. But why install Linux manually when you can skip the image writing and get dedicated support by buying Linux-first?\nI've ordered these tiny PCs alphabetically, not by power or review ratings. While I haven't put them to the test myself, I do have first-hand experience with some of the manufacturers, and they're all well-established in the Linux computing world. In fact, some are sponsors of Linux projects and resources you know, like KDE and DistroWatch. Buying one is a great way to support the alternative operating system ecosystem.\n5 Kubuntu Focus NX Gen 2\nIf you're a fan of the KDE Plasma desktop environment and the Ubuntu development base, take note of the Kubuntu Focus NX Gen 2. It's a tiny PC that comes with Kubuntu Linux LTS preinstalled, exclusively.\nThe NX Gen 2 was announced in early 2023, so it's a couple of years old at the time of writing. When you configure your order, you have your choice in processors between an Intel Core i5-1240P or i7-1260P, which might have been bleeding-edge at the time, but Intel has since released two generations of chips.\nStill, the i7-1260P processor can be boosted up to a respectable 4.7GHz. It's able to support up to four 4K monitors at once, plus an external GPU simultaneously thanks to its Thunderbolt 4 ports. You can configure it with a maximum of 64GB RAM that uses the DDR4 standard.\nIf you like Kubuntu, you'll love the \"Focus\" variant of Kubuntu that's optimized for the hardware you're buying. I reviewed the Focus Ir14 Gen 1 and later the Ir15 Gen 2, and I now own the Focus Ir14 Gen 2, so I speak from experience when I say the built-in utilities for managing your processor, fans, and other hardware are great. There's a ton of development tools too, including preinstalled JetBrains Toolbox and a script for automatically installing the Anaconda machine learning suite.\nThe Focus NX Gen 2 starts at $795 for a base configuration, and it ships from the US.\nKubuntu Focus NX (Gen 2)\nThis mini PC gives you a bevy of USB-C, USB-A, and HDMI ports for maximum multitasking. It comes with an optimized version of Kubuntu Linux LTS edition featuring the popular KDE Plasma desktop environment.\n4 Laptop with Linux Intel NUC13\nThe Intel NUC13 sold by the Netherlands-based brand Laptop with Linux appears to use the same body as the Focus NX. However, you get a wider selection of processor choices, which are themselves 13th generation Intel chips rather than 12th-gen. You also have more RAM options, including no RAM at all if you prefer to bring your own memory.\nPorts-wise, the NUC13 has two HDMI 2.1 ports, two USB-C ports with DisplayPort 1.4a capabilities, as well as four USB-A ports. You also get a headset jack and a 2.5Gbps Ethernet port, and it comes with Wi-Fi 6 and Bluetooth 5.3 support.\nLaptop with Linux gives you a ton of options for preinstalled Linux distros, accessories, and other pre-configuration requests like disk encryption and software suites. You can choose not include a wireless card if you plan to install your own or keep your mini PC air-gapped or wired-only.\nConfusingly, the Laptop with Linux website indicates the NUC13 starts at $484, but in configuring it you must choose a boot drive size, the smallest of which adds $68 to the price. So expect to spend at least $552. If you're ordering to the US, international shipping charges are sure to put more pressure on your wallet, too.\nLaptop With Linux Intel NUC13\nChoose from three different Intel processors when you configure this mini PC, along with your choice of dozens of Linux distribution options.\n3 Slimbook One\nSlimbook, a Spain-based company, offers one of the more powerful options on this list. The Slimbook One sports an AMD Ryzen 7 8845HS chip. It also supports DDR5 RAM, configurable up to a whopping 96GB. It has two PCIE 4.0 slots for NVMe drives, and there are both HDMI and Display Port connector ports, plus two 2.5Gbps Ethernet jacks and an array of USB-C and USB-A ports. All easily mounted to the back of a monitor.\nThere's an impressive number of configuration options, too. Slimbook will configure a dual-boot setup for you with Windows 11 and a Linux distro of your choice, if you want that. Your distro choices includes the company's own Slimbook OS, which is based on Ubuntu, and comes in both GNOME and KDE Plasma flavors. In addition to some other popular options, there are a few more niche distros, like Kali Linux, TrueNAS, and Proxmox.\nAt the time of writing, the Slimbook One will run you about $642 for its base configuration. Don't forget it's in the EU, so if you're ordering from the US expect a bit of pain in the shipping department. If your needs are simpler, check out the Slimbook Zero, which uses a far more humble processor but still has a lot of customization options while being a lot more affordable.\nSlimbook One AMD Ryzen 7 8845HS\nThis mini PC comes with your choice of Linux distribution preinstalled, and it's configurable with up to 96GB of memory and 8TB of storage. Its two Ethernet ports and dual DisplayPort and HDMI ports will keep you connected however you like.\n2 Star Labs Byte Mk III\nBringing some interesting philosophies to the mix is the Byte Mk III tiny PC designed by Star Labs, a UK-based Linux-first device maker. The fanless mini has some uncommon features, including Coreboot and EDK II firmware as an alternative UEFI implementation, plus a dedicated firmware updater tool. It includes a one-year \"open\" warranty, meaning everything from swapping parts to replacing the firmware won't void your warranty.\nWhile it's one of the more unique mini PCs in this list, it's one of the less impressive in terms of raw power. Its Intel Core 3 N355 processor doesn't benchmark as well as others, though it is newer than any of the other chips in this list, so it's a decent choice if you don't need a ton of oomph. You can configure Byte with up to 32GB of DDR4 RAM and 10TB in total storage. You get a decent selection of popular distros, including Ubuntu, Elementary OS, and Manjaro Linux.\nThe Byte Mk III is as cheap as it gets in this collection of mini PCs, starting at $551. At the time of writing, it's only available for pre-order, but Star Labs is running a deal for free international shipping. That means my fellow US folks will want to snap the deal up if it's in your consideration.\nStar Labs Byte Mk III\nA Linux-exclusive mini PC that uses open-source UEFI firmware and a fanless, compact design. Choose between Ubuntu, Manjaro, and other popular distributions when you order.\n1 Tuxedo Nano Pro Gen 14\nWe talked about the Tuxedo Nano Pro in a previous list of Linux-first mini PCs, but it's since been updated to its 14th generation. It's an exciting update because buying one puts you a lot closer to the bleeding edge than most other Linux mini PCs out there.\nNamely, it's got an AMD Ryzen AI chip, your choice between the 5 340 and the more powerful 7 350 version. You can get between 16GB and 96GB of DDR5-grade memory, and up to 10TB of combined NVMe and M.2 SSD storage.\nThe Nano Pro comes with the company's custom Ubuntu-based KDE Plasma distro called Tuxedo OS, but you can also choose from a few others like standard Ubuntu, Ubuntu MATE, Kubuntu, and Xubuntu. Tuxedo will also optionally configure a Linux-Windows 11 dual-boot setup for you, or install a licensed Windows 11 virtual machine in VirtualBox, all for added fees, if you need access to Windows.\nAll of that juice comes with a price tag of $827 USD at its most humble configuration. That doesn't count taxes and shipping, and Germany-based Tuxedo Computers charges a €99 EUR flat rate for shipping to the US. That means you should expect to approach or break $1,000 if you spring for the Nano Pro while living state-side.\nTuxedo Nano Pro (Gen 14)\nBuy this mini PC with Tuxedo OS or the distribution of your choice to get on the Ryzen AI 300 train, but in Linux style. It supports up to four displays while weighing in at just over two pounds.\nIf none of these speak to you, don't forget you could always build your own tiny PC, in which case you'd get to choose your own operating system from the start. You can also just choose from one of the best mini PCs out there and then install the Linux distro of your choice on it.\nRegardless of which purchase you make or installation route you take, be sure to subscribe to our newsletter and toggle the Linux option to get a weekly roundup of news and guides like this one, exclusively about the best open source operating systems and software."
    },
    {
      "url": "https://www.howtogeek.com/best-microsd-cards/",
      "text": "MicroSD cards are nifty little chips that increase the storage of your favorite gadgets. While most microSD cards will work just fine with your device, some are faster and more reliable than others. That’s why we’ve handpicked the best for you.\nWhat to Look For With a microSD Card in 2024\nA wide array of modern gadgets rely on microSD cards for storage expansion. However, as different microSD cards have different speed classes and video classes, which refer to their data transfer and video recording capabilities, respectively, not every card will be suitable or deliver the best experience with your device. That’s why it’s crucial to keep a few things in mind while picking up a microSD card.\nThe most important consideration is the requirements for your specific device. For example, you’ll need a higher video class card if you plan to record high-resolution video on it, or if you’re planning to run apps from it, it’s ideal to pick a card with a higher application rating. Similarly, faster read speeds are essential for smoother and responsive performance on a portable gaming console. Our How to buy an SD card guide explains all speed classes in detail.\nOnce you’ve figured out what you need regarding the speed or video class of your microSD card, you can decide on the storage size and budget. However, it’s crucial to stick with reputed brands for reliability. Remember, paying a slightly higher price to ensure quality and performance is always wise.\nOne of the biggest challenges when shopping for a microSD card is the prevalence of counterfeits. Unscrupulous sellers on platforms like Amazon and other e-retailers often sell duplicates and fakes under the names of reputable brands. It’s crucial to be cautious and always buy a microSD card from an official seller or a platform that keeps its own inventory, such as Best Buy or B&H Photo Video, to ensure you're getting a genuine product.\n|\nHow Did We Research |\n||\n|\nModels Evaluated |\nHours Researched |\nReviews Analyzed |\n|\n30 |\n10 |\n45 |\nHow-To Geek's product recommendations come from the same team of experts that have helped people fix their gadgets over one billion times. We only recommend the best products based on our research and expertise. We never accept payment to endorse or review a product. Read More »\nBest microSD Card Overall: Samsung Pro Plus microSDXC card\n|\nPros |\nCons |\n|---|---|\n|\nExtremely fast and reliable |\nOnly three storage sizes |\n|\nDurable |\nSamsung’s Pro Plus is a wildly popular microSD card that can handle almost anything you throw at it. It’s very fast and highly reliable, so whether you want to use it with your drone, dash cam, portable gaming console, or mobile device, it’ll deliver excellent performance.\nIt’s rated for C10, UHS-3, V30, and A2 speed classes. It can also reach sequential read speeds of 180MB/s and write speeds of 130MB/s. However, the card will only achieve these speeds if the device using it also supports such high speeds.\nThe Pro Plus is quite durable and can easily handle everyday mishaps, including a 72-hour dunk in seawater. Plus, the company offers a 10-year limited warranty. However, this warranty doesn’t cover write-intensive usage, such as continuous video recording from a dash cam, CCTV, and other surveillance cameras, which can significantly reduce the card's lifespan.\nUnfortunately, as of June 2024, it only comes in three storage sizes: 128GB, 256GB, and 512GB. A 1TB version is expected sometime later in 2024. If you need a smaller or bigger size, the SanDisk Extreme Pro is an impressive alternative. It’s more expensive than the Samsung Pro Plus but also slightly faster, with sequential read and write speeds of up to 200MB/s and 140MB/s, respectively.\nSamsung PRO Plus Memory Cards\nIf you need a single option for your microSD card, go for the Samsung Pro Plus. It’s very fast, reliable, and available in three sizes.\nBest High-Capacity microSD Card: SanDisk Ultra 1.5TB microSDXC card\n|\nPros |\nCons |\n|---|---|\n|\nUp to 150MB/s sequential read speeds |\nLimited to A1, U1, and V10 speed classes |\n|\nReliable |\nAlthough 2TB microSD cards are technically here, they are still very rare or available from the not-so-reputed manufacturers. So, if you want an ultra-high-capacity microSD card, your best bet is the SanDisk Ultra, which is available in a 1.5TB size.\nWhile it’s reasonably fast, with up to 150MB/s sequential read speeds for larger storage variants, it’s only rated for the A1, U1, and V10 speed classes. So, it’s most suitable when you want the largest possible storage size, and data transfer speeds aren’t super important. For example, you wouldn’t want to use it with your 4K action camera.\nThe Ultra has a great price and comes with a 10-year limited warranty. Like Samsung’s microSD cards, SanDisk's offering is also quite reliable. However, high-capacity cards are among the most counterfeited offerings. So don’t get enticed by sellers offering the SanDisk Ultra at very low prices; stick with reputed sellers and stores.\nIf you want even faster data transfer speeds and better speed class ratings, consider the company’s Extreme and Extreme Pro microSD cards. Both are available in up to 1TB storage sizes.\nSanDisk Ultra microSDXC Card\nThe SanDisk Ultra is a reliable microSD card for everyday essential data storage. Its 1.5TB size is enough to store hours of full-HD video and hundreds of thousands of photos.\nBest microSD Card for Steam Deck: Samsung Evo Select microSDXC Card\n|\nPros |\nCons |\n|---|---|\n|\nFast and reliable |\nNo 1TB version as of June 2024 |\n|\nReasonable pricing |\nBesides its impressive Pro Plus microSD card, Samsung offers the Evo Select, perfect for Steam Deck. It’s reasonably priced and fast enough that you’ll never feel the card bottlenecking you. The latest version of the card supports up to 160MB/s sequential read and write speeds.\nIt’s rated for A2, V30, U3, and C10 speed classes, and as such, Steam Deck games load quickly off it, and the fresh installs are fast.\nThe Evo Select is also durable and comes with a 10-year limited warranty. It can also handle a wide range of temperatures and is water-resistant. Moreover, you can get an adapter with the EVO Select for full-size SD card readers.\nAlthough Samsung plans to release a 1TB version of the Evo Select sometime in 2024, it’s unavailable as of June 2024. So, it tops out at 512GB. While 512GB is enough for most people, folks looking for more can opt for SanDisk’s Extreme, an equally awesome microSD card available in a 1TB storage size. It’s rated the same as the Evo Select.\nSamsung Evo Select Micro SD Card\nThe Samsung Evo Select is an excellent companion for your Stream Deck. It can reach up to 160MB/s speeds and has a 10-year limited warranty.\nBest microSD Card for Nintendo Switch: SanDisk Extreme microSDXC card\n|\nPros |\nCons |\n|---|---|\n|\nSurpasses Nintendo-recommended specifications |\n32GB and 64GB variants are slower than higher-capacity variants |\n|\nReliable and resilient |\nIt’s easy to fill up the onboard storage of Nintendo Switch. That’s why the Switch includes a microSD card slot for storage expansion, and SanDisk’s Extreme is a solid pick for this job. It’s fully compatible with all Switch models and comes in up to 1TB storage sizes, offering ample space for your growing game library.\nNintendo recommends getting a microSD card with transfer speeds of 60-95MB/s. But the Extreme surpasses this recommendation with its sequential read speeds of up to 190MB/s and write speeds of up to 130MB/s. Even the smallest 32GB variant of the card can reach read speeds of up to 100MB/s. So you’ll get rapid game loads and a smooth performance, letting you dominate the competition without lag.\nThe Extreme is also quite resilient and can function in less-than-friendly environments. It’s shockproof, waterproof, X-ray proof, and can operate in most temperature conditions.\nOne thing to note about microSDXC cards like the SanDisk Extreme is that you may need to update the Nintendo Switch operating system to use them.\nSanDisk Extreme\nSanDisk Extreme’s fast transfer speeds ensure quick game loading and a smooth performance for a lag-free gaming experience.\nBest microSD Card for Raspberry Pi: Kingston Canvas Go Plus microSDXC card\n|\nPros |\nCons |\n|---|---|\n|\nUp to 170MB/s read speeds |\nRelatively expensive |\n|\nDurable |\n64GB version is slower than higher-capacity cards |\n|\nAvailable in five storage variants |\nAlthough all of our picks are good options for the Raspberry Pi, Kingston’s Canvas Go Plus is another excellent microSD card that you can consider. It’s fully compatible with the Pi and delivers impressive read speeds of up to 170MB/s and write speeds of up to 90MB/s.\nIt’s almost overkill for the Pi, but as there isn’t much price difference between microSD cards of lower storage capacities, it’s better to go with the faster option. You can also use it with other devices without worrying about potential performance bottlenecks. Besides the Raspberry Pi, the Canvas Go Plus will deliver excellent performance with any other gadget.\nThe Kingston offering is also well-built and durable. You can pick from five storage variants, ranging from 64GB to 1TB. That said, the 64GB version will be enough for most people. Remember, the 64GB variant has slightly slower write speeds of up to 70MB/s.\nThe SanDisk Ultra is a good alternative to get the most affordable but still reliable microSD card for the Pi. It comes in more storage sizes than the Kingston offering and is also cheaper. Of course, it’s slower in comparison, but fast enough for the Raspberry Pi.\nKingston Canvas Go Plus MicroSDXC\nThanks to its fantastic read and write speeds, the Kingston Canvas Go Plus is an excellent choice for Raspberry Pi.\nBest microSD Card for Cameras: SanDisk Extreme microSDXC card\n|\nPros |\nCons |\n|---|---|\n|\nRated V30 to handle up to 4K video recording |\nSmaller sizes are slower |\n|\nOffers write speeds of up to 130MB/s |\n|\n|\nAvailable in multiple sizes |\nCameras, particularly those that capture high-resolution video or have a burst photo mode, require the fastest microSD card for a seamless experience. The SanDisk Extreme is a fast microSD card that will complement your action camera, 360-degree camera, dashcam, or drone very well.\nIt’s rated for UHS-3, V30, and C10 speed classes and offers write speeds of up to 130MB/s. So, whether you are shooting a 4K video or fast-action photos, you won’t get a lag from the microSD card. Remember that the smaller storage variants are slower than the higher-capacity versions. So it’s better to go with 256GB or a higher-capacity variant. You can buy it in up to 1TB sizes.\nThe SanDisk offering is also shockproof, waterproof, and X-ray proof, giving you peace of mind, and can operate in most temperatures. Moreover, when transferring photos and videos from your camera to your computer, you’ll appreciate the SanDisk Extreme’s quick read speeds of up to 190MB/s.\nIf you want an even faster microSD card than the Extreme, you can consider the Extreme Pro, which can reach write speeds of up to 140MB/s and read speeds of up to 200MB/s. The Samsung Pro Ultimate is another option that can reach write speeds up to 130MB/s and read speeds up to 200MB/s. But for most people, this slight increase in the read and write speeds won’t matter, and there is no point paying a premium.\nSanDisk Extreme\nThe SanDisk Extreme is an excellent microSD card for any type of camera. It’s fast, reliable, and durable. It also comes in multiple storage sizes.\nFAQ\nWhat is the difference between an SD and a microSD card?\nSD and microSD cards differ in their physical size and typical usage. SD cards are about 24mm x 32mm x 2.1mm, while microSD cards are about 15mm x 11mm x 1mm. Otherwise, both share the same standards for storage capacity and speed.\nCan I use a microSD card as a normal SD card?\nYou can use a microSD card as a normal SD card using an adapter. MicroSD cards are often bundled with an adapter for this very purpose. However, you can buy one separately if your microSD card doesn’t have an adapter.\nWhy is read and write speed important for an SD card?\nRead and write speeds are important for microSD and SD cards because they impact how quickly you can access the content stored on them or store fresh content. For example, your camera will struggle to record 4K video on a card without a fast writing speed. As cameras often have very little onboard storage, the captured photos and videos are transferred to the microSD and SD cards in real time. Similarly, without faster read speeds, your portable gaming console won’t be able to quickly load the apps and games on the card.\nWhat do the microSD card classes mean?\nThe microSD card classes refer to the card’s minimum sustained write speeds or random read/ write speeds. There are different card classes: Speed Class, UHS Speed Class, Video Speed Class, and Application Performance Class.\nSpeed Class is an older system. It’s denoted by C followed by a number. The higher the number, the faster the speed. Similarly, the UHS Speed Class is denoted by U followed by a number. U1 means a minimum 10MBps write speed, and U3 means a minimum 30MBps write speed.\nAs the name suggests, Video Speed Class tells how well a card handles sustained writing for video recording. It’s denoted by V followed by a number. V6 cards have a minimum 6MBps write speed, whereas V90 cards have a minimum 90MBps write speed.\nFinally, the Application Performance Class tells a card’s ability to handle random read and write operations. These speeds are essential for how well an app loads or runs on a microSD card. The A1 class has a minimum 1500 IOPS random read speed and 500 IOPS random write speed. The A2 class has a minimum 4000 IOPS random read speed and 2000 IOPS random write speed.\nHow do I format a microSD card?\nThere are two main ways to format a microSD card. You can format it on either your PC/ Mac or the device in which you are using the microSD card. However, it’s typically best to use the device for formatting, as that ensures you don’t mess up anything, and the microSD card works seamlessly with the device. To format the microSD card using the device, head over to the device settings and locate storage settings. The format or erase microSD card option is typically present in the storage settings. Remember to back up any existing data before formatting."
    },
    {
      "url": "https://www.reddit.com/r/SteamDeck/comments/192wus7/the_steam_deck_runs_linux_mint/",
      "text": "The Unofficial Subreddit for the Valve Steam Deck! Find discussions, games running on Deck, hardware / software mods and much more! (Please read the rules and check megathreads before posting!)\nThe Steam Deck runs Linux Mint\nLike title states, it does run Linux Mint. I realized not many have tried it, and there are few resources, if any. Figurd Id share the experience!\nBefore reading on, Im a moron, dont be like me. I tinker and prod until shit works or breaks. It worked for me, you may not be so lucky.\nInstalling Linux Mint: You go about it the same way you would re-installing SteamOS. Download your Linux of choice (research compatability, I like Linux Mint), create a USB boot drive and go nuts. Look out for frequently updated distro's. Drivers is the main issue.\nThings to note:\n-\nIt will run HOT until you've updated drivers and installed Steam. My Deck basically went 100%, and I could almost taste the CPU.\n-\nLinux Mint was a dream compared to Arch/SteamDesktop Linux. It felt outright useful!\n-\nGaming mode is far superior to full screen mode. You miss out on a lot of the comfortability with SteamOS.\n-\nIt ran games just fine.\n-\nI think id prefer it for emulation. Uhh think.\n-\nYes, I did a clean install. No dual booting.\nI will revisit it at some point as I actually do use the Steam Deck as a PC. Its my main squeeze.\nIn short:\n-\nYes, it can be used as a daily driver PC.\n-\nYes, other Linux distro's can work well on it.\nBut! Keep in mind that its not actively supported and there's some risk to it.\nIll end on a funny: I fucked up a rm -r command and watched my hard work come undone. So I just reverted to SteamOS.\nSo, there.. Any questions for the class duns?"
    },
    {
      "url": "https://brew.sh/",
      "text": "-\nInstall Homebrew\nPaste that in a macOS Terminal or Linux shell prompt.\nThe script explains what it will do and then pauses before it does it. Read about other installation options.\nIf you're on macOS, try our new\n.pkg\ninstaller.Download it from Homebrew's latest GitHub release.\n-\nWhat Does Homebrew Do?\nHomebrew installs the stuff you need that Apple (or your Linux system) didn’t.\n-\nHomebrew installs packages to their own directory and then symlinks their files into\n/opt/homebrew\n(on Apple Silicon). -\nHomebrew won’t install files outside its prefix and you can place a Homebrew installation wherever you like.\n-\nTrivially create your own Homebrew packages.\n-\nIt’s all Git and Ruby underneath, so hack away with the knowledge that you can easily revert your modifications and merge upstream updates.\n-\nHomebrew formulae are simple Ruby scripts:\n-\nHomebrew complements macOS (or your Linux system). Install your RubyGems with\ngem\nand their dependencies withbrew\n. -\n“To install, drag this icon…” no more. Homebrew Cask installs macOS apps, fonts and plugins and other non-open source software.\n-\nMaking a cask is as simple as creating a formula.\n-\nbrew\ncommand documentation -\nFurther Documentation\n-\nCommunity Discussion\n-\nHomebrew Blog\n-\nHomebrew Packages\n-\nAnalytics Data\n-\nDonate to Homebrew"
    },
    {
      "url": "https://www.howtogeek.com/best-steam-deck-docks/",
      "text": "Adding a docking station to your Steam Deck or ROG Ally setup can transform your gaming experience. They enable you to hook up your device to a big-screen display, fast-charge your handheld, or connect gaming peripherals, providing you with the versatility you need to play your way.\nWhat to Look for in a Steam Deck or ROG Ally Dock\nRegarding docking stations, you might be tempted to dive right in with first-party offerings, such as the Valve Steam Deck Docking Station, or the ROG Gaming Charger Dock. While these are both undoubtedly excellent options, they're not exactly the most cost-effective, and depending on what you're looking to gain from your docking station, you may find they are lacking in certain areas.\nFor instance, if you're simply looking to connect your handheld to a big-screen TV or gaming monitor, you may not need an abundance of USB ports on your dock. However, if you want to repurpose your Steam Deck or ROG Ally into a gaming PC, you will want a docking station that can accommodate peripherals, such as a mouse and keyboard, for extra versatility.\nSelecting a dock that can support 100W power delivery will benefit a more full-fat setup, as you'll be able to provide power to all your add-on devices without diminishing your overall gaming experience. You might want to consider a docking station with more premium features, such as an M.2 SSD slot, which will give you acres of convenient storage space to play with.\nFeatures such as Ethernet ports will provide a more stable connection for online play, while a hub with DisplayPort capabilities will allow you to set up multiple displays simultaneously. Whatever kind of docking station you're looking for, we've got the lowdown right here to help you choose the best option for your handheld PC.\n|\nHow Did We Research |\n||\n|\nModels Evaluated |\nHours Researched |\nReviews Analyzed |\n|\n15 |\n4 |\n20 |\nHow-To Geek's product recommendations come from the same team of experts who have helped people fix their gadgets over one billion times. We only recommend the best products based on our research and expertise. We never accept payment to endorse or review a product. Read More »\nBest Steam Deck Dock Overall: JSAUX M.2 Docking Station\n|\nPros |\nCons |\n|---|---|\n|\n✓ M.2 SSD slot |\n✗ Expensive |\n|\n✓ 100W power delivery |\n✗ Thermal performance could be better |\n|\n✓ Gigabit Ethernet connection |\nIf you're a Steam Deck or ASUS ROG Ally owner looking for the best console dock overall, there's plenty to enjoy with the JSAUX M.2 Docking Station. It has six ports, including HDMI 2.0 (supporting 4K output at 60Hz), Gigabit Ethernet, one USB-C port, plus two USB-A ports for peripheral devices. And if that's not enough to wet your whistle, it also has an M.2 slot for SSD storage.\nIncorporating built-in NVMe SSD support into the design of this docking station is, frankly, a stroke of genius. Simply docking it gives you up to 4TBs of expandable storage for your console. It also eliminates the need to constantly cycle through your library of downloaded games, swapping them out and deleting them to make room for your current faves.\nThe JSAUX M.2 Docking Station also supports 100W power delivery, so there's enough juice to power your Steam Deck at full charging speed. It also offers data transfer speeds of up to 10Gbps, so you can enjoy a fast and reliable gaming experience with this powerful hub, especially when using a Gigabit Ethernet connection.\nWith a price tag just shy of $90, the JSAUX M.2 Docking Station won't be for everyone. However, it has everything you need for a great time with your Steam Deck, and the bonus of SSD storage support makes it more akin to using a conventional desktop PC.\nJSAUX M.2 Docking Station\nThe JSAUX M.2 Docking Station is ideal for leveling up your Steam Deck gameplay, with its integrated M.2 SSD slot, super-fast data transfer speeds, and plenty of ports for connecting your gaming peripherals.\nThe Official Steam Deck Dock: Steam Deck Docking Station\n|\nPros |\nCons |\n|---|---|\n|\n✓ Firmare updates vis SteamOS |\n✗ Expensive |\n|\n✓ FreeSync VRR support |\n✗ Not compatible with the ASUS ROG Ally |\n|\n✓ Includes power adapter |\nAs you might expect, Valve's official Steam Deck Docking Station is tailor-made for Steam Deck owners. It offers a seamless experience for the Steam Deck, supporting a dual-display setup (up to 4K at 60Hz or 1440p at 120Hz), firmware updates, and even its own power adapter.\nIt comes equipped with at least three USB-A 3.1 ports, a Gigabit Ethernet port, DisplayPort 1.4, and HDMI 2.0, though sadly, no USB-C port is included here. It provides multi-monitor support, FreeSync VRR support for external monitors, and firmware updates via SteamOS.\nThis first-party docking station is the perfect match for your Steam Deck, boasting an impressive build quality and a feature-rich design. Made from the same materials as the Steam Deck, it acts as a natural extension of your handheld in terms of its look and functionality.\nOn the downside, which is no great surprise, the Steam Deck Docking Station isn't compatible with the ASUS ROG Ally. Being the official docking station for Valve's handheld, you'll need to look elsewhere if you're a ROG Ally owner. Plus, you might be better off looking at more cost-effective alternatives if you're shopping on a budget.\nValve Steam Deck Docking Station\nThe official Valve Steam Deck Docking Station is the perfect companion for your Steam Deck, offering a range of connectivity options, with firmware updates delivered directly from SteamOS.\nBest ASUS ROG Ally Dock Overall: UGREEN Steam Deck Dock\n|\nPros |\nCons |\n|---|---|\n|\n✓ Supports ROG Ally Turbo Mode |\n✗ Can run a little hot sometimes |\n|\n✓ Keeps cooling vents free from obstruction |\n|\n|\n✓ Integrated SD/TF slot |\nThere are plenty of third-party docking stations that can accommodate both the Steam Deck and the ASUS ROG Ally, but the UGREEN Steam Deck Dock is one that, despite its name, stands out as one of the best options for ROG Ally owners.\nThis 9-in-1 docking station offers exceptional versatility, with 4K support at 60Hz, 10Gbps data transfer speeds, and 100W fast charging. Crucially, it also supports the ROG Ally's Turbo Mode, so you can enjoy maximum power and the best possible frame rates for your game time.\nIt comes with an integrated SD/TF slot, a boon for expandable storage space, while the adjustable display stand allows you to set the viewing angle you prefer. Plus, the viewing stand has been designed so as not to obstruct the ROG Ally's cooling vents, letting you play for longer without your console overheating.\nThough it may be marketed as a Steam Deck docking station, the UGREEN Steam Deck Dock is one of the best docking stations available for the ASUS ROG Ally. This high-performance hub offers plenty of versatility to enable you to play the way you want to, and it doesn't look too shabby, either.\nUGREEN Steam Deck Dock\n- Input\n- 1E+2 Volts\n- Number of Docking Ports\n- 4\nWith support for the ASUS ROG Ally's Turbo Mode, the UGREEN Steam Deck Dock is perfect for getting the most out of your handheld PC, delivering maximum power and the best possible frame rates.\nThe Official ASUS ROG Ally Dock: ROG Gaming Charger Dock\n|\nPros |\nCons |\n|---|---|\n|\n✓ Can charge two devices at the same time |\n✗ Expensive for what it is |\n|\n✓ Supports display output of up to 4K at 60 Hz |\n✗ Not as versatile as some third-party options |\n|\n✓ Compact, space-saving design |\nThe official docking station for the ASUS ROG Ally, the ROG Gaming Charger Dock is an all-in-one charger for your handheld. This 65W charger dock allows simultaneous PD3.0 fast charging while providing display output at up to 4K at 60Hz via its HDMI 2.0 port.\nIt features a USB-C port and USB-A port and can charge two devices simultaneously, using 60W and 5W of charging power for the USB-C and USB-A ports, respectively.\nCompact and convenient, the ROG Gaming Charger Dock has a high portability factor and can easily be stowed away inside a bag or backpack. It allows you to plug in your ROG Ally wherever you go. Its discreet, space-saving design won't cause any undue cable clutter on your desk or near your TV.\nOn the downside, this charger dock is rather expensive for what it is, and it does lack a Gigabit Ethernet port. Its comparative lack of features may prove off-putting to some, particularly those who want as much versatility as possible from their charging dock. However, for those who are eager to invest in the official option, this is a sleek customer that performs well.\nROG Gaming Charger Dock\nThe official charging station for the ASUS ROG Ally, the ROG Gaming Charger Dock offers big-screen display support at 4K, with super-fast charging to boot.\nBest Budget Dock: SABRENT 6-Port Docking Station\n|\nPros |\nCons |\n|---|---|\n|\n✓ Affordable |\n✗ Not as feature-rich as some more premium options |\n|\n✓ Plenty of space for additional devices |\n|\n|\n✓ Compatible with both Steam Deck and ASUS ROG Ally |\nAt first glance, the Sabrent 6-Port Docking Station looks rather unassuming. Similar in design to the Valve Steam Deck Docking Station, it has a sleek and minimalist look that lacks a bit of visual flair. Nevertheless, it's compatible with the Steam Deck and the ASUS ROG Ally, offers six ports (including three USB-A and two USB-C), supports 4K resolution (with a 60Hz refresh rate), and costs less than $30.\nWith three USB-A ports, this dock is ideal for hooking up additional devices, such as a mouse and keyboard, to turn your handheld into a mini gaming desktop. The Type-C ports (something that the official Valve option lacks) can be used for power delivery or external storage, while the HDMI port allows you to use a secondary display, such as a TV or monitor.\nIt's versatile enough to be compatible with other USB-C devices and provides a sturdy non-slip base on which it can be placed. It also supports PD 3.0 with up to 95W charging speeds, meaning that your device can be charged quickly while docked.\nThe Sabrent 6-Port Docking Station will appeal to anyone who loves the look of the Valve Steam Deck Docking Station but doesn't want to pay the premium asking price for the official model. And while it lacks the bells and whistles of the Valve Dock, it still represents excellent value for money, with enough features to satisfy many Steam Deck (or ROG Ally) fans.\nSABRENT 6-Port Docking Station\nCompatible with both the Steam Deck and the ROG Ally, the Sabrent 6-Port Docking Station is one of the best multi-purpose hubs available at a more budget-friendly price.\nBest Compact Dock: Syntech Mini Dock\n|\nPros |\nCons |\n|---|---|\n|\n✓ Compact, space-saving design |\n✗ Port placement isn't ideal |\n|\n✓ Reasonable price point |\n|\n|\n✓ Compatible with both Steam Deck and ASUS ROG Ally |\nThe Syntech Mini Dock scores high in the portability stakes. Compatible with both the Steam Deck and the ASUS ROG Ally, this pint-sized port is one of the smallest currently available and comes with a fairly modest price tag to boot. It packs neatly into any bag or backpack and makes docking your ROG ally or Steam Deck a cinch when you're on the move.\nThe Syntech Mini Dock has been designed with a rounded base, providing good stability when docking your handheld. Thanks to its sturdier foundation, you don't need to worry about your console tipping over, despite this dock's smaller size. It has six ports, including an HDMI 2.0 port (which supports up to 4K at 60Hz), three USB-A ports for external devices, Gigabit Ethernet, and USB-C.\nThe docking station features anti-slip grips inside the console cradle so that your device holds its position, and a gripped pad on the bottom of the dock keeps it firmly rooted to your table or desk. As another handy quality-of-life feature, it can accommodate most protective cases, so you won't need to remove these before docking your device.\nThe Syntech Mini Dock is ideal for anyone who likes to travel on their Steam Deck or ROG Ally and is looking for a stable and effective space-saving dock that won't break the bank.\nSyntech Mini Dock\nThanks to its space-saving circular design, the Syntech Mini Dock is one of the best options available for gaming on the go with your Steam Deck or ASUS ROG Ally.\nFAQ\nHow do I connect my Steam Deck or ROG Ally to a TV?\nTo connect your Steam Deck or ROG Ally to your TV, you'll need to connect a USB-C hub or USB-C to HDMI cable to your TV (with the HDMI end), with the USB-C end plugged into your console.\nWith your TV on, select the corresponding HDMI input option and make sure your Steam Deck or ROG Ally is switched on. Your handheld's display will then be visible on your TV screen.\nCan I use a Steam Deck dock with my ROG Ally?\nWith the exception of the official Valve Steam Deck Docking Station, most third-party docking stations are compatible with both the Steam Deck and the ASUS ROG Ally, as well as other devices with USB-C ports.\nIs the Steam Deck or ASUS ROG Ally better?\nWhen it comes to which handheld is best between the Steam Deck and the Asus ROG Ally, it largely comes down to personal preference.\nThe ROG Ally is undoubtedly the most powerful of the two handhelds and runs up to 50% faster than the Steam Deck. It also has the advantage of running Windows 11 (compared to Steam Deck's SteamOS, which runs on Linux) which gives you access to other storefronts.\nIn contrast, the Steam Deck offers a marginally better battery life, and arguably provides the best tactile experience, with its precision trackpad and more familiar button array. It's also considerably cheaper than the ROG Ally, which makes it the more accessible of the two.\nCan I play non-Steam games on the Steam Deck?\nYes, you can. The Steam Deck also features a desktop mode, and when you switch across to desktop mode, you can install games and software here, which are not readily available from the Steam store.\nCan I play Steam games on the ROG Ally?\nYes. The ASUS ROG Ally runs on Windows 11, which means you can install Steam on there and play anything you have saved in your Steam library."
    },
    {
      "url": "https://www.howtogeek.com/reasons-to-replace-steamos-with-bazzite-and-reasons-not-to/",
      "text": "Own a Steam Deck and would like to try out an alternative operating system that's not Windows? Have you thought about installing Bazzite? While SteamOS is arguably the best choice for Steam Deck, Bazzite does hide a couple of tricks up its sleeve that make it a worthy SteamOS alternative.\nReasons You Would Install Bazzite\nWhile it's not for everyone, let's first go over the benefits of installing Bazzite in SteamOS' place.\n1. To Experiment With Different Desktop Environments\nIf you cannot daily drive the same operating system for long and are disappointed you can't install any ol' Linux distro onto your Steam Deck because of the implication (the lack of Game Mode), Bazzite is where it's at.\nThe platform comes with a fully-fledged, controller-friendly Game Mode that works great on the Deck. But, like SteamOS, Bazzite also comes with a proper Desktop mode that turns the Deck from a handheld console to a proper PC.\nWhat Is a Linux Distro, and How Are They Different from One Another?\nIf you’ve heard anything at all about Linux, you’ve probably heard of Linux distributions – often shortened to “Linux distros.\nThe good news is that you can pick between GNOME and KDE Plasma desktop environments, meaning you aren't limited to the same desktop environment (Plasma) your Steam Deck's Desktop mode is based on. While KDE Plasma is optimized for the mouse and keyboard combo, GNOME works better with touch-screen devices, which could be a plus in case you're often navigating around your Deck's Desktop mode without a mouse and a keyboard.\nIf you end up not liking GNOME but loving the backend based on Fedora Linux over SteamOS' Arch Linux foundation, you can switch back to KDE Plasma. This way, you'll get a similar GUI to SteamOS but with Bazzite-specific features such as faster software updates, support for full disk encryption, and an overlay file system allowing you to make changes to files outside the Home folder without them getting nuked after every update.\nArch Linux vs. Fedora Linux: Which Should You Use?\nThey're both great. It all depends on what matters to you.\nThe overall performance, battery life, and game support are virtually the same between SteamOS and Bazzite. If you end up liking the latter more than Valve's official Steam Deck OS, you can continue daily driving it without worrying you're missing out on something.\n2. For Troubleshooting Your Steam Deck\nI wish Bazzite had been available back when I troubleshooted download speed-related issues on my Deck. I wouldn't have to install Windows to determine whether the issue was stemming from SteamOS or the Wi-Fi chip inside the Deck.\nBazzite comes with Game Mode and a GNOME desktop environment that's touch-screen-friendly, allowing you to easily troubleshoot issues without a mouse and keyboard (you'll need a keyboard to install Bazzite, though), unlike with Windows, where a mouse and a keyboard are highly recommended if you want to do anything other than installing and playing games.\n3. For Better Security and Privacy\nWhile it's a great operating system for a gaming-focused device, SteamOS does come with some limitations. One of them is the lack of support for full disk encryption. You can Macgyver limited encryption of the home partition, but this procedure requires time and patience and isn't as effective as full disk encryption.\nBazzite, on the other hand, fully supports the Linux Unified Key Setup (LUKS), as well as full disk encryption. All you've got to do is click the \"Encrypt Data\" button during installation, and that's pretty much it.\n4. To Have More Control Over the OS\nNow, both SteamOS and Bazzite have read-only filesystems, preventing you from inadvertently breaking the OS; understandable considering both platforms are made primarily for gaming. But Bazzite has the advantage of using an overlay filesystem. In a nutshell, this allows you to make changes to the system without them being nuked with each system update.\nThis is great for niche use cases, like if you want to do some development work on your Deck, run other Linux distros via Distrobox, or use rpm-ostree to install Fedora packages that won't reset with the next system update.\nHowever, having an overlay filesystem is also great for some gamer-centric use cases. For instance, on Bazzite, you can set up Waydroid—an excellent tool to run Android apps on Linux—once and forget about it. On SteamOS, you have to go through the setup procedure after each system update.\nIt's also worth mentioning that some handy apps, such as Waydroid and Lutris, come pre-installed on Bazzite.\nBazzite also gets software updates faster than SteamOS. For example, Bazzite was on KDE Plasma 6 for months before the update landed on SteamOS.\nAnother reason to switch to Bazzite is that it provides a better experience when docked. SteamOS works fine with docks, but multi-monitor support is lacking. Heck, from my experience, even making my Deck's display and the external monitor play nice with one another can be a pain sometimes.\nOn Bazzite, you can use multiple monitors without issues. You can even adjust UI scaling on your external monitor and your Deck's built-in display independently of each other.\nThe multi-monitor quirks stem from Valve using the X11 protocol instead of Wayland when the Desktop mode is active. In contrast, Bazzite uses Wayland for desktop sessions, which generally works better with multi-monitor setups than X11.\nState of Linux Windowing Systems: Is Wayland Good in 2025?\nWayland is supposedly the way of the future, but when does that future actually arrive?\nLast but not least, and I'm serious here, Bazzite supports printers while SteamOS doesn't. As of this writing, the only way to get CUPS/printer support on SteamOS is by switching to the SteamOS Beta channel.\n5. In Case You Can't Stand KDE Plasma\nSome people just don't like certain things, and that's completely fine. Personally, I like Plasma. It's similar to Windows, comes with an awesome default file manager (but you're free to try alternatives), works fine without a mouse and keyboard, performs super snappy on my Steam Deck, and doesn't lack any features I might need.\nYou, on the other hand, might prefer GNOME. Or simply cannot stand KDE Plasma despite being content with the SteamOS feature combo; here's when Bazzite enters the conversation. If you like your Deck but hate its desktop GUI, install Bazzite with GNOME and break the Plasma shackles every Steam Deck is confined with.\nThe Wrong Reasons to Switch to Bazzite\nWhile Bazzite is the best SteamOS alternative, you shouldn't replace SteamOS with Bazzite if any of the following is true.\n1. You Want to Play More Multiplayer Games on Your Steam Deck\nBazzite, like SteamOS, is based on Linux. In other words, the multiplayer games not working on SteamOS won't work on Bazzite either.\nIf you want access to multiplayer games that aren't working on SteamOS, you'll have to abandon Linux completely and board the Windows train.\nThat said, I don't like Windows on Steam Deck very much. I recommend that fans of multiplayer gaming who'd like to get themselves a handheld PC opt for a Windows-based machine instead of Steam Deck.\n2. You'd Like to Play PC Game Pass Games\nBeing Linux-based, Bazzite, like SteamOS, doesn't support PC Game Pass. If you want access to PC Game Pass and run games locally, you need to switch to Windows or get yourself a Windows-based handheld PC.\nOn the other hand, if high latency and generally subpar image quality don't bother you and you're subscribed to the Game Pass Ultimate tier, you can stream games to your Steam Deck with Xbox Cloud Gaming.\nPersonally, I wouldn't recommend going the Xbox Cloud Gaming route unless you have no other choice. If you own a gaming PC and a Steam Deck, you can stream PC Game Pass games locally from your PC to the Deck, which works almost flawlessly with the Sunshine + Moonlight combo. You could also install Windows on your Deck, but the overall Windows on Deck experience is not up to snuff when it comes to daily driving Windows on your Deck.\n3. You Want Better Battery Life or More Performance\nTechnically, you can prolong your Deck's battery life with Bazzite, but the gain is negligible. You're looking at about ten minutes of extra juice when playing games, which isn't worth installing Bazzite for.\nPerformance, on the other hand, should stay the same between SteamOS and Bazzite as long as you don't mess anything up during installation.\nThat said, Bazzite uses a faster 1000Hz tick-rate for its Linux kernel compared to the 300Hz tick-rate on SteamOS. According to some Deck owners who've tried Bazzite, this makes the overall system feel snappier and more responsive.\nFrom my (very) limited experience of playing around with Bazzite on a friend's ASUS ROG Ally, the responsiveness feels the same as on a Deck running SteamOS, but your mileage may vary. You'll never know until you install Bazzite yourself.\nBazzite is very similar to SteamOS but is more flexible and comes with some nice extras that make the overall experience less limited than on SteamOS. You can set up full disk encryption and don't have to worry about system updates nuking changes you've made to the system. You can easily install stuff that isn't flatpacks or games and will receive software updates sooner than on SteamOS.\nWhereas SteamOS is optimized for the Deck, Bazzite presents an excellent, stable and flexible alternative for people who'd like to switch from SteamOS and want the same, controller-friendly, user interface built on top of a Linux foundation."
    },
    {
      "url": "https://www.howtogeek.com/what-is-arch-linux/",
      "text": "Summary\n- Arch is an independent distribution with a rolling release model and no corporate involvement.\n- Arch delivers a lean and minimal installation, requiring manual setup of desktop environments and packages.\n- Installing, using, and maintaining Arch Linux has a steep learning curve, but the ArchWiki serves as a comprehensive and reliable resource for users.\nArch Linux might be the most misunderstood of all the Linux distributions. It’s supposed to be difficult to install and maintain, so why do people use it? What makes Arch so different?\nArch Is Its Own Thing\nBecause most Linux distributions are based on other, older distributions, they can be classed according to their ancestry. Linux Mint, for example, is based on the long term support version of Ubuntu, which in turn is based on Debian Linux. Mint also has a version directly based on Debian. Fedora Linux is the free member of the Red Hat family. Manjaro and EndeavourOS are based on Arch Linux. Everything is based on something, it seems.\nBut backtrack up the family tree of a Linux distribution, and eventually you’ll come to its uber-ancestor. There’s only a handful of these top-tier created-from-scratch distributions. The big five are Slackware, Gentoo, Red Hat/Fedora, Debian, and Arch.\nArch doesn’t have corporate backers nor commercial involvement. The only hands on the tiller belong to the developers and maintainers of the Arch project itself and the Arch user community.\nThey don’t inherit changes from an upstream distribution, and they’re not pressured by corporate influences. They’re free to produce a Linux that meets their stated ideals).\nArch is a rolling release, with updates and patches used to keep your system current. An updated Arch Linux installation is always the most recent version. This is in contrast to the point release system, where all changes since the last release are bundled together and incorporated into the next release.\nThe rolling release model is the riskier of the two. You get the latest operating system upgrades and application releases as early as possible, but there’s the chance the updates introduce bugs and instabilities. If this happens, the fixes are always released within a day or so. Depending on what is affected, the impact to you might be minor or major, but it should be short-lived.\nWhen you install Arch you’re left with a working but minimal installation. There is zero application bloat. If you haven’t chosen to install something, you won’t have it. And that’s not just for applications. It also applies to vital functions of the operating system. Forgot to install network management utilities? You’ll have no network connections.\nArch Is Lean and Mean\nPost-installation, if you want anything more than a terminal window and command line, you need to choose and install a graphical desktop environment or a tiling window manager, and then install it by hand. You also need to install any packages you want.\nThe Arch way is to give you (virtually) nothing, and let you populate your Linux with the packages and tools you want. Most other distributions give you a bundled set of applications. Which applications, and how many, depends on the distribution. Yes, you can uninstall the things you don’t want, but the Arch way is cleaner.\nArch has its own package manager called pacman, and its own repositories. The software versions in the repositories are the plain vanilla releases from the application maintainers. The same goes for desktops environments. They haven’t been tweaked by the distribution maintainers.\nThe Arch User Repository (AUR) is an enormous repository of applications packaged by users. These are not installed using pacman, you need to use an AUR “helper” like yay. Between the Arch official repositories and the AUR, Arch has one of the biggest—if not the biggest—collections of curated software available for installation.\nThere’s a Steep Learning Curve\nWhen you install Arch you have to remember to do a lot of manual steps, and make many decisions. There isn’t a simple ;click, click, done’ installer. There’s no hand-holding here.\nThere is a text-based helper program, archinstall, that steps you through each part of the process, so you can’t forget to perform a step. But you can still make the wrong choice at any point.\nFor example, you need to specify how you want your drive(s) partitioned. You don't get a safety net. There’s no sanity checking to prevent you from creating overlapping, misaligned, or otherwise broken partitions.\nBefore you dive headfirst into installing Arch, you need to do your own research. Installing requires a lot of critical decisions, and answering them requires knowledge.\nThankfully, There’s the ArchWiki\nThe ArchWiki is a tremendous technical resource, with information on every aspect of installing and using Arch Linux. It is widely respected, incredibly detailed, clearly written, and above all else, accurate and up to date.\nThe ArchWiki is one of the jewels in the crown of Arch Linux. Users of other distributions even refer to it too. Ironically, the great thing about the ArchWikli is also its only problem. It is so comprehensive that newcomers can feel overwhelmed. But you’ll never regret the investment you make in getting comfortable with it.\nYour Computer Is Your Own\nSo, after the research, the installation, and the post-installation setup, what do you get? A bloat-free, independent, operating system.\nIts package manager installs applications natively, without extra layers of complication and abstraction. If you want Snaps and Flatpaks, you can configure your computer to do that. But out of the box, it does things the native Linux way.\nYour applications and your desktop or tiling manager are all plain vanilla, without distribution-specific modifications. Updates come as frequently as you like. It’s up to you. Checking for updates once a week or so seems to be average among the Arch users I interact with.\nIf you want to find out anything about Arch Linux, or troubleshoot something, or look for updates on issues and fixes, the class-leading ArchWiki is at your disposal.\nAvoid Pacman Headaches on Arch Linux by Automating Mirror List Updates\nAutomate your mirror list updates on Arch Linux so they're always up-to-date.\nAnd without corporate overseers and other outside pressures, the Arch project can concentrate on delivering a simple, uncluttered, lightweight Linux distribution while adhering to the project’s core principles."
    },
    {
      "url": "https://www.howtogeek.com/886225/how-to-upgrade-your-steam-decks-ssd/",
      "text": "Quick Links\nSummary\nTo upgrade your Steam Deck's SSD unscrew the back cover and open it, then remove the board shield.\nNext, fully disconnect the battery and remove the old SSD.\nStrip the ESD shield from the old SSD and sleeve it on the new one.\nReconnect the battery, install the new SSD, then put back and secure the board shield and the back plate.\nPlan on replacing your Steam Deck's solid-state drive (SSD) but don't know how to do it? You can upgrade your Steam Deck's SSD without much hassle in less than half an hour. We'll walk you through the Steam Deck SSD replacement procedure in an easy-to-follow step-by-step guide.\nWhat You Need\nBefore we begin, let's list the tools you need for the Steam Deck SSD upgrade procedure.\nFirst, you need a #0 and a #1 Phillips screwdriver. If you're outside the US, those two sizes are known as PH0 and PH1. You also need a pair of tweezers.\nWe recommend using a flathead screwdriver with a 1.2mm head instead of a #1 Phillips screwdriver for removing the backplate screws. The two bottom screws holding the backplate ---shown in the photo below--- are much easier to remove with a 1mm flat head. A #1 Phillips screwdriver is too wide to remove those screws without damaging the plastic around the screw holes.\nNext, you'll need a prying tool. We used an old plastic loyalty card, but you can use a plastic opening pick or a spudger. And, of course, you'll need an SSD. The SABRENT Rocket 2230 1TB PCIe 4.0 SSD is an excellent choice, albeit a bit pricey, if you don't know which SSD to get.\nSABRENT Rocket 2230 NVMe 4.0 1TB\nThe SABRENT Rocket 2230 NVMe SSD is an excellent choice for upgrading your Steam Deck SSD.\nIf you own a 64GB Steam Deck, don't worry; a Steam Deck 64GB SSD upgrade is possible. The procedure's the same as with other versions since the eMMC storage unit looks the same as a 2230 M.2 SSD found in other models, and is connected to the same M.2 slot.\nFinally, we recommend backing up your Deck with Clonezilla and then copying the clone SSD image to the new SSD. That way, you won't have to reinstall SteamOS, re-download your games and apps, and reapply all the settings and tweaks you've made before.\nRemove your SD Card, if you have one installed, before starting the SSD replacement procedure if you don't want to break it in half!\nStep 1: Place Your Steam Deck in Its Carrying Case\nOnce you remove the SD card, if you have any, open the Steam Deck carrying case and place your Deck inside it so it's snuggled in there, preventing any wobble or damage to the analog sticks.\nStep 2: Unscrew the 8 Screws Holding the Back Plate\nNext, remove the eight screws holding the plate. You can use a #1 Phillips screwdriver, but, as we said, removing them with a 1.2mm flat head is much easier.\nThe screws marked in red are shorter, while the blue ones are more prolonged. Don't mix the two groups when putting the back cover back. Also, be sure to keep track of the screws and not misplace them.\nStep 3: Pry Open the Back Plate and Remove It\nNow it's time to pry open the cover. Start with either the right grip or left grip side since the locking clips under those two spots are the easiest to loosen up. Once you unhook a couple of locking clips, disconnect the rest with your fingernails or a prying tool.\nOnce you disconnect every locking clip, remove the back plate entirely and move to the next step.\nStep 4: Unscrew the Board Shielding\nThe insides of the Deck hide the PCB along with the board shielding made of metal. We want to remove the shield. Three screws secure the shielding, one of which hides away under a metal foil rectangle glued to the shield.\nYou should only partly remove the foil. Use tweezers to do that and do it slowly, like when trying to remove a paper sticker without tearing it.\nPatiently pull the foil until it uncovers the hidden screw. Pull it away until you have enough headroom to remove the screw with a screwdriver. Use a Phillips #1 screwdriver for this particular screw.\nRemove the other two screwdrivers with a Phillips #0.\nOnce you remove all three screws, pull the shield up with your fingers and remove it.\nStep 5: Disconnect the Battery\nNow you've uncovered the PCB and the SSD. But before you disconnect the SSD, disconnect the battery.\nThe battery pull tab is tucked between the battery and the housing. Free it up with your finger or tweezers.\nNext, firmly hold the battery pull tab with your fingers and pull the battery connector directly towards the battery until you fully unhook it.\nWiggle it a bit left and right while pulling it away to disconnect it easier.\nOnce you fully disconnect it, move on to the next step.\nStep 6: Remove the Old SSD and Its ESD Cover\nNow you should remove the old SSD. Remove the screw with a #1 Phillips, then gently grip the SSD with your thumb and index finger and remove it.\nOnce you remove the SSD, pull its electrostatic discharge (ESD) cover ---the metal shield encircling the SSD and protecting it from electrostatic interference from other components--- by holding the shield and gently pulling the SSD in the opposite direction.\nStep 7: Place the ESD Shielding on the New SSD and Install It\nAfter you remove the shielding from the old SSD, sleeve it on the new one. We held the SSD by its sides and slowly pushed the shielding until it fully covered the storage drive.\nIf your SSD is too wide to sleeve the ESD shield on it, separate the shield with tweezers or fingers ---the ESD shield is a tape covered with a thin metal layer that encircles the SSD and is glued together at its ends--- wrap it around the new SSD and give the two ends covered with adhesive a squeeze to stick them back together.\nOnce you wrap the electrostatic discharge (ESD) shield around the new SSD, place the SSD inside the M.2 slot and secure it with a screw. Don't overdo it; stop once you feel the hard wall resistance from the screw.\nStep 8: Reconnect the Steam Deck Battery\nAfter you've secured the SSD, you can reconnect the battery. The reconnect procedure is way easier than disconnecting the battery. Just place the plastic connector inside the metal housing and push it by the edge until it's fully inserted, like in the photo below.\nStep 9: Put the Board Shield Back on and Secure It With Screws\nNow that you connected the battery connector, put the shield cover back on and secure it with screws. Don't forget to put back the aluminum foil covering the hidden screw and ensure that the board shield doesn't squash the fan cable!\nStep 10: Clip the Cover Back and Secure It With Screws\nNext, clip the back cover back by placing it over the backside, then hold the Deck while gently pressing it until the locking clips click into place. Once you tightly secure the cover, without any gaps between it and the front shell, screw back the eight screws that keep it in place. Be sure not to mix up the short and long screws!\nThe entire Steam Deck SSD replacement procedure shouldn't take more than half an hour of your time. Once you finish upgrading your Steam Deck's SSD, either copy the clone image onto the new SSD or reinstall SteamOS. If you opt for the latter, be sure to read our guide on how to reinstall SteamOS on your Steam Deck."
    },
    {
      "url": "https://www.howtogeek.com/what-is-bazzite-linux/",
      "text": "If you've researched gaming on Linux lately, a weird name has probably come up now and then: Bazzite. This Linux distribution is growing in popularity with gamers, and if you look at it you might think you were looking at SteamOS. Here's what you need to know about Bazzite.\nA Linux Distro for Gamers, Especially Steam Deck Owners\n|\nYear of First Release |\n2023 |\n|---|---|\n|\nMinimum System Requirements |\n64GB storage, 4GB RAM, 2GHz quad-core processor (64-bit) |\n|\nSupported Desktop Environment(s) |\nKDE Plasma, GNOME |\nBazzite is a free and open source operating system designed as an alternative to SteamOS, the operating system developed by Valve and that you get on a Steam Deck and some other handheld PCs. Unlike SteamOS, though, you can install it on more than just handhelds. Bazzite supports also desktop PCs, laptops, home theater PCs (HTPCs), and even a few tablets.\nBazzite, like SteamOS, is meant for gaming. It's centered around Steam since that's the most popular PC gaming platform. Steam also tends to lead the way in terms of support for Linux operating systems, through software like Proton. It's Proton and other compatibility layers that make gaming on Linux not just feasible but enjoyable.\nUnder the hood, Bazzite is based on a version of GNU/Linux called Fedora. Specifically, it's a customized version of the Fedora Atomic Desktop. If you've heard of Fedora Silverblue, it's related, and it's part of the Universal Blue project. If none of those names mean anything to you, then don't worry about it. Just know that though they look similar and both fall under the umbrella of \"Linux,\" SteamOS and Bazzite have very different underlying systems.\nWhy I've Gone All In on Fedora Silverblue\nThere's more to like here than just those two (admitedly awesome) colors.\nWhat Makes Bazzite Different?\nSo what's the point of Bazzite if it's just imitating an already existing distribution? First, Bazzite isn't limited to handhelds the way that SteamOS is. Desktop PCs, laptops, and HTPCs are all officially supported by Bazzite, so you have more freedom to use Bazzite how you like.\nOn a technical level, Bazzite is very different from SteamOS in that it's based on the Fedora Atomic framework instead of on Arch Linux. That means you don't have the Arch underpinnings, including things like the Arch User Repository.\nBazzite also stands out from other distros with its preinstalled software specific to gaming and Steam. It includes the Steam platform, plus Lutris for installing Epic Games Store, Good Old Galaxy, and other storefronts you might have bought games from. There's also an app called ProtonPlus, a tool for managing compatibility layers, which are crucial for a lot of gameplay on Linux. As of this writing, Bazzite also comes with a brand-new custom-made software store called Bazaar, where launchers, emulators, and other gaming software is front-and-center.\nBecause it's based on Fedora Atomic, Bazzite is known as an immutable Linux distro. \"Immutable\" essentially means the underlying system cannot be modified, at least not easily or permanently. On reboot, all system modifications are reverted. This has some benefits over other forms of operating systems, including in security and reliability. If you're used to working with other distros, though, the technical aspects can involve quite the learning curve. If you don't plan on doing a lot of work on Bazzite's guts, you don't really need to worry about this.\nHow to Install Bazzite\nTo install Bazzite, the process will look a little different depending on what kind of hardware you're installing it on. I'll go over the general course of action, though, to give you a sense of what it'll be like. No matter what, you're going to need a few things:\n- USB drive with a capacity of 10GB or more\n- Image writing application like Rufus, Balena Etcher, or Fedora Image Writer\n- Bazzite ISO (image file)\n- Physical keyboard (i.e., not just a touchscreen)\nFor the USB drive, be aware you're going to have to completely wipe it, so be sure to save any data you have on it. For the image writer, just make sure it works with whatever operating system you're using.\nSanDisk Extreme PRO Dual Drive\n- Brand\n- SanDisk\n- Capacity\n- 512GB\n- Speed\n- USB 3.2 Gen 2\n- Connection\n- USB-A, USB-C\nAmplify your data management with the SanDisk Extreme PRO Dual Drive, boasting read speeds up to 1,000MB/s and write speeds up to 900MB/s. Transition seamlessly between your USB-C and USB-A devices, and store tons of content with up to 2TB capacity.\nTo get the Bazzite ISO, you need to go to Bazzite's website and scroll until you see the \"Download Bazzite\" menu. It'll ask you some questions about what kind of hardware you're going to install Bazzite on and what kind of desktop you prefer. If you don't select a handheld or HTPC, you'll also be asked whether you want Bazzite to boot into gaming mode. Your answers to these questions will decide which Bazzite ISO you'll get, so make sure you answer them carefully.\nOnce you have it, you need to write the ISO to your USB drive. The exact process will depend on which image writing application you're using, but the important thing to remember is that this will wipe all data on your flash drive. I'm using Balena Etcher for this exercise, which you can see below.\nOnce the image writing is complete, you're ready to boot into Bazzite on the hardware you plan to install it on. This will usually involve entering the BIOS in your device so that you can tell your computer to boot using the USB drive.\nOn a successful boot, unlike many other Linux desktops, Bazzite won't give you a chance to test out the experience. You'll boot straight into the installation wizard. Follow the prompts to select your language, keyboard, and so on. Make sure you select the correct drive for installation, and that you aren't overwriting anything you aren't prepared to lose.\nBazzite is configured by default with \"bazzite\" as the username and as the password. Be sure to change that if you want to keep your device secure from anyone who might have access to your device. If you forget to do that, just remember the login password is \"bazzite\" without quotes.\nOnce you initiate the installation, all you have to do is wait, around 20 minutes or so, depending on your hardware. Then you'll reboot, and you're ready to start using Bazzite.\nWhat It's Like Using Bazzite\nI installed Bazzite on my HTPC a few weeks ago, and I can tell you the experience is pretty smooth. The biggest hiccup I had was that the installation screen didn't scale very well on my living room TV. I had to stand right in front of the TV to see what was going on, so I'd recommend you do the installation on a regular monitor, if possible, before moving to the TV. When installation was complete, in desktop mode I had to adjust scaling.\nOnce that was done, though, I had a great time using Bazzite. I especially liked how well it worked with my Steam Controller, since the operating system includes drivers for Steam devices.\nYour experience of course will differ a bit if you're installing it on a different kind of device, especially if you're not enabling Game Mode at startup. I use Bazzite for gaming only, so I'm not in the desktop very much. Whenever I am, though, it has a very cohesive design, and the preinstalled software is great for getting started gaming on Linux with minimal hassle.\nShould You Install Bazzite?\nYou should install Bazzite if you're looking for a way to play games without Windows and without the hardware limitations of SteamOS. If you have a tower PC and laptop and want to start gaming on Linux, Bazzite is a great place to start. Speaking from experience, I can vouch for it as a great way to build a living room Steam console.\nIf you're thinking of replacing SteamOS on your Steam Deck with Bazzite, I'll fall back on a fellow How-To Geek writer's advice and say I wouldn't recommend it except in certain cases. If you need to troubleshoot your Deck, you want finer-grained control of the operating system, or you just can't stand KDE Plasma are a few cases where it's a reasonable change. Otherwise, the experience isn't going to be improved much by switching to Bazzite.\nIf you do install it, be prepared for the technical challenges of installing a Linux operating system. You can also try Bazzite as a virtual machine (VM), using virtualization software like VirtualBox."
    }
  ],
  "argos_summary": "The article explains how the Steam Deck can serve as a versatile Linux mini PC, offering a full Desktop Mode based on KDE Plasma and Arch Linux that supports most Arch-compatible apps, and can be docked with USB‑C hubs to function as a compact desktop. It highlights the benefits of using a dock for external monitors, Ethernet, and peripherals, while noting limitations such as SteamOS’s immutable read‑only filesystem, delayed updates, and limited multi‑monitor support. The piece recommends Bazzite as a more flexible alternative with an overlay filesystem and full disk encryption, but advises that regular mini PCs may be preferable for non‑gamers or those needing a mutable Linux environment. Overall, the Steam Deck is portrayed as an affordable, portable Linux workstation for gamers who also want a handheld gaming experience, though it may not suit users who prioritize non‑gaming productivity or advanced customization.",
  "argos_id": "WJ220NUJP"
}