{
  "url": "https://nypost.com/2025/08/23/entertainment/kpop-demon-hunters-stars-light-up-empire-state-building/",
  "authorsByline": "Alexandra Bellusci",
  "articleId": "266486d3bcff4ea48df51f9844c52e95",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109966540.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T17:26:22+00:00",
  "addDate": "2025-08-23T17:27:54.737435+00:00",
  "refreshDate": "2025-08-23T17:27:54.737436+00:00",
  "score": 1.0,
  "title": "‘KPop Demon Hunters’ stars light up Empire State Building ahead of NYC sing-a-longs for wildly popular Netflix movie",
  "description": "The movie quickly rose to the top of the Netflix charts.",
  "content": "“KPop Demon Hunters” fever is gripping New York, with the stars of the wildly popular animated Netflix film lighting up the Empire State Building on Friday.\n\nThe movie, which premiered on Netflix in June, quickly became a blockbuster hit around the world, with the streaming giant now releasing a sing-along version in Big Apple theaters this weekend.\n\nThe film — which boasts a chart-topping soundtrack — follows K-pop band Huntr/x who moonlight as demon hunters to protect their fans from supernatural danger.\n\nThroughout the movie, Huntr/x is tasked with trying to stop the popular K-pop boy band, the Saja Boys, from stealing the souls of their fans.\n\nDubbed “K-Pop Demon Hunters Golden weekend,” this weekend’s festivities kicked off on Friday night at one of the highest points in NYC.\n\nThe celebration started with a sunrise lighting ceremony at the Empire State Building alongside the film’s stars, Arden Cho, 40, May Hong, 36, and Rei Ami, 26.\n\nChris Applehans, who co-wrote the film, opened up about creating the world of Huntr/x while at the ceremony.\n\n“Animation is a truly collaborative medium, and it’s their voices, literally, their voices, that have brought Rumi and Mira and Zoey to life and put these songs on top of the charts,” he stated. “I’m so grateful for the fans and for these wonderful, talented women who made this movie such a beacon of connection and joy in the last few months.”\n\n“I think it’s really awesome to have a symbol like the Empire State Building lit golden, just to kind of bring everybody in the city together and have a moment with music connecting us all, because it does do that. And really, really happy and proud that the movies sort of played on most of that.”\n\nThe musical action flick is currently the second-most-watched film on Netflix with 210.5 million global views.\n\n“The film has been praised for its unique blend of Korean mythology, K-Pop culture and vibrant animation inspired by anime and concert visuals,” Susanne Lieu, the Senior Vice President for Empire State Realty Trust said.\n\nShe added, “‘K-Pop Demon Hunters’ is the most-watched Netflix Animated Original film of all time, and Huntr/x has made history as the first female K-Pop artist to reach the number one spot on Billboard’s Hot 100 singles chart with their song ’Golden.’”\n\nHuntr/x and the Saja Boys now rank as the highest-charting K-pop bands ever, next to real-life groups such as BTS and Blackpink.\n\nOn Saturday, Cho took to Instagram to reminisce on the golden night.\n\n“So amazing to celebrate our movie @kpopdemonhuntersnetflix with this iconic moment of lighting up the @empirestatebldg in NYC…,” she gushed. “What a moment for all the musicians on the film! Congrats to all the KPDH talent & crew @sonyanimation @netflix! We are making history! Wish everyone could be here to celebrate… we must all unite soon! Keep watching so we get that sequel and become the #1 most streamed movie! We are so close!”\n\nAmi sweetly commented, “WERE GOING UP UP UP.”\n\nEarlier this month, the ladies revealed whether or not they would be up for a sequel.\n\n“Of course. We’re all like, ‘Yes, please call us!'” Cho told Access Hollywood. “We’re all waiting.”\n\nAs for what they would like to see explored next, Hong said, “More background.”\n\n“I want more context for how they’ve become who they are.”\n\n“We’ve all talked about how we’d love to see how the girls came together because all the characters are so different,” expressed Cho. “There is so much backstory and I think that’s what makes Huntr/x so special, that we’re all so different.”",
  "medium": "Article",
  "links": [
    "https://www.instagram.com/explore/tags/1/",
    "https://www.instagram.com/kpopdemonhuntersnetflix/",
    "https://www.instagram.com/sonyanimation/",
    "https://www.instagram.com/p/DNE6JhSJEww/?hl=en",
    "https://nypost.com/2025/08/23/entertainment/emily-in-paris-assistant-director-diego-borella-dead-at-47/",
    "https://www.instagram.com/p/DNtAH6E3A1o/?img_index=1",
    "https://nypost.com/2025/08/22/entertainment/prince-william-and-harrys-cousin-lady-kitty-spencer-34-spotted-with-rarely-seen-husband-michael-lewis-66-in-saint-tropez/",
    "https://www.instagram.com/netflix/",
    "https://nypost.com/2025/08/23/entertainment/the-walking-dead-actor-norman-reedus-son-mingus-arrested-for-assault-in-nyc/",
    "https://www.instagram.com/empirestatebldg/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Empire State Building",
      "weight": 0.0797709
    },
    {
      "name": "Empire State Realty Trust",
      "weight": 0.06958814
    },
    {
      "name": "KPop Demon Hunters",
      "weight": 0.06488737
    },
    {
      "name": "Golden weekend",
      "weight": 0.06107689
    },
    {
      "name": "Huntr",
      "weight": 0.058774393
    },
    {
      "name": "Arden Cho",
      "weight": 0.056410532
    },
    {
      "name": "K-Pop Demon Hunters",
      "weight": 0.0543217
    },
    {
      "name": "Netflix",
      "weight": 0.053583045
    },
    {
      "name": "Cho",
      "weight": 0.051877413
    },
    {
      "name": "May Hong",
      "weight": 0.04974576
    }
  ],
  "topics": [
    {
      "name": "Movies"
    },
    {
      "name": "K-pop"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.95703125
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.92919921875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.63671875
    }
  ],
  "sentiment": {
    "positive": 0.78603506,
    "negative": 0.0760994,
    "neutral": 0.13786553
  },
  "summary": "The animated Netflix film \"KPop Demon Hunters\" is being celebrated in New York with a sing-along version in theaters. The film, which premiered on Netflix in June, follows K-pop band Huntr/x who moonlight as demon hunters to protect their fans from supernatural danger. The event, dubbed “K-Pop Dem Hunters Golden weekend, included a sunrise lighting ceremony at the Empire State Building with the film's stars Arden Cho, May Hong, and Rei Ami. The musical action flick is currently the second-most-watched film on Netflix with 210.5 million global views. It has been praised for its unique blend of Korean mythology, K-Pop culture and animation inspired by anime and concert visuals.",
  "shortSummary": "The stars of Netflix’s \"KPop Demon Hunters” lit up the Empire State Building in New York, celebrating its massive success and potential sequel, with a sing-along in the Big Apple.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6b93f985ba78459fa9537b2266f557ab",
  "places": [
    {
      "osmId": "34633854",
      "road": "5th Avenue",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10118",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Manhattan Community Board 5",
      "coordinates": {
        "lat": 40.74844205,
        "lon": -73.98565890160751
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/22/entertainment/prince-william-and-harrys-cousin-lady-kitty-spencer-34-spotted-with-rarely-seen-husband-michael-lewis-66-in-saint-tropez/",
      "text": "Prince William and Harry’s cousin Lady Kitty Spencer, 34, spotted with rarely seen billionaire husband, 66, in St-Tropez\nLady Kitty Spencer was spotted soaking up the last of the summer sun with her mother and her rarely seen South African billionaire husband in St-Tropez, France.\nPrince William and Harry’s cousin, 34, enjoyed a laid-back day at the swanky Club 55 on Pampelonne Beach in Ramatuelle with her 66-year-old husband, Michael Lewis, and mom Victoria Aitken, 60.\nKitty, who has been married to Lewis for five years, held hands with her beau as they strolled to the beachfront restaurant for a lavish meal.\nFor the outing, Princess Diana’s niece opted for a red, pink and white floral co-ord that featured a cropped bralette with a matching flowy skirt.\nShe topped off her summery look with a Dolce & Gabbana straw bag, sunglasses and minimal jewelry.\nAitken, for her part, looked chic in a white linen flowy dress, which she paired with an oversized white bag and a pair of blacked-out shades.\nLewis, meanwhile, opted for a light blue shirt, striped beach shorts and a pair of tan boat shoes.\nThe businessman, who is five years older than Kitty’s father, Earl Spencer, married the model in July 2021.\nThe duo exchanged vows at the Villa Aldobrandini near Rome after having postponed their nuptials for two years due to the pandemic.\nThe exclusive three-day celebration was attended by a slew of celebs, royals and business honchos.\nThe couple went on to welcome their daughter, Athena, in April 2023.\nKitty has largely kept her personal life out of the spotlight and rarely posts photos of her husband on social media.\nThe pair had met through mutual friends in 2018, and struck up a romance the following year.\nStill, when it comes to her daughter, Kitty often shares sweet tributes on Instagram about the toddler.\n“Two years of you lighting up our world, my darling Athena,” she wrote when her daughter turned two.\n“You are sunshine and joy and all things magic. My little girl forever. How proud I am to be your mummy. I love you more than you could ever imagine or I could ever articulate.”\nThe touching post saw Athena’s famous aunts, Lady Eliza and Lady Amelia, rush to the comments section at the time.\n“Happy 2nd Birthday to my sweetest little love,” they wrote. “You are my whole heart, and I love and cherish you more than you will ever know. Thank you for giving us the greatest gift @kitty.spencer.”"
    },
    {
      "url": "https://nypost.com/2025/08/23/entertainment/emily-in-paris-assistant-director-diego-borella-dead-at-47/",
      "text": "‘Emily in Paris’ assistant director collapses, dies during filming of hit Netflix show\nDiego Borella, an assistant director on the Netflix show “Emily in Paris,” has died.\nThe series was shooting in Venice at the Hotel Danieli when Borella, 47, reportedly collapsed in front of the crew.\nPer La Repubblica, medics were unable to save him after showing up around 7 p.m. on Thursday. The outlet states Borella reportedly suffered a heart attack.\nAt the time, the show was shooting the final scene of Season 5.\nProduction on the last episode has allegedly been stopped. Originally, the shoot was set to wrap on Monday, Aug. 25.\nBorella was reportedly on schedule to shoot the final scene before he collapsed.\nThe Post has reached out to Netflix for comment.\nThe Venice health service said, per The Independent, “Our ambulance arrived at 6:42 p.m. Medics made attempts to resuscitate him. But in the end all efforts proved fruitless. At around 7:30 p.m., he was pronounced deceased.”\nBorella was born in Italy and worked in Rome, London and New York throughout his career.\nDays before Borella’s death, Lily Collins, who stars as Emily Cooper, shared some behind-the-scenes shots from filming.\n“Joy ride to and from work with the best…,” she captioned the pictures that included an image of her co-star Ashley Park.\nAll 10 episodes of Season 5 are set to debut on Netflix on December 18.\nThe fan-favorite series, created by Darren Star, follows Emily, an American marketing executive navigating her life in Paris.\nHowever, new episodes will see the fashionista relocate from the French capital to Italy. The fifth season will be set in Rome and Venice.\nThe series first ventured into Rome during Season 4.\n“It was so great to go from Paris to Rome because you’re still in Europe and you’re still feeling that romance and passion of Europe, but you’re getting to experience a different part of history which was really fun,” Collins, 36, told The Hollywood Reporter at last year’s premiere.\nNetflix, meanwhile, shared a synopsis for the upcoming season earlier this week.\n“Now the head of Agence Grateau Rome, Emily faces professional and romantic challenges as she adapts to life in a new city. But just as everything falls into place, a work idea backfires, and the fallout cascades into heartbreak and career setbacks.”\n“Seeking stability, Emily leans into her French lifestyle, until a big secret threatens one of her closest relationships. Tackling conflict with honesty, Emily emerges with deeper connections, renewed clarity, and a readiness to embrace new possibilities,” the statement revealed.\nThe Netflix show also stars Philippine Leroy-Beaulieu, Lucas Bravo, Samuel Arnold, Bruno Gouery, William Abadie, Lucien Laviscount, Minnie Driver, Eugenio Franceschini, Thalia Besson, Arnaud Binard, Paul Forman, Bryan Greenberg and Michèle Laroque.\nIn October, Bravo, 37, hinted at being done with “Emily in Paris.”\nAccording to the Times, the actor said in an interview with the French newspaper Le Figaro, that he was feeling finished with the show because “Life is short. It takes five months to shoot this series. Do I want to sacrifice them by telling something that does not stimulate me?”\nBravo added, “I do not want to be a part of a cog that does not tend to take the intelligence of viewers into consideration.”\nHowever, the star did decide to reprise his role.\nBravo also told The Hollywood Reporter that he was hoping his character, Gabriel, would see some growth in season five.\n“He made a few choices that made me kind of grow away from him,” admitted Bravo. “We were very much alike in season one, but now, I don’t really know. I think I feel like he needs to get his shit together.”\nBut the “Ticket to Paradise” alum isn’t the first person to criticize the storylines on the show.\nIn 2021, Brooklyn sports writer Greg Wyshynski told The Post, “Remember that scene in ‘Goodfellas’ where they slice the garlic with the razor so it just melts away in the pasta sauce? That’s how thin the characters, plots and stakes are for this television program.”\nHe continued, “No one learns. No one grows. Emily is less protagonist than a passenger in the back of a Parisian taxi … But it’s a good hate watch because it’s not aggressively bad or infuriating. It’s just pretty and it’s there.”\nJenny Marston, a London blogger, also told The Post, “It’s definitely quite problematic in parts, hugely stereotyped and highly unrealistic. Particularly in the way that Emily’s Internet fame took off almost literally overnight! All of these things are enough to make you inwardly cringe but because it was such a quirky, fun and light-hearted watch, that’s what kept people tuning in.”"
    },
    {
      "url": "https://nypost.com/2025/08/23/entertainment/the-walking-dead-actor-norman-reedus-son-mingus-arrested-for-assault-in-nyc/",
      "text": "‘The Walking Dead’ actor Norman Reedus’ son, Mingus, arrested for assault in NYC\nActor Norman Reedus’ son, Mingus Lucien Reedus, was arrested for assault in Manhattan Saturday morning, police sources told The Post.\nThe 25-year-old sometimes-model spawn of former Victoria’s Secret Angel Helena Christensen and “Walking Dead” actor allegedly punched his 33-year-old female victim – who later identified herself as his girlfriend to The Post – in the leg, causing redness, and then choked her and slammed her to the ground, police sources said.\nReedus, who is listed in public records as living in a swanky Chelsea apartment, was charged with criminal obstruction of breathing and assault in the third degree, another cop source said.\nThe sources said Reedus called 911 around 8:40 a.m. about a woman taking pills and threatening suicide at the West 16th Street apartment. When cops arrived, the woman said Reedus had assaulted her, according to sources, who said she was then taken to Bellevue Hospital in stable condition.\nThe woman who identified herself as Reedus’ girlfriend walked out of the 10th NYPD Precinct alongside an unidentified man at around 11:45 p.m.\n“You got your story all wrong,” the man said to a Post reporter who asked a question.\n“It was a misunderstanding,” added the thin, short woman, who was wearing big sunglasses and a leather jacket as the pair walked down West 20th Street.\nWhen asked why she called the police, the woman fired back: “He called the police.”\nHer potty-mouthed companion repeatedly told the reporter to “f–k off” until the pair hopped in a cab on Eighth Avenue.\nA disheveled Reedus with heavy eyelids was photographed being led out of the building by cops around 9:25 a.m.\nReedus, clad in green shorts, a black t-shirt and handcuffs, called a Post reporter and a photographer “ugly” as cops escorted him out of the 10th Precinct Saturday afternoon, and reiterated his apparent girlfriend’s claims that the incident was “a misunderstanding” in response to questions.\n“Why did you call the police?” a reporter called out, to which Reedus responded, “I didn’t.”\nWhen the reporter asked him to “tell us what really happened,” the accused assaulter could be seen grinning and chuckling, before replying “no.”\nIt’s not the first time the nepobaby has been accused of assault.\nIn March 2022, Reedus copped a plea deal for allegedly punching a woman during the San Gennaro Festival in Little Italy in the fall of 2021.\nThe victim in that case, a 24-year-old woman, was taken to the hospital with a cut under her left eye after she said Reedus struck her in the face during an argument. The two didn’t know each other, it was reported at the time.\nThe ugly incident occurred just a week after Reedus made his debut on the cover of Vogue Hommes.\nHe pleaded guilty to disorderly conduct, though his indignant lawyer thought he should’ve had to take “less responsibility” in the assault case.\nAn assistant district attorney, however, said the victim wished Reedus would “take more accountability” than the plea bargain offered.\nReedus, who was 22 at the time, was sentenced with a cushiony conditional discharge, which only required him to stay out of trouble for a year and participate in at least five counseling sessions.\nThe troubled child of privilege, who reportedly began modeling in 2017 and signed with The Society Management, apparently shifted his interests to making music this summer. He has put out five songs on Spotify since May, with the latest two being released on Aug."
    }
  ],
  "argos_summary": "The article highlights the New York celebration of the Netflix animated film \"KPop Demon Hunters,\" featuring a golden lighting of the Empire State Building and the film’s stars discussing its success and future plans. It also reports on Lady Kitty Spencer’s vacation in St‑Tropez with her husband and daughter, noting her family’s private lifestyle. Additionally, the piece covers the tragic death of \"Emily in Paris\" assistant director Diego Borella during filming in Venice, and the arrest of Norman Reedus’ son Mingus for assault in Manhattan, detailing the legal and personal ramifications of the incidents.",
  "argos_id": "WTMIWZ3OH"
}