{
  "url": "https://www.polygon.com/critical-role-not-choosing-daggerheart-campaign-4-dungeons-dragons/",
  "authorsByline": "Francesco Cacciatore",
  "articleId": "f86a3c67110049db82b16b16bf83e797",
  "source": {
    "domain": "polygon.com",
    "paywall": false,
    "location": {
      "country": "be",
      "county": "Antwerp",
      "city": "Antwerp",
      "coordinates": {
        "lat": 51.2211097,
        "lon": 4.3997081
      }
    }
  },
  "imageUrl": "https://static1.polygonimages.com/wordpress/wp-content/uploads/2025/08/matt-mercer-d-d-daggerheart.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T13:30:15+00:00",
  "addDate": "2025-08-23T13:36:01.262265+00:00",
  "refreshDate": "2025-08-23T13:36:01.262270+00:00",
  "score": 1.0,
  "title": "Critical Role choosing D&D over Daggerheart for Campaign 4 makes sense",
  "description": "Not going with Daggerheart was the right choice",
  "content": "Critical Role's Campaign 4 is already surprising fans months before its official start. First came the announcement that Brennan Lee Mulligan of Dimension 20 fame would be the Game Master, letting Matt Mercer finally break free of the \"eternal DM\" curse. Then, on Aug. 21, the question that everyone was asking was answered: Campaign 4 would not use Critical Role's in-house game, Daggerheart, but would stick with Dungeons & Dragons.\n\nThe decision has sparked debate. I've read TTRPG players online claiming that, while they were on the fence about Daggerheart but looking forward to trying it on the heels of Campaign 4, they will now abandon that prospect completely. If Critical Role isn't willing to bet on their own game, why should players? That's a reasonable argument, but I also think that after taking a deeper look, it's easy to understand why Critical Role decided to use D&D for their upcoming campaign.\n\nBrennan Lee Mulligan is not just the Game Master for Campaign 4, he's also the creator of the world in which the new game will take place, Aramán. Much like Exandria (the world where the first three campaigns of Critical Role take place), it's not unlikely that this setting will spark its own products, starting from sourcebooks and ranging to other media. If Mulligan is a smart about his business, as well as his storytelling, he will be thinking about this. We also don't know when his deal with Critical Role was finalized, and at the time Mulligan could have already had a deal with Wizards of the Coast to publish his products under the D&D umbrella.\n\nAlso, Mulligan has probably been working on this world for a long time, starting when Daggerheart was still in development. The most logical choice, thus, was to tailor Aramán for D&D rather than for a game that still had to come out. Could Mulligan adapt his work for Daggerheart? Absolutely, but something else has to be considered, then. Choosing Daggerheart for Campaign 4 was not convenient for Critical Role, either.\n\nI wrote earlier this month that Critical Role and Wizards have entered a \"cold war,\" and I still think it's an accurate statement. During the actual Cold War, the last thing that the United States and the Soviet Union wanted was to drop bombs on each other, aware of the mutual destruction consequences. Similarly, Critical Role has no interest in pissing off Wizards by dropping D&D from its most-watched actual play show. Their media powerhouse is built on Dungeons & Dragons, after all. And the group can always keep playing and showcasing Daggerheart on any other occasion. During the Aug. 21 announcement, Critical Role founders Matt Mercer, Travis Willingham, and Marisha Ray stated that more Age of Umbra and other Daggerheart content is on the horizon, plus more partners will be doing Daggerheart actual plays, including Dungeons & Dads and Legends of Avantris.\n\nConsidering that the game is already sold out, Critical Role probably wasn't worried about pushing Daggerheart into every corner of the business. Instead, the creatives behind it took the more cautious approach and avoided two dangers: alienating part of their fanbase who could have been put off by the change in system, and souring their relationship with Wizards of the Coast. Finally, let's not forget that Daggerheart is still a newborn game. It may simply not be ready to be showcased on such a stage during a years-long campaign. Meanwhile, Chris Perkins and Jeremy Crawford — the former creative director and game director for D&D — are working on their Daggerheart setting. Once that is ready, I'm sure there will be a good chance to see it showcased, perhaps during Critical Role Campaign Five.\n\nChoosing Daggerheart for Campaign Four would have been a bold choice for Critical Role. Instead, they took the most business-savvy decision and went with Dungeons & Dragons. Time will tell what impact, if any, this will have on the future of the two games.",
  "medium": "Article",
  "links": [
    "https://www.polygon.com/dnd-dungeons-dragons/",
    "https://www.polygon.com/dnd-critical-role-war-daggerheart/",
    "https://www.polygon.com/critical-role/",
    "https://www.polygon.com/critical-role-campaign-4-brennan-lee-mulligan/",
    "https://www.polygon.com/critical-role/599974/daggerheart-review-critical-role-ttrpg-rules-overview/",
    "https://www.polygon.com/critical-roles-campaign-4-cast-reveal-trailer/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Critical Role Campaign",
      "weight": 0.1251899
    },
    {
      "name": "Critical Role",
      "weight": 0.11912445
    },
    {
      "name": "Critical Role founders Matt Mercer",
      "weight": 0.10713632
    },
    {
      "name": "other Daggerheart content",
      "weight": 0.09681926
    },
    {
      "name": "Daggerheart actual plays",
      "weight": 0.09599492
    },
    {
      "name": "Daggerheart",
      "weight": 0.091674216
    },
    {
      "name": "Critical Role Campaign Five",
      "weight": 0.07388318
    },
    {
      "name": "Critical Roles Campaign",
      "weight": 0.07388318
    },
    {
      "name": "Campaign Four",
      "weight": 0.07205539
    },
    {
      "name": "game director",
      "weight": 0.07175755
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Games/Computer & Video Games/Gaming Reference & Reviews",
      "score": 0.95947265625
    },
    {
      "name": "/Games/Computer & Video Games/Action & Platform Games",
      "score": 0.658203125
    },
    {
      "name": "/Games/Computer & Video Games/Adventure Games",
      "score": 0.4794921875
    },
    {
      "name": "/Games/Roleplaying Games",
      "score": 0.46044921875
    }
  ],
  "sentiment": {
    "positive": 0.11180777,
    "negative": 0.5383766,
    "neutral": 0.34981558
  },
  "summary": "Critical Role's Campaign 4, the official start of the campaign, has been surprising fans by choosing to stick with Dungeons & Dragons over Critical Role's in-house game, Daggerheart. The decision has sparked debate with some players suggesting that Critical Role should not bet on their own game, as it is already sold out. However, author argues that the decision to choose D&D over Daggerheart makes sense. Brennan Lee Mulligan, the creator of the world in which the new game will take place, Aramán, is also Mulligan's creation of the setting, which could potentially spark its own products. Despite this, Critical Role has no intention of upsetting Wizards of the Coast by dropping D&G from its most-watched actual play show, as their media powerhouse is built on Dungeons and Dragons. The company can continue playing Daggerheart and showcasing it on any other occasions.",
  "shortSummary": "Critical Role's Campaign 4 will use D&D for the first time, surprising fans but ultimately benefiting from a business-savvy decision that avoids backlash and potential product launches.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ef9297607e9f4d93a71db1c1913e6022",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.polygon.com/critical-role/",
      "text": "Critical Role choosing D&D over its own game for Campaign 4 makes sense\nThis may seem surprising, but not going with Daggerheart was the right choice\nThis may seem surprising, but not going with Daggerheart was the right choice\nWhat is West Marches, anyway?\nLuis Carazo, Robbie Daymond, Aabria Iyengar, Whitney Moore, and Alex Ward join Critical Role's campaign\nAs Critical Role continues to expand its grip on the TTRPG world, Wizards of the Coast outlines a new strategy\nHiring Brennan Lee Mulligan for Campaign 4 is smart business — but it's still business\nDropout star Brennan Lee Mulligan is set to lead the next core campaign for the actual play empire\nThis slow-burn romance deserves an upgrade\nWildemount’s mightiest defenders\nExandria’s mightiest heroes are going virtual\nTusk Love combines bodice-ripping smut with fantasy fight scenes\nSamantha Béart’s latest role sees them voice a protagonist with a wet ‘n wild skillset\nAppearances may be friendly, but Daggerheart and Critical Role are aiming for D&D’s spot\nIt’s a fully fledged RPG war now\nAdvantage is rebalanced and combat is more dynamic\nThe Critical Role founders are together again for a game about hope, sacrifice, and survival\nRead a preview of the story here, before Free Comic Book Day\nThree original fairy tales penned by Liam O’Brien\nPercy de Rolo is looking sharp\nThe Dimension 20 and Critical Role Game Masters showed me how to invent God\nWriter Aabria Iyengar digs into the secret history of Critical Role’s flamboyant merchant\nWho better to headline an Avowed adventure than someone who’s lived it?"
    },
    {
      "url": "https://www.polygon.com/critical-role/599974/daggerheart-review-critical-role-ttrpg-rules-overview/",
      "text": "The popularity of the actual play show Critical Role helped make 5th edition Dungeons & Dragons wildly successful. But now, Critical Role Productions has become more than a booster and frequent collaborator for D&D: It’s become a competitor. After years in development, Daggerheart, a tabletop RPG from Critical Role’s publishing imprint, Darrington Press, launches today. And the book shows just how much lead designer Spenser Starke and the book’s other designers have learned from playing 5e, as they address some of that game’s biggest issues.\nProblem: Failure is boring\nThere are few things as satisfying as rolling a natural 20 in a clutch situation in D&D, but D&D’s d20 system has a big drawback. It’s inherently very swingy, with a wide range from success to failure, and it can lead to situations where failure means the PCs accomplish nothing, and the story doesn’t move forward in a meaningful way. Roll low, and you might miss an attack, miss a key clue needed to progress the plot, or be unable to bypass a locked door to get to the next goal.\nDaggerheart changes the math by having players roll two d12s and add the results, which generally smooths the probability curve in favor of success. But the more significant change is a system inspired by how Fantasy Flight’s Star Wars roleplaying game represents the pull of the light side and dark side of the Force. One of the d12s represents hope, while the other is fear, and the higher number determines which aspect is dominant in the totalled roll.\nSucceeding with hope is nothing but good news for the PCs. Failing with hope gives them a hope point, a resource that can be spent on numerous special abilities, as a sort of consolation prize. Fear, in turn, gives the game master a fear point they can use to introduce complications or activate abilities for antagonistic NPCs.\nThat system, combined with a collaborative narrative focus, means there’s never an instance where a roll has no effect. If you can’t pick that lock, you might hear guards approaching, or even trigger a trap, depending on whether you failed with hope or fear. Miss a roll with fear in combat, and an antagonist will get a turn to act. Failure always has consequences that move the game forward.\nProblem: Advantage and disadvantage are too significant\nOne of 5e’s key mechanics is the concept of advantage and disadvantage — rolling two d20s and taking the better or worse result, respectively. It’s an elegant way to avoid having numerous modifiers for conditions like being aided by an ally or trying to strike a hidden foe. But the math makes those edges and penalties too significant.\nDaggerheart keeps the concept, but changes the effect to adding or subtracting a d6. The game also simplifies D&D’s laundry list of conditions — “grappled,” “paralyzed,” “heavily obscured,” etc. — to just three options: “hidden,” “restrained,” and “vulnerable.” It creates a convenient way to modify rolls without making GMs worry about the specific mechanics too much.\nProblem: Species and background choices are too important\nIn the original 5e ruleset, players had to limit their species and background choices to ensure they got attribute boosts to the key stats for their class, or risk not being able to hit as frequently or do as much damage as players who made the more optimized choices. The 2024 ruleset removed attribute bonuses from species, but instead shunted them into backgrounds. That means you’re operating at a real disadvantage if, for story reasons, you want your wizard to have been a soldier instead of a scribe.\nAttributes are entirely divorced from these decisions in Daggerheart, and just assigned based on what’s best for your character class. The other decisions give you flavorful minor abilities that might be better for some classes, but are fairly broadly applicable, like a giant having extra hit points, or a person who grew up in the wilderness being able to move silently. It keeps the mechanics from getting in the way of the fantasy.\nProblem: Spellcasters have a lot more choices than non-casters\nAdmittedly, this isn’t a problem for everyone. Some new TTRPG players can be intimidated by lots of options, and might prefer the simplicity of playing a fighter who’s mostly going to move and attack on their turn, rather than considering which spells to use and prepare. Wizards of the Coast worked to offer more complexity to martial characters in the 2024 rules with the weapon mastery system, but mostly created more subclasses that are hybrids of casters and weapon-wielders.\nNo matter your class, Daggerheart characters all have equivalent options, thanks to a card system reminiscent of 4e D&D or Gloomhaven. Every level, characters get to choose new cards, which could represent a wizard using a runic ward, or a bard bolstering their allies with a pep talk. The modularity of the system also makes it easier to multiclass by just taking cards associated with other classes, at the price of digging deeper into your base abilities.\nThere’s still more work to be done\nFor all the problems they’ve solved, the Daggerheart designers left some big holes that need filling. The downtime action section is very thinly sketched. The game is deeply ambivalent about loot, preferring to abstract treasure rewards and costs into amounts like “a handful of gold” or “a chest of gold.” Upgrading gear is important to stay competitive, but the section on weapons is the weakest past of the entire book: Weapons follow a clear linear progression based on character tier, but their stats are printed over and over again, rather than being condensed with the formula.\nAnd GMs are encouraged to come up with their own gear, but there are no tools provided. Special items only available at higher tiers have random names, like Wand of Essek or Aantari Bow, with no descriptions to give them the character of powerful D&D magic items.\nBut overall, Daggerheart is a strong evolution of medieval fantasy roleplaying. It shows a deep understanding of Dungeons & Dragons’ flaws, addressing them by drawing on the strengths of other systems. Even for groups not ready to fully make the switch to a new game, the book can provide some inspiration for making a D&D game a bit better.\nDaggerheart is available for purchase now at through Critical Role shops and local game stores in the Darrington Press Guild, which offer a PDF free with a physical copy. The core set will arrive at Amazon and book stores including Barnes & Noble and Books-A-Million starting June 3. The free beta playtest is still available at DriveThruRPG.\nFor those who want to see Daggerheart in action, Critical Role has released several one-shots and specials. “Age of Umbra,” new eight-episode series run by Matthew Mercer will launch on May 29."
    },
    {
      "url": "https://www.polygon.com/critical-role-campaign-4-brennan-lee-mulligan/",
      "text": "When it comes to dominating the TTRPG scene, Critical Role can’t stop, won’t stop. Having mainstreamed Dungeons & Dragons actual play, adapted their campaigns into popular animated series, and launched their own tabletop system in this year’s Daggerheart, it’d be easy to think the CR gang might be out of surprises. Then Brennan Lee Mulligan showed up.\nOn Saturday night, Critical Role officially announced Campaign 4, which will, for the first time in CR’s core campaign, introduce a brand new host: Dimension 20’s Dungeon Master. Mulligan will take over for Matt Mercer when Campaign 4 launches in October.\nAccording to a news release, Mulligan will step into the Game Master seat for the full duration of Campaign 4, “bringing his signature depth, humor, wit, and high-stakes drama to Critical Role’s next grand adventure.”\n“We’ve been enormous fans of Brennan’s for many years now, and when it came to giving both Matthew Mercer and the world of Exandria a bit of a breather, Brennan felt like the perfect storyteller to take our community somewhere entirely new.” said CR CEO and cast member Travis Willingham. “Critical Role has always been about genuine connection through storytelling first and foremost, and as Brennan himself will tell you, he’s still played more TTRPGs away from a camera than in front of it. His passion and drive for worldbuilding is infectious, and it's been an absolute joy to spark off him as we forge ahead.\"\n\"What a gift, a privilege and an honor to be invited behind the screen of Critical Role for this next epic adventure,\" said Mulligan. \"Every collaboration we have had together has brought nothing but sheer joy, and Campaign 4 will be no exception. I'm finally playing *almost* as much tabletop as I'd like to!\"\nFor anyone worried about Mulligan’s tenure on Dimension 20 and Dropout.TV, fear not: Per Variety, he has also signed a three-year contract to continue work with the improv comedy network.\nCritical Role says Campaign 4 will premiere on Thursday, Oct. 2 with instant access on Beacon.tv as well as streamed to the official YouTube and Twitch channels. The VOD will be available to all on the following Mondays.\nHere at Polygon, we’re big fans of all things Critical Role, Dimension 20, and all things Mulligan. Here’s a recent highlight of CR’s new DM in action."
    },
    {
      "url": "https://www.polygon.com/dnd-critical-role-war-daggerheart/",
      "text": "Tabletop role-playing games fans usually get their excitement from letting their imagination run free and living amazing adventures from the comfort of their homes. However, that excitement is spilling out into the real world as some noticeable momentum is rocking the status quo in the TTRPG industry.\nEarlier this year, the two biggest designers responsible for the fifth edition of Dungeons & Dragons, Chris Perkins and Jeremy Crawford, left Wizards of the Coast to pursue new professional avenues. In June, the two were presented as the new creative director and game director for Darrington Press, the tabletop-games publishing arm of Critical Role. This came on the heels of the official release of Critical Role’s first TTRPG: Daggerheart. After the group became famous for playing D&D on their successful actual play show, which spawned a multimedia sensation, they are now ready to offer an alternative for gamers.\nWhile I love drama just as much as anyone else, one thing must be clear: The two sides are not at odds. Critical Role and Wizards of the Coast are still working together, and Mercer & Co.’s recently announced Campaign 4 will likely be using the D&D system like the three previous ones. Perkins and Crawford continue to appear in official D&D posts on social media and at other promotional events. Both parties have made it clear that their relationship is as amicable as possible. However, just like during the Cold War, it seems that the TTRPGs world will now be gravitating around two superpowers whose choices and actions will, in large part, influence the future of the industry. And among the two sides, one seems a lot more active and bolder than the other.\nAfter the announcement on Aug. 4 that Brennan Lee Mulligan will be the dungeon master for Critical Role’s campaign 4, it’s undeniable that, as we wrote in our coverage of that news, “When it comes to dominating the TTRPG scene, Critical Role can’t stop, won’t stop.” They have now officially assembled an all-star team that will make comparisons with the Avengers trite but inevitable. But if Critical Role has become the World’s Mightiest Heroes of TTRPG, then what about Wizards of the Coast? The company that, you know, owns the rights to the game that made Critical Role a thing?\nMarvel Comics fans with a mischievous attitude may be quick to compare Wizards with the Champions or even the Great Lake Avengers, but the company is actually not sitting on its hands. On June 30, Dan Ayoub, who recently became the head of the Dungeons & Dragons franchise for Wizards, shared a post on D&D Beyond, aptly titled “D&D’s New Direction.” After acknowledging the importance that D&D had in his life and career, Ayoub wrote: “I’m here to open a dialogue with you – the players, Dungeon Masters, live stream watchers, and storytellers.” He then moved to list the four core points of this strategy: a reassurance that the D&D 2024 rules do not replace 5e but enhance them; the promise to update the System Reference Document (SRD) regularly; the reveal that the Maps virtual tabletop system will be free for all D&D Beyond users, starting Sep. 16; the announcement of a new initiative “to create a rotating advisory group made of creators, publishers, educators, and fans,” which will help the company shape future tools, policies, and products.\nThe point about the SRD will surely reassure the many creators who publish their own D&D products under the Creative Commons license, and making Maps free will improve many online games, but the final point looks like the most interesting. After having lost its top creative minds (as a reminder, Mike Mearls, another lead designer for 5e, left in 2024 for rival Chaosium,) Wizards’ D&D department clearly has to think about the future carefully and design a strategy that will let the product move forward without being offset by these losses. And the hits keep coming: The creator of the Eberron setting, Keith Baker, will design an original Daggerheart setting, while Crawford and Perkins are also developing their own setting for Darrington’s game. It seems that Wizards’ strategy will be to get the community and its most active members more involved. A grassroots approach may truly bring a fresh perspective to the product and push it in unexpected directions, but it will be interesting to see how it will clash with a company that has acquired a reputation for being ruthless and profit-driven in the eyes of those same fans it now wants to involve.\nAgain, there is no official competition between Critical Role and Wizards of the Coast. Daggerheart is still a newborn game, and even the great sales numbers from its release do not guarantee that it will ever reach the popularity and diffusion of Dungeons & Dragons. However, the latter’s recent mainstream success was built on a number of factors (hello, Stranger Things!) that include Critical Role’s popularity. What happens when Mercer, Willingham, Bailey, Riegel, etc., decide to put all their efforts into pushing their own game?\nAnd even if we discard an hypothetical “D&D vs. Daggerheart” scenario, with the moves that Critical Role is making, at the very least Wizards should be worried, from a brand perspective, that the product it labels “The world’s greatest role-playing game” could soon be associated more easily with a third party than with the company that owns it."
    },
    {
      "url": "https://www.polygon.com/critical-roles-campaign-4-cast-reveal-trailer/",
      "text": "Critical Role has unveiled the main cast for its highly anticipated fourth campaign, confirmed the use of Dungeons & Dragons (2024 rules), and introduced a West Marches–style structure with rotating tables, exploring a brand-new world beyond Exandria.\nLed by award-winning storyteller and Game Master Brennan Lee Mulligan, Campaign Four will incorporate both official rules and homebrew content from Jeremy Crawford and Chris Perkins of Darrington Press. The star-studded lineup includes Critical Role founders Laura Bailey, Taliesin Jaffe, Ashley Johnson, Matthew Mercer, Liam O’Brien, Marisha Ray, Sam Riegel, and Travis Willingham, joined by Luis Carazo, Robbie Daymond, Aabria Iyengar, Whitney Moore, and Alex Ward. Together, they’ll explore Aramán with a fresh, West Marches–inspired style of play.\n\"When creating the worlds that we build and explore in all of our content at Critical Role, we have always held strong to the belief that we should use the system that best supports the story we want to tell,\" said Marisha Ray, creative director, co-founder, and cast member of Critical Role. \"We are certainly spoiled for choice when it comes to TTRPG systems that the cast knows and loves, so we are very excited to explore more of both Daggerheart and Dungeons and Dragons in our near (and hopefully distant) future.\"\nThe first four episodes will serve as an Overture, introducing all 13 cast members and weaving their stories through intersecting scenes before the narrative branches into three smaller tables — the Soldiers, Schemers, and Seekers — while overarching themes and genres tie the story together.\nCampaign Four premieres on Oct. 2 with instant access on Beacon.tv and simultaneous streams on Critical Role’s YouTube and Twitch channels. VODs will be available for all viewers the following Monday, and the podcast will be released in two parts: the first a week after the premiere, the second the following Tuesday. Beacon members will also enjoy exclusive access to all Campaign Four episodes of Critical Role: Cooldown, offering a front-row seat to the cast’s post-show reactions."
    },
    {
      "url": "https://www.polygon.com/dnd-dungeons-dragons/",
      "text": "Critical Role choosing D&D over its own game for Campaign 4 makes sense\nThis may seem surprising, but not going with Daggerheart was the right choice\nThis may seem surprising, but not going with Daggerheart was the right choice\nWhat is West Marches, anyway?\nLuis Carazo, Robbie Daymond, Aabria Iyengar, Whitney Moore, and Alex Ward join Critical Role's campaign\nSword World RPG is the Japanese phenomenon that did Critical Role before Critical Role\nAs Critical Role continues to expand its grip on the TTRPG world, Wizards of the Coast outlines a new strategy\nDropout star Brennan Lee Mulligan is set to lead the next core campaign for the actual play empire\nLegends of Greyhawk promises ‘less rules, more fun’\nJourney back to the Keep on the Borderlands\nOr Knights of the Old Republic 2, for that matter\nHeroes of the Borderlands will be released Sept. 16\nA trip down CRPG memory lane, if you can ignore the bad camera\nNarrative and roleplay are great in DnD, but the game has more to offer\nWith experience from D&D and Magic: The Gathering, Jess Lanzillo joins to help shape the future of World of Darkness.\nThe guide from the writer of Level Up: Monstrous Menagerie is on Kickstarter now\nThis is what I learned from playing Dungeon Crawl Classics\nTusk Love combines bodice-ripping smut with fantasy fight scenes\nAfter player feedback, the designers are taking another crack at the powerful Warlock subclass\nSamantha Béart’s latest role sees them voice a protagonist with a wet ‘n wild skillset"
    }
  ],
  "argos_summary": "Critical Role’s upcoming Campaign 4 will use Dungeons & Dragons instead of its own Daggerheart system, a decision driven by business considerations, the new world Aramán’s fit with 5e, and a desire to avoid alienating fans and souring ties with Wizards of the Coast.  The campaign will be led by Brennan Lee Mulligan, who created Aramán and will bring a fresh West‑Marches‑style structure to the show.  Mulligan’s long‑term partnership with Wizards and the fact that Daggerheart is still a nascent product make D&D the safer, more familiar choice for a high‑profile, multi‑platform production.  The move reflects Critical Role’s strategy to balance innovation with the commercial realities of its flagship franchise.",
  "argos_id": "WZQ2ASLRQ"
}