{
  "url": "https://www.slashgear.com/1944452/how-to-use-brickit-app-for-lego-builds-utilize-extra-pieces/",
  "authorsByline": "Jonathan H. Kantor",
  "articleId": "0a7726fb47cb4175807c9aaf26915660",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/do-you-have-a-ton-of-lego-pieces-nothing-to-build-this-app-can-help/l-intro-1755619831.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-24T02:45:00+00:00",
  "addDate": "2025-08-24T02:52:42.025629+00:00",
  "refreshDate": "2025-08-24T02:52:42.025630+00:00",
  "score": 1.0,
  "title": "Do You Have A Ton Of LEGO Pieces & Nothing To Build? This App Can Help",
  "description": "If you have a ton of LEGO pieces laying around and you don't know what to do with them, there is an app you can download that can give you things to build.",
  "content": "If you're an avid fan of LEGO and its many build sets, odds are you have a drawer or box filled to the brim with extra pieces. This is because LEGO always includes additional parts primarily as a backup on most sets. The pieces are typically small or easily breakable, so LEGO throws some extras into the box. They're also included by weight, so some lighter pieces can make it into the set that may not have been intended.\n\nSome LEGO sets are incredibly expensive, so using your old bricks can save some cash. Brickit, which is available on IOS and Android, is designed to help builders come up with designs for their spare pieces. According to the Brickit website, all you need to do is \"Scatter your bricks and take a photo. Brickit will show you hundreds of ideas for what to build with them, along with the exact location of each piece you'll need.\"\n\nYou're not going to build something like a valuable LEGO set, but you'll have a lot of fun. The app also catalogs all of your parts, so subsequent photos will add to this database and include them in future build projects. For fans of LEGO, Brickit is a game-changer, but it's not without flaws, as the nascent app could use some tweaking to improve performance, particularly in terms of piece recognition. Still, despite the issues, the app shows great promise. You can check out a brief demo setupspawn posted on Instagram in May 2025, showing how the app works.",
  "medium": "Article",
  "links": [
    "https://play.google.com/store/apps/details?id=com.brickit.brickit&hl=en_US",
    "https://www.slashgear.com/1937173/lego-most-expensive-sets-ranked-by-price/",
    "https://apps.apple.com/us/app/brickit-app/id1477221636",
    "https://www.instagram.com/setupspawn/reel/DJ9V9OXgR7w/",
    "https://www.slashgear.com/1442249/most-valuable-lego-sets/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "LEGO Pieces",
      "weight": 0.13346559
    },
    {
      "name": "LEGO",
      "weight": 0.10163402
    },
    {
      "name": "extra pieces",
      "weight": 0.10131753
    },
    {
      "name": "piece recognition",
      "weight": 0.09991752
    },
    {
      "name": "most sets",
      "weight": 0.095911175
    },
    {
      "name": "Brickit",
      "weight": 0.077516854
    },
    {
      "name": "additional parts",
      "weight": 0.07585543
    },
    {
      "name": "future build projects",
      "weight": 0.07556505
    },
    {
      "name": "subsequent photos",
      "weight": 0.07461909
    },
    {
      "name": "a valuable LEGO set",
      "weight": 0.074053
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.89501953125
    }
  ],
  "sentiment": {
    "positive": 0.36390108,
    "negative": 0.10907635,
    "neutral": 0.5270226
  },
  "summary": "A new app, Brickish, allows users to create designs for their spare LEGO pieces, which are often used as backup pieces for expensive sets. The app can also catalogs all of their parts, adding them to the database for future build projects. However, it could require some tweaking to improve performance, particularly in the piece recognition.",
  "shortSummary": "Brickit, a mobile app, allows users to create and share designs for spare LEGO pieces, allowing them to be stored and used for building projects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fa52d9f1df7b4f29aaf6d6833520474d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apps.apple.com/us/app/brickit-app/id1477221636",
      "text": "Brickit App 4+\nScan, choose, create!\nBrickit Inc.\nDesigned for iPad\n-\n- Free\n- Offers In-App Purchases\nScreenshots\nDescription\nBrickit helps you build new things with your old bricks.\n1. Spread out your bricks and take a photo of them. The app will scan the photo, identifying and counting the details.\n2. Decide what to build. Brickit suggests building ideas depending on what bricks you have. Choose from robots, kangaroos, X-Wings, and more!\n3. Build your creations using our step-by-step instructions. The instructions are useful, but you don’t have to stick to them exclusively. We give you ideas, and you decide what to make of them.\n4. Find any brick you want easily. Just choose a detail in our catalog, and the app will highlight it in your pile. The bricks you need in the instructions are highlighted in the steps where you need them.\nScanner Pro Subscription:\n— Brickit Pro subscriptions automatically renew unless auto-renewal is turned off at least 24 hours before the end of the current period.\n— Payment will be charged to your iTunes account upon confirmation of purchase.\n— Your account will be charged for renewal within 24 hours of the end of the current period.\n— Users can manage their subscriptions and turn off auto-renewal by going to Account Settings after purchase.\n— Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription.\n— License agreement: https://brickit.app/eula/\n— Privacy policy: https://brickit.app/privacy-policy/\nBrickit was created by fans and is not an official LEGO® product. The LEGO Group of companies does not sponsor or support Brickit.\nWhat’s New\nVersion 4.36.1\nTechnical update: made several bug fixes and performance improvements.\nRatings and Reviews\nReview\nI have mixed feelings about this app. Some parts I hate, and some parts I like. I’m going too talk about the parts that either need improvement or are just straight up annoying. A. The collection Feature… This one I like VERY much! But it needs updating. The latest Lego sets on it are the ones from 2022-mid 2023. The newest Lego sets from the end of 2023- beginning of 2024, have not come out yet in the collection feature. This is the only thing that needs too be updated that I have seen in “The Collection Feature…” B. Terms of publication… I hate the terms of publication. Straight up hate it. I agree that it’s a good system, but it gets a lot of things wrong. I took a picture of something, with no markup, change of lighting, or any other phone editing systems, and it still violated it. For some reason the “Open Terms Of Publication” button isn’t working. I tap and I tap and I tap, it does nothing. Also why did you remove the bio? If you read this pls respond. Also please update the collection feature! That’s all for right now, I bid you farewell.\nP.S. ADD THE NEW LEGO SETS TO THE COLLECTION FEATURE!!! The only updates you’ve ever made to this app are TECHNICAL UPDATES!!! Also WHY THE FRICK DID YOU MAKE IT TO WHERE THE ONLY WAY TO EDIT OUR ACCOUNT IS TO SIGN IN??? NOT EVERYONE HAS GOOGLE OR FACEBOOK OR APPLE!!! F. I. X. THIS!!!\nDeveloper Response ,\nThank you so much for the detailed feedback! It is very important for us to hear an honest opinion from our users. I will definitely tell the team everything! Thank you for being with us!\nGreat app… JUST TWO PROBLEMS\nThis app is great (as long as you have a big open floor). You need a big open floor to actually be able to spread out all of your LEGO pieces super thin so all the pieces can be seen, which can be a pain to pick up later. My second problem is with the posting feature. (Mainly about the “like” feature). You can’t see how many people liked your post, or who liked your post, without refreshing the whole app, like swiping up on your screen and then closing the app. It’s a real pain when I just want to take a quick look at my posts without having to close and reset the app. Please add a “refresh button” to the app. Now, on the plus side, it’s a really great app to find small pieces that I constantly miss in my pile. I also like how there are tons of easy to build LEGO ideas so you never get board. My most favorite part of the app is that you can submit your own idea to the app and the app people ( I don’t know the real term) will look at your idea and will sometimes add your idea into the app so other people can build your own creation. Please add the “refresh button” and I’ll give it a FIVE STAR RATING!\nvery good but...\nthis app is very good, but you have to spread your legos out super thin so it can recognize it and it only does small builds. I don't know about you, but if you want to people who like to be on the big fat builds this is not the app for you and if you have a really small floor this is not the app for you cause you have to have a really big floor to spread up the Legos that thin but if you really like those cute little smaller builds this is the app for you. The builds are pretty small just I don't like it doesn't scan for color to so you end up with this really glitchy looking build so you just have to sort it out yourself but I really wish it was a scam for that kind of stuff. Also if the Legos are too close together it's just gonna mix it up with another piece then you'll have a completely weird build that doesn't look like anything.\nDeveloper Response ,\nThank you for your feedback! Right, Brickit does not take into account the colors of the details. This is our conscious decision. We believe that this expands the possibilities for creativity and creativity, especially when the user does not have so many details. But we will definitely think about how to make it convenient for all users to use our application.\nApp Privacy\nThe developer, Brickit Inc., indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy.\nData Used to Track You\nThe following data may be used to track you across apps and websites owned by other companies:\n- Usage Data\nData Linked to You\nThe following data may be collected and linked to your identity:\n- Purchases\n- User Content\n- Identifiers\nData Not Linked to You\nThe following data may be collected but it is not linked to your identity:\n- Contact Info\n- Identifiers\n- Usage Data\n- Diagnostics\nPrivacy practices may vary, for example, based on the features you use or your age. Learn More\nInformation\n- Seller\n- Brickit inc\n- Size\n- 510.6 MB\n- Category\n- Entertainment\n- Compatibility\n-\n- iPhone\n- Requires iOS 13.0 or later.\n- iPad\n- Requires iPadOS 13.0 or later.\n- iPod touch\n- Requires iOS 13.0 or later.\n- Mac\n- Requires macOS 11.0 or later and a Mac with Apple M1 chip or later.\n- Languages\n-\nEnglish\n- Age Rating\n- 4+\n- Copyright\n- © 2023 Brickit\n- Price\n- Free\n- In-App Purchases\n-\n- Brickit Pro (1 Year) $39.99\n- Brickit Pro (Trial + 1 Year) $44.99\n- Brickit Pro (1 Year) $64.99\n- Brickit Pro (Trial + 1 Year) $64.99\n- Brickit Pro (1 Month) $6.99\n- Brickit Pro (1 Year) $34.99\n- Brickit Pro (1 Year) $44.99\n- Brickit Pro (1 Year) Discount $44.99\n- Brickit Pro (1 Month) $6.99\n- Brickit Pro (1 Year) $59.00\nSupports\n-\nFamily Sharing\nSome in‑app purchases, including subscriptions, may be shareable with your family group when Family Sharing is enabled."
    },
    {
      "url": "https://www.slashgear.com/1442249/most-valuable-lego-sets/",
      "text": "5 Lego Sets Worth Way More Than You Can Imagine\nIf you're shopping for your kids or are a master builder, you might know just how expensive certain LEGO sets can get. However, if you're looking for sets that are no longer in production or available at toy stores, you could end up paying a lot more. That's because there's a difference between the most expensive LEGO sets — the ones currently available on retail shelves — and the sets with the most value.\nLike other surprisingly valuable toys such as Hot Wheels, the most valuable LEGO sets — the ones worth a lot even if they're not explicitly on sale — can sometimes be found on a secondary market, or they might not be for sale at all. Some owners of these sets may not even be aware they have them in their possession. You could even be lucky enough to find one at a yard sale or flea market worth hundreds — or even thousands — of dollars on sale for a few bucks. Most of these sets are worth so much because of their relative rarity. Many of them were either originally limited edition kits or were never even sold in the first place but rather given out as promotional sets at internal LEGO functions or at Comic-Con (many of the top 20 most valuable LEGO sets are \"Star Wars\" or superhero-related).\nThe secondary market for LEGO is surprisingly vast and complex. The website BrickEconomy has a wealth of information on the history and estimated value of over 18,680 sets in its database. Using in-depth analytics, the website even predicts investment growth for sets based on factors like rarity and previous sales. According to BrickEconomy, these are currently the five most valuable LEGO sets worth way more than you can imagine.\n5. LEGO Jurassic World Fallen Kingdom Exclusive T-Rex\nWhile \"Jurassic Park\" and \"Jurassic World\" LEGO sets are pretty popular, it's a little surprising that the current fifth most valuable LEGO kit is merchandise for the latter, as opposed to bigger properties like \"Star Wars\" or \"Harry Potter.\" However, a few factors make the LEGO Jurassic World Fallen Kingdom\" Exclusive T-Rex set (item #4000031-1) as valuable as it is, which is currently $10,083.33.\nUnlike most other \"Jurassic World\" models, this T-Rex wasn't sold in stores. Instead, it was given away at toy stores and other retailers in 2018 as part of a promotional tie-in to the theatrical release of \"Jurassic World: Fallen Kingdom.\" Only 500 sets were made, and 100 of those were distributed exclusively in Belgium. While you wouldn't want to take it out of the box and depreciate its value, the set does look very cool when assembled. The brown and yellow T-Rex model stands atop a silver-colored pedestal, with the overall kit including 70 pieces in total. You might be tempted to showcase the toy dinosaur in all its glory, though it would cost you over 10 grand to do so.\n4. LEGO Castle\nOf the top five most valuable LEGO sets you can own today, only one was ever on sale in stores (as opposed to a promotional limited edition product): the original LEGO Castle (item #375-2). It first debuted in 1978, and while several LEGO Castle models have been sold since, this particular set was the first of its kind. Also known as the \"Yellow Castle,\" the website BrickEconomy says the model is \"one of the most famous and beloved sets in LEGO history.\"\nFurthermore, it was only sold in Europe, Australia, and Canada — making it even harder to come by and, to an extent, more valuable. The Lego Castle is currently valued at $10,642.75 and is expected to be worth $14,479.68 in another five years. Used versions of the set can sell from $319 to $492, depending on the condition; because the model is over 40 years old, mint condition units are hard to find and drive the overall value of the LEGO Castle. The LEGO Castle contains 767 pieces and 14 minifigs, including various colorful knights.\n3. LEGO Bionicle Tahu Mask (NYCC 2014 VIP Event)\nA LEGO Bionicle Tahu Mask given away at a special VIP event is the third most valuable LEGO set, and has a current worth of $16,393.54. Bionicle is a popular theme of LEGO sets that launched in 2001 and depicts a fictional universe of uniquely designed biomechanical beings. Its complex multimedia storyline about various tribes and powerful creatures has been depicted in comics, video games, movies, and more. Tahu, a mighty elemental warrior, is one of the main characters of the Bionicle universe.\nA LEGO Tahu mask was distributed at New York Comic-Con 2014 and can be worth over $300 today, but it's a special subset of the model that's far more valuable. Only 100 of these very limited edition masks were produced, and they were given away at an invite-only VIP event at the Flatiron District LEGO store celebrating the relaunch of Bionicle. A unique card backing came with this specific Tahu mask, which had a red strip labeled \"2014 NYCC VIP LEGO BIONICLE Event\" and was numbered from one to 100. If you stumble upon a Tahu mask with this label, you could potentially make a lot of money.\n2. Spider-Man (San Diego Comic-Con 2013)\nConsidering Spider-Man's enduring popularity in pop culture, it shouldn't be surprising that Spider-Man LEGO sets can be pretty valuable. However, there's one specific set that's worth more than the others and is, in fact, the second most valuable LEGO set of any kind — a Spider-Man minifig exclusively given away at San Diego Comic-Con in 2013. Its worth is currently $16,853.65, with an average yearly gain of about 20 percent.\nOnly 350 LEGO Marvel Super Heroes promotional sets were given away at SDCC 2013 as part of a raffle. However, it's not just the relatively small number of units that makes this particular Spider-Man so valuable. The design of Spidey's suit is inspired by the one Andrew Garfield wore in the 2012 film, \"The Amazing Spider-Man.\" Because LEGO did not have the rights to that franchise, no official LEGO models of this iteration of Peter Parker were ever sold, making the SDCC 2013 Spider-Man a rarity. Attendees of that year's Comic-Con could have potentially made a lot of money if they collected the right promotional swag — a Spider-Woman minifig from that same event is currently valued at $9,264.68.\n1. LEGO Operations Mexico 2011 Molding\nYou might be surprised to learn that the most valuable LEGO set by a longshot is an unassuming gray building — the LEGO Operations Mexico (LOM) 2011 Molding (item #4000002-1). It's currently valued at an astounding $39,490.90 per set, which is well over twice the worth of the second most valuable LEGO kit. The main reason a model of a relatively plain-looking gray warehouse can be worth so much is because of how rare it is. It was never sold in stores; instead, it was given as a gift to the employees of the building, which was the second LEGO molding factory ever built in Mexico. The LEGO employees received the gift set in 2011, and it was the first LEGO set of its kind to be given to factory workers, though other LEGO kits of company factories have been made since, which can go for hundreds of dollars each.\nThe LOM 2011 Moulding set contains 174 pieces and depicts the factory mostly with gray bricks, with its main entrance in the center. Its value has increased dramatically since its 2011 debut and is expected to be worth over $61,000 in five years — making it a great investment. However, this only applies to sets that have never been opened and are still in mint condition. The average price of a used set in good condition is merely $97, so opening the box immediately reduces its value by 99.75 percent."
    },
    {
      "url": "https://play.google.com/store/apps/details?id=com.brickit.brickit&hl=en_US",
      "text": "Brickit helps you build new things with your old bricks.\n1. Spread out your bricks and take a photo of them. The app will scan the photo, identifying and counting the details.\n2. Decide what to build. Brickit suggests building ideas depending on what bricks you have. Choose from robots, kangaroos, airplane, and more!\n3. Build your creations using our step-by-step instructions. The instructions are useful, but you don’t have to stick to them exclusively. We give you ideas, and you decide what to make of them.\n4. Find any brick you want easily. Just choose a detail in our catalog, and the app will highlight it in your pile. The bricks you need in the instructions are highlighted in the steps where you need them.\nScanner Pro Subscription:\n— Auto-renewing Brickit Pro subscriptions can be managed in your Google Play account settings.\n— Payment is charged to your Google Play account at confirmation of purchase.\n— Auto-renewal can be turned off in Google Play account settings, at least 24 hours before the end of the current period.\n— Account charged for renewal within 24 hours prior to the end of the current period.\n— Subscriptions may be managed by the user; auto-renewal may be turned off in the user's account settings after purchase.\n— Any unused portion of a free trial period, if offered, is forfeited upon purchase of a subscription.\n— License agreement: https://brickit.app/eula/\n— Privacy policy: https://brickit.app/privacy-policy/\nBrickit is independently developed by enthusiasts, and is not endorsed by or affiliated with any specific brick brand."
    },
    {
      "url": "https://www.slashgear.com/1937173/lego-most-expensive-sets-ranked-by-price/",
      "text": "5 Of The Most Expensive LEGO Sets Ever Sold, Ranked By Price\nLEGO sets are expensive. Way more expensive than they used to be. Thanks to pricey ultra-precision molds and hefty licensing deals, production costs have increased. That and the fact that LEGO deliberately (or cleverly) positions itself as a premium brand means its products are no longer simple toys. In fact, with numerous complex and display-focused kits, the company has a long-running strategy that targets adult collectors, rather than children.\nSome savvy buyers even treat LEGO as an investment, and with an average 11% growth, it outperforms traditional assets like stocks and gold. Many models can be worth way more than you can imagine, with retired or hard-to-find editions gaining a lot of value over time. But let's focus on the most expensive sets that LEGO has sold directly without delving too much into their aftermarket gains.\nThe most epic LEGO sets you can buy are often part of specific lines such as the Ultimate Collectors Series (UCS) or LEGO Icons. They can be recreations of real-world or fictional objects and are usually incredibly detailed. Our go-to for discovering the most expensive LEGO kits ever sold is BrickEconomy, which \"provides insights into LEGO economics and market values.\" And, with that, here are five of the most expensive LEGO sets ever sold, ranked by price.\nLEGO Titanic (10294) - $679.99\nThe fifth most expensive set ever sold by LEGO is the massive 9,090-piece Titanic that was launched in 2021. In fact, when it was released, it was the second-largest ever LEGO set by piece count and stretched to almost 4.5 feet long when built. The model pulls apart into three sections, and the interior is packed with surprising details. The grand staircase, cabins, dining rooms, lounges, and even a swimming pool are all inside.\nBut this set is very much a serious project for serious LEGO builders. There are no minifigures, not even Jack or Rose, and no gimmicky movie references. There's no iceberg, and there's certainly no gaping hole in the hull. This model is all about the glory of the RMS Titanic before it met its demise, and it leans hard into a realistic design. It's part of LEGO's Icons series and sits alongside other grown-up sets like the Eiffel Tower and the Colosseum as a serious set.\nIt was originally priced at an eye-watering $629.99. While it is still available through official channels, secondary market prices have already crept past $750. BrickEconomy predicts that when it's retired, which will likely be late 2025, it will receive an immediate bump in value with a further 5% annual growth, giving an estimated resale value approaching $1,000 within 5 years. And if that's not enough to make you consider cashing in, then you may well be in possession of a Titanic that's going to outlast the wreck itself.\nLiebherr Crawler Crane LR 13000 (42146) - $699.99\nAt $699.99, the 2,883-piece Liebherr Crawler Crane LR 13000 set ranks as the fourth most expensive ever sold by LEGO. But this licensed crawler crane isn't just big in price — it towers over most other models, too. When fully assembled, it stands at just over 3 feet, making it one of the tallest LEGO sets to date. And it's no wonder LEGO went all out on scale; With a 3,000-ton lifting capacity, the real-world Liebherr LR13000 is the most powerful crawler crane ever made.\nThe brick-built version mirrors that industrial scale with functional details, including a rotating turntable, luffing jib, working winch, and tank steering. Weighing it down (literally) are 24 weight elements that provide more than 2 pounds of counterbalance. And, best of all, it's powered by six motors and two Smart Hubs, which connect to LEGO's Control+ app so you can operate the crane from your smartphone.\nThe set launched in August 2023 but has dipped slightly in resale value since, with sealed copies selling for as low as $550 on platforms like eBay. However, the Liebherr Crawler Crane is projected to join the Titanic in retirement by the end of 2025, which should immediately add a bit of value to the set.\nImperial Star Destroyer (75252) - $699.99\nAlthough this Imperial Star Destroyer was sold for the exact same price as the Liebherr Crawler Crane at $699.99, due to its retirement and strong aftermarket performance, we've decided to rank it third. Released in October 2019 and retired in December '22, this 4,784-piece set is part of LEGO's Ultimate Collector Series (UCS), a Star Wars subtheme of detailed kits aimed more toward the serious builder. It has appreciated considerably since its retirement, with some sealed sets reportedly going for more than $1,400, which is already within BrickEconomy's 5-year projection range.\nThe build of the destroyer itself is rather imposing. It's almost impossible not to start humming Darth Vader's Theme when you see it. It measures over 3 feet long and is supported by a stand to handle the bulk. So, while you might want to pilot it yourself, it's clearly a display-first set and not designed for swooshing around a living room. This model has the scale and detail that should be expected of a UCS release. Signature surface detailing, rotating turbolasers, a tilting radar dish, and a detailed engine section give this set the details needed to justify the price.\nIt also comes with a scaled-down Rebel Blockade Runner, which was Princess Leia's escape vessel from the opening scene of \"A New Hope,\" and two exclusive minifigures — an Imperial Officer and an Imperial Crewmember. However, if you're left disappointed by those character choices, bear in mind that even these two little guys have a combined value of around $100.\nThe Millennium Falcon (75192) - $849.99\nWhen LEGO launched the UCS Millennium Falcon back in 2017, it set a new benchmark for price and size. With 7,541 pieces, it was the Danish company's largest ever set at the time, and the retail price of $799.99 was the most expensive. The Falcon's MSRP was increased to $849.99 in August 2022, making it one of the most expensive LEGO sets ever sold. However, LEGO has yet to retire this 'piece of junk,' and it sells for an average of $782 on secondary markets, which is why we've decided to rank the Falcon in second place. That said, it is the most-owned LEGO set in the entire UCS collection, and upon retirement, its value is expected to rise to between $1,129 and $1,249 within 5 years.\nWhen built, the model measures 2.75 feet long and includes detailed interiors, quad laser cannons, a boarding ramp, landing legs, and interchangeable sensor dishes so you can choose the Falcon version you want to display. The eight minifigures also cover both classic and modern trilogies, including both a young and an old Han Solo. Chewbacca is also there, as are Leia and Threepio, and BB-8, Finn, and Rey make up the sequel-era crew, while two Porgs and a Mynock make up the numbers.\nAT-AT (75313) - $849.99\nLEGO product 75313 is another Star Wars UCS set, and this time it is the legendary AT-AT from \"The Empire Strikes Back.\" It ties with the Millennium Falcon as the most expensive set ever sold by LEGO, with an MSRP of $849.99. However, we've decided to rank it first since it currently sells on secondary markets for an average of $1,099, with some eBay listings even reaching as high as $2,099. LEGO retired the set in 2024, which went a long way to increasing its worth, while its 5-year projected value sits between $1,550 and $1,950.\nThe UCS AT-AT is a hefty set of 6,785 pieces and comes with nine minifigures, including a Luke Skywalker kitted out in his orange and white flight suit, ready to take down this menacing behemoth. However, the interior can fit at least 40 minifigures as well as four speeder bikes for the snowtroopers, two of which are included in the set. A detailed E-web blaster is also part of the package and can be used in conjunction with the rotating cannons to take down that rebel scum. However, the Luke minifigure has his own attaching cable, and the bomb-drop hatch ensures victory for the Rebel Alliance on Hoth, unless you feel like changing the story."
    }
  ],
  "argos_summary": "The article explains how the Brickit app lets LEGO fans scan their spare bricks to generate build ideas and catalog pieces, noting its usefulness and some user‑reported issues. It then details the most valuable and most expensive LEGO sets, highlighting rare promotional items and large collector releases that have appreciated in value. Overall, it shows how LEGO’s strategy targets adult collectors and how certain limited editions can become significant investments.",
  "argos_id": "X9V0QP8WK"
}