{
  "url": "https://www.newsweek.com/trump-chicago-national-guard-reaction-2118188",
  "authorsByline": "Martha McHardy",
  "articleId": "7397dbf03cb048eda78dc374b14eea8a",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2708465/trump.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T08:55:48-04:00",
  "addDate": "2025-08-23T12:59:51.274387+00:00",
  "refreshDate": "2025-08-23T12:59:51.274390+00:00",
  "score": 1.0,
  "title": "Chicago officials react to Trump National Guard threat—'Trying to distract'",
  "description": "Trump said on Friday that Chicago will \"probably\" be the next city to which the administration will deploy federal troops, officers and agents.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nChicago officials are pushing back against President Donald Trump's threat to deploy the National Guard to the city, dismissing the move as a political ploy.\n\nTrump said on Friday that Chicago will \"probably\" be the next city to which the administration will deploy federal troops, officers and agents.\n\n\"Chicago's a mess, you have an incompetent mayor, grossly incompetent,\" Trump said from the Oval Office.\n\n\"We'll straighten that one out, probably next, that will be our next one after this. I think Chicago will be our next and then we'll help with New York.\"\n\nIt comes after Trump said he would do the same in Washington, D.C. Trump has repeatedly described some of the nation's largest cities, run by Democrats, with Black mayors and majority-minority populations, as dangerous and filthy.\n\nTrump announced earlier this month that he was sending federal troops to Washington, D.C, after alleging that the nation's capital was \"overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people.\"\n\nTrump's intervention marked an unprecedented federal crackdown in the local governance of the District of Columbia. The deployment of federal troops sparked widespread backlash over constitutional limits and home rule rights. Critics argue that it breaches democratic principles and could set a dangerous precedent, while supporters frame it as a necessary measure for public order.\n\nWhat To Know\n\nFollowing Trump's remarks, Chicago officials strongly condemned Trump's threat to send the National Guard to the city.\n\nIn a statement on X, Illinois Governor JB Pritzker said Trump is \"attempting to create chaos that distracts from his problems,\" accusing him of trying to \"incite fear in our communities and destabilize existing public safety efforts.\"\n\nPritzker argued that \"Trump and Republicans are trying to distract from the pain they're causing—from tariffs raising the prices of goods to stripping away health care and food from millions.\" He added that \"crime rates are improving. Homicides are down by more than 30 percent in Chicago in the last year alone,\" crediting local partnerships and community programs that \"they're defunding.\"\n\nChicago Mayor Brandon Johnson said the city has \"not received any formal communication from the Trump administration regarding additional federal law enforcement or military deployments,\" but warned that \"unlawfully deploying the National Guard to Chicago has the potential to inflame tensions between residents and law enforcement.\"\n\nJohnson argued that \"the problem with the President's approach is that it is uncoordinated, uncalled-for, and unsound,\" noting Chicago has already \"reduced homicides by more than 30 percent, robberies by 35 percent, and shootings by almost 40 percent.\" He added: \"The National Guard will not alleviate the housing crisis … will not put food in the stomachs of the 1 in 4 children that go to bed hungry … [and] is no substitute for dedicated local law enforcement and community violence interrupters.\"\n\nIt comes after Trump declared a \"crime emergency\" in Washington, D.C. in early August, and invoked Section 740 of the District of Columbia Home Rule Act to seize control of the city's police force, placing the Police Department under federal authority for the first time in history.\n\nAlongside that move, Trump ordered the deployment of roughly 800 D.C. National Guard troops, bolstered by reinforcements from six Republican-led states and hundreds of federal agents from the FBI, Drug Enforcement Agency (DEA), and Immigration and Customs Enforcement (ICE). In total, more than 2,000 federal and state forces are now on the ground in the nation's capital.\n\nTrump justified the takeover by citing rampant crime in the city, but official data contradicts the claim. Washington, D.C. has recorded a 26 percent drop in violent crime compared to last year, reaching a 30-year low. That has fueled criticism that the move was less about public safety and more about political power.\n\nIn Chicago, figures in the Chicago Police Department's July 2025 report quoted by Johnson above, shows homicides reached the lowest level since 2014, with 44 reported murders last month.\n\nOverall, Part I crimes—including violent and property offenses—dropped 14 percent year-to-date and 18 percent month-to-month. Robberies fell 36 percent in July and 34 percent year-to-date, with firearm-related robberies down 46 percent compared to July 2024. Motor vehicle thefts declined 21 percent this month and 27 percent year-to-date, while burglaries decreased 28 percent from July 2024. Vehicular hijackings dropped 49 percent year-to-date, with 293 incidents reported. Additionally, officers recovered 1,190 firearms in July, averaging 38 per day, bringing the year-to-date total to 6,704 firearms recovered.\n\nMayor Johnson attributes these positive trends to comprehensive community investment strategies, including youth employment programs, expanded access to mental health care, and housing initiatives.\n\nTrump has taken aim at Chicago for over a decade, including on the 2024 and 2016 presidential campaign trails. He has repeatedly compared the city to Afghanistan and, in 2017, threatened to send in federal officers due to gun violence in the city, despite historic declines in violent crime in recent years.\n\nIn July, the Trump administration cut more than half federal funding for gun violence prevention programs, totaling $158 million in grants, which affected cities like Chicago. The Justice Department also terminated 69 community violence intervention grants in April, part of a broader halt of 365 grants worth $811 million.\n\nThe Department of Justice official told Reuters that the agency canceled the grants because they \"no longer effectuate the program's goals or agency's priorities.\"\n\nMayor Johnson said that if Trump wants to make Chicago safer, he should restore $158 million he cut in violence-prevention programs for cities such as Chicago.\n\n\"There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them,\" he said.\n\nWhat People Are Saying\n\nTrump's eldest son, Donald Trump Jr, said in a Newsmax interview: \"Maybe we should roll out the tour to Portland, Seattle, the other craphole cities of the country.\"\n\nU.S. Senator Dick Durbin of Illinois, said in part: Chicago is \"a beautiful, vibrant city with people from all walks of life … These unprecedented threats from President Trump are nothing more than a power grab to distract from his disastrous policies.\"\n\nWhat Happens Next\n\nTrump has not indicated for certain if or when he will send federal troops into other cities.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/topic/department-justice",
    "https://www.chicagopolice.org/wp-content/uploads/July-2025-in-Review.pdf",
    "https://www.newsweek.com/topic/ice",
    "https://www.newsweek.com/topic/donald-trump",
    "https://www.youtube.com/watch?v=PQ3EycVrPr8",
    "https://www.newsweek.com/topic/democrats",
    "https://www.newsweek.com/topic/republicans",
    "https://www.newsweek.com/topic/fbi",
    "https://www.newsweek.com/national-guard-dc-carrying-weapons-report-2114531"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump National Guard",
      "weight": 0.0884197
    },
    {
      "name": "President Trump",
      "weight": 0.08121295
    },
    {
      "name": "Trump",
      "weight": 0.07951502
    },
    {
      "name": "Donald Trump",
      "weight": 0.07915444
    },
    {
      "name": "Donald Trump Jr",
      "weight": 0.075250745
    },
    {
      "name": "federal troops",
      "weight": 0.074001916
    },
    {
      "name": "Chicago officials",
      "weight": 0.07376008
    },
    {
      "name": "Chicago Mayor Brandon Johnson",
      "weight": 0.07216227
    },
    {
      "name": "Chicago",
      "weight": 0.0704739
    },
    {
      "name": "other cities",
      "weight": 0.06964031
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.990234375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.93115234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.68359375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.52978515625
    }
  ],
  "sentiment": {
    "positive": 0.037548274,
    "negative": 0.8562656,
    "neutral": 0.10618612
  },
  "summary": "Chicago officials have criticized President Donald Trump's threat to deploy the National Guard to the city, calling it a political ploy. The move comes after Trump announced that he would also deploy federal troops to Washington, D.C. This move has been met with criticism, with some arguing it could set a dangerous precedent. Chicago Governor JB Pritzker accused Trump of attempting to create chaos and destabilize public safety efforts, while Chicago Mayor Brandon Johnson warned that the move could potentially inflame tensions between residents and law enforcement. This follows an unprecedented federal crackdown in the local governance of the District of Columbia, which has resulted in widespread backlash over constitutional limits and home rule rights.",
  "shortSummary": "Chicago officials reject President Donald Trump's threat to deploy the National Guard, dismissing it as a political distraction, while Washington D.C faces similar concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "91384d193d734fdab719967c8b5ac742",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/topic/department-justice",
      "text": "Ghislaine Maxwell says Epstein may have been set up with Princess Diana\nThe Department of Justice released transcripts and audio recordings of interviews with Maxwell, Jeffrey Epstein's imprisoned former girlfriend.\nMAGA reacts to Ghislaine Maxwell's Trump comments\nThe Trump administrations released transcripts of interviews with Jeffrey Epstein's imprisoned former girlfriend, by Deputy Attorney General Todd Blanche.\nJeffrey Epstein update: Ghislaine Maxwell says \"there is no list\"\nConvicted sex trafficker Ghislaine Maxwell was quizzed about her Jeffrey Epstein ties during a two-day interview with Todd Blanche.\nFired MAGA official lifts the lid on DOJ under Pam Bondi\nRoger Alford, fired in July, says Bondi's appointees settled a major tech merger in a way that undermined the rule of law.\nGhislaine Maxwell interview: What Epstein's ex-girlfriend said about Trump\nThe transcripts cover two days of questioning last month by Deputy Attorney General Todd Blanche at a Florida courthouse.\nDonald Trump said he told Pam Bondi \"give them everything\" on Epstein files\nPresident Donald Trump has fiercely resisted calls to release the files over the summer, at times calling the issue a \"hoax.\"\nFBI speaks out about John Bolton's home being raided\n\"NO ONE is above the law,\" FBI Director Kash Patel posted to X after news broke that feds had raided the home of the former Trump official.\nVoters sue Elon Musk, say they were defrauded by $1M petition giveaway\nElon Musk faces a lawsuit over a $1 million petition giveaway that accuses him of misleading voters in battleground states.\nDonald Trump suffers major immigration legal blow\nJudge rejects Trump's lawsuit, ruling Illinois' workplace privacy law doesn't clash with federal immigration power.\nEpstein files update: Judge denies Trump's DOJ request\nU.S. District Judge Richard Berman issued the ruling on Wednesday in Manhattan.\nPark ranger fired after hanging transgender flag from Yosemite's El Capitan\nThe National Park Service confirmed Tuesday it is working with the Justice Department to pursue disciplinary action.\nTrump admin grapples with birthright citizenship dilemma\nThe Trump administration is seeking a 30-day delay as the DOJ maps the Supreme Court's path to test birthright citizenship.\nTrump administration probes DC police over alleged crime data manipulation\nThe Department of Justice is investigating whether police in Washington, D.C., manipulated crime data and statistics.\nWhen will Epstein records be sent to House? Trump DOJ provides an update\nHouse Oversight is also demanding interviews under oath from former AGs spanning the last four presidential administrations.\nFull list of states suing Trump administration for immigration\nSeveral attorneys general said the VOCA conditions appear to be another way the administration is targeting sanctuary jurisdictions.\nTrump admin makes concession after lawsuit filed in Washington, D.C.\nEarlier Friday, the nation's capital filed a lawsuit to block Republican President Donald Trump's takeover of its police department.\nDonald Trump's move to seize DC Metro Police control triggers lawsuit\nThe move followed Attorney General Pam Bondi's announcement that DEA chief Terry Cole would assume the duties of police chief.\nBondi IDs man who threw sandwich at officers as DOJ employee: \"Deep state\"\nJeanine Pirro, U.S. attorney for the District of Columbia, announced Wednesday that Sean Charles Dunn would be charged with a felony.\nDOJ reacts after major legal blow by Trump-appointed judge\nJudge Friedrich granted a preliminary injunction ordering the government to stop withholding funds to the National Endowment for Democracy.\nDOJ charges man with cyberstalking slain UnitedHealthcare CEO's family\nProsecutors say Shane Daley, 40, left multiple voicemails, beginning just hours after Thompson was shot in midtown Manhattan.\nDonald Trump Scores Migration Legal Win From Obama and Biden Judges\nA federal appeals court lets Trump's noncitizen registry roll on, in a setback for immigrant rights groups.\nJudges rip Trump admin's deportation lawsuit—\"Uniquely disruptive\"\nMaryland judges have criticized President Donald Trump's challenge to a deportation pause as an unprecedented power grab.\nDOJ bid to unseal Ghislaine Maxwell grand jury transcripts suffers blow\nThe Trump administration is pushing for the release of more files related to the Jeffrey Epstein case.\nDonald Trump's bid to make key data secret hit by major legal blow\nA court said only Congress could limit public spending disclosures, giving the administration until August 15 to restore a database.\nGreen-card applicants face major change after court ruling\nCourt sides with immigrant investors, reshaping EB-5 timeline and easing green-card hurdles.\nNY AG Letitia James subpoenaed by DOJ in Trump civil rights violation probe\nLetitia James has been subpoenaed as part of an investigation into whether she violated President Donald Trump's civil rights.\nPam Bondi doubles bounty on Venezuela's Nicolás Maduro\nIn a video posted on X, Bondi accused Maduro of working with criminal organizations such as Tren de Aragua and the Sinaloa Cartel.\nSupreme Court receives new request from Donald Trump\nThe Trump administration argued that a lower court ruling poses a significant barrier to enforcing federal immigration laws.\nWho is Brian Driscoll? Former FBI acting director forced out\nIn January, Driscoll was appointed acting director while Kash Patel's nomination was pending after the departure of Christopher Wray.\nJustice Department Issues Birthright Citizenship Update\nFight over Trump's order to deny birthright citizenship heads toward Supreme Court, with 14th Amendment protections at stake"
    },
    {
      "url": "https://www.newsweek.com/topic/democrats",
      "text": "Texas redistricting moves closer as millions pour into California fight\nThe Texas Senate has approved a Trump backed redistricting bill that could gain the GOP five House seats in 2026.\nGavin Newsom's 2028 chances jump after trolling offensive against Trump\nGavin Newsom's press office has been mocking President Trump with tweets in his style over the past few weeks.\nColin Allred edges out leading Republican in Texas race—internal poll\nAllred held a lead over Attorney General Ken Paxton in an internal poll released Friday in Texas' U.S. Senate race.\nDemocrats' chances of beating GOP's Vivek Ramaswamy and flipping Ohio—Polls\nA new poll showed Ramaswamy leading two Democrats in the gubernatorial race.\nRepublicans are losing Latino voters. Democrats aren't winning them either\nA demographic that shifted toward Trump in 2024 now appears up for grabs heading into the midterms.\nFBI speaks out about John Bolton's home being raided\n\"NO ONE is above the law,\" FBI Director Kash Patel posted to X after news broke that feds had raided the home of the former Trump official.\nGen Z Democrats warn DNC: Shift to grassroots or lose more young voters\nAs Republicans make Gen Z gains, young Democrats call for the party to reassess its strategy and messaging ahead of future elections.\nThe House Is on Fire and Democrats Are Debating Paint Colors | Opinion\nThe house is on fire, and Democratic leadership is debating what color to paint the kitchen. Either grab a hose or get out of the way because if we lose this fight, there won't be a democracy left to save.\nDemocrat switches party to Republican to run against Wes Moore\nMaryland gubernatorial candidate Ed Hale said he's changing parties because he doesn't believe he could defeat Moore in the primary.\nThe 1600: Dems want a fighter. Is Newsom it?\nEditor's note: This is a preview of The 1600, Newsweek's daily newsletter by politics and culture director Carlo Versano.\nHow education and gender are fueling Gen Z's political divide\nWith the cost of college rising and the appeal of being one's own boss ever-present, young voters' political leanings are shifting.\nJD Vance reacts to Gavin Newsom's new nickname for him\nVance offered his advice to the California governor, who has been mimicking President Donald Trump's social media style.\nGavin Newsom, Kathy Hochul issue warnings after Texas redistricting vote\nThe vote targets congressional lines ahead of the 2026 midterms in a state where shifts could change control of the House of Representatives.\nBarack Obama reacts to Gavin Newsom's California redistricting play\nObama's comments came as efforts in Texas, encouraged by President Trump, aim to strengthen GOP control ahead of next year's elections.\nGavin Newsom's redistricting ballot measure chances of passing—New poll\nThe California ballot measure could have key implications for the 2026 midterms.\nHow the right is winning over Gen Z\nYoung Americans traditionally start adulthood by voting for the left, but Republicans are capitalizing on their loss of trust in institutions\nGavin Newsom and Pete Buttigieg's chances of beating JD Vance in 2028: Poll\nEven with the election still a few years away, polling could offer insight into potential candidate viability.\nJames Talarico's chances of beating Colin Allred in Texas primary—Poll\nA new poll showed that Allred could face a competitive primary if other Democrats jump into the Senate race.\nElise Stefanik drowned out by relentless boos at memorial event\nThe New York Republican was booed while speaking at an event in honor of John Zurlo, a Clinton County clerk who died in December.\nTexas Democrat refuses to leave Capitol overnight in redistricting standoff\nState Representative Nicole Collier plans to stay in the Texas Capitol until Wednesday in protest against a police escort policy.\nGavin Newsom surges in 2028 presidential primary poll\nThe poll comes as Newsom has taken a more aggressive position in standing up to President Donald Trump.\nIowa Democrat drops out of Senate race, endorses rival\nJ.D. Scholten dropped out of the 2026 Senate race and endorsed a fellow legislator to potentially challenge Republican Joni Ernst.\nSherrod Brown's chances of flipping GOP seat in Ohio as he enters race\nSherrod Brown made official his comeback campaign for U.S. Senate on Monday.\nGavin Newsom's odds of beating AOC for 2028 nomination widen\nNew betting odds show the California governor's chances of beating the New York representative are increasing.\nDonald Trump's new census could be bad news for Texas\nPresident Donald Trump has requested a new national census excluding illegal migrants, but it is likely to face legal challenges.\nNewsom files request for info on Trump admin use of military\nThe California governor has again questioned the tactics of President Trump's administration.\nGavin Newsom's team unveils new nickname for JD Vance\n\"NOT EVEN JD 'JUST DANCE' VANCE CAN SAVE TRUMP FROM THE DISASTROUS MAPS 'WAR' HE HAS STARTED,\" Newsom's office wrote on social media.\nPhotos, videos show 'Fight the Trump Takeover' protests across the country\nThousands in cities including Washington and Austin joined protests against President Donald Trump's \"takeover\" on Saturday.\nMap shows Democratic plan for new California districts\nCalifornia is considering mid-cycle redistricting after the president's call for Texas to send \"five more Republicans\" to Congress.\nGavin Newsom breaks through by trolling Trump at his own meme game\nCalifornia Governor Gavin Newsom is punching back at Donald Trump — in memes and capital letters."
    },
    {
      "url": "https://www.newsweek.com/topic/donald-trump",
      "text": "Ghislaine Maxwell contradicts Trump claim about Bill Clinton\nMaxwell said in interviews with Deputy Attorney General Todd Blanche that she is sure Clinton never visited Epstein's private island.\nChicago officials react to Trump National Guard threat—'Trying to distract'\nTrump said on Friday that Chicago will \"probably\" be the next city to which the administration will deploy federal troops, officers and agents.\nJohn Bolton was asked if he was worried about Trump 12 days before FBI raid\nThe raid on Bolton's home was part of an investigation into the handling of classified documents according to The Associated Press.\nGhislaine Maxwell says Epstein may have been set up with Princess Diana\nThe Department of Justice released transcripts and audio recordings of interviews with Maxwell, Jeffrey Epstein's imprisoned former girlfriend.\nMAGA reacts to Ghislaine Maxwell's Trump comments\nThe Trump administrations released transcripts of interviews with Jeffrey Epstein's imprisoned former girlfriend, by Deputy Attorney General Todd Blanche.\nGen Z is falling in love with George Bush\nAs #BushTok sweeps the Internet, Newsweek spoke to experts about what America's youngest adult generation's fondness for the president means for politics today.\nDonald Trump's approval rating reverses course with baby boomers\nBaby boomers view Trump's overall effectiveness in negotiating with foreign leaders more favorably than the general electorate.\nLaura Loomer's influence is growing\nThe right-wing activist has been linked to a number of decisions by the Trump administation.\nTexas redistricting moves closer as millions pour into California fight\nThe Texas Senate has approved a Trump backed redistricting bill that could gain the GOP five House seats in 2026.\nDHS responds to backlash over ICE facilities at internment camp site\nFort Bliss in Texas served as an internment facility during World War II, holding Japanese, German and Italian civilians.\nIntel responds after Donald Trump says US is getting a 10 percent stake\nIntel's statement followed remarks from Trump that Washington would gain a direct stake in the chipmaker under a new agreement.\nDenim, dating and conservatism: Inside a \"Make America Hot Again\" party\nDozens of New York City conservatives gathered for a \"Good Genes\" party, nodding to Sydney Sweeney's controversial American Eagle campaign.\nGavin Newsom's 2028 chances jump after trolling offensive against Trump\nGavin Newsom's press office has been mocking President Trump with tweets in his style over the past few weeks.\nGhislaine Maxwell interview: What Epstein's ex-girlfriend said about Trump\nThe transcripts cover two days of questioning last month by Deputy Attorney General Todd Blanche at a Florida courthouse.\nDonald Trump said he told Pam Bondi \"give them everything\" on Epstein files\nPresident Donald Trump has fiercely resisted calls to release the files over the summer, at times calling the issue a \"hoax.\"\nDonald Trump says Chicago is \"probably next\" after Washington, DC crackdown\nPresident Donald Trump told reporters on Friday that the federal government will \"straighten\" Chicago out after Washington, D.C.\nTrump makes major announcement on location of 2026 World Cup draw\nPresident Donald Trump announced that the World Cup 2026 draw will be held at the Kennedy Center in Washington, D.C.\nMark Carney gives major tariff update after Trump call\nCarney spoke with Trump Thursday in what the Canadian PM's office described as \"a productive and wide-ranging conversation.\"\nFBI raids John Bolton's home over 2020 memoir: what he wrote about Trump\nAt the time of its release, The Room Where It Happened was one of the most high-profile and damaging insider accounts of the Trump presidency.\nRussia launches India charm offensive as US relations sour\nIt comes as U.S. President Donald Trump imposed an additional 25 percent tariff on India for buying Russian oil.\nRepublicans are losing Latino voters. Democrats aren't winning them either\nA demographic that shifted toward Trump in 2024 now appears up for grabs heading into the midterms.\nDonald Trump reacts to John Bolton's FBI home raid\nFBI agents entered Bolton's Bethesda, Maryland, home at 7 a.m. on Friday as part of a classified records probe.\nPete Hegseth authorizes National Guard to carry weapons in DC\nWith several states deploying some troops to Washington, D.C., the nation's capital has around 2,000 National Guard troops deployed.\nFed's Powell issues new Trump tariffs warning\nThe Federal Reserve chair delivered his annual Jackson Hole speech.\nWhite House cancels school field trip visits indefinitely, page disappears\nAll public tours, including those for student groups, are on hold as construction begins on a planned $200 million ballroom.\nAre there 55 million visa holders in the US? What to know\nAnti-immigration campaigners suggested 55 million people could be deported from the U.S. after \"continuous vetting\" as announced for visa holders.\nWhite House releases list of Smithsonian exhibits it objects to\nThe White House has ordered a wide-ranging review of the Smithsonian's museums and exhibitions.\nDonald Trump to make televised announcement from Oval Office: What to know\nPresident Trump will deliver a televised public address from the White House at noon ET.\nMAGA celebrates John Bolton's home being raided: 'How does it feel?'\nFormer White House national security advisor John Bolton's home was raided on Friday morning.\nFBI speaks out about John Bolton's home being raided\n\"NO ONE is above the law,\" FBI Director Kash Patel posted to X after news broke that feds had raided the home of the former Trump official."
    },
    {
      "url": "https://www.newsweek.com/national-guard-dc-carrying-weapons-report-2114531",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nNational Guard troops in Washington, D.C., have been told they should prepare to carry weapons in the nation's capital despite previous assurances from officials that the troops would not be armed, according to a Saturday report by The Wall Street Journal.\nWhen reached for comment, the D.C. Army National Guard told Newsweek that \"Guard members may be armed consistent with their mission and training.\"\nThe Pentagon directed Newsweek to speak with the Washington Guard when reached by email for comment. Meanwhile, D.C. Mayor Muriel Bowser's office told Newsweek it had no comment at this time.\nWhy It Matters\nPresident Donald Trump ordered 800 National Guard troops to deploy to Washington, with the troops arriving on Tuesday. The deployment aims to combat crime in the city, even as crime rates have reached a 30-year low, marking one of the most aggressive federal interventions in local law enforcement in recent history.\nThe deployment has prompted strong backlash due to the fact the administration bypassed the city's elected leaders, who have variously described Trump's directive as \"unsettling,\" \"unprecedented\" and \"dangerous.\"\nWashington officials sued the administration to block the federal takeover of the Metropolitan Police Department (MPD), which prompted U.S. Attorney General Pam Bondi to issue a memo that leaves the current police chief in charge of the department but also directs the police to cooperate with federal immigration enforcement, the Associated Press reported.\nWhat To Know\nAdministration officials had previously said the National Guard would not carry weapons, and troops who have already made the rounds on patrol around the city have done so without carrying them.\nThe Journal, citing people familiar with the plan, reported on Saturday that those troops were told on Friday evening they should expect an order to carry weapons. As of Saturday afternoon, no formal order had been issued.\nA White House official told the Journal that additional troops may be called to D.C., and they may be armed, but they would not be making any arrests.\nThe Army had stressed the lack of weapons in a press release issued Thursday, writing that the troops were deployed to \"provide a visible presence in key public areas, serving as a visible crime deterrent.\"\n\"They will not arrest, search, or direct law enforcement,\" the Army wrote. \"While they will not conduct arrests, they have the authority to temporarily detain individuals to prevent imminent harm, ensuring that custody is promptly transferred to law enforcement authorities.\"\nMost notably, the Army wrote that the troops would be equipped with personal protective equipment (PPE), including body armor, and that \"weapons are available if needed but will remain in the armory,\" while noting that \"future requirements will be assessed and determined based on the evolving needs of the supported law enforcement agencies.\"\nThe shifting framework highlights the tension in the capital and the unease between the administration and local officials.\nBondi in her Friday notice wrote of the responses from Washington officials, saying that \"unfortunately, the D.C. Attorney General continues to oppose our efforts to improve public safety in Washington, D.C.,\" in contrast to Washington, D.C., Mayor Muriel Bowser, \"who is dedicated to ensuring the safety of residents, workers, and visitors in Washington, D.C.\"\nWhat People Are Saying\nA White House official told Newsweek: \"The National Guard is not making arrests at this time – they may be armed, consistent with their mission and training, to protect federal assets, provide a safe environment for law enforcement officers to make arrests, and deter violent crime with a visible law enforcement presence.\nCaptain Tinashe T. Machona, a spokesperson for the D.C. Army National Guard, told Newsweek in an email statement: \"Guard members may be armed consistent with their mission and training. Their presence is focused on supporting civil authorities and ensuring the safety of the community they serve. The DC National Guard remains committed to assisting the District of Columbia and serving its residents and visitors whenever called upon.\"\nU.S. Attorney General Pamela Bondi on Friday wrote on X: \"I have just issued a new directive to Mayor Bowser requiring MPD to provide the services found necessary by my designee, DEA Administrator Terry Cole, to comply fully and completely with federal immigration law and authorities, regardless of any policies MPD might otherwise have.\"\n\"Unfortunately, the D.C. Attorney General continues to oppose our efforts to improve public safety in Washington, DC. It is important to note that this same D.C. Attorney General is responsible for failing to enforce consequences for dangerous juvenile offenders,\" Bondi wrote. \"We remain committed to working closely with Mayor Bowser, who is dedicated to ensuring the safety of residents, workers, and visitors in Washington, D.C.\"\nD.C. Mayor Muriel Bowser in an open letter to city residents this week, in part: \"...Over the course of a week, the surge in federal law enforcement across D.C. has created waves of anxiety. I was born one year after Home Rule became law, and while our autonomy has been challenged before, our limited self-government has never faced the type of test we are facing right now. My jobs are many right now. Part of my job is just managing us through this crisis and making sure that our government continues to operate in a way that makes DC residents proud.\"\n...In fact, this evening, I am pleased to be able to report that, after a day in court and in accordance with Home rule, Pamela Smith remains our Chief of Police, and command and control of our 3,100 men and women at the Metropolitan Police Department. I am incredibly proud of how the chief has handled this experience.\"\nShe concluded: \"...I know that if we keep sticking together, we will make it to the other side of this, we will make future generations of Washingtonians proud, we will show the entire nation what it looks like to fight for American democracy—even when we don't have full access to it.\"\nUpdate 8/17/25, 10:56 a.m. ET: This articles has been updated with additional comment.\nIs This Article Trustworthy?\nIs This Article Trustworthy?\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nAbout the writer\nPeter Aitken is a Newsweek Politics Editor based in New York. His focus is domestic U.S. politics, but he has ... Read more"
    },
    {
      "url": "https://www.newsweek.com/topic/republicans",
      "text": "Texas redistricting moves closer as millions pour into California fight\nThe Texas Senate has approved a Trump backed redistricting bill that could gain the GOP five House seats in 2026.\nColin Allred edges out leading Republican in Texas race—internal poll\nAllred held a lead over Attorney General Ken Paxton in an internal poll released Friday in Texas' U.S. Senate race.\nDemocrats' chances of beating GOP's Vivek Ramaswamy and flipping Ohio—Polls\nA new poll showed Ramaswamy leading two Democrats in the gubernatorial race.\nRepublicans are losing Latino voters. Democrats aren't winning them either\nA demographic that shifted toward Trump in 2024 now appears up for grabs heading into the midterms.\nThe House Is on Fire and Democrats Are Debating Paint Colors | Opinion\nThe house is on fire, and Democratic leadership is debating what color to paint the kitchen. Either grab a hose or get out of the way because if we lose this fight, there won't be a democracy left to save.\nGOP judge declares Alina Habba's actions \"void,\" NJ appointment unlawful\nAlina Habba's tenure as U.S. Attorney for New Jersey has been marked by controversy since her appointment.\nDemocrat switches party to Republican to run against Wes Moore\nMaryland gubernatorial candidate Ed Hale said he's changing parties because he doesn't believe he could defeat Moore in the primary.\nHow education and gender are fueling Gen Z's political divide\nWith the cost of college rising and the appeal of being one's own boss ever-present, young voters' political leanings are shifting.\nGavin Newsom, Kathy Hochul issue warnings after Texas redistricting vote\nThe vote targets congressional lines ahead of the 2026 midterms in a state where shifts could change control of the House of Representatives.\nHow the right is winning over Gen Z\nYoung Americans traditionally start adulthood by voting for the left, but Republicans are capitalizing on their loss of trust in institutions\nGavin Newsom and Pete Buttigieg's chances of beating JD Vance in 2028: Poll\nEven with the election still a few years away, polling could offer insight into potential candidate viability.\nElise Stefanik drowned out by relentless boos at memorial event\nThe New York Republican was booed while speaking at an event in honor of John Zurlo, a Clinton County clerk who died in December.\nTexas Democrat refuses to leave Capitol overnight in redistricting standoff\nState Representative Nicole Collier plans to stay in the Texas Capitol until Wednesday in protest against a police escort policy.\nIowa Democrat drops out of Senate race, endorses rival\nJ.D. Scholten dropped out of the 2026 Senate race and endorsed a fellow legislator to potentially challenge Republican Joni Ernst.\nSherrod Brown's chances of flipping GOP seat in Ohio as he enters race\nSherrod Brown made official his comeback campaign for U.S. Senate on Monday.\nRepublicans Pull 'Deport Depot' Merch After Home Depot Complains\n\"We don't allow any organization to use our branding or logo for their commercial purposes,\" a Home Depot spokesperson told Newsweek.\nDonald Trump's new census could be bad news for Texas\nPresident Donald Trump has requested a new national census excluding illegal migrants, but it is likely to face legal challenges.\nGavin Newsom's team unveils new nickname for JD Vance\n\"NOT EVEN JD 'JUST DANCE' VANCE CAN SAVE TRUMP FROM THE DISASTROUS MAPS 'WAR' HE HAS STARTED,\" Newsom's office wrote on social media.\nGavin Newsom breaks through by trolling Trump at his own meme game\nCalifornia Governor Gavin Newsom is punching back at Donald Trump — in memes and capital letters.\nBush family makes moves to reboot political dynasty\nJonathan Bush, cousin of former President George W. Bush, is eyeing a gubernatorial run.\nDemocrat says Texas \"gerrymandering war\" shows party's new fiery path\n\"It's imperative at this moment to use every tool that we have to fight back,\" Isaiah Martin, a candidate running in Texas's 18th congressional district.\nNew poll shows top 2028 Democratic, Republican candidates by Texas voters\nEven with the election still a few years away, polling could offer insight into candidate viability.\nSocial Security's 2025 changes praised by Trump administration\nThe agency has highlighted operational changes it says have improved service for beneficiaries.\nTexas Is the Front Line in a National Battle for Democracy | Opinion\nThe eyes of the nation have turned on Texas as Republicans, in collaboration with the Trump administration, brazenly attack their constituents' voting rights.\nStimulus checks 2025 update: Senators discuss Trump rebate proposal\nRepublican Senator Josh Hawley has proposed using the revenue from tariffs to provide direct payments to millions of Americans.\nBarack Obama sends message to Texas Democrats over redistricting battle\nTexas House Democrats have left the state to prevent the passage of a redistricting bill by breaking quorum.\nMarjorie Taylor Greene goes scorched earth on Lindsey Graham over Israel\nThe exchange reflects an ongoing split within sections of the Republican coalition over U.S. policy toward Israel.\nTexas Democrats reveal list of demands for returning to state\nTexas House Democrats who fled the state to block the GOP's efforts to redraw the congressional map announced a list of demands.\nAre gay dating apps threatening to expose Republicans? What we know\nA viral social media post claims gay dating apps will identify Republicans on their platforms, revisiting a familiar online trend.\nTaylor Swift's popularity with Republicans drops by double-digits: Poll\nSwift's appearance on boyfriend Travis Kelce's podcast on Wednesday evening nearly broke the internet."
    },
    {
      "url": "https://www.newsweek.com/topic/ice",
      "text": "DHS responds to backlash over ICE facilities at internment camp site\nFort Bliss in Texas served as an internment facility during World War II, holding Japanese, German and Italian civilians.\nICE detains disabled veteran with green card at citizenship interview\nMuhammad Zahid Chaudhry is held in ICE detention in Washington state.\nKilmar Abrego Garcia free from detention, reuniting with family\nKilmar Abrego Garcia was released from Putnam County Jail in Tennessee and is traveling to Maryland to reunite with his family.\nDad detained by ICE outside his child's elementary school\nThe Encinitas Union School District confirmed that the man was the father of a student at the school.\nBrother of truck driver in deadly \"illegal\" U-turn crash arrested by ICE\nHarneet Singh, 25, was taken into federal custody on August 18, the Department of Homeland Security said in a news release.\n\"Trump Burger\" owners detained by ICE in Texas\nImmigration and Customs Enforcement said it detained Iyad Abuelhawa, who founded the Trump Cafe in 2016, local media reported.\nICE pushes to deport double amputee in US since age 2 after over 40 years\nRodney Taylor has been in ICE detention since the beginning of this year.\nMom with green card detained for 10 days after family vacation released\nA Massachusetts mother of four with a valid green card was held in immigration custody for 10 days.\nDonald Trump scores legal win in \"Alligator Alcatraz\" fight\nTrump scored a partial win as a judge tossed one claim, but Florida legal battles over detainee rights continue.\nICE detains dad trying to reinstate green card after nearly 4 decades in US\nSam \"Psalm\" Behpoor has been in ICE custody for over two months.\nHotel contractor detained by ICE at routine immigration appointment\nMorgan Bowser said ICE detained her partner, John Ever Pineda Calderón, a hotel renovation worker seeking asylum, in Tennessee.\nHigh schooler detained by ICE couldn't shower for a week, teacher says\nBenjamin Marcelo Guerrero-Cruz was detained in the street in Los Angeles while walking his dog.\n\"Cornhusker Clink\" becomes latest Trump immigration detention center\nSome of the new centers have already drawn lawsuits and community backlash over conditions, environmental compliance and transparency.\nICE detains dad who previously had green card after 44 years in US\nChuong Dong came to the U.S. at age 12 and is married to an American citizen. They have two children.\nSix-year-old detained by ICE agents in New York\nThe girl attends PS 89, the Jose Peralta School of Dreamers in Queens, according to local media.\nMaine police officer agrees to leave US after ICE arrest\nJon Luke Evans, a Jamaican reserve officer, is to leave the US voluntarily after an ICE arrest.\nFull list of states suing Trump administration for immigration\nSeveral attorneys general said the VOCA conditions appear to be another way the administration is targeting sanctuary jurisdictions.\nGreen card holder detained by ICE says food not fit for his dog\n\"This food my dog wouldn't even eat,\" Deon Lewis told Newsweek from inside ICE custody.\nICE arrests influencer during live stream\nDHS Assistant Secretary Tricia McLaughlin told Newsweek that Martinez was arrested because of a prior DUI conviction in Los Angeles.\nGirlfriend says teen soccer star detained by ICE on second day of school\nRoberto Itzep-Caba was reportedly detained by ICE after a traffic stop on the second day of school in Georgia.\nFamily says ICE nabbed high school senior on walk, left family dog in road\nThe 18-year-old was detained amid heightened immigration enforcement in Los Angeles.\nWoman in US for nearly 3 decades arrested by ICE after traffic stop\nA single mom who's lived in the U.S. for nearly 30 years was spared expedited removal when a judge said her rights were violated.\nICE makes major change for new recruits\nICE no longer requires new recruits to take a five-week Spanish-language training program, according to DHS.\nLA Schools protect children from ICE With safe zones and campus patrols\nThe Los Angeles Unified School District has set up measures to ensure students and families can travel to and from school safely.\nGOP Rep: Let's Recognize the Patriots Who Defend Our Border | Opinion\nPresident Donald Trump won the popular vote in large part because he promised to end the immigration chaos and return to sanity.\nGavin Newsom blasts masked border agents descending on rally: \"Pathetic\"\n\"It was top down. You know that for a fact. They'll deny it—well, maybe they won't deny it,\" Newsom told reporters.\nICE arrests of migrants without criminal records surge nearly 200 percent\nThe Trump administration \"will inevitably sweep in many people with no criminal record,\" law professor Davis Hausman told Newsweek.\nDC police has new plan to help ICE: What to know\nD.C. police issued an order Thursday directing officers making traffic stops to notify ICE if they stop undocumented immigrants.\nBondi IDs man who threw sandwich at officers as DOJ employee: \"Deep state\"\nJeanine Pirro, U.S. attorney for the District of Columbia, announced Wednesday that Sean Charles Dunn would be charged with a felony.\nRon DeSantis touts cheaper price tag at \"Deportation Depot\" facility\nThe Florida Gov. said the detention facility will be housed at the Baker Correctional Institution, about 43 miles west of Jacksonville."
    },
    {
      "url": "https://www.newsweek.com/topic/fbi",
      "text": "John Bolton was asked if he was worried about Trump 12 days before FBI raid\nThe raid on Bolton's home was part of an investigation into the handling of classified documents according to The Associated Press.\nFBI raids John Bolton's home over 2020 memoir: what he wrote about Trump\nAt the time of its release, The Room Where It Happened was one of the most high-profile and damaging insider accounts of the Trump presidency.\nDonald Trump reacts to John Bolton's FBI home raid\nFBI agents entered Bolton's Bethesda, Maryland, home at 7 a.m. on Friday as part of a classified records probe.\nMAGA celebrates John Bolton's home being raided: 'How does it feel?'\nFormer White House national security advisor John Bolton's home was raided on Friday morning.\nFBI speaks out about John Bolton's home being raided\n\"NO ONE is above the law,\" FBI Director Kash Patel posted to X after news broke that feds had raided the home of the former Trump official.\nFBI agents exit John Bolton's office with boxes in raid\nJD Vance denied that Friday's FBI raid on John Bolton's home was related to the former national security adviser's vocal criticism of President Donald Trump.\nTrump admin makes concession after lawsuit filed in Washington, D.C.\nEarlier Friday, the nation's capital filed a lawsuit to block Republican President Donald Trump's takeover of its police department.\nDonald Trump's move to seize DC Metro Police control triggers lawsuit\nThe move followed Attorney General Pam Bondi's announcement that DEA chief Terry Cole would assume the duties of police chief.\nDOJ charges man with cyberstalking slain UnitedHealthcare CEO's family\nProsecutors say Shane Daley, 40, left multiple voicemails, beginning just hours after Thompson was shot in midtown Manhattan.\nTrump admin gives update on arrests after first day of DC federalization\nTrump's move activated National Guard members and temporarily place the District's police department under federal control.\nTrump administration ordered to improve conditions at New York ICE facility\nJudge Kaplan's order takes effect immediately as the case proceeds, forcing ICE to overhaul conditions at a NYC immigration facility.\nTrump sends 120 FBI agents to DC amid crime crackdown threat: Report\nThe FBI agents, primarily from the Washington Field Office, will work overnight shifts for at least one week supporting D.C. police.\nDemocratic politician says FBI wants to kill him\n\"You know the FBI is after me,\" Washington, D.C., Ward 8 council member Trayon White said Friday during a swearing-in ceremony.\nMap shows how DC crime rates compare to US states\nThe data shows that over 14 million criminal offenses occurred across the country in 2024, but that various offenses decreased compared to previous years.\nTrump administration launches another FBI purge\nThe Trump administration is firing three senior FBI officials, according to multiple reports.\nFBI helping Texas locate Democrats in redistricting \"war\" sparks alarm\nMichael McAuliffe, former prosecutor and former state attorney, told Newsweek the FBI's involvement is \"well beyond alarming.\"\nWho is Brian Driscoll? Former FBI acting director forced out\nIn January, Driscoll was appointed acting director while Kash Patel's nomination was pending after the departure of Christopher Wray.\nFBI to aid Texas in locating Democrats over redistricting\nSenator John Cornyn says the FBI will help locate Texas Democrats who left the state to block the GOP redistricting vote.\nMap shows homicide rates in every state\nThe FBI gave an update on their latest crime numbers this week.\nObama grand jury convening in Florida would be major boost for Trump\nWhile the grand jury venue has not yet been announced, placing it outside D.C. would serve as a tactical win for the president.\nDonald Trump issues FBI warning to fleeing Texas Democrats\nDozens of Texas Democrats have left the state in a bid to block a vote on redrawn U.S. House maps sought by Trump.\nTrump officials to discuss handling of Jeffrey Epstein case: Report\nThe pending decision comes as Congress, sex abuse victims and political leaders across the aisle intensify calls for transparency.\nOne person murdered every 30 minutes in US—FBI\nOverall, violent crime saw a decrease from 2023 to 2024, the report showed.\nEpstein victim says Trump's reported move \"monumentally mind-blowing\"\nTwo unidentified Epstein victims urged a Manhattan court to review files for privacy concerns before any public release.\nFake police scam targets Chinese international students, FBI warns\nCriminal actors are impersonating Chinese police officers in a scam targeting international students, according to an FBI field office.\nCalifornia man accused of sending money to ISIS: \"Soon, I'll be joining\"\nMark Lorenzo Villanueva, 28, was arrested for backing the militant group, the federal prosecutors said.\nGhislaine Maxwell subpoena update as House waits on Supreme Court\nMaxwell's legal team warned she would invoke her Fifth Amendment right against self-incrimination unless certain conditions were met.\nDonald Trump's name in Jeffrey Epstein files redacted by FBI: report\nThe Justice Department says the review turned up no \"client list\" or evidence linking President Trump to criminal activity,\nChance of Ghislaine Maxwell naming names may rise dramatically\nA major impediment to Ghislaine Maxwell spilling Jeffrey Epstein secrets will be removed but not yet, an attorney told Newsweek.\nSeven new Epstein jail video issues under scrutiny\nThe Department of Justice released surveillance footage that was meant to prove that Epstein died by suicide behind bars."
    }
  ],
  "argos_summary": "President Trump announced that Chicago could be the next city to receive National Guard troops, a claim Chicago officials dismissed as a political distraction. Illinois Governor JB Pritzker and Mayor Brandon Johnson criticized the threat, citing recent crime reductions and community programs that have lowered homicides, robberies, and shootings. The statement follows Trump’s earlier deployment of federal forces to Washington, D.C., which sparked legal challenges and accusations of overreach. Chicago leaders argue that federal intervention would not address housing, food insecurity, or the city’s public safety needs, and they call for restoration of cut federal violence‑prevention funding instead.",
  "argos_id": "XDDA9KCZ1"
}