{
  "url": "https://www.latimes.com/world-nation/story/2025-08-23/truck-driver-accused-by-the-trump-administration-of-being-in-the-us-illegally-is-denied-bond",
  "authorsByline": "Associated Press",
  "articleId": "549f0de566d0400bae67632506bed256",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/64e287b/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T17:52:32.964000+00:00",
  "addDate": "2025-08-23T17:56:56.039583+00:00",
  "refreshDate": "2025-08-23T17:56:56.039584+00:00",
  "score": 1.0,
  "title": "Truck driver in crash at center of Trump administration feud with Newsom is denied bond",
  "description": "A truck driver accused by the Trump administration of being in the U.S. illegally is denied bond. The driver, whose crash in Florida killed three people, was issued a work permit in California.",
  "content": "A truck driver accused of making an illegal U-turn that killed three people in Florida last week who the Trump administration said was in the U.S. illegally was denied bond Saturday.\n\nThe crash sparked a clash between the U.S. Department of Homeland Security and California Gov. Gavin Newsom over Harjinder Singh, a native of India who obtained a work permit and driver’s license in the state.\n\nSingh was charged with three state counts of vehicular homicide and immigration violations, and he was denied bond on all charges. He is being held in the St. Lucie County Jail, Lt. Andrew Bolonka from the St. Lucie County Sheriff’s Office said. U.S. Immigration and Customs Enforcement has put a hold on him.\n\nHomeland Security spokesperson Tricia McLaughlin said issuing a commercial license to someone in the country illegally is “asinine.” California is one of 19 states, in addition to the District of Columbia, that issues licenses regardless of immigration status. Supporters say that lets people work, visit doctors and travel safely.\n\nNewsom’s press office responded in a social media post on X that Singh obtained a work permit while Donald Trump was president, which McLaughlin disputed.\n\nFlorida authorities said Singh entered the U.S. illegally from Mexico in 2018.\n\nFlorida Gov. Ron DeSantis dispatched Lt. Gov. Jay Collins to California to escort Singh onto an airplane Thursday.\n\nSingh made the illegal turn on the highway about 50 miles north of West Palm Beach, according to the Florida Highway Patrol. A minivan in the neighboring lane was unable to avoid the truck’s trailer and slammed into it, killing the minivan’s driver and two passengers.\n\nSingh and a passenger in his truck were not injured.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-21/italian-divers-water-blast-the-popular-underwater-statue-of-christ-off-portofino",
    "https://www.latimes.com/world-nation/story/2025-08-22/immigration-raid-cannabis-farm-deportation-mexico",
    "https://www.latimes.com/world-nation/story/2025-08-23/us-seeks-to-deport-kilmar-abrego-garcia-to-uganda-after-he-refused-to-plea-offer-in-smuggling-case"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Harjinder Singh",
      "weight": 0.09370806
    },
    {
      "name": "Singh",
      "weight": 0.09080812
    },
    {
      "name": "California Gov. Gavin Newsom",
      "weight": 0.088530555
    },
    {
      "name": "Lt. Gov. Jay Collins",
      "weight": 0.08505607
    },
    {
      "name": "Truck driver",
      "weight": 0.08496861
    },
    {
      "name": "Florida Gov. Ron DeSantis",
      "weight": 0.08430716
    },
    {
      "name": "Trump administration feud",
      "weight": 0.0818544
    },
    {
      "name": "Lt. Andrew Bolonka",
      "weight": 0.07805042
    },
    {
      "name": "Homeland Security spokesperson Tricia McLaughlin",
      "weight": 0.07747335
    },
    {
      "name": "Donald Trump",
      "weight": 0.07285056
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.93017578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.92919921875
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.9091796875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.8232421875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.54736328125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.39501953125
    }
  ],
  "sentiment": {
    "positive": 0.04758131,
    "negative": 0.73132795,
    "neutral": 0.22109069
  },
  "summary": "Harjinder Singh, a truck driver accused of making an illegal U-turn that killed three people in Florida, has been denied bond by the U.S. Department of Homeland Security and California Gov. Gavin Newsom. Singh was charged with three counts of vehicular homicide and immigration violations. The California native of India obtained a work permit and driver’s license in the state. Homeland Security spokesperson, Tricia McLaughlin, called issuing a commercial license to someone in the country illegally \"anonymous\". However, Newsom's press office countered that Singh had obtained the permit while Donald Trump was president.",
  "shortSummary": "A truck driver accused of killing three people in a Florida crash was denied bond due to his alleged illegal immigration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bd9b3d1496504a5d85497f1b8c4cce0a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-23/us-seeks-to-deport-kilmar-abrego-garcia-to-uganda-after-he-refused-to-plea-offer-in-smuggling-case",
      "text": "U.S. seeks to deport Kilmar Abrego Garcia to Uganda after he refuses plea offer\n- Share via\nNASHVILLE — U.S. immigration officials said they intend to deport Kilmar Abrego Garcia to Uganda, after he declined an offer to be deported to Costa Rica in exchange for remaining in jail and pleading guilty to human smuggling charges, according to a Saturday court filing.\nThe Costa Rica offer came late Thursday, after it was clear that the Salvadoran national would probably be released from a Tennessee jail the next day. Abrego Garcia declined to extend his stay in jail and was released Friday to await trial in Maryland with his family. Later that day, the Department of Homeland Security notified his attorneys that he would be deported to Uganda and should report to immigration authorities Monday.\nAbrego Garcia’s case became a high-profile story in President Trump’s immigration crackdown after he was mistakenly deported to El Salvador in March. Facing a court order, the Trump administration brought him back to the U.S. in June, only to detain him on human smuggling charges.\nHe has pleaded not guilty and has asked the judge to dismiss the case, claiming that it is an attempt to punish him for challenging his deportation to El Salvador. The Saturday filing came as a supplement to that motion to dismiss, stating that the threat to deport him to Uganda is more proof that the prosecution is vindictive.\n“The government immediately responded to Mr. Abrego’s release with outrage,” the filing reads. “Despite having requested and received assurances from the government of Costa Rica that Mr. Abrego would be accepted there, within minutes of his release from pretrial custody, an ICE representative informed Mr. Abrego’s counsel that the government intended to deport Mr. Abrego to Uganda and ordered him to report to ICE’s Baltimore Field Office Monday morning.”\nAlthough Abrego Garcia was deemed eligible for pretrial release, he had remained in jail at the request of his attorneys, who feared the Republican administration could try to immediately deport him again if he were freed. Those fears were somewhat allayed by a recent ruling in a separate case in Maryland, which requires immigration officials to allow Abrego Garcia time to mount a defense.\nLoller writes for the Associated Press."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-22/immigration-raid-cannabis-farm-deportation-mexico",
      "text": "A mother’s choice: Jail in L.A. or deportation to Mexico with her children\n- Share via\n- Federal raids at cannabis farms in California swept up more than 300 undocumented immigrants, including a Mexican woman and two of her daughters, who also worked at a Glass House farm in Camarillo.\n- Back in her hometown in Mexico’s Oaxaca state, the woman and her daughters face an uncertain future.\n- Her situation is made even more complicated by the family’s mixed immigration status. Some of her daughters are U.S. citizens, others born in Mexico.\nYOJUELA, Mexico — Modesta Matías Aquino was working her regular morning shift — 3 a.m. till noon — at the Glass House Farms in Camarillo, caring for rows of marijuana plants.\nAmong her co-workers on the morning of July 10 were two of her daughters, aged 16 and 19.\n“With everything going on, with the raids, there had been rumors that something bad might happen,” Matías recalled.\nAbout 9 a.m., she said, phalanxes of masked agents in tactical vests sealed off the sprawling compound. Matías and her daughters were among more than 300 undocumented immigrants — including at least 10 minors — who, according to U.S. authorities, were detained at a pair of Glass House sites.\nThe raids, like other such operations across the United States, split many so-called “mixed-status” families, those with both U.S.-born citizens — often children — and undocumented relatives, typically one or both parents.\nMatías’ family life is, by any definition, complicated, including seven daughters in all. Her two youngest daughters, aged 2 and 5, are U.S. citizens, born in California. Her 2-year-old grandson —the child of Matías’ 16-year-old daughter — is also a native Californian. So when Matías was held in a federal lockup in downtown Los Angeles, she faced a momentous choice — one that would mark her family for life.\nAs fear over ICE raids mounts across Los Angeles, undocumented families are grappling with how to handle crucial conversations with their children.\nMatías, 43, could accept removal to Mexico. But that might effectively banish her from returning to the United States, where she had toiled as a field worker for most of the past quarter-century — and where she had deep family ties.\nAlternately, she could fight expulsion in court. But that would leave her in custody, possibly indefinitely.\n“They told me I could be locked up for months, maybe a year, and never see my children,” Matías said, recalling what U.S. agents informed her in Los Angeles. “I just couldn’t endure that.”\nInstead, Matías said, she agreed to return voluntarily to Mexico, but with a caveat: She had to be accompanied by her two youngest daughters and her grandson. After some haggling — federal authorities initially balked at sending U.S. citizen minors to Mexico, Matías said — an agreement was reached. (The Department of Homeland Security didn’t respond to inquiries from The Times.)\nShe and four daughters — the two undocumented teenagers who worked at Glass House and the two U.S. citizen youngsters — were soon in a van en route to Tijuana. The U.S.-born grandson was also with them.\n“Go ahead,” an agent told Matías upon letting the family out at the border. “You’re back in your country now.”\nBack to Yojuela\nThe hamlet of Yojuela is home to some 500 people — all of Indigenous Zapotec origins — who reside deep in the Sierra Madre Oriental, in Mexico’s southern Oaxaca state. The area is known for its clay pottery, fired from distinctive reddish earth, and for something else — dispatching its offspring to work in the fields of California, supporting loved ones left behind in a time-tested rite of passage.\nThe scripted sequel is the triumphant homecoming of those who moved on but never forsook their roots. These days, however, many return to places like Yojuela broke and embittered, casualties of President Trump’s deportation onslaught.\nMatías and her family showed up last month, just 20 days after she was detained. She had last set foot here seven years earlier.\n“This is is where I was born and reared,” Matías said with both resignation and pride, ushering visitors onto a verdant patch shimmering in the aftermath of recent rains.\nReaching the ancestral hearth involves a two-hour, uphill drive on a washboard road from the nearest city, and then a short hike — across a stream and up a steep hill, past fields of corn and beans and stands of pine, all to a soundtrack of clucking turkeys and braying donkeys.\nAccompanying Matías were two U.S.-born daughters, Arisbeth, 2, and Keilani, a onetime Oxnard preschooler who turned 5 in Tijuana. Also present were Matías’ 16-year-old daughter, Ailed, and Ailed’s U.S.-born son, Liam Yair, 2.\nI’d like like to go back to California\n— Ailed Lorenzo Matías\nIt marked the first time that the native Californians met their extended family, including a platoon of curious cousins.\nSeasoned to the periodic reunion ritual was Cecilia Aquino, mother of Matías and her five siblings— all of whom had made the trek to California. For decades, her adobe dwelling hosted waves of grandchildren and great-grandchildren as sons and daughters went back and forth, entrusting expanding broods to the matriarch.\nMatías and her mother, now 72, embraced, no words needed. Each examined the other closely. Time had taken its melancholic toll.\n“All of my children had to go away and leave their kids with me — there’s no work here,” said Aquino, worn down by years of toil, as she prepared coffee on a kindling-fired stove. “Then they come back. Then they leave again. It’s sad. The children never really get to know their parents. I wish the officials on the other side [of the border] would let them be together.”\nLeaving home\nMatías joined the migrant trail as a teenager, following the harvests — strawberries, celery, broccoli and more — from California to the Pacific Northwest. Through the years, she gave birth to her seven daughters — four in the United States, three in Mexico — as she crisscrossed the border a dozen times.\n“I was always a single mother, always battling on my own for my children,” Matías said. “I earned everything through my own sweat and toil. The fathers of my kids never gave me anything.”\nHer last journey north, in 2018, was the most difficult, as the once-porous international boundary had become a militarized bulwark. She vowed it would be her last crossing. Four years ago, she said, she secured work at Glass House Farms, a major player in the legalized cannabis boom.\n“It was the best job I ever had,” she said.\nThere was no back-breaking stooping: Trimmers sat on benches. The pounding sun wasn’t an issue in the temperature-controlled facilities.\nMatías said she rose to become a crew chief, overseeing 240 workers. She said she earned more than $20 an hour, and, with overtime, regularly grossed in excess of $1,000 a week — a unfathomable haul in Oaxaca, where field hands pocket the equivalent of about $10 a day.\nHer plan, she said, was to remain in California until she turned 65, then retire to Yojuela, using savings to open a shop.\n“I never wanted to stay forever in Oxnard,” she said.\nThen came July 10.\n‘Total chaos’\n“People were running all over the place,” Matías recalled of the raid. “Some tried to hide inside the greenhouses. Others crawled inside the ventilation shafts. It was total chaos.”\nOne worker, Jaime Alanis García, 56, died from injuries suffered when he fell from a greenhouse roof, apparently while trying to evade arrest.\nBlocking any escape for herself and her two daughters, Matías said, were los militares — heavily armed U.S. agents in martial getup.\nThe farmworker who suffered fatal injuries while fleeing an immigration raid in Ventura County was buried in his Mexican hometown.\nThat evening, Matías said, she spent a sleepless night in detention in downtown Los Angeles. The next day, she accepted a “voluntary return” to Mexico.\nFor almost a week, the family stayed in a shelter in Tijuana, awaiting the arrival of her male partner and the boyfriend of her 19-year-old-daughter. Both were also among the of Glass House detainees. The three-day bus ride south included a frenzied, crosstown change of terminals in Mexico City at midnight to catch the last coach for Oaxaca.\nWith her remaining savings, Matías purchased an unfinished, cinder-block house on the outskirts of Miahuatlán de Porfirio Díaz, a historic but drab city that hosts a federal prison. It’s about a two-hour drive on a rough track from Yojuela, but offers baseline schooling and job prospects.\nThe expulsion to Mexico shattered a family that had attained a modicum — perhaps an illusion — of stability in California.\nLike her mother, Ailed Lorenzo Matías, 16, succumbed to the siren call of the border. She was 14 when she and her boyfriend crossed into California. She struggled to climb the fence and descend on the U.S. side, worrying about her baby. She was five months pregnant.\nThe other day, Ailed sat in a stairwell of the new home in Miahuatlán, cuddling her son. They were sharing a video call to Oxnard with the boy’s father, who also worked at Glass House. But, in a twist of fate, he was off duty on July 10.\n“I’d like like to go back to California,” the soft-spoken Ailed said. “My son was born there. And that’s where his papá is.”\nUnlike Ailed, her sister, Natalia Lorenzo Matías, 19, has no intention of returning.\n“No, I don’t want to go back,” Natalia said. “You don’t have a real life there. You spend your time working and locked in your house, always afraid that you will be arrested.”\nHer mother is deeply tormented but endeavors to conceal her despair. “I have to be strong for the kids,” Matías said. “When I’m alone, I begin to cry.”\nAmong those at Thursday’s immigration action was a Trump voter who doesn’t like the president’s approach and the family of a National Guardsman who say it’s time for him to come home.\nShe says she understands Trump’s point: He wants to deport criminals. But, she asks, why target hardworking immigrants?\n“In all my years in the north,” she said, “I never saw an American working in the fields.”\nHer plan, she says, is to stabilize the family, enroll her 5-year-old in school, find some work — and, then, perhaps in a year or two, set off once more.\nFor now, though, Matías says she is concentrated on helping her family adjust to a new way of life — albeit, she hopes, a transitory one, until they get back on the road to California.\nSpecial correspondents Cecilia Sánchez Vidal and Liliana Nieto del Río contributed."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-21/italian-divers-water-blast-the-popular-underwater-statue-of-christ-off-portofino",
      "text": "Italian divers pressure-wash the popular underwater statue of Christ off Portofino\n- Share via\nROME — Police divers have cleaned one of the biggest underwater attractions of the Mediterranean, using pressurized water hoses to remove crustaceans from the “Christ of the Abyss” statue that was placed on the seabed off Italy’s northern coast in 1954 as a memorial to those who have died at sea.\nThe 2.5-yard-tall bronze statue, depicting Christ with his hands raised in blessing, was made using the melted-down medals of Italy’s fallen soldiers, cannons and ships and is appreciated here as a potent symbol of sacrifice in World War II. Similar statues are found off Key Largo, Fla., and in Grenada.\nThe statue is located about 300 yards off the beach between the resort towns of Portofino and Camogli, on Italy’s northern Ligurian coast, at a depth of around 18 yards.\nThe archaeological office of Italy’s Culture Ministry says that, because of its proximity to the coast and relatively shallow depth, the “Christ of the Abyss” site is the most frequented dive spot in the Mediterranean. The site, located in the bay of San Fruttuoso, also draws kayakers and paddleboarders since the statue can be seen from the surface.\nEvery year, police divers carefully water-blast the statue to remove bacteria and corrosive crustations that have accumulated. The cleaning, which this year took place on Tuesday, uses seawater itself and causes no damage to the bronze or the marine ecosystem as the microorganisms are dislodged and released back into the sea, said Alessandra Cabella, art historian from the Ligurian archaeology superintendent’s office.\n“There are a ton of marvelous fish who come to watch,” she said in an interview Thursday. “It’s truly an activity with zero impact on the environment.”\nThe water-blasting technique has been in use since 2004, when the statue was taken from the water for a full restoration after a hand had broken off and was reattached.\nIt was then that restorers realized that the previous underwater cleaning method — scraping the bronze with metal brushes to remove the crustaceans — had caused irreparable damage to the statue’s surface, creating crevices in the bronze patina that attracted even more marine material to accumulate.\nThe statue is also delicate because when it was made, by Italian artist Guido Galletti to honor an Italian diver who died in the area, it was filled with cement and iron rods to stabilize it on the seabed. The presence of the iron has helped corrode the bronze from the inside, Cabella said.\nStellacci and Winfield write for the Associated Press."
    }
  ],
  "argos_summary": "A truck driver, Harjinder Singh, was denied bond after a fatal illegal U‑turn in Florida, sparking a dispute between DHS and California over his work permit. Meanwhile, ICE plans to deport Kilmar Abrego Garcia to Uganda after he rejected a plea deal, and a Mexican woman and her daughters faced a voluntary return to Mexico following a federal raid on a cannabis farm, highlighting the challenges of mixed‑status families. Separately, Italian police divers cleaned the “Christ of the Abyss” statue off Portofino using a pressure‑water technique to preserve the bronze monument and marine environment.",
  "argos_id": "Z5TMR1FO1"
}