{
  "url": "https://www.howtogeek.com/google-sheets-functions-need-to-learn-switch-from-microsoft-excel/",
  "authorsByline": "Tony Phillips",
  "articleId": "71c9855e90424db68ab7261cc6e1dab6",
  "source": {
    "domain": "howtogeek.com",
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McNair",
      "coordinates": {
        "lat": 38.9695316,
        "lon": -77.3859479
      }
    }
  },
  "imageUrl": "https://static1.howtogeekimages.com/wordpress/wp-content/uploads/2024/05/two-computer-monitors-the-one-on-the-left-displaying-excel-and-the-one-on-the-right-displaying-google-sheets.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-23T15:00:16+00:00",
  "addDate": "2025-08-23T15:07:14.681787+00:00",
  "refreshDate": "2025-08-23T15:07:14.681788+00:00",
  "score": 1.0,
  "title": "4 Key Google Sheets Functions You Need to Learn Before You Make the Switch From Excel",
  "description": "Excel and Sheets share most functions—but not all.",
  "content": "If you're well-versed in Microsoft Excel, making the switch to Google Sheets shouldn't cause you too many problems. However, there are some essential functions exclusive to Google Sheets that will make your life much easier once you get to know them.\n\nThe QUERY function is as useful in Google Sheets as the Power Query tool is in Microsoft Excel. However, where Power Query in Excel operates through a separate window, queries in Google Sheets are powered through a series of clauses in a formula.\n\nThe QUERY function in Google Sheets has three arguments:\n• a is the range of cells containing the data to be manipulated,\n• b is the query to perform, written using Google Visualization API Query Language, and\n• c (optional) is the number of headers at the top of the data, which, if omitted or set to -1, forces Google Sheets to work this out automatically by analyzing the structure and content of your dataset.\n\nIf you've never used structured query language (SQL) before, the QUERY function might seem daunting at first. However, once you try using the function in some straightforward scenarios, the sky's the limit!\n\nIn this example, let's say you want to produce a list of employees from the T_Staff table who have completed their training (in other words, those who have \"Y\" in column D.\n\nTo do this, in a separate cell or spreadsheet, type:\n• T_Staff is the table where the data you want to extract is stored,\n• SELECT B, C tells Google Sheets that you want to extract certain data from columns B and C of the T_Staff table, and\n• WHERE D = 'Y' tells Google Sheets that you only want to extract the rows where there's a \"Y\" in column D.\n\nIn a second example, suppose you want to know which employees have completed training and earned over $30,000 in profit. The formula for this query is as follows:\n\nwhere D='Y' AND E>30000 combines the two logical arguments to only extract values from column B and C where there's a \"Y\" in column D and the value in column E is more than £30,000.\n\nNow, let's explore some slightly more advanced scenarios. Let's imagine that this time, you want to count the number of employees who have and haven't completed their training, and group those totals into individual tallies.\n\nIn this case, the formula is:\n\nwhere SELECT D first extracts the information from column D, COUNT(D) counts the number of entries in the same column, and GROUP BY D collates the count according to the common values (in this case, \"Y\" and \"N\").\n\nFinally, you now want to analyze whether those who have attended training have turned a greater profit than those who haven't. To do this, type:\n\nwhere SELECT D extracts the data from column D, AVE(E) averages the values in column E according to the common values in the previously selected column, and GROUP BY D aggregates the averages according to their common values.\n\nAs a result, you can see that those who attended training made, on average, a profit that is around $5,000 greater than those who didn't.\n\nIMPORTRANGE: Import Data From One Google Sheets File Into Another\n\nIn Microsoft Excel, if you wanted to import data from one file to another, you would most likely use Power Query. However, in Google Sheets, you'll need to use the IMPORTRANGE function.\n\nThe IMPORTRANGE function has a straightforward syntax with two arguments:\n\nArgument a directs Google Sheets to the file containing the range you want to import, either in the form of a URL (enclosed in double quotes) or a reference to a cell containing the URL.\n\nArgument b is the reference to the range within the identified file. This can be cell references, a sheet name followed by cell references, a named range, a table name, or a column within a table—all of which must be in double quotes. It can also reference a cell containing the cell references of the source data, and this doesn't need quotation marks.\n\nLet me show you IMPORTRANGE in action.\n\nIn this first example, your aim is to import the list of names from File 1 to File 2.\n\nTo do this, select the cell in File 2 where you want the list to be imported to, and type the following formula:\n\nNote how the URL and cell references are placed inside double quotes.\n\nThe first time you make the connection between the two files, you may see a #REF! error. In this case, hover over the cell containing one of the following two errors.\n\nIf you own both spreadsheets, Google Sheets requires you to grant permission to link the files. To do this, click \"Allow Access.\"\n\nAlternatively, if you're not the owner of the source file and haven't already been given edit access, you'll be told that you don't have permission to import the identified range using the IMPORTRANGE function. In this case, copy and paste the source file's URL into the browser address bar, and press Enter. Then, click \"Request Edit Access,\" and wait for the owner to grant permission.\n\nAs soon as the correct permissions are activated, the range is imported to File 2.\n\nOne benefit of the IMPORTRANGE function is that if the contents of the referenced cells in File 1 change, this is reflected in the imported data in File 2. However, if the source data expands or changes location, you'll need to adjust the formula accordingly.\n\nBy default, IMPORTRANGE imports from the source file's first worksheet. To import a range from another worksheet in the source file, for argument b, type the sheet name, followed by an exclamation mark, and then the cell references.\n\nIn this example, the formula will import the data from cells A2 to A11 in Sheet 2:\n\nOne issue with the above formulas is that they're lengthy and difficult to parse. So, to make the formula tidier, for argument a, you can reference a cell containing the source URL. For example, typing:\n\nimports the data in cells C2 to C11 in the Google Sheets file linked in cell A1.\n\nYou could do the same for argument b of the formula by referencing a cell that contains a reference to the range you want to import. Here, typing:\n\ninto cell B2 takes the URL from cell A1, and the cell references from cell B1:\n\nGOOGLETRANSLATE: Translate Text From One Language Into Another\n\nAs its name suggests, the GOOGLETRANSLATE function takes some text in your spreadsheet, and translates it into another language, much like the TRANSLATE function in Microsoft Excel.\n\nHere's how the GOOGLETRANSLATE function works in Google Sheets:\n• a is either the text to be translated (enclosed in double quotation marks) or a reference to a cell containing the text to be translated,\n• b (optional) is the source language code, and\n• c (optional) is the target language code.\n\nIf you omit argument b, Google Sheets will attempt to detect the language automatically. Omitting argument c translates the text into the language selected in your system settings.\n\nLet's start with a straightforward example before we explore how you can use this function in a real-life scenario.\n\nLet's say you're sent this Google Sheets file containing four cells containing sentences in four different languages, and you need to translate all the text into English, your system's default language.\n\nFirst, to translate the text in cell A1 into English in cell B1, you need to type:\n\nBecause you didn't specify a source language (argument b), Google uses its translation tool to work out that the text in cell A1 is Chinese. Also, since you didn't identify a target language (argument c), the text is automatically translated into your system's language.\n\nNow, double-click the fill handle in the bottom-right corner of cell B1 to apply this formula to cells B2, B3, and B4.\n\nNotice how, even though the source languages in cells A1 to A4 differ, the GOOGLETRANSLATE function still picks them up correctly.\n\nNow, let's see this function in action in a practical scenario. Imagine you're creating a sheet where you need individuals to enter some personal details in column C. However, you want Google Sheets to translate the text when the respondent selects a different language in cell B1.\n\nFirst, you need to import the language codes into a separate spreadsheet in your Google Sheets file. To do this, head to the list of codes on Google's website, select all the languages and their corresponding codes, and press Ctrl+C to copy them. Then, head back to the new tab in Google Sheets, and in cell A1, press Ctrl+V.\n\nNext, you need to translate the English names of these languages into the target language to make it easier for the person selecting a language to find their own. So, in cell C1, type:\n\nand press Enter. At this point, Google Sheets will offer to autofill the formula to the remaining cells in the range, so click the checkmark to accept.\n\nNow, head back to the spreadsheet where the text needs to be translated, and create a drop-down list of all the translated languages you just generated via the Data Validation option in the Data tab on the ribbon.\n\nYou're now ready to use the GOOGLETRANSLATE function to translate the fields in column A into the chosen language in column B. In cell B4, type the following formula, which I've split up into separate lines for easier understanding:\n• Line 2 translates the text in A4 from English,\n• Line 3 uses the XLOOKUP function to take the language cell B1, look it up in the list of languages in the Codes spreadsheets (cells C1 to C55), and return the corresponding language code (cells B1 to B55), and\n• Lines 1 and 4 use the IFERROR function to return a blank cell if no language is selected in cell B1.\n\nThen, use the fill handle in cell B4 to apply the formula to the remaining cells in the range, and select a language in cell B1 to see your work in action.\n\nso that the selected language heads the translated column, and in cell C3, type:\n\nso that the word \"Answer\" in cell C3 is also translated if a language is selected in cell B1.\n\nCharts are a great way to visualize your data, but they can take up lots of real estate in your spreadsheet, especially if you insert more than one. Luckily, the SPARKLINE function in Google Sheets creates a miniature chart within a cell.\n\nThe main difference between sparklines in Microsoft Excel and Google Sheets is that in the former, they're inserted and modified on the ribbon, while in the latter, everything is done within the formula. What's more, there are more modification options for sparklines in Sheets than in Excel.\n\nAlthough the SPARKLINE syntax initially appears quite simple, as you add modifications, it becomes more complex:\n\nwhere a references the cells containing the data you want to visualize, and b are optional settings you can apply to your sparklines, enclosed within curly braces. If you want to create a minimal in-cell line chart, you can omit argument b altogether. However, to use other types of charts and modify how they appear, argument b becomes necessary.\n\nAs I mentioned above, if you want a basic line sparkline, you only have to input the cells containing the data into argument a in your formula:\n\nHowever, you can modify the layout of these lines through argument b, which is a series of pairs of settings and their associated values. A setting and its value are separated by a comma, and each setting-value pairing is separated by a semicolon:\n\nThis table shows you the different types of settings you can apply:\n\nSo, in this example, the sparkline is red, ignores empty cells, and is slightly thicker than the default:\n\nTo turn your sparkline into a column chart, use the following for argument b:\n\nHere are the other optional setting-value pairings you can include in argument b for column or win-loss sparklines:\n\nHere, this formula uses a column sparkline whose columns are colored light gray, except for the highest value which is colored green, and sets a y-axis minimum of 50:\n\nBar chart sparklines don't work the same way as a usual bar chart, as they don't have variables on the y-axis and values on the x-axis. Instead, they group a single variable's values into one bar, allowing you to compare their proportions. For this reason, bar chart sparklines work best when you don't have too many values to plot.\n\ninto cell D2 and extending the formula to the other cells in the range means you can quickly see that team E accumulated the greatest proportion of its points in week 1, while team B did better in week 2.\n\nHere are some other settings you can apply to bar chart sparklines:\n\nTo allow for easier comparison across and within variables, I recommend always using the \"max\" setting.\n\nHere, as well as comparing each team's overall score, I can easily compare their weekly totals. I've also chosen green and yellow as the two bar colors:\n\nWhether you should use Google Sheets or Microsoft Excel depends on several factors, including the complexity of the tasks you want to perform, whether you want to collaborate with others, and if you like working on a desktop app or your web browser. Many people prefer the advanced analysis tools of Excel, while others prefer the more intuitive interface of Google Sheets.",
  "medium": "Article",
  "links": [
    "https://developers.google.com/workspace/admin/directory/v1/languages",
    "https://www.howtogeek.com/832764/how-to-use-xlookup-in-google-sheets/",
    "https://www.howtogeek.com/google-sheets-tables-dont-use-start-today/",
    "https://www.howtogeek.com/708758/how-to-resize-column-and-rows-in-google-sheets/",
    "https://www.howtogeek.com/microsoft-excel-power-query-commands-need-to-know/",
    "https://sheets.google.com/",
    "https://www.howtogeek.com/741479/how-to-hide-errors-in-google-sheets/",
    "https://www.howtogeek.com/google-sheets-microsoft-excel-which-should-you-use/",
    "https://developers.google.com/chart/interactive/docs/querylanguage",
    "https://www.howtogeek.com/6-excel-quick-tips-you-didnt-know-you-needed/#create-sparklines-to-visualize-trends",
    "https://www.howtogeek.com/microsoft-excel-combining-workbooks-easier-than-you-think-powerful-tool/",
    "https://www.howtogeek.com/450465/how-to-use-the-query-function-in-google-sheets/",
    "https://www.howtogeek.com/how-to-use-the-translate-function-in-excel/",
    "https://www.howtogeek.com/google-sheets-importrange-function-import-data-range/",
    "https://www.howtogeek.com/727905/how-to-rename-columns-or-rows-in-google-sheets/",
    "https://www.howtogeek.com/356563/what-is-a-url-uniform-resource-locator/",
    "http://www.howtogeek.com/412296/how-to-use-google-translate-directly-in-google-sheets/",
    "https://www.howtogeek.com/395616/how-to-create-a-drop-down-list-in-google-sheets/",
    "https://www.howtogeek.com/ways-google-sheets-better-than-microsoft-excel/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google Sheets",
      "weight": 0.09633065
    },
    {
      "name": "cell references",
      "weight": 0.08751439
    },
    {
      "name": "cell B1",
      "weight": 0.08603839
    },
    {
      "name": "cells B1",
      "weight": 0.08603839
    },
    {
      "name": "cell A1",
      "weight": 0.08443076
    },
    {
      "name": "cell",
      "weight": 0.08388754
    },
    {
      "name": "cells",
      "weight": 0.08388754
    },
    {
      "name": "cell B4",
      "weight": 0.08237354
    },
    {
      "name": "cell C3",
      "weight": 0.0813725
    },
    {
      "name": "cell B2",
      "weight": 0.08127204
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Reference/General Reference/How-To, DIY & Expert Content",
      "score": 0.79248046875
    },
    {
      "name": "/Computers & Electronics/Programming/Other",
      "score": 0.5439453125
    },
    {
      "name": "/Reference/Technical Reference",
      "score": 0.52880859375
    },
    {
      "name": "/Computers & Electronics/Programming/Development Tools",
      "score": 0.377197265625
    },
    {
      "name": "/Computers & Electronics/Programming/Scripting Languages",
      "score": 0.336669921875
    }
  ],
  "sentiment": {
    "positive": 0.12424566,
    "negative": 0.3394707,
    "neutral": 0.5362836
  },
  "summary": "The QUERY function in Google Sheets is similar to the Power Query tool in Microsoft Excel, but queries are powered through a formula rather than in a separate window. The function has three arguments: a range of cells containing data, a query written using Google Visualization API Query Language, and c (optional) is the number of headers at the top of the data. These queries can be used to discover which employees have completed training and earned over $30,000 in profit. The IMPORTRANGE function allows for import data from one file to another, but in Google sheets, users will need to use the IMPOR TRANGE function instead of Power Query.",
  "shortSummary": "Google Sheets functions like QUERY and IMPORTRANGE help you quickly learn from Microsoft Excel, offering useful tools like QERY and IMPORTRANGE to enhance your data management.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "c154c4f7029a4124ad07f527224b4566",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://developers.google.com/workspace/admin/directory/v1/languages",
      "text": "Languages Codes\nStay organized with collections\nSave and categorize content based on your preferences.\nThe language codes in the table below are supported for the field\nCustomer.language\n.\n| Name |\nCode |\n| Amharic |\nam |\n| Arabic |\nar |\n| Basque |\neu |\n| Bengali |\nbn |\n| English (UK) |\nen-GB |\n| Portuguese (Brazil) |\npt-BR |\n| Bulgarian |\nbg |\n| Catalan |\nca |\n| Cherokee |\nchr |\n| Croatian |\nhr |\n| Czech |\ncs |\n| Danish |\nda |\n| Dutch |\nnl |\n| English (US) |\nen |\n| Estonian |\net |\n| Filipino |\nfil |\n| Finnish |\nfi |\n| French |\nfr |\n| German |\nde |\n| Greek |\nel |\n| Gujarati |\ngu |\n| Hebrew |\niw |\n| Hindi |\nhi |\n| Hungarian |\nhu |\n| Icelandic |\nis |\n| Indonesian |\nid |\n| Italian |\nit |\n| Japanese |\nja |\n| Kannada |\nkn |\n| Korean |\nko |\n| Latvian |\nlv |\n| Lithuanian |\nlt |\n| Malay |\nms |\n| Malayalam |\nml |\n| Marathi |\nmr |\n| Norwegian |\nno |\n| Polish |\npl |\n| Portuguese (Portugal) |\npt-PT |\n| Romanian |\nro |\n| Russian |\nru |\n| Serbian |\nsr |\n| Chinese (PRC) |\nzh-CN |\n| Slovak |\nsk |\n| Slovenian |\nsl |\n| Spanish |\nes |\n| Swahili |\nsw |\n| Swedish |\nsv |\n| Tamil |\nta |\n| Telugu |\nte |\n| Thai |\nth |\n| Chinese (Taiwan) |\nzh-TW |\n| Turkish |\ntr |\n| Urdu |\nur |\n| Ukrainian |\nuk |\n| Vietnamese |\nvi |\n| Welsh |\ncy |\nExcept as otherwise noted, the content of this page is licensed under the Creative Commons Attribution 4.0 License, and code samples are licensed under the Apache 2.0 License. For details, see the Google Developers Site Policies. Java is a registered trademark of Oracle and/or its affiliates.\nLast updated 2025-08-04 UTC.\n[[[\"Easy to understand\",\"easyToUnderstand\",\"thumb-up\"],[\"Solved my problem\",\"solvedMyProblem\",\"thumb-up\"],[\"Other\",\"otherUp\",\"thumb-up\"]],[[\"Missing the information I need\",\"missingTheInformationINeed\",\"thumb-down\"],[\"Too complicated / too many steps\",\"tooComplicatedTooManySteps\",\"thumb-down\"],[\"Out of date\",\"outOfDate\",\"thumb-down\"],[\"Samples / code issue\",\"samplesCodeIssue\",\"thumb-down\"],[\"Other\",\"otherDown\",\"thumb-down\"]],[\"Last updated 2025-08-04 UTC.\"],[],[],null,[\"The language codes in the table below are supported for the field\\n[`Customer.language`](/workspace/admin/directory/v1/reference/customers#language).\\n\\n| Name | Code |\\n|-----------------------|---------|\\n| Amharic | `am` |\\n| Arabic | `ar` |\\n| Basque | `eu` |\\n| Bengali | `bn` |\\n| English (UK) | `en-GB` |\\n| Portuguese (Brazil) | `pt-BR` |\\n| Bulgarian | `bg` |\\n| Catalan | `ca` |\\n| Cherokee | `chr` |\\n| Croatian | `hr` |\\n| Czech | `cs` |\\n| Danish | `da` |\\n| Dutch | `nl` |\\n| English (US) | `en` |\\n| Estonian | `et` |\\n| Filipino | `fil` |\\n| Finnish | `fi` |\\n| French | `fr` |\\n| German | `de` |\\n| Greek | `el` |\\n| Gujarati | `gu` |\\n| Hebrew | `iw` |\\n| Hindi | `hi` |\\n| Hungarian | `hu` |\\n| Icelandic | `is` |\\n| Indonesian | `id` |\\n| Italian | `it` |\\n| Japanese | `ja` |\\n| Kannada | `kn` |\\n| Korean | `ko` |\\n| Latvian | `lv` |\\n| Lithuanian | `lt` |\\n| Malay | `ms` |\\n| Malayalam | `ml` |\\n| Marathi | `mr` |\\n| Norwegian | `no` |\\n| Polish | `pl` |\\n| Portuguese (Portugal) | `pt-PT` |\\n| Romanian | `ro` |\\n| Russian | `ru` |\\n| Serbian | `sr` |\\n| Chinese (PRC) | `zh-CN` |\\n| Slovak | `sk` |\\n| Slovenian | `sl` |\\n| Spanish | `es` |\\n| Swahili | `sw` |\\n| Swedish | `sv` |\\n| Tamil | `ta` |\\n| Telugu | `te` |\\n| Thai | `th` |\\n| Chinese (Taiwan) | `zh-TW` |\\n| Turkish | `tr` |\\n| Urdu | `ur` |\\n| Ukrainian | `uk` |\\n| Vietnamese | `vi` |\\n| Welsh | `cy` |\"]]"
    },
    {
      "url": "https://www.howtogeek.com/6-excel-quick-tips-you-didnt-know-you-needed/#create-sparklines-to-visualize-trends",
      "text": "Quick Links\nMany people know about the different functions in Excel, but fewer know the cool tricks that will help you save time and visualize data more effectively. In this article, we'll show you five tips you can keep in your armory for the next time you use Microsoft's spreadsheet program.\nSelect Arrays Quickly With a Keyboard Shortcut\nThere's nothing remarkable in knowing the Ctrl+A keyboard shortcut—it's one of the most well-known shortcuts out there. However, a lot can be said about knowing exactly what it does in different circumstances in Excel.\nFirst, select any cell in your spreadsheet. If that cell is independent of any other cell (in other words, it has no data to the left or right, above or below, or isn't part of a formatted table), pressing Ctrl+A will select the whole spreadsheet.\nHowever, if the cell you select is part of a range of data, such as an unformatted column of numbers or a formatted table, pressing Ctrl+A will select that array only. In this example, we selected cell D6, and pressed Ctrl+A.\nThis is useful for formatting only that data range (rather than the whole sheet).\nThen, if you press Ctrl+A again, Excel will select the whole spreadsheet.\nThis is great for formatting the whole sheet at the same time.\nUse this memorable tip to work quickly, as it means you don't have to use your mouse to click and drag to select a range of data.\nAdd Slicers to Filter Data Quickly\nWhen you format data into a table in Excel, you will automatically see the Filter Button at the top of each column, which you can remove or re-add by unchecking or checking \"Filter Button\" in the Table Design tab.\nHowever, an easier way to create filters for your table is by adding Slicers, especially if a particular column is more likely to be filtered than the rest.\nIn our example, we anticipate often filtering the Shop and Total columns, as these are prominent columns in our table, so let's add a Slicer for each.\nWith any cell in the table selected, click \"Insert Slicer\" in the Table Design tab on the ribbon.\nYou can then choose the columns for which you want to add Slicers, and click \"OK.\"\nNow, click and drag to reposition or resize your Slicers, or open the \"Slicer\" tab to see more options. To go one step further (such as removing the Slicer's headings), right-click the relevant Slicer, and click \"Slicer Settings.\"\nBecause the Slicers automatically present their data in order (as opposed to the order as it is presented in your original data set), you can analyze the data in an instant.\nHold Ctrl when selecting elements in your Slicer to display them all at the same time, or press Alt+C to clear all selections in the Slicer.\nCreate Sparklines to Visualize Trends\nYes, you can create highly formatted charts to visualize data in graphic form, but sometimes, you might need something a little less complex that takes up less space in your spreadsheet. This is where Sparklines come into play, and there are three types you can employ in your spreadsheet.\nIn the example below, we have a week's profit and loss data from various stores, and we want to add a visual representation of the trends for each shop in column J.\nFirst, select the cells in column J where you want the trend visualization to appear.\nNow, in the Insert tab on the ribbon, go to the Sparklines group, and click \"Line.\"\nPlace your cursor in the \"Data Range\" field, use your mouse to select the data from the table, and then click \"OK.\"\nYou will then instantly see your numbers presented in the form of a trend line.\nIf the line is too small to analyze comprehensively, simply increase the cell and column sizes, and the Sparkline will automatically fill to their cells' dimensions.\nDepending on the type of data you're looking to visualize, there are two other types of Sparklines to use.\nColumn Sparklines present the data in mini-column charts:\nAnd Profit/Loss Sparklines emphasize positive and negative values:\nOnce you have chosen and created your Sparklines, select any of the affected cells, and use the Sparkline tab on the ribbon to make any formatting or detailing changes you require. Since they were added together, they will all be formatted in the same way at the same time. If, however, you wish for them to be formatted separately, click \"Ungroup\" in the Sparklines tab. In the example below, we ungrouped every other Sparkline to format them alternately.\nMake the Most of Preset Conditional Formatting\nAnother way to instantly visualize and analyze data is to use Excel's preset Conditional Formatting tool. Setting up Conditional Formatting rules can take time and cause issues if they overlap or contradict one another, but using the default formats is much easier.\nSelect the data in your spreadsheet that you want to analyze, and click the \"Conditional Formatting\" drop-down menu in the Home tab on the ribbon. There, click \"Data Bars,\" \"Color Scales,\" or \"Icon Sets,\" and choose a design that works well for your data.\nIn our example, we've chosen an orange Data Bar, as this helps us to compare the totals at a glance. Handily, since there is a negative number in our data, Excel has automatically formatted the Data Bar to emphasize the number differences.\nTo clear Conditional Formatting, select the cells in question, click \"Conditional Formatting\" in the Home tab, and click \"Clear Rules From Selected Cells.\"\nScreenshot Data for Dynamic Use\nThis is a great way to capture cells on one sheet and duplicate them in another location, such as on a dashboard. Then, any changes made to the original data will also be reflected in the duplicated data.\nStart by adding the Camera tool to your Quick Access Toolbar (QAT). Click the down arrow on the right-hand side of any tab on the ribbon to see if your QAT is enabled. If the Hide Quick Access Toolbar option is available, it means that you already have it showing. Likewise, if you see the Show Quick Access Toolbar option, click it to activate your QAT.\nThen, click the QAT down arrow and click \"More Commands.\"\nNow, select \"All Commands\" in the Choose Command From menu, and then scroll to and select Camera, before clicking \"Add\" to add it to your QAT. Then, click \"OK.\"\nYou will now see the Camera icon in your QAT.\nSelect the cells you want to duplicate on another sheet or workbook, and click the newly added Camera icon.\nIf you want to duplicate something that is not attached to cells, such as an image or a chart, select the cells behind and around the item. This will copy the selected cells and everything in front of them as an image.\nThen, go to the location where you want the data copied (we've used Sheet 2 in the example below), and simply click once in the appropriate place (in our case, cell A1).\nExcel treats this as a picture, so you can use the Picture Format tab on the ribbon to present the snapshot exactly as you want it.\nConsider removing the gridlines before capturing the data as a picture, as this will help the image appear tidier in its copied location.\nDespite this being a picture (usually an unchanging element in a file), if you alter your original data, this will reflect instantly in your captured version!\nAnother way to increase your efficiency in Excel is to learn some of its most useful keyboard shortcuts, as they save you from having to switch between using your keyboard and your mouse."
    },
    {
      "url": "https://www.howtogeek.com/708758/how-to-resize-column-and-rows-in-google-sheets/",
      "text": "Quick Links\nSummary\n- Manually resize columns or rows in Google Sheets by dragging the border of the cell with your mouse or trackpad.\n- Automatically resize columns or rows in Google Sheets by double-clicking the border to fit the largest cell's content.\n- Use the column and row resizing tool in Google Sheets to resize to a specific size or automatically to fit the data.\nWhen you open a new Google Sheets spreadsheet, the columns, rows, and individual cells you see will all be a certain size. If you want to see more data in each cell, you'll need to resize them. Here's how.\nManually Resizing a Column or Row in Google Sheets\nOne of the quickest ways to resize a column or row in Google Sheets is to use your mouse or trackpad to resize it manually. This involves dragging the column or row border to a new position, resizing it in the process.\nTo do this, open a Google Sheets spreadsheet containing your data. Below the formula bar, you'll see your column headers, initially ranging from A to Z. Likewise, row headers are seen on the left-hand side, initially ranging from 1 to 100.\nTo resize either a row or column, hover over the column (A, B, etc.) or row (1, 2, etc.) header and move your mouse to the border. Your cursor should turn to an arrowhead, pointing in either direction.\nUsing your mouse or trackpad, drag the border to a new position, releasing it once the border is in place. A blue line will appear as the border is being moved, giving you a visual indication of the size of the new column or row.\nYou can also complete this step for multiple columns or rows at once by first selecting them, then using your mouse or trackpad to resize the border on one of the columns or rows.\nGoogle Sheets will treat the selected cells together, resizing them all to the same size.\nResizing Rows or Columns Automatically in Google Sheets\nIf the cells in your chosen row or column contain too much data, some of the information may be hidden from review (unless you wrap the text first).\nTo quickly resize these columns or rows to display this data without wrapping the cell text, you can use your mouse to resize it to fit. This will display all hidden text, resizing the column or row to match the size of the largest cell containing the most data.\nTo do this, open your spreadsheet and hover over the column (starting with A, B, etc.) or row (starting with 1, 2, etc.) header labels. Move your cursor to hover over the border until the cursor changes to an arrowhead.\nOnce the arrowhead cursor is visible, double-click the border. This will force Google Sheets to resize it automatically to fit the content of the largest cell.\nAs with the manual method above, you can select multiple rows or columns to resize them at once. This will automatically resize each row or column to fit the largest cell's data.\nUsing the Resize Column or Row Tool in Google Sheets\nThe steps above allow you to resize columns and rows using your mouse or trackpad, but these methods don't offer a way to resize them to a set size. To do this, you'll need to use Google Sheets' column and row resizing tool.\nTo start, open your spreadsheet and select the header for your row (starting with 1, 2, etc.) or column (starting with A, B, etc.) to select it. You can also do this for multiple rows and columns at once by selecting them first.\nWith the row or column you wish to resize selected, right-click the header label itself (eg. 1 or A). From the pop-up menu, click the \"Resize The Column\" or \"Resize The Row\" option.\nIn the \"Resize\" box for your row or column, enter a new size (in pixels) in the box provided to resize it. Alternatively, select the \"Fix To Data\" option to automatically resize the column or row to fit the largest cell's data.\nPress \"OK\" to make the change once you're happy with the new sizing.\nOnce confirmed, the column or row will resize to match the size you selected. You can repeat this step for additional rows or columns."
    },
    {
      "url": "https://www.howtogeek.com/how-to-use-the-translate-function-in-excel/",
      "text": "Quick Links\nWho knew that Microsoft Excel could act as a translator? Through Microsoft Translate Services, Excel can translate from one language to another (the TRANSLATE function) and detect another language already in a workbook (the DETECTLANGUAGE function).\nYou will only see these language functions (added in December 2024) if you're using the Excel Windows or Mac desktop app as a Microsoft 365 subscriber, Excel for the web, or the Excel mobile app.\nWhat Are the Syntaxes?\nBefore I show you some examples of each function in action, here are their syntaxes.\nTRANSLATE\nThe TRANSLATE function has three arguments:\n=TRANSLATE(a,b,c)\nwhere\n- a (required) is either the text to translate (embedded in double quotes), or a reference to the cell containing the text to translate.\n- b (optional) is the source language code in double quotes (see the Language Codes section below). If you omit this argument, Excel will try to detect the language automatically. Although this is an optional argument, it's best to include it (if you know the language and its code) to ensure an accurate translation.\n- c (optional) is the target language in double quotes. If you skip this argument, Excel will use your system language as the target language. However, again, try to add a target language code for better translation outcomes.\nIf you don't place the language code within double quotes, Excel will return the #NAME? error.\nDETECTLANGUAGE\nThis function is much more straightforward, requiring only one argument:\n=DETECTLANGUAGE(x)\nwhere\n- x is either the text to detect, embedded within double quotes, or a reference to the cell containing the text to detect.\nLanguage Codes\nHere are some of the language codes from Microsoft's longer list of codes. Remember that all language codes in your formula must be in double quotes.\n|\nCode |\nLanguage |\n|---|---|\n|\n\"en\" |\nEnglish |\n|\n\"es\" |\nSpanish |\n|\n\"fr\" |\nFrench |\n|\n\"de\" |\nGerman |\n|\n\"zh-chs\" |\nMandarin (simplified) |\n|\n\"ru\" |\nRussian |\n|\n\"ar\" |\nArabic |\nExamples of TRANSLATE in Action\nLet me show you the TRANSLATE function using two real-world examples. The first is a basic translation of several cells in Excel, while the second example shows you how to use the TRANSLATE function dynamically with a drop-down list.\nExample 1: Translating Text in Cells\nLet's say you have a vehicle expenses form, and you want to translate the form's title, totals section, and table headers from English into Spanish.\nStarting in cell C2, type:\n=TRANSLATE(A1,\"en\",\"es\")\nand press Enter.\nNow, use the format painter tool to apply the formatting of the English title to the Spanish title. You can also apply a red font to distinguish between the two languages.\nYou're now ready to translate the next section of the form. First, select cell C1, and select and copy (Ctrl+C) the formula in the formula bar.\nNow, select cell B3, paste (Ctrl+V) the copied formula into the formula bar, and change the first argument to reference cell A3, before pressing Enter.\nNow, use the fill handle to apply the same relative formula to cells B4 to B6.\nTo finish this section, copy and paste the formula into cell E3, and use the fill handle again.\nBecause some of the Spanish translations contain more characters than their English counterparts, adjust the font sizes (or, if you prefer, the column widths) so that they fit nicely into their respective cells. Remember to also change the font colors to red for consistency.\nFinally, follow the same process to translate your table headers.\nExample 2: Selecting a Translating Language From a Drop-Down List\nThis survey contains some questions that the respondent needs to fill in. Your aim is to create a drop-down list of languages so that the respondent can choose the language in which they want to see the questions.\nThe first step is to create the list of available languages. Let's say you want to offer Spanish, French, and Arabic as the options. Open Sheet 2 using the tabs at the bottom of your Excel window. Then, type each of those languages into separate rows in column A and their corresponding codes in column B.\nBecause you're going to refer to the cells containing these language codes, rather than type them directly into your formula, you don't need to embed them within double quotes.\nNow, in cell C1, type:\n=TRANSLATE(A1,\"en\",B1)\nPress Enter, and then use the fill handle to populate the remaining rows.\nIt's now time to create the drop-down list in Sheet 1. Select the cell where the drop-down will go, click the \"Data Validation\" drop-down icon in the Data tab, and select \"Data Validation.\"\nSelect \"List\" in the Allow field, and after placing your cursor in the Source field, select the three cells containing the translations of the chosen languages (cells C1 to C3 in Sheet 2).\nWhen you click \"OK,\" you'll see a drop-down list appear at the top of your survey, which, when clicked, displays the words Spanish, French, and Arabic in their respective languages.\nTo prepare your spreadsheet for the final step, select one of the languages from this list.\nYou're now ready to translate your questions into the selected language. In cell B3, type (or copy and paste) the following formula:\n=TRANSLATE(A3,\"en\",XLOOKUP($B$1,Sheet2!$C$1:$C$3,Sheet2!$B$1:$B$3))\nwhere\n- A3 is the cell containing the text you want to translate (the survey question),\n- \"en\" is the source language of that text, and\n- the third argument is an XLOOKUP formula that takes the selected language, looks for that in your table in Sheet 2, and returns the language code.\nNotice how, in the third argument, I have used dollar symbols ($) in each of the references to lock their positions. If you fail to do this, when you apply the formula to other cells, the formula will act relatively, meaning it will not work as you hoped.\nWhen you press Enter, the first question translates into the language you selected from the drop-down list earlier. Then, use the fill handle to apply the formula to the remaining questions in your survey.\nReduce the font size slightly in cells B3 to B7 to account for the fact that some translations may contain more characters than the questions in English.\nFinally, change the language in your drop-down menu to see the translations magically change accordingly!\nAn Example of DETECTLANGUAGE in Action\nIf your spreadsheet contains data in many languages, you might find it useful to use Excel's DETECTLANGUAGE function.\nSuppose you have received this spreadsheet containing three non-English sentences in cells A1 to A3, and you want Excel to identify their languages.\nIn cell B1, type:\n=DETECTLANGUAGE(A1)\nand press Enter. Then, use the fill handle to copy this formula to cells B2 and B3.\nColumn B now contains the language codes for each of these sentences. If you're unsure what these codes represent, you can see the full list on Microsoft's translator language support page.\nAs well as translating in Excel, you can also translate text in a Microsoft Word document. To translate a section of a file, select the relevant text, and click Review > Translate > Translate Selection. This opens the Translator pane, where you can choose a target language. Alternatively, to open a translated copy of a whole document, click Review > Translate > Translate Document."
    },
    {
      "url": "https://developers.google.com/chart/interactive/docs/querylanguage",
      "text": "The Google Visualization API Query Language lets you perform various data manipulations with the query to the data source.\nTable of Contents\nIntroduction\nTypically, visualizations expect data in some specific form. For example, a pie chart may expect data as two columns: a text label and a numeric value. The data within the data source may not exactly match this structure. For example the data source may have more than two columns, or the order of the columns may not match the order expected by the pie chart.\nThe query language provides the ability to send data manipulation and formatting requests to the data source, and ensure that the returned data structure and contents match the expected structure.\nThe syntax of the query language is similar to SQL. Developers familiar with SQL should be able to quickly learn and use this query language. There are many SQL tutorials available on the Web. There are some differences between this query language and SQL which are described in the syntax section.\nNote that data sources are not required to implement the query language, or if they do, to implement all features of the language. Unless you have reason to believe otherwise, you should not depend on a data source to implement all features of this language.\nUsing the Query Language\nYou can attach a query string to a data source request in two ways: by setting the query string from within JavaScript code, or by setting the query string as a parameter in the data source URL. If your request does not include a query string, the default behavior for a data source is to return all rows and columns using its default row/column order and formatting. You can change that by including a query string in your request to a data source.\nSetting the Query from JavaScript\nTo set the query string from within JavaScript code, call the setQuery\nmethod\nof the\ngoogle.visualization.Query\nclass.\nvar query = new google.visualization.Query(DATA_SOURCE_URL); query.setQuery('select dept, sum(salary) group by dept'); query.send(handleQueryResponse);\nSetting the Query in the Data Source URL\nThe query string can be added to the data source URL using the tq\nparameter.\nSetting the query in the URL parameter instead of in JavaScript allows you to\neasily use visualizations written by other developers, and still be able to\ncustomize the query.\nThe query string must be properly encoded as a URL parameter.\nYou can encode a URL using the JavaScript encodeURIComponent\nfunction,\nor you can encode it by hand, using the encoding tool at the end of this section.\nExample:\nConsider the following query string for a Google Spreadsheet. (Note that column IDs in spreadsheets are always letters; the column heading text shown in the published spreadsheet are labels, not IDs. You must use the ID, not the label, in your query string.)\nselect A, sum(B) group by A\nWhen encoded, this query becomes:\nselect%20A%2C%20sum(B)%20group%20by%20A\nAssume that this is the URL of your spreadsheet:\nhttps://docs.google.com/a/google.com/spreadsheets/d/1r8_mfnZAvTFmT02JHi1XgOwn_-sLCR9XgmR8wEQ4uW4\nAdd /gviz/tq?tq=\nYOUR_QUERY_STRING to the spreadsheet URL to get\nyour final query string:\nhttps://docs.google.com/a/google.com/spreadsheets/d/1r8_mfnZAvTFmT02JHi1XgOwn_-sLCR9XgmR8wEQ4uW4/gviz/tq?tq=select%A%2C%20sum(B)%20group%20by%20A\nUse the tool below to encode or decode a query string:\nNote: Accessing private spreadsheet data requires passing explicit authorization credentials using OAuth. See the Google Spreadsheets: Authorization section for more details.\nLanguage Syntax\nOverview\nThe Google Visualization API Query Language syntax is designed to be similar to SQL syntax. However, it is a subset of SQL, with a few features of its own that you'll need to learn. If you're familiar with SQL, it shouldn't be too hard to learn.\nData Tables\nThis document uses the term data table to refer to the result set of a query. A data table is composed of rows and columns. Each column in a data table has the following properties:\n- Identifier (or column ID). Used to reference columns within the query. Note that you should never try to reference a column by label in a query, only by identifier. Tip: Try not to use any IDs that include spaces; spaces are hard to manage and can cause you to make small, but hard to find mistakes, in your coding. Additionally, an ID that includes spaces must be surrounded by back-quotes.\n- Label. A\nstring\nthat is typically displayed to end users. For example as a legend within a pie chart, or a column header in a table. - Data type. Supported data types are\nstring\n,number\n,boolean\n,date\n,datetime\nandtimeofday\n. All values of a column will have a data type that matches the column type, or anull\nvalue. These types are similar, but not identical, to the JavaScript types. described in the Literals section of this page. - Formatting pattern. The data source can define formatting patterns for some or all of its columns. You can override this pattern by including a format clause.\nThroughout this section, all examples of queries refer to the following table. The column headers are the column identifiers.\nnamestring |\ndeptstring |\nlunchTimetimeofday |\nsalary number |\nhireDatedate |\nagenumber |\nisSeniorboolean |\nseniorityStartTimedatetime |\n|---|---|---|---|---|---|---|---|\n| John | Eng | 12:00:00 | 1000 | 2005-03-19 | 35 | true | 2007-12-02 15:56:00 |\n| Dave | Eng | 12:00:00 | 500 | 2006-04-19 | 27 | false | null |\n| Sally | Eng | 13:00:00 | 600 | 2005-10-10 | 30 | false | null |\n| Ben | Sales | 12:00:00 | 400 | 2002-10-10 | 32 | true | 2005-03-09 12:30:00 |\n| Dana | Sales | 12:00:00 | 350 | 2004-09-08 | 25 | false | null |\n| Mike | Marketing | 13:00:00 | 800 | 2005-01-10 | 24 | true | 2007-12-30 14:40:00 |\nLanguage Clauses\nThe syntax of the query language is composed of the following clauses. Each clause starts with one or two keywords. All clauses are optional. Clauses are separated by spaces. The order of the clauses must be as follows:\n| Clause | Usage |\n|---|---|\nselect |\nSelects which columns to return, and in what order. If omitted, all of the table's columns are returned, in their default order. |\nwhere |\nReturns only rows that match a condition. If omitted, all rows are returned. |\ngroup by |\nAggregates values across rows. |\npivot |\nTransforms distinct values in columns into new columns. |\norder by |\nSorts rows by values in columns. |\nlimit |\nLimits the number of returned rows. |\noffset |\nSkips a given number of first rows. |\nlabel |\nSets column labels. |\nformat |\nFormats the values in certain columns using given formatting patterns. |\noptions |\nSets additional options. |\nfrom |\nThe from clause has been eliminated\nfrom the language. |\nSelect\nThe select\nclause is used to specify the columns to return and\ntheir order.\nIf this clause is not specified, or if select *\nis used,\nall of the columns of the data source table are returned, in their original order.\nColumns are referenced by the identifiers (not by labels). For example, in a Google\nSpreadsheet, column identifiers are the one or two character column letter (A, B,\nC, ...).\nItems in a select\nclause can be column identifiers, or the output\nof aggregation\nfunctions, scalar functions, or operators.\nExamples:\nselect *\nselect dept, salary\nselect max(salary)\nIn the following example, back-quotes are used to reference column ids that contain spaces (email address) or that are reserved words (date):\nselect `email address`, name, `date`\nRunning the following query on the example table:\nselect lunchTime, name\nReturns the following response:\n| lunchTime | name |\n|---|---|\n| 12:00:00 | John |\n| 12:00:00 | Dave |\n| 13:00:00 | Sally |\n| 12:00:00 | Ben |\n| 12:00:00 | Dana |\n| 13:00:00 | Mike |\nWhere\nThe where\nclause is used to return only rows that match\na specified condition.\nThe simple comparison operators are <=, <, >, >=, =,\n!=, <>\n. Both comparison operators != <>\nmean\nnot-equal. Strings are compared by lexicographic value. Note that equality\nis indicated by =\n, not ==\nas in most computer languages.\nComparing to null\nis\ndone using is null\nor is not null\n.\nYou can join multiple conditions using the logical operators and\n, or\n,\nand not\n. Parentheses can be used to define explicit precedence.\nThe where clause also supports some more complex string comparison operators.\nThese operators take two strings as arguments; any non-string arguments (for example,\ndates or numbers) will be converted to strings before\ncomparison. String matching is case sensitive (you can use\nupper()\nor lower()\nscalar functions\nto work around that).\ncontains\n- A substring match. wholecontains\npart is true if part is anywhere within whole. Example:where name contains 'John'\nmatches 'John', 'John Adams', 'Long John Silver' but not 'john adams'.starts with\n- A prefix match. valuestarts with\nprefix is true if prefix is at the beginning of value. Examples:where dept starts with 'engineering'\nmatches 'engineering' and 'engineering managers'.where dept starts with 'e'\nmatches 'engineering', 'eng', and 'e'.ends with\n- A suffix match. valueends with\nsuffix is true if suffix is at the end of value. Example:where role ends with 'y'\nmatches 'cowboy', 'boy', and 'y'.matches\n- A (preg) regular expression match. haystackmatches\nneedle is true if the regular expression in needle matches haystack. Examples:where country matches '.*ia'\nmatches India and Nigeria, but not Indiana. Note that this is not a global search, sowhere country matches 'an'\nwill not match 'Canada'.like\n- A text search that supports two wildcards: %, which matches zero or more characters of any kind, and _ (underscore), which matches any one character. This is similar to the SQL LIKE operator. Example:where name like fre%\nmatches 'fre', 'fred', and 'freddy'.\nExamples:\nwhere salary >= 600 where dept != 'Eng' and date '2005-01-21' < hireDate where (dept<>'Eng' and isSenior=true) or (dept='Sales') or seniorityStartTime is null\nRunning the following query on the example table:\nselect name where salary > 700\nReturns the following response:\n| name |\n|---|\n| John |\n| Mike |\nGroup By\nThe group by\nclause is used to aggregate values across rows.\nA single row is created for each distinct combination of values in the\ngroup-by clause.\nThe data is automatically sorted by the grouping\ncolumns, unless otherwise specified by an order by\nclause.\nNote: If you use a group by\nclause, then every\ncolumn listed in the select\nclause must either be listed in the group by\nclause,\nor be wrapped by an aggregation function.\nExamples:\nselect dept, max(salary) group by dept\nRunning the following query on the example table:\nselect lunchTime, avg(salary), count(age) group by isSenior,lunchTime\nReturns the following response:\n| lunchTime | avg-salary | count-age |\n|---|---|---|\n| 12:00:00 | 425 | 2 |\n| 13:00:00 | 600 | 1 |\n| 12:00:00 | 700 | 2 |\n| 13:00:00 | 800 | 1 |\nPivot\nThe pivot\nclause is used to transform distinct values in columns\ninto new columns. For example, a pivot by a column 'year' would produce a\ntable with a column for each distinct year that appears in the original table.\nThis could be useful if, for instance, a line chart visualization draws each\ncolumn as a separate line. If you want to draw a separate line for each year,\nand 'year' is one of the columns of the original table, then a good option\nwould be to use a pivot operation to do the necessary data transformation.\nNote: If you use a pivot\nclause,\nthen every column listed in the select\nclause must either\nbe listed in the group by\nclause, or be wrapped by an aggregation\nfunction\nSince multiple rows may contain the same values for the pivot columns,\npivot implies aggregation. Note that when using pivot\nwithout\nusing group by\n, the result table will contain exactly one row.\nFor instance, running the following query on the\nexample table:\nselect sum(salary) pivot dept\nReturns the following response:\n| Eng sum-salary | Marketing sum-salary | Sales sum-salary |\n|---|---|---|\n| 2100 | 800 | 750 |\nThis is because 2100 is the sum of the salaries for the Eng department, 800 for the Marketing department, etc.\nUsing pivot\ntogether with group by\ncan be even\nmore useful, since it creates a table where each cell contains the result of\nthe aggregation for the relevant row and the relevant column. For example,\nrunning the following query on the\nexample table:\nselect dept, sum(salary) group by dept pivot lunchTime\nReturns the following response:\n| dept | 12:00:00 sum-salary | 13:00:00 sum-salary |\n|---|---|---|\n| Eng | 1500 | 600 |\n| Marketing | null | 800 |\n| Sales | 750 | null |\nYou can also \"invert\" this table, switching columns and rows, by switching\nbetween the pivot\ncolumns and the group by\ncolumns. Running the following query on the\nexample table:\nselect lunchTime, sum(salary) group by lunchTime pivot dept\nReturns the following response:\n| lunchTime | Eng sum-salary | Marketing sum-salary | Sales sum-salary |\n|---|---|---|---|\n| 12:00:00 | 1500 | null | 750 |\n| 13:00:00 | 600 | 800 | null |\nYou can also use more than one column in the pivot\nclause. In\nsuch a case the columns of the response table are composed of all the unique\ncombinations of values in the columns that exist in the original table. For\ninstance, running the following query on the\nexample table:\nselect sum(salary) pivot dept, lunchTime\nReturns the following response:\n| Eng,12:00:00 sum-salary | Eng,13:00:00 sum-salary | Marketing,13:00:00 sum-salary | Sales,12:00:00 sum-salary |\n|---|---|---|---|\n| 1500 | 600 | 800 | 750 |\nNote that only the combinations that appear in the original table are given columns in the response table. This is why there is no column for Marketing,12:00:00 or for Sales,13:00:00.\nUsing more than one aggregation is also possible. For instance, running the following query on the example table:\nselect sum(salary), max(lunchTime) pivot dept\nReturns the following response:\n| Eng sum-salary | Marketing sum-salary | Sales sum-salary | Eng max-lunchTime | Marketing max-lunchTime | Sales max-lunchTime |\n|---|---|---|---|---|---|\n| 2100 | 800 | 750 | 13:00:00 | 13:00:00 | 12:00:00 |\nYou can combine multiple aggregations in the select\nclause,\nmultiple columns in the group by\nclause and multiple columns in\nthe pivot\nclause. Internally, aggregation is performed by the\nconcatenation of the columns in the group by and pivot clauses.\nColumns specified in the pivot\nclause may not appear in the\nselect\n, group by\nor order by\nclauses.\nWhen pivot\nis used, the order by\nclause cannot\ncontain any aggregation columns. The reason for that is that for each\naggregation specified in the select\nclause, many columns are\ngenerated in the result table. However, you can format aggregation\ncolumns when pivot\nis used. The result of such a format is that\nall of the new columns relevant to the specific aggregation, that are\ngenerated by the pivot operation, are formatted by the specified pattern. In\nthe example above, adding format sum(salary) \"some_format_string\"\nwill affect the following columns: Eng sum-salary, Marketing sum-salary and\nSales sum-salary.\nYou can label aggregation columns. If no label is specified in the\nlabel\nclause, the label of a column that is produced as a result\nof pivoting is composed of the list of values in the pivot columns, the\naggregation type (min, max, sum, ...) and the aggregated column's label.\nFor example \"Eng,12:00:00 sum Salary\". If only one aggregation was specified\nin the select\nclause then the aggregation part is removed from\nthe label, and only the list of values in the pivot columns is kept. For\nexample \"Eng,12:00:00\". When a label\nclause specifies a label for\nan aggregation column, then the label requested is appended to the list of\nvalues, both when there is only one aggregation in the select\nclause, and when there is more than one. For example,\nlabel sum(salary) \"sumsal\"\nwill result in the column labels\n\"Eng,12:00:00 sumsal\", \"Eng,13:00:00 sumsal\", etc.\nOrder By\nThe order by\nclause is used to sort the rows by the values\nin specified columns.\nItems in an order by\nclause can be column identifiers, or the output\nof aggregation\nfunctions, scalar functions, or operators.\nExamples:\norder by dept, salary desc\nselect dept, max(salary) group by dept order by max(salary)\nLimit\nThe limit\nclause is used to limit the number of returned rows.\nExample:\nlimit 100\nOffset\nThe offset\nclause is used to skip a given number of first rows.\nIf a limit\nclause\nis used, offset\nis applied first: for example, limit 15 offset\n30\nreturns\nrows 31 through 45.\nExamples:\noffset 10 limit 30 offset 210\nLabel\nThe label\nclause is used to set the label for one or more columns.\nNote that you cannot use a label value in place of an ID in a query.\nItems in a label\nclause can be column identifiers, or the output\nof aggregation functions, scalar\nfunctions, or operators.\nSyntax:\nlabel column_id label_string [,column_id label_string]\ncolumn_id\n- The identifier of the column being assigned the label.\nlabel_string\n- The label to assign to that column. Many visualizations use the column label as text to display to the end-user, such as a legend label in a pie chart. Labels are string literals, and follow those syntax rules.\nExample:\nThe following example sets the label for the dept column to \"Department\", the label for the name column to \"Employee Name\", and the label for the location column to \"Employee Location\":\nlabel dept 'Department', name \"Employee Name\", location 'Employee Location'\nFormat\nThe format\nclause is used to specify a formatted value for cells in\none or more columns. The returned data should include both an actual value and a\nformatted value for each cell in a formatted column. Many visualizations use the\nunformatted value for calculations, but the formatted value for display. The patterns\nthat you specify in this clause are usually returned in the\npattern property\nof the corresponding columns.\nPattern Syntax:\nnumber\n,date\n,timeofday\n,datetime\n- The date and number patterns defined by the ICU.\n-\nboolean\n- Pattern is a\nstring\nin the format 'value-if-true:value-if-false'.\nExample:\nformat salary '#,##0.00', hireDate 'dd-MMM-yyyy', isSenior 'Yes!:Not yet'\nOptions\nThe options\nclause is used to control additional options\nfor query execution. Possible keywords that can follow the\noptions\nclause are:\n-\nno_format\nRemoves formatted values from the result, and leaves only the underlying values. Can be used when the specific visualization does not use the formatted values to reduce the size of the response. -\nno_values\nRemoves underlying values from the result, and leaves only the formatted values. Can be used when the specific visualization uses only the formatted values to reduce the size of the response.\nData Manipulation Functions\nThere are several kinds of operators and functions that let you manipulate or aggregate data in a single column, or compare or combine data across columns. Examples include sum() (to add all values in a column), max (to find the largest value in a column), and + (to add the values of two columns together in the same row).\nSome functions can appear in any clause; some can appear in a subset of clauses. This is documented below.\nExample:\n| Given this table... | If we apply this query... | We get this result. | ||||||||||||||||||||||||\n|\nselect upper(name), year(startDate) |\n|\nThe following data manipulation functions are defined by the Google Visualization API query language:\nAggregation Functions\nAggregation functions are passed a single column identifier,\nand perform an action across all values in each group (groups are specified by\ngroup by\nor\npivot\nclauses, or all rows if those clauses\nare not used).\nExamples:\nselect max(salary) // Returns a table with one column and one row. select max(salary) group by dept // Returns a table with the max salary for each dept column value. select max(salary) pivot dept // Returns a one-row table with a column for each dept, // and the max salary for that department.\nAggregation functions can be used in\nselect\n, order by\n, label\n, format\nclauses.\nThey cannot appear in where\n, group by\n, pivot\n,\nlimit\n, offset\n, or options\nclauses.\nHere are the supported aggregation functions:\n| Name | Description | Supported Column Types | Return Type |\n|---|---|---|---|\navg() |\nReturns the average value of all values in the column for a group. | number |\nnumber |\ncount() |\nReturns the count of elements in the specified column for a group. Null cells are not counted. | Any type | number |\nmax() |\nReturns the maximum value in the column for a group. Dates are compared with\nearlier being smaller, string s are compared alphabetically, with case-sensitivity. |\nAny type | Same type as column |\nmin() |\nReturns the minimum value in the column for a group. Dates are compared with\nearlier being smaller, string s are compared alphabetically, with case-sensitivity |\nAny type | Same type as column |\nsum() |\nReturns the sum of all values in the column for a group. | number |\nnumber |\nNote: Aggregation functions can only take a column identifier as an argument:\nmax(startDate) // OK min(firstScore) + min(secondScore) // OK max(year(startDate)) // INVALID. max requires column ID sum(salary + perks) // INVALID. sum requires column ID.\nScalar Functions\nScalar functions operate over zero or more parameters to produce another value. Scalar functions can be passed any expression that evaluates to the parameter of the appropriate type. Note that these types are the types defined in the Literals section of this document, which might be slightly different than the similarly named JavaScript objects.\nNote that the column name will be changed by wrapping it with a scalar function.\nScalar functions can take as a parameter anything that evaluates to a single value:\nyear(max(startDate)) datediff(now(), todate(1234567890000))\nScalar functions can be used in any of the following clauses: select\n,\nwhere\n, group by\n, pivot\n,\norder by\n, label,\nand\nformat\n.\n| Name | |\n|---|---|\nyear() |\nReturns the year value from a date or datetime value. For example:\nParameters: One parameter of type\ndate or datetime Return Type:\nnumber |\nmonth() |\nReturns the zero-based month value from a date or datetime value. For example:\nParameters: One parameter of type\ndate or datetime Return Type:\nnumber |\nday() |\nReturns the day of the month from a Parameters: One parameter of type\ndate or datetime Return Type:\nnumber |\nhour() |\nReturns the hour value from a datetime or Parameters: One parameter of type\ndatetime or timeofday Return Type:\nnumber |\nminute() |\nReturns the minute value from a Parameters: One parameter of type\ndatetime or timeofday Return Type:\nnumber |\nsecond() |\nReturns the second value from a Parameters: One parameter of type\ndatetime or timeofday Return Type:\nnumber |\nmillisecond() |\nReturns the millisecond part of a Parameters: One parameter of type\ndatetime or timeofday Return Type:\nnumber |\nquarter() |\nReturns the quarter from a Parameters: One parameter of type\ndate or datetime Return Type:\nnumber |\ndayOfWeek() |\nReturns the day of week from a Parameters: One parameter of type\ndate or datetime Return Type:\nnumber |\nnow() |\nReturns a datetime value representing the current Parameters: None\nReturn Type:\ndatetime |\ndateDiff() |\nReturns the difference in days between two Parameters: Two parameters of type\ndate or datetime (can be one of each)Return Type:\nnumber |\ntoDate() |\nTransforms the given value to a\nParameters: One parameter of type\ndate , datetime , or number Return Type:\ndate |\nupper() |\nReturns the given Parameters: One parameter of type\nstring Return Type:\nstring |\nlower() |\nReturns the given Parameters: One parameter of type\nstring Return Type:\nstring |\nArithmetic Operators\nYou can use arithmetic operators to perform mathematic operations upon anything that evaluates to single number (that is, the output of appropriate aggregate functions, operators, or constants).\nExamples:\nselect empSalary - empTax select 2 * (max(empSalary) / max(empTax))\nThe following operators are defined:\n| Name | Description | Parameters | Return Type |\n|---|---|---|---|\n+ |\nReturns the sum of two number values. |\nTwo number s |\nnumber |\n- |\nReturns the difference between two number values. |\nTwo number s |\nnumber |\n* |\nReturns the product of two number s. |\nTwo number s |\nnumber |\n/ |\nReturns the quotient of two number s. Division by zero returns null. |\nTwo number s |\nnumber |\nLanguage Elements\nLiterals\nLiterals are values used for comparisons or assignments. Literals can be string\ns,\nnumbers, boolean values, or various date/time types. Here are some examples\nof literals used in query syntax:\nwhere startDate < date \"2008-03-18\" // date \"2008-03-18\" is a date literal\nlimit 30 // 30 is a numeric literal\nformat salary '#,##0.00', isSenior 'not yet:of course!' // '#,##0.00' and 'not yet:of course!' are both string\nliterals\nHere are the formats for each type of literal:\nstring\nA\nstring\nliteral should be enclosed in either single or double quotes. Examples:\"fourteen\" 'hello world' \"It's raining\"\n.-\nnumber\n- Numeric literals are specified in decimal notation.\nExamples:\n3 3.0 3.14 -71 -7.2 .6\n-\nboolean\n- Boolean literals are either\ntrue\norfalse\n. -\ndate\n- Use the keyword\ndate\nfollowed by astring\nliteral in the formatyyyy-MM-dd\n. Example:date \"2008-03-18\"\n. -\ntimeofday\n- Use the keyword\ntimeofday\nfollowed by astring\nliteral in the formatHH:mm:ss[.SSS]\nExample:timeofday \"12:30:45\"\n. -\ndatetime\n- A date and a time, using either the keyword\ndatetime\nor the keywordtimestamp\nfollowed by astring\nliteral in the formatyyyy-MM-dd HH:mm:ss[.sss]\n. Example:datetime '2008-03-18 12:30:34.123'\nIdentifiers\nIdentifiers (or IDs) are text string\ns that identify columns.\nImportant: If your identifier\n- Has spaces,\n- Is a reserved word,\n- Contains anything but alphanumeric characters or underscores ([a-zA-Z0-9_]), or\n- Starts with a digit\nit must be surrounded by back-quotes (not single quotes).\nOtherwise, your identifier does not need to be quoted. (Note that not all keywords defined by the syntax are reserved words; so, for example, you can use \"max\" as an identifier, without having to back-quote it.)\nExamples: col1 employee_table `start\ndate` `7 days traffic` `select`\nWe recommend against choosing an identifier that requires back-quotes, because it can be easy to forget to use the back-quotes, or to accidentally use 'single quotes' instead of `back-quotes`. These are common mistakes, and often hard to debug.\nCase Sensitivity\nIdentifiers and string literals are case-sensitive. All other language elements are case-insensitive.\nReserved Words\nThe following reserved words must be back-quoted if used as an identifier:\nand asc by date datetime desc false format group label limit not offset options or order pivot select timeofday timestamp true where"
    },
    {
      "url": "http://www.howtogeek.com/412296/how-to-use-google-translate-directly-in-google-sheets/",
      "text": "Quick Links\nGoogle Translate lets you translate words or phrases from one language to another, but did you know that there’s a formula you can use to translate a batch of words directly in Google Sheets? Here’s how to do it.\nTranslating Text in Google Sheets\nIntegrating Google Translate with Google Sheets was a good call. Now you no longer have to switch back and forth between tabs to translate text. Translating text in Sheets is as simple as inputting a formula. Here’s the structure of the formula:\n=GOOGLETRANSLATE(“text”, “source language”, “target language”)\nWhen entering the text to be translated, you can either type the actual word in the formula itself, or you can input a cell containing the word to be translated.\nIn this example, we want to translate the English words in column A (which we've named \"English\") into their Chinese equivalents in column B (which we've named \"Chinese\"). Since we have the words already in the sheet, we can just call the cells that contain them. Here, we're calling cell A2, which contains the word “Cake.\"\nNote: If you input the text directly in the formula, you must include quotation marks around the word. If you enter the cell in which the word is residing, you must leave off the quotation marks.\nNext in our formula comes the source language. When entering the source language, you need to enter the two-letter language code. If you’re unsure of what the source language is, you can enter in “auto” and Google will auto-detect the language. We know “cake” is an English word, so we’ll use “en” here. Note that you must include the quotation marks around the two-letter language code.\nFinally, we need to input our target language in the same way. Here, we're using \"zh\"---the two-letter code for Chinese.\nOnce you’re finished, press Enter and watch the magic happen.\nIf you have a list of words in column A that you’d like to translate, all you need to do is select the cell that contains the formula we just entered, click and grab the bottom-right corner, and drag to the desired row.\nAs with any translation software out there, this is not always 100% accurate. For less complicated vocabulary though, this should be a reasonably reliable solution."
    },
    {
      "url": "https://www.howtogeek.com/google-sheets-tables-dont-use-start-today/",
      "text": "Quick Links\nTables are a fundamental part of any Google Sheets spreadsheet. They help you visualize your data, make filtering and sorting simple, ensure consistency, and can be referenced in formulas to aid accuracy and save time.\nThe 3 Ways to Create a Table in Google Sheets\nWhether you're starting with a blank canvas or already have some data in your Google Sheets spreadsheet, creating tables is straightforward.\nTurning Blank Cells Into a Table\nTo create a table from scratch in Google Sheets, select two or more adjacent cells, and in the Format tab, click \"Convert To Table.\"\nAs you can see in the screenshot below, if the range you select includes cells in row 1, Google Sheets automatically adds a gray banner across the top of the spreadsheet where the table name and other options sit. Then, default column headers are placed in row 1, and you can click these to replace them with more suitable labels.\nThe banner and column headers are frozen, meaning they remain in view if you scroll down.\nTurning Existing Data into a Table\nIf you already have a dataset in your Google Sheets file that you want to format as a structured table, first, make sure each column has an appropriate header. Then, select any cell in the range, and in the Format tab, click \"Convert To Table.\"\nOnce the table is created, click the down arrow in any of the column headers to apply filters or sort your data.\nUsing Pre-Built Google Sheets Tables\nA final way to create a table in Google Sheets is to use one of the program's pre-made templates.\nType @Tables into any cell, and press Enter.\nNow, in the Tables pane on the right, click the arrow next to the relevant table category, and hover over any of the table types to see a preview. Once you've settled on a table that suits your needs, click \"Insert.\"\nIf the active spreadsheet already contains some data, the new table is inserted on a new tab. On the other hand, if the active worksheet is blank, the table is added there.\nNaming Tables\nNow that you've created your table, one of the first things you should do is to name it. This makes it easier for collaborators to understand at a glance what the table contains, and descriptive table names are easier to read than direct cell references when used in formulas (we'll come to this later).\nTo name a table, click the placeholder name in the contextual tab above the first column, and type the new name.\nAlthough you're free to type pretty much whatever you want, there are a few restrictions. Table names can't:\n- Be \"TRUE\" or \"FALSE,\"\n- Be the same as an existing table name or cell reference,\n- Start with a number,\n- Contain more than 255 characters,\n- Contain special characters (other than underscores), or\n- Contain spaces (these are changed to underscores by default).\nAside from the above rules, as long as your table name is short yet descriptive, you can't go wrong.\nTo jump to any table in a Google Sheets file, regardless of its location, click the down arrow in the name box to the left of the formula bar.\nSelecting Column Types\nOnce you've created and named your table and inserted appropriate column headers, it's time to tell Google Sheets what type of data will go in each column. Taking this step helps the software check that you're entering the correct types of data into each cell in the table, thereby ensuring data consistency.\nIn this example, the Shop column contains a whole number, the Manager column contains text, the Revenue columns contain monetary values, and the Trend value should be a percentage.\nSo, to correct these, click the down arrows in the column headers, hover over \"Edit Column Type,\" and select the appropriate format.\nNotice how data types that require a symbol—like percentages and currencies—are updated automatically, and icons are added to the column header to indicate the types of data each column should contain.\nWhat's more, if you enter a value into a cell in this column that doesn't appear to align with the assigned data type, Google Sheets alerts you by adding a red tag to the cell. When you hover over that cell, you're told that the value doesn't match the column type.\nHere are the column type options:\n|\nColumn Type |\nDetails |\n|---|---|\n|\nNumber > Number |\nEnter any integer or decimal. |\n|\nNumber > Percent |\nWhen you enter a number, the % symbol is added automatically. |\n|\nNumber > Currency |\nTo change the currency, select all the cells in the column, and click Format > Number > Custom Currency. |\n|\nText |\nEnter any text. |\n|\nDate > Date |\nDouble-click a cell in a Date column to bring up a calendar, where you can select a date. |\n|\nDate > Date Time |\nDouble-click a cell in a Date column to bring up a calendar, where you can select a date. Then, override the placeholder time with the correct one. |\n|\nDate > Time |\nEnter a time using the HH:MM:SS format. |\n|\nDrop-down |\nWhen you select this column type, the data validation sidebar appears where you can define the drop-down options. |\n|\nCheckbox |\nThis inserts a checkbox into each cell in the column. You can either check and uncheck these manually or add a Boolean formula to make them work automatically. |\n|\nSmart chips > People |\nThe people smart chip lets you insert the name of a person in your organization or someone with whom you've been in email contact. Then, click the name to reveal more details. |\n|\nSmart chips > File |\nThe file smart chip lets you add a link to a local Google file. |\n|\nSmart chips > Finance |\nThe finance smart chip lets you enter the name of a financial organization. Then, click the name of the firm to reveal the latest market trends. |\n|\nSmart chips > Place |\nThe place smart chip links to Google Maps, meaning you can type the name of any location worldwide. Then, click the place to see a link to Google Maps. |\n|\nSmart chips > Rating |\nThe rating smart chip turns a number from 1 to 5 into a star rating. |\n|\nNone |\nChoose this option to leave the column open to any data type. |\nClick \"Show Placeholders\" at the bottom of the Edit Column Type list to make clear what data type should be entered into each cell.\nAdding and Removing Columns and Rows\nAs soon as you add data or a column header to a blank column to the right of an existing table, Google Sheets expands the table formatting to capture the added information. The same applies to any data you add to the first blank row at the bottom.\nTo insert a new column to the left of an existing column or a new row above an existing row, right-click a cell in the relevant column or row, and click \"Insert 1 Table Column Left\" or \"Insert 1 Table Row Above.\"\nTo delete a column or row, right-click any cell in the relevant column or row, and select \"Delete Table Column\" or \"Delete Table Row.\"\nFormatting Tables\nTo change the appearance of a table in Google Sheets, click any cell in the table, and in the Format tab on the ribbon, click \"Table Formatting.\"\nThis brings up the Table Formatting pane on the right of your screen. There, you can (1) choose a different table style, (2) create a custom style with different color headers and rows, and (3) activate several other properties in the Options section.\nCheck \"Show Table Footer\" in the Table Formatting pane to add a total row to the bottom of your table.\nReferencing Tables and Columns in Formulas\nWhile direct references in Google Sheets link one cell to another using the column and row header labels, table references link a cell to a table and column name.\nThis One Keyboard Shortcut in Google Sheets Will Change How You Edit Formulas\nChange a reference type in an instant.\nTable references can be used in non-tabular cells or within tables themselves.\nFor example, typing:\n=SUM(Shop_Details[Revenue 2024])\ninto a blank cell and pressing Enter adds all the values in the Revenue 2024 column of the Shop_Details table.\nRather than typing the table and column reference manually, use your mouse to select the whole column, and Google Sheets will insert the reference for you.\nOn the other hand, typing:\n=SUM(Shop_Details[Revenue 2023]+Shop_Details[Revenue 2024])\ninto the first cell of the Total Revenue column and pressing Enter sums the values in the two revenue columns of the Shop_Details table. What's more, since Google Sheets recognizes that you're likely to want the same formula to be applied to the remaining cells in the column, it offers to autofill it for you.\nIn both the above scenarios, if data is added to or removed from the referenced columns, the formula will adapt to these changes.\nIf you need to apply a single formula to a whole column, embed the formula within the ARRAYFORMULA function. For example, typing:\n=ARRAYFORMULA(SUM(Shop_Details[Total Revenue])/24)\ninto a blank cell divides the sum of all the values in the Total Revenue column of the Shop_Details table by 24 to produce a monthly average over the two years.\nIf the table or column names change, any formulas in the same file that reference them will update automatically.\nYou can also use table and column references with the IMPORTRANGE function to import data from one Google Sheets file to another. For example, typing:\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"Shop_Details[[#All],[Total Revenue]]\")\nand pressing Enter imports the header and data of the Total Revenue column of the Shop_Details table:\n- The first argument is the URL of the file containing the table, enclosed in quotation marks.\n- The second argument, also in quotation marks, references the Total Revenue column of the Shop_Details table, with [#ALL] telling Google Sheets to also include the column header and total row in the import.\nHow to Use the IMPORTRANGE Function to Import Data From One Google Sheets File Into Another\nThis powerful function makes duplicating data simple.\nYou can also nest the IMPORTRANGE function within another function. Here, typing:\n=SUM(IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"Shop_Details[Total Revenue]\"))\nand pressing Enter sums all the values in the Total Revenue column of the Shop_Details table in the linked sheet.\nIf the table or column names referenced in the IMPORTRANGE formula change, you will need to adjust the second argument in the formula accordingly.\nPro Tip: Grouping by a Table Column\nIf items in a table column are repeated, you can group all the values with each item in common.\nIn this example, let's say you want to aggregate the total sales made by each employee, Laura, Dave, Mike, and Tom.\nTo do this, click the down arrow in the Employee column, and select \"Group By Column.\"\nNow, the sales linked to each individual are temporarily grouped together, and you can click any of the down arrows to choose how the data is aggregated in each column.\nYou can either save this aggregated presentation of your table by clicking \"Save View\" in the top-right corner of the Google Sheets window, or disregard it by clicking \"X.\"\nIf you save the view, you can reactivate it anytime by hovering over \"Change View\" in the Data tab on the ribbon, and selecting the view you saved.\nAs well as formatted tables, there are many other fundamental Google Sheets features you should get to know if you're new to the program. For example, you can translate words directly in your spreadsheet, automate tedious tasks with macros, and easily remove duplicate values."
    },
    {
      "url": "https://www.howtogeek.com/450465/how-to-use-the-query-function-in-google-sheets/",
      "text": "Quick Links\nIf you need to manipulate data in Google Sheets, the QUERY function can help! It brings powerful, database-style searching to your spreadsheet, so you can look up and filter your data in any format you like. We'll walk you through how to use it.\nUsing the QUERY Function\nThe QUERY function isn't too difficult to master if you've ever interacted with a database using SQL. The format of a typical QUERY function is similar to SQL and brings the power of database searches to Google Sheets.\nThe format of a formula that uses the QUERY function is\n=QUERY(data, query, headers)\n. You replace \"data\" with your cell range (for example, \"A2:D12\" or \"A:D\"), and \"query\" with your search query.\nThe optional \"headers\" argument sets the number of header rows to include at the top of your data range. If you have a header that spreads over two cells, like \"First\" in A1 and \"Name\" in A2, this would specify that QUERY use the contents of the first two rows as the combined header.\nIn the example below, a sheet (called \"Staff List\") of a Google Sheets spreadsheet includes a list of employees. It includes their names, employee ID numbers, birth dates, and whether they've attended their mandatory employee training session.\nOn a second sheet, you can use a QUERY formula to pull a list of all of employees who haven't attended the mandatory training session. This list will include employee ID numbers, first names, last names, and whether they attended the training session.\nTo do this with the data shown above, you could type\n=QUERY('Staff List'!A2:E12, \"SELECT A, B, C, E WHERE E = 'No'\")\n. This queries the data from range A2 to E12 on the \"Staff List\" sheet.\nLike a typical SQL query, the QUERY function selects the columns to display (SELECT) and identifies the parameters for the search (WHERE). It returns columns A, B, C, and E, providing a list of all matching rows in which the value in column E (\"Attended Training\") is a text string containing \"No.\"\nAs shown above, four employees from the initial list haven't attended a training session. The QUERY function provided this info, as well as matching columns to show their names and employee ID numbers in a separate list.\nThis example uses a very specific range of data. You could change this to query all the data in columns A to E. This would allow you to continue to add new employees to the list. The QUERY formula you used will also update automatically whenever you add new employees or when someone attends the training session.\nThe correct formula for this is\n=QUERY('Staff List'!A2:E, \"Select A, B, C, E WHERE E = 'No'\")\n. This formula ignores the initial \"Employees\" title in cell A1.\nIf you add an 11th employee who hasn't attended the training to the initial list, as shown below (Christine Smith), the QUERY formula updates, as well, and displays the new employee.\nAdvanced QUERY Formulas\nThe QUERY function is versatile. It allows you to use other logical operations (like AND and OR) or Google functions (like COUNT) as part of your search. You can also use comparison operators (greater than, less than, and so on) to find values between two figures.\nUsing Comparison Operators with QUERY\nYou can use QUERY with comparison operators (like less than, greater than, or equal to) to narrow down and filter data. To do this, we'll add an additional column (F) to our \"Staff List\" sheet with the number of awards each employee has won.\nUsing QUERY, we can search for all employees who have won at least one award. The format for this formula is\n=QUERY('Staff List'!A2:F12, \"SELECT A, B, C, D, E, F WHERE F > 0\")\n.\nThis uses a greater than comparison operator (>) to search for values above zero in column F.\nThe example above shows the QUERY function returned a list of eight employees who have won one or more awards. Out of 11 total employees, three have never won an award.\nUsing AND and OR with QUERY\nNested logical operator functions like AND and OR work well within a larger QUERY formula to add multiple search criteria to your formula.\nA good way to test AND is to search for data between two dates. If we use our employee list example, we could list all employees born from 1980 to 1989.\nThis also takes advantage of comparison operators, like greater than or equal to (>=) and less than or equal to (<=).\nThe format for this formula is\n=QUERY('Staff List'!A2:E12, \"SELECT A, B, C, D, E WHERE D >= DATE '1980-1-1' and D <= DATE '1989-12-31'\")\n. This also uses an additional nested DATE function to parse date timestamps correctly, and looks for all birthdays between and equal to January 1, 1980, and December 31, 1989.\nAs shown above, three employees who were born in 1980, 1986, and 1983 meet these requirements.\nYou can also use OR to produce similar results. If we use the same data, but switch the dates and use OR, we can exclude all employees who were born in the 1980s.\nThe format for this formula would be\n=QUERY('Staff List'!A2:E12, \"SELECT A, B, C, D, E WHERE D >= DATE '1989-12-31' or D <= DATE '1980-1-1'\")\n.\nOf the original 10 employees, three were born in the 1980s. The example above shows the remaining seven, who were all born before or after the dates we excluded.\nUsing COUNT with QUERY\nRather than simply searching for and returning data, you can also mix QUERY with other functions, like COUNT, to manipulate data. Let's say we want to clear a number of all the employees on our list who have and haven't attended the mandatory training session.\nTo do this, you can combine QUERY with COUNT like this\n=QUERY('Staff List'!A2:E12, \"SELECT E, COUNT(E) group by E\")\n.\nFocusing on column E (\"Attended Training\"), the QUERY function used COUNT to count the number of times each type of value (a \"Yes\" or a \"No\" text string) was found. From our list, six employees have completed the training, and four haven't.\nYou can easily change this formula and use it with other types of Google functions, like SUM."
    },
    {
      "url": "https://www.howtogeek.com/727905/how-to-rename-columns-or-rows-in-google-sheets/",
      "text": "Quick Links\nIf you're creating a Google Sheets spreadsheet for others to use, you can make it easier to refer to certain sections of data by renaming columns or rows using named ranges. Here's how.\nWhat Are Named Ranges?\nNamed ranges allow you to add a custom name to a group of cells, from entire columns or rows to smaller groups of cells. Creating a named range doesn't overwrite the original cell references (A1, A2, etc.), but it does make it easier to refer to these cells (and the data contained within them) when you're adding new formulas.\nUsing the Name Box\nThe quickest way to add a named range to Google Sheets is to use the name box. This is the box, positioned to the left of the formula bar, that shows you the cell reference for the cell or cells that are currently selected in your spreadsheet.\nTo begin, open your Google Sheets spreadsheet and select a new column or row. With the row or column selected, replace the existing cell reference in the name box with a new name, and then press the Enter key to save your choice.\nGoogle Sheets will apply the new name to your column or row immediately. You can view a list of existing named ranges by pressing the downward-facing arrow button positioned to the right of the name box.\nA list of named ranges, including their original cell references, will appear in the list below.\nYou can click on any of the named ranges to select those cells or press \"Manage Named Ranges\" to make changes to existing named ranges.\nUsing the Named Ranges Menu\nAnother way to rename columns or rows is to use the named ranges menu. This menu allows you to manage existing named ranges as well as create new ones.\nAdding a New Named Range in Google Sheets\nTo begin, open Google Sheets and select the row or column that you wish to rename. With the column or row selected, right-click the selected cells and select \"Define The Named Range\" in the context menu.\nThe \"Named Ranges\" menu will open as a panel on the right. Type your chosen name in the box provided. You can also change the selected column, row, or smaller cell range by changing the cell reference below it.\nPress \"Done\" to save your choice.\nEditing or Removing Named Ranges\nTo edit or remove a named range, right-click any cell in the spreadsheet and select \"Define Named Range\" in the menu. You'll see a list of existing named ranges in a sidebar on the right side of the window. Hover over the name in the \"Named Ranges\" panel and press the \"Edit\" button.\nYou can then make changes to the named range (including changing the name and the cell range that it refers to) using the boxes provided. If you want to delete the named range, press the \"Delete\" button.\nYou'll need to confirm your choice---press \"Remove\" in the pop-up box to confirm.\nUsing a Named Range in Google Sheets\nWith the new named range added, you can now refer to it elsewhere in a new formula. For instance, if you named your range \"CellData,\" you could find the median value of the values in those cells by using the following formula:\n=MEDIAN(CellData)\nThe named range (CellData) replaces the original cell reference to the column, row, or cell range in your formula. For instance, if CellData is a named range for all of the cells in column A, you could use either A:A or CellData to refer to those cells.\nUsing a named range allows you to quickly refer to the data that you wish to use without requiring the original cell reference. It's just one more way to use the power of Google Sheets to make things easier while you work."
    },
    {
      "url": "https://www.howtogeek.com/microsoft-excel-power-query-commands-need-to-know/",
      "text": "Quick Links\nHave you heard of Power Query in Microsoft Excel but always thought that it's only intended for Excel experts? Let me stop you there because, actually, Power Query is designed to be user-friendly and, most importantly, save you a lot of hassle when organizing your data.\nThis guide is intended for readers who are new to Microsoft Excel or Power Query. The tips don't require you to know or use any Power Query M formula language, and they offer a good starting point for getting to know some of the commands you can use in this powerful data manipulation tool.\n1 Split Cells by Delimiter to Isolate Values\nThere are many ways in Excel to split data into more than one column, including the Text To Columns tool, Flash Fill, and built-in functions. However, the most intuitive method is to launch the Power Query Editor, and perform the operation there.\nLet's imagine that you've found a table on Wikipedia that you want to transform using Power Query. To import the table, first, you clicked \"Get Data\" on the Home tab on the ribbon, and then selected From Other Sources > From Web.\nHow to Import Tables From the Web to Excel 365\nDon't waste time or risk errors by copying data manually.\nNext, after pasting the URL into the text field in the From Web dialog box and clicking \"OK,\" you selected the table in the Navigator's left-hand pane, and clicked \"Transform Data.\"\nWhen the table loaded in the Power Query Editor, you noticed that the Career Span column contains two pieces of data—the year each player started their career, and the last year in which they played—and you want these to be in separate columns.\nTo do this, right-click the column header, hover over \"Split Column,\" and select \"By Delimiter.\"\nA delimiter is a character, symbol, or space that is used to separate items in a sequence.\nAt this point, the Power Query Editor reviews the data in the column to see whether it can detect a potential delimiter. In this case, it's identified that each cell contains a dash, and correctly assumes that this is the point at which the cell should be split. However, you can select a different delimiter from the first drop-down menu if necessary.\nSince there's only one delimiter in each cell of the selected column in this example, there's no need to make any further changes to the options in the dialog box, so click \"OK,\" and see the newly transformed data in the Power Query Editor.\nTo rename the new columns, double-click the column headers, and type the new data labels.\nNow, you've successfully split the data using the Power Query Editor, but did you notice that the cells in the two new columns are aligned differently? This is because the values in the \"First played\" column are all numbers (as indicated by the 123 icon next to the column header), but since the values in the \"Last played\" column include both text and numbers, Excel treats this as a text column (hence the ABC in the column header).\nExcel's 12 Number Format Options and How They Affect Your Data\nAdjust your cells' number formats to match their data type.\nTo fix this, select the \"ABC\" icon in the \"Last played\" column, and click \"Whole Number.\"\nNow, both columns are formatted as numerical datasets.\nHowever, because some cells in the \"Last played\" column contained text values, these now show as errors. But don't fret—continue reading to find out how to fix this!\n2 Replace Errors for Use in Calculations\nExcel's Power Query is a powerful tool for dealing with any errors that appear in your data.\nTaking the query in the previous example, some cells in the \"Last played\" column contain errors, because they previously contained the text value \"Present\" in a column formatted as whole numbers.\nAt present, if you click \"Close And Load\" in the top-left corner of the Power Query Editor, those cells with error values will be blank in the resultant table. While this might seem ideal, blank cells in an Excel column can cause issues when you're sorting and filtering the data or referencing column headers in formulas, so it's best to fill them with meaningful values.\nTo do this, right-click the column header, and select \"Replace Errors.\"\nYou might be tempted to select \"Remove Errors\" in the right-click menu. However, this deletes the entire row, not just the error, so only click this option if that's what you want to happen.\nNow, in the Replace Errors dialog box, type the value you want to appear instead of errors. In this case, since the errors appeared where the cell read \"Present,\" you could type the current year.\nWhen you click \"OK,\" all the error values are replaced with this new value.\nBecause all the cells in the two right-most columns all contain the same data types without any errors, you can create a new column that works out the total number of playing years for each player.\nHere, I clicked \"Custom Column\" in the Add Column tab, changed the column name to \"Years played,\" and used the list of columns in the Available Columns menu to create a simple subtraction.\nThen, when I clicked \"OK,\" this new column—free of any errors—was added to the right-hand side of the query.\nWhen you're done, click the \"Close And Load\" icon in the Home tab of the Power Query Editor to send the table to a new spreadsheet in your Excel workbook.\n3 Unpivot Data to Aid Analysis\nWhen creating a new dataset in Microsoft Excel, where possible, I follow the record-field principle, where:\n- Each row contains a collection of related but different data types (also known as a record), and\n- Each column contains a single, unique data type (also known as a field) relating to each record.\nIn this straightforward example, each country is a record, and their continents, populations, and currencies are fields.\nUsing this format prepares the data for further analysis, as you can easily filter and sort the data, reference column headers in formulas, and visualize the statistics.\nCompare the table in the example above to the following screenshot, where each column (field) contains identical data types.\nAs a result, it's impossible to filter the data by year, and you can't easily see which year was the most profitable for each company. To make these analyses, you'll need to unpivot (or flatten) the data, which involves converting the data from a wide table into a long table by turning each year column into a row. In other words, you want all the financial values to be stored as a single field.\nFirst, select any cell in the data, and in the Data tab on the ribbon, click \"From Table/Range.\"\nAt this point, if your data isn't already formatted as an Excel table, you'll see a dialog box prompting you to fix this. This is so that the Power Query Editor can read your data more easily.\nThen, in the Power Query Editor, select the headers of all the columns you want to unpivot. In this example, you'll need to click the \"2020\" header, press Shift, and then click the \"2024\" header.\nNow, in the Transform tab on the ribbon, expand the \"Unpivot Columns\" drop-down menu, and click \"Unpivot Only Selected Columns.\"\nNow, each column is a separate field (company, year, and profit), and each row is a detailed company record.\nFinally, double-click the column headers to rename them so that they match the field they represent, and click the number format icons to ensure each column contains the correct data type.\nNow, when you click \"Close And Load\" in the Home tab on the ribbon, the unpivoted table is sent to a new spreadsheet in your Excel workbook.\nAs a result, you can perform data analyses that were impossible before you flattened the table, like filtering the data by year and company or sorting the company profits into descending order.\nAfter adding more data to the original table, like another year of figures, head to the table produced previously by Power Query, and in the Query tab, click \"Refresh.\" Excel then adds the new data to the resultant table in its unpivoted format, saving you from having to return to the Power Query Editor each time.\n4 Fill Blank Cells Based on the Cell Above (Or Below)\nAs I mentioned earlier, blank cells in a dataset can lead to issues when you sort and filter your data or use formulas that reference column headers, so it's a good idea to fill them in.\nIn this example, only the first player in each team is assigned a team number in column A, so if you rearrange the data, you'll lose sight of which player is in which team. Also, currently, you can't filter the data by team number.\nIdeally, cells A3 to A5 should contain the number 1, cells A7 to A9 should contain the number 2, and so on. Typing these numbers manually would be time-consuming, especially if, like in this example, there are many rows in the dataset. Instead, use Power Query to populate the blank cells in seconds.\nFirst, with any cell in the data selected, in the Data tab on the ribbon, click \"From Table/Range.\"\nWhen the Power Query Editor opens, notice how the blank cells in the column in question contain the word \"null.\" To fix this, select the column by clicking the column header, and in the Transform tab, click \"Fill.\"\nThen, choose whether you want to fill the data downward or upward. Clicking \"Down\" finds a cell in the selected range containing a value, and fills in any blank cells beneath with the same value. On the other hand, clicking \"Up\" fills blank cells above a cell containing a value. In this case, because only the first row of each team contains a number, you need to fill downwards.\nMicrosoft Office 2024\nGain permanent access to Word, Excel, PowerPoint, and OneNote with the Office Home 2024 bundle. It isn't a one-to-one replacement for a Microsoft 365 subscription, as it lacks some apps and does not include feature updates, but it's a one-time purchase, so it's ideal for those who just need the basics.\nNow, each player is properly assigned a team number, so you can click \"Close And Load\" in the Home tab to send the query to a new worksheet.\nThanks to this quick but important change, you can sort and filter the dataset, safe in the knowledge that you won't lose track of which player is in each team.\nIf you have multiple tables in separate Excel worksheets, providing they have the same column headers, you can use Power Query to stack the data into a single table. This involves the extra (but straightforward) step of creating data connections between each table, before combining the queries in the Power Query Editor."
    },
    {
      "url": "https://www.howtogeek.com/ways-google-sheets-better-than-microsoft-excel/",
      "text": "Quick Links\nIt's no secret that Microsoft Excel is more powerful and complex than Google Sheets and is often the preferred program for sophisticated calculations and large datasets. However, Google Sheets offers several advantages that are often overlooked and may swing the balance in its favor.\n5 Get Detailed Help When Typing Formulas\nGoogle Sheets and Microsoft Excel want to help you when you're typing formulas. Indeed, as soon as you type the opening parenthesis, both programs display pop-up tips with the function's syntax.\nHowever, in Google Sheets, if you click the down arrow to the right of the pop-up, you can see more information about the function you're using.\nSpecifically, you're given an example of a completed formula for the function in question. This is particularly useful if—like me—you often forget that certain arguments need to be structured in certain ways, like being wrapped in quotation marks. You're also presented with a detailed description of what the function does and what each argument in the formula represents. If you're still struggling with the formula, scroll to the bottom of the pop-up, and click the link to a support page.\n9 Basic Google Sheets Functions You Should Know\nGet familiar with the basic functions you need for your spreadsheet.\nThis extra info is a game-changer if you're using a function you've never used before or one that requires many arguments.\n4 Condense Your Links to Other Files\nBoth Google Sheets and Microsoft Excel let you insert links to other files in the same program. For example, in Sheets, you can copy the URL of the Google Sheets file to which you want to link, and paste it into a cell in the active file. Similarly, in Excel, you can right-click a cell, select \"Link,\" and generate a hyperlink to an existing Excel file.\nAs you can see in both screenshots above, the links are lengthy and untidy.\nHow to Link to Cells or Spreadsheets in Google Sheets\nUse a link to quickly jump to a group of cells or another spreadsheet.\nTo avoid this in Microsoft Excel, instead of pasting the link directly into a cell, you could first type some text and then link the text to the relevant Excel file.\nHowever, this process can be time-consuming, especially if you need to link to many files at the same time. What's more, selecting and formatting the linked cell without triggering the link can be frustratingly challenging, since the link is active as soon as you insert it.\nOn the other hand, in Google Sheets, when you select the cell containing the link to the other Sheets file, you're given the option to replace the URL with a chip.\nWhen you activate this option, the URL turns into a tidily formatted button, with the file name inserted automatically.\nOne of the biggest benefits of using link chips in Google Sheets is that if you accidentally click them, you're not instantly taken to the linked file. Instead, you see a pop-up that lets you confirm your wish to leave the active worksheet and navigate to the linked one.\nThis means that you can easily select and format the cell containing the link without having to be overly careful about where you click.\nHow to Use the IMPORTRANGE Function to Import Data From One Google Sheets File Into Another\nThis powerful function makes duplicating data simple.\n3 See Table Names in the Cell Area\nBefore 2024, formatted tables were only available in Microsoft Excel, but Google realized their benefit and decided to implement them into their own spreadsheet software.\nThere are many reasons why you might convert your data to formatted tables, including the ability to reference table and column names in formulas. For example, typing:\n=SUM(Player_Scores[Score])\ninto an empty cell in both Sheets and Excel returns the total of all values in the Score column of the Player Scores table, saving you the bother of manually referencing data ranges.\nEverything You Need to Know About Excel Tables (And Why You Should Always Use Them)\nThis could totally change how you work in Excel.\nHowever, rather than simply copying Microsoft's table design, Google went a step further in the table naming process.\nTo rename a table in Microsoft Excel, you need to select a cell in the table, head to the \"Table Design\" tab, and change the text in the Table Name field of the Properties group. Given how useful tables are, it's surprising that you have to dig quite deep through the ribbon to rename them.\nOn the other hand, in Google Sheets, the table's name is visible in the worksheet area, directly above the table itself. So, as soon as you create the table, you're reminded to name it, and doing so only takes a second.\nAs a result, when you go to reference a table in a formula in Google Sheets, you only have to glance at the table—rather than root through the menus on the ribbon—to remind yourself of its name, thus saving lots of time.\nTo see a list of all tables and named ranges in a Google Sheets or Microsoft Excel file, click the down arrow in the name box, which is located in the top-left corner of the spreadsheet window (just above the row headings).\n2 Know Which Cells Contain Drop-Down Lists\nAdding drop-down lists to cells—something you can do in both Google Sheets and Microsoft Excel by clicking Data > Data Validation—improves data entry efficiency, prevents typos, and ensures consistency.\nIn Microsoft Excel, cells containing drop-down data validation rules look like \"normal\" cells until they're clicked. In other words, there's no way to know that you can select a value from a drop-down list until you select the affected cells.\nOn the other hand, cells in Google Sheets containing drop-down lists adopt a stylized format that looks professional and makes it clear that the cells can be clicked to reveal the input options.\nWhat's more, when stating the data validation input options, you can assign colored chips. To do the same in Microsoft Excel, you would need to take the extra step of adding conditional formatting rules.\n1 Get Notified if Certain Cell Values Change\nSo far, I've discussed how Google Sheets' versions of some features it shares with Microsoft Excel are more user-friendly. However, in this final section, I'll show you a tool exclusive to Google Sheets: conditional notifications.\nAt the time of writing (July 2025), conditional notifications in Google Sheets are only available to people using Business, Enterprise, or Education Google Workspace accounts. This is because the tool is intended for shared worksheets in collaborative environments.\nImagine you're a project manager, and you're tracking the progress of various tasks in your organization. The Status column tells you whether a task is in progress, completed, or requires a certain action for it to continue.\nSo you can keep an eye on the development of each task, you can set up a conditional notification rule that emails you if any of the task statuses change. To do the same in Microsoft Excel, you would need to know how to write VBA code—a much more complex skill.\nFirst, in Google Sheets, right-click any cell in the range, and select \"Conditional Notifications.\"\nThen, in the Add Rule pane, name the rule, select the table, range, or cell, type the Gmail or Workspace email addresses (up to 10) that should be notified when the data changes, and click \"Save.\"\nYou can also add extra conditions—such as only notifying you if the cell value changes to a specific word—by clicking \"Add Condition.\"\nGoogle Workspace Standard\nGoogle Workspace, formerly known as G Suite, is a collection of cloud-based productivity tools designed to help you work more efficiently. It focuses on collaboration to enable real-time editing and seamless integration between apps.\nNow, when the value in one of the nominated cells changes, an email notification will be sent to the specified addresses. The notification contains details of which cell has changed, what it changed from and to, and the name of the individual who made the change.\nThe notification can take up to 30 minutes to arrive. If more than one change is made in a short space of time, the notifications may be grouped into a single email.\nIn this case, because the status has changed to Action required, I need to email the person who made the change to discuss how we can enable the task to continue.\nIf you're still on the fence when deciding whether to use Google Sheets or Microsoft Excel, take some time to compare the programs in terms of their data analysis and visualization capabilities, ease of collaboration, the complexity of the tools they offer, and their overall performance.\nGoogle Sheets vs. Microsoft Excel: Which Should You Use?\nYes, they're both spreadsheet platforms, but they're actually very different."
    },
    {
      "url": "https://www.howtogeek.com/741479/how-to-hide-errors-in-google-sheets/",
      "text": "Quick Links\nIf you break a formula in Google Sheets, an error message will appear. You might prefer to hide these error messages to get a clean spreadsheet, especially if the overall data isn't affected, using the IFERROR function. Here's how.\nHiding Error Messages in Google Sheets Using IFERROR\nThe IFERROR function checks whether a formula that you're using results in an error. If it does, IFERROR allows you to return an alternative message or, if you'd prefer, no message at all. This hides any potential error messages that might appear when you're performing calculations in Google Sheets.\nThere are a number of errors that can appear in Google Sheets that IFERROR can handle. For example, if you attempt to apply a mathematical function to a cell containing text (eg.\n=C2*B2\n, where\nB2\ncontains text), Google Sheets will display a \"#VALUE\" error message.\nNo spreadsheet is perfect, so error messages might not necessarily indicate a problem, especially if you're performing calculations on a data set that combines text and data. If you want to hide these messages completely, you'll need to nest (combine) your initial formulas within an IFERROR formula.\nHow to Use an IFERROR Formula in Google Sheets\nIFERROR is a simple function with only two arguments. The syntax of a formula containing IFERROR is a little like this:\n=IFERROR(A2,\"Message\")\nThe first argument is the formula that IFERROR is checking for errors. As the example above shows, this can be used to refer to other cells (cell A2 in this example) to hide formula error messages that appear elsewhere.\nThese formulas can also be nested into an IFERROR formula directly. For example:\n=IFERROR(0/0, \"This formula has an error!\")\nThe second argument in an IFERROR formula is the custom error message that replaces Google Sheets' own message. For example, the illustration above shows that dividing zero by zero isn't possible. Rather than display Google's error message (#DIV/0!), a custom error message appears.\nIf you'd prefer to have no error message, you can use a blank text string as your second argument. For example:\n=IFERROR(0/0,\"\")\nRather than showing an error, the empty text string is \"displayed\"---but, as this isn't visible, the cell appears empty. Unlike Excel's own IFERROR formula, IFERROR in Google Sheets will also hide error indicators---the little red arrows that appear above cells to warn you of an error.\nThe IFERROR function won't fix problems with your calculations, but if you need to clean up your spreadsheet and don't mind missing a few error messages, IFERROR is the best way to achieve that in Google Sheets."
    },
    {
      "url": "https://www.howtogeek.com/microsoft-excel-combining-workbooks-easier-than-you-think-powerful-tool/",
      "text": "Stacking data from multiple worksheets manually can be painfully time-consuming and could easily lead to copying errors. What's more, this process becomes even more burdensome if you need to regularly update the dataset. Luckily, Excel's Power Query tool can do all this for you.\nStep 1: Organize the Workbooks You Are Going to Combine\nBefore you begin combining Microsoft Excel files into one worksheet, there are some important steps to take.\nFirst, make sure all the datasets you're going to combine are structured in the same way. Specifically, they must contain the same number of columns, have the same column headers, and the worksheet tabs must have the same name. Also, the process will be much more straightforward if the file names follow a similar syntax.\nThat said, the columns don't need to be in the same order, and the number of rows on each sheet can differ.\nSecond, ensure the files are saved in the same folder.\nIf possible, the folder should contain only the files you're going to combine, as this makes the process cleaner and easier in later steps. However, if you must store other files in this folder as well, I'll show you shortly how to ensure only the correct files are selected for the data merge.\nStep 2: Open Excel and Link to the Relevant Folder\nOnce the files are correctly organized into the folder according to the above prerequisites, you're ready to start pulling the data together.\nFirst, open a new Microsoft Excel workbook, start a blank worksheet, and press F12 to save the file in a different folder from where the individual files you're going to combine are located.\nThe Best Excel Keyboard Shortcuts I Use as a Power User\nThe key to excelling in your spreadsheet work.\nNext, in the Data tab on the ribbon, click \"Get Data.\" Then, hover over \"From File,\" and select \"From Folder.\"\nNow, in the Browse dialog box, locate and select the folder where the files you want to combine are stored, and click \"Open.\"\nStep 3: Choose the Files You Want to Combine\nWhat you do in this step depends on what's stored in the folder you selected. If it contains only the files you want to merge, see Section 3A below. On the other hand, if the folder also contains some files you don't want to merge, skip to Section 3B.\n3A: The Folder Contains Only the Files I Want to Merge\nEarlier, I said that the workbook-merging process is cleaner and easier if the folder you select is dedicated to the files you want to combine. This is because you don't need to filter out any unwanted files. So, since you're already ready to combine the files, click \"Combine,\" and in the drop-down menu that appears, click \"Combine And Transform Data.\"\nNow, after Excel briefly evaluates your data, you'll see the Combine Files dialog box, and you're ready to skip to Step 4.\n3B: The Folder Contains Some Files I Don't Want to Merge\nIf the selected folder also contains files other than the ones you want to merge, after you locate the folder in Step 2, you'll see them listed in the details. In this case, you need to click \"Transform Data,\" as you want to make changes to the file selection before you combine the data.\nClicking this option launches the Power Query Editor, a separate window within Microsoft Excel where you can filter out the files you don't want to include in the combining process.\nIn this case, the file named Contact Details needs to be excluded, so click the filter drop-down arrow in the Name column header, uncheck that file, and click \"OK.\"\nNow, only the files you want to combine are listed, so go ahead and click the double down arrow in the Content column to launch the Combine Files dialog box.\nStep 4: Combine the Files\nThere are a few things to look out for in the Combine Files dialog box.\nFirst, by default, the workbook nominated as the sample file is the first one you selected in the list. The sample file will dictate how the data is structured when the files are combined, so, as long as all your files are structured consistently, it's fine to leave this option as is.\nSecond, if your workbooks have more than one worksheet tab, you'll see them listed in the Display Options pane on the left. This is why it's important that all the tabs you want to combine across the nominated workbooks have the same name. Also, if you have formatted the data as Excel tables and named them, you'll see the list of names here.\nIn this example, however, each workbook only has one worksheet (named Scores), so go ahead and select this option. After reviewing the preview of the selected sample file in the right-hand pane, click \"OK\" to confirm and launch the Power Query Editor.\nStep 5: Transform the Data\nIf this is the first time you've opened the Power Query Editor in Excel, it can initially be overwhelming. However, once you take some time to understand what the different areas of the editor do, you'll realize that it's actually an intuitive tool.\nThe left-hand pane is where all the queries are located. When combining data from various Excel workbooks, you only need to focus on two of these—the Transform Sample File query, which is used as a template for any changes you want to make to the datasets, and the appended query at the bottom of the list, which consolidates the files. However, depending on what you want to do, they're both useful for transforming your data.\nFirst, in the Transform Sample File query, click the number format icons in the header of each column to tell Excel what types of data they contain. In this example, the first, third, and fourth columns contain whole numbers, and the second column contains a date.\nLook in the Query Settings pane on the right-hand side of the Power Query Editor to see (and remove if necessary) each step you take in transforming your data.\nNext, in the appended query, we don't need the Source Name column, but it would be handy to have the year for each team score.\nYou can transform this column to keep only the years while removing the rest of the file names. To do this, click the column header so that all values in the column are selected, and in the Transform tab on the ribbon, click \"Extract,\" then \"Text Before Delimiter.\"\nIn this case, we want to keep the year, and remove everything after the first space. So, in the Delimiter text field, type a single space. Then, click \"Advanced Options,\" and select \"From The Start Of The Input.\" Now, click \"OK.\"\nFinally, double-click the column header to rename it Year, and change the data type to \"Whole Number.\"\nTake a moment to scroll down the combined data list to check that there aren't any errors or any further transformations you wish to make.\nStep 6: Load the Combined Data Onto a New Worksheet\nNow that the data from the workbooks has been combined and transformed, it's time to see how it looks in a regular Excel worksheet. In the Home tab on the Power Query Editor window, click the top half of the \"Close And Load\" split button.\nClick the bottom half of the \"Close And Load\" split button for more loading options. For example, you can load the data onto an existing worksheet or as a PivotTable.\nNow, the data loads on a new worksheet as a formatted Excel table, meaning you can format its appearance and properties in the Table Design tab on the ribbon.\nEverything You Need to Know About Excel Tables (And Why You Should Always Use Them)\nThis could totally change how you work in Excel.\nTo make further changes to the query in the Power Query Editor, after activating the Queries And Connections pane in the Data tab, right-click the query, and select \"Edit.\"\nOnce you've made the necessary edits in the Power Query Editor, click \"Close And Load\" again to update the resultant dataset.\nStep 7: Append More Data From Additional Workbooks\nFinally, let's imagine the data for 2024 has now come in, and you want to append this new information to the existing query. Amazingly, because you've already taken the necessary steps in the Power Query Editor, all you need to do is ensure the workbook meets all the criteria I outlined in Step 1, and click a single button in Excel to refresh the table.\nFirst, move the workbook containing the data to the folder where the previous years' data is located, ensuring that the workbook name, worksheet structure, and tab name are consistent with the other files.\nThen, open the workbook containing the previously appended data, and in the Queries And Connections pane (which you can activate by clicking \"Queries And Connections\" in the Data tab on the ribbon), click the \"Refresh\" icon next to the primary query.\nAfter giving Excel a few seconds to complete this update, scroll down to see the additional data appended to the bottom of the table.\nTo keep any formatting you applied to the table before refreshing the Power Query, click \"Properties\" in the Table Design tab on the ribbon, and ensure \"Preserve Cell Formatting\" is checked. If you change the column widths, and don't want these to automatically fit to the data they contain each time you refresh, uncheck \"Adjust Column Width.\"\nAs well as appending data from separate workbooks saved into a folder, you can stack data from multiple Excel sheets within a single workbook by creating data connections between them and combining the queries. What's more, you can use Power Query Editor to import tables from the web."
    },
    {
      "url": "https://www.howtogeek.com/832764/how-to-use-xlookup-in-google-sheets/",
      "text": "The XLOOKUP function in Google Sheets gives you an easy way to find the data you're looking for quickly. XLOOKUP doesn't have the same limitations as VLOOKUP and HLOOKUP, enabling you to perform lookups in any direction.\nIf you're a Microsoft Excel user, you may have used XLOOKUP there. Luckily, it works the same way in Google Sheets. Whether you're used to the function in Excel or brand new to it altogether, we'll show you how to use XLOOKUP to find specific values from a range of cells.\nAbout XLOOKUP in Google Sheets\nWith the XLOOKUP function and accompanying formula, you can perform a lookup in one cell range and return a matching result from another. This is handy for sheets that contain a lot of data where using your eyeballs is time-consuming.\nThe syntax for the function is\nXLOOKUP(search_value, lookup_range, result_range, missing_value, match_mode, search_mode).\nThe first three arguments are required. The three remaining arguments can be used to customize your lookup.\n- Search_value: The value to look up which can be a number, text, or cell reference. Text should be placed within quotation marks.\n-\nLookup_range: The cell range to look for the\nsearch_value\nwhich should be a single row or column. -\nResult_range: The cell range to look for the result that corresponds to the\nsearch_value\nwhich should be the same size as the lookup_range. -\nMissing_value: The value to return if there's no match to the\nsearch_value\n. The formula returns the #N/A error by default. -\nMatch_mode: How to find the matching\nsearch_value\n. Enter 0 for an exact match, 1 for an exact match or the next value greater than thesearch_value\n, -1 for an exact match or next value less than thesearch_value\n, or 2 for a wildcard match. The default is 0. -\nSearch_mode: How to search the\nlookup_range\n. Enter 1 to search from the first to the last entry, -1 to search from the last to the first entry, 2 to use a binary search with values in ascending order, or -2 to use a binary search with values in descending order. The default is 1.\nHow to Use XLOOKUP in Google Sheets\nTo show how the function works, we'll start with a simple lookup using the required arguments and then move on to additional examples that use the optional arguments.\nHere, we have a sheet of customer orders that includes contact details and order information. For the first example, we'll do a simple lookup of the Order Number to return the Customer Name using this formula:\n=XLOOKUP(123456,D2:D14,A2:A14)\nTo break down the formula, 1234356 is the search_value\nor order number, D2:D14 is the lookup_range\n, and A2:A14 is the result_range\n. As you can see, Order Number 123456 belongs to Marge Simpson.\nBecause XLOOKUP can work from left to right as well as right to left, we can do the reverse. Here, we'll look up Marge Simpson in the range A2 through A14 to find her Order Number in the range D2 through D14.\n=XLOOKUP(\"Marge Simpson\",A2:A14,D2:D14)\nUnlike VLOOKUP which works vertically and HLOOKUP which works horizontally, XLOOKUP works in both directions.\nMissing Value\nIn this next example, we'll include \"ZERO\" for the missing_value\n. So, if our search_value isn't found, we'll see ZERO instead of the default #N/A.\n=XLOOKUP(\"Homer Simpson\",A2:A14,D2:D14,\"ZERO\")\nBecause our lookup of Homer Simpson isn't found in the range A2 through A14, our result is ZERO.\nMatch Mode\nFor an example using the match_mode\nargument, we'll use a search_value\nof 29 for the Amount in the range F2 through F14 to find the Customer Name in the range A2 through A14.\nWe'll include a match_mode\nof 1 for an exact match or the next greater value. Note that there's no missing_value\nargument in the formula.\n=XLOOKUP(29,F2:F14,A2:A14,,1)\nYou can see the result is Raj Koothrappali. Because there's no match for 29, the formula gives us a result for the next higher value which is 30.\nSearch Mode\nHere's one more example using both the match_mode\nand search_mode\narguments with the same search_value\nof 29 in F2 through F14. Again, we look for the Customer Name in the range A2 through A14.\nWe'll look for an exact match or the next lower value by searching from the last entry to the first. So, we enter -1 for the match_mode\nand -1 for the search_mode\n. Like above, the missing_value\nis omitted.\n=XLOOKUP(29,F2:F14,A2:A14,,-1,-1)\nAs you can see, the result is Michael Kelso. Because there's no match for 29, the formula gives us the next lower value which is 28. Even though Eric Forman also matches with 28, we performed the search from the last entry to the first (bottom to top), so Michael Kelso is the first result found.\nIf we were to search from the first entry to the last (top to bottom) using a search_mode\nof 1 instead of -1, then Eric Forman would be the result found.\nWhen you have a spreadsheet full of data, looking up a value to find its matching data can take time. But if you use XLOOKUP in Google Sheets, you'll find what you need in a snap.\nFor more, check out these basic Google Sheets functions you might want to try."
    },
    {
      "url": "https://www.howtogeek.com/google-sheets-importrange-function-import-data-range/",
      "text": "Quick Links\nDo you need to import a range of cells from another Google Sheets spreadsheet? If so, the IMPORTRANGE function is designed to do just that! What's more, if the source changes, so does the imported range. Here's how to use this useful tool.\nThe Google Sheets IMPORTRANGE Syntax\nThe IMPORTRANGE function in Google Sheets has two arguments:\n=IMPORTRANGE(a,b)\nArgument a is the link (URL) to the Google Sheets file where the range you want to import is located—enclosed in double quotes—or a reference to a cell containing the URL.\nWhat Is a URL?\nWhen you type an address into your web browser, a lot of things happen behind the scenes.\nArgument b is the reference to the range. This can be cell references, a sheet name followed by cell references, a named range, a table name, or a column within a table—all of which must be in double quotes. Argument b can also reference a cell containing the cell references of the source data, and this doesn't need quotation marks.\nConfused? Let's explore each of these more closely.\nImporting Data Using Direct Cell References\nYou can import data from one Google Sheets file to another by specifying the source URL and the relevant cell references. This is useful if you're sure that the source data won't change location or grow in size.\nLet's imagine you have two Google Sheets files open on separate browser tabs—File 1 contains a list of names in cells A2 to A11 that you want to import into File 2.\nTo do this, select the cell in File 2 where you want the list to be imported into, type the following formula—remembering to enclose both the URL and cell references in quotation marks—and press Enter:\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"A2:A11\")\nThe example formulas in this guide only show part of the URL for demonstration purposes. In your case, make sure you insert the whole URL into the formula.\nThe first time you connect the active and referenced worksheets, you may see a #REF! error. If you do, hover over the cell containing the error to see one of two messages.\nOn the one hand, if you own both spreadsheets, Google Sheets will tell you that you need to grant permission to link the files. To do this, click \"Allow Access.\"\nOn the other hand, if you don't own the source spreadsheet and haven't been given edit access, you'll be told that you don't have permission to use the linked sheet in your IMPORTRANGE formula. In this case, paste the URL into your browser's URL bar, click \"Request Edit Access,\" and wait for the owner to grant this request.\nOnce the correct permissions are activated, the range is imported successfully.\nWhat's more, any changes to the content of cells A2 to A11 in File 1 will be reflected in the imported data in File 2 after it refreshes automatically.\nIf the source data expands or changes location, the cell reference you used in argument b won't adjust to this change, so you'll need to adjust the formula accordingly.\nBy default, the IMPORTRANGE function imports from the first worksheet in the specified file, even if you use the URL of a different worksheet in the file. However, if you want to import a range from another worksheet, for argument b, type the sheet name, followed by an exclamation mark, and then the cell references.\nFor example, this formula would import the data from cells A2 to A11 in Sheet 2 of the source file:\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"Sheet2!A2:A11\")\nPro Tip: Importing Data From Within the Same Google Sheets File\nThe IMPORTRANGE function is intended to import ranges from different Google Sheets files. To import data from one spreadsheet in a Google Sheets file to another spreadsheet in the same Google Sheets file, use the ARRAYFORMULA function. For example, typing:\n=ARRAYFORMULA(A2:A11)\ndynamically copies the data from cells A2 to A11 in the same worksheet.\nSimilarly, typing:\n=ARRAYFORMULA(Sheet1!A2:A11)\ninto a cell in Sheet 2 duplicates the data in cells A2 to A11 in Sheet 1.\nImporting Data Using Indirect References\nIn the examples above, argument a contains the full URL of the source data, leading to lengthy formulas that are challenging to parse. Instead, to make the formula tidier, you could reference a cell that contains the source URL.\nHere, cells C2 to C11 in File 1 contain a list of animals you want to import into File 2.\nIf you have edit access to File 1, copy its URL, and select a blank cell in File 2. Then, click the formula bar at the top of the spreadsheet so that the cursor is flashing, and press Ctrl+V (or right-click and select \"Paste\"), before pressing Enter.\nIf you paste the link directly into the cell, Google Sheets reformats the link, causing it to be incompatible with the IMPORTRANGE function. This is why it's best practice to paste the URL into the formula bar after selecting the destination cell.\nNext, select the cell where you just pasted the link, and click \"Chip.\"\nThis shortens the link into a file label, making your spreadsheet tidier and more professional.\nThen, in another cell in File 2, type:\n=IMPORTRANGE(A1,\"C2:C11\")\nwhere A1 is the cell in File 2 containing the URL of File 1 that you just pasted, and C2:C11 is the range in File 1 that you want to import.\nThe cell containing the URL doesn't need to be in quotation marks.\nThen, press Enter.\nRather than hard-coding the cell references in argument b, you can type these into a separate cell in File 2, and reference that instead. As well as further shortening your formula, this method means that you can easily change the reference without having to edit the formula itself.\nIn this example, the formula:\n=IMPORTRANGE(A1,B1)\nin cell B2 takes the URL from cell A1, and the cell references from cell B1.\nIf you later realize that you want the imported range to be static (rather than allowing it to update according to the source data), simply select and copy the range, and press Ctrl+Shift+V to paste the data as values.\nImporting Data From Named Tables and Ranges\nThe IMPORTRANGE function in Google Sheets can also import tables, columns in tables, and ranges.\nIn this example, File 1 contains a table named T_Fruits, and you want to import the column named Fruits into File 2.\nSo, after ensuring you have edit access to File 1, in a blank cell in File 2, type:\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"T_Fruits[Fruits]\")\nwhere the URL is the link to File 1, T_Fruits is the name of the table, and Fruits is the column within that table that you want to import.\nIf you type only the name of the table (and not a column header), the whole table will be imported.\nThe benefit of this approach is that if more rows are added to the data, the IMPORTRANGE function will pick these up, meaning the changes will be reflected in the imported version. That said, if you rename the table or column headers, you'll need to update argument b of the IMPORTRANGE formula accordingly.\nIn a similar fashion, argument b can also be a named range.\n5 Ways to Use Named Ranges in Google Sheets\nWondering if named ranges are for you? There are plenty of ways to use them.\nFor example, cells H2 to H11 in File 1 are named R_Cities.\nAs a result, the formula in File 2 can import this data by referencing the named range:\n=IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"R_Cities\")\nNesting IMPORTRANGE in Other Functions\nIMPORTRANGE doesn't have to be used on its own in Google Sheets—it can also be used alongside other formulas to perform calculations on data in other Google Sheets files.\n9 Basic Google Sheets Functions You Should Know\nGet familiar with the basic functions you need for your spreadsheet.\nIn this example, let's imagine File 1 has a list of scores in cells J2 to J6. Your aim is to use the IMPORTRANGE function with the SUM function to evaluate these cells, sum their values, and return the result in File 2.\nTo do this, in a blank cell in File 2, type:\n=SUM(IMPORTRANGE(\"https://docs.google.com/spreadsheets/d...\",\"J2:J6\"))\nwhere the IMPORTRANGE function references cells J2 to J6 in File 1, and the SUM function adds the values they contain.\nAccording to Google, using this approach is faster than first using IMPORTRANGE to import the data, and then using a separate SUM function to sum the imported range.\nThe IMPORTRANGE function can't reference a cell that contains another volatile function—like NOW or the random number functions RAND and RANDBETWEEN—as doing so would potentially overload the spreadsheet's resources. The only exception is the TODAY function, since this only updates once daily.\nPoints to Note When Using the IMPORTRANGE Function\nBefore you go ahead and use IMPORTRANGE in your Google Sheets spreadsheets, here are some final pointers to bear in mind:\n- References and names in IMPORTRANGE don't update: If the range reference, table name, column name, or range name changes, it needs to be updated in the IMPORTRANGE formula in the destination file.\n- You can create an IMPORTRANGE chain: For example, you could use the function in File 2 to reference a range in File 1, and then use it again in File 3 to reference the imported range in File 2. That said, you should try to limit these chains, as having too many could affect the performance of your spreadsheets.\n- IMPORTRANGE requires an internet connection: Since this is an external data function, it needs an internet connection to work. A slower internet connection will result in importing lags.\n- Imports are capped at 10MB: The IMPORTRANGE function is limited to importing up to 10MB per data request. This limit is in place to reduce the adverse effect the function has on performance and resources.\nBecause it's an online software, many prefer Google Sheets to its desktop competitors, such as Microsoft Excel. Indeed, to perform the same importing actions in Excel, you would need to use the Power Query Editor tool, a route that requires many more steps."
    },
    {
      "url": "https://www.howtogeek.com/356563/what-is-a-url-uniform-resource-locator/",
      "text": "When you type an address into your web browser, a lot of things happen behind the scenes. And most of that is determined by the various parts of the URL you typed. Let's take a closer look.\nA URL can consist of a bunch of different parts. There's a hostname that maps to an IP address of a specific resource on the internet and bunch of additional information that tells your browser and the server how to handle things. You can think of an IP address as being something like a phone number. A hostname is like the name of a person whose phone number you want to look up. And a standard called the Domain Name System (DNS) works in the background like a phone book, translating the more human-friendly hostnames into the IP addresses that networks use to route traffic.\nKeeping that analogy in mind, let's take a look at the structure of a URL and how it works to get you where you want to go.\nHow a URL Is Structured\nThe structure of a URL was first defined by Sir Tim Berners-Lee---the guy who created the Web and the first web browser---in 1994. URLs essentially combine the idea of domain names with the idea of using a file path to identify a specific folder and file structure. So, it's similar to using a path like C:\\Documents\\Personal\\myfile.txt in Windows, but with some extra stuff at the beginning to help find the right server on the internet where that path exists and the protocol used to access the information.\nA URL consists of several different parts. Take, for example, a basic URL like the one shown in the image below.\nThat simple URL is broken down into two major components: the scheme and the authority.\nScheme\nA lot of people think of a URL as just a web address, but it's not quite that simple. A web address is a URL, but all URLs are not web addresses. Other services you can access on the internet---like FTP---or even locally---like MAILTO---are also URLs. The scheme portion of a URL (those letters followed by a colon) denote the protocol with which an app (like your web browser) and the server should communicate.\nWeb addresses are the most common URL, but there are others. So, you might see schemes like:\n- HyperText Transfer Protocol (HTTP): This is the underlying protocol of the web and determines what actions web servers and browsers should take in response to certain commands.\n- HTTP Secure (HTTPS): This is a form of HTTP that works over a secure, encrypted layer for safer transport of information.\n- File Transfer Protocol (FTP): This protocol is often still used for transferring files over the internet.\nIn modern browsers, the scheme isn't technically required as part of the URL. If you enter a website like \"www.howtogeek.com\", your browser will automatically determine the right protocol to use. Still, some other apps (and protocols) require the use of a scheme.\nAuthority\nThe authority portion of a URL (which is preceded by two slashes) is itself broken down into a bunch of parts. Let's start off with a very simple URL---the kind that would take you to the home page of a website.\nIn this simple example, the whole \"www.example.com\" part is called a hostname, and it resolves to an IP address. You can also type an IP address into your browser's address bar instead of the hostname if you happen to know it.\nBut, when parsing the hostname it helps to read it backward to understand what's going on, so here are those components:\n- Top-Level Domain: In the example here, \"com\" is the top-level domain. These are the highest level in the Domain Name System (DNS) hierarchy used to translate IP addresses into simple language addresses that are easier for we humans to remember. These top-level domains are created and managed by the Internet Corporation for Assigned Names and Numbers (ICANN). The three most common top-level domains are .com, .net, and .gov. Most countries also have their own two-letter top-level domain, so you'll see domains like .us (United States), .uk (United Kingdom), .ca (Canada), and many others. There are also some additional top-level domains (like .museum) that are sponsored and managed by private organizations. In addition to these, there are also some generic top-level domains (like .club, .life, and .news).\n- Subdomain: Since DNS is a hierarchical system, both the \"www\" and \"example\" parts of our example URL are considered subdomains. The \"www\" portion is a subdomain of the \"com\" top-level domain, and the \"www\" portion is a subdomain of the \"example\" domain. That's why you'll often see a company with a registered name like \"google.com\" broken out into separate subdomains like \"www.google.com,\" \"news.google.com,\" \"mail.google.com,\" and so on.\nThat's the most basic example of the authority section of a URL, but things can get more complicated. There are two other components that the authority section can contain:\n- User Information: The authority section can also contain a username and password for the site you're accessing. It's uncommon to see this structure in URLs today, but it can happen. If present, the user info portion comes before the hostname and is followed by an @ sign. So, you might see something like \"//username:password@www.example.com\" if it includes the user information.\n- Port Number: Network devices use IP addresses to get information to the right computer on a network. When that traffic arrives, a port number tells the computer the application for which that traffic is intended. The port number is another element you won't often see when browsing the web, but you might see it in network apps (like games) that require you to enter a URL. If the URL includes a port number, it comes after the hostname and is preceded by a colon. It would look something like this: \"//www.example.com:8080.\"\nSo, that's the scheme and authority portions of a URL, but as you might have guessed after looking at a lot of URLs while browsing the web, they can include even more stuff.\nPaths, Queries, and Fragments\nThere are three additional parts of a URL that you might see after the authority portion: paths, queries, and fragments. Here's how those work.\nPath\nThe authority section of a URL gets your browser (or whatever app) to the right server on a network. The path that follows---which works just like a path in Windows, macOS, or Linux---gets you to the right folder or file on that server. The path is preceded by a slash, and there's a slash between every directory and subdirectory, like this:\nwww.example.com/folder/subfolder/filename.html\nThe last piece is the name of the file that is opened when you access the website. Although you may not see it in the address bar, that doesn't mean it isn't there. Some languages used to create web pages hide the file name and extension you're viewing. This makes the URL easier to remember and type, and gives it a cleaner look.\nQuery\nThe query portion of a URL is used to identify things that aren't part of a strict path structure. Most often, you'll see them used when you perform a search or when a web page delivers data through a form. The query portion is preceded by a question mark and comes after the path (or after the hostname if a path is not included).\nAs an example, take this URL presented when we searched Amazon for the keywords \"wi-fi extender\":\nhttps://www.amazon.com/s/ref=nb_sb_noss_2?url=search-alias%3Daps&field-keywords=wi-fi+extender\nThe search form passed information to Amazon's search engine. Following the question mark, you can see there are two parts to the query: a URL for the search (that's the \"url=search-alias%3Daps&field\" part) and the keywords we typed (that's the \"keywords=wi-fi+extender\" part).\nThat's a fairly simple example, and you'll often see URLs with additional (and more complicated) variables. For example, here's the URL when we searched Google for the keyword \"howtogeek\":\nhttps://www.google.com/search?q=howtogeek&rlz=1C1GCEA_enUS751US751&oq=howtogeek&aqs=chrome..69i57j69i60l4j0.1839j1j4&sourceid=chrome&ie=UTF-8\nAs you can see, there's some different information there. In this case, you can see that there's additional information indicating the search language, the browser we used (Chrome), and even the version number of the browser.\nFragment\nThe final component of a URL that you might see is called a fragment. The fragment is preceded by a hash mark (#) and is used to indicate a specific location on a web page. When coding a web page, designers can create anchors for specific text like headings. When the proper fragment is used at the end of a URL, your browser will load the page and then jump to that anchor. Anchors and URLs with fragments are often used to create tables of content on web pages to make navigation easier.\nHere's an example. Wikipedia's page on the Renaissance is quite a long document, and it's broken up into about 11 sections, each of which has multiple subsections. But each heading on the page has an anchor included, and a table of contents at the top of the article includes links that let you jump to the different sections. Those links work by including fragments.\nYou can also use these fragments directly in your address bar or as shareable links. Say, for example, you wanted to show somebody the section of that page that covers Russia. You could just send them this link:\nhttps://en.wikipedia.org/wiki/Renaissance#Russia\nThat \"#Russia\" part at the end of the URL jumps them straight to that section after loading the page.\nSo there you have it---more than you likely ever wanted to know about how URLs work.\nImage Credit: Pawel Horazy/Shutterstock"
    },
    {
      "url": "https://www.howtogeek.com/395616/how-to-create-a-drop-down-list-in-google-sheets/",
      "text": "If you're working with others on a shared Google Sheets file, sometimes people can enter unexpected data or something that breaks a formula. One way to ensure everyone enters the data you want is to provide it for them in a drop-down validation list.\nHow to Create a Drop-Down List\nA drop-down list is a great way to ensure the data people enter into your form, application, or spreadsheet is exactly what you're expecting. It also provides a much faster way for people to input that data since they're selecting from a pre-configured list you provide.\nThe first thing you need to do is open up your Google Sheets file and select the cell(s) for which you want to use a drop-down list.\nNext, open the \"Data\" menu and select the \"Data Validation\" command.\nFrom the Criteria drop-down, choose either \"List From a Range\" or \"List of Items.\"\n-\nList From a Range: A list of values that have been selected from other cells in the same or a different sheet. For example, if you want to use the values in cells B1-B9 on sheet 2, you'd type\nto have the data contained in them appear in the drop-down list, or by selecting any of the cells from your Sheet directly.Sheet2!B1:B9\n- List of Items: A list of predetermined data items. This can be either text or numbers, and you'll type each value yourself, separating them by commas (and no spaces). This option does not allow you to insert data directly from other cells.\nHere, we're using the \"List of Items\" option and providing several numeric choices.\nAfter you've entered the data you want to appear in a drop-down list, make sure you have \"Show Drop-Down List In Cell\" option enabled or else the values won't appear in the selected cells.\nYou can also select what happens when someone tries to enter a value that isn't on the list. The \"Show Warning\" option lets them enter the invalid data, but marks it in the sheet (we'll look at how in just a bit). The \"Reject Input\" option prevents them from entering anything that's not on your list.\nAnd finally, you can enable the \"Show validation help text\" option to give people some indication about what they can choose in the cells. After selecting the option, type whatever instructions you want.\nGo ahead and click \"Save\" when you're done.\nHow to Use Your New Drop-Down List\nWhen you're done, anyone using the sheet can click the drop-down arrow in those cells and choose a value from the list.\nIf you selected the \"Show validation help text\" option, that text pops up whenever anyone selects one of the validated cells.\nIf someone enters a value that does not match something on the list and you have the \"Show Warning\" option turned on, the invalid data is marked in the cell.\nHovering your mouse over it shows why it's marked.\nIf instead, you have the \"Reject Input\" option selected, people will get a warning like this one when they try to enter anything that isn't on your list.\nIf you need to remove or modify any of the items from your drop-down list head back to Data > Data Validation to edit any items from the lists you've created. Removing the list completely is as easy as clicking the \"Remove Validation\" button located at the bottom."
    },
    {
      "url": "https://www.howtogeek.com/google-sheets-microsoft-excel-which-should-you-use/",
      "text": "Quick Links\nChoosing whether to use Excel or Sheets can be a difficult decision. Excel is widely known for its advanced features, while Google Sheets is famous for its collaboration power. Let's examine these traditions—and some other important features—so you can decide which program is truly the best for you.\nData Analysis\nSpreadsheets are primarily designed to enable quick data calculation and analysis. Whether you have two columns or two hundred columns, you can make the spreadsheet do the complex mathematical work for you. What's more, if you're new to working on spreadsheets, both Sheets and Excel have formula creation tools to walk you through the process—simply click the fx icon in Excel or the ∑ icon in Sheets, and you'll see easy-to-follow formula creation guidance appear on-screen.\nWhile both Sheets and Excel have extensive formulas to choose from, Excel is the better option for its specific focus on this area. For example, whether you're using Excel for the web or the desktop app, there's a dedicated Formulas tab, where you can browse the different functions available depending on the task you want to carry out, a feature not yet supported by Sheets.\nExcel also offers advanced functions that Google Sheets doesn't yet have, including the TAKE function (lookup and reference), the GROUPBY and PIVOTBY functions (data aggregation), and STOCKHISTORY (financial).\nThere are some advanced data analysis tools at your disposal if you're using Google Sheets through an organization or education edition—Google's Connected Sheets lets you analyze data through BigQuery without the need for .csv exports, but you'll need some training to get used to it.\nVerdict—Whether you're looking for basic or complex data analysis tools, Excel really is the winner, even if you're using the free Excel for the web version of the program. Excel's dedicated Formulas tab means you can navigate the functions more easily, and its more advanced formulas mean that you can analyze and automate your data more comprehensively.\nData Visualization\nOnce you've manipulated your data using the functions and formulas available in Excel or Sheets, you might want to present the information in a chart. You can either do this through the Chart option on the Insert tab in either program, or by first creating a pivot table that makes it easier for you to present your chart in more specific and custom ways.\nIf you go for the first option (creating a chart directly from the raw data in your spreadsheet), where Excel prevails is through its recommended charts. Excel reviews the data you want to present graphically and offers suggestions as to which charts would work best for that information. This saves you time scouring the many options available for the perfect visual representation of your numbers.\nIf you prefer to use a pivot table, you can do this in both Excel and Sheets, and both give you the option to choose what is displayed in the columns and rows, whether you apply filters, and what overall totals you want to include.\nHaving created your pivot table, there are several options to choose from in either program, whether that be to reformat your pivot table, reorder your data, or add more information. However, if you want to get the most out of your pivot table, you'll need to access Excel's desktop app, where you can create a pivot chart tied to the data in your pivot table, change the field items and sets, insert slicers, or move your pivot table through a dedicated PivotTable Analyze tab.\nWhen you strip the two programs back to their fundamental chart data visualization, Sheets and Excel for the web both offer very similar charts and chart amendment options. But unsurprisingly, given it's only available through a paid subscription, Excel's desktop app offers significantly more choices and variants of its charts, useful if you're looking to create a comprehensive dashboard or a more visual spreadsheet.\nVerdict—If you're looking to visualize your data for free, both Excel for the web's and Google Sheets' pivot tables and charts are equally good options. However, if you're looking for more chart options or more table analysis tools, you might consider subscribing to Microsoft 365 for access to the desktop app.\nCollaboration\nIn short, Google Sheets was built for live collaboration. As soon as you share a Google Sheet with someone else (providing you give them editing access to the worksheet), you can both work on it at the same time.\nYou can see who else is viewing or editing the sheet by looking in the top-right corner, where their initial will appear in a circle. Even more impressively, once you've added other people to your worksheet, you can chat in real time within the Sheets workbook.\nChanges made by others update instantly on the worksheet, and if they're adding data to a cell, it's grayed out so that you can't type in the same cell at the same time.\nExcel also facilitates real-time collaboration, but it's far less intuitive. When someone you have shared your workbook with opens it, it can take a few seconds for their presence to appear on your screen, and changes they make can take a while to sync with your copy. What's more, while Excel lets you directly email people collaborating on your worksheet, the in-program chat facility is only available if you've subscribed to a Microsoft 365 Business package.\nVerdict—While both Excel and Sheets allow collaboration, Google's product is much better for real-time joint work, and the in-program chat facility is available as a default option, making collaboration even more seamless.\nSimplicity vs. Advanced Tools\nWhether Excel or Sheets is better for general use depends on whether you're looking for advanced features and how savvy you are with spreadsheet technology.\nHaving been around for many more years than Google Sheets, Excel is far more advanced, with more menus, tabs on the ribbon, groups within each tab, and functions overall. This means that you can do a lot more in Excel than you can in Sheets. This is true for the free web-based version of Excel, and even more so for the subscription-only Excel desktop app. While this might lead you to conclude that Excel is the better program, to make full use of its features, you'll need to become an expert, and navigating its interface can take years to master.\nWhile being relatively less useful if you want to create a complex spreadsheet, Google Sheets is much better for simplicity. The interface is far more navigable and intuitive, and with its fewer menus and tabs, you can get your head around Sheets much more quickly than you can with Excel.\nVerdict—If you're a spreadsheet power user and want more complex functions and options, Excel is for you. However, if you want to create a relatively more straightforward spreadsheet, go for Google Sheets.\nSpeed and Lagging\nComparing the speeds of Excel and Sheets heavily depends on whether you're using the Excel app or Excel for the web. Excel's desktop app uses your computer's processor to process data, which (assuming you have a decent PC) means that the software works much more quickly than the browser-based Google Sheets and Excel for the web. These web-based spreadsheet programs can be slowed down significantly if you have large data quantities, many functions working simultaneously, or significant formatting.\nIf you're using a Chromebook, you can download a desktop version of Google Sheets to speed up your spreadsheet, but this option isn't available on most other computers.\nVerdict—Most web-based programs work more slowly than their desktop counterparts. If you have a heavily loaded worksheet, Excel's desktop app will certainly work more quickly for you, especially if you have a powerful PC, but if you only have a simple spreadsheet, you shouldn't encounter too many processing speed issues using Google Sheets or Excel for the web.\nOther Features\n- Form syncing—Excel for the web and Google Sheets both work in real time with their form counterparts. Microsoft Forms introduced the ability to sync your data to Excel for the web in early-2024 (though you can't live-sync to the Excel desktop app), and Google Forms has worked in tandem with Google Sheets since its inception.\n- AutoSave—As Google Sheets and Excel for the web are online programs, as soon as you create a new spreadsheet, they both upload your work to the cloud. To turn on AutoSave on the Excel desktop app, you first have to sign in to OneDrive before saving your sheet manually.\n- Offline work—Whether you're working on Excel for the web or Google Sheets, if your internet connection drops out, your sheet will automatically re-sync once you get back online. The Excel desktop app doesn't need an internet connection at all, but remember to save your work manually, as AutoSave won't work if your device is offline.\nExcel and Sheets aren't the only spreadsheet options for you to consider. Why not try out some of these free alternatives instead?"
    }
  ],
  "argos_summary": "The article explains how to use key Google Sheets functions—such as QUERY, IMPORTRANGE, GOOGLETRANSLATE, SPARKLINE, and XLOOKUP—providing syntax, examples, and tips for data import, translation, and visualization. It covers practical steps for handling permissions, dynamic ranges, and advanced query features like grouping and aggregation. The piece also compares Google Sheets to Microsoft Excel, highlighting differences in collaboration, feature sets, and user experience, and offers guidance on when each tool may be preferable.",
  "argos_id": "ZDHMHRUY4"
}