{
  "url": "https://www.aljazeera.com/news/2025/9/2/israeli-induced-starvation-in-gaza-kills-185-in-august-13-more-in-24-hours?traffic_source=rss",
  "authorsByline": "Al Jazeera",
  "articleId": "c4932834821d47db8400fff445865dfa",
  "source": {
    "domain": "aljazeera.com",
    "paywall": false,
    "location": {
      "country": "qa",
      "city": "Doha",
      "coordinates": {
        "lat": 25.2856329,
        "lon": 51.5264162
      }
    }
  },
  "imageUrl": "https://www.aljazeera.com/wp-content/uploads/2025/09/AFP__20250828__72NX2XM__v1__HighRes__PalestinianIsraelConflictGazaFood-1756806835.jpg?resize=1920%2C1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:52:16+00:00",
  "addDate": "2025-09-02T11:07:35.814907+00:00",
  "refreshDate": "2025-09-02T11:07:35.814909+00:00",
  "score": 1.0,
  "title": "Israeli-induced starvation in Gaza kills 185 in August, 13 more in 24 hours",
  "description": "More than 360 people, including 130 children, have died from hunger since the start of Israel’s genocidal war on Gaza.",
  "content": "More than 360 people, including 130 children, have died from hunger since the start of Israel’s genocidal war on Gaza.\n\nA total of 185 people in Gaza died “due to malnutrition” in August, according to Gaza’s Ministry of Health, as an additional 13 people, including three children, have died in 24 hours since then as the catastrophic effects of Israeli-induced famine in the enclave worsen.\n\nThe statement issued on Tuesday said more than 83 people, including 15 children, had died since the Integrated Food Security Phase Classification (IPC), a United Nations-backed global hunger-monitoring system, declared last month that parts of Gaza were undergoing a full-blown famine.\n\nThe Health Ministry also said 43,000 children below the age of five were suffering from malnutrition along with more than 55,000 pregnant and breastfeeding women. Two-thirds of pregnant women were suffering from anaemia, the highest rate in years, it added. Mothers and newborns are the most at risk from malnutrition.\n\nThe total number of hunger-related deaths in the besieged enclave now stands at 361, including 130 children, since the start of Israel’s genocidal war on Gaza on October 7, 2023.\n\nIsrael has killed at least 63,557 people in Gaza and wounded 160,660 during the war.\n\nThe IPC declared on August 22 that 514,000 people in the Gaza Strip, close to a quarter of the enclave’s population, are experiencing famine. It expected the number to rise to 641,000 by the end of September.\n\nThe IPC made its declaration after more than 22 months of war, during which Israeli forces have destroyed medical facilities, schools, infrastructure and bakeries; blocked the entry of aid into the besieged Strip; and targeted and killed Palestinians seeking food aid.\n\nThis is the first time the IPC has recorded famine outside Africa, and the global group predicted that famine conditions would spread to Deir el-Balah in central Gaza and Khan Younis in the south by the end of this month.\n\nAfter the IPC’s declaration, UN Secretary-General Antonio Guterres called the famine a “man-made disaster, a moral indictment and a failure of humanity itself”.\n\nGuterres said Israel had “unequivocal obligations” under international law as an occupying power to ensure food and medical supplies enter Gaza.\n\nHumanitarian organisations have demanded action. For its part, Israel rejected the findings, saying there was no famine in Gaza despite the IPC’s overwhelming evidence.\n\nAt least 54 Palestinians, including several aid seekers, were killed in Israeli attacks across Gaza since dawn on Tuesday, Al Jazeera correspondent Tareq Abu Azzoum reported at midday from Deir el-Balah. Israeli attacks are now focused on Gaza City as the Israeli army bombs it and tries to forcibly displace its residents to the southern part of the enclave.\n\n“Civilians on the ground are bearing the brunt. There are still hundreds of thousands of families in Gaza City,” Azzoum said. “They refuse to leave because they know that there are no safe spaces in central and southern Gaza and they would rather stay close to their communities and what’s left of their houses.”\n\nOnce teeming and crowded with residential buildings, Gaza City had been home to one million Palestinians, nearly half of Gaza’s population, but it is now a landscape of rubble.\n\nThe world’s top genocide scholars formally declared that Israel’s war on Gaza meets the legal definition of genocide, marking a landmark intervention from leading experts in the field of international law.\n\nThe International Association of Genocide Scholars, a 500-member body of academics founded in 1994, passed a resolution on Monday stating that Israel’s policies and actions in Gaza fulfil the definition of genocide set out in the 1948 UN Convention for the Prevention and Punishment of the Crime of Genocide.",
  "medium": "Article",
  "links": [
    "https://www.aljazeera.com/news/2025/9/1/israeli-forces-kill-pregnant-woman-and-unborn-baby-in-gaza-city-assault",
    "https://www.aljazeera.com/news/2025/8/22/what-has-led-to-a-famine-being-confirmed-in-gaza#:~:text=The%20IPC%20says%20that%20more,starvation%2C%20destitution%20and%20death”.",
    "https://www.aljazeera.com/news/2025/6/27/israeli-soldiers-ordered-to-shoot-at-unarmed-gaza-aid-seekers-report",
    "https://www.aljazeera.com/news/2025/8/31/israel-is-reducing-gaza-city-to-fields-of-rubble-kills-78-across-enclave",
    "https://www.aljazeera.com/news/liveblog/2025/9/2/live-israel-kills-17-palestinians-in-gaza-since-dawn",
    "https://www.aljazeera.com/news/2025/9/1/israel-committing-genocide-in-gaza-scholars-group-says",
    "https://www.aljazeera.com/news/2025/8/31/mothers-newborns-most-at-risk-as-israeli-induced-malnutrition-grips-gaza"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Gaza City",
      "weight": 0.10728471
    },
    {
      "name": "central Gaza",
      "weight": 0.10493592
    },
    {
      "name": "Gaza",
      "weight": 0.10401181
    },
    {
      "name": "famine conditions",
      "weight": 0.06462713
    },
    {
      "name": "Israel",
      "weight": 0.06267958
    },
    {
      "name": "famine",
      "weight": 0.06173771
    },
    {
      "name": "central and southern Gaza",
      "weight": 0.06018556
    },
    {
      "name": "the Gaza Strip",
      "weight": 0.055318035
    },
    {
      "name": "IPC",
      "weight": 0.055230718
    },
    {
      "name": "Gaza’s population",
      "weight": 0.055107635
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.77392578125
    },
    {
      "name": "/News/Other",
      "score": 0.69482421875
    },
    {
      "name": "/News/World News",
      "score": 0.65234375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.60400390625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.393310546875
    }
  ],
  "sentiment": {
    "positive": 0.048676483,
    "negative": 0.7991398,
    "neutral": 0.15218376
  },
  "summary": "Israeli-induced starvation in Gaza has killed 185 people in August alone, with an additional 13 people, including three children, in 24 hours. The Ministry of Health reported that over 83 people, mostly children, have died since the start of Israel's genocidal war on Gaza. The Integrated Food Security Phase Classification (IPC), a global hunger-monitoring system, declared parts of Gaza as a full-blown famine last month. The Health Ministry also revealed that 43,000 children below the age of five were suffering from malnutrition, along with over 55,000 pregnant and breastfeeding women. This is the first time the IPC has recorded famine outside Africa. UN Secretary-General Antonio Guterres called the famine a \"man-made disaster\" and stated that Israel had \"unequivocal obligations\" under international law as an occupying power to ensure food and medical supplies enter Gaza.",
  "shortSummary": "Israel's genocidal war on Gaza has led to over 360 deaths from hunger, with Israeli-induced famine causing significant malnutrition and violence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f0a848196d954fbfac94d94d6cb767b0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.aljazeera.com/news/2025/6/27/israeli-soldiers-ordered-to-shoot-at-unarmed-gaza-aid-seekers-report",
      "text": "Israeli soldiers ‘ordered’ to shoot unarmed Gaza aid seekers: Report\nThe Israeli news outlet, Haaretz, reports that soldiers operating near food aid sites in Gaza have deliberately fired upon Palestinians.\nIsraeli soldiers have deliberately shot at unarmed Palestinians seeking aid in Gaza after being “ordered” to do so by their commanders, the Israeli newspaper Haaretz reports.\nIsrael ordered an investigation into possible war crimes over the allegations by some soldiers that it revealed on Friday, Haaretz said.\nRecommended Stories\nlist of 3 itemsWar and Waste in Gaza\nIn an age of abundance and ceasefires, Gaza starves, and the war won’t stop\nAt least 549 Palestinians have been killed and 4,066 injured while waiting for food aid distributed at sites run by the Israeli-and United States-backed Gaza Humanitarian Foundation (GHF), the Gaza Government Media Office said on Thursday. The GHF has been a source of widespread criticism since its establishment in May.\nAccording to the Haaretz report, which quoted unnamed Israeli soldiers, troops were told to fire at the crowds of Palestinians and use unnecessary lethal force against people who appeared to pose no threat.\n“We fired machineguns from tanks and threw grenades,” one soldier told Haaretz. “There was one incident where a group of civilians was hit while advancing under the cover of fog.”\nIn another instance, a soldier said that where they were stationed in Gaza, between “one and five people were killed every day”.\n“It’s a killing field,” that soldier said.\nMethod of ‘control’\nThe Israeli army “strongly rejected” the accusations in the report, according to a military statement published on Telegram. “Any allegation of a deviation from the law or [military] directives will be thoroughly examined, and further action will be taken as necessary. The allegations of deliberate fire toward civilians presented in the article are not recognized in the field,” it said.\nIsraeli Prime Minister Benjamin Netanyahu and Defence Minister Israel Katz condemned the report, calling it “blood libel” on the Israeli Defence Forces (IDF), according to a statement carried by The Times of Israel news outlet.\n“The IDF operates under difficult conditions against a terrorist enemy that operates from within the civilian population,” they said. “IDF soldiers receive clear orders to avoid harming innocent civilians, and they act accordingly.”\nAccording to Haaretz, the Military Advocate General has told the army’s General Staff’s Fact-Finding Assessment Mechanism, which reviews incidents involving potential violations of the laws of war, to investigate suspected war crimes at these aid sites.\nOne of the authors of the report, Nir Hasson, told Al Jazeera that the Israeli directive to fire on civilians is part of a method to “control” the aid seekers.\n“It’s actually a practice of … controlling the crowd by fire, like if you wanted the crowd to run off [from] a place, you shoot them at them, even though you know they are unarmed … You use fire to move people from one point to another,” he said from West Jerusalem.\nWhile the journalist and his colleagues do not know the name of the commander who might have issued such a directive, Hasson said that he would likely hold a position high up in the army.\nDespite this practice at these sites, most Israelis and the army’s troops still believe the war on Gaza is just, even while some cracks are emerging in this understanding, the journalist said.\n“[There are] more and more people who are asking themselves if this war is necessary, but also what is the humanitarian price the Gazan population is [paying] for this war,” he said.\n‘A death trap’\n“War crimes” are taking place at GHF aid distribution sites in Gaza, the enclave’s Government Media Office said in a statement, referencing “the shocking confessions” published by Haaretz.\n“The report’s direct military orders to fire on unarmed civilians who pose no threat, and the use of heavy machine guns, artillery, and shells against peaceful gatherings waiting for food, are further evidence that the Israeli occupation army is pursuing a systematic policy of genocide under the false guise of ‘relief’,” the statement added.\nReporting from Amman, Jordan, Al Jazeera’s Hamdah Salhut said the Haaretz report is “shocking”.\n“People in Gaza have said these distribution centres have now become a death trap for Palestinians,” Salhut said. “Aid groups have said that Palestinians are left with no choice – to either starve to death, or die seeking the very little food that is offered in the distribution centres run by the GHF.”\nThe GHF operates four sites in Gaza – one in the centre and three in the south – and attacks on aid seekers have only increased since an Israeli blockade was lifted and the Foundation started distributing food at the end of May.\nOn Friday, medics said six people were killed by gunfire as they tried to get food in southern Gaza.\nThe GHF has come under intense condemnation by aid groups, including the United Nations, for its “weaponisation” of vital items.\n“We don’t need a report of that nature to acknowledge that there have been massive violations of international law [in Gaza],” UN Secretary General Antonio Guterres said in response to a question from Al Jazeera about the Haaretz report. “And when there is a violation of international law, there must be accountability,” he added at a press conference in New York.\nElsewhere on Friday, medical charity Doctors Without Borders, known by its French initials, MSF, called the GHF’s aid distribution sites “slaughter masquerading as humanitarian aid”.\nSince Israel began its war on Gaza in October 2023, at least 56,331 people have been killed, with 132,632 wounded in Israeli attacks, Gaza’s Health Ministry reported."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/31/mothers-newborns-most-at-risk-as-israeli-induced-malnutrition-grips-gaza",
      "text": "Mothers, newborns most at risk as Israeli-induced malnutrition grips Gaza\nAn estimated 55,500 malnourished pregnant and breastfeeding women require an urgent nutrition response.\nIn an overcrowded clinic in central Gaza’s Nuseirat refugee camp, Samar Abu Ajwah clutched her frail newborn as he burst into weak sobs.\nEyad has been diagnosed as malnourished, weighing only 1.9kg (4.2lb). “He needs milk, and we are appealing for help from people who can afford it because we cannot,” Abu Ajwah, who also suffers from malnutrition caused by Israel’s punishing blockade of humanitarian aid, told Al Jazeera.\nRecommended Stories\nlist of 3 itemsSumud, the largest flotilla to sail for Gaza, prepares to set out\nHamas’ ambush will have “tactical consequences on Israeli army”\nAmeera Tafesh brought Ru’a, her emaciated six-month-old, to the clinic hoping to find nourishment. “I breastfed her when she was born, but it lasted only a week because I couldn’t produce enough milk,” she told Al Jazeera. “I need to feed her formula, but it’s not available.”\nAl Jazeera’s Hind Khoudary, reporting from Nuseirat, said mothers are desperate to find food to feed their children and themselves amid Israeli-induced starvation in the enclave.\nSince Israel unilaterally broke a ceasefire in March, it has prevented the distribution of food and other aid through the United Nations and humanitarian agencies, instead setting up a handful of aid distribution sites controlled by its army, backed by the United States and operated by the US-based agency GHF.\nIsraeli soldiers and GHF security contractors have opened fire on aid seekers at the sites, killing more than 2,200 Palestinians and injuring more than 16,225 since the GHF began operations in late May, the Gaza Ministry of Health reported.\nUN agencies have called the system “an abomination” and “a death trap” and repeatedly asked Israel to be allowed to resume their own distributions.\nA global hunger monitor, the Integrated Food Security Phase Classification (IPC) initiative, confirmed this month that famine is occurring in the northern part of the Strip and said it is projected to spread to central and southern areas by the end of September.\nBy then, almost a third of the population of Gaza – nearly 641,000 people – are expected to face catastrophic conditions.\nWomen, newborns at acute risk\nThe IPC analysis warned that pregnant women and newborns are at acute risk of starvation. An estimated 55,500 pregnant and breastfeeding women are suffering from malnutrition and require an urgent nutritional response, according to its report.\nIt added that at least 132,000 children under the age of five will be at risk of death from acute malnutrition by June.\nAccording to Gaza’s Health Ministry, 339 people so far during the war have died due to famine and malnutrition, including 124 children.\nUN Secretary-General Antonio Guterres described famine in Gaza as a “man-made disaster, a moral indictment and a failure of humanity itself.”\nIsrael does not accept that there is widespread malnutrition among Palestinians in Gaza and has disputed fatality figures.\nThe UN Population Fund, the UN’s sexual and reproductive health agency, said mothers in Gaza were being “forced to give birth while malnourished, exhausted and at heightened risk of death”.\n“It means their babies are born too small, too weak or too early to survive. It means mothers unable to breastfeed because they, too, are starving,” the agency said in a statement.\n“No woman should be forced to give birth in famine conditions. No child should begin life starving. Every day of inaction condemns more mothers and newborns to suffering.”\nUNICEF Executive Director Catherine Russell repeatedly warned of “unmistakable” signs of spreading malnutrition: “children with wasted bodies, too weak to cry or eat; babies dying from hunger and preventable disease; parents arriving at clinics with nothing to feed their children”.\n“There is no time to lose. Without an immediate ceasefire and full humanitarian access, famine will spread, and more children will die,” she said."
    },
    {
      "url": "https://www.aljazeera.com/news/liveblog/2025/9/2/live-israel-kills-17-palestinians-in-gaza-since-dawn",
      "text": "Live updatesLive updates,\nLIVE: Israel starves 13 more Palestinians to death, kills 73 since dawn\nIsraeli forces continue to attack people seeking food aid as the death toll from famine rises further in Gaza.\nThis video may contain light patterns or images that could trigger seizures or cause discomfort for people with visual sensitivities.\nPublished On 2 Sep 2025\n- Gaza’s Health Ministry records 13 deaths, including three children, “due to starvation and malnutrition over the past 24 hours”, bringing the total number of hunger-related deaths to 361, 130 of them children.\n- At least 73 Palestinians have been killed in Israeli attacks across Gaza since dawn, including 42 in Gaza City, according to medical sources speaking to Al Jazeera."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/22/what-has-led-to-a-famine-being-confirmed-in-gaza#:~:text=The%20IPC%20says%20that%20more,starvation%2C%20destitution%20and%20death”.",
      "text": "What has led to a famine being confirmed in Gaza?\nThe UN-backed IPC has found that Gaza now faces famine after 22 months of Israel’s war on the Palestinian territory.\nA United Nations-backed global hunger monitor has determined that famine is now occurring in Gaza City and its surrounding area.\nThe Integrated Food Security Phase Classification (IPC) had previously warned that Gaza was on the verge of famine, but now says for the first time that the events of the past few months – including a new Israeli offensive, increased displacement and weeks of total Israeli blockade of the territory – have made famine a reality in Gaza.\nRecommended Stories\nlist of 3 itemsNetanyahu approves Gaza City seizure despite ordering truce talks to resume\nIsraeli data shows 83 percent of Gaza war dead are civilians: Report\nThe IPC experts warn that famine will spread to other areas of Gaza if nothing is done to stop Israel’s war and ramp up humanitarian aid. Let’s take a closer look.\nWhat were the main findings of the report?\nThe main finding is that famine is no longer a threat to Gaza – it is now a reality. The IPC says that more than 500,000 people in the Gaza Strip now face “catastrophic conditions”, the highest level in its food insecurity classification, “characterised by starvation, destitution and death”.\nIn the Gaza Governorate, which includes Gaza City, the IPC found that 30 percent of the population is facing catastrophic conditions, with 50 percent facing an “emergency”, the level below. Conditions in North Gaza governorate are believed to be “as severe – or worse – than in Gaza Governorate”, but the IPC is unable to classify the area because of limited data.\nThe IPC also projects that famine will also be present in Deir el-Balah and Khan Younis governorates by the end of September. The IPC already determines that 25 and 20 percent of the population in those governorates respectively, are already classified as being in a level 5 catastrophe.\nIt also projects that 132,000 children between five and six years of age will suffer from acute malnutrition before June of next year, as well as 55,000 pregnant and breastfeeding women and 25,000 infants needing urgent nutrition support.\nRafah, the southernmost governorate in Gaza, was not analysed by the IPC because it has been largely depopulated of Palestinians as a result of Israeli military operations.\nHow did the IPC conclude that a famine has begun in Gaza?\nThe IPC has a five-stage food insecurity classification, with “catastrophe” the worst. A catastrophe is classified as when “households experience an extreme lack of food and/or cannot meet other basic needs even after full employment of coping strategies”.\nIn a level 5 catastrophe, “starvation, death, destitution and extremely critical acute malnutrition are evident”.\nHowever, a famine classification is separate from this. For a “famine with reasonable evidence” to be declared, as it now has in Gaza, there must be clear evidence that two of three thresholds for acute food insecurity, acute malnutrition and mortality have been reached. The thresholds are that at least 20 percent of households “have an extreme lack of food and face starvation and destitution”, that acute malnutrition in children under five affects 30 percent or more, and that there are at least two deaths per 10,000 per day as a result of food insecurity.\nWhat does the IPC say has caused the famine in Gaza?\nThe IPC blames four factors it says are “man-made”: conflict, displacement, restricted access, and food system collapse.\nIsrael’s war in Gaza has already killed more than 62,000 Palestinians in the 22 months since it began. The IPC points out that fatalities and injuries rose dramatically in July, with an average of 119 deaths a day, nearly double the average of the previous month.\nIsrael’s continued offensives have led to many rounds of displacement for Gaza’s population – with the IPC reporting that 1.9 million people have been displaced more than once since the start of the war. The constant moving and lack of safe accommodation have contributed to the deterioration of Gaza’s food security situation, along with the destruction or inaccessibility of 98 percent of Gaza’s cropland and a ban on fishing activity.\nTo make matters worse, Israel imposed a total blockade on supplies of food and other goods, including water, medicine and fuel, to Gaza in mid-March. It has since lifted the total blockade, but severe restrictions on imports remain.\nWhy is the IPC determination so important?\nThe IPC is recognised as the main tool the international community and the UN use to determine food insecurity levels around the world.\nThe data the IPC provides is vital in heading off future food crises and preventing famine. It can also rally the international community to act early enough to stop famine from taking place, or end a famine once it has started.\nThe process of classifying a famine is complicated and there are multiple stages, with input from a wide array of bodies and groups, before it goes to a Famine Review Committee made up of “leading independent international food security, nutrition and mortality experts”. In the IPC’s words, this committee must “conduct a review to ensure technical rigour and neutrality of the analysis before the results are confirmed and communicated”.\nThe IPC has previously classified famines in Somalia in 2011, in South Sudan in both 2017 and 2020, and in Sudan in 2024.\nWhat has the reaction been?\nUN Secretary-General Antonio Guterres called the famine a “man-made disaster, a moral indictment, and a failure of humanity itself”.\nGuterres said Israel had “unequivocal obligations” under international law to ensure that food and medical supplies entered Gaza, as it is the occupying power.\n“Famine is not only about food; it is the deliberate collapse of the systems needed for human survival,” Guterres said. “People are starving. Children are dying. And those with the duty to act are failing.”\nHumanitarian organisations are demanding action.\n“Today’s findings must be a wake-up call for the international community,” said David Miliband, the president of the International Rescue Committee. “Without immediate, unhindered humanitarian access and a ceasefire, more lives will be lost to starvation and disease.”\nFor its part, Israel has rejected the findings, saying there was no famine in Gaza, despite the evidence from the IPC.\n“Over 100,000 trucks of aid have entered Gaza since the start of the war, and in recent weeks a massive influx of aid has flooded the Strip with staple foods and caused a sharp decline in food prices, which have plummeted in the markets,” Israel’s Ministry of Foreign Affairs said in a statement."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/9/1/israel-committing-genocide-in-gaza-scholars-group-says",
      "text": "Israel committing genocide in Gaza, scholars group says\nLeading genocide scholars formally declare that Israel’s war on Gaza meets the UN’s definition of genocide.\nThe world’s top genocide scholars have formally declared that Israel’s war on Gaza meets the legal definition of genocide, marking a landmark intervention from leading experts in the field of international law.\nThe International Association of Genocide Scholars (IAGS), a 500-member body of academics founded in 1994, passed a resolution on Monday, stating that Israel’s policies and actions in Gaza fulfil the definition of genocide set out in the 1948 United Nations Convention for the Prevention and Punishment of the Crime of Genocide.\nRecommended Stories\nlist of 4 items‘Fields of rubble’: Israel, destroying Gaza City, kills 78 across enclave\nHalf of US voters believe Israel committing genocide in Gaza, poll says\nHistory says the genocide in Gaza will be recognised – eventually\n“This is a definitive statement from experts in the field of genocide studies that what is going on on the ground in Gaza is genocide,” said Melanie O’Brien, IAGS president and professor of international law at the University of Western Australia, speaking to the Reuters news agency on Monday.\nThe resolution won overwhelming support, with 86 percent of members voting in favour. It called on Israel to halt “deliberate attacks on civilians, including children; starvation; deprivation of humanitarian aid, water, fuel, and other essentials; sexual and reproductive violence; and forced displacement”.\nSergey Vasiliev, professor of international law at the Open University of the Netherlands, told Reuters the declaration reflected a consensus that has taken root in academia. “This legal assessment has become mainstream within academia, particularly in the field of genocide studies,” he said.\nIsmail al-Thawabta, head of Gaza’s Government Media Office, said the “prestigious scholarly stance reinforces the documented evidence and facts presented before international courts”. He added that the resolution “places a legal and moral obligation on the international community to take urgent action to stop the crime, protect civilians, and hold the leaders of the occupation accountable”.\nIsrael’s growing legal woes\nThe resolution came as Israel faces a separate case at the International Court of Justice at The Hague, where it is already accused of genocide.\nThe International Criminal Court has issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant for war crimes and crimes against humanity.\nSince Israel launched its war on Gaza in October 2023, more than 63,000 Palestinians have been killed, nearly all residents have been displaced at least once, and most of Gaza’s buildings have been destroyed or damaged.\nA UN-backed global hunger monitor has confirmed the famine in parts of Gaza, a direct result of Israel’s blockade and bombing campaign that has deliberately restricted food, water, and medicine.\nIAGS has previously recognised genocides in Bosnia and Herzegovina, Rwanda, Armenia, and Myanmar. The UN convention it cites defines genocide as crimes committed “with intent to destroy, in whole or in part, a national, ethnic, racial or religious group”.\nThe resolution also said Hamas’s attack on southern Israel on October 7, 2023 constituted international crimes but emphasised that these acts do not justify genocide.\nHundreds of UN human rights staff last week urged High Commissioner Volker Turk to explicitly label Israel’s campaign as genocide, underscoring growing international consensus."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/9/1/israeli-forces-kill-pregnant-woman-and-unborn-baby-in-gaza-city-assault",
      "text": "Israeli forces kill pregnant woman and her unborn baby in Gaza City assault\nScenes of chaos play out in Gaza City, as military closes in on panic-stricken residents facing forced displacement.\nThe Israeli military has killed a pregnant woman and her unborn baby near the Shati refugee camp as it continued its large-scale assault on Gaza City, with several strikes targeting civilians.\nMedical sources at Gaza City’s al-Shifa Hospital said that another child was also killed in the attack on a house near the camp on Monday, according to the Wafa news agency.\nRecommended Stories\nlist of 3 itemsGaza school year starts but barely any children are in lessons\nNews outlets ‘blackout’ for Gaza to protest journalist killings\nThe military also continued to pummel the Zeitoun and Sabra neighbourhoods in the south of the city, where more than 1,000 buildings have been levelled since Israel began its push to take over the urban centre last month, killing 10 people on Monday.\nEarlier in the day, scenes of chaos played out at a crowded market on Gaza City’s Nasser Street, with locals scattering in all directions amid the debris after an Israeli attack, which killed at least four people and wounded dozens of others.\nReporting from the scene, Al Jazeera’s Moath al-Kahlout said people were panic-stricken.\n“They don’t know what to do and where to go. They are trying so hard to find a safer place, but the Israeli army keep attacking every corner in the city,” he said.\nFurther south, in Deir el-Balah, Israel targeted a group of citizens inside Al-Mazra’a School. Later, Al-Aqsa Martyrs Hospital announced the death of Anas Saeed Abu Mughsib, Wafe reported.\nMedical sources said that in total, at least 59 people were killed in Israeli attacks across the Strip on Monday.\n‘Man-made famine in the 21st Century’\nAlready displaced by war multiple times, Gaza City residents now face the twin threats of war and famine.\nHunger caused by Israel’s months-long blockade led to the deaths of three infants on Monday. Children account for more than a third of the nearly 350 deaths from hunger and starvation in the enclave since Israel’s war began in October 2023.\nAuthorities say the number of humanitarian aid trucks that Israel has allowed into the Strip in the last month has only met 15 percent of the starving population’s needs.\nYet, Israeli Prime Minister Benjamin Netanyahu rejected a report in August from the world’s leading authority on food crises, the Integrated Food Security Classification (PIC), that famine was under way in Gaza City, calling it an “outright lie”.\nOn Monday, United Kingdom Secretary of State for Foreign Affairs David Lammy acknowledged the United Nations-backed IPC declaration, saying he was “outraged” by Israel for not allowing enough aid to enter Gaza.\n“This is not a natural disaster, it’s a man-made famine in the 21st century,” he said.\n“We need a massive, massive humanitarian response to prevent more deaths, crucial NGOs, humanitarians and health workers allowed to operate, and stockpiles of aid on Gaza’s borders released.”\n‘Power-hungry ruler’\nMeanwhile, in Israel, mourners gathered for the separate funerals of Idan Shtivi and Ilan Weiss, captives taken from Israel during the October 2023 Hamas attack, whose remains were recovered in an Israeli military operation in Gaza last week.\nSome expressed anger at the government for not reaching a deal with Hamas to end the fighting and return the remaining captives.\n“It’s a horror, it’s profound sadness and grief beyond words to describe the anger, the insult to the hostages, the insult to the fallen, the insult to the soldiers sent once again to Gaza,” mourner Ruti Taro told The Associated Press news agency.\n“No one knows why, except for the power-hungry ruler,” he said.\nIsraeli news site Ynet reported on Monday that Israeli army chief Eyal Zamir had warned of the implications of Netanyahu’s intention to take over Gaza without making any post-war plans.\n“You are heading to a military government,” Zamir reportedly told a meeting of the Israeli security cabinet late on Sunday. “Your plan is leading us there. Understand the implications”.\nIsrael’s war on Gaza has so far killed more than 63,000 Palestinians. About one million inhabitants of Gaza City, many of whom have already been displaced multiple times, are now being forced out under sustained Israeli attacks, with no safe zones to flee to in the enclave."
    },
    {
      "url": "https://www.aljazeera.com/news/2025/8/31/israel-is-reducing-gaza-city-to-fields-of-rubble-kills-78-across-enclave",
      "text": "‘Fields of rubble’: Israel, destroying Gaza City, kills 78 across enclave\nOnce teeming and crowded with residential buildings, Gaza City is home to one million now facing forcible displacement.\nIsrael has stepped up its destruction of Gaza City as it plans to seize Gaza’s largest urban centre and forcibly displace around one million Palestinians to concentration zones in the south, as it killed at least 78 people across the besieged enclave since dawn, including 32 desperately seeking food.\nOn Sunday, in Gaza City, the Palestinian Civil Defence reported a fire in tents near al-Quds Hospital after Israeli shelling. At least five people were killed and three wounded when a residential apartment was hit near the Remal neighbourhood.\nRecommended Stories\nlist of 3 itemsCould Western leaders be legally complicit in the Gaza genocide?\n‘Mayhem, chaos’ in Gaza City as Israel intensifies attacks, killing 47\nIsmail al-Thawabta, director of Gaza’s Government Media Office, said the Israeli army is also using “explosive robots” in residential areas and forcibly displacing Palestinians in Gaza City.\nIn a statement on X on Sunday, al-Thawabta said the army has detonated more than 80 such devices in civilian neighbourhoods over the past three weeks, calling it a “scorched-earth policy” that has destroyed homes and endangered lives.\nHe said more than one million Palestinians in Gaza City and the north of the enclave “refuse to submit to the policy of forced displacement and ethnic cleansing” despite the destruction and starvation caused by the Israeli assault.\nFootage posted on Instagram by Palestinian journalist Faiz Osama and verified by Al Jazeera showed the moments that followed an Israeli aerial attack on the Sabra neighbourhood, in the southern part of Gaza City.\nIn the footage, as plumes of smoke rise to the sky, a child can be seen screaming with a wound to the leg. A man also lays on the ground with what appears to be a head injury.\nThe video also shows the destruction left by the strike after residential buildings were flattened by the explosion.\nIsrael’s forces have carried out sustained bombardment on Gaza City since early August as part of a deepening push to seize the area in the latest phase of its nearly two-year genocidal war.\nOn Friday, the Israeli military said it had begun the “initial stages” of its offensive, declaring the area a “combat zone”.\n‘Fields of rubble’\nReporting from Gaza City on Sunday, Al Jazeera’s Hani Mahmoud said intensifying Israeli attacks have been turning parts of Gaza City, once teeming and crowded with residential buildings, into “fields of rubble”.\n“There is non-stop heavy artillery targeting the Zeitoun area and Jabalia, where we are seeing the systematic demolition of homes. There is hardly any fighting going on, but heavy artillery and bulldozers are moving from one street to the other, destroying all of these residential clusters,” he said.\n“The majority of people in those areas do not have the luxury to pack up and leave because there is no safety anywhere.”\nAnother Palestinian journalist was also killed on Sunday. A source at al-Shifa Hospital told Al Jazeera that Islam Abed was killed in an Israeli attack on Gaza City and that she worked for Al-Quds Al-Youm TV channel.\nThe Government Media Office said the “number of martyred journalists has risen to 247″ since the war began. Other tallies have put the number of journalists and media workers killed at more than 270.\nOn Monday, five journalists – one of whom worked for Al Jazeera – were among at least 21 people killed in an Israeli attack on Nasser Hospital in southern Gaza’s Khan Younis.\n‘Life is difficult, so we will stay in our home’\nMany residents in Gaza City are opting to stay put despite Israel declaring it a “combat zone”.\nIt was Gaza’s most populous city before the war began, home to about 700,000 people. Then hundreds of thousands fled under Israel’s forced evacuation threats before many returned, joined by thousands of other displaced from the south, during a January-to-March ceasefire, which Israel broke.\nFedaa Hamad, who was displaced from Beit Hanoon, said she has “no plans to leave” Gaza City this time despite Israel’s latest warning.\n“We are tired from the first displacement. Where are we going to go? Is there a place in the south? We cannot find it,” she said.\nAkram Mzini, a resident of Gaza City, said he would not leave “because displacement is very difficult”.\n“We were displaced to the south before, and displacement in the south is not simple and it is costly,” he said. “Life is difficult, so we will stay in our home, and whatever God wants will happen.”\nElsewhere in Gaza on Sunday, an Israeli attack on the centre of Deir el-Balah killed at least four people, Al Jazeera Arabic reported.\nEarlier, medical sources said an Israeli bombardment killed at least one person and wounded several in the city, located in the central part of the Gaza Strip.\nIsraeli forces have killed at least 78 Palestinians across Gaza since dawn, including 32 aid seekers, according to medical sources.\nSince the war began, Israel has killed at least 63,459 people and wounded 160,256. A total of 1,139 people were killed in Israel during the Hamas-led October 7, 2023, attacks, and about 200 were taken captive.\nOn Sunday, Israeli army chief Eyal Zamir held a situation assessment meeting with his top commanders, saying the military must “initiate” more attacks to surprise and reach its targets anywhere.\nMany more reserve soldiers will assemble this week “in preparation for the continued intensification of the fighting against Hamas in Gaza City”, Zamir was quoted as saying by the military.\nMeanwhile, the armed wing of Hamas said its fighters successfully attacked two invading Israeli military vehicles in Gaza City on Saturday.\nThe Qassam Brigades said a Merkava tank of the Israeli army was hit with a Yassin-105 shell, while a D9 military bulldozer was targeted with an explosive device on a street southwest of the Zeitoun neighbourhood of the besieged area.\nAs global condemnation against the situation grows, in the largest attempt to break the Israeli blockade of the Palestinian territory by sea, the Global Sumud Flotilla left the Spanish port city of Barcelona on Sunday.\nThe flotilla’s launch comes after the United Nations-backed Integrated Food Security Phase Classification (IPC) declared a state of famine in Gaza this month.\nThe Global Sumud Flotilla, which describes itself as an independent group not linked to any government or political party, did not say how many ships would set sail or the exact time of departure, but Swedish campaigner Greta Thunberg spoke of “dozens” of vessels.\nSumud means “perseverance” in Arabic.\nTwo previous attempts by activists to deliver aid by ship to Gaza were blocked by Israel.\nMohamad Elmasry of the Doha Institute for Graduate Studies told Al Jazeera that while the flotilla was “an important act of symbolic resistance … ultimately, they will be intercepted”.\n“This is not going to solve the famine,” he said. “What’s going to solve the famine, ultimately, is governments doing their job to stop genocide and deliberate starvation programmes.”"
    }
  ],
  "argos_summary": "Israeli military actions have triggered a man‑made famine in Gaza, with the IPC confirming catastrophic conditions and 361 hunger‑related deaths, including 130 children, since the war began. Blockades, destruction of infrastructure, and restricted aid access have led to widespread malnutrition, especially among children under five and pregnant women. The UN and international scholars have labeled the situation as genocide, calling for immediate humanitarian relief and a ceasefire to halt further deaths.",
  "argos_id": "1ZSKG3VJ1"
}