{
  "url": "https://www.bloomberg.com/news/videos/2025-09-02/balance-of-power-early-edition-9-02-2025-video",
  "authorsByline": "bn",
  "articleId": "a12891052f244774a29ad619da328422",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i0.6HYcDsmOA/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T19:49:44.002000+00:00",
  "addDate": "2025-09-02T20:13:26.591505+00:00",
  "refreshDate": "2025-09-02T20:13:26.591506+00:00",
  "score": 1.0,
  "title": "US, India Keep Door Open to Trade Talks",
  "description": "On the early edition of Balance of Power, Bloomberg Correspondents Joe Mathieu and Kriti Gupta discuss the latest news from Washington. On today's show, Stonecourt Capital Partner Rick Davis, Harvard Kennedy School's Ash Center Democracy Visiting Fellow Jeanne Sheehan Zaino and former Acting White House Chief of Staff Mick Mulvaney.  (Source: Bloomberg)",
  "content": "> > LIVE FROM WASHINGTON, D.C., THIS IS \"BALANCE OF POWER\" WITH JOE MATHIEU AND KAILEY LEINZ. JOE: UNCERTAINTY RETURNS, IF IT EVER WENT AWAY. WELCOME TO THE TUESDAY EDITION OF \"BALANCE OF POWER.\" AS PRESIDENT XI TRIES TO REWRITE THE GEOPOLITICAL MAP, JUST AS AN APPEALS COURT RULES THAT MOST OF THE TRUMP TARIFF REGIME IS ILLEGAL. I’M JOE MATHIEU ALONGSIDE WASHINGTON. WE’VE GOT A LOT TO TALK ABOUT, AS LAWMAKERS RETURN TO TOWN WITH JUST OVER A DOZEN WORKING DAYS TO AVOID A GOVERNMENT SHUTDOWN. SO IT’S BACK TO WORK, BACK TO SCHOOL, AND IN YOUR CASE, BACK TO THE U.S.A. WELCOME. > > THANK YOU SO MUCH FOR HAVING ME. I FEEL LIKE THE TIMING IS PERFECT. IT’S ALMOST LIKE I PLANNED IT THIS WAY. JOE: WE’RE COUNTING DOWN TO A POTENTIAL SHUTDOWN AT THE END OF THIS MONTH. TARIFFS ARE UP IN THE AIR RIGHT NOW. AS LAWMAKERS COME BACK TO DEAL WITH THE JEFFREY EPSTEIN STORY AND EVERYTHING ELSE, WE HAVE A LOT OF QUESTIONS TO ANSWER AROUND HERE. THIS TARIFF MOVE, YOU MUST HAVE BEEN IN THE AIR SOMEWHERE BETWEEN LONDON AND THE UNITED STATES WHEN THAT HAPPENED. > > FEELS LIKE THE MARKETS HAVE BEEN ON EDGE SINCE LIBERATION DAY, REALLY, AND THEY’VE BEEN LOOKING FOR A REASON TO REALLY RESPOND. YOU WOULD HAVE THOUGHT THAT HAVING THAT COURT APPEALS KIND OF WORK AGAINST DONALD TRUMP WOULD BE A POSITIVE FOR THESE MARKETS, AND WE’RE NOT SEEING THAT TODAY. JOE: WE’RE NOT BECAUSE WE STILL DON’T KNOW WHAT’S GOING TO HAPPEN. HE’S GOING TO KEEP APPEALING THIS AND COULD REWROTE THE WHOLE TARIFF REGIME. WE WANT TO START WITH THE MARKETS. WE’LL BRING YOU A LIVE REPORT FROM THE WHITE HOUSE. WE’LL TALK TO JIM ABOUT THIS FASCINATING SESSION IN CHAIN AUTO, THE MEETING IN CHINA, AND WE’LL GO TO THE CENTER FOR STRATEGIC AND INTERNATIONAL STUDIES. LISA HAS THAT FOR US FROM WORLD HEADQUARTERS IN NEW YORK. > > WALL STREET KIND OF RETURN FROM THE LONG HOLIDAY WEEKEND ON A DOWN NOTE. THIS WEEK, TRADERS ARE LOOKING AHEAD TO KEY LABOR MARKET DATA, LOOKING FOR ANY CLUES ON ECONOMIC GROWTH, THE PATH OF INTEREST RATES, SO RIGHT NOW IF WE LOOK AT THE NASDAQ, IT’S DOWN MORE THAN 1.5%. THE DOW DOWN ABOUT .9%. THE S & P 500 DOWN MORE THAN 1%. IN THE YIELD SPACE, WE HAVE THE TWO-YEAR, 3.65%. THAT’S UP FOUR BASIS POINTS. AND THE YIELD ON THE 10-YEAR, 4.27%, THAT’S UP ABOUT FOUR BASIS POINTS. OVER TO COMMODITIES, WE HAVE GOLD THAT HIT A RECORD AT 3,591 AN OUNCE. OVER TO OIL, WE’LL GO TO W.T.I. CRUDE, UP MORE THAN 2.5% AT $65 A BARREL. THE BLOOMBERG DOLLAR SPOT INDEX UP ABOUT .4%. THE BRITISH POUND DOWN MORE THAN 1%. EURO DOWN ABOUT HALF A PERCENT. THE JAPANESE YEN DOWN ABOUT .7%. FEW COMPANIES MAKING NEWS, WE’LL START WITH ANTHROPIC. IT HAS CLOSED THE KEEL TO RAISE -- THE DEAL TO RAISE $13 BILLION FROM INVESTORS, A NEW FUNDING ROUND THAT TRIPLES THE VALUATION TO $183 BILLION. THEN KRAFT HEINZ, THEY PLAN TO SPLIT INTO TWO PUBLICLY TRADED COMPANIES. ONE INCLUDES HEINZ KETCHUP. THE SECOND INCLUDES SLOWER GROWING GROCERY PRODUCTS. SHARES DOWN MORE THAN 6.5%. ELLIOTT INVESTMENT MANAGEMENT BUILT A $4 BILLION STAKE IN PEPSICO. THE U.S. HAS PULLED THE WAIVER TO SHIP GEAR TO THE CHINESE BASE. YOU CAN SUBSCRIBE TO BLOOMBERG NEWS NOW, WHEREVER YOU GET YOUR PODCASTS. THAT IS THE BLOOMBERG BUSINESS FLASH. JOE: THANK YOU SO MUCH. WATCHING WALL STREET FOR US, WE’LL GET BACK TO LISA ABOUT 20 MINUTES FROM NOW TO CHECK IN ON THE TUESDAY TRADE, EVEN THOUGH WE ALL WANT TO SAY IT’S THE MONDAY TRADE. STILL REACTING ON THIS TUESDAY, FEELS LIKE A MONDAY, SESSION TO THE NEWS OF LATE FRIDAY, WHAT WE LIKE TO CALL THE FRIDAY NEWS DUMP, CAME FROM AN APPEALS COURT THAT CALLED INTO QUESTION THE ENTIRE BASIS, THE EMERGENCY STATUS FOR PRESIDENT TRUMP’S TARIFF REGIME. IT WOULD IMPACT MOST, IF NOT ALL OF THOSE TARIFFS. AND IT COINCIDES WITH A REMARKABLE MOMENT OVERSEAS. PRESIDENT XI HOLDING PRESIDENT PUTIN AND MODI FOR A VISIT THAT BLOOMBERG IS ASKING WHETHER IS REWRITING THE GEOPOLITICAL MAP AS WE KNOW IT. WE’LL TALK ABOUT THAT IN JUST A COUPLE OF MINUTES. LET’S START AT THE WHITE HOUSE. BLOOMBERG’S TYLER KENDALL IS STANDING BY ON THE NORTH LAWN. WE ARE EXPECTING TO HEAR FROM PRESIDENT TRUMP A LITTLE BIT LATER ON TODAY. TYLER, WHAT DO YOU HAVE? TYLER: JOE, THIS RULING REALLY IS DOMINATING THE HEADLINES AFTER THE WEEKEND. IT DID COME OUT PERHAPS ON THE QUIET END, CONSIDERING THAT IT WAS 5:00 P.M. EASTERN ON FRIDAY NIGHT. THIS REALLY HAS TO DO WITH THOSE TARIFFS ENACTED UNDER THE INTERNATIONAL EMERGENCY ECONOMIC POWERS ACT. SO FOR THOSE SO-CALLED RECIPROCAL TARIFFS, HE CITED PERSISTENT GLOBAL TRADE IMBALANCES. FOR TARIFFS AGAINST CANADA, MEXICO, PARTLY ON CHINA, HE SAID CONCERNS OVER THE BORDER AND FENTANYL. AND I’M BRINGING THIS UP, BECAUSE I WOULD EXPECT TO HEAR A LOT OF MESSAGING AROUND THIS FROM THE ADMINISTRATION AS WE ARE EXPECTING THE TREASURY SECRETARY SCOTT BESSENT AS SOON AS TODAY TO FILE A BRIEF TO THE SOLICITOR GENERAL, WHICH MEANS THAT THE WHITE HOUSE MIGHT HAVE THEIR SIGHTS SET ON APPEALING THIS ALL THE WAY UP TO THE SUPREME COURT. I THINK IT’S WORTH MENTIONING HERE THE COURTS HAVE BEEN DEFERENTIAL TO PRESIDENT WHEN’S IT COMES TO THEIR ABILITY TO INVOKE NATIONAL EMERGENCIES OF COURSE BUT AT THE SAME TIME, WE’VE NEVER SEEN A WHITE HOUSE INVOKE IEEPA IN ORDER TO IMPOSE TARIFFS, YET ALONE ONES THAT ARE SO BROAD RANGING. NOW, I DON’T NEED TO TELL EITHER OF YOU THAT THERE ARE TRILLIONS OF DOLLARS AT STAKE HERE WHEN IT COMES TO THIS DECISION. I WAS PRETTY STRUCK BY A RECENT ANALYSIS FROM THE COMMITTEE FOR A RESPONSIBLE FEDERAL BUDGET, WHICH FOUND THAT MANY THE SUPREME COURT UPHOLDS THIS RULING, 71% OF THE EXPECTED TARIFF REVENUE FOR THIS YEAR WOULD ALL BUT VANISH. BUT THAT DOESN’T MEAN THAT TARIFFS OR THE GOING AWAY. THE ADMINISTRATION IS LOOKING AT OTHER EARLY IN AUTHORITIES TO INVOKE TARIFFS GOING FORWARD, EVEN AS THEY PLAN TO APPEAL THIS RULING. > > YOU’RE TALKING ABOUT A LOT OF MONEY AT STAKE. TALK ABOUT HOW THIS BLEEDS INTO THE CORPORATE SPACE. WE KNOW THE WHITE HOUSE HAS BEEN KIND OF BACK IN TUG OF WAR, A LITTLE BIT OF LOVE AND HATE WHEN IT COMES TO NVIDIA. ANOTHER MAJOR CHIP COMPANY IN THE CROSSHAIRS, WALK US THROUGH IT. > > EXACTLY. AND YOU’RE HIGHLIGHTING WHAT WE SAW COME TO LIGHT TODAY AS THE TENSION, THAT PUSH AND PULL BETWEEN THIS ADMINISTRATION AS WELL AS CHIPMAKERS, WE SAW THEM MIRROR A SIMILAR MOVE TO LAST WEEK THAT BACKED SAMSUNG, ESSENTIALLY REVOKING THE AUTHORIZATION TO SHIFT ESSENTIAL GEAR TO ITS MAINLAND CHINESE OPERATION BASE. NOW, THE ADMINISTRATION HERE HAS REALLY HIGHLIGHTED THESE COMPANIES AS ONES THAT ARE WILLING TO WORK WITH THE WHITE HOUSE. THEY’VE PLEDGED TO RESHORE MANUFACTURING, BUT THEN ON THE OTHER HAND, YOU ALSO HAVE THEM NOW POLICING THEIR ACTIONS ABROAD. AND THAT COULD LEAD TO SOME DIFFICULTIES AHEAD, ONE OFFICIAL TELLS US HERE THAT U.S. OFFICIALS ALERTED THEM RECENTLY THEY WERE GOING TO REVOKE WHAT’S KNOWN AS THEIR VALIDATED END REDUCER STATUS. THINK OF THAT AS A BLANKITY PERMISSION, AND NOW THE COMPANY IS GOING TO NEED TO SEEK APPROVALS. WE KNOW WE COULD DIFFICULTY CONSIDERING THE U.S. IS DEALING WITH A BACKLOG OF EXPORT LICENSES. IT JUST ADDS UNCERTAINTY TO THE PICTURE HERE, PARTICULARLY ALWAYS THE U.S. HAS BEEN TRYING TO POUR TO THESE CHIP MAKERS TO GET ON BOARD WITH PRESIDENT TRUMP’S RESHORING AND MANUFACTURING VISION. JOE: THERE’S A LOT THERE. FROM A BEAUTIFUL NORTH LAWN ON THIS FIRST WEEK OF SEPTEMBER. TYLER KENDALL AT THE WHITE HOUSE. THIS TSMC HEADLINE IS REALLY SOMETHING. WE’RE ALSO TALKING ABOUT UPSETTING THE CHINESE AT A PERIOD OF TIME IN WHICH WE WERE SUPPOSED TO BE IN TALKS ABOUT A DEAL. WE GO AGAIN TO WASHINGTON. MICHELLE, REVOKING TAIWAN’S SEMICONDUCTORS AUTHORIZATION TO SHIP ESSENTIAL GEAR TO ITS MAIN BASE, JUST AS PRESIDENT XI SITS DOWN WITH PRIME MINISTER MODI AND VLADIMIR PUTIN FOR A WEEKEND OF FESTIVITIES AHEAD OF THE BIG MILITARY PARADE TOMORROW. BLOOMBERG IS WRITING ABOUT THE REDRAWING OF GEOPOLITICAL LINES. IS THAT WHAT WE’RE SEEING? > > YEAH, A LOT TO UNPACK, ESPECIALLY WITH ALL THREE LEADERS, XI, MODI AND PAIN ALL GETTING TOGETHER AT THE SHANGHAI COOPERATION ORGANIZATION MEETINGS, BILATERAL MEETINGS AS WELL. YEAH, YOU CAN CALL IT A REDRAWING OF THE GLOBAL MAP. I THINK WE’RE SEEING A LOT OF THE CULMINATING ENERGY AROUND THE BRICS COUNTRIES AND OTHERS THAT ARE FINDING THE ENEMY OF MY ENEMY IS MY FRIEND, BUT THEY’RE COMING TOGETHER WITH THIS FRUSTRATION OVER THE TRUMP TARIFFS AND THEY’RE FINDING WAYS TO DISSOLVE OLD DISPUTES THEY HAVE WITH EACH OTHER. HE SAW IT WITH XI AND MODI TALKING ABOUT RESOLVING BORDER DISPUTES THAT CAME TO BLOWS AT DIFFERENT TIMES, TALKING ABOUT COUNTER TERRORISM OPERATIONS AND BUILDING THEIR OWN BILATERAL TRADE TIES, RESTARTING DIRECT FLIGHTS BETWEEN THEIR TWO COUNTRIES. ALL OF THAT, I THINK WHAT YOU SEE IS A SORT OF ALMOST TAUNTING SIGNAL TO THE U.S. THESE PHOTOS, THESE EMBRACES, HAND SHAKES, SMILES, ALL OVER SOCIAL MEDIA THAT MODI CALLING PUTIN, SAYING IT WAS ALWAYS A DELIGHT TO MEET WITH PRESIDENT PUTIN, ALL MEANT TO NEEDLE AT PRESIDENT TRUMP, WHO SO FAR HAS NOT TAKEN THE BAIT, AND TYPICALLY LIKES TO PRETEND BRICS DOESN’T EXIST AND DOESN’T HAVE THE POWER THAT IT THINKS IT MIGHT HAVE. > > HOW MUCH IS JUST AN EXPANSION OF AN ECONOMIC RELATIONSHIP THAT REALLY HAS ALREADY EXISTED, ESPECIALLY WHEN IT COMES TO THE LIKES OF INDIA AND RUSSIA, FOR EXAMPLE, OIL, DEFENSE. IT FEELS LIKE THIS HAS BEEN IN THE WORKS FOR QUITE SOME TIME. > > YEAH, I THINK IN THAT CASE, IT’S CERTAINLY A DOUBLING DOWN OF WARM ECONOMIC TIES. WE DID SEE WHERE THIS IS CROSSING INTO THE UKRAINE-RUSSIA SITUATION. MODI REPORTEDLY SPOKE WITH PRESIDENT ZELENSKYY BEFORE HIS MEETING WITH PUTIN, BEFORE LEAVING FOR THAT TRIP. ZELENSKYY HAD SAID THAT HE WAS ASSURED THAT INDIA WOULD BRING THE APPROPRIATE MESSAGE, THE APPROPRIATE SIGNALS TO RUSSIA. I’M NOT SURE HE GOT WHAT HE WANTED OUT OF THAT BILATERAL MEETING THAT HAPPENED BETWEEN PUTIN AND MODI, BUT CERTAINLY THAT IS AN ELEMENT HERE THAT THEY’RE PLAYING, INDIA AND RUSSIA ARE TRYING TO PLAY TO THEIR ADVANTAGE, SAYING WE’RE NOT GIVING UP THESE DECADES-OLD TIES EITHER, EVEN THOUGH WE MIGHT NOT AGREE ON EVERYTHING THAT GOES ON WITH THE RELATIONSHIP AND WITH THE WAR ITSELF. THEY’RE SETTING THAT ASIDE. IT’S ALL ECONOMY AND ECONOMIC TIES FOR THEM IN THOSE MEETINGS. JOE: THE IDEA OF PRIME MINISTER MODI FOR 50 MINUTES IN VICE PRESIDENT’S LIMOUSINE, AFTER WE SAW PUTIN DO THE SAME WITH TRUMP FOR ONLY FIVE MINUTES. I’M SURE IT WAS NOT A COINCIDENCE. WHAT WERE THEY TALKING ABOUT? WHAT HAPPENED IN THAT CAR? > > WELL, THAT’S WHAT I MOON WHEN I SAY THIS IS PERHAPS SOME SORT OF TAUNTING SIGNAL. OUR COLLEAGUES ON THE OTHER SIDE CALL IT LIMO DIPLOMACY, AS YOU MENTIONED. YEAH, AFTER THIS REMARKABLE INVITATION BY PRESIDENT TRUMP TO HAVE PUTIN IN HIS VEHICLE, IN THE BEAST AS WE CALL IT, YOU KNOW, WITH ALL THE SECURITY IMPLICATIONS THAT SENDS, FOR PUTIN TO TURN AROUND AND THEN DO THE SAME FOR MODI AT A TIME WHEN BOTH COUNTRIES ARE HAVING TENSE RELATIONSHIPS WITH THE U.S., IT CERTAINLY DOES SEND A SORT OF DIPLOMATIC SIGNAL IN SOME WAYS. WE DON’T KNOW THE DETAILS OF WHAT THEY DISCUSSED, BUT THERE’S STILL PLENTY ON THE TABLE BETWEEN MODI AND PUTIN, AND CERTAINLY I THINK HOW TO KIND OF HELP TOGETHER THWART THE TRUMP TARIFF ENERGY WAS PROBABLY TOP OF THE LIST. > > MICHELLE, THOSE ARE THREE KEY ALLIES NOW, AND ASIA AS WELL. BUT THE SECONDARY SANCTIONS ARE SO INTERESTING TO ME, BECAUSE THIS IS SOMETHING THAT DONALD TRUMP HAS REALLY TAKEN A VERY FIERCE STEP FORWARD ON. YOU KNOW HOW EUROPEAN LEADERS SAY THEY’RE GOING TO BE DOING THE SAME THING, ESPECIALLY WHEN IT COMES TO TARGETING CHINA, INDIA. IT’S BEEN PUT OUT THERE, WHETHER IT ACTUALLY HAPPENS IS A DIFFERENT STORY. HOW EFFECTIVE COULD THAT BE? > > WELL, IT WILL BE -- IT WILL CERTAINLY CHANGE THE GAME, BECAUSE AS TO THIS POINT, WE HAVEN’T HAD BETWEEN ABE INVOLVED IN THAT -- HAD CHINA BE INVOLVED IN THAT TARGET OF SECONDARY SANCTIONS, AS WE’RE AWAITING A LEADER SUMMIT BETWEEN TRUMP AND AND I, SORT OF THAW BEING OF THAT SORT OF TRADE RELATIONSHIP. AND THEN WE GOT THE 90-DAY EXTENSION OF THE TRADE TRUCE WITH CHINA JUST LAST MONTH, A COUPLE OF WEEKS AGO. THERE’S KIND OF A HOLDING PATTERN THAT WE HAVE RIGHT NOW BETWEEN THE U.S. AND CHINA. BUT YEAH, THEY’RE ASKING, WHY JUST US? IF YOU’RE GOING TO DO SECONDARY SANCTIONS, WHAT’S GOING ON WITH CHINA? WHY AREN’T YOU TARGETING THEM FOR THESE SAME PENALTIES? JOE: LET’S TALK ABOUT SECONDARY TARIFFS AS THE PRESIDENT PUT IT AT THE TIME, SECONDARY SANCTIONS. THE DEADLINE JUST PASSED. IT WAS A 50-DAY DEADLINE. WE JUST PASSED IT TWO DAYS AGO, HAVING BEEN REVISED MULTIPLE TIMES. THERE’S NO END IN SIGHT WHEN IT COMES TO THE FIGHTING. THERE’S NO ACTUAL DEAL OR HOPE, IT SEEMS, FOR EVEN A CEASE-FIRE. AT WHAT POINT DO THESE SECONDARY SANCTIONS TAKE EFFECT? > > WE CERTAINLY HAVE A LOT OF OVERLAPPING DEADLINES. WE’VE GOT THE 90-DAY TRUCE WITH CHINA, DEADLINES THAT HAVE BEEN THREATENED, AND AS YOU KNOW, JOE, THE PRESIDENT IS FOND OF SAYING IN TWO WEEKS, USING THAT FOR MANY DIFFERENT ISSUES. SO WE’LL HAVE TO SEE HOW THESE COALESCE. I THINK WE’LL PROBABLY HEAR FROM THE PRESIDENT IN SOME FORM, IT SPEAKS TO THE NATURE OF THESE ISSUES. HE’S BEEN, I THINK, LOATHE TO COMMENT DIRECTLY ON THESE LEADERS’ MEETINGS, THE TRIUP INVITE OF FOLKS WE’VE BEEN TALKING ABOUT TODAY BECAUSE HE DOESN’TMENT TO LEND CREDENCE TO ANY POWER THAT WOULD GIVE THEM AGAINST THE U.S. RIGHT NOW. I SEE WHERE THESE OTHER POWERS ARE KIND OF PLAYING THEIR OWN GAME, TRYING TO PLAY TRUMP OFF HIMSELF, SO WE’LL SEE HOW THOSE CONVERSATIONS GO. BUT OBVIOUSLY WHEN YOU HAVE THESE CONVERSATIONS GOING ON THREE DIFFERENT TRACKS, WITH THREE DIFFERENT COUNTRIES, AND TRUMP WANTS TO WIN THEM ALL, IT’S GOING TO GET A LITTLE STICKY. JOE: GREAT ANALYSIS FROM MICHELLE, THE STORIES SHE’S REPORTING ON AND EDITING HERE IN WASHINGTON, D.C. LET’S ASSEMBLE THE PANEL. THEY’RE BOTH WITH US TODAY. BLOOMBERG POLITICS CONTRIBUTORS JEANNIE AND RICK DAVIS. RICK IS OUR WE STRATEGIST AND PARTNER AT -- REPUBLICAN STRATEGIST. AND JEANNIE IS A DEMOCRACY VISITING FELLOW, BLOOMBERG POLITICS CONTRIBUTOR. I’D LIKE TO GET INTO THIS WITH BOTH OF YOU. WE’VE BEEN TALKING ABOUT IT FOR A COUPLE OF YEARS WITH REGARD TO THE WAR IN UKRAINE, WITH REGARD TO RUSSIA AND, OF COURSE, AMERICA’S RELATIONSHIP WITH CHINA, WHICH IS EVOLVED IN INTERESTING WAYS BETWEEN BOTH THE BIDEN AND TRUMP ADMINISTRATION. RICK, WHAT WENT THROUGH YOUR MIND WHEN YOU SAW THESE IMAGES FROM OVER THE WEEKEND? PUTIN, AND I, MODI, HUGGING -- XI, MODI, HUGGING, LAUGHING, IN CHINA, NOT TO MENTION MODI AND PUTIN TOGETHER IN A VEHICLE FOR ALMOST AN HOUR. THESE LINES ARE BEING REWRITTEN BEFORE OUR EYES. IS IT BECAUSE OF THE TRUMP ADMINISTRATION? > > WELL, YOU DIDN’T SEE THIS KIND OF PARTICIPATION JUST A FEW YEARS AGO WITH THESE DIALOGUES. IT IS A TROUBLESOME SITUATION. TROUBLESOME THAT WE DON’T HAVE A BETTER RELATIONSHIP TODAY WITH INDIA, SOMEWHAT SPARKED BY THE PUNITIVE TARIFFS THAT PRESIDENT TRUMP HAS PUT ON THEM. BUT I POINT OUT ANOTHER ONE. TURKIYE’S ERDOGAN WAS THERE TOO, AND HE’S A MEMBER OF NATO. SO WE HAVE A NATO MEMBER SITTING IN A GROUP WITH ALL OF OUR GLOBAL ANTAGONISTS. IT’S GOT TO BE A WARNING SHOT FOR THE TRUMP ADMINISTRATION AND THEIR NATIONAL SECURITY GROUP TO START GETTING SERIOUS ABOUT HOW THEY PLAY THESE GLOBAL AFFAIRS. BECAUSE EVEN THOUGH AMERICA FIRST SAYS LET THEM DO WHATEVER THEY WANT TO DO, THIS IS NOT GOOD FOR DEMOCRACY AND FREEDOM AROUND THE WORLD. > > I FEEL LIKE WE’VE BEEN FOCUSING SO MUCH ON THE NEGATIVES OF THE. LET ME TAKE MY DEBBIE DOOMSDAY HAT OFF FOR A MOMENT AND PUT MY POSITIVE ONE ON. IF WE START TO SEE RELATIONS BETWEEN THE UNITED STATES THAW WITH EITHER PUTIN, XI OR MODI, DOES THAT HAVE A CASCADING EFFECT? > > I WISH I COULD JOIN YOU AND BE OPTIMISTIC, BUT I AM SO NOT. I THINK IN TERMS OF FOREIGN POLICY, THIS ADMINISTRATION JUST EIGHT MONTHS IN, IT HAS REALLY BEEN A DISASTER. YOU LOOK AT JUST THE IMPACT OF THE TARIFFS ON OUR ALLIANCES. IF YOU’RE GOING TO CONFRONT AND COMPETE WITH CHINA, THE ONE THICK YOU NEED IS ALLIES. YOU CANNOT WIN THIS COMPETITION WITHOUT THEM. AND WHAT DOES HE DO? HE GOES AND INFLICTS TARIFFS ON OUR CLOSEST ALLIES. INCLUDING, AS YOU GUYS WERE JUST TALKING ABOUT, INDIA, SECONDARY TARIFFS, AND, OF COURSE, THEY THUMB THEIR NOSE AT HIM, AND MODI GOES RIGHT OVER AND IS NOW WITH XI JINPING AND PUTIN. SO, YES, A THAW IN RELATIONS COULD BE BENEFICIAL, BUT I’M DEEPLY WORRIED THAT THINGS HAVE GOTTEN TOO FAR NOW, AND THE PRESIDENT PROMISING ABOUT 24 HOURS, HE COULD MAKE UKRAINE SAFE AGAIN, END THE WAR. YOU LOOK AT WHAT’S GOING ON IN THE MIDDLE EAST, YOU LOOK AT OUR RELATIONSHIP WITH INDIA, THE ENTIRE WORLD HAS NOW RECONFIGURED OR IS IN THAT PROCESS. EVEN JAPAN MEETING WITH XI JINPING RECENTLY, AND THAT’S AS A RESULT OF THESE POLICIES. SO I AM NOT AS OPTIMISTIC, ALTHOUGH I WILL TRY TO BE WHEN I COME BACK AND TALK TO YOU NEXT. JOE: EVER THE OPTIMIST. I DON’T KNOW, SOUNDS LIKE THE SECONDARY SANCTIONS COULD HAVE QUITE AN IMPACT, WHICH IS SOMETHING RICK DAVIS HAS BEEN CALLING FOR. OUR GREAT PANEL WILL BE BACK WITH MORE TO TALK ABOUT, AS WE TURN TO DOMESTIC POLITICS. THIS IS THE TUESDAY, EVEN THOUGH IT FEELS LIKE A MONDAY EDITION OF \"BALANCE OF POWER.\" WE’LL TAKE A LOOK AT WALL STREET. LISA MATTEO CHECKING STOCKS FOR US WITH A NEW WHIFF OF UNCERTAINTY IN THE AIR OVER TARIFFS. AND WE’VE GOT CREDE GUPTA WITH US IN WASHINGTON, D.C., AND FOR THE NEXT SEVERAL WEEKS. WE’LL BE BACK WITH MORE SMART TALK FROM WASHINGTON BY WAY OF WALL STREET, STRAIGHT AHEAD. THIS IS BLOOMBERG TV ♪. > > IT IS 1:21 ON WALL STREET. TRADERS LOOKING AHEAD TO THE LABOR MARKET DATA OUT LATER THIS WEEK. THE JOBS REPORTED COMES OUT ON FRIDAY. AHEAD OF IT, STOCKS ARE LOWER. NASDAQ DOWN NEARLY 1.5%. THE DOW OFF ABOUT .9%. S & P 500 OFF MORE THAN 1%. THE TWO-YEAR YIELD, 3.64%. THAT’S UP THREE BASIS POINTS. THE YIELD ON THE 10-YEAR, 4.2%. THE NASDAQ UP ABOUT FOUR BASIS POINTS. WE HAD THE BLOOMBERG DOLLAR SPOT INDEX UP ABOUT HALF A PERCENT. CHECKING WITH OTHER CURRENCIES, JAPANESE YEN DOWN .7%. EURO DOWN HALF A PERCENT. BRITISH POUND DOWN MORE THAN 1%. SOME I.P.O. NEWS, KLARNA IS LOOKING TO RAISE AS MUCH AS $1.27 BILLION. THIS IS AS THE COMPANY REVISED THE NEW YORK I.P.O. THAT WAS DELAYED EARLIER THIS YEAR. THEN WE GO TO BLACKROCK COFFEE BARS, LOOKING TO RAISE $265 MILLION IN AN I.P.O. IT WILL BECOME THE LARGEST PUBLICLY TRADED COFFEE RETAILER ON A U.S. EXCHANGE, JOINING RIVALS LIKE STARBUCKS AND DUTCH BROTHERS. FOR NEWS 24 HOURS A DAY, SUBSCRIBE TO BLOOMBERG NEWS NOW. I’M LISA MATTEO, THAT IS YOUR BLOOMBERG BUSINESS FLASH. JOE: LISA MATTEO WITH US TODAY. GREAT TO HAVE A LONG FOR THE SIDE. I’M JOE MATHIEU, AND THIS IS \"BALANCE OF POWER,\" ALONGSIDE KRITI GUPTA IN FOR KAILEY LEINZ. AS WE TURN OUR ATTENTION TO DOMESTIC POLITICS. WE’VE BEEN TALKING ABOUT THE POTENTIAL FOR NATIONAL GUARD TROOPS OR FEDERAL LAW ENFORCEMENT TO ENTER CHICAGO, THE NEXT CITY THAT PRESIDENT TRUMP IS HIGHLIGHTED HERE. OF COURSE, THEY’RE ON THE STREETS OF WASHINGTON, D.C. HE’S SUGGESTED OTHER CITIES, LIKE NEW YORK MIGHT GET THAT TREATMENT NEXT. ALL OF THIS, OF COURSE, BEGAN IN LOS ANGELES A COUPLE OF MONTHS AGO. KRITI: AT THE TIME, EVEN WHEN HE WAS THREATENING LOS ANGELES, NO ONE TOOK IT THAT SERIOUSLY. THIS WAS UNTHINKABLE IN TERMS OF TROOPS, IN TERMS OF THE LEGALITIES AROUND IT. AND NOW WE FIND OUT, WELL, IT’S ACTUALLY NOT LEGAL TO DO THAT. JOE: WE DID GET A COURT RULING THAT’S GOING TO RAISE SOME REAL QUESTIONS ABOUT GOING INTO OTHER CITIES. THE PRESIDENT HAS A LOT OF LEEWAY HERE IN WASHINGTON, D.C. IN THE FEDERAL CITY. IT’S NOT LIKE THAT WHEN YOU GO INTO ANOTHER STATE WITH AN EXECUTIVE THAT ACTUALLY IS THE COMMANDER IN CHIEF OF THE NATIONAL GUARD. SO HERE WE ARE, THE JUDGE RULING HERE THAT THE PRESIDENT’S DEPLOYMENT IN L.A., THIS WAS IN JUNE AGAINST THE IMMIGRATION CRACKDOWN, VIOLATED FEDERAL LAW WITH MUCH TO WONDER ABOUT THE WAY FORWARD. WE ASSEMBLE OUR POLITICAL PANEL, OUR CONTRIBUTORS HERE ON THE FEW EDITION. RICK IS OUR REPUBLICAN STRATEGIST. JEANNIE, DEMOCRACY VISITING FELLOW AT HARVARD KENNEDY SCHOOL’S ASH CENTER. ONE THING, JEANNIE, THAT DONALD TRUMP HAS ALWAYS SAID SINCE HE GOT BACK IN THE WHITE HOUSE, IS THAT HE WILL COMPLY WITH COURT ORDERS. COULD THIS SLOW DOWN THE ROLE OF NATIONAL GUARD TORONTO RAPTORS, IF NOT FEDERAL LAWSUIT IN OTHER PARTS OF THE COUNTRY? > > IT ABSOLUTELY COULD, BUT I’LL TELL YOU, I AM DOUBTFUL THAT IT IS GOING TO SLOW DOWN THIS ADMINISTRATION, AND I’LL TELL YOU WHY. VERY MUCH LIKE HIS IMPOSITION OF THE TARIFFS, WHICH IS SOMETHING HE’S TALKED ABOUT ALMOST HIS ENTIRE ADULT LIFE, HE HAS BEEN FIXATED ON VIOLENCE IN CHICAGO FOR MUCH OF HIS LIFE. HE BUILT THE TRUMP TOWER THERE. HE HAS TALKED ABOUT IT SINCE BEFORE HE RAN FOR ELECTION THE FIRST TIME. CONTINUED RIGHT THROUGH TO THE CURRENT MOMENT. I THINK AS EARLY AS TODAY, IF I’M READING MY TRUTH SOCIAL RIGHT. SO I’M NOT SURE THIS IS GOING TO SLOW HIM DOWN. THE OTHER THING IS THAT WE ALSO HAVE A SUPREME COURT DECISION JUST EARLIER, A FEW MONTHS AGO, IN WHICH THEY SAID THEY WON’T ALLOW FEDERAL STRICT COURT JUDGES TO IMPOSE NATIONWIDE INSTRUCTIONS, WHICH RAISES THE QUESTION, IS JUDGE BRIERE’S RULING -- JUDGE BREYER’S RULING JUST FOR HIS DISTRICT, OR DOES IT APPLY NATIONWIDE? SO AS MUCH AS I WOULD LIKE TO THINK THIS MAY SLOW THINGS DOWN SO WE COULD GET A REAL DECISION ON THE SUPREME COURT, I’M NOT SURE IT’S GOING TO SLOW DOWN THIS ADMINISTRATION. KRITI: DO YOU AGREE WITH JEANNIE? DOES THIS SERVE AS A DETERRENT WHEN IT COMES TO OTHER CITIES ACROSS THE UNITED STATES? OR COULD THIS SIMPLY BE JUST SOMETHING THAT HAPPENS MONTHS AFTER THE ACTUAL ACTION OF PUTTING TROOPS IN THOSE CITIES? HOW DO YOU VIEW IT? CREDIT. > > TRUMP WANTS TO TEST THE LEGAL BOUNDARIES OF A VERY POWERFUL PRESIDENCY, AND HE’S DONE IT IN VARIOUS WAYS, AND THIS IS JUST ONE OF THE MOST CURRENT WAYS THAT HE HAS SAID SUE ME, I’M GOING TO DEPLOY THESE TROOPS. I’M GOING STAKE OUT AN EMERGENCY. I’M GOING TO TAKE THE POWERS THAT THE CONSTITUTION GIVES ME AND EXERT THEM. IT WOULD NOT SURPRISE ME -- AND BY THE WAY, TAKE ME TO THE SUPREME COURT, WHERE HE’S RUNNING A PRETTY GOOD TRACK RECORD RIGHT NOW. I HAVE NO DOUBTS THAT THERE ARE VOICES INSIDE THE WHITE HOUSE SAYING GREAT, THIS IS EXACT WHAT WILL WE PLANNED, WE WANT TO TAKE THIS ALL THE WAY TO THE SUPREME COURT. IF WE ARE GIVEN THE AUTHORITY BY THE SUPREME COURT TO DEPLOY NATIONAL GUARD TROOPS ANYWHERE WE WANT FOR BASICALLY ANY REASON WE WANT, THIS IS WHAT THEY’RE LOOKING FOR. THEY WANT THAT CARTE BLANCHE, AND THEY WANT IT WITHIN THE FIRST YEAR OF THEIR PRESIDENCY. SO I THINK WE SEE THIS PLAYING OUT EXACTLY THE WAY THEY WANTED IT. JOE: WELL, DONALD TRUMP ON TRUTH SOCIAL, TO YOUR POINT, THIS IS JUST A COUPLE OF HOURS AGO, AT LEAST 54 PEOPLE WERE SHOT IN CHICAGO OVER THE WEEKEND. EIGHT PEOPLE WERE KILLED. THE LAST TWO WEEKEND WERE SIMILAR. THE PRESIDENT WRITES CHICAGO IS THE WORST AND MOST DANGEROUS CITY IN THE WORLD. AND I’M LOOKING AT A LIST OF CITIES BY HOMICIDE RATE. THE FIRST AMERICAN CITY THAT APPEARS ON THE LIST IS, IN FACT, NEW ORLEANS, AND THAT’S AT POSITION 28. IT IS FOLLOWED BY MEMPHIS AND A FEW OTHERS HERE. BEFORE YOU GET THAT FAR DOWN THE LIST, IT’S PRETTY MUCH ALL IN MEXICO OR IN CENTRAL AMERICA. THE PRESIDENT DOESN’T ACTUALLY THINK CHICAGO IS THE MOST DANGEROUS CITY IN THE WORLD, I PRESUME, RIGHT? > > NOT IF HE IS LOOKING AT THE DATA. BUT AS WE KNOW, HE IS NOT FOND OF LOOKING AT DATA. HE IS FOND OF FINDING DATA OR MAKING AND CREATING HIS OWN REALITY AND TALKING ABOUT IT, AND HE VERY MUCH BELIEVES THAT CHICAGO IS VIOLENT. AND WE SHOULD NOT UNDERESTIMATE THE FACT THAT 54 SHOOTINGS OVER A WEEKEND OF LABOR DAY IS STUNNING, IT IS VIOLENT, IT NEEDS TO BE ADDRESSED. THE PROBLEM HERE IS THAT THIS FEDERAL JUDGE SAID THE PRESIDENT DOESN’T HAVE THE POWER UNDER THE ACT TO DO THIS. IT IS AN OVERREACH OF HIS POWER. HE DOES NOT HAVE THE ABILITY TO SET UP A NATIONWIDE POLICE FORCE AS IS UNDER HIS POWER. THAT IS THE PROBLEM FOR DONALD TRUMP, WHICH IS WHY I THINK LAST WEEKEND THAT LONG EXTENDED CABINET MEETING THAT YOU SAT THROUGH, HE SAID I WANT TO BE INVITED IN. OF COURSE, HE’S NOT GOING TO BE INVITED IN, EITHER BY MAYOR JOHNSON OR BY THE GOVERNOR. IT IS VERY MUCH IN KEEPING THE POINT OF RICK’S POINT, REALLY WANTING TO DO, NOT JUST TO ADDRESS CRIME, WHICH THEY THINK IS A WINNING ISSUE FOR THEM, BUT IMMIGRATION AS WELL. KRITI: FROM A STATES’ RIGHT PERSPECTIVE, WE KNOW THE MAYOR OF CHICAGO HAS BEEN VOCAL ABOUT HOW WELCOME THOSE TROOPS WOULD BE. WHAT MORE CAN THEY DO, CHICAGO AND OTHER CITIES ACROSS THE COUNTRY? > > THEY ARE GOING TO HAVE TO READ CAREFULLY THIS FEDERAL JUDGE’S DECISION. IF THE PRESIDENT DOES SEND TROOPS IN UNINVITED, THEY WILL TAKE HIM TO COURT AND FOLLOW THAT. WE HEARD THE MAYOR OF CHICAGO SAY THAT HIS POLICE FORCE WOULD NOT COOPERATE WITH LAW ENFORCEMENT. THERE ARE OTHER MORE MODERATE DEMOCRATS AND REPUBLICANS SAYING MAYBE THE GOVERNOR AND THE MAYOR SHOULD TRY TO WORK WITH THE PRESIDENT TO ADDRESS CRIME. BUT I JUST DON’T SEE THAT IN THE OFFING, IN PART BECAUSE OF THE POLITICS OF THE THING, BECAUSE WE KNOW THAT PRITZKER, JUST LIKE NEWSOM, HAS DESIGNS ON THE WHITE HOUSE HIMSELF POTENTIALLY. SO THIS DOES GIVE HIM A WAY TO MAKE A NATIONAL FORUM FOR HIM TO TAKE HIS CASE TO AMERICANS BEYOND ILLINOIS. JOE: WELL, RICK, YOU WONDER IF THE PRESIDENT IS GOING TO NEED TO REWRITE THE SORT OF BASELINE FOUNDATION, THE REAL MOTIVATION FOR USING THESE TROOPS, NOT UNLIKE THE RULING ON TARIFFS. IF HE CAN REWRITE THE TARIFF EMERGENCY AND CREATE ANOTHER REASON TO KEEP THE TARIFFS IN PLACE, CERTAINLY HE CAN FIND ANOTHER REASON TO PUT NATIONAL GUARD TROOPS IN DIFFERENT CITIES IN AMERICA, CORRECT? THIS IS SOMETHING THEY’VE LIKELY GAMED OUT AT THE WHITE HOUSE ALREADY, NO? > > SURE, AT A MINIMUM. THEY HAVE ALREADY BEEN SAYING THEY’RE USING THE NATIONAL GUARD TROOPS TO SUPPORT THE IMMIGRATION PLANS, WHICH MEANS THAT YOU HAVE FEDERAL TROOPS SUPPORTING THE FUNCTION OF A FEDERAL LAW ENFORCEMENT OFFICER, WHICH ACTUALLY GIVES HIM BETTER STANDING WITHIN THE LEGAL SYSTEM. THERE WILL ALWAYS BE A REASON FOR THIS ADMINISTRATION TO TRY TO DO WHAT THEY’RE GOING TO DO. THEY’RE EXTREMELY GOOD AT FINDING CAUSE AND EFFECT, AND EVEN THE PRESIDENT’S COMMENTS ON TRUTH SOCIAL THIS MORNING ABOUT THE 54 SHOOTINGS, YOU DON’T HAVE TO BE RANKED NUMBER ONE. IT’S ALWAYS AN OVERFRANCHISE FOR HIM. BUT MOST PEOPLE WOULD SAY, WELL, THAT’S A DANGEROUS PLACE, 54 PEOPLE WERE SHOT AT, IN CHICAGO THIS WEEKEND. SO HE DOES PLAY ON THE FEARS OF PEOPLE WHEN THEY SAY THESE THINGS. AND OF COURSE, THEN HE ALWAYS TAKES IT A LITTLE BIT TOO FAR. BUT THE REALITY IS I DON’T THINK HE’S GOING TO SUFFER THE DESPAIR TO FIND A REASON TO DO T. HE’S JUST GOING TO EXECUTE UPON THE FACT HE EVEN TALKED ABOUT DURING THE CAMPAIGN. HE SAID HE WAS GOING TO PUT TROOPS IN THESE CITIES, AND YET PEOPLE VOTED FOR HIM. NOW WHEN YOU LOOK AT THE POLLS, YOU SEE THERE’S LITTLE SUPPORT FOR PUTTING NATIONAL GUARD TROOPS IN A LAW ENFORCEMENT POSITION IN THESE CITIES. SO I WOULD SAY THE REALLY ONLY THING THAT CAN CONTROL THIS IS THE BAD POLITICAL EFFECT THAT MAY TAKE PLACE BECAUSE OF IT. KRITI: ARE THERE ANY REPUBLICAN CITIES THAT COULD BE ON THE RADAR OF THE TRUMP ADMINISTRATION RIGHT NOW? > > WELL, THERE SHOULD BE. IN OTHER WORDS, IF YOU’RE MAKING THE ARGUMENT THAT THESE ARE DANGEROUS CITIES, I THINK THREE OF THE TOP FIVE ARE IN RED STATES. AND SO THAT’S NOT WHAT THIS IS ABOUT. THIS IS ABOUT POLITICS. IT’S GOT NOTHING TO DO WITH CRIME FIGHTING. DONALD TRUMP ISN’T GOING TO DEPLOY NATIONAL GUARD TROOPS IN THESE STATES WITHOUT A CLOSE COOPERATION WITH THE GOVERNOR, AND PROBABLY MORE LIKELY A BORDER STATE DEALING WITH BORDER ISSUES, LIKE HE’S DONE IN THE PAST. WE PRETEND SOMETIMES TO SAY THAT THESE ARGUMENTS THAT ARE MADE IN PUBLIC POLICY REALMS ARE LEGITIMATE, THIS IS POLITICS DIRECTING POLICY, NOT THE OTHER WAY AROUND. JOE: WE’VE HEARD OF A COUPLE THAT MIGHT BE LOOKING AT, INCLUDING THE AFOREMENTIONED MEMPHIS AND THE ADMINISTRATION HAS SUGGESTED THAT, YES, IT WILL BE LOOKING IN THOSE AREAS. QUESTION FROM A TERMINAL USER HERE WITH REGARD TO CHICAGO. HE WRITES, WE COULD HATE TRUMP FOR GOING TO CHICAGO, BUT THE CITY WHAT ARE A MESS FOR DECADES. WHAT IS THE COUNTER FROM LOCAL OFFICIALS? > > I THINK THAT’S A GREAT QUESTION, AND THIS IS WHERE I MENTIONED BEFORE, YOU DO HAVE SOME VOICES ON MODERATES ON BOTH THE DEMOCRATIC AND REPUBLICAN SIDE SAYING HOLD ON, LET’S WORK TOGETHER. WHY DOESN’T THE GOVERNOR INVITE THE PRESIDENT IN? BUT TO BE CLEAR, HE CAN’T JUST COME IN WITHOUT BEING INVITED, AND THEY HAVE TO HAVE A PLAN AS TO WHAT THEY’RE GOING TO DO TO COMBAT CRIME. HIRING MORE POLICE OFFICERS, BETTER TRAINING, ALL THE THINGS THAT WE COULD DO TO ADDRESS THESE ISSUES, BECAUSE TO THE TERMINAL USERS’ POINT, CHICAGO HAS BEEN VIOLENT, AS HAS MANY CITIES FOR A LONG TIME. THE PROBLEM HERE IS THAT CHICAGO, IF YOU’RE REALLY LOOKING AT THE DATA, IS NOT NEARLY THE MOST VIOLENT CITY. OF COURSE, YOU JUST MENTIONED MEMPHIS. THE TENNESSEE GOVERNOR SENT NATIONAL GUARD TROOPS TO WASHINGTON, D.C. WHEN TWO OF HIS OWN CITIES ARE FAR MORE VIOLENT THAN WASHINGTON, D.C. WHY AREN’T THOSE TROOPS IN HIS HOME CITY? SO THERE’S A LOT OF POLITICKING HERE TO RICK’S POINT, AND I THINK THE DANGER FOR THE TRUMP ADMINISTRATION POLITICALLY IS THAT POLLING-WISE, THIS IS AT LEAST AT THIS POINT WILDLY UNPOPULAR. THE AMERICAN PUBLIC, PARTICULARLY INDEPENDENTS, DO NOT WANT ARMED TROOPS ON THE NATION’S STREETS. BUT THEY DO WANT TO COMBAT CRIME, AND WE SHOULD ALL WANT TO DO THAT. SO HOPEFULLY THERE’S A WAY THEY CAN WORK TOGETHER TO MAKE THIS HAPPEN. JOE: GREAT CONVERSATION WITH JEANNIE AND RICK, BLOOMBERG POLITICS CONTRIBUTORS. THANK YOU BOTH FOR THE INSIGHTS. WE WILL KEEP TALKING ABOUT THIS, SOMETHING TELLS ME, IN THE FUTURE. WANT TO MENTION A QUICK BREAKER HERE, HEADLINE CROSSED THE TERMINAL. WE TOLD YOU IT WAS COMING. JONI ERNST, MADE OFFICIAL, THE SENATOR FROM IOWA SAYS SHE WILL NOT SEEK RE-ELECTION NEXT YEAR, AND SHE’S UP WITH A VIDEO POST MAKING THAT FORMAL ANNOUNCEMENT TODAY. THIS IS BLOOMBERG. ♪ > > TECH STOCKS LEADING THE LOSSES ON THIS SHORTENED TRADING WEEK. WE’LL START WITH THE NASDAQ, DOWN MORE THAN 1%. ALL MEGA CAPS ARE FALLING, WITH NVIDIA SEEING ITS LONGEST DROP SINCE MARCH. NVIDIA SHARES DOWN MORE THAN 2.5%. TO THE DOW, DOWN ABOUT .7%. THE S & P 500 IS OFF ABOUT .9%. WE HAVE THE TWO-YEAR, 3.64%. THAT’S UP THREE BASIS POINTS. THE YIELD ON THE 10-YEAR, 4.27%, UP ABOUT FOUR BASIS POINTS. THE COMMODITIES, CRUDE UP ABOUT 2.5%, $65 A BARREL. WE HAVE GOLD AT $3,5L 89 AN OUNCE. A FEW COMPANIES MAKING NEWS. NECESSARY LIVE TURNING TO THE EXECUTIVE TO RUNS ITS NESPRESSO EMPIRE TO LEAD THE COMPANY, AFTER IT WAS HIT BY THE SECOND C.E.O. FIRING IN LITTLE OVER A YEAR. AMERICAN VOGUE HAS NAMED CHLOE MALLE ITS NEW EDITOR, AND SHE’S SUCCEEDING ANNA WINTOUR. SHE’S THE DAUGHTER OF DIRECTOR LOUIS MALL AND HE ACTRESS CANDICE BERGEN. MCDONALD’S BRINGING BACK ITS EXTRA VALUE MEALS FOR $8. MEANTIME, IN AN INTERVIEW WITH CNBC, THE MCDONALD C.E.O. HAS THE REPUTATION OF AMERICAN BRANDS HAS DIMMED, AND THE COMPANY WANTS TO FOCUS ON STRENGTHENING THE BRAND’S IDENTITY IN LOCAL COMMUNITIES. WE’RE ON DEMAND NEWS 24 HOURS A DAY, SUBSCRIBE TO BLOOMBERG NEWS NOW. THAT IS A BLOOMBERG BUSINESS FLASH. JOE: LISA, THANK YOU SO MUCH. THANK YOU FOR BEING WITH US HERE ON THE TUESDAY EDITION OF \"BALANCE OF POWER.\" I’M JOE MATHIEU IN WASHINGTON. THIS IS BLOOMBERG TV AND RADIO. ALONGSIDE KRITI GUPTA IN FOR KAILEY LEINZ THE NEXT COUPLE OF WEEKS HERE IN THE NATION’S CAPITAL. KRITI JUST IN FROM LONDON WITH MANY QUESTIONS ABOUT THE STORIES THAT ARE UNFOLDING HERE. SOMEDAY I’LL HAVE YOU ABOUT WHAT THE CONVERSATIONS HAVE BEEN LIKE IN LONDON AGAINST THE TARIFFS, NOW WE’VE GOT ANOTHER COURT RULING THAT HAS BROUGHT US TO ANOTHER INFLEXION POINT, AND THE MARKETS ARE CLEARLY NOT TERRIBLY HAPPY. IT’S INTERESTING, YOU HEAR A RULING LIKE THAT, AND YOU THINK IT WOULD BE MARKET POSITIVE, BECAUSE THEY SEEM TO HAVE AN ALLERGY TO TARIFFS, BUT IT’S THE UNCERTAINTY. KRITI: EVEN IF IT’S A PERSONALITY OR TARIFF, JUST HAVING A NUMBER ATTACHED TO IT IS GOOD. YOU SAID WHAT’S THE THINKING IN LONDON? IT’S QUITE SIMILAR TO HERE, WHICH IS WHAT IS THE THINKING IN WASHINGTON. JOE: LET US KNOW WHEN YOU KNOW, YOU KNOW? THERE’S ANOTHER THING WE DON’T KNOW A LOT ABOUT, AND THAT’S WHETHER THEY’RE COME UP WITH FUNDING FOR THE GOVERNMENT AFTER THE END OF THIS MONTH. IF YOU ASK CHRIS MURPHY OF CONNECTICUT, YOU MIGHT WONDER. HE’S SUGGESTING THAT DONALD TRUMP WANTS TO SEE A SHUTDOWN. IT WAS ON SOCIAL MEDIA TALKING ABOUT THIS VERY THING. YOU CAN SEE IT ON BLOOMBERG TV AND ON YOUTUBE. TRUMP IS ROOTING FOR A SHUTDOWN, HE WRITES. HE KNOWS HE HAS CREATED A HUGE PROBLEM BECAUSE NOW ANY BUDGET DEAL WITH REPUBLICANS ISN’T WORTH THE PAPER IT’S WRITTEN ON, REFERRING PRESUMABLY TO RESCISSIONS, AMONG OTHER THINGS, THAT HAVE DEMOCRATS AND REPUBLICANS NOT EXACTLY GETTING ALONG. NOW, WE BRING ALL OF THIS UP, BECAUSE LAWMAKERS ARE COMING BACK INTO TOWN TODAY. IT’S FLY-IN DAY. WE WANTED TO SPEND TIME WITH MICK MULVANEY, WITH US FROM WASHINGTON, FORMER REPUBLICAN CONGRESSMAN, CO-FOUNDER OF THE FREEDOM CAUCUS, FORMER ACTING CHIEF OF STAFF IN THE FIRST TRUMP ADMINISTRATION. HE RAN O.M.B. AND HAS MORE TITLES THAN YOU CAN FIT ON THE CARD. GREAT TO HAVE YOU BACK WITH US. I GUESS SUMMER IS OFFICIALLY OVER. NOW WE GET TO REAL BUSINESS. > > DOES IT GO BY LABOR DAY OR THE SOLSTICE? > > WELL, I THINK LABOR DAY IN WASHINGTON. THAT DOESN’T REALLY MATTER. SEPTEMBER 30 IS WHAT MATTERS. > > THAT’S THE END OF THE YEAR. JOE: I FEEL LIKE IT’S UP TO ME TO START CHALLENGING THE CONVENTIONAL WISDOM. WITH THIS MANY PEOPLE SAY THEY’RE GOING TO SHUT DOWN, DOESN’T THAT MEAN WE’RE NOT? > > GENERALLY, YES, IN THIS TOWN. AND I ACTUALLY DID HEAR FOR THE FIRST TIME FROM A WELL PLACED REPUBLICAN THAT THEY REALLY DON’T WANT TO SHUT DOWN. THEY DON’T THINK THERE’S GOING TO BE ONE. BUT I KEEP COMING BACK IS AGAIN AND AGAIN TO A COUPLE OF THINGS. EXACTLY WHAT MURPHY SAID, THE ENVIRONMENT IS REALLY, REALLY NASTY RIGHT NOW. WHAT WAS CHRIS REALLY SAYING? IGNORE THE PART ABOUT THE PRESIDENT THAT DOESN’T FOLLOW THE LAW. WHAT HE’S SAYING IS, LOOK, WE PASSED A SPENDING BILL ON A BIPARTISAN BASIS BECAUSE IT TAKES 60 VOTES, AND THEN YOU RESCINDED ON PARTISAN LIES. SO WE AGREED TO SPENDING TOGETHER, AS TWO PARTIES, AND THEN YOU RESCINDED THAT SPENDING ON PARTISAN LINES. AND THAT DOES SORT OF MAKE A DEMOCRAT WONDER WHY WOULD I EVER VOTE FOR ANOTHER SPENDING BILL AGAIN AS LONG AS THIS PRESIDENT IS AROUND? AND THEN YOU LOOK AT SOMETHING I’M A LITTLE BIT FAMILIAR WITH, WHICH IS EXECUTIVE AUTHORITY GOES UP DURING A GOVERNMENT SHUTDOWN, WHICH IS TECHNICALLY A LAPSE IN FUNDING. THE OFFICE OF MANAGEMENT AND BUDGET IS HEAVILY INVOLVED IN DETERMINING WHO IS ESSENTIAL AND NONESSENTIAL, A TERM WE’RE FAMILIAR WITH NOW IN THIS TOWN. JOE: THIS IS GOING TO GET INTERESTING. > > I AM SO JEALOUS OF RUSS VAUGHT, HE’S HAVING A GREAT TIME THERE. I WOULD LOVE TO BE DOWN THERE RIGHT NOW. THIS IS FANTASTIC. HE SORT OF GETS BACK TO SIT BACK AND SAY, KRITI, YOU’RE ESSENTIAL, AND WE LIKE WHAT YOU’RE DOING. JOE, YOU’RE NOT ESSENTIAL, SO GOODBYE. IT’S REALLY SORT OF A WAY TO RUN THE GOVERNMENT WITHOUT CONGRESS’ INPUT. SO YEAH, I THINK THEY MIGHT WANT TO SHUT DOWN. WHEN EVERYBODY IN THIS TOWN SAYS X, IT’S A GOOD IDEA TO VOTE Y. KRITI: CAN WE FOCUS ON SHUTDOWN? I’M COME IN FROM LONDON, AND THE THOUGHT IN LONDON, SHOULDN’T TARIFFS HAVE FIXED ALL THE PROBLEMS? SHOULDN’T THE MATH HAVE COME AND AT LEAST CANCELLED OUT -- NOT CANCEL OUT THE ENTIRE BUDGET ISSUE, BUT AT LEAST TAKEN SOME OF THE PRESSURE? > > NO, IT’S NOT CLOSE. KRITI: BUT IS IT PROGRESS? > > IT’S MORE MONEY, BUT I’VE HEARD TRUMP SAY TARIFFS HAVE BROUGHT IN $7 TRILLION. NO, IT HASN’T. IT’S $115 BILLION, WE SPENT THAT MUCH DURING LUNCH TIME TODAY. SO NO, TARIFFS WERE NEVER DESIGNED -- THEY WERE NEVER DESIGNED TO PLUG A FISCAL HOLE. IT’S GOOD MONEY. IT’S ADDITIONAL MONEY. I GET IT. YOU AND I HAVE TALKED BEFORE ON THE SHOW ABOUT HOW WE BOTH THOUGHT INFLATION WOULD GO UP. IT HASN’T. IT’S HARD TO ARGUE WITH THE FACTS, AND THEY’VE NOT CONTRIBUTED TO INFLATION, AND THEY HAVE GENERATED MORE GOVERNMENT PERIOD, END OF STORY, NO REAL DEBATE AS OF RIGHT NOW. BUT IT WAS NEVER GOING TO PLUG THE FISCAL HOLE TO WHERE EVERYBODY IN WASHINGTON WOULD GO, OH, IT’S GREAT. BY THE WAY, THEY JUST SPEND MONEY ANYWAY. THEY DON’T CARE ABOUT DEFICITS. IT DOESN’T MAKE ANY DIFFERENCE. IT JUST GOES TO SHOW YOU YOU’RE ASKING ABOUT THE WRONG THINGS. JOE: LET’S TALK ABOUT MOTIVATIONS HERE. BECAUSE IT’S REALLY INTERESTING WHAT YOU JUST MAPPED OUT. IF YOU’RE AT THE WHITE HOUSE RIGHT NOW, YOU’RE SAYING MAKE MY DAY, RIGHT? PLEASE SHUT DOWN THE GOVERNMENT. WE HAVE A PLAN FOR THAT. AND I WISH YOU LUCK OPENING THE GOVERNMENT. THERE’S NO SUCH THING WITH THIS WHITE HOUSE, IS THERE? > > NOT IF THEY KEEP THEIR -- KEEP IN MIND, WHEN WE WENT THROUGH THE SHUTDOWN INTO 2019, WE FELT LIKE WE WERE DOING A GOOD JOB OF MANAGING THE LAPSE IN APPROPRIATIONS. JOE: THAT WAS THE RECORD. > > THE LONGEST SHUTDOWN EVER. I THINK IT’S FAIR TO SAY THAT WHEN A REPUBLICAN IS IN CHARGE OF O.M.B., YOU CAN MAKE IT LOOK VERY DIFFERENT THAN WHEN A DEMOCRAT IS IN CHARGE. CASE IN POINT, WE KEPT THE MONUMENTS OPEN ON THE NATIONAL MALL. THE OBAMA ADMINISTRATION DURING THEIR SHUTDOWN PUT UP THE BARRIERS, IF YOU DON’T LIKE IT, CALL CONGRESS. SO YEAH, WE DO FEEL LIKE WE’RE ABLE TO MANAGE A LAPSE IN APPROPRIATIONS. THE ONLY REASON THAT WE DENT KEEP IT CLOSED LONGER IN 2019 WAS BECAUSE WE DIDN’T HAVE THE SUPPORT OF THE REPUBLICANS IN THE WHITE HOUSE AND THE SENATE. WE HAD PAUL RYAN AND MITCHELL MCCONNELL BEATING US YOU WILL SAYING YOU HAVE TO DO SOMETHING ABOUT IT. YOU’RE NOT GOING TO GET THAT FROM THIS REPUBLICAN LEADERSHIP. IF IT DOES SHUT DOWN, HOW DOES IT OPEN? AND I DON’T KNOW THE ANSWER TO THAT QUESTION. CREDIT EYE: WHAT WOULD THE TRUMP ADMINISTRATION WANT? WHAT IS THE EASIEST THING TO FIX TO GET THAT SHUTDOWN OFF THE RADAR? > > I DON’T KNOW IF THEY WANT ONE. MORE RESCISSIONS? ONE OF THE MOST FASCINATING THINGS THAT NO ONE PAID ATTENTION TO WAS THE POCKET RESCISSION, JUST A COUPLE OF DAYS AGO. IT HASN’T BEEN DONE IN A LONG TIME. WE TRIED TO PUSH IT IN 2017 AND 2018, BUT WE COULDN’T GET THE COUNSEL TO GO ALONG WITH IT. IT’S A FASCINATING TOOL. I THINK THEY WANT TO SPEND LESS MONEY, ESPECIALLY ON THINGS LIKE USAID. THEY’D LIKE TO SHUT DOWN THOSE ENTIRE PROGRAMS. MAYBE THAT’S WHAT WOULD OPEN IT UP. YOU TELL ME IF A REPUBLICAN IS GOING TO OPEN TO SHUTDOWN GOVERNMENT AS PART OF A DEAL TO SHUT DOWN USAID PROGRAMS PERMANENTLY. JOE: THE NEXT THING IS A SURE THING, RIGHT? IF WE’RE DARING YOU TO SHUT DOWN, THEN LET’S KEEP CLAWING BACK. > > THE LOGIC IS ACTUALLY QUITE INTERESTING. YOU WANT TO TALK ABOUT GETTING INTO THE PLUMBING. AN ORDINARY RESCISSION PACKAGE, THEY GOT NOWHERE. THEY GO TO THE HALL, AND IF CONGRESS DOES NOTHING, THEY DIE, OK? THIS TIME RUSS VAUGHT SENT DOWN ONE A COUPLE OF WEEKS BACK AND CONGRESS DID ACT AND GAVE IT THE THUMBS UP. THIS POCKET RESCISSION IS DIFFERENT. THEY’VE GOT LEGAL OPINIONS TO SAY, LOOK, IF WE SEND YOU A RESCISSION DURING THE LAST 45 TAKES. CONGRESSIONAL YEAR, OF THE FISCAL YEAR, IF YOU DO NOTHING CONGRESS, THE RESCISSION IS VALID. SO CONGRESS WOULD HAVE TO AFFIRMATIVELY ACT TO UNDO THE RESCISSION, SO IT FLIPS IT ON ITS HEAD WHEN IT COMES TO THE LAST 45 DAYS. IT’S SIMILAR TO THAT TO SAY A POCKET VETO. IF THIS HOLDS, IT’S A TREMENDOUS TOOL. BECAUSE WHAT IT MEANS IS FUTURE ADMINISTRATIONS IN THE LAST 45 DAYS OF THEIR ADMINISTRATION CAN REALLY CLAW BACK ON SPENDING UNLESS CONGRESS DOES SOMETHING. AND AS WE ALL KNOW IN THIS TOWN, CONGRESS IS BETTER AT DOING NOTHING THAN IT IS AT DOING SOMETHING. KRITI: IS THERE A POLITICAL COST? > > HARDLY EVER. EVERYBODY SAYS IT COSTS PEOPLE VOTES, AND I DON’T KNOW IF A PERSON CHANGES A VOTE BASED ON THIS. MAYBE POLLSTERS HAVE HARD DATA. JOE, HOW LONG HAVE WE BEEN HERE? SIX SHUTDOWNS SINCE 2015. I CANNOT REMEMBER A SINGLE TIME. JOE: WALL STREET FEELS THE SAME WAY. WHEN YOU REOPEN THE GOVERNMENT, PRESUMABLY SOMEDAY, EVERYONE IS MADE WHOLE ON WHAT THEY MISSED. > > I THINK THE BEST G.D.P. QUARTER THE OBAMA ADMINISTRATION EVER HAD WAS THE QUARTER THAT WE HAD A BIG SHUTDOWN. JOE: SO HERE WE GO. > > BUCKLE UP. JOE: ANOTHER SHUTDOWN. > > I WANT TO BE RUSS VAUGHT WHEN I GROW GROW UP. JOE: WE CAN CONNECT YOU GUYS. THE CONVERSATION WITH DONALD TRUMP ON A DAY LIKE THIS, WHEN THE COURT SAYS NOPE, TARIFFS ARE ILLEGAL, AND THEN SOME OF THE OTHER THINGS YOU’RE DOING, SENDING NATIONAL GUARD INTO L.A. WAS ALSO ILLEGAL. DOES THE PRESIDENT SIT BACK AND SAY, OK, THEN REWRITE IT SO IT’S NOT ILLEGAL, OR DOES HE TAKE THIS AS A DEFEAT? > > NO, HE NEVER TAKES IT AS A DEFEAT. I THOUGHT YOU WERE GOING TO SAY, LET’S CHALLENGE IT AT THE NEXT LEVEL? THE ANSWER IS BOTH. HE GOES TO ONE GROUP, ALL RIGHT, WHAT’S OUR ARGUMENT? I THINK THE TARIFFS JUST CAME OUT OF THE COURT IN D.C. GET READY ON THAT. BUT IN CASE WE LOSE, WHAT’S OUR BACKUP PLAN. LET’S FIND OUT WHAT OTHER TOOLS HAVE WE GOT. THIS IS LIKE A 122, WHICH IS 15% FOR 150 DAYS. THERE’S ALL SORTS OF TRADE TOOLS THE PRESIDENT HAS, IN ADDITION TO THE ONES UNDER IEEPA. YOU CAN DO BOTH. WE’RE GOING TO PUSH ON THE SUPREME COURT DECISION, AT THE SAME TIME, IF WE LOSE, WE’RE GOING TO START THE PROCESS TO SEE WHAT WE CAN DO, THAT CAN’T PASS JUDICIAL MUSTER. KRITI: IN TERMS OF GETTING SOME OF THE OTHER SOURCES OF REVENUE, WE’VE ALREADY TALKED ABOUT THIS IDEA GETTING 15% OF REVENUE FROM CORPORATIONS AS ONE EXAMPLE. HOW SERIOUS IS HE GO EXPANDING THAT USE? > > SADLY, I THINK HE’S SERIOUS ABOUT IT. THIS WHOLE GOVERNMENT OWNERSHIP OF PRIVATE COMPANIES I THINK IS REAL. REALLY, REALLY DISAPPOINTS ME. I’M WANT A BIG FAN. YOU LOOK UP THE DEFINITION OF SOCIALISM IN THE ENGINEER, AND IT SAYS GOTH OWNERSHIP IS THE MEANS OF PRODUCTION. LAST TIME I CHECKED, WE NOW OWN SOME CHIPS. I’M NOT EXCITED ABOUT IT. I HOPE THERE’S SOMEBODY MAKING THE CASE WHY THIS IS ALWAYS A BAD IDEA. IT NEVER WORKS. BUT I’M NOT SURE THOSE VOICES ARE REALLY THERE. JOE: WHO’S TELLING HIM IN THE WHITE HOUSE THIS IS A GOOD IDEA? WOULD THIS HAVE HAPPENED IN THE FIRST ADMINISTRATION WHEN YOU WERE CRITICIZING BARACK OBAMA FOR INVESTING IN GOVERNMENT MOTORS? > > AND MAYBE WE WERE JUST TOO CLOSE TO IT. NOW PEOPLE HAVE FORGOTTEN THAT SOCIALISM IS A BAD THING. DO I THINK PETER NAVARRO IS CAPABLE OF MAKING AN ARGUMENT THE GOVERNMENT SHOULD OWN U.S. STEEL AND G.M. AND INTEL? YEAH, HE PROBABLY IS. AS MUCH AS I BEAT UP ON PETER, AND I’D BE HAPPY TO DO IT ALL DAY LONG, HE CAN’T BEING THE ONLY VOICE. THERE’S GOT TO BE OTHER VOICES SAYING, YOU KNOW, IT’S A REALLY GOOD IDEA. HEY, WHY NOT? WE OWN CRITICAL MINERALS NOW. WE OWN U.S. STEEL, A PIECE OF INTEL. WHY NOT? WHY DON’T WE OWN BOEING? ONCE YOU OPEN THIS DOOR, HOW DO YOU CLOSE IT? AND THAT’S MY QUESTION TO MY REPUBLICAN FRIENDS. WHERE’S MY CAMERA? OVER HERE. WHEN WE FINALLY LOSE CONTROL AND THE DEMOCRATS ARE IN CHARGE, WHICH ALWAYS HAPPENS, PENDULUMS SWING BACK AND FORTH, AND THEY WANT TO BUY EVERY SOLAR INCOME. WE THOUGHT LENDING MONEY WAS A REALLY BAD IDEA. HOW IS IT GOING TO BE WHEN WE OWN SOLINDRA? THAT’S WHERE WE’RE GOING. WE’RE NOT ARGUING ABOUT DIFFERENT LEVELS OF SOCIALISM, IT’S WHAT DO YOU WANT TO BUY? IF YOU’RE A DEMOCRAT YOU WANT TO BUY WHATEVER. THIS IS WHO’S THE BETTER SOCIALIST, NOT THE DIFFERENCE. THERE’S NOT MUCH DIFFERENCE BETWEEN THE TWO PARTIES. THAT’S WHY I’M SO DISAPPOINTED ABOUT IT. JOE: PEOPLE IN THE STUDIO ARE LOOKING DIRECTLY TO THE CAMERA TO SEND A MESSAGE TO SOMEONE, I’M WONDERING, IS THE PRESIDENT WATCHING THIS RIGHT NOW? > > YES, HE’S OUT THERE SEPARATION. ALIX: YOUR BROTHER KEPT RESPONDING ABOUT IT. ALL IN THE FAMILY WITH MICK MULVANEY. THANK YOU FOR BEING HERE. > > DO YOU KNOW THAT DAVID HAS A TERMINAL IN HIS OFFICE AND WATCHES YOU EVERY SINGLE DAY? JOE: DID YOU KNOW THAT? WOW. HOW MANY MEMBERS HAVE TERMINALS? > > I THINK HE MAY BE THE ONLY ONE. I HOPE I DIDN’T BURY THE LEAD TOGETHER. JOE: THE FORMER CONGRESSMAN, FORMER ACT BEING CHIEF OF STAFF AT THE WHITE HOUSE, THANK YOU. AND DON’T BE A STRANGER. WITH ME HERE IN WASHINGTON, KRITI GUPTA. WE’LL MEET YOU FOR THE LATE EDITION OF \"BALANCE OF POWER.\" DELIGHTED TO HAVE YOU AS PART OF THE CONVERSATION. THAT’S AT 5:30 EASTERN TIME. WE’LL HAVE MORE TO TALK ABOUT RIGHT HERE ON \"BALANCE OF POWER.\" ♪",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.95263671875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.91357421875
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.62353515625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.546875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.306396484375
    }
  ],
  "sentiment": {
    "positive": 0.051952522,
    "negative": 0.74211925,
    "neutral": 0.20592819
  },
  "summary": "The US and India are keeping the door open to trade talks. This comes as President XI attempts to rewrite the GEOPOLITICAL MAP, following an APPEALS Court ruling that most of the Trump TARIFF REGIME is ILLEGAL. Meanwhile, the US and Indian markets are on a downward trend, with the NASDAQ down more than 1.5% and the S&P 500 down more over 1%. Meanwhile, there are concerns about a potential government shutdown due to ongoing tensions between the two countries. The article also discusses a potential trade deal with India.",
  "shortSummary": "The US and India are keeping their doors open for trade talks amid uncertainty over the Trump TARIFF Regime's future, with potential shutdowns looming.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "b2c77be00ba14537ab3a38720decbc14",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bloomberg’s \"Balance of Power\" highlighted a court ruling declaring most of President Trump’s tariff regime illegal, sparking market uncertainty and a sharp decline in equity indices and a rally in gold and oil.  The segment also discussed the administration’s push for a government shutdown, the deployment of National Guard troops in cities like Chicago, and the broader geopolitical shift as China, India, Russia, and the U.S. navigate trade and security tensions.  Analysts warned that the legal challenges to tariffs and fiscal policy could reshape U.S. trade strategy and domestic politics in the coming weeks.",
  "argos_id": "367GLEXW8"
}