{
  "url": "https://www.cnn.com/2025/09/02/health/offit-fda-vrbpac",
  "authorsByline": "Meg Tirrell, Katherine Dillinger",
  "articleId": "b2641014d27a43ab8293754da2c4b859",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2008859255.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T02:18:20.415000+00:00",
  "addDate": "2025-09-03T02:22:22.107176+00:00",
  "refreshDate": "2025-09-03T02:22:22.107179+00:00",
  "score": 1.0,
  "title": "Vaccine expert who is a frequent critic of RFK Jr. is blocked from participating in FDA advisory committee",
  "description": "Dr. Paul Offit, a frequent critic of US Health and Human Services Secretary Robert F. Kennedy Jr., has been blocked from participating in a panel of independent experts who advise the US Food and Drug Administration on vaccines. An HHS spokesperson told CNN that Offit was among multiple advisers to FDA committees whose terms have expired, meaning they can’t participate in advisory committee work. Offit, who is director of the Vaccine Education Center at Children’s Hospital of Philadelphia, told CNN that a senior FDA official had previously asked him to extend his term on the FDA panel, but the paperwork appeared to have been held up at HHS.",
  "content": "Dr. Paul Offit, a frequent critic of US Health and Human Services Secretary Robert F. Kennedy Jr., has been blocked from participating in a panel of independent experts who advise the US Food and Drug Administration on vaccines.\n\nAn HHS spokesperson told CNN that Offit was among multiple advisers to FDA committees whose terms have expired, meaning they can’t participate in advisory committee work. Offit, who is director of the Vaccine Education Center at Children’s Hospital of Philadelphia, told CNN that a senior FDA official had previously asked him to extend his term on the FDA panel, but the paperwork appeared to have been held up at HHS.\n\nOffit, who is also a professor of pediatrics in the Division of Infectious Diseases at CHOP, a former member of the US Centers for Disease Control and Prevention’s vaccine advisers and an inventor of the rotavirus vaccine RotaTeq, has clashed with Kennedy, a longtime anti-vaccine advocate, for years.\n\n“I’ve been critical of RFK Jr. — I think for good reason,” Offit told CNN on Tuesday. But he noted that he hadn’t been given a reason for the holdup on the paperwork and pointed out, “I’ve been a vocal critic of him for many years,” including during Kennedy’s time helming the anti-vaccine group Children’s Health Defense, “which was almost 10 years ago.”\n\nA Trump administration hiring freeze applies to Special Government Employees, a category that includes advisers such as Offit, and renewals must go through the White House’s Presidential Personnel Office, a person familiar with the situation told CNN.\n\nNonetheless, Offit’s inability to participate in the FDA’s vaccine advisory panel makes him just the latest in a slew of experts to depart or be ousted from the FDA and CDC under Kennedy. Most recent was the forcing out last week of CDC Director Dr. Susan Monarez, an appointee of President Donald Trump who’d been confirmed only weeks earlier, prompting the departure of multiple other key CDC leaders.\n\nOffit joined the FDA’s Vaccines and Related Biological Products Advisory Committee in 2017, and he was a prominent voice helping interpret vaccine science throughout the Covid-19 pandemic.\n\nHis latest term was set to end in January 2025, he said, before a senior FDA official asked him to remain for another four years.\n\nOffit agreed to stay until 2027, he said, and filled out renewed Special Government Employee forms, which include financial disclosures. But he says a senior official told him that those forms were “held up” for months within HHS, and he finally received an email last week that said he was no longer a member of the FDA committee because his forms were never approved.\n\nKennedy has accused Offit of having conflicts of interest, a common theme in his targeting of government vaccine advisers; in June, Kennedy cited such conflicts when dismissing the 17 members of the CDC’s advisory panel. Offit noted at the time that candidates for that committee were typically subjected to months of review, including for potential conflicts of interest.\n\nThe HHS secretary also singled out Offit in an interview with Fox News in June, saying he had voted to add the rotavirus vaccine to the CDC’s recommended immunization schedule and then sold his stake for $186 million. But Offit noted in a video he posted on social media that the vaccine hadn’t come up for a vote until three years after he served as a voting member of the CDC advisory panel and that CHOP had owned the vaccine patent, not him.\n\n“I worked for 26 years on that vaccine,” he told CNN on Tuesday. “Both the motivation for doing it and the reward from doing it were never financial, obviously. What upsets me the most about that is that people believe it. You know, they believe that I would actually knowingly lie about vaccine safety or vaccine efficacy to line my own pocket.”\n\nOffit said he’s received hate mail, been physically assaulted and received death threats. “They hate you because they think that you’re putting their children in harm’s way for money. And it’s not true.”\n\nOffit emphasized that if the FDA’s Vaccines and Related Biological Products Advisory Committee, or VRBPAC, remains in its current form, just without him, he’d still trust its advice.\n\n“I love talking to my fellow committee members, because they’re really smart, and I learned a lot. That’s what I’ll miss,” he told CNN. “But the VRBPAC is in no sense weaker by my not being there. There are a lot of really good people on that committee, so I don’t think anybody should feel they’re getting lesser advice because I’m not there.”",
  "medium": "Article",
  "links": [
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fx.com%2FDrPaulOffit%2Fstatus%2F1933326301126971563&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530849470%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=Q2b0i91Npy%2FP3j5VHpBkGOnYqYe86hBjvMlxIByKJAM%3D&reserved=0",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2025/08/28/politics/video/cdc-leaders-resign-rfk-jr-src-digvid",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.foxnews.com%2Fvideo%2F6374202112112&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530833225%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=HBWNrXaWt63Jx4oIua39bvxMxofMo44xj4sD7JIYAKs%3D&reserved=0",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.cnn.com%2F2025%2F06%2F11%2Fhealth%2Fkennedy-new-members-vaccine-advisory-panel&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530816880%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=W%2B1EVTUhbykELHij7HlLGkFIBQ2HQ%2F%2BMu3hqh4vtze4%3D&reserved=0",
    "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.fda.gov%2Fabout-fda%2Fethics%2Fspecial-government-employee-sge-resources&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530795950%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=t4AgQoqRwAY8Jhswers50UDXrKJw6Xdf8Ke%2FeVoMe40%3D&reserved=0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "FDA advisory committee",
      "weight": 0.09041189
    },
    {
      "name": "FDA committees",
      "weight": 0.08673895
    },
    {
      "name": "Vaccine expert",
      "weight": 0.08544716
    },
    {
      "name": "government vaccine advisers",
      "weight": 0.084335506
    },
    {
      "name": "vaccine efficacy",
      "weight": 0.081570275
    },
    {
      "name": "vaccines",
      "weight": 0.08110712
    },
    {
      "name": "vaccine safety",
      "weight": 0.08081865
    },
    {
      "name": "vaccine science",
      "weight": 0.08075946
    },
    {
      "name": "Offit",
      "weight": 0.07846424
    },
    {
      "name": "Paul Offit",
      "weight": 0.07701358
    }
  ],
  "topics": [
    {
      "name": "FDA"
    }
  ],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9482421875
    },
    {
      "name": "/Health/Public Health/Health Policy",
      "score": 0.8359375
    },
    {
      "name": "/News/Health News",
      "score": 0.79248046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.74560546875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.64990234375
    },
    {
      "name": "/Health/Public Health/Other",
      "score": 0.60498046875
    },
    {
      "name": "/Health/Health Conditions/Infectious Diseases/Other",
      "score": 0.306640625
    }
  ],
  "sentiment": {
    "positive": 0.035806544,
    "negative": 0.7500373,
    "neutral": 0.21415606
  },
  "summary": "Dr. Paul Offit, a frequent critic of US Health and Human Services Secretary Robert F. Kennedy Jr., has been blocked from participating in a panel of independent experts who advise the US Food and Drug Administration on vaccines. Offit was among multiple advisers to FDA committees whose terms have expired, meaning they cannot participate in advisory committee work. He is director of the Vaccine Education Center at Children’s Hospital of Philadelphia and an inventor of the rotavirus vaccine RotaTeq. Kennedy, a longtime anti-vaccine advocate, has accused Offit of having conflicts of interest, a common theme in his attacks on government vaccine advisers. Despite this, Offit remains committed to the FDA's Vaccines and Related Biological Products Advisory Committee.",
  "shortSummary": "Dr. Paul Offit, a frequent critic of RFK Jr, is blocked from participating in FDA advisory committees due to potential conflicts of interest.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e57458ed11f04d78aebe3f63575b9ef9",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.cnn.com%2F2025%2F06%2F11%2Fhealth%2Fkennedy-new-members-vaccine-advisory-panel&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530816880%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=W%2B1EVTUhbykELHij7HlLGkFIBQ2HQ%2F%2BMu3hqh4vtze4%3D&reserved=0",
      "text": "Just two days after retiring the entirety of the US Centers for Disease Control and Prevention’s vaccine advisory panel, US Health and Human Services Secretary Robert F. Kennedy Jr. has appointed several prominent critics of the government’s Covid-19 response to that committee.\nHe announced eight new members of the CDC’s Advisory Committee on Immunization Practices, or ACIP, on Wednesday.\nKennedy had said Monday that the previous 17-member panel that makes recommendations on who should get vaccines and when was rife with conflicts of interest and that he would appoint new “highly credentialed” experts in time for the panel’s June 25 meeting, at which the members are expected to discuss guidance for Covid-19 and HPV shots, among others.\nIn a statement Wednesday, Kennedy said the reassembled panel will demand “definitive safety and efficacy data before making any new vaccine recommendations” but will review data for the current vaccine schedule, as well.\nThe eight new ACIP members include Dr. Robert Malone, a biochemist who made early innovations in the field of messenger RNA but in more recent years has been a vocal critic of mRNA technology in Covid-19 vaccines.\nThe CDC recently narrowed its recommendations for mRNA Covid-19 shots, but some advocates in the Make America Healthy Again movement have pressed Kennedy to go further and bar the vaccines entirely.\nAnother new member is Dr. Martin Kulldorff, a biostatistician and epidemiologist who co-authored an October 2020 strategy on herd immunity known as the Great Barrington Declaration with Dr. Jay Bhattacharya, now director of the US National Institutes of Health.\nBoth Malone’s and Kulldorff’s names were circulated early in the second Trump administration as potential advisers on ACIP or other panels, according to a person familiar with the process who requested anonymity because they weren’t authorized to speak with CNN.\nKennedy also chose Dr. James Pagano, an emergency medicine physician he described as a “strong advocate for evidence-based medicine” who has served on hospital committees and medical executive boards.\nDr. Retsef Levi, an MIT professor who has published studies on mRNA vaccines and cardiovascular events, is also joining the panel. Levi is a professor of operations management.\nSeveral of the new members have served in federal health agencies previously, including Dr. Joseph Hibbeln, a former acting chief of the NIH’s section on nutritional neurosciences.\nDr. Cody Meissner, a Dartmouth professor of pediatrics who also signed the Great Barrington Declaration, has previously served on ACIP and on the US Food and Drug Administration’s Vaccines and Related Biological Products Advisory Committee.\nDr. Vicky Pebsworth, the Pacific region director of the National Association of Catholic Nurses, also served on the FDA vaccine committee. Pebsworth has questioned vaccine safety, citing her son’s “serious, long-term health problems” after vaccinations at 15 months, and served on the board of the nonprofit National Vaccine Information Center, which has suggested links between vaccines and autism.\nDr. Michael Ross, a professor of obstetrics and gynecology at George Washington University and Virginia Commonwealth University, has previously served on the CDC’s Advisory Committee for the Prevention of Breast and Cervical Cancer. Kennedy also nodded in his statement to Ross’ “continued service on biotech and healthcare boards.”\nThe private equity company Havencrest, in which Ross is an operating partner, describes him on its site as a “serial CEO” who has served on the boards of several biotechnology companies.\nRebuilding ACIP\nACIP, established in 1964, plays a quiet but significant role in American vaccine policy. The panel is typically an assembly of pediatricians, immunologists, researchers and patient advocates, and it is tasked with reviewing vaccine safety and efficacy and voting on who should receive which vaccines. Its recommendations shape insurers’ coverage of vaccines and physicians’ recommendations to their patients.\nKennedy has promised that a “clean sweep” of federal vaccine advisers will restore public trust in the medical establishment and in vaccines.\nHe argued in several public comments this week that the panel was rife with conflicts of interest and has served as a “rubber stamp” for vaccine manufacturers for years. ACIP members have historically stated disclosures and conflicts of interest at the start of meetings and make federal filings about stock holdings and research funding. ACIP also recently published members’ conflicts and disclosures from 2000 through 2024 online.\nThe secretary has also said that several previous ACIP members “were last-minute appointees of the Biden administration” and that without dismissing the panel, the Trump administration would not be able to add new members until 2028.\nBiden officials appointed eight members to ACIP in the final months of his administration. Panelists typically serve for four years.\nKennedy wrote on X Tuesday that none of the new ACIP members would be “ideological anti-vaxxers.”\n“They will be highly credentialed physicians and scientists who will make extremely consequential public health determinations by applying evidence-based decision-making with objectivity and common sense,” he said.\nAlthough the secretary of Health and Human Services has the authority to remove and appoint new members to advisory boards, Kennedy’s complete overhaul and speedy appointment of new members earned swift rebukes from physicians, nurses and some former health officials.\nThe American Medical Association, which is meeting in Chicago this week, adopted a resolution calling for Kennedy to reverse the decision to remove the previous ACIP members, particularly in the current climate around public health in the U.S.\n“With an ongoing measles outbreak and routine child vaccination rates declining, this move will further fuel the spread of vaccine-preventable illnesses,” AMA President Dr. Bruce Scott said in a statement.\nVetting the new panel\n“We’ve taken a giant step backwards,” said Dr. Paul Offit, a vaccine scientist at the Children’s Hospital of Philadelphia and an outside adviser on vaccines to the US Food and Drug Administration. “We had on that committee, before the purge, the kind of expertise and experience and institutional memory from which we benefited. We don’t have that anymore.\n“You have two anti-vaccine activists in that group,” Offit said. “Robert Malone, who testified in front of Congress that mRNA vaccines cause cancer, and you have Vicky Pebsworth, who is a member of the anti-vaccine group the National Vaccine Information Center.”\nA suggestion that the new advisory committee will review the existing immunization schedule “could mean that everything’s in play,” he said. “Every vaccine that’s on the current schedule is in play. Who knows what they could do? They could say, ‘I think that these other vaccines need to be tested in the right way, because they haven’t been tested in the right way before, and we’re going to suspend their use until they’re tested the right way.’ The sky’s the limit. It’s chaos. One can only imagine how bad it could be.”\nOffit was previously a member of ACIP and said the review of a new candidate before their appointment, including their conflicts of interest, typically takes at least two to three months.\n“You have to fill out a lot of forms, and people look very carefully,” he said. “One, to see whether you have the expertise; two, to see whether or not there’s any undue connections, that you are completely independent of the pharmaceutical industry and completely independent of the government.\nTwo just-dismissed ACIP members noted that their application and review processes took much longer: from a year and a half to more than two years, although one pointed out that it’s possible the process could be faster if an HHS secretary were in a hurry.\nWall Street reacts\nThe investment community following biopharma stocks also reacted with unease to the new slate.\n“We are particularly concerned by the appointments of vaccine critics like Drs. Malone and Kulldorf, and Vicky Pebsworth,” said Evan Seigerman, an analyst with the financial firm BMO Capital Markets, noting that Malone “has contributed to Covid-19 conspiracies and vaccine critique,” Kulldorf “was against Covid lockdowns and vaccine mandates” and Pebsworth’s National Vaccine Information Center has been “widely criticized for spreading vaccine misinformation.”\nSeigerman added, though, that “while the appointment of known vaccine dissidents is alarming, such voices do not appear to dominate the committee.”\nHe pointed out that the biggest fallout from the committee changes could be to insurance coverage of vaccines, noting that “ACIP’s role in determining the annual US vaccine schedule is typically what then drives US insurer coverage decisions.”"
    },
    {
      "url": "https://www.cnn.com/2025/08/28/politics/video/cdc-leaders-resign-rfk-jr-src-digvid",
      "text": "Video Ad Feedback\nCDC leaders who resigned sound alarm over direction of public health under RFK Jr.\nCNN's Kaitlan Collins speaks with three former CDC leaders who resigned after decades of public service in the wake of CDC Director Dr. Susan Monarez's departure amid clashes with HHS Secretary Robert Kennedy Jr. over vaccine policy.\n05:09\n- Source:\nCNN\nPolitics of the Day\n18 videos\nVideo Ad Feedback\nCDC leaders who resigned sound alarm over direction of public health under RFK Jr.\nVideo Ad Feedback\nNew video shows moment US strikes alleged ‘drug vessel’ tied to Venezuelan cartel\nGov. Pritzker addresses Trump's 'unhinged' remarks\nVideo Ad Feedback\nJudge blocks removal of Guatemalan children in US custody\nVideo Ad Feedback\nPritzker warns the Trump admin. about reported operation in Chicago\nVideo Ad Feedback\n'A power grab': California Republicans vow to fight Newsom's plan to redistrict\nVideo Ad Feedback\nHear what Chicago mayor said before signing order aimed at resisting Trump’s immigration crackdown\nVideo Ad Feedback\nAppeals court says Trump unlawfully leaned on emergency powers to impose tariffs\nThis week at the White House: Trump mulls sending additional troops to cities, and more\nVideo Ad Feedback\nTrump cancels Kamala Harris' Secret Service protection\nVideo Ad Feedback\n‘Am I the next person?’: Former Pence staffer and Trump critic on retribution fears\nVideo Ad Feedback\nHear Maryland governor's message to Trump over possible deployment of National Guard in his state\nVideo Ad Feedback\nTrump cabinet secretary defends sending National Guard to only Democratic-led states\nVideo Ad Feedback\nTrump says he will seek death penalty for murders in DC\nVideo Ad Feedback\n'Questionable' cause: Former prosecutor reacts to Trump firing of Fed governor\nVideo Ad Feedback\nKilmar Ábrego García speaks out before entering ICE facility"
    },
    {
      "url": "https://www.cnn.com/follow",
      "text": "Close icon\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nMore\nUS\nWorld\nPolitics\nBusiness\nHealth\nEntertainment\nUnderscored\nStyle\nTravel\nSports\nScience\nClimate\nWeather\nUkraine-Russia War\nIsrael-Hamas War\nGames\nWatch\nListen\nLive TV\nSubscribe\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nSign in\nMy Account\nSettings\nNewsletters\nTopics you follow\nSign out\nYour CNN account\nSign in to your CNN account\nLive TV\nListen\nWatch\nEdition\nUS\nInternational\nArabic\nEspañol\nEdition\nUS\nInternational\nArabic\nEspañol\nUS\nCrime + Justice\nWorld\nAfrica\nAmericas\nAsia\nAustralia\nChina\nEurope\nIndia\nMiddle East\nUnited Kingdom\nPolitics\nTrump\nFacts First\nCNN Polls\n2025 Elections\nBusiness\nTech\nMedia\nCalculators\nVideos\nMarkets\nPre-markets\nAfter-Hours\nFear & Greed\nInvesting\nMarkets Now\nNightcap\nHealth\nLife, But Better\nFitness\nFood\nSleep\nMindfulness\nRelationships\nCNN Underscored\nElectronics\nFashion\nBeauty\nHealth & Fitness\nHome\nReviews\nDeals\nGifts\nTravel\nOutdoors\nPets\nEntertainment\nMovies\nTelevision\nCelebrity\nTech\nInnovate\nForeseeable Future\nMission: Ahead\nWork Transformed\nInnovative Cities\nStyle\nArts\nDesign\nFashion\nArchitecture\nLuxury\nBeauty\nVideo\nTravel\nDestinations\nFood & Drink\nStay\nVideos\nSports\nPro Football\nCollege Football\nBasketball\nBaseball\nSoccer\nOlympics\nHockey\nScience\nSpace\nLife\nUnearthed\nClimate\nSolutions\nWeather\nWeather\nVideo\nClimate\nUkraine-Russia War\nIsrael-Hamas War\nWatch\nLive TV\nCNN Headlines\nCNN Shorts\nShows A-Z\nCNN10\nCNN Max\nCNN TV Schedules\nFlashDocs\nListen\nCNN 5 Things\nChasing Life with Dr. Sanjay Gupta\nThe Assignment with Audie Cornish\nOne Thing\nTug of War\nCNN Political Briefing\nThe Axe Files\nAll There Is with Anderson Cooper\nAll CNN Audio podcasts\nGames\nDaily Crossword\nJumble Crossword\nPhoto Shuffle\nSudoblock\nSudoku\n5 Things Quiz\nAbout CNN\nSubscribe\nPhotos\nInvestigations\nCNN Profiles\nCNN Leadership\nCNN Newsletters\nWork for CNN\nFollow CNN\nTopics you follow\nManage your email update preferences in\nAccount Settings\n.\nNew: Get the latest updates on topics you follow in your email inbox.\nSign up now\nAdd more topics\nSelect topics to follow\nUnlock your personalized feed and get email updates on topics you follow with a free CNN account.\nPopular\nAI\nAstronomy\nAviation news\nClimate change\nCongressional news\nDOGE\nEric Adams\nExtreme temperatures\nFashion and beauty\nGreen energy\nGun control\nHistory uncovered\nHurricanes\nImmigration\nInflation\nIsrael-Hamas war\nLGBTQ issues\nMovies\nOlympics\nRace & ethnicity\nStorms\nSupreme Court\nTariffs\nTech news\nThe Pope\nTikTok\nTrump legal cases\nUS military\nWar in Ukraine\nWellness\nAll\n5 Things\nAaron Rodgers\nAbortion rights\nAbuse in church\nActivism\nAdam Sandler\nAdele\nAfrica\nAge & Generations\nAgriculture\nAI\nAir quality\nAir travel safety\nAirplane crashes\nAlex Morgan\nAncient creatures\nAngel Reese\nAnimal stories\nAOC\nAriana Grande\nAsia\nAstronomy\nAuto industry\nAviation news\nAwards shows\nBaltimore bridge collapse\nBasketball\nBeatles\nBeyoncé\nBiden family\nBiden's cabinet\nBillie Eilish\nBono\nBrad Pitt\nBradley Cooper\nBritney Spears\nBruce Springsteen\nBTS\nCaitlin Clark\nCampus protests\nCancer\nCardi B\nChildren's health\nChina\nChronic diseases\nCivil conflicts\nClimate & Wildlife\nClimate change\nClint Eastwood\nCoco Gauff\nCongressional news\nCorporate news\nCrime\nCristiano Ronaldo\nCruises\nCrypto\nCulture wars\nDeep space\nDementia\nDemocratic Natl Committee\nDemocratic Natl Convention\nDemocratic presidential candidates\nDenzel Washington\nDigital privacy\nDigital security\nDisability issues\nDiversity and equity\nDOGE\nDolly Parton\nDonald Trump\nDrought\nDrugs in society\nDua Lipa\nDwayne Johnson\nEarthquakes\nEconomy\nEducation policy\nElection polls\nElection security\nElectoral college\nEllen DeGeneres\nElton John\nEndangered life\nEnvironmental disease\nEric Adams\nEuropean Union\nExtreme temperatures\nFashion and beauty\nFEC\nFederal agencies\nFighting disinformation\nFlorence Pugh\nFood & drink\nFood & health\nFootball\nFreedom of religion\nFreedom of speech\nGardening\nGenetics\nGeorge Clooney\nGeorgia election case\nGetting older\nGolf\nGreen energy\nGubernatorial elections\nGun control\nGun violence\nHarry Styles\nHealth care policy\nHeart disease\nHistory uncovered\nHomes\nHouse election\nHouse leadership\nHousehold debt\nHuman rights\nHurricanes\nImmigration\nImmigration politics\nIndependent candidates\nIndia\nIndigenous people\nInflation\nInterest rates\nInterior design\nInvesting\nIsrael-Hamas war\nJanuary 6th\nJapan\nJason Aldean\nJay-Z\nJD Vance\nJennifer Lawrence\nJennifer Lopez\nJessica Pegula\nJob market\nJoe Biden\nJohnny Depp\nJulia Roberts\nJustin Bieber\nKamala Harris\nKanye West\nKaty Perry\nKim Kardashian\nKylian Mbappe\nLabor unions\nLady Gaga\nLeBron James\nLeonardo DiCaprio\nLewis Hamilton\nLGBTQ issues\nLibertarian Party\nLionel Messi\nLively-Baldoni lawsuit\nLizzo\nMadonna\nMaria Sharapova\nMaternal health\nMatt Gaetz\nMax Verstappen\nMedia\nMedicare\nMegan Rapinoe\nMegan Thee Stallion\nMen's health\nMental health\nMeryl Streep\nMexico\nMichael Jordan\nMick Jagger\nMike Tyson\nMiley Cyrus\nMovies\nMusic\nNational security\nNATO\nNew in medicine\nNorth Korea\nNovak Djokovic\nNRA\nObituaries\nOceania\nOil & gas\nOlivia Rodrigo\nOlympics\nOprah Winfrey\nPACs\nParenting\nPatrick Mahomes\nPaul McCartney\nPay & income\nPedro Pascal\nPeople in entertainment\nPeople in sports\nPersonal finance\nPete Hegseth\nPlanned Parenthood\nPolicing\nPollution\nPort workers strike\nPoverty\nPrescription drugs\nPresidential debates\nPrimary elections\nRace & ethnicity\nRafael Nadal\nRail travel\nReality entertainment\nRelationships\nReligion\nRepublican National Committee\nRepublican National Convention\nRepublican presidential candidates\nRespiratory viruses\nRetail consumer\nRingo Starr\nRolling Stones\nRoyals\nRussia\nSam Bankman-Fried\nSamuel L. Jackson\nSean 'Diddy' Combs\nSenate election\nSenate leadership\nSerena Williams\nShaquille O'Neal\nShohei Ohtani\nSimone Biles\nSoccer\nSocial media\nSouth America\nSouth Korea\nSpace programs\nSpace tourism\nState & local races\nSteph Curry\nStocks\nStorms\nStudent life\nSupreme Court\nSupreme Court justices\nSustainability\nSyria conflict\nTariffs\nTaxes\nTaylor Swift\nTech giants\nTech news\nTennis\nTerrorism\nThe Amazon\nThe Caribbean\nThe Middle East\nThe Pope\nThe UN\nTiger Woods\nTikTok\nTim Walz\nTom Brady\nTom Cruise\nTom Hanks\nTrain accidents\nTravel News\nTravis Kelce\nTrump appointments\nTrump family\nTrump legal cases\nTulsi Gabbard\nTupac Shakur killing\nTV shows\nTyler Perry\nUK\nUS elections\nUS military\nUS shutdown\nVaccines\nVehicle safety\nVenus Williams\nVeterans\nVideo gaming\nVisual arts\nVolcanoes\nVoting rights\nWar in Ukraine\nWater availability\nWellness\nWildfires\nWill Smith\nWinding down\nWomen's health\nWork life\nZendaya\nNext\nCancel\nor\nsign in to see your topics\nFind this page again in your account menu. Feedback? Let us know at\nFollow@cnn.com\n.\nDon't miss out on new stories!\nGet updates on topics you follow in your email inbox.\nSign up\nSign up\nUh, oh. Something happened.\nIt could be you, or it could be us, but there's no page here."
    },
    {
      "url": "https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.fda.gov%2Fabout-fda%2Fethics%2Fspecial-government-employee-sge-resources&data=05%7C02%7Ckatherine.dillinger%40cnn.com%7Cf21cbd9e2f1f43b81b6808ddea8cbd94%7C0eb48825e8714459bc72d0ecd68f1f39%7C0%7C0%7C638924612530795950%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=t4AgQoqRwAY8Jhswers50UDXrKJw6Xdf8Ke%2FeVoMe40%3D&reserved=0",
      "text": "Special Government Employee (SGE) Resources\nBelow are a list of laws and regulations applicable to Special Government Employee (SGE):\nSGE Annual Ethics Training\nAll SGEs are required to complete ethics training annually. If you have any questions regarding ethics training for SGEs, please contact Advisory Committee Oversight and Management Staff (ACOMS) by email at ACOMSsubmissions@FDA.HHS.gov.\nThe Principles of Ethical Conduct were established by Executive Order 12674, modified by Executive Order 12731, as basic principles regarding the conduct of federal employees. It is important that federal employees observe these principles in order to promote confidence in the integrity of the federal government.\nStandards of Ethical Conduct for Employees of the Executive Branch\nThe Standards were developed by the Office of Government Ethics and set forth the basic obligation of public service. The standards contain regulations regarding matters such as conflicting financial interests, impartiality in performing official duties, and misuse of position.\nHHS Supplemental Standards of Ethical Conduct\nOn February 3, 2005, The Department of Health and Human Services (HHS) amended the Supplemental Standards of Ethical Conduct (5 CFR 5501) and Supplemental Financial Disclosure Requirements section\n(5 CFR 5502), both effective on that date. On August 31, 2005, HHS published the Final Rule for both sections.\nUnited States Code, Title 18 contains the criminal conflict of interest statutes applicable to employees in the executive branch of the government. Included in Title 18 is a prohibition against solicitation or receipt of bribes; a prohibition against acting as an agent or attorney before the government; post-employment restrictions; a prohibition against participating in matters affecting personal financial interest; and a prohibition against receiving supplementation of salary as compensation for government service.\nAdditional Resources\n-\n“Ethics Rules for Advisory Committee Members and Other Individuals Appointed as Special Government Employees (SGEs)” an 11-page summary prepared by the HHS OGC Ethics Division\n-\n“Overview of the Ethics Rules for Special Government Employees Serving on Advisory Committees,” a brochure prepared by the HHS OGC Ethics Division.\n-\n“To Serve with Honor,” a 16-page booklet for advisory committee members prepared by the U.S. Office of Government Ethics (OGE) in 2008.\n-\n“The Ethical Choice: Ethics for Special Government Employees” at https://www.youtube.com/watch?v=yDnYTRATCrs.\nRelevant Forms\n-\nOGE-450 Confidential Financial Disclosure Report\n-\nFDA-3410 Confidential Financial Disclosure Report for Special Government Employees\n-\nHHS-697 Foreign Activities Questionnaire\nFor all other Advisory Committee or SGE related questions, please visit the Advisory Committee Oversight and Management Staff (ACOMS) website https://www.fda.gov/AdvisoryCommittees/default.htm or contact ACOMS by phone at (301) 796-8220 or email at ACOMSsubmissions@FDA.HHS.gov."
    }
  ],
  "argos_summary": "Dr. Paul Offit, a prominent vaccine scientist and critic of HHS Secretary Robert F. Kennedy Jr., was barred from serving on the FDA’s Vaccines and Related Biological Products Advisory Committee after his term expired and paperwork was reportedly held up by HHS. The move follows Kennedy’s broader purge of CDC and FDA vaccine advisers amid accusations of conflicts of interest and a push for stricter vaccine oversight. Offit’s exclusion highlights tensions between public health experts and the current administration’s vaccine policy direction.",
  "argos_id": "3EFO1OOMT"
}