{
  "url": "https://www.forbes.com/sites/johntamny/2025/09/02/book-review-ed-zwicks-excellent-hits-flops-and-other-illusions/",
  "authorsByline": "John Tamny",
  "articleId": "54bea9be502c4cfe8d8f7eff9db6c54f",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b08e38784bc8e3675561d7/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T15:00:00+00:00",
  "addDate": "2025-09-02T15:10:33.233448+00:00",
  "refreshDate": "2025-09-02T15:10:33.233451+00:00",
  "score": 1.0,
  "title": "Book Review: Ed Zwick’s Excellent “Hits, Flops, And Other Illusions”",
  "description": "The rapid segmentation of audiences may herald the end of the Hollywood memoir as we know it. Let's enjoy them while we still can.",
  "content": "The Calendar section in the Los Angeles Times used to be thick Monday through Saturday, and then near book-length on Sundays. So many ads promoting released and soon-to-be-released films, and so many articles about the movie industry that has long animated business activity in Los Angeles.\n\nThe Calendar section, and surely Variety to a smaller but much more substantive collection of industry insiders, fed Hollywood and broad excitement about it. It was in Calendar sometime in the early 1980s that I was introduced to Michael Ovitz as the most powerful person in Hollywood. It sparked a lifelong fascination with Ovitz, and a review (here) of his eventual memoir that I didn’t want to end.\n\nNotable about Ovitz is that while at CAA he morphed from agent to advertising maven to investment banker. In modern times, Ovitz has taken his talents to Silicon Valley where he invests in and mentors the technology visionaries of today and tomorrow. Which is kind of the point. And it’s an unfortunate one for those long fascinated by the Hollywood of old.\n\nWhile the movie industry remains big and rich, they’re getting much richer up in northern California. One reason is that in seeding a golden age for television most notably, Silicon Valley has so minutely segmented audiences (while making information consumption an online endeavor) that the days of big network television shows, major movie releases, and thick Calendar sections/Variety issues are largely in the past.\n\nQuick: name five famous directors today. Five producers. Except for the film stars essentially grandfathered (directors and producers too) into the segmented present, name several modern male and female movie stars.\n\nAbout what you’ve read, it’s not a total lament. Progress can’t be lamented, and this is progress whereby something better replaces the past. The number of movies and television shows that entertain a wide range of audiences anytime and anywhere is surely bigger than ever. Still, it’s hard not to miss the grandiosity of the Hollywood of old, of the studio executives, producers, directors, actors and actresses that so many were so familiar with, along with the relentless efforts by their would-be replacements to take their spots at the top.\n\nAll this throat-clearing is seemingly necessary as a jump-off to director, producer and actor Ed Zwick’s (Thirtysomething, Glory, Shakespeare In Love, Under Siege, My So-Called Life, and many more) excellent and insight-driving new memoir, Hits, Flops and Other Illusions: My Fortysomething Years In Hollywood. While I haven’t seen all or even half of what Zwick created, he’s long been a successful somebody in Hollywood. As someone who devours Hollywood histories and memoirs, I wasn’t going to miss Zwick’s.\n\nI’m glad I didn’t firstly because Zwick has a very interesting story to tell, but I’m also glad because there’s a case to be made that audience segmentation will render the Hollywood memoir much less of a thing in the future. If segmented audiences shrink the household names and those close to it, what will be the purpose of memoirs or publishing of same? Better yet, won’t the shrinking of the bold-faced names in front of and behind the camera cause more than a few of the ambitious to skip Hollywood altogether? While Zwick’s career choice in 2025 versus 1975 will be speculated on later, it’s no reach to suggest that if graduating from UCLA in 2025, Ovitz would be heading north, or east.\n\nWith Zwick, one of the more appealing aspects of his memoir is that there’s an admirably sheepish quality to what he remembers. While he tells the reader up front that he’ll be “dropping a few names,” he refers to Tom (Cruise), Brad (Pitt) and Julia (Roberts) with evident embarrassment? There’s no critique here. First-name references of celebrities are obnoxious even if the person (like Zwick) knows them quite well. That Zwick can drop names is plainly a part of the appeal of his memoirs, but it’s still appreciated that he recognizes, even after directing so many prominent names, that it’s good to be humble even if on the surface. The surface qualifier comes up because Zwick himself acknowledges the contradiction: he presents himself as “a thoughtful, collegial guy who wants everybody’s opinion while in fact I’m Ahab in a baseball cap.”\n\nZwick is also fun. While he hides a few names, he’s frequently willing to name names while writing “about mentors, monsters, and the meaning of friendship.” You will recognize the people written about, and perhaps savor the fact that you care to read about the stars, producers and directors. If the whiny laments at the opening of this review have any validity, increasingly segmented audiences will have readers of scarce future memoirs that drop “a few names” wondering just who some of the people are whose names are being dropped.\n\nZwick attended New Trier outside Chicago, which is the Greenwich, Beverly, Langley, Highland Park (Dallas), San Marino High of the Chicago area. It brings to mind the right’s disdain for public or “government” schools. Many of them are quite good. So many huge successes have emerged from New Trier, which is just a comment that good schools are invariably an effect of the students showing up for school each day.\n\nIn Zwick’s case, he writes that “I’ve been work-addicted since childhood.” Translated, Zwick was going places. Though he suffered a boom-bust, alcoholic father, his father’s own ups and downs surely said something about his own ambition. It brings on a speculation that it would be interesting to know if Zwick has already addressed himself.\n\nHe writes on p. 1 that “I tell stories for a living,” which is an implied comment that whatever the certain brutalities of the business he chose, Zwick loves what he does. As he writes toward memoir’s end, “I honestly can’t ever remember waking up in the morning and saying, ‘Shit, I have to go work today.’” What’s funny and true about what Zwick writes is that even if he hadn’t written it, wise readers could have attributed it to him. That’s because you don’t last forty years in an industry as ruthlessly competitive as Hollywood, and get to write memoirs about it, unless you’re energized by what you do. It’s a truth and a lesson that perhaps explains Zwick's father.\n\nWhat if he’d been born when his son was? Opportunity was so much vaster and more wide-ranging in 1974 when Ed Zwick graduated from Harvard as opposed to when Allen Zwick was starting out. The view here is that this matters a great deal.\n\nEd Zwick’s father was quite the drinker, evidently the son not as much. Except that the son loved his work, and when you love your work you’re more likely to avoid what interferes with it? It’s a long way of suggesting that in the future, alcoholism, addiction more broadly, and most of all indolence will become rarer. Thanks to AI, other machine advances, along with soaring global cooperation among hands and machines, the work of tomorrow will powerfully amplify the skills and intelligence of exponentially more individuals who would have been viewed as failures or layabouts or boom-and-bust types in the past. Zwick was and is excited to go to work each day, but much more interesting will be how excited his grandkids will be each morning. I’ll bet Allen Zwick would have been one of the much more excited, much more focused types had he been born later.\n\nUpon graduation from Harvard, Zwick was already a somebody. He had published in magazines like The New Republic. Publisher Martin Peretz, who similarly wrote a great memoir of recent vintage (my review here), was one of Zwick’s professors at Harvard. The main thing is that The New Republic was no easy feat to be placed in. Zwick must have had something, and he must have networked well while at Harvard.\n\nThat’s because upon moving to Paris after graduating, he was working as Woody Allen’s assistant on Love and Death. Again, he was going places. Upon returning to the United States, Zwick was accepted into the American Film Institute’s (AFI) program for would-be filmmakers, plus Allen connected him to the well-to-do daughter of a Bel-Air ad mogul.\n\nAbout what you’ve read, none of it is to suggest Zwick had it easy. As Brian Grazer wrote in A Curious Mind, Hollywood is the land of no. Even Grazer, who is most know for being Ron Howard’s producer, is constantly being turned down. To make it in the film business, let alone work in it for forty years, is not a story of connections. As Zwick’s longtime production partner Marshall Herskovitz put it to him in an emotional moment for the both of them, there’s no such thing as “a free pass to a career.”\n\nIt was at AFI that Zwick discovered Herskovitz, the other way around, or both. They work together to this day, which is inspiring. It would be interesting to know if Herskovitz would accept Zwick’s self-deprecating take that Herskovitz was the bigger talent. Zwick quotes Madame X to explain his decision to work with Herskovitz: “I couldn’t risk becoming your enemy, so I became your friend.”\n\nZwick describes Herskovitz as technically proficient and a great writer, while allegedly his one attribute “was the ability to be dropped anywhere in a story and be able to say what scene came before and what beat should come after.” Since your reviewer is an economics writer, it will be said that the partnership of Zwick and Herskovitz explains well the genius of free trade: people are never a cost or a burden, just as goods and services from around the world are never a cost or a burden. When we combine production, and in doing so combine varied skills, the end results are much better and much more abundant.\n\nZwick didn’t waste time making his way up. The cancelation of a television show James at 15 led to Zwick’s writing being sent to the producers of Family, which could lay claim to A-list producers like Mike Nichols and Leonard Goldberg. Even better, upon connecting himself to Family, good fortune shined on Zwick beyond being hired by such a name show: story editor David Jacobs had just sold a pilot (it was Dallas) which led to Zwick being asked to replace him.\n\nThe same Zwick who’d been living in a seedy Hollywood motel soon found himself making more money per week than he had in the previous two years. More crew departures from Family to other shows (including one that lasted six episodes – no one knows anything!) meant that within a year Zwick had ascended to showrunner; all of this by the age of 27.\n\nYet with Zwick, it was always more than that. Or so it seems? While self-deprecating, there must be an ego there. See the Ahab reference. And that’s not a dig. It’s a comment once again that you don’t get to where he did by being unassuming. He had to have had a certain something, and perhaps it was his father’s charisma minus the alcohol? This is asked because amid all this Zwick had scripts that were being read by Michael Douglas, plus he could be found playing tennis at Leonard Goldberg’s house along with Sidney Poitier and Charlton Heston. For a wife to whom he’s married to this day, Zwick found his way to the quite beautiful and smart Liberty Godshall, the daughter of Bucks County (PA) big-wig and gentleman farmer, Ray Godshall; Ray so striking that he routinely made it into Zwick’s projects. These things don’t just happen to anyone. Interesting as Zwick is, to read him is to think that he’s more of a presence than he lets on.\n\nThe good news is that Family prospered, and as Zwick recalls, “it was the second best thing that happened to me.” What was the first? The cancelation of Family, which led to Zwick and Herskovitz’s production of television movie Special Bulletin. Written by Herskovitz and directed by Zwick, the film about a terrorist group’s threat to detonate a nuclear bomb in Charleston, SC proved a ratings and critical winner. Zwick and Herskovitz were showered with Emmys, Directors’ Guild, Writers’ Guild, and other awards. They were both inside and thriving, which is arguably a bit of a redundancy.\n\nIt all led to Thirtysomething, the show that familiarized me with Zwick and Herskovitz. A college girlfriend turned me onto it, and distant memories tell me that a major part of my interest was rooted in interest in the girlfriend. That's not a knock on Thirtysomething, or the girl.\n\nThe production duo pitched it to producers based on the view that “we didn’t recognize anyone on television who looked or sounded like us.” But as Zwick isn’t afraid to say, they and those who acted out Zwick, Herskovitz, and their wives sounded like “whiny,” invariably “self-absorbed” people.\n\nStill, to reduce critically acclaimed and award-winning Thirtysomething (Zwick recalls that Steven Bochco never spoke to him again after it beat LA Law for Outstanding Drama Series Emmy) to a bunch of whiny, self-absorbed left-wingers is to miss the point. It was plainly so much more. While all the yelling in Who’s Afraid of Virginia Woolf is to this day cited as a pathbreaking look into the alleged reality of marriage (for a great read of how it became a movie, read Philip Gefter's excellent Cocktails With George and Martha - review here), there’s an obvious case to be made that Zwick and Herskovitz did a much better job of revealing the endless ups and downs of it all.\n\nFunnily enough, there was no box set of Thirtysomething’s 80+ episodes until the 2000s, and what led to it resulted in a Wall Street Journal story. Memory says the story indicated it would soon be available, and it surely is as a streamer now. It would be interesting to watch now as a married person because the guess is that the show would resonate quite a bit more than it did at the time. It was very interesting then, while today it would be interesting and real. Memory of the episodes is slim, but the “endlessly peevish conversation that we call marriage” (the late P.J. O’Rourke) was vivified in it. Happiness followed by anger, misery, frustration, followed by happiness again. The bet here is that the show has aged better than its already sterling reviews.\n\nIn making it, Zwick writes of how they crafted the dialogue, that in real life “there’s talking and waiting to talk.” More powerfully, Zwick adds about the making of the show that “the strain on our marriages would have been intense enough had the four of us [Zwick, Herskovitz, Godshall, plus Susan Shilliday, Herskovitz’s wife] not been writing for the show.” Add the intense stress of the latter to the marriage itself all while writing marital troubles into the show, seeing intimate scenes involving your actual husband and wife (Ken Olin was married to Patricia Wettig, but they were married to others on the show), playing a single character (Peter Horton) while in the midst of an actual divorce, getting a divorce while acting out a troubled marriage, etc. It’s hard to read about.\n\nJust the same, the quality of the show is confirmed in the “family tree” that prospers to this day. Zwick notes that Ken Olin, Timothy Busfield and Peter Horton are big-time showrunners, Melanie Mayron “is booked as a director every week,” Polly Draper “writes and directs her own movies,\" Mel Harris has “an IMDb list of credits longer than my arm,” and on and on.\n\nThe early successes clearly established Zwick and Herskovitz. Which brings up an economic and political point. Zwick was accepted to Harvard Law, his father thought him nuts for turning it down (the bet here is that he would not criticize his son today for doing the same thing), but Zwick did just that. What’s interesting is that he suffered his own frustrations in doing as he did. As in he recognized that Harvard Law was the safer path to a nice apartment in the right part of Manhattan, well-taken-care-of kids, and all of this happening while he was living in his “dingy L.A. apartment reading scripts for other directors.”\n\nThe incredibly rare “seen” is what Zwick and Herskovitz became, but the much more common unseen is how many Harvard, Brandeis (Herskovitz) and AFI classmates never stuck it out in film and television, or if they did, never made it. Also unseen is how Zwick lived before making it, whereas the seen in Hollywood is the Beverly Hills, Bel-Air, Brentwood mansions that have at least historically housed the very few successes in what is a competitive industry.\n\nThe view here from this right-wing reviewer is that media types along with left-wingers too readily focus on the seen of Beverly Hills splendor, and the allegedly harmful inequality that the latter signifies, while never seeing the towering risks against brutal odds taken by the best and brightest of Hollywood to get to the top, or near it. Had Zwick gone to Harvard Law there never would have been the “dingy L.A. apartment,” but there also likely never would have been the highs of becoming a much-garlanded director, writer and producer. Risk and reward and all that, or insert your cliché.\n\nStill, it’s important. It is because Zwick is an unabashed left winger. While he thankfully keeps much of his memoir free of politics, it’s at least somewhat evident where he stands? Much time is spent on this simply because Zwick doesn’t hide from how hard it was to get where he was, and is. He quotes Leonard Goldberg as saying, “You pay to get paid.” So very true.\n\nThat it’s true raises a question: why is Zwick a left winger in consideration of the left’s frequent disdain of the rich, its desire to make the rich pay their “fair share” (it’s no reach to say that Zwick has paid more in taxes than 99.9999% of Americans), and in consideration of Hollywood’s not infrequent characterization of the rich as bad the bad people?\n\nTo be clear, this is NOT a call for Zwick to join the Republican Party. As my review of the Peretz book makes plain, I think George W. Bush the worst president in my lifetime, by far. And while a libertarian case can be made for Donald Trump’s first term as president, his second term with the deportations, the tariffs, the purchases of “Golden Shares” in U.S. companies, and the harassing of elite U.S. universities is more than execrable. Throw Trump out, throw the Republicans out, but also throw the Democrats out. They’re awful too. Arguably what makes them most palatable is that at least when they control the White House, Republicans act kind of like Republicans again.\n\nIt's a long way of asking why Zwick isn’t a libertarian. Not Libertarian Party, but libertarian as a philosophy. This is asked because Zwick plainly disdains war, loves success, plus from prospering in Hollywood all these years, it’s evident that he doesn’t care what goes on in other people’s bedrooms. At this point, it can confidently be said that the Democrats are only good on social issues, but even there they’re still authoritarian as evidenced by their support for the sick and pointless lockdowns that Donald Trump panicked into imposing in 2020, lockdowns that seriously harmed the American poor, brought over 200 million of the world’s poorest to the brink of starvation, and with Zwick's memoir in mind, led to the quick cancelation of a Thirtysomething reboot. Which means the Democrats are situationally pro-liberty, they increasingly support foreign adventurism even more than Republicans, plus the base at least disdains rich people.\n\nAll this, plus Zwick gives indications of frustration with the perpetually offended. I very much share his frustration, but credit must be given to Zwick for happening on this sad state of perpetual victimhood on the left and right back in the 1990s. After releasing The Siege (Denzel Washington, Annette Benning, Tony Shalhoub) in 1998, a film that some credited for its pre-9/11 foresight (Zwick is more circumspect about his vision), Zwick found himself under attack by The American-Arab Anti-Discrimination Committee due to the organization's anger over how Arab characters were portrayed in the movie.\n\nZwick responded with an excellent New York Times op-ed that resonates a great deal in 2025. He wrote that the feeling of the Committee “is that all one billion Islamic people in the world can be portrayed only in their most positive aspect.” Better yet, and in a passage that every perpetually up-in-arms left and right winger would ideally internalize, Zwick added that “These days, it seems people wake up in the morning not only waiting to be offended, but also hoping to be offended.” Yes! The media, teachers’ unions, Hollywood, universities, the New York Times, CNN, are being “mean” to conservatives daily. Conversely, the rich, Fox News, big business, the Freedom Caucus, sexist, and surely “racist” conservatives are being “mean” to the left each day. Both sides are truly ridiculous, and in their absurdity, they arguably foster even greater division given their unwillingness to allow discussion of anything. Zwick wrote about this too in the op-ed: “To shrink from any subject because it’s hurtful or politically sensitive or politically correct, or Islamically incorrect, is to deny one of the most important functions of art, which is to be provocative.” Amen.\n\nYou see, in the op-ed there’s free thinking reason that’s hard to find in Republican or Democratic circles in 2025. Zwick then saves the best for last: “So, I’m sorry I offended anyone. But I’m really not.” Yes! A thousand times. Let’s have more of this. Much more of this. Allowing for my bias, it’s the essence of libertarianism. I’ll wager that if Ed Zwick ever visited with Cato Institute co-founder Ed Crane, he would agree with most of what Crane has to say. Figure that Crane and Charles Koch (the other co-founder) were anti-interventionist long before it was cool to seriously disdain foreign adventurism (Cato somewhat uniquely came out against both wars in Iraq), they were for marital freedom long before Democrats and Republicans would touch it, and they were for ending the drug war long before its abject stupidity became more commonplace. In his chapter about the making of the excellent Traffic, Zwick describes the “drug war” as a “clown show.” Yes!\n\nBack to movies and television, Zwick tells would-be directors to not tell an actor what a great take they just had, but to instead just say they look incredible. That’s funny and sounds wise at the same time. What sounds incredibly difficult for the actor and director is the multiple takes. Think of the meaning of this. Zwick writes that “Invariably, one actor needed multiple takes while another lost his spontaneity.” Zwick describes actors as “passionate, reactive, oversensitive,” so imagine the collision of missed takes with his description of actors, and the inevitability that the best takes won’t always include each actor’s best work. It must be nightmarish for all concerned.\n\nHow to get movies made? Zwick makes a case for “getting the studio a little pregnant.” He adds that “once you can get them to start spending money its hard for them to stop because they would have to admit they’ve wasted it.” Zwick may or may not know it, but there he’s also describing government spending. Robert Moses said much the same, that he just needed a shovel in the ground to ensure what he started was finished. The view here is that film studios have a better track record than do governments, and they do precisely because it’s very hard to get the studio “a little pregnant.”\n\nAs Zwick puts it toward book’s end, “Movies aren’t born. They fight their way to life.” Precisely. What’s routinely recalled in entertainment memoirs is how difficult it is to get films made. No surprise there. There’s real money on the line. These truths first discredit the “easy,” “costless credit,” Federal Reserve narrative that reveals itself endlessly and obtusely among academics, economists and pundits, and they also show the dangers of the left and right’s obsession with increasing the flow of dollars to Washington. Not only does the latter logically (though paradoxically to some, and counterintuitively to others) result in soaring government debt, it means that government is being impregnated with too much frequency, all to the detriment of the creatives in technology, transportation, healthcare, and yes, entertainment.\n\nTaking this further, Zwick’s track record as a writer, director and producer means he’s worked with some of the biggest of big names, including Tom Cruise. Zwick and Herskovitz made The Last Samurai with Cruise in 2003, and it’s a very good lesson in how credit and capital flow, or not. Zwick writes that The Last Samurai had a green light from the moment Tom said yes. Think about how rare this is, and how few people can get a movie financed just for saying yes. As Zwick points out, awards season is defined by endless speeches about the years and decades that not infrequently precede the making of a film. Money is never easy.\n\nZwick lived the above truth up close with Shakespeare In Love. Looked at in retrospect, what an obvious film to greenlight. Except that they’re rarely obvious. Tom Cruise can get films made, but he’s had his duds. So has Steven Spielberg. Tim Matheson chose Spielberg’s 1941 over playing Ted Striker in Airplane!\n\nWith Shakespeare In Love, Zwick not only secured the services of Tom Stoppard on the way to making it into a great script, but he had Julia Roberts attached as the lead. Except that Roberts eventually walked. And the film went into “turnaround” and all manner of other Hollywood words. Roberts obviously didn’t know what she had, but she’s in an industry littered with what might have been. No one knew what Zwick had.\n\nOther than Harvey Weinstein. While Zwick plainly views him as a bad guy, he writes that “little has been said about his extraordinary displays of enthusiasm and powers of persuasion.” Weinstein told Zwick he was genius, that he would finance Shakespeare In Love, but changed his mind once he realized Miramax would be on the hook for the $6 million previously spent by Universal.\n\nZwick didn’t hear from him for years, during which he writes that “I must have show the script, often more than once, to every studio and independent financier with two nickels to rub together. All said no.” Remember this yet again next time conservatives marinating in their victimhood claim Hollywood is full of socialists. They’re ridiculous.\n\nEventually Weinstein made a trade with Universal to get the rights to Shakespeare In Love in return for King Kong. Zwick suggests it was Gwyneth Paltrow’s interest in the script that lit the fire under Weinstein, but the point of the story is that that movie that was impossible to finance was eventually made. Zwick rated a producer credit, but Weinstein made sure that he did not get the mic when it won Best Picture. It’s all a reminder of what a challenging business it is, but much more importantly in an economic sense, it disproves the trite, childish, “easy money” narrative that animates economists on the left and right. With the possible exception of Silicon Valley and Wall Street, the movie industry is easily the most brutally capitalist of all. Look up “movie jail” if you’re skeptical, or much better, read Zwick’s book in which “movie jail” is referenced.\n\nZwick writes that “there are certain actors so preternaturally gifted it takes your breath away.” Which has to be. These are the Michael Jordans of their craft. Except that there’s plainly more, and Zwick doesn’t hide from it. The looks, except that it’s more than looks. As he puts it, “certain faces let in the light.” Among others, he’s clearly talking about Brad Pitt, whom he first directed (one word) in Thirtysomething, but did so again in somewhat challenging fashion in Legends of the Fall. Some people just demand that you look at them, it seems.\n\nWhich may help explain the difficulties with actors on set for reasons beyond their emotional qualities. This comes up most notably in the making of Glory, and the extraordinary difficulties Zwick had not just with Matthew Broderick, but with his mother. It won’t be described here, but wow! It lends validity to Zwick’s later comment that “the best time to work with a movie star is immediately after he’s directed.” Somewhere David Ricardo is smiling.\n\nZwick quotes colleague Menno Meyjes at book’s end as saying “Working in Hollywood is a series of small humiliations interrupted by bigger ones.” Despite this, the highs clearly outweigh the lows as Zwick’s excitement about his work reveals page after page. Would Ed Zwick in 2025 take the film route that he took in 1975? That’s the question I’m asking in closing this review. That his and Liberty Godshall’s kids got the writing bug suggests that he would do the same thing again, but then the doctors of 1975 are up in Silicon Valley as is Michael Ovitz once again.\n\nHopefully Ed Zwick would still choose entertainment, but the trend says many won’t. Which means at least in one way, the world will be a little less fun. No memoir entertains like Hollywood, which is why readers should read Zwick’s, and many more.",
  "medium": "Article",
  "links": [
    "https://www.realclearmarkets.com/articles/2025/08/27/dear_conservatives_the_universities_didnt_do_it_neither_did_hollywood_1130535.html",
    "https://www.amazon.com/When-Politicians-Panicked-Coronavirus-Opinion/dp/1642938378/ref=sr_1_3?dib=eyJ2IjoiMSJ9.t5NLgYNKJFiXxjv06su8KMN3OfrJnCVsSpFm9ID5qLptbPWTrUrTU8Hnq28LmAsC9PraaCGB7A4m14FcSsJYP0e0Jzdk90kvD-5JDUAwKNGs3p4W6MFYQ8wNCMMFRmOEQk-zgfxmOb1VDr4FZSJ_WUxLNfdi-1PfmbxO5YCuGp4.v_0DpZWyCk-DrEHoVTheYFCSGEl-r8eLUhesH4Q9lG8&dib_tag=se&keywords=John+Tamny&qid=1756335925&sr=8-3",
    "https://www.realclearmarkets.com/articles/2025/02/27/book_review_philip_gefters_spectacular_cocktails_with_george_and_martha_1094172.html",
    "https://www.realclearmarkets.com/articles/2018/10/25/books_michael_ovitz_has_written_the_best_business_book_of_the_year_103452.html",
    "https://www.amazon.com/Hits-Flops-Other-Illusions-Fortysomething/dp/1668046997/ref=sr_1_1?crid=CLNPRWPQ7255&dib=eyJ2IjoiMSJ9.hO5_a2KDWZZFiziUpMvdswMJiDwBzkO5gSAaOKnR8ho.0fdmx_zvu5_4TjfuUTEUkUE0abvAYjZZinlbNC_dbck&dib_tag=se&keywords=ed+zwick+-+hits%2C+flops%2C+and+other+illusions&qid=1756211925&sprefix=Ed+Zwick%2Caps%2C109&sr=8-1",
    "https://www.realclearmarkets.com/articles/2023/12/07/book_review_martin_peretzs_excellent_the_controversialist_997283.html",
    "https://www.amazon.com/Deficit-Delusion-Everything-Supply-Side-National/dp/1510784853/ref=sr_1_1?dib=eyJ2IjoiMSJ9.t5NLgYNKJFiXxjv06su8KMN3OfrJnCVsSpFm9ID5qLob5lkPL84Ncj4obu6UnzDF1UcjR90PkaOJL0cZbdAi7kW6HxJjplzdKFRh41U9xqqs3p4W6MFYQ8wNCMMFRmOEQk-zgfxmOb1VDr4FZSJ_WUxLNfdi-1PfmbxO5YCuGp4.kcREyi3zrrQkbPslwuyRrC3FtjaRW_sPei27IxZESW0&dib_tag=se&keywords=John+Tamny&qid=1756312910&sr=8-1"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Zwick",
      "weight": 0.08429251
    },
    {
      "name": "Ed Zwick",
      "weight": 0.08334226
    },
    {
      "name": "Allen Zwick",
      "weight": 0.08197406
    },
    {
      "name": "other Hollywood words",
      "weight": 0.04778074
    },
    {
      "name": "Ed Zwick’s father",
      "weight": 0.04680842
    },
    {
      "name": "Zwicks memoir",
      "weight": 0.04594545
    },
    {
      "name": "other shows",
      "weight": 0.045721076
    },
    {
      "name": "Zwick’s longtime production partner",
      "weight": 0.044790395
    },
    {
      "name": "Zwick’s later comment",
      "weight": 0.0447726
    },
    {
      "name": "Zwick’s track record",
      "weight": 0.04443165
    }
  ],
  "topics": [
    {
      "name": "Reviews"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Books & Literature/Other",
      "score": 0.8330078125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.431640625
    }
  ],
  "sentiment": {
    "positive": 0.18105578,
    "negative": 0.44680646,
    "neutral": 0.37213776
  },
  "summary": "Ed Zwick has written a new memoir, \"Hits, Flops, And Other Illusions,\" about his Hollywood experience. The book was praised for its detail about Michael Ovitz, the most powerful person in Hollywood, who later moved into Silicon Valley where he invests in and mentors the tech visionaries. While Hollywood remains big and rich, the industry is becoming more accessible up in northern California due to the increasingly segmented nature of Silicon Valley. Zwick argues that audience segmentation could diminish the importance of memoirs or publishing of such works in the future. However, he acknowledges that while he is willing to drop a few names, he also acknowledges himself as a thoughtful, collegial guy who wants everybody to know.",
  "shortSummary": "Ed Zwick’s memoir \"Hits, Flops, and Other Illusions\" explores Hollywood's past, current trends, and its evolution to embrace digital technology.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2c997f82570744899f74bd75428e87bb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.realclearmarkets.com/articles/2025/08/27/dear_conservatives_the_universities_didnt_do_it_neither_did_hollywood_1130535.html",
      "text": "What’s firstly puzzling about the right’s Ivy League and Ivy League-adjacent hatred, and the belief that so much of what ails us is an effect of what \"they're teaching\" on campus, is that so many of their own attended Ivy League schools themselves. Tom Cotton attended Harvard and Harvard Law, Ted Cruz went to Princeton before Harvard Law, while Ron De Santis attended Yale before Harvard Law. Trump Supreme Court appointees Neil Gorsuch and Brett Kavanaugh attended Harvard and Yale Law respectively, while the Trump appointee conservatives most love to hate (Amy Coney Barrett) attended Notre Dame Law.\nIt's just a comment that conservative disdain for the Ivy League is frequently self-hatred. Somehow so many of the right’s greats emerged from the Ivy League with ideology intact, but supposedly this time is different?\nIt’s not. Conservative laments about left-leaning universities are as old as universities.\nSorry, but it's just not that bad on campus. If it were, parents wouldn’t send their kids to college, nor would the best of the best corporations routinely devote the majority of their recruiting to the Ivy League schools.\nYet whenever something goes wrong in the U.S., what they teach in universities is blamed. And when it's not universities being blamed, Hollywood is the next stop for the perpetually offended.\nSupposedly the movie industry is socialist, except that as director and producer Ed Zwick writes in his recent memoir, Hits, Flops, and Other Illusions, \"Movies aren't born. They fight their way to existence.\" In his 2015 book A Curious Mind, film producer Brian Grazer (A Beautiful Mind, Apollo 13, Splash, Rush, etc.) reported that he's turned down 90 percent of the time. So ruthless is Hollywood about money that Grazer has quipped that “Instead of spelling out the word H-O-L-L-Y-W-O-O-D in the famous sign in the Hollywood Hills, they could have spelled out: N-O-N-O-NO-N-O!” It's a long way of saying that Hollywood is - with the possible exceptions being Silicon Valley and Wall Street - the most capitalistic industry on earth.\nConservatives claim they're the answer to the societal problems created by elite universities and Hollywood, except that when markets healthily corrected in 2008 to the substantial betterment of the economy, it was “limited government,” “free market” Republicans in the Bush administration (George W. - Yale, Harvard Business School, Hank Paulson - Dartmouth, HBS, Ben Bernanke - MIT, Harvard) who demanded the bailouts that were precisely the crisis. And when the Trump administration discovered a coronavirus in March of 2020 that had plainly been spreading for months before, it was the Republicans in the Trump administration (Donald Trump - Penn) who oversaw an economy, freedom, and health-crushing lockdown.\nDid the Bushies and the Trumpists listen too much while being educated in the Ivy League, or is the whole thing about U.S. universities and Hollywood teaching us the wrong things a load of nonsense? Hopefully the question answers itself, and hopefully conservatives will quietly cease acting so foolishly. If not, a left winger with a clue may ask conservatives why, if Universities and Hollywood have made us so socialist, the Dow Jones Industrial Average is up over 50x since 1982? And if this time is once again different, it's not so different that markets are no longer a look into the future. That they're at all-time highs in no way correlates with rising socialism inside the electorate.\nWhich calls for conservatives to relax, and look inward. Whining about the universities and Hollywood reeks of victimhood. Worse, it makes conservatives look weak and non-believing. Honestly, what does it say about conservatives when they constantly imply that socialist messaging is more influential than their own?"
    },
    {
      "url": "https://www.realclearmarkets.com/articles/2025/02/27/book_review_philip_gefters_spectacular_cocktails_with_george_and_martha_1094172.html",
      "text": "It always interested Cato Institute co-founder Ed Crane that while left-handed writers represent roughly 11 percent of the population, something like 40 percent of Cato’s staff wrote left-handed. Crane’s conclusion from the statistical oddity was that the left-handed aren’t mirror images of majority. They see the world differently, and seemingly in a libertarian fashion.\nMore on Cato, when John Stossel would present to the Institute’s donors and explain his libertarianism, he would always say that he viewed homosexuality as something every bit as natural as heterosexuality. Few disagreed with Stossel considering how natural desire is, but after reading Philip Gefter’s spectacular new book, Cocktails with George and Martha: Movies, Marriage, and the Making of Who’s Afraid of Virginia Woolf, I found myself wanting to ask Crane, Stossel and the great libertarian scholar Charles Murray if, as with the left-handed (I am one), dyslexics, and other “minorities,” there’s perhaps something different about homosexuals; that to limit the difference to sexual preference is to miss something greater?\nWhat brought on the thinking, and the wondering, was the quote that Gefter leads with ahead of Chapter One. It’s by Fran Lebowitz, and it goes like this: “If you removed the homosexuals and the homosexual influence from what is generally regarded as American culture you would be pretty much left with Let’s Make a Deal.” What a remark. What an insight. And a very economically insightful one at that.\nIt brings to mind a taping of The Bill Walton Show from years ago. Walton was interviewing former Ronald Reagan staffer Ralph Benko and me, and the subject was my not-so-insightful view that much as economic policy matters, people matter much more. Where the talented go is a greater predictor of economic prosperity than growth-oriented policy is, and evidence supporting the previous claim can be found in Los Angeles, New York and San Francisco. Benko subsequently quipped that one of the best predictors of booming economic growth is where the gays go.\nWe all laughed, but he was right. There’s a predictive quality to where gays migrate. Which leads to the basic conclusion that the most visible difference among “minorities” is perhaps not what makes them most visible, and this once again includes sexual preferences.\nWhy all this throat clearing ahead of a review of a book about the making of a film based on a play that, in Gefter’s words, isn’t solely about a marriage, but is “equally, about marriage”? The answer is that much as Who’s Afraid of Virginia Woolf? isn’t solely about a marriage, Cocktails with George and Martha isn’t just about the making of a film. While Gefter’s book would be fascinating if only about the film, it’s so much more. It will cause the reader to think about so many things, including marriage. What a spectacular read.\nIt all begins with Edward Albee (1928-2016), who was the adopted child of a very well-to-do couple who had little to do with the child they adopted. As readers can probably guess from this review’s introduction, Albee was homosexual. That he was arguably explains Gefter leading with the previously mentioned Lebowitz quote. Up to Albee’s play (the critically acclaimed stage version of Who’s Afraid of Virginia Woolf? lasted 3 ½ hours), Gefter writes that “the movie industry’s preferred image of coupledom tended toward sweet – if insipid – romantic comedies.”\nAs for television, those familiar with the play or film are aware that George and Martha are nothing like the Ricardos, Nelsons, or Cleavers. How interesting then, that the individual who seemingly wrote the most realistic portrayal of marriage, the one who so ably depicted how “hatred tangles with love” and how “rage follows on the heels of affection,” was a homosexual who, for most of his life, couldn’t get married.\nBy the time Albee wrote Who’s Afraid of Virginia Woolf?, he was already a rising figure in New York’s theater world with successful, well-regarded plays including The Zoo Story and American Dream. Albee’s notoriety is worth mentioning mostly because by the time he’d finished writing Who’s Afraid of Virginia Woolf?, his reputation was such that the producers could bring the script to the biggest of big names. For instance, Henry Fonda’s agent was given a copy, but Gefter reports the agent “found it too unsavory to forward to his client.” Fonda eventually fired his agent over the error, and later said not playing George was his “single greatest regret.”\nArthur Hill secured the role that Fonda wished he’d gotten. He signed on despite his view that “This thing will never make a dime,” but it “has to be done” just the same. About the mistake made by Fonda’s agent, along with Hill’s low box office expectations, it should be said that if anyone ever wants to see the folly of antitrust law, they should just read books about entertainment. The future of entertainment is so powerfully uncertain, yet antitrust cops feel they must restrain the dominant businesses of the moment so that they don’t remain dominant in the future. Their work is conceited, but also superfluous. Hits of any kind are much more more often than not surprises, and since the hits are so difficult to predict, so are the future giants of business incredibly difficult to predict.\nWho’s Afraid of Virginia Woolf? opened on October 13, 1962 on Broadway (the symbol, not the street) at the Billy Rose Theatre. Upon completion of the play, the applause was “thunderous.” Only for the reviews to come in. Which on its own is interesting. The play opened on a Saturday night, which meant that producers, cast and the rest were waiting for the October 15 reviews. Except that this was 1962, and well before the internet. Gefter writes that the producers’ “spies were strategically placed at the various newspaper printing plants to deliver word of their fate hot off of the printing press.” What a different world it was. What we can get quickly and cheaply on the supercomputers in our pockets today used to require all sorts of planning, and expense to attain.\nNotable about the reviews is that they were mixed. The Mirror’s referred to Who’s Afraid of Virginia Woolf? as a “sick play about sick people,” while the New York Daily News led with the headline “A PLAY LIES UNDER THE MUCK.” So while Howard Taubman of the New York Times described the play as “a wry and electric evening in the theater,” Gefter writes that Billy Rose himself was already \"reading a different set of tea leaves” ahead of Taubman's praise. He sensed that the negative reviews would in some way titillate the public and bring them out. He offered to buy out the producers who wisely didn’t bite. The play was a huge hit, and a month after release Albee and other “tastemakers” found themselves at the JFK White House.\nThe buzz and the packed playhouses set Who’s Afraid of Virginia Woolf? up for a film version next. And interest among the boldfaced names in film acting was impressive. No less than Richard Burton observed that “you’ve only to read the first lines and you know this is a great play.” He told his wife in Elizabeth Taylor that she had to play Martha in the film version to ensure that no one else would.\nAll of which leads to some of the most interesting passages in the book. With Burton, Gefter is clear that he was most certainly something else. He quotes Hume Cronyn as saying that Burton “was truly touched by the finger of God: his appearance, despite the pockmarked face; his quick intelligence, beautiful voice, and above all, a Welsh lyricism of spirit that only money, notoriety, and an overweaning ambition to be a film star could waste.” Taylor herself said about Burton that his voice alone “drowned out the troubles, the sorrows, everything just melted away.” Which, oddly enough, was the problem.\nHow could someone as powerfully present and appealing to women play George, someone the preternaturally gifted writer in Gefter referred to as a “a beaten-down character whose authority was dimming behind his tattered dignity.” How, by extension, could a 32-year-old, impossibly beautiful Elizabeth Taylor play a run down, twenty pounds overweight, 48-year-old, alcoholic, Martha?\nAmazingly, the bigger challenge for the film’s producer (Ernest Lehman) was Burton. Gefter writes that as Lehman suspected, in screen tests “the Shakespearean actor came across with a masculine intensity that was too bold for George.” It brings on a pause. Is there a Burton equivalent today, or in modern times? Someone who combines presence with remarkable intelligence? Burton was of course known to sleep with all his leading ladies, which nowadays is a “cancel-able” offense. In which case are there a few Burtons out there who are just hiding it, or was he sui generis? As interesting as Gefter’s book is, to read it is for the reader wanting to ask the author so much more.\nUltimately Lehman wisely saw beyond Burton seemingly not being a fit for the role of George. As Gefter puts it, “if attaching Burton were the only way to secure Taylor as Martha, Lehman knew it was worth it.” Lehman secured for his film the most famous couple in the world.\nWhich brings us to Mike Nichols. Oprah Winfrey famously said that Nichols was the one that every woman at every dinner party wanted to be seated next to. In Life Isn’t Everything, Ash Carter and Sam Kashner’s oral history of Nichols (review here), they unearthed a quote from Burton himself that Nichols and Noel Coward were the two people he knew with “the capacity to change the world” anytime they walked into a room. Meaning Burton was a fan, as was Taylor, and they recommended him to Lehman. Though Nichols hadn’t yet directed a feature film, his genius (including as a Broadway director) was already known.\nWhere it becomes anecdotally and economically interesting is that with Nichols eager about directing the film version of Who’s Afraid of Virginia Woolf?, and with Taylor and Burton singing his praises to Lehman, Lehman called Nichols to discuss the project down in Jamaica where the polymath (his houses were filled with the best art, he knew the right Arabian horses to buy, he could sit down on a piano and play the music of the greats with ease) was on a working vacation. Gefter writes that the phone call “cost an astronomical $250 at the time.” Which is a reminder that one can learn exponentially more about economics reading books about Hollywood than one can by reading books by actual economists. Economists near monolithically believe economic growth causes inflation, but as the call between Nichols and Lehman reveals to the mildly sentient, economic growth (meaning productivity) is all about falling prices. In other words, Lehman had called Nichols in 2024 instead of 1964, the cost of the call would not have rated mention.\nNichols is endlessly interesting. In which case Cocktails with George and Martha is at least the third book read by yours truly in which he figures prominently. Carter and Kashner’s previously mentioned book is one of them, Mark Harris’s Mike Nichols: A Life (review here) is another, and it’s worth mentioning because the first two gave the impression that beyond the warts was a super nice guy. Gefter gives the reader a more nuanced look. He paints a picture of Nichols that acknowledges his staggering brilliance, but that includes his manipulative qualities, his social-climbing ways, his arrogance, and an inability “to stop himself from being dick-ish.” Put another way, Nichols was much more likely to transform a room walked into if Burton and those like him were in it, as opposed to any old room.\nHarris (Gefter references his biography of Nichols regularly) acknowledged Nichols’s neurotic ways, cited numerous instances of Nichols’s obsession with wealth (and an unrelenting fear that he was running out of it), but you wanted to hang out with Harris’s Nichols. That’s true with Gefter’s too, but his overall description isn’t as laudatory as is Harris’s.\nWhat’s important as applied to Who’s Afraid of Virginia Woolf? is that Nichols thought the world of Albee’s play, and he would plainly work tirelessly to bring the best version of it to the screen. As Gefter sees it, Nicholas “was doing it all for the sake of the picture.” This included calling the bluff of the legendary Jack Warner of Warner Brothers. Warner felt, as did the film distributors, that the movie version would be more bankable if filmed in color. This was something Nichols would not countenance, and it didn’t matter if Warner was sitting across from him. At one point when Warner demanded a color film, Nichols replied, “Shoot your film in color. I like it at home. I will just go back to New York.”\nSo who or what is Virginia Woolf? It was not the Bloomsbury set writer. In Albee’s rendering, Virginia Woolf was the examined life. Which is something all too many of us are afraid of, including George and Martha.\nGefter indicates that Albee had many models for George and Martha, including his own parents, but concludes that the characters were most modeled after Willard Maas and Marie Menken, professors at Staten Island’s Wagner College. George is a professor at a college where Martha’s father is president. George hasn’t done well. Gefter quotes John Kenneth Galbraith’s quip about how “I know the man. He’s never been published.” Nichols’s is own take was that George and Martha “are so locked together that each suffers what the other has not become.”\nThe great writer in Gefter arguably describes George and Martha best: “She has been starved for love; he has been defeated - emasculated – by failed ambition.” What comes out on stage and screen is the “peevish conversation we call marriage” (P.J. O’Rourke) through this couple. Let’s call their hatred tangled with love the hidden side of marriage.\nOr, as my RealClear and Parkview Institute colleague Rob Smith explained it in a recent column, “No one knows what goes on inside a marriage; there’s a lot of craziness and dysfunction in the world.” Exactly, and there’s a case to be made that the latter informs some of the unhappiness within marriages. Precisely because most of us see only the public face of other marriages, we ascribe endless happiness to them while wondering about our own.\nAs Gefter puts it oh-so-well, “Marriages tend to straddle a common paradoxical line. In public, couples by and large conform to a standard social etiquette, where bickering, say, is to be avoided. At home, though, behind closed doors, the private, truer reality of marital coalescence is lived out at the deeper, more intimate, and murkier foundation of emotional attachment.” So very true, yet so very difficult for so many couples to grasp? Comparing their marriages to other marriages, they’re actually doing no such thing. The private is nothing like the public.\nWhich was seemingly why Who’s Afraid of Virgina Woolf?, while so often over the top and hard to watch, resonated. Finally the private version of marriage was being portrayed publicly as George and Martha revealed the private version of marriage in front of another couple in Nick and Honey. About Nick and Honey, Gefter concludes that the story ultimately revealed George and Martha’s as the more solid union as compared to Nick and Honey, but what I took from the movie was that Albee was trying to convey the truth behind the public face of marriages. Nick and Honey in public give off the impression of perfection, but cocktails with George and Martha after 2 am unveiled the less attractive side of the marriages that appear so attractive in the public realm.\nWhat’s additionally nice about Gefter’s book is that unlike so many he didn’t spend too much time making a case for how Who’s Afraid of Virgina Woolf? “changed everything.” There are so many books about how various albums, movies, domestic and global events did just that. In Gefter’s case, rather than hitting the reader over the head with commentary on the bigger, world-changing meaning of the film (Who’s Afraid of Virgina Woolf? did $17 million in box office, meaning most Americans didn’t see it), he writes that the timing of the movie “was consistent with the wider cultural forces.” In other words, Who’s Afraid of Virgina Woolf? didn’t change the American outlook on marriage as much as it reflected those changing views.\nWho’s Afraid of Virgina Woolf? garnered 13 Oscar nominations, and could claim five wins. Taylor won Best Actress, Dennis Best Supporting Actress, and while Nichols and Burton were respectively nominated for Best Director and Actor, neither took home the statue. Still, what a comment on the acting abilities of both Taylor and Burton to play so far out of character, and by extension what a comment on the skills of Nichols. Quoting Burton again, as a director Nichols “conspires with you, rather than directs you.”\nPhilip Gefter writes so well, and puts together a great story about the making of a very well-regarded movie. At the same time, and as mentioned early on, he did so much more. He wrote a great meditation on people and marriage, all of it interspersed with interesting anecdotes that are crucial as a way to explain economics and the world around us. He writes toward book’s end that “romance is the halcyon child of marriage before the realities set in.” Yes! Call romance the public face of marriage too? Buy Gefter’s spectacular book to learn about the making of a film but do so confident that you’ll come away with so much more on your mind for a very long time."
    },
    {
      "url": "https://www.realclearmarkets.com/articles/2018/10/25/books_michael_ovitz_has_written_the_best_business_book_of_the_year_103452.html",
      "text": "Books: Michael Ovitz Has Written the Best Business Book of the Year\n“You’re there because you are in your industry what they are in theirs.” That’s what Judy Ovitz said to her husband Michael Ovitz in 1993. The most powerful man in Hollywood was at a David Rockefeller-hosted dinner in New York that included major players of the Akio Morita (Sony CEO), Henry Kissinger and James Wolfensohn (World Bank head) variety. Ovitz briefly stepped out in order to call his wife to ask if he belonged in such elite company, and Mrs. Ovitz’s response hit it on the head. In the late 20th century Ovitz was to film what Kissinger was to international diplomacy, and more realistically he was to the entertainment industry what Michael Jordan was to basketball.\nIn my case, I first learned about Ovitz sometime in the 1980s. I was in my teens and memory tells me that Ovitz and the talent agency he created with several former William Morris colleagues (Creative Artists Agency – CAA) was featured in the “Calendar” section of the then very thick and prosperous Sunday Los Angeles Times. As early as the ‘80s it was a known quantity that the aggressively low-profile, low talking Ovitz was the most important and most-feared man in Hollywood.\nAs someone who has long been fascinated by the movie industry, Ovitz fascinated me from the day I learned of his existence. And he still does. Having become a noun by the end of his rein atop CAA (Jerry Seinfeld joked that he “got the last Ovitz” when the superagent left agenting not long after negotiating a record television deal for the comedian), I’ve always wanted to know more about this famously private person. Ovitz has delivered with his unputdownable new memoir, Who Is Michael Ovitz? And while he’s clear in his book that “Mystique is ten times better than publicity,” Ovitz has finally shed some sunlight on the magic. I just wish the book had been three times longer.\nUp front, this review will presume that readers are already somewhat familiar with Ovitz and the industry he transformed. At the same time it’s worth noting that the author’s story will interest anyone, so good is it. Along those lines, Ovitz’s book will be many things to many people. For those merely interested in insider-y tidbits about Hollywood, there’s lots of information in what will now be referred to as “Who” that will hold their attention. About Robert Redford, Ovitz observes that he “seemed deeply embarrassed by acting” and “took his unhappiness out on the people around him.” Ovitz adds that Redford was “one of our most difficult clients.”\nTom Cruise? Ovitz the businessman made plain to Scientology head David Miscavige that ‘”We don’t want to see Tom’s name in the paper for anything but his career.”’ And CAA largely succeeded until the talent agency and Cruise’s publicist Pat Kingsley “were no longer in Tom’s life.” Ovitz et al plainly did a good job as evidenced by their ability to keep under wraps Cruise’s odd decision to “set up a Scientology booth to proselytize the cast and crew” on the set of the 2005 film War of the Worlds.\nSpeaking of Cruise, it turns out that Rain Man was a movie that no director seemingly wanted. Four walked away from the script, and when the film was finally released in 1988, it was with “very low expectations.” Rain Man ultimately grossed $400 million worldwide, and CAA clients including Cruise earned “many multiples of their salaries” through CAA-negotiated shares of gross profits. The latter, versus “net profits,” is on its own, an economic lesson. Readers can expect to hear more about it in future columns. Rain Man was an example of a common practice for television that CAA brought to movies: the packaging of clients for studios. CAA didn’t just find work for its clients; rather it found great material only to bring writers, directors and cast members to studios on the way to the making of films.\nAs for the legendary Lew Wasserman (head of MCA, and seemingly Ovitz before Ovitz), Ovitz would eventually learn that his “only weakness was gambling.” The latter looms large in consideration of Ovitz’s longtime former business partner, Ron Meyer. He and Meyer talked “thirty times a day” and largely built CAA together. Ovitz plainly loves Meyer despite modern strains placed on the friendship that are detailed in Who. That’s what’s so interesting about his seeming revelation of Meyer’s gambling problem from the CAA days; one that led to multi-million dollar losses for the agent. CAA and Ovitz helped Meyer out of at least two financial jams, but Ovitz alludes to how their friendship perhaps never fully recovered from CAA’s #1 in Ovitz (in title, and in percentage of firm ownership) essentially putting his best friend and CAA’s #2 on an allowance while he worked off his gambling debts.\nCrucial here for readers is that despite a split in their post CAA friendship that led to Meyer badmouthing Ovitz all over Hollywood, Ovitz can’t help but think the world of Meyer. By Ovitz’s own regular admission in Who, Meyer was his “agent” inside CAA and around Hollywood. As Ovitz puts it toward book’s end, “Money was important to me, but not as important as Ron’s friendship.” So while it would be interesting to hear Meyer’s side of the story, Ovitz indicates that he and Meyer (he’s now Vice Chairman at NBCUniversal) are on good terms. Better yet, Ovitz acknowledges throughout Who just how much he regrets not taking care of what had Meyer so frustrated.\nAfter that, I read Who as an economics writer. While Who belongs on any list of excellent business books, my reading is invariably focused on the economic lessons that can be learned from the business exploits of the prominent. Ovitz very much delivers in this regard. Like Phil Knight’s Shoe Dog, I’ll be quoting Who for a very long time. Ovitz probably didn’t know it as he wrote his memoir, but his business life instructs better than the economics books that academics cruelly foist on students.\nFor one, Ovitz’s grand achievements are a reminder to the redistributionists in our midst that wealth is never foreordained. Brilliant as Ovitz is, CAA’s evolution into the most important institution in entertainment was far from a sure thing. For one, the agency that Ovitz, Meyer and a few others left (William Morris) was intent on crushing CAA before it even got started. And while they didn’t succeed in squashing the nascent talent agency, the early days were lean: for office space they leased “in a lower-end building” at “the very edge of Beverly Hills.” For operating money, the founding partners “scraped together $100,000 by putting up our homes as collateral.”\nOnce in their “bargain-bin” building, Ovitz et al “brought in folding chairs and card tables for desks, and our wives each came in one day a week to answer the phones.” They had one paid assistant (a bookkeeper), and “two cars among the five of us.” For Ovitz himself, with CAA a start-up he wasn’t making much money early on. In that case, Judy Ovitz booked modeling jobs at Bullock’s (a long gone department store known to west coast readers), and worked in the lounge of a long lost airline, PSA. It was only after 2 ½ years during which CAA’s founding partners “netted nothing” that “each partner was able to take $80,000 out of our profits.”\nBut even with CAA on the path to success, Ovitz was still not comfortable. He recalls that “there wasn’t a day when I didn’t walk in the door and get hit by a rush of anxiety. What idea can I come up with today to pay the overhead?” We’re talking about someone who grew up on the wrong side of Muholland Drive in the unfashionable San Fernando Valley. Ovitz doesn’t hide that a driving ambition for the son of a liquor salesman was to get out of the Valley (literally and figuratively), and never look back.\nAll of this rates mention given the view on the left that the creators of great wealth must “pay their fair share” in taxes, and that they need to “give back” to seemingly atone for their success. Sorry, but Ovitz’s story is yet another reminder of how wrongheaded those beliefs are. Ovitz earned his wealth the hard way. It’s his. This is a liberty thing. That Ovitz knows how to allocate his wealth (he’s built a second career as an investor and advisor to Silicon Valley start-ups) exponentially better than those so unimaginative as to work in government just adds to your reviewer’s frustration that achievers like Ovitz are expected to hand so much over.\nAll of the above naturally leads to a question. As Ovitz is wrapping up Who, he updates readers on the doings of his three kids. He jokes about Eric Ovitz that “Somehow he came out Republican, despite my best efforts.” The quote had me wondering. Readers of this column are well aware of how critical it often times is of Republicans, but always because they depart from their small-government, low tax, non-interventionist rhetoric. Applied to Ovitz, I found myself wishing this most self-made of men would explain what about the Democrats rated and rates his good opinion. I say this as a registered Independent who thinks Republicans have mostly lost their way, and who thinks Donald Trump at times an insult to the GOP’s Reagan legacy. It’s a long way of saying that warts-and-all, Ovitz should be a Republican. While it’s a known quantity that Hollywood is near-monolithically Democrat, it says here that the Dems don’t deserve Ovitz?\nTo all this Ovitz might respond that government has a role when it comes to helping the have nots, but one wonders how well he could support such a belief. In a very strong sense his brilliant career rejects the view of government as fixer. To understand why, consider how he describes in the book’s prologue how very dedicated he was to his clients at CAA:\n“Our tenuous capital was the hours in the day, less the few we slept, and we spent that capital at a frenzied pace. I’d drop everything to get you the right cardiac surgeon, the right car, a place for your kid at John Thomas Dye or Harvard-Westlake schools – whatever you needed. I was everyone’s chief psychiatrist, legal adviser, financial adviser, fixer, cultural translator, and shoulder to cry on. With so many clients’ very lives seemingly our responsibility, I obsessed about what might go wrong for them – and for the agency.”\nReaders might stop and think about the above, and then ask themselves if they’ve ever experienced anything close to that kind of service in their dealings with government at any level. Goodness, even getting a passport or something as basic as stamps can be a lengthy ordeal. As for the idea that Ovitz was serving the elite of the elite, readers need only ask whether America’s non-elite get better care from the DMV and FEMA, or from Walmart and Waffle House.\nIn a sense it’s a relief that Ovitz didn’t get all political in a book about his career, but his comment about son Eric’s switch to the Republican Party stuck with this reader. Bad as the Republicans have become in modern times (in my estimation George W. Bush is the worst president of my lifetime, and no one else comes close), Ovitz’s life and career is a loud rejection of the Democratic Party’s rhetorical assertions about the U.S. no longer being the land of opportunity, that the rich need to pay “their fair share,” and that government is necessary to aid the have-nots. I’ll take Ovitz allocating his millions over the feds any day of the week, and history supports my assertion.\nHappily, Ovitz’s business experiences don’t just reject certain Democratic talking points. They also call into question a view that’s increasingly popular on both sides about long-term wage stagnation in the United States. What a laugh. If what’s accepted as real were true, then it would also be true that the world’s tired and hungry wouldn’t be regularly risking their lives to get to the United States. On their own, the actions of immigrants loudly mock the idea that the American worker is stuck in place. So does the story of CAA.\nOvitz writes that at CAA they paid their agents “well-above-market rates” to “ensure they didn’t leave.” Crucial here is that they similarly paid people around town well-above-market rates. Restaurant maître d’s could expect major tips at year end from CAA because the agency wanted to be sure that those who aided their agenting of clients similarly “didn’t leave” them.\nOvitz is a UCLA grad, and he worked hard to raise money for the school and its prestigious hospital more specifically “because it proved extremely useful for CAA to be able to get our clients or potential clients the best medical care with one call.” For its clients CAA maintained a “famous gifts office” on “the uncontroversial theory that people love free stuff.” Free stuff included Ovitz signing over the title of a Ferrari he owned to Sylvester Stallone. As Ovitz puts it, “If someone needed a personal trainer or a dog groomer or an impossible dinner reservation, our assistants were on the phone until it got done. Multiply that process by a thousand, and you get a reputation for taking care of everything.”\nAll of this rates mention in terms of wages for what it says about how business is done in the United States. So that CAA could overpay its agents, the same CAA overpaid its clients. Important here is that while CAA was the McKinsey of Hollywood, the U.S. is pregnant with businesses that are the best in the world at what they do. Implicit in the wage stagnation theory that’s taken hold is that the nation which houses the biggest, most valuable, and most service-oriented companies in the world is populated by companies that routinely underpay the very individuals who make those companies great. The very notion is absurd. CAA is but the latest example of a business that became great by overpaying its employees. And Michael Ovitz surely wasn’t alone in understanding that the most expensive employees are the ones who feel they’re undervalued by virtue of being underpaid. Stated simply, the wage stagnation narrative is exposed as ludicrous by the brilliance of U.S. businesses.\nRegarding modern fear of China, Trump-loving Republicans and Bernie Sanders-loving Democrats would be wise to read Ovitz’s memoir. While he’s still an investment force today, Ovitz days as a Hollywood giant were in the two decades that ended the 20th century. This is important simply because Ovitz gradually evolved from being an agent to an advertising guru, corporation whisperer, and global M&A specialist with specific expertise in Japan. This is worth discussing because the global businessman in Ovitz understands from history that the wasted hysteria over China in the present is a repeat of what he heard in the ‘80s and ‘90s about Japan. Same fears, different country.\nAs the Trump administration shamefully talks of policing Chinese investment in U.S. businesses, back in the ‘80s and ‘90s those same wrongheaded fears were expressed about Japanese investment stateside. But as Ovitz puts it about the Japanese, “They weren’t pillaging – they were financing.” Absolutely! Seemingly forgotten by the emotional puddles who populate the political class is that liquidity and the need for liquidity is a nightly worry for all but the bluest of blue-chip of businesses. Applied to American businesses, a dollar is a dollar is a dollar. When protectionists strive to keep dollars out of American hands with “national security” in mind, they don’t just compromise American safety thanks to a lack of investment rendering future invasion of the shooting kind quite a bit less expensive. Figure that Chinese investment means much more than crucial liquidity: it means know-how, and it means crucial knowledge about how U.S. businesses can crack what is and will be a massive market for them. With China, it’s once again same fears, different country. If Ovitz is a Democrat in response to the GOP’s modern embrace of protectionism, maybe I’m with him….\nAnd then there’s the question of intellectual property. Here it would be so interesting to ask Ovitz endless questions about his comment that “A movie idea” has “no intrinsic worth.” The author continues with a crucial point: “Give the same concept to ten different directors and you’ll get ten different films.” Brilliant. And I say a refutation of all the handwringing about Chinese “theft” of “American” intellectual property. Really? What would they steal? They could rummage for days through Steven Spielberg’s files, they could plant countless spies on one of his movie sets, but they could never come anywhere close to making a Steven Spielberg Film. And since they could never emulate Spielberg, why are Americans so fearful of them mimicking Jeff Bezos and Apple’s Jonny Ive? When we make a lot of noise about so-called Chinese IP theft, we thoroughly insult those “stolen” from. Ovitz notes how his M&A client Matsushita from the CAA days “was nicknamed maneshita, or ‘copycat’,” and that’s a useful point about China: its businesses are in the mimic phase right now, but eventually they’ll be in the innovation phase. When they are Americans will benefit in astounding fashion much as the rest of the world has benefited from American innovators like Amazon, Apple and Microsoft.\nIt’s also worth mentioning that for others, Ovitz’s remarkable book will serve as a guide to doing businesses; perhaps a modern Art of War. Ovitz is ultimately a student of the human condition, and his innate understanding of people made him a great agent, advertiser, M&A specialist, and now investor. He gets things. He sees things. Ovitz plays to the desire of people to better themselves, and always let potential clients know that he would make their \"dream project happen,” or he would ask “So what are your dreams?” Goldman Sachs has long taught “underpromise, overdeliver” but with Ovitz it’s overpromise and still overdeliver. As for “power,” it’s “only power until you exert it.” Perception is what matters. Ovitz always taught his employees to reach for the power club “every day, but to never – almost never – pick it up.” Ovitz was the club.\nFor those in sales, arguably the most crucial lesson within Who is for individuals to “Never count on anything.” When he and his partners left William Morris to start CAA, they left with what they assumed were a few “sure thing” clients who would sign with them right away. Except that they didn’t. Interesting about people who didn’t show up for work at CAA is that the always working Ovitz would call them “out of concern,” but more interesting from a management perspective is that “I also wanted them to know I was keeping a watchful eye.”\nAn odd thing about Who is that it seemingly had errors. This is surprising in consideration of just how detail-oriented Ovitz was and is. In that case it was puzzling in the pictures section of the book to see Jay Moloney’s (Ovitz’s talented CAA protégé who sadly crashed and burned) name spelled Jay Maloney. Son Eric’s wife is named Kendall, but in the picture of them at their wedding Kendall is spelled once with two ls, and once with one. When daughter Kimberly Ovitz was asked a CAA-related question by a security guard at her NYU dorm, the years were off when it’s remembered that Kimberly was born in 1983, but Ovitz left CAA in 1995. When Ari Emanuel left CAA for InterTalent, Ovitz recalls that Ron Meyer “fired Tom Strickland because Tom had known about the impending defection and hadn’t told us, and because he assumed Tom was going to InterTalent anyway (which he then did.)\" Isn’t the name Tom Strickler?\nAs for quibbles, it’s a guess that the editor asked Ovitz to insert some last minute stuff about sexual harassment in Hollywood that read as though it was inserted. And then in certain introspective parts of the book, Ovitz references how in retrospect he wishes he’d been an architect, or done charitable work of the Red Cross variety. This didn’t read as real. Someone as ambitious as Ovitz would have always felt stifled in the world of non-profit. Without knowing him, it’s a safe bet that Ovitz had to be great and that he had to be high-profile in a high-profile industry by virtue of being low profile. Having grown up in the Valley, Ovitz had something to prove and wanted his success to be known. His inaccessibility and his mystery would be his high profile. Ovitz got it better than most about how to be famous via mystery. He needn’t be sheepish about what he achieved, but there’s a sense in Who that he’s apologizing for something. He needn’t. While great people sometimes step on toes and often have enemies, they make the world go ‘round.\nLooking ahead, my hope is that Ovitz tours with the book and that he makes himself available for interviews. Engrossing and great as Who is, I wanted so much more. The questions for the author are endless, including whether there can ever be someone like him in Hollywood again. Ovitz seems to indicate no not out of ego, but because there are so many small screens showing so many different shows to so many more segmented audiences. The internet has robbed Hollywood of its essential mystery, and as a result it’s not just the screens that are shrinking. Power has been redistributed by technology? Or so it seems. Again, so many questions. For now, I’ll just simply say that Who Is Michael Ovitz? is the best business book of the year for it teaching readers about so much more than business."
    },
    {
      "url": "https://www.realclearmarkets.com/articles/2023/12/07/book_review_martin_peretzs_excellent_the_controversialist_997283.html",
      "text": "MSNBC is difficult to watch these days, but so is Fox News. The warring ideologies are so comfortable in their alarmism, and their certitude about being the noble, much put-upon victims of the other side, that it’s painful to tune into either channel. Probably in a binary situation bereft of books, newspapers and magazines Fox would get the nod from yours truly, but only because some of the hosts on Fox are legitimately funny.\nThe execrable nature of the two cable networks came to mind while reading former publisher and owner of The New Republic Martin Peretz’s new, and thoroughly unputdownable new memoir, The Controversialist: Arguments With Everyone, Left Right and Center. Describing Fox and MSNBC early on, he laments that the “warring parties cannot even refer to a shared reality.” He puts it so well. I lean Fox (for several years I was a cast member on the late, great Forbes on Fox), but can’t presently watch the channel without rolling my eyes every few seconds.\nPeretz seemingly does the same when watching MSNBC, or name your left-leaning news show. As he acknowledged toward book’s end, “I’d grown up on the left, and now I had lost the left.” The surest sign of Peretz’s separation from the left he helped shape at The New Republic (TNR from now on), is that when he wrote an opinion piece in 2013 criticizing the drift of TNR from center-left after its sale to “new money technocrats” (think Chris Hughes, an early Facebook employee), it was published on the Wall Street Journal’s editorial page, surely the Holy Grail of right-leaning opinion. Peretz’s pro individual freedom, anti-communist, and hawkish views certainly made him more of a fit at the Journal by the 2000s than most any publication on the left. In the left’s defense, it should be said that publications and shows from both sides increasingly feed their flocks. More on this later in the review.\nFor now, it will be reiterated that Peretz’s memoir is just great. As a small l libertarian, my strong sense is that he and I would agree on a lot, but disagree on a lot too. Peretz’s insights into people, historical events, and the world around us are so interesting. About the title of the memoir, Peretz describes a controversialist as “someone determined to stir the pot.” That he surely does, and he always has to his everlasting credit.\nIndeed, while TNR has long had a reputation as left-leaning relative to National Review’s right-leaning magazine, it’s easily forgotten that TNR was the longtime home of numerous conservative heroes including Fred Barnes, Glenn Loury, Morton Kondracke, and Charles Krauthhammer. Andrew Sullivan was at one time the magazine’s editor. Peretz is the embodiment of “stir the pot,” and to read about the thinkers he cultivated from both sides is to hope that there will be more like him (Peretz is 84) on the way. For now, there’s a lot of preaching to the choir by the dominant ideologies.\nPeretz is the son of Jewish immigrants from Poland. The story of Peretz’s father in particular is a reminder of why we erect barriers to the immigrants stateside at our peril. Peretz’s father was the owner of a pocketbook factory, an apartment landlord, plus he was a “zealous anti-communist.” He was a patriot who would say with pride that “I’m going to die in America.” His father’s background clearly informs Peretz’s own unwillingness to fully embrace some of the hard left’s most common absurdities. For instance, when activists from Peretz’s 1960s world gathered on his porch in Cambridge to sing “anti-Semitic songs about Jewish landlords overcharging and evicting black tenants in Harlem,” Peretz “threw them off the porch.” Having witnessed his father at work, Peretz knew he “wasn’t a bad guy as a landlord and always gave errant tenants, white or black, another week or month.”\nAt the same time, Peretz’s relationship with his father was troubled. This is noted in the review just because it fascinates me. As Peretz explains it, his father “was angry all the time. The atmosphere he created in our home was a frightening one.” Frightening fathers are so common to Peretz’s era, and so rare nowadays. The Great Santini (released in 1979) is a popular movie with people in Peretz’s age range mainly because so many can relate. It’s still a good movie in 2023, but the bet here is that most twenty or thirtysomethings of the moment wouldn’t get “Bull” Meechum. As for the babies being born today, no chance. The question posed here is why? Why have fathers changed so much? My own speculation is that thoroughly ridiculous numbers like GDP, the “trade deficit,” unemployment and other full-employment notions created for economists don’t come close to explaining just how abundant modern life is, particularly in America. It’s not just that we’re exponentially richer, but we’re also exponentially more fulfilled as wondrous automation frees us from the work we formerly had to do, in favor of work we can’t not do.\nThink Peretz himself. His life has been one defined by ideas. He’s a controversialist. He’s made a good, and realistically great living stirring the pot. His father once again owned a pocketbook factory, and pried rent from tenants who likely dreaded the sight of him. Sorry, but life is better. Much better. And because it’s much better, we’re all much happier.\nConsider also the world that Peretz was born into. He arrived in 1938, which means he came into the world 23 years after the Armenian genocide, twenty years after the needless tragedy that was World War I, followed by the Great Depression, Hitler, World War II, the nuclear bomb, socialism in England, the Soviet Union’s wrapping of substantial parts of Europe in communism, etc. etc. Please think about what it was like to be a parent then, relative to the present. Think of it in terms of the 2016 election when MSNBC watchers nodded along to predictions that the U.S. would collapse under Donald Trump, the nodding similar to that done by Fox watchers when it was speculated that Hillary Clinton might win.\nIt’s a long way of saying our problems at present are so microscopic relative to what the world was like when Peretz was born. No wonder his father was so angry? The world was truly on fire. Its greatest countries twice tried to commit suicide. It was hard not to think about this later in the book when Peretz wrote about Al Gore’s pivot from near-president to global warming activist. Peretz, likely out of respect for Gore, merely acknowledges that fear of a warming planet didn’t register as much with him as it did for Gore. The bet here is that in private Peretz might be more expansive with his skepticism? Again, consider the world he came up in. Yet now the alarmists on the left worry endlessly about a warming planet? And the alarmists on the right think our demise will be a consequence of parents choosing to not procreate as much? Oh wow, we must be prosperous and free of real worries to fear such irrelevancies! That’s what I want to imagine Peretz secretly thinks. Left and right today have no idea how good they have it, and how small are their crises. More on Gore later.\nFor now, it should be added that Peretz’s book is so vivid. Brutally so at times, uplifting at others. One anecdote comes from Peretz’s early life that arguably helps inform his father’s difficult countenance. Though they were in America, danger was so close, including for family members. Peretz’s family is once again from Poland, there were many relatives there when Hitler did what he so tragically did. One of Peretz’s cousins “spent the first four years of his life hiding from the Nazis behind a barn door. He didn’t talk much. In 1950, when we were both eleven, he threw himself from the fifth-floor fire escape.” On a happier note, “Another relative, Charlie, a big, strong, handsome guy, went back to Germany in 1946 or maybe 1947, found out the identities of some ex-Nazi soldiers who had been in a unit that had occupied Levertov [where relatives were in Poland], and killed three of them. Then he came back to America, where he proudly told everyone what he had done.” What a different world it was nearly 80 years ago, and the view here is that the horrors of what came before thoroughly discredit much of the alarmism embraced by the warring ideologies of today. We’re so lucky, while the alarmists are both lucky and spoiled.\nFor high school, Peretz attended public school, specifically the highly-regarded Bronx High School of Science. He observes that something like 80 percent of the students at New York City’s elite public schools at the time were Jewish. This rates mention as a reminder to conservatives that the biggest driver of a good school isn’t whether it’s public or private, but who attends the school. Where there are conscientious kids frequently raised by parents with high expectations, there are good schools. Always. Conservatives are convinced that “school choice” will “break the government school monopoly” and solve the problem of failing public schools. On its face this sounds wise as competition lifts all boats. Except that a lack of competition isn’t the problem. What ails schools is students who aren’t interested, and who don’t show up to learn, not the fact that they’re public or private.\nNotable here is that Peretz attended Brandeis University after Bronx High School of Science. As he describes it, Brandeis “was fulfilling a specific function: it was assimilating mostly Left-American Jewish thinkers and smart American Jewish kids who might be accepted to the University of Chicago, but not to the Ivy Leagues.” Where it gets interesting is that he adds “Once we were accepted everywhere, Brandeis wasn’t needed and began to fade.” The latter arguably explains the decline of public schools in New York City. Far Rockaway High used to educate Nobel Laureates, and no doubt Peretz is aware of how City University of New York formerly educated all manner of great Jewish thinkers who were featured in a 1998 documentary, Arguing the World. Did the quality of education at Far Rockaway and City University of New York decline, or did both “fade” once Jewish students no longer needed them?\nAbout the deep intellectuals that Peretz ran around with post-college, most were Jewish. This rates mention mainly because by Peretz’s own admission, the crowd was dense with socialists and communists. As notable thinker Herbert Marcuse put it to Peretz, “Not for nothing were we called the Office of Stalin’s Servants.” Marcuse was referring to the OSS where he once worked, which is now known as the CIA. Marcuse relayed to Peretz that while at the OSS, his friends (in the words of Peretz) “were Marxists,” that while they “might not all have passed information along to the Soviets,” their “hearts were with Stalin.” Memory says that Carl Bernstein confirmed much the same about his own parents, who were similarly in government, and who apparently told him that Sen. Joe McCarthy was right about the deep penetration of communists within the federal government.\nReaders can conclude what they want from the density of communists in government from the Cold War era, but in the eyes of the rabid anti-communist that was and is Peretz, “None of these people were thinking real revolution. Communism in America was a fantasy; anybody with any sense of reality knew it.” This is of crucial importance. Perhaps it can be said that communism was a pose, a style. Evidence supporting the previous claim can be found in Peretz’s description of Max Palevsky, “a pioneer in computer science who sold his company to Xerox in 1969 for $920 million.” About Palevsky, Peretz writes that “Max wanted to be thought of as a man on the Left – that was what sophisticated people did.” Again, there was a posing quality to the left lean, and arguably there still is.\nThis isn’t meant to excuse the murderous ideology that was and is communism, but it is meant to calm the modern communist alarmists on the right who fear TikTok and other social media are polluting American thought. Try to be serious. Americans love life’s comforts way too much to seriously entertain collectivism, as do the Chinese. A visit to China for those who haven’t been would confirm this truth. The Chinese people are conducting a passionate love affair with all things American. If the CCP can’t convince its own people of how bad the U.S. is, good luck convincing the American people to seriously embrace what is fantasy.\nEventually Peretz made his way to Harvard, where he worked for fifty years as an assistant professor. As he describes it, his arrival at Harvard was “a social leap into the domain of ruling Protestant America.” Yes! For Harvard to remain great, it could no longer be exclusionary, either to students or professors. This is one of many reasons I so very much loathed the Supreme Court’s decision “banning” affirmative action on U.S. college campuses. There was no need to. Schools should be free to choose their students as they wish, professors, and you name it. Let the markets solve this. While Harvard was formerly very Protestant as Peretz alludes, now it’s not. Those formerly discriminated against are now being discriminated against based on over-representation. How things change. The point here is that Harvard should once again be free to choose its students, and at the same time be free to not choose academically qualified individuals who will undoubtedly thrive elsewhere, and who might eventually earn billions. In other words, Harvard should be free to err or not err in favor of races, children of privilege, athletes, or name your group. How libertarians and conservatives could support the Supreme Court essentially writing Harvard’s admission policies will forever remain a mystery. Why not allow markets to work? They did in the case of Peretz, and many other non-Protestants like him.\nThat Peretz reached Harvard and thrived there also bears mention considering the times we’re in. Peretz’s book was of course published before the October 7, 2023 tragedy in Israel whereby animalistic members of Hamas ruthlessly murdered over 1,000 Israelis. Subsequent to the tragedy, much ink was spilled about growing antisemitism on U.S. campuses, of how “this time is different” as Jewish students increasingly feel isolated, hated, etc. My own reply was that the commentary didn’t nor does it ring true. The bet here is that Peretz would agree that antisemitism was much worse in the past relative today, so much so that he would disdain the very question. This isn’t to excuse instances of it on campus, and it’s certainly not to excuse what happened in Israel, but it is to say that the presumption of rampant antisemitism on elite college campuses imagines schools with a high percentage of Jewish students (it’s estimated that Harvard’s student body is over 30% Jewish) who actively politic and rant against themselves. With left and right there’s always a crisis of some kind.\nOne of the most interesting aspects of Peretz’s book are the various comments about famous people and families. About the Kennedys, Peretz recalls that the powers-that-be within the family “filled their inner circle with opportunists and imitators” who “never comprehended that the world, the real world, was a different place than they hoped it would be.” One individual close to the Kennedys (and subsequently LBJ), Richard Goodwin, “always looked like he was thinking about what he was going to say next when he wasn’t talking.”\nRegarding George McGovern, long lionized by members of the left, Peretz writes that he “would have been a disaster for the country – maybe for the world.” Is Peretz right? That’s what makes the book so interesting. As a libertarian, Peretz is much more hawkish than me or my crowd, yet most would consider me and my crowd “hard right” versus Peretz’s center left. Interesting here is that Peretz writes of how the “only responsible people” on the matter of the Soviet nuclear threat “were the Reaganites.” It’s interesting mainly because I lunch nearly every week with Cato Institute co-founder Ed Crane (what I’d give to see Peretz and Crane converse!), and it was Crane who, upon returning from a visit to the Soviet Union in 1981 (with Charles Koch, no less), subsequently wrote a spectacular essay (“Fear and Loathing In the Soviet Union”) in which he concluded that members of the left were thoroughly mindless for imagining that the Soviets had an economy, but that members of the right were similarly mindless for imagining that a wrecked, odiferous country populated with hunched over, miserable people represented any kind of threat to the U.S. It’s a long way of saying that what had Peretz fearful about McGovern (foreign policy issues) would not have worried Crane. Ideally this helps explain why so many libertarians are so offended when they’re referred to as conservatives. Not remotely.\nAbout gay marriage, Peretz is rightly proud that TNR ran a cover-story supporting gay marriage in 1985, but then Crane and other libertarians like Charles Koch always supported individual choice on the matter of gay marriage, they were always skeptical about foreign policy adventurism, and they’ve long supported drug legalization. It’s important to mention all this because books like Wildland (my review here), by frequently wise members of the left like Evan Osnos, portray libertarians as they’re decidedly not. In reality, we’re the liberals. Big time.\nQuoting Peretz writing about the thinking of TNR legend Leon Wieseltier, “Liberals were supposed to care about individuals and freedom.” Yes, they should. That’s what true libertarians think and care about. We’re not anti-government because small government “increases GDP” or name your idiotic measure relied on by witless economists, rather we’re for limited government because we’re for freedom. We would be for limited government even if it could be proved that big government directly associates with prosperity. It doesn’t, but that’s how deep our belief in freedom is.\nPeretz cites with lament Hillary Clinton’s admonition to conservative Democrat Jim Cooper in the early days of the Bill Clinton administration that “We’ll crush you” for not siding with the administration on Hillary-care, and there lies another libertarian problem with government. The force involved. Peretz also notes that the Clinton DOJ found “nothing constitutionally problematic” with the Defense of Marriage Act, yet it’s the “libertarians” in books like Wildland who are the rigid ones? Rest assured that libertarians never saw anything remotely constitutional about federal limits on choice of any kind, and certainly not government control over whom one marries. Peretz ultimately concluded about the Clintons and their administration that it was defined by “the new American elite, the types of students I’d been so hopeful about when they came to Harvard twenty-five years earlier.”\nThe most appealing part of Peretz’s book is his discussion of Charles Murray, and his and Andrew Sullivan’s decision (in the face of major protest within the magazine, and outside of it by readers and partisans) to run an excerpt of Murray and Richard Herrnstein’s controversial 1994 book, The Bell Curve. Peretz refused to cave to the critics. While Peretz was “happy to publish dissents,” he was not willing “to cater to people’s axiomatic feelings. When you do that, you’re giving up belief in your readers’ power of reason.” Amen. Many times over. Considering this through the prism of Fox News most notably, Rupert Murdoch and conservatives more broadly were surely correct that “major media” slanted left, at which point Fox News filled a major market need. But now it, MSNBC and other media have seemingly gone overboard in their desire to cater to “axiomatic feelings.” And it’s not just the cable networks.\nThink conservative or right leaning media too. And think of it with TikTok top of mind. For the longest time conservatives have said (with good reason) that government can’t do business, that when government inserts itself into business matters, it weakens the business, etc. Yet conservatives are convinced that TikTok is controlled by the Chinese Communist Party (CCP), and that the CCP is using it to shape the thinking of Americans. Can conservatives be serious? If the CCP controlled TikTok, we would never have heard of it, and it certainly wouldn’t have 150 million American users. Notable here is that the views just expressed don’t find their way into conservative media, including the editorial page on which Peretz expressed frustration about the drift of TNR in 2013. This isn’t good. People need their most deeply held views challenged. Sadly, they don’t want them challenged (anecdotally my most complete book, They’re Both Wrong, sold the fewest copies by far!), which explains why Peretz’s willingness to challenge his readers with Murray’s viewpoint was so appealing.\nA major reason your reviewer launched the Parkview Institute was to act as a “controversialist” on the right, to challenge increasingly hardened views on the right about China, TikTok, immigration, energy autarky, educational vouchers, monetary policy, and yes, the hawkishness that Peretz shares with some strains of the modern right. There’s not enough of this right now. Members of the right complain about censorship, but in a sense they’ve become the censor at times as evidenced by the growing difficulty of publishing or stating opposing views within conservative media.\nAll of which brings us to Iraq. To Peretz and TNR’s credit, they admitted they were incorrect about the invasion and attempts to democratize the country as early as 2004. It was then that TNR ran a cover story “We Were Wrong.” It’s only in 2023 that a few on the right are finally admitting same. As Peretz put it in a paraphrase of the late Donald Rumsfeld, he wasn’t aware of how much he didn’t see, “and how much I didn’t know I didn’t see.” About Peretz’s admission, there will be no longwinded foreign policy discussion here. My subject of interest is economics.\nAt the same time, it’s so interesting to witness the certitude at the moment on the right about how wrongheaded the “isolationists” are about the U.S.’s substantial involvement in Ukraine, our presumed involvement in Taiwan at some point, and in the ongoing chaos that defines the Middle East. To admit one’s skepticism about the ability of the U.S. defense establishment to get all three or even one correct is to invite major criticism from members of the right. Unknown is why. Conservatives make sport of governmental incompetence domestically, but somehow imagine it acquires competence outside our borders?\nMore on the Middle East and Israel, Peretz was lightly “canceled” in 2010 for observing in a blog post that “frankly, Muslim life is cheap, most notably to Muslims…” Ok, but as evidenced by October 7th, and the wanton murder of Israelis by Hamas members fully aware of the muscular response that would follow, life certainly is cheap to all too many Muslims. It’s discussed here given the view among some libertarians that Israel is unquestionably superior to its neighbors not just in a civilization sense, but also a military sense. “Victory” over Hamas is assured, but what’s victory in a part of the world where life is treated so cheaply? Is it worth wasting more Israeli lives on people who view victory as drawing blood without regard to the subsequent cost? Peretz’s memoir isn’t libertarian despite his clear libertarian lean in some areas, but it’s hard to read it without wishing that the libertarian view would finally get its chance on the world stage. From the U.S. preferably…\nDid Peretz’s excellent book have weaknesses? Yes, though not all were the fault of the author in Peretz. The reality is that as the economics of publishing worsen, so does the editing. There were word errors (p. 119), and weird pivots. On page 248 Peretz begins a paragraph about JFK Jr.’s George magazine folding two years after his death, then he switches to the “crop of stars” at TNR, then in the next paragraph he pivots to Norman Mailer. It was hard to figure.\nAbout Al Gore, he and Peretz were and seemingly are very close. What I’ll write here isn’t a critique as much as a comment or question: what happened to Gore? Looking back to 1988 when he first ran for president, at the time he seemed cool, good looking, but most of all normal. While I reject Peretz’s view that Earth In the Balance was “important” (oh wow, what a silly book), that’s almost not the point. My point is that by the time Gore ran against George W. Bush in 2000, he was downright strange. It wasn’t just the kiss at the Democratic convention, it was Gore walking up close to Bush during one of their debates. If he’d been at all normal, Gore would have won. But he wasn’t. The kiss, the close talking, the “everyman” dancing at the Sydney Olympics, the “Kennedy-esque” touch football game at the Veep’s mansion as votes were still being counted in the contested 2000 election. Did something happen to Gore? I say this as someone who has written more than once that Bush #43 was the worst president in my lifetime, and no one else comes close. Peretz is critical of so many in his book, and in particular about their demeanor. John Kerry gets hit very hard. Yet Gore comes off so well. Why?\nPeretz claims the Republicans didn’t care about AIDS. That’s not fair. Hollywood’s lean is pretty left, but gay actors like Tony Perkins went to great lengths to hide his AIDS diagnosis for fear that he would never work again.\nWhich leads to Peretz’s personal life: the book plainly wasn’t meant to be about his sexuality, but it’s hard to divine if Peretz wrote the book under the assumption that readers already knew he was either gay or bisexual, or if he wasn’t sure how to introduce the latter. About his longtime wife Anne Labouisse, whom he divorced in 2009, it’s written that she descends from remarkable wealth (Singer Sewing Machine Company, blocks of Manhattan real estate) and lineage (Henry Richardson Labouisse Jr.), but it’s not clear why in later years Peretz no longer had the money to keep TNR afloat as he once had. It seemed her money became their money as is so often the case in marriage, but there was less clarity later on as the finances of TNR became more fraught. Did her money run out, or did the relationship change? At one point Peretz recalls an inability to recall whom he voted for between Bush and Kerry in 2004, and a similar inability to remember when he stopped teaching at Harvard. Neither rang true?\nRegardless, the quibbles are small. What a great read The Controversialist was, and will be for readers. 4/5ths through Peretz writes that “the worst sin in the world is coercion.” So true. Freedom is the point. If libertarians and left liberals could agree on this, ideally they could gradually agree on policy more broadly. Peretz has and continues to have arguments with left, right and center presumably with a desire to bring the warring ideologies together. Hopefully more join him in this noble quest after reading his excellent memoir."
    }
  ],
  "argos_summary": "The review examines Ed Zwick’s memoir \"Hits, Flops, and Other Illusions,\" noting how the shift to segmented audiences and digital platforms is eroding the traditional Hollywood narrative and the relevance of memoirs. It highlights Zwick’s career trajectory—from early days in Hollywood to his current role in Silicon Valley—and his reflections on the changing nature of film production, talent management, and industry economics. The piece also touches on broader cultural and political themes, such as the rise of niche content, the decline of mainstream studio dominance, and the impact of technology on creative industries. Overall, the review frames Zwick’s story as a lens on the transformation of entertainment and its implications for future media consumption and business models.",
  "argos_id": "3RHWOI8M4"
}