{
  "url": "https://finance.yahoo.com/news/russian-pipeline-boost-gas-exports-105323714.html",
  "authorsByline": "DPA",
  "articleId": "89f91f1e93d74e758dc56e5ff7f86ca3",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/dpa_international_526/33da7ce6f41ccc037c2007c7f8e71988",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:53:23+00:00",
  "addDate": "2025-09-02T11:48:14.855769+00:00",
  "refreshDate": "2025-09-02T11:48:14.855772+00:00",
  "score": 1.0,
  "title": "New Russian pipeline to boost gas exports to China",
  "description": "Russia and China have signed a legally binding memorandum for the construction of a new gas pipeline through Mongolia to China, Gazprom chief Alexei Miller announced in Beijing on Tuesday, according to Russian news agencies. The price of gas supplied via the Power of Siberia 2 pipeline would be lower than for Europe, Miller noted, pointing to reduced transport costs.",
  "content": "Russia and China have signed a legally binding memorandum for the construction of a new gas pipeline through Mongolia to China, Gazprom chief Alexei Miller announced in Beijing on Tuesday, according to Russian news agencies.\n\nThe price of gas supplied via the Power of Siberia 2 pipeline would be lower than for Europe, Miller noted, pointing to reduced transport costs.\n\nGazprom and the China National Petroleum Corporation also signed documents to boost gas deliveries through the existing Power of Siberia pipeline from 38 billion cubic metres per year to 44 billion cubic metres, according to the reports.\n\nThe 6,700-kilometre-long Power of Siberia 2 pipeline, including 2,700 kilometres on Russian soil, is due to have a capacity of 50 billion cubic metres per year. The contract is set for 30 years, according to the Russian reports.\n\nMiller described the pipeline as the \"largest, most extensive and capital-intensive gas project worldwide,\" without giving details on the costs.\n\nEstimates suggest it will cost tens of billions of dollars.\n\nThe announcement follows a meeting of Russian President Vladimir Putin with his Chinese counterpart Xi Jinping and Mongolian President Ukhnaagiin Khürelsükh in Beijing.\n\nThe timeline for the construction of the new pipeline remains unclear. Negotiations on the Power of Siberia 2 pipeline have been ongoing for five years, with Moscow and Beijing unable to agree on the price.\n\nHaving largely lost the European oil and gas market following Russia's full-scale invasion of Ukraine, Moscow has been pressured by China to offer hefty discounts, with media reporting that Beijing wanted to pay domestic Russian gas prices.\n\nHowever, according to the Wall Street Journal, the recent conflict between Israel and Iran, including US attacks on Iran, has reignited Chinese interest in the project, due to concerns about supply security from the Middle East.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New Russian pipeline",
      "weight": 0.11964751
    },
    {
      "name": "domestic Russian gas prices",
      "weight": 0.112449124
    },
    {
      "name": "gas deliveries",
      "weight": 0.09276588
    },
    {
      "name": "Russian President Vladimir Putin",
      "weight": 0.09250533
    },
    {
      "name": "gas exports",
      "weight": 0.09078883
    },
    {
      "name": "gas",
      "weight": 0.09054909
    },
    {
      "name": "Russian soil",
      "weight": 0.08618809
    },
    {
      "name": "Russian news agencies",
      "weight": 0.08577955
    },
    {
      "name": "Russian",
      "weight": 0.082301915
    },
    {
      "name": "Gazprom chief Alexei Miller",
      "weight": 0.07494168
    }
  ],
  "topics": [
    {
      "name": "Energy Sector"
    },
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.8662109375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.74365234375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.6845703125
    },
    {
      "name": "/News/World News",
      "score": 0.6630859375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.61376953125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.52490234375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.339599609375
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.335693359375
    }
  ],
  "sentiment": {
    "positive": 0.2629924,
    "negative": 0.34254646,
    "neutral": 0.39446115
  },
  "summary": "Russia and China have signed a legally binding memorandum for the construction of a new gas pipeline through Mongolia to China, with Gazprom chief Alexei Miller stating that the price of gas supplied via the Power of Siberia 2 pipeline would be lower than for Europe due to reduced transport costs. The 6,700-kilometre-long pipeline is expected to have a capacity of 50 billion cubic metres per year and is set to be operational for 30 years. The cost of the new pipeline is unknown, with estimates suggesting it will cost tens of billions of dollars. The announcement follows a meeting between Russian President Vladimir Putin and Chinese counterpart Xi Jinping.",
  "shortSummary": "Russia and China signed a memorandum to expand their gas supplies via the Power of Siberia 2 pipeline, with reduced transport costs and ongoing negotiations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e2f792b91dba4ad9bedc580908a07898",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Russia and China have signed a legally binding memorandum to build the 6,700‑km Power of Siberia 2 pipeline through Mongolia, with a 30‑year contract and a capacity of 50 billion cubic metres per year. The new line will deliver gas to China at lower transport costs than the existing Power of Siberia route, which will see deliveries rise from 38 billion to 44 billion cubic metres annually. The project, described by Gazprom as the world’s largest gas pipeline, is expected to cost tens of billions of dollars, but construction timelines remain unclear. The deal follows heightened Chinese interest amid Middle East supply concerns and Russia’s need to diversify after losing European gas markets.",
  "argos_id": "3SHOQHFS4"
}