{
  "url": "https://www.nytimes.com/athletic/6593640/2025/09/02/tcu-social-media-fun-bill-belichick-unc/",
  "authorsByline": "Bruce Feldman",
  "articleId": "df3324ed63cc448ebd7163c657504bca",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/09/02212028/USATSI_26979716-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T02:14:57+00:00",
  "addDate": "2025-09-03T02:20:41.752643+00:00",
  "refreshDate": "2025-09-03T02:20:41.752645+00:00",
  "score": 1.0,
  "title": "How TCU social media leaned into Bill Belichick hype: Memes, one-liners and plenty of receipts",
  "description": "TCU’s director of football creative media kept the zingers coming throughout the easy win: “This part is just so much fun.\"",
  "content": "TCU had a heckuva time ruining Bill Belichick’s big debut at North Carolina on Monday night. The only one who might’ve had as much fun as the Horned Frog players in Chapel Hill was 32-year-old Sam Lazarus.\n\nTCU’s director of football creative media, like the rest of the Horned Frogs, had taken note of how everything surrounding Monday night’s game was about Belichick and his team. Of course, that wasn’t a shock considering that the 73-year-old Belichick, the greatest coach in NFL history, was coaching his first game at the college level. The curiosity factor of that probably even topped what the Horned Frogs faced when they opened up two years ago against Colorado in Deion Sanders’ first FBS game. Still, for a team coming off a nine-win season with most of its top talent returning, the disrespect of being reduced to some random faceless opponent felt like a snub.\n\nAnd, when the Tar Heels opened the game with an impressive seven-play, 83-yard touchdown drive to go up 7-0, it felt like the six-time Super Bowl-winning head coach was going to work some of his wizardry against his first college opponent. North Carolina did make that first drive look easy, and it only ratcheted up the hype another few notches. From that point on, though, the Horned Frogs systematically dismantled everything Belichick and his team attempted to do, and Lazarus and his three-person crew were ready to celebrate all of it from their TCU Football X account with memes, one-liners and lots of receipts.\n\nEarly on, the TCU Football feed sent out posts praising their players for forcing a three-and-out on defense, and then for star QB Josh Hoover’s pinpoint TD pass to Jordan Dwyer to tie the score. But an hour later, after Bud Clark’s pick six, a few field goals and a long touchdown run, Lazarus started to lean into the vibe of the evening. Like the TCU scoreboard, which ran off 41 unanswered points en route to a 48-14 victory, his posts came in a flurry.\n\nLazarus proceeded to zing everyone, from Skip Bayless to Colin Cowherd to the UNC Football account, before the night was over.\n\n“TCU was the favorite in the game, but you probably wouldn’t have known it beforehand,” Lazarus told The Athletic on Tuesday. “A lot of that played into how we approached it afterwards. We wanted to play into the irony of how it was all covered.”\n\nLazarus, who is in his second season at TCU, previously worked for UCLA and Tulsa, his alma mater. He said when he was hired at TCU, it was with the goal of showcasing the players and telling their stories.\n\nMuch of what Lazarus and his team posted from Chapel Hill was spur-of-the-moment stuff. Like his response to the Cowherd tweet that popped up right after the Tar Heels’ opening drive, when the longtime TV host declared Belichick “the second best college coach I’ve ever seen, just below Saban.”\n\nSame with his dunk on the Skip Bayless tweet predicting that “TCU is about to get blown out. Too much MJ, LT. About to get Mossed.”\n\nOf course, none of those guys were actually playing in the game. Someone sent that to Lazarus, and it didn’t take him long to respond with the perfect meme of Bayless’ old colleague Stephen A. Smith laughing his head off.\n\n“Just knowing the whole Skip-Stephen A. rivalry, that made perfect sense,” Lazarus said.\n\nA week-old Carolina Football tweet with behind-the-scenes footage touting a docuseries on Belichick’s team was another easy target. It might’ve felt like trolling when he responded with “when does episode one come out?” But Lazarus said he is genuinely curious to see that show. He also knows that’s not why the post already has more than five million views.\n\n“It’s a little bit of a joke, but there’s also a little bit of seriousness in that you want to see how they cover it,” he said.\n\nFor the night, a glorious evening for TCU, the Horned Frogs football X account has received more than 17 million views. Not bad for a school that only has around 13,000 students, but that’s part of the goal.\n\n“We’re in a private school in a league with a lot of huge schools, UCF, ASU, Texas Tech is big,” Lazarus said. “We have to get more creative with how we get attention because we don’t have that same built-in fan base that some others have.”\n\nWhen he enrolled in college, Lazarus, a huge “Moneyball” fan, had visions of working for a Major League Baseball front office, but he eventually switched to a marketing track. At one point, he thought he might go the athletic director path, but as he’s seen the evolution of the social and creative aspects of college athletic programs that have grown so much, he’s found a niche he loves.\n\n“This part is just so much fun,” he said.\n\nIt sure was for TCU fans.",
  "medium": "Article",
  "links": [
    "https://twitter.com/TCUFootball/status/1962734169928188205?ref_src=twsrc%5Etfw",
    "https://twitter.com/hashtag/GoFrogs?src=hash&ref_src=twsrc%5Etfw",
    "https://twitter.com/TCUFootball/status/1962731927439376677?ref_src=twsrc%5Etfw",
    "https://t.co/40O9IeBxn7",
    "https://t.co/GDeJQM0rR9",
    "https://t.co/3pbGVhu38k",
    "https://twitter.com/TCUFootball/status/1962757413884338433?ref_src=twsrc%5Etfw",
    "https://t.co/tyfK7iuELo",
    "https://t.co/IMMghbe7TE",
    "https://t.co/ZOp6lUwgKF",
    "https://t.co/5vON5s7NKk",
    "https://t.co/rSwVSeACq6",
    "https://twitter.com/TCUFootball/status/1962733101861200167?ref_src=twsrc%5Etfw",
    "https://t.co/hZ0EyBp88Z",
    "https://twitter.com/hashtag/ForTheWinners?src=hash&ref_src=twsrc%5Etfw",
    "https://twitter.com/TCUFootball/status/1962731873387380846?ref_src=twsrc%5Etfw",
    "https://t.co/hc1KV4LBqR",
    "https://twitter.com/TCUFootball/status/1962737717222969618?ref_src=twsrc%5Etfw",
    "https://twitter.com/TCUFootball/status/1962733255687381318?ref_src=twsrc%5Etfw",
    "https://twitter.com/TCUFootball/status/1962732283120480292?ref_src=twsrc%5Etfw",
    "https://t.co/t3pgvduhnV",
    "https://t.co/mxhQhIvLAk"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "TCU Football",
      "weight": 0.07768476
    },
    {
      "name": "TCU Football X",
      "weight": 0.07738098
    },
    {
      "name": "TCU fans",
      "weight": 0.073259436
    },
    {
      "name": "Lazarus",
      "weight": 0.07034989
    },
    {
      "name": "Sam Lazarus",
      "weight": 0.06958817
    },
    {
      "name": "TCU social media",
      "weight": 0.06913551
    },
    {
      "name": "TCU",
      "weight": 0.06869184
    },
    {
      "name": "Bill Belichick hype",
      "weight": 0.06866888
    },
    {
      "name": "Bill Belichick",
      "weight": 0.06724535
    },
    {
      "name": "Horned Frogs",
      "weight": 0.06674892
    }
  ],
  "topics": [
    {
      "name": "NFL"
    },
    {
      "name": "Football"
    },
    {
      "name": "Sports Figures"
    },
    {
      "name": "Media"
    },
    {
      "name": "Social Media"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9921875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.990234375
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.94921875
    },
    {
      "name": "/Sports/Sports Coaching & Training",
      "score": 0.370361328125
    }
  ],
  "sentiment": {
    "positive": 0.10230928,
    "negative": 0.6378343,
    "neutral": 0.25985643
  },
  "summary": "TCU's director of football creative media, Sam Lazarus, had a successful social media campaign during Bill Belichick's debut at North Carolina on Monday night. The team celebrated the game with memes, one-liners, and receipts. Despite being the subject of much attention due to the hype surrounding the game, it felt like a snub for a team coming off a nine-win season with most of its top talent returning. Lazarus and his team were able to counterbalance the attention given to the North Carolina team. The TCU Football X account has received more than 17 million views and over five million views.",
  "shortSummary": "TCU's social media exploded with memes and receipts as they defeated Bill Belichick and his team in their pre-match match against North Carolina, highlighting their team’s recent successes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "44b8b138c86b4b38b4d20e2e71e78c46",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "TCU’s football creative media director Sam Lazarus amplified the buzz around Bill Belichick’s first college game by flooding social media with memes, one-liners, and reactions to media coverage. His posts celebrated TCU’s decisive 48‑14 win over North Carolina, driving the account to over 17 million views. The strategy showcases how a smaller program can use creative digital marketing to generate national attention and engagement.",
  "argos_id": "46OJB1YAR"
}