{
  "url": "https://www.latimes.com/world-nation/story/2025-09-02/ice-is-showing-up-to-interview-parents-hoping-to-reunite-with-their-children-who-entered-us-alone",
  "authorsByline": "Valerie Gonzalez",
  "articleId": "e9cfe9b16b0f4b94b1c22d44b2d2ea84",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/afab062/2147483647/strip/true/crop/4463x2343+0+316/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F41%2F09%2F244d5063499b80bc2ab8bed59025%2F1e26f07da1cf4f909f336cf2b1b55be0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T18:31:39.804000+00:00",
  "addDate": "2025-09-02T18:35:35.996109+00:00",
  "refreshDate": "2025-09-02T18:35:35.996111+00:00",
  "score": 1.0,
  "title": "ICE is showing up to interview parents hoping to reunite with their children who entered U.S. alone",
  "description": "Legal advocacy groups say the shift has led to the arrest of some parents, while their children remain in U.S. custody.",
  "content": "People wait for loved ones from Guatemala deported from the United States outside La Aurora International Airport, in Guatemala City, Sunday, Aug. 31, 2025.\n\nPresident Trump’s administration has started requiring parents looking to reunite with their children who crossed into the U.S. alone to show up for interviews where immigration officers may question them, according to a policy memo obtained by The Associated Press.\n\nLegal advocacy groups say the shift has led to the arrest of some parents, while their children remain in U.S. custody. The U.S. Department of Homeland Security did not confirm that or answer questions about the July 9 directive, instead referring in a statement to the Biden administration’s struggles to properly vet and monitor homes where children were placed.\n\nThe Office of Refugee Resettlement, which is part of the U.S. Health and Human Services Department and which takes custody of children who cross the border without a parent or legal guardian, issued the directive. The agency said the goal is to ensure that sponsors — usually a parent or guardian — are properly vetted.\n\nThe memo is among several steps the Trump administration has taken involving children who came to the U.S. alone. Over the Labor Day weekend it attempted to remove Guatemalan children who were living in shelters or with foster care families.\n\nThe July 9 memo regarding sponsors said they must now appear in person for identification verification. Previously, sponsors could submit identity documents online. The directive also says “federal law enforcement agencies may be present to meet their own mission objectives, which may include interviewing sponsors.”\n\nNeha Desai, managing director of human rights at the National Center for Youth Law, said the change provides U.S. Immigration and Customs Enforcement a “built-in opportunity” to arrest parents — something she said has already happened.\n\nMary Miller Flowers, director of policy and legislative affairs for the Young Center for Immigrant Children’s Rights, said she knew of a case in which immigration officers arrested the father of a child under the age of 12 who had shown up for an identification check. “As a result, mom is terrified of coming forward. And so, this child is stuck,” Miller Flowers said.\n\nDesai also said the interviews are unlikely to produce information authorities don’t already have. Vetting already included home studies and background checks done by Office of Refugee Resettlement staff, not immigration enforcement.\n\nThe Office of Refugee Resettlement said it communicates “clearly and proactively” with parents, telling them they may be interviewed by ICE or other law enforcement officials. It said parents can decline to be interviewed by ICE and that refusal won’t influence decisions about whether their children will be released to them.\n\n“The goal is to ensure that every child is released to a stable and safe environment and fully vetted sponsors by ensuring the potential sponsor is the same individual submitting supporting documentation, including valid ID,” it said in a statement.\n\nHowever, Desai is aware of a situation in which a sponsor was not notified and only able to decline after pushing back.\n\n“We know of sponsors who are deeply, deeply fearful because of this interview, but some are still willing to go forward given their determination to get their children out of custody,” she said.\n\nTricia McLaughlin, a Homeland Security spokesperson, issued a statement that did not address any arrests or mention the specific changes. Instead, she said the department is looking to protect children who were released under President Joe Biden’s administration.\n\nA federal watchdog report released last year addressed the Biden’s administration struggles during an increase in migrant children arriving at the U.S.-Mexico border in 2021. The Trump administration has dispatched Homeland Security and FBI agents to visit the children.\n\nAnother recent change allows ICE to interview children while they are at government-run shelters. That took effect July 2, according to a separate directive that the Office of Refugee Resettlement sent to shelters, also obtained by the AP.\n\nThe agency said it provides legal counsel to children and that its staff does not participate in interviews with law enforcement. Child legal advocates say they get as little as one-hour notice of the interviews, and that the children often don’t understand the purpose of the interview or are misled by officers.\n\n“If we don’t understand what the interview is for or where the information is going, are we really consenting to this process?” said Miller Flowers, with the Young Center.\n\nJennifer Podkul, chief of global policy at Kids in Need of Defense, said some officers lack language skills, trauma-informed interviewing techniques and knowledge of the reunification process.\n\n“It seems like it’s designed just to cast the net wider on immigration enforcement against adults,” she said.\n\nString of policy changes adding hurdles to reunification process\n\nThe July changes are among the steps the Trump administration has taken to ramp up vetting of parents seeking to reunite with children.\n\nThe administration has required fingerprinting from sponsors and any adults living in the home where children are released. It has also required identification or proof of income that only those legally present in the U.S. could acquire, as well as introducing DNA testing and home visits by immigration officers.\n\nChildren have been spending more time in government-run shelters under increased vetting. The average length of stay for those released was 171 days in July, down from a peak of 217 days in April but well above 37 days in January, when Trump took office.\n\nAbout 2,000 unaccompanied children were in government custody in July.\n\nShaina Aber, an executive director of the Acacia Center for Justice analyzing child custody data, attributes the longer custody times to the policy changes.\n\n“The agency’s mission has been conflated and entangled,” she added. “It seems ORR’s mission has been somewhat compromised in that they are now doing more on the immigration enforcement side, and they’re not an immigration enforcement entity.”\n\nGonzalez writes for the Associated Press.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/world-nation/story/2025-08-31/dhs-secretary-noem-confirms-more-ice-resources-are-heading-to-chicago-for-immigration-crackdown",
    "https://www.latimes.com/world-nation/story/2025-08-02/south-koreans-are-obsessed-with-netflixs-kpop-demon-hunters-heres-why",
    "https://www.latimes.com/world-nation/story/2025-09-02/houston-man-charged-with-murder-in-shooting-of-11-year-old-boy-after-doorbell-prank"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Children",
      "weight": 0.09116915
    },
    {
      "name": "children",
      "weight": 0.09116915
    },
    {
      "name": "child custody data",
      "weight": 0.089463994
    },
    {
      "name": "Guatemalan children",
      "weight": 0.08942365
    },
    {
      "name": "migrant children",
      "weight": 0.088982575
    },
    {
      "name": "Child legal advocates",
      "weight": 0.08709004
    },
    {
      "name": "policy changes",
      "weight": 0.06578224
    },
    {
      "name": "U.S. custody",
      "weight": 0.065106034
    },
    {
      "name": "immigration officers",
      "weight": 0.062918045
    },
    {
      "name": "immigration enforcement",
      "weight": 0.062838666
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Travel"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.92333984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.87841796875
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.8759765625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.65966796875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.6513671875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.417724609375
    },
    {
      "name": "/News/Other",
      "score": 0.327880859375
    }
  ],
  "sentiment": {
    "positive": 0.058250148,
    "negative": 0.6611269,
    "neutral": 0.28062302
  },
  "summary": "The US President's administration has begun requiring parents looking to reunite with their children who crossed into the U.S. alone to attend interviews where immigration officers may question them. This move has led to the arrest of some parents, while their children remain in U.K. custody. The Office of Refugee Resettlement, which takes custody of children who cross the border without a parent or legal guardian, issued a directive on July 9 to ensure sponsors are properly vetted. The Department of Homeland Security did not confirm this or answer questions about the directive. The change is part of several steps the Trump administration has taken involving children who came to the US alone. The agency also allows ICE to interview children while they are in government-run shelters.",
  "shortSummary": "The Trump administration has ordered parents to appear before immigration officers to reunite with their children, potentially leading to arrests and legal issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d106343626384bc49a70b73777c5d73d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-02/south-koreans-are-obsessed-with-netflixs-kpop-demon-hunters-heres-why",
      "text": "South Koreans are obsessed with Netflix’s ‘K-pop Demon Hunters.’ Here’s why\n- Share via\nSEOUL — When South Koreans start to obsess over a movie or TV series, they abbreviate its name, a distinction given to Netflix’s latest hit “K-pop Demon Hunters.” In media headlines and in every corner of the internet, the American-made film is now universally referred to as “Keh-deh-hun” — the first three syllables of the title when read aloud in Korean.\nAnd audiences are already clamoring for a sequel.\nThe animated film follows a fictional South Korean girl group named “HUNTR/X” as its three members — Rumi, Mira and Zoey — try to deliver the world from evil through the power of song and K-pop fandom.\nSince its release in June, it has become the most watched original animated film in Netflix history, with millions of views worldwide, including the U.S. and South Korea, where its soundtrack has topped the charts on local music streaming platform Melon. Fans have also cleaned out the gift shop at the National Museum of Korea, which has run out of a traditional tiger pin that resembles one of the movie’s characters.\nMuch of the film’s popularity in South Korea is rooted in its keenly observed details and references to Korean folklore, pop culture and even national habits — the result of having a production team filled with K-pop fans, as well as a group research trip to South Korea that co-director Maggie Kang led in order to document details as minute as the appearance of local pavement.\nThere are nods to traditional Korean folk painting, a Korean guide to the afterlife, the progenitors of K-pop and everyday mannerisms. In one scene, at a table in a restaurant where the three girls are eating, viewers might notice how the utensils are laid atop a napkin, an essential ritual for dining out in South Korea — alongside pouring cups of water for everyone at the table.\n“The more that I watch ‘Keh-deh-hun,’ the more that I notice the details,” South Korean music critic Kim Yoon-ha told local media last month. “It managed to achieve a verisimilitude that would leave any Korean in awe.”\n::\nDespite its subject matter and association with the “K-wave,” that catchall term for any and all Korean cultural exports, “K-pop Demon Hunters,” at least in the narrowest sense, doesn’t quite fit the bill.\nProduced by Sony Pictures and directed by Korean Canadian Kang and Chris Appelhans — who has held creative roles on other animated films such as “Coraline” and “Fantastic Mr. Fox” — the movie is primarily in English and geared toward non-Korean audiences. But its popularity in South Korea is another sign that the boundaries of the K-wave are increasingly fluid — and that, with more and more diaspora Korean artists entering the mix, it flows in the opposite direction, too.\nThose barriers have already long since broken down in music: many K-pop artists and songwriters are non-Korean or part of the Korean diaspora, reflecting the genre’s history of foreign influences such as Japanese pop or American hip-hop.\n“Once a cultural creation acquires a universality, you can’t just confine it to the borders of the country of origin, which is where K-pop is today,” said Kim Il-joong, director of the content business division at the Korea Creative Content Agency, a government body whose mission is to promote South Korean content worldwide. “Despite what the name ‘K-pop’ suggests, it is really a global product.”\nIn “K-pop Demon Hunters,” Zoey is a rapper from Burbank. In addition, the soundtrack was written and performed by a team that includes producers, artists and choreographers associated with some of the biggest real-life K-pop groups of the past decade.\nStreaming productions are increasingly flying multiple flags, too: Apple TV’s “Pachinko” or Netflix’s “XO, Kitty” are both American productions that were filmed in South Korea. But few productions have been able to inspire quite the same level of enthusiasm as “K-pop Demon Hunters,” whose charm for many South Koreans is how accurately it captures local idiosyncrasies and contemporary life.\nWhile flying in their private jet, the three girls are shown sitting on the floor even though there is a sofa right beside them. This tendency to use sofas as little more than backrests is an endless source of humor and self-fascination among South Koreans, most of whom would agree that the centuries-old custom of sitting on the floor dies hard.\nSouth Korean fans and media have noted that the characters correctly pronounce “ramyeon,” or Korean instant noodles. The fact that ramyeon is often conflated with Japanese ramen — which inspired the invention of the former decades ago — has long been a point of exasperation for many South Koreans and local ramyeon companies, which point to the fact that the Korean adaption has since evolved into something distinct.\nIt’s a small difference — the Korean version is pronounced “rah myun” — but one that it pays to get right in South Korea.\nThe girls’ cravings for ramyeon during their flight also caught the eye of Ireh, a member of the real-life South Korean girl group Purple Kiss who praised the film’s portrayals of life as a K-pop artist.\n“I don’t normally eat ramyeon, but whenever I go on tour, I end up eating it,” she said in a recent interview with local media. “The scene reminded me of myself.”\nSouth Korean fans have also been delighted by a pair of animals, Derpy and Sussy, which borrow from jakhodo, a genre of traditional Korean folk painting in which tigers and magpies are depicted side by side, popularized during the Joseon Dynasty in the 19th century.\nIn the film, Derpy is the fluorescent tiger with goggle eyes that always appears with its sidekick, a three-eyed bird named Sussy.\nThough they have long since been extinct, tigers were once a feared presence on the Korean peninsula, at times coming down from the mountains to terrorize the populace. They were also revered as talismans that warded off evil spirits. But much like Derpy itself, jakhodo reimagined tigers as friendlier, oftentimes comical beings. Historians have interpreted this as the era’s political satire: the magpie, audacious in the presence of a great predator, represented the common man standing up to the nobility.\nThe movie is peppered with homages to Korean artists throughout history who are seen today as the progenitors of contemporary K-pop. There are apparent nods to the “Jeogori Sisters,” a three-piece outfit that was active from 1939 to 1945 and is often described as Korea’s first girl group, followed by the Kim Sisters, another three-piece that found success in the U.S., performing in Las Vegas and appearing on “The Ed Sullivan Show.”\nLongtime K-pop fans might recognize the demon hunters from the 1990s as S.E.S., a pioneering girl group formed by S.M. Entertainment, the label behind present-day superstars Aespa and Red Velvet. (Bada, S.E.S.’s main vocalist, recently covered “Golden,” the film’s headline track, on YouTube.)\nFor a long time, South Korean audiences have often complained about outside depictions of the country as inauthentic and out of touch. Not anymore.\n“Korea wasn’t just shown as an extra add-on as it has been for so long,” Kim said. “‘K-pop Demon Hunters’ did such a great job depicting Korea in a way that made it instantly recognizable to audiences here.”"
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-09-02/houston-man-charged-with-murder-in-shooting-of-11-year-old-boy-after-doorbell-prank",
      "text": "Houston man charged with murder in shooting of 11-year-old boy after doorbell prank\n- Share via\nHOUSTON — Police have charged a Houston man with murder in the fatal shooting of an 11-year-old boy who rang the doorbell of a home and ran away as a prank, police said Tuesday.\nThe 42-year-old man was taken into custody and booked into the Harris County Jail in Houston early Tuesday morning.\nCourt records did not list an attorney for the man to comment on the allegations.\nThe boy, identified by police Tuesday as Julian Guzman, had been ringing doorbells as a prank late Saturday, according to Houston police. Commonly referred to as “ding dong ditching,” the prank involves fleeing before someone inside the home opens the door.\nThe boy died of his wounds Sunday, police said.\nOther “ding dong ditch” pranks have turned deadly in the past. In 2023, a Southern California man was convicted of first-degree murder for killing three teenage boys by intentionally ramming their car after they rang his doorbell as a prank.\nIn May, a Virginia man was charged with second-degree murder for shooting an 18-year-old who rang his doorbell while filming a TikTok video, the New York Times reported.\nLozano writes for the Associated Press."
    },
    {
      "url": "https://www.latimes.com/world-nation/story/2025-08-31/dhs-secretary-noem-confirms-more-ice-resources-are-heading-to-chicago-for-immigration-crackdown",
      "text": "As Noem confirms more ICE resources are heading to Chicago, mayor is defying crackdown\n- Share via\nWASHINGTON — Homeland Security Secretary Kristi Noem said Sunday that immigration operations will soon be expanded in Chicago, confirming plans for a stepped-up presence of federal agents in the nation’s third-largest city as President Trump continues to lash out at Illinois’ Democratic leadership.\nNoem’s comments came a day after Chicago Mayor Brandon Johnson struck back against what he called the “out-of-control” plan to surge federal officers into the city. The Chicago Police Department will be barred from helping federal authorities with civil immigration enforcement or any related patrols, traffic stops and checkpoints during the surge, according to an executive order Johnson signed Saturday.\nThe Homeland Security Department last week requested limited logistical support from officials at the Naval Station Great Lakes to support the agency’s anticipated operations. The military installation is about 35 miles north of Chicago.\n“We’ve already had ongoing operations with ICE in Chicago ... but we do intend to add more resources to those operations,” Noem said during a Sunday appearance CBS News’ ”Face the Nation.”\nNoem declined to provide further details about the planned surge of federal officers. It comes after the Trump administration deployed National Guard troops to Washington, saying they were needed to target crime, immigration and homelessness, and two months after it sent troops to Los Angeles.\nTrump lashed out against Illinois Gov. JB Pritzker in a social media posting Saturday, warning him that he must straighten out Chicago’s crime problems quickly “or we’re coming.” The Republican president has also been critical of Johnson.\nJohnson and Pritzker, both Democrats, have denounced the expected federal mobilization, noting that crime has fallen in Chicago. They are planning to sue if Trump moves forward with the plan.\nIn his order signed Saturday, Johnson directed all city departments to guard the constitutional rights of Chicago residents “amidst the possibility of imminent militarized immigration or National Guard deployment by the federal government.”\nAsked during a news conference about federal agents who are presumably “taking orders,” Johnson replied: “Yeah, and I don’t take orders from the federal government.”\nJohnson also blocked Chicago police from wearing face coverings to hide their identities, as most federal immigration officers have done since Trump launched his crackdown.\nThe federal surge into Chicago could start as early as Friday and last about 30 days, according to two U.S. officials who spoke on condition of anonymity to discuss plans that had not been made public.\nPritzker, in an interview aired Sunday on “Face the Nation,” said that Trump’s expected plans to mobilize federal forces in the city may be part of a plan to “stop the elections in 2026 or, frankly, take control of those elections.”\nNoem said it was a Trump “prerogative” whether to deploy National Guard troops to Chicago as he did in Los Angeles in June in the midst of protests there against immigration raids.\n“I do know that L.A. wouldn’t be standing today if President Trump hadn’t taken action,” Noem said. “That city would have burned if left to devices of the mayor and governor of that state.”\nUnlike the recent federal takeover of policing in Washington, the Chicago operation is not expected to rely on the National Guard or military and is focused exclusively on immigration, rather than being cast as part of a broad campaign against crime, Trump administration officials have said.\nChicago is home to a large immigrant population, and both the city and the state of Illinois have some of the country’s strongest rules against cooperating with federal immigration enforcement efforts. That has often put the city and state at odds with the Trump administration’s mass deportation agenda.\nJohnson’s order builds on the city’s longtime stance, that neither Chicago nor Illinois officials have sought or been consulted on the federal presence and they stand against Trump’s mobilization plan.\nDuring his news conference Saturday, Johnson accused the president of “behaving outside the bounds of the Constitution” and seeking a federal presence in Democratic cities as retribution against his political rivals.\n“He is reckless and out of control,” Johnson said. “He’s the biggest threat to our democracy that we’ve experienced in the history of our country.”\nIn response, the White House contended that the potential flood of federal agents was about “cracking down on crime.”\n“If these Democrats focused on fixing crime in their own cities instead of doing publicity stunts to criticize the President, their communities would be much safer,” White House spokesperson Abigail Jackson said in an email Saturday.\nCritics have noted that Trump, while espousing a tough-on-crime push, is the only felon ever to occupy the White House.\nMadhani and Beck write for the Associated Press and reported from Washington and Chicago, respectively."
    }
  ],
  "argos_summary": "The Trump administration’s July 9 memo now requires parents of unaccompanied children to appear in person for ICE interviews, a move that has led to arrests of some parents while their children remain in U.S. custody. The directive, issued by the Office of Refugee Resettlement, aims to better vet sponsors but critics argue it adds unnecessary hurdles and may deter parents from reuniting with their children. ICE has also begun interviewing children in shelters, raising concerns about language barriers and trauma‑informed practices. The policy reflects a broader shift toward stricter enforcement of immigration and reunification procedures amid ongoing debates over child custody and federal‑state cooperation.",
  "argos_id": "4IDN0S3TB"
}