{
  "url": "https://finance.yahoo.com/news/exclusive-amazon-us-prime-sign-100538794.html",
  "authorsByline": "Greg Bensinger",
  "articleId": "a8fc9c5c8290471e90da927174689676",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/reuters-finance.com/722f333490f2b4562cdbd677100e55ce",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:05:38+00:00",
  "addDate": "2025-09-02T10:12:20.033007+00:00",
  "refreshDate": "2025-09-02T10:12:20.033010+00:00",
  "score": 1.0,
  "title": "Exclusive-Amazon US Prime sign-ups slow despite expanded promotion, data shows",
  "description": "SAN FRANCISCO (Reuters) -Amazon doubled its Prime Day discount sales to four days this year and touted blowout numbers days after the event.  Sign-ups in the U.S. failed to meet last year's total and even the company's own target, according to internal company data reviewed by Reuters.  The world's largest online retailer registered 5.4 million U.S. sign-ups over the 21-day run-up to Prime Day and its four-day sales event from July 8 to July 11.",
  "content": "SAN FRANCISCO (Reuters) -Amazon doubled its Prime Day discount sales to four days this year and touted blowout numbers days after the event. But by one critical metric, it missed the mark.\n\nSign-ups in the U.S. failed to meet last year's total and even the company's own target, according to internal company data reviewed by Reuters.\n\nThe world's largest online retailer registered 5.4 million U.S. sign-ups over the 21-day run-up to Prime Day and its four-day sales event from July 8 to July 11. That was around 116,000 fewer than for the same period a year earlier and 106,000 below the company's own goal, a roughly 2% decline in both metrics.\n\nThe data, which is not publicly available, offers a rare glimpse into Amazon's vaunted - and closely guarded - Prime business, a paid subscription service that offers fast delivery at no added cost and access to streaming content, among other benefits. Amazon seldom discusses details of its Prime program.\n\nReuters was unable to determine how many days Amazon used in its calculation for the full 2024 period.\n\nAmazon said it had achieved record-breaking sign-ups in the 25 days around Prime Day, without providing specifics. \"Prime membership continues to show strong growth and customer engagement in the U.S. and internationally,\" the company said in a statement to Reuters.\n\nPrime Day is viewed as the marquee event outside of the holiday shopping season to attract new members to Amazon Prime, two people familiar with the matter said. But subscriptions typically fall off after the event once the discounts disappear, said the sources, who declined to be identified as they are not authorized to discuss internal business.\n\nA pioneer of speedy delivery, Amazon is facing growing competition from Walmart, which has ramped up its own membership program offering fast delivery and other perks.\n\nWith the Trump administration's tariffs biting into importers and consumers alike, Wall Street had expected a duller Prime Day than usual, with fewer sellers and discounts.\n\nHowever, CEO Andy Jassy in a call with analysts in July described Prime Day as Amazon's \"biggest ever\", citing record sales, items sold, and sign-ups in the lead-up to the event, saying customers saved \"billions of dollars.\"\n\nDuring the four-day event, Amazon signed up 1.6 million Prime U.S. subscribers, exceeding an internal target by about 6%, or 87,000, the data showed.\n\nBut in the three weeks prior to Prime Day, a closely-watched internal metric, Amazon registered 3.9 million new U.S. Prime members, 185,000 fewer than during the same period in 2024 and 193,000 below its goal, about a 5% miss in each case.",
  "medium": "Article",
  "links": [
    "https://www.yahoo.com/people/donald-trump/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Amazon Prime",
      "weight": 0.12720795
    },
    {
      "name": "Prime Day",
      "weight": 0.12007049
    },
    {
      "name": "U.S. Prime",
      "weight": 0.114113905
    },
    {
      "name": "Prime membership",
      "weight": 0.104419395
    },
    {
      "name": "Prime",
      "weight": 0.101967685
    },
    {
      "name": "Amazon",
      "weight": 0.08835829
    },
    {
      "name": "internal company data",
      "weight": 0.07872175
    },
    {
      "name": "its Prime Day discount sales",
      "weight": 0.07579529
    },
    {
      "name": "days",
      "weight": 0.07071399
    },
    {
      "name": "fast delivery",
      "weight": 0.07002074
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98388671875
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.48583984375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.354736328125
    },
    {
      "name": "/Shopping/Shopping Portals",
      "score": 0.306884765625
    }
  ],
  "sentiment": {
    "positive": 0.15030505,
    "negative": 0.6252827,
    "neutral": 0.22441223
  },
  "summary": "Amazon doubled its Prime Day discount sales to four days and touted high numbers after the event, but sign-ups in the US fell short of expectations. The company registered 5.4 million U.S. sign-up times in the 21-day lead-up to the event and the four-day sales event were around 116,000 fewer than the same period a year earlier, and 106,000 below the company's own goal, a 2% decline. The data, which is not publicly available, offers a rare glimpse into Amazon's highly secretive Prime business. Despite this, Amazon's CEO Andy Jassy described Prime Day as Amazon's \"biggest ever\", citing record sales, items sold, and sign-ings in the lead-ups as evidence of significant growth.",
  "shortSummary": "Amazon's Prime Day sales missed expectations, with sign-ups down 2% and the company's own goal falling short, despite record-breaking performance.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "53aafdb85a534fe9aeab5f65e3464496",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Amazon’s U.S. Prime membership sign‑ups fell short of last year’s totals and the company’s own targets, with 5.4 million new members over the 21‑day period surrounding Prime Day—a roughly 2% decline from 2023. The internal data, revealed by Reuters, shows a 116,000‑member shortfall versus the prior year and a 106,000 miss against Amazon’s goal. Despite record sales during the four‑day event, the subscription growth trend remains weaker than expected, raising concerns about post‑event momentum and competition from rivals such as Walmart.",
  "argos_id": "4NEH95RLO"
}