{
  "url": "https://nypost.com/2025/09/02/sports/how-to-watch-fritz-vs-djokovic-for-free-in-us-open-quarterfinals/",
  "authorsByline": "Angela Tricarico",
  "articleId": "d2d143d7b9fd4dcfb9dc2654573a1b5a",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/djokovic-fritz.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T20:30:00+00:00",
  "addDate": "2025-09-02T20:32:21.921326+00:00",
  "refreshDate": "2025-09-02T20:32:21.921328+00:00",
  "score": 1.0,
  "title": "How to watch Taylor Fritz-Novak Djokovic for free in US Open quarterfinals",
  "description": "The last American standing will face a tennis legend for a ticket to the semifinals.",
  "content": "The only American man still standing in the US Open men’s singles draw will face a tennis legend tonight for a spot in the semifinal round.\n\nTaylor Fritz entered the US Open as the reigning runner-up and the highest-ranked American at No. 4. After several upsets during the first week of the tournament, Fritz is the only American left in the tournament, and the sole chance the United States has to produce a men’s grand slam winner since Andy Roddick’s 2003 US Open victory.\n\nIn tonight’s quarterfinal, Fritz will face No. 7 Novak Djokovic. As a 24-time Grand Slam champion tied for the most all-time among men or women, Djokovic is chasing his record-breaking 25th in this year’s US Open.\n\nHead-to-head, Djokovic and Fritz have met 10 times before, including in the quarterfinal round of the 2023 US Open, and most recently at an ATP Masters 1000 event in Shanghai. Djokovic is currently 10-0 against Fritz.\n\nThe quarterfinal match between Fritz and Djokovic is set to begin at approximately 8:30 p.m. ET tonight, Sept. 2. It will follow the quarterfinal between Aryna Sabalenka and Marketa Vondrousova, which begins at 7 p.m. ET.\n\nHow to watch Taylor Fritz vs. Novak Djokovic for free\n\nIf you don’t have cable or a TV antenna, you’ll need a live TV streaming service to stream matches from the US Open live for free. One option we love is DIRECTV, which comes with five days free and starts at $49.99/month, with plenty of subscription options and genre packs that include ESPN.\n\nYou can also watch every US Open match, including tonight’s, on ESPN’s new DTC streaming service. The $11.99/month Select plan will give you access to the matches, but springing for the $29.99/month Unlimited package will also include 24/7 live ESPN and more.\n\nWhy Trust Post Wanted by the New York Post\n\nThis article was written by Angela Tricarico, Commerce Streaming Reporter for Post Wanted Shopping, Page Six, and New York Post’s streaming property, Decider. Angela keeps readers up to date with cord-cutter-friendly deals, and information on how to watch your favorite sports teams, TV shows, and movies on every streaming service. Not only does Angela test and compare the streaming services she writes about to ensure readers are getting the best prices, but she’s also a superfan specializing in the intersection of shopping, tech, sports, and pop culture. Prior to joining Decider and The New York Post in 2023, she wrote about streaming and consumer tech at Insider Reviews",
  "medium": "Article",
  "links": [
    "https://nypost.com/shopping/",
    "https://decider.com/article/hulu-netflix-disney-plus-best-streaming-deals/",
    "https://nypost.com/2025/08/31/sports/taylor-fritz-records-convincing-win-to-reach-us-open-quarterfinals/",
    "https://nypost.com/2025/09/01/sports/taylor-fritz-will-have-to-finally-beat-novak-djokovic-for-shot-at-us-open-glory/",
    "https://nypost.com/2025/08/29/sports/frances-tiafoe-upset-in-third-round-of-us-open-in-heartbreaker/",
    "https://nypost.com/2025/08/31/sports/tommy-paul-falls-apart-in-fifth-set-of-third-round-loss-at-us-open/",
    "https://clicks.trx-hub.com/xid/nypost_01638_nypost?p=https%3A%2F%2Fnypost.com%2F2025%2F09%2F02%2Fsports%2Fhow-to-watch-fritz-vs-djokovic-for-free-in-us-open-quarterfinals%2F&q=https%3A%2F%2Fwww.dpbolvw.net%2Fclick-100223664-15242095%3Fsid%3Dusopentennis%26url%3Dhttps%3A%2F%2Fwww.directv.com%2Fstream%2F&author=Angela%20Tricarico&articleID=37000730&event_type=click&publishdate=september%202%2C%202025&linksource=web&primarytag=taylor-fritz&contentsection=sports",
    "https://clicks.trx-hub.com/xid/nypost_01638_nypost?p=https%3A%2F%2Fnypost.com%2F2025%2F09%2F02%2Fsports%2Fhow-to-watch-fritz-vs-djokovic-for-free-in-us-open-quarterfinals%2F&q=https%3A%2F%2Fgo.web.plus.espn.com%2Fc%2F2229206%2F531511%2F9070%3FsubId1%3Dnyp-CT-MPB--%26u%3Dhttps%3A%2F%2Fplus.espn.com%2F&author=Angela%20Tricarico&articleID=37000730&event_type=click&publishdate=september%202%2C%202025&linksource=web&primarytag=taylor-fritz&contentsection=sports",
    "https://nypost.com/why-trust-post-wanted-by-new-york-post/",
    "https://decider.com/author/angela-tricarico/",
    "https://clicks.trx-hub.com/xid/nypost_01638_nypost?p=https%3A%2F%2Fnypost.com%2F2025%2F09%2F02%2Fsports%2Fhow-to-watch-fritz-vs-djokovic-for-free-in-us-open-quarterfinals%2F&q=https%3A%2F%2Fgo.web.plus.espn.com%2Fc%2F2229206%2F531511%2F9070%3FsubId1%3Dnyp-CT-TXL--%26u%3Dhttps%3A%2F%2Fplus.espn.com%2F&author=Angela%20Tricarico&articleID=37000730&event_type=click&publishdate=september%202%2C%202025&linksource=web&primarytag=taylor-fritz&contentsection=sports",
    "https://decider.com/article/best-live-tv-streaming-services/",
    "https://nypost.com/author/angela-tricarico/",
    "https://nypost.com/2025/08/29/sports/novak-djokovic-gets-into-a-groove-to-roll-into-us-open-round-of-16/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Open quarterfinals",
      "weight": 0.10482999
    },
    {
      "name": "US Open",
      "weight": 0.10145847
    },
    {
      "name": "Taylor Fritz",
      "weight": 0.08018343
    },
    {
      "name": "Novak Djokovic",
      "weight": 0.07977866
    },
    {
      "name": "Fritz",
      "weight": 0.073803
    },
    {
      "name": "Post Wanted Shopping",
      "weight": 0.0698798
    },
    {
      "name": "Djokovic",
      "weight": 0.06808338
    },
    {
      "name": "every US Open match",
      "weight": 0.062475514
    },
    {
      "name": "men",
      "weight": 0.060271557
    },
    {
      "name": "TV shows",
      "weight": 0.059219383
    }
  ],
  "topics": [
    {
      "name": "Tennis"
    },
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9912109375
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.9111328125
    },
    {
      "name": "/Sports/Individual Sports/Racquet Sports",
      "score": 0.462890625
    }
  ],
  "sentiment": {
    "positive": 0.3594146,
    "negative": 0.087435596,
    "neutral": 0.5531498
  },
  "summary": "Taylor Fritz, the only American still standing in the US Open men's singles draw, is set to play against Novak Djokovic in the quarterfinals. This match is the only chance the US has to produce a men's grand slam winner since Andy Roddick's 2003 victory. If you don't have cable or a TV antenna, a live TV streaming service like DIRECTV can be used to watch the match. The match will begin at approximately 8:30 p.m. ET and will follow the quarterfinal between Aryna Sabalenka and Marketa Vondrousova.",
  "shortSummary": "Taylor Fritz faces Novak Djokovic in the US Open quarterfinals, with both sets set to unfold in dramatic fashion.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5f6110ec322d4f2dbd706dcaa6f5b998",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/09/01/sports/taylor-fritz-will-have-to-finally-beat-novak-djokovic-for-shot-at-us-open-glory/",
      "text": "With Taylor Fritz the last hope for American men in the U.S. Open, he’ll face a quarterfinal date vs. Novak Djokovic — the formidable foe he’s never defeated.\nWith Ben Shelton, Frances Tiafoe and Tommy Paul gone, can the always crazy crowd at Flushing Meadows push Fritz — America’s ultimo hombre — to finally break through?\n“It can be a good thing for me. Hopefully, the crowd is really going to get behind me now because I’m the last guy,” said Fritz, 27. “Yeah, it’s surprising. I think it’s just been a rough week for the guys. … I’m happy to be here, and hopefully, if the crowd can get behind me, we can do this.”\nIt’ll be something Fritz has never done. The Californian was a finalist here last year, but he’s winless against Djokovic. He’s 0-10 against the Serb and has dropped 23 of the 26 sets they’ve played.\n“The first seven or eight times I played him, I just wasn’t a good enough player to really have much of a chance unless I have the best day ever and he has a bad day,” Fritz said. “Only the last couple times we’ve played, I’ve been a better player that can, I’d say, compete and have chances.\n“Last time we played in Shanghai, I had looks. I had set points in the second set. I really should’ve probably won the second, taken it to a third set.”\nFritz served for the set in the Shanghai Masters before Djokovic pulled out a 6-4, 7-6 (6) win. Djokovic also needed a first-set tiebreaker to take a tough four-set win earlier last year in the Australian Open. And Fritz had served for a set in the 2022 ATP Final before the Serb gutted out a 7-6 (5), 7-6 (6) victory.\nIn short, the same way Coco Gauff broke through against Iga Swiatek — taking the past three after dropping 11 of her first dozen — there is no magic trick.\n“The way to turn it around is just to become a better player. Coco would probably say the same thing,” Fritz said. “I’m not thinking about all the losses I had to Novak … five years ago. I was nowhere near the level of player that I am now.\n“In the most recent matches we’ve had, there’s been looks. I just haven’t been able to make it happen in the important moments of those matches. That’s what makes the best guys the best guys. They’re not going to give it to you in those moments. You have to go and take it.”\nWhile Djokovic, 38, has been a pain in the neck for Fritz, he had to overcome pain in his own neck in the Round of 16.\nThe 24-time Slam winner needed multiple visits from ATP physiotherapist Clay Sniteman, working on his right shoulder and neck, then his right firearm.\n“[Fritz] is knocking on that door,” said Djokovic.\n“Taylor definitely is one of the guys that no doubt has a game, has a potential to be a Grand Slam winner. He was playing finals here last year. He was one match away, so there’s no reason not to believe that he can make it. Hopefully, not this year, but any other year is fine.”"
    },
    {
      "url": "https://nypost.com/2025/08/29/sports/novak-djokovic-gets-into-a-groove-to-roll-into-us-open-round-of-16/",
      "text": "For the first time this year at the U.S. Open, Novak Djokovic inched closer to looking more like himself in his third-round match.\nThe Serbian had not played a competitive singles match since Wimbledon and won two subpar matches to kick off the year’s final Grand Slam. It has been a slow start to the tournament, but his Friday night performance proved to be enough in a 6-4, 6-7 (4), 6-2, 6-3 win over Cameron Norrie in nearly three hours.\nThe crucial hiccups that there were, though, could have thrown off the match against a stronger opponent.\n“My team wants me to suffer on the court so I can get some more minutes spent on match play,” Djokovic said on the court after the win. “It’s good that I get tested. I haven’t had any matches since Wimbledon … still trying to find my groove. I think this is the best I’ve played so far in the tournament.”\nOne came late in the first set and it looked like Djokovic was at risk of retiring from the match for an early night at Arthur Ashe Stadium.\nFor eight straight games in the first set, he was wowing the crowd with nine aces against the Englishman after having a total of 10 just a match ago.\nYet, after breaking Norrie in the seventh game and powering four aces across the net to take the next for a 5-3 set lead, Djokovic started to rub and stretch out his back with a grimace on his face after a net point.\nHe eventually called for a trainer and was evaluated off court during a break, prompting a medical timeout.\nDjokovic came back out, settling crowd nerves, and took the first set, 6-4. Yet, it was a less mobile version of himself and during another break, trainers came back out to tend to him, rubbing his back.\n“In terms of how I’m feeling, it really goes up and down, to be honest,” he said in his post-match news conference. “Yeah, it’s frustrating for me, honestly, that I’m not able to feel 100 percent always like I have for 20-plus years. But yeah, I guess the circumstances are quite different and I have to get used to the fact that every match there’s something that might happen as it has been the case this year pretty much every slam.”\nDjokovic managed to brush it aside and made it a distant memory despite a second set that saw five double faults including one that lost him the set tiebreak to Norrie.\nHe showed separation in the final two sets as the senior player at 38, totaling 18 aces on the night for his most ever in a match at the U.S. Open.\n“I still feel like I enjoy myself competing, can be very hard on myself and my team, I know that, but I still feel like I have game left in me, you know, to play at the highest level,” he said. “I want to keep pushing myself to see, you know, whether I can have a shot at another slam or, you know, any big tournaments.”\nDjokovic’s slow start was also benefited by an early exit by Frances Tiafoe, who lost to qualifier Jan-Lennard Struff in straight sets.\nHe will face the German in the fourth-round on Sunday, setting him up with an easier schedule. Nevertheless, Struff has been on a run — also beating No. 11 Holger Rune in a five-set second-round thriller."
    },
    {
      "url": "https://nypost.com/shopping/",
      "text": "Shopping\nLast chance! We found 70+ extended Labor Day sales still available today—Shop while you can\nWe’re here to take the labor out of Labor Day shopping.\nBeat next summer’s heatwave with the lowest price ever on the BLACK + DECKER Portable Air Conditioner on Amazon\nChill out with this great Amazon deal.\nAdvertisement\nMore in Shopping\nSleep better every night with our tried-and-true sheet sets\nSeptember 2, 2025 | 4:02pmBedtime never looked so good.\nBalding? Studies say this $850 laser could regrow hair — we have the hidden promo code\nSeptember 2, 2025 | 3:38pmFeeling blue about balding? Red light therapy to the rescue!\nLayer up in timeless pieces this season with Men’s Wearhouse —starting as low as $20\nSeptember 2, 2025 | 11:24amFeeling confident is priceless.\nI swapped Microsoft 365 for this one-time $160 deal for Microsoft Office—no regrets here\nSeptember 2, 2025 | 7:00amThe full suite—no subscription, no stress. Just real tools for a one payment.\n31+ Labor Day mattress and bedding deals ready to sleep on\nSeptember 1, 2025 | 1:11pmThe dreamiest deals to crash into.\nCostco’s big, new perk kicks in — but you may need to upgrade your membership to get it\nSeptember 1, 2025 | 10:22amThe early bird gets the Kirkland rotisserie chicken.\nBloom is bringing creatine gummies to the top of your feed with TikTok Shop\nSeptember 1, 2025 | 9:00amPause your workout. Or, stop scrolling. Bloom’s new creatine gummies are taking over TikTok.\nAre parasites wrecking your gut? The best parasite cleanses and how they work, per experts\nSeptember 1, 2025 | 9:00amParasites crashing the party? Here’s the best way to kick them out.\nGive your wrist a $155 upgrade with Apple Watch Series 7\nSeptember 1, 2025 | 8:00amYour wrist can get a whole lot smarter with this deeply discounted Apple Watch.\nThe e-scooter that’s all about the extras — and it’s 45% off\nSeptember 1, 2025 | 7:00amStorage for days, safety features for peace of mind.\nCan you improve circulation while sitting down? Maybe with this $99 Amazon fitness find\nAugust 31, 2025 | 9:04amPedal your problems away before Labor Day!\nBeauty TikTok’s favorite COSRX snail goo skincare is over 50% off on Amazon for 12 hours only\nAugust 31, 2025 | 8:22amCOSRX for the win.\nGo global with lifetime access to Mondly’s 41 languages\nAugust 31, 2025 | 8:00amA lifetime of language skills for a one-time, 70% off payment.\nPeace of mind and personal safety are only $23.99\nAugust 31, 2025 | 7:00amKeep your loved one’s safe\nPart mood lighting, part charger — this modern latern is under $30\nAugust 30, 2025 | 1:07pmPutting some glamp in your camp!\nThe Labor Day deals are seriously dreamy over at Saatva\nAugust 30, 2025 | 10:30amGet your dreamy Saatva Labor Day deals here, with some of the luxe bedding brand’s deepest discounts ever!\nExclusive Labor Day sale at Lafayette 148 — enjoy an extra 20% off with coupon code\nAugust 30, 2025 | 9:58amShop fast, sizes are flying off the shelves.\nThese are the top last minute back-to-school deals that’ll save you time and money this year\nAugust 30, 2025 | 6:07amDo you have everything you need?\nWe have a secret code for the Cozy Earth pajamas our editors are likely wearing right now\nAugust 29, 2025 | 2:08pmYes, we practically live in these pajamas — and you should too.\nSave your oven for your shoes, and use this air fryer instead — 40% off for Labor Day\nAugust 29, 2025 | 12:16pm10,000 shoppers have already added this to their cart!"
    },
    {
      "url": "https://nypost.com/why-trust-post-wanted-by-new-york-post/",
      "text": "We’re your buying beacon through the shopping chaos:\nFor over 200 years, the New York Post has been America’s go-to source for bold news, engaging stories, in-depth reporting, and now, insightful shopping guidance.\nFounded in 1801 by the legendary Alexander Hamilton, The Post has witnessed history’s grandest chapters. It only makes sense that in recent years, we’ve turned our keen eye toward the ever-evolving world of online shopping to provide expert product guides.\nEnter, Post Wanted.\nPost Wanted was established to help take the guesswork out of finding what you want online. But before you dive into our curated picks, let’s address the elephant in the room: Why buy from Post Wanted by the New York Post? Why count on us as your trusted online shopping destination for your hard-earned cash?\nWe review with honesty, irreverence, and a dash of wit:\nForget artificially “intelligent” robotic reviews and soulless stories about steals and deals.\nNews devotees trust our fearless reporting and opinions, zodiac zealots trust our best-in-class cosmic coverage, religious real estate readers rely on us for the latest luxury listings, and sports fanatics come to us first for up-to-the-minute score reporting and colorful columnist commentary.\nTherefore, it should be no surprise that savvy shoppers come to Post Wanted for the most wanted sales, shopping guides, and product reviews. We prioritize honesty and integrity above all else because we, just like you, are tired of the convoluted chaos online shopping has become, where trust can be harder to find than the perfect gift for your wife.\nAt Post Wanted, we’re real-life humans, just like you. Our team of seasoned journalists and product enthusiasts spends their days sifting through mountains of information, testing products until our brains go numb, and writing content and reviews so engaging you’ll forget you’re only reading about meal kits (even if that meal kit is life-changing).\nWe go beyond the buzzwords:\nSure, we could bombard you with buzzy brands and technical jargon, but what good does that do? You’re smarter than that. We believe in cutting through the noise and delivering clear, concise information that actually helps you make informed purchasing decisions.\nOur shopping guides are chock-full of real-world insights, pros and cons laid bare, and honest evaluations that leave no stone unturned. We don’t just tell you the 411 on the latest and greatest; we tell you what’s worth your hard-earned dollars, no matter your budget or lifestyle.\nWe’re a community, not just a catalog:\nPost Wanted isn’t just another shopping site for cord-cutters or those good at housekeeping (you know what we’re talking about); it’s a vibrant community of curious minds and discerning shoppers.\nOur content fosters a sense of shared discovery and informed choice. If we haven’t tried it, that doesn’t mean we won’t. Until then, we will continuously update our content to meet industry standards by living in the weeds of customer reviews to separate fact from fluff, researching and testing new competitive product choices, and interviewing leading experts in related fields.\nJust like you, we’re constantly evolving and learning through trial and error, and we always welcome your feedback. After all, a community thrives on dialogue, and we’re all eyes and ears when it comes to your thoughts and experiences.\nWe know transparency is the name of the game:\nWe live in a pay-for-play world of sponsored content and affiliate marketing, and we get it. At best, it can be crowded, but at worst, it can be downright criminal.\nHowever, brutal honesty is kind of our thing. The New York Post built an entire reputation around honest headlines that make headlines. So, at Post Wanted, we clearly label partnership content and disclaim if we receive anything from our affiliate links, so you always know where we stand. By shopping with us, you continue to support our hard work in finding only the best products for you.\nWe aim to empower you with knowledge, not insult you with marketing mumbo jumbo. Our team loves what we do, and you deserve to know what drives our recommendations. We wouldn’t have it any other way.\nPost Wanted is where shopping and storytelling meet:\nWhen reading Post Wanted, you won’t lose the New York Post’s legacy of powerful storytelling. We weave our witty real-life experiences into every one of our guides, hopefully making the process of finding the perfect product exciting, not exhausting.\nWe believe informed shopping should be fun – even addictive – and we’re here to prove it. So, ditch the endless scrolling and by-the-book reviews and join us on a journey of discovery where knowledge meets wit, and trust is always above the fold.\nWho’s helping you shop:\nJackie Goldstein, Vice President, Commerce\nBarret Wertz, Editorial Director, Commerce\nCamryn La Sala, Editor, Commerce\nHolly J. Coley, Editor, Commerce Updates\nKendall Cornish, Writer/Editor, Commerce\nVictoria Giardina, Journalist & Content Strategist, Commerce\nSophie Cannon, Associate Manager, Commerce Strategy and Development\nP.J. McCormick, Writer/Reporter, Commerce Deals\nMatt Levy, Writer/Reporter, Commerce Events\nMiska Salemann, Writer/Reporter, Commerce\nEmma Sutton-Williams, Writer/Reporter, Commerce\nHannah Southwick, Writer/Reporter, Page Six Commerce\nErica Radol, Writer/Reporter, Page Six Commerce\nAngela Tricarico, Writer/Reporter, Decider Commerce\nMeaghan Roche, Senior Manager, Commerce SEO\nReady to start shopping?\nExplore our curated collections of beauty and skincare must-haves, home improvement heroes, deals for days, or the greatest gift guides for anyone you could ever think of. Let us make your life easier, better, and just maybe a little more fun.\nWe know building trust takes time, but if it still isn’t clear after more than 200 years, we’re here to earn yours – one product, one gift, one witty review at a time."
    },
    {
      "url": "https://decider.com/author/angela-tricarico/",
      "text": "Angela Tricarico\nAngela Tricarico is a commerce reporter\nBackground\nAngela is a New York-based commerce reporter for The New York Post and its streaming property, Decider. Every day, she scours for the best streaming bundles, and tests tech products like headphones while listening to plenty of Taylor Swift. To keep readers updated on cord-cutter-friendly deals and how to watch their favorite sports teams, TV shows, and movies, Angela brings her expertise in shopping, tech, and entertainment to every piece. Before joining Decider and The Post in 2023, she covered streaming and consumer tech at Insider Reviews. An alumna of the University of New Haven, where she studied journalism and theater, Angela enjoys Broadway shows, ice cream, and making the most of her AMC A-List pass — or supporting her favorite teams, win or lose.\n- First Movie I Ever Saw:\n- Monsters, Inc.\n- First Binge\n- Shameless (the US version!)\n- All-Time Faves\n- Top Gun, Paddington 2, The Social Network, Ted Lasso, Succession, Saturday Night Live\n- Current Obsession\n- It's Always Sunny in Philadelphia\n- If I Were A GIF...\n-\nThe Latest\n-\nHow to Watch 'The Great British Bake Off' Season 16 From Anywhere\nBy Angela Tricarico •If you hate spoilers, this streaming info is for you. -\nThe 18 Best Streaming Bundles and Packages We Found for September 2025\nBy Angela Tricarico • Updated: 154 SharesWith so many streaming services to choose from in 2025, here are the very best deals on Netflix, Hulu, Disney+, ESPN+, Apple TV Plus — and more. -\nApple TV+'s New K-Pop Show Is Here—Here's How to Watch 'KPOPPED'\nBy Angela Tricarico •The K-Pop phenomenon hits Apple TV+. -\n'Thunderbolts' Disney+ Release Date—What to Know and How to Watch\nBy Angela Tricarico •The MCU's misfits come together in Thunderbolts*, which is now streaming on Disney+. -\n'Thunderbolts*'\nBy Angela Tricarico •Not super. Not heroes. Now streaming on Disney+. -\nNew FOX One Streaming Service Launches on Prime Video: Here's How to Subscribe\nBy Angela Tricarico •FOX One is already increasing the ways you can subscribe! -\nHere's What You Need to Know About the New ESPN Streaming Service: Price, Bundles, Deals\nBy Angela Tricarico •The brand new DTC streaming service launched on Aug. 21 ahead of the 2025 NFL season. -\nWhat Time Does 'Peacemaker' Season 2 Come Out on HBO Max? How to Watch, Release Schedule\nBy Angela Tricarico •We're just hours away from a first look at Season 2's title sequence dance. -\n'Superman' (2025)\nBy Angela Tricarico •James Gunn's feel-good blockbuster has made its way to streaming. -\nHow to Watch KJ Apa and Madelyn Cline in 'The Map That Leads To You' For Free\nBy Angela Tricarico •A new romantic drama is coming to Prime Video. -\nHow to Watch 'The Pickup' for Free on Prime Video: Release Date, Streaming\nBy Angela Tricarico •The new Amazon Original stars Eddie Murphy and Pete Davidson. -\nShop the Limited-Edition MeUndies x 'Jurassic Park' Collab Before It Sells Out\nBy Angela Tricarico •This wild collaboration is available for a limited time! -\nWhere to Watch 'The Naked Gun' and Sequels Before the 2025 'Naked Gun' Movie\nBy Angela Tricarico •Here's how you can catch up with the Police Squad! adventures ahead of The Naked Gun (2025). -\nHow to Watch 'The Challenge: Vets and New Threats' for Free: Time, Streaming, Cast\nBy Angela Tricarico •16 The Challenge veterans meet 16 new competitors. -\n'Peacemaker' Season 1\nBy Angela Tricarico •Peacemaker Season 2 is coming soon! Make sure you're caught up. -\nAll the Streaming Services with Student Discounts: Subscribe For The Best Deals\nBy Angela Tricarico • Updated:You're going to need something to stream on study breaks. -\nHere's How to Watch New Episodes of 'The Wonderfully Weird World of Gumball' for Free\nBy Angela Tricarico •Gumball is back and he's on a new network. -\n'Happy Gilmore 2' is Here — Shop New Callaway Golf Balls Inspired by the Movie\nBy Angela Tricarico •It's time to hit the links! -\nOver 3,000 Amazon Shoppers Bought This Discounted Sony Soundbar This Month — You Can Too\nBy Angela Tricarico •This thin Sony model is perfect for virtually any space. -\n'South Park' is Back for Season 27 — Here's How to Watch New Episodes Free\nBy Angela Tricarico •After a two-week delay, the new season is here!"
    },
    {
      "url": "https://nypost.com/2025/08/31/sports/taylor-fritz-records-convincing-win-to-reach-us-open-quarterfinals/",
      "text": "Don’t count out the American men — or man — just yet.\nThe last representative, Taylor Fritz, doesn’t look ready to go anywhere.\nThe world No. 4 Fritz is headed back to the quarterfinals at the U.S. Open after his impressive straight-set victory over No. 21 Tomas Machac 6-4, 6-3, 6-3 at Louis Armstrong Stadium.\nThe early departures of No. 6 Ben Shelton, No. 14 Tommy Paul and No. 17 Frances Tiafoe left only Fritz.\nIf that brought any added pressure, he didn’t show it in reaching the quarterfinals in Queens for the third straight year.\n“I guess it can be a good thing for me,” Fritz said. “Hopefully, the crowd is really going to get behind me now because I am the last guy.\n“It’s surprising. I think it’s just been a rough week for the guys. I mean, it’s tough, Ben with the injury, then I think [Tiafoe] and Tommy just ran into some guys who were dangerous players, playing really good tennis, so it happens.”\nNot to the 27-year-old Fritz.\nHe conceded just 13 points on his dominant serve without facing a break point in the brief one-hour, 38-minute rout.\nHe broke Machac late in each of the first two sets to take a commanding lead.\nIn the third, a Machac double-fault gave Fritz an early break, and he cruised from there.\nAfter dropping a set in his previous two matches, he didn’t have nearly as much trouble.\nFritz did enough in the return game and was in complete control with his overpowering serve, notching 14 aces and winning an absurd 35 of 39 points on his first serve.\n“I thought it was definitely the best match I have played so far in this tournament,” he said.\nFritz advances to face No. 7 Novak Djokovic, the 24-time Grand Slam champion.\nThe two have met 10 times before, with Fritz losing each matchup.\nHe obviously is a different player now, compared to several of their earlier encounters.\n“I think the way to turn it around is just to become a better player,” Fritz said. “For me, in my head, I’m not thinking about all the losses I had to Novak, I don’t know, like, five years ago. I was nowhere near the level of player that I am now.”\nLast summer, he broke through here to reach the final, where he lost to Jannik Sinner.\nIn doing so, Fritz became the first American man to play for a Grand Slam title in 15 years.\nThe last American to win a major was Andy Roddick 22 years ago at the U.S. Open.\nThe hope was that the drought would end in this tournament.\nWhile only one American reached the fourth round, a disappointing result after four U.S. men got to that point a year ago, Fritz is carrying the torch pretty well for the time being.\n“I’m happy to be here,” he said, “and hopefully, like I said, if the crowd can get behind me, we can do this.”"
    },
    {
      "url": "https://nypost.com/2025/08/29/sports/frances-tiafoe-upset-in-third-round-of-us-open-in-heartbreaker/",
      "text": "Instead of the American men having a tennis breakthrough, they had a breakdown.\nBen Shelton and Frances Tiafoe both crashed out of the U.S. Open in third-round upset losses on Friday. They’d been tipped to end America’s 22-year drought in men’s majors, but instead suffered major heartbreak in Flushing Meadows.\nAfter Pat McEnroe had boldly predicted before this U.S. Open that an American man would finally win here for the first time since Andy Roddick in 2003, Shelton was leading unseeded Adrian Mannarino when he injured his shoulder and retired at the start of the fifth set. An hour later, Tiafoe was ousted by Jan-Lennard Struff, the German winning 6-4, 6-3, 7-6 (7).\n“[The pain level] was really high. I never retired before. I’m not a guy who would retire if I could continue,” said Shelton, who retired for the first time of his Tour-level career.\n“Usually I’ll play through anything and just find a way. And whether it’s sickness or injury, if I can stay out there, I can stay out there. I never felt anything like this before. So, that was kind of tough.”\nIt was tough for American men’s tennis as a whole.\nThe sixth-seeded Shelton was amid a career-best season and seen as potentially the best chance at breaking the U.S. men’s skid.\nShelton had won a dramatic set point to take the third set and go up 6-3, 3-6. 6-4. But, in doing so, he took a fall to the Louis Armstrong Stadium court. The tumble may have proved costly.\nWhile Shelton said he’s not sure what caused the injury, he went for a big forehand in the opening game of the fourth set and immediately grimaced in pain. He clutched at his shoulder and tried to play through it. Shelton did manage to save a break point, but immediately signaled to coach Bryan Shelton, his father.\nThree points into the next game, Shelton had to take a medical timeout with a trainer working on his shoulder. Even when he resumed, a compromised Shelton had to change his entire game, charging the net rather than his usual first-strike style and pounding the ball from the baseline.\nEventually, Shelton lost the fourth set 6-4. After talking with his father, he resolved to retire. He walked off the court with towel draped over his face.\nShelton said he was unsure if he’d need any imaging. What’s clear is this is a golden opportunity missed, with even Mannarino admitting a healthy Shelton likely would’ve won.\n“Even if I’m giving a little trouble to him, he’s still a better player than me,” Mannarino said. “So, yeah, bad luck.”\nIt got worse for American tennis an hour later as Tiafoe suffered a straight-sets loss on the Grandstand court.\nHe was broken five times, while he saw Struff score on 88 percent of his first serves.\n“I was late on a lot of balls, just scrubbing them to be on offense, and he was dictating play. … The match was always kind of on his racket,” Tiafoe said. “I had a little window there when he just gave me some gifts; I didn’t take it. But I played extremely passive; I didn’t put any pressure on him at all.\n“I’ve got to tip my hat to him. He made me feel very, very [uncomfortable], and I didn’t do a very good job of adjusting. It is what it is. I’ve got to swallow it; very, very tough.”\nTiafoe had his back taped but said it was precautionary and wouldn’t use that as an excuse.\n“No, I had no issues. I felt good, and I’ve had those all the matches,” Tiafoe said. “So, no, I don’t want to use that.”\nThis comes after Tiafoe was ousted in the second round at both Wimbledon and the Australian Open.\nTiafoe didn’t expect to have company on his way out from countryman Shelton, whom he assumed was on his way to the fourth round.\n“I saw he was up two sets to one on the court, and that was it; I just figured he probably won,” Tiafoe said. “That always sucks to go out like that. I’ve had that feeling, but especially in a Grand Slam where actually it was most like he was probably going to win, very, very tough.”\nWith Tiafoe’s loss and Shelton’s injury, American hopes entering Friday night were pinned on No. 4 Taylor Fritz as he prepared to face Jerome Kym."
    },
    {
      "url": "https://decider.com/article/best-live-tv-streaming-services/",
      "text": "For many, one of the biggest fears anyone considering getting rid of their cable or satellite box is whether they can still watch live TV. While cutting the cord may mean paying a lower monthly bill, many wannabe streamers still like to watch events like news and sports live — like the good old days.\nCutting the cord doesn’t have to mean giving up watching live TV entirely. A selection of services allows streaming these coveted sports games live over the internet. Dubbed live TV streaming services, these services with Live TV differ from monthly or yearly subscription-based streaming sites like Netflix, Hulu and Disney+. Live TV streaming services, like Sling TV and Hulu + Live TV, offer a more complete opportunity to cut those cords that bind you while still giving you access to live local and national news and sports channels — for a price. But there are also free live streaming options to plug some holes, like Pluto TV.\nHere’s what you need to know about the best alternative to cable while still retaining the ability to watch TV. Here are the best live TV streaming services you can get right now and how they compare.\n- Best Live TV Streaming Service Overall: Hulu + Live TV\n- Best Budget Live TV Streaming Service: Philo\n- Best Cable Alternative Live TV Streaming Service: DIRECTV Stream — save up to $60 on your first three months\n- Best Live TV Streaming Service for Sports: Fubo — save $5 on your first month\n- Best Live TV Streaming Service for Add-Ons: Sling TV — save 50% on your first month\nBest Live TV Streaming Service Overall: Hulu + Live TV\nPros:\n- Over 90 channels included\n- Hulu, Disney+, and ESPN+ included\n- Unlimited DVR\nCons:\n- Can only stream on two screens at once\n- Free trial is only 3 days\n- One of the more expensive live TV services\n- Number of channels: 95+\n- Top channels: Live local ABC, NBC, CBS, Fox; ESPN; FS1; FX\n- Simultaneous streams: Up to two at once\nNot only will Hulu + Live TV stream all your live TV, but it also comes with three great streaming services as a bonus. A subscription will get you access to Hulu, Disney+, ESPN+, and over 90 live TV channels. We’ve found that Hulu + Live TV has the most inclusive and well-rounded selection of channels included with a base subscription — unlike some of the other services, which only offer some fairly common channels in add-on packages, the only add-ons Hulu + Live TV offers (aside from premium channels like Max, Starz, and Showtime) are for more specialized channels. You can stream on two screens at a time and all subscriptions now come with unlimited cloud DVR storage.\nHulu + Live TV costs $82.99/month (with ad-supported Hulu, Disney+, and ESPN+) or $95.99/month if you want to upgrade to ad-free versions of Hulu and Disney+ (ESPN+ will still be ad-supported).\nBest Budget Live TV Streaming Service: Philo\nPros:\n- Super affordable\n- 70+ channels\n- One week free trial\n- AMC+ included at no extra charge\nCons:\n- No local news channels\n- Number of channels: 70+\n- Top channels: MTV, Paramount Network, AMC, Hallmark Channel\n- Simultaneous streams: Up to three at once\nPhilo, which is the cheapest live TV streaming service, is perfect for those who love lifestyle content. The service includes over 70 channels in their base plan, which costs just $28.00/month.\nThere are no live news channels or local channels, save for BBC News, on Philo, so if that’s where your interests really lie, Philo might not be the best live TV streaming service for you. But if you can’t get enough House Hunters, 90 Day Fiancé, and Diners, Drive-Ins, and Dives, this is the best live TV streaming service for you. The channel lineup is primarily focused on lifestyle, with networks like Hallmark Channel, HGTV, Great American Family, MTV, TLC, Discovery, and more, all included in the $28.00/month price tag.\nOur review: “Philo is a true hidden gem in the wild world of over-the-top streamers. An affordable alternative to YouTube TV and Hulu + Live TV, Philo offers 70+ channels and unlimited DVR space for only $28/month. The service doesn’t include local network channels, but it does offer a host of popular cable options like A&E, AMC, AMC+, Comedy Central, BET, Hallmark Channel, and Paramount Network. Wanna give it a go? Philo offers a seven-day free trial for new subscribers.” — Josh Sorokach\nBest Cable Alternative Live TV Streaming Service: DIRECTV Stream\nPros:\n- Local news and sports channels\n- Free trial\n- Unlimited DVR\nCons:\n- More expensive than most live TV streaming services\n- Number of channels: 90+\n- Top channels: Live local ABC, NBC, CBS, Fox; regional sports networks, ESPN\n- Simultaneous streams: Unlimited on same Wi-fi network\nWhat sets DIRECTV Stream apart from other live TV streaming services is the channel selection that mimics the kind of selection you’d get from a traditional cable subscription with cable boxes and all of that.\nIn addition to including all your local news channels, like affiliates of ABC, NBC, CBS, and Fox, you’ll also get your local sports channels — the specialized networks like MSG or YES in New York and various regional Bally Sports affiliates — based on the market you’re located in.\nWe’ve found that this service has the most well-rounded selection of local channels in a base plan, but to get the sports channels, you’ll have to upgrade to a more expensive plan. The base Entertainment + Sports Pack costs $101.98/month, while the Choice plan with local sports is $114.98/month (but right now, you can save up to $60 on your first three months).\nBest Live TV Streaming Service for Sports: Fubo\nPros:\n- Free trial\n- Premium add-ons\n- Base plan has the most channels of any live service\nCons:\n- Some basic channels require upgrading past base plan\n- Unlimited DVR and 4K quality cost extra per month\n- Number of channels: 214+\n- Top channels: Live local ABC, NBC, CBS, Fox; regional sports networks, ESPN\n- Simultaneous streams: Up to 10\nWhat makes Fubo the best streaming service for live sports is the wide array of live sports channels included in the 180+ channel base plan. From local sports channels and ESPN to international channels like Bein and niche sports networks like NBC Golf, if you want to watch a sporting event, odds are, Fubo has it — even your regional sports networks, if you subscribe to the Pro plan or higher.\nFubo TV has three plans starting at $79.99/month. They also have a few add-on packages priced monthly, but upgrading past the base plan will give you those channels included at a discount. You can also add premium channels and add-ons like Starz, NBA League Pass, Paramount+ with Showtime, and MGM+.\nBest Live TV Streaming Service for Add-Ons: Sling TV\nPros:\n- Affordable\n- Huge selection of add-ons\nCons:\n- Plans can be confusing and only have up to 46 channels\n- No free trial\n- Only 50 hours of DVR storage without paying extra\n- Number of channels: 35+\n- Top channels: Live local ABC, NBC, Fox; ESPN; Fox news\n- Simultaneous streams: Up to 4 (but Orange plan only allows 1)\nIf customizing your channel offerings is important to you, you can’t go wrong with Sling TV. The service has two base plans, Blue and Orange — each offers different channels — starting at $45.99/month. You can also combine the two starting at $65.99/month. The base plans only have up to 46 channels, and the rest (including channels that other services have inside of their base plans) have to be added on.\nOnce the base plan is picked, Sling has more add-ons than any other live TV service, so you can pick and choose different premium channels (often with sweet deals attached), niche interest channels, and bundles, until Sling TV is full of everything you want to watch.\nThese are just a few of the add-on highlights:\n- Sling Blue + Sports Extra (15 channels for $11/month)\n- Sling Blue and Orange + Sports Extra (20 channels for $15/month)\n- Max (half off your first month, $5 off every subsequent month)\n- Paramount+ with Showtime ($5 for your first month, then $10/month)\n- Starz ($5 for your first month, then $10.99/month)\n- AMC+ ($5 for your first month, then $9.99/month)\nOther Streaming Services With Specific Live TV Options:\n- Paramount+: Paramount+ with Showtime ($11.99/month) subscribers can watch their local CBS channel live 24/7, in addition to a handful of sporting events like NFL on CBS, The Masters, March Madness games, and more.\n- Our review: I enjoy Paramount+ because it allows me to watch live sports with convenient features like rewinding and fast-forwarding, or even starting a game from the beginning if I miss a key moment like a goal or penalty. It brings back a nostalgic feel, reminding me of the days when cable TV was the go-to option. Beyond sports, Paramount+ offers a great selection of classic TV shows, keeps me updated with daily news, and even provided a smooth experience streaming the Golden Globes with minimal interruptions. — Maeve Degan\n- Peacock: If you subscribe to Peacock Premium Plus ($11.99/month), you’ll be able to watch your local NBC affiliate live. Any live sports on Peacock are open to both subscription tiers to stream.\n- ESPN+: Get your sports fix with live NHL, MLB, NFL, golf tournaments, UFC and more with ESPN+ for $10.99/month.\n- Max: With Max’s Bleacher Report Sports add-on (currently free for all subscribers), you’ll be able to stream NBA, NFL, NCAA, and other sports and leagues that air on TNT and TBS. The linear HBO cable networks are also always live on Max. You’ll also be able to watch live CNN 24/7 with the new News section.\nWhy Trust Decider Shopping\nThis article was written by Angela Tricarico, Commerce Streaming Reporter for Decider, the New York Post, and Page Six. Angela keeps readers up to date with cord-cutter-friendly deals, how to watch your favorite sports teams and movies on each streaming service and the very best in tech, like soundbars, to enhance your viewing experience. Not only does Angela test and compare the services, devices and merch she writes about, but she’s also a superfan specializing in the intersection of shopping, tech and pop culture. Prior to joining Decider and the New York Post in 2023, she wrote about streaming and consumer tech at Insider Reviews.\nFor more like this, check out the Decider Shopping section."
    },
    {
      "url": "https://nypost.com/2025/08/31/sports/tommy-paul-falls-apart-in-fifth-set-of-third-round-loss-at-us-open/",
      "text": "A week into the U.S. Open, the once-promising American men are down to one representative.\nOn Friday, sixth-seeded Ben Shelton and No. 17 Frances Tiafoe were eliminated.\nSaturday night, Tommy Paul joined them, leaving just Taylor Fritz, the fourth seed, left on the men’s side.\nThe 14th-seed, who had advanced to the quarterfinals of both the Australian and French Open earlier this year, was sent packing by No. 23 Alexander Bublik 7-6 (5), 6-7 (4), 6-3, 6-7 (5), 6-1 at Arthur Ashe Stadium.\nLast year, four American men reached the fourth round, with Fritz facing Tiafoe in an all-American semifinal.\nThat was sliced to one this time around.\nPaul had no answer for Bublik’s big serve, failing to break him once during the entire 3-hour, 38-minute match.\nHe had just six opportunities, needing tiebreakers in the second and fourth sets to push it to the limit.\nBut Paul lost his serve early in the fifth set and found himself in a love-three hole.\nIt didn’t get any better for Paul.\nHe lost his serve again, this time at love.\nBy then, the end was near.\nIt has been 22 years since an American man won the U.S. Open — Andy Roddick in 2003.\nIf that drought is going to end, Fritz will have to get it done.\nHe reached the final here last summer, becoming the first to play for a Grand Slam title in 15 years.\nFritz lost to Jannik Sinner in straight sets.\nHe will face No. 21 Tomáš Machác in the fourth round on Sunday.\nPaul’s third-round exit marked his earliest departure from the U.S. Open since 2022.\nHe reached the fourth round the previous two years."
    },
    {
      "url": "https://nypost.com/author/angela-tricarico/",
      "text": "Angela Tricarico\nAngela Tricarico is a writer/reporter at the New York Post.\nBackground\nEvery day, Angela scours for the best streaming bundles, and tests tech products like headphones while listening to plenty of Taylor Swift. To keep readers updated on cord-cutter-friendly deals and how to watch their favorite sports teams, TV shows, and movies, Angela brings her expertise in shopping, tech, and entertainment to every piece. Before joining Decider and The Post in 2023, she covered streaming and consumer tech at Insider Reviews. An alumna of the University of New Haven, where she studied journalism and theater, Angela enjoys Broadway shows, ice cream, and making the most of her AMC A-List pass — or supporting her favorite teams, win or lose.\nLatest Articles\nHow to watch Taylor Fritz-Novak Djokovic for free in US Open quarterfinals\nSeptember 2, 2025 | 4:30pmThe last American standing will face a tennis legend for a ticket to the semifinals.\n'The Naked Gun' is now streaming — Here's how to watch at home\nSeptember 2, 2025 | 1:59pmOne of 2025's best comedies has made its way to home video.\nHow to watch WWE Clash in Paris 2025: Date and start time, match card\nAugust 31, 2025 | 10:00amFive matches are on the card this afternoon in Paris.\nF1 Summer Break ends today—Here's how to watch the Dutch Grand Prix for free\nAugust 31, 2025 | 5:00amF1 is back!\nHow to watch Nevada vs. Penn State in college football Week 1: Time, live stream\nAugust 30, 2025 | 11:30amA loaded roster meets a team in the midst of a rebuild.\nLee Corso retires: How to watch his final 'College GameDay' live for free\nAugust 30, 2025 | 5:00amCorso will make his final mascot headgear pick this morning.\nCollege Football is back—Here's every Week 1 game you can stream with Sling TV\nAugust 28, 2025 | 1:30pmGet set now so all you have to do on Saturday is flip the TV on.\nHow to watch 'The Terminal List: Dark Wolf' for free: Release time, cast\nAugust 26, 2025 | 9:00pmTaylor Kitsch and Chris Pratt reprise their roles from \"The Terminal List\" in the new prequel.\nBath and Body Works drops new Disney Villains collab—Shop it now\nAugust 26, 2025 | 9:57amEarlier this year, princesses had their time to show; now, it's all about the villains.\nLittle League World Series: How to watch Chinese Taipei vs. Las Vegas championship: Time, streaming\nAugust 24, 2025 | 11:00amSummerlin South has the opportunity to become the first team from Nevada to win the LLBWS.\nHow to watch 2025 US Open tennis for free: Live stream, TV schedule\nAugust 24, 2025 | 7:00amThe final grand slam of the season gets started on a Sunday this year.\nLittle League World Series: How to watch United States, International Championships: Time, streaming\nAugust 23, 2025 | 8:30amA team from the tri-state area is just one win away from the final game.\nHere's how to watch the 2025 Aer Lingus College Football Classic between Iowa State and Kansas State\nAugust 23, 2025 | 8:00amCollege football is officially back!\nHere's how to watch Cowboys vs. Falcons for free in NFL Preseason Week 3\nAugust 22, 2025 | 5:18pmBoth teams are looking for their first win of preseason.\nJets close out preseason against the Eagles—Time, channel, how to watch for free\nAugust 22, 2025 | 4:43pmThe Jets are finishing out preseason at home.\nCollege football is back — Be ready for the whole season with Sling TV\nAugust 22, 2025 | 4:16pmSling offers flexible ways to watch college football, from day passes to five-month prepaid subscriptions.\nThe Mets open series vs. Braves with Apple TV+ broadcast—Watch for free\nAugust 22, 2025 | 3:41pmThe Mets 12-game run against NL East teams continues with this series against the Braves.\nHow to watch West Ham vs. Chelsea for free in the US: Start time, live stream, lineups\nAugust 22, 2025 | 12:29pmBoth teams are still looking for their first wins of the new season.\nThe F1 movie is racing onto your living room TV—Here's how to stream it at home\nAugust 22, 2025 | 10:47am\"F1\" features a handful of real F1 drivers racing alongside the film's characters.\nESPN just dropped a bundle with free Disney+ and Hulu for a year—Here's what you need to know\nAugust 21, 2025 | 6:22pmGet an all access pass to all things ESPN and beyond."
    },
    {
      "url": "https://decider.com/article/hulu-netflix-disney-plus-best-streaming-deals/",
      "text": "We’re at the height of the Streaming Wars, and deciding for which platform you’re willing to pay a premium can be as challenging as figuring out your favorite ice cream on a hot summer’s day. There are countless options, each offering a similarly satisfying selection, with something new debuting seemingly every week.\nHowever, some are just better than others. It all depends on what mood you’re in, right? Well, much like ice cream, there are streaming services that offer something yummy for just about everyone’s taste.\n- Disney+ with Hulu and HBO Max bundle — save up to 42% monthly\n- Disney+ with Hulu and ESPN bundle — save over 39% monthly\n- Prime Video subscription — add channels like HBO Max, Paramount+\n- Starz via Prime Video — get three months for $3.99/month\nSimiles aside, the reality is that streaming services are how most TV watchers watch TV. According to data aggregator Statista, there will be over 182.26 million streaming service users in the U.S. this year. By 2027, that number is predicted to be nearly 202.6 million.\nStreaming can quickly get pricey, though — that’s the beauty of deal packages like the Disney+, Hulu, and ESPN+ bundle, or HBO Max, which bundles a ton of Discovery networks (Food Network, TLC, etc.) with all things HBO and live sports from TNT and TBS, all for one low price. Even streamers like Prime Video have bundle options: with Prime Video Channels, you can add a number of streamers onto your Prime Video app.\nSo how do you decide what you need? Easy. You come to Decider.\nDisney+\nIf shows like Andor and Ironheart are on your radar, you’ll want to purchase a Disney+ subscription. In addition to movies and series from the classic Walt Disney collection, it also gives parents and fans of all ages access to the Marvel Cinematic Universe (so you can finally watch all the Marvel movies in order), plus Pixar, Star Wars, National Geographic, and even 20th Century Fox content like The Simpsons and some Hulu titles.\nCurrently, Disney+ offers multiple bundle options to fit various budgets and needs. The basic ad-supported plan costs $9.99/month, but to get Disney+ ad-free, you’ll pay $15.99/month. Based on these prices, a bundle option may be more cost-effective if you were already considering subscribing to Hulu, ESPN+, or HBO Max, or are already a subscriber of any of those services.\n- Disney+ and Hulu bundle with ads – $10.99/month (save 44% monthly)\n- Disney+ and Hulu bundle ad-free – $19.99/month (save 42% monthly)\n- Disney+, Hulu, ESPN Select bundle with ads – $16.99/month (save 46% monthly)\n- Disney+, Hulu, ESPN Select bundle ad-free – $26.99/month (save 42% monthly)\n- Disney+, Hulu, HBO Max bundle with ads – $16.99/month (save 43% monthly)\n- Disney+, Hulu, HBO Max bundle ad-free – $29.99/month (save 42% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle with ads – $29.99/month (save 40% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle ad-free – $28.99/month (save 40% monthly)\nWhat to look forward to on Disney+ in 2025: Lilo and Stitch (9/3), LEGO Star Wars: Rebuild the Galaxy – Pieces of the Past (9/15), Percy Jackson and the Olympians Season 2 (12/10), Ahsoka Season 2 (TBA), Wonder Man (TBA), Elio (TBA), The Fantastic Four: First Steps (TBA)\nAmazon Prime Video\nSuppose, for whatever reason, you haven’t succumbed to the Amazon juggernaut yet. If that’s the case, now is your chance to finally join the masses and stream original Prime Video series such as the award-winning Fallout, but also thousands of other TV series and movies like the exclusive Reacher and The Wheel of Time.\nPrime Video is one of the perks of an Amazon Prime membership, along with the signature two-day free shipping and some Prime-exclusive pricing during shopping events like Prime Day. Amazon Prime currently costs $14.99/month or $139.00/year. If you’re not interested in all that Prime offers, the company offers a standalone subscription to Prime Video for $8.99/month.\nAs of January 2024, Prime Video plays limited ads during movies and shows, but you can pay an additional $2.99/month to remove them.\nYou can also add over 100 streaming services onto your Prime Video subscription to combine multiple subscriptions into one service. Here are just a few of those:\n- Starz – $10.99/month after seven days free\n- Peacock – $16.99/month after seven days free\n- FOX One – $19.99/month after seven days free\n- HBO Max – from $9.99/month\n- Paramount+ – $7.99/month after seven days free\n- Apple TV+ – $9.99/month after seven days free\n- Hallmark+ – $7.99/month after seven days free\n- Mubi – $14.99/month after seven days free\n- BritBox – $8.99/month after seven days free\n- Acorn TV – $8.99/month after seven days free\nWhat sports are streaming on Prime Video? NFL Thursday Night Football, WNBA, MLB (New York Yankees in NY area), NHL (Seattle Kraken in SEA area), ONE Championship, Premier Boxing Championship + more with add-ons (Max, Paramount+), NASCAR, NBA (beginning fall 2025)\nWhat to look forward to in 2025:The Summer I Turned Pretty Season 3 (currently airing), The Terminal List: Dark Wolf (currently airing), The Girlfriend (9/10), Gen V Season 2 (9/17), Hotel Costiera (9/24), Hedda (9/24), Our Fault (10/16), Lazarus (10/22), Hazbin Hotel Season 2 (10/29), Maxton Hall Season 2 (11/7), Fallout Season 2 (12/17)\nHulu\nWith a subscription to Hulu, you’ll be able to watch originals like Only Murders in the Building, FX on Hulu titles like The Bear, and new episodes of ABC and Fox broadcast shows like 9-1-1 and Grey’s Anatomy the day after they air on TV. When you bundle, you’ll also be able to watch all of Hulu’s content in the Disney+ app.\nCurrently, Hulu offers two subscription options and a handful of bundles to fit all of your streaming needs. With ads, you can subscribe to Hulu alone for $9.99/month after a 30 day free trial, and without ads, $18.99/month. These are the other bundles available with Hulu.\n- Disney+ and Hulu bundle with ads – $10.99/month (save 44% monthly)\n- Disney+ and Hulu bundle ad-free – $19.99/month (save 42% monthly)\n- Disney+, Hulu, ESPN Select bundle with ads – $16.99/month (save 46% monthly)\n- Disney+, Hulu, ESPN Select bundle ad-free – $26.99/month (save 42% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle with ads – $29.99/month (save 40% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle ad-free – $28.99/month (save 40% monthly)\n- Disney+, Hulu, Max bundle with ads – $16.99/month (save 43% monthly)\n- Disney+, Hulu, Max bundle ad-free – $29.99/month (same 42% monthly)\nWhat to look forward to on Hulu in 2025: Alien: Earth (currently airing), The Twisted Tale of Amanda Knox (currently airing), Only Murders in the Building Season 5 (9/9), Chad Powers (9/10), Reasonable Doubt Season 3 (9/18), Solar Opposites final season (10/13), All’s Fair (TBA 2025)\nHBO Max\nHBO Max (formerly known as Max) is a service that combines all things HBO with all things Discovery (TLC, Food Network, etc.), Warner Bros., and more. There’s a vast library of current and classic TV and film just waiting to be explored with HBO Max. Additionally, ad-free plans include live sports and live CNN.\nMax currently offers a few subscription options and bundles to fit all of your streaming needs. With ads, you can subscribe to HBO Max alone for $9.99/month, and without ads, $16.99/month. These are the other bundles available with HBO Max.\n- Disney+, Hulu, HBO Max bundle with ads – $16.99/month (save 43% monthly)\n- Disney+, Hulu, HBO Max bundle ad-free – $29.99/month (save 42% monthly)\n- HBO Max and Cinemax bundle with ads – $21.99/month (save 19% monthly)\nWhat sports are streaming on HBO Max (with the Bleacher Report Sports add-on included with ad-free plans)? NHL on TNT, NBA on TNT, March Madness, French Open, Unrivaled Basketball\nWhat to look forward to on HBO Max in 2025: Hard Knocks Season 25 (currently airing), Peacemaker Season 2 (currently airing), Task (9/7), It: Welcome to Derry (October 2025), I Love LA (11/2), The Chair Company (TBA 2025)\nStarz\nGet some of the most popular original series around, like Outlander and BMF, plus a massive library of great movies for one low price of $10.99/month. The service continues to grow in popularity as it also continues to invest in the Power series with new spinoff titles.\nRight now, you can sign up for Starz with a special offer; your first three months will be just $4.99/month. If you prefer a longer plan, you can get one year for $29.99 total.\nYou can also take advantage of a deal when subscribing to Starz via Prime Video. Your first three months will be just $3.99/month.\nESPN+\nESPN Unlimited is ESPN’s new DTC streaming service that lets subscribers watch all things ESPN. With live streams of every ESPN network (from the flagship to ESPNU to ACCN and beyond) and over 47,000 live sporting events every year, this new service is allowing cord-cutters to experience all things ESPN.\nIf you were previously a subscriber to ESPN+ or had ESPN+ included in a streaming bundle, your subscription was converted to ESPN Select, and includes everything it previously had (NHL, PGA Tour, US Open tennis, and more). ESPN Select is still available to subscribe to as a new subscriber, too.\n- ESPN Select Annual Plan – $119.99/year (Save 16% annually)\n- ESPN Unlimited Annual Plan – $299.99/year (save 16% annually)\n- Disney+, Hulu, ESPN Select bundle with ads – $16.99/month (save 46% monthly)\n- Disney+, Hulu, ESPN Select bundle ad-free – $26.99/month (save 42% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle with ads – $29.99/month (save 40% monthly)\n- Disney+, Hulu, ESPN Unlimited bundle ad-free – $28.99/month (save 40% monthly)\nWhat sports are streaming on EPSN? NHL, NFL Monday Night Football, UFC Pay-Per-View, PGA Tour, Formula 1, Tennis, FA Cup, La Liga, Bundesliga, assorted NCAA (football, basketball, lacrosse, baseball, hockey, wrestling), WWE\nPeacock\nSimilarly to Paramount+, Peacock is a streaming service that debuts their own original content while also being the streaming home for an entire family of cable networks, namely the NBC Universal ones. That means you can watch currently-airing NBC titles like the Law and Order franchise and Saturday Night Live the day after they air on NBC, plus a backlog of NBC shows that includes all of their iconic sitcoms — The Office, Parks and Rec, and more.\nThe same goes for all things Bravo; Real Housewives, Below Deck, Southern Charm, and more are all streaming in full on Peacock. You can watch all of the past seasons, plus new episodes of new seasons the morning after they air on Bravo.\nPeacock also premieres Focus Features, DreamWorks, and Universal Pictures movies after theatrical runs; recent titles include Trolls: Band Together, Oppenheimer, and The Holdovers.\nPeacock currently has three plans after eliminating their free plan in early 2023. The plan with ads is either $10.99/month or $109.99/year. To get rid of ads, you’ll pay $16.99/month or $169.99/year.\nThe newest plan, Select, is an ad-supported plan that includes the best of NBC and Bravo television (excludes Peacock Originals and movies). It costs $7.99/month or $79.99/year.\nPeacock also launched on Prime Video, where you can get the Premium Plus (ad-free) plan with a seven-day free trial.\nWhat sports are streaming on Peacock? NFL Sunday Night Football, the Olympic Games, Premier League, Tennis (Grand Slam Opens), IndyCar, NASCAR, US Open Golf\nWhat to look forward to in 2025: Twisted Metal Season 2 (currently airing), The Paper (9/4), Love Island Games Season 2 (9/16), Devil in Disguise: John Wayne Gacy (10/16)\nDIRECTV\nWhat sets DIRECTV apart from other live TV streaming services is that channel selection mimics the kind of selection you’d get from a traditional cable subscription with cable boxes and all of that — which is fitting, since DIRECTV is known for satellite cable.\nIn addition to including all your local news channels, like affiliates of NBC, CBS, and Fox, you’ll also get your local sports channels — the specialized networks like MSG or YES in New York and various regional Fox Sports affiliates — based on the market you’re located in.\nWe’ve found that this service has the most well-rounded selection of local channels in a base plan and the most variety, especially with the newly-released Genre Packs.\n- MySports ($69.99/month) – 25+ channels, including everything you’ll need to tune into your favorite sporting events\n- MyEntertainment ($34.99/month) – 40+ channels and the Disney+ and Hulu basic bundle\n- MyNews ($39.99/month) – 10+ channels with news coverage from across the political spectrum\n- MiEspañol ($34.99/month) – 50+ Spanish-language networks\n- MyKids ($19.99/month) – 10+ kid-friendly channels, plus Disney+\nOnce you’ve chosen a Genre Pack, you can add on additional packs and services.\nIf you’re looking for the more classic DIRECTV experience, you can still subscribe to the Entertainment ($86.99/month), Choice ($89.99/month for the first three months), or Ultimate ($104.99/month for the first three months) base plans.\nFOX One\nFor one low price, you’ll gain access to a number of networks and brands with FOX One, which just launched on Aug. 21. With FOX One, you can watch live FOX News Channel, FOX Business Network, FOX Weather, FOX Sports, FS1, FS2, FOX Deportes, BTN, FOX Local Stations, and the FOX Network. This also includes the NFL, MLB, NASCAR, and the upcoming 2026 FIFA World Cup.\nAfter a seven-day free trial, FOX One (on Prime Video) costs $19.99/month.\nApple TV+\nApple got into streaming video in 2019, giving subscribers to its Apple TV+ service access to original programming like The Morning Show, with Reese Witherspoon and Jennifer Aniston, and the critically acclaimed Ted Lasso, which garnered over 40 Emmy nominations over a three season run, as well as more than 40 other original shows and movies.\nThough the days of Apple offering a one-year free trial are over, you can still take advantage of a three-month free trial by purchasing a new eligible Apple device or a seven-day free trial without a new device. Once that trial is over, or if you’re ineligible, Apple TV+ costs $13.99/month.\nLike a few other services on this list, Apple allows you to purchase add-on streaming services that you can access right in the Apple TV app, including their very own MLS streaming app.\nWhat sports are streaming on Apple TV? MLB Friday Night Baseball, MLS\nWhat to look forward to in 2025: Foundation Season 3 (currently airing), Platonic Season 2 (currently airing), Invasion Season 3 (currently airing), Highest 2 Lowest (9/5), The Morning Show Season 4 (9/17), Slow Horses Season 5 (9/24), The Savant (9/26), Loot Season 3 (10/15), Pluribus (11/7), F1 (TBA 2025)\nPhilo\nThis huge live TV streaming bundle allows cord-cutters access to over 60 different channels. The basic package includes Paramount Network, MTV, A&E, BBC America, AMC, OWN, MTV, and Hallmark content, plus a subscription to AMC+. Right now, you can get Philo’s basic channel bundle for just $28.00/month after a seven-day free trial.\nWant more premium channels? You can add-on content from MGM+ for $5.99/month and Starz for $9.99/month.\nSling TV\nSling TV has three different packages to choose from, and they each have something fantastic to offer. If you’re interested in family-friendly programs, go with Sling Orange ($45.99/month). It has 32 channels, including seven exclusive for sports, and family. Sling Blue ($50.99/month) is a great option if you’re an entertainment or news buff, while Sling Orange + Blue ($65.99/month) has 22 exclusive channels (46 in total) to enjoy.\nFor a limited time, the streaming service is offering 50% off your first month, which means you can start watching for as low as $23!\nThere’s also a Sling offer running that’ll give you a month of free AMC+ in addition to your Sling channels and you can snag HBO Max for 50% off during your first month and $5 off every month after.\nParamount+\nThis updated streaming service is a rebrand of CBS All Access. You’ll find a huge library of TV episodes, films, live sporting events, and original content from entities including CBS, BET, Comedy Central, MTV, Nickelodeon, Paramount Pictures, Pluto TV, movies from Paramount Pictures, and more.\nParamount+ restructured its streaming plans to integrate Showtime, which no longer operates as a standalone streaming service. If you’re looking for just Paramount+ content, and don’t mind a few ads, the essential plan is $7.99/month or $59.99/year (37% off!).\nFor $12.99/month or $119.99/year (23% off!), get Paramount+ Premium — this is now the only way to watch all of Showtime’s original series, like Yellowjackets and The Chi and a library of acclaimed movies, including A24’s catalog, without a linear cable subscription. This plan will also give you your live local CBS affiliate.\nWhat sports are streaming on Paramount+? NFL on CBS, Soccer (UEFA, CONCACAF, NWSL), Big 10 Football, PGA Tour\nWhat to look forward to in 2025: Dexter: Resurrection (currently airing), Star Trek: Strange New Worlds Season 3 (currently airing), NCIS: Tony and Ziva (9/4), Tulsa King Season 2 (9/21), Landman Season 2 (11/16)\nfuboTV\nThis live 4K streaming option has over 100 channels, including almost every broadcast and cable network. But what might make it more attractive for many viewers is the addition of loads of niche sports networks like MSG, Golf Network, FS2 and BeIN Sports.\nFubo TV has two base plans, both with a one-week free trial: Pro and Elite. Here’s a breakdown of what each plan will get you:\n- Pro ($84.99/month): 232 channels including RSNs, unlimited cloud DVR, 100+ live sporting events, and unlimited screens\n- Elite ($94.99/month): Everything included in Pro, plus 67 additional channels\nDeal Alert! Right now, you can save $20 on your first month of fuboTV when you subscribe to one of the base plans listed above.\nAdditional channel bundles, like Fubo Extra and News Plus, are available as a la carte add-ons, but by subscribing to a plan that already includes them, you’ll be receiving a monthly discount. Other add-ons not included in one of the base plans are Starz ($9.99/month), Sports Plus with NFL RedZone ($10.99/month), and NBA League Pass ($14.99/month). The service also offers add-ons for international viewers who speak Spanish, Italian, French, and Portuguese.\nDAZN\nDAZN is a sports-focused streaming service that offers live and on-demand coverage of a wide range of events, including boxing, MMA, soccer, and more. It provides flexible access across devices, allowing fans to watch their favorite sports anytime, anywhere. Known for exclusive rights to major fights and leagues in various countries, DAZN is a go-to platform for dedicated sports enthusiasts.\nMost major MMA fights require both a subscription and a PPV. If you prefer a more flexible option, you can subscribe to DAZN for $29.99/month, but you can also subscribe to a Monthly Saver plan that locks you into a $19.99/month plan for 12 months — that’s 33% cheaper than the flexible monthly plan when you add it all up.\nHulu + Live TV\nHulu + Live TV will stream all your live TV, and it also comes with three great streaming services as a bonus. A subscription will get you access to Hulu, Disney+, ESPN+, and over 90 live TV channels all for $82.99/month.\nWe’ve found that Hulu + Live TV has the most inclusive and well-rounded selection of channels included with a base subscription — unlike some of the other services, which only offer some fairly common channels in add-on packages, the only add-ons Hulu + Live TV offers (aside from premium channels like Max, Starz, and Showtime) are for more specialized channels. You can stream on two screens at a time and all subscriptions now come with unlimited cloud DVR storage\nNordVPN\nTo watch anything from anywhere, a VPN like NordVPN will be your new streaming best friend.\nKnown for its fast and reliable server connections, NordVPN is regarded as one of the best options in the market. It has an expansive collection of servers worldwide. More importantly, it comes equipped with several privacy and security features that protect your device against malware and keep your browsing safe and anonymous.\nThe service offers 1-and-2-year plans that start as low as $3.39/month paid all at once (paid monthly, plans start at $12.99/month), and often have free months thrown in to extend your coverage further — right now, it’s up to one year free.\nNetflix\nFar from the days of mailing DVDs in red sleeves, Netflix is still the largest streaming service in the world, with over 240 million subscribers worldwide. If you aren’t one of those customers, it may be time to consider the monthly plans. In addition to a massive library of TV shows and movies, Netflix has its own studio. It offers an impressive stream of popular original films and shows, like steamy Shondaland favorite Bridgerton and fan favorites like Squid Game and, of course, Stranger Things.\nThe streamer currently offers three plans, with the cheapest being the most recent addition to its lineup. For $7.99/month, you can stream Netflix in standard definition with ads. To get rid of ads, plans start at $17.99/month for full high definition, and $24.99/month for streaming in up to 4K UHD on up to four screens at a time.\nAs Netflix recently cracked down on password sharing, you can add profiles for people who don’t live in your immediate household to your account for $6.99/month extra if you have either of the two ad-free plans.\nWhat sports are streaming on Netflix? NFL Christmas Day games, WWE Raw\nWhat to look forward to in 2025: Wednesday Season 2, Part 2 (9/3), Nobody Wants This (10/23), Stranger Things Season 5 (11/26)\nWhy Trust Decider Shopping\nThis article was written by Angela Tricarico, Commerce Streaming Reporter for Decider, the New York Post, and Page Six. Angela keeps readers up to date with cord-cutter-friendly deals, how to watch your favorite sports teams and movies on each streaming service and the very best in tech, like soundbars, to enhance your viewing experience. Not only does Angela test and compare the services, devices and merch she writes about, but she’s also a superfan specializing in the intersection of shopping, tech and pop culture. Prior to joining Decider and the New York Post in 2023, she wrote about streaming and consumer tech at Insider Reviews.\nFor more like this, check out the Decider Shopping section."
    }
  ],
  "argos_summary": "Taylor Fritz, the last American man in the U.S. Open, will face 24‑time Grand Slam champion Novak Djokovic in the quarterfinals at 8:30 p.m. ET on September 2. The match can be streamed for free on the first five days of DIRECTV’s trial or via ESPN’s new direct‑to‑consumer service, which offers a $11.99/month select plan. Fans can also watch the event on ESPN’s DTC platform, which includes live sports coverage. The article highlights the streaming options and the significance of Fritz’s potential breakthrough in the tournament.",
  "argos_id": "6CG14MI06"
}