{
  "url": "https://www.usatoday.com/story/entertainment/tv/2025/09/02/the-summer-i-turned-pretty-season-3/85893963007/",
  "authorsByline": "Amaris Encinas",
  "articleId": "7ea050a42fff488db9b52d0cc3694df7",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/29/USAT/85895868007-s-3-ut-308-241031-cheedd-00046-r-crop-c-3000.jpg?crop=2999,1687,x0,y156&width=2999&height=1687&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:05:07+00:00",
  "addDate": "2025-09-02T10:10:20.483448+00:00",
  "refreshDate": "2025-09-02T10:10:20.483449+00:00",
  "score": 1.0,
  "title": "When does Episode 9 of 'The Summer I Turned Pretty' come out? How to watch Belly in Paris",
  "description": "With Belly in Paris, the end of \"The Summer I Turned Pretty\" is closer than you think. Here's what to know, including where to stream Episode 9.",
  "content": "The end of \"The Summer I Turned Pretty\" is closer than you think.\n\nFollowing the disaster of the wedding that (almost) was, Belly (Lola Tung) decided to leave everything she's ever known, including Cousins, behind.\n\nAs Jeremiah (Gavin Casalegno) mourns the loss of what could have been, Belly heads to Paris in search of herself. And Conrad (Christopher Briney) is playing the long game (though he doesn't know it quite yet.)\n\n\"I had these pillars in my life. Cousins, my family, Taylor, Jer,\" Belly says in a new trailer posted on Friday, Aug. 29. \"They made me feel like I was safe, like I was on solid ground. Now they're gone and it's just me.\"\n\nWhile viewers don't know exactly what potential adventures, even romance, await Belly in Paris (since it's not exactly canon), they're excited to find out.\n\nThe Amazon Prime Original Series, now in its third and final season, hinges on a love triangle between Belly and the Fisher brothers, Conrad and Jeremiah, as they navigate life, growing pains and one immeasurable loss.\n\nLooking for a free mini puzzle? Play the USA TODAY Quick Cross now.\n\nBased on the beloved book trilogy (of the same name) by bestselling author Jenny Han, \"The Summer I Turned Pretty\" is a TV adaptation that depicts \"first love, first heartbreak, and the magic of that one perfect summer.\"\n\nHere is what to know, including where to stream Episode 9.\n\nWhen is the next episode of 'The Summer I Turned Pretty' coming out?\n\nEpisode 9 of \"The Summer I Turned Pretty\" premieres Sept. 3 at 3 a.m. ET/midnight PT on Prime Video.\n\nWhat days does 'The Summer I Turned Pretty' come out?\n\nNew episodes of \"The Summer I Turned Pretty\" are released weekly, on Wednesdays.\n\nAfter this week's episode drops, there are onlytwomore \"The Summer I Turned Pretty\" episodes left.\n\nHere are the release dates for (the rest of) Season 3:\n\nWhere to stream 'The Summer I Turned Pretty'\n\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show, as well as the first eight episodes from Season 3, are also available to watch on the streaming platform.\n\n\"TSITP\" Season 3 premiered on Wednesday, July 16, and will conclude on Wednesday, Sept. 17, after an 11-episode run.\n\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 per month, or $139 a year if you prefer to pay annually. Discounted membership options are available for young adults and qualifying recipients of government assistance.\n\nCustomers may purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/entertainment/tv/2025/08/12/the-summer-i-turned-pretty-season-3/85614910007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/07/08/the-summer-i-turned-pretty-season-3-release-date/84493978007/",
    "https://www.amazon.com/gp/video/getstarted?usattrending-20",
    "https://www.usatoday.com/story/entertainment/tv/2025/07/17/summer-i-turned-pretty-season-3-episode-schedule/85261779007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/08/26/the-summer-i-turned-pretty-season-3/85822651007/",
    "https://www.aboutamazon.com/news/retail/amazon-prime-access-discounted-membership",
    "https://www.aboutamazon.com/news/retail/prime-student-benefits",
    "https://www.usatoday.com/story/entertainment/tv/2025/08/19/the-summer-i-turned-pretty-season-3/85710030007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/07/29/the-summer-i-turned-pretty-season-3/85428100007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/07/16/the-summer-i-turned-pretty-season-3-cast/85247556007/",
    "https://puzzles.usatoday.com/quick-cross",
    "https://www.usatoday.com/story/entertainment/books/2025/07/19/summer-i-turned-pretty-book-ending/85275509007/",
    "https://www.usatoday.com/story/life/health-wellness/2025/07/23/the-summer-i-turned-pretty-phenomenon/85323290007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/07/15/summer-i-turned-pretty-season-3/85217613007/",
    "https://www.aboutamazon.com/news/retail/is-cost-of-prime-membership-worth-it",
    "https://www.usatoday.com/picture-gallery/entertainment/celebrities/2025/08/04/best-celebrity-photos-august-2025/85484998007/",
    "https://www.usatoday.com/story/entertainment/tv/2025/08/05/summer-i-turned-pretty-season-3/85511403007/",
    "https://www.usatoday.com/story/shopping/best-streaming-deals-bundles-free-trials/83951337007/?utm_source=usat&utm_medium=content&utm_campaign=spike",
    "https://www.youtube.com/embed/UFPT7_U4oyc?si=cEuuDUMbnK7C6zax"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Belly",
      "weight": 0.084375344
    },
    {
      "name": "Prime Video",
      "weight": 0.0820991
    },
    {
      "name": "Prime Video subscriptions",
      "weight": 0.08007661
    },
    {
      "name": "Amazon Prime",
      "weight": 0.07902311
    },
    {
      "name": "New episodes",
      "weight": 0.076851524
    },
    {
      "name": "Pretty",
      "weight": 0.071822405
    },
    {
      "name": "first love",
      "weight": 0.07010694
    },
    {
      "name": "Episode",
      "weight": 0.06734475
    },
    {
      "name": "USA TODAY Quick Cross",
      "weight": 0.06409642
    },
    {
      "name": "first heartbreak",
      "weight": 0.06331694
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.9677734375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.96044921875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.5302734375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.304931640625
    }
  ],
  "sentiment": {
    "positive": 0.20899929,
    "negative": 0.22867733,
    "neutral": 0.56232333
  },
  "summary": "The end of \"The Summer I Turned Pretty\" is closer than you think, with Episode 9 set to air on Prime Video on Wednesday, August 3. The show, based on the book trilogy by Jenny Han, follows Belly (Lola Tung) leaving everything she's ever known, including her family, friends, and brothers, Jeremiah and Conrad, as they navigate life, growing pains and one significant loss. The episode 9 will premiere on August 3 at 3 a.m. ET/midnight PT. The series is currently in its third and final season and hinges on a love triangle between Belly and the Fisher brothers.",
  "shortSummary": "The Summer I Turned Pretty, starring Lola Tung and Conrad, is drawing to a close with episodes released on Amazon Prime Video on September 3.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e07eecab099a4e4b82d3c946f1750988",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/07/08/the-summer-i-turned-pretty-season-3-release-date/84493978007/",
      "text": "'The Summer I Turned Pretty' Season 3 is almost here. Here's when it will return.\nThe end of an era is nearly upon us.\nAnd that's because in less than two weeks, viewers will once again return to Cousins with Belly and boys for the summer. Except this trip back to Cousins will be the \"last\" one, iykyk.\nSeason 3 of \"The Summer I Turned Pretty,\" a coming-of-age romantic television series based on the popular book trilogy by bestselling author Jenny Han, premieres July 16 on Amazon Prime Video.\nThe show, which takes place over many-a summer, follows the ongoing love triangle between Belly (Lola Tung) and brothers, Conrad (Christopher Briney) and Jeremiah (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\nAt the end of the \"The Summer I Turned Pretty\" Season 2 finale, we see Belly put the past and her feelings for first love Conrad in the rearview as she focuses on her future and her budding relationship with Jeremiah.\nBut the past, specifically Conrad, has a habit of reappearing when its least convenient for Belly, who tries but might fail to keep her feelings at bay. Belly's left to make a huge decision, one that will change the course of their lives forever, by the end of the summer.\nWill Season 3 of \"The Summer I Turned Pretty\" be the last time we see Belly and the boys? Here's what we know, including what best-selling author and showrunner Jenny Han has said about the possibility of a fourth season.\nWhat happens in Season 3 of 'The Summer I Turned Pretty?'\nWe're not huge fans of spoilers at USA TODAY, but what we can say with certainty is that Belly will choose someone to give her love to by the end of the summer. (Hint: You can always read the books, specifically the third book, if you're desperate to know how things will end.)\nThe new season picks up with Belly, who is looking forward to another summer in Cousins with Jeremiah after her junior year of college.\n(Everyone, including Jeremiah, knows that Conrad still has a place in Belly's heart.)\n\"Her future seems set, until some core-shaking events bring her first love Conrad back into her life,\" according to official logline for Season 3. \"Now on the brink of adulthood, Belly finds herself at a crossroads and must decide which brother has her heart. Summer will never be the same.\"\nWhile Belly's decision is the focus of Season 3, other character arcs like that of Taylor and Steven will also have their moment in the spotlight.\n'The Summer I Turned Pretty' Season 3 episode release schedule\nThe third and final season of \"The Summer I Turned Pretty\" premieres July 16 on Prime Video with the first two episodes of Season 3 available to stream on premiere day.\nThe remaining Season 3 episodes, unlike the two previous seasons, will drop weekly on Wednesdays at 12:00 a.m. PT/3 a.m. ET through the Sept. 17 finale.\nHere's the full schedule:\n- Episode 3 drops Wednesday, July 23\n- Episode 4 drops Wednesday, July 30\n- Episode 5 drops Wednesday, Aug. 6\n- Episode 6 drops Wednesday, Aug. 13\n- Episode 7 drops Wednesday, Aug. 20\n- Episode 8 drops Wednesday, Aug. 27\n- Episode 9 drops Wednesday, Sept. 3\n- Episode 10 drops Wednesday, Sept. 10\n- Episode 11 (Finale) drops Wednesday, Sept. 17\n'The Summer I Turned Pretty' Season 3 cast\nIt's not summer without Belly or the boys, including Steven, of course.\n- Lola Tung is Belly, the protagonist\n- Christopher Briney is Conrad Fisher, Belly's first love\n- Gavin Casalegno is Jeremiah Fisher, Conrad's brother and Belly's boyfriend\n- Sean Kaufman is Steven, Belly's brother\n- Rain Spencer is Taylor, Belly's best friend\n- Jackie Chung is Laurel, Belly's mom and Susannah's best friend\nAdditional characters seen over the course of the show include Susannah Fisher (Rachel Blanchard), Cam (David Iacono), Skye (Elsie Fisher), Aunt Julia (Kyra Sedgwick), John Conklin (Colin Ferguson) and Adam Fisher (Tom Everett Scott).\nHow to watch 'The Summer I Turned Pretty' Season 3\nThe first two episodes of \"The Summer I Turned Pretty\" Season 3 will drop on July 16 on Prime Video. In the meantime, you can stream the first and last season, also available on Prime Video, now.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are also available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.\nWill there be a Season 4 of 'The Summer I Turned Pretty?'\nThe short answer is no, but the longer answer is that Han reserves the right to revisit these characters, or this world if she ever felt like there was enough material.\nHan, herself, isn't opposed to telling more stories in the Cousins universe, telling Entertainment Weekly in a recent that she'll \"never say never — I never do.\"\nAmazon Prime Video has noted in its promotional material for the upcoming season, from imagery to the trailer, that Season 3 will be the show's last.\n\"If the story is there, then I'm there,\" Han told EW. \"As a storyteller, you just get hit with inspiration all the time. If I had a really great idea that I was excited by, that I wanted to keep telling the story, and if [the stars] were excited to do it, then I would be so pumped. It really depends on if I feel like there is more story to tell.\"\nTung, who plays Belly, is equally as excited at the thought of working with Han again in the future, whether for a sequel series or revival.\n\"I love working with this group of people and I love working with Jenny,\" Tung told EW. \"I think it's such a privilege to be any part of her cinematic universe, so if I was ever asked, I'm there.\""
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/07/15/summer-i-turned-pretty-season-3/85217613007/",
      "text": "'The Summer I Turned Pretty' Season 3: Premiere date, time, cast, where to watch\nGet ready to be transported back to Cousins for the summer.\nThe third and final season of \"The Summer I Turned Pretty,\" a coming-of-age romantic TV series based on the popular book trilogy by bestselling author Jenny Han, premieres July 16 on Amazon Prime Video.\nThe show, which takes place over many a summer, follows the ongoing love triangle between Belly (Lola Tung) and brothers Conrad (Christopher Briney) and Jeremiah (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\nAt the end of the \"The Summer I Turned Pretty\" Season 2 finale, we see Belly put the past and her feelings for first love Conrad in the rearview as she focuses on her future and her budding relationship with Jeremiah.\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\nBut the past, specifically Conrad, has a habit of reappearing when it's least convenient for Belly, who tries, but might fail, to keep her feelings at bay. Belly is left to make a huge decision, one that will change the course of their lives forever, by the end of the summer.\nHere's what to know about \"The Summer I Turned Pretty\" Season 3, including how to watch.\nWhat happens in Season 3 of 'The Summer I Turned Pretty?'\nWe're not huge fans of spoilers at USA TODAY, but we can say Belly will choose someone to give her love to by the end of the summer. (Hint: You can always read the books, specifically the third book, if you're desperate to know how things will end.)\nThe new season picks up with Belly, who is looking forward to another summer in Cousins with Jeremiah after her junior year of college. (Everyone, including Jeremiah, knows that Conrad still has a place in Belly's heart.)\n\"Her future seems set, until some core-shaking events bring her first love Conrad back into her life,\" according to official logline for Season 3. \"Now on the brink of adulthood, Belly finds herself at a crossroads and must decide which brother has her heart. Summer will never be the same.\"\nWhile Belly's decision is the focus of Season 3, other character arcs like that of Taylor and Steven will also have their moment in the spotlight.\nWhat time does 'The Summer I Turned Pretty' Season 3 come out?\nThe third and final season of \"The Summer I Turned Pretty\" premieres Wednesday, July 16 at 12:00 a.m. PT / 3 a.m. ET on Prime Video.\n'The Summer I Turned Pretty' Season 3 episode schedule\nThe first two episodes of TSITP Season 3 will be available to stream on premiere day. The remaining episodes, unlike the previous seasons, will be released weekly on Wednesdays.\nHere's the full schedule:\n- Episodes 1-2 release Wednesday, July 16\n- Episode 3 release Wednesday, July 23\n- Episode 4 release Wednesday, July 30\n- Episode 5 release Wednesday, Aug. 6\n- Episode 6 release Wednesday, Aug. 13\n- Episode 7 release Wednesday, Aug. 20\n- Episode 8 release Wednesday, Aug. 27\n- Episode 9 release Wednesday, Sept. 3\n- Episode 10 release Wednesday, Sept. 10\n- Episode 11 (Finale) airs Wednesday, Sept. 17\nHow to watch 'The Summer I Turned Pretty' Season 3\nThe first two episodes of \"The Summer I Turned Pretty\" Season 3 will drop on July 16 on Prime Video. In the meantime, you can stream the first and last season, also available on Prime Video, now.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.\n'The Summer I Turned Pretty' Season 3 cast\nIt's not summer without Belly or the boys, including Steven, of course. Cast members include:\n- Lola Tung as Belly, the protagonist\n- Christopher Briney as Conrad Fisher, Belly's first love\n- Gavin Casalegno as Jeremiah Fisher, Conrad's brother and Belly's boyfriend\n- Sean Kaufman as Steven, Belly's brother\n- Rain Spencer as Taylor, Belly's BFF\n- Jackie Chung as Laurel, Belly's mom and Susannah's best friend\nAdditional characters seen over the course of the show include Susannah Fisher (Rachel Blanchard), Cam (David Iacono), Skye (Elsie Fisher), Aunt Julia (Kyra Sedgwick), John Conklin (Colin Ferguson) and Adam Fisher (Tom Everett Scott).\nWatch 'The Summer I Turned Pretty' Season 3 trailer\nWe occasionally recommend interesting products and services. If you make a purchase by clicking one of the links, we may earn an affiliate fee. USA TODAY Network newsrooms operate independently, and this doesn’t influence our coverage.\nThis story was updated to add new information."
    },
    {
      "url": "https://www.aboutamazon.com/news/retail/amazon-prime-access-discounted-membership",
      "text": "Prime’s mission is to bring the best of shopping and entertainment to all customers, regardless of income. That’s why we created Prime Access, a discounted membership for qualifying government assistance recipients and income-verified customers that is half of the cost of a regular Prime membership. Prime is savings, convenience, and entertainment, all in a single membership. Learn more about the program below and the easy way to sign up.\nHow do I join Prime Access?\nWith Prime Access, eligible members can pay just $6.99/month (normally $14.99/month) for a Prime membership.\nTo sign up, visit the Prime Access page. You’ll be directed to verify your income or upload a document confirming your eligibility to a selected government assistance program. Once you enter your payment and billing information, you’re all set to start enjoying Prime benefits every day.\nIf you're already a Prime member, you can also update your membership to Prime Access by visiting the Prime Access page and uploading your eligibility verification.\nNew Prime members receive a free 30-day trial before the $6.99 monthly charge begins.\nAs a government assistance recipient, which programs are eligible for Prime Access?\nYou can provide proof of eligibility or participation from the following programs:\n- SNAP EBT\n- Medicaid\n- Woman, Infants, and Children Program (WIC)\n- Supplemental Security Income (SSI)\n- Direct Express Debit Card (DE)\n- Temporary Assistance for Needy Families (TANF)\n- National School Lunch Program (NSLP)\n- Low Income Home Energy Assistance Program (LIHEAP)\n- Tribal Assistance Eligibility Letter (TTANF)\n- Nutrition Assistance Program (NAP)\nWhat is Prime Access?\nOther than the discounted monthly price, Prime Access gets you the exact same incredible benefits of a regular Prime membership, like Prime Video entertainment and low prices on medications from Amazon Pharmacy.\nCan you share Prime benefits with family members?\nYes! You can share free Prime delivery, free digital content, and more through Amazon Household. Learn more about how Amazon Household works.\nHow long does eligibility for Prime Access last?\nIn order to keep your Access membership, you must reverify your eligibility every 12 months. Don’t worry, we’ll send you a reminder email when it’s time to reverify your info.\nCan you cancel your Prime Access membership at any time?\nYes, cancel your Prime Access membership at any time by visiting your account and updating your membership preferences.\nWhat are other ways Amazon is helping customers save money?\nAmazon offers SNAP EBT-eligible groceries, discounts on prescription medications, a discounted Prime membership for young adults, and more. Check out the Amazon Access resource page, where you can find all the programs and features that make it easier to shop at Amazon. Visit Amazon Access and learn more about Amazon Access.\nTrending news and stories"
    },
    {
      "url": "https://www.usatoday.com/story/life/health-wellness/2025/07/23/the-summer-i-turned-pretty-phenomenon/85323290007/",
      "text": "The cult of 'The Summer I Turned Pretty', explained\nBreanna Quigley thought of everything.\nFor her watch party last week for the debut of \"The Summer I Turned Pretty\" Season 3, the 24-year-old in Charlotte, North Carolina, had custom cookies, matching pool floats, a popcorn machine, a custom painted banner, a big speaker, seashell place mats, a fish net table runner, blue hydrangeas ... the list goes on.\nEach item was a reference to the show about a love triangle between Belly Conklin (Lola Tung) and brothers Conrad Fisher (Christopher Briney) and Jeremiah Fisher (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\nBlue water appeared on Quigley's blow-up TV screen as she and her friends watched from her pool, chimes sounding as the opening credits played like a call to worship for the devout fans of Jenny Han's fan-favorite novels-turned-Amazon Prime Video series.\nQuigley, who dropped $350 on her event, is among many fans gathering at one another's homes and public venues weekly to enjoy the guilty pleasure of watching Belly navigate her love for two boys she's known her whole life – and that each present a different future for her.\nThe watch parties are pure sun-soaked indulgence for viewers who know deep in their souls whether they're Team Jeremiah or Team Conrad – and are ready to present a thesis as to why. Series creators even issued a foreboding warning imploring fans to refrain from online harassment as the angst of the season plays out.\n\"I think the show has such a following because of how it makes you feel,\" Quigley said. \"Everyone loves summer romance and I feel a lot of people can relate and love to see Belly choose between brothers. It’s funny because the show can be pretty cringey but it’s cute.\"\nEmphasis on the cringe. Some viewers are really embarrassed about the degree of investment they have in Season 3, despite watching these young lovers through their fingers.\n\"I'm one episode in and already cringing and very uncomfy,\" posted one audience member.\nWhen Belly and Jeremiah middle-school-style slow dance to \"Dilemma\" by Kelly Rowland and Nelly at a college frat party, one viewer physically twinged with second-hand shudders. Fans' significant others are watching from the other room, stunned and bewildered by the dynamics of a girl who loves two siblings. Bearing witness to the \"icks\" on screen are a test of endurance.\nBut why do we watch anyway, and get so invested? It reminds us so much of our own loves, the ones we lost or never had, according to Alicia M. Walker, professor of sociology at Missouri State University.\n\"Maybe we're cringing, but we might be a bit jealous, too,\" Walker said.\nWho wouldn't want to experience love for the first time against the lustful backdrop of fictional Cousins Beach, an idyllic East Coast town, Walker said. The raw unabashed relationships on screen, while we recoil, may remind viewers of any age of the significant impact of being chosen for simply being yourself, Walker said.\n\"The show doesn't just depict first love, it restores its emotional weight,\" Walker said. \"The show almost doesn't feel like fiction, it feels like memory.\"\nThe cult of \"TSITP\" is especially powerful because its ethos juxtaposes our cultural zeitgeist, one deprived of connection and defined by division, she said. We want something we can all gather around right now and root for, awkwardness included, she said.\n\"It ends up being emotional comfort food during this time,\" Walker said. \"The cult following around the show really shows how starved we are for something that we can feel, not just watch. The characters become avatars for our own longing, heartbreak, hopefulness and grief ... Whether you're 17 or 57, that hunger for connection, clarity and care is real and this show feeds that.\""
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/books/2025/07/19/summer-i-turned-pretty-book-ending/85275509007/",
      "text": "Conrad or Jeremiah? How 'The Summer I Turned Pretty' books end\nSpoiler alert! We're discussing details from Season 3 of Prime Video's \"The Summer I Turned Pretty.\" Stop reading now if you haven't seen it yet and don't want to know.\nWho does Belly end up with? You're about to find out.\nSince the July 16 premiere of \"The Summer I Turned Pretty,\" a coming-of-age romantic TV series based on the beloved book trilogy of the same name, viewers are dying to know which Fisher is endgame.\nWill Belly (Lola Tung) stick with best friend and now fiancé Jeremiah (Gavin Casalegno), or risk everything, including her heart, for first love Conrad (Christopher Briney)?\nThe answer, unknown to those who haven't read the books, was revealed at the end of \"We'll Always Have Summer,\" the last book set in \"The Summer I Turned Pretty\" universe.\n\"I think I always knew I would be Belly Fisher one day,\" bestselling author Jenny Han writes in \"We'll Always Have Summer.\" \"I just didn't know it was going to happen like this.\"\nAnd she does make a choice, one that changes her present and her future forever. If you want to know which Fisher Belly chooses, read on.\nHere's how it ends.\nWhat is 'The Summer I Turned Pretty' about?\n\"The Summer I Turned Pretty,\" at its core, is a story about \"first love, first heartbreak, and the magic of that one perfect summer.\" The show, in its third and final season, made its debut on Amazon Prime Video on July 16.\nThe story itself, which takes place over many a summer, hinges on a love triangle between Belly Conklin and brothers Conrad Fisher and Jeremiah Fisher as they navigate life, growing pains and one immeasurable loss.\nThe trio also happens to be childhood friends, the kind who have spent summer breaks together at the same place for as long as they can remember. Now, they're all grown up.\nBelly, who has just wrapped her junior year at Finch College, is feeling good about her future. She has found a friend in Anika, is still close with Taylor and has Jere by her side, just like she wanted.\nBut when \"core-shaking events\" bring first love Conrad back into her life, she finds herself at a crossroads.\n\"(Belly) must decide which brother has her heart,\" the show's official logline reads. \"Summer will never be the same…\"\nWho does Belly end up with?\nBelly doesn't choose Jeremiah or Conrad because in the end, she chooses herself.\nJeremiah and Belly do not stay together, or (ever) end up having a beach wedding in Cousins. Jere goes back to live at the fraternity house, and Belly lives with Anika in her sophomore year at Finch University. (FYI: Belly is a little older in the show than she is in \"We'll Always Have Summer.\")\nBelly spends her junior year studying abroad in Spain, where she has \"lots and lots of adventures.\" Spain is also the place she hears from Conrad for the first time, following his spontaneous declaration and tearful goodbye in Cousins.\n\"Spain is where I got my first letter from him,\" Han writes. \"Real letters, written by his hand, not e-mails. I didn't write him back, not at first, but they still came, once a month, every month. The first time I saw him again, it was another year, at my college graduation. And I just knew.\"\nAnd Belly does, just like Susannah hopes, end up with a young man, whose last name is Fisher.\n\"This is our start,\" Han writes. \"This is the moment it becomes real. We are married. We are infinite. Me and Conrad. The first boy I ever slow danced with, ever cried over. Ever loved.\"\n'The Summer I Turned Pretty' cast\nIt's not summer without Belly or the boys, including Steven, of course.\n- Lola Tung is Belly Conklin, the protagonist\n- Christopher Briney is Conrad Fisher, Belly's first love and Susannah's son\n- Gavin Casalegno is Jeremiah Fisher, Conrad's brother, Belly boyfriend-turned-fiancé and Susannah's son\n- Sean Kaufman is Steven Conklin, Belly's brother\n- Rain Spencer is Taylor Jewel, Belly's best friend\n- Jackie Chung is Laurel Conklin, Belly's mom and Susannah's best friend\nAdditional characters include Lucinda Jewel (Kristen Connolly), John Conklin (Colin Ferguson), Anika (Sofia Bryant), Agnes (Zoé De Grand Maison), Redbird (Tanner Zagarino), Denise (Isabella Briggs) and Lacie (Lily Donoghue) among others.\nHow to watch 'The Summer I Turned Pretty'\nPrevious seasons of \"The Summer I Turned Pretty,\" including the first two episodes from Season 3, are available to stream on Prime Video.\n\"TSITP\" Season 3 premiered on Wednesday, July 16. New Season 3 episodes will drop every Wednesday at 3 a.m. ET/midnight PT on Prime Video through the Sept. 17 finale episode.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.\nOur team of savvy editors independently handpicks all recommendations. If you purchase through our links, the USA Today Network may earn a commission. Prices were accurate at the time of publication but may change."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/07/16/the-summer-i-turned-pretty-season-3-cast/85247556007/",
      "text": "Who stars in 'The Summer I Turned Pretty' Season 3? Meet the cast\nSeason 3 of \"The Summer I Turned Pretty\" is officially here.\nThe third and final season of the coming-of-age romantic television series, based on the popular book trilogy by bestselling author Jenny Han, made its debut on Amazon Prime Video on July 16, nearly two years after the Season 2 finale episode aired.\nThe show, which charts the ongoing love triangle between Belly (Lola Tung) and brother Conrad (Christopher Briney) and Jeremiah (Gavin Casalegno) over the course of multiple summers, will culminate in a decision that will forever change the trajectory of their lives.\nThis season, Belly is all grown up, having settled into a pretty comfortable life with Jeremiah, who she chose to be with at the end of last season, by her side.\nBut first love Conrad and her feelings for him have a way of sneaking up on her when she least expects it.\nBelly has a choice to make and with the release of each new episode, viewers are one step closer to learning which Fisher she'll end up with. You might be itching to know more about the actors who brought your favorite characters to life after the \"TSITP\" Season 3 premiere.\nHere's what we know about them.\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\nLola Tung is Belly\nBelly (Lola Tung) is the young woman caught in a love triangle with her two childhood best friends who happen to be brothers.\nShe's Jeremiah's best friend and girlfriend, Conrad's first love, Steven's younger sister and best friends to Anika and Taylor. Belly is currently a junior at Finch College.\nMore on Lola Tung:\n- Age: 22\n- Zodiac sign: Scorpio\n- Also known for: \"Hadestown\" and \"Forbidden Fruits\"\nChristopher Briney is Conrad\nConrad (Christoper Briney) is Belly's first love, Jeremiah's older brother and Susannah's son. Conrad is currently studying medicine at Stanford University.\nMore on Christopher Briney:\n- Age: 27\n- Zodiac sign: Aries\n- Also known for: \"Mean Girls\" (2024), \"Daliland,\" \"Want This,\" and \"Under the Covers\"\nGavin Casalegno is Jeremiah\nJeremiah (Gavin Casalegno), or Jere, is Belly's best friend and boyfriends, best friends to Steven, Conrad's younger brother and Susannah's son. Jeremiah is a senior at Finch College.\nMore on Gavin Casalegno:\n- Age: 25\n- Zodiac sign: Virgo\n- Also known for: \"Queen of the Ring,\" \"Walker,\" \"The Unhealer,\" \"Nine Seconds,\" \"Vampire Diaries,\" and \"When the Game Stands Tall\"\nRain Spencer is Taylor\nTaylor (Rain Spencer) is Belly's best friend and is in a situationship with Steven, Belly's older brother.\nTaylor was briefly #TeamConrad but is now #TeamJeremiah. Taylor is a junior at Finch, just like Belly.\nMore on Rain Spencer:\n- Age: 25\n- Zodiac sign: Pisces\n- Also known for: \"Test Screening,\" \"Good Girl Jane,\" and \"A Better Paradise Volume One: An Aftermath\"\nSean Kaufman is Steven\nSteven (Sean Kaufman) is Belly's older brother, best friend to Conrad and Jeremiah and is in a situationship with Taylor.\nHe has always been #TeamConrad.\nMore on Sean Kaufman:\n- Age: 25\n- Zodiac sign: Cancer\n- Also known for: \"FBI: Most Wanted,\" \"Walker,\" \"Fire Burning,\" \"Manifest,\" and \"Law & Order: SVU\"\nOther 'The Summer I Turned Pretty' characters\n- Jackie Chung is Laurel, Belly and Steven's mom\n- Colin Ferguson is John, Belly and Steven's dad\n- Kristen Connolly is Lucinda Jewel, Taylor's mom\n- Sofia Bryant is Anika, Belly's best friend\n- Zoé De Grand Maison is Agnes, Conrad's friend\n- Tanner Zagarino is Redbird, Jeremiah's friend\n- Isabella Briggs is Denise, Steven's coworker\n- Lily Donoghue is Lacie, girl who hooks up with Jeremiah\nHow to watch 'The Summer I Turned Pretty' Season 3\nSeason 3 of \"The Summer I Turned Pretty,\" specifically the first two episodes, premiered on Prime Video July 16.\nAnd new episodes will drop every Wednesday at 3 a.m. ET / 12 a.m. PT on Prime Video through the Sept. 17 finale episode. Check out the episode release schedule here.\nIf you're in urgent need of a rewatch before you binge watch the first two episodes \"TSITP\" Season 3, Prime Video's got you covered. The first and second season of \"The Summer I Turned Pretty\" are available to stream on Prime Video, now.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.\nThis story was updated to add additional information and include photographs."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/07/29/the-summer-i-turned-pretty-season-3/85428100007/",
      "text": "What time does 'The Summer I Turned Pretty' Episode 4 come out? Where to watch Season 3\n\"The Summer I Turned Pretty\" is back for Episode 4.\nThe show, in its third and final season, has a quickly become a fan favorite, with viewers anxious (but excited) to learn which Fisher brother will win Belly's heart once and for all.\nThe story, at its core, is a tale about \"first love, first heartbreak, and the magic of that one perfect summer\" and was based on the beloved book trilogy (of the same name) by bestselling author Jenny Han.\n\"The Summer I Turned Pretty,\" which premiered July 16 on Amazon Prime Video, hinges on a love triangle between Belly Conklin (Lola Tung) and brothers Conrad Fisher (Christopher Briney) and Jeremiah Fisher (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\n\"(Belly) must decide which brother has her heart,\" the show's official logline reads. \"Summer will never be the same…\"\nWith Season 3 of the show officially underway, viewers are not only dying to know which Fisher is endgame, they also want to know when, including what day and what time, new episodes will be released.\nHere's where and how to watch the new \"The Summer I Turned Pretty\" Season 3 episode.\nWhat time does the next 'Summer I Turned Pretty' episode come out?\nEpisode 4 of \"The Summer I Turned Pretty\" Season 3 premieres Wednesday, July 30 at 3 a.m. ET / midnight PT on Prime Video. New episodes drop weekly, on Wednesdays, through the Sept. 17 finale.\nHere's the full remaining schedule:\n- Episode 4: Wednesday, July 30\n- Episode 5: Wednesday, Aug. 6\n- Episode 6: Wednesday, Aug. 13\n- Episode 7: Wednesday, Aug. 20\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nWhere to watch 'The Summer I Turned Pretty'\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show and the first few episodes from Season 3 are also available to watch on the streaming platform.\n\"TSITP\" Season 3 premiered on Wednesday, July 16. New episodes drop every Wednesday at 3 a.m. ET/ midnight PT on Prime Video through the Sept. 17 finale episode.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/08/19/the-summer-i-turned-pretty-season-3/85710030007/",
      "text": "When does Episode 7 of 'The Summer I Turned Pretty' come out? How to watch\nBetween two love triangles and a wedding, things are heating up on \"The Summer I Turned Pretty.\"\nWith less than five episodes until the finale, viewers are eager to discover what the future holds for Belly (Lola Tung), and more specifically, which Fisher brother she'll end up with.\nAfter an unsuccessful and rather bleak apartment hunt, the \"happy\" couple went their separate ways, with Jere (Gavin Casalegno) off on a shopping spree and Belly at her bridal shower. (Belly and Conrad also share a rather steamy moment later in the episode, fyi.)\nThe Amazon Prime Original Series, now in its third and final season, hinges on a love triangle between Belly and the Fisher brothers Conrad and Jeremiah, as they navigate life, growing pains and one immeasurable loss.\n\"(Belly) must decide which brother has her heart,\" the show's official logline reads. \"Summer will never be the same…\"\nBased on the beloved book trilogy (of the same name) by bestselling author Jenny Han, \"The Summer I Turned Pretty\" is a TV adaptation that depicts \"first love, first heartbreak, and the magic of that one perfect summer.\"\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\nHere's how to watch, including where to stream Episode 7.\nWhen is the next episode of 'The Summer I Turned Pretty' coming out?\nEpisode 7 of \"The Summer I Turned Pretty\" premieres Aug. 20 at 3 a.m. ET/midnight PT on Prime Video.\nWhat days does 'The Summer I Turned Pretty' come out?\nNew episodes of \"The Summer I Turned Pretty\" are released weekly, on Wednesdays through the finale on Sept. 17.\nHow many seasons of 'The Summer I Turned Pretty' are there?\nThree. (There are also three \"Summer I Turned Pretty\" books.)\n'The Summer I Turned Pretty' episode release dates\nAfter this week's episode drops, there are only four more \"The Summer I Turned Pretty\" episodes left.\nHere are the release dates for (the rest of) Season 3:\n- Episode 7: Wednesday, Aug. 20\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nWhere to stream 'The Summer I Turned Pretty'\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show, as well as the first six episodes from Season 3, are also available to watch on the streaming platform.\n\"TSITP\" Season 3 premiered on Wednesday, July 16, and will end on Wednesday, Sept. 17, after an 11-episode run.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 per month, or $139 a year if you prefer to pay annually. Discounted membership options are available for young adults and qualifying recipients of government assistance.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/08/12/the-summer-i-turned-pretty-season-3/85614910007/",
      "text": "When is Episode 6 of 'The Summer I Turned Pretty'? Date, time, where to watch Season 3\nAfter a hearty dose of Conrad Fisher's POV, we're back to our regularly scheduled programming.\nViewers are more than ready to learn what the future holds for Belly (Lola Tung), and more specifically, which Fisher brother she'll end up with at the end of \"The Summer I Turned Pretty.\"\nLast week we saw Belly run wedding errands with Conrad (Christopher Briney) in Cousins while Jeremiah (Gavin Casalegno) worked overtime to get his dad on board in Boston. Steven and coworker Denise, unbeknownst to Taylor, also shared a moment while on a train ride to NYC.\nThe Amazon Prime Original Series, which is in its third and final season, hinges on a love triangle between Belly and brothers Conrad Fisher and Jeremiah Fisher as they navigate life, growing pains and one immeasurable loss.\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\nThe story, at its core, is a tale about \"first love, first heartbreak, and the magic of that one perfect summer\" and was based on the beloved book trilogy (of the same name) by bestselling author Jenny Han.\n\"(Belly) must decide which brother has her heart,\" the show's official logline reads. \"Summer will never be the same…\"\nHere's how to watch this week's episode.\nWatch The Summer I Turned Pretty on Prime\nWhat day does 'The Summer I Turned Pretty' come out?\nNew episodes of \"The Summer I Turned Pretty\" come out weekly, on Wednesdays, through the Sept. 17 finale.\nWhen does Episode 6 of 'The Summer I Turned Pretty' come out?\nEpisode 6 premieres Aug. 13 at 3 a.m. ET/midnight PT on Prime Video.\n'The Summer I Turned Pretty' release schedule\nAfter this week's episode drops, there are only five episodes left of \"The Summer I Turned Pretty.\"\n- Episode 6: Wednesday, Aug. 13\n- Episode 7: Wednesday, Aug. 20\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nHow to stream 'The Summer I Turned Pretty'\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show and the first five episodes from Season 3 are also available to watch on the streaming platform.\n\"TSITP\" Season 3 premiered on Wednesday, July 16 and will end on Wednesday, Sept. 17 after an 11-episode run.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account."
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/08/26/the-summer-i-turned-pretty-season-3/85822651007/",
      "text": "When does Episode 8 of 'The Summer I Turned Pretty' come out? See Season 3 schedule\nThe end of \"The Summer I Turned Pretty\" is near.\nWith only a handful of episodes until the finale, viewers are more than ready to learn what the future holds for Belly (Lola Tung), and more specifically, which Fisher brother she'll end up with.\nAfter a fun (if messy) bar crawl and an \"unexpected\" confession from Conrad, Belly is feeling more conflicted than ever. To make matters worse, her country club wedding is right around the corner.\nThe Amazon Prime Original Series, now in its third and final season, hinges on a love triangle between Belly and the Fisher brothers Conrad and Jeremiah, as they navigate life, growing pains and one immeasurable loss.\n\"Her [Belly's] future seems set, until some core-shaking events bring her first love Conrad back into her life,\" the show's official logline reads. \"Now on the brink of adulthood, Belly finds herself at a crossroads and must decide which brother has her heart. Summer will never be the same…\"\nBased on the beloved book trilogy (of the same name) by bestselling author Jenny Han, \"The Summer I Turned Pretty\" is a TV adaptation that depicts \"first love, first heartbreak, and the magic of that one perfect summer.\"\nHere's how to watch, including where to stream Episode 8.\nWhen is the next episode of 'The Summer I Turned Pretty' coming out?\nEpisode 8 of \"The Summer I Turned Pretty\" premieres Aug. 27 at 3 a.m. ET/midnight PT on Prime Video.\nWhich days does 'The Summer I Turned Pretty' come out?\nNew episodes of \"The Summer I Turned Pretty\" are released weekly, on Wednesdays.\nHow many seasons of 'The Summer I Turned Pretty' are there?\nThree. (There are also three \"Summer I Turned Pretty\" books.)\n'The Summer I Turned Pretty' episode release dates\nAfter this week's episode drops, there are only three more \"The Summer I Turned Pretty\" episodes left.\nHere are the release dates for (the rest of) Season 3:\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nWhere to stream 'The Summer I Turned Pretty'\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show, as well as the first seven episodes from Season 3, are also available to watch on the streaming platform.\n\"TSITP\" Season 3 premiered on Wednesday, July 16, and will conclude on Wednesday, Sept. 17, after an 11-episode run.\nPrime Video subscriptions are included with an Amazon Prime membership, which start at $14.99 per month, or $139 a year if you prefer to pay annually. Discounted membership options are available for young adults and qualifying recipients of government assistance.\nCustomers may purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account."
    },
    {
      "url": "https://www.usatoday.com/story/shopping/best-streaming-deals-bundles-free-trials/83951337007/?utm_source=usat&utm_medium=content&utm_campaign=spike",
      "text": "What's going on with the Crumbl Cookies co-founder?\nHealth and Wellness\nOver 1,000 killed in landslide in western Sudan village\nWorld\nVietnam celebrates independence day with huge military parade\nWorld\n'Generational change:' Longtime Democratic Rep. Jerry Nadler won't seek reelection\nNation\nIsrael is committing genocide in Gaza, scholars' association says\nWorld\nChina's Xi convenes 'Axis of Upheaval' in Beijing, sidelining Trump\nWorld\nNestlé CEO ousted after allegedly failing to disclose romantic relationship\nMoney\nBelgium to recognize Palestinian state at UN General Assembly\nWorld\nBaby born at Burning Man; mother didn't know she was expecting\nNation\nHiker dies after cows trample couple walking dog in Austrian Alps\nWorld\nOsaka upsets Gauff in US Open: Highlights from Round of 16 match\nUS Open"
    },
    {
      "url": "https://www.aboutamazon.com/news/retail/prime-student-benefits",
      "text": "Key takeaways\n- 18-to-24-year-olds can join the newly enhanced membership for $7.49 a month or $69 per year.\n- Offers include exclusive drops, 5% cash back savings on popular categories for a limited time, and more.\n- Eligible new members can try Prime for Young Adults for six months for $0.\nPrime is savings, convenience, and entertainment, all in one membership. In the U.S., Amazon offers more than 300 million items with free Prime delivery, including tens of millions of the most popular products available with Same Day or One-Day Delivery. And if you’re a young adult ages 18-24, you can enjoy all these benefits (and more) at a discounted rate of just $7.49 a month or $69 per year.\nThat means Prime for Young Adults enjoy the same exact benefits as a regular Prime membership at 50% of the cost, including Prime’s fast, free delivery on a vast selection of products, year-round low prices, access to exclusive deals and events like Prime Day and Prime Big Deal Days, cash back savings on popular categories that members can enjoy for a limited time, game-changing double (sometimes triple!) cash back days, exclusive drops, and more. Prime for Young Adults also get exclusive perks including the all-new everyday 5% cash back on everyone’s favorites, as well as surprise-and-delight experiences.\n“We’re always looking for ways to make the incredible value of Prime more affordable, accessible, and fun,” said Jamil Ghani, worldwide vice president of Amazon Prime. “Whether someone is beginning their first job, moving into their first apartment or college dorm, or taking time to decide what's next, the new Prime for Young Adults membership helps members save money, save time, and make the most of this important life stage.”\n- Everyday cash back savings to level up spending power: Prime for Young Adults members can now earn 5% cash back for a limited time on beauty, apparel, electronics, and personal care purchases—categories that matter most to young adults.\n- Enhanced benefits with every drop: Members will also soon get a line-up of just-for-them exclusive surprise and delight experiences, double or triple cash back boosters on popular brands, and special deals throughout the year.\n- All of Prime, all of the time: Get Amazon’s faster-than-ever, free delivery on tens of millions of items with Same-Day or One-Day Delivery, right to the door. Plus, members get access to a vast collection of high-quality programming to browse and stream via Prime Video, inclusive of award-winning Amazon Originals, premium channels, and live sports.\n- More than just an enhanced shopping experience: Prime for Young Adults brings all entertainment needs together in one place, giving members access to streaming movies, series, live sports, music, books, games, and unlimited photo storage with Amazon Photos. Members get ultimate access to Amazon Originals like Fallout and Reacher on Prime Video, ad-free listening on 100 million songs and podcasts through Amazon Music, thousands of books and comics, and free games with Prime Gaming, including a free Twitch channel subscription.\n- Late-night and everyday cravings, deliciously delivered: Members can indulge by ordering from their favorite guilty-pleasure restaurants with free Grubhub+ as a part of the membership—that’s a $120 annual value—including $0 in delivery fees on eligible orders.\n- Elevated wanderlust: Hitting the road? Every day, Prime members can save $0.10 per gallon when purchasing at more than 7,500 bp, Amoco, and ampm participating locations.\nTry Prime for Young Adults for six months for $0\nEligible Prime for Young Adults members receive a six-month trial for $0, and then just pay $7.49 per month—getting all the benefits of Prime at 50% of the cost, plus exclusive perks designed specifically for young adults. Verification is simple—customers just need to share their driver's license, passport, or identity card to confirm their age. Higher-education students enrolled in a two- or four-year college can sign up by sharing their .edu email address. Learn more at amazon.com/youngadult.\nTrending news and stories"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/07/17/summer-i-turned-pretty-season-3-episode-schedule/85261779007/",
      "text": "When do new episodes of 'The Summer I Turned Pretty' come out? See Season 3 schedule\nThe last installment of \"The Summer I Turned Pretty,\" a coming-of-age romantic television series based on the popular book trilogy by bestselling author Jenny Han, made its debut on Amazon Prime Video July 16. The story, at its core, is about \"first love, first heartbreak, and the magic of that one perfect summer.\"\nAnd the show, in its third and final season, hinges on a love triangle between Belly (Lola Tung) and brothers Conrad (Christopher Briney) and Jeremiah (Gavin Casalegno) that takes place over the course of multiple summers.\nBelly is all grown up this season, having settled into a pretty comfortable life with Jeremiah, who she chose to be with at the end of last season, by her side. But first love Conrad and her feelings for him have a way of sneaking up on her when she least expects it and often, at the worst time.\nBelly has a choice to make by the end of the summer and with the release of each new episode, audiences are one step closer to learning which Fisher she ends up with. But in order to get the full picture, you'll have to tune in.\nHere's when new \"Summer I Turned Pretty\" Season 3 episodes will drop.\nWatch The Summer I Turned Pretty on Prime Video\nWhen do new 'Summer I Turned Pretty' episodes come out?\nNew \"Summer I Turned Pretty\" episodes drop Wednesdays at 3 a.m. ET / 12 a.m. PT on Prime Video.\nNeed a break? Play the USA TODAY Daily Crossword Puzzle.\n'The Summer I Turned Pretty' Season 3 episode schedule\nThe third and final season of \"The Summer I Turned Pretty\" premiered July 16 on Prime Video.\nThe show announced last month that the rest of the Season 3 episodes, unlike previous seasons, will be released weekly on Wednesdays at 3 a.m. ET / 12 a.m. PT.\nHere's the full schedule:\n- Episode 3: Wednesday, July 23\n- Episode 4: Wednesday, July 30\n- Episode 5: Wednesday, Aug. 6\n- Episode 6: Wednesday, Aug. 13\n- Episode 7: Wednesday, Aug. 20\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nHow to watch 'The Summer I Turned Pretty' Season 3\nSeason 3 of \"The Summer I Turned Pretty,\" specifically the first two episodes, premiered on Prime Video July 16.\nAnd new episodes will drop every Wednesday at 3 a.m. ET / 12 a.m. PT on Prime Video through the Sept. 17 finale episode.\nIf you're in urgent need of a rewatch before you binge the first two episodes \"TSITP\" Season 3, Prime Video's got you covered. The first and second season of \"The Summer I Turned Pretty\" are available to stream on Prime Video, now.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account.\nWatch The Summer I Turned Pretty on Prime Video"
    },
    {
      "url": "https://www.aboutamazon.com/news/retail/is-cost-of-prime-membership-worth-it",
      "text": "Prime saves members money every day with exclusive deals, fast, free delivery, prescription savings, and quality entertainment. If you’re still considering whether the cost of a Prime membership would be worth it for you, we’re here to help you decide.\nGo through the following questions—if you answer “yes” for most or all, Prime might be exactly what you’re looking for. We’ve included information about the cost of a Prime membership—and how to join—below, including information on discounted memberships.\nDo you like fast, free delivery when you shop online?\nAre you the type of person who clicks “order” and then cannot wait for your package to arrive? Perhaps you find yourself frequently needing to order birthday or holiday gifts, pantry essentials, or household items you’re running low on last minute. If you’re nodding along, you’ll definitely enjoy this noteworthy perk to get your money’s worth.\nOne of Prime’s most notable benefits is the fast, free delivery. There are more than 300 million items eligible for free Prime shipping and tens of millions of the most popular items are available with Same-Day or One-Day Delivery. Amazon now offers Same-Day Delivery in more than 110 U.S. metro areas from San Francisco, Boston, and Atlanta to Cedar Rapids, Daytona Beach, and Baton Rouge. If you’re looking to schedule your Amazon deliveries on a specific day, you can use the free Prime member perk, Amazon Day. On top of making deliveries work for your personal schedule, choosing Amazon Day is a great way to combine multiple orders into one delivery, potentially reducing the amount of packaging you receive.\nDo you like saving money?\nLet’s be real, no one is saying “no” to this question.\nPrime members get access to special deals, every day. Prime members also get 30-minute early access to Lightning Deals as well as exclusive access to savings during shopping events like Prime Day; in 2023 Prime members worldwide purchased more than 375 million items and saved more than $2.5 billion for Prime Day.\nPrime members also save big on items like prescriptions. RxPass from Amazon Pharmacy allows members to get their eligible medications for one low price of $5 per month. This can add up to serious savings for members on multiple eligible medications. Amazon Pharmacy is making the pharmacy experience better—with upfront pricing, free home delivery, and pharmacists available 24/7. Prime members also get high-quality, convenient care from One Medical, including 24/7 on-demand virtual care nationwide and easy to schedule office visits at any of One Medical’s hundreds of locations across the U.S.\nDo you like great entertainment?\nFor music-, film-, podcast-, and television-lovers, don’t forget that a Prime membership gives you access to Prime Video and Amazon Music.\nPrime Video is part of a Prime membership. You’ll be able to watch movies, series, and sports, including Thursday Night Football. Enjoy Emmy winner The Marvelous Mrs. Maisel, Emmy-nominated satirical superhero drama The Boys, Emmy-nominated fan-favorite miniseries Daisy Jones & The Six, and the smash hits AIR, , Citadel, Tom Clancy’s Jack Ryan, Creed III, Shotgun Wedding, The Tomorrow War, Reacher, The Summer I Turned Pretty, and Coming 2 America. There are also plenty of selections to rent or buy like Barbie and Oppenheimer.\nAmazon Music includes 100 million songs ad-free, the largest catalog of ad-free top podcasts, and thousands of playlists and Stations, included with Prime at no additional cost. You can shuffle play any artist, album, or Playlist from our expanded music catalog and discover new music based on your likes. Non-Prime members can join Amazon Music Unlimited at a savings for $9.99 per month for a monthly subscription or $99 per year for an annual subscription. It gives you access to Amazon’s complete catalog of 100 million songs and podcasts, all ad-free. With this plan, you can pick and play any song, and you have unlimited skips when listening to stations.\nDo you enjoy ordering food for delivery (but don’t love the delivery fees)?\nIf you love to order in, but don’t love paying delivery fees, you’re in luck. Prime members can enjoy free Grubhub+—a $120 value per year—included with their membership on an ongoing basis. Grubhub+ includes $0 delivery fees on eligible orders over $12, lower service fees, 5% credit back on pick-up orders, and exclusive offers. On average, Prime members save $300 per year on delivery fees and promotions with Grubhub+.\nSo, is a Prime membership right for you?\nIf you said yes to the questions above, we think that a Prime membership will serve you well. There are also tons of other perks and benefits that might make a membership worth it, so we encourage you to learn more about what Prime has to offer.\nHow much does Prime cost?\nA Prime membership is $14.99 per month, or $139 per year if you pay annually—but Amazon also offers several discounted membership options with the same valuable benefits including fast, free delivery on millions of items, exclusive perks, and savings for eligible members.\nPrime Access is just $6.99 per month for qualifying government assistance recipients, including SNAP EBT and Medicaid. Prime Student—another discounted membership—is $7.49 per month or $69 per year for members enrolled in two or four-year colleges that includes additional exclusive perks specifically for students.\nGet more information about Prime, including the lesser-known perks, and more information about discounted memberships—and sign up or start a free trial today.\nTrending news and stories"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/tv/2025/08/05/summer-i-turned-pretty-season-3/85511403007/",
      "text": "When does Episode 5 of 'The Summer I Turned Pretty' come out? How to watch Season 3\nSeason 3 of \"The Summer I Turned Pretty\" will be halfway over after this week's new episode.\nWith only a handful of episodes left, viewers are more than ready to learn what's in store for Belly (Lola Tung), more specifically, which Fisher brother she'll end up with. Viewers are also excited to see how Steven's on-again, off-again relationship with Taylor will unfold.\nThe Amazon Prime Original Series, which is in its third and final season, hinges on a love triangle between Belly Conklin and brothers Conrad Fisher (Christopher Briney) and Jeremiah Fisher (Gavin Casalegno) as they navigate life, growing pains and one immeasurable loss.\n\"(Belly) must decide which brother has her heart,\" the show's official logline reads. \"Summer will never be the same…\"\nThe story, at its core, is a tale about \"first love, first heartbreak, and the magic of that one perfect summer\" and was based on the beloved book trilogy (of the same name) by bestselling author Jenny Han.\nHere's what to know, including episode release dates \"The Summer I Turned Pretty\" Season 3 and how to watch Episode 5.\nWhat day does 'The Summer I Turned Pretty' come out?\nNew \"The Summer I Turned Pretty\" episodes come out weekly, on Wednesdays, through the Sept. 17 finale.\nWhat time does Episode 5 of 'The Summer I Turned Pretty' Season 3 come out?\nEpisode 5 premieres Aug. 6 at 3 a.m. ET / midnight PT on Prime Video.\n'The Summer I Turned Pretty' Season 3 release schedule\n- Episode 5: Wednesday, Aug. 6\n- Episode 6: Wednesday, Aug. 13\n- Episode 7: Wednesday, Aug. 20\n- Episode 8: Wednesday, Aug. 27\n- Episode 9: Wednesday, Sept. 3\n- Episode 10: Wednesday, Sept. 10\n- Episode 11 (finale): Wednesday, Sept. 17\nWhen does the last episode of 'The Summer I Turned Pretty' Season 3 come out?\nThe last episode a.k.a. the finale comes out Wednesday, Sept. 17.\nWhere is 'The Summer I Turned Pretty' streaming?\n\"The Summer I Turned Pretty\" is on Prime Video now. Previous seasons of the show and the first four episodes from Season 3 are also available to watch on the streaming platform.\n\"TSITP\" Season 3 premiered on Wednesday, July 16 and will end on Wednesday, Sept. 17 after an 11-episode run.\nPrime Video subscriptions are included with an Amazon Prime membership, which starts at $14.99 a month, or $139 a year if you prefer to pay annually. Discounted membership options for young adults and qualifying government-assistance recipients are available.\nCustomers can purchase or rent a selection of media titles from Prime Video without having an Amazon Prime or Prime Video account."
    }
  ],
  "argos_summary": "The article details the release schedule for Season 3 of Amazon Prime’s \"The Summer I Turned Pretty,\" noting that Episode 9 airs on Wednesday, September 3 at 3 a.m. ET/12 a.m. PT and the series concludes with Episode 11 on September 17. It explains that new episodes drop weekly on Wednesdays and are available to stream on Prime Video, with the first two episodes released on the premiere date of July 16. The piece also highlights the show’s finality and provides information on how to watch the remaining episodes.",
  "argos_id": "7VUOZQPSY"
}