{
  "url": "https://www.forbes.com/sites/tomsanderson/2025/09/02/fans-of-fc-barcelona-wouldnt-have-forgiven-fermin-chelsea-sale/",
  "authorsByline": "Tom Sanderson",
  "articleId": "f595de90802e4d8bac5a0117009eaab0",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b6defe92354f0411a1f6d5/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T12:46:37+00:00",
  "addDate": "2025-09-02T12:55:51.351318+00:00",
  "refreshDate": "2025-09-02T12:55:51.351319+00:00",
  "score": 1.0,
  "title": "Fans Of FC Barcelona Wouldn’t Have Forgiven Fermin Chelsea Sale",
  "description": "FC Barcelona fans would have never forgiven the board for selling Fermin Lopez to Chelsea had the move come to fruition.",
  "content": "As we now know for sure given the closure of the European summer transfer window, FC Barcelona midfielder Fermin Lopez will stay put at its boyhood club after numerous reports of a potential move to Premier League giant Chelsea.\n\nHad the switch been realized, however, Culers would have never forgiven the Barca board for offloading a fan favorite.\n\nHow did Fermin become linked with an FC Barcelona exit?\n\nWith Barca still recovering from the economic crisis which thrust it to the brink of oblivion in 2020, and struggling to navigate Financial Fair Play (FFP) or register new players or contracts, offers for some players that aren’t untouchables such as Lamine Yamal and Pedri will always be entertained.\n\nNever a darling in La Masia tipped for big things as the superstar of his age group, Fermin had to work hard to get to where he is today.\n\nLoaned out to fourth tier Linares in 2022, he never looked so far away from the first team and probably thought his days in Blaugrana were numbered upon return.\n\nWhen an impressive temporary spell at his only other professional club besides Barca was done, however, Fermin took advantage of international players turning up to preseason training later than the rest of the group and impressed then-head coach Xavi Hernandez enough to stay with the senior team.\n\nBreaking out impressively in 2023/2024, Fermin was also useful for Xavi’s successor Hansi Flick the following term and an integral part of a treble winning outfit.\n\nBecause of his important goals, intensity and competitive spirit, however, it is unsurprising that the Premier League came calling for him.\n\nWhile Barca is not in the best of shape financially speaking, there is no way it would have accepted a $46.5 million (€40 million) offer according to Fabrizio Romano.\n\nThat comes despite Fermin’s sale being interesting because his sale as an academy product would have presented pure profit.\n\nYet with Gavi out injured and Dani Olmo out of sorts, Flick perhaps didn’t want to lose one of his three CAM choices for good.\n\nMARCA reported that Fermin was intent on staying in Catalonia too, meaning that the soap opera can be tied up - at least until January.\n\nWhy wouldn’t FC Barcelona fans have forgiven the board for selling Fermin?\n\nLoved by Culers for the reasons listed above, Fermin’s hypothetical exit would have angered fans in Catalonia.\n\nHad an offer been too good to refuse, and something around the $100 million mark which Fermin is worth, then perhaps some could understand.\n\nYet arming a European rival, which Barca will face in the Champions League, for a cut rate would be a show of weakness and an acceptance that the La Liga holder no longer sits at the top table of the continental game - at least from a transfer market perspective.\n\nThankfully for all concerned, except the English club in question, Fermin remains an FC Barcelona player who could occupy a starting central attacking midfield berth against Valencia after the international break.",
  "medium": "Article",
  "links": [
    "https://e-noticies.cat/es/futbol/deco-se-cansa-del-drama-fermin-lopez-y-chelsea-lo-que-pide-para-que-lo-fichen",
    "https://www.forbes.com/sites/tomsanderson/2025/07/16/fc-barcelona-ace-lamine-yamal-answers-party-life-critics/",
    "https://www.marca.com/futbol/barcelona/2025/08/30/confesiones-fermin-lopez.html",
    "https://www.forbes.com/sites/tomsanderson/2025/08/01/fc-barcelona-star-gavi-says-of-course-real-madrid-is-worried/",
    "https://www.forbes.com/sites/tomsanderson/2025/01/01/fc-barcelona-could-lose-273-million-in-olmo-registration-debacle/",
    "https://x.com/DAZNFutbol/status/1962608039648768440",
    "https://www.forbes.com/sites/tomsanderson/2025/02/10/this-act-says-everything-about-fc-barcelona-star-pedri/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "FC Barcelona midfielder Fermin Lopez",
      "weight": 0.09606139
    },
    {
      "name": "Fermin Chelsea Sale",
      "weight": 0.09584584
    },
    {
      "name": "Fermin",
      "weight": 0.09317003
    },
    {
      "name": "Fermin Lopez",
      "weight": 0.09272475
    },
    {
      "name": "FC Barcelona fans",
      "weight": 0.078323215
    },
    {
      "name": "FC Barcelona",
      "weight": 0.07277865
    },
    {
      "name": "Premier League giant Chelsea",
      "weight": 0.06739155
    },
    {
      "name": "international players",
      "weight": 0.067258745
    },
    {
      "name": "Premier League",
      "weight": 0.063329324
    },
    {
      "name": "new players",
      "weight": 0.06294809
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.984375
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.98193359375
    }
  ],
  "sentiment": {
    "positive": 0.18522708,
    "negative": 0.36861542,
    "neutral": 0.44615746
  },
  "summary": "FC Barcelona midfielder Fermin Lopez, who has been linked with a potential move to Premier League giant Chelsea, will stay at the club after the European summer transfer window ended. However, fans of FC Barcelona would have never forgiven the club board for selling a fan favorite. The move to Chelsea was not widely anticipated due to Barcelona's financial difficulties and ongoing struggles with Financial Fair Play (FFP) and inability to register new players or contracts. Despite this, Fermin remains an FC Barcelona player and could potentially play a starting central attacking midfield berth against Valencia after the international break.",
  "shortSummary": "FC Barcelona's Fermin Lopez will stay at the club despite speculation linking him to Chelsea, which would have upset fans despite financial struggles.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "06f49cdf8b074084b4fc3472be9cdccd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://e-noticies.cat/es/futbol/deco-se-cansa-del-drama-fermin-lopez-y-chelsea-lo-que-pide-para-que-lo-fichen",
      "text": "Deco se cansa del drama de Fermín López y el Chelsea: Lo que pide para que lo fichen\nEl Barça fija el precio de Fermín López para poder abandonar el Barça\nÚltimos suspiros en el mercado de fichajes y la incertidumbre en el Barça sigue creciendo en ciertos aspectos. Mientras la operación salida se ha ido desencallando con la cesión de Iñaki Peña al Elche y la rescisión del contrato de Oriol Romeu, se podría también dar alguna salida dolorosa. La calidad en la medular del conjunto blaugrana es tan grande que algunos de sus integrantes despiertan mucho interés entre los grandes europeos.\nLa situación económica en Can Barça continúa siendo complicada y una gran venta daría un gran balón de oxígeno a la entidad. Joan Laporta lo sabe y aunque la venta sea dolorosa, es casi imprescindible para la entidad para evitar problemas de tesorería. El principal handicap de Laporta la tiene en el staff técnico donde Flick no es partidario que ningún peso pesado de la plantilla abandone el club.\nEl técnico alemán ya fue muy reticente con la probable salida de Marc Casadó a la Premier cuando el catalán recibió ofertas. Ahora, le toca el turno al andaluz Fermín López que a pesar de no ser titular indiscutible, es muy valorado por Flick. El Chelsea va en serio a por el fichaje de Fermín y el Barça ha fijado el precio de salida del canterano.\nEl Barça fija el precio de salida de Fermín\nLa directiva del Barça, conscientes del gran interés que despierta Fermín en las filas del Chelsea, ha aumentado su precio de salida. El conjunto inglés estaría valorando en hacer llegar una propuesta de fichaje que rondaría los 50 millones de Euros. El Barça, por su parte, ha fijado su precio de salida en 70 millones.\nAunque el mediapunta andaluz no ha contado con demasiados minutos en el inicio liguero, Hansi Flick ha afirmado que quiere a Fermín en la plantilla. De momento, el Barça no se plantea desprenderse del futbolista a no ser que sea el propio Fermín que lo solicite. El jugador tiene contrato hasta 2029 y tiene la última palabra sobre su futuro inmediato.\nEl Chelsea quiere ficharlo\nTal como indicado, la postura del Barça es clara, no pretende forzar la salida del onubense pero si el futbolista quiere salir, su precio queda fijado en 70M. Una cifra millonaria que permitiría de todas, todas que el club regresara a la famosa norma del 1:1 de fair play financiero. El Chelsea ha hecho llegar una oferta al jugador para que la analice y les responda si acepta formar parte de su plantilla.\nLa incertidumbre en la respuesta de Fermín es manifiesta, se mueve entre dos aguas, el amor al Barça y la posibilidad de ser protagonista en un equipo como el Chelsea. Los londinenses le ofrecen un rol protagonista y un salario, que supera con creces, al que recibe en el Barça. Si el jugador acaba aceptando la oferta inglesa, está por ver si los londinenses acaban pagando los 70M que exige el Barça.\nMás noticias:"
    },
    {
      "url": "https://www.forbes.com/sites/tomsanderson/2025/01/01/fc-barcelona-could-lose-273-million-in-olmo-registration-debacle/",
      "text": "FC Barcelona can lose up to $273 million (€263 million) thanks to the debacle surrounding Dani Olmo's registration, or lack thereof, as explained by SPORT.\nBarca received terrible news late on New Year's Eve in Spain, with La Liga releasing a statement detailing that it would not allow the forward to be registered for the rest of the 2024/2025 season as things stand.\n\"La Liga informs that, as of today, December 31, FC Barcelona has not presented any alternative that, in compliance with La Liga's economic control regulations, would allow it to register any player from next January 2,\" the correspondence read.\nThose choosing to remain positive believe that Barca can turn things round by January 3, but pessimism is the general vibe among Culers and the \"entorno\" that engulfs the club.\nOlmo is technically a free agent as things stand. And though his agent Andy Bara said to Fabrizio Romano that the decision made by the player is to \"stay at Barcelona\" while they are \"not considering any other option\", the huge amount of money that Barca would lose if he does end up walking cannot be ignored.\nFirst there is the $50 million (€48 million) Barca is obliged to pay up for the rest of his contract until 2030 - even if the Euro 2024 winner is no longer on its books.\nAdd that to the $57 million (€55 million) it still needs to cough up to his last club RB Leipzig, and the potential, non-existent transfer fee that the Catalans would also forego.\nAccording to German transfer market expert site Transfermarkt, Olmo is currently rated at $62 million (€60 million).\nFurthermore, Barca sold its VIP boxes for the Spotify Camp Nou - still yet to be reopened while a renovation runs past schedule - for ($104 million) €100 million. Yet it is believed that this could have been done for a figure of $208 million (€200 million) instead meaning that an additional ($104 million) €100 million was missed out on.\nThrow this altogether, and we're talking about a roughly huge $273 million (€263 million) sum which a financially-challenged club like Barca really can't afford as a black hole in its accounts."
    },
    {
      "url": "https://www.marca.com/futbol/barcelona/2025/08/30/confesiones-fermin-lopez.html",
      "text": "- Barcelona. Hansi Flick: \"El corazón de Fermín dice Barça\"\n- Barcelona. Confirmado: Gavi, baja contra el Rayo y la selección por la lesión en la rodilla derecha\n\"Estaré feliz cuando finalice el mercado. Es una locura y no sé qué pasará\", reconoció este mediodía Hansi Flick en la rueda de prensa de previa al encuentro contra el Rayo. El técnico alemán se refirió, sobre todo, con este comentario a la posible salida de Fermín López del club culé con rumbo al Chelsea. Pero, en estos momentos, en el Barça sostienen que en todas las comunicaciones y contactos que tienen con el centrocampista de ElCampillo ést\n¿Ya tienes cuenta?\n- Contenido exclusivo\n- Sorteos y experiencias exclusivas\n- Videoanálisis de jornadas\n- Newsletters temáticas\nQuiero seguir leyendo GRATIS\nComentarios"
    },
    {
      "url": "https://www.forbes.com/sites/tomsanderson/2025/07/16/fc-barcelona-ace-lamine-yamal-answers-party-life-critics/",
      "text": "FC Barcelona ace Lamine Yamal answered a question for critics of his partying lifestyle on the day that his contract renewal was made official and that the teenager inherited the number 10 shirt from Ansu Fati.\nThe Ballon d’Or candidate has come under fire recently for his lavish 18th birthday party and other trips to Ibiza and Brazil over Barca’s summer holidays.\nWith Hansi Flick’s men returning to work and starting their preseason campaign on the landmark day for Lamine becoming of adult age, July 13, his contract renewal and inheritance of the number 10 from past greats such as Ronaldinho, Diego Maradona, Rivaldo and Lionel Messi was made official on Wednesday.\nLamine answered questions in Catalan from the Catalan press and others in Spanish, and towards the end of a press conference, he was asked about his activities away from the pitch.\n“At the end of the day I work for Barca, and I play for Barca. And when I’m away from the Ciudad Esportiva (i.e. the Club’s Joan Camper HQ) I enjoy my life and that’s it,” he stated in Spanish.\n“The truth is that both criticism and praise, if they are not from my family or from people very close to me, I am indifferent, because if not, one day I will be very high and another very low,” Lamine also said elsewhere.\nRegarding Messi, who he is often compared to because of their similarities as left-footed La Masia geniuses, Lamine noted how the Argentine “made his way” while vowing to make his own.\n“The 10 comes from Ansu now, so I will try to make all the Culers happy, those who are there (at Camp Nou) and those who are at home,” he promised.\nLamine called Maradona, Ronaldinho and Messi “three legends of football, three legends of this club”.\n“I would keep everything from each of them. I am grateful for the trust of the club, and I will try to continue that legacy,” he added.\nLamine has pressure to live up to past greats at FC Barcelona\nAs Ansu could tell Lamine, there are fewer jerseys heavier than the number 10 at FC Barcelona. Being a first team star is one thing, but doing the shirt justice and living up to the names of those that have gone before him will add extra pressure on a figure that we must remember is still a boy despite having recently become an adult."
    },
    {
      "url": "https://www.forbes.com/sites/tomsanderson/2025/08/01/fc-barcelona-star-gavi-says-of-course-real-madrid-is-worried/",
      "text": "FC Barcelona midfielder Gavi said that \"of course\" bitter rival Real Madrid is \"worried\" about the Catalans, while speaking from a preseason tour of Asia.\nGavi was given the captain’s armband during Thursday’s 7-3 win over Seoul in South Korea, and even got on the scoresheet.\nFor the Andalusian, being the team’s leader was a dream come true and a source of great pride.\n“I’ve always dreamed of being able to wear the Barcelona armband. It is a [source of] pride for me and I feel very motivated every time I wear it. It inspires me more. If at the end of this season I’m not one of the captains, it’s fine. Even though I’ve been in the first team for many years, I’m young and I still have to learn from the veterans. It will come when it is time,” he explained, about being named one of permanent skippers.\nWith Barca bested by Inter Milan in the semifinals of the competition last term, Gavi agreed that winning the Champions League is one of the main goals in this upcoming season.\n“In the end, everyone remembers the Champions League. It’s the most important trophy and hopefully we can be in the final. I am sure and I trust that my team will give everything possible to be there and give us that Champions League that Culers crave so much,” he confidently stated.\nWhile the Champions League is the most coveted team trophy, Lamine Yamal could be awarded the highest individual honor in the sport which is the Ballon d’Or.\n“I hope he wins it. If he doesn’t do it this year, he’s 18 years old and still very young. Being there among the favorites is already something unique. I’m happy for what he’s doing with us,\" Gavi said.\n“He’s an incredible player. Every day is better. In training he is amazing. He has to continue like this, with that mentality, and I'm sure that if he doesn't win the Ballon d'Or this year, he will win many in the future.”\nReal Madrid will be Barca’s main rival domestically. And with Madrid spending heavily to avoid the Catalans lifting all three main trophies in Spain again, Gavi said that “of course” Los Blancos are worried about the Blaugrana.\n“Of course they are worried. It was four out of four [Clasicos we won] and that had never happened in histor. It is logical that they are worried. In the end, we were spectacular last season and they didn’t win anything. This year they have reinforced themselves with very good players to be honest, but we will see what they will do this season. They have a great team but we have to be us and that’s it,” Gavi concluded.\nGavi will once again have a difficult fight for minutes at FC Barcelona\nWith the likes of Dani Olmo and Fermin Lopez his competition for the CAM spot, while Pedri and Frenkie de Jong have the more retreated spots locked down, Gavi once again faces a tough battle for minutes in FC Barcelona’s midfield this season."
    },
    {
      "url": "https://www.forbes.com/sites/tomsanderson/2025/02/10/this-act-says-everything-about-fc-barcelona-star-pedri/",
      "text": "FC Barcelona midfielder Pedri has been praised for a humble act highlighted on social media and by AS.\nThe number 8 was at his mercurial best in Sevilla on Sunday, and once more a protagonist in the 4-1 win that moved the Catalans within two points of bitter rival and La Liga leader Real Madrid which they once trailed by as a many as 10 in the title race.\nAs highlighted by Miquel Blazquez’s popular account on X, formerly known as Twitter, though, a grounded Pedri isn’t letting star status get to his head.\n“Pedri Gonzalez leaves Sevilla’s stadium carrying the suitcase of towels that Barca used for the match,” Blazquez tweeted, to caption a photo of the Spain international in the act.\n“He is not only the best midfielder in the world for his football, but also for his human quality. He neither insults nor provokes, he just plays,” Blazquez added.\nAS said that “the Canary Islander once again showed his great quality not only on the pitch, but also off it” by helping out the kitman, and praised him for his “recital” at the Estadio Ramon Sanchez Pizjuan.\n“His ability to read the game and enable his teammates were two of the reasons why his team ended up scoring on a ground where Barca have not lost since 2015,” the newspaper also offered.\nPost-match, Pedri said that picking up the win “was very important” after a “bump in La Liga”.\n“We wanted to continue with the streak and the top team drew. We had to take the three points,” he explained.\n\"We started very well, with a lot of intensity with the ball, but their goal came and they came back into the match.\n“In the second half we came out on top, we scored and it gave us a lot of momentum. I am left with the fact that, with one less, we knew how to maintain the back line,” Pedri remarked in reference to Fermin Lopez’s red card, while pointing out that “having the ball with one less is also possible”.\nAsked if he is in the best moment of his career, Pedri answered: “Maybe. I’m very comfortable, having a lot of continuity and enjoying myself on the pitch”.\nHe touched on this via an interview before the weekend, and as for Barca, insisted that he and his teammates “have to continue until the end”.\n“The team believes and we are alive in all the competitions,” Pedri concluded."
    }
  ],
  "argos_summary": "FC Barcelona midfielder Fermin Lopez will remain at the club after the summer transfer window closed, sparking speculation that a sale to Chelsea would have angered fans. Lopez, a product of La Masia who broke into the first team under Xavi and Hansi Flick, drew interest from the Premier League club but Barcelona set a €40‑million asking price and declined offers. The club’s financial struggles and the desire to keep a fan favourite in a key attacking midfield role were cited as reasons for keeping him, with the board unlikely to accept a higher bid. Fans would have viewed a transfer to a European rival as a sign of weakness and a threat to Barcelona’s competitive standing.",
  "argos_id": "7VVBYWST7"
}