{
  "url": "https://finance.yahoo.com/news/policybazaar-expands-reinsurance-operations-asia-111129037.html",
  "authorsByline": "GlobalData",
  "articleId": "fad0f2c99e4e4cf997077f9dc5118f6e",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/life_insurance_international_186/ce0af65a16f07fb81cd74b00f95d46e1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T11:11:29+00:00",
  "addDate": "2025-09-02T11:21:04.578715+00:00",
  "refreshDate": "2025-09-02T11:21:04.578717+00:00",
  "score": 1.0,
  "title": "Policybazaar expands reinsurance operations in Asia and Middle East",
  "description": "The services, launched in Sri Lanka, Qatar, Oman and the UAE, aim to bridge capacity gaps in these regions' insurance sectors.",
  "content": "Policybazaar for Business, a business-to-business branch of Policybazaar.com, has initiated its reinsurance services in Sri Lanka, Qatar, Oman and the United Arab Emirates (UAE), according to a press release posted on Zawya.\n\nThe move seeks to bridge capacity gaps in the insurance sectors of these regions by leveraging a technology-centric reinsurance model.\n\nThe reinsurance services are founded on a \"digital-first\" infrastructure that incorporates data analytics, actuarial expertise and experience in insurance distribution.\n\nThe platform is designed to facilitate both facultative and treaty reinsurance solutions, addressing a spectrum of risks including property, marine, liability, cyber and those linked to climate change.\n\nThe expansion is part of the company’s aim to develop a reinsurance network across the Asian and Middle Eastern markets, the report said.\n\nPolicybazaar co-founder Tarun Mathur said: “At Policybazaar for Business, we have built a reinsurance platform with that very premise: a digital-first ecosystem that reduces friction, provides transparency in placements and gives insurers the ability to make faster, better-informed decisions.\n\n“Sri Lanka, Qatar, Oman and the UAE are all markets where insurers are ambitious, where innovation is welcome and where efficiency gaps remain. Our role is to stand shoulder to shoulder with these insurers – helping them transfer risk in a way that is modern, data-led and globally connected. This is not just an entry into four new geographies; it is the start of building a pan-Asian reinsurance network with technology at its core.”\n\nEarlier this month, Policybazaar insurance, a subsidiary of PB Fintech, was fined Rs50m ($570,000) by the Insurance Regulatory and Development Authority of India (IRDAI) for non-compliance with specific regulatory directives.\n\nThis penalty followed an inspection carried out on 1–5 June 2020. In February last year, Policybazaar obtained IRDAI authorisation to function as a composite insurance broker, thereby extending its portfolio to include reinsurance offerings.\n\n\"Policybazaar expands reinsurance operations in Asia and Middle East\" was originally created and published by Life Insurance International, a GlobalData owned brand.\n\n\n\n The information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
  "medium": "Article",
  "links": [
    "https://www.lifeinsuranceinternational.com/news/indian-insurance-regulator-fines-policybazaar/",
    "https://www.lifeinsuranceinternational.com/news/policybazaar-reinsurance-asia-middle-east/",
    "https://www.lifeinsuranceinternational.com/news/policybazaar-composite-insurance-broker-licence/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "reinsurance operations",
      "weight": 0.09261025
    },
    {
      "name": "reinsurance offerings",
      "weight": 0.086793646
    },
    {
      "name": "Policybazaar insurance",
      "weight": 0.08653802
    },
    {
      "name": "Policybazaar co-founder Tarun Mathur",
      "weight": 0.073153906
    },
    {
      "name": "Policybazaar",
      "weight": 0.06757792
    },
    {
      "name": "insurance distribution",
      "weight": 0.063858956
    },
    {
      "name": "Life Insurance International",
      "weight": 0.060401767
    },
    {
      "name": "a pan-Asian reinsurance network",
      "weight": 0.058880646
    },
    {
      "name": "Sri Lanka",
      "weight": 0.05851665
    },
    {
      "name": "insurers",
      "weight": 0.056600783
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97705078125
    },
    {
      "name": "/Finance/Insurance/Other",
      "score": 0.427490234375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.3203125
    }
  ],
  "sentiment": {
    "positive": 0.53613824,
    "negative": 0.032009497,
    "neutral": 0.4318522
  },
  "summary": "Policybazaar for Business, a business-to-business branch of Policybazaar.com, has expanded its reinsurance services in Sri Lanka, Qatar, Oman and the United Arab Emirates. The move aims to bridge capacity gaps in the insurance sectors in these regions by using a technology-centric reinsurance model. The services are founded on a \"digital-first\" infrastructure that incorporates data analytics, actuarial expertise and experience in insurance distribution. The platform is designed to facilitate both facultative and treaty reinsurance solutions, addressing a range of risks including property, marine, liability, cyber and those linked to climate change. This expansion is part of PolicyBazaar's aim to develop a reinsurance network across the Asian and Middle Eastern markets.",
  "shortSummary": "Policybazaar for Business expanded reinsurance services in Sri Lanka, Qatar, Oman, and the UAE using a \"digital-first\" platform to address capacity gaps in these markets.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "eb5b0ca9ec584c5cafebc7f44e06a645",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Policybazaar for Business has launched a digital-first reinsurance platform in Sri Lanka, Qatar, Oman and the UAE to fill capacity gaps in those markets. The service offers facultative and treaty solutions across property, marine, liability, cyber and climate-linked risks, leveraging data analytics and actuarial expertise. The expansion is part of the company’s plan to build a pan‑Asian reinsurance network centered on technology. Earlier this month, the parent firm faced a regulatory fine in India for non‑compliance with insurance directives.",
  "argos_id": "85W27CX1T"
}