{
  "url": "https://www.ibtimes.com/landslide-flattens-sudan-village-kills-more-1000-armed-group-3782195",
  "authorsByline": "AFP News",
  "articleId": "aa7bf2916e9e4c1da1b055cef2a31ebf",
  "source": {
    "domain": "ibtimes.com",
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://d.ibtimes.com/en/full/4619141/abdulwahid-al-nur-faction-rebel-sudan-liberation-army-says-this-photograph-shows-scene-deadly.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T07:12:09-04:00",
  "addDate": "2025-09-02T11:39:10.626481+00:00",
  "refreshDate": "2025-09-02T11:39:10.626484+00:00",
  "score": 1.0,
  "title": "Landslide Flattens Sudan Village, Kills More Than 1,000: Armed Group",
  "description": "Rescue teams were struggling to reach a remote mountain village in Sudan's Darfur region on Tuesday after a devastating landslide buried almost the entire community killing more than 1,000 people.",
  "content": "Rescue teams were struggling to reach a remote mountain village in Sudan's Darfur region on Tuesday after a devastating landslide buried almost the entire community killing more than 1,000 people.\n\nHeavy rain triggered the disaster on Sunday, flattening the village of Tarasin in the Jebel Marra range, the rebel Sudan Liberation Movement/Army (SLM) faction which controls the area said in a statement, adding that there was only one survivor.\n\n\"Initial information indicates the death of all village residents, estimated at more than 1,000 individuals, with only one survivor,\" the faction led by Abdulwahid al-Nur said, calling the landslide \"massive and devastating\".\n\nThe group appealed to the United Nations and other aid organisations for help recovering the dead still buried under mud and debris.\n\n\"This is beyond our capacity,\" Nur told AFP via a messaging app.\n\n\"Masses of mud fell onto the village. Our humanitarian teams and local residents are trying to retrieve the bodies, but the scale of the disaster is far greater than the resources available to us,\" he said.\n\nThe African Union urged Sudan to \"silence the guns\" and allow aid delivery to victims of the deadly landslide.\n\n\"In these painful circumstances, the chairperson of the Commission... calls on all Sudanese stakeholders to silence the guns and unite in facilitating the swift and effective delivery of emergency humanitarian assistance to those in need,\" the bloc said in a statement.\n\nImages the SLM published on its website appeared to show huge sections of the mountainside collapsed, burying the village under thick mud and uprooted trees.\n\nFootage showed people standing on jagged rocks as they searched for those buried beneath the mud.\n\nThe SLM controls parts of the Jebel Marra range and has mostly stayed out of the conflict, but hundreds of thousands of people have fled into SLM-held territory to escape the violence.\n\nJebel Marra is a rugged volcanic range stretching about 160 kilometres (100 miles) southwest of North Darfur's besieged state capital El-Fasher, which the RSF is pushing to capture after besieging it for more than a year.\n\nThe area is prone to landslides, particularly during the rainy season which peaks in August. A 2018 landslide in nearby Toukoli killed at least 20 people.\n\nSince April 2023, Sudan has been ravaged by a war that erupted from a power struggle between army chief Abdel Fattah al-Burhan and his former deputy, RSF commander Mohamed Hamdan Daglo.\n\nThe rivals have responded to Sunday's disaster.\n\nBurhan's Transitional Sovereignty Council, which heads the internationally recognised government based in Port Sudan on the Red Sea coast, mourned the victims on Tuesday.\n\nIt pledged to mobilise all available resources to support those affected by what it described as a \"painful disaster\".\n\nThe rival government based in South Darfur state capital Nyala also weighed in on the tragedy.\n\nMohamed Hassan al-Taayshi, prime minister in the RSF-backed government, expressed deep sorrow and said solidarity must rise above politics.\n\n\"This is a profoundly human moment,\" he said, adding that \"the lives and safety of Sudanese citizens are above any political or military considerations\".\n\nHe also said that he had spoken directly with SLM leader Nur to assess needs on the ground.\n\nMuch of Darfur -- including the area where the landslide occurred -- remains inaccessible to international aid organisations due to ongoing fighting, severely limiting the delivery of emergency relief.\n\nThe disaster also comes during Sudan's rainy season, which often renders mountain roads impassable.\n\nIn Sudan's main war zones like Darfur, infrastructure was already fragile after more than two years of fighting.\n\nBurhan's forces retook central Sudan in a series of offensives earlier this year, leaving the RSF in control of most of Darfur and parts of Kordofan in the south.\n\nThe paramilitaries have moved to set up a rival government in the territories they still control.\n\nThis week, RSF commander Daglo was sworn in as head of its newly-formed presidential council while Taayshi was sworn in as prime minister.\n\nThe war has killed tens of thousands of people and driven more than 14 million from their homes, according to UN figures.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Sudan Village",
      "weight": 0.08568158
    },
    {
      "name": "central Sudan",
      "weight": 0.07133413
    },
    {
      "name": "Port Sudan",
      "weight": 0.07110776
    },
    {
      "name": "Sudan",
      "weight": 0.07035462
    },
    {
      "name": "South Darfur state capital",
      "weight": 0.06652824
    },
    {
      "name": "SLM leader Nur",
      "weight": 0.06575606
    },
    {
      "name": "RSF commander Daglo",
      "weight": 0.063066944
    },
    {
      "name": "RSF commander Mohamed Hamdan Daglo",
      "weight": 0.06138107
    },
    {
      "name": "South Darfur",
      "weight": 0.06099366
    },
    {
      "name": "aid delivery",
      "weight": 0.05913029
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9716796875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.939453125
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.89111328125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.66845703125
    },
    {
      "name": "/News/Local News",
      "score": 0.59375
    },
    {
      "name": "/News/World News",
      "score": 0.44921875
    }
  ],
  "sentiment": {
    "positive": 0.052266855,
    "negative": 0.75467277,
    "neutral": 0.19306038
  },
  "summary": "A landslide in Sudan's Darfur region has killed more than 1,000 people, according to the rebel Sudan Liberation Movement/Army (SLM) faction. The group, which controls the area, described the disaster as \"massive and devastating\". It appealed to the United Nations and other aid organisations for help recovering the dead. The African Union has urged Sudan to \"silence the guns\" and allow aid delivery to victims. The disaster occurred due to heavy rain, which triggered the disaster. Much of Darfur remains inaccessible to international aid organisations due to ongoing fighting. The conflict has left Sudan's infrastructure fragile after more than two years of fighting.",
  "shortSummary": "A landslide in Sudan's Darfur killed over 1,000 people, prompting aid requests and calls for political unity to aid victims.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a5229d212f6d48c68e725313322846fc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A massive landslide triggered by heavy rain on Sunday buried the village of Tarasin in Sudan's Jebel Marra range, killing over 1,000 residents and leaving only one survivor. Rescue teams struggled to reach the remote site amid ongoing conflict, with aid delivery hampered by fighting between the Sudanese army and the Rapid Support Forces. The Sudan Liberation Movement, which controls the area, appealed to the UN for assistance, while the African Union urged a ceasefire to facilitate relief. The disaster highlights the vulnerability of Darfur's fragile infrastructure during the rainy season and the broader humanitarian crisis amid the war that has displaced millions.",
  "argos_id": "8NB05BU2S"
}