{
  "url": "https://www.zerohedge.com/markets/futures-point-firmer-open-despite-lower-apac-handover-newsquawk-europe-market-open",
  "authorsByline": "Newsquawk",
  "articleId": "71e35e5eab434603aaeb9807f34950c2",
  "source": {
    "domain": "zerohedge.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://assets.zerohedge.com/s3fs-public/styles/16_9_max_700/public/2025-09/Euro-Opening-News_1.png?itok=JcGJqdoe",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T01:41:51-04:00",
  "addDate": "2025-09-03T06:04:17.297998+00:00",
  "refreshDate": "2025-09-03T06:04:17.298001+00:00",
  "score": 1.0,
  "title": "Futures point to a firmer open despite a lower APAC handover - Newsquawk Europe Market Open",
  "description": "",
  "content": "• APAC stocks were predominantly lower following the weak handover from Wall St; sentiment dampened by global debt concerns.\n• European equity futures indicate a higher cash market open with Euro Stoxx 50 future up 0.3% after the cash market closed with losses of 1.4% on Tuesday.\n• DXY is holding onto yesterday's gains, JPY and GBP remain softer vs. the USD after a bruising session on Tuesday.\n• USTs lack direction following yesterday's bear-steepening. Bunds are a touch softer, JGB tracked recent losses in global peers.\n• Crude futures lacked conviction after whipsawing yesterday, spot gold is steady after printing another fresh ATH.\n• UK Chancellor Reeves has pencilled in November 26th for the date of the Budget, according to Huffington Post.\n• Looking ahead, highlights include EU Producer Prices, EZ, UK, US Services PMI (Final), US Durable Goods R (Jul), JOLTS Job Openings (Jul), NBP Announcement, Fed Beige Book, BoE’s Mann, Breeden, Bailey, Lombardelli, Greene & Taylor, ECB’s Lagarde, RBA Governor Bullock, Fed’s Musalem & Kashkari, Supply from Germany.\n\n2. Listen to this report in the market open podcast (available on Apple and Spotify)\n• US stocks declined on Tuesday as participants returned from the long Labor Day weekend and were hit by the broader risk aversion amid numerous factors including the US appeals court ruling on Trump tariffs as illegal, geopolitical uncertainty, and the US Commerce Department revoking waivers for Intel/Samsung/SK Hynix/TSMC. Meanwhile, Treasuries saw broad-based selling alongside global fixed income as the US curve bear steepened on trade rulings, global fiscal/political woes, and supply.\n• SPX -0.69% at 6,416, NDX -0.79% at 23,231, DJI -0.55% at 45,296, RUT -0.60% at 2,352.\n• US President Trump said on the tariff ruling that they're going to the Supreme Court Wednesday and need an early decision.\n• US Ambassador to NATO said US President Trump has not put tariffs on China because those negotiations are ongoing and the war in Ukraine is certainly part of that discussion, while he added that Trump “certainly knows that he has those cards to play” and may impose tariffs if he deems them necessary. He also stated that while tariffs on India “have changed their calculation” about purchases of Russian energy, the US “probably not going to foster a closer relationship in trade with India\".\n• Japanese Trade Minister Akazawa is to visit the US this week, according to TV Tokyo.\n• US President Trump said they need a very serious rate cut, while it was also reported that the ruling on Trump's Fed firing is not expected until after September 4th.\n• US Treasury Secretary Bessent is planning to start a blitz of interviews on Friday in search of a candidate to be the next Fed Chair, according to WSJ.\n• US President Trump said they're going to send the National Guard to Chicago.\n• APAC stocks were predominantly lower following the weak handover from Wall St, where the major indices declined on return from the extended weekend as sentiment was dampened by global debt concerns amid a higher yield environment.\n• ASX 200 retreated with the declines led by underperformance in tech, utilities and financials, while slightly stronger-than-expected Australian GDP data failed to inspire.\n• Nikkei 225 was pressured amid a higher global yield environment but with the downside initially cushioned by recent currency weakness.\n• Hang Seng and Shanghai Comp gradually fell despite the better-than-expected RatingDog Services PMI data from China and with the attention in Beijing on the military parade, which was attended by Russian President Putin and North Korean Leader Kim, while US President Trump reacted in a post and accused them of conspiring against the US.\n• US equity futures (ES +0.1%, NQ +0.2%) traded mixed after recent losses on Wall St and with Alphabet shares supported after-hours following a federal judge ruling that the Co. would not be required to sell its Chrome browser but must share data with competitors.\n• European equity futures indicate a higher cash market open with Euro Stoxx 50 futures up 0.3% after the cash market closed with losses of 1.4% on Tuesday.\n• DXY is holding onto yesterday's gains, which were seen amid a risk-off tone that was fuelled by a global rise in bond yields amid concerns over increased debt issuances, and which outweighed the data releases. Nonetheless, participants look ahead to incoming releases including JOLTS data scheduled later, which kicks off a flurry of employment metrics culminating with Friday's NFP report, while it was also reported that Treasury Secretary Bessent is planning to start a blitz of interviews on Friday for the Fed Chair role.\n• EUR/USD languished firmly beneath the 1.1700 handle after it recently gave up ground to the buck, while the mostly hotter-than-expected EU inflation data and somewhat mixed comments from ECB officials did little to inspire the single currency.\n• GBP/USD remained subdued at a sub-1.3400 territory following yesterday's underperformance as debt concerns were triggered alongside a rise in the UK 30yr yield to a 27-year high.\n• USD/JPY continued its upward momentum and edged closer to the 149.00 level before running into some resistance.\n• Antipodeans were contained with only brief support seen following the slightly better-than-expected Australian GDP data.\n• 10yr UST futures lacked direction after bear steepening yesterday following trade rulings, global fiscal woes and supply.\n• Bund futures languished beneath the 129.00 level after retreating alongside a sell-off in global bond markets as yields climbed and with a EUR 5bln Bund issuance scheduled for today.\n• 10yr JGB futures tracked recent downside in global peers with demand not helped by a lack of tier-1 data from Japan.\n• Crude futures lacked conviction after whipsawing yesterday amid a stronger dollar and with the US imposing sanctions targeting Iranian oil, while participants will have to wait an additional day for this week's inventory data owing to the recent Labor Day holiday.\n• Israeli PM Netanyahu ordered not to proceed with the huge gas agreement between Leviathan and Egypt without his consent, according to Al Jazeera citing Israel's Hayom.\n• Spot gold was rangebound but printed fresh record highs above the USD 3,500/oz level despite recent dollar strength.\n• World Gold Council said to launch a digital form of gold, according to FT.\n• Copper futures pulled back from a 1-month high amid the mostly subdued overnight risk appetite including in its largest buyer, China.\n• Bitcoin traded indecisively with price action oscillating around the USD 111k level.\n• BoJ Governor Ueda said he exchanged views with PM Ishiba on the economy and financial markets, while they had discussions on various topics about the economy and talked about forex. Ueda said it was a regular meeting to exchange views on the economy and financial markets and there is no change to their stance of raising interest rates if the economy and prices move in line with the forecast.\n• Japanese ruling party LDP's Aso is set to call for an early party election, according to Mainichi.\n• Israeli PM Netanyahu said they have destroyed the Iranian axis in Gaza, Lebanon and Syria, while he said in a message to Israeli soldiers that the war in Gaza has reached a decisive stage, according to Al Arabiya and Sky News Arabia.\n• US President Trump commented about Russian President Putin, in which he stated that he is \"very disappointed in him\" and will be doing something to help people live regarding the war in Ukraine, according to the Scott Jennings Radio Show.\n• Ukrainian President Zelensky said Russia is engaged in a new troop buildup in certain sectors and continues to launch strikes on Ukraine.\n• Ukraine's Foreign Ministry said the Zaporizhzhia nuclear power plant is a part of Ukraine and it will never agree to legalise its Russian occupation, while it added the only way to guarantee safety at the plant is the full and immediate withdrawal of Russian troops.\n• Ukraine's military said Russia launched an air attack on Kyiv and it was also reported that all of Ukraine was under air raid alerts following Ukrainian air force warnings of Russian missile and drone attacks, while Poland scrambled aircraft to ensure airspace security after Russia launched strikes on Ukraine.\n• Russian Foreign Minister Lavrov said Moscow expects Russia-Ukraine talks to continue and he stated that the heads of delegations are in direct contact. Lavrov said Russia expects statements from its partners in support of dialogue with the US on Ukraine, while he added that for a lasting peace in Ukraine, territorial realities must be recognised. Lavrov also said that India did not bow to US demands to stop purchasing resources from Russia, which Moscow appreciates, as well as noted the US is making active diplomatic efforts on Ukraine and that Putin–Trump contacts are substantive. Furthermore, he said a new system of security guarantees for Russia and Ukraine must be formed and that Moscow calls for ensuring a neutral, non-bloc and non-nuclear status of Ukraine, according to RIA and TASS.\n• Russian Foreign Ministry spokeswoman said Kyiv and its allies reject the possibility of compromises on settlement of conflicts, according to RIA.\n• Russia and the US are in the process of coordinating on dates and the venue of the next round of talks, according to RIA.\n• Russia and India discussed the possibility of expanding S-400 supplies, according to TASS.\n• Chinese President Xi said at the military parade in Beijing that China is a great nation that fears no violence and is self-reliant and strong, while he added the Chinese people stand on the right side of history and are committed to peace. Xi also said the world is facing a choice of peace or war now and he called on nations to prevent historical tragedies from recurring.\n• US President Trump posted on Truth Social \"The big question to be answered is whether or not President Xi of China will mention the massive amount of support and “blood” that The United States of America gave to China in order to help it to secure its FREEDOM from a very unfriendly foreign invader. Many Americans died in China’s quest for Victory and Glory. I hope that they are rightfully Honored and Remembered for their Bravery and Sacrifice! May President Xi and the wonderful people of China have a great and lasting day of celebration. Please give my warmest regards to Vladimir Putin, and Kim Jong Un, as you conspire against The United States of America. PRESIDENT DONALD J. TRUMP\"\n• US President Trump said he is not concerned about the axis forming against the US, including among China and Russia. Furthermore, Trump said regarding Chinese President Xi hosting Russian President Putin and North Korean Supreme Leader Kim, in which he stated that this is not a challenge and \"China needs us more than we need them\", as well as stated that he may take a different stance on Putin if nothing comes.\n• UK Chancellor Rachel Reeves has pencilled in November 26 for the date of the Budget, according to Huffington Post.\n• UK is in advanced talks to build warships for Denmark and Sweden, according to FT.\n• French Finance Minister Lombard urged for a compromise on the 2026 Budget and said the deficit reduction plan will inevitably be less ambitious if the government falls, while he is confident France will accomplish its GDP growth forecast of 0.6% this year and said they are on track to reduce the deficit from 5.8% in 2024 to 5.4% in 2025, according to FT.\n• ECB's Muller said it makes sense to keep rates on hold for a while and watch the economy, while he added that looking at recent data, “we could still assume that we are more or less on the path that was already there during the last round of projections for the ECB\". Furthermore, Muller said “In light of all of this turmoil that we have seen in the recent past, starting with the trade policy in the US, also the impact of war in Ukraine that we have now for a number of years, the economy has held up quite well in Europe”.",
  "medium": "Article",
  "links": [
    "https://newsquawk.com/?utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
    "https://newsquawk.com/daily?utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
    "https://newsquawk.com/daily/article/?id=4885-europe-market-open-futures-point-to-a-firmer-open-despite-a-lower-apac-handover&utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
    "https://newsquawk.com/headlines/newsquawk-us-market-wrap-global-risk-off-sees-stocks-and-bonds-weighed-while-dollar-gains-ahead-of-jolts-02-09-2025"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US President Trump",
      "weight": 0.07482345
    },
    {
      "name": "US equity futures",
      "weight": 0.066980205
    },
    {
      "name": "US",
      "weight": 0.062421776
    },
    {
      "name": "US demands",
      "weight": 0.062262632
    },
    {
      "name": "US stocks",
      "weight": 0.061935853
    },
    {
      "name": "US Ambassador",
      "weight": 0.06001112
    },
    {
      "name": "US Services PMI",
      "weight": 0.05969122
    },
    {
      "name": "Russian President Putin",
      "weight": 0.057821073
    },
    {
      "name": "US Treasury Secretary Bessent",
      "weight": 0.05695065
    },
    {
      "name": "US Durable Goods R",
      "weight": 0.055442847
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9873046875
    },
    {
      "name": "/Finance/Investing/Commodities & Futures Trading",
      "score": 0.72119140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.697265625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.4287109375
    }
  ],
  "sentiment": {
    "positive": 0.07311997,
    "negative": 0.71576476,
    "neutral": 0.21111529
  },
  "summary": "European equity futures indicate a higher cash market open with Euro Stoxx 50 future up 0.3% after the cash market closed with losses of 1.4%. Despite a weak handover from Wall St, APAC stocks were mostly lower due to global debt concerns. Meanwhile, US stocks declined due to a US appeals court ruling on Trump tariffs as illegal, geopolitical uncertainty, and the US Commerce Department revoking waivers for Intel/Samsung/SK Hynix/TSMC. Treasuries saw broad-based selling alongside global fixed income as the US curve bear steepened on trade rulings, global fiscal/political woes, and supply supply. UK Chancellor Reeves has confirmed November 26th for the date of the Budget. US President Trump said they need a serious rate cut and the ruling on the Fed firing is not expected until after September 4th.",
  "shortSummary": "European stock futures are higher amid weaker APAC stocks and global debt concerns, with US Treasury Secretary Bessent considering potential interest rate cuts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "bc38d6704b9a41489dd985a0891be87b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://newsquawk.com/daily?utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
      "text": "Pricing\nFeatures\nEnterprise\nNews & More\nPremarket Movers & News\nCase Studies\nHow to Trade News Events\nTools\nAffiliates & Advertising\nCompetitor Discount\nLog In\nStart 7-Day Trial\nEnterprise\nFeatures\nPricing\nContact\nCase Studies\nHow to Trade News Events\nPremarket Movers & News\nTools\nAffiliates & Advertising\nCompetitor Discount\nStart 7-Day Trial\nLog In\nThe Premarket Movers & News by Newsquawk\nOriginal insights into market moving news\nGet the Daily Market Open in your inbox twice a day...\nEmail Address\nPrevious\nNext\nCookies help us deliver the best experience on our website. By using our website you agree to the use of cookies.\nLearn more.\nOK"
    },
    {
      "url": "https://newsquawk.com/daily/article/?id=4885-europe-market-open-futures-point-to-a-firmer-open-despite-a-lower-apac-handover&utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
      "text": "Published\nListen to the Market Open\nAlso available on Apple Podcasts & Spotify\n2 of the 3 biggest banks in the US already use Newsquawk to mitigate the risk of being caught out on market impacting news. When will you?\n100% Free for 7 days\nCancel any time\nBe ready for your next economic event\nMost professional traders see results during free trial\nWhat Professional Traders Say...\n\" With Newsquawk you get the services of a full analyst team for the price of their coffee each month. It’s a no-brainer value wise compared to hiring your own analysts.\"\n\"A month of Newsquawk pays for itself in less than one good position. The speed benefit you get from a squawk news service when you trade news events is huge. It just makes everything easier to understand and react to.\"\n\"Having access to Newsquawk whilst trading from home makes me feel I’m back on the trading floor, with the audio of the moving news and additional full analysis of the economic and geopolitical events. The cost of the service is easily covered 10 fold with timely trades on breaking news which is not priced into markets.\"\n\"I use news from Newsquawk to nudge clients into making a trade. They provide news about bonds, commodities and FX that I don’t get from competitors.\"\n\"I really enjoy the follow ups around global macro events as it helps provide more understanding on market moves. It’s really helpful for reading the equity markets.\"\n\"Newsquawk’s ability to process and filter news headlines at the speed they do directly benefits our traders financially. The cost of the service is nothing compared to the benefit.\""
    },
    {
      "url": "https://newsquawk.com/headlines/newsquawk-us-market-wrap-global-risk-off-sees-stocks-and-bonds-weighed-while-dollar-gains-ahead-of-jolts-02-09-2025",
      "text": "Newsquawk US Market Wrap: Global risk-off sees stocks and bonds weighed while Dollar gains ahead of JOLTS\n-\nSNAPSHOT: Equities down, Treasuries down, Crude up, Dollar up -\nREAR VIEW: ISM Mfg PMI underwhelms; US Construction Spending declines as expected; Trump will appeal tariff ruling; US pulls TSMC's waiver for China shipments of China supplies; AtlantaFed GDPnow (Q3) revised down; Trump admin prepares new measures against Brazil; Top officials of the Japanese ruling LDP are reportedly to resign; BoJ's Himino backs raising rates but acknowledges global uncertainty; Elliott takes stake in PEP; AAPL loses lead AI robotic researcher to META; STZ cuts guidance. -\nCOMING UP: Data: Australia Real GDP (Q2), Chinese Caixin Services PMI (Final), EU Producer Prices, EZ, UK, US Services PMI (Final), US Durable Goods R (Jul), JOLTS Job Openings (Jul). Events: NBP Announcement; Fed Beige Book, BoE Treasury Select Committee Hearing. Speakers: BoE’s Mann, Breeden, Bailey, Lombardelli, Greene, Taylor; ECB’s Lagarde; RBA Governor Bullock; Fed’s Musalem, Kashkari. Supply: Australia, Germany. -\nWEEK AHEAD: Highlights include US NFP, ISM PMIs, EZ Flash CPI, UK Retail Sales, and Canada Jobs. Click here for the full report. -\nWEEKLY US EARNINGS ESTIMATES: AVGO the highlight on Thursday AMC. Click here for the full report.\nMARKET WRAP\nUS indices were in the red on Tuesday, as participants returned from the long Labor Day weekend, but were hit by the broader risk aversion amid numerous factors. In particular, but not limited to, the US appeals court ruling on Trump tariffs as illegal, geopolitical uncertainty, and the US Commerce Department revoking waivers for Intel/Samsung/SK Hynix/TSMC. Meanwhile, Treasuries saw broad-based selling alongside global fixed income as the US curve bear steepened on trade rulings, global fiscal/political woes, and supply. The Dollar saw strength amid the aforementioned risk-off, while the EUR, JPY, and GBP lagged. The latter was hit as focus resides on the UK's fiscal outlook, which saw the UK 30yr yield hit a 27-year high, while the Yen was hit on yield differentials. Gold hit an all-time high. In the energy space, benchmarks were choppy but ultimately gained due to the wider geopolitical footing and the US imposing sanctions targeting Iranian oil, as opposed to the firmer Dollar and risk-off sentiment. There were no Fed speakers, while ISM Manufacturing largely supported the notion of rate cuts, but did little to move the dial amid the previously mentioned themes. Recapping the data, the headline and employment rose, but by less than expected, while prices paid unexpectedly declined. Construction spending declined 0.1%, as expected.\nUS\nISM MFG: ISM Manufacturing PMI for August rose to 48.7 from 48.0, but shy of the expected 49.0, and the same was seen with the Employment index as it printed 43.8, against the expected 44.5 and prior 43.4. Prices paid fell to 63.7 from 64.8, and below the bottom end of the forecast range. New orders lifted back into expansionary territory at 51.4 from 47.1. Within the release, it notes that the past relationship between the Manufacturing PMI and the overall economy indicates that the August reading corresponds to a change of plus 1.8% in real GDP on an annualised basis. Within the survey respondents, one noted that “tariffs continue to wreak havoc on planning/scheduling activities… due to unexpected tariff announcements (such as 50% duties on imports from India), materials/supplies are now rising in price… Plans to bring production back into the US are impacted by higher material costs, making it more difficult to justify the return.” Oxford Economics write that tariffs are still putting upward pressure on input costs, and will likely intensify over the next couple of months. Therefore, OxEco say it won’t be surprising if the dip in prices paid is temporary, and it won’t have any bearing on whether or not the Fed opts to cut interest rates in September – that burden falls on the August employment and consumer price reports, Oxford adds.\nCONSTRUCTION SPENDING: US Construction spending fell 0.1% as expected in July, modestly extending the 0.4% decline seen in June. The July reading brings the YTD value to 1.232tln, +2.2% Y/Y. Private construction spending fell 0.2%, private residential construction rose 0.1%, with the private non-residential component 0.5% lower M/M. Concerning public construction spending, that was 0.3% higher M/M, with educational construction and highway construction both down 0.1% M/M. The data has led Oxford Economics to downwardly revise its near-term forecast for business investment in structures lower. \"Fiscal policy won't provide meaningful relief to this GDP component until next year\".\nFIXED INCOME\nT-NOTE FUTURES (Z5) SETTLED 11+ TICKS LOWER AT 112-04+\nT-Notes bear steepen on trade rulings, global fiscal/political woes and supply. At settlement, 2-year +3.7bps at 3.660%, 3-year +4.5bps at 3.629%, 5-year +4.7bps at 3.746%, 7-year +5.3bps at 3.982%, 10-year +5.7bps at 4.283%, 20-year +6.0bps at 4.927%, 30-year +5.9bps at 4.977%.\nINFLATION BREAKEVENS: 1-year BEI +1.3bps at 3.316%, 3-year BEI +0.0bps at 2.818%, 5-year BEI -0.4bps at 2.519%, 10-year BEI +0.5bps at 2.399%, 30-year BEI +1.5bps at 2.298%.\nTHE DAY: T-Notes bear steepened tracking global fixed income moves with UK yields rallying on ongoing debt concerns, and French yields rising on political instability. Also driving the global move was a plethora of supply. Bloomberg reported that Bond sales in Europe hit a record EUR 49.6bln (USD 57.7bln) in a single day, thanks to issuance from the UK and Italy, in what it described as kickstarting a September rush for funding after a summer lull. Elsewhere, in the US, Merck and Cigna were in the market with corporate issuance, with Merck noting some of the proceeds may be used in relation to the Verona Pharma acquisition in July, worth USD 10bln. Even before the supply, Treasuries were weighed on amid the return of players from the Labor Day holiday in response to the US Appeals court deeming that US President Trump's tariffs are illegal, albeit Trump is appealing the ruling to the US Supreme Court, and the tariffs will remain in place for now. Raymond James, in a note, suggested that if this ruling is upheld, refunds of existing tariffs are on the table, which could cause a surge in Treasury issuance and yields due to the loss of revenue. Meanwhile, the US ISM Manufacturing PMI report remained in contractionary territory and slightly missed expectations, while prices paid fell beneath all analyst forecasts, and employment saw little change but still missed forecasts. Construction spending declined 0.1%, in line with forecasts. In wake of the data, the Atlanta Fed Q3 25 GDPNow estimate was lowered to 3.0% from 3.5%. Attention now turns to the August NFP report on Friday to further shape Fed rate cut expectations, where a hot report might derail some September rate cut bets, but another slowdown would likely see markets fully cement a 25bps cut. Fed speak will also be key given Friday is the last day before the FOMC blackout period, so any commentary from officials post-NFP will be closely watched, albeit no speeches are scheduled yet. There is also the ongoing Trump v Fed dispute, with an update still awaited on Fed Governor Cook's future. Note, the US Senate will hold a hearing on September 4th (Thursday) to consider CEA Chair Miran for the Fed Board of Governors, replacing Governor Kugler as Trump looks to kit out the Fed with dovish Republicans.\nSUPPLY\nBills:\n- US sold USD 82bln of 3-month bills at a high rate of 4.045%, B/C 2.96x\n- US sold USD 73bln of 6-month bills at a high rate of 3.880%, B/C 2.70x\n- US sold USD 85bln of 6-wk bills at a high rate of 4.190%, B/C 2.64x\n- US sold USD 50bln of 52-wk bills at a high rate of 3.660%, B/C 3.82x\n- US to sell USD 65bln in 17-week bills on September 3rd\n- US to sell USD 85bln of 8-week bills and USD 100bln of 4-week bills on September 4th\nSTIRS/OPERATIONS\n- Market Implied Fed Rate Cut Pricing: September 23bps (prev. 22bps), Oct 36bps (prev. 35bps), Dec 55bps (prev. 55bps).\n- NY Fed RRP op demand at USD 21bln (prev. 78bln) across 17 counterparties (prev. 26).\n- EFFR at 4.33% (prev. 4.33%), volumes at USD 115bln (prev. 115bln) on August 29th\n- SOFR at 4.34% (prev. 4.36%), volumes at USD 2.870tln (prev. 2.889tln) on August 29th\nCRUDE\nWTI (V5) SETTLED USD 1.58 HIGHER AT 65.59/BBL; BRENT (X5) SETTLED USD 0.99 HIGHER AT USD 69.14/BBL\nThe crude complex was choppy, but saw gains amid the wider geopolitical footing and US imposing sanctions targeting Iranian oil, as opposed to the firmer Dollar and broader risk-off sentiment. Regarding price action on Tuesday, WTI and Brent hit peaks of USD 66.03/bbl and 69.53 in the European morning, likely on the wider geopolitical picture. On that, concerns about supply disruptions rose amid an escalation of the conflict between Russia/Ukraine, whereby Reuters reported Ukraine's attacks force Russia to shut 17% of oil-processing capacity. On top of this, there is speculation that OPEC+ will not raise output at a meeting on Sunday. After hitting the peaks, benchmarks sold off and trimmed a large chunk of the gains and eventually succumbed to the wider risk sentiment, as opposed to something headline-driven. However, and highlighting the two-way day in the energy space, WTI and Brent rose back higher to ~USD 0.50/bbl off the earlier peaks with many citing the US Treasury issuing new Iran-related sanctions; US imposed sanctions on an Iraqi tycoon accused of helping Iran evade restrictions on its oil exports, the latest in a series of moves targeting Tehran’s energy trade. Note, private inventory data is delayed a day due to Labor Day on Monday, and there is a disparity between WTI and Brent settlement due to no WTI settlement on Monday due to the aforementioned US holiday.\nEQUITIES\nCLOSES: SPX -0.69% at 6,416, NDX -0.79% at 23,231, DJI -0.55%, RUT -0.60%.\nSECTORS: Real Estate -1.74%, Industrials -1.06%, Technology -0.97%, Consumer Discretionary -0.95%, Financials -0.71%, Materials -0.59%, Communication Services -0.42%, Utilities -0.37%, Consumer Staples +0.07%, Health +0.07%, Energy +0.24%.\nEUROPEAN CLOSES: Euro Stoxx 50 -1.41% at 5,291, Dax 40 -2.21% at 23,505, FTSE 100 -0.87% at 9,117, CAC 40 -0.70% at 7,654, FTSE MIB -1.61% at 41,728, IBEX 35 -1.49% at 14,717, PSI -1.71% at 7,678, SMI -0.64% at 12,099, AEX -1.38% at 884\nSTOCK SPECIFICS:\n-\nPepsiCo (PEP): Activist Investor Elliott Management TOOK a USD 4bln stake in the Co. -\nConstellation Brands (STZ): Cut FY profit guidance. -\nTSMC (TSM): Plans to raise foundry prices; the US has reportedly pulled TSMC's waiver for China shipments of chip supplies. -\nTesla (TSLA): Cut price of its Model 3 long-range RWD in China by 3.7%. -\nApple (AAPL): Accelerating automation across its manufacturing supply chain. -\nMeta (META): Exploring partnerships with Google (GOOG) & OpenAI to enhance AI features in its apps. -\nAmazon (AMZN): US prime signups fall short of last year's total & target. -\nLyft (LYFT): Announced A private offering of USD 450mln of convertible senior notes. -\nZscaler (ZS): Upgraded at MS to 'Overweight' from 'Equal Weight'. -\nFortinet (FTNT): Downgraded to 'Underweight' from 'Equal Weight' at Morgan Stanley. - US revokes Samsung's & SK Hynix's long-standing waivers to use American equipment in their Chinese chip plants.\n-\nMerck (MRK): Filed for a five-part note offering and one-part FRN offering, size not disclosed. Note, Merck announced in July it is to acquire UK-based Verona Pharma in a USD 10bln deal. -\nPhilip Morris International (PM): Announced FY adj. EPS guidance of USD 7.24-7.37 (exp. 7.53). -\nGoogle’s (GOOGL) adtech fine has been delayed as the EU remains anxious over potential US President Trump backlash. - Warren Buffett says he is \"disappointed\" with the Kraft Heinz (KHC) split, via CNBC.\n-\nNVIDIA (NVDA) said they've seen erroneous chatter claiming that NVDA is supply-constrained and \"sold out\" of H100/H200; as they said at earnings, cloud partners can rent every H100/H200 they have online, but it doesn't mean they're unable to fulfil new orders. \"We have more than enough H100/H200 to satisfy every order without delay. The rumour that H20 reduced our supply of either H100/H200 or Blackwell is also categorically false — selling H20 has no impact on our ability to supply other NVIDIA products\". -\nAmazon (AMZN) cracks down on Prime free shipping sharing, according to CNBC. -\nGeneral Motors (GM) EV sales in August jump to a monthly record of more than 21k, combined from Chevrolet, Cadillac, and GMC. -\nApple (AAPL) loses lead AI robotics researcher to Meta (META) in latest exit, Bloomberg reports; Apple is now discussing internally whether to rely more on outside technology, rather than just homegrown models.\nFX\nThe Dollar began September with broad-based strength against peers, amid a risk-off tone fuelled by a global rise in bond yields due to concerns over increased debt issuance. Said factors were more than enough to outweigh the ISM Manufacturing PMI survey, which indicated smaller-than-expected jumps in the headline and employment gauges, while prices paid unexpectedly declined. Meanwhile, construction spending fell as expected, resulting in the latest Atlanta Fed GDPnow (Q3) being revised down to 3.0% (prev. 3.5%). DXY gains were helped by notable weakness in EUR, and particularly the GBP and JPY (more details below), rising to highs of 98.597 before retreating to ~98.35. Aside from the concerns in the Treasury space, which led yields higher, and also tracked UK and French yields higher, drivers for FX moves were on the light side. However, that is likely to end on Wednesday, which will see JOLTS kick off the job data due this week in the US. Expectations are for job openings to fall to 7.378mln in July from 7.437mln.\nEUR, JPY, and GBP were the worst performers in the G10 space, while CAD saw relative outperformance. At the ECB, many members hit the wires. Schnabel does not see a reason for a further rate cut, adding that global rate hikes may come earlier than people think. Meanwhile, Kocher advocates for caution ahead of the next rate decision, while Muller believes it makes sense to keep rates on hold for a while and watch the economy. Latest EU data concerned EZ HICP metrics, which were generally hotter-than-expected in August. After having a muted reaction to the EZ data, EUR/USD trades lower at ~1.1640 from earlier highs of 1.1718.\nJPY was pressured by higher US yields, geopolitical concerns arising from China's President Xi hosting Russia's President Putin and the North Korean Supreme Leader Kim Jong Un. There were a couple of domestic developments also at play. Concerning politics, uncertainty has increased after four officials in the LDP ruling party are reported to resign, which would be seen as the LDP taking responsibility for its historic July upper house election defeat. Meanwhile, the BoJ Deputy Governor advocated for a lower level of BoJ JGB buying to restore sound functioning in the JGB market. Himino's baseline scenario is for Japan’s corporate profits to come under pressure from the global slowdown and the impact of trade policy. USD/JPY now trades at ~148.40 from earlier lows of 147.06.\nGBP was hit by growing concerns over a weak UK fiscal position amid rising borrowing costs, with FX options highlighting bearish sentiment through dealers reporting elevated premiums for GBP puts over calls. The gilt market was also pressured, resulting in new decade highs in the 30-year yield. Uncertainty in UK assets is likely to remain for some time, with Chancellor Reeves reportedly pencilling in a budget announcement date for November 26th. GBP/USD trades at ~1.3380 from earlier highs of 1.3549 and earlier lows of 1.3341.\nEMFX: In China, the PBoC returned to a bias for a stronger CNY, setting the USD/CNY midpoint at 7.1089, lower than the expected 7.1325 (prev. 7.1072). Elsewhere, Turkish assets were pressured by political developments, whereby the Turkish Court removed the main opposition CHP's Istanbul Chief, diminishing the chances of a threat towards Erdogan's Presidency. Later, the CHP Leader announced they had removed the VP from the party. USD/TRY was modestly higher.\n02 Sep 2025 - 21:20- Fixed IncomeGeopolitical- Source: Newsquawk\nSubscribe Now to Newsquawk\nClick here for a 1 week free trial\nNewsquawk provides audio news and commentary for over 15,000professional traders and brokers worldwide. Services include:\n- Real-time audio coverage from 0630 to 2200 London time plus Asia-Pac 2200 to 1000 London time\n- Teams of analysts covering equities, fixed income, FX, energy, and metals markets\n- Real-time scrolling news service with instant analysis\n- Daily and weekly pre-market research and calendars\n- Video updates covering near-term key risk events & primary trading themes\n- One-to-one chat with our expert analysts"
    },
    {
      "url": "https://newsquawk.com/?utm_source=zerohedge&utm_medium=research&utm_campaign=partner-post&utm_content=euro-open",
      "text": "Newsquawk provides you with real-time audio news headlines that actually impact the market. Our analysts monitor and filter hundreds of sources so you don't need to.\nAs seen on\n“Newsquawk has been a great provider of financial news to the benefit of our traders. Newsquawk's effectiveness results from combining speed with the knowledge to communicate news.”\nThe Problem\nThere's more information than ever at your disposal but it's impossible to stay across everything that's happening, decide what matters and be faster than the market.\n❌ Need a newsroom to monitor world events\n❌ Need analysts to quickly understand market impact\n❌ Time spent filtering & analysing news is time lost on positions\n❌ Need a newsroom to monitor world events\n❌ Need analysts to quickly understand market impact\n❌ Time spent filtering & analysing news is time lost on positions\nTraditional business news sources have a lengthy publishing process and cater to the masses. Our process is tailored to professional traders and we only speak when the news will move the underlying asset price.\n❌ Mass market squawks talk too much\n❌ Legacy news providers are slower to publish news\n❌ Squawks and headlines become noise and time is wasted filtering\n❌ Mass market squawks talk too much\n❌ Legacy news providers are slower to publish news\n❌ Squawks and headlines become noise and time is wasted filtering\nHear News Before the Market Moves\nNewsquawk monitors all data releases and global events, broadcasting via audio in real-time the news that will impact your asset class.\nSelect your asset and fill out the sign up form.\nOr if you prefer the human touch, schedule a setup call and demo.\nSelect your asset and fill out the sign up form.\nOr schedule a 2-minute phone call if you prefer the human touch and a demo.\nOur analysts produce 12-15 daily research sheets that cover all upcoming market events as well as recapping the current state of play.\nWe provide audio and text reminders of upcoming events throughout the day to make sure you're ready for your next market moving event to trade on.\nNo more filtering through event calendars, we do all the work for you!\nOur analysts produce 12-15 daily research sheets that cover all upcoming market events as well as recapping the current state of play.\nWe provide audio and text reminders of upcoming events throughout the day to make sure you're ready for your next market moving event to trade on.\nNo more filtering through the headlines, we do all the work for you!\nOur analysts monitor thousands of headlines and data releases across news wires, social media and live tv broadcasts to find the news that will move the market.\nWe cover all unplanned major macro-impacting breaking news events so you won't get caught out by the unexpected.\nOur analysts monitor thousands of headlines and data releases across news wires, social media and live tv broadcasts to find the news that will move the market.\nWe cover all unplanned major macro-impacting breaking news events so you won't get caught out by the unexpected.\nNo more searching for the news, we do it for you!\nOur analysts monitor thousands of headlines and data releases across news wires, social media and live tv broadcasts to find the news that will move the market.\nWe also explain how the news fits the wider macro narrative and assets it impacts.\nOur analysts monitor thousands of headlines and data releases across news wires, social media and live tv broadcasts to find the news that will move the market.\nWe also explain how the news fits the wider macro narrative and assets it impacts.\nWhat Professional Traders Say\n\" With Newsquawk you get the services of a full analyst team for the price of their coffee each month. It’s a no-brainer value wise compared to hiring your own analysts.\"\n\"A month of Newsquawk pays for itself in less than one good position. The speed benefit you get from a squawk news service when you trade news events is huge. It just makes everything easier to understand and react to.\"\n\"Having access to Newsquawk whilst trading from home makes me feel I’m back on the trading floor, with the audio of the moving news and additional full analysis of the economic and geopolitical events. The cost of the service is easily covered 10 fold with timely trades on breaking news which is not priced into markets.\"\n\"I use news from Newsquawk to nudge clients into making a trade. They provide news about bonds, commodities and FX that I don’t get from competitors.\"\n\"I really enjoy the follow ups around global macro events as it helps provide more understanding on market moves. It’s really helpful for reading the equity markets.\"\n\"Newsquawk’s ability to process and filter news headlines at the speed they do directly benefits our traders financially. The cost of the service is nothing compared to the benefit.\"\nAll packages include\nWeb-based Audio News Feed\nInstant Analysis and Reaction\nLive-Scrolling Text Headlines\nEconomic Calendars\nAnalyst Chat Service\nResearch Reports & Market Rundowns\nTwitter Scanner\nAI Curated Media Monitoring\n2 of the 3 biggest banks in the US already use Newsquawk to mitigate the risk of being caught out on market impacting news. When will you?\n100% Free for 7 days\nCancel any time\nBe ready for your next economic event\nMost professional traders see results during free trial"
    }
  ],
  "argos_summary": "APAC stocks opened lower after a weak handover from Wall Street, while European equity futures signaled a firmer cash market open with the Euro Stoxx 50 up 0.3%. The dollar (DXY) maintained its recent gains, but USTs and Bunds showed little direction amid a bear‑steepening curve. Crude futures were choppy after a whipsaw, and gold steadied at a fresh all‑time high. The UK announced November 26 as the budget date, and markets are eyeing a slate of data releases—including EU producer prices, US services PMI, and JOLTS—alongside ongoing tariff disputes and risk‑off sentiment.",
  "argos_id": "9SBLW4XAH"
}