{
  "url": "https://finance.yahoo.com/news/enhanced-bioavailability-shoden-ashwagandha-linked-110000158.html",
  "authorsByline": "PR Newswire",
  "articleId": "482b83128db14313a6f2d2807c9c996f",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/31806c56afdf741da5c528f0c30873d4",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T11:00:00+00:00",
  "addDate": "2025-09-02T11:50:39.033734+00:00",
  "refreshDate": "2025-09-02T11:50:39.033735+00:00",
  "score": 1.0,
  "title": "Enhanced Bioavailability in Shoden® Ashwagandha Linked to Withanolide Glycosides",
  "description": "A new clinical study identified withanolide glycosides as the key drivers of superior bioavailability in ashwagandha (Withania somnifera) extracts. This marks the first direct evidence in humans that the type of withanolide—not just the total content —significantly influences absorption and efficacy. Shoden® ashwagandha extract, the innovation of nutraceutical pioneers Arjuna Natural Pvt., Ltd., demonstrated superior performance in uptake in the volunteer subjects.",
  "content": "At 35% withanolide glycosides, Shoden® ashwagandha extract by Arjuna Naturals outperforms other commercial ashwagandha products in clinical study KERALA, India, Sept. 2, 2025 /PRNewswire/ -- A new clinical study identified withanolide glycosides as the key drivers of superior bioavailability in ashwagandha (Withania somnifera) extracts. This marks the first direct evidence in humans that the type of withanolide—not just the total content —significantly influences absorption and efficacy. Shoden® ashwagandha extract, the innovation of nutraceutical pioneers Arjuna Natural Pvt., Ltd., demonstrated superior performance in uptake in the volunteer subjects. The randomized, open-label, crossover clinical study, led by Priyank Rathi, MD, was published in the science journal Phytomedicine Plus, last July. It evaluated the bioavailability in 16 healthy human volunteers of four commercially available, standardized ashwagandha extracts with varying compositions, including: Shoden standardized to 35% Withania somnifera withanolide glycosides (WS-35), 10% (WS-10), 5% (WS-5), or 2.5% (WS-2.5). Each sample was standardized to deliver 185mg of total withanolides. Seventeen blood samples were collected over a 24-hour period after dosing. Plasma concentrations of withanolide A, withanoside IV, withaferin A, and total withanolides were quantified, and pharmacokinetic parameters—how the body metabolizes a substance over time—were calculated. Results of the study revealed striking differences in their pharmacokinetic profiles. Extracts rich in withanolide glycosides—particularly those derived from the plant—demonstrated markedly higher systemic exposure. With Shoden in the lead, these extracts showed longer half-lives, indicating prolonged circulation of active compounds in the body. \"Clinical data now confirm that withanolide glycosides stand out not just for quantity but for quality, with higher bioavailable than other withanolide types,\" reveals Benny Antony, PhD, Joint Managing Director of Arjuna Natural. \"Our findings suggest that the strength of ashwagandha is in its withanolide profile, specifically the chemical nature of the withanolides—and not their total amount. This plays a critical role in determining the uptake and metabolism of ashwagandha extracts in the body for optimal effect. This study emphasized the importance of extract composition and the plant parts used.\" Shoden® is a highly bioactive extract of ashwagandha, with an industry-leading 35% withanolide glycosides, the key active compounds in the plant. Derived from carefully chosen and validated ashwagandha sources, Arjuna employs a proprietary extraction process to deliver a potent holistic charge of the popular adaptogenic, even at a uniquely low dose of 60 mg.\n\nAlso known as \"Indian ginseng,\" the botanical powerhouse has been used in Ayurvedic medicine for centuries as a \"rasayana,\" a rejuvenator, due to its scientifically validated capacity to enhance overall resilience and vitality and promote longevity and mental wellness. Ashwagandha is also noted for its antioxidant, anti-inflammatory, and immunomodulatory properties. Yet Withania extracts available in the market differ considerably in their active compound profiles, analytical methods, plant parts used, manufacturing processes, and recommended dosages. These variables can potentially affect the absorption and therapeutic efficacy of the extracts. This study marks the latest milestone in Arjuna's robust collection of 12 clinical studies of Shoden. They showcase Shoden's positive role in relieving stress and anxiety and improving sleep quality. Research indicates its mechanisms of action include the ability to regulate the hypothalamus-pituitary-adrenal axis, reducing the stress hormone cortisol and increasing relaxing GABA neurotransmitters. One clinical study highlighting its immunomodulating benefits revealed natural improvements in immune cell markers. And toxicity studies have endorsed its safety. \"These findings have major implications for both consumers and supplement manufacturers. As ashwagandha continues to gain popularity for its adaptogenic, cognitive, and stress-relieving benefits, the current research underscores the need for more detailed labeling and standardization that goes beyond total withanolide content. Future clinical studies and product formulations should consider the specific withanolide profile—particularly the presence of glycosides—to deliver ashwagandha extracts with maximum efficacy and consistency,\" concludes Antony. Shoden has been internationally recognized for the 23 patents attributed to its unique formulation and manufacturing process. It is available in three doses and in various supplement formats, including pills, capsules, and powders. Its low-dose capabilities allow for its seamless integration into functional foods and beverages. For more than a quarter of a century, Arjuna Natural has been India's leading manufacturer of standardized botanical extracts for food supplement industries, dedicated to ecofriendly and sustainable practices. Established in 1989, the company has grown rapidly, with customers in 70+ countries, and has an advanced research facility that works in collaboration with international universities on phytochemistry, pharmacokinetics, formulation, development, pre-clinical and toxicity studies. Arjuna Natural's facilities comply with the highest world standards, are GMP-certified, GRAS approved and have ISO, NSF, halal and Star-K kosher certification. Arjuna will exhibit at Vitafoods Asia 2025, Booth #H34 and also at SupplySide West, Booth #6517. For further information, please contact:",
  "medium": "Article",
  "links": [
    "https://www.sciencedirect.com/science/article/pii/S0011393X2500030X",
    "https://www.arjunanatural.com/",
    "https://www.prnewswire.com/news-releases/enhanced-bioavailability-in-shoden-ashwagandha-linked-to-withanolide-glycosides-302543638.html",
    "https://mma.prnewswire.com/media/2762297/Arjuna_Shoden_Ashwagandha.jpg",
    "https://www.nutripr.com/",
    "https://mma.prnewswire.com/media/2762297/Arjuna_Shoden_Ashwagandha.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Withanolide Glycosides",
      "weight": 0.08675281
    },
    {
      "name": "withanolide glycosides",
      "weight": 0.08675281
    },
    {
      "name": "ashwagandha extracts",
      "weight": 0.08280488
    },
    {
      "name": "total withanolides",
      "weight": 0.08143455
    },
    {
      "name": "total withanolide content",
      "weight": 0.0787254
    },
    {
      "name": "clinical study",
      "weight": 0.07722568
    },
    {
      "name": "other withanolide types",
      "weight": 0.0750308
    },
    {
      "name": "withanolide A",
      "weight": 0.07476207
    },
    {
      "name": "withanolide",
      "weight": 0.074049145
    },
    {
      "name": "Future clinical studies",
      "weight": 0.07267425
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.8984375
    },
    {
      "name": "/News/Health News",
      "score": 0.72607421875
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.68359375
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.6064453125
    },
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.591796875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.440673828125
    },
    {
      "name": "/Science/Biological Sciences/Other",
      "score": 0.374267578125
    }
  ],
  "sentiment": {
    "positive": 0.56882733,
    "negative": 0.034260962,
    "neutral": 0.39691168
  },
  "summary": "A new clinical study has identified withanolide glycosides as the key drivers of superior bioavailability in ashwagandha extracts. The study, led by Priyank Rathi, MD, found that the type of withanolid, not just the total content, significantly influences absorption and efficacy. Shoden® ashwaggandha extract by Arjuna Naturals outperformed other commercial ashwagenandha products in the study. This study was published in the science journal Phytomedicine Plus. It evaluated the bioavailability of four commercially available, standardized extracts of Ashwagantha extracts with varying compositions. The findings emphasised the importance of extract composition and the plant parts used. Future clinical studies should consider specific product formulations with the presence of specific withanolanoloids, particularly specific in specific areas of extract.",
  "shortSummary": "Arjuna Naturals' Shoden® ashwagandha extract outperforms similar products due to its 35% withanolide glycosides, enhancing its performance in clinical studies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "01ee88fbae3b4c44a05395bcaca15469",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nutripr.com/",
      "text": "top of page\nNutriPR web banner\nNutriPR web banner\n1/3\nABOUT\nAt NutriPR, a global boutique B2B Public Relations agency, we focus exclusively on health and nutrition.\nWe help you design and craft your story for the food and supplement industries via an advanced toolbox of PR promotions, social media and new media to address your potential customers, investors and industry experts.\nAs an industry insider, the staff of NutriPR knows the food market inside-out.\nWe’re tuned in to all the food and beverage trends, dynamic market changes and innovation, now and around the corner.\nWe bring insight into your product to build strong food and nutraceutical brands.\nWe are passionate about our work and your products, cover every detail of your marketing communications campaign, without compromise -\nOur primary goal is your success\nSERVICES\nServices\nCONTACT\nWe can't wait to hear from you...\n+972 9 9742893\n78 Angel st. Kfar Saba, Israel\nbottom of page"
    },
    {
      "url": "https://www.arjunanatural.com/",
      "text": "Engineering Botanical Extracts Effectively.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nScientific. Safe. Sustainable.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nBettering Life Globally\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nScientific. Safe. Sustainable.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nScientific. Safe. Sustainable.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nEngineering Botanical Extracts Effectively.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nEngineering Botanical Extracts Effectively.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nEngineering Botanical Extracts Effectively.\nWe’ve been the world's leading manufacturer of standardized botanical extracts for over 30 years.\nAnd we believe our journey has only begun.\nTransforming Industries\n|\nWe help organizations create world-class products that inspire.\nHuman Nutrition\nAnimal Nutrition\nProduct Journey\n|\nOur commitment to quality is showcased by our end to end, in-house design & manufacturing capabilities.\nIdentifying herbs with potential compounds\nDetermining the potent actives\nCreating the product & its process\nDesigning comprehensive clinical studies\nUndertaking clinical studies worldwide\nPublishing scientific papers after peer review\nObtaining /gathering herbs from sustainable sources\nExtracting actives using gentle processes\nCustomising products as per customers' needs\nTesting to ensure actives' specifications\nTesting to ensure the product's safety\nDocumenting the product's validations\nPackaging the product safely\nCollaborating with delivery partners\nDelivering the order on time, every time\nIdentifying herbs with potential compounds\nDetermining the potent actives\nCreating the product & its process\nDesigning comprehensive clinical studies\nUndertaking clinical studies worldwide\nPublishing scientific papers after peer review\nObtaining /gathering herbs from sustainable sources\nExtracting actives using gentle processes\nCustomising products as per customer's needs\nTesting to ensure actives' specifications\nTesting to ensure the product's safety\nDocumenting the product's validations\nPackaging the product safely\nCollaborating with delivery partners\nDelivering the order on time, every time\nOur Signature Products\nBCM-95® (CURCUGREEN®) is our 100% pure turmeric extract that boasts enhanced bio-efficacy. It is manufactured by…Read More\nOxystorm® is the world’s first nitrate enriched extract of Amaranthus, one of the highest dietary sources of nitrates…Read More\nCreated using natural bioactive from turmeric, Boswellia and more, Rhuleave-K® is our proprietary formula designed to deliver…Read More\nCreated using natural bioactive from turmeric, Boswellia and more, Rhuleave-K® is our proprietary formula designed to deliver…Read More\nBCM-95® (CURCUGREEN®) is our 100% pure turmeric extract that boasts enhanced bio-efficacy. It is manufactured by…Read More\nOxystorm® is the world’s first nitrate enriched extract of Amaranthus, one of the highest dietary sources of nitrates…Read More"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/enhanced-bioavailability-in-shoden-ashwagandha-linked-to-withanolide-glycosides-302543638.html",
      "text": "Enhanced Bioavailability in Shoden® Ashwagandha Linked to Withanolide Glycosides\nAt 35% withanolide glycosides, Shoden® ashwagandha extract by Arjuna Naturals outperforms other commercial ashwagandha products in clinical study\nKERALA, India, Sept. 2, 2025 /PRNewswire/ -- A new clinical study identified withanolide glycosides as the key drivers of superior bioavailability in ashwagandha (Withania somnifera) extracts. This marks the first direct evidence in humans that the type of withanolide—not just the total content —significantly influences absorption and efficacy. Shoden® ashwagandha extract, the innovation of nutraceutical pioneers Arjuna Natural Pvt., Ltd., demonstrated superior performance in uptake in the volunteer subjects.\nThe randomized, open-label, crossover clinical study, led by Priyank Rathi, MD, was published in the science journal Phytomedicine Plus, last July. It evaluated the bioavailability in 16 healthy human volunteers of four commercially available, standardized ashwagandha extracts with varying compositions, including: Shoden standardized to 35% Withania somnifera withanolide glycosides (WS-35), 10% (WS-10), 5% (WS-5), or 2.5% (WS-2.5). Each sample was standardized to deliver 185mg of total withanolides. Seventeen blood samples were collected over a 24-hour period after dosing. Plasma concentrations of withanolide A, withanoside IV, withaferin A, and total withanolides were quantified, and pharmacokinetic parameters—how the body metabolizes a substance over time—were calculated.\nResults of the study revealed striking differences in their pharmacokinetic profiles. Extracts rich in withanolide glycosides—particularly those derived from the plant—demonstrated markedly higher systemic exposure. With Shoden in the lead, these extracts showed longer half-lives, indicating prolonged circulation of active compounds in the body.\nNew gold standard\n\"Clinical data now confirm that withanolide glycosides stand out not just for quantity but for quality, with higher bioavailable than other withanolide types,\" reveals Benny Antony, PhD, Joint Managing Director of Arjuna Natural. \"Our findings suggest that the strength of ashwagandha is in its withanolide profile, specifically the chemical nature of the withanolides—and not their total amount. This plays a critical role in determining the uptake and metabolism of ashwagandha extracts in the body for optimal effect. This study emphasized the importance of extract composition and the plant parts used.\"\nShoden® is a highly bioactive extract of ashwagandha, with an industry-leading 35% withanolide glycosides, the key active compounds in the plant. Derived from carefully chosen and validated ashwagandha sources, Arjuna employs a proprietary extraction process to deliver a potent holistic charge of the popular adaptogenic, even at a uniquely low dose of 60 mg.\nAlso known as \"Indian ginseng,\" the botanical powerhouse has been used in Ayurvedic medicine for centuries as a \"rasayana,\" a rejuvenator, due to its scientifically validated capacity to enhance overall resilience and vitality and promote longevity and mental wellness. Ashwagandha is also noted for its antioxidant, anti-inflammatory, and immunomodulatory properties. Yet Withania extracts available in the market differ considerably in their active compound profiles, analytical methods, plant parts used, manufacturing processes, and recommended dosages. These variables can potentially affect the absorption and therapeutic efficacy of the extracts.\nThis study marks the latest milestone in Arjuna's robust collection of 12 clinical studies of Shoden. They showcase Shoden's positive role in relieving stress and anxiety and improving sleep quality. Research indicates its mechanisms of action include the ability to regulate the hypothalamus-pituitary-adrenal axis, reducing the stress hormone cortisol and increasing relaxing GABA neurotransmitters. One clinical study highlighting its immunomodulating benefits revealed natural improvements in immune cell markers. And toxicity studies have endorsed its safety.\nShoden outperformed other dominant formulations\n\"These findings have major implications for both consumers and supplement manufacturers. As ashwagandha continues to gain popularity for its adaptogenic, cognitive, and stress-relieving benefits, the current research underscores the need for more detailed labeling and standardization that goes beyond total withanolide content. Future clinical studies and product formulations should consider the specific withanolide profile—particularly the presence of glycosides—to deliver ashwagandha extracts with maximum efficacy and consistency,\" concludes Antony.\nShoden has been internationally recognized for the 23 patents attributed to its unique formulation and manufacturing process. It is available in three doses and in various supplement formats, including pills, capsules, and powders. Its low-dose capabilities allow for its seamless integration into functional foods and beverages.\nAbout Arjuna Natural Pvt., Ltd.\nFor more than a quarter of a century, Arjuna Natural has been India's leading manufacturer of standardized botanical extracts for food supplement industries, dedicated to ecofriendly and sustainable practices. Established in 1989, the company has grown rapidly, with customers in 70+ countries, and has an advanced research facility that works in collaboration with international universities on phytochemistry, pharmacokinetics, formulation, development, pre-clinical and toxicity studies. Arjuna Natural's facilities comply with the highest world standards, are GMP-certified, GRAS approved and have ISO, NSF, halal and Star-K kosher certification.\nArjuna will exhibit at Vitafoods Asia 2025, Booth #H34 and also at SupplySide West, Booth #6517.\nFor further information, please contact:\nCompany contact Press Contact\nArjuna Natural Pvt NutriPR\nBenny Antony, PhD Liat Simha\nJoint Managing Director Tel: +972-9-9742893\nEmail: [email protected] E-mail: [email protected]\nWebsite: www.arjunanatural.com Website: www.nutripr.com\nPhoto: https://mma.prnewswire.com/media/2762297/Arjuna_Shoden_Ashwagandha.jpg\nSOURCE Arjuna Natural Ltd.\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    }
  ],
  "argos_summary": "A clinical study published in Phytomedicine Plus shows that withanolide glycosides, rather than total withanolide content, are the key drivers of superior bioavailability in ashwagandha extracts. Shoden®—standardized to 35% glycosides—outperformed other commercial formulations, exhibiting higher systemic exposure and longer half‑lives in 16 healthy volunteers. The findings underscore the need for detailed labeling and standardization focused on glycoside profiles, and suggest that future product development should prioritize specific withanolide chemistry to maximize efficacy.",
  "argos_id": "AOGWV1CSQ"
}