{
  "url": "https://www.pymnts.com/cpi-posts/judge-dismisses-antitrust-case-against-major-banks-over-bond-pricing/",
  "authorsByline": "CPI",
  "articleId": "04663fdb0f074abe81c1360ca02d8b9e",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/07/small-lenders-tariff-banks.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T19:32:11+00:00",
  "addDate": "2025-09-02T19:47:01.786579+00:00",
  "refreshDate": "2025-09-02T19:47:01.786581+00:00",
  "score": 1.0,
  "title": "Judge Dismisses Antitrust Case Against Major Banks Over Bond Pricing",
  "description": "A U.S. federal judge has dismissed an antitrust lawsuit that accused ten of the world’s largest banks of conspiring to inflate prices in the corporate",
  "content": "A U.S. federal judge has dismissed an antitrust lawsuit that accused ten of the world’s largest banks of conspiring to inflate prices in the corporate bond market, according to Reuters.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe case, filed by investors, alleged that Bank of America, Barclays, Citigroup, Credit Suisse, Deutsche Bank, Goldman Sachs, JPMorgan Chase, Morgan Stanley, NatWest and Wells Fargo colluded to overcharge clients on so-called “odd-lot” bond trades, which typically involve fewer than 1,000 bonds or transactions valued at under $1 million. These trades make up the majority of corporate bond activity. Investors claimed the banks charged spreads up to 300% higher than those applied to larger transactions, per Reuters.\n\nU.S. District Judge Valerie Caproni in Manhattan ruled that the plaintiffs had not proven that the banks worked together to manipulate trading platforms or to shut out competitors offering fairer pricing. She noted that although the institutions accounted for roughly 65% of underwriting and 90% of trading in corporate bonds, this alone did not establish control over secondary market pricing. Caproni also found no evidence of illegal activity in the four years preceding the April 2020 filing, a gap that undermined the case under the Sherman Antitrust Act.\n\nRead more: Benefits and Challenges of Open Banking\n\nThe dismissal was issued with prejudice, meaning the lawsuit cannot be refiled. Attorneys representing the investors did not immediately comment on the ruling, according to Reuters.\n\nThe case had a complicated history. It was first dismissed in October 2021 by Judge Lewis Liman. Months later, his clerk revealed that Liman’s wife owned shares in Bank of America while the case was pending. Though the appeals court later found the conflict likely unintentional, it revived the lawsuit in July 2024, saying the judge’s impartiality could reasonably be questioned. Liman was never accused of misconduct.\n\nThe case is titled Litovich v. Bank of America Corp. et al., in the Southern District of New York, No. 20-03154.",
  "medium": "Article",
  "links": [
    "https://www.pymnts.com/cpi-posts/benefits-and-challenges-of-open-banking/",
    "https://www.reuters.com/sustainability/boards-policy-regulation/ten-big-banks-defeat-antitrust-lawsuit-us-over-bond-trades-2025-09-02/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "corporate bond activity",
      "weight": 0.086813524
    },
    {
      "name": "corporate bonds",
      "weight": 0.085242726
    },
    {
      "name": "Antitrust Case",
      "weight": 0.08173319
    },
    {
      "name": "Bond Pricing",
      "weight": 0.07821128
    },
    {
      "name": "Deutsche Bank",
      "weight": 0.07136488
    },
    {
      "name": "U.S. District Judge Valerie Caproni",
      "weight": 0.069520764
    },
    {
      "name": "Major Banks",
      "weight": 0.06812518
    },
    {
      "name": "Bank",
      "weight": 0.066475086
    },
    {
      "name": "America Corp.",
      "weight": 0.06391631
    },
    {
      "name": "Judge Lewis Liman",
      "weight": 0.06359752
    }
  ],
  "topics": [
    {
      "name": "Antitrust"
    },
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.91845703125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.86474609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.8291015625
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.80810546875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7802734375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.767578125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.6953125
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.68701171875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.39013671875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.368408203125
    },
    {
      "name": "/Law & Government/Legal/Legal Services",
      "score": 0.3310546875
    }
  ],
  "sentiment": {
    "positive": 0.06286092,
    "negative": 0.66274714,
    "neutral": 0.27439198
  },
  "summary": "A U.S. federal judge has dismissed a lawsuit alleging that ten of the world's largest banks, including Bank of America, Barclays, Citigroup, Credit Suisse, Deutsche Bank, Goldman Sachs, JPMorgan Chase, Morgan Stanley, NatWest and Wells Fargo, alleging that they conspired to inflate prices in the corporate bond market. The judge dismissed the lawsuit with prejudice, stating there was no evidence of collusion. The case had a complicated history, first dismissed in 2021 by Judge Lewis Liman, whose wife owned shares in Bank of England while the case was pending.",
  "shortSummary": "A US judge dismissed an antitrust lawsuit against ten major banks, citing insufficient evidence and a potential conflict of interest.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "cedbeaf0bdfb46b99d8803bdb8db675b",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "A U.S. federal judge dismissed an antitrust lawsuit alleging that ten major banks conspired to inflate odd‑lot corporate bond prices. The judge found no evidence of coordinated manipulation or illegal activity in the four years before the 2020 filing, and ruled the plaintiffs had not proven the banks worked together to set spreads. The dismissal is with prejudice, preventing the case from being refiled. The lawsuit had previously been dismissed in 2021, revived in 2024 after a judge’s conflict of interest was questioned, and is now closed.",
  "argos_id": "AVZ5IMG8U"
}