{
  "url": "https://9to5mac.com/2025/09/02/deals-m4-mac-mini-m4-ipad-pro-iphone-15-pro-max/?extended-comments=1",
  "authorsByline": "Justin Kahn",
  "articleId": "00f056d0c9f94bc1b0b5a15681eb6066",
  "source": {
    "domain": "9to5mac.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/09/Apple-deals-iPhone-iPad-Pro-Mac-mini.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T15:45:00+00:00",
  "addDate": "2025-09-02T15:54:39.342436+00:00",
  "refreshDate": "2025-09-02T15:54:39.342439+00:00",
  "score": 1.0,
  "title": "Deals: M4 Mac mini, M4 iPad Pro, iPhone 15 Pro Max, more 9to5Mac",
  "description": "There are still plenty of notable Apple Labor Day deals still live in our master hub right here, but today’s...",
  "content": "There are still plenty of notable Apple Labor Day deals still live in our master hub right here, but today’s 9to5Toys Lunch Break does have some additional offers that should be on your radar. Firstly, we have an even lower price on the M4 Mac mini with 24GB of RAM and 1TB of storage at $200 off the list price (now an additional $100 off). Next up we are taking a look at Apple’s 1TB 11-inch M4 iPad Pro Wi-Fi + Cell model at a giant $500 off ahead of the upcoming padOS updates alongside the 1TB iPhone 15 Pro Max at $730 off ahead of the iPhone 17 reveal next week. All of that and more awaits down below.\n\nApple’s 24GB M4 Mac mini with 1TB upgrade drops even lower at $200 off the list price\n\nB&H had a number of upgraded M4 Mac mini deals live ahead of Labor Day this year, but just about all of them jumped back up to full price over the long weekend. However, one of these models is now even lower than it was last week. You’ll now find the latest M4 model configured with 24GB of RAM and the 1TB internal SSD at $200 off the list price.\n\nB&H is now offering the M4 Mac mini with 24GB of RAM and 1TB of storage down at $999 shipped. That’s $200 off the $1,199 list price you would pay at Apple, $100 under our previous mention, and the lowest we can find.\n\nThe most upgraded model you can find on Amazon is the 24GB variant with 512GB of RAM – you can’t buy the model B&H has on sale here today there at all. And for the record, we have never seen the 24GB/512GB model at a full $200 off via Amazon and it very rarely ever goes for better than $100 off.\n\nClearly the real value in the M4 Mac mini lineup for most potential customers is the low price of entry, and you’re not exactly getting that here with the $999 deal price on the 24GB/1TB – it is after all nearly double the price of the entry variant. But for folks looking to land something that will remain snappy and powerful for most likely years to come, or something to support more involved creative projects, there is some value in this rarely discounted configuration at $200 off the list price.\n\nM5 iPad Pro might be on the way, but 9to5 readers can score this M4 Pro at a giant $500 off\n\nWhile there are still some hangover Labor Day iPad deals up for grabs, like the $150 off most M3 iPad Air models, we wanted to shine a light on the exclusive iPad Pro offer we have secured for 9to5 readers. While the M5 lineup might very well be on the way sooner than later, it’s going to be a very long time before you can score over $500 off one of those like we have here today.\n\nAll things considered, the M4 iPad Pro will likely remain a more than compelling tablet for quite some time, especially with upcoming padOS updates. We are pretty convinced that, with the upcoming iPadOS 26, chances are pro-grade iPads will come even closer to delivering a full-on computer experience than ever before, and today’s deal will have you ready to do just that at a massive discount.\n\n9to5 readers can follow through any of the links in this post to land Apple’s 1TB 11-inch M4 iPad Pro Wi-Fi + Cell modelwith the nano-texture glass down at $1,394.07 shipped. That’s nearly $505 off the sticker price and the best we have tracked to date.\n\nWhen you click through it looks like the price is listed at $1,499, but if you scroll down and add it to your cart you’ll see the special 9to5 pricing.\n\nYou’re looking at an $1,899 configuration here that has never sold for less than $1,599 at Amazon where it is currently up at over $1,700. And, more realistically, it almost never drops below $1,699 and has only ever gone for less once.\n\nNeedless to say this is about as pricey as it is a giant discount. This sort of investment on an Apple tablet certainly isn’t for everyone, but if you have been considering the flip from MacBook to iPad the way some 9to5 staffers already have, and with iPadOS 26 on the horizon, this is a deal worth consideration.\n\nApple will reveal iPhone 17 in one week, but this 1TB iPhone 15 Pro Max is almost $730 off (Renewed Premium)\n\nApple will officially unleash iPhone 17 in exactly one week from today at its upcoming “Awe dropping”event. But for those not interested in paying the premium Apple’s latest and greatest will surely come along with – early leaks and reports suggest will be seeing a slight price increase this year too, Amazon Premium Renewed listings on the spec’d out iPhone 15 Pro Max have dropped even lower. You can land one at nearly $730 off the original list price right now.\n\nAmazon’s Premium Renewed listing on the 1TB iPhone 15 Pro Max in the Black Titanium colorway has now dropped to 871.90 shipped. That’s still a pretty penny to drop down, but just remember we are talking about an Apple Intelligence-capable 1TB Pro Max iPhone here that originally fetched $1,599 at launch. This very same phone would have costed you over $1,600 with tax buying it straight from Apple in early September 2024.\n\nIt’s certainly not the iPhone 16 Pro, and we are less than 7 days from the reveal of the series 17 lineup, but the 15 Pro Max is still a more than capable device and you can land one at a giant discount right now – the difference in price between this 15 Pro Max listing and a comparable 17 Pro Max is almost as much as a brand new iPhone 17 standard.\n\nBlack 1TB iPhone 16 Pro now $470 off the list price ahead of 17 launch (Amazon Renewed Premium)\n\nApple’s latest M3 iPad Air lineup at Amazon all-time low pricing, all models $150 off from $449\n• Anker 2025 Labor Day sale serving up to 45% off latest Nano chargers, MagSafe stands, more from just $10\n• This 7-in-1 USB-C hub has a hidden Type-C cable and adapter compartment, now $39.50 (Reg. $65)\n• This code slashes 40% off ORICO’s metal USB 4 M.2 NVMe SSD enclosure with 40Gb/s transfer speeds, now $42\n• Lexar’s tiny 1TB Go portable SSD adds 4K Apple Pro Res action to iPhone, and it’s down to its lowest price today at $105\n• This originally $100 3-in-1 charging cube for your entire Apple kit just dropped to $22.50 low\n\nApple Labor Day deals: MacBook, iPhone up to $720 off, AirPods from $90, more\n\nM4 MacBook Air from $799 might be the best bang for your buck in Apple gear right now ($200 off)\n\nAmazon is still offering just about every single M4 MacBook Air configuration out there at the lowest we have tracked online. These deals have been live for quite some time now, but after detailing why we think they might be among the best Apple deals of the year, and considering they are the latest 2025 releases of one of the most universally appealing pieces of Apple kit in the lineup, they deserve to be front and center once again. This includes both the 13- and 15-inch models across all storage capacities and colors at $200 off with prices starting from $799 shipped.\n\nThere have been a few very short-lived, one-off disocunts on select models in particular colors for a touch less than we are seeing right now, but you are, by in large, looking at the best deals that have been offered online, and the best chance to land any of the configs/colors in the lineup with a sweet deal.\n\nOn top of what you might call the standard configurations listed above, we have also uncovered some $200 price drops outside of Amazon on configs you can’t even buy there:\n\nIt is also worth mentioning that these are some of the best investments on an Apple laptop you can make right now in a couple different ways. Firstly, the MacBook Air, especially the latest generation that started at $100 less this year, is the most affordable way to bring home a new MacBook. And now with the new 16GB of RAM starter tier at $200 off the list price, you’re really getting some bang for your buck.\n\nSecondly, you’re getting a machine barely half way through its lifecycle, and that’s if Apple upgrades them to the M5 chip next spring (it probably will). While we are tracking a gigantic collection of Apple gear on sale this weekend, the M4 MacBook Air is one of the only products in the sale that isn’t likely to see a new model take the reigns sometime this fall. There are others, but the bulk of the big ticket gear will see new models land in the coming month(s).\n\nJBL introduces its new and rugged Grip portable Bluetooth speaker for preorder at $100\n\nHere are the LEGO sets releasing in September 2025 from Icons, Ideas, DC, Marvel, Disney, more + advent calendars and GWPs",
  "medium": "Article",
  "links": [
    "https://9to5toys.com/2025/08/29/black-titanium-1tb-iphone-16-pro/",
    "https://9to5toys.com/2025/09/02/team-cherry-free-switch-2-hollow-knight-silksong-upgrade-pack/",
    "https://9to5toys.com/2025/08/29/orico-usb-4-40gb-s-m-2-nvme-ssd-enclosure/",
    "https://9to5toys.com/2025/09/01/apple-labor-day-deals-macbook-airpods/",
    "https://9to5toys.com/2025/09/02/here-are-the-lego-sets-releasing-in-september-2025-from-icons-ideas-dc-marvel-disney-more-advent-calendars-and-gwps/",
    "https://9to5toys.com/2025/09/02/jbl-grip-portable-bluetooth-speaker-preorder-100/",
    "https://9to5toys.com/2025/08/29/jsaux-omnicase-7-in-1-usb-c-hub-with-cable-storage/",
    "https://9to5toys.com/2025/09/01/anker-167-5w-car-charger-3/",
    "https://9to5toys.com/2025/09/02/m5-ipad-pro-m4-discount/",
    "https://9to5toys.com/2025/09/02/lexar-1tb-go-portable-ssd-lowest-price-today-at-105/",
    "https://9to5toys.com/2025/09/02/apple-m3-ipad-air-best-price-labor-day/",
    "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
    "https://9to5toys.com/2025/09/02/charging-cube-for-entire-apple-kit-just-22-low/",
    "https://9to5toys.com/2025/09/02/spigen-apple-watch-trail-loop-band-2/",
    "https://9to5toys.com/2025/09/02/apple-reveal-iphone-17-iphone-15-pro-max/",
    "https://9to5toys.com/2025/09/01/best-labor-day-deals-3/",
    "https://9to5toys.com/2025/09/02/apple-24gb-mac-mini-1tb-deal/",
    "https://9to5toys.com/2025/09/01/anker-2025-labor-day-sale-up-to-45-off-just-10/",
    "https://9to5toys.com/2025/08/28/latest-m4-macbook-air-best-apple-deal/"
  ],
  "labels": [
    {
      "name": "Paid News"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "M4 iPad Pro",
      "weight": 0.09580234
    },
    {
      "name": "Apple Pro Res",
      "weight": 0.09546701
    },
    {
      "name": "Apple Labor Day deals",
      "weight": 0.090158075
    },
    {
      "name": "iPad Pro",
      "weight": 0.085740425
    },
    {
      "name": "notable Apple Labor Day deals",
      "weight": 0.08535044
    },
    {
      "name": "Apple gear",
      "weight": 0.08355718
    },
    {
      "name": "M5 iPad Pro",
      "weight": 0.082325466
    },
    {
      "name": "Apple",
      "weight": 0.08155576
    },
    {
      "name": "Apple kit",
      "weight": 0.081406526
    },
    {
      "name": "Pro Max",
      "weight": 0.079225436
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    },
    {
      "name": "iPad"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.9052734375
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.83740234375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.69482421875
    },
    {
      "name": "/News/Technology News",
      "score": 0.67578125
    },
    {
      "name": "/Shopping/Consumer Resources/Coupons & Discount Offers",
      "score": 0.323974609375
    }
  ],
  "sentiment": {
    "positive": 0.08211367,
    "negative": 0.59153086,
    "neutral": 0.32635552
  },
  "summary": "Apple's M4 Mac mini with 24GB of RAM and 1TB of storage is now discounted at $200 off the list price, an additional $100 off. The 1TB 11-inch M4 iPad Pro Wi-Fi + Cell model is also $500 off, ahead of upcoming padOS updates and the 1TB iPhone 15 Pro Max at $730 off ahead of the iPhone 17 reveal next week. B&H is now offering the latest M4 model with 24 GB/512GB model at $999 shipped, making it the lowest-price Amazon is currently offering. While there are still some Labor Day deals, 9to5 readers can also purchase an exclusive iPad Pro for $500.",
  "shortSummary": "Apple Labor Day deals include M4 Mac mini with 24GB RAM and 1TB storage, 1TB iPad Pro with a giant $500 discount ahead of the iPhone 17 reveal.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "944df6ce46e949809dca19dca229d5ca",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://9to5toys.com/2025/08/29/jsaux-omnicase-7-in-1-usb-c-hub-with-cable-storage/",
      "text": "JSAUX OmniCase 7-in-1 USB-C Hub with Cable Storage\nBuy for $39.50 (Reg. $65)\nApply code PZC7INDL during checkout\nWhat we love\nThis hub differentiates itself with a built-in storage compartment for various cables and adapters. Inside you’ll find a USB-C cable as well as Lightning and microUSB adapters. There’s even an SIM tray removal tool and a slot for a spare SIM card. In terms of I/O, you’ll have Ethernet, USB-A, Type-C, HDMI, as well as microSD and full-size SD card slots.\nMore curated coverage for you\nJSAUX OmniCase 7-in-1 USB-C Hub with Cable Storage features:\n- 【7-in-1 Docking Station】JSAUX Docking Station has an HDMI 4K@30Hz output, an RJ45/Ethernet input, a 100W USB C port for charging and dual USB A 3.0 ports. SD and TF card readers up to 104MB/S fast transmission. You can explore new way to play with Steam Deck.\n- 【4K@30Hz HDMI Output】The usb c hub comes with a 4K@30Hz HDMI output. When you connect an external 4K monitor, it can provide you clearer visual experience, so you can enjoy the visual feast on your games.\n- 【Fast Charging Speed】JSAUX docking station supports 100W Max power delivery, which is sufficient to charge your Steam Deck at full speed when paired with the original charger. (Note: the MAX charging speed of Steam Deck is 45W)\n- 【JSAUX Exclusive Patent Design】Not only a docking station, but also an electronic organizer. The electronic organizer has multiple types of cables and adapters, which can be conveniently taken out and connected to your devices. You will get: USB C to USB C Cable，USB C to Lightning Cable (MFI Certification)，USB A to USB C Female Adapter, Micro USB to USB C Female Adapter, Eject Pin and Sim Card Slot.\n- 【Compatibility】This docking station is compatible with the device has USB C port. It is small and has a electronic organizer which is convenient to carry out and use. Just bring this docking station meet your multiple port device charging and data transmission needs.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/01/best-labor-day-deals-3/",
      "text": "Labor Day has arrived and we have now collected all of the best deals carrying through the long weekend. The Amazon Labor Day sale, alongside events at Walmart, Best Buy and others kicked off well ahead of time this year and we have been featuring all of the most notable discounts across a massive selection of product categories for the better part of two weeks now. While not all of those offers are still be up for grabs through today, many of them are and you will find them all ready and waiting down below.\nTable of contents\nApple\nThis year’s Apple deals are headlined by one of the lowest prices we have tracked to date on the base model AirPods – the most affordable current-gen set that isn’t likely to be replace this year. The deals then carry through to both the M4 MacBook Pro and MacBook Air lineups at up to $300 off the list prices alongside price drops on iPad Pro, iPad Air, and iPad mini configs as well as iPhone 15 /16 Pro.\nAirPods\n- AirPods 4 $90 (Reg. $129)\n- AirPods 4 w/ ANC $139 (Reg. $179)\nMacBook\n- 13-inch M4 MacBook Air 16GB/256GB $799 (Reg. $999)\n- 13-inch M4 MacBook Air 16GB/512GB $999 (Reg. $1,199)\n- 13-inch M4 MacBook Air 24GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 16GB/256GB $999 (Reg. $1,199)\n- 15-inch M4 MacBook Air 16GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 24GB/512GB $1,399 (Reg. $1,599)\nM4/Pro MacBook Pro\n- 14-inch M4 MacBook Pro 16GB/512GB from $1,299 (Reg. $1,599)\n- 14-inch M4 MacBook Pro 16GB/1TB from $1,499 (Reg. $1,799)\n- 14-inch M4 MacBook Pro 24GB/1TB from $1,699 (Reg. $1,999)\n- 14-inch M4 Pro MacBook Pro 24GB/512GB from $1,699 (Reg. $1,999)\n- 14-inch M4 Pro MacBook Pro 24GB/1TB from $2,099 (Reg. $2,399)\n- 14-inch M4 Max MacBook Pro 24GB/1TB from $2,899 (Reg. $3,199)\nM4 iPad Pro\n- M4 iPad Pro 11-inch\n- Apple M4 iPad Pro 11-inch 256GB $895 (Reg. $999)\n- Apple M4 iPad Pro 11-inch 512GB $1,075 (Reg. $1,199)\n- Apple M4 iPad Pro 11-inch 1TB $1,461 (Reg. $1,599)\n- Apple M4 iPad Pro 11-inch 2TB $1,809 (Reg. $1,999)\n- M4 iPad Pro 13-inch\n- Apple M4 iPad Pro 13-inch 256GB $1,099 (Reg. $1,299)\n- Apple M4 iPad Pro 13-inch 512GB $1,299 (Reg. $1,499)\n- Apple M4 iPad Pro 13-inch 1TB $1,699 (Reg. $1,899)\n- Apple M4 iPad Pro 13-inch 2TB $2,049 (Reg. $2,299)\niPad mini 7\n- iPad mini 7 128GB $399 (Reg. $499)\n- iPad mini 7 256GB $499 (Reg. $599)\n- iPad mini 7 512GB $699 (Reg. $799)\nM3 iPad Air\n- M3 iPad Air 11-inch\n- 11-inch M3 iPad Air 128GB from $449 (Reg. $599)\n- 11-inch M3 iPad Air 256GB from $549 (Reg. $699)\n- 11-inch M3 iPad Air 512GB from $749 (Reg. $899)\n- 11-inch M3 iPad Air 1TB from $949 (Reg. $1,099)\n- M3 iPad Air 13-inch\n- 13-inch M3 iPad Air 128GB from $649 (Reg. $799)\n- 13-inch M3 iPad Air 256GB from $749 (Reg. $899)\n- 13-inch M3 iPad Air 512GB from $949 (Reg. $1,099)\n- 13-inch M3 iPad Air 1TB from $1,149 (Reg. $1,299)\nSamsung\nMac Accessories\nSmartphone Accessories\nHeadphones\nGreen Deals\nPC\nPC Gaming\nSmart Home\nSmart TV\nHome Goods\nAmazon Tech\nFire HD tablets\n- Amazon Fire HD 8 tablet from $65 (Reg. $100)\n- Amazon Fire HD 10 tablet from $90 (Reg. $140)\n- Amazon Fire Max 11 tablet from $175 (Reg. $230)\n- Amazon Fire 7 Kids tablet $70 (Reg. $110)\n- Amazon Fire HD 8 Kids $95 (Reg. $150)\n- Amazon Fire HD 8 Kids Pro tablet $105 (Reg. $160)\n- Amazon Fire HD 10 Kids Pro $135 (Reg. $190)\nKindle e-readers\n- Amazon Kindle Colorsoft 16GB $220 (Reg. $250)\n- Amazon Kindle Colorsoft Kids 16GB $240 (Reg. $270)\n- Amazon Kindle 16GB $90 (Reg. $110)\nFire TV Stick streaming media players\n- Amazon Fire TV Stick HD $25 (Reg. $35)\n- Amazon Fire TV Stick 4K $30 (Reg. $50)\n- Amazon Fire TV Stick 4K Max $40 (Reg. $60)\n- Amazon Fire TV Cube $100 (Reg. $140)\nEcho Hub\n- Amazon Echo Hub $130 (Reg. $180)\nAmazon Echo smart speakers\n- Amazon Echo Pop $28 (Reg. $40)\n- Amazon Echo Spot $65 (Reg. $80)\n- STAR WARS Echo Dot Bundle $88 (Reg. $110)\n- Amazon Echo Pop Kids $29 (Reg. $50)\n- Amazon Echo Dot Kids $39 (Reg. $60)\n- And even more…\nBlink Video Doorbell\n- Blink Video Doorbell w/ Sync module$40 (Reg. $70)\n- Blink Video Doorbel $35 (Reg. $60)\n- Blink Outdoor 4 2-pack $90 (Reg. $180)\n- And even more…\nRing Battery Doorbells\n- Ring Battery Doorbell $55 (Reg. $100)\n- Ring Battery Doorbell Plus $100 (Reg. $150)\n- Ring Battery Doorbell Pro $180 (Reg. $230)\nAmazon Echo Buds\n- Amazon Alexa Echo Buds with noise cancellation $55 (Reg. $140)\n- With wireless charging case\n- Amazon Alexa Echo Buds with noise cancellation $45 (Reg. $120)\n- With wired charging case\n- Amazon Alexa Echo Buds $25 (Reg. $50)\nUpdating…\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/08/29/black-titanium-1tb-iphone-16-pro/",
      "text": "While we did see the White, Natural, and Dessert titanium models for slightly less recently, Amazon has now once again dropped the price on the black 1TB iPhone 16 Pro. Its higher-end Renewed Premium list for the Black Titanium 1TB model has now dropped down to $1,029 shipped, or $470 off the new unlocked list price at Apple.\nWe have seen these 1TB models drop as low as $1,010 in the last few months, but deals on the black model at anywhere under $1,099 have been far and few between otherwise. Today’s deal is the second-lowest price we have tracked on Amazon for this one, landing within $19 of the best price ever. Considering this is a regularly $1,499 configuration of Apple’s latest and greatest, the difference is negligible at best.\nIt is also worth noting that the other three colors – Natural Titanium, White, and Desert Titanium – are also sitting at the same price as the black variant.\nNow, we are less than a month out from the reveal of iPhone 17, and more like a few weeks really, but these Renewed Premium offers at Amazon are a great way to land a new unlocked handset at dramatically lower prices. You’re certainly not going to be scoring any major deals on iPhone 17 unless you have a relatively new device to trade-in against it, and we didn’t see the 16 Pro deals pop up until well into the following year. If you must have the latest and greatest, then by all means hold out a few weeks, but if you’re looking for a serious deal on an iPhone that will still feel new for at least another year, today’s deal is worth a look.\nAlongside the 1-year warranty, you can get more details on the Amazon Renewed units below:\nAmazon Renewed is your trusted destination for pre-owned and refurbished products that are inspected and tested to work and look like new. Any repairs are made with Apple components that are new, or reused and in like-new condition. The products will have minimal to no signs of wear, no visible cosmetic imperfections when held 12 inches away, batteries with at least 80% capacity relative to new, and may arrive in a brown or white box with relevant accessories (no headphones included) that may be generic.\n- This pre-owned product is not Apple certified, but has been professionally inspected, tested and cleaned by Amazon-qualified suppliers.\n- There will be no visible cosmetic imperfections when held at an arm’s length. There will be no visible cosmetic imperfections when held at an arm’s length.\n- This product will have a battery which exceeds 80% capacity relative to new.\n- Accessories will not be original, but will be compatible and fully functional. Product may come in generic Box.\n- This product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/spigen-apple-watch-trail-loop-band-2/",
      "text": "Update: This popular deal is still live. Details below in the original post.\nSpigen’s 2025 Athlex Apple Watch band is one of the best new accessories I have had a chance to test out this year. There’s certainly higher-end straps out there for your Apple wrist computer, but since quickly jumping in price shortly after launch, you can now land one of the most comfortable Apple Watch straps I have in my collection at under $22 Prime shipped at Amazon today.\nCourtesy of the brand’s official Amazon storefront, you’ll now find the Spigen Athlex Apple Watch brand down at $21.99 with free shipping for Prime members or in orders over $35. Today’s deal includes all four colors as well: black, navy, green, and gray.\nAgain, this band launched at $20, but it quickly went out of stock for a short time in some colors and then carried a $25 list price without moving since mid April. Today, however, we are catching the first chance to save since on what I would consider to be one of the best bands you can buy for this price.\nThe first thing to say about this strap is that is has that Apple Trail Loop vibe at a fraction of the $99 one of those will run you. It’s not quite as high-end as one of those overall, but for me it is a wonderful alternative for folks looking to side-step the Apple tax.\nThe next thing I would want to highlight for anyone considering picking one up is the wearing experience – this thing is incredibly comfortable to wear for me. I tend to favor metal bracelets and leather straps from brands like SANDMARC, Nomad, and Burton Goods, but on a hot day running errands, out for a walk, or even exercising, the Spigen Athlex strap has been a go-to for me for months now.\nAnything else I have to say about this band is, of course, waiting in my full Tested with 9to5Toys review you can check out right here.\nSpigen Athlex Apple Watch band features:\n- Premium Comfortable Fabric Band: Experience all-day comfort with a premium fabric band for your Apple Watch\n- Secure Hook and Loop Fastener: Easily adjust the fit and ensure a secure hold on your wrist with a sleek hook and loop fastener\n- Innovative Loop Design: Prevents accidental detachment when adjusting the band, so you get the perfect fit without any slips\n- Sporty Yellow Stitching: Add a pop of color to your wrist with our stylish yellow stitching for sporty accents on 3 unique colorways\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/apple-reveal-iphone-17-iphone-15-pro-max/",
      "text": "Apple will officially unleash iPhone 17 in exactly one week from today at its upcoming “Awe dropping” event. But for those not interested in paying the premium Apple’s latest and greatest will surely come along with – early leaks and reports suggest will be seeing a slight price increase this year too, Amazon Premium Renewed listings on the spec’d out iPhone 15 Pro Max have dropped even lower. You can land one at nearly $730 off the original list price right now.\nAmazon’s Premium Renewed listing on the 1TB iPhone 15 Pro Max in the Black Titanium colorway has now dropped to 871.90 shipped. That’s still a pretty penny to drop down, but just remember we are talking about an Apple Intelligence-capable 1TB Pro Max iPhone here that originally fetched $1,599 at launch. This very same phone would have costed you over $1,600 with tax buying it straight from Apple in early September 2024.\nIt’s certainly not the iPhone 16 Pro, and we are less than 7 days from the reveal of the series 17 lineup, but the 15 Pro Max is still a more than capable device and you can land one at a giant discount right now – the difference in price between this 15 Pro Max listing and a comparable 17 Pro Max is almost as much as a brand new iPhone 17 standard.\nAmazon Renewed is your trusted destination for pre-owned and refurbished products that are inspected and tested to work and look like new. Any repairs are made with Apple components that are new, or reused and in like-new condition. The products will have minimal to no signs of wear, no visible cosmetic imperfections when held 12 inches away, batteries with at least 80% capacity relative to new, and may arrive in a brown or white box with relevant accessories (no headphones included) that may be generic.\n- This product is eligible for a replacement or refund within 90 days of receipt if you are not satisfied.\n- This pre-owned product is not Apple certified, but has been professionally inspected, tested and cleaned by Amazon-qualified suppliers.\n- There will be no visible cosmetic imperfections when held at an arm’s length. There will be no visible cosmetic imperfections when held at an arm’s length.\n- This product will have a battery which exceeds 80% capacity relative to new.\n- Accessories will not be original, but will be compatible and fully functional. Product may come in generic Box.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/jbl-grip-portable-bluetooth-speaker-preorder-100/",
      "text": "Among the seemingly endless number of Bluetooth speakers that are on the market, JBL has remained at the top of them for a long time, and today, the popular audio brand is giving folks the chance to preorder its latest evolution, the JBL Grip. Featuring pro-grade sound quality, ambient lighting, an IP68 construction, and more – this new speaker promises adaptability alongside reliable audio that we all have come to expect from the brand. Head below to get the rundown on what you’ll be getting, as well as pricing and official release details.\nThe JBL Grip – “small in size, big on sound”\nJBL’s new Grip Portable Bluetooth Speaker comes along sporting a similar design to some past models, keeping to a more cylindrical IP68-rated design that provides audio how you want to listen to it, wherever you want to listen. Aside from the five bright colorways, the compact form factor also sports an integrated rope hook, making it easy to attach to backpacks, bikes, kayaks, and more for audio on the go. What’s more, there’s ambient lighting on its back panel, which you can customize to pair with your playlist through its companion app.\nThis new speaker comes equipped with the brand’s AI Sound Boost, delivering even more power-driven and deeper bass without distortion issues, bolstered further by 16W of output and JBL Pro Sound. You’ll be getting 12 hours of wireless playback here – plus, an additional two hours when its Playtime Boost mode is activated, which optimizes and tunes its system for even sharper quality. You’ll also find it offering Auracast alongside Bluetooth 5.4 to pair two speakers and achieve stereo sound or go bigger with multiple speakers connected for a truly dynamic audio experience.\nJBL has been the category leader in portable speakers since we launched JBL Flip in 2012. The all new JBL Grip continues to push the category forward with proof that we’re not standing still as we deliver great sound at a very affordable price. We are excited to add Grip to our lineup, showing once again that there’s a JBL speaker for every moment, every mood, and every budget.\nYou can currently preorder JBL’s Grip Portable Bluetooth Speaker directly on the brand’s website for $99.95 shipped, which is slated to being shipping on September 28, 2025. As mentioned, there are five colors to choose from: black, white, red, purple, and blue.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/m5-ipad-pro-m4-discount/",
      "text": "While there are still some hangover Labor Day iPad deals up for grabs, like the $150 off most M3 iPad Air models, we wanted to shine a light on the exclusive iPad Pro offer we have secured for 9to5 readers. While the M5 lineup might very well be on the way sooner than later, it’s going to be a very long time before you can score over $500 off one of those like we have here today.\nAll things considered, the M4 iPad Pro will likely remain a more than compelling tablet for quite some time, especially with upcoming padOS updates. We are pretty convinced that, with the upcoming iPadOS 26, chances are pro-grade iPads will come even closer to delivering a full-on computer experience than ever before, and today’s deal will have you ready to do just that at a massive discount.\n9to5 readers can follow through any of the links in this post to land Apple’s 1TB 11-inch M4 iPad Pro Wi-Fi + Cell model with the nano-texture glass down at $1,394.07 shipped. That’s nearly $505 off the sticker price and the best we have tracked to date.\nWhen you click through it looks like the price is listed at $1,499, but if you scroll down and add it to your cart you’ll see the special 9to5 pricing.\nYou’re looking at an $1,899 configuration here that has never sold for less than $1,599 at Amazon where it is currently up at over $1,700. And, more realistically, it almost never drops below $1,699 and has only ever gone for less once.\nNeedless to say this is about as pricey as it is a giant discount. This sort of investment on an Apple tablet certainly isn’t for everyone, but if you have been considering the flip from MacBook to iPad the way some 9to5 staffers already have, and with iPadOS 26 on the horizon, this is a deal worth consideration.\nM4 iPad Pro features:\niPad Pro is the ultimate iPad experience in an impossibly thin and light design. Featuring the breakthrough Ultra Retina XDR display, outrageous performance from the M4 chip, superfast wireless connectivity,* and compatibility with Apple Pencil Pro.* Plus powerful productivity features in iPadOS. Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple.*\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/01/anker-2025-labor-day-sale-up-to-45-off-just-10/",
      "text": "Anker’s Labor Day sale is now going strong with 20% off sitewide on its online store, and many of those are either matched or going for even less over at Amazon. The brand’s official Amazon storefront is offering some solid discounts right now across its lineup of Prime charging stations, MagSafe Qi2 charging stand, power banks, and more. You’ll also find discounts on the brand’s latest Nano charging gear, including the new display-equipped 7-in-1 Nano charging station as well as the 10,000mAh Nano power bank with a built-in cable. Head below for more details.\nAnker’s 2025 Labor Day sale now live\nAnker’s Labor Day 2025 sale is now live and kicking, offering some discounts across the brand’s latest charging gear. Here’s a quick rundown of some of the best deals we’ve found so far:\n- Anker 25,000mAh Laptop Power Bank with display $95 (Reg. $135)\n- Anker 140W 4-port charger with display $80 (Reg. $100)\n- Anker 7-in-1 Nano charging station with display $76.50 (Reg. $90)\n- Anker 10,000mAh Nano power bank with retractable cable $50 (Reg. $60)\n- Anker Prime 240W Flat Charging Station $99 (Reg. $165)\n- Anker 250W Prime USB-C charging station $140 (Reg. $170)\n- 200W 6-port Anker Prime charger $65 (Reg. $86)\n- Anker MagGo UFO 3-in-1 Qi2 charging station $63 (Reg. $90)\n- Anker MagGo USB-C SD card reader $10 (Reg. $25)\n- And even more…\nOne of the more notable deals of the lot drops the brand’s popular 100W 9-in-1 desktop charging station down to $33.99 with free shipping for Prime members or in orders over $35. This is originally a $60 charging unit that has lately been fetching $46. Today’s deal shaves an additional $12 off to land it $2 below its previous all-time low and our mention from a couple of months back. It’s a pretty capable charger sporting four USB-C ports (up to 100W), two USB-A ports, and 3AC outlets. It also offers built-in surge protection and has a 5-foot flat cable and plug attached to it.\nBe sure to stop by Anker’s official Amazon storefront to catch more deals across a massive selection of the brand’s tech accessories, chargers, headphones, speakers, and more.\nAnker 9-in-1 100W USB-C charging station features:\n- The Ultimate 9-in-1 Power Strip: Embrace the convenience of having 4 USB-C ports, 3 AC outlets, and 2 USB-A ports in one sleek, compact charging station.\n- Maximize Your Charging: Boasting a 100W capacity, this USB-C charging station delivers fast, efficient charging for all your high-power gadgets. *To achieve full 100W charging capacity, an E-Marker certified cable is required.\n- Efficient and Tidy: Enjoy a tidy charging station with our unique design, featuring AC outlets on three sides to keep cords organized and the front area free for USB devices.\n- Sleek and Subtle: Upgrade your space with the ultra-slim 0.35 in plug and flat wire design, ensuring effortless integration and a sleek, modern look.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/charging-cube-for-entire-apple-kit-just-22-low/",
      "text": "LISEN 3-in-1 wireless charging cube\nBuy for $22.50 (Reg. $40)\nEnter promo code OOBSAS76 for $17 off.\nWhat we love\nThis all-in-one charging station can power your entire portable Apple setup at the same time, then fold down into a compact cube when not in use for easy storage. It includes three dedicated wireless charging pads – one for your iPhone, one for AirPods, and one for Apple Watch. The iPhone pad delivers up to 7.5W, while the AirPods and Apple Watch pads each offer 2.5W.\nMore curated coverage for you\nLISEN 3-in-1 wireless charging cube features:\n- Compact and Portable Design: Our foldable 3 in 1 charging station is designed to be travel-ready, fitting easily into your palm or pocket. Whether you’re at home, in the office, traveling, or in a meeting room, this sleek and stylish charger keeps your space organized and clutter-free. Its slim and lightweight design makes it the perfect companion for your busy lifestyle\n- Effortless Charging Experience: Say goodbye to tangled cables and hello to seamless charging with this MagSafe-compatible charger. Its strong magnetic connection ensures easy alignment and fast charging for your iPhone, Apple Watch, and AirPods\n- Sturdy and Stable Base: The charger’s grippy base and satisfying weight provide stability and peace of mind, keeping your devices securely in place while they charge\n- Versatile Usage: Not only does our charging station provide a convenient solution for charging your devices, but it also doubles as an adjustable stand for your iPhone. Whether you prefer to watch videos, make calls, or use your phone in landscape or portrait mode, this charger offers the flexibility you need. The anti-slip design ensures stability and safety while charging\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/lexar-1tb-go-portable-ssd-lowest-price-today-at-105/",
      "text": "We just spotted a deal at Amazon that drops Lexar’s 1TB Professional Go portable SSD in silver down to $104.99 shipped. Originally a $150 unit, this 1TB model has been hovering between $120 and $125 at Amazon since its recent Prime Day discount. Today’s 30% price cut knocks $45 off, bringing it back down to its lowest price. The 2TB variant of this SSD, which typically goes for $240, is also discounted down to $185 right now, so be sure to grab the one that suits your needs after getting more details below.\nThis ultra-compact external drive is fully compatible with iPhones, making it perfect for capturing high-quality 4K Apple ProRes footage from iPhone 15 or 16 Pro/Max (and likely 17 starting later this month). It’s available in 1TB and 2TB capacities, both of which deliver read and write speeds of up to 1,000MB/s. This plug-and-play drive comes with a built-in USB-C connector to ensure simple and reliable connectivity, and it’s also quite durable with a water-resistant build.\nBest Buy has some solid alternatives from Samsung that are now starting from just $40. These are the retailer’s Labor Day SSD deals that are still going strong, so be sure to grab them before they’re gone for good.\nLexar 1TB Professional Go SSD features:\n- Ultra-compact so you can always keep it with you for spontaneous creativity anytime, anywhere\n- Wireless plug-and-play Type-C connector frees you from tangled, cumbersome cables (press firmly to ensure drive is completely inserted before use)\n- Expand your smartphone’s storage instantly and enjoy seamless data transfers, as well as easy access to all your files\n- Blazing-fast performance 1050MB/s read and 1000MB/s write for seamless Apple ProRes 4K 60 fps recording, no dropped frames, and swift backups\n- Compatible with mobile phones, iPads, tablets, Macs, PCs, cameras, and many more Type-C devices\n- Ready for travel – it’s dust- and water-resistant (rated IP65), drop-resistant up to 1 meter, and comes with a protective silicone case\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://news.google.com/publications/CAAqBggKMLOFATDAGg?hl=en-US&gl=US&ceid=US:en",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://9to5toys.com/2025/09/02/apple-m3-ipad-air-best-price-labor-day/",
      "text": "Alongside the ongoing M4 MacBook Air lineup at $200 off and some of the exclusives we have secured for readers over the last month or so, one of the more notable sales we have seen on Apple gear is carrying through Labor Day – $150 off all of the Wi-Fi M3 iPad Air models. Far more powerful than the A series iPad and iPad mini, while coming in at dramatically lower prices than the M4 iPad Pro, the M3 iPad Air hits that sweet spot for many folks and especially so at $150 off the list prices.\nWe have already put together the best deals now live on Apple gear for Labor Day 2025, and one of the more notable of the bunch is landing across the current iPad Air lineup.\nAll of the base Wi-Fi models went $120 off for Prime Day this year back in early July, but now things are at all-times lows across every model for the second time, save for a few one-off discounts on more pricey configurations.\nAt $150 off, you’re looking at all-time low Amazon pricing on the most affordable configs in the lineup with the 11-inch form-factor now starting at $449 and the 13-inch at $649 – here’s how pricing looks across the lineup on the less expensive Wi-Fi only models:\nM3 iPad Air 11-inch\n- 11-inch M3 iPad Air 128GB from $449 (Reg. $599)\n- 11-inch M3 iPad Air 256GB from $549 (Reg. $699)\n- 11-inch M3 iPad Air 512GB from $749 (Reg. $899)\n- 11-inch M3 iPad Air 1TB from $949 (Reg. $1,099)\nM3 iPad Air 13-inch\n- 13-inch M3 iPad Air 128GB from $649 (Reg. $799)\n- 13-inch M3 iPad Air 256GB from $749 (Reg. $899)\n- 13-inch M3 iPad Air 512GB from $949 (Reg. $1,099)\n- 13-inch M3 iPad Air 1TB from $1,149 (Reg. $1,299)\nAnd, as mentioned above, you’ll want to take note of the exclusive offer we have secured for readers on the 11-inch M2 iPad Air with 512GB of storage and the Wi-Fi + Cell upgrade:\nApple M3 iPad Air features:\n- WHY IPAD AIR — iPad Air is powerful, versatile, and comes in a choice of two sizes. Featuring the incredible performance of the M3 chip built for Apple Intelligence and a stunning Liquid Retina display along with Touch ID, advanced cameras, blazing-fast Wi-Fi 6E, and a USB-C connector.\n- APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly.* With groundbreaking privacy protections integrated into the core of iPad, it gives you peace of mind that no one else can access your data — not even Apple.\n- PERFORMANCE AND STORAGE — M3 is a powerful chip built for Apple Intelligence that brings amazing performance for advanced creative and product tasks, graphic-intensive games, and smooth multitasking. And with all-day battery life, you can keep working and playing wherever you go.* Choose up to 1TB of storage depending on the room you need for apps, music, movies, and more.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/01/anker-167-5w-car-charger-3/",
      "text": "Anker 167.5W 3-Port USB-C Car Charger\nBuy for $36 (Reg. $54)\nWhat we love\nOn busy days commuting from one place to the next, it’s easy to find batteries running low on your devices. Thankfully, Anker and others have really leaned into very powerful car chargers like this. Here you’ll find a unit that can distribute up to 167.5W of power to three devices. This is dished out at up to 100W for it’s main USB-C port and the secondary Type-C output tops out at 45W. Finally, the USB-A port can reach 22.5W. Another perk is that Anker includes a USB-C cable to get you started.\nMore curated coverage for you\nAnker 167.5W 3-Port USB-C Car Charger features:\n- Triple-Port 167.5W Max: Seamlessly power up all your essential devices with the first USB-C port delivering a powerful 100W, the second USB-C port providing 45W, and the USB-A port adding an additional 22.5W.\n- Ultra-Fast 100W USB-C1 Port: With the first USB-C port offering 100W, quickly charge your 16-inch MacBook Pro from 0 to 50% in only 47 minutes.\n- Reliable 45W USB-C2 Port: The second USB-C port offers 45W max of power, providing fast and reliable charging for iPhones and Samsung devices, keeping you connected without any delays.\n- Tiny and Mighty: Designed to be unobtrusive, this super-compact charger won’t clutter your car’s interior.\n- What You Get: Anker Car Charger (167.5W, 3 Ports), 3.3 ft USB-C to USB-C cable, welcome guide, 18-month warranty, and our friendly customer service.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/01/apple-labor-day-deals-macbook-airpods/",
      "text": "Labor Day 2025 has officially arrived, and while there have been a serious number of notable price drops on Apple gear for over a week now, much of the best of them are still kicking today. The return of all-time low pricing across most M3 iPad Air models continues at $150 off alongside $100 price drops on iPad mini 7 and up to $200 off M4 iPad Pro. Those deals also join ongoing offers on M4 MacBook Air and M4 MacBook Pro at $200 and $300 off, respectively, as well as AirPods 4 at very close to the best price ever and a series of iPhone 15/16 Pro deals as well.\nLabor Day Apple deals\nAirPods 4 and AirPods Pro 2\n- AirPods 4 $90 (Reg. $129)\n- AirPods 4 w/ ANC $139 (Reg. $179)\n- AirPods Pro 2 $199 (Reg. $249) – we recommend waiting until they are closer to $170.\nM4 MacBook Air\n- 13-inch M4 MacBook Air 16GB/256GB $799 (Reg. $999)\n- 13-inch M4 MacBook Air 16GB/512GB $999 (Reg. $1,199)\n- 13-inch M4 MacBook Air 24GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 16GB/256GB $999 (Reg. $1,199)\n- 15-inch M4 MacBook Air 16GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 24GB/512GB $1,399 (Reg. $1,599)\nM4/Pro MacBook Pro\n- 14-inch M4 MacBook Pro 16GB/512GB from $1,299 (Reg. $1,599)\n- 14-inch M4 MacBook Pro 16GB/1TB from $1,499 (Reg. $1,799)\n- 14-inch M4 MacBook Pro 24GB/1TB from $1,699 (Reg. $1,999)\n- 14-inch M4 Pro MacBook Pro 24GB/512GB from $1,699 (Reg. $1,999)\n- 14-inch M4 Pro MacBook Pro 24GB/1TB from $2,099 (Reg. $2,399)\n- 14-inch M4 Max MacBook Pro 24GB/1TB from $2,899 (Reg. $3,199)\niPad mini 7\n- iPad mini 7 128GB $399 (Reg. $499)\n- iPad mini 7 256GB $499 (Reg. $599)\n- iPad mini 7 512GB $699 (Reg. $799)\nM3 iPad Air\n- M3 iPad Air 11-inch\n- 11-inch M3 iPad Air 128GB from $449 (Reg. $599)\n- 11-inch M3 iPad Air 256GB from $549 (Reg. $699)\n- 11-inch M3 iPad Air 512GB from $749 (Reg. $899)\n- 11-inch M3 iPad Air 1TB from $949 (Reg. $1,099)\n- M3 iPad Air 13-inch\n- 13-inch M3 iPad Air 128GB from $649 (Reg. $799)\n- 13-inch M3 iPad Air 256GB from $749 (Reg. $899)\n- 13-inch M3 iPad Air 512GB from $949 (Reg. $1,099)\n- 13-inch M3 iPad Air 1TB from $1,149 (Reg. $1,299)\niPhone 15/16 Pro\nM4 iPad Pro\n- M4 iPad Pro 11-inch\n- Apple M4 iPad Pro 11-inch 256GB $895 (Reg. $999)\n- Apple M4 iPad Pro 11-inch 512GB $1,075 (Reg. $1,199)\n- Apple M4 iPad Pro 11-inch 1TB $1,461 (Reg. $1,599)\n- Apple M4 iPad Pro 11-inch 2TB $1,809 (Reg. $1,999)\n- M4 iPad Pro 13-inch\n- Apple M4 iPad Pro 13-inch 256GB $1,099 (Reg. $1,299)\n- Apple M4 iPad Pro 13-inch 512GB $1,299 (Reg. $1,499)\n- Apple M4 iPad Pro 13-inch 1TB $1,699 (Reg. $1,899)\n- Apple M4 iPad Pro 13-inch 2TB $2,049 (Reg. $2,299)\nAccessories and more\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/08/29/orico-usb-4-40gb-s-m-2-nvme-ssd-enclosure/",
      "text": "ORICO USB 4 40Gb/s M.2 NVMe SSD Enclosure\nBuy for $42 (Reg. $70)\nApply code ORICOACOM2 during checkout.\nWhat we love\nSure, we see SSD enclosures go on sale for less, but not when they support 40Gb/s transfer speeds. This typically drives the cost up to $70 for this sort of thing and well over $50 when they go on sale. Today’s markdown goes well under that at $42. Doing the math, this means you can theoretically transfer a 5GB file in just one second if you have all of your ducks in a row.\nMore curated coverage for you\nORICO USB 4 40Gb/s M.2 NVMe SSD Enclosure features:\n- Faster than Ever: With the stable smart chip, support for UASP acceleration protocol, and equipped with a Thunderbolt 3/4-compatible Type-C interface, the M.2 NVMe enclosure can achieve blazing fast data transfers of up to 40Gbps. Its read speed is up to 3500Mb/s and write speed is up to 2800Mb/s. 180G files can be transfered in 1 min. Ideal for gaming enthusiasts, professional video editors, content creators, photographers and anyone who wanna enjoy its remarkable speed performance\n- Efficient Heat Dissipation: Designed with an aluminum alloy body featuring a 360° stripe pattern, built-in fan, cooling silicone pad, and metal vest for enhanced airflow. This setup effectively keeps your SSD cool, preventing speed drops, disconnections, data loss, and potential damage\n- Ease of Setup: Enjoy a hassle-free installation with no screws or screwdrivers needed. Simply push the button to install your SSD. Plug and play, with a compact and portable design for convenience on the go\n- 8TB Large Capacity: Supports up to 8TB of storage, ideal for 4K/8K video projects. Comes with USB-C to C and USB-C to A cables for wide device compatibility\n- Broad Compatibility: Supports M-Key 2230/2242/2260/2280 SSDs and Thunderbolt 3/4, USB4/3.2/3.1/3.0 ports. Fully compatible with Windows, macOS, Linux, and Android. (Note: Not compatible with SATA AHCI M.2 or mSATA SSDs)\n- Note: Not recommended for use with Crucial-P3 Plus, WD Black SN750 and Samsung 970 EVO Plus. Not compatible with Intel (except 12th Gen) Thunderbolt ports prior to 12th Gen; compatible with AMD and Apple Thunderbolt ports\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/08/28/latest-m4-macbook-air-best-apple-deal/",
      "text": "Amazon is still offering just about every single M4 MacBook Air configuration out there at the lowest we have tracked online. These deals have been live for quite some time now, but after detailing why we think they might be among the best Apple deals of the year, and considering they are the latest 2025 releases of one of the most universally appealing pieces of Apple kit in the lineup, they deserve to be front and center once again. This includes both the 13- and 15-inch models across all storage capacities and colors at $200 off with prices starting from $799 shipped.\nThere have been a few very short-lived, one-off disocunts on select models in particular colors for a touch less than we are seeing right now, but you are, by in large, looking at the best deals that have been offered online, and the best chance to land any of the configs/colors in the lineup with a sweet deal.\n- 13-inch M4 MacBook Air 16GB/256GB $799 (Reg. $999)\n- 13-inch M4 MacBook Air 16GB/512GB $999 (Reg. $1,199)\n- 13-inch M4 MacBook Air 24GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 16GB/256GB $999 (Reg. $1,199)\n- 15-inch M4 MacBook Air 16GB/512GB $1,199 (Reg. $1,399)\n- 15-inch M4 MacBook Air 24GB/512GB $1,399 (Reg. $1,599)\nOn top of what you might call the standard configurations listed above, we have also uncovered some $200 price drops outside of Amazon on configs you can’t even buy there:\nIt is also worth mentioning that these are some of the best investments on an Apple laptop you can make right now in a couple different ways. Firstly, the MacBook Air, especially the latest generation that started at $100 less this year, is the most affordable way to bring home a new MacBook. And now with the new 16GB of RAM starter tier at $200 off the list price, you’re really getting some bang for your buck.\nSecondly, you’re getting a machine barely half way through its lifecycle, and that’s if Apple upgrades them to the M5 chip next spring (it probably will). While we are tracking a gigantic collection of Apple gear on sale this weekend, the M4 MacBook Air is one of the only products in the sale that isn’t likely to see a new model take the reigns sometime this fall. There are others, but the bulk of the big ticket gear will see new models land in the coming month(s).\nApple M4 MacBook Air features:\n- SPEED OF LIGHTNESS — MacBook Air with the M4 chip lets you blaze through work and play. With Apple Intelligence, up to 18 hours of battery life, and an incredibly portable design, you can take on anything, anywhere.\n- SUPERCHARGED BY M4 — The Apple M4 chip brings even more speed and fluidity to everything you do, like working between multiple apps, editing videos, or playing graphically demanding games.\n- BUILT FOR APPLE INTELLIGENCE — Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data — not even Apple.\n- UP TO 18 HOURS OF BATTERY LIFE — MacBook Air delivers the same incredible performance whether it’s running on battery or plugged in.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/here-are-the-lego-sets-releasing-in-september-2025-from-icons-ideas-dc-marvel-disney-more-advent-calendars-and-gwps/",
      "text": "It’s been an exciting summer for LEGO, as we’ve seen massive waves of new building sets release over the last few months with regular unveilings of new sets happening in between. Following the 107 new releases we saw hit the scene last month, September is geared up to be a much smaller event, though one stacked with plenty of standouts that already have builders champing at the bits – with some already available to preorder too. Of course, there are four different Gift With Purchase rewards that will be popping up for Harry Potter and the recently revealed Pirates of the Caribbean sets. You can get the full rundown below and start planning (or preordering) what will be joining your collection once the clock ticks over to September.\nWhile it may not be a massive blowout like August, September is sure to be another exciting month of new releases from the LEGO Group, with notable standouts like the LEGO Icons Captain Jack Sparrow’s Pirate Ship (Black Pearl) – which gets one of the four GWP sets tagging along, as well as others like the 76300 Batman Arkham Asylum set, the 21360 Ideas Willy Wonka & the Chocolate Factory set, and plenty more to wet your brick-shaped whistles.\nAs usual, LEGO Insiders will have the first access to these new releases once the clock officially turns us over into September, with general admissions opening a few days after. You may notice a few sets not becoming available until later in the month, so be sure to make a note for those particular releases and plan accordingly.\nAs I already mentioned, there are four potential GWP rewards to take advantage of on two very specific themes. The first of these is Captain Jack Sparrow’s Compass that will be accompanying the LEGO Icons Captain Jack Sparrow’s Pirate Ship (Black Pearl) set through September 18 (as the main set doesn’t release until September 15). From there, Harry Potter fans can score three different GWP sets – one of which accompanies a building set, while the other two are acquired via a $40 or $130 pricing threshold being hit while buying the theme’s latest sets.\nHead below to see our curated list of all the new LEGO sets releasing in September 2025:\nLEGO Advent Calendar September 2025 releases\n- Friends Advent Calendar: $34.99 shipped | 237 pieces\n- City Advent Calendar: $34.99 shipped | 186 pieces\n- Disney Frozen Advent Calendar: $44.99 shipped | 231 pieces\n- Harry Potter Advent Calendar: $44.99 shipped | 278 pieces\n- Minecraft Advent Calendar: $44.99 shipped | 300 pieces\n- Star Wars™ Advent Calendar: $44.99 shipped | 263 pieces\nLEGO DC & Marvel September 2025 releases\n- Batman – Arkham Asylum: $299.99 shipped | 2,593 pieces\n- Spider-Man: Across the Spider-Verse Minifigure: $4.99 shipped | 8 pieces\n- Spider-Man – Across the Spider-Verse Minifigure 6-pack: $29.94 shipped | 97 pieces\nLEGO Disney September 2025 releases\n- WALL-E and EVE: $69.99 shipped | 811 pieces\nLEGO Harry Potter September 2025 releases\n- Hogsmeade Village – Collectors’ Edition: $399.99 shipped | 3,228 pieces\n- The Goblet of Fire BrickHeadz Figures: $49.99 shipped | 671 pieces\n- Luna Lovegood & Thestral Brickheadz Figures: $19.99 shipped | 292 pieces\nLEGO Icons and Ideas September 2025 releases\n- Captain Jack Sparrow’s Pirate Ship (Black Pearl): $379.99 shipped | 2,862 pieces\n- Willy Wonka & the Chocolate Factory: $219.99 shipped | 2,025 pieces\nLEGO Nike September 2025 releases\n- Nike Slam Dunk: $69.99 shipped | 809 pieces\n- Nike Dunk Trickshot: $39.99 shipped | 454 pieces\nLEGO Wicked September 2025 releases\n- Emerald City Wall Art: $159.99 shipped | 1,518 pieces\n- Glinda & Elphaba Bookends: $129.99 shipped | 1,327 pieces\n- Emerald City & Kiamo Ko Castle: $79.99 shipped | 860 pieces\n- Glinda & Elphaba Visit Munchkinland: $69.99 shipped | 734 pieces\n- Glinda’s Wedding Day: $39.99 shipped | 476 pieces\n- Elphaba’s Retreat: $27.99 shipped | 228 pieces\n- Elphaba & Glinda Brickheadz Figures: $19.99 shipped | 325 pieces\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/team-cherry-free-switch-2-hollow-knight-silksong-upgrade-pack/",
      "text": "Now roughly 48 hours out from one of the most highly-anticipated game releases of the year, Team Cherry has issued a final Kickstarter update on Hollow Knight: Silksong. It just recently confirmed the GameStop price leak at $19.99 here in the U.S. across what appears to be all platforms (as well as the launch times on September 4), but what does this mean for Nintendo Switch 2?\nHollow Knight: Silksong is now confirmed to be launching at a surprisingly low $19.99 here in the U.S. across all platforms by the looks of it. This includes Switch, PS4/5, on Steam, GoG, Humble Bundle, and Xbox (it is a day 1 Game Pass title for the record).\nThat GameStop listing that quickly appeared and promptly disappeared was the first to “leak” the price of the game, and it turned out to be correct.\nRelease times:\n7AM PT | 10AM ET | 4PM CEST | 11PM JST\nGame price:\nUSD $19.99 | EUR €19.99 | JPY ¥2300\nI think many folks had a feeling Team Cherry might be incredibly generous with the price of a game it could have easily charged double for, but $20 is impressively low, even for them.\nNonetheless that is official, and the development team has now updated its ancient Kickstarter page for the original Hollow Knight with some details for early backers.\nIf you haven’t done so already, please fill out your survey so we can deliver your keys!\nNote: A few backers have reported finding their survey in their junk folder, so please do check there if it hasn’t shown up. If you can’t find it, shoot us an email at backers@teamcherry.com.au, mention your email address, or your backer name & number, and we’ll get a survey out to you asap.\nSurveys will close in 24hours from now. If you do miss the cut-off, don’t worry! You can still receive your Silksong keys, but you’ll have to contact us directly through backers@teamcherry.com.au.\nEveryone who has already filled out the survey, keys will arrive shortly before release.\nSteam keys will arrive via Humble Bundle and will include the Official Soundtrack for all players.\nNintendo Switch keys will be delivered directly via email.\nBut here’s the interesting part: those who receive a key for the Switch version will have to download the game as expected and additionally “download the (free) Hollow Knight: Silksong Upgrade Pack from the eShop to unlock the platform’s enhanced features.”\nThis looks to just be for those receiving the game via the Kickstarter campaign, and that you will be able to just buy the game straight for Nintendo Switch 2 directly on the eShop (as opposed to downloading the Switch 1 version and the aforementioned “(free) Hollow Knight: Silksong Upgrade Pack”).\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    },
    {
      "url": "https://9to5toys.com/2025/09/02/apple-24gb-mac-mini-1tb-deal/",
      "text": "B&H had a number of upgraded M4 Mac mini deals live ahead of Labor Day this year, but just about all of them jumped back up to full price over the long weekend. However, one of these models is now even lower than it was last week. You’ll now find the latest M4 model configured with 24GB of RAM and the 1TB internal SSD at $200 off the list price.\nB&H is now offering the M4 Mac mini with 24GB of RAM and 1TB of storage down at $999 shipped. That’s $200 off the $1,199 list price you would pay at Apple, $100 under our previous mention, and the lowest we can find.\nThe most upgraded model you can find on Amazon is the 24GB variant with 512GB of RAM – you can’t buy the model B&H has on sale here today there at all. And for the record, we have never seen the 24GB/512GB model at a full $200 off via Amazon and it very rarely ever goes for better than $100 off.\nClearly the real value in the M4 Mac mini lineup for most potential customers is the low price of entry, and you’re not exactly getting that here with the $999 deal price on the 24GB/1TB – it is after all nearly double the price of the entry variant. But for folks looking to land something that will remain snappy and powerful for most likely years to come, or something to support more involved creative projects, there is some value in this rarely discounted configuration at $200 off the list price.\nM4 Mac mini features:\nThe far mightier, way tinier Mac mini desktop computer is five by five inches of pure power. Built for Apple Intelligence. Redesigned around Apple silicon to unleash the full speed and capabilities of the spectacular M4 Pro chip. With ports at your convenience, on the front and back. At just five by five inches, Mac mini is designed to fit perfectly next to a monitor and is easy to place just about anywhere. Get connected with Thunderbolt, HDMI, and Gigabit Ethernet ports on the back and, for the first time, front-facing USB-C ports and a headphone jack.\nFTC: 9to5Toys is reader supported, we may earn income on affiliate links\nSubscribe to the 9to5Toys YouTube Channel for all of the latest videos, reviews, and more!"
    }
  ],
  "argos_summary": "Apple’s Labor Day sales feature deep discounts on its latest M4 Mac mini, M4 iPad Pro, and iPhone 15 Pro Max, with the 24GB‑RAM, 1TB Mac mini now $200 off the list price and the 1TB iPad Pro 11‑inch $500 off. The iPhone 15 Pro Max is offered at roughly $730 off its launch price, and the M4 MacBook Air and Pro lines also see $200–$300 reductions. These deals coincide with the upcoming iPhone 17 reveal, creating a window of opportunity for buyers to secure high‑end Apple hardware at significant markdowns before new models launch.",
  "argos_id": "BIW8PBCQH"
}