{
  "url": "https://www.washingtontimes.com/news/2025/sep/2/ohio-state-ranks-no-1-top-25-poll-lsu-miami-move-top-5/",
  "authorsByline": "Eric Olson, The Washington Times https://www.washingtontimes.com",
  "articleId": "70c5bd3cd465455aab3536ea73db3a77",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/09/02/College_Football_Poll_74286_c0-100-2400-1500_s1200x700.jpg?4fe62c4baf8f15c7a1252812691534105c9546ec",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T02:06:18+00:00",
  "addDate": "2025-09-03T02:12:34.137687+00:00",
  "refreshDate": "2025-09-03T02:12:34.137690+00:00",
  "score": 1.0,
  "title": "Ohio State ranks No. 1 in Top 25 poll as LSU, Miami move into top 5",
  "description": "Ohio State climbed to No. 1 in The Associated Press Top 25 college football poll on Tuesday, LSU and Miami moved into the top five, and Florida State jumped back into the rankings at the expense of Alabama, which plummeted to its lowest spot in 17 seasons.",
  "content": "Ohio State climbed to No. 1 in The Associated Press Top 25 college football poll on Tuesday, LSU and Miami moved into the top five, and Florida State jumped back into the rankings at the expense of Alabama, which plummeted to its lowest spot in 17 seasons.\n\nThe defending national champion Buckeyes received 55 of 66 first-place votes to move up two spots after their win over preseason No. 1 Texas. Ohio State is at the top of a regular-season Top 25 for the first time since November 2015.\n\nTexas dropped to No. 7 as the media voters shuffled the rankings following a topsy-turvy Labor Day weekend. It was only the second time, and first since 1972, that two top-five teams lost in Week 1 and the first time four top-10 teams lost. Only three teams in the Top 25 are in the same spot they were in the preseason poll.\n\nPenn State got seven first-place votes and remained No. 2. LSU, which received three first-place votes, was followed by Georgia and Miami to round out the top five.\n\nOregon got the other first-place vote and was followed by Texas, Clemson, Notre Dame and South Carolina.\n\nLSU jumped six spots after winning at Clemson and Miami got a five-rung promotion for its victory over Notre Dame.\n\nThe biggest movers in the poll were Florida State and Alabama after the Seminoles’ 31-17 victory in their head-to-head matchup: Florida State, 15 spots outside the Top 25 in the preseason, is now No. 14. Alabama dropped all the way from No. 8 to No. 21 — its lowest ranking since it was No. 24 in the 2008 preseason poll. That was the second of Nick Saban’s 17 teams in Tuscaloosa.\n\nIt’s been quite a turnabout for Florida State. The Seminoles were No. 10 in the 2024 preseason, lost their first two games, finished 2-10 and weren’t ranked again until now.\n\nIn and out\n\nUtah, at No. 25, joins Florida State as the only newcomers this week.\n\nThe Utes had received the second-most points, behind BYU, among teams outside the preseason Top 25. Utah got more credit for beating UCLA 43-10 on the road than BYU got for hammering FCS foe Portland State. The Utes are ranked for the first time since last October, when they were at the front end of a seven-game losing streak.\n\nBoise State, which had been No. 25, received no votes following its 34-7 loss at South Florida. The Broncos had appeared in 14 straight polls. The other team to drop out of the poll was No. 17 Kansas State, which followed up its season-opening loss to Iowa State with a last-minute home win over FCS team North Dakota.\n\n— Ohio State is the first team to take over the top spot in the first regular-season poll since Alabama in 2012. It was the biggest jump to No. 1 in the first regular-season poll since Southern California was promoted from No. 3 in 2008.\n\n— Texas’ fall was the biggest for a preseason No. 1 since Auburn dropped to No. 8 in the first regular-season poll of 1984.\n\n— LSU has its highest ranking after Week 1 since it was No. 3 in 2012, and Miami has its highest ranking after Week 1 since it was No. 5 in 2004.\n\n— South Carolina is in the top 10 in the regular season for the first time since it was No. 8 in December 2013.\n\nNo. 15 Michigan at No. 18 Oklahoma: This weekend’s game will be the first meeting since Oklahoma beat the Wolverines in the Orange Bowl to win the 1975 national championship. Wolverines freshman QB Bryce Underwood gets put to the test in his second start.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Florida State",
      "weight": 0.102725804
    },
    {
      "name": "No",
      "weight": 0.09271254
    },
    {
      "name": "Ohio State",
      "weight": 0.09255166
    },
    {
      "name": "first",
      "weight": 0.090412796
    },
    {
      "name": ".",
      "weight": 0.0900832
    },
    {
      "name": "Iowa State",
      "weight": 0.089294635
    },
    {
      "name": "Kansas State",
      "weight": 0.088760644
    },
    {
      "name": "Portland State",
      "weight": 0.088352576
    },
    {
      "name": "FCS foe Portland State",
      "weight": 0.08731127
    },
    {
      "name": "Penn State",
      "weight": 0.08710381
    }
  ],
  "topics": [
    {
      "name": "Academia"
    },
    {
      "name": "Louisiana State University"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.96533203125
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.9267578125
    }
  ],
  "sentiment": {
    "positive": 0.079848565,
    "negative": 0.6761145,
    "neutral": 0.2440369
  },
  "summary": "Ohio State has been ranked No. 1 in The Associated Press Top 25 college football poll, following a win over Texas. The defending national champion received 55 of 66 first-place votes, marking a significant increase from the previous year's No. 2. LSU and Miami also moved into the top five, while Texas dropped to No. 7. The biggest movers in the poll were Florida State and Alabama, who moved up from No. 8 to 21, marking their lowest ranking in 17 seasons. Only three teams currently in the Top 25 are in the same spot they were in the preseason poll. Utah and Florida State were the only newcomers this week.",
  "shortSummary": "Ohio State topped the APO Top 25, while LSU and Miami moved into the top five, while Florida State and Alabama's drop was notable.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2518b1f2cf7f466988a292cc65f424f6",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ohio State moves to No. 1 in the AP Top 25 after beating Texas, while LSU and Miami enter the top five. Florida State jumps to No. 14, pushing Alabama down to its lowest rank in 17 seasons. The poll shift follows a turbulent Labor Day weekend where several top teams lost.",
  "argos_id": "BS11GYDHD"
}