{
  "url": "https://www.latimes.com/sports/highschool/story/2025-09-02/redondo-union-marymount-high-school-girls-volleyball",
  "authorsByline": "Steve Galluzzo",
  "articleId": "af0c3ee7b8e7421ea7d886c1848d71c6",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/276ee69/2147483647/strip/true/crop/1280x672+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F95%2Fe1%2F71fd60e94bf59d38413b129f1aea%2Fvb1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T04:33:51.224000+00:00",
  "addDate": "2025-09-03T04:40:10.409424+00:00",
  "refreshDate": "2025-09-03T04:40:10.409425+00:00",
  "score": 1.0,
  "title": "Redondo Union defeats Marymount in high school girls volleyball showdown",
  "description": "In an early season showdown between two of the top girls volleyball teams in the state, Redondo Union beat Marymount.",
  "content": "In an early season showdown between two of the top girls volleyball teams in the state, Redondo Union took control over the last two sets to handle Marymount, 25-23, 18-25, 25-21, 25-14 and prove it is a threat for its first Southern Section championship since 2019.\n\nThe squads entered their nonleague matchup with a 22-1 combined record this fall and could meet again down the road with the stakes even higher. The Sea Hawks’ triumph was all the more impressive given that it was accomplished without libero Rowan DeVore (sidelined with flu) and senior twins Avery and Addi Junk, who are skipping the indoor season to concentrate on beach volleyball, which both are committed to play at Florida State.\n\nCal commit Abby Zimmerman was almost unstoppable, pounding a match-high 26 kills, Leah Blair (committed to play beach at Washington) had 10 kills and UC Irvine-bound Taylor Boice added seven kills for the home side. Setter Marlo Libbey had 33 assists and served three aces.\n\nZimmerman led her school to the beach title in the spring.\n\n“Indoor is my favorite and we’ve put in so much work, it would be great to go out on top my last year,” Zimmerman said. “This was a solid match for us and if we can bring the same energy and fight every game we have a good chance.”\n\nBoth programs were coming off successful trips to Hawaii. Redondo Union finished runner-up to national power Byron Nelson (Texas) for the second straight season at the Ann Kang Invitational, while Marymount did not drop a set on its way to the Hawaiian Island Labor Day Classic championship Saturday in Hilo.\n\nJunior hitter Makenna Barnes had 16 kills, Washington commit Sammy Destler added 14, Olivia Penske had 36 assists and Declan Eastman recorded 11 digs for the Sailors, who were trying to avenge a five-set defeat in the first round of the CIF SoCal Open Division regionals last fall.\n\n“I play on the same club team as Abby and Taylor… we’re best friends,” Destler said. “This was a much-needed wake-up call for us. We have practice at 5:45 a.m. tomorrow and I have to like it. Redondo’s a whole different level than the teams we saw in Hawaii.”\n\nTuesday’s nonleague match not only featured many of the Southland’s most talented players, but also two of its most successful coaches in Redondo Union’s Tommy Chaffins (who passed the 900 career wins milestone last year) and Marymount’s Cari Klein (who has led her Sailors to 30 or more victories in three of the last four seasons).\n\nKlein said the trip back from Hawaii had a little drama as the plane had engine problems and had to divert to Oahu.\n\nMarymount was off to its hottest start since 2021 when it finished 35-0 en route to its 10th section title and seventh state crown under Klein and the No. 1 national ranking.\n\nThe schedule only gets tougher for Redondo Union (14-1), which travels to reigning Division 1 champion Mater Dei on Thursday and hosts 2022 champion Sierra Canyon next Tuesday. Marymount (9-1) will try to shake off its first loss Thursday when it hosts the Sea Hawks’ Bay League rival, Mira Costa, on Thursday.\n\n“We’re very close on and off the court and we bonded even more in Hawaii,” Boice said. “Tonight we simply wanted it more.”",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/sports/highschool/story/2025-09-02/booster-confirms-paying-parents-bringing-in-players-at-narbonne-st-bernard-bishop-montgomery",
    "https://www.latimes.com/sports/highschool"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Redondo Union",
      "weight": 0.07609495
    },
    {
      "name": "last year",
      "weight": 0.0643463
    },
    {
      "name": "last fall",
      "weight": 0.06399018
    },
    {
      "name": "high school girls volleyball showdown",
      "weight": 0.06386837
    },
    {
      "name": "Marymount",
      "weight": 0.06253003
    },
    {
      "name": "beach volleyball",
      "weight": 0.05876735
    },
    {
      "name": "Redondo",
      "weight": 0.05778468
    },
    {
      "name": "Cal commit Abby Zimmerman",
      "weight": 0.05637084
    },
    {
      "name": "Washington commit Sammy Destler",
      "weight": 0.055871382
    },
    {
      "name": "national power Byron Nelson",
      "weight": 0.053408332
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9951171875
    },
    {
      "name": "/Sports/College Sports",
      "score": 0.888671875
    },
    {
      "name": "/Jobs & Education/Education/Primary & Secondary Schooling (K-12)",
      "score": 0.837890625
    },
    {
      "name": "/News/Local News",
      "score": 0.640625
    }
  ],
  "sentiment": {
    "positive": 0.5321768,
    "negative": 0.13389996,
    "neutral": 0.33392328
  },
  "summary": "Redondo Union high school girls volleyball team defeated Marymount in a nonleague match, with Redondo Union securing its first Southern Section championship since 2019. The victory was notable given that it was without the presence of libero Rowan DeVore and senior twins Avery and Addi Junk, who are currently focusing on beach volleyball at Florida State. Cal commit Abby Zimmerman was instrumental in the victory, scoring 26 kills and Leah Blair had 10 kills. Setter Marlo Libbey provided 33 assists and served three aces. The match featured many of the Southland's most talented players and their coaches, Tommy Chaffins and Cari Klein. Both teams had successful trips to Hawaii recently.",
  "shortSummary": "Redondo Union defeated Marymount in a high-profile girls volleyball match, securing their first Southern Section championship since 2019.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e64df0cfcd4d4b47b70c5867eae39225",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/sports/highschool/story/2025-09-02/booster-confirms-paying-parents-bringing-in-players-at-narbonne-st-bernard-bishop-montgomery",
      "text": "Bishop Montgomery forfeits 2025 football season amid ties to booster who paid parents\n- Share via\nBishop Montgomery has forfeited the remainder of the 2025 football season and reported more rule violations amid statements by a booster about his past activities paying parents of transfer players, the school announced Tuesday night.\nMike Hall will be the interim football coach while the Archdiocese of Los Angeles investigates why five Bishop Montgomery transfer students were declared ineligible for two years by the Southern Section for violating CIF bylaw 202, which involves submitting false information. The school announced it reported additional violations of the CIF transfer policy within the football program and continues to investigate the football program.\n“We recognize the gravity of this situation and we are deeply sorry for the lapse in oversight that resulted in violations of CIF-SS regulations,” a letter released Tuesday signed by Bishop Montgomery principal Michele Starkey and school president Patrick Lee read. “We are instituting corrective actions aimed at ensuring compliance and preventing such issues in the future.”\nThe decision was handed down a day after Brett Steigh, a 1992 Narbonne High graduate, booster, local businessman and gambler, said during an appearance on the “Fattal Factor” podcast that he paid parents to secure transfers for Narbonne and St. Bernard before currently “helping” Bishop Montgomery. Narbonne in Harbor City is part of the Los Angeles Unified School District, while the Archdiocese of Los Angeles operates St. Bernard in Playa del Rey and Bishop Montgomery in Torrance.\nWhile name, image and likeness policies allow for payment of players, recruiting transfer athletes and paying their parents as much as $50,000 remains a violation of the California Interscholastic Federation’s undue influence rules.\n“I ain’t doing nothing that others aren’t doing,” Steigh said, alleging Orange County private schools, including national powerhouse Mater Dei, paid to secure transfer players.\nA Mater Dei spokesperson has not yet responded to a request for comment in response to the allegation.\nSteigh said he recruited players in 2018 and 2024 to Narbonne without the knowledge of the head coaches while paying parents to move. Both times, Narbonne was sanctioned by the City Section for rule violations.\nIf Bishop Montgomery were to cancel the remainder of its season, players on the team could seek hardship waivers to play elsewhere.\nHe said he met with St. Bernard President Carter Paysinger in 2020 and agreed to support that school after former Narbonne coach Manuel Douglas took over the program. Douglas told The Times on Tuesday the payments reached close to $1 million between funding tuition for incoming freshman football players and improvements at the school. Douglas said school administrators were aware of the contributions.\nDouglas and Steigh became the subject of FBI and IRS investigations after Douglas failed to report donations from Steigh and didn’t pay taxes on them. Steigh said they didn’t face any charges. Douglas resigned in 2020 and St. Bernard shut down its football program in 2021, 2022 and 2023.\nSteigh said he has now been “supporting” Bishop Montgomery with the knowledge of Lee.\nMore than 20 transfers joined Bishop Montgomery’s football program during the offseason. After five Bishop Montgomery transfers were declared ineligible by the Southern Section, the school announced on Saturday it had fired head football coach Ed Hodgkiss.\nBishop Montgomery received numerous football transfers in the offseason. The Southern Section has reviewed the paperwork and declared five players ineligible.\nIn a text message to The Times, Lee denied any connection to Steigh.\n“What he said was an outright lie,” Lee said. “Neither the principal nor I ever met this man, spoke to him, emailed him, texted him — nothing.”\nThe City and Southern Section commissioners are aware of the statements Steigh made during the podcast, with one telling The Times they are reviewing them.\nSteigh said he agreed to appear on reporter Tarek Fattal’s podcast because he felt it was wrong that Hodgkiss — the Bishop Montgomery football coach — was fired.\nBishop Montgomery pulls out of a scheduled Friday game against the Monarchs after problems in Hawaii.\n“Pat knew what the deal was and now he’s backing away. Not fair,” Steigh said, referring to the Bishop Montgomery president.\nHodgkiss told The Times he has been advised by legal counsel not to answer any questions.\nA Bishop Montgomery parent wrote in a letter to The Times that football transfers joining the program were given preferential treatment.\n“Returning players were demoted, excluded from trips or quit,” the parent wrote. “Archdiocesan Catholic values appear secondary to short-term athletic exposure. Despite my June outreach to the school, no reply ever came.”\nIn the spring, The Times asked Starkey, the Bishop Montgomery principal, if she was aware of any involvement by Steigh in Bishop Montgomery’s program. She said no.\nWhen Steigh was asked during the podcast why he would risk players’ eligibility by getting involved at Bishop Montgomery, he said he felt previous administrations he worked with didn’t have the backbone to succeed at recruiting players.\n“They told us it wouldn’t be ... sorry I shouldn’t say that,” Steigh said of Bishop Montgomery’s leadership. “They’re basically supporting to win right now.”\nWhen pressed for more details, Steigh said, “I can’t comment on any players at Bishop Montgomery.”\nHe said he has now decided to retire from supporting high school football programs.\nSteigh said he previously was a traditional booster at Narbonne, making donations to help pay for helmets, uniforms and a washing machine.\n“In 2018, I decided to play the game that everyone else was playing,” Steigh said. “The head coach at the time did not want to do this. It was all on me. I lied to him. These players just showed up. Why? I wanted to compete with the private schools. I felt it was unfair public schools being left behind.”\nFour coaches of Marine League schools forfeited games against Narbonne last season while demanding a City Section investigation into whether transfers were paid to play for the school.\n“All these rumors through all these years, it’s all true,” Steigh said. “It was all me.”"
    },
    {
      "url": "https://www.latimes.com/sports/highschool",
      "text": "A look at the top 25 high school football teams in the Southland after Week 1 of the 2025 season.\nThe Bishop Montgomery football team is reeling after transfers were declared ineligible and other issues surfaced, prompting the firing of its head coach.\nAfter weeks of turmoil in football program, Bishop Montgomery leaders announce Ed Hodgkiss is no longer employed by the school.\nHead coach Bryan Robinson and his brother Jason, along with former UCLA star Bruce Davis, are building up a program under watchful eye of father.\nAndrew Rodriguez will compete in final event of Stephen Curry’s tour in New York on Sept. 10-12.\nCIF City Section and Southern Section high school football schedule for Week 2 of the 2025 season.\nHigh school football scores from across the Southland on Saturday, Aug. 30.\nCIF City Section and Southern Section girls’ high school flag football scores for Friday and Saturday.\nA look at the top performers from high school football across the Southland this week.\nHigh school football scores from across the Southland on Friday, Aug. 29.\nVikings quarterback Brady Bretthauer passed for 244 yards, threw for two touchdowns and ran for another while Brian Bonner rushed for 159 yards."
    }
  ],
  "argos_summary": "Redondo Union defeated Marymount 25‑23, 18‑25, 25‑21, 25‑14 in a high‑stakes non‑league match, securing a spot in the Southern Section championship. The win was driven by Cal commit Abby Zimmerman’s 26 kills and Marlo Libbey’s 33 assists, while Marymount’s key players were absent for beach volleyball commitments. Both teams, with strong records and recent success in Hawaii, look ahead to tougher schedules and a chance to rebound from this loss.",
  "argos_id": "CKBEAU4AS"
}