{
  "url": "https://www.reuters.com/world/china/global-markets-view-europe-2025-09-03/",
  "authorsByline": "Reuters",
  "articleId": "f064d60bad0b4b9bb92e07fb1a1e4bf0",
  "source": {
    "domain": "reuters.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.reuters.com/resizer/v2/IUH5NS27DJMWVJYY7RXVIZZAWM.jpg?auth=9a6a75b2314a6224be92d3f6a86897053167bd0a8feb8fe5c928b3a402d75755&height=1005&width=1920&quality=80&smart=true",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T04:39:23.357000+00:00",
  "addDate": "2025-09-03T04:44:09.740695+00:00",
  "refreshDate": "2025-09-03T04:44:09.740696+00:00",
  "score": 1.0,
  "title": "EUROPE Bond markets rattle as Xi's tanks roll",
  "description": "A look at the day ahead in European and global markets from Rocky Swift",
  "content": "A look at the day ahead in European and global markets from Rocky Swift\n\nA day after U.S. President Donald Trump re-emerged in the Oval Office to dispel rumours about his health, Chinese President Xi Jinping made a defiant show of strength at his nation's largest ever military parade.\n\nTrump returned from days of public absence to face court challenges to his tariff policies, immigrant deportations , and ability to fire any public official he pleases.\n\nThe optics were very different in Beijing, as Xi, Russia's Vladimir Putin and North Korea's Kim Jong Un watched processions of missiles, tanks and drones. Kim even followed the \"bring your daughter to work\" tradition, showing off to the world his potential successor and evidence that autocracies still have a lot of life in them.\n\nAway from geopolitics, bond markets are again sounding alarm over mounting government deficits and debt piles. U.S. Treasury yields ticked up in Asian trading and Japan's 30-year yields reached an all-time high.\n\nSterling sank even lower after a 1.1% slide on Tuesday when 30-year gilt yields soared to the highest since 1998.\n\nWith stocks shaky and bonds looking perilous, you can always count on gold. The precious metal hit an all-time high of $3,546.99 in the Asian trading day.\n\nOn the data front, purchasing managers indexes (PMIs) for the euro zone and Britain will lead the way, with July JOLTS figures in the United States to follow as a prelude to key nonfarm payrolls on Friday.\n\nMarkets are pricing in an 89% chance of a 25-basis-point reduction in the Federal Reserve's key policy rate this month, and weak labour data would increase the odds for more cuts.\n\nEquity futures are pointing to openings in positive territory in Europe, with the pan-region Euro Stoxx 50 contracts up 0.34% at 5,317, German DAX futures gaining 0.3% to 23,609, and FTSE futures inching up 0.1% at 9,151.\n\nAnd keeping on the positive theme, Trump sounded a conciliatory note to Xi, posting on social media: \"Please give my warmest regards to Vladimir Putin and Kim Jong Un as you conspire against the United States of America.\"\n\nKey developments that could influence markets on Wednesday:\n\n- PMIs for Britain, euro zone, Chicago\n\n- Bank of England's Sarah Breeden and Catherine Mann speak at separate events\n\n- European Central Bank President Christine Lagarde speaks\n\n- Euro zone PPI inflation (July)\n\n- France: Reopening of 3-month, 4-month, 6-month and 11-month government debt auctions\n\n- Germany: Reopening of 7-month, 2-year, 7-year and 10-year government debt auctions\n\n- Britain: - Reopening of 1-month, 3-month, 6-month and 3-year government debt auctions\n\n- Federal Reserve officials scheduled to speak include St. Louis Fed President Alberto Musalem and Minneapolis Fed President Neel Kashkari\n\n- U.S. data durable goods and JOLTS job openings for July",
  "medium": "Article",
  "links": [
    "https://www.reuters.com/world/india/gold-extends-record-run-strong-safe-haven-inflows-2025-09-03/",
    "https://www.reutersagency.com/en/licensereuterscontent/?utm_medium=rcom-article-media&utm_campaign=rcom-rcp-lead",
    "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
    "https://www.reuters.com/world/us/us-appeals-court-rejects-trumps-use-alien-enemies-act-deport-venezuelans-2025-09-03/",
    "https://www.reuters.com/world/china/front-runner-be-north-koreas-next-supreme-leader-makes-international-debut-china-2025-09-03/",
    "https://www.reuters.com/world/us/trump-says-his-administration-will-ask-supreme-court-expedited-ruling-tariffs-2025-09-02/",
    "https://www.reuters.com/business/world-at-work/fed-potential-pivot-point-jobs-storylines-diverge-2025-09-02/",
    "https://www.reuters.com/world/china/chinas-xi-projects-power-military-parade-with-putin-kim-2025-09-03/",
    "https://www.reuters.com/world/us/fired-democratic-ftc-commissioner-reinstated-by-us-appeals-court-2025-09-02/",
    "https://www.reuters.com/world/americas/us-military-kills-11-people-strike-alleged-drug-boat-venezuela-trump-says-2025-09-03/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chinese President Xi Jinping",
      "weight": 0.07740989
    },
    {
      "name": "U.S. President Donald Trump",
      "weight": 0.07601858
    },
    {
      "name": "bond markets",
      "weight": 0.07124291
    },
    {
      "name": "EUROPE Bond markets",
      "weight": 0.068745695
    },
    {
      "name": "European Central Bank President Christine Lagarde",
      "weight": 0.06771285
    },
    {
      "name": "Minneapolis Fed President Neel Kashkari",
      "weight": 0.067214474
    },
    {
      "name": "St. Louis Fed President Alberto Musalem",
      "weight": 0.06590937
    },
    {
      "name": "Kim Jong Un",
      "weight": 0.06470287
    },
    {
      "name": "Xi Jinping",
      "weight": 0.06338242
    },
    {
      "name": "Euro zone",
      "weight": 0.06054489
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.966796875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.90234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.80078125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7294921875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.56005859375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.3623046875
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.34423828125
    }
  ],
  "sentiment": {
    "positive": 0.37444168,
    "negative": 0.35987732,
    "neutral": 0.26568103
  },
  "summary": "Bond markets are on the rise as Chinese President Xi Jinping makes a defiant display of strength at his nation's largest ever military parade. Despite the absence of U.S. President Donald Trump due to health issues and court challenges over tariff policies, immigration, and ability to fire any public official he wishes. Bond markets are also raising concerns over mounting government deficits and debt piles. The U.K. Treasury yields rose in Asian trading, and Japan's 30-year yields reached an all-time high. Sterling dropped even further after a 1.1% slide when 30/year gilt yields soared to the highest since 1998. Despite these concerns, equity futures in Europe are expected to open in positive territory. Key data figures include purchasing managers indexes (PMIs) for the euro zone and Britain, with July JOLTS figures in the United States expected to follow.",
  "shortSummary": "Global markets are volatile as bond markets tremor amid rising debt concerns and political tensions, with key economic data and trade tensions dominating headlines, while Chinese President Xi Jinping's military parade.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f2134f40f71b477d8f20fa4346541574",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.thomsonreuters.com/en/about-us/trust-principles.html",
      "text": "The Trust Principles\nThomson Reuters is dedicated to upholding the Trust Principles and to preserving its independence, integrity, and freedom from bias in the gathering and dissemination of information and news.\nTrust Principles – the history\nThe Trust Principles were created in 1941, in the midst of World War II, in agreement with The Newspaper Proprietors Association Limited and The Press Association Limited (being the Reuters shareholders at that time). The Trust Principles imposed obligations on Reuters and its employees to act at all times with integrity, independence, and freedom from bias.\nReuters Directors and shareholders were determined to protect and preserve the Trust Principles when Reuters became a publicly traded company on the London Stock Exchange and Nasdaq. A unique structure was put in place to achieve this. A new company was formed and given the name 'Reuters Founders Share Company Limited', its purpose being to hold a 'Founders Share' in Reuters.\nThe legal structure has evolved over time and the Founders Share and other contractual arrangements now confer a number of special rights upon the Thomson Reuters Founders Share Company. For example, (i) the Thomson Reuters Founders Share Company has enhanced voting rights in circumstances where someone is seeking to obtain a significant shareholding in, or acquire control of, Thomson Reuters and (ii) the prior consent of the Thomson Reuters Founders Share Company must be sought prior to undertaking any sale of, or other material transaction involving, the Reuters news business unit.\nThomson Reuters itself is obliged and committed to apply the Trust Principles to its operations. The charter documents of Thomson Reuters Corporation include provisions to safeguard the Trust Principles as they apply to the Thomson Reuters business and require Thomson Reuters Directors, in the performance of their duties, to have due regard to the Trust Principles, by the proper exercise of their powers and in accordance with their other duties as Directors.\nThe Trust Principles are:\n- That Reuters shall at no time pass into the hands of any one interest, group, or faction;\n- That the integrity, independence, and freedom from bias of Thomson Reuters shall at all times be fully preserved;\n- That Reuters shall supply unbiased and reliable news services to newspapers, news agencies, broadcasters, and other media subscribers and to businesses, governments, institutions, individuals, and others with whom Reuters has or may have contracts;\n- That Thomson Reuters shall pay due regard to the many interests which it serves in addition to those of the media; and\n- That no effort shall be spared to expand, develop, and adapt the news and other services and products of Thomson Reuters so as to maintain its leading position in the international news and information business\nThomson Reuters Founders Share Company was established in 1984 when Reuters became a public company. The directors of Thomson Reuters Founders Share Company (known as ‘Trustees’) have a duty to ensure, to the extent possible, that the Trust Principles are complied with.\nThe Trustees are experienced and eminent people from diverse arenas in politics, diplomacy, media, public service and business. The Trustees are selected by a nomination committee and proposed to the board of the Thomson Reuters Founders Share Company for appointment. The nomination committee assists in scrutinizing candidates’ suitability and its members include two persons appointed by the chairman after consultation with the European Court of Human Rights and representatives of certain press associations. The Thomson Reuters Corporation board has two representatives on the nomination committee. The Chairman and Deputy Chairman of the Thomson Reuters Founders Share Company Board are members of the nomination committee, and the Chairman appoints three other directors of the Thomson Reuters Founders Share Company as members of the nomination committee. The Chairman of the Thomson Reuters Founders Share Company acts as chairman of the nomination committee.\nThe number of Trustees has to be at least 14 and not more than 18. Trustees have a minimum of two meetings per year, and receive reports on our activities in the different fields in which we operate (including Reuters news). The Trustees meet with both the Thomson Reuters Board and representatives of senior management. Through Thomson Reuters Founders Share Company's Chairman, regular contact is maintained with our company. The relationship is one of trust and confidence.\nIndependence of Thomson Reuters\nCustomers across the world depend on us to provide them with reliable and objective news and information.\nThis means that we have a special need to safeguard our independence and integrity and avoid any bias which may stem from control by specific individuals or interests.\nThe Thomson Reuters Trust Principles were adopted in 1941 and include the preservation of integrity, reliability of news, development of the news business, and related principles.\nToday, the Trust Principles are fundamental to our entire business.\nMore information\nContact us\nBrian Moss\nFor inquiries pertaining to Reuters reporting standards and the Trust Principles please email: brian.moss@thomsonreuters.com."
    }
  ],
  "argos_summary": "European bond markets rattled after Chinese President Xi's massive military parade, amid concerns over mounting government deficits. U.S. Treasury yields rose, Japanese 30‑year yields hit record highs, and sterling fell as gilt yields spiked. Gold surged to an all‑time high at $3,546.99, while equity futures in Europe showed modest gains. Markets are pricing in a high probability of a 25‑bp Fed rate cut this month, with weak labor data potentially boosting cut odds.",
  "argos_id": "D2E0FEKSK"
}