{
  "url": "https://people.com/kim-kardashian-criticized-for-north-wests-finger-piercing-11801975",
  "authorsByline": "Catherine Santino",
  "articleId": "99b746766be6478e830235e390b26c13",
  "source": {
    "domain": "people.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://people.com/thmb/NGJirkfZZEUPVJIwzvyCFVa54xg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(745x395:747x397)/North-West-Kim-Kardashian-090225-032d582c747240e8bf701481c35a61a0.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T21:17:05+00:00",
  "addDate": "2025-09-02T21:29:57.980676+00:00",
  "refreshDate": "2025-09-02T21:29:57.980677+00:00",
  "score": 1.0,
  "title": "Kim Kardashian Slammed for Letting Daughter North West, 12, Get Dermal Piercing in Her Middle Finger",
  "description": "Kim Kardashian is being criticized for her 12-year-old daughter North West's dermal piercing on her finger. Fans spotted the piercing while the mother and daughter were vacationing in Rome.",
  "content": "Kim Kardashian is coming under fire for North West 's new piercing.\n\nWhile the SKIMS founder and her 12-year-old daughter were recently vacationing in Rome , eagle-eyed fans spotted what appears to be a dermal piercing on North's middle finger. Also known as microdermal piercings or single-point piercings, dermal piercings lie flat against the skin and don't have a separate entry and exit point, per Byrdie .\n\nIn photos snapped on Aug. 23, Kardashian, 44, wore a black bodycon silk dress, while North wore a black corset, a skirt and knee-high boots. The tween's electric blue hair was styled in two ponytails that reached below her waist. In addition to her fresh piercing, she accessorized with a heart-shaped purse, glasses and lots of bracelets.\n\nIn a TikTok , posted on the mother-daughter duo's joint account, the pair showed off their outfits as they danced to Destroy Lonely's \"If Looks Could Kill.\"\n\nThe fashion moment is coming under fire, with many fans saying that North is too young for a dermal piercing, which some say can be more painful and prone to infection than other types of piercings. One user called out the piercing in a Keeping Up With the Kardashians  subreddit , prompting many to criticize Kardashian.\n\n\"She's 12. Wtf is Kim doing?!\" one user wrote.\n\n\"Who the f--- lets their 12 year old have piercings? And who the f--- pierces a 12 year old? My kid didn’t even have her ears pierced at 12,\" said another.\n\nOthers expressed their concern about the healing process.\n\nOne user shared: \"That makes me wince just looking at it😣🤢 It must be so irritating! And in the perfect place to be infected all the time.\"\n\nSaid another: \"That's going to be impossible to heal...\" \n\nKardashian, who is also mom to Psalm, 6, Chicago, 7, and Saint, 9, has spoken about her oldest daughter being a \"big critiquer\" of her fashion looks.\n\nWhile speaking with s correspondent Emma Chamberlain on the blue carpet at the 2025 Met Gala, Kardashian insinuated that her daughter was embodying the spirit of fashion icon Joan Rivers .\n\n\"She's a big critiquer, but it's pretty good, you know, her critiquing,\" she said when Chamberlain asked her what North has taught her about fashion. \"But you know just be yourself, right? She's ... also, I think, in a really positive place, like vibe, right now, where it's just like, 'Hey, even if that's not my style, I'm not going to critique that because just be you and if you like that then that's what you should be into.'\"\n\n\"So, I love that energy, and so she was such a positive force tonight, like it was great,\" Kardashian concluded.",
  "medium": "Article",
  "links": [
    "https://www.byrdie.com/what-to-know-before-getting-a-dermal-piercing-4846536",
    "https://youtu.be/n7cXYX2tYxQ?si=8kIdF5kD9GpXCADU",
    "https://people.com/tag/north-west/",
    "https://people.com/tag/joan-rivers/",
    "https://people.com/kim-kardashian-s-daughter-matches-mom-s-look-with-corset-and-boots-11797018",
    "https://people.com/kim-kardashian-shares-the-one-thing-she-doesnt-believe-in-for-parenting-11801666",
    "https://people.com/parents/all-about-kim-kardashian-kanye-west-children/",
    "https://people.com/tag/kim-kardashian/",
    "https://www.tiktok.com/@kimandnorth/video/7541863791873625375",
    "https://people-app.onelink.me/HNIa/kz7l4cuf",
    "https://people.com/north-west-attends-first-venice-film-festival-mom-kim-kardashian-11799759",
    "https://www.reddit.com/r/KUWTKsnark/comments/1n0etmd/does_north_have_a_finger_piercing/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Dermal Piercing",
      "weight": 0.09957336
    },
    {
      "name": "dermal piercings",
      "weight": 0.09957336
    },
    {
      "name": "piercings",
      "weight": 0.08947496
    },
    {
      "name": "microdermal piercings",
      "weight": 0.08931668
    },
    {
      "name": "Kim Kardashian",
      "weight": 0.084007844
    },
    {
      "name": "North West",
      "weight": 0.08118293
    },
    {
      "name": "Kardashian",
      "weight": 0.07734992
    },
    {
      "name": "Daughter",
      "weight": 0.07544115
    },
    {
      "name": "North",
      "weight": 0.07348123
    },
    {
      "name": "fashion icon Joan Rivers",
      "weight": 0.06524288
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.99609375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.94921875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.82958984375
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.5068359375
    }
  ],
  "sentiment": {
    "positive": 0.06789744,
    "negative": 0.6751085,
    "neutral": 0.2569941
  },
  "summary": "Kim Kardashian and her daughter, North West, have been criticized for letting their daughter, who is currently 12, have a dermal piercing on their middle finger. The piercing, which lie flat against the skin and does not have a separate entry and exit point, was spotted during a vacation in Rome. Many fans believe that North is too young for such a type of dermal piercings, which can be more painful and potentially infection-prone than other types of piercations. The incident has led to criticism of Kardashian, who also mentioned her daughter being a \"big critiquer\" of her fashion looks.",
  "shortSummary": "Kim Kardashian faces criticism for allowing her 12-year-old daughter to have a dermal piercing on her middle finger, raising concerns about healing and style.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "08a86e3772984f868706c9a6035893ba",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.byrdie.com/what-to-know-before-getting-a-dermal-piercing-4846536",
      "text": "Looking to up your body jewelry game? Dermal piercings are a popular option for areas traditionally too difficult to pierce. By anchoring into the skin, rather than through the skin, dermal piercing can be placed on almost any flat surface of the body.\n\"It's actually a single point piercing that is anchored to hold tight to the surface of the skin with a beautiful gemstone or flat piece of jewelry on top,\" says Jessie Darling, a professional body piercer at Taunton Tattoo Company in Ontario, Canada. \"Most commonly, dermals [sic] are placed under the eyes or [on the] collar bones, back dimples, arms, hips, or chest.\"\nMeet the Experts\n- Jessie Darling is a professional body piercer at Taunton Tattoo Company in Ontario, Canada\n- Deanne Mraz, MD, FAAD, is a board-certified dermatologist in Connecticut.\nWith these types of piercings, the possibilities feel endless. So, we tapped Darling and a board-certified dermatologist to break down everything there is to know about them. Read on for their insight to dermal piercings.\nDermal Piercing\nPlacement: Dermal piercings can be placed on any flat surface of the body, but are most commonly placed under the eyes, on the collar bones, back dimples, back of the neck, arms, hips, forearms, or chest.\nPricing: Between $70 and $100, though jewelry is an additional charge.\nPain level: 3/10\nHealing time: 1-3 months\nAftercare: Thoroughly clean the area once a day, pat dry with a clean piece of paper towel, then apply a fresh Band-Aid. Repeat for seven days.\nWhat Is a Dermal Piercing\nDermal piercings—also known as microdermal piercings or single-point piercings—are piercings that lie flat against the surface of the skin. The completely flat effect occurs because dermal piercings don’t have a separate entry and exit point; instead, a dermal anchor is installed directly under the skin. This anchor is around six or seven millimeters long, and the top of it sits on the surface layer of the skin, making it look like there are beads directly underneath the dermis. The jewelry is then installed by being screwed into the top of the post.\nDermal Piercing vs. Surface Piercing\nWhile many people tend to interchange the two, dermal and surface piercings are very different. A dermal piercing can be placed underneath any flat surface of the body, though it sits on the surface of the skin. A surface piercing, which has a separate entry and exit point, is created by pinching the skin, sticking a needle through it to create a “passageway” for the jewelry, and inserting a barbell into the flesh so both ends are visible while the middle sits below the surface of the skin.\nPain Level of Dermal Piercings\nJust like with any body modification, there is going to be some pain when it comes to dermal piercings. Unless your pain tolerance is extremely high, you will most likely feel some sort of discomfort—whether a pinch or a more visceral feeling.\n\"Dermal piercings feel like pressure,\" notes Darling. \"Everyone is a little different, so pain levels may differ from others. Most of my clients say it wasn't as bad as they expected!\"\nIt’s fairly dependent on where you choose to place your dermal piercing as well. Considering nerve placement, the different thicknesses of skin, and proximity to veins will be helpful when choosing a placement, as they’re all elements that affect how much a piercing will hurt.\nCommon Placement for Dermal Piercings\nAs mentioned before, one of the best things about dermal piercings is their ability to be placed anywhere flat on the body. Some of the most popular areas to get a dermal piercing include: The chest, lower back, thighs, cheekbones, back of the neck, forearm, hand, and even dimples. The nature of dermal piercings is that if you can imagine piercing it, you most likely can. You can spruce up a tattoo with a dermal piercing, highlight a facial feature you love, or even pierce your neck or wrist for some permanent jewelry.\nProcess of Getting a Dermal Piercing\nThe process of a dermal piercing is much simpler than it may seem. First, your skin is cleaned by the piercer to ensure no bacteria gets into the fresh wound, and a small mark is drawn to indicate where the jewelry will go. The piercer will quickly puncture the skin with a needle or skin punch to create an empty space (or “pocket\") where the metal will sit. Then, the anchor of the jewelry is inserted into the small opening by the piercer—either by hand or with a small pair of forceps—until it’s completely under the skin’s surface. Once set, the top is screwed or placed on, depending upon the type you’ve chosen. The whole process only takes a matter of minutes; a good artist will probably spend more time sterilizing than actually piercing.\n\"The area is disinfected thoroughly, [then] marked with a marker to make sure you and I like the placement,\" says Darling. \"We then use a tool called a dermal punch to remove a little (1.5 to 2 millimeter) pocket of skin. We then use a taper tool that allows us to create room for the anchor base to fit snug. Lastly, we place an anchor base with decorative top into our pocket and gently make sure it's sitting properly. You now have a dermal!\"\nDermal Piercing Aftercare\n\"I suggest to my clients thoroughly cleaning the area once a day, pat dry with a clean piece of paper towel, then apply a fresh bandage,\" says Darling. \"This routine should be faithfully adhered to for seven days; beyond the seventh day, no bandage is required, but proper hygiene is key for a happy and healthy dermal.\"\nDuring the healing process, make sure that you keep the fresh piercing site covered for the recommended amount of time. Once you uncover it, it’s important to clean it twice a day with a sea salt or saline solution, making sure to gently wipe any crusty build-up, and pat the piercing dry with a new paper towel each time to stop any potential spread of bacteria. Board-certified dermatologist, Deanne Mraz, MD says to also avoid swimming, hot tubs, and baths while the piercing is healing as \"those activities can submerge the open wound in an environment that contains bacteria and irritants.\"\nOn average, dermal piercings take between one to three months to heal; however, the length of time completely depends on how you care for it. \"Healing timeline can be impacted by your consistency with aftercare instructions, lifestyle habits, and the location on your body—some areas of the body, such as the cheeks, can take closer to eight to 12 months to heal,\" explains Dr. Mraz. While you should keep an eye out for possible signs of infection, it’s normal for a new piercing site to crust up and slightly swell.\nThe healing process can be hindered by elements you may not think of. Make sure not to let your hair get tangled in the jewelry if the piercing is near it; consider wearing it up during the healing process to ensure they don’t get tangled up. In terms of clothing, don’t wear anything tight around the piercing site so it can breathe and to decrease the risk of infection. Be careful of sports or high-energy exercise, as collisions are possible and extra sweat may mean a higher risk of infection. Keep hands off the piercing when not cleaning it, including not changing the jewelry until it has fully healed.\nCost of Dermal Piercing\nThe cost of a dermal piercing is completely up to the studio, but a well-done one by a reputable and experienced piercer will generally cost you between $70 and $100. It’s important to note that many shops will also charge for jewelry on top of the actual piercing service, so be prepared to pay anywhere from $10 to $50 or more for good quality (and good looking) metal.\nOn top of the base and jewelry prices, there are a few more elements that need to be taken care of as well. Just like getting a tattoo, it’s standard and expected that you tip your piercer for their hard work—at least 20 percent, but more if you feel so inclined. There are also costs associated with aftercare, like saline solution and bandages.\nThe best way to get an accurate idea of how much a dermal piercing will actually cost is to call the shop ahead of your appointment and ask what they charge, as well as what they recommend for aftercare so you can be prepared before it’s even scheduled.\nPotential Side Effects of a Dermal Piercing\n- Infection: If the healing process is not handled properly, your new piercing could become infected. If you have worsening pain at the site of piercing, your skin feels hot to the touch, or you notice swelling, rash, discharge, or a bad odor you should see your doctor immediately,\" says Dr. Mraz. It’s not just the actual wound that shows symptoms; your jewelry may become displaced, hang or droop, or completely detach from its anchor.\n- Tissue damage: If a piercing infection isn’t caught, there’s a risk of something worse happening. The primary major risk is tissue damage, which happens when the piercing isn’t installed properly. If it’s too deep in the skin, a dermal piercing may embed and pull skin layers together. A shallow piercing, on the other hand, may move around.\n- Hypergranulation: Another possible issue is hypergranulation, which is a red bump that shows up around the piercing site due to too much pressure being placed on the site—either by jewelry that is too tight, non-breathable clothing, or something else.\n- Scarring: Developing scars is also possible if you play with or remove your jewelry during the healing process. \"[Scarring] can happen in the form of a keloid (a raised scar) as well as hypergranulation, which will present as a raised, red bump that could even push your piercing out,\" says Dr. Mraz. \"If your dermal piercing is placed too deep in the skin and/or becomes infected, the body may reject it, physically pushing it out of the skin.\" The best way to ensure nothing goes wrong during healing is to follow all directions, keep the wound clean, and get pierced by a certified professional in the first place.\nHow to Change Dermal Piercing Jewelry\nOnce the piercing has healed, you’re more than welcome to change the external jewelry. If you feel confident in this process, you can try it yourself. Make sure to wash your hands and piercing thoroughly—with antibacterial soap and saline solution, respectively—before drying it. Unscrew the jewelry top counterclockwise, but never force it. If there’s any resistance, stop the process. Twist your new jewelry on in a clockwise direction and clean the site again. If your jewelry is stubborn or you’re unsure whether you’re doing it correctly, it’s recommended that you have your piercer change the jewelry to be sure it’s done safely and correctly.\nNo matter what it looks like, though, a dermal piercing isn’t permanent; your skin will eventually grow in such a way that pushes the anchor up to the surface and out. Whether this happens right as it heals or years later is up to your body and how you care for it. However, if you don’t want to wait for your body to naturally purge your dermal piercing, it is possible to have it removed by a professional piercer. Never take out a dermal piercing on your own.\n\"Dermals can last as long as you properly care for them,\" Darling says. \"I have clients who have had dermals for over eight years. If you treat them well, they could last a very long time. But don't fret; if you have a dermal you don't want anymore, it can also be removed by a skilled piercer or your family doctor.\"\nThere are two processes for taking out a dermal piercing. The first is done by having a piercer gently massage the piercing area to dislodge the anchor from its location under the skin. Once it’s loose, the piercer will twist the anchor to break the skin and be able to pull it out. This process is generally reserved for newer piercings. For older or stubborn piercings, the piercer will make a small incision with a scalpel or tweezers (depending on the jewelry’s size) and pull it out of the skin. While professionals may use anesthetics to dull the pain, you should expect a removed dermal piercing to leave a scar if the skin has to be cut open to remove it\nWhat Type of Jewelry Is Used for Dermal Piercings?\nDermal anchor: Although dermal piercings are small, they require a lot of different elements to be sure they’re properly applied to the skin. The first major part is the dermal anchor, which comes in flat-footed and rounded-base varieties. These are both acceptable, but a flat-footed anchor is more common and more widely liked because the foot is at an angle, making it less likely to let go of your skin and pop out than a rounded-base type.\nDermal top: The next element is a dermal top, which is the actual jewelry that is screwed on to the top of the anchor and is completely removable and interchangeable. While possible to change, however, getting a dermal top switched out is generally done by a piercer, so you can also consider magnetic tops—rather than screw-on ones—if you’d rather not have to go to a piercing shop every time you want to change up your piercing.\nDiver: In some cases, you may see a dermal piercing with a diver, a pointed-end base with preset jewelry. This is inserted by being punched under the surface of the skin, rather than by needle, and cannot be changed once inserted.\nWhat Jewelry Material Is Used for Dermal Piercings?\nRegardless of whether your jewelry can be switched up, the metals most used for dermal piercings are titanium (or anodized titanium), surgical-grade stainless steel, and niobium. The most common and most recommended metal for any body jewelry is surgical-grade stainless steel—though it may cause irritation for those with more sensitive skin. Titanium (and anodized titanium) is the safest and best option for the latter, as it’s the least likely metal to cause irritation of any kind. Niobium is less common, but is sometimes used for its lightweight and hypoallergenic properties.\nThe Final Takeaway\nWith proper care, dermal piercings offer countless styling options that not only look cool, but also make modifying body parts that would otherwise be difficult to pierce, possible. But do take heed of a final word of caution: Be careful when looking to get a dermal piercing, as some people actually mean surface piercings when they say dermal. The major difference here is that a surface piercing is a barbell that sits on the surface of the skin and has an entry and exit point."
    },
    {
      "url": "https://people.com/north-west-attends-first-venice-film-festival-mom-kim-kardashian-11799759",
      "text": "North West Attends Her First Venice Film Festival with Mom Kim Kardashian in Pinstripe Ensemble and Chunky Boots The 12-year-old showed off her style in a safety pin-clad outfit and electric blue hair By Kayla Grant Kayla Grant Kayla Grant is a writer-reporter at PEOPLE. She has been working at PEOPLE since 2025. Her work has previously appeared in theGrio, Shondaland and ESSENCE GU. People Editorial Guidelines Published on August 28, 2025 02:00PM EDT 143 Comments Kim Kardashian and her daughter North West. Credit : COBRA TEAM / BACKGRID NEED TO KNOW North West rocked a safety pin-clad ensemble as she arrived at her first Venice Film FestivalThe 12-year-old is the daughter of Kim Kardashian and Kanye WestThe pre-teen first debuted her electric blue hair in June North West is showing off her bold fashion sense. On Thursday, Aug. 28, the 12-year-old arrived for her first Venice Film Festival alongside her mom Kim Kardashian. The pre-teen wore a gray-and-white pinstriped ensemble adorned with safety pins, which she paired with black chunky boots. She had her electric blue hair tied back in ponytails for the event. Meanwhile, Kardashian, 44, wore a long black dress with heels and black sunglasses. Our new app is here! Free, fun and full of exclusives. Scan to download now! Kim Kardashian and her daughter North West. COBRA TEAM / BACKGRID The SKIMS founder and her daughter recently had a matching moment in all-black looks during an evening out in Rome. The mother-daughter duo stepped out together on Saturday, Aug. 22. Kardashian adorned a black bodycon silk dress, while North wore a black corset, a skirt and knee-high boots, standing taller than her mom. The tweens' electric blue hair was again styled in two ponytails down to her waist. In a TikTok, posted on the mother-daughter duo's joint account, the pair showed off their outfits as they danced to Destroy Lonely's \"If Looks Could Kill.\" Related Stories Kim Kardashian's Daughter North, 12, Matches Mom's All-Black Look with Corset and Boots for Night Out in Rome Kim Kardashian and Daughter North, 12, Look Just Like Twins in Side-By-Side Photo of the Duo: 'Like Mom Like Daughter' Kardashian, who's a mother to Psalm, 6, Chicago, 7, Saint, 9, and North, debuted her daughter's blue hair back in June. She shared a photo on her Instagram Stories of her daughter with the new hairstyle. In the photo, North could be seen sitting in a car, wearing big sunglasses and showing off her new, vibrant blue locks. Her hair perfectly matched the car's lining. \"💙,\" Kardashian simply captioned the photo. North West. COBRA TEAM / BACKGRID Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. North is growing up to share a striking resemblance to her mother. Back in July, The Kardashians star reshared a post via her Instagram Stories that showed a side-by-side comparison of her younger self and her daughter. In the picture, both the mom of four and her daughter gave big smiles and had their hair pushed out of their faces. The doting mom sweetly wrote over the photo, \"Like mom Like daughter 🤍.\" Close Leave a Comment Read more: Celebrity Celebrity Family Celebrity Kids"
    },
    {
      "url": "https://people.com/kim-kardashian-shares-the-one-thing-she-doesnt-believe-in-for-parenting-11801666",
      "text": "Kim Kardashian Shares the One Thing She Doesn't Believe in When It Comes to Parenting The SKIMS co-founder is mom to sons Psalm and Saint and daughters North and Chicago By Hannah Sacks Hannah Sacks Hannah Sacks is a writer/reporter for the Parents team at PEOPLE. She has been working at PEOPLE since May 2023. Her work has previously appeared in The Toy Insider, The Toy Book, The Pop Insider, and Saratoga Living. People Editorial Guidelines Published on September 2, 2025 12:12PM EDT Leave a Comment Kim Kardashian and her kids. Credit : Kim Kardashian/Instagram NEED TO KNOW Kim Kardashian is sharing the one thing she doesn't believe in when it comes to parenting The SKIMS co-founder appeared on a livestream over the weekend and said she's not a fan of this one thing Kardashian is mom to four kids — Psalm, Chicago, Saint and North Kim Kardashian is sharing the one thing she doesn't believe in as a mom. The SKIMS co-founder appeared on Kai Cenat's \"Mafiathon 3\" livestream over the weekend and shared her take on another parenting debate, according to a video posted to X. Kardashian, who is mom to sons Saint, 9, and Psalm, 6, and daughters North, 12, and Chicago, 7, revealed she's not a fan of homework for her kids. \"I don't believe in homework,\" Kardashian said. \"But I'm going to tell you why. Kids are in school for eight hours a day.\" \"When they come home, they need to also — they do sports, have a life, spend time with their family. I think that homework should be left for in school,\" she continued. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Related Stories North West Attends Her First Venice Film Festival with Mom Kim Kardashian in Pinstripe Ensemble and Chunky Boots Kim Kardashian Calls Son Psalm, 6, and Saint, 9, Her 'Biker Boys' as She Shows Off Their Dirt Bike Skills in New Photos At the end of August, Kardashian and her daughter North had a matching moment in all-black looks as they spent an evening out in Rome, Italy. Our new app is here! Free, fun and full of exclusives. Scan to download now! The mother-daughter duo stepped out together wearing all-black outfits on Aug. 22. Kardashian wore a black bodycon silk dress while North wore a black corset, a skirt and knee-high boots, standing taller than her mom. The tween's electric blue hair was styled in two ponytails down to her waist. In a TikTok, posted on the mother-daughter duo's joint account, the pair showed off their outfits as they danced to Destroy Lonely's \"If Looks Could Kill.\" Back in July, the mom of four shared a carousel of photos on her Instagram as she rounded up her time spent during her annual friend trip to a lake. In one photo, Kardashian could be seen posing with her sons Saint, who held a sparkler, and Psalm, as well as daughter Chicago. Other shots show her kids playing with their friends, the various pies they had, and Kim's sister Khloé Kardashian, 41, who wore a fake mustache and posed with her own kids True, 7, and Tatum, 2, as well as niece Dream, 8, and Kim's sons. \"Lake 2025,\" Kim wrote in her caption. Close Leave a Comment Read more: Celebrity Celebrity Family Celebrity Parenting"
    },
    {
      "url": "https://people.com/parents/all-about-kim-kardashian-kanye-west-children/",
      "text": "Kim Kardashian and Kanye West's 4 Kids: All About North, Saint, Chicago and Psalm Kim Kardashian and Kanye West welcomed two girls and two boys together By Hannah Kerns Hannah Kerns Hannah Kerns is a former contributor at PEOPLE. People Editorial Guidelines Updated on August 26, 2025 11:33AM EDT Leave a Comment Kim Kardashian and her kids. Credit : Kim Kardashian Instagram Kim Kardashian and Kanye West first started dating in 2011 after years of friendship. Over the course of their 10-year relationship, West and Kardashian welcomed four children together: North, Saint, Chicago and Psalm. Though Kardashian and West may no longer be together, it's clear that they continue to take their roles as co-parents very seriously. \"Make sure you are your co-parent's biggest cheerleader, no matter what you're personally going through,\" Kardashian told Vogue in February 2022. Kardashian and West's divorce was finalized on Nov. 29, 2022, with the parents agreeing to joint physical and legal custody of their four children. \"Although Kim and Kanye share custody [of the kids], Kim is the primary caregiver,\" a source told PEOPLE. \"They agreed that Kanye needs to speak to Kim in private about any complaints and not go public with them. She wants the kids to be protected. Kim hopes the co-parenting will be a bit easier from now on.\" In a June 2023 episode of The Kardashians, the SKIMS founder talked to her mom, Kris Jenner, about not wanting more kids. \"I think I'm done,\" Kardashian remarked, adding that four kids is \"a lot.\" From welcoming their children to their sweet family moments, here's everything to know about Kim Kardashian and Kanye West's kids. North West, 12 North West and Kim Kardashian. Pascal Le Segretain/Getty North West, Kardashian and West's first child, was born on June 15, 2013, in Los Angeles. According to grandmother Kris Jenner, her unusual name has a \"sweet\" significance. \"The way [Kim] explained it to me was that North means highest power and she says that North is their highest point together,\" she explained on The View. North is well-known for her outspoken personality, something her parents have encouraged from day one. \"I want to learn what my daughter has to say. What she learns. I just want to learn how she learns in this world,\" Kanye said in 2016. \"I'm extremely protective.\" And North doesn't hold back her opinions — even when she's her mom's plus-one to Paris Fashion Week. In July 2022, she held up a handwritten \"Stop\" sign aimed at photographers who were snapping her photo during the show. \"North I guess had it with the people taking pictures of her so she wrote on her invite STOP and held it up and wanted them to just focus on the show,\" Kardashian explained on Instagram. Kanye West and North West. Stephane Cardinale - Corbis/Corbis With her family, North is even blunter. According to Kardashian, North calls her mom's house \"ugly\" whenever they get into disagreements. \"She'll say, 'Your house is so ugly, it's all white! Who lives like this?' \" Kardashian explained in October 2021. \"She just thinks it, like, gets to me, and it is kind of mean because I like my house.\" In another interview, Kardashian joked, \"Who intimidates me? I was going to say politicians, but they don't. Maybe just my daughter, North.\" In May 2023, North joined her mom at the Met Gala, where she helped the SKIMS founder recover from a wardrobe malfunction. On the way to the event, the bottom half of Kardashian's pearl-covered Schiaparelli gown broke, causing some pearls to fall off. On the red carpet, Kardashian explained that she asked North to grab the loose pearls, saying, \"They're real pearls, and she was putting them in her purse.\" North landed her first solo magazine cover in October 2023. When asked by i-D to describe herself in three words, she simply said: \"The Best Ever.\" The pre-teen went on to share that she'd like to \"own Yeezy and SKIMS\" one day. North made headlines for her style again in August 2025 when she stepped out in Rome with her mom wearing a black corset and knee-high boots, her blue hair in low pigtails. Saint West, 9 Kim Kardashian and Saint West. Kim Kardashian Instagram West and Kardashian's second child, Saint West, was born on Dec. 5, 2015, in L.A. West gets the credit for choosing Saint's uncommon name. Apparently, the rapper was \"going back and forth for a while\" before landing on Saint because he wanted the name to have \"spiritual significance.\" A friend of West told PEOPLE, \"It needed to mean something and he agonized over it, probably even more than Kim ... Kanye believes that a name is extremely important and that it's the first sense of identity that we have.\" Saint is a major sports fan. He received a football lesson from one of the best quarterbacks in the game, Tom Brady, in November 2021, and he attended a Golden State Warriors game with West in March 2022. Saint West and Kim Kardashian. Kim Kardashian/Instagram In October 2022, Kardashian took Saint to a Los Angeles Rams game at SoFi Stadium in L.A. Roughly a month later, she arranged for Saint to meet Jalen Ramsey on his 7th birthday at another Rams home game. Saint also loves soccer. In March 2023, Kardashian took him and his friends to watch England's Arsenal F.C. play Portugal's Sporting Lisbon in London. Saint West and Lionel Messi. Kim Kardashian/Instagram Kardashian treated Saint to another memorable soccer outing when they went to Lionel Messi's first game at DRV PNK Stadium in Florida in July 2023. The mom of four shared a clip on her Instagram Story of Saint and a friend taking photos with the soccer star. \"Best day of their entire lives,\" Kardashian captioned the clip. In an October 2023 episode of The Kardashians, the mom of four revealed that she hired a \"manny\" for Saint and Psalm. \"My household and even our family is very female-dominated. I really wanted a male around that would be picking them up and taking them to sports,\" Kardashian shared. Chicago West, 7 Chicago West. Kim Kardashian Instagram West and Kardashian welcomed their third child, Chicago West, on Jan. 15, 2018. The couple had Chicago via surrogate after Kardashian's previous high-risk pregnancies. \"We are incredibly grateful to our surrogate who made our dreams come true with the greatest gift one could give and to our wonderful doctors and nurses for their special care,\" Kardashian announced. Chicago may be named for West's hometown, but she definitely takes after Kardashian. For her 4th birthday, Kardashian called her youngest daughter her \"independent baby girl twin\" and the \"ultimate princess.\" Chicago and Psalm West. Kim Kardashian Instagram Chicago was born right around the same time as her cousins Stormi (daughter of Kylie Jenner and Travis Scott) and True (daughter of Khloé Kardashian and Tristan Thompson). The three girls are known as \"The Triplets,\" and have already formed quite the bond. Chicago has already started developing her own fashion sense. While she often matched with her mom and big sister North as a toddler, she's since shown off her unique style, rocking a throwback Britney Spears T-shirt on one occasion and a bright pink jumpsuit with cowboy boots on another. Chicago is still taking a hint from her very stylish mom, however — Kardashian even once caught her trying to \"sneak off\" with a purse from her closet! In January 2023, Kardashian celebrated Chicago's fifth birthday with a Hello Kitty party. The reality star shared images and videos of the event on her Instagram Story, showing off lots of playful decor, including balloon structures and slides leading to a ball pit. A year later, Chicago rang in her 6th birthday with a Bratz-themed party. Psalm West, 6 Psalm West. Kim Kardashian Instagram West and Kardashian's youngest child, Psalm West, was born via surrogate on May 9, 2019, in L.A. Like the rest of their children, Psalm's name holds special significance for West and Kardashian. \"The inspiration was the Book of Psalms in the Bible,\" Kardashian's mom, Kris, explained to ET Online shortly after his birth. \"I think it's just a wonderful way to celebrate how they feel. And he's such a blessing, so it's perfect.\" According to Kardashian, Psalm's arrival helped bring her family together. \"[North, Saint and Chicago] love him. He has helped everyone come together. So now everyone gets along,\" she told PEOPLE. \"Everyone loves each other. Everyone is helpful. And everyone loves him. Like, obsessed with him.\" Psalm West and Chicago West. Kim Kardashian Instagram Kardashian also called Psalm \"the sweetest baby ever\" on his 2nd birthday. \"He's my child that looks most Armenian to me like my grandpa and reminds me so much of my dad,\" the reality star wrote. When Psalm was a baby, Kardashian even thought he could be her father Robert Kardashian reincarnated because they share so many of the same characteristics. As the youngest of Kardashian and West's kids, Psalm spends plenty of time with his three siblings, whether they're playing in the sand on vacation or posing for silly photos before bedtime. Close Leave a Comment Read more: Celebrity Celebrity Family Celebrity Kids"
    },
    {
      "url": "https://people.com/kim-kardashian-s-daughter-matches-mom-s-look-with-corset-and-boots-11797018",
      "text": "Kim Kardashian's Daughter North, 12, Matches Mom's All-Black Look with Corset and Boots for Night Out in Rome 'The Kardashians' star is a mother to four children: Psalm, Chicago, Saint and North By Kayla Grant Kayla Grant Kayla Grant is a writer-reporter at PEOPLE. She has been working at PEOPLE since 2025. Her work has previously appeared in theGrio, Shondaland and ESSENCE GU. People Editorial Guidelines Published on August 25, 2025 02:13PM EDT 153 Comments Kim Kardashian and her daughter North West. Credit : Cobra Team / BACKGRID NEED TO KNOW Kim Kardashian and her daughter North matched in all-black looks during an evening out togetherThe Kardashians star wore a black bodycon silk dress with silver accessories, while her daughter adorned a corset, a skirt and bootsThe SKIMS founder first became a mother in June 2013 Kim Kardashian and her daughter had a matching moment in all-black looks during a recent evening out in Rome. The SKIMS founder, 44, and her daughter North, 12, stepped out together wearing all-black outfits on Saturday, Aug. 22. Kardashian adorned a black bodycon silk dress, while North wore a black corset, a skirt and knee-high boots, standing taller than her mom. The tweens' electric blue hair was styled in two ponytails down to her waist. In a TikTok, posted on the mother-daughter duo's joint account, the pair showed off their outfits as they danced to Destroy Lonely's \"If Looks Could Kill.\" Our new app is here! Free, fun and full of exclusives. Scan to download now! Kim Kardashian and her daughter North West. Cobra Team / BACKGRID Kardashian debuted her daughter's blue hair back in June. She shared a photo on her Instagram Stories of her daughter with the new hairstyle. In the photo, North could be seen sitting in a car, wearing big sunglasses and showing off her new, vibrant blue locks. Her hair perfectly matched the car's lining. \"💙,\" Kardashian simply captioned the photo. Related Stories Kim Kardashian and Daughter North, 12, Look Just Like Twins in Side-By-Side Photo of the Duo: 'Like Mom Like Daughter' Kim Kardashian Says She's 'Proud' of Daughter North, 11, After She Stars in FKA twigs Music Video North is growing up to share a striking resemblance to her mother. Back in July, The Kardashians star reshared a post via her Instagram Stories that showed a side-by-side comparison of her younger self and her daughter. In the picture, both the mom of four and her daughter gave big smiles and had their hair pushed out of their faces. The doting mom sweetly wrote over the photo, \"Like mom Like daughter 🤍.\" Kim Kardashian and her daughter North West. Cobra Team / BACKGRID Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Kardashian, who's a mother to Psalm, 6, Chicago, 7, Saint, 9, and North, occasionally goes to her older daughter for fashion advice. While speaking with Vogue's correspondent Emma Chamberlain on the blue carpet at the 2025 Met Gala, Kardashian insinuated that her daughter was embodying the spirit of fashion icon Joan Rivers and noted that she brings North with her to watch her get ready for the big event. \"Every time I come to the Met I love bringing my oldest daughter with me, just to see me get ready and all her aunties are in the hotel, and we're all getting ready together, so it's just a fun few days,\" she told Chamberlain, who then asked Kardashian what North has taught her about fashion. \"She's a big critiquer, but it's pretty good, you know, her critiquing,\" she said. \"But you know just be yourself, right? She's ... also, I think, in a really positive place, like vibe, right now, where it's just like, 'Hey, even if that's not my style, I'm not going to critique that because just be you and if you like that then that's what you should be into.'\" \"So, I love that energy, and so she was such a positive force tonight, like it was great,\" she concluded. Close Leave a Comment Read more: Celebrity Celebrity Family Celebrity Kids"
    }
  ],
  "argos_summary": "Kim Kardashian faces backlash after her 12‑year‑old daughter North West was photographed with a dermal piercing on her middle finger during a Rome trip. Fans argue the piercing is inappropriate for a child, citing pain and infection risks. The incident sparked online criticism and discussions about parental choices in fashion and body modification.",
  "argos_id": "EUZ2K7DBX"
}