{
  "url": "https://www.digitaltrends.com/computing/elon-musk-bold-claim-tesla-robot/",
  "authorsByline": "Trevor Mogg",
  "articleId": "0bb1fdd89505483cbf57a12c50e44f47",
  "source": {
    "domain": "digitaltrends.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "OR",
      "county": "Multnomah County",
      "city": "Portland",
      "coordinates": {
        "lat": 45.5202471,
        "lon": -122.6741949
      }
    }
  },
  "imageUrl": "https://www.digitaltrends.com/wp-content/uploads/2023/12/tesla-optimus-robot.jpg?resize=1200%2C630&p=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T19:00:00-07:00",
  "addDate": "2025-09-03T02:07:59.879212+00:00",
  "refreshDate": "2025-09-03T02:07:59.879213+00:00",
  "score": 1.0,
  "title": "Elon Musk makes bold claim about Tesla’s humanoid robot",
  "description": "Tesla is suffering a global downturn in sales in the face of tough competition from China and public unease over the political controversies of its polarizing CEO, Elon Musk, among other reasons. That places the electric-car maker in a sticky situation, though Musk said this week that he sees a way out. Recommended Videos In […]",
  "content": "Tesla is suffering a global downturn in sales in the face of tough competition from China and public unease over the political controversies of its polarizing CEO, Elon Musk, among other reasons.\n\nThat places the electric-car maker in a sticky situation, though Musk said this week that he sees a way out.\n\nIn a post on X on Tuesday, the Tesla chief said he believes that around “80% of Tesla’s value will be Optimus,” referring to the company’s humanoid robot.\n\nHe didn’t put a time frame on it, but with the bipedal bot still under development, it could be years before AI-powered Optimus secures meaningful deployment at a large scale.\n\nMusk’s comment came around the same time that Tesla shared its “Master Plan Part IV” in a post on X on Tuesday.\n\n“We are building the products and services that bring AI into the physical world,” Tesla said in the post. “We have been working tirelessly for nearly two decades to create the foundation for this technological renaissance through the development of electric vehicles, energy products, and humanoid robots.”\n\nIt added: “Optimus … is changing not only the perception of labor itself but its availability and capability. Jobs and tasks that are particularly monotonous or dangerous can now be accomplished by other means. In this way, Optimus’s mission is to give people back more time to do what they love.”\n\nMusk envisages the robot being used in industrial settings like factories, and wants to deploy thousands of them to work alongside human workers at Tesla manufacturing plants. He’s also spoken of Optimus becoming a home helper, suggesting it could one day “babysit your kid, walk your dog, mow your lawn, get the groceries, just be your friend, serve drinks.” And presumably make your dinner, too.\n\nBut it won’t be cheap. Musk said last year that when the robot is produced at scale, it could cost somewhere between $20,000 and $30,000.\n\nWhen it comes to humanoid robots, Tesla faces tough competition from a slew of companies building similar machines. We’ve already seen impressive displays from robots by the likes of Boston Dynamics, Unitree, Figure, and Robotera, so Tesla clearly has its work cut out if it’s going to make a success of Optimus.",
  "medium": "Article",
  "links": [
    "https://www.digitaltrends.com/computing/humanoid-robot-dominates-robot-olympics/",
    "https://x.com/Tesla/status/1962591324022153607",
    "https://www.digitaltrends.com/cars/figure-humanoid-robot-autonomous-tasks/",
    "https://x.com/elonmusk/status/1962618811141812475",
    "https://www.digitaltrends.com/computing/robotera-l7-humanoid-robot/",
    "https://www.digitaltrends.com/computing/the-tesla-bot-isnt-superhuman-yet-but-it-can-make-dinner/",
    "https://www.digitaltrends.com/computing/humanoid-robot-complex-tasks/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Tesla",
      "weight": 0.09329176
    },
    {
      "name": "humanoid robots",
      "weight": 0.090819895
    },
    {
      "name": "Tesla manufacturing plants",
      "weight": 0.08965363
    },
    {
      "name": "Elon Musk",
      "weight": 0.080716774
    },
    {
      "name": "robots",
      "weight": 0.07881183
    },
    {
      "name": "Optimus",
      "weight": 0.07860596
    },
    {
      "name": "Musk",
      "weight": 0.07193827
    },
    {
      "name": "Tesla’s humanoid robot",
      "weight": 0.068538345
    },
    {
      "name": "tough competition",
      "weight": 0.06833024
    },
    {
      "name": "more time",
      "weight": 0.067714654
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Auto"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.92578125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.87060546875
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Brand)/Tesla Motors",
      "score": 0.71142578125
    },
    {
      "name": "/Autos & Vehicles/Motor Vehicles (By Type)/Hybrid & Alternative Vehicles",
      "score": 0.33935546875
    }
  ],
  "sentiment": {
    "positive": 0.15656337,
    "negative": 0.45060438,
    "neutral": 0.39283222
  },
  "summary": "Tesla CEO, Elon Musk, has stated that around 80% of the company's value will be in the form of its humanoid robot, Optimus. The announcement comes amidst a global downturn in sales and public unease over the CEO's controversial political stance. However, Musk remains optimistic about the future of the robot, suggesting it could be used in industrial settings like factories and as a home helper. The robot is currently under development and could cost between $20,000 and $30,000 when it is produced at scale.",
  "shortSummary": "Elon Musk believes Tesla’s humanoid robot, Optimus, will account for 80% of the company's value, despite challenges and competition, aiming for large-scale deployment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "50384dac8da0458780b1c1a7f2f3a7c2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.digitaltrends.com/computing/humanoid-robot-complex-tasks/",
      "text": "Boston Dynamics’ humanoid robot may have skipped the inaugural “robot Olympics” in China last week, but that doesn’t mean the engineers behind the machine have been sitting around watching the world go by.\nIndeed, a video released by the Massachussetts-based company on Wednesday reveals that the team has been hard at work on Atlas, its advanced and highly talented bipedal bot.\nWorking with experts at the AI- and robotics-focused Toyota Research Institute (TRI), Boston Dynamics has equipped Atlas with a Large Behavior Model (LBM), essentially a sophisticated AI system trained on vast datasets of human actions, aimed at enabling the robots to understand, generate, and adapt complex, human-like behaviors for activities in real-world environments.\nThe video shows Atlas performing a lengthy sequence of complex tasks that force it to combine object manipulation with locomotion. They include walking, crouching, and lifting objects, while at the same time packing, sorting, and organizing.\n“By adopting LBMs, new capabilities that previously would have been laboriously hand-programmed can now be added quickly and without writing a single new line of code,” the Massachussetts-based company said in a release.\nTo test its ability to adjust itself, an engineer interrupts Atlas in the way that an annoying co-worker might do, by repeatedly closing the lid of the box from which it’s taking things, and by sliding the box across the floor.\nIf Atlas had a voice — and no doubt one day it will — it would probably have said: “Can you quit messing around — I’m trying to get a job done here.”\nAtlas passes with flying colors, refraining from decking the troublemaker and instead readjusting its position to continue with the task in hand.\n“This work provides a glimpse into how we’re thinking about building general-purpose robots that will transform how we live and work,” said Scott Kuindersma, Boston Dynamics’ vice president of robotics research. “Training a single neural network to perform many long-horizon manipulation tasks will lead to better generalization, and highly capable robots like Atlas present the fewest barriers to data collection for tasks requiring whole-body precision, dexterity, and strength.”\nBoston Dynamics is one of a growing number of tech firms working on humanoid robots, with rapidly advancing technology paving the way for increasingly agile, dexterous, and intelligent bipedal robots that could one day perform a huge variety of activities. Even the laundry …"
    },
    {
      "url": "https://www.digitaltrends.com/computing/the-tesla-bot-isnt-superhuman-yet-but-it-can-make-dinner/",
      "text": "A week ago we saw Tesla’s Optimus robot showing off some nifty dance moves. This week, you can watch it performing a bunch of mundane tasks, though admittedly with a great deal of skill — for a humanoid robot.\nInstructed via natural language prompts, the so-called “Tesla bot” is shown in a new video dumping trash in a bin, cleaning food off a table with a dustpan and brush, tearing off a sheet of paper towel, stirring a pot of food, and vacuuming the floor, among other tasks.\nThe performance may not shake the world of humanoid robotics to its core, but it nevertheless shows the kind of steady progress that Tesla engineers are making, with the bot’s actions and movements becoming evermore complex.\nCommenting on the latest clip, Optimus team boss Milan Kovac said in a post on X: “One of our goals is to have Optimus learn straight from internet videos of humans doing tasks.” Just to be clear, that doesn’t mean the robot will literally watch videos like a human. Instead, it suggests that the robot will learn from the vast amount of data available in those videos, such as demonstrations of tasks, movements, or behaviors.\nKovac said that his team recently had a “significant breakthrough” that means it can now transfer “a big chunk of the learning directly from human videos to the bots (1st- person views for now),” explaining that this allows his team to bootstrap new tasks much more quickly compared to using teleoperated bot data alone.\nNext, the plan is to make Optimus more reliable by getting it to practice tasks on its own — either in the real world or in simulations — using reinforcement learning, a method that improves actions through trial and error.\nTesla boss Elon Musk, who has spoken enthusiastically of Optimus ever since the company first announced it in 2021, has claimed that “thousands” of the robots may one day be deployed alongside human staff at Tesla factories, taking care of “dangerous, repetitive, [and] boring tasks.”\nThe company, better known for making electric cars than humanoid robots, is racing against a growing number of tech firms globally that are intent on commercializing their humanoid robots, whether for the workplace, home, or perhaps some entirely new human-robot ecosystems yet to be imagined."
    },
    {
      "url": "https://www.digitaltrends.com/cars/figure-humanoid-robot-autonomous-tasks/",
      "text": "Robotics startup Figure recently shared a new video showing several of its humanoid robots performing a task that could be applied to the automotive industry.\nFigure completed a trial deployment of its advanced Figure 02 humanoid robot at a BMW facility in Spartanburg, South Carolina, a few months ago, when the robots were used to insert sheet metal parts into specific fixtures that were then assembled as part of a vehicle’s chassis.\nIn the new video, California-based Figure said its fully autonomous humanoid robot is capable of carrying out 1,000 placements a day, with the latest version of the machine improving in areas of accuracy and speed over the original design.\n“The developments in the field of robotics are very promising,” BMW said at the end of the trial in August. “With an early test operation, we are now determining possible applications for humanoid robots in production.” It added that the robot “can save employees from having to perform ergonomically awkward and tiring tasks.”\nThe trial also allowed BMW to better understand how it might successfully integrate multipurpose robots into an existing production system.\nLooking ahead, BMW and Figure will work together to improve the robot’s design while preparing it for future applications in auto manufacturing.\nFigure unveiled the latest version of its humanoid robot in August, in time for the BMW trial. It features three times the processing power of the original version; improved voice communication; better cameras, microphones, and sensors; and a high-performance battery. It also comes with fourth-generation human-scale hands with 16 degrees of freedom and human-equivalent strength, capable of performing two-handed tasks that require varied and dynamic manipulation, complex grasping, and careful coordination.\nWhile it’s true that highly advanced, multi-axis arm-like robots have been operating in car plants for decades, it’s possible that humanoid robots — like those being developed by Figure, Boston Dynamics, and Tesla — could one day surpass these in areas such as versatility and adaptability, which is particularly important in dynamic manufacturing environments. The hands attached to humanoid robots are certain to become even more dexterous, enabling them to better perform more delicate manipulations than those carried out by more traditional industrial robots. Cognitive abilities, too, will improve over time, with AI helping the robots to act more intelligently for even greater autonomy.\nMulti-axis robots certainly excel in specific, repetitive tasks, but humanoid robots look like a more flexible solution for complex, varied environments where human-like interaction and problem-solving abilities are key.\nThe current crop of humanoid robots isn’t there yet, but it’s exciting to see videos like this showing the advances being made in the sector."
    },
    {
      "url": "https://www.digitaltrends.com/computing/robotera-l7-humanoid-robot/",
      "text": "What’s happened? Chinese robotics firm Robotera has officially launched its next-generation, high-performance humanoid robot, called Robot L7.\n- The highly versatile bipedal robot stands at 171 cm tall and can run, jump, and dance, and also perform an array of tasks, some of which it demonstrates in the video below.\n- The L7 deploys fast-acting joint motors, enabling the robot to quickly change direction and also adjust its balance to avoid sudden falls. It also uses an AI system that Robotera calls “Body and Brain” for full-body control and which enables the robot move in a natural way.\n- Its core frame uses aerospace-grade aluminum alloy and carbon fiber composites, with the entire robot tipping the scales at 143 pounds (65 kg).\nThis is important because: The launch of Robotera’s L7 robot marks the latest arrival in a string of increasingly impressive humanoid robots made by companies big and small around the world.\n- The L7 is believed to be the fastest full-sized humanoid robot, capable of sprinting at up to 9 mph (14.4 kph). The feat highlights its agility and suitability for tasks that require rapid action, as well as fast movement between locations.\n- The launch comes hot on the heels of other highly capable humanoid robots entering the sector, reflecting notable progress in robotics technology that’s also becoming increasingly affordable.\nWhy should I care? Well, they could, for example, take your job. The humanoid robots, many of which are now being infused with AI smarts, could dramatically transform workplaces such as factories and warehouses. Customer-facing roles, and even security (think Robocop) could also be impacted.\n- Automakers have been using industrial robots for years, but now they’re also testing humanoid robots in their manufacturing plants in a development that demonstrates a clear interest in the technology.\n- SoftBank once tried to make its Pepper robot a regular fixture as a customer service helper in places like shops, malls, and airports, but the technology — in terms of both movement and cognitive ability — just wasn’t ready, and production of Pepper ended in 2021. Other tech companies have since raced ahead.\nOkay, what’s next? While existing robotics companies are enhancing their current humanoid robots all the time, new startups are also unveiling fresh designs. Competition is fierce, and money is pouring into the humanoid robotics sector as engineers seek to become the first to secure a design that’s well and truly ready for mass production — and mass deployment. But there are challenges, so such a change won’t be happening for a while.\n- While many humanoid robots excel in lower-body movement, their upper-body dexterity remains a serious challenge, with delicate tasks involving hands and fingers, for example, still too fiddly for most to carry out at speed.\n- Incorporating humanoid robots into current industrial or commercial environments could prove difficult, especially if they’re working alongside humans."
    },
    {
      "url": "https://www.digitaltrends.com/computing/humanoid-robot-dominates-robot-olympics/",
      "text": "The first-ever World Humanoid Robot Olympics has wrapped up in Beijing, China, and one particular robot shone in the track events.\nBuilt by Chinese firm Unitree Robotics, the H1 humanoid robot helped the team to pick up four gold medals, three silver, and four bronze at the three-day contest, which saw more 280 teams from 16 countries showcasing around 500 humanoid robots.\nThe events included not only athletics but also gymnastics, boxing, music performances, and more. The performances revealed the many advancements made by such robots in recent years, as developers work to apply these capabilities to real-world scenarios in the home and workplace.\nWhile videos shared online over the weekend showed plenty of robots tumbling over (and getting up again), Unitree’s H1 robot performed impressively in track events that included the 1,500 meters, 400 meters, 100 meters obstacle, and 4×100 meters relay.\nThe robot’s first gold came in the 1,500 meters, which it completed with ease in just over 6 minutes and 34 seconds (the world record is 3 minutes and 26 seconds). Footage (top) posted on YouTube by Unitree shows the H1 running at a steady pace as it stormed to victory. Hitting a top speed of 4.78 meters a second, the humanoid robot’s running style closely resembled that of a top athlete, with its arms and legs moving in perfect sync to maintain balance, speed, and momentum.\nUnitree founder and CEO Wang Xingxing described H1’s success at the Games as “meaningful,” as the robot was the first among several humanoid robots made by the company since it was founded in 2016.\nUnitree recently made the news with the R1, an ultra-lightweight, fully customizable humanoid robot capable of walking, running, dancing, and much more besides. Priced at $5,900, Unitree is aiming the bipedal bot at developers, tech enthusiasts, research labs, and educational institutions."
    }
  ],
  "argos_summary": "Elon Musk has declared that roughly 80% of Tesla’s future value will come from its humanoid robot, Optimus, even though the bot remains in early development and could take years to deploy at scale. Tesla’s Master Plan Part IV frames Optimus as a key AI‑powered product that could transform labor by automating repetitive or dangerous tasks in factories and homes. Musk envisions thousands of Optimus units working alongside humans at Tesla plants, with a projected unit cost of $20,000–$30,000, while the company faces stiff competition from other robotics firms such as Boston Dynamics, Figure, and Robotera.",
  "argos_id": "GCJWUJB3P"
}