{
  "url": "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-september-1/",
  "authorsByline": "Will Salmon",
  "articleId": "fbe07bacc4194f718431a3f6703fbba0",
  "source": {
    "domain": "gamesradar.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/rF4EQZJqMJAhExxN9HR4od.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T17:00:00+00:00",
  "addDate": "2025-09-01T17:09:08.987190+00:00",
  "refreshDate": "2025-09-01T17:09:08.987192+00:00",
  "score": 1.0,
  "title": "The best new shows and movies streaming this week on Netflix, Disney Plus, Paramount Plus, and more",
  "description": "Check out our guide to the best movies and shows streaming this week, September 1–7",
  "content": "Welcome back to another edition of our weekly guide to the best new shows and movies! On this page, you'll find six recommendations for the hottest films and TV shows that are available this week across all the best streaming services.\n\nThe biggest highlight of the week is surely the second half of Wednesday season 2. Still, the creepy and kooky student isn't the only must-watch. One of the best recent Marvel movies is making its streaming debut, as is the latest Spike Lee movie. There's also a particularly strong episode of Alien: Earth and a gripping new K-drama to round things out.\n\nSo if you're looking forward to putting your feet up and enjoying a great night in front of your TV, check out our list below. And when you're done here, why not check out our lists of the best shows on Paramount Plus and the best Netflix movies for more streaming inspiration.\n\nThe back half of Wednesday's second season arrives this week, bringing with it a resolution to episode 4's killer cliffhanger. Wednesday is injured – possibly even dead (though we seriously doubt that, given that season 3 is on the way). That's only the start of her problems, though, as she still has to deal with LOIS – a secret program that is attempting to steal outcast powers.\n\nWednesday season 2 has, so far, been a solid follow-up to the first run. These final four episodes look like they'll be big on twists and reveals, while also including Lady Gaga's long-awaited appearance as Rosaline Rotwood, who Netflix has described as \"a legendary Nevermore teacher who crosses paths with Wednesday.\" Exactly which episodes the pop icon will appear in this season is currently uncertain, but you can find out when all four episodes drop – when else? – this Wednesday.\n\nFind out what we made of the first half of the season with our Wednesday season 2 part 1 review.\n\nAvailable: UK/US \n\nWhere to watch: Disney Plus\n\nThe 36th (yes, really) MCU film is now streaming on Disney Plus. Thunderbolts* follows a scrappy group of Marvel anti-heroes as they try to save the world – and themselves. Florence Pugh's second Black Widow; Sebastian Stan's former-Winter Soldier, Bucky Barnes; Wyatt Russell's fallen, former-Captain America John Walker; David Harbour's Red Guardian, and more – these are all damaged people with bad pasts who are very specifically not clean cut heroes like the Avengers. Still, fate has conspired to make them the team the world needs right now.\n\nIf you missed Thunderbolts* at the cinema, now is the perfect time to catch up. It's funny, heartfelt, and more surefooted than some of the other recent MCU efforts, and Lewis Pullman's Bob feels like a very significant addition to this universe's ever-expanding list of characters.\n\nWe said the movie \"Makes good on the promise of a new start for the MCU\" in our Thunderbolts* review.\n\nAvailable: US/UK\n\nWhere to watch: Hulu (US), Disney Plus (UK)\n\nAfter a couple of paranoid episodes that eased up on the Xenomorph horror, Alien: Earth returns to its roots. 'In Space, No One...' flashes back to tell the story of the USCSS Maginot – the doomed spaceship that crashed into Earth at the start of the season. The main character here is Babou Ceesay's Morrow, the mysterious cyborg who has quickly become the show's most intriguing player. Something is wrong onboard the ship and he is determined to get to the bottom of it.\n\nAlien: Earth has successfully broadened the parameters of what this franchise is capable of. Still, it's nice to have a back-to-basics episode like this, one which reminds you just how tense and thrilling an escaped Xenomorph on a spaceship can be. Fans of Ridley Scott's original movie and of Alien: Isolation should get a kick out of this one.\n\nFind out more about this terrifying show with our Alien: Earth review.\n\nAvailable: US/UK \n\nWhere to watch: Apple TV Plus\n\nAward-winning director Spike Lee teams up with Denzel Washington for this fantastic remake – or perhaps remix? – of Akira Kurosawa's 1963 classic thriller, High and Low. Washington plays David King, a music mogul in New York who is willing to risk everything to get the majority share in his music company, Stackin' Hits Records, back. Just as he is about to make the deal, however, he discovers that his son Trey (Aubrey Joseph) has been kidnapped.\n\nThings only get more complicated from there, with King's ethics tested as he tries to save both his son and his career. Washington is backed up by a terrific supporting cast, including Jeffrey Wright, Ilfenesh Hadera, and rapper A$AP Rocky. This is Spike Lee on terrific form, with a film that can easily stand alongside his best work.\n\nCheck out our list of the best Apple TV Plus movies.\n\nThe term \"stan\" – as in an over-zealous fan of someone or something – originated in rapper Eminem's harrowing track of the same name from 2000. One of the definitive songs about the downsides of fame, 'Stan' is a portrait of a (fictional) fan who takes things too far, with tragic results. This similarly-named documentary is less doom-laden, but looks at Marshall Bruce Mathers III's real life fans and the artist himself, using rare archive footage and interviews.\n\nDespite a few elements of his life being public knowledge (most notably his difficult relationship with his mother) and his often very personal lyrics, Eminem has largely managed to keep his private life, well, private. Stans doesn't significantly change that, being far more about the fans that the artist himself, but it's an engaging and insightful documentary that's worth watching even if you're not one of the faithful.\n\nThis eight-episode k-drama hinges on the strained relationship between a police officer and his mother, who just happens to be a serial killer known as the Mantis! Cha Su Yeol (Jang Dong-yoon) is a cop who has grown up in the shadow of his infamous mom, Jung Yi-shin (Go Hyun-jung), who slaughtered five men. When a copycat killer strikes, however, Cha Su Yeol must turn to his mother, who has spent the last two decades behind bars, to try and solve the mystery.\n\nYes, this sounds a bit like The Silence of the Lambs in South Korea, with an added family dynamic. Unusually for a Netflix show, Queen Mantis will be airing two episodes each week, on Fridays and Saturdays throughout September.\n\nDiscover the brilliant series that make up our list of the best Netflix shows.\n\nLooking for something else to watch? Check out our list of the best movies on Disney Plus.",
  "medium": "Article",
  "links": [
    "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-july-14/",
    "https://www.gamesradar.com/alien-isolation-review/",
    "https://www.gamesradar.com/entertainment/fantasy-shows/wednesday-season-3-has-been-ordered-at-netflix-and-a-top-secret-spinoff-series-is-in-early-talks-theres-a-lot-to-explore-in-the-addams-family/",
    "https://www.gamesradar.com/entertainment/best-netflix-movies/",
    "https://www.gamesradar.com/entertainment/sci-fi-shows/alien-earth-release-date-cast-plot-trailer/",
    "https://www.gamesradar.com/best-movies-on-apple-tv/",
    "https://www.gamesradar.com/tag/disney/",
    "https://www.gamesradar.com/entertainment/best-streaming-services/",
    "https://www.gamesradar.com/best-shows-on-paramount-plus/",
    "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-august-11/",
    "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-august-25/",
    "https://www.gamesradar.com/best-shows-on-netflix/",
    "https://www.gamesradar.com/entertainment/horror-shows/alien-earth-review/",
    "https://www.gamesradar.com/entertainment/marvel-movies/thunderbolts-review/",
    "https://www.gamesradar.com/best-movies-on-disney-plus/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Wednesday season",
      "weight": 0.05839747
    },
    {
      "name": "paranoid episodes",
      "weight": 0.055987775
    },
    {
      "name": "Disney Plus",
      "weight": 0.055674803
    },
    {
      "name": "TV shows",
      "weight": 0.052228265
    },
    {
      "name": "Apple TV Plus",
      "weight": 0.051438145
    },
    {
      "name": "Paramount Plus",
      "weight": 0.048404425
    },
    {
      "name": "Fans",
      "weight": 0.047488257
    },
    {
      "name": "movies",
      "weight": 0.046851758
    },
    {
      "name": "season",
      "weight": 0.04647714
    },
    {
      "name": "the best Apple TV Plus movies",
      "weight": 0.046352435
    }
  ],
  "topics": [
    {
      "name": "Gaming"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.91943359375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.8662109375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.81640625
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.7626953125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.476806640625
    }
  ],
  "sentiment": {
    "positive": 0.21157345,
    "negative": 0.32763135,
    "neutral": 0.46079516
  },
  "summary": "The best new shows and movies streaming this week include the second half of Wednesday season 2, one of the best recent Marvel movies, and the latest Spike Lee movie. Other notable streaming services include Alien: Earth and a new K-drama from Apple TV Plus. The back half of the second season of Wednesday, which includes Lady Gaga's appearance as Rosaline Rotwood, is expected to be big on twists and reveals. The 36th MCU film, Thunderbolts*, follows a group of Marvel anti-heroes on their quest to save the world and themselves. Meanwhile, the latest episode of Wednesday tells the story of an escaped Xenomorph on a spaceship.",
  "shortSummary": "The second half of Wednesday season 2 and the latest Spike Lee movie are among the best new shows and movies streaming on Netflix, Disney Plus, and Paramount Plus.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "683a047316454dc9a35be7ceec8de6de",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.gamesradar.com/entertainment/best-streaming-services/",
      "text": "The best streaming services in 2025: comparing Netflix, HBO Max, Disney Plus, and more\nYour complete guide to the best streaming services for TV and movies right now\nNarrowing down the best streaming services is harder than ever, as there are so many different platforms now available. In the old days most people would likely choose Netflix, but now Disney Plus, Max and Prime Video all offer huge libraries, with the smaller streamers offering new avenues for entertainment as well.\nThey all have their own movie release dates, new TV shows, and exclusives, as well as downsides like price hikes and ads. That's why we've put together this page to help simplify your selection. Whatever criteria you're looking for, whether it be access to your favorite shows, the price, or if the best Netflix movies are still the obvious winners, we've outlined the options to help you make an informed choice.\nPerhaps you want a reliable service for movie night, the best anime, or shows like The Last of Us season 2. Whatever it is, we've done the research for you. In this guide to the best streaming services, we've accounted for library size, cost, and user experience, giving you all the info you need to find a streamer that fits your specific needs.\nNetflix\nAvailable: Worldwide\nPrice: $17.99/month (Standard plan) / £12.99/month (Standard plan)\nNetflix is the elder statesman of streamers, having launched in 2007 (though the company itself stretches all the way to the late '90s, having started as a mail order DVD rental service). It's also still arguably the most comprehensive, with thousands of shows and movies to choose from and an easy-to-use UI.\nIt has its share of issues, of course – namely a recent price increase and a tendency for content to come and go from the service, due to licensing. It's no longer home to Friends and The Office, for example. That said, the catalog of shows that it does have is enviable. Squid Game, Bridgerton, You, Cobra Kai, and Black Mirror are among the biggest shows on the planet, and Stranger Things season 5 is sure to be event viewing, and there's some stunning Netflix anime series. The Netflix Originals strand means that the service is an enticing draw for movie lovers too. If you're only going to sub to one streamer then Netflix is probably the one for you.\nRead more: Already signed up? Why not check out the best shows on Netflix?\nDisney Plus\nAvailable: Worldwide\nPrice: $9.99/month (Standard plan) / £8.99/month (Standard plan)\nIf you love Marvel, Star Wars, or Disney movies then a Disney Plus subscription is a no-brainer. With over 600 movies and TV shows at launch, the House of Mouse's streaming service is jam-packed with childhood classics as well as new shows and movies.\nDisney Plus is where you'll find all the upcoming Marvel movies and shows, including the likes of Daredevil: Born Again and Ironheart. It's the only place where you can see new Star Wars shows too, including the critical smash that is Andor season 2. Then, of course, there's Disney itself – arguably the biggest entertainment brand in the world thanks to classics like The Lion King, Frozen, and The Little Mermaid, all of which are available here.\nIt's pretty cheap, too, in comparison to some of its competitors and there's a Disney Plus, Hulu, and ESPN package for $16.99 a month in the US, which sweetens the deal. There are also Disney Plus downloads that allow you to download content for offline viewing. Our Disney Plus bundles page has the best options for countries around the world.\nRead more: Find the best movies on Disney Plus.\nPrime Video\nAvailable: Worldwide\nPrice: $8.99/month ($139/year) / £8.99/month (£95/year)\nAs you might expect coming from Amazon, one of the biggest companies in the world, Prime Video is absolutely stacked with movies and shows. OK, so it might not have the same level of big name show recognition as some of the content on Netflix or Disney Plus, but there's still some of the best TV shows here including The Boys (and its spin-off Gen V), Lord of the Rings: The Rings of Power, and The Marvelous Ms. Maisel to name just a few.\nIt's good value, too. If you have an Amazon Prime membership then you'll get Prime Video bundled in alongside loads of other extras. You can also expand the content available with bolt on services such as the art house movie-focused MUBI plus various anime channels. Region-locking is a bit of a pain, but it's hard to argue with Prime's combination of eye-catching shows (The Boys season 5 for one...) and value for money.\nRead more: Check out the best shows on Amazon Prime and the best movies on Amazon Prime.\nMax\nAvailable: US, Europe, Japan, Latin America\nPrice: $16.99/month (ad-free) / $9.99 (with ads)\nMax (formerly HBO Max) is where you'll find Warner Bros. Discovery's latest and greatest. Upcoming projects to look out for include a Green Lantern TV show in the works, House of the Dragon season 3, and the Harry Potter TV show. But not everything has to be shiny and new to be worthwhile.\nYou're also getting complete access to HBO's incredible library, which means if you've missed out on The Sopranos, The Leftovers, Deadwood, or The Wire, you can rest easy knowing they'll be there for you. Speaking of, Friends is also streaming on Max exclusively. Sadly, Max isn't in the UK yet. There's also no denying that $16.99/month is a little steep. Still, you're getting loads of viewing material here, especially when you factor in content from Adult Swim, Cartoon Network, Warner, and Crunchyroll. Plus, the entire Studio Ghibli collection.\nRead more: For a deeper dive into the service, look at our list of the best movies on Max and the best shows on Max.\nApple TV Plus\nAvailable: US, UK, Canada, Latin America, Europe, Russia, Africa, Turkey, Middle East, Asia-Pacific, and Central Asia\nPrice: $9.99/month / £8.99/month\nApple TV Plus focuses on high-quality shows with household names instead of the scattershot approach of some of its rivals. You'll find plenty of limited series starring A-listers and a small collection of original films. Jennifer Aniston (The Morning Show), Aaron Paul (Truth Be Told), and Hailee Steinfeld (Dickinson) formed part of Apple TV Plus' opening salvo, with visionaries such as JJ Abrams and M. Night Shyamalan two of the many directors who preferred Apple's approach.\nBut compared to its contemporaries, Apple TV Plus struggles to draw attention. In a crowded marketplace, it’s destined to get lost in the background as far more eye-catching services stake their claim. That being said, there's no better service if you prefer quality over quantity. Severance season 2 was a huge hit, and the streamer just debuted the hotly-anticipated Your Friends & Neighbors. Another good mark for Apple TV is that it's one of the services that still offers free trials, and many new Apple products also come with several months free.\nRead more: Find out about the Apple TV Plus prices and read our list of the best Apple TV Plus shows.\nHulu\nAvailable: US\nPrice: $9.99/month (Basic) / $18.99/month (Premium)\nHulu was once the go-to streaming service for those who didn't want to pay for cable. It still operates effectively in that regard, though now has the additional benefit of a handful of top-quality original shows, such as The Handmaid's Tale, that make the small outlay even more worthwhile. But Hulu's main selling point is still that you can watch network TV shortly after it airs, including shows on major networks such as ABC and Fox.\nAs a substitute for paying for a cable provider, there's no better. As a streaming service, though, it's lacking in some regards. The animation on offer is great (Family Guy, Rick and Morty, Bob's Burgers), though there's no more than one or two killer must-watch shows, and the Basic package includes ads. It's not currently available on its own in the UK – so Brits will have to head to Disney Plus to access the shows and movies on offer. If you're in the US though, you’re in luck.\nRead more: See our extensive rundown of the latest Hulu prices and bundle deals.\nPeacock\nAvailable: US, Europe, Africa, India\nPrice: $7.99/month (ad-free)\nComedy is a big draw to NBC's streaming service. It houses sitcom royalty like The Office, Parks & Recreation, and Brooklyn Nine-Nine. The collection of movies and shows is mixed. Many will lap up Shrek, Hell's Kitchen, and the Bourne movies, but mileage may vary. NBC is looking to make waves elsewhere, too, with original and live content.\nA new season of Rian Johnson's ace whodunnit Poker Face has just landed on the streamer, and a spin-off of The Office is in development. Whether the latter comes to pass is up in the air, but it's proof that NBC wants to compete in the arena of big original productions. Sports also have a place here as non-televised NBC Premier League games are available on Peacock as well as WWE content. With so many services on offer, Peacock might be best playing second fiddle to another larger one. Alongside Netflix or Amazon Prime, this could be well worth the outlay. It used to have a free option, but it's no longer available to new customers.\nRead more: For more information on signing up, check out the latest Peacock TV costs.\nNow TV\nAvailable: UK\nPrice: £9.99/month (Entertainment) / £9.99/month (Sky Cinema) / £34.99/six months (Sports)\nFor those looking to watch HBO Max in the UK, Now TV presents a fairly cheap, straightforward way of accessing some of your favorite box sets and movies without having to pay for a Sky or Virgin Media subscription.\nThere are no exclusives of its own to speak of, but Now TV regularly gives viewers the latest and greatest TV shows immediately after airing. Shows like House of the Dragon are available on the same day as Sky Atlantic through the Entertainment Pass. However, the negatives can outweigh the positives. Some heavy hitters (such as The Walking Dead and South Park) were removed in 2020. And wanting everything costs a pretty penny, which may see you scrambling for an all-in-one television package instead of the myriad of passes.\nRead more: For more information on signing up, read how you can use Now TV to watch HBO Max in the UK.\nFor new streaming picks, check out our lists of all the new TV shows this year!\nBringing all the latest movie news, features, and reviews to your inbox\nI'm the Senior Entertainment Writer here at GamesRadar+, focusing on news, features, and interviews with some of the biggest names in film and TV. On-site, you'll find me marveling at Marvel and providing analysis and room temperature takes on the newest films, Star Wars and, of course, anime. Outside of GR, I love getting lost in a good 100-hour JRPG, Warzone, and kicking back on the (virtual) field with Football Manager. My work has also been featured in OPM, FourFourTwo, and Game Revolution.\n- Will SalmonStreaming Editor\n- Trudie GrahamContributor\n- Emma-Jane BettsManaging Editor, Evergreens\n- Anthony McGlynnContributing Writer"
    },
    {
      "url": "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-july-14/",
      "text": "The best new shows and movies streaming this week on Netflix, Crunchyroll, Disney Plus, and more\nCheck out our guide to the best movies and shows streaming this week, July 14–July 20\nWelcome back to our weekly guide to the best new shows and movies. Here on this page we've selected six of the must-see TV shows and films, all of which are available to stream this week.\nIf you've been struggling to find something to watch then this handy list is here to help you out with some streaming inspiration. We've scoured all of the best streaming services, including Netflix, Prime Video, Disney Plus, and more to find the hottest new shows and movies that will brighten up your week.\nThis week we have the return of Star Trek to Paramount Plus, a gripping new thriller series on Netflix, and Nick Frost horror comedy Get Away hacks and slashes its way to Hulu. So if you're ready to find your next essential watch, go find some snacks, sit back, and let's plan your week's viewing.\nStar Trek: Strange New Worlds season 3\nAvailable: US/UK\nWhere to watch: Paramount Plus\nThe best of the modern Star Trek shows returns for its third season. Kicking off with the resolution to last season's big cliffhanger, which saw Captain Pike (Anson Mount) and the crew of the Enterprise facing down a deadly Gorn fleet, the new run of 10 episodes then takes in a very messy wedding, an away mission that takes a turn for the sinister, an archaeological adventure, and much more.\nAs ever Strange New World is diverse in tone, straddling sci-fi action, comedy, and even some pretty effective horror. The show takes some big swings – admittedly some of which work better than others – and the crew remains as reliably charming as ever. Mount in particular is excellent as the immaculately-coiffed Captain cursed with the foreknowledge of a bleak future but determined to make the most of his life regardless.\nFind out what we made of the new episodes with our Star Trek: Strange New Worlds season 3 review.\nUntamed\nAvailable: UK/US\nWhere to watch: Netflix\nEric Bana and Sam Neill star in Netflix's latest crime miniseries. Set in the beautiful expanse of the Yosemite National Park, Untamed opens with the discovery of a woman's body at the bottom of El Capitan – seemingly killed in a climbing accident. National Park Service agent Kyle Turner (Eric Bana) isn't convinced, however, and he soon finds himself hunting a killer. With close to a million acres of wilderness in the park, however, that's going to be no easy task...\nBana's Turner is your classic troubled detective, haunted by a tragedy in his past that he must reckon with in the present, all while getting to grips with new partner Naya Vasquez (Lily Santiago) and various problems in the park. This looks like a good, twisty mystery enlivened by the stunning locations and Bana and Neill's charisma.\nCheck out our guide to the best Netflix shows.\nGet Away\nAvailable: US/UK\nWhere to watch: Hulu/NOW TV\nThis British horror comedy stars Shaun of the Dead's Nick Frost and plays out like a less harrowing and more amusing take on Midsommar. Frost plays Richard Smith who, along with his wife Susan (Aisling Bea), and kids Sam (Sebastian Croft) and Jessie (Maisie Ayres), take a holiday on Svalta, a remote Swedish island. The locals there are far from impressed by the arrival of these holidaymakers and it's not long before the blood starts to flow...\nDirected by Steffen Haars and written by Frost himself (in his first solo writing venture), Get Away is a likeable mix of gore and gags with a pretty killer twist. It's not quite of the same pedigree as the films that Frost made with Edgar Wright (Shaun of the Dead, Hot Fuzz, and The World's End) but it's well worth a watch, with Aisling Bea particularly excelling as the tough and resourceful Susan. Get Away lands on Hulu in the US on July 15 and can be found in the UK on NOW TV.\nKaiju No. 8 season 2\nAvailable: US/UK\nWhere to watch: Crunchyroll\nThis monster-hunting anime is currently sitting pretty with a perfect 100% score on Rotten Tomatoes for its first season. We'll see if it can maintain that hit rate later this week when season 2 of the series lands on Crunchyroll. For those who haven't seen it, Kaiju No. 8 follows Kafka Hibino, a young man who has the ability to transform into a kaiju. Trouble is, Kafka has made a solemn oath that one day he will be a part of the Japanese Anti-Kaiju Defense Force.\nThe end of season one saw Kafka's secret revealed. As a kaiju he fought with members of the Defense Force. Rather than be killed, however, Kafka was eventually recruited into the squad, as an anti-kaiju weapon. Season 2 picks up from there with another 11 episodes of monster-bashing mayhem on Crunchyroll.\nCheck out the first trailer for Kaiju No. 8 season 2.\nNormal People\nAvailable: US/UK\nWhere to watch: Hulu/Disney Plus\nThis Irish romantic drama was a major breakout role for both Paul Mescal and Daisy Edgar-Jones back in 2018. Adapted from Sally Rooney's beloved bestselling novel, Normal People documents the relationship between Marianne Sheridan (Edgar-Jones) and Connell Waldron (Mescal), through high school and university. It's a tumultuous time in both their lives and this achingly sensitive drama follows the highs and lows of their on-again/off-again romance over 12 gripping, addictive episodes.\nNormal People has been streaming on Hulu in the US for some time. Now it's coming to Disney Plus in the UK meaning this is a great opportunity to see a beautiful, melancholy drama that helped boost both its leads to stardom.\nMamma Mia!\nAvailable: US/UK\nWhere to watch: Netflix\nThis jukebox musical, based around the songs of ABBA, was a big hit back in 2008 despite some pretty mixed reviews. Meryl Streep plays Donna Sheridan, a hotel owner in Greece who is excitedly getting ready for her daughter Sophie's wedding. Little does she know, however, that Sophie has invited three of Donna's old flames along in the hope of finally finding out once and for all who her father is. Trouble is, even her mom doesn't know...\nCue several – literal – song and dance numbers as Donna and her former lovers (played by Pierce Brosnan, Colin Firth, and Stellan Skarsgård) try to get to the bottom of the paternity mystery. It's all very silly but also a lot of big-hearted fun. And let's face it, you can't argue with ABBA.\nLooking for something else to watch? Check out our list of the best movies on Disney Plus.\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/best-shows-on-netflix/",
      "text": "The 25 best shows on Netflix to watch right now\nFrom Wednesday to Arcane, here are the best Netflix shows to stream in September 2025\nWelcome back to our page dedicated to the best Netflix shows! Here we've pulled together a selection of 25 series that represent the finest shows that are available to stream right now on Netflix.\nAs one of the best streaming services out there, Netflix has a vast catalog to choose from. To help you browse it, we've put together this list, which is broken down into five popular genres: action, animation, fantasy, sci-fi, and horror. Here you'll find all the big name hits you'd expect, like Squid Game and Black Mirror, as well as a few lesser known gems. We also have a pick of the week: this time around it's the second half of Wednesday season 2.\nSo, while we wait for Stranger Things season 5, why not check out some of the other great shows that Netflix has to offer? And when you've finished reading here, take a look at our selection of the best Netflix movies, and our weekly guide to the best shows and movies currently streaming.\nStreaming pick of the week\nWednesday season 2, part 2\nYear: 2022\nSeasons: 2\nAvailable on: Netflix US/UK\nIt's been a long month since the first part of Wednesday season 2 left us all screaming at that cliffhanger. Well, thankfully we'll get an answer to if Wednesday Addams lives or dies this week as the second batch of season 2 episodes lands on Netflix. That's not the only reason to tune in, though, as it's in these next four episodes that we'll finally see Lady Gaga's much-hyped appearance as a mysterious new character named Rosaline Rotwood.\nWednesday season 2 has been a eventful follow up to the original, with a more complex (if slightly convoluted) plot, but Jenna Ortega remains the show's charismatic heart. All four episodes are available to stream from tomorrow, but fans needn't worry about this being the end – a third season has already been confirmed to be in development.\nRead our Wednesday season 2 review here.\nWeekly digests, tales from the communities you love, and more\nBest action shows on Netflix\nBlack Doves\nYear: 2024\nSeasons: 1\nAvailable on: Netflix US/UK\nNew British thriller Black Doves stars Keira Knightley and Ben Whishaw as spy besties taking on some seriously dangerous threats, all in time for Christmas.\nThe London-set show follows an undercover agent who has been posing as a politician's wife for a decade in order to feed government secrets to her employers. When the man she is secretly in love with is murdered, she will stop at nothing to find out the truth and exact revenge on those who killed him.\nBlack Doves is the kind of nail-biting thriller that you won't be able to stop watching. It is so good that it has already been greenlit for a second season, so make sure to join the party as soon as possible.\nBodyguard\nYear: 2018\nSeasons: 1\nAvailable on: Netflix US/UK\nImmerse yourself in this British political thriller starring The Eternals' Richard Madden as a former war veteran turned Police Sergeant who is assigned to protect the despised Home Secretary, Julia Montague (Keeley Hawes). These contrasting personalities are thrown together in close proximity to thwart domestic terrorist attacks, all while Sergeant Budd grapples with his ongoing PTSD and conflict about his evolving emotions toward his boss.\nIt dives into controversial issues of the government's access to private information and how corrupt our politics are to favor the people in positions of power. Think White House Down meets James Bond; this gripping six-part series is almost too good not to be watched in one sitting.\nAfter streaming this one, you can also read our handy guide breaking down all the details on the potential for a Bodyguard season 2.\nThe Gentlemen\nYear: 2024\nSeasons: 1\nAvailable on: Netflix US/UK\nAs spin-off series go, The Gentlemen is one of the finest. Guy Ritchie recreates the world he established in his acclaimed 2019 film of the same name in this Netflix original with Divergent's Theo James at the helm alongside Maze Runner's Kaya Scodelario. In an unexpected turn of events, Edward inherits his father's 1500-acre estate and the title of Duke of Halstead instead of his elder brother, Freddie, and, in turn, his lucrative below-ground weed empire.\nNow a partner in big business to a crime leader's daughter, Susie Glass, Eddie has to navigate the underworld he's been plunged into and try and make it out alive, all while protecting his image as a gentleman. With a second season on the way, there’s no better time to revisit this action comedy.\nRead our The Gentlemen review for more insights!\nNarcos\nYear: 2015\nSeasons: 3\nAvailable on: Netflix US/UK\nPrepare to sit at the edge of your seat, as you tune into the rise and fall of the infamous drug empire led by Pablo Escobar, leader of the Medellín Cartel. The Spanish-American crime drama immerses you in a dramatized version of this real-life figure who moved illegal goods (think cocaine, alcohol, and cigarettes) on the black market as two DEA agents, Murphy and Pena, attempt to finally win the war against drugs in Colombia.\nAll three seasons are packed with twists and turns. Each one does something different without straying too far from its main theme of 'catch the bad guy.' It's a binge-worthy drama that will keep you on your toes.\nLove high-stakes? Check out our list of the best Netflix action movies streaming right now.\nCobra Kai\nYear: 2018\nSeasons: 6\nAvailable on: Netflix US/UK\nCalling all fans of The Karate Kid, the cherished sequel series Cobra Kai is all available to stream on Netflix. After its original release on YouTube Premium, the martial arts drama found a whole new audience when it joined the streaming platform for season three. Set three decades after the original films, the series picks up with Johnny Lawrence, who is suffering from alcoholism and depression after being defeated by his old nemesis, Daniel, as he tries to reform his ways and open the Cobra Kai dojo.\nThere are nods that Karate Kid fans will enjoy, including old cast members, as well as plenty of new material for anyone unfamiliar with the original. It's a story of contrast, resilience, and making peace with old feuds. The show ended in February, so all episodes are now available. Did someone say Cobra Kai marathon?\nRead our Cobra Kai season 6 ending explained to know how the story wrapped, and learn everything about the upcoming Karate Kid: Legends.\nBest Animated shows on Netflix\nArcane\nYear: 2021\nSeasons: 2\nAvailable on: Netflix US/UK\nSet in the Riot Games' League of Legends universe, Arcane is an action-adventure that follows sisters Vi and Jinx (voiced by Hailee Steinfeld and Ella Purnell) as they navigate the unrest between the contrasting worlds of the utopian city, Piltover and the seedy, oppressed side of Zaun. The animation has been widely praised for its world-building, action sequences, and storylines.\nInvested fans will love the homage to the original game, but this is still an accessible and exciting watch for anyone unfamiliar with the source material, too, which led to it becoming the first streaming series to win a Primetime Emmy Award for Outstanding Animated Program. If you needed any more convincing, it's regarded as one of the best video game adaptations ever made, which is an accolade that shouldn't be taken lightly.\nTo keep up-to-date with this gem, head over to our Arcane season 2 release schedule guide. Or read our four-star Arcane season 2 review.\nCastlevania\nYear: 2017\nSeasons: 4\nAvailable on: Netflix US/UK\nBased on the acclaimed Japanese video game series of the same name, this dark action fantasy animation follows Trevor, the last surviving member of the disgraced Belmont clan, a formerly legendary family of monster hunters, as he sets out to take down the revered vampire Dracula and his expansive forces.\nAcross the four seasons there's a host of twists and turns, but also top-notch storytelling and animation throughout the 32 episodes. Starting with 20-minute episodes in the first season, it’s an adaptation that is easy to binge and effortless in style. Castlevania is not one to miss. In fact, it's easily one of the best anime series on Netflix right now.\nLove, Death, and Robots\nYear: 2019\nSeasons: 4\nAvailable on: Netflix US/UK\nBrought to you by David Fincher and Joshua Donner, this unique animated series actually consists of a series of short films that aren't in any way interconnected. Set across various genres, the episodes sometimes relate to a similar theme, but feature different cast, crew, and stories.\nFincher and Donner originally planned this reboot of Heavy Metal to become a film, which is noticeable in the epic storytelling of each episode and makes for a rich feast for audiences across the four seasons. If you love robots, fantasy, romance, and science-fiction, then give this innovative world a whirl.\nVinland Saga\nYear: 2019\nSeasons: 2\nAvailable on: Netflix US/UK\nBased on Makoto Yukimura's manga of the same name, this Japanese anime series follows the life of Thorfinn, a man who is initially bloodthirsty for revenge after his father’s death at the hands of Askeladd. He joins the formidable Vikings and sets out to unleash his rage on the world before ultimately losing all hope in the second season.\nThe acclaimed series has been praised for its animation, writing, and action sequences and the emotive exploration of Thorfinn's grief, psychological damage, and the trauma that haunts him, which develops the existing source material. Whether you're new to these stories or an avid manga reader, it's a breathtaking animation that deserves recognition.\nFor more 2D gems, you can head over to our guide on all the new anime heading our way.\nBest fantasy shows on Netflix\nThe Witcher\nYear: 2019\nSeasons: 3\nAvailable on: Netflix US/UK\nThe Witcher is the ultimate place to start if you're looking for high-fantasy escapism. Based on the novels by Andrzej Sapkowski, the series follows Geralt of Riviera as he goes across the Continent, slaying beasts and saving cities from destruction. Woven into this epic is the tale of crowned princess Ciri and the sorceress Yennefer of Vengerberg.\nThe success of the first three seasons has even led to a spin-off animated series and a live-action prequel, not to mention The Witcher season 4, which will see Liam Hemsworth take over from Henry Cavill in the titular role. It's an ever-expanding franchise, and for good reason: it's visually stunning, with intricate storylines woven across various timelines and bloody, brutal fight sequences. It's one of Netflix’s greatest series.\nNeed more Geralt in your life? Read our list of the best games like The Witcher 3 to play today.\nShadow and Bone\nYear: 2021\nSeasons: 2\nAvailable on: Netflix US/UK\nIf you’ve scrolled through Booktok, then you'll have heard of the Grishaverse, the fantasy universe where Shadow and Bone and the Six of Crows books are set. This adaptation of Leigh Bardugo's fantasy book follows Li, a young orphan who is the long-awaited Sun Summoner and has to step into her destiny and new identity as a Grisha, a person with magical abilities.\nThink The Witcher meets Harry Potter, if that's your vibe, then add this adaptation to your watch list. The second season covers more of this extensive universe, touching on epic storylines from several books in the series, including Siege and Storm and Crooked Kingdom. Ready to escape into an entirely new world? Look no further.\nRead our ranking of the best fantasy movies on Netflix for more epics.\nSweet Tooth\nYear: 2021\nSeasons: 3\nAvailable on: Netflix US/UK\nIn a post-apocalyptic world, Gus, a boy who is half-human and half-deer, sets out on an epic adventure to find his mother after the death of his father, with a gruff protector. Based on the comic book series, it's an eccentric, heart-warming, and whimsical tale that merges together the best of fantasy adventures and science fiction.\nGus is one of many hybrid animal-human babies who were born after a virus wiped out the majority of the world's population. If you needed any further convincing, the first two seasons received over twenty nominations for Children and Family Emmy awards, those accolades speak for themselves.\nFor more award winners, check out our list of the best shows on Apple TV to watch right now.\nOne Piece\nYear: 2023\nSeasons: 1\nAvailable on: Netflix US/UK\nThis beloved manga and one of the best anime series of all time moved into live-action in 2023, and it's safe to say it had big shoes to fill. Yet, the fantasy adaptation created by Matt Owens and Steven Maeda exceeded our expectations. It captured the heart of Eiichiro Oda's magnificent world, as the series followed Monkey D. Luffy (Iñaki Godoy) and his crew of Straw Hat Pirates on the hunt for a fabled treasure.\nIt features an excellent cast with Emily Rudd as Nami, Mackenyu as Roronoa Zoro, and Taz Skylar as Sanji, who should be credited with bringing this well-loved story to life in a delightful new way for existing fans and new ones, too. With One Piece season 2 in the works, it's time to revisit this recent success.\nChilling Adventures of Sabrina\nYear: 2019\nSeasons: 2\nAvailable on: Netflix US/UK\nFar from the cozy, quaint comedy found in Sabrina the Teenage Witch, this Sabrina Spellman, taken from the Archie Comics, has a much darker edge. The series still follows Sabrina, a teen girl who struggles with her witch ancestry and longs to be normal, all while living with her two squabbling Aunts and her cat, Salem.\nThings generally turn from bad to worse for Sabrina as the series dabbles in everything dark, foul, and devilish in the witch world and its colossal repercussions. There's stand-out performances from Kiernan Shipka as Sabrina, as well as appearances from Doctor Who’s Michelle Gomez, Lucy Davis, and Miranda Otto. There's only two seasons, told across four parts, but it's a spellbinding watch for anyone who loves witch lore, magic, and mayhem.\nRead our Chilling Adventures of Sabrina season 2 review for more witchy information.\nBest sci-fi shows on Netflix\nThe Eternaut\nYear: 2025\nSeasons: 1\nAvailable on: Netflix US/UK\nThis six-episode sci-fi thriller has proven to be one of the year's most unexpected and exciting sci-fi surprises. One night snow falls on Buenos Aires, killing everyone it touches. The show follow a group of everyday people, led by Ricardo Darín's Juan Salvo, as they struggle to survive in what is eventually revealed to be the first stages of an alien invasion...\nBased on the famous Argentine comic series of the same name by Héctor Germán Oesterheld and Francisco Solano López, The Eternaut is immediately gripping from its surreal opening scene as a group of girls party on a boat only to see the lights of Buenos Aires go suddenly blink out. But despite its bleak subject matter, the show has a warmth and a pleasing sense of humor that keeps you rooting for the characters.\nBlack Mirror\nYear: 2011\nSeasons: 7\nAvailable on: Netflix US/UK\nYou can always rely on this dystopian anthology show, from British satirist Charlie Brooker, to put a menacing spin on the modern world. Every episode of Black Mirror is a standalone story and the show straddles many different genres, from action and horror to the sweet, gorgeous love story that is season 3's 'San Junipero.' What they all have in common, however, is that they will leave you questioning your relationship with technology.\nBlack Mirror season 7 has recently landed on Netflix, blessing us with six more episodes including stories about AI, sinister subscription services, and a long-awaited sequel to the fan favorite Star Trek parody 'USS Callister.' New seasons of Black Mirror are an irregular occurrence, so cherish this terrifying, thoughtful, and highly inventive series while you can.\nCheck out our handy guide to the best Black Mirror episodes.\nLost\nYear: 2010\nSeasons: 6\nAvailable on: Netflix US\nIt's easy to forget just how exciting, radical, and straight up game-changing Lost was at the start of the 2010s. Ostensibly a survival thriller about a group of people who survive a plane crash and wind up on a mysterious island, it grew over six seasons to incorporate everything from strange science experiments to a mythic battle between the forces of good and evil by way of time travel and polar bears. And that's not even scratching the surface of a show that rewards patience and fan loyalty like few others.\nFolk will tell you that Lost never explains its mysteries (it does) or that the ending is bad (it's not), but this really is a show where it's best to ditch any of your preconceived notions and discover the story for yourself. And no, they weren't dead all along.\nLost showrunner Damon Lindelof's next series was The Leftovers – hands down one of the best HBO Max shows.\nBodies\nYear: 2023\nSeasons: 1\nAvailable on: Netflix US/UK\nVenom's Stephen Graham fronts this British science fiction mystery thriller that sees the same dead body found in four locations in East London across four different time periods. The crime drama sees four police officers inspecting the same body, who become embroiled in a conspiracy far bigger than any of them could imagine.\nIt's a gripping twist on your standard murder mystery that will keep you guessing until the very end. Alongside Graham, the cast features Shira Haas, Jacob Fortune-Lloyd, Kyle Soller, and Amaka Okafor. With only eight episodes to get through, what are you waiting for?\nThe Umbrella Academy\nYear: 2019\nSeasons: 4\nAvailable on: Netflix US/UK\nOne of Netflix's best superhero series is The Umbrella Academy, which started with a strong first season and the second season even became the most-watched series on the platform in 2020. The series centers around a group of superhero siblings who are all miraculously born at the same time on the same day by women who were not actually pregnant.\nIt's stuffed with twists and each season seems to become even more energetic and ambitious than the last. If you're looking for a fresh spin on a comic book adaptation that features a standout cast, then The Umbrella Academy is for you.\nRead our The Umbrella Academy season 4 review for more information on the latest season.\nBest horror shows on Netflix\nMidnight Mass\nYear: 2021\nSeasons: 1\nAvailable on: Netflix US/UK\nAs we alluded to above, Mike Flanagan is the master of horror on Netflix. While The Haunting of Hill House is arguably his scariest series, Midnight Mass is both his most personal and his overall best. It's also a series that benefits from knowing as little as possible about before watching. All you need to know is that it follows Riley Flynn (Zach Gilford) as he returns to his home town, Crockett Island, having served time in jail for a drunk-driving incident where he killed a young woman. Also in town is Father Paul Hill (Hamish Linklater, in a role that brought him major acclaim), a priest who harbors dark secrets.\nThat's all we're gonna say, but trust us on this one. Midnight Mass takes tired genre tropes and breathes new life into them, ironically, by delivering a thoughtful, moving, and utterly chilling meditation on mortality and redemption.\nBack in 2021 we crowned Midnight Mass our TV show of the year. Find out why in our full Midnight Mass review – but watch out for spoilers.\nSquid Game\nYear: 2021\nSeasons: 3\nAvailable on: Netflix US/UK\nThe third and final season of this world-conquering thriller is streaming now, which means there's never been a better time to watch or rewatch the gruesome tale of Player 456. The first season fully lives up to hype as Lee Jung-jae's cash-strapped Gi-hun finds himself embroiled in a series of contests to win a huge cash prize. There's only one problem: these games are deadly. It's an old concept, but Squid Game's empathetic characters, terrifying set pieces, and a couple of smart twists make this a show for the ages.\nSeason 2 launched late last year and was less surefooted in its early episodes. By the time it had reached its almighty cliffhanger ending, however, the buzz was well and truly back. Season 3 has had its critics, but for our money it brings the show to a fitting conclusion – just in time for a much-anticipated US remake.\nFind out why we thought the new season was \"staggeringly excellent\" in our Squid Game season 3 review.\nThe Haunting of Hill House\nYear: 2018\nSeasons: 1\nAvailable on: Netflix US/UK\nChances are, if Mike Flanagan has written a horror series, it will be on our watch list. This adaptation of Shirley Jackson's terrifying novel lives up to its name. The Haunting of Hill House follows the Crain family, who move into the grand and remote 'Hill House' to flip it before moving on to their 'dream home.' But the house has other plans. Switching between the past and the present, the story picks up decades later as the now scattered family is reunited by the events of their childhood in that house.\nHill House is not for the faint-hearted. Both equal parts terrifying and mesmerizing. Its follow-up, The Haunting of Bly Manor, strikes a different tone but sees the return of the same actors in new roles, many of which are frequent collaborators with Flanagan, especially in his Netflix series. Final warning, though: you will be scared of turning the lights off at night after finishing this one.\nMore nightmares await in our list of the best Netflix horror movies.\nStranger Things\nYear: 2016\nSeasons: 4\nAvailable on: Netflix US/UK\nNow, there is nothing quite like Stranger Things. The Duffer Brothers' nostalgic coming-of-age series is rooted in the 1980s and references a host of iconic tropes in horror, science-fiction, and mystery. Set in a small town in Indiana, the first season begins with the disappearance of a young boy, Will Byers. As his mother, Joyce, the sheriff, and his friends start to investigate what happens, it seems that there’s something much more sinister than any of them expected.\nA parallel world, packed with demonic monsters, sits right next to their own, and they have to venture into the Upside Down to set things straight again and save Will. With a phenomenal ensemble cast, it's one of the most outstanding series of the past decade. Make sure you catch up before Stranger Things season 5 is released.\nWednesday\nYear: 2022\nSeasons: 1\nAvailable on: Netflix US/UK\nTim Burton's coming-of-age horror-comedy is the most streamed series on Netflix for good reason. The Addams Family spin-off follows Jenna Ortega as a Wednesday Addams as she's enrolled in a centuries-old boarding school called Nevermore Academy. Unlike most teens her age, the gothic icon must learn to control her emerging psychic powers, stop a monster from destroying the town, and solve a murder that stems from generations of supernatural trauma from her family's history.\nAll the while, she reluctantly tries to find her place in the world outside of her mother's family. It swooped up awards of every kind and has been renewed - meaning that Wednesday season 2 will be released in 2025. This is a must-watch, and we aren't just saying that because we're excited by the recent casting news of Lady Gaga joining the next season either.\nFor more streaming picks, check out our lists of the best shows on HBO Max, the best shows on Disney Plus, and finally, the best Amazon Prime series.\nJess is a freelance culture and entertainment journalist based in Cambridgeshire who has bylines in Rolling Stone, GQ, Dazed, Cosmopolitan, Stylist, Radio Times, The Guardian and the i. With a degree in English Literature and a Masters in Creative Writing, Jess is passionate about story-telling in all its forms and especially the representation of women and mental health on-screen. In between overanalyzing her favorite TV shows, films and internet trends, she’s working on her debut non-fiction book.\n- Trudie GrahamContributor\n- Fay WatsonDeputy Entertainment Editor\n- Mireia MullorContributing Writer\n- Emma-Jane BettsManaging Editor, Evergreens\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/best-movies-on-disney-plus/",
      "text": "The 30 best movies on Disney Plus to watch right now\nFrom Avatar to Star Wars and the MCU, these are the best movies on Disney Plus to watch in August 2025\nPicking the best movies on Disney Plus is no easy task. The House of Mouse is home to some of the most influential and iconic outings in all of cinema, be that powerhouses like the Marvel Cinematic Universe and Star Wars, or some of the best animated movies ever made. Not only that, it's now also the home of Pixar, and the streaming service also has some award-winning indie flicks.\nIn short, finding your next pick for movie night can be tricky, especially when it comes to one of the best streaming services around. Well, that's where we come in. We've put together this list of the 30 best Disney movies currently streaming on the platform for your convenience. The list includes everything from classic cartoons to explosive action films and at least one certified tearjerker. We've also made sure that our picks are strictly Disney Plus affairs since US readers have to purchase bundles to get access to Hulu movies and more. Our choices below come at no extra cost to the base subscription, so you'll have to head to our list of the best Hulu movies to check out further additions.\nAnd, if you need some further guidance, we also have a list of the best shows on Disney Plus, as well as guides on how to watch all the Marvel movies in order and all the Star Wars movies in order too. But for now, let's grab the popcorn and dig into the 30 best Disney Plus movies to watch this August!\n- Does the Disney Plus free trial still exist?\n- Grab the best Disney Plus sign-up deals\nThe best movies on Disney Plus to watch in August 2025\nGuardians of the Galaxy Vol. 3\nYear: 2023\nDirector: James Gunn\nGuardians of the Galaxy Vol. 3 draws James Gunn's beloved MCU trilogy to a close in a poignant send-off. Kicking off after the events of Avengers: Endgame, Peter Quill (Chris Pratt) is still reeling from the loss of Gamora. But the galaxy isn't saving itself as Adam (Will Poulter) appears to cause trouble for this bunch of A-holes as one of their own lands themselves in serious danger.\nIn order to save Rocket (Bradley Cooper), they have to find a genetic passcode, sending the gang on a trip across the galaxy. There's an air of finality throughout this movie, which also marks Gunn's farewell from Marvel for DC adventures anew, but it's still imbued with so much comedy and levity. However, it's the emotion that works best, as GOTG 3 provides some of the most gut-wrenching moments in the MCU so far.\nBefore you dive into hyperspace, read our Guardians of the Galaxy Vol. 3 review for more information on one of the best Marvel movies ever made.\nBringing all the latest movie news, features, and reviews to your inbox\nAvatar\nYear: 2009\nDirector: James Cameron\nWith the Earth facing collapse due to a lack of resources, mankind has turned to pillage the planet of Pandora for the valuable mineral, unobtanium. To better understand Pandora and its big, blue, alien inhabitants, the Na'vi, the Resources Development Administration creates Na’vi-human hybrids. But, when former Marine, Jake Sully, integrates with the Pandoran natives, he falls in love and vows to protect his new tribe from human invaders.\nAvatar was, quite literally, a game-changer for the medium of cinema. The stunning and highly-immersive visuals will have you believing Pandora is real, and that's all down to the impressive blend of incredible computer-generated graphics and specially-modified cameras James Cameron used. None of that works, though, without a meaningful story, and Cameron's sci-fi tale is as poignant as it is exciting.\nOnce you finish Avatar, you get ready to dive into its sequel with our Avatar: The Way of Water review or check out our guide on Avatar: Fire and Ash.\nX-Men\nYear: 2000\nDirector: Bryan Singer\nLong before the inception of the Marvel Cinematic Universe, our favorite mutants had their own sacred timeline. The first entry in the X-Men series sees Professor Charles Xavier's titular heroes clash with Magneto's Brotherhood of Mutants as Senator Kelly ushers in the era of the Mutant Registration Act, laying the foundations for an epic conflict.\nLet's be honest: the X-Men are the coolest and make up some of the greatest Marvel characters around, and to see them come to life on the big screen at the turn of the millennium was, frankly, life-changing for comic book fans. This movie nailed the tone needed to make the X-Men work in live-action, featured a quintessential mutant storyline, and introduced the world to Hugh Jackman's iconic Wolverine. The one downside is we don't get the classic yellow suits, but we can live with that.\nIf you want to start watching all the X-Men movies in order, you can read our X-Men review and find out more about the first chapter.\nThe Lion King\nYear: 1994\nDirectors: Roger Allers and Rob Minkoff\nThe Lion King is often heralded as the jewel in Disney’s crown and it’s easy to see why. Everything about it just feels so big: the scale of the stampede sequence, the sombre tone of James Earl Jones’ voice, the “Circle of Life”, and the grand themes of legacy and sacrifice. Thank god for Timon and Pumbaa, who step in right at the moment things start to get unbearably depressing.\nIt’s an epic story painted on such an exquisite canvas, from the vast plains to the bubbling green lava of Scar’s lair. It also spawned an entire generation of people who like to lift up their pets into the sky like they’re Rafiki showing off baby Simba. Who knew lions could get so Shakespearean?\nThe Toy Story trilogy\nYear: 1995 - 2010\nDirectors: John Lasseter and Lee Unkrich\nPixar immediately branded itself as the studio obsessed with ambitious concepts. Their first-ever movie, Toy Story (aka one of the best Pixar movies ever made), puts forward the idea back that all your toys are alive and run around your room when you’re not looking. Instead of giving kids nightmares, it was somehow endearing. So the studio kept pushing and pushing until we got to Toy Story 3, which has Woody and Buzz Lightyear come to terms with their own mortality after they are thrown into a garbage incinerator. There are some twisted geniuses at work here.\nToy Story really did, right out of the gate, establish the trademarks that have made Pixar a powerhouse animation studio. Its unusual premise has philosophical and moral underpinnings that adults can pore over and analyze to death. Meanwhile, the kids in the audience are kept entertained by bright colors, lively characters, and funny jokes.\nAs we mentioned in our Toy Story 4 review, the new film acts as a nice epilogue to the trilogy but doesn't quite compare to the first three movies.\nSister Act\nYear: 1992\nDirector: Emile Ardolino\nLounge singer Deloris Van Cartier is present for a mob hit and ends up in the witness protection program. The last place her enemies would think to look? Saint Katherine’s Parish, a San Francisco convent, where she volunteers as its choir director. At first, Deloris clashes with the Reverend Mother, who disapproves of her throwing out traditional hymns in favour of gospel and rock stylings. Of course, by the time things wrap up, the two have developed a mutual respect.\nThis is peak Whoopi Goldberg – a performance where she can be cutting without being callous. And, wow, can she sing. The film’s so feel-good and people-pleasing that it’s hard to be cynical about it, especially when the nuns start to cover '60s classics like ”I Will Follow Him” and “My Guy” (switched to “My God”). It’s a reminder that sometimes it’s the most simple concepts that work, like pitching a lapsed Catholic pitched against the strictest of religious institutions.\nHocus Pocus\nYear: 1993\nDirector: Kenny Ortega\nIt’s sometimes a little too easy to forget that the Sanderson sisters are meant to be child-murdering villains in Hocus Pocus. After being accidentally resurrected in modern-day Salem by young Max, the trio start to cause havoc in the local town. If they’re not stopped, they’ll suck the soul out of every child for miles in order to maintain their vitality and youth.\nWhile it wasn’t much of a hit at the time (especially with critics), Hocus Pocus has slowly grown in reputation and become a seasonal tradition. It was part of a refreshing wave of Halloween-themed movies that weren’t actually horrors, alongside The Addams Family and Casper the Friendly Ghost. It’s a perfect film for people who want to celebrate the holiday but are also complete scaredy cats.\nThe original Star Wars trilogy\nYear: 1977 - 1983\nDirectors: George Lucas, Irvin Kershner, and Richard Marquand\nA princess, a scoundrel, and a farm boy: it’s this simple trio of characters that sparked one of the biggest cultural phenomena of all time. Each of them found their own way to save the day. Sometimes that involves taking up Jedi training and discovering your dad is the last person you’d want them to be, at other times it means choking a giant slug kingpin with your bare hands. Occasionally it means getting frozen into a man-sized ice cube so you can finally pay your debts.\nThese movies have crafted a fictional universe so rich and deep, there’s the constant threat that once you fall in you might never come out. Next thing you know, you’re three hours deep into researching the true origins of chindinkalu flute player Droopy McCool. Star Wars is the kind of world you yearn to live in, because it’s a place where the most insignificant person can become the greatest hero and where there’s always hope that good can triumph over evil, no matter how bleak it might seem.\nWant new titles? Read our list of all the upcoming Star Wars movies and shows heading our way.\nThe Pirates of the Caribbean trilogy\nYear: 2003 - 2007\nDirector: Gore Verbinski\nThe franchise is concerned chiefly with the adventures of scallywag pirate Jack Sparrow, as he crosses paths with his mutinous former first mate Barbossa, the fiercely independent Elizabeth Swann, and her bland, but altogether quite sweet, love interest Will Turner. Add to that, there are curses, krakens, maelstroms, British imperialism, and a tentacle-faced Davy Jones to keep things lively.\nPeople tend to disagree a little with how good Dead Man’s Chest and At World’s End are in comparison to the first film (come on, though, how can you resist a giant Naomie Harris exploding into a thousand little crabs… it’s so weird it’s good). But there’s something to be said for the ingenuity of this franchise, which cranked out old-fashioned romanticism and colourful characters from what was a 15-minute Disneyland ride. Let’s just never speak of the fourth and fifth films ever again…\nThe Chronicles of Narnia: The Lion, the Witch and the Wardrobe\nYear: 2005\nDirector: Andrew Adamson\nA retelling of the classic children's book and one of the best fantasy movies ever made, The Chronicles of Narnia follows the Pevensie children as they stumble upon a magical world. With this hidden land ruled by the evil White Witch, it's up to Peter, Susan, Edmund, and Lucy to put an end to her tyranny and free the animals of Narnia from the endless winter.\nIt is incredible that, almost two decades later, the visual effects in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe hold up as well as they do (in fact, they're actually better than a lot of movies made today). Some adaptations try something different, but there's a lot to be said for films that stay loyal to the source material, and this family flick delivers all the heart and epic scale of the original C. S. Lewis story.\nLogan\nYear: 2017\nDirector: James Mangold\nIn a world where mutants are all but extinct, Logan (AKA Wolverine) gives everything he has to care for an ailing Professor Charles Xavier. Those efforts are strained when Laura — a young mutant who possesses the same abilities as Logan — turns up on his door, needing protection from the evil forces that created her.\nIf you're tired of the current crop of superhero movies, with their formulaic stories and light, fluffy tone, Logan is the breath of fresh air you need. It's packed with epic, uber-violent fight scenes for a start, but none of it is gratuitous. The movie is based on the best Wolverine comic book, Old Man Logan, with a powerful, painful story laying the foundations for one hell of a performance from Hugh Jackman.\nFor more information on one of the best superhero movies ever made, check out our Logan review.\nFantasia\nYear: 1940\nDirectors: Samuel Armstrong, James Algar, Bill Roberts, Paul Satterfield, Ben Sharpsteen, David D. Hand, Hamilton Luske, Jim Handley, Ford Beebe, T. Hee, Norman Ferguson, and Wilfred Jackson\nEssentially a series of shorts set to classical music, the film takes us through all manner of imaginative scenarios: from the colourful world of centaurs and fauns, the extinction of the dinosaurs, to the monstrous reign of the demon Chernabog. The most famous sequence is set to Paul Dukas’ The Sorcerer’s Apprentice and sees an eager Mickey accidentally summon an unstoppable army of mops.\nFantasia’s arguably the most unique and artistically ambitious entry in Disney’s collection of its best animated movies. There’s nothing else like it. It’s not fixated on talking down to children or trying to coddle them, but whisks them through the classical greats with a sense of wit and sophistication. It can be weird, sweet, psychedelic and frightening – slipping between moods and emotions with ease. Even if it’s meant to be educational, it doesn’t feel like any ordinary music lesson.\nThe Incredibles\nYear: 2004\nDirector: Brad Bird\nPixar's spin on the Avengers before the Avengers ever reached cinema screens, The Incredibles keeps it a strictly family affair. In the movie, public opinion has turned against superheroes. They’ve been accused of leaving behind too much collateral damage. And so, the Parrs have done their best to keep quiet and hide their powers, having settled down in an idyllic American suburb. But Bob, otherwise known as Mr. Incredible, is struggling to let go of the “glory days”. His actions end up dragging the entire family into a deadly confrontation with an embittered former fan.\nThe Incredibles is a flawless blend of comic book movie stylings and earnest family comedy. For all the whizz-bang action, which easily rivals most live-action attempts at the genre, the film’s also rich with themes - it touches on bureaucracy, the family unit, and what it means to be exceptional. Less deep, but equally exciting is Edna Mode’s catchphrase, “No capes!”\nAll of Us Strangers\nYear: 2023\nDirector: Andrew Haigh\nMore inspired by than strictly adapted from Taichi Yamada's elegantly eerie novel Strangers, Andrew Haigh's film is a heartbreaking masterpiece. Andrew Scott plays Adam, a lonely screenwriter living in a gloomy London tower block. One night he connects with Harry (Paul Mescal) and the two embark on a relationship. Adam goes back to his childhood home to see his parents several times, leading to some necessary conversations. The only trouble is, his parents died many years ago...\nBeautifully acted and dreamily directed, All of Us Strangers is a delicate, enigmatic film that's not at all interested in revealing precisely how or why Adam is able to reconnect with his lost family like this. Instead, it's a melancholy but ultimately hopeful meditation on time, memory, love, and loss.\nThe Emperor's New Groove\nYear: 2000\nDirector: Mark Dindal\nIt takes a lot for some people to learn their lesson. Say, being transformed into a llama. That’s the fate that befalls the selfish, egotistical Kuzco, who makes an enemy of his royal adviser Yzma. She plans to poison him and take the throne for herself. Unfortunately, she has a rather unfortunate taste in henchman and the hapless Kronk accidentally swaps the vial of poison with a vial of transforming potion. Only after Kuzco faces the consequences of his actions will he finally be able to turn back.\nThe early 2000s are too easily dismissed as an era of creative bankruptcy for Disney. The Emperor’s New Groove (and one other film on this list) prove otherwise. The film is fun, zippy, and genuinely funny in a way that feels worlds apart from the epics of the Disney Renaissance – and that’s refreshing in its own way. And how could you possibly shun a movie where Eartha Kitt pays a villain who looks likes a decrepit, centuries-old peacock come to life?\nReady to crave some cinematic spinach puffs? Read our The Emperor's New Groove review now!\nFrozen\nYear: 2013\nDirectors: Chris Buck and Jennifer Lee\nFrozen tells the story of two sisters, Anna and Elsa, who become estranged from each other after their parents’ death and from all the years Elsa has been kept isolated – all because she possesses ice powers she struggles to control. With the help of a kind-hearted ice harvester named Kristoff and his reindeer Sven, alongside a magical snowman named Olaf, the two sisters save the kingdom of Arendelle and discover the key to their special bond.\nFrozen offers the best example of the modern Disney princess, Elsa and Anna’s stories don’t prioritise getting rescued or finding some Prince Charming. It’s their relationship that remains at the heart of everything, offering a touching tribute to the power of sisterly love. Plus, the way Idina Menzel belts out “Let it Go” has given us an anthem for the ages.\nWarm up by reading our in-depth Frozen review!\nInside Out\nYear: 2015\nDirector: Pete Docter\nWhat if your emotions had a emotions? That’s the question at the centre of Inside Out, the most thematically ambitious of all Pixar’s movies. We jump inside the head of Riley, an 11-year-old girl, and meet its colourful inhabitants: Joy, Sadness, Fear, Disgust, and Anger. They’re struggling to guide Riley through the major changes that come from moving halfway across the country, after her parents relocate her from Minnesota to San Francisco.\nWhat’s so profound about Inside Out is how director Pete Docter and his team found a way to directly and elegantly talk to children about depression and the necessary role that sadness has to play in our lives. It’s not just an entertaining film, but an effective therapeutic tool (that extends beyond just children, considering it has a reputation for causing grown adults to start blubbering away).\nYou can read our five star Inside Out review for more details, but make sure you have a pack of tissues nearby for all those sentimental tears.\nFantastic Mr. Fox\nYear: 2009\nDirector: Wes Anderson\nRoald Dahl's iconic story is brought to life in stunning stop-motion with all the extra quirks and comedic flair you'd expect from acclaimed director, Wes Anderson. In this adaptation, Mr. Fox comes to blows with three local farmers, as he carries out clandestine missions to steal produce from the farms of Boggis, Bunce, and Bean.\nNot only does Fantastic Mr. Fox look astounding — with intricate details and playful production design — but it's also superbly smart and very, very funny. Kids will love it for the more slapstick, silly moments, but adult viewers will arguably take just as much (if not more) away from the film's more sincere and sharp social commentary. Bringing it all to life is an extraordinary voice cast at the top of their game, including George Clooney, Meryl Streep, Jason Schwartzman, and Willem Dafoe.\nMind the farmers. Read our Fantastic Mr. Fox review next.\nThe Nightmare Before Christmas\nYear: 1993\nDirector: Henry Selick\nAfter being plunged into the stop-motion imaginarium of Tim Burton (although the film, in truth, was actually directed by Henry Selick), we follow Jack Skellington, otherwise known as the Pumpkin King and the most heralded resident of Halloween Town. One day, he stumbles into the portal to “Christmas Town” and becomes fixated on the holiday, recruiting his ghoulish friends to help him become the new “Sandy Claws“ and deliver toys to the world.\nThe Nightmare Before Christmas serves double duty as a holiday classic, since it works for both Halloween and Christmas – meaning it can be enjoyed at any point between September and January. It’s also one of the finest examples of Burton’s trademark blend of Gothic styling and fairy tale sensibility, where the strange and unusual are not only celebrated but represent the new norm.\nLilo & Stitch\nYear: 2002\nDirectors: Chris Sanders and Dean DeBlois\nLilo, who’s under the guardianship of her adult sister after the death of their parents, is in for the surprise of a lifetime when her newly adopted dog, who she names Stitch, actually turns out to be the highly dangerous Experiment 626. He’s an alien genetically bred to be a tool of pure destruction. And while Stitch might not fit in at first, he soon discovers the real meaning of “ohana”, or family.\nOut of all of Disney’s animated movies, very few have a message as grounded in reality as Lilo & Stitch. It teaches kids that families come in all shapes and sizes, are functional and dysfunctional, or are bound by blood or by friendship – that doesn't mean they’re any less legitimate. Not only is Stitch as adorable as can be, but he also issues the film’s most heart-breaking piece of dialogue: “This is my family. I found it, all on my own. It's little, and broken, but still good. Yeah, still good.”\nFor more information before adding this film to your Disney Plus watch list, read our Lilo & Stitch review.\nThe Muppet Christmas Carol\nYear: 1992\nDirector: Brian Henson\nThe story here is pretty much the same as Charles Dickens’ 1843 novella, you just need to swap out most of the humans for felt puppets. On Christmas Eve, the miserly Ebenezer Scrooge is given a brutal lesson in human compassion, as he’s visited upon by three ghosts; the Ghost of Christmas Past (creepy), the Ghost of Christmas Present (jolly), and the Ghost of Christmas Yet to Come (not here to mess around), We all know how it ends.\nAlthough Muppet Treasure Island will always have its fans, The Muppet Christmas Carol is considered by many to be not only as the best Muppets movie, but one of the greatest holiday movies ever made. It captures the touching, inward-looking sentiment of the original book, while still throwing in plenty of irreverent humour to keep things feeling festive.\nYou can learn more about one of the best Christmas movies ever made by reading our The Muppet Christmas Carol review.\nMonsters, Inc.\nYear: 2001\nDirector: Pete Docter\nThe city of Monstropolis has found its own source of renewable energy: the screams of children. Sulley and his best friend Mike work at the local factory as scarers, using portals to sneak into children’s bedrooms and harvest their terror so they can help power the city. One day, a little girl manages to escape and is let loose on Monstropolis, as Sulley and Mike take it upon themselves to get her home safe.\nThe brilliance of pitting John Goodman and Billy Crystal against each other makes Monsters, Inc an ingenious throwback to all of the most classic of double acts. But the film isn’t just silliness for silliness’ sake, and, in true Pixar tradition, it’s got a heart of gold at its centre in the form of Boo, the lost girl. She forms a close bond with Sulley, who she calls “Kitty”. It’s a reminder to us all that the fear of the other is an entirely irrational thing.\nLove a good scream? Well, check out our fantastic Monsters Inc review.\nWho Framed Roger Rabbit\nYear: 1988\nDirector: Robert Zemeckis\nThe story takes place in an alternate version of 40s Hollywood were cartoon characters are real, breathing entities, but remain an oppressed minority – exploited for their work and forced to live in the segregated borough of Toontown. One of the biggest toon stars, Roger Rabbit, is falsely accused of the murder of studio head R.K. Maroon. He turns to Detective Eddie Valiant, a jaded alcoholic, in an attempt to clear his name and uncover the sinister secret lurking in the shadows.\nRoger Rabbit doesn’t use its mix of live-action and animation as some kind of flashy gimmick, but as a tool to create a rich, believable world that brilliantly parodies the noir genre. It dances on the edge of risqué without alienating its family audience, thanks to its femme fatale Jessica Rabbit (who’s not bad, just drawn that way) and the gruesome effects of Dip. It was also the first time that Bugs Bunny and Mickey Mouse crossed party lines and appeared onscreen together.\nSleeping Beauty\nYear: 1959\nDirectors: Clyde Geronimi, Wolfgang Reitherman, Eric Larson, and Les Clark\nBased on the Charles Perrault fairytale, while also incorporating music from Tchaikovsky's ballet of the same name, Sleeping Beauty sees a beautiful young princess named Aurora targeted by a curse from the evil fairy Maleficent. Before the sun sets on her 16th birthday, Aurora will prick her finger on a spinning wheel and be consumed by an endless sleep. The only way the curse can be lifted is through the power of true love's kiss.\nSleeping Beauty is the most beautiful Disney film ever made, with an animation style modelled after medieval tapestries and illuminated manuscripts. And thanks to the classical touch in the film’s score, the final film feels so elegant and refined – it's a swoon-worthy dream just like the one Aurora sings of, where she's united with her handsome prince. Add to that, Maleficent’s cackle and haughty air (she only unleashes the curse because she's offended she wasn't invited to the christening) makes her an all-time great among the Disney villains.\nThe Star Wars sequel trilogy\nYear: 2015 - 2019\nDirectors: J. J. Abrams and Rian Johnson\nThe Force Awakens had a lot riding on it. It needed to kick off the revived franchise and soothe everyone’s memories of the prequels. It introduced us to a new trio of heroes: Rey, a scavenger whose mysterious origins are still hotly debated today, Finn, the stormtrooper-turned-rebel hero, and Poe, the hotshot pilot. Their journeys all intersect as the Resistance stands firm against the rising threat of the First Order. The Last Jedi continues the battle against the new enemy, and The Rise of Skywalker brings the entire Skywalker saga to an end.\nAs much as director J.J. Abrams may have played it safe by replicating the familiar beats of the original trilogy (yes, there’s another Death Star) with The Force Awakens, he also revived many of the elements that were crucial to those movies attaining their classic status. Episode 7 has that same childish sense of excitement that sweeps you up and takes you on a journey across the stars, meeting all kinds of fascinating and bizarre individuals, revisiting old friends, and settling back into the eternal fight of good vs evil. The Last Jedi and The Rise of Skywalker follow and are both divisive for their own reasons. But stick through the trilogy and be rewarded with a grand finale to this astonishing series.\nBeauty and the Beast\nYear: 1991\nDirectors: Gary Trousdale and Kirk Wise\nBased on an old French fairytale, the “beauty” of the film’s title refers to Belle, whose love of reading has made her an outsider in her own village – probably because they think a vain, arrogant slab of meat like Gaston is the best there is. But when she becomes the prisoner of a monstrous lion/buffalo hybrid, she discovers that she’s developed a very unusual case of Stockholm Syndrome.\nBeauty and the Beast is a wonderful example of what Disney does best: it uses modern technology (including computer animation, which was still in its relative infancy) and modern thinking (Belle is a smart, independent princess), but the result is still as sweepingly romantic as the oldest of folktales. That’s thanks partially to the songs, created by Alan Menken and Howard Ashman.\nMary Poppins\nYear: 1964\nDirector: Robert Stevenson\nAlthough this adaptation of the P.L. Travers book series had its troubles (see Saving Mr Banks), the film was still much more warmly regarded than its source material. The Mary Poppins in question is a magical nanny who flies in to help troubled families, including the Bankses, who live on Cherry Tree Lane. The patriarch of the clan, you see, has become far too obsessed with his job at the bank and has lost sight of how much his children need him.\nIt’s a fairly simple celebration of the joys of imagination and playtime, but the whole affair is wrapped up in an irresistible, whimsical bow. We get to jump into chalk paintings, float up to the ceiling, or tidy rooms with a single snap of a finger. Mary Poppins captured how limitless and full of potential the world felt as a child – which makes it as soothing for adults as it is for the little ones. And what a practically perfect presence Julie Andrews is, making Mary as stern and correct as she is secretly mischievous. Everyone needs a Mary Poppins in their life.\nThe Little Mermaid\nYear: 1989\nDirectors: John Musker and Ron Clements\nHans Christian Andersen’s original version of this story was a little more upsetting than what we’re used to. Instead of Ariel getting both her man and her voice back after defeating the evil sea witch Ursula, she, A. has to deal with her new human feet bleeding constantly and being agony to walk on, and, B. ends up sacrificing herself to save the prince and dissolves into a pile foam. It’s hard to imagine Disney trying to market “Ariel as foam” or “Ariel with realistic bleeding feet” dolls.\nThe Little Mermaid kicked off the Disney Renaissance and arguably still boasts the studio’s best princess. Unlike pretty much all of her predecessors, Ariel isn’t some genteel, perfect doll waiting to be rescued. She drives the film’s plot, and, importantly, she’s deeply flawed. Rebellious and excitable, her story is defined by her curiosity and her committed belief to the idea that the grass is always greener on the other side – or, in this case, that the grass exists in the first place.\nThe Avengers movies\nYear: 2012 - 2019\nDirectors: Joss Whedon, Anthony Russo, and Joe Russo\nIt’s hard to pack the entire decade-long history of the MCU into one paragraph. Weaving together characters and plotlines from every single entry of the series, the Avengers movies act as the big cornerstones for Disney and Marvel's huge series. the conclusion is, of course, Endgame. After the warmongering Thanos collects all the Infinity Stones and causes the Snap, instantly wiping out half of all living things, the surviving heroes are left to pull up their bootstraps and save the day.\nEndgame is unlike any other film that’s existed before it. It’s the final chapter of a story that’s been gradually told over 20 different movies – including a few on this list, although we've kept only the best here. That’s the kind of ambition that would be doomed to fail if Marvel didn’t get the balance right: it needed to be epic on an unimaginable scale, while still servicing the characters that fans had grown so attached to over the years. We recommend – if you haven't already – diving into the Marvel movies now!\nThe Sound of Music\nYear: 1965\nDirector: Robert Wise\nThis classic musical is actually based (although it’s no winner when it comes to historical accuracy) on the real-life Maria Von Trapp. She was a nun who married the Austrian naval commander Georg von Trapp and became the stepmother to his seven children. They performed concerts together under the growing shadow of Nazi rule, before packing their bags and moving to the United States. In reality, they just took a train to Italy, although the film creates a much more dramatic escape.\nIt’s the unwavering sense of optimism that makes this musical sing, as best exemplified by “My Favourite Things”. When the dog bites, when the bee stings, or when evil is encroaching from all sides, sometimes it’s the smallest and most fragile of joys that can get us through the darkest of times.\nTo get the best deal on the streaming service, check-in with these Disney+, Hulu Bundles.\nClarisse is a freelance film journalist, and is a film critic for The Independent. She also writes in a freelance capacity for a number of publications such as GamesRadar and Total Film, and is the co-host for the Fade to Black Podcast. She also runs her own YouTube channel focused on film reviews.\n- Mireia MullorContributing Writer\n- Fay WatsonDeputy Entertainment Editor\n- Emma-Jane BettsManaging Editor, Evergreens\n- Jack ShepherdFreelance Journalist\n- Will SalmonStreaming Editor\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/alien-isolation-review/",
      "text": "GamesRadar+ Verdict\nDeep, intelligent, intense, and utterly unlike any experience before it, Alien: Isolation presents all that's truly great about AAA, and also its evolution.\nPros\n- +\nThe Alien is truly terrifying\n- +\nAmazing recreation of the Alien universe\n- +\nSmart AI keeps the game unpredictable\n- +\nLooks astonishing\n- +\nIt's a long game\n- +\nbut intense throughout\nCons\n- -\nLack of guidance will deter some\nVideo games are liars, and you are a fraud. I’m sorry if that sounds harsh, but it’s best that you know this right now. I once thought as you do now. I thought I had achieved things. I thought I had overcome adversity and performed heroic, death-defying feats. But I know now that those adventures were a sham, a theme park version of danger and peril, my heroism puppeteered on invisible strings and my path to victory pre-paved. Because now I’ve experienced Alien: Isolation.\nThe Alien doesn’t give a fuck about how many of video games’ stupid lies you’ve believed. It couldn’t care less about your naïve, assumed privileges as Designated Protagonist. And if it had anything resembling relatable human emotions, it would laugh in the face of what you think you know about stealth and survival. I’ll let you into a little secret about Alien: Isolation. It isn’t a survival game at all. It’s a survival simulator. That’s very, very different to anything you’ve encountered before. Forget what you think you know. It won’t help here.\nIf Alien: Isolation can be summed up with any one word, then it’s ‘real’. Not ‘realistic’. Not ‘visually believable’. Not even ‘immersive’, that peak achievement of the best AAA games thus far. But flat-out, bona fide real, right through to its core, throughout everything it does.\nDiscovered in the death throes of a physical, social and economic collapse, Sevastapol station (resting place of the ill-fated Nostromo’s black box recorder) is a truly living ecosystem. And within it, you--even as Amanda Ripley, daughter of Ellen--are not special, protagonist’s rights be damned. Very quickly, that notion will be driven into you as hard as a sledgehammer shot. Every one of Sevastapol’s humanoid denizens--from aggressively defensive looter to low-fi, bargain-bin android--is driven solely by the same dynamic, emergent AI instincts that have given the titular beast itself such warranted attention. Every encounter brings immense depth and spiralling, potentially deadly possibilities. Your enemies’ behaviour is always logical but endlessly unpredictable, driven by emergent interplay between character, environment and circumstance.\nMany licensed games use art and sound assets from the original source, but most, at best, do a good impersonation. Alien: Isolation feels like Alien. Clean lines and dirty surfaces. Brutal, utilitarian spaces and gently dancing light. The interplay between abrasive, ambiguous noise, weighted, underplayed dialogue, and thick, nervous silence. That atmosphere. Plenty of games, officially or not, try to steal the look of Alien, but only Isolation has ever captured its soul.\nAnd you are not ready. Alien: Isolation’s stealth survival bears very little resemblance to what the genre has previously taught you. There are no set patrol patterns here, no easily identifiable, black-and-white states of alertness to be read and manipulated all the way to victory. This is a survival simulation. These are real, thinking, reacting threats, with their own agendas driven by anger, fear, stress, and steadfast self-preservation. They won’t give you any convenient windows of safety or any second chances. They’ll make you improvise every opportunity, however slim.\nIf this sounds potentially frustrating, don’t worry. Isolation deftly avoids that issue at every turn. While Isolation’s objectives are mostly linear, its environments’ intricate, branching paths provide a vast array of fresh, rewarding, creative approaches to navigation and evasion. Enemies will make full use of that as well, demanding complete awareness of every evolving situation. But combined, all of his turns Isolation’s stealth into a deeply satisfying, free-form sandbox, utterly devoid of the prescriptive play that often plagues the genre.\nManual save-points initially appear a harsh addition, but rapidly become a strategically exciting double-edged sword. Like Dark Souls’ bonfires, they present both the upset of the painfully-far-away (though in truth they never are) and joyful, victorious achievement upon reaching them. There’s also an electrifying risk/reward game. Do you plough on after a midpoint objective, or make a risky but potentially beneficial backtrack to safety? At first seeming a blunt, additional hardship, they actually amplify the tactical excitement of evasion and build a greater relationship with your environment. And that really matters, because you’re going to need every advantage you can muster.\nGet caught in the open by a looter, and if you don’t back off quickly then there’s every chance you’ll be immediately face-down with a single bullet in your skull. And that’s if they even give you a warning. It’ll depend entirely on their mood. And that will depend on their previous emotional states, which in turn will depend on whatever dynamic events they were dealing with before you stumbled in. It’s chaos theory in practice, the shape of each encounter formed well before it begins, and playing out through nothing more than gloriously freeform, exhilaratingly unpredictable, skin-of-the-teeth desperation.\nYou must truly live in the moment, making the second-to-second best of an unremittingly bad situation. You have lockers to hide in, vents to scurry through, and an ever-expanding array of bodged-together flash-bangs, noise-makers, smoke bombs and Molotovs. Even a couple of hard-to-use guns, later on. But none of them is ever the true answer. Because there are no true answers. Every possibility comes with disadvantages. Most are unwieldy and uncertain in their results, and all have the potential to make things worse if they don’t pan out. And they often won’t. Every move you make has an immediate and dramatic effect. Everything’s a ripple in the pond, and nothing ever reverts to a reassuring ‘normal’. It's all monumentally unsettling, made of constantly threatening unknowns. Exactly as real horror should be.\nIt takes at least a couple of hours to deprogram those long-ingrained video game instincts and understand how things work here, but when you do, you’re in for the most tooth-crackingly tense, ferociously believable, and emotionally harrowing survival action you’ve ever experienced. Not to mention a constant array of spectacular, randomly evolving, dramatic set-pieces, the power and spontaneity of which can put even the best scripted action to shame. You might gingerly open the door to a cavernous room that you know is filled with gun-toting humans, only to instantly behold they and the Alien silhouetted in a grim tableau of evisceration. You might quickly sneak out of a dangerous corridor to a side-office, to calm down and regroup, and immediately see a nine-foot horror show walking past the opposite door, missing you by a second.\nOh yes. The Alien. There’s that as well. Once you’ve spent the first hour or two forcibly acclimatising yourself to the depth, pace, and sheer, relentless demands on your mind and nerves, the real terror arrives. And you are not ready.\nSo nuanced, layered, and complete is the experience laid out by all of the above, that it’s almost possible to forget about the beast before it eventually appears. But however aware of it you are, its impact is devastating. Hell. I’d encountered it multiple times at preview, and even now, after the marathon, masterfully-paced running time of the full game (at least 20 hours, based on the current office completion average), it’s still a terrifying, confounding, and captivating presence.\nI use ‘captivating’ very deliberately there. Because the Alien is not simply a figure of fear. Its advanced intelligence and senses make it death-on-legs, a truly living, untamable wild animal. If it sees you, you are almost certainly dead. If it’s closely stalking you, your personal view of the world changes in an instant. Instinctively, you suddenly define your surroundings by light and shadow, by hiding holes, cover, silence and sound, all of which can work for or against you. Progress becomes a case of ‘if’ and ‘how’, not ‘when’. Movement is measured in inches and feet rather than metres, and simply remaining alive becomes more exhilarating than any objective achieved. Every new hiding place reached becomes a glorious win. Every room crossed becomes more satisfying than any boss fight. It’s as thrilling as it is terrifying, and that’s to say, immensely.\nBut over time, your relationship with the Alien will change, just as it changes the dynamics of the world around you. Despite its horrific, primal nature, you’ll steadily form a closeness to it. A strange, terrified, adversarial intimacy as you unconsciously study it and learn. Its sheer array of behaviours, reactions and abilities, while always monstrously imposing, will start to inform your own. The sound of its footsteps when out of sight, the cacophony of its breathing and screams, and the metallic thunder of its traversal through vents, gradually become a language, and your deadly, cat-and-mouse interplay a conversation. Avoiding, misdirecting and outsmarting a dangerous enemy is always a satisfying action, but with so much emotional weight attached to the act, and your methods informed by so much unguided, hard-earned understanding of the organism’s nature and actions, it’s more powerful and personal here than you’ve likely experienced before.\nYou’ll start to plot its invisible routes ‘outside’ of the level. Its movements on your motion tracker will explain its paths and behaviours around the map if interpreted with insight. You’ll try to predict whether it’s on the ground or in the ceiling, based on the sounds it makes. Eventually, it will become a key part of your journey, a perverse companion even. Sometimes you’ll even look upon it with fleeting relief, as it arrives to gore a pack of noisy, bloodthirsty looters on your tail. As later items allow you to interact with it more directly--though never to truly fight back--that closeness will increase, until by the end you’ll find your journey to be as strangely emotional as it is physical. In fact you’ll go through a very similar personal development to that of one Ellen Ripley over the course of a certain three films. And there truly can’t be a more perfect adaptation of Alien than that.\nStay low. Stay quiet\nSurvival is everything in Alien: Isolation. And it's not easy. Not easy at all. Fortunately, I've spent enough time on Sevastopol's uncaring, tin-can Hell to know how it works, and I can offer you a few rudimentary pointers. You're still in trouble though. A lot of trouble. You have my sympathies.\nKnow where your save point is\nUpon entering a new area, it should be the first thing you find. Think about doubling back to it between objectives (if it's worth the risk), and don't worry too much about hostiles near it, as long as they're not in the way. It you survive long enough to make the save, they'll have moved on when you reload.\nChoose (and use) your distractions wisely\nEvery crafted lure, trap and weapon can be as damaging to you as your pursuers. Flash-bangs and EMPs draw a lot of attention. Noise-makers can bounce the wrong way, attracting rather than distracting. Molotovs will get everyone's notice, and can burn you up just as easily as your opposition. Guns are loud, slow, awkward to use, and desperately inaccurate at range. Be very, very careful with all of your tools.\nFear the synthetic\nI can't prepare you for how utterly chilling Sevastapol's android drones are, but I can help you deal with them. They're incredibly resilient to violence, but a flash-bang--or even better, EMP--will stun them long enough to bludgeon. That though, will take time, causing a lot of noise and exposure in the process. Think very cautiously.\nAnd really, on a fundamental level, that’s what Alien: Isolation is about. It isn’t interested in giving you a sanitized, sugar-coated, traditionally gamey experience, with a familiar monster neutered by a load of player-friendly safety nets. It’s interested in being a real, sense-searing evocation of the honest reality of being trapped in a hostile environment with that creature. A total-immersion simulation of the film, with all of the horror, cruelty, disempowerment, and desperate, hard-fought triumphs that entails.\nIt’s about backing down a dead-end corridor, desperately, slowly and awkwardly ploughing every bullet you have into the nightmarish deathmask of a murderous, glacial android, praying you have enough time and ammo to kill it while screamingly aware that you don’t even know if it can be killed. It’s about the knowledge that even if you survive this one, your pockets will be empty, and you’ll have no idea how to deal with the other two coming around the corner. But goddamnit if you’re not going to fight for every last second of life you can get.\nIs Alien: Isolation for everyone? Perhaps not. If you demand reassurance, telegraphed threats, predictable solutions, and an inherent, hand-holding sense of ‘fairness’, you might find the experience too much to handle. But those of you brave enough--those of you tired of existing video game approximations of survival and horror, and craving a real test of your skills, instincts and nerves--will find a bounty of thrilling, engrossing, profoundly fulfilling rewards. If you truly embrace it, then during its most powerful moments, Alien: Isolation will probably make you feel more alive than a video game has in years.\nThis game was reviewed on PS4.\nMore info\n| Genre | Survival Horror |\n| Description | Total War developer Creative Assembly goes all-out to give the Alien franchise the brutal, claustrophobic, ungodly terrifying survival-horror adaptation it deserves. |\n| Platform | \"PS4\",\"Xbox 360\",\"PS3\",\"PC\",\"Xbox One\" |\n| US censor rating | \"Mature\",\"Mature\",\"Mature\",\"Mature\",\"Mature\" |\n| UK censor rating | \"\",\"\",\"\",\"\",\"\" |\n| Release date | 1 January 1970 (US), 1 January 1970 (UK) |"
    },
    {
      "url": "https://www.gamesradar.com/entertainment/marvel-movies/thunderbolts-review/",
      "text": "GamesRadar+ Verdict\nThunderbolts* is a refreshing offering from the MCU that takes plenty of big swings and only occasionally misses. The movie cares more about the characters and relationships on screen than the franchise at large, and that means we do too.\nPros\n- +\nFlorence Pugh brings the heart and the stunts\n- +\nLewis Pullman's Bob is an interesting addition to the MCU\n- +\nThe group dynamic feels fresh and fun\nCons\n- -\nSebastian Stan is underused\n- -\nA few plot points are glossed over a little too easily\n- -\nSome action scenes are a little underwhelming\nWhy you can trust GamesRadar+\nEvery new Marvel project seems to promise a new start for the MCU, but Thunderbolts* might be the only movie in recent memory that makes good on its word. Director Jake Schreier, known for his work on the Steven Yeun-led Netflix series Beef, takes some big swings, and they almost always pay off.\nThis is in no small part thanks to Florence Pugh's lead performance as Yelena Belova, a character who's back on the big screen for the first time since her MCU debut in the 2021 prequel Black Widow. When Thunderbolts* begins, Yelena is lacking purpose, and she's getting a bit existential with it (although the guard she's holding hostage isn't the most willing listener). She's in the midst of carrying out a string of under-the-table missions for CIA director Valentina Allegra de Fontaine (Julia Louis-Dreyfus), but her heart isn't in it – and hasn't been since the death of her sister Natasha, AKA Black Widow (Scarlett Johansson).\nLacking emotional support from hapless father figure and retired super soldier Alexei (David Harbour), Yelena decides to take on one final mission for Val before changing track, but she ends up with a little more on her plate than she thought she signed up for. While she's out in the field, she inadvertently crosses paths with some other aimless antiheroes: John Walker, AKA US Agent/disgraced former Captain America (Wyatt Russell), Ava Starr, AKA Ant-Man and the Wasp's antagonist Ghost, Antonia Dreykov, AKA Red Room assassin Taskmaster (Olga Kurylenko), and newly elected congressman Bucky Barnes (Sebastian Stan). And newcomer Bob (Lewis Pullman), who doesn't quite know why he's there, either.\nNew ground\nDespite a bout of amnesia, Bob soon proves to be vital to the movie – and bringing the titular team together – thanks to his superpowered alter-ego. Coming up against his own demons and those who are keen to exploit a superhero ingénue, Bob is the key to unlocking a different kind of Marvel movie in Thunderbolts*. It puts its characters' comic book pasts on the backburner to focus instead on something a little more humanizing: mental health struggles.\nThis isn't the first time a superhero movie has tackled similar themes, but Thunderbolts* does push them onto center stage in a way that previous offerings haven't. That thought may make you wince a little – I know I would have if I'd known that going in – but rather than using \"mental health\" as an empty buzzphrase, the movie makes an admirable attempt to explore what it means to be unwell, and how the state fails those who struggle with mental illness.\nRelease date: May 1 in the UK, May 2 in the US\nAvailable on: In theaters\nDirector: Jake Schreier\nRuntime: 2h 6m\nThe central group dynamic also feels pretty fresh and the way the Thunderbolts bounce off each other helps shake off the tiring, quip-heavy humor of Marvel movies past. It brings to mind the first Guardians of the Galaxy movie, although this is still its own beast. For one thing, Russell is having much more fun here than in his last MCU outing, the 2021 TV show The Falcon and the Winter Soldier, and Walker is a much more interesting character here when he's butting heads (and working together) with his new teammates. On the other hand, the scope of Harbour's performance often seems to be \"shouting\", but there are still some quieter, more touching moments between Alexei and Yelena that try to anchor the film.\nStan, now an Oscar nominee, is surprisingly underused and takes somewhat of a backseat in the action, but he does pull off one of the funniest moments in the movie, which involves his vibranium arm getting a freshen up in the dishwasher. On the other side of the story, Thunderbolts* sees Val take center stage for the first time after a smattering of appearances in Black Widow, Black Panther: Wakanda Forever, and The Falcon and the Winter Soldier. Louis-Dreyfus doesn't quite seem convinced by all her lines, but she remains great casting as a camp, comic villain.\nBringing all the latest movie news, features, and reviews to your inbox\nMissed opportunities\nOf course, with any movie that makes some big swings, there are a few misses. As with any popcorn flick, there are a couple of plot points that are a little too conveniently glossed over, particularly in the later acts, and there's nothing to really set the action sequences and fight scenes apart from any other installment in the franchise (that being said, Pugh seriously impresses with a jump from the world's second-tallest building in the movie's opener, a stunt she insisted on doing herself).\nUltimately, Thunderbolts* is trying very hard to be \"about something\", and it mostly succeeds. The movie is primarily concerned with how we live with the weight of our mistakes, and acknowledges – mostly through Yelena and Bob – that there's no easy solution. It's a sentiment that could easily become saccharine, but Pugh and Pullman are skilled enough performers to pull it off.\nWhat Thunderbolts* really benefits from, though, is a separation from the rest of the shared universe. This might seem like an odd assertion about a movie populated by characters we recognize from other movies and shows (and one that is, admittedly, slightly undercut in the post-credits scenes), but the story works even if you haven't seen them. There are references to past events, sure, but the movie isn't bogged down in the franchise's history. In this movie, it doesn't really matter that it was Black Widow who died; it matters that Yelena is grieving her sister.\nThunderbolts* is out on May 1 in UK cinemas and May 2 in US theaters. For more, check out our guide to the other upcoming Marvel movies on the way in 2025 and beyond.\nI’m an Entertainment Writer here at GamesRadar+, covering everything film and TV-related across the Total Film and SFX sections. I help bring you all the latest news and also the occasional feature too. I’ve previously written for publications like HuffPost and i-D after getting my NCTJ Diploma in Multimedia Journalism.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/sci-fi-shows/alien-earth-release-date-cast-plot-trailer/",
      "text": "Alien: Earth release date, trailer, cast, and everything else we know about the Alien TV show\nHere are all the latest details and news that you need to know about FX's new Alien TV show, Alien: Earth\nAlien: Earth is finally here, and despite only releasing a few episodes, it's already become a fast sci-fi obsession of ours. If you've watched all the Alien movies in order, then you'd know that Ridley Scott's original 1979 outing isn't just one of the best horror movies of all time, but also introduced us to a fascinating sci-fi world, complete with terrifying creatures that burst out of chests, hug faces and have a habbit of spitting acid all over the place.\nFor years, xenomorphs have been haunting the big screen, and with prequel stories such as Prometheus building up lore, we're thrilled to see the franchise get a chance to expand with a new series that takes place years before Ellen Ripley's first encounter with the deadly lifeform. With Fargo creator Noah Hawley as showrunner, and some complications around the Alien: Earth timeline, we expect to see some more changes, though, as the show continues. In fact, despite our glowing Alien: Earth review, the changes that we've already seen can get a tad confusing even for the most seasoned Alien fan. So with that in mind, we've decided to create a helpful guide on everything that you need to know about the series as more episodes head our way.\nBelow you'll find information on the Alien: Earth release schedule, a complete cast list, trailers, a spoiler-free plot deep dive, and more. So what are you waiting for? Get ahead of the game and get ready to face some small-screen xenomorphs!\nAlien: Earth release date\nAlien: Earth was released on August 12 in the US and August 13 in the UK. The show is on Hulu in the US and Disney Plus in the UK, with two episodes dropping at once, then the rest following weekly. Season one will finish on September 23 with the release of episode eight.\nFilming on Alien: Earth wrapped in summer 2024, with creator Noah Hawley confirming that the team was busy in post-production shortly afterwards. While editing and adding visual effects on anything sci-fi-related takes time, it makes sense for Alien: Earth to capitalize on the renewed hype for the franchise that the 2024 movie Alien: Romulus created.\nIf you want to keep up with the show, you can also head on over to our guide breaking down the Alien: Earth release schedule.\nAlien: Earth trailer\nThe first teaser trailer for Alien: Earth was a 15-second clip featuring a blood-dripping Xenomorph and ending with a jump scare. We see Planet Earth before its shape slowly turns into a Xenomorph and screeches at the viewer. Because we know that Noah Hawley doesn't play around when it comes to violence (thanks to Fargo) and that he plans to follow the aesthetic from Alien and Aliens, we know this is going to be quite the scary ride.\nBringing all the latest movie news, features, and reviews to your inbox\nOur best look yet, though, was the official trailer below. This ship has collected five different lifeforms from the darkest corners of the universe,\" Babou Ceesay's Morrow whispers ominously in the clip. Later, we see a couple of characters logging details of a jellyfish-like specimen on a computer, to which its description reads: \"Ocular irises and a tentacle system that can grow or retract at will. The tentacles carry extraordinary strength and are built to climb into and dislodge the eyes of other living organisms.\n\"Once replaced in the eye socket, [it] takes over the ocular pathways to the brain, overriding the neurotransmissions throughout the body,\" it continues. Truly nightmarish stuff.\nWe're still holding out hope that one of the \"five lifeforms\" mentioned turns out to be a Predator, after fans convinced themselves (and subsequently, us) that they could hear the ultimate hunter's iconic snarl in an earlier teaser.\nAlien: Earth plot\nThe new TV series is a prequel to the original 1979 Alien, taking place in 2120 – just two years before Ellen Ripley encountered her first xenomorph aboard the Nostromo. It's set in an era where \"five corporations – Prodigy, Weyland-Yutani, Lynch, Dynamic, and Threshold – wield the power of nations.\"\nIt centers more specifically on Wendy (Sydney Chandler), a synthetic with the body of an adult woman and the mind of a child, who comes face to face with the eponymous creature, after she and a bunch of fellow hybrids are tasked with investigating a crash-landed spaceship in Prodigy City. Thanks to a first-look deep dive from Vanity Fair, we now know that the vessel Wendy and her pals venture into is the USCSS Maginot, a Weyland-Yutani freighter. Ruh roh.\nA new Special Look Trailer for ‘ALIEN: EARTH’ has been released.#AlienEarth hits Disney+ this Summer! pic.twitter.com/tWVeFJRwtTMarch 22, 2025\nWhile it had previously been reported that Alien: Earth would not bridge the gaps between the Alien timeline, instead focusing on the Weyland-Yutani Corporation's race to develop robotic life, Vanity Fair's write-up paints a slightly different picture.\n\"I don't yet know, in terms of the series from beginning to end, how much time is going to pass or where we're going to end up,\" Hawley told the publication, suggesting that possible future seasons could creep into crossover territory. \"But I do know that at a certain point, the Weyland-Yutani Corporation is going to divert the Nostromo to that planet. We have the opportunity to maybe see what was happening on the other side of that phone call.\"\nOne thing's for certain: we're going to get lots of xenomorph action. \"There's something about seeing a xenomorph in the wilds of Earth with your own eyes,\" Hawley teased to Deadline. \"I can't tell you under what circumstances you'll see that, but you'll see it – and you're going to lock your door that night.\" We've been promised more xenomorph screentime than any of the movies, and that the show will also include a bunch of different creatures\nThe director also stated that the creature will look different from what we have seen before but will still keep the same silhouette, calling that detail \"sacrosanct.\" Hawley added, \"But some of the elements, as we know, whatever the host is, informs what the final creature is. I just wanted to play around a little bit to make it as scary as it should be.\"\nAs more episodes drop, we'll keep you posted on any big story reveals as they come. In the meantime, we have managed to gather a list of all the Alien: Earth Easter Eggs so far, if you're looking for any potential clues on the direction of the show's narrative.\nAlien: Earth cast\nThe cast for Alien: Earth is stacked with stars who have appeared in several of the best TV shows around, such as Game of Thrones, Shadow and Bone, and Fargo. You may recognize names such as Timothy Olyphant (who starred in the likes of The Mandalorian and Scream 2) or Alex Lawther (as seen in Black Mirror and Andor).\nWhile we don't know specific details on most characters, we've scoured the internet to find out their names. Check out the complete Alien: Earth cast list below:\n- Sydney Chandler as Wendy\n- Alex Lawther as CJ\n- Samuel Blenkin as Boy Kavalier\n- Essie Davis as Dame Silvia\n- Adarsh Gourav as Slightly\n- Kit Young as Tootles\n- Timothy Olyphant as Kirsh\n- David Rysdahl as Arthur\n- Babou Ceesay as Morrow\n- Jonathan Ajayi as Smee\n- Erana James as Curly\n- Lily Newmark as Nibs\n- Diêm Camille as Siberian\n- Adrian Edmondson as Atom Enis\n- Moe Bar-El as Rashidi\n- Sandra Yi Sencindiver\nWhere can I watch Alien: Earth?\nYou can now watch Alien: Earth on Hulu if you are in the US and on Star via Disney Plus if you're not. For UK readers, it seems like Disney Plus will be your go-to.\nGiven how other FX series, such as What We Do In The Shadows, have arrived on Disney Plus or the BBC, we assume that the upcoming Alien series will be heading to either of those two streaming hubs in the future.\nKeep your eyes on this guide as we update you on the latest streaming news. While we wait, you can also check out our list of the best movies on Disney Plus to watch right now!\nFor more outer-world fun, check out our lists of the best sci-fi movies on Netflix and the best Alien movies ever made.\nAfter reviewing films throughout University and being a cosy game expert for years, I realised that entertainment journalism was my true calling in 2019. Since then, I've started multiple new farms on Stardew Valley and have written for several publications such as The Upcoming, PCGamesN, and Wargamer. I was the resident Guides Editor and horror lover for The Digital Fix before joining the GamesRadar+ team in 2024. As the Managing Editor for Evergreens, I'll be making sure that all the best lists you read on GamesRadar+ are the most helpful and fun pages on the internet!\n- Mireia MullorContributing Writer\n- Amy West\n- Megan GarsideEditorial Associate, GamesRadar+\n- Molly EdwardsDeputy Entertainment Editor\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/best-movies-on-apple-tv/",
      "text": "The 10 best movies on Apple TV Plus to stream right now (August 2025)\nFrom CODA to Tetris, here are 10 of the best Apple TV movies to watch in August 2025\nThis list of the best Apple TV Plus movies includes several modern gems that are more than worthy of your attention. Although the streamer's library is perhaps a little smaller than some of its competitors, it more than makes up for that in terms of quality.\nThere's some terrific stuff here on what is undoubtedly one of the best streaming services around. From Martin Scorsese's gripping Killers of the Flower Moon to video game biopic Tetris, by way of the beautiful animated movie Wolfwalkers and the haunting Causeway, this list has something for every taste.\nSo join us now as we pick out the 10 best movies on Apple TV Plus to watch right now. For more, check out our guide to the best Apple TV shows, and our pick of the best Netflix movies to see what else is out there.\n10. CODA\nYear: 2021\nDirector: Sian Heder\nCODA's Best Picture win at the 94th Academy Awards has earned it a place in the hallowed halls of Hollywood history, yet there's more to this powerful movie than shiny accolades. Our hero is Ruby Rossi, the child of deaf adults (CODA) – and the only member of her family who can hear – who wants more from her life than a future working on the family fishing boat.\nWhile there's a degree of cliché to the film's plot, that doesn't stop CODA from being an emotional coming-of-age story that'll leave you on the brink of tears, thanks in large part to its incredible cast, who bring a degree of authenticity to a slightly formulaic story. Arguably, the film's greatest strength is Emilia Jones, who is simply sensational as the ambitious but isolated Ruby.\nWant to stay ahead of the award season? Keep track of exciting titles with our guide to all the best movies of 2024.\nBringing all the latest movie news, features, and reviews to your inbox\n9. Greyhound\nYear: 2020\nDirector: Aaron Schneider\nBased on C. S. Forester's book, The Good Shepherd, this thrilling war movie follows Ernie Krause, a US Navy commander who must protect an Allied convoy from German U-boats during World War 2. While Greyhound's story and characters are a little thin, it's made up for it by having some of the most intense maritime action scenes ever put to film.\nWe also have to talk about a deliberately taciturn but soulful performance from Tom Hanks, who fills in the holes in Krause's characterization with his own reassuring presence. Seriously, it's not the best Tom Hanks movie ever made, but it is the best Tom Hanks movie on Apple TV Plus, so if you are craving some drama, add it to your watchlist.\nFor more information on this Tom Hanks must-watch, check out our Greyhound review.\n8. Blitz\nYear: 2024\nDirector: Steve McQueen\nSteve McQueen's wartime thriller is equal parts heartwarming and harrowing. Elliott Heffernan stars as George Hanway, a nine-year-old boy who is evacuated from London during the Blitz, but who leaps off the train and makes his way back to the city to find his mother, Rita (Saoirse Ronan).\nAlthough the scenario sounds like the start of an adventure movie, Blitz is shot through with moments of real horror. McQueen brings this horrifying chapter in British history vibrantly to life, making you feel the sheer terror of living in a city under siege through the eyes of a child. Blitz is haunting and frequently sad, but it's also gripping and features, somewhat unexpectedly, an excellent performance from rock icon Paul Weller as George's grandfather. A compelling watch – but bring a box of tissues, as this one's a bit of a tear-jerker.\nFind out more about the WW2 movie in our Blitz review.\n7. Hala\nYear: 2019\nDirector: Minhal Baig\nA moving and naturalistic coming-of-age story, Hala follows Hala Masood, a young Pakistani American, as she struggles with her family's expectations and her own growing attraction to a boy at school. While it may sound a little cliché, this isn't a John Hughes movie.\nInstead, it tells the story you think you know through the experience of a second-generation immigrant, which puts an impressive fresh spin on things. As the film plays out, however, it morphs from a deceptively predictable set-up into a much more powerful parable about the mistakes our parents make. Perhaps, though, the film's secret weapon is Geraldine Viswanathan, who keeps Hala charming, funny, and easy to empathize with as she walks the tightrope between childhood and adulthood.\nHaven't signed up for Apple TV yet? Check out our handy guide breaking down all the Apple TV Plus costs and prices.\n6. Causeway\nYear: 2022\nDirector: Lila Neugebauer\nAn understated and compelling drama about the lasting effects of trauma, Causeway tells the story of Lynsey, a former soldier trying to rebuild her life after she experienced a traumatic brain injury while on tour in Afghanistan. A wonderfully authentic and quietly moving film, Causeway doesn't necessarily take any big swings, but it doesn't need to.\nIts power lies in the quiet drama of everyday life and the value of human connection. Jennifer Lawrence gives a sensationally affecting performance, which was hailed by some as a return to form upon the film's release, yet in my opinion, it's her chemistry with co-star Brian Tyree Henry that makes this film sing.\nFor more streaming recommendations, head over to our list of the best movies on Netflix.\n5. Tetris\nYear: 2023\nDirector: Jon S. Baird\nOn paper, Tetris sounds like one of the dullest movies ever made. A biopic about Henk Rogers, the man who licensed (he didn't even invent it!) Tetris and made it popular in the West? Are you kidding me? Well, no, I'm not because director Jon S. Baird manages to turn a tale of boring business backhanders into a film as colorful and chaotic as the titular game.\nThere's just a lot of life and energy in this zany and funny film, and it's hard not to enjoy its charms. Taron Egerton is, of course, brilliant as Henk, giving the character a sort of greasy conniving allure, yet under his yuppie disguise, you'll find a surprisingly noble soul. Weirdly, though, Egerton wasn't my favorite actor in the cast. Instead, I was won over by Roger Allam's villainous portrayal of Robert Maxwell, a sort of business boogeyman determined to get Tetris for himself.\nDo you love seeing games on the big screen? Check out our list of all the upcoming video game movies in the works.\n4. Fancy Dance\nYear: 2023\nDirector: Erica Tremblay\nSet on the Seneca-Cayuga reservation in Oklahoma, Jax (Lily Gladstone) turns to stealing cars to care for her niece Roki (Isabel Deroy-Olson) while also investigating what happened to her missing sister. We have many things to thank Martin Scorsese for, but one of them is introducing us to Lily Gladstone, one of the best actors currently working in Hollywood.\nIn this moody thriller that's part social drama, part murder mystery, she gives yet another star turn which, were there any justice in this world, would earn her the Oscar she was denied for Killers of the Flower Moon (more on that later). Beyond Gladstone, though, Fancy Dance has a lot going for it, specifically Erica Tremblay's assured direction, and the layered story about the injustices Indigenous women are forced to endure every single day will keep you enthralled for its entire 90-minute run.\n3. The Tragedy of Macbeth\nYear: 2021\nDirector: Joel Coen\nShakespeare adaptations are ten a penny these days, but there's something special about Joel Coen's take on Macbeth. Perhaps it's the incredible cast he managed to assemble who – led by the inimitable and charismatic Denzel Washington – breathe new life into the Bard's dark meditation on pride and ambition.\nMaybe it's the incredibly stark and eerie visuals that Coen and his cinematographer Bruno Delbonnel conjure up from shadows and light? Or it could just be that Shakespeare's words still hold power over us, bewitching audiences even now, centuries after he put them to paper. Whatever the answer, this moody tragedy deserves your attention.\nFor more award-winning films, read our list of the best movies on HBO Max.\n2. Wolfwalkers\nYear: 2020\nDirectors: Tomm Moore, Ross Stewart\nCartoon Saloon regularly produces some of the best animated movies ever made, and Wolfwalkers, the third film in their Irish Folklore Trilogy, might be their greatest achievement to date. This vibrant and lively cartoon follows Robyn, an apprentice hunter who befriends a young girl, Mebh, who has the power to turn into a wolf.\nWe won't give away what happens next, but let's just say things get a lot more complicated from there. Boasting memorable and lovable characters, gorgeous animation, and a story as moving as anything Pixar has put out, this charming fairy tale is a must-watch. Its art style is also stunning and is a nice change of pace from the typical 3D style we've been seeing largely throughout the last few years.\nRead our list of the best Disney Plus movies for more animated masterpieces.\n1. Killers of the Flower Moon\nYear: 2023\nDirector: Martin Scorsese\nMartin Scorsese is a legend in Hollywood, and his most recent picture proves that he's still at the height of his directorial powers. Grand in every sense of the word – from its ambitious story to ginormous run-time – Killers of the Flower Moon is a demanding and engaging drama that tells the sadly true story of the Osage tribe and the injustices they suffered when oil was discovered on their land.\nHonestly, summing up what makes Killers such an amazing film is hard to do. Nearly every element of the film is perfect, from Scorsese's sublime direction, Rodrigo Prieto's haunting cinematography, and the impeccable work of an all-star cast. Yet honestly, my favorite thing about the film is the way Scorsese cleverly uses the trappings of crime drama to tell a much more important story about America's exploitative relationship with the natural world and Indigenous people.\nRead our five-star Killers of the Flower Moon review for more details on the best movie on Apple TV Plus.\nIf you're still looking for something new to watch, we have lists of the best movies on Amazon Prime and the best movies on Hulu for you to look over.\nTom Percival is an experienced editor and journalist with an expertise in the movie and TV industries. As well as contributing to GamesRadar+, you can also find Tom's work at sites like Dexerto, The Digital Fix, and UNILAD. He's also a film critic for BBC Radio Manchester. When he isn't writing about the biggest and most interesting movies around, he's probably distracted by Warhammer or spending too much time reading about Spider-Man.\n- Tom BeasleyContributor\n- Mireia MullorContributing Writer\n- Emma-Jane BettsManaging Editor, Evergreens\n- Will SalmonStreaming Editor\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/tag/disney/",
      "text": "Disney\nLatest about Disney\nMy favorite ever Disney Halloween decoration is available again, so don't miss it\nBy Benjamin Abbott published\nNews I'm a massive Disney fan and this is my favorite Fall decoration\nTron: Ares release date, trailer, cast, plot, and more news\nBy Emma-Jane Betts last updated\nGuide Tron 3 is coming in a matter of weeks – here's everything you need to know about the new Disney movie\nA new behind-the-scenes Thunderbolts photo is making fans even more disappointed with one character death: \"She showed her face for like two seconds for absolutely no reason\"\nBy Mireia Mullor published\nNews Fans feel \"they've done her dirty\" in the MCU\nThe best new TV shows coming your way in 2025\nBy Fay Watson, Emma-Jane Betts last updated\nBest List From Slow Horses to Gen V, these are the best new TV shows still to come this year\nDisney pulls plug on The Aristocats remake according to director Questlove who says it \"just wasn’t meant to happen\"\nBy Nick Staniforth published\nNews Disney restructuring is what stopped our new meeting with Thomas O'Malley Cat\nEvery new Star Wars movie and TV show currently in the works\nBy Molly Edwards last updated\nUpcoming What you need to know about the new Star Wars movies and TV shows releasing in the next few years\nStar Wars: Starfighter release date, cast, plot, and more news\nBy Molly Edwards last updated\nGuide Everything we know about Starfighter, the 2027 Star Wars movie\nDeadpool and Wolverine director's Star Wars movie Starfighter shares first look and confirms new casting, including Amy Adams and a Lanterns star\nBy Lauren Milici published\nNews Production has officially begun\nWeekly digests, tales from the communities you love, and more"
    },
    {
      "url": "https://www.gamesradar.com/best-shows-on-paramount-plus/",
      "text": "The 25 best shows on Paramount Plus to watch right now\nFrom Dexter to Yellowjackets, here are 25 of the best shows on Paramount Plus to watch in September 2025\nIf you're looking for a list of the best Paramount Plus shows then you've come to the right place! On this page we've put together a selection of 25 of our favorite shows that are all available to stream right now.\nParamount Plus may not be quite as big as Disney Plus, Netflix, or Amazon Prime Video, but it's easily one of the best streaming services around. It has a wealth of great new shows, like Star Trek: Strange New Worlds, MobLand, and Tulsa King. But what really sets it apart from other streamers is its incredible back catalog of titles. If you're a comedy fan, then Paramount Plus is the streamer for you, with both Cheers and Frasier here, Ghosts, and of course the ever-relevant South Park. Sci-fi and horror fans, meanwhile, will find all the different Star Trek shows and Twin Peaks at their fingertips.\nSo if you're looking for a new TV obsession, check our list of the best Paramount Plus shows below. And when you're done reading this, take a look at our guide to the best Paramount Plus movies and the best HBO Max shows.\n25. 1923\nThere's no arguing with the casting of this Yellowstone prequel, which stars Harrison Ford and Helen Mirren, alongside former James Bond Timothy Dalton. Set in 1923 (obviously), the series follows the ever-troubled Dutton family through a period of great change and hardship in Montana.\nFor fans of Taylor Sheridan's Western franchise this will be reassuringly familiar stuff. That's no bad thing, though. Tough and exciting, 1923 also expands the scope of the saga, moving some of the action outside of the States with subplots set in Africa and at sea. And there's no doubt that casting a pair of bona fide movie legends in the leads lends the show some real class and gravitas.\n24. Tulsa King\nYear: 2022\nSeasons: 2\nRocky star Sylvester Stallone made the move to TV with this two-fisted crime drama. Stallone plays Dwight \"The General\" Manfredi, a New York mobster who has just served 25 long years in prison for murder. On his release he moves to Tulsa and tries to start again – but that's going to mean dealing with a nasty biker gang and figuring out his relationship with Stacy Beale (Andrea Savage), an ATF agent who is investigating Dwight.\nBringing all the latest movie news, features, and reviews to your inbox\nCreated by Yellowstone's Taylor Sheridan, Tulsa King is something of a throwback. If you're after the new Sopranos, then you're in the wrong place. If, on the other hand, you want a mob drama with action, humor, and some slightly bananas plotting, then Tulsa King is the show for you.\n23. Knuckles\nYear: 2024\nSeasons: 1\nFew expected the Sonic the Hedgehog movies to be as much fun as they turned out to be. Remarkably, last year's six-episode Knuckles spinoff show was even better. Focused on Sonic's hot-headed echidna warrior pal, once again voiced by Idris Elba, the Knuckles series combined live action with animation and comedy with some real emotional stakes.\nThe key to all this is Adam Pally's Wade Whipple – Knuckles' partner on a bizarre road trip, and the heart of the series, whether battling G.U.N. agents Mason and Willoughby, or getting caught up in a bizarre dream sequence that saw British comedy legend Julian Barratt performing a rock opera retelling of Knuckles' backstory with singer Michael Bolton. Inventive, hilarious, and often super weird, Knuckles proved that there's still a lot of life in the Sonic franchise.\n22. Evil\nYear: 2019\nSeasons: 4\nOver its four seasons this quirky horror series quietly became one of the most reliably entertaining shows on Paramount Plus. Forensic psychologist Dr. Kristen Bouchard (Katja Herbers) joins forces with a Catholic priest David Acosta (Mike Colter) to investigate reports of supernatural events. Pitted against them is Michael Emerson (who played the villainous Ben Linus on Lost) as a rival psychologist and devout evil-doer – not exactly playing against type here.\nWith a nice mix of one-off episodes and ongoing arcs, Evil really does feel like The Catholic X-Files. It's not afraid to mix humor in with the laughs and the leads are compelling, especially the tormented Acosta, who is grappling with substance issues. Evil wrapped up its final season last year, meaning the whole is available to watch on the streamer right now.\n21. MobLand\nYear: 2025\nSeasons: 1\nTom Hardy, Helen Mirren, and Pierce Brosnan – now there's a cast! In MobLand, Hardy plays Harry Da Souza – a fixer for prominent crime family, the Harrigans. Led by the deadly duo of Conrad (Pierce Brosnan) and Maeve Harrigan (Helen Mirren), this Irish gang have a stranglehold on the drugs and guns in London, but they're also prone to getting into trouble. That's where Harry comes in – threatening, cajoling and sometimes straight up beating anyone who gets in his way, all while having to deal with a disintegrating marriage.\nMobLand is fast-paced and fun, aided by the natural charisma of its leads. Giving it extra gangster cred is the fact that the season's first two episodes (of 10) are directed by Guy Ritchie – no stranger, of course, to this sort of thing. The show was an instant hit, which means the Harringans will be back in action for a second season in the nearish future.\n20. Yellowjackets\nYear: 2021\nSeasons: 3\nThis gripping – and often unexpectedly very funny – mystery drama takes place in two different time zones. In the '90s, an all-girl football team's plane crashes in a mountainous wilderness. With seemingly no hope of rescue, the survivors turn to increasingly desperate measures to survive, including cannibalism. In the present day, we learn that some of the survivors eventually made it back to civilisation, but their adult lives are, if anything, even more perilous...\nYellowjackets has a perfect first season and two almost as good follow ups. It's a brilliantly unpredictable and often ruthlessly dark thriller with an exceptional cast. Christina Ricci impresses as Misty, shy and bullied as a teenager, now a master manipulator. But it's Melanie Lynskey's increasingly off the rails Shauna who has grown into the rotten heart of an increasingly psychotic series.\nSeen all of Yellowjackets but still have questions? Check out our guide to the ending of Yellowjackets season 3.\n19. Dexter: Resurrection\nYear: 2025\nSeasons: 1\n21 years after he first slashed his way onto our screens, serial killer Dexter Morgan (Michael C. Hall) is back in a new spinoff series. Somewhat remarkably – considering this is the fourth show in the franchise – the still-airing Resurrection has turned out to be just as good as the groundbreaking original.\nThe show picks up where Dexter: New Blood left off. That ended with Dex seemingly fatally shot and his son Harrison (Jack Alcott) moving to New York. Well, it turns out that our killer with a conscious survived and in Resurrection he's both keeping a watchful eye on his son and taking out more deadly killers, just like in the old days. It's fun, it's violent, and it's a big improvement on the last few seasons of the original. Perhaps, in time, it may even surpass it.\n18. South Park\nYear: 1997\nSeasons: 27\nAmerica's most outrageous animated series is as filthy and hilarious as when it debuted back in 1997. Trey Parker and Matt Stone's hands-on approach to the series means that, while it has its fair share of weaker episodes, it has remained remarkably consistent over an incredible 27 seasons now.\nSouth Park follows the adventures of four young boys (along with their schoolmates and parents) in the titular town. There are occasional aliens and supernatural events, but mostly the series is about poking satirical fun at everyday life. In that regard, Parker and Stone go out of their way to offend everybody. And while it's fair to say that some of South Park's gags have aged poorly, it remains an impressively reliable joke machine – and one that has garnered a lot of recent headlines.\nThese are the 25 best South Park episodes, mmkay?\n17. Halo\nYear: 2022\nSeasons: 2\nHalo was one of the flagship shows created to introduce viewers to the fledgling Paramount Plus. Inspired by the famous video game series, it follows the adventures of Master Chief Petty Officer John-117 (Pablo Schreiber), a super-soldier in the war against the alien Covenant.\nThe wider Halo franchise has some fairly in-depth lore, established in both the games and expanded universe novels. The Halo show sensibly streamlines a lot of this, taking place in a separate \"Silver Timeline.\" This decision alienated some hardcore fans but made sense for a show aimed at a wider audience. After a solid but occasionally a little sluggish first season, the show really matured in its second year. The action stepped up and so did the drama, resulting in a show that did the legendary FPS justice. Sadly, it was axed after just two seasons.\n16. Star Trek: Strange New Worlds\nYear: 2022\nSeasons: 3\nThe best of the many recent Star Trek spin-offs is this refreshingly old-school space adventure show. Set a few years before the original 1960s Trek, Strange New Worlds follows the crew of a pre-Captain Kirk USS Enterprise. In the captain's chair is Christopher Pike (Anson Mount), a charming, immaculately coiffed leader who we know will eventually face a terrible fate. Alongside him is Rebecca Romijn as Pike's first officer, nicknamed Number One, and Ethan Peck as a young Spock.\nStrange New Worlds mainly trades in one-off episodes, which makes it the easiest Trek to get into for new viewers, but there are also some neat arcs ticking along in the background – such as Pike learning of his seemingly inescapable fate. It's also blessed with a truly lovable central cast. The third season is now airing weekly on the streamer.\nUnsure where Strange New Worlds sits in relation to Deep Space 9 or The Next Generation? Check out our Star Trek timeline.\n15. Nathan For You\nYear: 2013\nSeasons: 4\nNathan Fielder broke onto our screens with this jaw-dropping Comedy Central series. The premise is simple: Nathan is here to help give stalling businesses a boost with some truly out of the box ideas like, say, convincing an ice cream parlour to trial a new poo flavored product; or reinventing a caricature artist as a mean \"King of the Sting\" who only draws unflattering portraits; or creating a sleeper cell of deliberately bad Uber drivers...\nNathan For You goes so far into cringe comedy extremes that, at times, it can be genuinely a little hard to watch. But at its best, this sublime series blurred the lines between fact and fiction in a truly dazzling way. It also set the stage for Fielder's excellent, equally boundary-pushing future shows The Rehearsal and The Curse.\n14. Star Trek: Deep Space Nine\nYear: 1993\nSeasons: 7\nWhile it may not be as much of a crowd-pleaser as the shows that spawned it, Deep Space Nine is arguably the connoisseur's choice of Star Trek show. More sombre than its predecessors, DS9 broke new ground by being the first Trek show to not really, well, trek anywhere. Instead, it took place largely on the titular space station – a rundown relic in orbit around the planet Bajor.\nAvery Brooks stars as Benjamin Sisko, a Starfleet officer who finds himself torn between his duties to the Federation and a growing loyalty to the Bajorans. Meanwhile a race of alien shapeshifters has set their sights on the Alpha Quadrant, eventually leading to all out war. Rather than being grimdark Star Trek, however, Deep Space 9 was all about stress-testing Starfleet's much-vaunted moral principles. It also showed a commitment to serialized storytelling long before that was the prevailing TV trend.\n13. Cheers\nYear: 1982\nSeasons: 11\nThis beloved sitcom is far more than just the show that spawned Frasier. Set in Boston, and focused on the titular basement pub, Cheers was built around the will they/won't they romance between down to earth bartender Sam (Ted Danson) and Diane Chambers' more academically-minded Shelley. They weren't the only great characters though – in fact the pub was stocked full of them, from Nicholas Colasanto's slow-witted Coach, to Rhea Perlman's belligerent cocktail waitress Carla, and Norm (George Wendt), a perennial fixture at the bar.\nCheers ran for 11 seasons and 275 episodes, and remained a remarkably consistent joke machine throughout. It weathered major cast changes – Colasanto passed away suddenly in 1985, while Diane Chambers left the series to pursue a movie career. She was replaced by Kirstie Alley's Rebecca, who stayed till the end of the series. It also introduced the world to a certain neurotic psychiatrist played by Kelsey Grammer – but that's a whole other story...\n12. Ghosts UK\nYear: 2019\nSeasons: 5\nThis supernatural sitcom has quietly become one of the UK's most beloved TV exports. Cash-strapped couple Alison (Charlotte Ritchie) and Mike (Kiell Smith-Bynoe) unexpectedly inherit a crumbling mansion from a previously unknown relative and move in only to find that it is absolutely riddled with ghosts. These specters date from different time periods connected to the house and while they initially try to spook Alison and Mike, they eventually all become firm friends – albeit friends that often bicker and squabble.\nOver its five seasons, the BBC version struck the balance between family-friendly silliness, some surprisingly cutting gags, and real emotional heft, with the show never forgetting that loss is at the core of its premise. The US version, which started in 2021, doesn't quite have the same heart, but the strength of the show's premise and a larger cast means that it's still a fun and often inspired watch.\n11. The Good Wife\nYear: 2009\nSeasons: 7\nThis legal drama followed the life and career of Julianna Margulies' Alicia Florrick, the wife of a State's Attorney caught up in a sex scandal. Initially deciding to stick with her husband while returning to work as a lawyer after more than a decade raising kids, Alicia faces many personal and professional challenges, not least her attraction to Will Gardner (Josh Charles), a partner at the firm she works for.\nThe Good Wife ran for seven seasons and was never afraid to change things up a little. Alicia's marriage flounders. She embarks on a turbulent relationship with Will, and starts her own law firm, before eventually running for State's Attorney herself. The series was always smart and engaging, mixing real world issues – vote-rigging, gender inequality, and more – with high drama. A sequel series, The Good Fight, followed Christine Baranski's Diane Lockhart, and ran for six seasons.\n10. Frasier\nYear: 1993\nSeasons: 11\nIs Frasier the best TV spinoff ever made? It's certainly one of the most successful, running for 11 seasons between 1993 and 2004. Kelsey Grammar reprises his Cheers role as Dr. Frasier Crane, a fussy radio psychiatrist brought down to Earth when he is forced to take in his father Martin, a retired cop played with earthy charm by the late John Mahoney. Also in the mix is Martin's live-in carer Daphne (Jane Leeves), and Niles (David Hyde Pierce), Frasier's even snootier younger brother.\nFrasier strikes the perfect balance between sitcom farce and genuine emotion. The relationship between the Crane boys and their father is strained, but loving, while the tentative romance between Daphne and Niles becomes the heart of the show. Frasier relaunched in 2024 for a new series, which ran for two seasons. It's better than its critics might suggest, but doesn't touch the many high points of the original.\n9. RuPaul's Drag Race\nYear: 2009\nSeasons: 17\nThe only reality show on this list is this wildly OTT, gloriously camp, and endlessly entertaining competition. Every season the iconic drag queen RuPaul, and a group of judges, pit a group of up and coming queens against each other in a series of challenges, involving makeovers, lip syncs, and more. The contestants are whittled down to just a few finalists who display the most \"charisma, uniqueness, nerve and talent\". until RuPaul declares America's next drag superstar.\nDrag Race is a world-conquering phenomenon that has so far run for 17 seasons of the original, and numerous spin-offs. The reason is simple: it's just a huge amount of fun. What started as an enjoyably scrappy and low budget show now has real glitz and glamor, but its cheeky sense of humor remains intact, as does RuPaul's deadpan delivery.\n8. The Twilight Zone\nYear: 1959\nSeasons: 5\nThere have been many horror and sci-fi anthology shows over the years, but none have made as much of an impact as The Twilight Zone. Created and hosted by screenwriter Rod Serling, The Twilight Zone ran for five game-changing seasons and 156 episodes between 1959 and 1964, with Serling penning many of the episodes himself. Not only was the series a masterclass in how to tell one-and-done stories week-after-week, it was also remarkably consistent. The stories would move from horror to fantasy to sci-fi to comedy, but you were pretty much always guaranteed a rattling good yarn – not to mention a sting in the tale.\nMany have tried to replicate the success of the original Twilight Zone – it's been revived no less than three times, but there's no denying that Stirling's original remains the best and a true television landmark.\nOne of our writers reminisces about two of The Twilight Zone's best episodes.\n7. Key & Peele\nYear: 2012\nSeasons: 5\nBefore he rebranded himself as the master of smart, subversive and satirical horror films like Get Out and Nope, Jordan Peele was most famous for his work with Keegan-Michael Key. Together, the pair made five seasons of sketch show Key & Peele for Comedy Central, a relentlessly funny shotgun blast of absurdist ideas and social commentary.\nSumming up a sketch show is a difficult task, so instead we'll suggest you check out a few specific sketches to get a flavor of the show, all of which are available on the Comedy Central YouTube: the Gremlins 2 brainstorm from season 5, the Obama meet and greet from season 4 (the former US President has even praised Peele's impression of him), and the blisteringly funny pizza order from season 2. Key & Peele's ability to quickly create fully realized characters is unmatched, and their show is a fountain of hilarious ideas.\n6. Dexter\nYear: 2006\nSeasons: 8\nThis serial killer thriller, inspired by Jeff Lindsay's novel series, has an irresistible premise. Over eight seasons Dexter Morgan (Michael C. Hall) struggles to keep three very different parts of his life separate. To his friends and relatives he is a kind family man. At work he is a forensic technician working with the Miami Police. But by night Dexter is a serial murderer, albeit one with a very specific MO: he only kills killers.\nDexter was an immediate sensation when it launched in 2006, and for its first four seasons it was a remarkably gripping watch. Alas, its final years were less surefooted, leading to an infamously awful final episode. Happily, that was not the end for Dexter. Hall reprised the role in 2021 for Dexter: New Blood, a sequel miniseries that helped clear the original show's name, while another sequel, Dexter: Resurrection, is set to drop later this year.\n5. Twin Peaks\nYear: 1990\nSeasons: 2\nThere's a reason why Twin Peaks remains so beloved, 35 years after it changed the face of TV. Its blend of surreal murder mystery, soap opera, and extra-dimensional horror was groundbreaking, and while it inspired countless imitators, nothing quite compares to David Lynch and Mark Frost's baffling, brilliant series. Peaks brought a more mature style to US television when it first aired in 1990 and became an instant smash hit as audiences around the world longed to discover who murdered homecoming queen Laura Palmer.\nTwin Peaks lived fast and died young. Its second season started strong, but once the Palmer mystery had been resolved (against Lynch and Frost's wishes) the show floundered. Still, Lynch made sure it went out in style, giving the show one of TV's greatest endings and a cliffhanger that would pay off 25 years later in the excellent sequel, Twin Peaks: The Return.\n4. Star Trek: The Next Generation\nYear: 1987\nSeasons: 7\nChoosing the best Star Trek series is hard. The original series remains a science fiction classic, while Deep Space 9 steered the franchise into darker, more morally complex territory. But The Next Generation is our pick for a very simple reason: its impeccable, endlessly endearing cast. Patrick Stewart as the legendary Captain Jean-Luc Picard, Jonathan Frakes as charming first officer Will Riker, Michael Dorn as stout Klingon security officer Worf, Marina Sirtis's empathic councillor Deanna Troi – and on, and on.\nA Star Trek show lives and dies by its crew. And while The Next Generation's first two seasons were... uneven, the Starfleet officers of the Enterprise NCC-1701-D made it worth sticking with. That the show underwent an incredible transformation in its third year, and evolved into one of the smartest and most consistently exciting shows on TV, was the cherry on the cake. The Next Generation secured Star Trek's place in sci-fi history, and established a future for the franchise that continues to this day.\n3. Colin From Accounts\nYear: 2022\nSeasons: 2\nThis Australian comedy has grown into a huge word-of-mouth hit over the last few years. Harriet Dyer plays Ashley Molden and Patrick Brammall is \"Flash\" (real name Gordon Crapp), two singles who meet and embark on a bumpy relationship. So who is the Colin from the title? That's actually the name of a stray dog that Gordon accidentally runs over in the first episode. The two rush the dog to a vet and are faced with the tough decision of either putting him down or adopting him. They choose the latter and name him Colin \"from Accounts Payable, who's working on the big merger.\"\nColin From Accounts's secret sauce is that it mixes its edgy jokes and spiky banter with deep characterization. Both Ashley and Gordon feel like real, flawed, complicated people. And Colin? Well he's just adorable. A third season is currently in production.\n2. The Curse\nYear: 2023\nSeasons: 1\nNathan Fielder follows up the impossibly funny Nathan For You with this brilliant, if absolutely agonizing sort-of-comedy. Whitney (Fielder) and Asher Siegel (Emma Stone) are a married couple who star in a grim reality TV show about a couple who do supposedly good deeds for the people of Española, New Mexico. In truth, they are also trying to boost their own business interests, buying and flipping cheap homes for the maximum amount of money.\nUncut Gems' Benny Safdie co-created, co-wrote and also appears in the series, and some of that film's unrelenting tension is palpable here. But The Curse also feels in many ways like the natural next step of the sort of jaw-dropping mix of cringe comedy and cutting satire that Fielder excelled at in Nathan For You, here taken to new extremes. The Curse is so funny, so devastating, and so original that it feels like nothing else on TV.\n1. Twin Peaks: The Return\nYear: 2017\nSeasons: 1\nCreators David Lynch and Mark Frost stepped back into the world of their groundbreaking 1990s hit and found it a much darker, sadder, stranger place with this astonishing limited series. Set 25 years after Kyle MacLachlan's Special Agent Dale Cooper was first trapped in the Black Lodge, the series sees the FBI investigate another murder, one that has direct links back to the town of Twin Peaks. Meanwhile Coop's evil doppelganger is still at large...\nRather than giving us the coffee and cherry pie-fuelled nostalgia-fest that some fans expected, Twin Peaks: The Return feels bracingly new. The story is a novelistic tangle of plots that takes in everything from drug crime in small town America to the first detonation of the atomic bomb, by way of parallel universes, and Michael Cera doing a Marlon Brando impersonation. Co-written and entirely directed by the late, great Lynch, The Return is a singular and uncompromising work, but also one that reminds us of just how powerful, moving, terrifying, and hilarious a TV show can be.\nFor more TV streaming picks, you can read our lists of the best shows on Amazon Prime, the best shows on Disney Plus, and the best shows on Netflix.\nParamount Plus\nWhatever country you're in, it's easy to sign up to Paramount Plus, where you can enjoy a vast library of shows and movies. Just head to the website here to get signed up.\nAnd don't forget that new customers are also able to take advantage of the service's 7-day FREE trial, letting you effectively try before you buy.\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/horror-shows/alien-earth-review/",
      "text": "GamesRadar+ Verdict\nBold, ambitious, and often brutally violent – is this the best xenomorph story since James Cameron's Aliens? On the basis of the first six episodes it sure feels like it. Alien: Earth has it's flaws, but it's never less than ferociously entertaining.\nPros\n- +\nAn atmospheric and immersive return to the world of Alien\n- +\nThe cast are terrific – and sometimes terrifying\n- +\nGreat creature effects\nCons\n- -\nSome weak and misplaced humor\n- -\nThe Lost Boys are a great idea, but not always well-plotted\nWhy you can trust GamesRadar+\nThis review is spoiler-free.\nThis has been a long time coming. The show that became Alien: Earth was announced back in 2019, with Fargo and Legion showrunner Noah Hawley officially attached the following year. A lot has changed since then.\nAt the time, the xenomorph franchise felt pretty moribund, with 2017's Alien: Covenant faring poorly both critically and commercially. In the years since, however, the series (along with its sister franchise Predator) has seen a fairly remarkable renaissance. Last year's Alien: Romulus was a solid hit at the box office and was generally liked by fans, despite its tendency to wallow in unnecessary references and call-backs.\nAlien: Earth, then, arrives with both optimistic hype and not a little trepidation from fans. There's been confusion over when the show is set (2120 – two years before the Nostromo has its fateful encounter on LV-426), while a stray comment from FX Entertainment president Gina Balian about the show existing \"in parallel\" to the movies led some fans to panic and assume that this was going to be set in an alternate universe.\nWell, unless the show does something drastically bizarre in its final two episodes (critics have been provided with six of the first season's eight instalments), that's not the case at all. This is very much the world of Ridley Scott's first film, plausibly expanded and with a stronger focus on the corporate intrigue that has always hovered around the edges of these films. The result is an imperfect series, but arguably the franchise's strongest outing since James Cameron's Aliens. Seriously – at its best, it really is that good.\nDeep impact\nWeyland-Yutani ship the USCSS Maginot is returning from a 65-year-long deep space mission gathering extraterrestrial samples when something goes wrong – you can guess what, though things are more complicated in that regard than they first appear. The ship crashes to Earth, slamming straight into New Siam, a city under the control of Prodigy, the youngest of \"the Five\" – the mega corporations that now control the Earth.\nFor Boy Kavalier (Samuel Blenkin), Prodigy's 'move fast and break things' CEO, the timing is perfect. In a world where synthetics are relatively commonplace, Prodigy has developed something new. Experimenting on terminally ill children, Kavalier and his team have seemingly discovered a way to transfer a young human consciousness into an artificial adult body. This leads to some of the show's most troubling and thought-provoking sequences, though anyone concerned the show might venture into icky Poor Things territory can breathe easy, as Alien: Earth thankfully never goes there.\nThe \"Lost Boys\" – Kavalier's name for his hybrid squad, and one of the show's many Peter Pan allegories – are the ideal team to dispatch to the crash site and bring back the alien samples. The team's de facto leader, Wendy (Sydney Chandler), has her own reasons for wanting to get to the Maginot. Meanwhile, Yutani (Sandra Yi Sencindiver) wants her deadly cargo back...\nRelease date: August 12 (US), August 13 (UK)\nAvailable on: Hulu (US), Disney Plus (UK)\nShowrunner: Noah Hawley\nEpisodes reviewed: 6 of 8\nAlien: Earth's opening two episodes (both of which are available on launch day) are a masterclass in giving fans of the franchise what they want while also broadening the scope of the story. The show borrows plentifully from the \"cassette futurism\" of Ridley Scott's original movie, both in the Maginot's set – a beautiful reproduction of the interior of the Nostromo – and in the look of the wider world, but mercifully avoids the constant call-backs that littered Romulus.\nAt the same time, there are aesthetic touches that might throw some fans – for the first time in an Alien project, there are needle drops. While none of the songs here feel out of place or ill-considered, it's definitely a little strange the first time it happens. Alien has never been a TV show before, and seeing this familiar franchise morph slightly to fit into an entirely different medium can be disconcerting.\nAnother bug hunt?\nAs the show moves into its middle episodes the focus turns more fully onto the Lost Boys – and stumbles slightly. Hawley finds pleasingly different roles for each of the characters in his story, but while the cast are all strong, the series bites off more than it can chew with the notion that these are children in adult bodies.\nThat leads episode 3 to dabble briefly with humor, a tone that sits uneasily with the overwhelmingly ominous mood of the rest of the series. And while it makes sense that these characters are more naive than the adult humans, they sometimes make some frustratingly dumb decisions.\nStill, the hybrids also provide the show with much of its disquieting heart. The question of whether Prodigy really has saved the lives of five sick kids – or simply murdered them and pasted their memories into a bunch of androids – lingers uneasily over the series.\nThere's also no questioning Sydney Chandler's Wendy. It's a terrific central performance, both cooly competent and youthfully inquisitive. Wendy's tender concern for Alex Lawther's human Hermit is effective and touching, but she also has more than enough steel to believably handle the alien-battling action.\nSpeaking of which, much has been made of Alien: Earth's introduction of four new species of critter. It's a bold decision: collectively, the egg, facehugger, and xenomorph make for some of the most memorable monsters in cinema history. None of the new creatures are as potent (though the baleful glare of a contaminated sheep quickly becomes one of the show's most indelible and unnerving images), but they add a refreshing unpredictability to the show's more horrific moments.\nThe classic alien, too, is well-handled. At times it feels more brutal and bestial than we've seen since Alien 3, at others more weirdly graceful. It's a more enigmatic presence here than the man-sized bugs of Aliens, though no less dangerous.\nBut while Alien: Earth doesn't skimp on the monsters and gore, it's the human – and android – horror that lingers the most. Babou Ceesay's Morrow is the show's most intriguing and terrifying character, and a dangerous mystery who only fully comes into focus in the more-or-less self-contained fifth episode.\nSamuel Blenkin's Kavalier, meanwhile, represents a different kind of villainy. Backed up by Adrian Edmondson's officious Atom Eins, they deliver on the banal corporate cruelty previously represented by Paul Reiser's Carter Burke in Aliens, and hinted at in Romulus's opening scenes in the run-down colony on Jackson's Star. This is a world where being fired is as good as a death sentence, and a work contract (or an off-world mission) is a life-changing and family-wrecking event.\nThe perfect organism?\nAs we noted up top, critics have not been sent the season's final two episodes just yet. Because of that and a few slightly misjudged moments along the way, we can't say that Alien: Earth is an unqualified success. Still, from what we've seen so far, this is ferociously good television: ambitious, exciting, and beautifully realized. It's tangibly the same franchise, but it also feels fresh and new.\nPart 6 ends with a lot up in the air – too much, perhaps, to fully wrap up in just two more episodes. Noah Hawley has indicated that he envisions the series as a multi-season affair, but as yet it's unclear if that means each year will be a standalone tale or if this is an ongoing story. On the basis of these first six episodes, we have to assume the latter.\nWhat Hawley and his team have done here, however, is build on the foundations of Ridley Scott's original to create a believable and fascinating universe, one that's ripe with the opportunity for further exploration. There's nothing here so far that explicitly contradicts the later films, or Scott's divisive prequels, but Alien: Earth successfully restores a sense of mystery to this universe while also delivering some fantastic action sequences, lashings of gore, and compelling characters. If not quite a perfect organism, the alien's latest evolution is still a monstrous success.\nAlien: Earth is streaming on Hulu in the US from August 12, and on Disney Plus in the UK from August 13.\nFor more, check out our look ahead at the most exciting upcoming TV shows.\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/fantasy-shows/wednesday-season-3-has-been-ordered-at-netflix-and-a-top-secret-spinoff-series-is-in-early-talks-theres-a-lot-to-explore-in-the-addams-family/",
      "text": "Wednesday season 3 has been ordered at Netflix, and a \"top secret\" spinoff series is in early talks: \"There’s a lot to explore in the Addams Family\"\nWednesday season 2 premieres in August\nWednesday has been renewed for a third season just weeks before season 2 is set to arrive on Netflix – and a spinoff about another member of the Addams Family might very well be on the way.\nAccording to The Hollywood Reporter, showrunners Alfred Gough and Miles Millar plan to continue the series for as long as Wednesday (Jenna Ortega) is to complete her schooling at Nevermore Academy – which is apparently around seven years...so we could be looking at a hopeful seven seasons (though Netflix is notorious for giving some of its shows the axe prematurely, Wednesday's enormous success might be the exception to the rule).\nThe team behind Wednesday is also exploring options for a spin-off series, with Millar commenting, \"It’s something we’re definitely noodling; there are other characters we can look at.\" Netflix CCO Bela Bajaria added to this, stating, \"There's a lot to explore in the Addams Family.\" The THR report describes the details as \"top secret.\"\nWednesday debuted in November of 2022 and immediately broke records, becoming the second most-watched English-language series on the streamer. Created by Gough Miles Millar and executive produced by Tim Burton, the series received two Golden Globe nominations including Best Television Series - Musical or Comedy and Best Actress – Television Series Musical or Comedy for Ortega. Not to mention the Wednesday dance (choreographed by Ortega herself) went massively globally viral, solidifying the show's status as one of Netflix's biggest-ever hits.\nWednesday season 2 is releasing in two parts, with part one set to hit Netflix on August 6 and part two set to arrive on September 3. For more, check out our list of the best Netflix shows to add to your streaming queue right now.\nLauren Milici is a Senior Entertainment Writer for GamesRadar+ based in New York City. She previously reported on breaking news for The Independent's Indy100 and created TV and film listicles for Ranker. Her work has been published in Fandom, Nerdist, Paste Magazine, Vulture, PopSugar, Fangoria, and more.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-august-11/",
      "text": "The best new shows and movies streaming this week on Netflix, Prime Video, HBO Max, and more\nCheck out our guide to the best movies and shows streaming this week, August 11–17\nWelcome back to our weekly guide to the best new shows and movies! On this page, we've put together a list of six fantastic shows and movies that make a perfect package of must-see entertainment.\nOne of the year's most anticipated new shows lands this week in the terrifying form of sci-fi horror Alien: Earth. But if facehuggers and chest-bursters aren't your thing, there are still plenty of other great shows and films to watch across all the best streaming services. Some of the other things we've picked out this time around include a heart-warming fantasy movie, an exciting new spy show, and the return of time-travelling romantasy Outlander.\nSo if you're ready for a great night in, it's time to get browsing. And when you've done here, why now check out our list of the best shows on Paramount Plus for more streaming inspiration.\nAlien: Earth\nAvailable: US/UK\nWhere to watch: Hulu (US), Disney Plus (UK)\nAn Alien TV show has been teased for years, and finally arrives this week on Hulu and Disney Plus. Happily, Alien: Earth is good – really good, in fact. Set a couple of years before Ridley Scott's first film, Alien: Earth follows a group of hybrids – dying children whose minds have been transferred into synthetic adult bodies – as they are despatched to investigate a crashed spaceship in Prodigy City. They find monsters – and not just the classic xenomorph...\nSydney Chandler leads a strong cast in this eight episode horror adventure. Alien: Earth has all the body horror and gore you'd expect from this franchise, but there's also a stronger focus on the war between the mega-corporations that rule the world of Alien, as well as some philosophical elements plucked from Scott's other great science fiction film, Blade Runner. Dark and dangerous, but also fun and exciting, Alien: Earth is one of the year's best new shows.\nWill the show make you scream with delight? Find out with our Alien: Earth review.\nButterfly\nAvailable: UK/US\nWhere to watch: Amazon Prime Video\nAnother week, another streaming spy thriller. Butterfly immediately caught our eye, however, for giving a well-deserved leading role to Lost's Daniel Dae Kim. He plays David Jung, a retired intelligence agent who returns to South Korea to try and connect with his daughter Rebecca (Reina Hardesty). It's not an easy reunion, however. Rebecca has spent years operating under the belief that her father was dead and, in the meantime, has become an assassin for CADDIS – the private outfit that David previously set up with his former partner, Juno (Piper Perabo).\nBased on Arash Amel's graphic novel of the same name, Butterfly mixes bullets and explosions with a heartfelt relationship drama. It's a cliche to say that an action drama is all about family, but this one really is. Still, when it comes time to deliver some propulsive thrills and explosive action, Butterfly does not disappoint.\nCheck out our guide to the best Amazon Prime Video shows.\nThe Monkey\nAvailable: US\nWhere to watch: Hulu\n\"Everybody dies. And that's f**ked up.\" That's the tagline for Longlegs director Osgood Perkins' latest horror spectacular. The Monkey (based on Stephen King's short story of the same name) lives up to that fatalistic promise, offering as grand a smorgasbord of grimly hilarious death and destruction as any Final Destination movie. It follows an estranged father, Hal, played by Theo James, and son Petey (Colin O'Brien) as they try to resolve their differences, while also surviving their connection to a cursed toy monkey.\nThe Monkey is grimly hilarious – both brutal and slapstick in its violence. Despite the nihilistic themes that run through the film. However, it's also a fun and refreshing antidote to the trauma-wallowing of some recent horror films. Recommended for those with a strong stomach.\nFind out what our critic thought of the movie with our Monkey review.\nNight Always Comes\nAvailable: US/UK\nWhere to watch: Netflix\nFantastic Four's Vanessa Kirby stars in this gripping crime thriller based on Willy Vlautin's novel of the same name. Set in Portland, Night Always Comes follows Lynette, a woman who is struggling to make ends meet while working multiple jobs and also looking after her brother Kenny (Zack Gottsagen). When her plan to finally buy a home goes wrong, however, she puts everything on the line in order to try and save it.\nDirected by Benjamin Caron, who previously helmed several standout episodes of Andor's first season, Night Always Comes takes place over one intense and stressful evening. Joining Kirby in the cast are Eli Roth and Uncut Gems' Julia Fox. Will this be as fist-gnawingly stressful as that movie? Quite possibly...\nFind something great to watch with our list of the best Netflix movies.\nThe Legend of Ochi\nAvailable: US/UK\nWhere to watch: HBO Max\nOne of the year's most charming movies arrives on HBO Max this week. The Legend of Ochi opens on the isolated island of Carpathia and follows Yuri (Helena Zengel), a young farm girl who has grown up being told that she must never go outside after dark because of fearsome creatures called Ochi. One day, however, she discovers an injured baby Ochi. This sets her on a perilous journey to reunite it with its family.\nWritten and directed by Isaiah Saxon, this gorgeous fantasy adventure uses puppetry and a host of other practical special effects to realise its story. Willem Dafoe, Emily Watson, and Finn Wolfhard are the big names in the cast, but the heart of the story really belongs to Zengel's Yuri and her cute little Ochi friend.\nFind out what else is on the streamer with our guide to the best HBO Max movies.\nOutlander season 7, part 1\nAvailable: US/UK\nWhere to watch: Netflix\nThe seventh season of this surprisingly enduring historical romance lands on Netflix today, just as a prequel series – Outlander: Blood of My Blood also comes to Starz in the US. For those who haven't seen the show, which is based on the series of books by Diana Gabaldon, Outlander is about Claire Randall (Caitriona Balfe), a married nurse from 1945 who finds herself transported back in time to the 1700s where she meets Jamie, a handsome Highland warrior, played by Sam Heughan.\nOutlander launched all the way back in 2014 and has rambled on since then – always a bit daft, but also always compelling thanks to the dynamic between Balfe and Heughan and the show's capacity for wild plot twists. Hardcore fans will likely have already seen this season on Starz. For everyone else, here's your chance to get caught up before the eighth and final season in 2026.\nLooking for something else to watch? Check out our list of the best movies on Disney Plus.\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/streaming-services/new-shows-movies-to-stream-august-25/",
      "text": "The best new shows and movies streaming this week on Netflix, Prime Video, Hulu, and more\nCheck out our guide to the best movies and shows streaming this week, August 25–31\nWelcome back to our weekly guide to the best new shows and movies! This page is the place for you if you're looking for some top streaming inspiration. Here we've gathered together six shows and films from across all the best streaming services.\nThe Thursday Murder Club heads up our picks this week – a fun and lively slice of cosy crime that's ideal for these late summer evenings. There's also the long-awaited follow-up to the Chris Pratt-starring thriller The Terminal List on Amazon Prime Video, plus a new episode of one of the best new shows on TV right now – that's Alien: Earth, in case you were wondering–and a twisty new Spanish-language mystery series.\nSo if you're looking forward to spending a great night in front of the TV, check out our list below. And when you're done here, why not check out our list of the best shows on Paramount Plus for more streaming inspiration?\nThe Thursday Murder Club\nAvailable: US/UK\nWhere to watch: Netflix\nRichard Osman's bestselling cosy crime series is brought to the screen via Netflix. Directed by Christopher Columbus, who previously helmed the first two Harry Potter movies, The Thursday Murder Club follows a group of elderly detectives living in a retirement home who band together to solve a brutal slaying. The leads – played by four acting titans in Helen Mirren, Pierce Brosnan, Ben Kingsley, and Celia Imrie – come from a diverse range of backgrounds. While Imrie's Joyce Meadowcroft is a retired nurse, Mirren's Elizabeth Best used to be a spy!\nIt's all very silly, but The Thursday Murder Club seems precision designed to be a comfort watching classic: witty, warm – and basically a Sunday teatime TV crime drama writ large and with a killer cast.\nThese are the best Netflix movies to watch right now.\nThe Terminal List: Dark Wolf\nAvailable: UK/US\nWhere to watch: Amazon Prime Video\nWhile the sequel to the original Terminal List is still a little way off, the prequel starts this week. Dark Wolf brings back both Taylor Kitsch as ex-Navy SEAL turned CIA operative Ben Edwards and Chris Pratt as tough SEAL James Reece. Fans of the original will know that the first season hid a pretty big twist, the ramifications of which will be explored here.\nAlthough The Terminal List was adapted from novelist Jack Carr's books, this is an all-new story. Fans shouldn't worry too much, though – Carr remains a producer and writer on the series. And while prequels have a bit of a patchy track record, this looks like essential viewing for fans – and may even contain a few hints as to the future of the franchise.\nRead our list of the best Amazon Prime shows for more recommendations.\nThe Friend\nAvailable: US\nWhere to watch: Paramount Plus\nBill Murray and Naomi Watts star in this moving drama. Based on the bestselling novel of the same name by Sigrid Nunez, The Friend follows Iris (Watts), a woman who unexpectedly inherits a dog – an enormous Great Dane named Apollo – from her best friend Walter (Murray), following his death. As she comes to terms with Walter's passing and the struggles of her everyday life (including facing eviction from her New York apartment), she begins to form an unexpected bond with Apollo that might just help her through a dark time.\nWitty and warm, The Friend was well-received on its brief initial release last year. Now finding a proper home at Paramount Plus, this is a sad, but good-natured look at grief, the legacies that people leave behind, and the relationship between one woman and a very troublesome dog.\nTwo Graves\nAvailable: US/UK\nWhere to watch: Netflix\nIt's a new week and that means another new show about a mysterious disappearance in a coastal town! Two Graves follows Isabel (Kiti Mánver), the grandmother of one of two girls who have vanished. After two years of waiting for the police to solve the mystery, however, Isabel decides to take the law into her own hands in order to discover what truly happened to the girls.\n\"Two Graves is a revenge story led by a character rarely seen at the heart of fiction... a grandmother willing to do whatever it takes to seek justice for the loss of her granddaughter,\" creator Agustín Martínez told Netflix. The Spanish-language drama looks tense and gripping. All three episodes are available to watch on Netflix from August 29.\nDiscover the brilliant series that make up our list of the best Netflix shows.\nSisu\nAvailable: US/UK\nWhere to watch: Hulu\nThis Nazi-hunting revenge thriller has rapidly become a modern cult classic. Jorma Tommila stars as Aatami Korpi, a prospector in Lapland with a traumatic past. Things start to look up for Korpi when he strikes gold – but then he's intercepted by a platoon of Waffen-SS. The Nazis try to rob him, but quickly discover that they've bitten off a lot more than they can chew...\nSisu is preposterously violent, in a slightly cartoonish way. Korpi is not immortal, but simply \"refuses to die\" as one character puts it. The same can't be said for the hordes of baddies he encounters. If you're in the mood for something action-packed with a pitch black sense of humor, this is one to watch when it drops on Hulu on August 29. A sequel titled Sisu: Road to Revenge is incoming later this year.\nOur list of the best Hulu movies contains some more action classics.\nAlien: Earth\nAvailable: US/UK\nWhere to watch: Hulu / Disney Plus\nThe sci-fi horror series reaches its halfway point. Last week's episode took some time out from the action to help us get to know the \"Lost Boys\" – a group of children whose minds have been implanted into synthetic bodies. While Wendy (a phenomenal Sydney Chandler) has been reunited with her brother Joe (Alex Lawther), the rest of the group are starting to come apart at the seams. Meanwhile, the threat of the recovered aliens grows even stronger.\nAfter a relentlessly-paced first two episodes, last week's instalment and this one are really about turning the screws on the characters. Expect more hints about Wendy's apparent connection to the Xenomorphs and further developments in the plot surrounding Slightly (Adarsh Gourav) and Morrow (Babou Ceesay). Alien: Earth remains a tense, well-acted, and beautifully made nightmare.\nFind out more about this terrifying show with our Alien: Earth review.\nLooking for something else to watch? Check out our list of the best movies on Disney Plus.\nWill Salmon is the Streaming Editor for GamesRadar+. He has been writing about film, TV, comics, and music for more than 15 years, which is quite a long time if you stop and think about it. At Future he launched the scary movie magazine Horrorville, relaunched Comic Heroes, and has written for every issue of SFX magazine for well over a decade. His music writing has appeared in The Quietus, MOJO, Electronic Sound, Clash, and loads of other places too.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.gamesradar.com/entertainment/best-netflix-movies/",
      "text": "The 25 best movies on Netflix to watch this week\nFrom Havoc to They Cloned Tyrone, here are 25 of the best Netflix movies to watch in September 2025\nIt's a new week and we're once again updating our list of the best Netflix movies! On this page you'll find 25 of the finest films that are available to watch right now on the streamer.\nNetflix is easily one of the best streaming services out there, with an intimidatingly huge back catalog. Because of that we've split the list into five genres for easy browsing. Kicking off with action, we have thrillers like Rebel Ridge and Havoc. Next up is animation, with gems like Suzume. Fantasy brings us some real big hitters like Troll and My Neighbor Totoro, and is followed by sci-fi classics like Godzilla Minus One and Okja. Finally, horror will leave you quaking in fear with films like Creep.\nBut first on the list is our pick of the week – this time around it's the brilliant Tom Cruise sci-fi film Edge of Tomorrow. So, if you're ready to find something to watch, dive into our list. And when you've finished here, check out our list of the 25 best Netflix shows, as well as our weekly guide to the best shows and movies.\nPick of the week\nEdge of Tomorrow\nYear: 2014\nDirector(s): Doug Liman\nAvailable on: US/UK\nThis ace sci-fi action film from The Bourne Identity director Doug Liman was rather ignored on its release in 2014. That's a shame, because it's has a satisfying and fun central premise. Tom Cruise plays Major William Cage – in truth a cowardly PR officer with little actual combat experience. When he angers the wrong General, he is punished by being sent to the front lines, which is effectively a death sentence. And die he does, very quickly. But then he wakes up and lives through the day again. And again.\nYes, this is basically Starship Troopers meets Groundhog Day, with Cage forced to fight his way through hordes of aliens. It's quite a video gamey premise, with Cage having to remember where certain monsters will appear, but it works. It's a lot of fun seeing Cruise play against type, and Emily Blunt is a strong co-lead.\nAction\nBullet Train Explosion\nYear: 2025\nDirector(s): Shinji Higuchi\nAvailable on: US/UK\nThis Japanese action thriller is a real nail-biter. It's a standalone sequel to director Junya Sato's 1975's classic The Bullet Train (sadly not currently available on Netflix), but don't worry if you've not seen that one, as Bullet Train Explosion has an irresistible premise that needs little explanation. Basically, an anonymous terrorist has planted a bomb on a high-speed train and if it drops beneath 100 km/h then it will explode.\nBringing all the latest movie news, features, and reviews to your inbox\nSounds a bit like Speed, huh? But as we say, The Bullet Train got there first. This new movie amps up the action, while maintaining the smarts. While an influencer on board complicates matters, the police and rail staff work together to try and find a way to get rid of the bomb before the train hits Tokyo Station. Gripping stuff.\nHavoc\nYear: 2025\nDirector(s): Gareth Evans\nAvailable on: US/UK\nThe Raid director Gareth Evans returns with this long-in-development Netflix Originals action movie starring Tom Hardy, Forest Whitaker, and Timothy Olyphant. Havoc was originally filmed in 2021, but has lingered in various stages of development hell for the last few years due to scheduling issues, reshoots, and strikes. Well, the film is finally complete and available for our viewing pleasure on Netflix this Friday – and the good news is that the early reviews for the film have been overwhelmingly positive.\nIn Havoc, Hardy plays Walker – a tough detective who must battle the criminal underworld in order to rescue a politician's son. Cue a ton of bullets, bloodshed, and hyper-kinetic violence. You can always rely on Hardy to bring the charisma and action is Evans speciality. If the reviews are anything to go by, then fans of The Raid's inventive violence will be more than satisfied by this brutal, unflinching neo-noir thriller.\nRebel Ridge\nYear: 2024\nDirector(s): Jeremy Saulnier\nAvailable on: US/UK\nWhen Terry (Aaron Pierre), a Marine Corps veteran, is harassed by the police and has the bail money he was saving for his cousin seized, he goes on a one-man mission to get justice. As the cops play dirty, Terry uses his very special skill set to exact his revenge and uncover corruption in small-town Louisiana.\nRebel Ridge wastes no time in creating a palpable tension, and writer-director Jeremy Saulnier ensures that the atmosphere is maintained for the full runtime. With a tight script, killer performance from Aaron Pierre, and scintillating set-pieces, this Netflix Original is not your typical action-thriller. In fact, it may also just be one of the best action movies ever made by a streaming service, so be sure to check it out.\nRRR\nYear: 2022\nDirector(s): S. S. Rajamouli\nAvailable on: US/UK\nThere's a reason RRR has been called one of the greatest action movies of all time. First released in cinemas, RRR has found a new life on Netflix, with Western audiences discovering this Indian epic. Directed by S. S. Rajamouli, the Telugu-language movie takes place in the 1920s and centers on two revolutionaries, Alluri Sitarama Raju (Ram Charan) and Komaram Bheem (N. T. Rama Rao Jr.), in their explosive challenge of the British Raj.\nIt's lengthy at 182 minutes, but RRR doesn't waste a second, cramming in everything from fiery bow and arrow battles and motorcycle chases to men fighting alongside bloodied tigers. If none of that tickles your fancy, firstly, what more do you want? Secondly, fear not, it also features a romantic subplot, a sweet bromance, and a couple of musical numbers, too. All of which culminates in making this one of the best Netflix movies you can watch right now.\nAnimation\nThe Mitchells vs the Machines\nYear: 2021\nDirector(s): Michael Rianda\nAvailable on: US/UK\nA family road trip goes terribly wrong when the titular family gets caught up in an AI uprising. Evil robots begin capturing humans with the intention of launching them into space as revenge for the treatment of the original PAL virtual assistant by tech entrepreneur Mark Bowman. But, in this disaster, the Mitchells learn to put aside their differences and realize just how much they care for one another, no matter how often they might argue.\nThe Mitchells vs the Machines is not only a vibrant and very funny animated movie; it’s got a surprisingly emotional core to the story that’ll make you want to hug your family straight after the credits roll. The voice cast does a phenomenal job of breathing life into the characters, and the animation style itself — the Lord and Miller involvement is clear to see — is delightfully playful.\nFancy more animation in your life? Jump into our The Mitchells vs the Machines review for more colorful fun.\nGrave of the Fireflies\nYear: 1988\nDirector(s): Isao Takahata\nAvailable on: US/UK\nAre you ready to experience some of the best anime on Netflix? Well, then, this entry will be right up your street. In Japan, devastated by World War 2, two orphaned siblings, Seita and his sister Setsuko, traverse the land looking for a means to survive. As supplies dwindle and their health deteriorates, the young pair can only find comfort in one another amid the spiritual journey they undertake.\nGrave of the Fireflies is one of those rare but beautiful films that you might only watch once; such is the emotional toll it carries. As with all Studio Ghibli movies, this is a true work of art visually, with some of the most gorgeous yet heartbreaking frames you're likely to find in animation. Just don't go into this expecting the cute, playful side of Ghibli, because you will find yourself broken by the end of the story.\nFor more on the masterpiece, read our five-star Grave Of The Fireflies review.\nWallace and Gromit: Vengeance Most Fowl\nYear: 2024\nDirector(s): Nick Park and Merlin Crossingham\nAvailable on: US/UK\nThe beloved animated Claymation duo are back. Wallace & Gromit: Vengeance Most Fowl is now available on Netflix. This is their sixth film outing on screen and second feature-length film, and has already been lauded as one of their best.\nThe premise sees Feathers McGraw return from The Wrong Trousers with revenge on his mind. His approach? Using Wallace's new robotic garden gnome invention against them. Reviews are really strong for the animated outing, which even landed Aardman an Oscar nomination as well.\nSuzume\nYear: 2022\nDirector(s): Makoto Shinkai\nAvailable on: US/UK\nPart-romantic time travel, part-fantasy disaster movie, Suzume follows the eponymous teenager as she explores a mystical multiverse via magical doors that act as portals to other sections of her timeline and beyond. She teams up with Souta, a mysterious man charged with closing these portals and preventing another supernatural catastrophe that would destroy Tokyo. What follows is a story that confronts loneliness, gives us romance, and takes us on an unforgettable adventure that may very well bring you to tears as well.\nSuzume is, quite simply, one of the most astounding animated movies of the 2020s. Not only does it perfectly blend a multitude of different genres, it does it all while looking absolutely incredible. The story is so rich and full of heart, and the whole thing is epic in scale while retaining the essence of a human drama.\nCheck out our Suzume review for more on this anime movie.\nLost in Starlight\nYear: 2025\nDirector(s): Han Ji-won\nAvailable on: US/UK\nParasite director Bong Joon Ho described this movie as a \"visual masterpiece\", and it's easy to see why. A beautiful new anime movie that feels like the spiritual successor to Your Name, Lost in Starlight is one of those gems that too often goes unnoticed on Netflix, and it shouldn't.\nThis Korean sci-fi romance film, now available to stream on Netflix, is set in Seoul in 2050, and follows astronaut Nan-young (Kim Tae-ri) as she falls in love with a musician named Jay (Hong Kyung). As Nan-young's new space mission takes her to Mars, the lovebirds have to deal with their separation, while the perils of deep space become an obstacle for Nan-young's return to Earth.\nFantasy\nNimona\nYear: 2023\nDirector(s): Troy Quane, Nick Bruno\nAvailable on: US/UK\nOne of the newer entries on our list, Nimona, is a 2023 gem that people don't put in the spotlight enough. Well, we're here to change that; this Netflix movie is wholly worth your time and attention. Wrongfully accused of killing Queen Valerin, Ballister Boldheart becomes a fugitive and must gather evidence to prove his innocence, win back the trust of his boyfriend, Ambrosius Goldenloin, and unite the kingdom. And, like it or not, he’s going to have the help of the titular monster, who has mischievous yet rather powerful abilities.\nIt's hard to put a finger on exactly what it is, but Nimona just feels different to most of the movies being produced lately, and that’s a very good thing. Vibrant animation, a smart and stirring story, and magnificent worldbuilding combine to make Nimona one of the most dynamic and intriguing fantasy movies on Netflix. It's also a great pick to watch with the whole family, so if you are looking for the best Netflix movies for kids come your movie night, this one is for you.\nTroll\nYear: 2022\nDirector(s): Roar Uthaug\nAvailable on: US/UK\nNorwegian monster movie Troll became a surprise hit when it was first released in 2022, creeping up to become one of Netflix's most-watched movies ever. Helmed by Tomb Raider director Roar Uthaug, it follows an unlikely group who are pulled together to stop an ancient troll who has awakened in a Norwegian mountain.\nWith a rich mythology behind it, as well as exciting action sequences and strong performances, Troll is well worth adding to your watchlist. And good news if you like it too, as a sequel is already in development.\nThe Old Guard\nYear: 2020\nDirector(s): Gina Prince-Bythewood\nAvailable on: US/UK\nBased on the comic book of the same name, The Old Guard is a fresh take on the superhero subgenre, which sees a band of warriors with regenerative healing abilities working as mercenaries. While they take on jobs to help people, unfortunately, their latest mission will set them on a path to deception, experimentation, and great conflict.\nThe Old Guard is another hit from one of the most exciting action directors working today, Gina Prince-Bythewood. Once again, the set pieces in this film are out of this world, with jaw-dropping hand-to-hand combat that would make John Wick proud. Charlize Theron is always of great value, too, and she puts her heart and soul into making Andy an exceptionally cool, captivating lead character. It isn't a perfect film by any means, but it is a wildly entertaining one to add to your Netflix watchlist.\nWant to see Charlize Theron in action? Read our The Old Guard review.\nMy Neighbor Totoro\nYear: 1988\nDirector(s): Hayao Miyazaki\nAvailable on: US/UK\nEarlier in this list we recommended Grave of the Fireflies – a fantastic film, but also an utterly heartrending one. My Neighbor Totoro also hails from anime legends Studio Ghibli, but has a very different tone. Directed by the great Hayao Miyazaki, the film follows Satsuki and Mei, two young girls living in post-war Japan who move into an old house filled with cute spirits. They lead Mei into an adventure with a friendly and loveable nature spirit she dubs \"Totoro\".\nMy Neighbor Totoro is a warm hug of a film, but that doesn't mean it's lacking in depth. Mei and Satsuki's mother, Yasuko, is slowly recovering from a long-term illness and the shadow of mortality hangs over the movie. Overall, though, this is a film about mythology and nature in all its weird and wild forms.\nGuillermo del Toro's Pinocchio\nYear: 2022\nDirector(s): Guillermo del Toro\nAvailable on: US/UK\nWe all know the story of Pinocchio, the wooden toy who longed to be a real boy, but Guillermo del Toro's take embraces the darker elements of the story (obviously). Set against the backdrop of fascist Italy, drawing on themes of depression and grief, and utilizing mind-boggling stop-motion animation techniques, this version of Pinocchio is far from the Disney classic.\nBut, that's a good thing. Del Toro has never been afraid to share his passion for the power of animation, and this is the perfect showcase of just how diverse and potent the medium can be. Not only does GDT's Pinocchio look fantastic, but it's also incredibly mature and impactful, while retaining some of the more fun and fantastical elements of the original story. It's hard to top one of the best Disney movies of all time. However, this Netflix fantasy manages to exceed our expectations with each watch-through.\nSci-fi\nLeave the World Behind\nYear: 2023\nDirector(s): Sam Esmail\nAvailable on: US/UK\nThis apocalyptic thriller from Mr. Robot creator Sam Esmail (based on Rumaan Alam's novel) shows the end of civilization happening in terrifying slow motion. Julia Roberts and Ethan Hawke are Amanda and Clay, a wealthy couple who are disturbed when their holiday rental vacation is interrupted first by a crashing cargo ship, then by the arrival of Mahershala Ali's GH and his daughter Ruth (Myha’la Herrold). Distrust grows between the families, but soon they are forced to reckon with much bigger problems...\nBoth a psychological thriller and a bleak piece of very near future sci-fi, Leave the World Behind is worryingly plausible in its depiction of how a chain of seemingly disparate events can lead to disaster. Fun fact: The film was executive produced by former U.S. President Barack and First Lady Michelle Obama, with the former giving Sam Esmail notes on the story while the film was in development.\nCheck out our full review of Leave the World Behind from 2023.\nOkja\nYear: 2017\nDirector(s): Bong Joon-ho\nAvailable on: US/UK\nWhen you go into a Bong Joon-ho picture, you know you're probably going to get dark humor, bloody violence, and some mega twists and turns along the way. Okja is a little different, though. This is a story about Mija, who has a special bond with her pet super pig, Okja, an animal specially bred using genetic mutations with the intention of ending world hunger. The problem is, that Mija doesn't want her beloved companion to become somebody’s next meal.\nFirst of all, Okja is precious, and she should be protected at all costs (think sci-fi Moo Deng). But cute, super pig aside, this is by far Bong’s most tender tale to date, and if you don't shed even a little tear watching this, you're a monster. Come for the cute pig, stay for Jake Gyllenhaal's wacky turn as the eccentric zoologist, Dr. Johnny Wilcox. Trust us, this is easily one of the best sci-fi movies on Netflix right now.\nGodzilla Minus One\nYear: 2023\nDirector(s): Takashi Yamazaki\nAvailable on: US/UK\nThis fresh take on the Godzilla story (aka one of the best monster movies ever made) sends us to war-torn Japan as the country reels from the fallout of World War 2, but the people of Tokyo are about to face a new level of destruction in the form of the titular kaiju. It is up to pilot Kōichi Shikishima to lead the charge against the monster, while he grapples with survivor's guilt and a difficult romantic arrangement.\nGodzilla Minus One somehow manages to feel huge in scale, while managing to capture the most intricate, nuanced, and meaningful aspects of the human experience within a frenetic disaster movie. It looks phenomenal, especially the all-important design of the iconic monster; the musical score is off the Richter scale, and it's paced with precision to keep you on the edge of your seat throughout.\nTake a bite out of our Godzilla Minus One review for more on this monster movie.\nThey Cloned Tyrone\nYear: 2023\nDirector(s): Juel Taylor\nAvailable on: US/UK\nOne night, Fontaine (John Boyega) is shot dead in a drug-related gang conflict. The next day, he's seemingly back from the dead, with no memory of the previous night. Together with one of his customers, Slick, (Jamie Foxx), and Yo-Yo (Teyonah Parris), a sex worker-client of Slick’s, Fontaine begins to uncover a conspiracy that will change his life forever.\nThey Cloned Tyrone brings out the best of all three of its lead actors, with Foxx delivering one of his funniest performances to date, Boyega going back to Attack the Block vibes, and Parris proving she is far more interesting in quirky genre movies than she is as a superhero. This Netflix Original feels like a modern tale from The Twilight Zone. It's Lovecraftian, almost, but with far more humor. They Cloned Tyrone is one of the most creative pickings that Netflix has to offer at the moment, so it's a must-watch!\nDive into our They Cloned Tyrone review for more details.\nSpaceman\nYear: 2024\nDirector(s): Johan Renck\nAvailable on: US/UK\nOK, fair warning before you even consider watching this entry: if you're afraid of spiders (even if they are from space and voiced by Paul Dano), this isn’t a film for you. If you can stomach friendly arachnids, though, you're in for a treat because Spaceman is one of the best Netflix originals to come out of 2024. Based on the novel Spaceman of Bohemia by Jaroslav Kalfař, the movie gives us a sci-fi romp laced with highly relatable themes around loneliness and human relationships.\nThe plot follows the Czech cosmonaut Jakub Procházka (played by Adam Sandler), who is six months into a mission to investigate a mysterious cloud on Jupiter called Chopra. However, when he starts missing his family and his marriage becomes strained, his sci-fi tasks become tangled with his own internal issues. Spaceman's plot isn't perfect but it's heartfelt and very much worthy of your time this month.\nCheck out our Spaceman review for more information.\nHorror\nUs\nYear: 1975\nDirector(s): Steven Spielberg\nAvailable on: US/UK\nSteven Spielberg's iconic big shark movie celebrated its 50th birthday recently. Jaws was arguably the first blockbuster and changed the face of cinema forever, inspiring legions of copycats and making a star of its director. It's easy to see why: the tale of a Great White shark terrorizing the seaside town of Amity Island is remarkably tense and suspenseful.\nRoy Scheider plays police chief Martin Brody, tasked with finding a way to stop a shark (nicknamed \"Bruce\" by the film's crew) from chowing down on Amity's residents. To do so he teams up with Richard Dreyfuss's oceanographer Matt Hooper, and the grizzled shark hunter Quint (an unforgettable Robert Shaw). The rest is movie history. Jaws was so successful it led to three sequels of varying quality. Really though, this is a case where you can just stick to the original.\nCreep\nYear: 2014\nDirector(s): Patrick Brice\nAvailable on: US/UK\nPatrick Brice's low budget found footage thriller remains one of the best examples of the subgenre – a tense, funny, and deeply unsettling character study. Broke filmmaker Aaron (Patrick Brice) accepts an unusual gig: shooting a video diary for Josef (Mark Duplass) – a terminally ill man who initially says that he wants to leave a record of his life for his unborn son. Aaron starts to suspect that Josef may not be being entirely honest with him, but he doesn't realise quite how dangerous his new \"friend\" really is...\nIn \"Josef\" – it's never clear if that really is his name, or just another lie – Duplass embodies one of the great horror villains of recent years. It's an incredible, unpredictable performance that oscillates between all-consuming loneliness, jovial good humor, and barely-controlled psychosis. The sequel, Creep 2, is also worth a look and available on Netflix.\nUnder the Shadow\nYear: 2016\nDirector(s): Babak Anvari\nAvailable on: US/UK\nIf one parent-child traumatic horror movie wasn't enough for you, we've got another recommendation here, and this time, it comes all the way from Iran, as acclaimed filmmaker Babak Anvari takes us back to '80s war-torn Tehran. There, medical student Shideh and her daughter Dorsa are plagued by an unwelcome and unsettling presence in their home.\nCombining the terrors of war in the Middle East with a supernatural possession story is harrowing but a masterful move by Anvari. The technical elements of this unsettling horror are of the highest order, but it is in the sound design that Under the Shadow flourishes. At less than 90 minutes, there's no excuse not to give this one a go… unless you're scared, that is?\nCalibre\nYear: 2018\nDirector(s): Matt Palmer\nAvailable on: UK/US\nStraddling the line between horror and psychological thriller, Calibre stars Slow Horse actor Jack Lowden as Vaughn. He joins his friend Marcus (Martin McCann) on a weekend hunting trip to the Scottish Highlands. However, the pair soon find themselves caught up in a traumatic event.\nNo spoilers here, but it's a gut-wrenching premise. The movie is rated with a perfect score on Rotten Tomatoes with many praising it for its tense atmosphere and impressive performances.\nHis House\nYear: 2020\nDirector(s): Remi Weekes\nAvailable on: US/UK\nHorror movies are brilliant vehicles for tackling some of society’s biggest talking points, and His House wonderfully and creepily hones in on the experiences of refugees in Britain and the way they are treated by the communities they enter. Bol and Rial flee war-torn South Sudan to take asylum in a dingy London flat, but while this new home should be a safe haven, it becomes a terrifying symbol of everything they have left behind.\nAs far as directorial debuts go, His House is certainly one of the most assured and unique of the 2020s. Remi Weekes imbues his film with the promise of life and the threat of death at every turn, creating a surrealist atmosphere that really will get under your skin. Stars Wunmi Mosaku and Sope Dirisu are fascinating to watch and are frighteningly convincing, too.\nFor more streaming picks, you can read our lists of the best movies on Amazon Prime, the best movies on Disney Plus right now, and the very best HBO Max movies streaming.\nJakob is a freelance journalist with a decade’s worth of experience in the entertainment sector. He founded the award-winning independent outlet JumpCut Online, before joining the staff at The Digital Fix, and later, Dexerto. He has also written for PCGamesN, GiveMeSport, and The Spurs Web. When it comes to films, Jakob loves Star Wars, superheroes, and dark, psychological thrillers.\n- Mireia MullorContributing Writer\n- Fay WatsonDeputy Entertainment Editor\n- Bradley Russell\n- Emma-Jane BettsManaging Editor, Evergreens\n- Trudie GrahamContributor\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "The article is a weekly guide to new streaming releases across major platforms, highlighting the second half of \"Wednesday\" season 2, Marvel’s \"Thunderbolts\", the Alien series \"Alien: Earth\", a Spike Lee remake, and a new K‑drama, among others. It lists where each title is available—Netflix, Disney Plus, Hulu, Apple TV Plus, and Paramount Plus—and notes key plot points or cast highlights. The piece serves as a quick reference for viewers looking to catch the latest shows and movies this week.",
  "argos_id": "I4Z7B23CA"
}