{
  "url": "https://www.techtimes.com/articles/311772/20250902/whatsapp-roll-out-close-friends-feature-status-updates.htm",
  "authorsByline": "Jose Enrico",
  "articleId": "bb03130c7f1b4a69a79cf8df4d86675c",
  "source": {
    "domain": "techtimes.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.techtimes.com/en/full/459070/whatsapp-roll-out-close-friends-feature-status-updates.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T03:00:14-04:00",
  "addDate": "2025-09-02T07:09:25.946839+00:00",
  "refreshDate": "2025-09-02T07:09:25.946840+00:00",
  "score": 1.0,
  "title": "WhatsApp to Roll Out Close Friends Feature for Status Updates",
  "description": "WhatsApp is testing a Close Friends feature for Status, giving users more privacy and control over who sees their updates, just like Instagram.",
  "content": "WhatsApp is getting ready to roll out a significant update to its Status feature. Though the feature is used sparingly in the United States, Status has become integral for millions of users as it lets them post photos, videos, and messages that vanish after 24 hours.\n\nTo imitate the current features of Instagram, the messaging platform will launch the Close Friends option.\n\nWhatsApp Status and How It Works\n\nIf you've used Instagram Stories, WhatsApp Status will feel familiar. Users can share updates that vanish after a day, creating a more casual and temporary way to connect. Until now, WhatsApp has offered three privacy settings, according .\n\nYou can choose My Contacts if you want to allow your full contact list to see your life updates. If you want a little privacy and want specific people to avoid seeing your posts, you can use My Contacts Except. For WhatsApp users who love sharing everything within their small circle, Only Share With is the best option.\n\nWhile the \"Only Share With\" feature has previously been employed as a loophole for a confidential list, this new Close Friends feature will render the process easier and more user-friendly.\n\nHow the Close Friends Feature Will Work\n\nAccording to WABetaInfo, the Close Friends feature was seen in WhatsApp's newest TestFlight release. People will be able to set up a special Close Friends list from within privacy settings soon. When sharing a Status, they'll be able to decide if they want to post to everyone or keep updates limited to the inner circle.\n\nSimilar to Instagram, WhatsApp will also visually call out these updates. Close Friends shared status will appear with a ring around them of a specific color, signaling that the post was meant to be shared with a smaller, more intimate group. Most importantly, the Close Friends list will be kept private. Contacts won't be able to tell if they have been added or removed.\n\nThe new feature could only mean one thing: people are more often craving private and selective sharing, not broadcasting to all their contacts. WhatsApp is making Status updates more interesting to users who care about both connection and control through this feature.\n\nLast week, Tech Times reported that WhatsApp is getting a voicemail-like feature for those who want to leave a missed call for their friends.\n\nThere's also an AI-powered writing feature called Help to assist users in composing messages. Here, you can edit your message and apply your desired voice in any style you like, be it humorous, corporate, or informal.",
  "medium": "Article",
  "links": [
    "https://unsplash.com/photos/a-green-square-button-with-a-phone-on-it-pkX0E7E8pcc",
    "https://wabetainfo.com/whatsapp-beta-for-ios-25-23-10-80-whats-new/",
    "https://www.techtimes.com/articles/309972/20250411/whatsapp-unveils-12-epic-features-iphone-users-group-chats-channelsheres-whats-new.htm",
    "https://www.techtimes.com/articles/311256/20250709/whatsapp-tests-threaded-message-replies-ios-beta.htm",
    "https://9to5mac.com/2025/09/01/whatsapp-status-is-getting-a-close-friends-feature/",
    "https://www.techtimes.com/articles/310587/20250603/whatsapp-username-feature-aims-protect-privacy-here-are-limitations-you-need-know.htm",
    "https://www.techtimes.com/articles/311746/20250829/whatsapp-introduces-ai-powered-writing-help-transform-messaging.htm"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Close Friends shared status",
      "weight": 0.11071939
    },
    {
      "name": "WhatsApp users",
      "weight": 0.11034894
    },
    {
      "name": "WhatsApp Status",
      "weight": 0.106104314
    },
    {
      "name": "Close Friends Feature",
      "weight": 0.09993841
    },
    {
      "name": "Status Updates",
      "weight": 0.095459886
    },
    {
      "name": "Status updates",
      "weight": 0.095459886
    },
    {
      "name": "WhatsApp",
      "weight": 0.08895111
    },
    {
      "name": "this new Close Friends feature",
      "weight": 0.079503365
    },
    {
      "name": "Users",
      "weight": 0.07607036
    },
    {
      "name": "users",
      "weight": 0.07607036
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Apps & Add-Ons",
      "score": 0.73583984375
    },
    {
      "name": "/News/Technology News",
      "score": 0.6962890625
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.52978515625
    }
  ],
  "sentiment": {
    "positive": 0.18962096,
    "negative": 0.24655125,
    "neutral": 0.56382775
  },
  "summary": "WhatsApp is set to roll out a significant update to its Status feature, which allows users to share updates that vanish after a day. The new feature, named Close Friends, resembles the current features of Instagram and will allow users to set up a special Close Friends list within their small circle. The list will be kept private and will also be called \"Only Share With\" by users. The update could make WhatsApp more engaging for users who value private and selective sharing, not broadcasting to all their contacts.",
  "shortSummary": "WhatsApp is launching the Close Friends feature for Status updates, mimicking Instagram's disappearing status, allowing users to choose privacy settings and display specific updates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ebbbbae5669d4b60b997ef8e90b11855",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.techtimes.com/articles/310587/20250603/whatsapp-username-feature-aims-protect-privacy-here-are-limitations-you-need-know.htm",
      "text": "WhatsApp is finally catching up with the competition by working on introducing a highly sought-after feature: usernames. This significant update will enable users to join without having to share their own personal phone numbers, just like competitors Telegram and Signal.\nAs first seen in the TestFlight beta version by WABetaInfo, the messaging platform is actively working on developing the interface and backend rules required to accommodate distinctive user handles.\nHow WhatsApp Usernames Will Work\nAs reported by Technoblog, the main reason behind the implementation of usernames is to maximize user privacy, particularly for users who don't want to share their mobile numbers with strangers or new contacts. With this feature being rolled out soon, users who start a conversation without having your phone number will see only your username.\nLike handles in other messaging apps, WhatsApp usernames should obey certain rules, including the following:\n- Usernames cannot begin with \"www.\" – This prevents confusion with official sites.\n- Must have at least one letter – Numbers and symbols will not suffice.\n- Permitted characters: a–z (lower case), 0–9, periods (.), and underscores (_).\nWith these restrictions, WhatsApp is set to provide a neat, readable, and secure frame for all usernames.\nWhen you choose a suitable username, WhatsApp will acknowledge it with a happy confetti animation, welcoming the transition to a more private and contemporary means of connecting.\nRead more: Meta Expands AI Integration: WhatsApp to Get Dedicated Meta AI Widget That You Can Turn Off\nUsername Changes Will Be Shared in Chats\nIf the user later wishes to make a change to their handle, WhatsApp will issue a system message in active conversations, the same as a profile picture or number-changing notifications. This allows for transparency and prevents confusion on the part of contacts.\nWhat's more, WhatsApp is set to launch a username availability checker on its web version, allowing users to search and reserve their preferred handle easily before others do.\nNot Available Yet, But It's Coming Soon\nWhile the username feature isn't available even for beta testers yet, its presence in WhatsApp's latest beta code suggests that the launch is imminent, 9to5Mac reports.\nThe username feature announcement comes shortly after the platform made headlines by finally releasing an official iPad app.\nWhen live, this functionality would transform how individuals interact, exchange, and defend their identity on one of the globe's most popular messaging services.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://www.techtimes.com/articles/311256/20250709/whatsapp-tests-threaded-message-replies-ios-beta.htm",
      "text": "WhatsApp is now rolling out threaded message replies on iOS, a highly sought-after feature that has so far only been offered to Android beta users. The feature, which enables users to better keep track of and follow multiple conversations in one chat, is live in WhatsApp for iOS beta through TestFlight.\nWhile not yet released to everyone, the fact that the feature shows up in the beta build is a good indication that it's nearing public release.\nThreaded Message Replies Coming in WhatsApp\nWhereas inline replies show up right in the main feed of the chat, threaded message replies provide a more formalized system for responding to individual messages. According to WaBetaInfo, it works when a reply count shows up beside any message with responses.\nEntering this counter reveals a new thread view, enabling users to view all the replies in chronological order. Users are also able to post new responses within the thread without filling up the primary chat window.\nThis design is similar to what people have been accustomed to in apps such as Discord and Microsoft Teams. It's more convenient when trying to juggle several simultaneous discussions within one group or individual chat.\nHow Will WhatsApp Users Benefit From Threaded Replies\nWhile WhatsApp develops further as a powerful messaging and collaboration platform, threaded replies are a major usability leap. It is particularly beneficial for overlapping conversations in group chats, according to MacRumors.\nIt's also important in business discussions where context and clarity are important. For individuals who do not wish to scroll through lengthy chains of messages to locate certain replies, this is also a must-have feature.\nTo sum it up, threaded responses assist in keeping discussions tidy, minimizing confusion, and facilitating topics, especially in discussions with high message rates.\nFor the time being, the threaded reply feature is only present for iOS beta testers, and even they cannot use it yet. Yet, with its inclusion in the recent TestFlight build, we can see that WhatsApp is actively polishing the experience before making it available more widely.\nSimilar to most of WhatsApp's previous updates, with a staggered rollout, we can anticipate functionality slowly rolling out across regions and user groups before it becomes available globally.\nLast month, WhatsApp teased the launch of the AI studio. It's for users who want to create personalized chatbots via Meta AI.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://wabetainfo.com/whatsapp-beta-for-ios-25-23-10-80-whats-new/",
      "text": "WhatsApp beta for iOS 25.23.10.80: what's new?\nWhatsApp has released a new iOS update through the TestFlight beta Program, bringing the version up to 25.23.10.80.\nWhat's new in this update? WhatsApp is working on a feature that allows users to share status updates with their close friends, and it will be available in a future update!\n| Key Points | Details |\n|---|---|\n| Name of the feature: | Status updates with close friends |\n| Status: | Under development |\n| Availability info: | This feature is currently in development and not yet available for beta testing. In the meantime, you can read this article for a sneak peek. |\n| Previous news: | WhatsApp Introduces AI Writing Help: Smarter and Secure Messaging with Meta's Private Processing! |\nSTATUS UPDATES - CLOSE FRIENDS\nIn the article about the WhatsApp for iOS 25.22.83 update, we announced that a feature to share status updates from other apps is available. This feature introduces a dedicated \"My Status\" option in the iOS share sheet, allowing users to post photos and videos as status updates directly from any app. Unlike before, when users had to select WhatsApp and then navigate through their contact list, the new shortcut streamlines the process by removing that extra step. With this update, sharing becomes faster and more seamless, letting users instantly edit their status with text, emojis, or drawings before publishing. It appears that WhatsApp is also exploring additional ways to share status updates, with a particular focus on giving users more control over customizing the audience they share with. Following the release of the latest WhatsApp beta for iOS 25.23.10.80 update, which is available on the TestFlight app, we discovered that WhatsApp is working on a feature that allows users to share status updates with their close friends!\nAs you can see from the attached screenshot, WhatsApp is exploring the implementation of a feature that will allow users to select a more personal audience for their statuses, scheduled for release in a future update. This upcoming option focuses on creating a \"close friends\" list directly within the privacy settings screen, a section users are already familiar with and use to control who can view their updates. Once this separate list is ready, users will be able to choose at the time of posting whether to share a new status with their default audience or exclusively with their selected close friends.\nSimilar to the familiar behavior on Instagram, these special updates will be visually distinguished through a different color, making it clear to anyone viewing that the status was shared only with close friends. This visual cue is subtle but effective, as it helps users instantly recognize the intended audience and reinforces the feeling of exclusivity. It's important to mention that managing the close friends list is designed to be discreet. If someone is added or removed from the list, they will not receive any notification about the change. This ensures that the process remains completely private, as only the user has full control over curating and updating their close friends list without drawing unwanted attention. This gives users peace of mind and avoids potentially awkward situations with contacts who might otherwise feel excluded.\nIt's worth noting that changes to the close friends list will only apply to future status updates. If a user shares a status with their close friends and later updates the list, the original status will still be visible to the people who were on the list at the time of posting, and it will not automatically include any new contacts added afterwards. In order to apply the new configuration for a status update previously shared with close friends, the user would need to manually delete that update and publish it again. While this may require a bit of extra attention, it ensures clarity and prevents unintentional shifts in visibility after a status has already been published.\nStatus updates shared with close friends will remain temporary, disappearing after 24 hours, and are always protected with end-to-end encryption. This ensures that only the chosen recipients can view the update, while neither Meta nor WhatsApp has access to its content. With the same level of protection applied to status updates shared with the default audience, users can feel confident that their personal moments remain fully private and secure. The added layer of exclusivity also makes close friends updates feel more intimate, allowing people to be more authentic in what they share.\nA feature that allows users to share status updates with their close friends is under development and it will be available in a future update of the app. We will keep you updated on any further developments about this feature until it's officially released.\nFollowing WABetaInfo on X is the best way to stay informed about new features under development and those released to WhatsApp beta for Android, iOS, Web, and Desktop. We love hearing your feedback, so let us know what you think! You can also explore our dedicated page to discover all our services, or join our Discord Server to chat with others, get help and advice, and stay up to date with the latest WABetaInfo announcements."
    },
    {
      "url": "https://www.techtimes.com/articles/309972/20250411/whatsapp-unveils-12-epic-features-iphone-users-group-chats-channelsheres-whats-new.htm",
      "text": "WhatsApp has simply released a monster update filled with 12 brand-new features intended to enhance the user experience, increase productivity, and further make communication even easier.\nIn a departure from the typical beta-tested trickle of updates, however, this drop delivers a sizeable overhaul in one fell swoop- and users are curious already.\nOnline Status Now Visible in Group Chats\nAccording to a WhatsApp blog post, one of the most useful new features is the Online indicator in group chats, which allows you to immediately know who's online right below the group name. This tiny but effective tweak makes group work and discussion feel livelier.\nRead more: Pavel Durov Calls WhatsApp 'Cheap Imitation' After Telegram Crosses 1 Billion Monthly Users\nGroup Highlights to Reduce Notification Overload\nTo reduce notification fatigue, WhatsApp now allows you to turn on Highlights for group chats.\nIt will only alert you if you are mentioned, someone is responding to your messages, or if the message comes from a saved contact. This is a game-changer for staying productive without losing out on important updates.\nSmarter Event Planning in Chats\nPlanning events just got simpler with a whole range of new event planning features. Now you can create vents on 1-to-1 chats themselves, add a plus one to events, set an end date and time for events, pin events to the top of the chat, and RSVP as \"maybe.\" It's an all-around personal calendar now.\nTap to Copy Reactions\nReacting just got faster. You can now tap another person's emoji reaction to add the same one to a message, avoiding the extra step of opening the emoji menu.\niOS Users Receive Document Scanning and Default App Settings\nOn iOS, you can now scan and share documents directly from WhatsApp with cropping and save functions. You can even make WhatsApp your default calling and messaging app on eligible versions of iOS by going to Settings > Default.\nZoom In on Video Calls and Add People Easily\nThe video-calling feature got a boost, too. You can now invite a person to a current 1-to-1 call from right within the chat. You can also pinch to zoom in calls, but this is for iOS only.\nSmoother and Higher-Quality Video Calls\nAt the back end, WhatsApp improved the quality of video calls as well as video call stability. GSM Arena reports that the app automatically switches to an HD quality mode when it can read sufficient bandwidth to provide a smoother experience.\nApart from that, you can now also record and post short clips for up to 60 seconds, receive voice message transcripts, and create and share a QR code that will take users to your channel.\nWe expect WhatsApp to drop more announcements about these beta features in the next few weeks.\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://www.techtimes.com/articles/311746/20250829/whatsapp-introduces-ai-powered-writing-help-transform-messaging.htm",
      "text": "WhatsApp is no longer a stranger to AI integration. Two months ago, AI Message Summaries became available in the US, so you can easily catch up with your friends on chats. Now, the new feature dubbed Writing Help will make it easier and more imaginative to write messages.\nUsing Meta AI, the feature provides users with suggested text in various tones, including professional, casual, humorous, and more. If you're running out of options to use, this AI-powered feature will help you take control of your communication.\nWhatsApp Writing Help is Very Helpful\nAs stated by WhatsApp in its latest blog post, this feature is easily accessible. During any one-on-one or group conversation, users can tap the new pencil icon to turn Writing Help on. Then, WhatsApp creates AI-suggested rewrites based on the preferred style.\nThe messaging platform stresses that Writing Help is made using Private Processing technology, which means neither Meta nor WhatsApp scans your original messages, nor the rewrites suggested by AI. In this way, it seeks to allow convenience without undermining privacy.\nRead more: WhatsApp Username Feature Aims to Protect Privacy: Here Are the Limitations You Need to Know\nPrivacy and Security at the Center\nWhatsApp has emphasized that Private Processing has been tested thoroughly in partnership with security community leaders. With the feature being opt-in and disabled by default, people who are privacy-conscious can just leave it alone. This opt-in system provides people with the freedom to choose whether they want to use AI support in their everyday conversations.\nWill it Be Available In Your Location?\nAt the moment, Writing Help is going live in English for US users. It will be available for select users in other countries. According to GSM Arena, WhatsApp confirmed that the additional language and market support will be available later this year. Millions of users around the globe will benefit from this.\nThis launch is part of Meta's overall effort to bring AI tools across its apps and continue to build user trust through increased privacy protections.\nAI is quickly evolving. Before, we will first think thoroughly about what tone we should use in different conversations. Now, we're just a few clicks away from doing it. It's the power of AI, but whatever tone you use at the end of the day, the essence of your message will still depend on you.\nLast week, WhatsApp teased a voicemail-like feature on the platform. If you're the type of person who usually misses conversations, the smarter missed call feature will help you.\nWith this, you can now leave a short voice message when your calls are unanswered. A \"record voice message\" shortcut will appear on your screen.\nRelated Article: WhatsApp Tests Threaded Message Replies on iOS Beta\nⓒ 2025 TECHTIMES.com All rights reserved. Do not reproduce without permission."
    },
    {
      "url": "https://9to5mac.com/2025/09/01/whatsapp-status-is-getting-a-close-friends-feature/",
      "text": "While most U.S. users have never used—or even heard of—WhatsApp Status Updates, Meta recently revealed that the tab is now used by 1.5 billion people per day worldwide. And soon, WhatsApp will take a page from Instagram by adding a Close Friends feature.\nIf you’re unfamiliar with WhatsApp Status, it works much like Instagram Stories, where users can post photos and videos that disappear after 24 hours.\nFor the last few years, Instagram users have enjoyed a Close Friends feature, which lets them select specific people to share updates with rather than their entire followers list.\nNow, according to WABetaInfo, Meta is preparing to bring that same option to the 1.5 billion daily WhatsApp Status users, who currently can only choose between:\n- “My Contacts,” which shares the update with their entier contact list;\n- “My Contacts Except…,”, which shares the update with all their contacts, except specific people;\n- “Only Share With…,” which only shares the update with selected contacts.\nWhile many users currently rely on the “Only Share With…” option as a makeshift Close Friends list, soon they’ll have both options, offering greater flexibility over who can see each update.\nHere’s how it’ll work\nBased on materials found by WABetaInfo in the latest TestFlight release, users will be able to create a dedicated Close Friends list from within the existing privacy settings screen.\nWhen posting a new Status update, users will have the option to share it with their entire contact list, or restrict it to the selected group of closer friends.\nLike on Instagram, these updates will be visually distinguished with a different-colored ring around them, making it clear to these contacts that they are seeing an update shared only with select friends rather than a broader audience.\nAnd also like on Instagram, the list itself is private, which means people won’t be notified if they’re added or removed.\nHave you ever used WhatsApp Status updates? Let us know in the comments.\nAccessory deals on Amazon\n- Apple AirTag 4 Pack, 29% off\n- Apple AirTag, 21% off\n- Beats USB-C to USB-C Woven Short Cable, 19% off\n- Wireless CarPlay adapter, $10 off\nFTC: We use income earning auto affiliate links. More.\nComments"
    }
  ],
  "argos_summary": "WhatsApp is set to launch a Close Friends option for its Status feature, allowing users to create a private list of contacts who can view temporary posts, similar to Instagram Stories. The feature will add a colored ring to distinguish close‑friend updates and remain fully end‑to‑end encrypted. It expands on existing privacy settings—My Contacts, My Contacts Except, and Only Share With—providing a dedicated, discreet way to share moments with a select audience. The rollout is expected in a future update after testing in TestFlight.",
  "argos_id": "IQFQIPS9Z"
}