{
  "url": "https://www.nbcnews.com/world/asia/sydney-dockworkers-charged-100-million-cocaine-bust-rcna228468",
  "authorsByline": "Jay Ganglani",
  "articleId": "a7a896e1a5214f37a93dc540e17541d5",
  "source": {
    "domain": "nbcnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-09/250902-cocaine-sydney-rs-56b514.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T09:16:54.976000+00:00",
  "addDate": "2025-09-02T09:19:01.592164+00:00",
  "refreshDate": "2025-09-02T09:19:01.592166+00:00",
  "score": 1.0,
  "title": "Sydney dockworkers charged over $100 million cocaine bust",
  "description": "Officials said they had been investigating a criminal syndicate believed to be working with “trusted insiders” to import commercial quantities of illegal drugs into Australia.",
  "content": "Three Sydney dockworkers have been charged over a cocaine shipment worth more than $100 million that was found hidden behind a false wall in a shipping container.\n\nOfficials said they had been investigating a criminal syndicate believed to be working with “trusted insiders” at Sydney ports to import commercial quantities of illegal drugs into Australia.\n\nThey said they had received intelligence that a group was planning to remove illicit drugs from an imported shipping container while it was stored on the Sydney waterfront.\n\nOn Sunday, a 25-year-old man was arrested while exiting the shipping container, whose legitimate cargo had already been unloaded. Police said they found a crowbar, an angle grinder, ear protection, portable lights and other tools inside that they alleged the man was using to cut through a false wall at the back of the shipping container.\n\nBehind the wall were 506 blocks of cocaine weighing 1 kilo (2.2 pounds) each, for a total of more than 1,115 pounds. The shipment had a street value of more than 164 Australian dollars ($106 million), the Australian Federal Police (AFP) said Tuesday in a joint news release with the New South Wales Police Force.\n\nThe 25-year-old man, along with two others ages 38 and 42, appeared in a New South Wales court on Monday, with only the 42-year-old being released on bail.\n\nIf convicted, the three men could face life in prison. They are next expected to appear in court on Oct. 29.\n\nThough the shipping container came from Europe, police said they were still investigating the origin of the cocaine. Searches of two of the men’s homes found 330,000 Australian dollars (about $215,000) in cash suspected of being proceeds from crime.\n\n“To anyone lured in by the false promise of riches from drug importations — these offenses carry the potential of life in jail,” AFP Detective Superintendent Peter Fogarty said.\n\nThe investigation was carried out by the Multi Agency Strike Team, a collaboration between Australian law enforcement agencies that aims to “investigate and target trusted insiders assisting transnational serious organized crime syndicates.”\n\nThere have been a series of recent drug busts in Australia, including late last year when police seized a record 2.3 tons of cocaine and arrested 13 people in raids after the suspects’ boat broke down off the coast of Queensland.\n\nIn 2022, police also found 2 U.S. tons of methamphetamine hidden in marble tiles shipped from the Middle East to Sydney in what they said was the largest-ever seizure of the illicit drug in the country.",
  "medium": "Article",
  "links": [
    "https://www.nbcnews.com/world/australia/katy-perry-concert-sydney-fan-storms-stage-rcna211978",
    "https://www.afp.gov.au/news-centre/media-release/three-alleged-trusted-insiders-charged-mast-following-failed-506kg",
    "https://www.nbcnews.com/news/world/australian-police-seize-record-11-billion-crystal-meth-rcna44945",
    "https://www.nbcnews.com/news/world/australia-police-arrest-13-seize-23-tons-cocaine-boat-rcna182393",
    "https://www.nbcnews.com/news/europe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "illicit drugs",
      "weight": 0.07863004
    },
    {
      "name": "recent drug busts",
      "weight": 0.07536722
    },
    {
      "name": "drug importations",
      "weight": 0.073991
    },
    {
      "name": "illegal drugs",
      "weight": 0.07226774
    },
    {
      "name": "New South Wales",
      "weight": 0.07193957
    },
    {
      "name": "Australian law enforcement agencies",
      "weight": 0.069767
    },
    {
      "name": "Sydney dockworkers",
      "weight": 0.06940471
    },
    {
      "name": "Sydney ports",
      "weight": 0.06769419
    },
    {
      "name": "cocaine",
      "weight": 0.06589296
    },
    {
      "name": "trusted insiders",
      "weight": 0.06457002
    }
  ],
  "topics": [
    {
      "name": "Cocaine"
    },
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97802734375
    },
    {
      "name": "/News/Local News",
      "score": 0.9560546875
    },
    {
      "name": "/News/Other",
      "score": 0.927734375
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.85546875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.818359375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Drug Laws & Policy",
      "score": 0.599609375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.40869140625
    }
  ],
  "sentiment": {
    "positive": 0.049027476,
    "negative": 0.72327334,
    "neutral": 0.2276992
  },
  "summary": "Three Sydney dockworkers have been charged over a cocaine shipment worth over $100 million that was found hidden behind a false wall in a shipping container. The authorities were investigating a criminal syndicate believed to be working with \"trusted insiders\" at Sydney ports to import commercial quantities of illegal drugs into Australia. The 25-year-old man was arrested while exiting the shipping container, which contained 506 blocks of cocaine weighing 1 kilo (2.2 pounds) each. The shipment had a street value of over 164 Australian dollars ($106 million). If convicted, the three men could face life in prison. The investigation was conducted by the Multi Agency Strike Team, a collaboration between Australian law enforcement agencies that aims to target and target trusted insiders assisting transnational serious organized crime syndicates.",
  "shortSummary": "Three Sydney dockworkers have been charged over a $100 million cocaine shipment hidden behind a false wall in a shipping container.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ae85246d58fc43c7bc117254a15fb466",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nbcnews.com/news/world/australia-police-arrest-13-seize-23-tons-cocaine-boat-rcna182393",
      "text": "WELLINGTON, New Zealand — Police in Australia seized a record 2.3 tons of cocaine and arrested 13 people in raids after the suspects’ boat broke down off the coast of Queensland, authorities said Monday.\nThe drugs had a sale value of 760 million Australian dollars ($494 million) and equaled as many as 11.7 million street deals if they had reached the country of 28 million people, federal police said in a statement.\nInvestigators told reporters in Brisbane that the drugs were transported from an unidentified South American country.\nThe arrests on Saturday and Sunday followed a monthlong investigation after a tipoff that the Comancheros motorcycle gang was planning a multiton smuggling operation, Australian Federal Police Commander Stephen Jay said.\nThe smugglers made two attempts to transport the drugs to Australia by sea from a mothership floating hundreds of miles offshore, Jay said. Their first boat broke down, and the second vessel foundered on Saturday, leaving the suspects stranded at sea for several hours until police raided the fishing boat and seized the drugs, he said.\nThe mothership was in international waters and was not apprehended, Jay said.\nAuthorities have seized more than one ton of cocaine before, Jay said, but the weekend’s haul was the biggest ever recorded in Australia.\nThose charged are accused of conspiring to import the drug into Australia by sea and were due to appear in various courts on Monday. The maximum penalty under the charge is life in prison.\nSome were arrested on the boat, while others were waiting on shore to collect the cocaine, police said. Two were under age 18 and all were Australian citizens, they said.\n“Australia is a very attractive market for organized criminal groups to send drugs such as cocaine,” Jay said."
    },
    {
      "url": "https://www.nbcnews.com/world/australia/katy-perry-concert-sydney-fan-storms-stage-rcna211978",
      "text": "Pop star Katy Perry was surprised at her concert in Sydney on Monday when an attendee briefly ran up to her on stage and grabbed her before being escorted away by security.\nPerry was midway through her show at the 21,000-seat Qudos Bank Arena, the second of three sold-out dates in the Australian city on her “Lifetimes Tour.” Video footage posted by a concertgoer and verified by NBC News showed a man run down the circular stage, throw an arm around Perry’s shoulder and start bouncing and dancing wildly.\nPerry, who appeared surprised, quickly moved away as she continued singing her 2008 hit “Hot N Cold.”\n“There’s never going to be another show like this, so just enjoy it, Sydney,” she said, as the fan appeared to struggle with security guards.\n“What the hell is going on?” Perry said to the crowd, as the man was dragged off stage.\nA representative for Perry could not immediately be reached for comment.\nThe incident highlights growing concerns about poor etiquette at concerts, with audience members throwing items at artists such as Harry Styles and Lady Gaga.\nPolice in the state of New South Wales, which includes Sydney, told NBC News that a man had been arrested and charged with two offenses: entering enclosed land and obstructing a person in performance of work or duties. They said he had been detained by security after jumping on stage during a concert around 9:20 p.m. local time.\nThe man has been granted conditional bail and is due to appear in court on June 23, police said, declining to name him in the meantime. They said he has also been banned for six months from Sydney Olympic Park, where the arena is located.\nThe man has been identified in Australian media as Johnson Wen, who describes himself as a “prankster” on his TikTok account, where he goes by the username pyjamamann and has a little over 1,100 followers.\n“I was like, ‘Let me get on stage with you,’ and then she freaked out because I think she realized I wasn’t a performer,” Wen told Australia’s 9News about the incident, adding that he was “about to do the extra Fortnite move, but security got there too quick.”\nPrevious videos posted on Wen's account show him running on stage at a concert by The Weeknd in Melbourne last year, and onto the field at the FIFA Women’s World Cup final in 2023.\nWen told 9News that his stage invasion days were over.\n“I’m planning to quit forever, because you get in way too much trouble for it,” he said.\nWen did not immediately respond to a request for comment. By Tuesday, he had posted four different videos of his rushing the stage.\n“Katy Perry your songs are my Childhood Memmory since 2008,” he wrote in a caption for one of the videos.\n“Me Hugging Katy Perry on Stage,” another caption read. “I said to Her ‘let me dance for you.’”\nPerry has not otherwise publicly commented on the incident. Her tour was set to continue Tuesday with another show in Sydney before she continues on to Melbourne, Brisbane, Perth and Adelaide."
    },
    {
      "url": "https://www.nbcnews.com/news/world/australian-police-seize-record-11-billion-crystal-meth-rcna44945",
      "text": "Authorities have found 2 U.S. tons of methamphetamine hidden in marble tiles shipped from the Middle East to Sydney in what police describe as the largest-ever seizure of the illicit drug in Australia.\nThree men were arrested after 1,649 pounds of the drug were found early this month hidden in 24 containers that arrived at Port Botany, officials said on Friday.\nAnother 2,337 pounds of meth were found in 19 containers that arrived at the same port last week. The drugs were hidden in the same method and were all shipped from the United Arab Emirates.\nPolice estimate the meth’s street value at $1.1 billion, which reflects the higher prices that Australians pay for illicit drugs than users do in many comparable countries.\nPolice Detective Chief Supt. John Watson described the quantity of meth as “staggering.”\n“This seizure will be felt for weeks to come by many high-, mid- and lower-level suppliers,” Watson said.\nNo further arrests have been made since last week’s seizure. Investigators have turned their attention to identifying the overseas suppliers.\n“The Middle Eastern region is probably our main focus,” Watson said. “But I certainly wouldn’t restrict our investigation to just that region.”\nAll the containers were destined to be sent to a factory in western Sydney that had been set up to quickly extract meth from marble, Watson said. Police do not know how often the factory had been used.\nThe three men already arrested — aged 24, 26 and 34 — face potential life sentences in prison if convicted of drug trafficking. They have appeared in court and have been refused bail.\nAustralia’s previous record meth haul was 1.8 U.S. tons hidden in speakers and shipped into Melbourne from Bangkok in April 2019. Three Melbourne residents were charged with drug offenses."
    },
    {
      "url": "https://www.nbcnews.com/news/europe",
      "text": "Minouche Shafik became president of New York's Columbia University in 2023, but quit after the handling of student protests over Israel's war in Gaza drew criticism.\nUrsula Von der Leyen, a fierce critic of Russian President Vladimir Putin and Moscow’s war in Ukraine, is on a four-day tour of the E.U. nations bordering Russia and its ally Belarus.\nCamilla was on a train to London’s Paddington Station in the mid-1960s when the man next to her reached out and attempted to touch her, according to a new book on the royal family.\nFinland’s air force adopted the swastika emblem in 1918 soon after the country gained its independence after more than a century of Imperial Russian rule.\nGrimsby’s jubilant fans stormed onto the field to celebrate with the players after Bryan Mbeumo’s spot kick rebounded off the crossbar to seal United’s fate."
    },
    {
      "url": "https://www.afp.gov.au/news-centre/media-release/three-alleged-trusted-insiders-charged-mast-following-failed-506kg",
      "text": "Three alleged trusted insiders charged by the MAST following failed 506kg cocaine import\nThis is a joint media release between the Australian Federal Police and NSW Police Force\nEditor’s note: Vision of the seizure and arrest are available via Hightail.\nThree Sydney men have been charged and about 506kg of cocaine and $330,000 cash seized following a Multi Agency Strike Team (MAST) investigation into trusted insiders facilitating the importation of illicit drugs into Australia.\nThe MAST, made up of investigators from the Australian Federal Police (AFP) and NSW Police Force (NSWPF), works directly with law enforcement partners from the Australian Border Force (ABF), NSW Crime Commission (NSWCC), Australian Criminal Intelligence Commission (ACIC), Australian Transaction Reports and Analysis Centre (AUSTRAC) and Australian Taxation Office (ATO), to target trusted insiders.\nIn April 2025, investigators established Strike Force Paiporta to target a criminal syndicate that allegedly had members working inside Sydney ports to facilitate the importation of commercial quantities of illegal drugs.\nMAST investigators received intelligence that a group was allegedly planning to remove illicit drugs from an imported shipping container while it was stored at a sea freight facility in Sydney.\nThe shipping container had entered Australia with legitimate cargo, which was delivered and the seemingly empty shipping container returned to a storage area.\nA Hillsdale man, 38, who worked as a forklift driver was observed moving shipping containers around the facility to access a specific shipping container which was later found to contain the cocaine, about 12.30am on Sunday (31 August, 2025).\nA short time later police observed another man with a bag enter that shipping container.\nMAST investigators entered the facility and arrested the man – a 25-year-old from Oyster Bay– as he exited the shipping container.\nPolice found a crowbar, an angle grinder, ear protection, portable lights and other hand tools in the container, which they allege the man was using to cut into a false wall at the rear of the shipping container.\nSpecialist crime scenes teams attended, removed the false wall and found 506 individual blocks of white powder in a cavity covered in lead sheeting, with the contents testing positive for cocaine.\nThis shipment has an estimated street value of more than $164 million and could have been sold in the community as 2,530,000 individual 0.2 gram street deals.\nA short time later the Hillsdale man returned to the container and was also arrested by MAST investigators.\nBoth men were transported to St George Police station where they were formally charged with importing a commercial quantity of a border-controlled drug, namely cocaine, contrary to section 307.1 of the Criminal Code (Cth).\nThey were also charged with attempting to possess a commercial quantity of cocaine, contrary to section 307.5 of the Criminal Code (Cth). The maximum penalty for these offences is life imprisonment.\nA short time later investigators executed a search warrant at the Hillsdale man’s home where a 42-year-old Caringbah man was intercepted as he left the property.\nInvestigators spoke to the man, who was found in possession of $200,000 in cash suspected of being the proceeds of crime.\nFurther inquiries established the Caringbah man also worked at a logistics company as a forklift driver.\nThe Caringbah man was subsequently charged with dealing with money believed to be proceeds of general crime, contrary to section 400.9(1AB) of the Criminal Code (Cth).\nA second search warrant was executed at the home of the Oyster Bay man, where a further $130,000 in suspected proceeds of crime was located and seized.\nAll three men appeared before Sutherland Local Court yesterday (1 September 2025). The Hillsdale and Oyster Bay men were refused bail and are expected to appear at the Downing Centre Local Court on 29 October, 2025.\nThe Caringbah man was granted bail with strict conditions and is also expected to appear at the Downing Centre Local Court on 29 October, 2025.\nWhile the shipping container was sent from Europe, inquiries into the source of the illicit drugs and anyone involved in the importation plot remain ongoing.\nAFP Detective Superintendent Peter Fogarty said the AFP and its partners were determined to protect the community and prevent organised crime networks from importing illicit drugs and causing harm.\n“Transnational serious organised crime groups routinely seek to exploit vulnerabilities at Australia’s gateways to the world, and the AFP, alongside our partners, are committed to exposing these syndicates and bringing them before the courts,” Det Supt Fogarty said.\n“We will allege this syndicate was disciplined but was no match for the capabilities and tenacity of the MAST and its investigators.\n\"To anyone lured in by the false promise of riches from drug importations – these offences carry the potential of life in jail.”\nNSW Police Drug and Firearms Squad Commander, Detective Superintendent John Watson, said the MAST was proving to be a point of difference.\n“The MAST combines Commonwealth and NSW law enforcement resources and intelligence, including officers with specialist knowledge,” Det Supt Watson said.\n“This significant seizure is proof that the multi-agency operation is disrupting transnational serious organised crime from infiltrating our shores.”\nThe MAST has 41 full-time investigators and analysts from both Commonwealth and NSW law enforcement agencies, leveraging the capabilities, resources and legislative powers to investigate and target trusted insiders assisting transnational serious organised crime syndicates impacting NSW.\nTransnational Serious Organised Crime and Trusted Insiders\nTransnational serious organised crime (TSOC) groups are focused on finding ‘a door’ into Australia to import and move their illicit commodities.\nA trusted insider is any person who, through their employment or association with a supply chain business, uses their access to goods, systems, or premises for malicious purposes to facilitate TSOC-related activities without law enforcement detection.\nTrusted insiders are very valuable and highly sought by TSOC groups. They act as key enablers to compromise the supply chain and allow illicit goods into Australia, causing harm to NSW communities.\nHow the MAST approach is different to other law enforcement strategies?\nThe MAST aims to disrupt TSOC groups by targeting trusted insiders to ‘close the door into Australia’. The MAST is commodity-agnostic and will target anyone who uses a position of trust within the supply chain to enable TSOC groups to bring illicit goods into Australia.\nPolice investigations typically focus on the illicit commodity, its origin, destination, or the person or groups involved. The MAST tracks how the illicit commodity was able to bypass border controls, identifies the vulnerabilities exploited, and closes the door to prevent future exploitation by TSOC groups.\nNote to media\nMedia are encouraged to include help-seeking information in stories about illicit drugs to minimise any negative impact on people in the community. The following services provide people with access to support and information.\n- For free and confidential advice about alcohol and other drug treatment services call the National Alcohol and Other Drug Hotline on 1800 250 015.\n- Access free 24/7 drug and alcohol counselling online.\n- For information about drug and alcohol addiction treatment or support, go to the Turning Point website."
    }
  ],
  "argos_summary": "Three Sydney dockworkers were charged after a $106 million cocaine shipment was discovered hidden behind a false wall in a shipping container. The container, originally from Europe, was stored at a Sydney waterfront facility where insiders allegedly cut into the wall to access the drugs. Police seized 506 kg of cocaine and $330,000 in cash, and the men face potential life sentences. The case is part of a broader effort by Australian law enforcement to target trusted insiders facilitating transnational drug trafficking.",
  "argos_id": "JJU8PEXDM"
}