{
  "url": "https://www.businessinsider.com/stock-market-crash-more-concentrated-than-ever-ai-tech-morningstar-2025-8",
  "authorsByline": "William Edwards",
  "articleId": "2f5e7a4d617a41dbbeaf12015a815610",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b1ee3d194a2d49b8af76cb?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T15:09:20+00:00",
  "addDate": "2025-09-02T15:16:45.658303+00:00",
  "refreshDate": "2025-09-02T15:16:45.658306+00:00",
  "score": 1.0,
  "title": "Morningstar details 2 forces that could derail a stock market that's historically dependent on Big Tech",
  "description": "This particular episode of concentration may be especially risky for the S&P 500 because the top 8 companies are tech-related firms.",
  "content": "By at least one measure, the US stock market is more concentrated in its biggest names than it's ever been.The top 10 stocks in the S&P 500 now make up about 40% of the benchmark index, an all-time high, according to Morningstar data.High concentration in any portfolio can be risky because, while it can mean more upside potential if the select few names do well, it also comes along with more downside risk if things go awry.This particular episode of concentration may be especially risky for the broader market because the top eight companies are technology or technology-like firms, said Dominic Pappalardo, chief multi-asset strategist at Morningstar Wealth.\"The vast majority of the top 10 are all very likely to move together,\" Pappalardo told Business Insider. \"So if you have one or two of those tech names come out with, let's say, weak earnings next quarter, it's likely that all eight of those are going to move downward and sell off simultaneously, which is going to have an outsized impact on the level of that index.\"He added: \"If you go back to a period like April, where we had the post-Liberation Day sell-off, those names also led the market downward.\"Pappalardo said it wouldn't be surprising to see a pullback in the market in the near future, given that S&P 500 is near record highs. And while he said he doesn't believe a recession is imminent, he also unpacked a few potential threats to the rally that could start to emerge in the months ahead.For one, the labor market could soften further. The most recent jobs report showed historically weak employment growth in May, June, and July. Investors will get their next insight into the health of the labor market from the Bureau of Labor Statistics in the September 5 payrolls report.The lackluster job growth appeared to be enough to convince the Federal Reserve to resume its rate cuts in September, which investors have cheered on. But Pappalardo said that rate cuts may only boost stocks if the labor market holds up.\"If the Fed is only cutting rates because they think the economy is weakening to a point where they have to step in and support it longer-term, that's not a great thing,\" he said.Something else that could create issues for investors is inflation, he said. It has already proven sticky, with the Consumer Price Index up 2.7% year-over-year in July. Core Personal Consumption Expenditures, the Fed's preferred inflation measure, was up 2.9% in July.Tariffs have fed into that data, and are still working their way into the economy, he said. If inflation remains elevated, the Fed is more likely to keep rates high, slowing economic activity.\"There's no question tariffs have increased prices for businesses and consumers, it's just a simple fact,\" Pappalardo said.He added: \"There are a lot of things that are lining up to be concerning.\"To diversify your portfolio further if you're overweight tech stocks, Pappalardo suggested adding exposure to international stocks, small-cap stocks, and the healthcare sector because of its earnings prospects and low valuations.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tech stocks",
      "weight": 0.08039885
    },
    {
      "name": "international stocks",
      "weight": 0.07511488
    },
    {
      "name": "stocks",
      "weight": 0.07245097
    },
    {
      "name": "rate cuts",
      "weight": 0.070101194
    },
    {
      "name": "Dominic Pappalardo",
      "weight": 0.06621349
    },
    {
      "name": "Pappalardo",
      "weight": 0.06201763
    },
    {
      "name": "weak earnings",
      "weight": 0.06067525
    },
    {
      "name": "chief multi-asset strategist",
      "weight": 0.06016894
    },
    {
      "name": "rates",
      "weight": 0.05963574
    },
    {
      "name": "post-Liberation Day",
      "weight": 0.05868863
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "Stocks"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9931640625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.95703125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.315673828125
    }
  ],
  "sentiment": {
    "positive": 0.05875407,
    "negative": 0.7938354,
    "neutral": 0.14741053
  },
  "summary": "The US stock market is becoming more concentrated in its top 10 stocks, making up about 40% of the benchmark index, an all-time high. This concentration may be particularly risky as the top eight companies are technology or technology-like firms. Dominic Pappalardo, chief multi-asset strategist at Morningstar Wealth, suggested that if one or two of these tech companies come out with weak earnings next quarter, all eight of them will likely sell off simultaneously. He also warned that the labor market could soften further, and inflation could pose another issue for investors. Pattalardo suggested exposure to international stocks, small-cap stocks, and the healthcare sector due to their low valuations.",
  "shortSummary": "The US stock market is significantly concentrated on Big Tech, with the top 10 companies making up 40% of the benchmark index, amid slowing job growth and inflation concerns.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "852b2af796e24f80bc7f4006da885b18",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Morningstar warns that the S&P 500’s extreme concentration—40% of the index now held by the top ten stocks, eight of which are tech firms—creates outsized downside risk if any of those names falter.  Weak labor market growth, sticky inflation, and ongoing tariff‑driven price pressures could prompt the Fed to keep rates high or cut them only to support a weakening economy, further tightening the market.  Pappalardo advises diversifying into international, small‑cap, and healthcare stocks to mitigate the concentration risk.",
  "argos_id": "JL5S7YO65"
}