{
  "url": "https://www.chron.com/news/world/article/top-japanese-beverage-giant-suntory-s-chief-21026172.php",
  "authorsByline": "By YURI KAGEYAMA, AP Business Writer",
  "articleId": "149196f5219c4127a375cc3a528bbc00",
  "source": {
    "domain": "chron.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "TX",
      "county": "Harris County",
      "city": "Houston",
      "coordinates": {
        "lat": 29.7589382,
        "lon": -95.3676974
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T09:16:28+00:00",
  "addDate": "2025-09-02T09:37:35.563216+00:00",
  "refreshDate": "2025-09-02T09:37:35.563218+00:00",
  "score": 1.0,
  "title": "Top Japanese beverage giant Suntory's chief resigns as he faces a drug probe",
  "description": "Takeshi Niinami, a Japanese business leader and CEO of beverage giant Suntory, has resigned as he is facing an investigation into his alleged possession of an illegal drug. Suntory Holdings President...",
  "content": "TOKYO (AP) — Takeshi Niinami, chief executive of Japan’s major beverage maker Suntory, resigned Tuesday to take responsibility for being under investigation for alleged possession of an illegal drug.\n\nTorii was vague about details such as the type of allegedly illegal drug, saying the case was still under investigation.\n\nNiinami, 66, is an prominent business leader who is credited with guiding strong growth at Suntory, which makes whisky, beer and non-alcoholic beverages. He became the company's chief executive in 2014, and has won respect across the industry for his prominent role in lobbies that represent industry to the government.\n\n“He was a dynamic and decisive leader whom I respect greatly. During a decade of his leadership, both profits and sales grew dynamically,” Torii told reporters.\n\nIt was unclear who would take Niinami's place. Torii said he was already in a leadership role alongside Niinami and would take full responsibility for the business, including its overseas operations.\n\nTorii said Niinami had contributed greatly to the company over the years, but that the resignation was inevitable because of “governance issues.”\n\nIt is common in Japan for people who cause embarrassment for a group to give up their posts. Japan’s culture stresses accountability and avoidance of shame.\n\n“Regardless of whether he is found innocent or guilty, we feel he is not fit for the job,” Vice President Kenji Yamada told reporters.\n\nTorii and Yamada said the alleged drug in question might have been a “supplement” that Niinami acquired personally. Suntory, founded in 1899, is well known for whisky and soft drinks, but also makes supplements.\n\nThey quoted Niinami as saying he didn’t know the supplement was illegal. The police probe started last month, they said, while declining to give other details.",
  "medium": "Article",
  "links": [
    "https://www.threads.com/@yurikageyama"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Takeshi Niinami",
      "weight": 0.08981117
    },
    {
      "name": "Niinami",
      "weight": 0.08603279
    },
    {
      "name": "chief executive",
      "weight": 0.07816171
    },
    {
      "name": "non-alcoholic beverages",
      "weight": 0.07602511
    },
    {
      "name": "Suntory",
      "weight": 0.07575975
    },
    {
      "name": "Vice President Kenji Yamada",
      "weight": 0.07501613
    },
    {
      "name": "Top Japanese beverage giant",
      "weight": 0.07354571
    },
    {
      "name": "Torii",
      "weight": 0.0718302
    },
    {
      "name": "Japan",
      "weight": 0.06781238
    },
    {
      "name": "full responsibility",
      "weight": 0.06740019
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.92822265625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.69873046875
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.5234375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.453125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.365234375
    },
    {
      "name": "/News/Other",
      "score": 0.3564453125
    }
  ],
  "sentiment": {
    "positive": 0.07543053,
    "negative": 0.5927279,
    "neutral": 0.3318415
  },
  "summary": "Takeshi Niinami, CEO of Japan's largest beverage maker, Suntory, has resigned to take responsibility for being under investigation for alleged possession of an illegal drug. The alleged drug may have been a supplement purchased personally by Niinam. The case is still under investigation. It is common in Japan for people who cause embarrassment to resign from their positions due to their roles in the company. It was unclear who would replace Niinamic.",
  "shortSummary": "Suntory CEO Takeshi Niinami resigned amid a police investigation into alleged possession of an illegal drug, citing corporate governance issues.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d62743f2e2674aa1b842d736918e05a4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Suntory CEO Takeshi Niinami resigned after being investigated for alleged possession of an illegal drug, a case still under investigation. Niinami, who led the company since 2014, stepped down amid governance concerns, with company president Torii taking full responsibility for operations. The probe began last month, and while details remain unclear, the incident reflects Japan’s culture of accountability and the potential impact on the company’s reputation.",
  "argos_id": "KAB3PA9FI"
}