{
  "url": "https://thenextweb.com/news/past-tipping-point-climate-transition",
  "authorsByline": "Andrea Hak",
  "articleId": "506b98301bad433b8848822d2bee2bb8",
  "source": {
    "domain": "thenextweb.com",
    "paywall": false,
    "location": {
      "country": "nl",
      "city": "Amsterdam",
      "coordinates": {
        "lat": 52.3727598,
        "lon": 4.8936041
      }
    }
  },
  "imageUrl": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2025%2F08%2Fmadara-Eurc8pMvox8-unsplash.jpg&signature=4ec3913fcf466551825e288c39fa0c88",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T08:30:53+00:00",
  "addDate": "2025-09-02T08:43:12.629702+00:00",
  "refreshDate": "2025-09-02T08:43:12.629703+00:00",
  "score": 1.0,
  "title": "Past the tipping point: why the climate transition is now in our hands",
  "description": "The climate transition is already underway — but scaling up investment in climate tech, energy communities, and EV innovation is critical.",
  "content": "Jacqueline van den Ende, CEO of Carbon Equity, believes we have already passed the climate transition tipping point: “Last year, 90% of all new electricity production worldwide came from renewable sources, i.e. generated via solar, wind, or water. Meanwhile, China is actually ahead of its climate goals compared to other countries,” she said.\n\nThis isn’t a sign to let up; if anything, van den Ende believes we need more investment into climate tech solutions that will help accelerate the transition and make clean energy accessible across the globe. Yet, European climate tech funding sunk to a five-year low in Q1 2025.\n\nIn the latest episode of Kia’s Next Big Drive, van den Ende shares how Carbon Equity is using its platform to democratise climate finance by making it possible for individuals to invest in pioneering climate tech companies.\n\nDespite recent headlines, support for the energy transition is growing across the continent. European citizens are not only voicing their opinions but taking action by reducing and recycling waste (64%) and cutting down on consumption of disposable items whenever possible (49%).\n\nMany are also putting their money where their mouth is. The first half of 2025 marked a significant milestone for the European battery electric vehicle (BEV) market, with new registrations up 34% compared to the same period in 2024.\n\nAccording to the European Commission’s 2025 Eurobarometer survey:\n\nAppetite for creating what the EU calls ‘energy communities’ has increased over the last few years, as EU funding has supported new community led actions. By securing ownership of renewable energy production, these communities are able to protect residents from price shocks by providing stable, affordable power year-round.\n\nInvestment into an energy network based on wind turbines, an electric boiler, and heat pumps paid off for Denmark’s Hvide Sande District during the 2022 energy crisis. While energy bills soared across Europe, residents of the community saw heating costs drop by over 50%.\n\nSince 2015, Ireland’s Ecovision community has used energy saving profits to create a community fund aimed at helping residents access funding for energy saving renovations. Over 900 homes and 50 community and commercial buildings have been renovated so far, saving over 10 GWh of energy, the equivalent of the average annual electricity consumption of more than 2,300 Irish households. All renovations are done through local contractors, helping to boost the local economy.\n\nRecently, a Finnish town of 5,000 people introduced a sand battery that uses dirt to store excess renewable energy as heat. On a sunny or windy day, the battery heats up, storing energy for weeks or even months. Polar Night, the startup behind the battery, estimates the battery will be able to heat the whole town for a week in winter or an entire month in summer, on just one charge.\n\nThis pilot project could kick start a new trend for communities looking to heat their homes and businesses sustainably.\n\nHowever, the Iberia-wide blackout on April 28th fueled skepticism, with some blaming Spain and Portugal’s net zero ambitions. Just before the blackout, on April 16th, Spain had reached a milestone by running 100% on wind, solar, and hydro power for the first time.\n\nOur sustainability tech reporter, Siôn Geschwindt, based in Portugal, was quick to report on the story at the time, interviewing several climate tech experts who attributed the Iberian blackout points to grid growing pains — not green energy failure.\n\n“While wind and solar generate clean, cheap electricity, they don’t produce power in a steady stream — they rise and fall with the weather. However, grids in Europe were largely built for more predictable sources of energy, like coal, gas, or nuclear plants,” says Geschwindt. “Without that stabilising force, or the addition of alternatives like battery storage systems, the grid becomes more vulnerable to surges in electricity demand or supply.”\n\nExperts, including Carbon Equity portfolio company Octopus Energy, say updating the grid to enable more flexibility is an essential step for the transition. South Australia experienced a similar blackout in 2016. Afterwards, it strengthened its grid by introducing:\n\nBy 2023, South Australia achieved 64% renewable electricity with zero major outages.\n\nWhile helping to significantly lower CO2 emissions, the rise of EVs could also put pressure on the demand for green energy. But carmakers are preparing for a future in which your car will become more than a way of getting from A to B: it could also play an integral role in the energy ecosystem of the future.\n\nThe interview between van den Ende and TNW founder Boris Veldhuijzen van Zanten took place in Kia’s all-electric EV9, the first model equipped with vehicle-to-grid technology and bidirectional charging, allowing it to store energy gained from renewable sources and feed it back into the power grid. In fact, a fully charged EV9 with a 99.8kWh battery could power a household for about one week.\n\nIn a recent study, researchers explored the benefits of using an EV to optimise solar energy sharing between neighbours. They found that this arrangement could cut electricity costs for both households by about 1.2 cents per kilowatt-hour for the solar-owning home and 3.6 cents for the neighbor.\n\nA Fraunhofer study for T&E investigated the potential economic benefits of ‘vehicles to grid’ technology for the wider EU with some promising findings:\n• By 2040, widespread adoption of bidirectional charging could reduce annual energy system costs across the EU by 8.6%, amounting to €22.2 billion in savings per year. Even by 2030, savings of 5.5% or €9.7 billion annually are projected. Total savings between 2030 and 2040 could amount to €175.45 billion – which is almost the entire EU budget for 2023.\n• EVs could contribute up to 9% of Europe’s annual power supply, becoming the 4th largest power supplier. During peak demand periods, EVs could supply 15-20% of instantaneous electricity demand, acting as a mass distribution virtual power plant.\n• Bidirectional charging could enable an additional 430 GW of solar PV capacity by 2040, nearly doubling the current EU capacity.\n• The need for stationary battery storage could be cut by up to 92% in 2040, while backup power plant capacity could be reduced by 126 GW.\n\nPotential savings in grid expansion costs could reach €9.8 billion by 2040, but the researchers warn that this technology should not be seen as a substitute for necessary grid reinforcement and expansion.\n\nHowever, infrastructure requirements, standardization of the technology, and regulatory frameworks governing safety and fair pricing in energy trading between EV owners and utility companies are a few roadblocks that need to be worked out before we can realise the full potential of EVs.\n\nFor now, it seems the use of EVs as ‘batteries on wheels’ will be very much a community-led experiment, the learnings of which can be used to later scale up this potential. For example, studies into offsetting lost energy during working hours and developing heterogeneous energy sharing across multiple communities are all steps in a more energy efficient direction.\n\nScaling up energy community-led initiatives and experiments could be key to helping the EU move past the energy transition tipping point towards rapid adoption.",
  "medium": "Article",
  "links": [
    "https://thenextweb.com/news/worlds-biggest-sand-battery-heat-finnish-town-fossil-fuels",
    "https://www.kia.com/nl/modellen/ev9/ontdekken/",
    "https://www.transportenvironment.org/articles/batteries-on-wheels-the-untapped-potential-of-ev-batteries",
    "https://thenextweb.com/spaces/book-a-tour",
    "https://www.rescoop.eu/news-and-events/stories/july-success-story-home-renovations-following-the-seven-cooperative-principles",
    "https://thenextweb.com/news/spain-portugal-blackout-hints-at-green-energy-growing-pains",
    "https://www.sciencedirect.com/science/article/pii/S096014812401930X",
    "https://www.mdpi.com/1996-1073/18/2/393",
    "https://thenextweb.com/topic/climate-change",
    "https://www.sciencedirect.com/science/article/abs/pii/S0960148124009650",
    "https://danskfjernvarme.dk/aktuelt/nyheder/2022/tre-vindmoeller-giver-hvide-sande-uhoert-billig-fjernvarme",
    "https://thenextweb.com/sustainability",
    "https://www.linkedin.com/feed/update/urn:li:activity:7323095696331468801/",
    "https://thenextweb.com/topic/ev",
    "https://climate.ec.europa.eu/citizens-stakeholders/citizen-support-climate-action_en#:~:text=85%25%20believe%20climate%20action%20should,climate%20change%20will%20foster%20innovation.",
    "https://thenextweb.com/news/why-european-climate-tech-funding-sunk-to-five-year-low-in-q1"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "energy",
      "weight": 0.08598321
    },
    {
      "name": "clean energy",
      "weight": 0.08547376
    },
    {
      "name": "renewable energy production",
      "weight": 0.08505663
    },
    {
      "name": "green energy",
      "weight": 0.08478065
    },
    {
      "name": "excess renewable energy",
      "weight": 0.08378635
    },
    {
      "name": "lost energy",
      "weight": 0.083785355
    },
    {
      "name": "energy trading",
      "weight": 0.083717726
    },
    {
      "name": "solar energy sharing",
      "weight": 0.08334324
    },
    {
      "name": "energy saving renovations",
      "weight": 0.082944565
    },
    {
      "name": "energy bills",
      "weight": 0.08281046
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.9716796875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.91748046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.61328125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.5126953125
    },
    {
      "name": "/Science/Ecology & Environment/Climate Change & Global Warming",
      "score": 0.440673828125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.32373046875
    },
    {
      "name": "/Finance/Investing/Socially Responsible Investing",
      "score": 0.322509765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.31689453125
    }
  ],
  "sentiment": {
    "positive": 0.32391292,
    "negative": 0.41820338,
    "neutral": 0.25788364
  },
  "summary": "Jacqueline van den Ende, CEO of Carbon Equity, believes that we have already passed the climate transition tipping point, with 90% of all new electricity production worldwide generated from renewable sources. Despite this, European climate tech funding dropped to a five-year low in Q1 2025. Van denEnde believes that more investment into climate tech solutions will accelerate the transition and make clean energy accessible across the globe. She also highlighted the need for greater investment in climate tech companies. The first half of 2025 marked a significant milestone for the European battery electric vehicle market, with new registrations up 34% compared to the same period in 2024. Despite recent headlines, support for the energy transition is growing across Europe.",
  "shortSummary": "The climate transition is now in our hands, with 90% of global electricity generated from renewable sources, despite funding constraints and recent blackouts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3bc92f3605f348c1b51bc9aab3f5fe88",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://thenextweb.com/news/why-european-climate-tech-funding-sunk-to-five-year-low-in-q1",
      "text": "Europe’s climate tech startups raised $2.3bn (€2bn) in the first quarter of this year — the lowest total since Q3 2020, according to Dealroom data.\nBehind the headline figure lies a complex mix of growing pains, shifting investor focuses, and broader VC market dynamics, experts told TNW.\nMore specifically, they said the slowdown stems from a blend of market maturity, strategic repositioning, AI’s outsized pull on capital, and a tough exit environment.\n“If we use the narrative of Dunning-Kruger Curve, we are at a slope of despair in climate now, at least for investors,” Rokas Peciulaitis, founder and managing partner at Lithuania-based Contrarian Ventures, told TNW.\n“No quick wins, no massive exits, mergers and acquisitions are limited,” he added. “Most companies required more capital than assumed, and did not show enough traction. Also, the regulatory tailwind completely failed in most cases.”\nHowever, Peciulaitis believes there is light at the end of the tunnel. “I think those who are disciplined will prevail and win, both on the founder and VC side,” he said.\nThe funding dip comes off the back of an exceptional run. European climate tech funding has soared over the past decade. The sector’s best year was in 2023, when climate tech startups raised $15bn in venture capital — more than their counterparts in the US. That’s despite an overall poor funding environment that year.\nOrla Browne, head of insights at Dealroom, told TNW that there are several possible reasons why Europe’s climate tech funding has slowed down so far in 2025.\nFirstly, the market is maturing. Some forms of cleantech that previously attracted heaps of VC cash — like electric mobility startups — have gone mainstream. As these markets become more established and growth stabilises, they tend to attract less early-stage venture funding, Browne said.\nInvestor hype around AI could also be fuelling the slowdown. “AI is taking the oxygen out of VC, at least for other sectors,” Browne said. “More than 25% of all VC now goes to AI startups, up from single-digit percentages just a few years ago.”\nAnother reason for the slump could be that climate tech startups are rebranding themselves as a “resilience” or “security” play to capitalise on skyrocketing defence tech spending and Europe’s current push for tech sovereignty.\nThe dip likely also signals a broader return to normal, following an unprecedented spike in VC investment in 2021. But Peciulaitis believes there could be a lot of “unannounced deals” in the pipeline this year.\nStartup funding is one of the key themes at TNW Conference, which takes place on June 19-20 in Amsterdam. Tickets for the event are now on sale — use the code TNWXMEDIA2025 at the checkout to get 30% off.\nGet the TNW newsletter\nGet the most important tech news in your inbox each week."
    },
    {
      "url": "https://thenextweb.com/news/spain-portugal-blackout-hints-at-green-energy-growing-pains",
      "text": "Spain and Portugal have largely restored power after Monday’s unprecedented blackout — the worst in recent European history.\nThe fallout has put the region’s reliance on renewables under fire. Santiago Abascal, leader of Spain’s far-right Vox party, even called on the country to abandon “climate fanaticism” in response to the power cut. Yet, experts stressed to TNW that the problem isn’t green energy, but the outdated grid infrastructure and technology it relies upon.\n“What’s happened this week should serve as a stark reminder of the dangers of failing to invest in a more resilient energy grid,” Amsterdam-based Taco Engelaar, managing director at energy infrastructure firm Neara, told TNW.\nLast year, Portugal and Spain sourced, respectively, 87.5% and 56% of their electricity from renewables such as wind, solar, and hydropower. The two countries have both, for short periods, run their grids entirely on green energy. However, as the Iberian nations have surged ahead in the race to adopt renewables, they may have become victims of their own momentum.\nOutgrowing the grid?\nWhile wind and solar generate clean, cheap electricity, they don’t produce power in a steady stream — they rise and fall with the weather. However, grids in Europe were largely built for more predictable sources of energy like coal, gas, or nuclear plants.\nWithout that stabilising force, or the addition of alternatives like battery storage systems, the grid becomes more vulnerable to surges in electricity demand or supply. As we’ve seen this week, on rare occasions, that can overwhelm the system, causing it to crash, taking homes, businesses, and critical services offline.\n“The first thing to clarify is that this is not a net-zero issue,” Chris Glover, utilities and energy director at British engineering consultancy Buro Happold, told TNW. “The issue here is managing supply and demand.”\nThe growing mismatch between the grid’s design and its new energy mix is now playing out. But that’s no reason to hit the brakes on the energy transition, said Glover. Instead, he suggests they double down on energy storage, grid balancing tech, and infrastructure upgrades to support a more resilient system.\n‘Starved of flexibility’\nSpain and Portugal are not the first to face this challenge. A major blackout in 2016 left 850,000 South Australians without power. Critics, including Australia’s prime minister Malcolm Turnbull, pointed to the state’s ambitious shift to renewables. But rather than retreat, South Australia leaned in, investing in big batteries, so-called synchronous compressors (which mimic the stabilising “inertia” of fossil fuel-powered turbines), and even more wind and solar. Last year, the state sourced 75% of its electricity from renewables and hasn’t had another blackout since. The IEA has called its progress “remarkable.”\nAlex Schoch, head of flexibility at Octopus Energy, believes Spain could take a cue from South Australia’s success. While the latter’s blackout was caused by a storm, “both countries’ grids lacked the proper tools to recover from sudden shocks,” he wrote on LinkedIn. He called Spain’s power system one “starved of flexibility.”\nBefore the blackout, Spain’s grid was running on nearly 80% wind and solar — a huge achievement for clean energy, but also a challenge for stability. There was very little electricity coming from steady sources like gas or nuclear, which help keep the grid balanced. On top of that, Spain has almost no large-scale battery storage to step in when solar or wind drops unexpectedly.\nExperts believe these factors played a key role in Monday’s sweeping blackout. The disruption has been traced back to two separate grid disconnections in the southwest of the country — the heart of Spain’s solar energy production. With so little backup power in place, the system may have struggled to respond to these disruptions fast enough, leading to cascading failures across the network.\nWhen part of Spain’s power supply suddenly dropped, the grid should have quickly reduced demand to keep everything in balance — for example, by using batteries or other backup systems to smooth things out, Glover explained. “No such steps appear to have been taken,” he said.\nWhen power generation drops, countries can often import electricity from neighbours. However, Spain and Portugal are mostly cut off, with just a weak link to France through the Pyrenees mountains. That makes them more vulnerable during outages.\nAlthough the exact cause of the blackout is still under investigation, the disruption — which saw Spain’s grid lose 15GW of energy in just five seconds — has raised serious doubts about the region’s energy infrastructure. It could also serve as a stark warning for other countries.\nElectrification conundrum\nAs more electric vehicles plug in, heat pumps replace gas boilers, and factories switch to electric power, Europe’s ageing grids are increasingly feeling the strain. Between 2020 and 2050, electricity demand is set to jump 80%. Yet much of the infrastructure carrying that load was built decades ago. To meet climate targets, annual global grid investment needs to nearly double to $600bn by 2030, according to the International Energy Agency (IEA).\nEngelaar believes new technologies could help. “Digital modelling can give [energy] utilities granular insights into every inch of their networks, as well as allowing them to stress-test their assets against potential threats and pinpoint vulnerabilities before it’s too late.” Another software solution is demand response, which automatically adjusts electricity use in real time.\nJacob Bro, partner at climate tech VC firm 2150, also highlights the power of decentralised energy solutions. These include rooftop panels, home batteries, and local wind farms, which generate electricity closer to where it’s used.\n“Closer to our homes and offices, at the edge of the grid, we need to deploy flexible capacity, and we need smarter grids and greater transparency,” he told TNW.\nOverall, what emerges is a complex picture of rapid progress outpacing preparation. The blackout wasn’t a failure of renewables — it was a failure to keep up with them. If Europe wants a cleaner future, its grids need to catch up fast.\n“Investing in net-zero infrastructure is a core part of the solution, not the problem,” said Glover.\nGet the TNW newsletter\nGet the most important tech news in your inbox each week."
    },
    {
      "url": "https://www.transportenvironment.org/articles/batteries-on-wheels-the-untapped-potential-of-ev-batteries",
      "text": "A Fraunhofer study for T&E outlines the potential economic benefits of 'vehicles to grid' technology.\nAs Europe transitions to clean energy and zero-emission transport, electric vehicles (EVs) are emerging as 'batteries on wheels' with the potential to revolutionise our energy system. A new study by the research institutes Fraunhofer ISI and ISE reveals how bidirectional charging could transform EVs into 'virtual power plants', delivering substantial economic benefits.\nKey findings:\nMassive energy system savings: By 2040, widespread adoption of bidirectional charging could reduce annual energy system costs across the EU, by 8.6%, amounting to €22.2 billion in savings per year. Even by 2030, savings of 5.5% or €9.7 billion annually are projected. Total savings between 2030 and 2040 could amount to €175.45 billion - which is almost the entire EU budget for 2023. Those saving stem from a reduction of generation capacity, reduction of curtailment as well as reduced fuel consumption.\nEVs as a major power resource by 2040: EVs could contribute up to 9% of Europe's annual power supply, becoming the 4th largest power supplier. During peak demand periods, EVs could supply 15-20% of instantaneous electricity demand, acting as a massive, distributed virtual power plant.\nBoosting renewable energy integration: bidirectional charging could enable an additional 430 GW of solar PV capacity by 2040, nearly doubling the current EU capacity.\nReduced storage needs: the need for stationary battery storage could be cut by up 92% in 2040, while backup power plant capacity could be reduced by 126 GW.\nEV drivers could save between 4-52% on annual electricity bills, with savings ranging from €31 to €780 per year, depending on factors such as location, solar PV ownership, and vehicle battery size - this does not even include V2G services.\nGrid impact: while bidirectional charging offers positive effects on the low voltage grid, the impact is modest. Potential savings in grid expansion costs could reach €9.8 billion by 2040, but this technology should not be seen as a substitute for necessary grid reinforcement and expansion.\nBattery life considerations contrary to common concerns, bidirectional charging can extend EV battery lifetime by up to 9% compared to standard charging practices.\nHowever, while the benefits are huge the potential is not fully captured today. Not all electric vehicles are V2X capable. Crucially, there are important interoperability challenges as current focus on either AC or DC bidirectional charging by different manufacturers poses a significant barrier to widespread adoption. Ensuring interoperability between all EVs and chargers - by mandating bidirectional capability as a standard at EU level - is crucial for realizing the full potential of bidirectional charging technology.\nBy leveraging the full potential of electric vehicles as 'batteries on wheels', Europe can significantly reduce energy system costs, enhance grid stability, and accelerate the transition to renewable energy. This approach aligns perfectly with the EU's climate and energy goals, offering a win-win solution for consumers, the energy sector, and the environment.\nTo find out more, download the briefing and study.\nEU cave in on vehicle trade rules\nPedestrians, cyclists and drivers are at increased risk as the rapid rise in monster US pick-up trucks on Europe’s roads is set to accelerate after th...\nEU budget falls short at boosting competitiveness\nT&E reaction to the post-2027 EU budget proposal\nAfter the battery is depleted, EREVs consume an average of 6.4 litres per 100 km – no better than a conventional petrol SUV, new analysis finds."
    },
    {
      "url": "https://www.kia.com/nl/modellen/ev9/ontdekken/",
      "text": "7 zitplaatsen\n249km\nin 15 minuten\nmet 563km\nrange (WLTP)\nDe super-SUV met 508 pk, waarmee je in\n4,6 seconde van 0 naar 100 km/u schiet.\nDe EV9 tilt energie-efficiëntie naar een nieuw niveau. Met de Vehicle-to-load (V2L) functie maak je van de EV9 een stopcontact. Ideaal om je laptop op te laden of een ander elektrisch apparaat aan te sluiten. De EV9 is voorbereid op de toekomst met Vehicle-to-grid (V2G), waarmee je energie kunt terugleveren aan je huis of het elektriciteitsnet.\nOntdek het duurzame materiaalgebruik in het interieur van de Kia EV9.\nHaal nog meer uit je Kia-ervaring met upgrades die je met één druk op de knop kunt ontgrendelen.\nDe lange wielbasis en het volledig vlakke ontwerp van het Electric Global Modular Platform (E-GMP) zorgen voor meer ruimte en verbeterde algehele prestaties en bereik. De indrukwekkende stuur- en remprestaties, het stille interieur en de fijne draaicirkel dragen allemaal bij aan jouw rijplezier.\nKies tussen achterwielaandrijving en vierwielaandrijving om ervoor te zorgen dat jouw EV9 het bereik en de prestaties levert die jij zoekt.\nRWD (achterwielaandrijving)\nMet het nieuwe batterijpakket van 76,1kWh brengt de EV9 jou 443 kilometer ver. Laad ultra-snel 249 km in 15 minuten en in 20 minuten van 10% tot 80%.\nRWD (achterwielaandrijving)\nGecombineerd met het 99,8 kWh batterijpakket brengt deze achterwielaangedreven uitvoering je tot 563 km ver op één lading. Laad ultra-snel 249 km in 15 minuten, zodat je langer onderweg kunt blijven.\nAWD (vierwielaandrijving)\nHet e-AWD-systeem van de EV9 biedt geoptimaliseerde efficiëntie in combinatie met superieure grip en prestaties.\nMet de verschillende uitrustingsvarianten geef je jouw EV9 een persoonlijk tintje.\nNiets is zo belangrijk als een ervaring. Plan je proefrit bij de jouw dealer in de buurt."
    },
    {
      "url": "https://thenextweb.com/spaces/book-a-tour",
      "text": "Book a tour!\nLet’s show you around.\nJoin the Ecosystem\nPlug into something bigger\nBecome part of Amsterdam’s boldest tech hub. Rent a private office, claim your dedicated desk, or get flexible with a membership. However you join, you’ll plug into a community of founders, freelancers, and innovators driving what’s next.\nHost in the Ecosystem\nEvents that hit different\nBring your event into the heart of innovation. From workshops and networking nights to product launches and summits, our event space offers the perfect backdrop. You'll tap into the TNW community, gain visibility in Amsterdam’s buzzing tech scene, and create experiences people remember."
    },
    {
      "url": "https://danskfjernvarme.dk/aktuelt/nyheder/2022/tre-vindmoeller-giver-hvide-sande-uhoert-billig-fjernvarme",
      "text": "Tre vindmøller giver Hvide Sande uhørt billig fjernvarme\nEl fra vindmøller og et produktionssystem med en elkedel og varmepumpe til at udnytte det, har i år givet Hvide Sande Fjernvarme en varmepris på 4.273 kroner. Midt i en energikrise har den grønne investering for alvor givet pote i havnebyen, og derfor er vindmøllerne også blevet en del af den lokale identitet.\nDet bliver svært at slå Hvide Sande Fjernvarme, hvis man har ambitioner om at bejle til titlen som ”Danmarks billigste fjernvarme” anno 2022.\nI så fald skal man toppe en pris på sølle 4.273 kroner for et standardhus.\nAllerede tilbage i maj kunne Hvide Sande Fjernvarme nemlig melde ud, at man sløjfede årets sidste to rater og sænkede den forventede årlige fjernvarmepris med mere end 50 procent – fra 9.903 kroner til de før omtalte 4.273 kroner.\nForklaringen på det skal findes i tre af landets mest effektive vindmøller, som har en optimal placering ved den lokale havn, lige ud mod Vesterhavet. De tilhører Hvide Sande Fjernvarme og er ledningsforbundet direkte med fjernvarmeværket. Møllerne producerer ofte mere el, end fjernvarmeselskabet selv kan nå at bruge på deres elkedel og varmepumpe - resten sælger de derfor ud på elnettet.\nOg det er en exceptionelt god forretning for tiden, hvor elpriserne er skyhøje og svinger omtrent lige så meget som rotorbladene på Hvide Sandes vindmøller på en blæsende dag.\nMidt i en energikrise giver det mange fordele – men driftsleder Morten Rauhe fremhæver særligt én: Det har gjort Hvide Sande Fjernvarme selvfinansierende.\n- I og med at vi ikke skal købe en masse gas, som er steget markant, kan vi levere fjernvarmen til en fast pris. Og de øgede elpriser er med til at højne prisen på den strøm, vi sælger. Vi har desuden en akkumuleringstank, som vi bruger som buffer, når strømmen er dyr, siger han og fortsætter:\n- Det kræver selvfølgelig, at vi tænker smart, når vi regulerer ud på elnettet. Til det har vi en softwareløsning fra EMD, som hjælper os med at forudsige, hvordan vi kører produktionen og handler med el.\nI og med at vi ikke skal købe en masse gas, som er steget markant, kan vi levere fjernvarmen til en fast pris. Og de øgede elpriser er med til at højne prisen på den strøm, vi sælger. Vi har desuden en akkumuleringstank, som vi bruger som buffer, når strømmen er dyr.\nRobust, grøn varmeproduktion\nFor nylig kunne Hvide Sande Fjernvarme melde ud, at varmeprisen i 2023 forbliver på et uhørt lavt niveau – nemlig 5.241 kroner.\nFjernvarmeselskabets budget følger nemlig prognoserne for elprisen – og forventningen er, at den vil forblive høj til næste år. Morten Rauhe understreger dog, at man i Hvide Sande har en fornuftig varmeproduktion, krise eller ej. Arbejdet med den grønne omstilling går nemlig helt tilbage til 2011 – og i 2020 modtog man Fjernvarmeprisen for de grønne tiltag.\n- Vores bestyrelse og den tidligere driftsleder har investeret i grøn fjernvarme med solvarme, tre vindmøller og en elkedel. Det supplerede vi så i oktober 2020 med en 4,6 MW varmepumpe. I dag er mellem 85 og 90 procent af varmen grøn – og naturgassen bruger vi kun til spidslast, fortæller han.\nElkedlen kom til i 2011, mens solvarmen blev koblet på fjernvarmenettet i 2014 og i dag bidrager med over 10% af varmeproduktionen. Men det er og bliver de tre vindmøller, som lige nu gør den helt store forskel for varmeprisen i Hvide Sande.\nDe indledende overvejelser om at investere i vindmøllerne kom i 2016, hvor de i perioder stod stille, fordi elprisen var så lav, at det ikke kunne betale sig for de daværende ejere at have dem kørende.\nVind var på det tidspunkt ikke en god forretning – men i dag er Morten Rauhe i hvert fald ikke i tvivl om, at fjernvarmeselskabet lavede en god investering på det helt rette tidspunkt.\n- Man tænkte i Hvide Sande Fjernvarme, at det var latterligt at brænde gas af, mens de lokale vindmøller stod stille. Hvorfor lukke CO2 ud i atmosfæren, når man lige så godt lave grøn energi ved at kombinere vindmøllerne med en elkedel? Derfor valgte man at købe dem over tid – de to første i 2018 og den sidste i 2019, fortæller driftslederen.\nEt lokalt vartegn\nDet med vindmøller i baghaven er ofte genstand for lokale kontroverser og utilfredse naboer. Men i Hvide Sande er lige det modsatte faktisk tilfældet. Her er de tre vindmøller sammen med marhalmen i baggrunden blevet et vartegn, som er med på postkort fra byen. Og de indgår også i Hvide Sande Fjernvarmes logo.\nDen store opbakning til vindmøllerne, tilskriver Morten Rauhe det sammenhold, man har i byen. Og han kan kun give cadeau for, at Hvide Sande har taget dem til sig på den måde.\n- Alle i byen får gavn af vindmøllerne, og jeg vil næsten også vove at påstå, at alle forbrugerne kan se dem fra et eller andet hjørne af deres grund, siger han og fortsætter:\n- Den helt store fortælling da de blev bygget var, at de skulle finansiere en havneudvidelse. Og havnen er jo hjertet i Hvide Sande. Derfor står møllerne på en lejet grund, som tilhører havnen. Jo flere penge, møllerne genererer, jo større bliver havnelejen. Så vi giver til alle, når vi producerer el på dem - både forbrugerne og havnen. Det har en enorm betydning for byen, og så bliver vindmøller jo pludselig flotte at se på, siger han.\nDet forventes, at der alene i 2022 vil blive betalt et arealleje til havnen for vindmøllerne på et sted mellem ni og ti millioner kroner.\nAlle i byen får gavn af vindmøllerne, og jeg vil næsten også vove at påstå, at alle forbrugerne kan se dem fra et eller andet hjørne af deres grund.\nFremtiden er grønnere – men byder nok ikke på flere vindmøller\nSelvom vindmøller ikke møder samme modstand i Hvide Sandes baghaver som så mange andre steder, er der ikke udsigt til flere møller i havnebyen, siger Morten Rauhe.\nDe tre, man allerede har, matcher nemlig varmeproduktionen ret godt. Og med en tilslutningsprocent i Hvide Sande på 96 procent, mener driftslederen ikke, at det giver den store mening at sætte flere op. Der er nemlig ikke rigtig plads til flere fjernvarmeudvidelse i havnebyen, som ligger forholdsvis isoleret.\n- Så hvis vi skal have flere forbrugere, skal vi langt ud. De sidste fire procent, vi mangler i byen, er primært varmepumper, som folk har investeret i for nylig. Men jeg tror da ikke, at der er tvivl om, at alle – også dem med varmepumper – gerne vil på fjernvarmen, mener driftslederen.\nHeldigvis er konverteringer ikke den eneste måde at tænke i grønne ambitioner på. Når man nu ikke kan udvide forbrugerbasen, kan man nemlig i stedet forsøge at gøre fjernvarmen endnu mere miljøvenlig. Og det er også målet i Hvide Sande.\n- Det kunne da være sjovt at blive 100 procent grønne og helt fri for naturgas. Men de nærmeste fremtidsplaner drejer sig om at få mere akkumulering, så vi kan lagre mere fjernvarmevand, når det for alvor blæser. Derfor har vi planer om at bygge en ny akkumuleringstank, som vi udnytter afhængigt af vejret, siger Morten Rauhe og uddyber:\n- Også for at beskytte os selv mod store udsving i energipriserne. Jeg tvivler på, at de bliver mindre svingende, efterhånden som vi får mere sol- og vindenergi ind i vores energiproduktion."
    },
    {
      "url": "https://thenextweb.com/topic/ev",
      "text": "Startup company Tallinn startup bags €2.3M to turn CO2 into ‘critical’ graphite for EV batteries Ioanna Lykiardopoulou 1 year ago\nStartup company Dutch EV charging startup raises €27.5M to grow European network Ioanna Lykiardopoulou 1 year ago\nStartup company Startup bags €8.5M to bolster Europe’s EV battery upcycling Ioanna Lykiardopoulou 1 year ago\nStartup company EV charging startup VOOL bags €2.9M to scale production, optimise grid usage Ioanna Lykiardopoulou 1 year ago\nMobility New discovery could lead to faster-charging and longer-range EVs Ioanna Lykiardopoulou 2 years ago\nEV This ‘factory in a box’ promises affordable EV production anywhere in the world Thomas Macaulay 2 years ago\nBattery pack Electric hypercar Rimac Nevera smashes 23 performance records in a single day Ioanna Lykiardopoulou 2 years ago\ntech Stockholm is a world-class tech hub: 6 startups and scaleups to watch Ioanna Lykiardopoulou 2 years ago\nbattery BMW backs German startup to deliver ‘next generation’ of EV motors Siôn Geschwindt 2 years ago"
    },
    {
      "url": "https://climate.ec.europa.eu/citizens-stakeholders/citizen-support-climate-action_en#:~:text=85%25%20believe%20climate%20action%20should,climate%20change%20will%20foster%20innovation.",
      "text": "Even in the face of heightened geopolitical tensions climate change remains among the top three concerns of Europeans. A large majority support action across the EU to tackle the climate crisis and make Europe the first climate-neutral continent, according to the latest Eurobarometer survey by the European Commission.\n2025 Survey\nThe image is an infographic detailing the strong support among European Union citizens for climate change initiatives and sustainability goals.\n- 85% of EU citizens believe climate change is a serious problem\n- 81% support the EU's goal of becoming climate neutral by 2050\n- Almost 9 in 10 support more EU action to boost renewables and improve energy efficiency\nMain survey findings\nEuropeans continue to take climate change seriously\n- European citizens identify climate change as the joint third most serious problem facing the world, alongside the economic situation and behind armed conflicts and poverty, hunger, and lack of drinking water.\n- 85% of respondents consider climate change a serious problem for the world.\nStrong support for action to tackle climate change and the clean transition\n- 81% of respondents support the EU’s goal of reaching climate neutrality by 2050.\n- Over three quarters (77%) agree that the cost of damage caused by climate change outweighs the cost of transitioning to a climate-neutral economy, while 88% support greater investment in renewables and energy efficiency by the EU.\n- More than eight in ten Europeans (84%) agree more support should be given to European companies to compete in the global market for clean technologies, demonstrating public backing for the Clean Industrial Deal.\n- Citizens see national governments (66%), the EU (59%), and business and industry (58%) as best placed to tackle climate change.\nClimate change is personal\n- A growing share of Europeans (38%) also report feeling personally exposed to environmental and climate-related risks.\n- In 8 Member States, more than half of citizens report feeling this exposure, particularly in Southern Europe, Poland, and Hungary.\n- Two thirds of Europeans said that they consider extreme weather conditions when deciding on a holiday destination.\nEuropeans are aware of the benefits of the transition\n- Citizens see climate action not only as necessary but beneficial—both economically and socially.\n- 85% believe climate action should be a priority to improve public health, while 83% agree that preparing better for the adverse impacts of climate change will improve the lives of EU citizens.\n- 77% of Europeans agree that acting on climate change will foster innovation.\n- Three quarters of respondents believe reducing fossil fuel imports will enhance energy security and benefit the EU economically.\nMost Europeans are consciously making choices for the climate\n- More than half (59%) of Europeans say they have taken an action in the past six months that combats climate change, most notably by reducing and recycling waste (64%) and cutting down on consumption of disposable items whenever possible (49%).\n- Just over a third (34%) of Europeans take account of lower energy consumption when buying a new household appliance, while just over a quarter regularly use environmentally-friendly alternatives to a private car.\nInformation gaps remain\n- While 84% agree that climate change is caused by human activity, 52% say traditional media fail to provide clear information on climate change, its causes and impacts.\n- Looking more widely at communication channels, 49% believe that it is difficult to differentiate between reliable information and disinformation about climate change on social media.\nFull report and individual Member State information\n- Full report\n- 03/03/2014 - IP/2014/201 - Turn to climate action for a job-rich economic recovery, Europeans say\n- Full report\n- 07/10/2011 - IP/2011/1162 - Climate change: Survey shows increased public concern, awareness of economic benefits of action\n- Full report\n- 02/12/2009 - IP/2009/1858 - Eurobarometer: Climate change the second most serious problem faced by the world today\n- Full report\n- 11/09/2008 - IP/2008/1314 - Strong public support for EU targets on climate change"
    },
    {
      "url": "https://www.linkedin.com/feed/update/urn:li:activity:7323095696331468801/",
      "text": "How Spain’s 2025 Blackout Could Have Been Avoided: Lessons from Batteries, Demand Response, and South Australia Yesterday, Spain and Portugal experienced a massive blackout, causing widespread disruptions. This event mirrored South Australia's 2016 crisis but highlighted a critical difference: South Australia learned from its mistakes and built resilience through battery storage and demand response. Two Blackouts, One Root Cause Spain 2025: A Grid Starved of Flexibility Spain's grid failure began with a loss of generation, triggering instability. The system couldn’t stabilise quickly enough, causing interconnectors to France to trip and leading to a loss of 15GW of power. Key factors included: Low inertia: 70% of Spain’s power came from renewables, lacking the inertia traditionally provided by fossil fuel plants. No rapid response: Scarce batteries and demand response meant reliance on slower-acting gas plants, hydro, and imports. South Australia 2016: Stormy Weather Meets Outdated Systems South Australia’s blackout was triggered by storm damage, but the real issue was outdated protection settings: Wind farms disconnected due to voltage dips. The interconnector to Victoria overloaded and tripped. Both grids lacked the tools to recover from sudden shocks. How South Australia Fixed Its Grid After 2016, South Australia rebuilt its grid, focusing on flexibility. The Hornsdale Power Reserve (Tesla Big Battery) was key: Batteries stepped up: Hornsdale’s 150 MW battery provided synthetic inertia and fast frequency response (FFR). It responded in 0.14 seconds during an outage, versus minutes for traditional generators. Demand response joined: Aggregated rooftop solar, batteries, and smart thermostats balanced supply and demand. Grid settings modernised: Updated requirements kept wind farms online during disturbances. By 2023, South Australia achieved 64% renewable electricity with zero major outages. #energytransition #smartgrid #flexibility #batterystorage Octopus Energy Greg Jackson Roberto Giner Anna Casas Llopart Mark Twidell Josef Tadich Drew Baglino Marcia Poletti smartEn Smart Energy Europe\nThe Blueprint Spain Needs Now Drawing on South Australia’s playbook, here’s the path forward: 1. Accelerate Battery Deployment Target: 20 GW of grid-scale batteries by 2030 (up from <1GW). Focus: Prioritise projects offering synthetic inertia and frequency management. Funding: Redirect EU recovery funds to storage. Make domestic batteries smart: Allow home batteries to provide grid services. 2. Unlock \"Hidden\" Demand Flexibility Automate demand response: Use smart devices to react in real-time to grid signals. Aggregate everything: Pool EVs, heat pumps, and industrial loads into virtual power plants (VPPs). Open markets: Allow smart devices to provide fast demand response. 3. Modernize Grid Protocols Update protection settings: Ensure solar/wind farms stay online during disturbances. Build interconnectors: Double capacity to France by 2030. Plan for a decentralised smart system: Incentivise renewable generation to actively support the grid. 4. Reward Speed in Energy Markets Pay for milliseconds: Create markets that value synthetic inertia and sub-second response. End fossil fuel favours: Phase out subsidies for gas peakers.\nIt is reasonable to assume that the lack of inertia in the system is not due to lack of knowledge. Assuming the knowledge/ understanding was there - the fact that there was shortage might reflect budgetary limitations or overly optimistic projections. if budget constraints were indeed the culprit: i wonder if the cost of the outage + kicking things back into operation was high enough to trigger proper budget allocation.\nLoss of inertia has likely occurred on the load side too with more inverter based appliances. And, while there has certainly has been a loss of inertia provided by generation I've not seen this quantified... but it seems to be the magnet for blame. Strategies to help stop a cascade could include using different protection and fault response characteristics across the portfolio of generation. This would change the timing of trips.. a very small change to the rate of change in generation online and hence frequency can give protection and dispatch the milliseconds needed to stop a cascade. Note that all large machines (e.g. the nukes) tripped simultaneously. Almost all inverter based generation could apply control strategies to inject reactive power in emergencies, this is done for over voltages using AS4777... but similar could be implemented for under voltages... reducing real power while flex is reducing load.. distributed control is needed!\nI wasn't aware that the root cause in the Spanish / Portuguese outage had been identified yet. Having said that, what you've implied does make sense.\nThanks for the clarity on the Iberian Island chaos this week, as shared by Giles Petersen of Renew Economy. We at #Asynsis suggest #MetaLoop PRT-VPP networks are the multi-modal way forward to build greater renewables-led grid resilience by serving as distributed big batteries and virtual power plants via our personal rapid transit concept. New video here: https://asynsis.medium.com/metaloop-f5caa684d1e9\nSimple and powerful 🔋 🦾\nGreat post Alex - two further thoughts: 1.Across Europe we need to be designing the post-transition electricity systems now (in particular how will we cost effectively run electricity systems with low inertia and limited dispatchable power - answer of course: synthetic inertia from inverter based generation, lots of assets capable of fast frequency response - such as grid scale batteries, and lots of dispatchable demand (including bringing forward V2G quickly) 2. We then need to ask why these things are not happening with current market structures - why the UK has 5-8 GW of Grid Scale BESS already on the system, and at least 1.6GW of demand response participating in capacity market, balancing mechanism, and DSO markets versus the 10MW of BESS in Spain and no demand response (outside SRAD).\nIt’s bizarre how you can write here with such clarity and insight, and in contrast, not keep on top of Sunday plans for a roast dinner.\nLeading the Energy Transition as VP / Group Director, Flexibility & Electrification at Octopus Energy\n4moHow Batteries and Demand Response Could Have Saved Spain Spain’s grid was vulnerable due to: No synthetic inertia: Minimal battery storage to compensate for solar/wind. Slow demand response: A 15+ minute activation time was too slow for a rapid crisis. Islanded grid: Limited interconnectors left Spain isolated. Here’s what could have helped: 1. Grid-Scale Batteries: The Inertia Insurance Policy Batteries provide synthetic inertia and FFR. South Australia's Hornsdale slashed grid stabilization costs and prevented outages. Spain had only <1 GW of batteries vs. 50 GW of solar/wind, missing a rapid-response safety net. 2. Instant Intelligent Demand Response Instant access to resources like smart water heaters, EV chargers, and factory loads could have further stabilised the system. South Australia’s demand response shaved 200+ MW off peak demand. Spain’s 15-minute activation was too slow. 3. Interconnectors + Market Reform Upgraded interconnectors helped South Australia in later storms. Spain’s weak links to France provided no lifeline."
    },
    {
      "url": "https://www.rescoop.eu/news-and-events/stories/july-success-story-home-renovations-following-the-seven-cooperative-principles",
      "text": "Stories\nJuly success story: Home renovations following the seven cooperative principles\nCommunity energy is key to action on the climate crisis. It can empower people, boost local economies, and reinvigorate communities. Community-led initiatives play an important role in the transition towards a 100% renewable and just energy future. Success stories of community energy projects can be found all over Europe. At REScoop.eu we want to highlight these stories to further accelerate the movement towards a cleaner and democratic system.\nThis month, we travel to Ireland on 6 July to celebrate the International Day of Cooperatives with EcoVision, a community-owned cooperative dedicated to citizen-led renovations.\nRenovations in the hands of citizens\nEcoVision, formerly known as Energy Communities Tipperary Cooperative, was established in 2015 by four local communities to carry out energy efficiency projects for old homes and community buildings in County Tipperary, Ireland. Since then, they have upgraded more than 900 houses and 50 community and commercial buildings, saving over 10 GWh of energy, the equivalent of the average annual electricity consumption of more than 2,300 Irish households.\nHome renovations allow inhabitants to save energy, reduce their energy bills, and enhance their comfort. When these renovations are carried out following the seven cooperative principles, they offer additional benefits. As a non-profit organisation, EcoVision provides impartial advice and can offer better prices than profit-driven organisations. With the long-term social transformation of communities in Clare, Limerick and Tipperary as its main objective, EcoVision prioritises local contractors, boosting the local economy and creating employment in the area. Moreover, it supports other community projects in the region.\nEcoVision pioneered citizen-led renovations with a one-stop-shop approach in Ireland. This model, developed organically by EcoVision, provides an integrated solution for home renovation services, simplifying the process for customers and guiding them throughout the entire renovation journey.\nA project based on cooperative principles\nA volunteer board of directors oversaw EcoVision’s activities for many years. However, in 2022, due to the growth in the number of members and activities, the board deemed it necessary to recruit a general manager. Máirtín Ó Méalóid, previously the general manager of the development cooperative of Cape Clear Island, was chosen for the position. Máirtín decided to join EcoVision because its ethos aligned with his own: the cooperative principles.\nDespite being registered as a company limited by guarantee – a legal structure usually used by non-profit companies in Ireland – EcoVision operates according to the cooperative principles. “It is a cooperative in principles, structure, and action,” Máirtín notes, and emphasises that “the legal structure isn’t important; what is important is how we function, behave, and treat our members, staff, and other citizens.”\nFor Máirtín, the cooperative principles mean “working together as a collective of equals to improve the lives of the community and build a better and more sustainable society for everyone”.\nToday, the volunteer board of directors steers EcoVision activities, while Máirtín handles the daily management, reporting to the board in monthly meetings. In the transformation from Energy Communities Tipperary Cooperative to EcoVision, a number of changes have been made to the cooperative’s statutes to allow for a broader membership. Beginning in autumn 2024, on top of the annual general meeting, there will be three online open member meetings per year to facilitate information exchange. This governance system ensures democratic member control, in line with the second cooperative principle.\nConcern for community\nLike many cooperatives, EcoVision is a non-profit organisation, but Máirtín clarifies this concept.\n“Profit is not a bad word. If you are not making a profit, you are making a loss, and then you are finished. You have to make profit, but what’s important in a social enterprise is what you do with that profit. At EcoVision, it goes back into the cooperative development and to our community fund, which helps our community member organisations with energy projects.”\nFor example, in Lorrha, a village within one of the member communities where the last shop closed years ago, EcoVision contributed to the energy aspects of a building renovation to host a new community shop and café. Last month, they also installed solar PV on the roof to supply the shop and café with solar energy.\nThis perfectly exemplifies the seventh cooperative principle: “Cooperatives work for the sustainable development of their communities through policies approved by their members.”\nEducation, training and information\nEcoVision also adheres to the fifth cooperative principle regarding education, training and information for staff, members and the general public. One of its main services is helping citizens access renovation grants from the Sustainable Energy Authority of Ireland (SEAI). When working with new contractors, the cooperative offers upskilling in sustainable renovations and organises workshops on the technical requirements of the SEAI funding programmes.\nEcoVision’s Energy Saving Champion Programme focuses on the general public. They train energy saving champions who then guide people in their community on how to best reduce domestic energy consumption and improve energy efficiency.\nReplicating the citizen-led renovation model\nWhen asked for advice to other cooperatives aiming to get involved in citizen-led renovations, Máirtín draws on the sixth cooperative principle, which refers to the cooperation among cooperatives.\n“My advice would be to look at the work of cooperatives. There’s no need to reinvent the wheel. Organisations like EcoVision, People Powered Retrofit in the UK, Energent in Belgium, and Les 7 Vent in France are already doing citizen-led renovations. Together we are trying to advance cooperative One-Stop Shop building renovation services in Europe through the OSR-Coop project. I invite people to follow the project and join our capacity building activities.”\nMáirtín also mentions REScoop.eu’s citizen-led renovation working group, where REScoop.eu members collaborate and share knowledge, experience, and best practices on deep and shallow renovations."
    },
    {
      "url": "https://thenextweb.com/news/worlds-biggest-sand-battery-heat-finnish-town-fossil-fuels",
      "text": "A small town in Finland is about to ditch fossil fuels in its heating network thanks to a sand-filled energy storage tank the size of a house.\nFinnish startup Polar Night Energy recently turned on the so-called sand battery in the municipality of Pornainen, an hour north of Helsinki.\nThe machine, which uses dirt to store excess renewable energy as heat, will warm the homes and businesses in the town of 5,000 people. It is expected to replace natural gas and oil in Pornainen’s district heating network entirely, slashing emissions by an estimated 70%.\n“This project is a powerful example that effective solutions for mitigating climate change do exist,” said Liisa Naskali, COO at Polar Night Energy. “Combustion is not a sustainable option for the climate or the environment.”\nThe energy-storing structure measures about 13 metres tall and 15 metres wide and is filled with 2,000 tonnes of crushed soapstone, a byproduct of the construction industry. The new battery is 10 times larger than the startup’s first pilot plant in Pornainen, launched in 2022.\nWhen renewables are abundant, like on a sunny or windy day, clean electricity is wired to the battery. There, it powers a heater that sends hot air through a series of pipes into the giant vat of sand, heating it to a toasty 600°C.\nThanks to the battery’s insulated wall, this energy can be stored for weeks or even months. When needed, the battery discharges the hot air on demand — warming water in the district heating network. This can provide heat to households, factories, and even swimming pools.\n“Of course, we alone cannot solve the whole problem of climate change, but we need different solutions, and our sand battery is one of them,” said Naskali in a video.\nWith a power output of 100 MWh, Polar Night estimates the battery will be able to heat the whole town of Pornainen for a week in winter, or an entire month in summer when demand is lower — on just one charge. The town will still maintain a biomass boiler, which burns wood chips, as a backup source of energy during peak demand.\nCharging the sand battery from ambient temperature to 600°C takes about four days. However, in practice, it’s continuously topped up with excess renewable energy whenever it’s available — so it rarely drops back to the temperature of the surrounding air.\nPolar Night said it is currently discussing installing new, bigger sand batteries in Finland and internationally. It aims to offer a cleaner alternative to fossil fuels for heating homes.\nAccording to the International Energy Agency (IEA), heating accounts for around half of total energy consumption. In Europe, the majority of this heat comes from burning natural gas, oil, wood chips, or waste.\nFor European towns, especially ones with access to lots of renewable energy, sand batteries could be low-hanging fruit. If scaled, they could become a significant part of the energy storage toolbox, alongside other options such as lithium-ion, gravity, hydropower, and CO2 domes.\nWant to discover the next big thing in tech? Then take a trip to TNW Conference, where thousands of founders, investors, and corporate innovators will share their ideas. The event takes place on June 19–20 in Amsterdam and tickets are on sale now. Use the code TNWXMEDIA2025 at the checkout to get 30% off.\nGet the TNW newsletter\nGet the most important tech news in your inbox each week."
    },
    {
      "url": "https://thenextweb.com/topic/climate-change",
      "text": "European Union Europe needs more skilled workers to build the green economy Sandra O Connell 2 years ago\nclimate change Europe plots to replace natural gas with geothermal energy Ioanna Lykiardopoulou 2 years ago\nSustainability Climate risks are a major business threat – here’s how AI can help Marris Adikwu 2 years ago\nArtificial intelligence AI project brings the climate crisis to your home Thomas Macaulay 3 years ago\nclimate change Why digital twins emerge as the ‘ultimate’ tool for resilient cities Cities Today 3 years ago\nclimate change How ‘pee bacteria’ could change electricity production as we know it The Conversation 4 years ago\nExhaust gas Engineers have built machines to scrub CO2 from the air – and it could halt climate change The Conversation 4 years ago\nAtmosphere Earth has been habitable for billions of years — simulations show it was ‘just luck’ The Conversation 4 years ago\nclimate change 9 reasons why policymakers should tackle climate change with small-scale solutions The Conversation 4 years ago"
    }
  ],
  "argos_summary": "The article argues that the global climate transition has already passed its tipping point, with 90% of new electricity coming from renewables, yet European climate‑tech funding has fallen to a five‑year low. It highlights community‑led energy initiatives, EV vehicle‑to‑grid technology, and innovative storage solutions like Finland’s sand battery as key drivers for accelerating the transition. Despite public support for climate action, the piece stresses the need for increased investment, grid flexibility, and policy alignment to sustain momentum and avoid outages such as Spain’s 2025 blackout.",
  "argos_id": "KNA2K74JK"
}