{
  "url": "https://finance.yahoo.com/news/vetcomm-ceo-kate-monroe-pays-165000176.html",
  "authorsByline": "VETCOMM US",
  "articleId": "cebdab0e6e3846e6aebf636f1d10efd6",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/accesswire.ca/dbd345af7e067ab5169b4cbc03969c6c",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T16:50:00+00:00",
  "addDate": "2025-09-02T17:17:04.462612+00:00",
  "refreshDate": "2025-09-02T17:17:04.462613+00:00",
  "score": 1.0,
  "title": "VetComm CEO Kate Monroe Pays Off Injured Air Force Veteran's GoFundMe After Horrific Car Accident",
  "description": "SAN DIEGO, CA / ACCESS Newswire / September 2, 2025 / In an extraordinary act of compassion and leadership, Marine Corps veteran and VetComm CEO Kate Monroe has paid off the GoFundMe fundraiser for Staff Sergeant Veronica Chacon, an injured Air Force ...",
  "content": "SAN DIEGO, CA / ACCESS Newswire / September 2, 2025 / In an extraordinary act of compassion and leadership, Marine Corps veteran and VetComm CEO Kate Monroe has paid off the GoFundMe fundraiser for Staff Sergeant Veronica Chacon, an injured Air Force reservist and mother of twin girls, after visiting her at home in San Diego.\n\nOn July 27, Chacon and her daughters were struck by an uninsured 18-year-old driver in a devastating crash. Chacon suffered two broken legs, while her daughters sustained serious injuries, including internal bleeding, a broken nose, and a dislocated shoulder.\n\nMoved by their plight, Monroe visited the family personally, bringing a gift basket of toys and essentials. During the visit, she pulled up Chacon's GoFundMe page and paid off the balance in full, ensuring that immediate medical costs were covered.\n\nMonroe also pledged to provide ongoing caregiver support, food deliveries, and assistance with Chacon's VA disability claim, underscoring VetComm's mission to stand with veterans in their greatest time of need.\n\n\"Nobody matters more to me than our veterans and their families,\" said Monroe. \"When I saw Veronica and her daughters' situation, I knew I had to act. This isn't charity-it's duty.\"\n\nThe story has already gained significant local and national traction, with coverage by both ABC10 News and Fox5 San Diego.\n\nChacon's GoFundMe fundraiser remains active for those who wish to contribute to her long recovery journey: Sgt Chacon's Fundraiser Link\n\nFounded by Marine Corps veteran Kate Monroe, VetComm US is a veteran-first organization dedicated to helping service members and their families navigate the VA disability claims process. Through personalized assistance, national advocacy, and education, VetComm empowers veterans to access the benefits they earned through service.",
  "medium": "Article",
  "links": [
    "https://pr.report/dsx6",
    "https://pr.report/dsx5",
    "https://pr.report/dsx4",
    "https://www.accessnewswire.com/",
    "https://www.accessnewswire.com/newsroom/en/business-and-professional-services/vetcomm-ceo-kate-monroe-pays-off-injured-air-force-veterans-gofu-1067853"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Marine Corps veteran Kate Monroe",
      "weight": 0.10597601
    },
    {
      "name": "VetComm CEO Kate Monroe",
      "weight": 0.0956863
    },
    {
      "name": "Veronica Chacon",
      "weight": 0.09177505
    },
    {
      "name": "Staff Sergeant Veronica Chacon",
      "weight": 0.08882253
    },
    {
      "name": "veterans",
      "weight": 0.086925566
    },
    {
      "name": "Kate Monroe",
      "weight": 0.084110186
    },
    {
      "name": "Chacon",
      "weight": 0.083912894
    },
    {
      "name": "Marine Corps veteran and VetComm CEO Kate Monroe",
      "weight": 0.079021156
    },
    {
      "name": "VetComm US",
      "weight": 0.07118057
    },
    {
      "name": "Monroe",
      "weight": 0.070581295
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    },
    {
      "name": "Traffic"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.91943359375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.8037109375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.787109375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.64013671875
    },
    {
      "name": "/News/Other",
      "score": 0.63134765625
    },
    {
      "name": "/Law & Government/Public Safety/Emergency Services",
      "score": 0.51171875
    },
    {
      "name": "/News/Local News",
      "score": 0.30859375
    }
  ],
  "sentiment": {
    "positive": 0.58430195,
    "negative": 0.14284019,
    "neutral": 0.27285784
  },
  "summary": "Marine Corps veteran and VetComm CEO Kate Monroe has paid off the GoFundMe fundraiser for Staff Sergeant Veronica Chacon, an injured Air Force reservist and mother of twin girls, after visiting her at home in San Diego. Chacon and her daughters were hit by an 18-year-old driver in a car accident on July 27, resulting in two broken legs and serious injuries. During her visit, Monroe brought a gift basket of toys and essentials and pledged to provide ongoing caregiver support, food deliveries, and assistance with Chacon's VA disability claim.",
  "shortSummary": "Mariner Kate Monroe, CEO of VetComm US, paid off the GoFundMe fundraiser for injured Air Force reservist Veronica Chacon, ensuring immediate medical costs and ongoing support for her recovery.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a4fa689d56bb4fbcafe28897e28398a2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://pr.report/dsx6",
      "text": "Help Support USAF SSgt Chacon and her Twins after car crash.\nDonation protected\nHelp Support USAF Airman, SSgt Chacon & Her Twin Daughters After Devastating Car\nWe are reaching out to you with heavy hearts on behalf of a brave United States Air Force Airman, SSgt Chacon, from the 701st Combat Operations Squadron at March Air Reserve Base. This dedicated mother of twin daughters was en route to serve her country when her life was tragically altered.\nAn 18-year-old male, speeding in a sports Infinity car, struck the Airman’s vehicle in a devastating head-on collision. The crash left her with severe injuries — both legs were broken from the knees down. Her young twin daughters also suffered serious injuries: one sustained a broken shoulder, while the other endured a broken nose and internal bleeding.\nThis accident has resulted in an overwhelming physical, emotional, and financial burden for this family. SSgt Chacon is now hospitalized and facing a long road to recovery that includes surgeries, rehabilitation, and time away from military duties. Meanwhile, her daughters are also recovering and require ongoing care and support.\nAs a single mother and a proud member of the U.S. Air Force, she has always put her family and her country first. Now, she and her daughters need our help.\nAll donations will go directly toward:\n• Medical expenses and recovery costs\n• Rehabilitation and mobility support\n• Childcare and emotional support for her daughters\n• Housing and transportation adjustments\n• Lost income during recovery\nNo amount is too small. Your kindness and generosity can make a world of difference as this family begins to rebuild their lives. Please share, donate, and keep this courageous Airman and her daughters in your thoughts and prayers.\nThank you for supporting those who serve.\nWith gratitude,\nChacon family and friends\nOrganizer\nLiliana Jimenez\nOrganizer\nSpring Valley, CA"
    }
  ],
  "argos_summary": "VetComm CEO Kate Monroe paid off the GoFundMe fundraiser for injured Air Force reservist Staff Sergeant Veronica Chacon after a July 27 crash that left Chacon with broken legs and her twin daughters seriously injured. Monroe visited the family in San Diego, covering the remaining balance and pledging ongoing support for medical care, caregiving, food deliveries, and VA disability assistance. The act has drawn local and national attention, highlighting VetComm’s mission to aid veterans in critical times.",
  "argos_id": "M3VCJGQFW"
}