{
  "url": "https://www.newsmax.com/peter-morici/trump-tariffs-fed/2025/09/02/id/1224790/",
  "authorsByline": "Peter Morici",
  "articleId": "ee9b50d7b3244ec8be6277cd9bbcf889",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=5e807a37-47e5-4705-9eff-f75a4e44f54b&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T12:57:58-04:00",
  "addDate": "2025-09-02T17:16:54.173986+00:00",
  "refreshDate": "2025-09-02T17:16:54.173988+00:00",
  "score": 1.0,
  "title": "Trump's Tariffs Aren't Driving Economy Over a Cliff",
  "description": "Fed Likely Powerless to Ease Tariffs' Bite on Growth",
  "content": "President Trump’s trade war is raising taxes and slowing growth, but we aren’t headed for a recession.\n\nHigher tariffs on steel, aluminum and automotive products, special levies on China, Canada and Mexico and broad reciprocal tariffs on other countries have raised the average effective rate on all imports from 2% to 19%.\n\nAlthough reciprocal tariffs imposed under the International Emergency Powers Act face a questionable future in the courts, the president has other options to maintain those.\n\nNegotiations with China and most other trading partners won’t quickly result in comprehensive trade agreements, and the deals with the UK, EU, Vietnam and others didn’t alter tariffs much.\n\nConsequently, high tariffs are likely the remainder of Trump’s second term.\n\nIf sustained, those could bring in $3 trillion in new revenue over the next decade. That would roughly offset the deficit increasing effects of the president’s spending initiatives and tax cuts beyond renewing the 2018 Tax Cut and Jobs Act.\n\nLarge federal deficits and growing national debt are a problem, but Trump’s overall tax and spending policies won’t much alter President Biden’s trajectory.\n\nIn 2025, Trump’s tariffs are slowing growth, because those and some of his spending cuts bite this year, whereas the tax cuts won’t boost workers’ take home pay until 2026.\n\nSo far, tariffs haven’t been highly visible. Inflation has ticked and should accelerate by fall.\n\nWhen the president boosted tariffs on washing machines in January 2018, the Consumer Price Index for laundry equipment showed little effect in February and March and then jumped 11% by May.\n\nAs inflation accelerates, consumers will borrow more or spend less. Likely, it will be some of each, as banks are preparing for more losses on credit cards and other loans.\n\nIn January, economic forecasters were predicting 2% GDP growth for this year, but it should slow in the second half and average about 1.5% for all of 2025.\n\nThe conventional thinking is that the Federal Reserve could lower interest rates to give home builders, debt-burdened consumers and overall economic growth a boost but at the expense of stoking inflation. However, the Fed could be mostly powerless.\n\nFrom September to December last year, the Fed cut the federal funds rate—the overnight rate that banks pay to borrow funds—a full percentage point, but the rate on 10-year Treasury bonds jumped from about 3.6% to 4.6%.\n\nThe 10-year rate is the benchmark for most borrowing throughout the economy. Even as the Fed cut the overnight rate last fall, the rate on 30-year mortgages jumped about a percentage point too.\n\nWith the economy near full employment, a peacetime federal deficit exceeding 6% of GDP is unprecedented. Treasury borrowing requirements are overwhelming anything the Fed could do.\n\nWith fiscal and monetary policy essentially in neutral, the consequences of Trump’s tariffs are largely supply side and difficult to sort because businesses are so uncertain about future trade policies.\n\nIt’s one thing to say that the average tariff on imports will stay at 19%, but it’s another to know what rates will be charged on specific products from various jurisdictions.\n\nWith more certainty, businesses could more cost efficiently adjust supply chains—for example, invest more to source from Vietnam, Mexico and U.S. factories and less from China. But early episodes with items as simple as children’s toys indicate that finding new suppliers can take months.\n\nParents will face fewer choices, shortages and higher prices filling Christmas stockings, and similar frustrations will repeat throughout the economy.\n\nFor complex products like automobiles and cell phones, building new manufacturing capacity can take years.\n\nThe best clarity business may assume is that Trump’s tariffs will stay mostly as they are. That realization will come slowly, and business investment outside hot artificial intelligence related activities will recover but haltingly.\n\nGDP fell -0.5% in the first quarter, because imports surged in March ahead of the Liberation Day tariffs. That reversed in the second quarter.\n\nTariffs are burdening demand this summer and fall but not enough to drag the economy into a recession.\n\nInflation will surge above 3% and then subside as we move through 2026 if the Fed doesn’t enable reckless federal deficits by slashing interest rates.\n\nNext year, the economy will be back on track. The hit to growth and purchasing power from tariffs will prove a one-time adjustment, as we learn to live with Trump’s protectionism.\n\nPeter Morici is an economist and emeritus business professor at the University of Maryland, and a national columnist.",
  "medium": "Article",
  "links": [
    "https://www.wsj.com/economy/central-banking/fed-meeting-interest-rates-powell-trump-bd21e33f",
    "https://www.cbo.gov/publication/61461",
    "https://fred.stlouisfed.org/series/DGS10",
    "https://www.npr.org/2025/06/04/nx-s1-5423652/trump-tariffs-cbo-deficits-house-budget-bill",
    "https://www.federalreserve.gov/monetarypolicy/openmarket.htm",
    "https://www.bloomberg.com/news/articles/2025-07-02/trump-says-he-made-trade-deal-with-vietnam-details-to-follow",
    "https://www.nytimes.com/2025/06/13/business/economy/tariff-trade-war-inflation.html",
    "https://www.crfb.org/blogs/comparing-senate-and-house-obbbas",
    "https://fred.stlouisfed.org/series/MORTGAGE30US",
    "https://www.cbo.gov/publication/61187",
    "https://www.wsj.com/finance/investing/wall-street-bond-market-us-debt-990e12e9?mod=hp_lead_pos2#comments_sector",
    "https://www.wsj.com/business/retail/trump-tariffs-higher-prices-forecast-5233d6c4?mod=hp_lead_pos2",
    "https://www.wsj.com/economy/trade/importers-china-trade-chaos-tariffs-b3463832?gaa_at=eafs&gaa_n=ASWzDAjU4siuPK96ZQQUW7-ZSkXdvj__uV06Cb88xknGg--04xmfq5xQ1hKlms-C0J0%3D&gaa_ts=68497e95&gaa_sig=JnaRqhA94CIzMjNdaWK4VpEmcx2vRdllwzYvv9CyrEl8vtw4sj5zI2aFW_4StvjmeISuwYzInJhsgyiH5F2eIg%3D%3D",
    "https://www.wsj.com/economy/trade/trump-says-he-has-a-tariff-deal-with-european-union-avoiding-trade-war-3ca72c5d?gaa_at=eafs&gaa_n=ASWzDAifyfA0Qu45Xb_dI6BM_5nWoTzHxFIsXAwXt78ceFVU02f20_uiEMpJ1HLe8hk%3D&gaa_ts=689097ac&gaa_sig=WGTr-DzbSa3J74S-hPoZvLjIFh2wIX1VBFsx8gpw7r7jDAuLIS_4Vgitp0JFv5uKL5Q8Ga60j1GlF7tnWKt2Bg%3D%3D",
    "https://www.wsj.com/politics/policy/appeals-court-rejects-trumps-global-tariffs-aae2dc99?mod=hp_lead_pos1",
    "https://www.kshb.com/news/local-news/how-long-will-it-take-to-build-new-manufacturing-facilities-in-response-to-tariffs#:~:text=He%20said%20crews%20can%20build,a%20warehouse%20in%20six%20months.",
    "https://www.bloomberg.com/news/articles/2025-06-12/japan-won-t-rush-trade-deal-while-welcoming-progress-before-g-7?cmpid=061225_morningamer&utm_medium=email&utm_source=newsletter&utm_term=250612&utm_campaign=morningamer",
    "https://www.wsj.com/economy/trade/china-tariffs-mean-fewer-more-expensive-dolls-for-american-kids-ab5629d1?gaa_at=eafs&gaa_n=ASWzDAgD01az3SC8TKtXafACNjDMZIAa13-grY7CA6F_nMpZsA57jaZSZNS1bxGdv_I%3D&gaa_ts=68497cb9&gaa_sig=qzoYcoBfF8DsK6JArhd6lIWqpOxr_c0hPae-ma9HSSvMAVcfFPfNT_7XFc2Ssdfg-YijOhwOLnzBvEGy6FS5Xw%3D%3D",
    "https://www.wsj.com/economy/trump-tariffs-us-economy-business-investment-7d3c6476?gaa_at=eafs&gaa_n=ASWzDAg4hzpURqwmqSnVd0nVhQisfetmwxe9Xsu894yX_D-jBA4goQ7Rz1AOPqct-LY%3D&gaa_ts=684988fc&gaa_sig=Eqt3x0ocxrSqVsBrpGTFMsgve8s-n_xGzfKlrpuiwV0NdMj1VeNLGgE0Uew7-fUX3bOf-qw-BMqOshDOcvEA6g%3D%3D",
    "https://www.wsj.com/economy/trade/trump-tariffs-list-products-canada-mexico-china-b41351df?gaa_at=eafs&gaa_n=ASWzDAgXNvbS4_sW10gD6BNNXwrd-3l0vKnO7dguEvBse1kiRxKACS9P77mE1bohaVo%3D&gaa_ts=6849764b&gaa_sig=qV33PEmPayK50yFXa5Kt8RDlS_xSTFim2CGAPQeE4cNRM561e_61J1N_YsO3jP8Px7IoqxbZoRJwTwQOWlcIOw%3D%3D",
    "https://www.bea.gov/data/gdp/gross-domestic-product",
    "https://www.washingtontimes.com/news/2025/may/20/british-trade-deal-shows-limits-trumps-tariff-strategy/",
    "https://www.wsj.com/world/china/beijing-puts-six-month-limit-on-its-ease-of-rare-earth-export-licenses-ec8277ed?mod=hp_lead_pos1",
    "https://www.bloomberg.com/news/articles/2025-06-10/citi-to-set-aside-more-money-for-losses-on-loans-credit-cards",
    "https://fred.stlouisfed.org/graph/?g=nPgS",
    "https://www.bloomberg.com/news/articles/2025-06-02/why-apple-appl-can-t-just-move-iphone-production-from-china-to-india",
    "https://www.wsj.com/finance/federal-government-debt-deficit-charts-3289eff8?mod=hp_lead_pos4",
    "https://www.bloomberg.com/news/articles/2025-06-03/trump-s-tariffs-plunge-us-and-global-economy-into-slowdown",
    "https://www.cnbc.com/2025/05/29/trump-expected-to-find-a-workaround-after-trade-court-blocks-tariffs.html",
    "https://www.nytimes.com/2018/01/22/business/trump-tariffs-washing-machines-solar-panels.html",
    "https://wellsfargo.bluematrix.com/links2/html/0ca46ebc-0aa7-40f8-917a-0516816a757e"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Higher tariffs",
      "weight": 0.08174047
    },
    {
      "name": "high tariffs",
      "weight": 0.08174047
    },
    {
      "name": "reciprocal tariffs",
      "weight": 0.07959739
    },
    {
      "name": "Tariffs",
      "weight": 0.07806796
    },
    {
      "name": "tariffs",
      "weight": 0.07806796
    },
    {
      "name": "broad reciprocal tariffs",
      "weight": 0.07671991
    },
    {
      "name": "interest rates",
      "weight": 0.069892675
    },
    {
      "name": "Next year",
      "weight": 0.062504224
    },
    {
      "name": "emeritus business professor",
      "weight": 0.061562926
    },
    {
      "name": "reckless federal deficits",
      "weight": 0.061367724
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "US Politics"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97900390625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.94287109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9140625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.79150390625
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.73681640625
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.708984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.414306640625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.396240234375
    }
  ],
  "sentiment": {
    "positive": 0.15954898,
    "negative": 0.5084091,
    "neutral": 0.3320419
  },
  "summary": "President Trump's trade war has raised taxes and slowed growth, but it is not expected to cause a recession, argues Peter Morici from the University of Maryland. Higher tariffs on steel, aluminum, and automotive products, along with special levies on China, Canada, and Mexico, have raised the average effective rate on all imports from 2% to 19%. These tariffs could generate $3 trillion in new revenue over the next decade, which would offset the deficit increasing effects of the president's spending initiatives and tax cuts. However, large federal deficits and growing national debt are a concern, Morici argues. The Federal Reserve may be powerless to lower interest rates to boost economic growth without increasing inflation. The consequences of the tariffs are largely supply-side, as businesses are uncertain about future trade policies.",
  "shortSummary": "President Trump's trade war is raising taxes, slowing growth, and potentially impacting businesses, despite potential tax and spending cuts to boost economic growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b12ffd3633d8420aa43c1d87608d94f1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.kshb.com/news/local-news/how-long-will-it-take-to-build-new-manufacturing-facilities-in-response-to-tariffs#:~:text=He%20said%20crews%20can%20build,a%20warehouse%20in%20six%20months.",
      "text": "KSHB 41 reporter Charlie Keegan covers politics on both sides of the state line. If you have a story idea to share, you can send Charlie an email at charlie.keegan@kshb.com.\n—\nTariffs have been in the lesson plan for Steve Bennett. He teaches construction management at Johnson County Community College. Thursday’s class touched on a series of tariffs that President Donald Trump announced Wednesday.\nOne of Trump’s goals is to encourage companies to build products in the United States instead of importing items into the United States. In order to build products in America, companies have to build manufacturing facilities first, which is where the students in Bennett’s class come into play.\n“People like you are needed to build these jobs,” Bennett told his students.\nBuilding the production facilities will take time, Bennett warned.\nBefore teaching, he worked in the construction industry. He said crews can build simple manufacturing plants and warehouses in less than one year. Larger. more complex facilities will take years to build.\n“We can typically build a warehouse in six months. I have built one in 4 and half months,” Bennett said. “It’s what we call fast-tracking. What we call design-build.”\nKevin Lewis is the CEO of Henderson Companies in Lenexa. The firm uses the design-build approach. This is where you design the facility while you build it. It shaves time off the project's length.\n“Those are words we love to hear. Design-build is something we’re passionate about,” Lewis said.\nHe laid out the typical steps for building a new manufacturing facility.\nIt starts by finding land for the project. Oftentimes, these projects require a lot of land, and cities require owners to build them in certain areas with special zoning privileges.\nLewis wants all his clients to make sure the project will be profitable. He doesn’t want to build something the client can’t pay for.\nThen, engineers and architects design the facility.\nFinally, companies buy the materials and begin building.\n“Long story short, it’s going to take a little while for this to all work through the process and for some of these new construction projects to come to fruition,” Lewis summarized.\nBoth Lewis and Bennett said the construction labor market is short-staffed and has been since the COVID-19 pandemic. They believe the lack of workers might also slow down progress on building new manufacturing facilities.\n—"
    },
    {
      "url": "https://www.cnbc.com/2025/05/29/trump-expected-to-find-a-workaround-after-trade-court-blocks-tariffs.html",
      "text": "U.S. President Donald Trump could still find a work-around after suffering a major blow to a core part of his economic agenda.\nThe U.S. Court of International Trade on Wednesday ruled that the president had overstepped his authority by invoking the International Emergency Economic Powers Act, or IEEPA, to impose sweeping tariffs on numerous countries.\nThe New York-based court ordered a permanent halt to most of Trump's tariffs and further barred their future modification. A panel of three judges gave the White House 10 days to complete the formal process of stopping the tariffs. The Trump administration swiftly appealed the ruling.\nGoldman Sachs economists said the White House has a few tools at its disposal that could ensure the court ruling is only a temporary problem.\n\"This ruling represents a setback for the administration's tariff plans and increases uncertainty but might not change the final outcome for most major US trading partners,\" Goldman Sachs economists said in a research note.\n\"For now, we expect the Trump administration will find other ways to impose tariffs,\" they added.\nOptions on the table\nThe Wall Street bank said the ruling blocks the 10% baseline tariff imposed by Trump on most imports, as well as the additional duties on China, Canada and Mexico – but not sectoral levies, such as those imposed on steel, aluminum and autos.\nThe Trump administration nevertheless has other legal means of imposing tariffs, Goldman says, flagging Section 122 of U.S. trade law, Section 301 investigations and Section 338 of the Trade Act of 1930.\nSection 122 of the Trade Act of 1974 does not require a formal investigation and could therefore be one of the swiftest ways to get around the court roadblock.\n\"The administration could quickly replace the 10% across-the-board tariff with a similar tariff of up to 15% under Sec. 122,\" analysts at Goldman said. They noted, however, that such a move would only last for up to 150 days after which law requires congressional action.\nRead more\nTrump could also swiftly launch Section 301 investigations on key U.S. trading partners, laying the bureaucratic groundwork for tariffs — although Goldman said that this process will likely take several weeks at a minimum.\nSection 232 tariffs, which are already in place for steel, aluminum and auto imports, could also be broadened to other sectors. This trade law allows the president to take action against threats to national security.\nSection 338, meanwhile, allows the president to impose levies of up to 50% on imports from countries that discriminate against the U.S. Goldman noted that this particular measure has not been used before.\nMichelle Schulz, founder and managing partner at Schulz Trade Law PLLC, echoed the possibility that the Trump administration would seek work-arounds, including looking at ways the White House has imposed tariffs in the past.\n\"We have had section 301 tariffs on Chinese goods even under the previous administration, which were pretty harsh. So I can imagine that the administration will look at these provisions again and see if they can use 232, or 301, or some other mechanism where, whereby they can enforce the tariffs,\" she told CNBC's \"Squawk Box Europe\" on Thursday.\nSchulz also pointed to the fact that such tariffs require investigations.\n\"I think that's the difference here. All of the tariffs that we're talking about today with IEEPA were issued under executive order and pretty much just by the executive branch,\" she said. \"When you look at these other sections, you're going to have the involvement of the Commerce Department and other agencies investigating whether there really has been damage\" to justify tariff action.\nSchulz added that such investigations could take months.\nCNBC has reached out to the White House for comment but did not immediately receive a response.\nWhat about the Supreme Court?\nJames Ransdell, partner at the law firm Cassidy Levy Kent, said the court opinion marks the first of many other cases still pending — and the first substantive opinion out of federal court \"to really address the meat of the plaintiffs challenge.\"\nRansdell said the speed of the Trump administration's appeal was \"very unusual\" and suggests the government could be working through the night to prepare its motion for an emergency stay of the order.\nHe added that it was \"certainly a possibility\" that the Supreme Court could end up having the last say.\n\"There is not a lot of precedent on this particular statute and on similar actions by the president, so there might be an interest that the Supreme Court has in taking this up,\" Ransdell told CNBC's \"The China Connection\" on Thursday.\nSteven Blitz, chief U.S. economist at TS Lombard, said Trump had a \"very good\" level of understanding of how to play the courts to get what he wants in terms of playing for time.\n\"The first thing he will probably do is an emergency appeal to the Supreme Court … wanting to get a ruling from them that basically says you can keep these tariffs in place while the appeals process runs through,\" Blitz said Thursday.\n\"This king-like executive order was always going to, at some point, going to run into the courts. … The difference between being a monarchy and being a constitutional democracy is the legal system,\" he added.\nStocks, U.S. dollar on the rise\nEquity markets around the world broadly rose on Thursday as investors reacted to the legal ruling. Asia-Pacific markets ended the day mostly higher and U.S. futures jumped.\nMarket reaction in Europe was more muted, with the pan-European Stoxx 600 up a mere 0.3% by early afternoon London time. The euro was last seen trading at $1.1285, little changed for the session after paring earlier losses.\nJordan Rochester, head of FICC strategy at Mizuho EMEA, said in a note that the limited market reaction was \"because Trump still has various options to raise tariffs.\"\n\"Things are more complicated but the end goal for Trump remains the same. In politics when there is a will, there is a way,\" he said.\nThe U.S. dollar rose slightly against major rivals, with the U.S. dollar index up 0.07%. So far this year, the dollar index has tumbled close to 8% amid continued market turmoil."
    },
    {
      "url": "https://www.npr.org/2025/06/04/nx-s1-5423652/trump-tariffs-cbo-deficits-house-budget-bill",
      "text": "Trump's tariffs could cut deficit by $2.8 trillion over next decade — with caveats\nCongressional forecasters say President Trump's tariffs could raise trillions of dollars over the next decade — if they remain in place — more than offsetting the additional red ink that's projected to flow from a sweeping budget bill passed by the House last month.\nSince taking office in January, Trump has imposed taxes of 10 to 50% on nearly everything the U.S. imports. Those taxes have already raised tens of billions of dollars in revenue.\nIf the tariffs become permanent, they're expected to reduce the federal deficit by $2.8 trillion by 2035, according to a letter released Wednesday by the non-partisan Congressional Budget Office.\nA separate CBO forecast out earlier in the day shows the combination of tax cuts and spending cuts in the House-passed budget bill would increase the deficit by $2.4 trillion over the same period.\nThere are big unknowns, however\nThe tariff forecast includes a number of caveats.\n\"Because the United States has implemented no increases in tariffs of this size in many decades, there is little relevant empirical evidence on their effects,\" writes CBO director Phillip Swagel. The high taxes might discourage imports more than expected, which would result in lower revenues. On the other hand, if imports drop less than expected due to tariffs, the government could end up raising more money.\nThe forecast assumes that most of the tariffs in place in mid-May are made permanent. It does not include the doubling of tariffs on steel and aluminum imports that took effect Wednesday, or the prospect that higher tariffs, which have been temporarily suspended, might return.\nMany of the tariffs were imposed under a novel reading of a 1977 law, and they are being challenged in court, though they remain in effect for now.\nIn addition to cutting deficits, forecasters project the tariffs will result in higher inflation this year and next and slower economic growth.\nForecasters say tariffs will likely raise prices for both rich families and poor families, although the CBO is still sorting out which end of the income ladder would be hit hardest."
    },
    {
      "url": "https://www.bea.gov/data/gdp/gross-domestic-product",
      "text": "Gross Domestic Product\nGross Domestic Product (Second Estimate), Corporate Profits (Preliminary Estimate), 2nd Quarter 2025\n|\nQ2 2025 (2nd)\n|\n+3.3%\n|\n|\nQ1 2025 (2nd)\n|\n-0.5%\n|\nReal gross domestic product (GDP) increased at an annual rate of 3.3 percent in the second quarter of 2025 (April, May, and June), according to the second estimate released by the U.S. Bureau of Economic Analysis. In the first quarter, real GDP decreased 0.5 percent. The increase in real GDP in the second quarter primarily reflected a decrease in imports, which are a subtraction in the calculation of GDP, and an increase in consumer spending. These movements were partly offset by decreases in investment and exports.\n- Current release: August 28, 2025\n- Next release: September 25, 2025\n- Percent Change in Real GDP: Years, Since 1930\n- Percent Change in Real GDP: Quarters, Since 1947\n- Real GDP (Inflation-Adjusted Dollars): Years, Since 1929\n- Real GDP (Inflation-Adjusted Dollars): Quarters, Since 1947\n- Current-Dollar GDP: Years, Since 1929\n- Current-Dollar GDP: Quarters, Since 1947\n- Underlying Detail Tables\n- Motor vehicles August 29, 2025\n- Prices and Output for Information and Communication Technologies\n- Estimates prepared for international comparisons based on the System of National Accounts\n- Additional Tables\n- Data Archive Previously published estimates contain historical data and have since been revised.\n- News Release Archive\n- Vintage History of Quarterly Gross Domestic Product (GDP) and Gross Domestic Income (GDI) Estimates\nWhat is Gross Domestic Product?\nA comprehensive measure of U.S. economic activity. GDP measures the value of the final goods and services produced in the United States (without double counting the intermediate goods and services used up to produce them). Changes in GDP are the most popular indicator of the nation's overall economic health.\nContact Personnel\n-\nGDPLisa Mataloni\n-\nCorporate ProfitsKate Pinard\n-\nMediaConnie O’Connell"
    },
    {
      "url": "https://www.cbo.gov/publication/61187",
      "text": "The Long-Term Budget Outlook: 2025 to 2055\nExtending the 10-year budget projections it published on January 17, 2025, CBO projects that federal debt held by the public, boosted by sustained deficits, will grow far beyond any previously recorded level over the next 30 years.\nSummary\nThis report presents the Congressional Budget Office's projections of what the federal budget and the economy would look like over the next 30 years if current laws generally remained unchanged. Those long-term projections are based on the agency's January 2025 demographic projections (which reflect information, laws, and policies as of November 15, 2024), economic projections (which reflect laws, policies, and economic developments as of December 4, 2024), and 10-year budget projections (which include the effects of legislation enacted as of January 6, 2025). The projections do not reflect the effects of administrative actions taken or judicial decisions made after those respective dates, including actions and decisions affecting immigration, tariffs, and other policy areas.\nThe Federal Budget\nDebt held by the public, boosted by large deficits, reaches its highest level ever in 2029 (measured as a percentage of gross domestic product, or GDP) and then continues to grow, reaching 156 percent of GDP in 2055. It remains on track to increase thereafter. Mounting debt would slow economic growth, push up interest payments to foreign holders of U.S. debt, and pose significant risks to the fiscal and economic outlook; it could also cause lawmakers to feel constrained in their policy choices.\nThe deficit remains large by historical standards over the next 30 years, reaching 7.3 percent of GDP in 2055. That amount results from rising interest costs and sustained primary deficits, which exclude net outlays for interest and average 0.3 percent of GDP more over the next 30 years than they did over the past 50 years.\nOutlays, which are already high by historical standards, rise over the 2025–2055 period, reaching 26.6 percent of GDP in 2055. Rising interest costs; spending for the major health care programs, particularly Medicare; and spending for Social Security, especially over the next decade, drive that growth.\nRevenues increase over the next few years, largely because certain provisions of the 2017 tax act are scheduled to expire. Thereafter, they generally rise, reaching 19.3 percent of GDP in 2055, as growth in real income—that is, income adjusted to remove the effects of changes in prices—boosts receipts from the individual income tax.\nChanges in CBO's Budget Projections Since March 2024\nFederal debt held by the public in 2054 is now projected to be 12 percent of GDP less than it was projected to be in last year's report, and the deficit is now projected to be 1.3 percent of GDP less. Lower spending, particularly for net interest costs and Medicare, and higher revenues in the current projections contribute to the lower projected debt and smaller projected deficits.\nThe U.S. Economy\nPopulation growth, which has a significant effect on the economy, is slower over the next 30 years than it was over the past 30 years. Without immigration, the U.S. population would begin to shrink in 2033.\nEconomic growth is slower over the next three decades than it was over the past three decades. The slowdown in the growth of output results from slower growth in the size and productivity of the labor force; the latter stems partly from increased federal borrowing.\nInflation slows through 2027 to a rate that is consistent with the Federal Reserve's long-term goal of 2 percent and then remains at rates that are consistent with that goal from 2027 to 2055.\nThe interest rate on 10-year Treasury notes stays close over the next three decades to what it was, on average, over the past 30 years, reflecting upward pressure from increases in federal borrowing and downward pressure from slowdowns in the growth of the labor force.\nChanges in CBO's Economic Projections Since March 2024\nThe economy is now expected to grow more slowly, on average, over the next 30 years than CBO projected last year. That decrease stems mainly from slower growth of private investment and consumer spending over the next decade and slower growth of the labor force over the last decade of the projection period. The interest rate on 10-year Treasury notes is also lower, on average, in the current projections."
    },
    {
      "url": "https://fred.stlouisfed.org/graph/?g=nPgS",
      "text": "Data in this graph are copyrighted. Please review the copyright information in the series notes before sharing.\nSource: U.S. Office of Management and Budget\nSource: Federal Reserve Bank of St. Louis\nRelease: Debt to Gross Domestic Product Ratios\nUnits: Percent of GDP, Not Seasonally Adjusted\nFrequency: Annual\nFederal Surplus or Deficit [-] as Percent of Gross Domestic Product (FYFSGDA188S) was first constructed by the Federal Reserve Bank of St. Louis in October 2012. It is calculated using Federal Surplus or Deficit [-] (FYFSD) and Gross Domestic Product (GDPA):\nFYFSGDA188S = ((FYFSD/1000)/GDPA)*100\nFYFSD/1000 transforms FYFSD from millions of dollars to billions of dollars.\nU.S. Office of Management and Budget and Federal Reserve Bank of St. Louis, Federal Surplus or Deficit [-] as Percent of Gross Domestic Product [FYFSGDA188S], retrieved from FRED, Federal Reserve Bank of St. Louis; https://fred.stlouisfed.org/series/FYFSGDA188S, .\nSource: U.S. Bureau of Labor Statistics\nRelease: Employment Situation\nUnits: Percent, Seasonally Adjusted\nFrequency: Monthly\nThe unemployment rate represents the number of unemployed as a percentage of the labor force. Labor force data are restricted to people 16 years of age and older, who currently reside in 1 of the 50 states or the District of Columbia, who do not reside in institutions (e.g., penal and mental facilities, homes for the aged), and who are not on active duty in the Armed Forces.\nThis rate is also defined as the U-3 measure of labor underutilization.\nThe series comes from the 'Current Population Survey (Household Survey)'\nThe source code is: LNS14000000\nU.S. Bureau of Labor Statistics, Unemployment Rate [UNRATE], retrieved from FRED, Federal Reserve Bank of St. Louis; https://fred.stlouisfed.org/series/UNRATE, .\nFederal Surplus or Deficit [-] as Percent of Gross Domestic Product\nAnnual, Not Seasonally AdjustedUnemployment Rate\nMonthly, Not Seasonally Adjustedmodal open, choose link customization options\nSelect automatic updates to the data or a static time frame. All data are subject to revision."
    },
    {
      "url": "https://wellsfargo.bluematrix.com/links2/html/0ca46ebc-0aa7-40f8-917a-0516816a757e",
      "text": "Economics\nU.S. Tariff Tracker\nEconomics Group\n|\nTim Quinlan |\nSenior Economist |\n704-410-3283 |\nTim.Quinlan@wellsfargo.com |\n|\nSam Bullard |\nSenior Economist |\n704-410-3280 |\nSam.Bullard@wellsfargo.com |\n|\nNick Bennenbroek |\nInternational Economist |\n212-214-5636 |\nNicholas.Bennenbroek@wellsfargo.com |\n|\nSarah House |\nSenior Economist |\n704-410-3282 |\nSarah.House@wellsfargo.com |\n|\nAzhar Iqbal |\nEconometrician |\n212-214-2029 |\nAzhar.Iqbal@wellsfargo.com |\n|\nCharlie Dougherty |\nSenior Economist |\n212-214-8984 |\nCharles.Dougherty@wellsfargo.com |\n|\nMichael Pugliese |\nSenior Economist |\n212-214-5058 |\nMichael.D.Pugliese@wellsfargo.com |\n|\nBrendan McKenna |\nInternational Economist |\n212-214-5637 |\nBrendan.Mckenna@wellsfargo.com |\n|\nJackie Benson |\nEconomist |\n704-410-4468 |\nJackie.Benson@wellsfargo.com |\n|\nShannon Grein |\nEconomist |\n704-410-0369 |\nShannon.Grein@wellsfargo.com |\n|\nNicole Cervi |\nEconomist |\n704-410-3059 |\nNicole.Cervi@wellsfargo.com |\n|\nDelaney Conner |\nEconomic Analyst |\n704-374-2150 |\nDelaney.Conner@wellsfargo.com |\n|\nAli Hajibeigi |\nEconomic Analyst |\n212-214-8253 |\nAli.Hajibeigi@wellsfargo.com |\n|\nAzhin Abdulkarim |\nEconomic Analyst |\n212-214-5154 |\nAzhin.Abdulkarim@wellsfargo.com |\n|\nAnagha Sridharan |\nEconomic Analyst |\n704-410-6212 |\nAnagha.Sridharan@wellsfargo.com |\n|\nAndrew Thompson |\nEconomic Analyst |\n704-410-2911 |\nAndrew.L.Thompson@wellsfargo.com |\n|\nCoren Miller |\nAdministrative Assistant |\n704-410-6010 |\nCoren.Miller@wellsfargo.com |\nAll estimates/forecasts are as of 8/20/2025 unless otherwise stated. 8/20/2025 13:18:30 EDT.\nRequired Disclosures\nThis report is produced by the Economics Group of Wells Fargo Bank, N.A. (“WFBNA”). This report is not a product of Wells Fargo Global Research and the information contained in this report is not financial research. WFBNA distributes this report directly and through affiliates including, but not limited to, Wells Fargo Securities, LLC, Wells Fargo & Company, Wells Fargo Clearing Services, LLC, Wells Fargo Securities International Limited, Wells Fargo Securities Europe S.A., and Wells Fargo Securities Canada, Ltd. Wells Fargo Securities, LLC is registered with the Commodity Futures Trading Commission as a futures commission merchant and is a member in good standing of the National Futures Association. WFBNA is registered with the Commodity Futures Trading Commission as a swap dealer and is a member in good standing of the National Futures Association. Wells Fargo Securities, LLC and WFBNA are generally engaged in the trading of futures and derivative products, any of which may be discussed within this report. All reports published by the Economics Group are disseminated and available to all clients simultaneously through electronic publication to our public website. Clients may also receive our reports via third party vendors. We are not responsible for the redistribution of our reports by third-party aggregators. Any external website links included in this report are not maintained, controlled or operated by WFBNA. WFBNA does not provide the products and services on these websites and the views expressed on these websites do not necessarily represent those of WFBNA.\nThis publication has been prepared for informational purposes only and is not intended as a recommendation, offer or solicitation with respect to the purchase or sale of any security or other financial product, nor does it constitute professional advice. The information in this report has been obtained or derived from sources believed by WFBNA to be reliable, but has not been independently verified by WFBNA, may not be current, and WFBNA has no obligation to provide any updates or changes. All price references and market forecasts are as of the date of the report or such earlier date as may be indicated for a particular price or forecast. The views and opinions expressed in this report are those of its named author(s) or, where no author is indicated, the Economics Group; such views and opinions are not necessarily those of WFBNA and may differ from the views and opinions of other departments or divisions of WFBNA and its affiliates. WFBNA is not providing any financial, economic, legal, accounting, or tax advice or recommendations in this report. Neither WFBNA nor any of its affiliates makes any representation or warranty, express or implied, as to the accuracy or completeness of the statements or any information contained in this report, and any liability therefore (including in respect of direct, indirect or consequential loss or damage) is expressly disclaimed. WFBNA is a separate legal entity and distinct from affiliated banks, and is a wholly-owned subsidiary of Wells Fargo & Company.\nYou are permitted to store, display, analyze, modify, reformat, copy, duplicate and reproduce this report and the information contained within it for your own use and for no other purpose. Without the prior written consent of WFBNA, no part of this report may be copied, duplicated or reproduced in any form by any other means. In addition, this report and its contents may not be redistributed or transmitted to any other party in whole or in part, directly or indirectly, including by means of any AI Technologies (defined below) through which this report or any portion thereof may be accessible by any third-party. “AI Technologies” means any deep learning, machine learning, and other artificial intelligence technologies, including without limitation any and all (a) proprietary algorithms, software, or systems that make use of or employ neural networks, statistical learning algorithms (such as linear and logistic regression, support vector machines, random forests or k-means clustering) or reinforcement learning, or curated data sets accessible by any of the foregoing or (b) proprietary embodied artificial intelligence and related hardware or equipment. In addition, certain text, images, graphics, screenshots and audio or video clips included in this report are protected by copyright law and owned by WFBNA, its affiliates or one or more third parties (collectively, “Protected Content”). Protected Content is made available to clients by Wells Fargo under license or otherwise in accordance with applicable law. Any use or publication of Protected Content included in this report for purposes other than fair use requires permission from WFBNA or, in the case of content attributed to any third party, the third-party copyright owner. You may not alter, obscure, or remove any copyright, trademark or any other notices attached to or contained within this report. All rights not expressly granted herein are reserved by WFBNA or the third-party providers from whom WFBNA has obtained the applicable information. © 2025 Wells Fargo Bank, N.A.\nImportant Information for Non-U.S. Recipients\nFor recipients in the United Kingdom, this report is distributed by Wells Fargo Securities International Limited (\"WFSIL\"). WFSIL is a U.K. incorporated investment firm authorized and regulated by the Financial Conduct Authority (“FCA”). For the purposes of Section 21 of the UK Financial Services and Markets Act 2000 (the “Act”), the content of this report has been approved by WFSIL, an authorized person under the Act. WFSIL does not deal with retail clients as defined in the Directive 2014/65/EU (“MiFID2”). The FCA rules made under the Act for the protection of retail clients will therefore not apply, nor will the Financial Services Compensation Scheme be available. For recipients in the EFTA, this report is distributed by WFSIL. For recipients in the EU, it is distributed by Wells Fargo Securities Europe S.A. (“WFSE”). WFSE is a French incorporated investment firm authorized and regulated by the Autorité de contrôle prudentiel et de résolution and the Autorité des marchés financiers. WFSE does not deal with retail clients as defined in MiFID2. This report is not intended for, and should not be relied upon by, retail clients.\nSECURITIES: NOT FDIC-INSURED - MAY LOSE VALUE - NO BANK GUARANTEE"
    },
    {
      "url": "https://www.crfb.org/blogs/comparing-senate-and-house-obbbas",
      "text": "Comparing the Senate and House OBBBAs\nThe Senate has passed its version of the Fiscal Year (FY) 2025 reconciliation bill – the One Big Beautiful Bill Act (OBBBA). The table below is a comprehensive tally of each provision included in the Senate bill, along with a deficit impact estimate and the deficit impact estimate of the equivalent provision in the House bill. This table will be updated if the bill changes and/or new scores become available.\n| Provision | Deficit Increase (-) / Decrease (FY2025-FY2034) |\n||\n|---|---|---|---|\n| Senate | House Equivalent | Difference | |\n| Finance | |||\n| Extend & Expand Rate Cuts | -$2,193 billion | -$2,177 billion | -$16 billion |\n| Extend & Expand Standard Deduction Hike | -$1,425 billion | -$1,308 billion | -$117 billion |\n| Repeal Personal and Dependent Exemption | $1,900 billion | $1,870 billion | +$30 billion |\n| Extend & Expand Child Tax Credit Increase | -$817 billion | -$797 billion | -$20 billion |\n| Extend & Expand 199A Pass-Through Deduction | -$737 billion | -$820 billion | +$83 billion |\n| Extend Standard Deduction and Itemized Deduction Reforms (modifications below) | -$289 billion | -$327 billion | +$38 billion |\n| Increase SALT Cap and Other Deduction Changes | -$145 billion | -$280 billion | +$135 billion |\n| Revert Some AMT Parameters to 2018 Levels | $12 billion | $110 billion | -$98 billion |\n| Limit Value of Itemized Deductions to 35% Rate | $34 billion | $41 billion | -$7 billion |\n| Limit Deductibility of Business Losses | $18 billion | $26 billion | -$8 billion |\n| Extend & Expand Estate Tax Cut | -$212 billion | -$212 billion | $0 |\n| Subtotal, Extend & Expand TCJA Individual Provisions | -$3,852 billion | -$3,874 billion | +$22 billion |\n| Revive 100% Bonus Depreciation for equipment (through 2029 in House) | -$363 billion | -$37 billion | -$326 billion |\n| Revive Domestic R&E Expensing (through 2029 in House) | -$141 billion | -$23 billion | -$118 billion |\n| Revive Looser Interest Limit (through 2029 in House) | -$61 billion | -$40 billion | -$21 billion |\n| Extend and Modify International Tax Rates and Rules | -$167 billion | -$165 billion | -$2 billion |\n| Extend & Expand Opportunity Zones through 2033 | -$41 billion | -$5 billion | -$36 billion |\n| Subtotal, Revive TCJA Business Provisions | -$772 billion | -$270 billion | -$502 billion |\n| Cut Taxes on Tips through 2028 | -$32 billion | -$40 billion | +$8 billion |\n| Cut Taxes on Overtime through 2028 | -$90 billion | -$124 billion | +$34 billion |\n| Increase Senior Standard Deduction through 2028 | -$93 billion | -$66 billion | -$27 billion |\n| Establish Deduction for Car Loan Interest through 2028 | -$31 billion | -$58 billion | +$27 billion |\n| Establish \"Trump Accounts\" and Contribute through 2028 | -$15 billion | -$17 billion | +$2 billion |\n| Offer Non-Itemizer Charitable Deduction (through 2028 in House) | -$74 billion | -$7 billion | -$67 billion |\n| Create Scholarship Tax Credit | -$26 billion | -$20 billion | -$6 billion |\n| Health Savings Account Expansions | -$11 billion | -$44 billion | +$33 billion |\n| Expansions of Credits for Adoption, Child Care, and Dependent Care | -$18 billion | -$3 billion | -$15 billion |\n| Exclusion for Employer Payments of Student Loans | -$11 billion | -$11 billion | $0 |\n| Other Individual Tax Cuts | -$18 billion | -$6 billion | -$12 billion |\n| Subtotal, New Individual Tax Cuts | -$417 billion | -$396 billion | -$21 billion |\n| Allow Expensing of Factories through 2028 | -$141 billion | -$148 billion | +$7 billion |\n| Extend and Reform Clean Fuel Tax Credit | -$26 billion | -$45 billion | +$19 billion |\n| Restrictions on Carbon Dioxide Sequestration Credit | -$14 billion | $18 billion | -$32 billion |\n| Enhanced Low-Income Housing Credit and New Markets Tax Credit | -$21 billion | -$14 billion | -$7 billion |\n| Expansion of Qualified Small Business Stock Gain Exclusion | -$17 billion | N/A | -$17 billion |\n| Enhanced Advanced Manufacturing Investment Credit | -$15 billion | N/A | -$15 billion |\n| Other Business and Related Tax Cuts | -$51 billion | -$60 billion | +$9 billion |\n| Subtotal, New Business Tax Cuts | -$285 billion | -$249 billion | -$36 billion |\n| Repeal EV Tax Credits | $192 billion | $191 billion | +$1 billion |\n| Phase Out Energy Investment, Production, and Manufacturing Credits | $246 billion | $249 billion | -$3 billion |\n| Repeal or Reform other IRA Credits | $104 billion | $113 billion | -$9 billion |\n| Subtotal, Repeal and Reform IRA Credits | $543 billion | $553 billion | -$10 billion |\n| Impose Floor on Charitable Deduction | $80 billion | $17 billion | +$63 billion |\n| Foreign Corporate Retaliation Tax | N/A | $116 billion | -$116 billion |\n| Modifications to De Minimis Entry Privilege | $39 billion | $39 billion | $0 |\n| Expand Executive Compensation Deduction Limit | $20 billion | $20 billion | $0 |\n| EITC Reforms | N/A | $15 billion | -$15 billion |\n| Increase College Endowment Tax | $1 billion | $23 billion | -$22 billion |\n| Impose Remittance Excise Tax | $10 billion | $26 billion | -$16 billion |\n| Increase in Private Foundation Investment Income Tax | N/A | $16 billion | -$16 billion |\n| Limitation on Amortization of Certain Sports Franchises | N/A | $1 billion | -$1 billion |\n| Other Revenue Provisions | $15 billion | $15 billion | $0 |\n| Subtotal, Other Revenue Increases and Tax Credit Reductions | $164 billion | $288 billion | -$124 billion |\n| Require States to Establish Medicaid Work Requirements | $317 billion | $336 billion | -$19 billion |\n| Change Eligibility and Enrollment Rules^ | $145 billion | $163 billion | -$18 billion |\n| ACA Savings | $226 billion | $241 billion | -$15 billion |\n| Freeze New or Increased Provider Taxes | $183 billion | $87 billion | +$96 billion |\n| Revise the Payment Limit for Certain State Directed Payments | $149 billion | $72 billion | +$77 billion |\n| Increase Frequency of Medicaid Eligibility Redeterminations | $58 billion | $60 billion | -$2 billion |\n| Require Uniform Tax for Medicaid Provider Taxes | $34 billion | $34 billion | $0 |\n| Expansion State FMAP Changes | $28 billion | $24 billion | +$4 billion |\n| Repeal and Freeze Nursing Home Staffing Standards Rule^ | $20 billion | $23 billion | -$3 billion |\n| Reducing Duplicate Enrollment in the Medicaid and CHIP Programs | $17 billion | $17 billion | $0 |\n| Sunsetting Increased FMAP Incentive | $13 billion | $14 billion | -$1 billion |\n| Modify Cost-Sharing Requirements in Medicaid Program | $7 billion | $8 billion | -$1 billion |\n| Other Health Related Offsets | $27 billion | $21 billion | +$6 billion |\n| Rural Health Transformation Program | -$47 billion | N/A | -$47 billion |\n| Expand Drug Price Negotiation to Include Orphan Drugs | -$5 billion | -$9 billion | +$4 billion |\n| Modify Update to Conversion Factor Under the PFS | -$2 billion | -$5 billion | +$3 billion |\n| Other Health Related Spending and Tax Breaks | -$13 billion | -$1 billion | -$12 billion |\n| Interactions | -$83 billion | -$78 billion | -$5 billion |\n| Subtotal, Health Care Provisions | $1,074 billion | $1,007 billion | +$67 billion |\n| Subtotal: Finance | -$3,545 billion | -$2,941 billion | -$604 billion |\n| Armed Services | |||\n| Air Superiority and Missile Defense | -$31 billion | -$30 billion | -$1 billion |\n| Shipbuilding | -$28 billion | -$32 billion | +$4 billion |\n| Munitions and Supply Chain | -$24 billion | -$19 billion | -$5 billion |\n| Scaling Development and Production of Low-Cost Weapons Systems | -$15 billion | -$13 billion | -$2 billion |\n| Enhance Military Readiness | -$15 billion | -$11 billion | -$4 billion |\n| Nuclear Deterrence | -$14 billion | -$13 billion | -$1 billion |\n| Deterrence and Readiness in the Pacific Theater | -$12 billion | -$11 billion | -$1 billion |\n| Military Personnel | -$8 billion | -$8 billion | $0 |\n| Border Security and Narcotics | -$1 billion | -$5 billion | +$4 billion |\n| Military Intelligence, Cyber Security, and Oversight | <-$1 billion | -$2 billion | <+$2 billion |\n| Subtotal: Armed Services | -$150 billion | -$144 billion | -$6 billion |\n| Homeland Security and Government Affairs | |||\n| Election for At-Will Employment and Lower Federal Employee Retirement System (FERS) Contributions for New Federal Employees | N/A | $4 billion | -$4 billion |\n| Tighten Eligibility for Family Members in the Federal Employee Health Benefit System and Other Government Affairs Related Savings | $2 billion | $1 billion | +$1 billion |\n| Eliminate FERS Annuity Supplement for Certain Employees | N/A | $7 billion | -$7 billion |\n| Expand Immigration and Customs Enforcement (ICE) Detention Capacity | -$45 billion | -$45 billion | $0 |\n| Border Wall Construction and Border Security Facilities Enhancements | -$50 billion | -$50 billion | $0 |\n| Customs and Border Protection (CBP) Personnel and Vehicles | -$7 billion | -$8 billion | +$1 billion |\n| CBP Technology and Other Border Security Enhancements | -$6 billion | -$6 billion | $0 |\n| Other Spending, Homeland Security Grants, and Reimbursements to State and Local Jurisdictions | -$11 billion | -$1 billion | -$10 billion |\n| State Border Security Reimbursement | -10 billion | -$12 billion | +$2 billion |\n| Security, Planning, and Other Costs Related to the 2026 FIFA World Cup and 2028 Olympics | -2 billion | -$2 billion | $0 |\n| Subtotal: Homeland Security and Government Affairs | -$129 billion | -$112 billion | -$17 billion |\n| Judiciary | |||\n| Visa Integrity Fee | $27 billion | $29 billion | -$2 billion |\n| Form I-94 Fee | $10 billion | $11 billion | -$1 billion |\n| Electronic System for Travel Authorization fee | $3 billion | N/A | +$3 billion |\n| Fee Relating to Termination, Renewal, and Extension of Employment Authorization for Asylum Applicants | $1 billion | $14 billion | -$13 billion |\n| Fee Relating to Renewal and Extension of Employment Authorization for Aliens Granted Temporary Protected Status | $1 billion | $4 billion | -$3 billion |\n| Diversity Immigrant Visa Fees | N/A | $6 billion | -$6 billion |\n| Other Immigration Fees | $3 billion | $9 billion | -$6 billion |\n| Immigration and Border Security Related Funding | -$45 billion | -$36 billion | -$9 billion |\n| Radiation Exposure Compensation Act Expansion | -$8 billion | N/A | -$8 billion |\n| Subtotal: Judiciary | -$9 billion | $37 billion | -$46 billion |\n| Health, Education, Labor, and Pensions | |||\n| Simplify and Reform Loan Repayment | $269 billion | $295 billion | -$26 billion |\n| Limit Borrowing for Graduate Students and by Enrollment Intensity | $44 billion | $50 billion | -$6 billion |\n| Prevent Presidents from Unilaterally Enacting Debt Cancellation | N/A | $32 billion | -$32 billion |\n| Repeal Loan Discharge Authority | $17 billion | $16 billion | +$1 billion |\n| Create New Accountability Rules and Exempt Certain Assets from Aid Eligibility Calculation | $1 billion | $6 billion | -$5 billion |\n| Fund Pell Shortfall and Create Workforce Pell | -$11 billion | -$11 billion | $0 |\n| Funding for Sponsor Vetting for Unaccompanied Alien Children and Garden of Heroes | <-$1 billion | N/A | <-$1 billion |\n| Interactions | -$42 billion | -$41 billion | -$1 billion |\n| Fund Appropriations for ACA Cost Sharing Reductions | N/A | $34 billion | -$34 billion |\n| Eliminate In-School Interest Forgiveness | N/A | $20 billion | -$20 billion |\n| Modify Pell Eligibility | <$1 billion | $8 billion | <-$8 billion |\n| Restrict Parent Borrowing and Increase Undergraduate Limits | N/A | -$19 billion | +$19 billion |\n| Repeal For-Profit Accountability Rules | N/A | -$7 billion | +$7 billion |\n| Subtotal: Health, Education, Labor, and Pensions | $278 billion | $383 billion | -$105 billion |\n| Agriculture, Nutrition, and Forestry | |||\n| Strengthen SNAP Work Requirements | $69 billion | $92 billion | -$23 billion |\n| Establish SNAP Matching Funds Requirement for States^ | $34 billion | $128 billion | -$94 billion |\n| Limit Executive Power to Increase Agricultural Subsidies | $37 billion | $37 billion | $0 |\n| Reduce Federal Share of Administrative Costs for SNAP Program | $25 billion | $27 billion | -$2 billion |\n| Exclude Internet Expenses from SNAP Benefit Calculations | $11 billion | $11 billion | $0 |\n| Link Eligibility for SNAP Benefits on Receipt of Other Federal Benefits | $6 billion | $7 billion | -$1 billion |\n| Restrict SNAP Eligibility for Undocumented Individuals | $2 billion | $4 billion | -$2 billion |\n| Other Savings Provisions | $7 billion | $13 billion | -$6 billion |\n| Increase Farm Subsidies and Other Agricultural Safety Net Programs | -$65 billion | -$52 billion | -$13 billion |\n| Fund Agricultural Trade Promotion | -$2 billion | -$2 billion | $0 |\n| Other Spending Provisions | -$4 billion | -$4 billion | $0 |\n| Interactions | -$5 billion | -$24 billion | +$19 billion |\n| Subtotal: Agriculture, Nutrition, and Forestry | $114 billion | $237 billion | -$123 billion |\n| Commerce, Science, and Transportation | |||\n| Spectrum Auctions | $85 billion | $88 billion | -$3 billion |\n| Highway Trust Fund Fees for Electric Vehicles | N/A | $39 billion | -$39 billion |\n| Rescissions and Other Offsetting Provisions | $4 billion | $1 billion | +$3 billion |\n| Coast Guard Mission Readiness | -$23 billion | -$20 billion | -$3 billion |\n| Air Traffic Control Improvements | -$12 billion | -$12 billion | $0 |\n| Space Exploration, Other Spending Increases and Revenue Reductions | -$11 billion | N/A | -$11 billion |\n| Subtotal: Commerce, Science, and Transportation | $44 billion | $96 billion | -$52 billion |\n| Energy and Natural Resources | |||\n| Onshore Oil and Gas Leasing | $11 billion | $13 billion | -$2 billion |\n| Offshore Oil and Gas Leasing | $4 billion | $6 billion | -$2 billion |\n| Alaskan Oil and Gas Leasing | $1 billion | $1 billion | $0 |\n| Funding Repeals and Rescissions | $7 billion | $7 billion | $0 |\n| Land Sales and Timber Sales | $6 billion | N/A | +$6 billion |\n| Environmental Review Fees, Coal Mining Royalties, and Other Spending Cuts | <$1 billion | $2 billion | <-$2 billion |\n| Strategic Petroleum Reserve | -$1 billion | -$2 billion | +$1 billion |\n| Funding for Water Storage and Conveyance, as well as America's 250th Anniversary | -$1 billion | -$3 billion | +$2 billion |\n| Other Spending Provisions | -$1 billion | -$2 billion | +$1 billion |\n| Subtotal: Energy and Natural Resources | $27 billion | $22 billion | +$5 billion |\n| Environment and Public Works | |||\n| Repeal Biden Administration \"Tailpipe\" Vehicle Emissions Rule and CAFE Standards | N/A | $8 billion | -$8 billion |\n| Rescission of Neighborhood Access and Equity Grant Program | $2 billion | $2 billion | $0 |\n| Rescission of Low-Carbon Transportation Materials Grants | $1 billion | $1 billion | $0 |\n| Other Rescissions | $2 billion | $2 billion | $0 |\n| Rescission of Funding for Methane Emissions and Waste Reduction Incentive Program | -$1 billion | -$1 billion | $0 |\n| Kennedy Center Funding | <-$1 billion | <-$1 billion | $0 |\n| Subtotal: Environment and Public Works | $3 billion | $12 billion | -$9 billion |\n| Banking, Housing, and Urban Affairs | |||\n| Cap CFPB Authority to Draw Funds from Federal Reserve | $2 billion | $4 billion | -$2 billion |\n| Other Savings Provisions | $1 billion | $1 billion | $0 |\n| Defense Production Act Fund | -$1 billion | N/A | -$1 billion |\n| Subtotal: Banking, Housing, and Urban Affairs | $2 billion | $5 billion | -$3 billion |\n| Additional Interactions and Other Changes | -$3 billion | -$11 billion | +$8 billion |\n| PRIMARY DEFICIT IMPACT | -$3,366 billion | -$2,416 billion | -$950 billion |\n| Interest | -$713 billion | -$551 billion | -$162 billion |\n| TOTAL DEBT IMPACT WITH INTEREST | -$4.1 trillion | -$3.0 trillion | -$1.1 trillion |\n| TOTAL DEBT IMPACT WITH INTEREST IF PERMANENT | -$5.5 trillion | -$5.0 trillion | -$0.5 trillion |\nTotals may not sum due to rounding\n* Figure includes the $3,761 billion current policy baseline adjustment, reflecting the hidden cost of extending TCJA\n^ Rough CRFB estimates based on Senate \"wraparound\" amendment"
    },
    {
      "url": "https://www.federalreserve.gov/monetarypolicy/openmarket.htm",
      "text": "Open Market Operations\nOpen market operations (OMOs)--the purchase and sale of securities in the open market by a central bank--are a key tool used by the Federal Reserve in the implementation of monetary policy. The short-term objective for open market operations is specified by the Federal Open Market Committee (FOMC). Before the global financial crisis, the Federal Reserve used OMOs to adjust the supply of reserve balances so as to keep the federal funds rate--the interest rate at which depository institutions lend reserve balances to other depository institutions overnight--around the target established by the FOMC.\nThe Federal Reserve's approach to the implementation of monetary policy has evolved considerably since the financial crisis, and particularly so since late 2008 when the FOMC established a near-zero target range for the federal funds rate. From the end of 2008 through October 2014, the Federal Reserve greatly expanded its holding of longer-term securities through open market purchases with the goal of putting downward pressure on longer-term interest rates and thus supporting economic activity and job creation by making financial conditions more accommodative.\nDuring the policy normalization process that commenced in December 2015, the Federal Reserve first used overnight reverse repurchase agreements (ON RRPs)--a type of OMO--as a supplementary policy tool, as necessary, to help control the federal funds rate and keep it in the target range set by the FOMC.\nIn September 2019, the Federal Reserve used term and overnight repurchase agreements (repo) to ensure that the supply of reserves remain ample even during periods of sharp increases in non-reserve liabilities, and to mitigate the risk of money market pressures that could adversely affect policy implementation. The Federal Reserve continued to offer overnight repos and, amid the COVID-related stress around March 2020, term and overnight repos played an important role in ensuring that the supply of reserves remained ample and supporting the smooth functioning of short-term U.S. dollar funding markets.\nIn the Statement Regarding Repurchase Agreement Arrangements released on July 28, 2021, the Federal Reserve announced the establishment of a domestic standing repo facility (SRF). Under the SRF, the Federal Reserve conducts daily overnight repo operations against eligible securities. The SRF serves as a backstop in money markets to support the effective implementation of monetary policy and smooth market functioning.\nFor additional information, see: http://www.federalreserve.gov/monetarypolicy/bst_openmarketops.htm\nThe Federal Reserve Bank of New York publishes a detailed explanation of OMOs each year in its Annual Report. For a description of open market operations during the 1990s, see the article in the Federal Reserve Bulletin (102 KB PDF).\nFor additional information on how the Federal Reserve will use ON RRPs during the policy normalization process, see: http://www.federalreserve.gov/monetarypolicy/overnight-reverse-repurchase-agreements.htm\nFOMC's target federal funds rate or range, change (basis points) and level\n2024 | 2023 | 2022 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2008 | 2007 | 2006 | 2005 | 2004 | 2003 | Historical Archive\n2024\n| December 19 |\n0 |\n25 |\n4.25-4.50 |\n| November 8 |\n0 |\n25 |\n4.50-4.75 |\n| September 19 |\n0 |\n50 |\n4.75-5.00 |\nBack to year navigation\n2023\n| July 27 |\n25 |\n0 |\n5.25-5.50 |\n| May 4 |\n25 |\n0 |\n5.00-5.25 |\n| March 23 |\n25 |\n0 |\n4.75-5.00 |\n| February 2 |\n25 |\n0 |\n4.50-4.75 |\nBack to year navigation\n2022\n| December 15 |\n50 |\n0 |\n4.25-4.50 |\n| November 3 |\n75 |\n0 |\n3.75-4.00 |\n| September 22 |\n75 |\n0 |\n3.00-3.25 |\n| July 28 |\n75 |\n0 |\n2.25-2.50 |\n| June 16 |\n75 |\n0 |\n1.50-1.75 |\n| May 5 |\n50 |\n0 |\n0.75-1.00 |\n| March 17 |\n25 |\n0 |\n0.25-0.50 |\nBack to year navigation\n2020\n| March 16 |\n0 |\n100 |\n0-0.25 |\n| March 4* |\n0 |\n50 |\n1.00-1.25 |\nBack to year navigation\n2019\n| October 31 |\n0 |\n25 |\n1.50-1.75 |\n| September 19 |\n0 |\n25 |\n1.75-2.00 |\n| August 1 |\n0 |\n25 |\n2.00-2.25 |\nBack to year navigation\n2018\n| December 20 |\n25 |\n0 |\n2.25-2.50 |\n| September 27 |\n25 |\n0 |\n2.00-2.25 |\n| June 14 |\n25 |\n0 |\n1.75-2.00 |\n| March 22 |\n25 |\n0 |\n1.50-1.75 |\nBack to year navigation\n2017\n| December 14 |\n25 |\n0 |\n1.25-1.50 |\n| June 15 |\n25 |\n0 |\n1.00-1.25 |\n| March 16 |\n25 |\n0 |\n0.75-1.00 |\nBack to year navigation\n2016\n| December 15 |\n25 |\n0 |\n0.50-0.75 |\nBack to year navigation\n2015\n| December 17 |\n25 |\n0 |\n0.25-0.50 |\nBack to year navigation\n2008\n| December 16 |\n... |\n75-100 |\n0-0.25 |\n| October 29 |\n... |\n50 |\n1.00 |\n| October 8 |\n... |\n50 |\n1.50 |\n| April 30 |\n... |\n25 |\n2.00 |\n| March 18 |\n... |\n75 |\n2.25 |\n| January 30 |\n... |\n50 |\n3.00 |\n| January 22 |\n... |\n75 |\n3.50 |\nBack to year navigation\n2007\n| December 11 |\n... |\n25 |\n4.25 |\n| October 31 |\n... |\n25 |\n4.50 |\n| September 18 |\n... |\n50 |\n4.75 |\nBack to year navigation\n2006\n| June 29 |\n25 |\n... |\n5.25 |\n| May 10 |\n25 |\n... |\n5.00 |\n| March 28 |\n25 |\n... |\n4.75 |\n| January 31 |\n25 |\n... |\n4.50 |\nBack to year navigation\n2005\n| December 13 |\n25 |\n... |\n4.25 |\n| November 1 |\n25 |\n... |\n4.00 |\n| September 20 |\n25 |\n... |\n3.75 |\n| August 9 |\n25 |\n... |\n3.50 |\n| June 30 |\n25 |\n... |\n3.25 |\n| May 3 |\n25 |\n... |\n3.00 |\n| March 22 |\n25 |\n... |\n2.75 |\n| February 2 |\n25 |\n... |\n2.50 |\nBack to year navigation\n2004\n| December 14 |\n25 |\n... |\n2.25 |\n| November 10 |\n25 |\n... |\n2.00 |\n| September 21 |\n25 |\n... |\n1.75 |\n| August 10 |\n25 |\n... |\n1.50 |\n| June 30 |\n25 |\n... |\n1.25 |\nBack to year navigation\n2003\nBack to year navigation"
    }
  ],
  "argos_summary": "Trump’s trade war has pushed the average effective tariff rate on imports to 19%, generating an estimated $3 trillion in revenue over a decade while dampening growth and raising inflation. A recent U.S. Court of International Trade ruling halted most of the tariffs, but the administration may use alternative legal tools such as Section 122, 301, or 232 to maintain pressure. The policy is expected to slow U.S. GDP growth to about 1.5 % in 2025, increase borrowing costs, and keep inflation above 3 % until 2026, but it is unlikely to trigger a recession. The Federal Reserve’s ability to offset the fiscal drag is limited by rising debt and constrained monetary policy space.",
  "argos_id": "NGHMKKN99"
}