{
  "url": "https://time.com/7314000/trump-administration-climate-report-scientists/",
  "authorsByline": "Connor Greene",
  "articleId": "f4c7268dde7d4e08a7e07f7d5639960d",
  "source": {
    "domain": "time.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://api.time.com/wp-content/uploads/2024/11/Trump-Climate-protest-2024.jpg?quality=85&w=1024&h=628&crop=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T19:21:06+00:00",
  "addDate": "2025-09-02T19:32:02.867430+00:00",
  "refreshDate": "2025-09-02T19:32:02.867432+00:00",
  "score": 1.0,
  "title": "Scientists Slam Trump Administration's Climate Report",
  "description": "Scientists said the Trump Administration cherry-picked climate change data to advance its fossil fuel interests.",
  "content": "More than 85 scientists from around the world have issued a scathing rebuttal to a recent U.S. Department of Energy (DOE) report that diminished the threat of climate change, arguing that it misrepresented data and cherry-picked numbers contrary to scientific consensus. The Trump Administration’s July review of the impact of greenhouse gas emissions claimed that the threat of climate change is exaggerated and “less damaging economically than commonly believed.” Chris Wright, the energy secretary and former fossil fuel executive, hand-selected the five authors of the report, who all refute the consensus that burning fossil fuels is quickly heating the planet.\n\n“This report makes a mockery of science,” said Dr. Andrew Dessler, one of the contributors to the 500-page report written by climate experts in response to the review. “It relies on ideas that were rejected long ago, supported by misrepresentations of the body of scientific knowledge, omissions of important facts, arm waving, anecdotes, and confirmation bias. This report makes it clear DOE has no interest in engaging with the scientific community.” Read more: Here Are All of Trump’s Major Moves to Dismantle Climate Action The scientists behind the report say the DOE report is being used to advance and justify the administration’s fossil fuel interests, at the same time as the White House has rolled back the Environmental Protection Agency’s abilities to fight against climate change in President Donald Trump’s second term. The report found several instances where the DOE authors misrepresented information on climate change, such as claiming that rising carbon dioxide can have a “net benefit” to the U.S. agricultural economy, without citing the documented consequences of increased temperatures for that industry.\n\nErrors in the DOE review included misquoting a climate report, providing incorrect explanations for scientific concepts, and confusing the results of various studies that the report cited. The Department of Energy did not respond to TIME’s request for comment on the critiques it is facing. Dr. Kim Cobb, director of the Institute at Brown for Environment and Society and co-author of the report, highlighted a “glaring omission” by the DOE of the human-caused warming of the ocean and its decimation of coral reefs through marine heat waves. Cobb also noted that the DOE argued against rising global temperatures, citing the natural variability of weather over centuries. “Maybe there was a time when that debate could be had, but that is no longer a tenable position,” Cobb told TIME. “From a scientific perspective, we have extremely robust lines of evidence pointing out that we are living through a period of unprecedented warmth.”\n\nCobb emphasized that one of the greatest threats of the DOE review is its potential to become a bedrock for future environmental policy. She described the credibility of the DOE’s review versus the scientific community’s rebuttal as “a feather on one side and 1,000 pounds of metal on the other.” “It is really important that climate scientists stand up and be active stewards of their science in the public sphere. It's part of our job. It's our responsibility to the world, to taxpayers, to the next generations. That's what we are charged with doing. And this may be the most important moment where we are called to do that,” Cobb said. The scientists who responded to the DOE’s review argue that it was compromised from the beginning due to its “tiny team of hand-picked contrarians,” the absence of a peer review process, which is standard practice for a document of this volume, cherry-picked evidence and inaccurate citations.\n\n“Normally, a report like this would undergo a rigorous, unbiased and transparent peer review. When it became clear that DOE wasn’t going to organize such a review, the scientific community came together on its own, in less than a month, to provide it,” said Dr. Robert Kopp, another contributor, upon its release.\n\nOther organizations and scientists have refuted the DOE’s review, including the American Meteorological Society, which highlighted further flaws in the report and urged a correction of the findings by the agency.\n\nTrump has taken several steps in his second term to dismantle government efforts to address climate change, including blocking state laws against climate change, expanding oil and gas production, and phasing out FEMA, the agency responsible for responding to climate-related disasters, which have become more frequent with rising global temperatures.\n\nIn his first term, Trump rolled back more than 125 environmental policies. Columbia University’s Climate Backtracker identifies steps taken by the administration to scale back climate mitigation measures, and has identified over 200 instances in Trump’s second term.",
  "medium": "Article",
  "links": [
    "https://www.energy.gov/sites/default/files/2025-07/DOE_Critical_Review_of_Impacts_of_GHG_Emissions_on_the_US_Climate_July_2025.pdf",
    "https://climate.law.columbia.edu/content/climate-backtracker",
    "https://drive.google.com/file/d/1PwAR8I9YYmPhbQ6CRekHkroJGMbjbX7l/view",
    "https://time.com/7258269/trump-climate-policies-executive-orders/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "climate change",
      "weight": 0.09018347
    },
    {
      "name": "climate scientists",
      "weight": 0.08619916
    },
    {
      "name": "climate experts",
      "weight": 0.07677418
    },
    {
      "name": "Climate Action",
      "weight": 0.075744405
    },
    {
      "name": "DOE",
      "weight": 0.07544529
    },
    {
      "name": "climate mitigation measures",
      "weight": 0.074335076
    },
    {
      "name": "Trump Administrations Climate Report",
      "weight": 0.06272218
    },
    {
      "name": "scientific consensus",
      "weight": 0.06243862
    },
    {
      "name": "scientific knowledge",
      "weight": 0.061061297
    },
    {
      "name": "scientific concepts",
      "weight": 0.06072754
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9580078125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.9208984375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.86279296875
    },
    {
      "name": "/Science/Ecology & Environment/Climate Change & Global Warming",
      "score": 0.66650390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.413818359375
    }
  ],
  "sentiment": {
    "positive": 0.051221292,
    "negative": 0.7242098,
    "neutral": 0.22456893
  },
  "summary": "Over 85 scientists from around the world have issued a scathing rebuttal to a recent U.S. Department of Energy (DOE) report, claiming it misrepresented data and cherry-picked numbers contrary to scientific consensus. The report was selected by Chris Wright, the energy secretary and former fossil fuel executive, who all refute the consensus that burning fossil fuels is heating the planet. The scientists argue that the DOE report is being used to advance and justify the administration's fossil fuel interests, while the White House has rolled back the Environmental Protection Agency's ability to fight climate change. The review's errors included misquoting a climate report, providing incorrect explanations for scientific concepts, and confusing results of various studies.",
  "shortSummary": "More than 85 scientists, including some former leaders, criticize the US Department of Energy’s climate report, alleging it misrepresented data and cherry-picked numbers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e34474a0f6fa497da00f99fffefd9bce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://time.com/7258269/trump-climate-policies-executive-orders/",
      "text": "Since taking office, President Donald Trump has been implementing a slew of actions and executive orders that stand to have wide-reaching impacts on climate policies.\nDuring Trump’s first term, the administration put climate on the back burner—rolling back more than 125 environmental rules and policies. When former-President Joe Biden took office, he led the U.S. forward on climate action, signing the Inflation Reduction Act, the largest federal climate change investment in American history.\nNow, the Trump administration stands to dismantle much of the momentum it has inherited—curbing progress to reduce fossil fuel emissions, the largest contributor to climate change, just as the world surpassed 1.5°C of warming in 2024—the hottest year on record.\nColumbia University’s Sabin Center for Climate Change Law’s “Climate Backtracker,” has logged nearly 100 efforts to scale back or eliminate federal climate mitigation and adaptation measures since the administration took office at the end of January—ranging from boosting fossil-fuel production to withdrawing the U.S. from the Paris Climate Accords.\nHere are some of the major ways the Trump Administration is undoing climate action.\nMore Logging in National Forests\nThe Trump Administration announced on June 23 that it would open up 58 million acres in national forests for road construction and development—abolishing protections that have been in place for a quarter of a century.\nU.S. Secretary of Agriculture Brooke L. Rollins called the “roadless rule,” established by Bill Clinton in 2001 to protect roadless areas of national forests, “outdated” and “overly restrictive” in his announcement of the rollback. The rule has been a source of contention among Democrats and Republicans for decades—and the source of many lawsuits.\nOn March 1, the President signed an executive order to increase timber production across 280 acres of national forests and federal land. In the executive order, Trump said that “heavy-handed Federal policies” have “prevented full utilization” of the country’s timber resources. The move appeared to be an attempt to boost domestic production ahead of imposing tariffs on foreign countries. (In 2023, the U.S. was the largest importer of wood products in the world, importing $24.8 billion worth from Canada, China, Brazil, and others.)\nLogging drastically impacts a region’s biodiversity—causing wildlife to lose their habitat and food sources and produces harmful greenhouse gas emissions. The order also directed federal agencies to look for ways to bypass endangered species protections and other environmental regulations, putting the fate of many of the nation’s long protected ecosystems at risk.\nPhasing Out FEMA\nOn June 11, Trump announced that he would begin phasing out the Federal Emergency Management Agency (FEMA), the nation’s main arm for disaster recovery, after this year’s hurricane season. He has said that the federal government will begin distributing less disaster aid, with money coming from the president’s office instead. The switch-up comes as the National Oceanic and Atmospheric Administration (NOAA) predicts an above normal hurricane season this year.\nThe president signed an executive order on Jan. 24 calling for an assessment of FEMA's effectiveness. While visiting Hurricane Helene victims in North Carolina on Jan. 24, he proposed “getting rid” of FEMA, a move that could impact the country’s ability to recover from extreme weather events that are becoming more intense and frequent due to climate change. The appointed council, which will include the Secretary of Homeland Security and the Secretary of Defense, will have one year to evaluate “the existing ability of FEMA to capably and impartially address disasters occurring within the United States.”\nRead more: The Challenge of Overhauling FEMA In a Climate Changed World\nFast-Tracking Deep-Sea Mining\nOn April 24, the Trump Administration moved forward with an executive order aimed at boosting the highly controversial practice of deep-sea mining. The order side-steps ongoing international efforts to regulate the practice, and would allow companies to approve licenses in the high seas, an area typically overseen by an intergovernmental agency, the International Seabed Agency (ISA). The U.S. never signed a U.N. treaty, overseen by the ISA, that governs the seabed, though has in the past respected it. There are currently no approved commercial-scale deep-sea mining projects anywhere in the world, and many countries have called for a moratorium until the environmental impact is better understood.\nRead more: What to Know About Trump’s Push to Boost Deep-Sea Mining\nBlocking State Climate Laws\nIn addition to rolling back federal climate action, the Trump Administration has taken action to block the enforcement of state level climate measures. In an April 8 Executive Order, the White House directed the Attorney General to identify all state and local laws on addressing climate change, ESG initiatives (short for environmental, social, and governance), environmental justice, and carbon emissions—and make moves to block them.\nMany state leaders have reaffirmed their commitment to addressing climate change in the wake of the Trump Administration’s regressions. New York governor Kathy Hochul and New Mexico governor Michelle Lujan Grisham, who co-chair the U.S. Climate Alliance, have said they will not be deterred. \"We will keep advancing solutions to the climate crisis that safeguard Americans' fundamental right to clean air and water, create good-paying jobs, grow the clean energy economy, and make our future healthier and safer,” they said in a joint statement.\nRamping up Oil and Gas Production\nOn Feb. 14, Trump signed an executive order to create a new “National Energy Dominance Council,” aimed at increasing the country’s oil and gas production. Trump’s “drill, baby, drill” approach is meant to lower energy prices and increase supply of fossil fuels. The country’s oil and gas production, however, already reached record highs under the Biden administration, according to the Center for American Progress. And some experts have warned the moves may actually harm some refineries and raise gas prices.\nIn response to Trump’s declaration of a national energy emergency, the Department of Interior said on April 23 that it would implement emergency permitting processes to accelerate approval times for energy and mining projects on federal lands.\nRead more: What Trump’s Executive Orders Really Mean for the Climate\nEPA Deregulation\nOn March 12, Environmental Protection Agency (EPA) Administrator Lee Zeldin announced 31 actions aimed at rolling back a number of significant environmental regulations, in what the agency called \"the most consequential day of deregulation in U.S. history.\" The list of targets includes reconsidering restrictions on carbon dioxide emissions from power plants, rolling back vehicle emission standards meant to accelerate a transition to EVs, and pushing to challenge a 2009 finding that greenhouse gasses like carbon dioxide and methane are a threat to public health.\nIn a video announcing the actions, Zeldin refashioned the goals of the EPA, saying the agency’s actions would help lower costs and make purchasing cars or heating homes more affordable to Americans. “Today the green new scam ends as the EPA does its part to usher in the golden age of American success,” he said.\nNOAA Staff Cuts\nMore than 600 workers at the National Oceanic and Atmospheric Administration, or NOAA, were laid off on Feb. 27 as part of the Trump Administration’s efforts to cull the federal workforce. The move stands to have profound impacts on the country’s ability to protect public safety during extreme weather events that are only increasing in frequency as the planet warms. NOAA is a vital data resource on everything from hurricanes to drought, which weather forecasters, local authorities, farmers, and others around the country rely on. The agency’s weather alerts are also an essential warning system allowing communities to protect themselves from extreme weather. Last year, NOAA recorded 27 weather and climate disasters with at least $1 billion in damages, the second highest number since the agency began tracking the numbers in 1980.\nRead more: Mass Layoffs at NOAA Spark Concerns Over Weather, Climate Research\nIn mid-March, NOAA announced it would lay off an additional 1,000 workers or more, less than a month after its first round of cuts as part of the Trump Administration’s efforts to cull the federal workforce.\nWithdrawing From Paris Accords\nOne of the administration’s first moves on the first day of Trump’s presidency, was to begin the process of withdrawing the United States from the Paris Agreement. The pact, which was signed by nearly 200 countries in 2015, aimed to curb long-term global warming to 2.7°F (2°C) above pre-industrial levels or keep temperatures below 3.6°F (1.5°C) above pre-industrial levels. The move did not come as a surprise—during his first administration, Trump also withdrew the U.S. from the agreement, though Biden rejoined upon taking office.\nRead more: What Happened the Last Time Trump Withdrew From the Paris Agreement\n“In recent years, the United States has purported to join international agreements and initiatives that do not reflect our country’s values or our contributions to the pursuit of economic and environmental objectives,” President Trump said in an executive order. “Moreover, these agreements steer American taxpayer dollars to countries that do not require, or merit, financial assistance in the interests of the American people.”\nThe move weakens the U.S. position and reliability when it comes to international climate negotiations. In a November interview with the Guardian, U.N. Secretary General António Guterres likened a potential U.S. withdrawal to losing a limb or organ. “The Paris Agreement can survive, but people sometimes can lose important organs or lose the legs and survive. But we don’t want a crippled Paris Agreement. We want a real Paris Agreement,” he said.\nIn early March, the U.S. also withdrew from the International Partners Group, an agreement which had rich countries allocate money to the green energy transition in South Africa, Indonesia, Vietnam, and Senegal, as well as the board of the Loss and Damage Fund, which is dedicated to helping developing countries weather climate disasters.\nEPA Cuts\nThe Trump Administration and its newly created Department of Governmental Efficiency (DOGE) proposed sweeping cuts to many federal agencies, including the EPA. At the beginning of February, the agency told more than 1,000 “probationary” employees, those who had been working for the agency for less than a year, that they could be fired immediately, according to NBC News. The agency has since “terminated” nearly 400 employees, according to The Hill.\nThe reduction of staff could impact the organization's speed and ability to respond to crises—like tackling environmental health risks or implementing regulations.\nBanning Paper Straws\nTrump signed an executive order on Feb. 10 ending the use of paper straws by the federal government, calling them “nonfunctional” and urging the Assistant to the President for Domestic Policy and “relevant agencies” to “issue a national strategy to end the use of paper straws” within 45 days. The move, while considered largely symbolic, undoes part of a Biden Administration initiative aimed at phasing out the use of single-use plastics, such as plastic straws and water bottles, from all federal operations by 2035.\nPausing Electric Vehicle Adoption\nIn 2021, the Biden Administration set a goal to have EVs make up half of all new cars sold by 2030, a move which President Trump revoked upon returning to power. The Federal Highway Administration (FHWA) also released a memo on Feb. 6 saying that the Department of Transportation was reviewing the implementation of the National Electric Vehicle Infrastructure (NEVI) Formula Program. The move froze roughly $3 billion dollars in funding that was allocated to expand the network of electric vehicle charging stations across the country, according to Atlas Public Policy.\nAccording to the most recent EPA data, in 2022 transportation was the largest source (28%) of emissions in the U.S. Decarbonizing this sector would go a long way to reducing the country’s carbon footprint.\nMore Must-Reads from TIME\n- Cybersecurity Experts Are Sounding the Alarm on DOGE\n- Meet the 2025 Women of the Year\n- The Harsh Truth About Disability Inclusion\n- Why Do More Young Adults Have Cancer?\n- Colman Domingo Leads With Radical Love\n- How to Get Better at Doing Things Alone\n- Michelle Zauner Stares Down the Darkness\nWrite to Simmone Shah at simmone.shah@time.com"
    }
  ],
  "argos_summary": "Scientists from around the world have publicly rebuked a July DOE report that downplayed climate change, arguing it cherry‑picked data and misrepresented scientific consensus. The critique, led by 85 climate experts, highlights errors such as claiming CO₂ benefits agriculture and ignoring ocean warming impacts. The report’s findings are seen as a tool to advance fossil‑fuel interests amid a broader Trump climate rollback agenda. The scientific community’s rapid response underscores the potential policy influence of the DOE review.",
  "argos_id": "NSQ1I98RR"
}