{
  "url": "https://www.independent.co.uk/news/hiv-uganda-hiv-infection-africa-b2818291.html",
  "authorsByline": "Matt Sedensky",
  "articleId": "493125f2f893445991f080ea07400b53",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/09/02/08/APTOPIX_Aging_Africa_HIV_33246.jpg?width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-09-02T07:20:44+00:00",
  "addDate": "2025-09-02T07:38:04.675407+00:00",
  "refreshDate": "2025-09-02T07:38:04.675409+00:00",
  "score": 1.0,
  "title": "For many with HIV, drugs lifted their death sentence. Now they must face old age.",
  "description": "They survived HIV",
  "content": "Past a smoldering pile of trash and two bleating goats, through a doorway beginning to buckle beneath the weight of the bricks above, is a darkened room where a skeletal, 70-year-old man lies on a pillowless bed above a floor littered with trash.\n\nThe lone window’s shutters are closed but enough shards of sun make it through holes in the corroded roof to see Joseph Malagho’s ribs poke at the skin of his torso and legs like twigs inside his olive green pants. As he struggles to sit up, leaves crinkle beneath him on a soiled sheet. His mattress sags. The air is thick and stale.\n\nMalagho has no illusions about the difficulty of growing old. But the fact that he is here at all is its own miracle.\n\nAcross Africa, millions who once faced the death sentence of an HIV infection have survived only to face something nearly as daunting: old age.\n\nAs infections have dropped markedly and antiretroviral drugs have reduced mortality, the turnaround of the AIDS crisis has helped build Africa’s longevity revolution. Lives that were expected to be cut short instead continued decades more, changing the demographics of those facing the disease and fueling the rush of people encountering health systems that were never built for old age.\n\nMalagho isn’t sure when he was infected, but he was diagnosed about five years ago. His health has steadily declined since. He has tuberculosis now, too, and can barely stand.\n\nHe hasn’t left this room in months.\n\nThere is barely any soap for his wife to wash him with a rag. His lone source of entertainment, a small radio, has gone dead, and there’s no money for batteries. He has lost most of his teeth and can’t afford dentures, but there is little food to eat anyway.\n\n“If there is food or not,” he says, “I don’t even care.”\n\nHe urinates into a small white bucket and his wife hurls it outside just as the first drops of rain begin to strafe the roof and start leaking to the space below.\n\nReach One Touch One sponsors Malagho and has dispatched a field worker, Grace Nabanoba, to check on him this day.\n\nThe organization distributes food and medicine to many of its beneficiaries and helps repair homes, install water tanks and provide basic items, like a bed for seniors who are sleeping on dirt floors. But there are limits to what it can do and Nabanoba feels helpless as she stands before Malagho.\n\nShe promises him batteries for his radio and exits the home. Sometimes, after visiting him, colleagues will ask her why she’s quiet and she’ll slink off to cry.\n\n“Some situations,” she says, “are too hard to bear.”\n\nMatt Sedensky can be reached at msedensky@ap.org and https://x.com/sedensky",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/topic/hiv",
    "https://www.independent.co.uk/topic/africa"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "old age",
      "weight": 0.066689596
    },
    {
      "name": "Malagho",
      "weight": 0.065809
    },
    {
      "name": "little food",
      "weight": 0.058553305
    },
    {
      "name": "Grace Nabanoba",
      "weight": 0.05663502
    },
    {
      "name": "antiretroviral drugs",
      "weight": 0.052588195
    },
    {
      "name": "food",
      "weight": 0.051793627
    },
    {
      "name": "health systems",
      "weight": 0.049966488
    },
    {
      "name": "enough shards",
      "weight": 0.04949393
    },
    {
      "name": "Matt Sedensky",
      "weight": 0.048882373
    },
    {
      "name": "dirt floors",
      "weight": 0.048033886
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Health"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Health News",
      "score": 0.6982421875
    },
    {
      "name": "/Sensitive Subjects/Recreational Drugs",
      "score": 0.63427734375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.5185546875
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.4794921875
    },
    {
      "name": "/Health/Medical Literature & Resources/Other",
      "score": 0.352783203125
    }
  ],
  "sentiment": {
    "positive": 0.070294484,
    "negative": 0.6666099,
    "neutral": 0.26309562
  },
  "summary": "The turnaround of the AIDS crisis in Africa has allowed millions of HIV patients to survive despite facing the death sentence of an HIV infection. Joseph Malagho, a 70-year-old man who was diagnosed about five years ago, has been unable to leave the room where he lies on a pillowless bed and barely uses soap for his wife to wash him and his radio. His health has deteriorated, and he has lost most of his teeth and cannot afford dentures. One Touch One sponsors Malaghi and sends out field worker Grace Nabanoba to check on him. The organization provides food and medicine to many of its beneficiaries and provides basic necessities like basic housing and basic necessities.",
  "shortSummary": "The AIDS crisis in Africa has transformed lives, enabling many to recover from severe illnesses like that in old age and relying on traditional health systems for survival.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f2195c990305405bb87aef13d1874b87",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "In Africa, the success of antiretroviral therapy has turned HIV from a death sentence into a chronic condition, leaving many patients like 70‑year‑old Joseph Malagho to confront the challenges of old age. Malagho’s deteriorating health, compounded by tuberculosis and poverty, highlights the strain on health systems that were never designed for an aging HIV population. NGOs such as Reach One Touch One provide basic aid, but resources remain scarce, underscoring the need for broader support for elderly HIV survivors.",
  "argos_id": "OVEQMPZ4V"
}