{
  "url": "https://seekingalpha.com/article/4818457-wall-street-breakfast-podcast-wall-street-futures-slip-to-start-september",
  "authorsByline": "Wall Street Breakfast",
  "articleId": "262e6e78deac471db82e7122a6502c57",
  "source": {
    "domain": "seekingalpha.com",
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187254257/image_2187254257.jpg?io=getty-c-w1536",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T10:55:00+00:00",
  "addDate": "2025-09-02T10:58:25.108082+00:00",
  "refreshDate": "2025-09-02T10:58:25.108084+00:00",
  "score": 1.0,
  "title": "Wall Street Breakfast Podcast: Wall Street Futures Slip",
  "description": "Wall Street slides as renewed tariff uncertainty weighs. Tesla falls short in India with about 600 orders since launch. Meta created flirty chatbots of celebrities, including Taylor Swift.",
  "content": "Listen below or on the go on Apple Podcasts and Spotify\n\nWall Street slides as renewed tariff uncertainty weighs. (00:31) Tesla falls short in India with about 600 orders since launch, Bloomberg News reports. (01:26) Meta created flirty chatbots of celebrities, including Taylor Swift, without consent: report. (02:10)\n\nThis is an abridged transcript.\n\nWall Street is looking at a negative start to September, with stock index futures down this morning.\n\nThe 10-year Treasury yield (US10Y) rose 2 basis points to 4.28%. The 2-year yield (US2Y) was flat at 3.64%.\n\nOne item of note happening today is that President Trump is set to make a statement from the Oval Office at 2pm.\n\nUBS' Paul Donovan said, “There are a number of topics the president may choose to address and a number of directions that may be taken on each of those topics. Uncertainty about policy has economic consequences—relevant as markets consider the next employment report on Friday.\"\n\nTesla (NASDAQ:TSLA) has reportedly received orders for just over 600 cars since launching sales in India in mid-July.\n\nBloomberg News reported, citing people familiar with the matter, that the number falls short of Tesla's own expectations.\n\nDeliveries will initially be limited to Mumbai, Delhi, Pune, and Gurugram, the report said, adding that the size of shipments is based on the full payments it has received for the cars as well as the company's ability to deliver outside the four cities where it has a physical presence.\n\nTesla (NASDAQ:TSLA) officially entered the Indian market in July with the launch of its Model Y electric SUV, priced at around ₹6 million ($69,751).\n\nAnd now for a trending article on Seeking Alpha.\n\nMeta reportedly appropriated the names and likenesses of celebrities, including Taylor Swift, Scarlett Johansson, Anne Hathaway and Selena Gomez, to develop dozens of flirty social-media chatbots…and it was done without their consent.\n\nAccording to Reuters, several of these were created by users with a Meta tool for developing chatbots, but a Meta employee also produced at least three, including two Taylor Swift “parody” bots.\n\nThe report added that Meta also allowed users to develop publicly available chatbots of child celebrities, including a 16-year-old movie star.\n\nAll the virtual celebrities have been shared on Meta’s social media platforms, Facebook, Instagram and WhatsApp. In several weeks of Reuters testing to see the bots’ behavior, the avatars often insisted they were the real actors and artists. The bots routinely made sexual advances, often inviting a test user for meetings, according to the report.\n\nMeta spokesperson Andy Stone told the news agency that the company's AI tools should not have created intimate images of adult celebrities or any photos of child artists. He also blamed Meta’s production of images of female celebrities wearing lingerie on failures of the company’s enforcement of its own policies, which forbid such content, the report added.\n\nMeta’s rules also forbid “direct impersonation,” but Stone said that the celebrity characters were acceptable so long as the company labeled them as parodies. Many were labeled but Reuters found that some were not.\n\nMeta deleted about a dozen of the bots, both “parody” avatars and unlabeled ones, shortly before the story was published.\n\nTrump says India offered to cut tariffs to zero, slams purchase of Russian oil and arms\n\nMetaplanet gains shareholder approval to raise up to $3.8 billion to buy more bitcoin\n\nBessent bets on Supreme Court upholding Trump tariffs but keeps backup plan ready - report\n• None The three-day Commercial UAV Expo will begin in Las Vegas. The conference is considered the leading international trade show and conference dedicated to commercial unmanned aerial systems. Workhorse Group (WKHS), Sony (SONY), Trimble (TRMB), KULR Technology Group (KULR) and Teledyne (TDY) are some of the companies scheduled to participate.\n• None Lucid Group (LCID) will begin trading on a split-adjusted basis after the company's 1-for-10 reverse stock split.\n\nWe’ve already touched on Dow, S&P and Nasdaq futures.\n\nCrude oil is up 1.8% $65/barrel. Bitcoin is up 1.1% at $110,000. Gold is flat at $3,478.\n\nThe FTSE 100 is down 0.4% and the DAX is down 1%.\n\nThe biggest movers for the day premarket: Frontier Group Holdings (NASDAQ:ULCC) +8% - Shares surged after Deutsche Bank upgraded the low-cost carrier to buy from hold, citing its strong positioning to capture market share following Spirit Airlines’ bankruptcy.",
  "medium": "Article",
  "links": [
    "https://seekingalpha.com/symbol/TSLA#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews",
    "https://seekingalpha.com/news/4490951-sp500-nasdaq-dow-jones-outlook-stock-market",
    "https://seekingalpha.com/symbol/TRMB",
    "https://seekingalpha.com/symbol/SONY",
    "https://seekingalpha.com/symbol/US10Y#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews",
    "https://seekingalpha.com/news/4490937-tesla-falls-short-in-india-with-about-600-orders-since-launch-bloomberg-news-reports",
    "https://seekingalpha.com/symbol/WKHS",
    "https://seekingalpha.com/news/4490939-trump-says-india-offered-to-cut-tariffs-to-zero-slams-purchase-of-russian-oil-and-arms",
    "https://seekingalpha.com/symbol/US100:IND#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews",
    "https://seekingalpha.com/news/4490933-bessent-bets-on-supreme-court-upholding-trump-tariffs-but-keeps-backup-plan-ready---report",
    "https://seekingalpha.com/symbol/SPX",
    "https://seekingalpha.com/symbol/US2Y#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews",
    "https://seekingalpha.com/symbol/LCID",
    "https://seekingalpha.com/symbol/KULR",
    "https://seekingalpha.com/symbol/ULCC#hasComeFromMpArticle=false#source=section%3Amain_content%7Cbutton%3Abody_link%7Cfirst_level_url%3Anews",
    "https://seekingalpha.com/news/4490944-metaplanet-gains-shareholder-approval-to-raise-up-to-38-billion-to-buy-more-bitcoin",
    "https://open.spotify.com/show/05uLjJxkVgQsRk8LWLCLpx?si=r3_yJgxiQiivJwNQG8WNew&nd=1",
    "https://podcasts.apple.com/us/podcast/wall-street-breakfast/id1358381502?mt=2",
    "https://www.reuters.com/business/meta-created-flirty-chatbots-taylor-swift-other-celebrities-without-permission-2025-08-29/",
    "https://seekingalpha.com/news/4490959-biggest-stock-movers-tuesday-ftnt-ulcc-and-more",
    "https://seekingalpha.com/news/4490735-meta-created-flirty-chatbots-of-celebrities-including-taylor-swift-without-consent",
    "https://seekingalpha.com/symbol/INDU",
    "https://seekingalpha.com/symbol/TDY"
  ],
  "labels": [
    {
      "name": "Opinion"
    },
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "child celebrities",
      "weight": 0.061690383
    },
    {
      "name": "female celebrities",
      "weight": 0.059897956
    },
    {
      "name": "adult celebrities",
      "weight": 0.059819363
    },
    {
      "name": "Meta spokesperson Andy Stone",
      "weight": 0.05877356
    },
    {
      "name": "Wall Street Futures",
      "weight": 0.058633927
    },
    {
      "name": "celebrities",
      "weight": 0.05840327
    },
    {
      "name": "Meta",
      "weight": 0.056244314
    },
    {
      "name": "Trump tariffs",
      "weight": 0.055858653
    },
    {
      "name": "KULR Technology Group",
      "weight": 0.05458159
    },
    {
      "name": "Frontier Group Holdings",
      "weight": 0.053449266
    }
  ],
  "topics": [
    {
      "name": "Podcasts"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9970703125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97802734375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.57275390625
    }
  ],
  "sentiment": {
    "positive": 0.14486891,
    "negative": 0.35611126,
    "neutral": 0.49901977
  },
  "summary": "Wall Street futures have slipped due to renewed tariff uncertainty, with the 10-year Treasury yield (US10Y) rising 2 basis points to 4.28%. Meanwhile, Tesla fell short in India with about 600 orders since its launch in mid-July, according to Bloomberg News. The company, Meta, reportedly created flirty chatbots of celebrities, including Taylor Swift, without their consent. This comes as President Trump is set to make a statement from the Oval Office regarding the upcoming employment report. The three-day Commercial UAV Expo in Las Vegas will begin in place of companies such as Workhorse Group (TRMB), KULRADA, and TelTDY.",
  "shortSummary": "Wall Street Futures slip as renewed tariff uncertainty raises concerns about global economic stability, while Tesla's Indian sales fall short and Meta's celebrity chatbots become unsolicited.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "de31f856f31e4b6fae3e1a3e7609d47c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Wall Street futures slipped on renewed tariff uncertainty, with the S&P 500 and Nasdaq futures down. The 10‑year Treasury yield rose to 4.28%, while the 2‑year held steady at 3.64%. Tesla's India launch underperformed with only about 600 orders, and Meta faced scrutiny for creating unconsented celebrity chatbots. Trump is scheduled to speak at 2 pm, adding further policy uncertainty.",
  "argos_id": "PTG0NPCTL"
}