{
  "url": "https://www.washingtonexaminer.com/daily-on-energy/3790097/daily-on-energy-gold-bars-legal-update-doi-accelerates-coal-leasing-sage-grouse/",
  "authorsByline": "Callie Patteson and Maydeen Merino, Callie Patteson, Maydeen Merino",
  "articleId": "a5b9b9440acd4817918410737bf542b1",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2024/07/DOE.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T19:24:22+00:00",
  "addDate": "2025-09-02T19:35:13.694256+00:00",
  "refreshDate": "2025-09-02T19:35:13.694259+00:00",
  "score": 1.0,
  "title": "Daily on Energy: ‘Gold bars’ legal update, DOI accelerates coal leasing, and a sage grouse rollback",
  "description": "WHAT’S HAPPENING TODAY: Good afternoon and happy Tuesday, readers! We hope you all had a relaxing Labor Day weekend.  An appeals court has sided with",
  "content": "WHAT’S HAPPENING TODAY: Good afternoon and happy Tuesday, readers! We hope you all had a relaxing Labor Day weekend.\n\nAn appeals court has sided with the Environmental Protection Agency in its efforts to claw back billions in grants from the Greenhouse Gas Reduction Fund. The ruling is the latest development in the ongoing legal battle between the EPA and climate groups.\n\nWelcome to Daily on Energy, written by Washington Examiner energy and environment writers Callie Patteson (@CalliePatteson) and Maydeen Merino (@MaydeenMerino). Email cpatteson@washingtonexaminer dot com or mmerino@washingtonexaminer dot com for tips, suggestions, calendar items, and anything else. If a friend sent this to you and you’d like to sign up, click here. If signing up doesn’t work, shoot us an email, and we’ll add you to our list.\n\nAPPEALS COURT RULES AGAINST FEDERAL JUDGE IN GREENHOUSE GAS REDUCTION FUND CASE: A three-judge U.S. Court of Appeals panel issued a 2-1 ruling this morning in favor of the Environmental Protection Agency’s efforts to claw back billions of dollars in grant money to climate groups.\n\nThe case: The EPA for months has sought to terminate climate groups’ grant money from the Greenhouse Gas Reduction Fund, which was established as part of the Inflation Reduction Act. However, EPA Administrator Lee Zeldin claimed the fund was mismanaged and lacked oversight, and that funds were improperly distributed by being routed through Citibank.\n\nThe EPA’s efforts to terminate the fund were quickly met with legal challenges brought by the grantees: Climate United, Coalition for Green Capital, and Power Forward Communities.\n\nThe appeals court ruling is the latest twist in the battle between the climate groups and the EPA. Today’s ruling overturned District Judge Tanya Chutkan’s decision in April that would have allowed the groups access to grant money held in Citibank.\n\nThe majority rule said the district court “abused its discretion” by issuing the injunction preventing the EPA from rescinding the funds. The judges added the plaintiffs were not likely to succeed in their case because it belonged in the Court of Federal Claims, not the district court.\n\nReaction: Climate United CEO Beth Bafford said in a statement, “While we are disappointed by the panel’s decision, we stand firm on the merits of our case: EPA unlawfully froze and terminated funds that were legally obligated and disbursed.”\n\n“This is another hurdle in our fight to lower energy costs for those who need it most while creating jobs for hardworking Americans, but we will continue to press on for communities across the country that stand to benefit from clean, abundant, and affordable energy. This is not the end of our road,” she added.\n\nRead more by Maydeen here.\n\nDOI ADVANCES COAL LEASE SALES: The Department of the Interior advanced three coal lease sales in Alabama, Montana, and Utah for this fall as part of the Trump administration’s efforts to revive the coal industry.\n\nThe lease sales: In Alabama, the Bureau of Land Management will offer two lease areas covering nearly 14,050 acres beneath private lands in Tuscaloosa County. The area contains an estimated 53 million tons of metallurgical coal or met coal, which is used in steelmaking. The bid will be held on Sept. 30.\n\nIn Utah, BLM will offer about 120 acres known as the Little Eccles Tract, which contains an estimated 1.29 million tons of recoverable coal. Sealed bid offers must be submitted by Oct. 1.\n\nLastly, in Montana, BLM will offer nearly 1,262 acres containing an estimated 167.5 million tons of recoverable coal. Bids for the lease are due Oct. 3.\n\n“By moving forward with these lease sales, we are creating good-paying jobs, supporting local communities, and securing the resources that keep America strong,” Interior Secretary Doug Burgum said in a statement. “President Trump’s leadership is putting American workers first and ensuring our nation’s energy future is built on reliable, homegrown resources.”\n\nThe DOI moves are aligned with Trump’s executive order, “Reinvigorating America’s Beautiful Clean Coal Industry,” which is meant to revive the coal industry by opening up public land for coal leasing.\n\nHIGH ELECTRICITY PRICES ARE CHRIS WRIGHT’S TOP CONCERN: Energy Secretary Chris Wright said that bringing down electricity prices is a top priority for him, insisting that “crazy” renewable projects will continue to increase bills at home.\n\n“It’s what I worry about most, seven days a week,” Wright said during an appearance on Fox Business this morning. “We want to stop the rise in electricity for Americans and reshore jobs and opportunity here.”\n\nWright accused the Biden administration of facilitating the steady increase in electricity prices seen over the last four years, claiming it was due to a prioritization of wind and solar projects. The Trump administration has sought to stymie the development of renewables in recent weeks by pulling government funding and federal subsidies as well as by adding bureaucratic hurdles for obtaining federal approval for new projects.\n\nDespite the recent crackdown, Wright said, the administration won’t be able to prevent all wind and solar projects from being plugged into the grid.\n\n“All sorts of crazy projects were under construction and being built on your electricity grids over the last four years. We can’t stop all of them,” he said. “They’re going to get finished. That extra expenditure goes into the rate base for the utility, and it pushes up your prices. But we’re doing everything we can to build common sense things on those electricity grids and to build electricity in front of the AI demand.”\n\nMost recently: The administration tightened its grip on the renewable energy industry on Friday, as the Department of Transportation moved to withdraw and terminate roughly $679 million worth of funding for offshore wind projects. Most of the funding was not set to go towards building offshore wind farms, but instead to projects that were set to serve as manufacturing hubs and ports for future farms. The money is expected to be reallocated to boost the maritime industry.\n\nTRUMP ADMINISTRATION SEEKS TO ROLL BACK SAGE GROUSE PROTECTIONS: The Bureau of Land Management is moving to re-examine the management of habitat of the Greater Sage-grouse, the latest effort from the Trump administration to walk back Biden-era environmental protections.\n\nThe details: BLM announced today that it is seeking out public comments on managing the bird’s habitat, which stretches across California, Idaho, Montana, Nevada, North Dakota, South Dakota, Utah, and Wyoming. Last November, the Biden administration increased protections for the brown speckled grouse, by issuing a rule to safeguard the habitat from drilling and mining activities. The rule also blocked renewable energy projects in the region.\n\nThe Trump administration is considering changing this Biden-era rule to expand the amount of land available for energy and mining projects.\n\nBLM is accepting comments on its proposal until Oct. 3.\n\nLARGEST US UTILITY ANNOUNCES ANOTHER NUCLEAR COLLABORATION: The Tennessee Valley Authority is further expanding its nuclear energy portfolio and has plans to obtain another 6 gigawatts worth of nuclear power to help meet growing energy demand.\n\nThe details: Early this morning, TVA, the largest public utility provider in the U.S., announced an agreement with ENTRA1 Energy, a strategic partner of advanced nuclear developer NuScale. Under the agreement, TVA plans to collaborate with ENTRA1 Energy to build up to 6 gigawatts worth of nuclear power generation on several sites throughout the utility’s region. ENTRA1 Energy plans to deploy small modular reactors developed by NuScale inside its energy plants.\n\nThe agreement is expected to provide enough energy to power the equivalent of 4.5 million homes, or 60 new data centers. All of the power is expected to be sold to TVA under future power purchase agreements. It was not immediately clear when ENTRA1 Energy expects to have its plants operational.\n\nSome background: The collaboration is the latest avenue TVA is pursuing to bring as much new nuclear energy online as quickly as possible. The utility is working with Google and Kairos Power to connect 50 megawatts of SMR capacity to the grid by 2030. TVA is also planning to build its own SMR at its Clinch River Nuclear Site in eastern Tennessee.\n\nOVER 80 SCIENTISTS SAY DOE CLIMATE REPORT IS ‘MISLEADING’: Eighty-five climate scientists said that the Department of Energy’s report that downplays climate change risks is misleading.\n\n“Our review reveals that the DOE report’s key assertions—including claims of no trends in extreme weather and the supposed broad benefits of carbon dioxide—are either misleading or fundamentally incorrect,” the scientists said.\n\nThe scientists said that the authors of the report reached “flawed conclusions” by “cherry picking” evidence and research.\n\nThe DOE report, titled “A Critical Review of Impacts of Greenhouse Gas Emissions on the U.S. Climate,” was released in tandem with the EPA’s proposal to roll back the 2009 Endangerment Finding, which concludes that greenhouse gas emissions threaten public health.\n\nThe DOE’s report has received criticism from a number of climate researchers who said their work that was cited in the report was misrepresented.\n\n“No one should doubt that human-caused climate change is real, is already producing potentially dangerous impacts, and that humanity is on track for a geologically enormous amount of warming. No one knows what socioeconomic impacts of this warming will be,” the scientists said. “It should also be clear that the DOE report’s approach to undermining scientific evidence mirrors tactics previously employed by the tobacco industry to create artificial doubt.”\n\nEnergy Secretary Chris Wright spoke with Callie last month, where he admitted there were some mistakes made in the report. Read more about the interview here.\n\nMAJOR OIL AND GAS TRADE GROUP GETS NEW PRESIDENT: The Independent Petroleum Association of America has announced the appointment of a new president to head up the industry group, which represents more than 5,000 of independent crude and natural gas producers and developers nationwide.\n\nIPAA has appointed Edith Naegele to serve as the new president and CEO effective Sept. 22. Naegele currently serves as vice president of membership and strategic development as well as corporate secretary of the American Gas Association, where she has worked since 2021. Prior to AGA, Naegele worked for the U.S. Chamber of Commerce.\n\nWhile leading IPAA, Naegele plans to prioritize engaging more with association members to “better understand the issues facing the upstream oil and gas industry,” the group said today.\n\n“I am excited to join the team at the IPAA and get out to meet our members, invigorate our events, and continue to elevate the message of the importance of the U.S. oil and natural gas industry to our federal legislators and regulators,” Naegele said in a statement.\n\nENERGY ABROAD…THE LATEST: It has already been a busy week for the energy sector abroad, with big news coming out of Russia, China, Europe, and South America.\n\nRussia and China: Officials from Moscow and Beijing have signed a legally binding agreement to build the Power of Siberia 2 gas pipeline, an apparent move from Russia to secure increased exports of its energy products after Europe suspends all imports of Russian gas and oil.\n\nAlexei Miller, CEO of Russian state-owned energy company Gazprom, confirmed to Russian press today that the two countries would be moving forward on the second pipeline, which would stretch through Mongolia, according to CNBC. The pipeline is expected to supply as much as 50 billion cubic meters of gas annually for at least 30 years. The price of the gas transported through the pipeline has yet to be agreed upon.\n\nBrazil: Brazil is seeking to affirm its position as a major player within the global energy markets, by requesting to join the International Energy Agency. The IEA confirmed today that it received a letter from Brazil’s Minister of Foreign Affairs Mauro Vieira and Minister of Mines and Energy Alexandre Silveira to join the intergovernmental organization.\n\nBrazil officials pointed out that the South American country has continued to hold a position as a “net oil exporter” while also leading in the integration of clean and renewable alternatives. Currently, Brazil is only an association country. Only 32 countries have full membership status, including the United States, Germany, Japan, France, Canada, and Australia. Its request comes as Brazil prepares to host the United Nations Climate Change Conference later this fall.\n\nGermany: As the Trump administration increases pressure on its allies to slow the deployment of renewables and favor traditional fossil fuels, Germany has stayed on course to reduce reliance on coal power and is even ahead of schedule.\n\nThe Federal Network Agency, which regulates electricity and energy markets in Germany, announced yesterday that the country has already met its 2028 goal for reducing coal-fired energy generation. The country has been aiming to reduce coal energy by 8.7 gigawatts by 2028. As of Sept. 1, Germany has exceeded this goal by around 10%. The country still plans to completely phase out coal by 2038.\n\nICYMI – EPA FIRES STAFF FOR PUBLICLY CRITICIZING THE AGENCY: The Environmental Protection Agency on Friday fired at least eight employees who signed a letter criticizing the agency’s actions.\n\nIn June, more than 170 EPA employees signed a dissent letter criticizing the agency’s actions, stating they were steering away from its mission to protect the environment and public health.\n\nThe majority of those employees were placed on administrative leave and the EPA accused the employees of “ unlawfully undermining, sabotaging, and undercutting the administration’s agenda…”\n\nIt is unclear how many employees have been fired, but the Washington Post reported that at least six probationary employees and two career employees were fired.\n\nSept. 3 Senate Committee on Environment and Public Works is holding a meeting to consider the nominations of Jeffrey Hall to serve as Environmental Protection Agency Assistant Administrator and Katherine Scarlett to serve as a member of the Council on Environmental Quality.\n\nSept. 3 The House Natural Resources subcommittee on Energy and Mineral Resources is holding a legislative hearing to discuss a number of bills that aim to unleash domestic mining capabilities.\n\nSept. 3 – 4 The Hydrogen Americas Summit and Exhibition is being held in Maryland at the Gaylord National Resort and Convention Center.\n\nSept. 4 The Senate Energy and Natural Resources Committee is holding a hearing to consider the nominations of Laura Swett and David LaCerte to serve as members of the Federal Energy Regulatory Commission.\n\nSept. 4 Latitude Media and Advanced Energy United are holding a webinar looking at how companies and states can continue to develop clean energy in the wake of the One Big Beautiful Bill Act.\n\nSept. 4 The Center for Strategic and International Studies is holding a fireside chat with Jarrod Agen, executive director of the White House’s National Energy Dominance Council.\n\nSept. 5 The House Natural Resources Committee is holding a field hearing in Moose, Wyoming, titled “The Great American Outdoors Act: Modernizing and Maintaining National Parks to Celebrate America’s 250th Birthday.”\n\nGrist How drones and AI are changing the way we fight wildfires\n\nNew York Times Cue the Sun: This Lab Recreates Hot, Sweaty Days to Test Humans",
  "medium": "Article",
  "links": [
    "https://www.cnbc.com/2025/09/02/power-of-siberia-2-russia-signs-new-gas-pipeline-deal-with-china.html",
    "https://www.foxbusiness.com/video/6378154506112",
    "https://www.washingtonexaminer.com/policy/energy-and-environment/3789657/appeals-court-permits-trump-epa-terminate-gold-bars-climate-funding/",
    "https://www.washingtonexaminer.com/policy/energy-and-environment/3462652/epa-letter-trump-dissent-staffers-signed-placed-on-leave/",
    "http://click1.trk-washingtonexaminer.com/bggldnsgffzybzdfyjsgjysmkgynjctckvgkzsjlplcqbb_bzqlgjbqbddypcgpfplcqz.html?a=Daily+on+Energy+both+authors&b=06%2F30%2F2025&c=WEX_Daily+on+Energy&d=25486800&e=74099866aa2c0d01e9f38050cb25f7dae70ca665c8be98d6137212ccf7a6e60b",
    "https://sites.google.com/tamu.edu/doeresponse/home",
    "http://click1.trk-washingtonexaminer.com/rnrrjshgnnlpwljnpkhgkphbfgpsktqtfygflhkrcrtvlj_bzqlgjbqbddypcgpfplcqz.html?a=Daily+on+Energy+both+authors&b=06%2F30%2F2025&c=WEX_Daily+on+Energy&d=25486800&e=74099866aa2c0d01e9f38050cb25f7dae70ca665c8be98d6137212ccf7a6e60b",
    "https://www.politico.com/news/2025/09/01/trumps-anti-renewable-energy-spree-threatens-a-vulnerable-republican-in-wind-rich-iowa-00530060",
    "https://www.nytimes.com/2025/09/02/climate/research-extreme-heat-lab.html",
    "https://www.washingtonexaminer.com/policy/3757997/google-tennessee-valley-authority-smr-2030/",
    "https://www.washingtonexaminer.com/policy/energy-and-environment/3790089/trump-bureau-of-land-management-limit-greater-sage-grouse-protections-ease-fossil-fuel-development/",
    "https://www.prnewswire.com/news-releases/tva-and-entra1-energy-announce-collaborative-agreement-in-landmark-6-gigawatt-nuscale-smr-deployment-program--largest-in-us-history-302543877.html",
    "https://www.washingtonexaminer.com/news/3777474/energy-market-realities-poses-hurdle-trump-coal-revival/",
    "https://www.energy.gov/sites/default/files/2025-07/DOE_Critical_Review_of_Impacts_of_GHG_Emissions_on_the_US_Climate_July_2025.pdf",
    "https://www.bundesnetzagentur.de/DE/Fachthemen/ElektrizitaetundGas/Kohleausstieg/Hintergrund_Volumenberechnung.pdf?__blob=publicationFile&v=2",
    "https://www.washingtonexaminer.com/policy/3787531/duffy-cancels-679m-offshore-wind-redirects-funds-maritime/",
    "https://www.iea.org/news/brazil-makes-formal-request-to-become-iea-member-country",
    "https://www.washingtonexaminer.com/policy/energy-and-environment/3778723/chris-wright-climate-change-report-energy-department-small-mistakes/",
    "https://grist.org/wildfires/how-drones-and-ai-are-changing-the-way-we-fight-wildfires/",
    "https://www.washingtonpost.com/climate-environment/2025/08/29/epa-dissent-letter-employees-fired/",
    "https://www.ipaa.org/ipaa-board-announces-edith-naegele-as-new-president-and-ceo/",
    "http://click1.trk-washingtonexaminer.com/rgkrjshgnnlpwljnpkhgkphbfgpsktqtfygflhkrcrtvwl_bzqlgjbqbddypcgpfplcqz.html?a=Daily+on+Energy+both+authors&b=06%2F30%2F2025&c=WEX_Daily+on+Energy&d=25486800&e=74099866aa2c0d01e9f38050cb25f7dae70ca665c8be98d6137212ccf7a6e60b"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "coal energy",
      "weight": 0.06543483
    },
    {
      "name": "renewable energy projects",
      "weight": 0.060725532
    },
    {
      "name": "clean energy",
      "weight": 0.05691005
    },
    {
      "name": "energy costs",
      "weight": 0.05441687
    },
    {
      "name": "enough energy",
      "weight": 0.05432661
    },
    {
      "name": "growing energy demand",
      "weight": 0.051275514
    },
    {
      "name": "Advanced Energy United",
      "weight": 0.049572546
    },
    {
      "name": "ENTRA1 Energy",
      "weight": 0.049242467
    },
    {
      "name": "Energy Secretary Chris Wright",
      "weight": 0.048696287
    },
    {
      "name": "met coal",
      "weight": 0.04772005
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.970703125
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.76171875
    },
    {
      "name": "/News/Other",
      "score": 0.62841796875
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Other",
      "score": 0.5712890625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.53564453125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.4384765625
    },
    {
      "name": "/News/Local News",
      "score": 0.387939453125
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.378173828125
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.30078125
    }
  ],
  "sentiment": {
    "positive": 0.06526496,
    "negative": 0.7116709,
    "neutral": 0.22306415
  },
  "summary": "An appeals court has sided with the Environmental Protection Agency (EPA) in its efforts to claw back billions in grants from the Greenhouse Gas Reduction Fund, a fund established under the Inflation Reduction Act. The EPA has been trying to terminate the fund for years, arguing that the fund was mismanaged and lacked oversight, and that funds were improperly distributed. The appeals court ruling overturns District Judge Tanya Chutkan’s decision in April allowing climate groups access to grant money held in Citibank. The Department of the Interior has also advanced three coal lease sales in Alabama, Montana, and Utah for the fall as part of the Trump administration's efforts to revive the coal industry. Energy Secretary Chris Wright stated that the opening up public land leasing is a priority for the Department of Energy.",
  "shortSummary": "A US appeals court ruled in favor of the EPA in its attempt to claw back billions in Greenhouse Gas Reduction Fund grants, while the Department of Interior advances coal leasing.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2a240f26161745c1937371ec6f1daa0f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3789657/appeals-court-permits-trump-epa-terminate-gold-bars-climate-funding/",
      "text": "An appeals court has overturned a federal judge’s ruling blocking the Environmental Protection Agency from terminating $20 billion in grants for several climate groups.\nA three-judge U.S. Court of Appeals panel on Tuesday issued a 2-1 ruling in favor of the Trump EPA’s efforts to slash billions of dollars in grant money to green groups obligated during former President Joe Biden‘s administration. The District of Columbia Circuit Court judges were Gregory Katsas, Neomi Rao, and Cornelia Pillard, who dissented.\nThe district court “abused its discretion” by issuing the injunction preventing the EPA from rescinding the funds, the judges wrote. They said the plaintiffs were not likely to succeed in their case because it belonged in the Court of Federal Claims, rather than the district court.\n“Moreover, the equities strongly favor the government, which on behalf of the public must ensure the proper oversight and management of this multibillion-dollar fund,” they wrote.\nIn April, the D.C. Circuit Court placed a hold on U.S. District Judge Tanya Chutkan’s ruling that allowed climate groups access to grant money held in Citibank. The appellate court’s decision is the latest twist in the legal battle between the EPA and three climate groups: Climate United, Coalition for Green Capital, and Power Forward Communities.\nFor months, the EPA has sought to terminate the grantees’ grant money from the Greenhouse Gas Reduction Fund, which was established as part of the Biden administration’s 2022 Inflation Reduction Act. The attempt to cut the funding is part of the agency’s efforts to deregulate and cut funding to programs that no longer align with the Trump administration, which is focused on boosting fossil fuel production.\nClimate United CEO Beth Bafford said in a statement: “While we are disappointed by the panel’s decision, we stand firm on the merits of our case: EPA unlawfully froze and terminated funds that were legally obligated and disbursed.”\n“This is another hurdle in our fight to lower energy costs for those who need it most while creating jobs for hardworking Americans, but we will continue to press on for communities across the country that stand to benefit from clean, abundant, and affordable energy. This is not the end of our road,” she added.\nAPPEALS COURT HALTS ORDER TO EPA TO DISBURSE ‘GOLD BAR’ GREEN FUNDS\nEPA Administrator Lee Zeldin has claimed the grant money was improperly distributed by being routed through Citibank. The EPA froze the funds for eight weeks and attempted to cancel $20 billion in grants from eight nonprofit organizations in the program.\nThe fund was given $27 billion to help climate projects across the United States, specifically in low-income communities. The three nonprofit groups suing the EPA were granted $14 billion under the program’s National Clean Investment Fund.\nZeldin has called the funds “gold bars,” referring to a video last year in which a former EPA employee said the Biden administration was trying to disburse promised funds quickly before the next administration.\n“It truly feels like we’re on the Titanic, and we’re throwing, like, gold bars off the edge,” the former employee says in the video."
    },
    {
      "url": "https://www.prnewswire.com/news-releases/tva-and-entra1-energy-announce-collaborative-agreement-in-landmark-6-gigawatt-nuscale-smr-deployment-program--largest-in-us-history-302543877.html",
      "text": "KNOXVILLE, Tenn., Sept. 2, 2025 /PRNewswire/ -- The Tennessee Valley Authority (TVA) and ENTRA1 Energy (ENTRA1) have announced the signing of an agreement to advance the nation's energy security and maintain America's leadership in nuclear technologies. Under this agreement, ENTRA1 Energy will collaborate with TVA to develop plants to provide TVA with up to 6 gigawatts of new nuclear power generation on sites in TVA's seven-state region through the deployment of six ENTRA1 Energy Plants.\nThis collaboration could provide enough energy to power the equivalent of approximately 4.5 million homes or 60 new data centers—at a time when hyperscale data centers, artificial intelligence (AI), semiconductor manufacturing, and other energy-intensive technologies are driving unprecedented growth in electricity demand. ENTRA1 aims to develop and own a portfolio of power infrastructure assets and sell the output to TVA under future power purchase agreements.\nENTRA1 Energy is an American company dedicated to producing power by commercializing and deploying American nuclear and natural gas technologies in its power infrastructure assets.\nENTRA1 Energy is pioneering the commercialization of small modular reactors (SMRs) as a bridge between technologies and end usage of power. As NuScale's strategic partner, ENTRA1 Energy drives the deployment, financing, investment, development, execution, and management of ENTRA1 Energy Plants™ with NuScales SMRs inside. The TVA and ENTRA1 Energy partnership is an important first step to advance deployment of advanced nuclear technology in America with ENTRA1's immediate strategy to utilize NuScale' s SMR equipment inside ENTRA1 Energy Plants™.\n\"TVA is leading the nation in pursuing new nuclear technologies, and no utility in the U.S. is working harder or faster than TVA. This agreement with ENTRA1 Energy highlights the vital role public-private partnerships play in advancing next-generation nuclear technologies that are essential to providing energy security - reliable, abundant American energy - and creating jobs and investment across the nation,\" said Don Moul, TVA President and CEO.\n\"The ENTRA1 team brings deep experience in investing in, developing, and executing power infrastructure. Our focus is on deploying best-in-class American technologies in the nuclear SMR and natural gas-fired power sectors – and that is what we are doing in the immediate term via our partnership with NuScale SMRs. We're investing in the next generation of power solutions to meet the country's growing energy demands,\" said Skip Alvarado, ENTRA1 Energy Chief Projects Officer.\nTVA and ENTRA1 Energy are planning to add megawatts to the TVA service area, which aligns with the Administration's Energy Dominance agenda and focus on America's energy security. The partners are identifying opportunities to work with other federal agencies and explore potential sites with new nuclear generation and joint gas-fired capabilities.\nTVA is strategically partnering with innovative companies, like ENTRA1, to advance the development of new nuclear technologies to provide affordable and abundant energy. This is the energy needed to power America's economic prosperity and fuel artificial intelligence, quantum computing and advanced manufacturing.\nAbout TVA\nThe Tennessee Valley Authority is the nation's largest public power supplier, delivering energy to more than 10 million people across seven southeastern states. TVA has one of the most diverse energy systems – including nuclear, hydro, coal, gas, solar and advanced technologies. TVA is making significant investments in its power system toward new generation and transmission.\nTVA stands at the forefront of America's advancements in nuclear energy – and its bold partnerships and national leadership continue to power the nation's nuclear renaissance. Amid growth in energy-intensive sectors such as artificial intelligence and data centers, TVA is exploring a diverse range of advanced nuclear technologies to shape the most effective, scalable, secure solutions for the region's growing economy.\nTVA is a corporate agency of the United States, receiving no taxpayer funding, deriving virtually all of its revenues from sales of electricity. TVA maintains some of the lowest energy costs and highest reliability in the nation. TVA's residential rates are lower than those paid by about 80% of customers of the top 100 U.S. utilities, and its industrial rates are lower than those paid by over 90% of customers of the top 100 U.S. utilities. In addition, TVA provides flood control, navigation, and land management for the Tennessee River system, and assists local power companies and state and local governments with economic development and job creation.\nAbout ENTRA1\nENTRA1 Energy is an American independent global energy production platform dedicated to increasing energy security by providing baseload, safe, and reliable energy. ENTRA1 Energy is led by an executive team of energy, infrastructure and finance sector veterans drawing on significant experience in the investment, development and execution of critical infrastructure projects globally.\nENTRA1 Energy is NuScale's strategic partner and the two companies have an existing 50/50 joint venture company – ENTRA1 NuScale LLC. ENTRA1 Energy holds the global exclusive rights to the commercialization, distribution, and deployment of NuScale's products and services. ENTRA1 Energy is the one-stop-shop and single hub for the deployment, financing, investment, development, execution, and/or management of ENTRA1 Energy Plants™ with NuScale SMRs-inside. NuScale SMRs are the first and only small modular reactor technology to receive Part 52 approval by the U.S. Nuclear Regulatory Commission.\nMedia Contact: |\nScott Fiedler, 901-414-6964, [email protected] |\nTVA Public Relations, Knoxville, 865-632-6000 |\n|\nSOURCE Tennessee Valley Authority\nWANT YOUR COMPANY'S NEWS FEATURED ON PRNEWSWIRE.COM?\nNewsrooms &\nInfluencers\nDigital Media\nOutlets\nJournalists\nOpted In\nShare this article"
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3778723/chris-wright-climate-change-report-energy-department-small-mistakes/",
      "text": "EXCLUSIVE — Energy Secretary Chris Wright admitted there were some mistakes made in a report released by the Energy Department last month that downplays the risks of climate change, even as he defended the report in response to harsh criticism from many environmentalists and climate scientists.\nDuring an interview with the Washington Examiner on Friday, Wright said he encouraged debate around the agency’s research, noting that the administration wants to foster discussions both disagreeing with and agreeing with the report’s findings.\nAmong the most serious criticisms of the report, titled “A Critical Review of Impacts of Greenhouse Gas Emissions on the U.S. Climate,” is the accusation from a number of climate researchers whose work it cited that it misrepresented their research or included erroneous data.\nWright told the Washington Examiner that the agency has found some “small mistakes” in the report since it was released a month ago in tandem with the Environmental Protection Agency’s proposal to roll back the 2009 Endangerment Finding, which laid the foundation for decades of climate change-related laws and regulations.\n“Look, the authors worked quickly to assemble a great amount of stuff,” Wright said. “Mistakes can be made, of course. And I have seen a few small mistakes identified. Of course, those will be fixed.”\nWright did not specify what mistakes he saw.\nFive independent scientists, selected by Wright in early spring, wrote the report. Several of these authors, including John Christy, Judith Curry, and Ross McKitrick, are widely considered to be skeptics of mainstream climate science or contrarians.\nOverall, the report’s key findings downplay the effects of climate change on extreme weather and the efficacy of mitigation-related policies and actions.\nThe authors write that claims of increased frequency or intensity of hurricanes, tornadoes, floods, and droughts are not supported by U.S. historical data, that carbon dioxide-induced warming is less damaging economically than commonly thought, that aggressive mitigation policies cause more harm than good, and that U.S. policy actions will have undetectably small direct imparts on the global climate.\nThe report is currently subject to a public comment period, which is scheduled to end on Sept. 2.\nWhen asked if public input could sway the administration from fully revoking the Endangerment Finding, Wright told the Washington Examiner, “That’s the idea of public comment period.”\n“We’ll hear input and ideas from everyone,” he continued. “But I think that the data in the story on climate change … is pretty clear and pretty compelling. It’s a real physical phenomenon. It’s just not even remotely close to the world’s greatest problem, and it’s nowhere near the United States’s greatest problem.”\nHERE’S WHAT’S AT STAKE IF THE EPA WITHDRAWS THE ENDANGERMENT FINDING\nAs both the decision to revoke the 2009 Endangerment Finding and the DOE report supporting the move have come under fire, Wright is welcoming the criticism and debate.\n“That’s what we want,” the secretary said. “That’s what science is. This Orwellian cancel culture way climate change was treated before — it’s just wrong. We can’t scare kids and tell them, ‘You can’t say anything, but the world is about to end.’ Let’s have a discussion about the data and the debate where it may lead, and what it might say about trade-offs with energy.”"
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3462652/epa-letter-trump-dissent-staffers-signed-placed-on-leave/",
      "text": "Environmental Protection Agency staffers who signed a letter criticizing Trump administration policies were placed on leave Thursday.\nThe EPA said it placed 144 staffers on administrative leave as it investigates the letter.\n“The Environmental Protection Agency has a zero-tolerance policy for career bureaucrats unlawfully undermining, sabotaging, and undercutting the administration’s agenda as voted for by the great people of this country last November,” EPA spokeswoman Brigit Hirsch said in a statement.\nCurrent and former EPA staffers wrote in a letter Monday that the “administration’s policies ‘undermine the EPA mission of protecting human health and the environment'” with concern that the EPA is pandering to those who cause pollution, promoting a culture of fear, reversing the agency’s progress in vulnerable communities, undermining public trust, and dismantling its Office of Research and Development.\n“Your decisions and actions will reverberate for generations to come. EPA under your leadership will not protect communities from hazardous chemicals and unsafe drinking water, but instead will increase risks to public health and safety,” the staffers wrote to Administrator Lee Zeldin.\nThe EPA said Monday that it would “continue to work with states, tribes, and communities to advance the agency’s core mission of protecting human health and the environment.”\n“Policy decisions are a result of a process where Administrator Zeldin is briefed on the latest research and science by EPA’s career professionals, and the vast majority who are consummate professionals who take pride in the work this agency does day in and day out,” a spokesperson added.\nIt also criticized former President Joe Biden’s policies that allegedly attempted “to shut down American energy and make our citizens more reliant on foreign fossil fuels.”\nZeldin told the media in January that anyone who doesn’t want to be at the agency should not be there.\n“I don’t believe that anyone should be here at EPA who is not committed to the agency mission and the lawful directives coming from the duly elected president of the United States,” he said.\nUnion leader Nicole Cantello, president of the American Federation of Government Employees Local 704, representing EPA employees in the Midwest, told The Hill that putting staffers on leave was ”blatant retaliation by the Trump administration.”\n“We don’t swear an oath to the Trump administration, we swear an oath to the Constitution, and so we don’t feel like we violated that oath or that we did anything wrong by signing this letter,” she said. She added that some staffers placed on leave are “crucial players in trying to implement Trump’s policies at EPA.”"
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/3787531/duffy-cancels-679m-offshore-wind-redirects-funds-maritime/",
      "text": "The Department of Transportation has moved to withdraw and terminate approximately $679 million worth of funding for what the agency described as “doomed” offshore wind projects, in the Trump administration’s latest move to crack down on the green energy resource.\nTransportation Secretary Sean Duffy announced Friday that the funding will be redirected from infrastructure projects that would have supported offshore wind development and instead will be used to boost the maritime industry.\n“Wasteful, wind projects are using resources that could otherwise go towards revitalizing America’s maritime industry,” Duffy said in a statement.\nFormer President Joe Biden and Biden Transportation Secretary Pete Buttigieg “bent over backwards to use transportation dollars for their Green New Scam agenda while ignoring the dire needs of our shipbuilding industry,” he continued. “Thanks to President Trump, we are prioritizing real infrastructure improvements over fantasy wind projects that cost much and offer little.”\nThe redirected funds are now poised to be used to support expanding the Maritime Administration’s shipbuilding capacity, to unleash traditional forms of energy, and to utilize natural resources to support the energy industry.\nThe Transportation Department is specifically targeting 12 offshore wind-related grants that no longer align with the goals of the administration. Many of these projects affected by the decision were set to serve as manufacturing hubs and ports for future offshore wind farms.\nHumboldt Bay Offshore Wind, a planned marine terminal off the coast of California, will see the biggest loss, of around $427 million in federal funding. The terminal is intended to support the build-out of offshore wind in California, including through deploying 5 gigawatts of offshore wind by 2030.\nThe Sparrows Point Steel Marshalling Port Project in Baltimore, Maryland, is set to lose over $47 million in federal support. This site of this project was once the home of the largest steel production facility in the world. Offshore wind developer US Wind intends to use the port to produce foundations and other steel components needed for installing wind turbines off the coast of Maryland.\nIt is no secret that President Donald Trump detests wind energy projects, particularly those offshore. The industry has remained in the crosshairs of the administration all summer, as the president and his Cabinet have moved to make it more difficult for wind projects to be built over the next four years.\nTrump himself has promised not to let any new projects be built while he is president.\nMuch of the crackdown has been led by the Department of the Interior, but Duffy also launched a department-wide review regarding wind project safety concerns at the end of July.\nDUFFY SAYS BUTTIGIEG IGNORED SAFETY CONCERNS TO BUILD WIND TURBINES NEAR ROADS\nThe Transportation Secretary claimed at the time that Buttigieg ignored safety recommendations for dozens of wind projects near highways and railroads.\n“Joe Biden and Pete Buttigieg put climate religion ahead of safety — blatantly ignoring engineers who warned of the danger of constructing wind turbines near railroads and highways,” Duffy said."
    },
    {
      "url": "https://sites.google.com/tamu.edu/doeresponse/home",
      "text": "On July 29, 2025, the Department of Energy (DOE) published a report from its Climate Working Group (CWG). This report features prominently in the EPA's reconsideration of its 2009 Endangerment Finding. In response, over 85 scientists have come together to write a comprehensive review, which is being submitted to the DOE, EPA, and National Academy review.\nOur review reveals that the DOE report's key assertions—including claims of no trends in extreme weather and the supposed broad benefits of carbon dioxide—are either misleading or fundamentally incorrect. The authors reached these flawed conclusions through selective filtering of evidence ('cherry picking'), overemphasis of uncertainties, misquoting peer-reviewed research, and a general dismissal of the vast majority of decades of peer-reviewed research.\nNo one should doubt that human-caused climate change is real, is already producing potentially dangerous impacts, and that humanity is on track for a geologically enormous amount of warming. No one knows what socioeconomic impacts of this warming will be. It should also be clear that the DOE report's approach to undermining scientific evidence mirrors tactics previously employed by the tobacco industry to create artificial doubt.\nThough our review doesn't explicitly address the EPA's 2009 Endangerment Finding, the process of compiling our response made one thing clear: in the 16 years since that finding, evidence of human-caused climate change and its threats to public health and welfare has only strengthened.\nInstead of relying on this report, the DOE should instead use the thoroughly vetted assessments from the Intergovernmental Panel on Climate Change and National Climate Assessment, which offer more accurate representations of our scientific understanding of climate change.\nMedia contact: doereportresponse@proton.me\nComment submitted to the DOE"
    },
    {
      "url": "https://www.washingtonexaminer.com/news/3777474/energy-market-realities-poses-hurdle-trump-coal-revival/",
      "text": "The realities of the energy market may jeopardize President Donald Trump’s push to renew what he calls “beautiful clean coal,” an industry that has declined for decades as it faces competition with other energy sources.\nThe Trump administration has made large-scale efforts to boost the coal industry through executive orders, congressional action, and deregulatory measures.\nThe administration considers coal essential for meeting today’s surging energy demand. But despite all of these efforts, the industry has spiraled downward for decades, and some analysts say that the Trump team’s efforts will not be sufficient to reverse that trend.\nMarket realities facing coal\nThe U.S. Energy Information Administration said in April that U.S. coal production has declined over the past two decades. The United States in 2023 produced 578 million short tons of coal, less than half of the amount produced in 2008, when U.S. coal production peaked.\nThe decline is partly attributable to the imposition of environmental regulations. Most prominently, the Environmental Protection Agency under former Presidents Barack Obama and Joe Biden sought to impose rules to limit carbon and toxic emissions from coal-fired power plants. Republican opponents accused the Democrats of waging a “war on coal” and said that the restrictions would mean the shuttering of plants around the country.\nThe rules have been subject to a regulatory and legal tug-of-war. Obama’s rule on power plant emissions was stayed by the Supreme Court. The first Trump administration proposed a rule with dramatically lighter restrictions, but the D.C. Circuit Court found it illegal just before Biden entered office.\nThe Supreme Court limited the EPA’s authority to regulate carbon emissions in West Virginia v. EPA during the Biden administration, which later finalized a new rule to comply with the high court’s ruling that would have required coal plants to use carbon capture technologies to reduce their emissions by 90% by 2032.\nMichelle Bloodworth, president and CEO of America’s Power, said, “The EPA regulations certainly under the Biden administration — they were really designed to shut down every coal plant in the United States.”\nNow, the Trump EPA is taking action to repeal the rule.\nStill, the regulatory actions against coal are only part of the story of its decline.\nScott Segal, cochairman of the Policy Resolution Group at Bracewell, told the Washington Examiner that economic factors have primarily driven the trend away from coal, noting that many of the toughest climate regulations were not fully implemented.\nDuring the early 2000s, the development of fracking, a technology for cracking shale rock layers thousands of feet underground to obtain natural gas and oil, led to a boom in low-cost oil and natural gas. The Shale Revolution quickly made natural gas more competitive than coal.\n“It’s not environmental law, but it’s more economic law,” Segal said. “The supply of natural gas went up. The cost of producing natural gas went down.”\n“A single drilling pad could produce dozens of different wells … As a result, it became less expensive and more environmentally protective to produce natural gas. And those were market forces. Those were not forced by environmental regulation,” he added.\nIn July, EIA reported a price of $25.45 per megawatt-hour for natural gas at the Henry Hub in May 2025, while the cost of coal was $36.43 per megawatt-hour during the same period. Coal generated about 16.2% of U.S. electricity in 2023. Natural gas, in comparison, generated 43.1%, making it the single-largest source of power.\nBrandon Dalling, an attorney at King & Spalding, said power producers will not spend capital to upgrade coal-fired plants unless they are guaranteed a long-term return on capital.\n“In order to burn [coal], you need to keep spending a lot of money on your power plants to make sure that they are in tip-top shape to continue to burn coal, and that investment has not been as intensive in recent years,” he said.\nDalling said people have been more rewarded for investing in wind turbines, solar panels, battery storage, and gas-fired power plants.\n“The market forces have resulted in coal plants shutting down, and less investment in coal,” he said.\nEfforts to revamp coal\nIn April, Trump signed four executive orders aimed at revitalizing the coal industry. One of those executive orders, “Reinvigorating America’s Beautiful Clean Coal Industry,” invoked emergency powers to fast-track environmental reviews for coal-related projects. It also opened up public land for coal leasing and directed the Interior Department to designate coal as a “mineral,” allowing it to receive similar federal benefits as other minerals, including eased permitting and federal loans.\nThe other orders directed the Energy Department to identify and keep critical power generation online to address grid reliability troubles, such as coal. One exempted power plants from complying with the EPA mercury and toxics standards for two years. Lastly, the president directed the Justice Department to challenge state laws that targeted the use of coal.\nThe Energy Department has recently used emergency powers to keep the J.H. Campbell coal plant in Michigan and the Eddystone oil and gas plant in Pennsylvania from retiring, citing concerns of being unable to meet energy demands within the region. The Department of the Interior has also taken policy action to make coal more accessible by reducing regulatory barriers and reopening federal lands.\n“The administration does not appear to be attempting to change the fundamental economics of the power system through these executive orders. These executive orders still cast a weather eye on emergency conditions and seek to address those emergency conditions,” Segal said.\nIn Congress, the Republicans’ One Big Beautiful Bill Act classified metallurgical coal, used in steel production, as a critical mineral, making it eligible for an advanced manufacturing production credit. The legislation also speeds up the review of coal lease applications and increases federal land leasing for coal.\nSurging energy demand\nThose in the industry argue that coal is needed to meet growing energy demand, which is increasing due to the rise of technologies such as databases and artificial intelligence.\nEmily Arthun, CEO of the American Coal Council, told the Washington Examiner, “There has been a constant assault on the coal industry for several decades at this point, and I believe that policies have to be put in place to help this industry revive.”\n“We have areas like in California that experience rolling brownouts and blackouts due to lack of resources for energy. And so it’s absolutely critical that we have this very important baseload energy source continuing to thrive in the United States just to meet our energy needs,” she said.\nThe DOE released a report in July that found that the U.S. will see peak hour energy supply demand rise by at least 100 gigawatts by 2030, with half of the demand attributed to data centers.\nAs energy demand grows, prices are also going up. Electricity prices increased by 5.5% for the year ending in July, according to the Bureau of Labor Statistics’ Consumer Price Index.\n“We have been saying for the past three or four years that we are in the middle of an energy emergency,” Bloodworth said.\n“We do feel like coal provides attributes that no other resource can replicate,” she continued. “One of those would be fuel security, 24/7 capacity, and it also can ramp up and down very quickly, especially during periods of extreme weather.”\nIn his first term, Trump attempted to revive the industry, including through proposals to boost payments to coal plants on the grounds that they produce reliable power, but failed to make any lasting changes.\nThis time, though, the White House created the Energy Dominance Council, led by Interior Secretary Doug Burgum, to coordinate among federal agencies on energy-related issues.\nBloodworth said the Trump administration’s creation of the council has made a “huge difference, even since the first Trump administration.”\nMeanwhile, Ethan Tsai, project manager consultant at Rystad Energy, told the Washington Examiner he does not expect tremendous growth in the coal industry, but a decline in the retirement of coal plants.\n“The truth of the matter is that coal’s still going to be around for at least another few decades. But the growth is not there. We’re going to be seeing a downward trend of coal within the grid space itself,” Tsai said.\nCALIFORNIA GOP LAWMAKERS SUE AND STALL TO BLOCK NEW MAP FROM PASSING\nThe EIA told the Washington Examiner that 19.6 gigawatts of coal capacity were scheduled to retire by the end of 2024. As of the end of June, 105 gigawatts are still on track to retire within the same time frame, although nearly 8 gigawatts have had retirement schedule changes.\n“As we’re seeing more and more natural gas power plants ramp up, more renewables ramp up, especially with AI and demand for data centers, and the spike in electricity demand, coal is going to take a smaller share of that entire supply,” Tsai added."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/3757997/google-tennessee-valley-authority-smr-2030/",
      "text": "Google and Kairos Power are set to build a small modular nuclear reactor connected to the Tennessee Valley Authority grid by the end of the decade, a major milestone for the Big Tech giant, which plans to harness nuclear power for artificial intelligence.\nThe two companies revealed their collaboration with the federally owned utility on Monday morning, saying Kairos Power’s Hermes 2 Plant in Oak Ridge, Tennessee, will generate up to 50 megawatts of power.\nThis electricity will pump into the Tennessee Valley Authority grid, which powers Google-owned data centers in Tennessee and Alabama. The deal marks the first time that a major utility in the United States has signed a power purchase agreement with an SMR facility like Hermes.\n“Energy security is national security, and electricity is the strategic commodity that is the building block for AI and our nation’s economic prosperity,” Don Moul, TVA President and CEO, said in a statement.\n“The world is looking for American leadership, and this first-of-a-kind agreement is the start of an innovative way of doing business,” Moul continued. “By developing a technology, a supply chain, and a delivery model that can build an industry to unleash American energy, we can attract and support companies like Google and help America win the AI race.”\nThe financial terms of the deal were not disclosed on Monday.\nThe deployment of the Hermes 2 SMR will be the first under the historic deal made between Google and Kairos Power last fall. At the time, the companies penned the world’s first corporate agreement to purchase nuclear energy through a fleet of SMRs.\nThe deal calls for the first reactor to come online by 2030, with additional reactors supplying upwards of 500 megawatts of power by 2035.\nUnlike traditional reactors, which use water, the Kairos reactors use a molten-salt cooling system to transport heat into a steam turbine that then generates power.\nGoogle and Kairos face an uphill regulatory battle to meet their ambitious timeline, as there are currently no SMRs operational in the U.S. and only three operational in the world. To make matters more difficult, the Nuclear Regulatory Commission has only issued approvals for two SMR designs, both for developer NuScale Power.\nIn November of last year, Kairos received construction permits from the NRC to move forward with the Oak Ridge facility, an indication that the nuclear company was on track to receive other crucial approvals from federal regulators, including an operating license.\nDespite little regulatory groundwork for deploying SMRs in the U.S., their development has been widely supported within both the public and private sectors.\nThe Trump administration has been vocally in favor of bringing SMRs and other advanced nuclear technologies online to supply reliable and clean energy to the grid while bolstering AI advancements.\nUS WILL BUILD THREE SMALL NUCLEAR REACTORS BY NEXT FOURTH OF JULY, WRIGHT SAYS\n“The deployment of advanced nuclear reactors is essential to U.S. AI dominance and energy leadership,” Energy Secretary Chris Wright said in a statement.\n“The Department of Energy has assisted Kairos Power with overcoming technical, operational, and regulatory challenges as a participant in the Advanced Reactor Demonstration Program, and DOE will continue to help accelerate the next American nuclear renaissance,” Wright continued."
    },
    {
      "url": "https://grist.org/wildfires/how-drones-and-ai-are-changing-the-way-we-fight-wildfires/",
      "text": "Earlier this summer, the Banana Lake Fire erupted near Plains, Montana, engulfing over 850 acres in flames within a day. The “total suppression” response from firefighting officials included deploying at least 17 engines, two helicopters, and three bulldozers, as well as highly trained fire crews. But another newer piece of technology was also at play as firefighters worked to contain the blaze: drones.\nBanana Lake was one of several early-season fires in the state this year. As of this writing, there are over 20,000 acres burning across seven key wildfires in Montana, at varying levels of containment. And increasingly hot and dry conditions throughout the American West are making fire an ever more fickle foe.\nAs a new era with the natural disaster commences, both fire practitioners and researchers across the West are bolstering their arsenal with cutting-edge tools. Drones now fly above firefighters, private satellite companies monitor fire and smoke from above, and AI machine-learning models are helping to advance fire research. While these new innovations are not panaceas, ground operations crews and scientists are optimistic about the ways modern technology can help fight fire smarter, not harder.\nSince 2018, drones — sometimes referred to as unmanned aerial systems, or UAS — have been flying under the radar as a new instrument for the United States Forest Service in the fight against wildfire. Thanks in large part to Dirk Giles, who launched and leads the agency’s UAS program, the number of drones deployed each year by the Forest Service has jumped from 734 flights in 2019 to over 17,000 in 2024.\n“The program has really hit a new stride in the past three years,” said Giles. “We are seeing UAS supplementing fire crews across all phases of response.”\n“This UAS program is now being recognized as prolific,” said Ry Phipps, a division supervisor in Region 1 of the Forest Service, which includes Montana. “There was a time we wouldn’t have even thought to try and order a drone for operations. They have become a fantastic tool that is changing the game.”\nAccording to Phipps, drones are increasingly seen as a force multiplier by Forest Service employees. Drones equipped with infrared sensors can help detect lingering hot spots, pinpointing areas at risk for reigniting. Previously, firefighters had to meticulously hand-check burn scars, which could take days at a time and a ton of manpower depending on the size of the area. With supervisors like Phipps reading a thermal map on a screen fed by drone data, firefighters with boots on the ground can be dispatched more safely and efficiently, only going to spots that have high heat signatures.\n“It saves a lot of time and risk for crews,” said Phipps.\nFor helicopter pilots, who help control wildfires by dropping water or fire retardant to suppress flames and creating fire lines for ground crews to control blazes, drones can also assist. Preprogrammed flight trajectories in combination with infrared sensors allow UAS to fly through heavy smoke or at night. This mitigates the need for “low and slow” reconnaissance missions, which require pilots to fly close to the ground in tricky terrain and low visibility. According to Giles, these missions are some of the most dangerous for wildland fire pilots. As their name would suggest, unmanned aerial systems offer a way to do surveillance without putting pilots in danger — which means that UAS can unlock new abilities for fire crews in extreme conditions.\n“Basically, you can fly drones so that nobody gets hurt,” said Phipps. “You can replace a drone. You can’t replace a person.”\nAlthough Giles, Phipps, and others believe that drones show great promise — especially in shifting risk from firefighters to a machine the size of a small cooler — they’re far from being a silver bullet. The machines have limited battery life and can only complete flights of about 15 minutes on average, meaning that deployments must be carefully planned. And since drones are still being studied in various fire management applications, manpower is still needed to check the “ground truth” of information that UAS provide.\nAnother limitation is simply availability. According to Phipps, there aren’t as many drones as there is demand for them.\nIronically, there’s also an emerging risk from privately owned drones getting in the way of official operations. If hobby drones are in the airspace near a wildfire, it’s also a no-go for land management agencies to fly. During a wildfire in Montana in 2022, aerial crew operations came to a standstill as an unapproved drone buzzed right into an area with a temporary flight restriction. Officials were able to locate the drone’s owner in just about 15 minutes — but that’s precious time when a fire is raging.\nAnd just two weeks ago during a wildfire near Provo, Utah, fire operations were shut down by multiple drone incursions, impeding fire management on a high-profile fire near a densely populated community. While UAS are becoming more critical in fire operations, officials must also work on educating civilians to ensure unauthorized drones don’t prevent them from flying their own.\nAnother area of fire management that drones have shown shown some promise in is lighting and managing controlled burns — intentional blazes set to clear dry brush and other fuels.\nFire management’s history of suppression disrupted the natural fire cycles that Indigenous communities once stewarded — cycles that many ecologists now champion. As colonization spread across the West and settlers sought to control land and resources, racist assimilation programs criminalized all manner of Indigenous customs. Prescribed burning was one of them.\nBut as the consequences of this more aggressive, reactive approach to fire management have become apparent, Western science has increasingly caught on to the effectiveness of routine controlled burning. One recent Stanford-led study revealed that prescribed burns can reduce the severity of subsequent wildfires by an average of 16 percent and net smoke pollution by 14 percent. Fire professionals have also recognized their potential, with applications growing year over year.\nEnter another new breed of drones: UAS that can be equipped to carry “dragon eggs,” pingpong ball-sized clusters of a flammable potassium concoction that ignite on impact. This innovation helped the Forest Service burn around 189,000 acres in 2024 to reduce built-up fuels.\nWhile the use of prescribed burns is on the rise, in Montana and elsewhere, concerns remain about public safety risks, both from air pollution and the possibility of blazes getting out of control. Technology is helping to address those kinds of questions, too.\nResearchers in Montana are looking to clear some of the lingering haze of safety concerns around prescribed burns through a National Science Foundation-funded project titled SMART FIRES. (The project’s title is an acronym for Sensors, Machine Learning, and Artificial Intelligence in Real Time Fire Science.) The group, specializing in fields from atmospheric chemistry to public health, will use the grant to conduct five years of study and fieldwork aimed at unpacking the environmental and social dynamics needed to scale prescribed burns as a preventative measure for wildfire. The suite of custom gadgets that the project is utilizing includes some proprietary UAS.\n“Drones are just a tool,” said John Sheppard, who leads SMART FIRES’ AI computer science team. He added that his role in the project is a supportive one — to see how these technological tools can further the various research aims.\nUsing smart sensors and high-resolution cameras fastened on drones and ground sites, the researchers are training AI models to analyze prescribed burns on the fly. The different smart sensors will efficiently process real-time data, and in combination with weather and historical fire information, they will look to model a burn’s movement on the landscape.\nBefore conducting a prescribed burn, practitioners usually carefully examine environmental factors like wind, humidity, and temperature. These AI models will theoretically offer an enhanced version of that, also incorporating factors like ground fuels and topography to provide supervisors with the best possible data to burn accurately and safely.\nSMART FIRES also touts a “science lab on wheels” — a tricked-out Ford Transit van that looks right off a Ghostbusters movie set. The van collects smoke directly from active fires, which environmental chemists then analyze to determine things like the level of PM2.5 — particulate matter smaller than 2.5 microns, a concern for public health — and other pollutants present in the smoke.\nThe social science arm of the project will also engage community members, surveying rural and Indigenous communities in particular about their concerns and priorities related to prescribed burns and ensuring these considerations are put into risk assessments. The consortium ultimately hopes to provide interpretable, map-based forecasts to land managers to help them decide when, where, and how prescribed burns can be used for wildfire prevention.\n“The goal of the project is to refine the AI models so that they can give better recommendations to experts on the ground who know best,” said Sheppard.\nWhile drones and AI are opening up a new era for fire science and management, some of the most tenured experts on the ground have yet to gain access to these types of cutting-edge tools.\nThe Confederated Salish and Kootenai Tribes of Montana, sometimes known by the acronym CSKT, have practiced prescribed burns as a tool for land stewardship since time immemorial. According to Ron Swaney, the fire management officer of the CSKT Division of Fire, the role of fire has long been guided by a deep cultural responsibility. “I think a lot of people underestimate the role of Indigenous burning on the landscape,” he said. “There was purpose and intent for that use of fire.”\nJustin Underwood, the CSKT prescribed fire and fuel specialist, has been in fire management for 19 years and was the first UAS pilot to be certified under the Bureau of Indian Affairs in the Pacific Northwest region. For three years, he has been trying to get a drone for the tribes’ prescribed burn operations. But because he isn’t employed by the Department of the Interior, he has yet to cut through the red tape.\nThe Office of Aviation Services, which lives within the U.S. Department of the Interior, is responsible for all aircraft services and facilities — including the certification card needed for flying a UAS. According to Swaney, the tribe has a helicopter, two single-engine air tankers, and an air attack platform for firefighting. But because drones are a newer implementation in fire management, nonfederal fire divisions may run up against a convoluted process to get clearance to use a UAS.\n“I wouldn’t be so frustrated if my qualifications didn’t mirror other pilots,” said Underwood. “I’ve done every training offered by the Department of the Interior, but I am still unsure what it will take to get officially carded for a UAS.”\nWhile the CSKT coordinates with public land agencies on prescribed burns, the tribal nation sets its own fire management plan — one part of a larger plan focused on climate change adaptation. The tribe’s approach to fire weaves together ancestral knowledge and contemporary science. But being unable to utilize the latest technological tools has hampered these efforts, Swaney said, underscoring just how important the role of technology is in present and future fire management.\n“It’s like living in the dark ages,” said Swaney."
    },
    {
      "url": "https://www.iea.org/news/brazil-makes-formal-request-to-become-iea-member-country",
      "text": "Brazil makes formal request to become IEA Member country\nNews\nLetter from Ministers of Foreign Affairs and of Mines and Energy to IEA Executive Director highlights the strong value the Agency provides to its Members\nThe government of Brazil has made a formal request to become a full Member of the International Energy Agency, citing years of close partnership and the strong value that the IEA provides to its Member countries in navigating a complex global energy landscape.\nAt the IEA’s headquarters in Paris today, Ambassador Sarquis J.B. Sarquis presented IEA Executive Director Fatih Birol with a letter from Brazil’s Minister of Foreign Affairs Mauro Vieira and Minister of Mines and Energy Alexandre Silveira in which they officially requested for Brazil to begin the process of Accession to the IEA.\n“Let us convey to you the appreciation of the Brazilian government for the partnership with the International Energy Agency, which has significantly contributed to advancing energy policies in Brazil over the years,” the Ministers said. “Recognising the challenges that lie ahead in the energy landscape and the strategic support that the IEA provides to its member countries … [we are] pleased to inform you that our government would like to initiate accession procedures to the IEA as a full member.”\nThe letter notes that Brazil’s cooperation with the IEA to date has enabled close work on issues such as energy security, energy data and statistics, and energy policy analysis. The relationship between the IEA and Brazil has steadily deepened, with the IEA carrying out an in-depth review of the country’s energy policies this year. The letter also highlights that Brazil’s position as “a net oil exporter” with a “diversified energy mix and its increasing leading role in the use of clean and renewable sources will further contribute to IEA's work and international cooperation in the energy sector”.\n“I am very happy to have received the formal request from Ministers Vieira and Silveira for Brazil to become a full IEA Member, a major development for international governance that builds on many years of deepening cooperation across a wide range of energy issues,” Dr Birol said. “Brazil is a cornerstone of the global energy system today and its importance is only set to increase in the years ahead. We look forward to discussing next steps with Brazil and our Member governments.”\nBrazil is Latin America’s largest country, both in terms of its economy and its population of more than 210 million people. As a major oil producer and exporter, it plays a key role in support of international energy security. Brazil has also positioned itself as a leader on energy transitions, drawing on its low-emissions power system, abundant renewable energy resources and strong biofuels sector to advance its economic development and social inclusion. Brazil holds the Presidency of this year’s COP30 international climate conference and held the G20 Presidency in 2024.\nBrazil joined the IEA Family as an Association country in 2017. The IEA currently has 32 Member countries, with 4 other countries in the Accession process to become Members. There are also 13 Association countries in the IEA Family."
    },
    {
      "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3790089/trump-bureau-of-land-management-limit-greater-sage-grouse-protections-ease-fossil-fuel-development/",
      "text": "The Bureau of Land Management on Tuesday proposed reexamining the management of the greater sage-grouse habitat across eight Western states as it seeks to open land for fossil fuel developments.\nThe bureau said on Tuesday it is requesting public comments on managing the greater sage-grouse habitat, which spans California, Idaho, Montana, Nevada, North Dakota, South Dakota, Utah, and Wyoming. In addition to the greater sage-grouse, a brown-speckled bird with a turkey-like tail, the habitat is home to more than 350 other wildlife species.\nEnvironmentalists and energy producers have long clashed over rules that would prevent drilling that could disturb the greater sage-grouse’s habitat. In November, the Biden administration issued a final rule to safeguard the habitat from drilling, mining, and renewable energy developments.\nThe habitat has shrunk in the last several years due to energy developments, wildfires, and droughts. The greater sage-grouse population has dropped 80% since 1965, according to the U.S. Geological Survey.\nThe Trump administration has sought to open public lands for fossil fuel development.\nAPPEALS COURT PERMITS TRUMP EPA TO TERMINATE ‘GOLD BARS’ CLIMATE FUNDING\nThe bureau said it would propose changes to former President Joe Biden’s regulations on managing the area to provide more land for energy and mining developments, and the proposal will incorporate research on how the greater sage-grouse responds to drought and disturbance.\nThe comment period closes on Oct. 3."
    },
    {
      "url": "https://www.cnbc.com/2025/09/02/power-of-siberia-2-russia-signs-new-gas-pipeline-deal-with-china.html",
      "text": "Russia and China on Tuesday signed a legally binding deal to build the long-delayed Power of Siberia 2 gas pipeline, deepening commercial ties in what is likely to be seen as a defiant signal to the West.\nAlexei Miller, the chief executive of Russia's state-owned energy giant Gazprom, told Russian news agencies that a memorandum of understanding had been signed on the construction of the new gas pipeline, following talks between Russian President Vladimir Putin and China's Xi Jinping in Beijing.\nThe pipeline, which is set to transit gas reserves in Russia's West Siberia to northern China via eastern Mongolia, will make it possible to supply 50 billion cubic meters (bcm) of gas per year, Miller said, according to Russia's Interfax news agency.\nSupplies under the new Power of Siberia 2 agreement will run for 30 years.\nThe price of the gas via the new pipeline will be agreed on separately, Miller said. The two countries also signed a separate agreement for Gazprom to boost gas supplies to China through the existing Power of Siberia pipeline.\nA Gazprom spokesperson was not immediately available to comment when contacted by CNBC. Beijing has not yet confirmed Miller's announcement, although state news agency Xinhua reported that the two countries signed more than 20 cooperation agreements, with energy deals among them.\nRead more\nRussia's gas exports to Europe have collapsed since Moscow's full-scale of invasion of Ukraine in early 2022. The West has imposed punitive economic sanctions on the Kremlin and reduced dependency on Russian energy, seeking to cut off a major source of revenues funding Putin's war machine.\nThe European Union, for example, introduced measures to stop the import of Russian gas and oil by the end of 2027, while the U.S. imposed a ban on the import of Russian fossil fuels in March 2022.\nThe measures have injected fresh urgency into Moscow's years-long push to build the Power of Siberia 2 gas pipeline. As a result, Russia has been trying to pivot to Beijing to replace Europe as its major gas customer.\nA new multipolar order\nChristopher Granville, managing director at TS Lombard, said that while the significance of the Power of Siberia 2 gas pipeline agreement is \"somewhat limited,\" it should not be dismissed as a \"nothing burger\" either.\n\"For the past decade, Gazprom has been pushing China to give the go-ahead for Power of Siberia-2, only to be met - until now - with positive but non-committal noises. So today's signing of a MOU is a step forward for Gazprom,\" Granville told CNBC by email.\n\"The fact that this has happened against the background of the fraught Ukraine war endgame, is a clear enough signal of China's steady strategic backing for Russia as the lynchpin of the new multipolar order to which both these core Eurasian powers aspire,\" Granville said.\nIt is a long way, however, from an MOU to a Final Investment Decision. The equivalent MOU-style agreement in principle on the original Power of Siberia pipeline was struck in the mid-2000s, Granville said, noting that a definitive pricing agreement was not agreed until 2014.\nRussia and China have sought to showcase a new global security and economic order at the annual Shanghai Cooperation Organization (SCO) summit.\nIn a thinly veiled swipe at U.S. President Donald Trump's administration, China's Xi said in his opening speech on Monday that the world had entered \"a new phase of turbulence\" with global governance at a \"new crossroads.\"\n'Trump Always Chickens Out'\nTimothy Ash, an associate fellow in the Russia and Eurasia program at Chatham House, said China has been \"playing very hard\" to get the Power of Siberia 2 gas pipeline deal over the line.\nThat's partly because of Russia's urgency to sign an agreement given the loss of more than 120 bcm in gas exports to Europe, Ash said, and perhaps because Beijing had previously been \"mindful of not annoying\" the Biden administration by going all out in support of Putin.\n\"But now I think likely the Chinese got a better deal, in terms of the pricing, and perhaps are now more willing to fund the construction,\" Ash told CNBC by email.\n\"I think Xi has figured out TACO and that only by adopting a strong, tough stance towards the US, will the US actually back down,\" Ash said. The TACO acronym refers to \"Trump Always Chickens Out,\" a term to describe the back-and-forth nature of the president's tariff policies.\n\"I think this SCO has all been about presenting a United front to the US, that the Global South will not back down in response to US pressure,\" he added."
    }
  ],
  "argos_summary": "An appeals court ruled 2‑1 in favor of the Trump‑era EPA, allowing it to claw back billions in Greenhouse Gas Reduction Fund grants that were earmarked for climate groups, a decision that could dampen federal climate‑finance flows. The ruling follows a broader backlash against a DOE climate‑risk report that critics say misrepresents science and supports the administration’s push to roll back the 2009 Endangerment Finding. The court’s decision, coupled with the DOE report controversy, signals a tightening of federal climate‑policy enforcement and a potential shift in funding toward fossil‑fuel and energy‑security projects such as coal leasing and nuclear SMR developments.",
  "argos_id": "Q7IUYV2JV"
}