{
  "url": "https://www.nytimes.com/athletic/6592483/2025/09/02/micah-parsons-jerry-jones-negotiations-agent/",
  "authorsByline": "Saad Yousuf",
  "articleId": "3628f6e096e44ad88f9f001f45283e95",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/09/02135042/USATSI_24246804-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T18:47:12+00:00",
  "addDate": "2025-09-02T18:54:15.456570+00:00",
  "refreshDate": "2025-09-02T18:54:15.456572+00:00",
  "score": 1.0,
  "title": "Micah Parsons’ agent details his view of contract negotiations with Cowboys, Jerry Jones",
  "description": "'At no point did Micah believe that he was negotiating a contract,' Parsons' agent, David Mulugheta, said Tuesday on ESPN's 'First Take.'",
  "content": "Dallas Cowboys owner and general manager Jerry Jones voiced his side of the story during contract negotiations with former Cowboys pass rusher Micah Parsons. Now, after Parsons was traded to the Green Bay Packers last week and received a monster contract extension, Parsons’ agent, David Mulugheta, is sharing his side of what transpired.\n\nMulugheta joined ESPN’s “First Take” on Tuesday morning to discuss the negotiations with the Dallas front office.\n\n“I think the most important thing is that Micah wanted to be a Cowboy,” said Mulugheta, president of team sports at Athletes First. “He grew up cheering for the Cowboys, wore the blue and white at Penn State, wore it in the NFL with the Dallas Cowboys. He wanted to be a Cowboy. We did everything we could for him to remain a Cowboy.”\n\nMulugheta said his agency typically prefers to keep negotiation discussions out of the media spotlight. But Athletes First believed some things deserved clarification after so much information about this one became public.\n\n“If you look at many of these contracts that the Cowboys have done over the past few years, and the recent ones, the guarantees don’t stretch much further than the first new year,” Mulugheta said. “If you look at Micah’s current deal, he has guarantees into four years from now. So again, there are certain things that have been put out in the media to make it look as though Micah turned down a fair or a great deal, but that’s simply not the case.”\n\nArguably the biggest point in question was Jones’ claim that he had offered Parsons a deal in March that would make him the highest-paid non-quarterback in the NFL.\n\n“That’s a loaded question,” Mulugheta said. “From an APY (average per year) standpoint, if you’re just looking at the average that was offered to him, I believe it was $40.5 million was the offer, which would have made him, at the time, from an APY standpoint, the highest paid. That being said, the way the cash flow was structured, over his first three new years, he would not be paid as the highest-paid (non-quarterback) player in the NFL.\n\n“Again, that’s why I say, the devil’s in the details. Another important part of the contract was a four-year deal versus a five-year deal. When you look at that, that fifth new year can be a difference of $30 million or $40 million for the player. If you look at where the pass-rusher market was a year ago, it was at $35 million or so with Nick Bosa. Now, it’s at $47 million in one year with Micah Parsons. Four years from now, where do you think that number is? It’s probably closer to $65 million or $70 million per year, and if we lock in that fifth year, currently at $40 million, just that year alone is worth an additional $30 million to Micah, if not more.”\n\nMulugheta said the difference between the deal the Cowboys had offered versus what Parsons got from the Packers could be a difference upwards of $60 million, when it’s all said and done.\n\nAnother thing that was murky — with only one side of the story — was the meeting that took place between Jones and Parsons. Jones said that meeting is where a contract was agreed upon. In his public statement requesting a trade on Aug. 1, Parsons addressed that point briefly, saying that the meeting was advertised to him as a conversation about leadership, not a contract negotiation.\n\n“As far as Micah was concerned, he was out of the country,” Mulugheta said. “He got a call from Jerry’s assistant and was asked to come in to meet about leadership. So, when he got back from his vacation, he came in and he gave him a call and said that he was back and he was ready to meet. At some point during that meeting that was represented to him (as one that) was going to be about leadership, it turned into contract talk.\n\n“If you’re a 25-year-old football player and your boss who happens to be the most powerful person in the NFL starts talking about contracts, it’s hard for you to end that conversation. So, they had a conversation, Micah nodded his head out of respect. Obviously, there’s a power dynamic that’s a little different there. One guy is the owner of the team, and the GM, and the other one is Micah Parsons, who is a young, 25-year-old football player. I’m not sure if there was a miscommunication there by the time Micah walked out, but at no point did Micah believe that he was negotiating a contract.”\n\nAt one point, Jones made a comment that when the Cowboys tried to send Mulugheta a completed contract, Mulugheta told the Cowboys to “stick it up their ass.” Mulugheta said that terminology wasn’t used and clarified how it went from their side.\n\n“It was a misrepresentation of what I said,” Mulugheta said. “What I did tell them was if they believed that the contract was already finalized and they were sending it over to me to be rubber stamped, then they probably shouldn’t send it over.”\n\nAfter the messy nature of the negotiations, there were questions about how this may impact future negotiations between other Mulugheta clients and the Cowboys. That client list includes receiver George Pickens, who the Cowboys traded for this offseason and is entering the final year of his rookie deal.\n\n“There’s nothing personal here,” Mulugheta said. “It’s a business transaction as far as the contract is concerned. If George Pickens does what we expect him to do, which is be one of the best receivers in the NFL this year, we’ll have those conversations with the Cowboys. And if they’re open to having that dialogue with us, and negotiating a long-term deal, then we’d love for George Pickens to be a star with a star on his helmet. But if that’s not the case, then obviously we’ll see what else is out there for him. But again, this is not going to affect any negotiations moving forward for us.”\n\nMulugheta also said that Parsons did not intend to sit out games this season, if an extension wasn’t reached and Parsons had to play on the fifth-year option. Mulugheta said Parsons’ back injury is a legitimate ailment for which he’s taking medicine for — not a cover for a contract dispute — and he intended to get it further examined and play when the season began.\n\n“Micah loves the game too much,” Mulugheta said. “He was going to play no matter what. … He had a real injury, but at no point did he plan on that keeping him off the field. The Cowboys were never told that he would not play. He always intended to play football. He was going to be on the field Thursday to play against the (Philadelphia) Eagles.”\n\nOne of the main things that led to the divorce between the Cowboys and Parsons was how the two sides viewed the March meeting between Parsons and Jones. Jones viewed it as a contract negotiation while Parsons and his camp did not.\n\n“To expect somebody like Micah Parsons to be one of the best defenders in the NFL, and also a great lawyer when it comes to contracts, I think is a bit unfair,” Mulugheta said. “His job is to go out there and chase quarterbacks and our job is to go out there and chase commas for him. So, I’m not sure exactly why it went this way, but we were always prepared and open to negotiate a contract with the Jones family.”",
  "medium": "Article",
  "links": [
    "https://t.co/zHqvflKxEo",
    "https://www.nytimes.com/athletic/6585213/2025/08/29/packers-expectations-micah-parsons-week-1-takeaways/",
    "https://t.co/5cXgwDzq71",
    "https://twitter.com/FirstTake/status/1962899906626040225?ref_src=twsrc%5Etfw",
    "https://twitter.com/FirstTake/status/1962895847374405903?ref_src=twsrc%5Etfw",
    "https://www.nytimes.com/athletic/6568347/2025/08/21/cowboys-jerry-jones-micah-parsons-contract/",
    "https://www.nytimes.com/athletic/6582707/2025/08/28/micah-parsons-trade-packers-cowboys-nfl-2025/",
    "https://www.nytimes.com/athletic/6582930/2025/08/28/cowboys-trade-micah-parsons-jerry-jones-comments/",
    "https://www.nytimes.com/athletic/6584360/2025/08/31/jerry-jones-cowboys-nfl-owners-raiders-al-davisjerry-jones-cowboys-nfl-owners/",
    "https://www.nytimes.com/athletic/6590134/2025/09/01/micah-parsons-back-sprain-season-opener-lions/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Micah Parsons",
      "weight": 0.097577594
    },
    {
      "name": "contract negotiations",
      "weight": 0.09699832
    },
    {
      "name": "former Cowboys pass rusher Micah Parsons",
      "weight": 0.09428182
    },
    {
      "name": "contracts",
      "weight": 0.082146235
    },
    {
      "name": "contract talk",
      "weight": 0.07949704
    },
    {
      "name": "year",
      "weight": 0.07867555
    },
    {
      "name": "Parsons",
      "weight": 0.07628514
    },
    {
      "name": "Dallas Cowboys",
      "weight": 0.07473951
    },
    {
      "name": "Mulugheta",
      "weight": 0.073417634
    },
    {
      "name": "other Mulugheta clients",
      "weight": 0.07340734
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97412109375
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.96337890625
    }
  ],
  "sentiment": {
    "positive": 0.23089093,
    "negative": 0.32784188,
    "neutral": 0.44126716
  },
  "summary": "Dallas Cowboys owner and general manager, Jerry Jones, has publicly commented on contract negotiations with former Cowboys pass rusher Micah Parsons. Parsons was traded to the Green Bay Packers last week and received a contract extension. His agent, David Mulugheta, confirmed that Parsons wanted to remain a Cowboy and that his agency tried to keep the discussions out of the media spotlight. He refuted claims that Jones had offered Parsons a deal that would have made him the highest-paid non-quarterback in the NFL. Mulughheta also noted that the difference between the Cowboys' offer and Parsons' from the Packers could be upwards of $60 million.",
  "shortSummary": "The agent of Micah Parsons, traded for the Green Bay Packers, shared his side of the contract negotiation with the Dallas Cowboys, emphasizing his desire to remain a Cowboy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "3c0e6a345b024fbca016b97c185e226b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6568347/2025/08/21/cowboys-jerry-jones-micah-parsons-contract/",
      "text": "Dallas Cowboys coach Brian Schottenheimer said Wednesday he’s confident Micah Parsons will be on the field Week 1 against the Philadelphia Eagles. Judging by Jerry Jones’ comments Thursday, there’s a good chance that’s without a new contract.\nWhile joining former Cowboys star wide receiver Michael Irvin on his YouTube channel, the Cowboys owner and general manager sounded completely committed to not renegotiating what he believes was already negotiated in March with Parsons. Jones said the offer would have made the All-Pro pass rusher the NFL’s highest-paid non-quarterback in guaranteed money.\nAdvertisement\n“The world would know that I want Micah if they knew what I had offered him,” Jones told Irvin. “And he knows what I offered him.”\nJones and Parsons met in March and negotiated without Parsons’ agent, David Mulugheta, being present. Jones said Thursday that when they sent the contract details over, “the agent told us to stick it up our ass.”\nParsons, who requested a trade Aug. 1, is entering the fifth and final year of his rookie deal. His 2025 salary is just over $24 million. The NFL’s highest-paid non-quarterback in terms of average annual value is Pittsburgh Steelers pass rusher T.J. Watt at $41 million per year. Last month, he signed a three-year, $123 million contract extension with $108 million guaranteed, the most guaranteed money by a non-quarterback.\nWhen Parsons posted his trade request on X, his statement said, “I no longer want to be held to close door negotiations without my agent present.” Parsons included details about the March meeting, writing that it was about leadership. “Somehow the conversation turned into him talking contract with me,” Parsons added. “Yes I engaged in a back and forth in regards to what I wanted from my contract, but at no point did I believe this was supposed to be a formal negotiation and I informed Mr. Jones afterward my agent would reach out thinking this would get things done.”\nJones continued to explain Thursday that Parsons is under contract for this season and the Cowboys can franchise tag him the next two seasons. The franchise tag number for a defensive end this season is $22 million. According to Over the Cap, the projected franchise tag number for a defensive end next season will be a little over $26.5 million.\n“We really got three years to work this thing out,” Jones said, before explaining how he did the same thing with franchise quarterback Dak Prescott, who is the NFL’s highest-paid player at $60 million per season. “We couldn’t agree so Dak played the last year of his contract and then we franchised him. It’s exactly what happened with Dak, so we moved forward and ultimately we got a contract, made Dak the highest-paid player in the NFL. So the precedent is handling it like Dak.\nAdvertisement\n“But in this particular case, then Micah comes in and plays this year under his contract. If he doesn’t, then it’s very costly, very costly for everybody.”\nAfter Jones’ comments emerged Thursday, Parsons removed all references to the Cowboys from his social media. He then posted a video on TikTok showing him waving goodbye, with audio from former NBA star Allen Iverson saying, “Imma win wherever I go. Wherever I go, imma win. I don’t care where I go.”\nParsons has been attending training camp practices, taking part in the walk-through portions and meetings. But he has not been practicing. It remains to be seen whether that will change next week as the Cowboys begin preparation for their season opener at the Philadelphia Eagles on Sept. 4.\nMicah Parsons is here pic.twitter.com/HLOZO4t6g8\n— Jon Machota (@jonmachota) August 20, 2025\nIt’s unrealistic to expect a deal to get done without Jones and Mulugheta talking. That hasn’t happened to this point. And judging by Jones’ comments Thursday, it doesn’t sound like he will be the one making the first call.\n“Micah and I talked (in March) and then we were going to send it over to the agent,” Jones said. “We had our agreements on terms, amount, guarantees, everything. We were going to send it over to the agent, and the agent said don’t bother because we have all that to negotiate. Well, I had already negotiated. I already moved off my mark in several areas. So the issue, very frankly, is we’ve had the negotiation in my mind. And the agent is trying to get his nose in it right now and try to come in there and improve off the mark that we had already set.\n“We’ve got this deal resolved in my mind, for the Dallas Cowboys. We’ve got it done. And if the agent wants to finish up the details, which he should, and do all the paperwork, he can do that. And we’re ready to go. But as far as the amount of money, the years, the guarantees, all of that, we’ve negotiated that.”\nJerry Jones when asked on @FoxNews about how close the Cowboys are to getting a deal done with Micah Parsons pic.twitter.com/ckmJ9FqIJv\n— Jon Machota (@jonmachota) August 21, 2025\n(Photo: Stacy Revere / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6582930/2025/08/28/cowboys-trade-micah-parsons-jerry-jones-comments/",
      "text": "FRISCO, Texas — The Dallas Cowboys traded star pass rusher Micah Parsons to the Green Bay Packers on Thursday for defensive tackle Kenny Clark and first-round draft picks in 2026 and 2027 from Green Bay.\nParsons had been embroiled in a contract dispute with the Cowboys this offseason. While he attended the team’s training camp in Oxnard, Calif., he did not practice and the more camp went on, the more contentious things got between him and owner/GM Jerry Jones. Parsons requested to be traded Aug. 1, but that didn’t feel like a real option. Until it was … Thursday.\nAdvertisement\nSo why did Jones make the move?\n“Without being too broad, obviously, we did think it was in the best interest of our organization. Not only the future but right now this season, as well. We gained a Pro Bowl player in an area we had big concerns in on the inside of our defense,” Jones said.\nThen Jones got more to the point of the matter.\n“Let me go beyond your question. First of all, I want to tell you, I really like Micah. I appreciate the four years that we’ve had him here. He’s a great player. We are very appreciative of the fact that he’s a great player. There’s no question that I could have signed him in April. So we all know to have agreements, all parties have to agree, but this was by design. I did make Micah an offer. It wasn’t acceptable, and I honored the fact that it wasn’t done in the way that he wanted to do it through an agent. So he was made an offer. There’s not an ounce of vindictiveness. There’s no bad feelings on my part about the fact that we didn’t come together on an agreement.”\nJerry Jones said the requirement in trade offers for Micah Parsons was that they had to get a top defensive tackle in return pic.twitter.com/g7HRJePsgL\n— Jon Machota (@jonmachota) August 28, 2025\nJones discussed the offer he made to Parsons in April.\n“When I offered Micah the contract that I offered him back in April, he flew in from out of the country,” Jones said. “He wanted to come right in, I said, no, get you a night’s sleep and come on in the next day. When I did that, we offered him a contract to come play for the Dallas Cowboys and it was a good one. OK? It was more guaranteed than what’s here now (that’s) been reported. My point is, without getting into detail, that was a very genuine negotiation. We changed the amounts and then we left, and then he called back and talked to Stephen — Stephen negotiated amounts. We changed those amounts that he called back from.\nAdvertisement\n“Of course, the rest is history when the time came to say, “Let’s go,” then he said, ‘Let’s start the negotiation.’ Again, nothing in the world am I criticizing Micah about at all. That was every bit his right. Micah’s never been anything but so pleasant for me to be around. I want to be real clear. … Things are good here.”\nJones and Cowboys executive vice president Stephen Jones stressed the importance of adding Clark.\n“We have the highest-paid player in the NFL at quarterback, and we made that commitment last year and we’re proud we made it,” Jerry Jones said. “It had everything to do with this decision. Everything. It gives us every opportunity with Dak Prescott and (CeeDee) Lamb and the base that we’ve got to win now. So all you need do — I’m not so sure this would have been the result had we not had Dak. But the fact that we have Dak, we need to stop the run. We really do. We need to get the ball back.”\n“Kenny Clark was a big part of this,” Stephen Jones said. “That was a part of winning right now. We feel like when you look at the frustration, it’s we haven’t been able to win the big game in the playoffs, and we think it is a direct connection of not being able to stop the run and we think Kenny Clark is going to be a big piece to that. And we felt like, because of our depth on the edge, as well as the ability to scheme pressure, that we could make up for Micah — because obviously he’s elite at rushing the passer.”\n(Photo: Nick Cammett / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6590134/2025/09/01/micah-parsons-back-sprain-season-opener-lions/",
      "text": "By Matt Schneidman, Dianna Russini and Zach Powell\nGreen Bay Packers linebacker Micah Parsons is managing a facet joint sprain in his back and may need an epidural injection to play on Sunday, a league source said.\nBefore Parsons, 26, was traded from the Dallas Cowboys to Green Bay last week, the Cowboys prescribed him a five-day plan of prednisone, a corticosteroid used to reduce inflammation around irritated nerves and tissues in his back. Dallas also had Parsons on a physical therapy program, according to the source.\nAdvertisement\nParsons is beginning his fifth season after a blockbuster trade landed him with Green Bay after a contract standoff with the Cowboys. Last week, he signed a four-year extension with the Packers worth $188 million and $136 million guaranteed. His average annual salary of $47 million makes him the highest-paid non-quarterback in NFL history.\nThe star linebacker is practicing this week to prepare for the season opener against the Detroit Lions.\nCould Parsons miss Week 1 opener vs. Lions?\nWhile Parsons may have a legitimate back injury, he has not indicated he’ll miss the Packers’ Week 1 matchup. Parsons was asked during his introductory news conference on Friday about his physical condition and expectations for the season opener.\n“Physically, I’m great,” Parsons said. “I think I can contribute a lot. I’m going to team up with the doctors in creating a plan. We already talked about how we can ramp things up and get me into a flow where they feel comfortable and I feel comfortable. But my plan is to be here. They didn’t give up what they gave up for me to sit on the sidelines and make this big of a risk and change for me to do that, so I’m going to give them my all.”\nPackers left tackle Rasheed Walker, Parsons’ college teammate, said after Monday’s practice that Parsons took some 11-on-11 reps but looked to be a limited participant.\n“He said he was gonna be more full-go Wednesday and Thursday, so yeah, he gon’ have to come see me,” Walker said.\nIf Parsons is indeed a full participant on Wednesday, Thursday or even Friday, that’s a telling sign he’ll play in the season opener on Sunday. Maybe he won’t have a typical workload after not practicing all camp and nursing a back injury, but it would be a surprise if Parsons doesn’t suit up at all. — Matt Schneidman, Packers beat writer\n(Photo: Tork Mason / USA TODAY NETWORK Wisconsin)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6582707/2025/08/28/micah-parsons-trade-packers-cowboys-nfl-2025/",
      "text": "By Saad Yousuf, Jon Machota, Matt Schneidman and Dianna Russini\nThe Athletic has live coverage of the Micah Parsons trade.\nThe Dallas Cowboys have traded star edge rusher Micah Parsons to the Green Bay Packers, the Cowboys announced on Thursday.\nIn exchange, Dallas will receive Pro Bowl defensive tackle Kenny Clark and first-round draft picks in 2026 and 2027 from Green Bay.\nAdvertisement\nAccording to Parsons’ agency, he has also signed a four-year extension with Green Bay for $188 million with $136 million guaranteed and an average annual salary of $47 million, making him the highest-paid non-quarterback in NFL history.\nParsons, 26, is entering his fifth season in the NFL after being drafted by Dallas with the No. 12 pick in the 2021 NFL Draft. The Cowboys host the Packers on Sunday Night Football on Sept. 28 at AT&T Stadium.\nWe have completed a trade to receive a 2026 first-round pick, a 2027 first-round pick, and Pro Bowler DT Kenny Clark from the Packers in exchange for Micah Parsons.\n🗞️: https://t.co/7Hiwb2Nilj | @blockchain pic.twitter.com/NED5bHcHYT\n— Dallas Cowboys (@dallascowboys) August 28, 2025\nWhy Packers made the bold move\nOn the eve of the 2018 NFL regular season, the Packers lost out to the Bears for Khalil Mack, whom Chicago acquired from the Raiders for a king’s ransom. In his first year as general manager, Brian Gutekunst showed a willingness to take a big swing for an edge rusher in the prime of his career. Seven years later, with his job potentially on the line under new team president Ed Policy, Gutekunst pulled out his driver once again for a similar move.\nThere are two players in league history with at least 12 sacks in their first four seasons: Micah Parsons and Reggie White. White is one of six players with his number retired on the Lambeau Field facade. Parsons will now call home the same stadium that one of the best players ever did.\nWhile the Packers gave up a three-time Pro Bowler and their longest-tenured player in defensive tackle Kenny Clark, they retained their No. 1 edge rusher (now No. 2) in Rashan Gary.\nGutekunst himself said Green Bay’s pass rush was too inconsistent last season. It’s part of the reason head coach Matt LaFleur fired defensive line coach Jason Rebrovich and replaced him with former Patriots defensive coordinator DeMarcus Covington. LaFleur also said that before defensive coordinator Jeff Hafley’s first season calling the defense last year, he envisioned the Packers generating pressure on the quarterback by rushing a traditional four (like the Eagles effectively do). Instead, the Packers weren’t able to and Hafley resorted to crafting exotic pressures with linebacker Edgerrin Cooper, safety Xavier McKinney and others to cause havoc.\nAdvertisement\nNow, the Packers should have an easier time generating pressure with four and dropping the typical seven into coverage (like LaFleur wanted last year) with Parsons and Gary coming off the edge, even if losing a healthy Clark up the middle is a big blow. That means more responsibility now falls on fourth-year defensive tackle Devonte Wyatt, a 2022 first-rounder whose fifth-year option the Packers exercised in May, and 2023 Day 3 picks Karl Brooks and Colby Wooden. Two rookie defensive tackles from Georgia, sixth-rounder Warren Brinson and undrafted signing Nazir Stackhouse, also made the Packers’ 53-man roster. — Matt Schneidman\nA stunning decision by Cowboys, Jerry Jones\nThis is a stunning trade by the Cowboys because Jerry Jones just doesn’t make these types of moves. Jones falls in love with star players and doesn’t let them leave the building in their prime. The other part is that Jones has become so conservative over the last decade that everyone just assumed he’d do what he’s done with every other star player — eventually give them a new massive contract. But maybe his recent Netflix documentary “The Gambler” got him feeling nostalgic and looking to make a big splash. This would qualify.\nJones has always wanted credit for the Herschel Walker trade. That one set up the Cowboys’ dynasty run of the 1990s. Maybe that’s his hope here. Two first-round picks and Clark are far from what Jones got for Walker, but it’s still very bold.\nThis deal is also surprising because no team has been a bigger thorn in Jones’ side over the last 15 years than the Packers. They ended the Cowboys’ seasons in 2014, 2016 and 2023. Dallas’ best shots at making a deep postseason run. Definitely not the team anyone thought Jones would send his team’s best player. — Jon Machota\n(Photo by Stacy Revere/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6584360/2025/08/31/jerry-jones-cowboys-nfl-owners-raiders-al-davisjerry-jones-cowboys-nfl-owners/",
      "text": "If Cowboys owner and general manager Jerry Jones could win Super Bowls as easily as he makes himself the center of conversation, he’d have more rings than fingers and toes.\nJones is the topic du jour again these days after the stunning trade of outside linebacker Micah Parsons, arguably the best defensive player in football.\nAdvertisement\nJones apparently is counting on this trade having an outcome similar to the Herschel Walker trade of 1989 that helped build a dynasty. For that to happen, the Cowboys would have to draft like coach Jimmy Johnson did in the early 1990s.\nThe move was curious because the Cowboys had considered themselves Super Bowl contenders. They received defensive tackle Kenny Clark and two first-round picks in return for Parsons, but there is no way to argue they are better today than last week. And the message the trade sent to fans and players is they should not expect the 29-year championship drought to end anytime soon. It isn’t the kind of deal expected from an 82-year-old owner/general manager.\nParsons isn’t the only Cowboys star whose negotiations with Jones were thorny.\n“Sometimes Jerry will negotiate right down to the final dime with somebody,” Jones’ close friend Mike McCoy said in “King of the Cowboys: The Life and Times of Jerry Jones.” “It’s the point of proving that he can win. Then he’ll turn right around when the bargaining is over and he’ll give something back that you’ve been negotiating over for days. Sometimes it’s just like a game to him.”\nIn the Netflix docuseries “America’s Team: The Gambler and His Cowboys,” Jones says, “We do it our way, baby.”\nAnd the Cowboys’ way is different than most.\nHowever, some of it is reminiscent of the way Bears founder George Halas and Raiders owner Al Davis conducted their business.\nHalas let future Hall of Famers Bronko Nagurski, George Blanda and Mike Ditka walk away rather than pay them. Nagurski, in fact, became a pro wrestler in 1938 over a $500 difference in negotiations.\nWhen Ditka was the best tight end in the NFL in the early 1960s, Halas wouldn’t give him the salary he thought he was worth, and Ditka subsequently said Halas “threw around nickels like they were manhole covers.” Halas, who had survived the Great Depression by taking money out of the piggy banks of his two children, responded, “That is correct.”\nAdvertisement\nDitka was traded to the Eagles.\nDavis, unlike Halas and Jones, didn’t have many notable contract disputes with players. But his parsimoniousness came out in the way he paid — or didn’t pay — coaches.\nBy 2002, Jon Gruden — “Chucky” as he was known to Raiders fans — was the brightest coaching star in the NFL. In the previous four years as coach of the Raiders, his record was 40-28. If not for a playoff loss to the Patriots, partly due to the famous “Tuck Rule” play, the Raiders would have been in the AFC Championship Game for the second straight season. Gruden’s success and popularity gave him negotiating leverage for a healthy raise.\nInstead of paying him, Davis traded him to the Buccaneers, who beat the Raiders in the Super Bowl the following season.\nJones, Davis and Halas took many arrows late in their tenures. They were easy targets. Halas coached until he was 73. Jones’ Cowboys are 5-13 in the postseason since their last Super Bowl, with only one of the victories coming in the last six years. In the last eight years of Davis’ life, his Raiders were 54 games below .500.\nJones’ legacy is fascinating. Only one active owner — Robert Kraft of the Patriots — has more Super Bowl victories, and Jones has had a massive footprint on 31 teams besides his own. But perceptions of him have been colored by the Cowboys’ inability to get back to the level they were in the ’90s. The Parsons trade undoubtedly will color those perceptions further, one way or another.\nThe problem with being an owner/GM is that the owner has one less person to blame for failures.\nThe heat serves Jones well. It gives him fuel.\nDavis was thin-skinned and barked back at anyone who took issue with his decisions. When he was an old man using a walker, he tried to physically intimidate a media critic.\nSuccess shielded Halas from criticism for much of his long career, but the wolves started howling when he couldn’t get his team over the hump in the 1950s. That’s when he showed his cantankerous side.\nAttention was important to all three.\nJones, unabashedly, is a promoter. “The Cowboys are a soap opera 365 days a year,” he said in “America’s Team.” “When it gets slow, I stir it up.”\nAdvertisement\nIn Halas’ case, he used attention to grow the league during eras when the NFL played second fiddle to Major League Baseball and college football. Halas typed press releases and personally delivered them to newsrooms.\nBeing the face of his franchise was vital for Davis. When he had to pass a billboard with head coach Gruden on it on his way to work every day, he couldn’t take it. The scenario was similar with running back Marcus Allen, who had become arguably the best running back in the NFL by the late 1980s and also the most popular Raider. At Davis’ behest, Allen was moved to fullback and forced to take a back seat to Bo Jackson, Roger Craig and Eric Dickerson.\nJones and Davis differed in how they dealt with attention. Davis was a sphinx, reveling in the mystery of silence.\nJones is transparent. He’ll answer all questions and is more available than any owner of anything in the history of everything.\nIf his Cowboys could control the ball the way their owner controls the news cycle, they’d lead the league in time of possession every year.\nFor Halas, the motivation was love of the game. With Jones, there was also love of the fame.\nDavis was driven by love of the Raiders, his creation.\nJones has been criticized more than Halas or Davis for several reasons. Everyone is more criticized these days, given the growth of the game and the population of trolls. By talking so much, Jones exposes himself. And he was never afforded the credibility that Halas and Davis were because they were coaches.\nJones was an offensive lineman and captain for an Arkansas team that won the UPI national championship in 1964. He accumulated his wealth as a wildcatter and did his only coaching from his couch. But he has admitted to being a frustrated coach. He once told Sports Illustrated’s Frank DeFord that he “could have coached the s— out of this (Cowboys) team.”\nAdvertisement\nJones has often made his influence felt on the field by having a hand in the hiring of assistant coaches. When Barry Switzer took over for Johnson in 1994, he had to retain the assistants from Johnson’s staff. Switzer was allowed to hire Mike Zimmer to coach the nickel defense. Partly because Zimmer had the respect of Jones, he was retained by head coaches Chan Gailey, Dave Campo and Bill Parcells and then brought back years later under Mike McCarthy.\nWhen Halas was coaching, he hired stellar assistants, including Ralph Jones, Luke Johnsos, Clark Shaughnessy, Hunk Anderson, George Wilson and George Allen. After stepping down as a coach, Halas still had a hand in the coaching staff. Six of the nine assistants on the 1985 Super Bowl Bears, including defensive coordinator Buddy Ryan and former Bears head coach Jim Dooley, were holdovers that Ditka agreed to retain at Halas’ request.\nDavis famously hired many Raiders assistant coaches after he stopped formally coaching in 1966 to become the commissioner of the AFL. Some Raiders assistants, such as Fred Biletnikoff, Willie Brown and Art Shell, were former Raiders players. When Davis named Mike Shanahan head coach in 1988, Davis allowed him to bring in only three assistants: Alex Gibbs, Nick Nicolau and Pete Rodriguez. The rest were Davis hires. Shanahan fired two of Davis’ old-guard assistant coaches only to have Davis reinstate them.\nJones can be headstrong, but the truth is, he’s open-minded with his lieutenants. Johnson ran the fruitful drafts that laid the foundation for the Cowboys’ dynasty of the ’90s. When Parcells was the head coach of the Cowboys, he pushed for the Cowboys to draft tight end Jason Witten and pass rusher DeMarcus Ware. Jones allowed his son Stephen Jones, his personnel director, to talk him into drafting Zack Martin instead of Johnny Manziel in 2014.\nParcells said it was a misconception that Jones had to call all the shots.\n“Jerry is a good businessman and a good listener,” he told Dallascowboys.com after he left the team. “What you have to do is make sense to him. … If he thinks you’re making sense, he’ll alter his opinion.”\nNeither Jones, Davis, nor Halas was concerned about living in harmony, however.\nAdvertisement\nJones might have won more if he could have co-existed with Johnson.\nDavis might have won more if he could have co-existed with Gruden.\nHalas might have won more if he could have co-existed with his defensive coordinator, George Allen, who left because of a contract fight.\nDavis was a mentor to Jones. During Jones’ first year as owner of the Cowboys, Davis often called Jones during the team’s struggles to offer encouragement.\nOver the years, Davis and Jones spoke on the phone two or three times a month, with many of their calls lasting an hour or more. Jones told the Dallas Morning News that before the Cowboys of the ’90s started winning, he and Johnson considered trading wide receiver Michael Irvin and replacing him with Kelvin Martin. Davis told Jones he would be happy to trade for Irvin, but Jones needed to keep him.\nAn argument could be made that Jones would have benefited from Davis last week.\nFor Jones, it was a compliment to be compared to Davis. Both were drawn to splashy moves, and neither could resist a roll of the dice.\nIn 1982, Mike Haynes was one of the best cornerbacks in the NFL for the Patriots, a Pro Bowler and an All-Pro. The next season, he held out for a renegotiated contract. Davis acquired him in November for first- and second-round picks. The Raiders lost only one other game the rest of the season on their way to a Super Bowl championship, as Haynes and Lester Hayes became one of the greatest cornerback duos of all time.\nA similar scenario played out in Dallas 13 years later. The Cowboys had lost to the 49ers in the NFC Championship Game the year before, so Jones poached cornerback Deion Sanders from the Niners and made him the highest-paid defensive player in the NFL. The Cowboys won Super Bowl XXX that year.\nDavis was known for taking chances on players with histories that deterred other teams. Among those he acquired despite warning flags were Lyle Alzado, John Matuszak, Todd Marinovich and JaMarcus Russell.\nAdvertisement\nJones, meanwhile, has acknowledged being an ardent believer in what he considers player rehabilitation, and he’s shown it in his transactions, acquiring Charles Haley, Pacman Jones, Terrell Owens, Greg Hardy and others who gave most teams pause.\nIn 1995, Davis was intent on drafting linebacker Derrick Brooks after selecting running back Napoleon Kaufman with the 18th pick. He thought Jones would trade him the 28th pick, according to the book, “Al Davis: Behind The Raiders Shield.” Instead, Jones took a better offer from the Bucs, who selected Brooks.\n“That one really surprised me because Al had an affinity for Jones,” former Raiders scout Bruce Kebric said. “One time, I was in Al’s office and Jones called. I remember Al saying to Jones. ‘There are not many people that I call a friend … but you’re one.”\nJones had such respect for Davis that when he countersued the NFL in 1990 for the freedom to cut independent marketing deals, Davis was the only team owner who was omitted from the lawsuit.\nJones and Halas probably did more to expand the NFL’s reach than anyone, except for former commissioner Pete Rozelle and current commissioner Roger Goodell. A plaque in Halas Hall, written by former team official Bill McGrane, reads: “By the sheer weight of enormous will, he (Halas) demanded that America pay attention to professional football.”\nAs AFL commissioner, Davis made AFL teams competitive with their NFL big brothers, which helped convince NFL owners that a merger was the wisest choice. And an expanded NFL has been a more powerful NFL.\nBetween Halas, Jones and Davis, the teams they touched won 15 championships. They also have three busts in the Pro Football Hall of Fame, which underscores the most prominent similarity between them — they were visionaries.\nIn light of the Parsons trade, some are pointing out that vision often deteriorates with age.\n(Top photo: Matt Winkelmeyer / Getty Images for Netflix)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6585213/2025/08/29/packers-expectations-micah-parsons-week-1-takeaways/",
      "text": "GREEN BAY, Wis. — Micah Parsons strolled to the podium at Lambeau Field in a sweater with green and gold lines and a yellow beanie.\n“I had this for a while,” Parsons said. “I don’t buy clothes no more, so it’s kind of like Adidas or whatever’s in the closet.”\nParsons wanted deep down for Dallas to be his home, but he dressed to fit in at his new one.\nAdvertisement\nHere are five things we learned from Parsons’ first meeting with the media in Green Bay.\nReady for Week 1?\nParsons hasn’t practiced yet this preseason as he held out in Dallas, and the Green Bay Packers host the Detroit Lions next Sunday. Parsons was also dealing with a back injury, which seems to have magically healed, as he said Friday, “Physically, I’m great.” But what are reasonable expectations for Parsons’ participation in Green Bay’s season opener?\n“I think I can contribute a lot,” Parsons said. “I’m going to team up with the doctors in creating a plan. We already talked about how we can ramp things up and get me into a flow where they feel comfortable and I feel comfortable. … They didn’t give up what they gave up for me to sit on the sidelines and make this big of a risk and change for me to do that, so I’m going to give them my all.”\nParsons said he’ll meet with defensive coordinator Jeff Hafley when he returns to Green Bay on Sunday to map out what the next six days before game day look like.\n“He says he’s got a lot planned for me,” Parsons said. “I don’t know what the scheme looks like. I just got my iPad today. I’m going to look over it. I’m super excited. I know about his creativity. I’ve heard a lot. Obviously, I don’t watch their defense a lot, but I’m excited to learn. I’m excited to get better and be a dominant player for them.”\nCoach Matt LaFleur approached the topic of Parsons’ Week 1 participation with slightly more caution.\n“We’ve got to see where he’s at,” LaFleur said. “I don’t believe he’s practiced, so we’ve got to be very calculated with how we deploy him and just the number of snaps that he’s going to get. The first part of that is you’ve got to assess the situation, and in order to do that, you’ve got to have some sort of physical movement … it’s gonna be a lot of time spent together, I would say, and a lot of one-on-one time to try to get him up to speed as quickly as possible. But I think more than anything else, I’m confident that will happen quickly — we just gotta see where he’s at physically before we put him out there and he’s playing 70 snaps a game.”\nThe last time a Packers player wore No. 1 was Curly Lambeau 99 years ago.\n\"I'm going with No. 1,\" Micah Parsons said Friday night inside Lambeau Field.\nStory: https://t.co/5IN3NYSCvb\n— Matt Schneidman (@mattschneidman) August 30, 2025\nRasheed Walker’s role\nParsons is friends with Packers left tackle Rasheed Walker since they were in the same recruiting class at Penn State and played three years together for the Nittany Lions.\nAdvertisement\nBefore Parsons officially decided to join the Packers, he contacted Walker.\n“That’s my guy,” Parsons said. “He’s like, ‘It’s like Penn State. It’s like home. It’s like a brotherhood. It’s safe. You focus on ball, and you keep everything the right thing.’ It kind of gave me comfort, and it kind of gave me a better decision, like, ‘OK, this is a place where I feel like I can take my next step and continue to have a great legacy here.’”\nParsons has been itching to play actual football, and Walker might feel the brunt of that pent-up energy being released next week.\n“I told Rasheed, I said, ‘Bruh, just go ahead and get ready for your best practice week because I ain’t put my hands in somebody so long,’” Parsons said.\nMatt LaFleur’s first impression\nLaFleur said game planning for Parsons makes him lose sleep. He’s had to do it twice, once in the 2022 regular season and once in the 2023 playoffs. The Packers won both games.\nBut LaFleur’s first impression of Parsons came while coaching him in the 2021 Pro Bowl.\n“The majority of the players in the Pro Bowl — I think it’s well known that’s why there’s not a Pro Bowl game anymore — the majority of the guys looked like they were going through the motions,” LaFleur said. “Except for one guy. And he was trying to wreck shop out there, and he was trying to win, and that’s one thing, just having relationships with other coaches throughout the league that have worked with him, they’ll tell ya. This guy’s the ultimate competitor, and whatever it is you’re playing, he’s gonna wanna win, and I don’t think he’s very apologetic about that, which is so exciting as a coach to get a guy like that, and I think that just elevates everybody around him.”\nParsons was asked about LaFleur’s recollection, and his answer might make Packers fans find the nearest brick wall to run through.\nAdvertisement\n“You’ll realize as I’m here, I’m probably one of the most authentic people you’ll meet,” Parsons said. “I’m probably going to say things I probably shouldn’t say off emotion, and that’s just me. I’m going to do as I like because that’s just me. All I know is go, and if I feel like you can’t be around me because you’re not on go, too, we probably shouldn’t be friends or probably be in the same room, so I just don’t be around you.”\n1 of 1 pic.twitter.com/z2R0NVtI1b\n— Green Bay Packers (@packers) August 30, 2025\nBig swing\nGeneral manager Brian Gutekunst has noted in the past, when discussing hypothetical trades such as the one he just made for Parsons, that you better be confident in the player you’re acquiring because of how much it’ll cost in trade capital and a contract.\nSo what made Gutekunst go ahead with this seismic deal?\n“The picks and the financial part of it, that’s always a lot,” Gutekunst said. “But at the same time, like I said, this is a very unique player that rarely becomes available to us. So, a little bit like X (Xavier McKinney) and Josh Jacobs, there’s just not a lot of these players at this point in their career where their best football is ahead of them, that become available … every opportunity that we have to improve the football team, now and in the future, we’re going to take a look at. Certainly, this was something we were going to take a look at, and then we were just fortunate enough that we were able to get it across the finish line.”\nNew Packers president Ed Policy has vowed to stay out of football decisions, though Gutekunst said his new boss was consulted before making such a big move.\n“Very supportive,” Gutekunst said of Policy during the process of acquiring Parsons. “Certainly, with a move like this, it’s certainly something that I would let him know that we were going down this road. When we’re signing practice squad guys, we don’t do that, but with something like this, the magnitude of the financial part of it, let him know that we’re going down this road and make sure that the organization’s prepared for it. Mark (Murphy) was exceptionally supportive during my time with him, and Ed was the same in this instance.”\nFinancial future\nHere is a look at Parsons’ contract breakdown, via Over the Cap.\n“I really like the three-year cap numbers, the first three years,” Gutekunst said. “I think that’s gonna give us the flexibility with a lot of really good players coming up that we’re still gonna be able to keep those guys. There’s no doubt when you acquire a player like this, who’s gonna take up that much of the cap, that you’re gonna have to make some choices. You always do. But again, looking at it right now, the cap numbers for ’25, ’26 and ’27, I think, are pretty solid for us and we’ll kind of see where that goes.”\n(Photo: Jayden Mack / Getty Images)"
    }
  ],
  "argos_summary": "Micah Parsons’ agent, David Mulugheta, disputes Dallas Cowboys owner Jerry Jones’ claims that the player was offered a high‑pay contract, arguing that the Cowboys’ offer was less generous and that the negotiation was misrepresented. Parsons was traded to the Green Bay Packers for a four‑year, $188 million extension, making him the highest‑paid non‑quarterback in NFL history. The agent emphasizes that the trade stemmed from a breakdown in communication and a desire for a fair deal, and that it will not affect future negotiations with other Cowboys players. The controversy highlights the importance of clear contract terms and the impact of high‑profile player moves on team dynamics and market perception.",
  "argos_id": "QBZZHX60I"
}