{
  "url": "https://nypost.com/2025/09/02/lifestyle/walmart-and-target-accused-of-removing-price-tags-amid-tariff-driven-price-hikes/",
  "authorsByline": "Adriana Diaz",
  "articleId": "4f02467e681d426fa629124558c23fad",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/09/newspress-collage-sbm9ii6zh-1756835298291.jpg?quality=75&strip=all&1756820997&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T18:43:11+00:00",
  "addDate": "2025-09-02T18:46:32.177742+00:00",
  "refreshDate": "2025-09-02T18:46:32.177744+00:00",
  "score": 1.0,
  "title": "Walmart and Target accused of sneakily removing price tags amid tariff-driven price hikes — leaving customers furious",
  "description": "They’re hoping you’ll shop even as the price tags drop.",
  "content": "They’re hoping you’ll shop even as the price tags drop.\n\nShoppers at both Walmart and Target are noticing prices missing from items’ tags — and a wave of viral social media posts from employees of these stores are proving customers’ speculations to be true.\n\nReportedly, employees at these retail giants are removing price tags so they can nonchalantly reprice items as both stores prepare for widespread price hikes in response to looming tariffs.\n\nPeople claiming to be employees from both companies have taken to social media to show themselves strategically tearing off tags from items such as underwear, jeans and children’s apparel.\n\n“Spent almost a whole 8-hour shift just doing this,” TikTokker Mykala Montalbano captioned a video of herself in a Target uniform ripping off price tags.\n\nA TikTokker named Amanda shared a video of herself doing the same during her shift at Walmart.\n\n“WALMART IS Deceiving PEOPLE. ALSO MAKING WORKERS DO THEIR DISHONEST WORK…” angrily expressed someone else.\n\n“Leave the prices on so America can see what they would’ve been without these Traiffs,” another frustrated commenter wrote.\n\nThe practice is said to allow retailers to quickly reprice items without drawing attention from shoppers — yet wise shoppers have been quick to notice this sneaky change.\n\nAt one Walmart, identical children’s outfits were seen with differing prices — some with labeled tags, others priced higher on shelf signs, Retail Brew reported.\n\nIn a statement to The U.S. Sun, Walmart explained that prices for some items are now shown on shelves or pegs instead of hang tags. Some items may be re-stickered, while others may have no visible price at all.\n\n“As we strive to provide the best value for our customers while remaining flexible and competitive, earlier this year we implemented a change to our labeling process for some items,” the chain said in a statement.\n\nWalmart did not confirm whether this change was directly linked to tariffs. However, CEO Doug McMillon acknowledged on the company’s latest earnings call that price increases are on the horizon: “As we replenish inventory at post-tariff price levels, we’ve continued to see our costs increase each week.”\n\nTarget has not responded publicly to the mounting reports, though employees and shoppers alike have documented similar activity in its stores.\n\nThe Post has reached out to both Walmart and Target for comment.\n\nAnd this mishandling of price tags isn’t the only thing getting Target customers up in arms.\n\nIt was announced in July that after a decade, the store dropped its price-matching policy with Walmart and Amazon.\n\n“Target’s Price Match Guarantee, paired with our commitment to being priced right daily, ensures guests get great prices when shopping Target,” the company said.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/09/01/lifestyle/mom-makes-heartbreaking-discovery-after-picking-daughter-up-from-party/",
    "https://nypost.com/2025/09/02/lifestyle/delta-air-lines-permanently-stops-flights-to-this-airport-in-november/",
    "https://www.the-sun.com/money/15086246/walmart-confirms-new-price-policy-shopper/",
    "https://nypost.com/2025/07/23/business/target-drops-popular-perk-for-shoppers-after-more-than-a-decade/#",
    "https://www.tiktok.com/@mykalamontalbano?refer=embed",
    "https://www.tiktok.com/tag/foryou?refer=embed",
    "https://www.tiktok.com/tag/fyp?refer=embed",
    "https://www.tiktok.com/tag/tarrifs?refer=embed",
    "https://nypost.com/2025/09/02/lifestyle/flight-from-hell-sees-six-passengers-sickened-with-mystery-illness-ground-crews-enter-in-hazmat-suits-pure-panic-mode/",
    "https://www.tiktok.com/@mykalamontalbano/video/7531199775224417567",
    "https://www.retailbrew.com/stories/2025/08/28/are-walmart-and-target-asking-employees-to-tear-the-prices-off-clothing-tags",
    "https://www.tiktok.com/tag/democrat?refer=embed",
    "https://www.tiktok.com/tag/target?refer=embed",
    "https://nypost.com/2025/03/17/us-news/nyc-target-bars-kids-under-age-18-without-adult-after-rash-of-delinquent-fights/",
    "https://www.cnbc.com/2025/08/21/walmart-wmt-q2-2026-earnings.html",
    "https://nypost.com/2025/07/23/business/target-drops-popular-perk-for-shoppers-after-more-than-a-decade/",
    "https://www.tiktok.com/tag/work?refer=embed",
    "https://nypost.com/2025/09/01/us-news/indiana-walmart-employee-is-beaten-by-mob-of-women-in-disturbing-viral-video/",
    "https://www.tiktok.com/music/Vogue-Edit-6704930089957591042?refer=embed",
    "https://www.tiktok.com/tag/walmart?refer=embed",
    "https://www.tiktok.com/@amandaleah2021?refer=embed",
    "https://www.tiktok.com/tag/worklife?refer=embed",
    "https://www.tiktok.com/music/Got-Your-Money-feat-Kelis-6737662499526543361?refer=embed",
    "https://www.tiktok.com/tag/teamlead?refer=embed",
    "https://www.tiktok.com/@amandaleah2021/video/7532692028124105997",
    "https://nypost.com/2025/08/26/opinion/trumps-tariffs-could-slice-a-stunning-4-trillion-from-the-us-deficit/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "price tags",
      "weight": 0.123876974
    },
    {
      "name": "prices",
      "weight": 0.10569885
    },
    {
      "name": "differing prices",
      "weight": 0.10487563
    },
    {
      "name": "great prices",
      "weight": 0.10477337
    },
    {
      "name": "widespread price hikes",
      "weight": 0.10395954
    },
    {
      "name": "price increases",
      "weight": 0.10382499
    },
    {
      "name": "post-tariff price levels",
      "weight": 0.09603266
    },
    {
      "name": "Target customers",
      "weight": 0.091062784
    },
    {
      "name": "labeled tags",
      "weight": 0.08041924
    },
    {
      "name": "items",
      "weight": 0.079223976
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.92431640625
    },
    {
      "name": "/Shopping/Mass Merchants & Department Stores",
      "score": 0.84130859375
    },
    {
      "name": "/Food & Drink/Food & Grocery Retailers/Other",
      "score": 0.405029296875
    }
  ],
  "sentiment": {
    "positive": 0.062350832,
    "negative": 0.6812234,
    "neutral": 0.25642583
  },
  "summary": "Walmart and Target are accused of removing price tags from items in preparation for anticipated price hikes due to tariffs. Social media posts suggest that employees are removing tags to allow them to quickly reprice items without attracting attention. The practice has led to angry customers, with some claiming to be employees from both companies. Walmart confirmed that some items are now displayed on shelves or pegs instead of hang tags and some may have no visible price at all. Meanwhile, Target announced in July that it had dropped its price-matching policy with Walmart and Amazon.",
  "shortSummary": "Walmart and Target are accused of secretly removing price tags from items ahead of tariff-driven price increases, causing customer outrage.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "249d941016f046578b72653c7c1c4aa3",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/09/01/lifestyle/mom-makes-heartbreaking-discovery-after-picking-daughter-up-from-party/",
      "text": "Mom makes heartbreaking discovery after picking daughter up from party: ‘I feel like the worst mom ever’\nLauren dropped her daughter off at a birthday party, thinking she’d have the time of her life. Only when she returned, she found a heartbreaking opposite.\n“I literally feel like the worst mom ever,” she shared.\n“I took my daughter to a birthday party, and I asked them, ‘Is it okay if I do a drop off and run an errand and I’ll be back?’ and she said, ‘Absolutely, you can definitely leave them here.’”\n“My daughter was alone”\nThe mother checked the end time of the party. The party parent said they would be finished at 5 pm.\nSo Lauren left her daughter to enjoy the party at the roller rink and returned at 4:30 pm to pick her up.\n“Nobody was there. My daughter was alone,” Lauren revealed on TikTok.\nThe party room had been locked, the lights turned off, and the party mother had vanished. She asked her daughter where everybody was.\n“She said everybody had left. I was like ‘What do you mean everybody had left?’ She said ‘they’re gone’ and my baby was there alone,” the mother explained.\n“I trusted this other mom”\nThe young girl was lucky enough that there had been a friend there who wasn’t associated with the party. It just so happened that she’d been there at the right place, at the right time.\nLauren decided to try and find some answers.\n“I called this mom eight times and she did not answer my phone call. She didn’t answer my text messages or anything so I talked to the manager and I said ‘what time did they leave?’ and they said they left an hour before that,” she recounted.\nThe party parent had left an hour and a half earlier than she had told Lauren.\nMatters only got worse.\n“I asked Ashton, I said ‘did you eat?’ She said no. Because they didn’t announce for food, they didn’t announce for cake and they did not announce for presents,” she explained.\nIt’s left Lauren feeling shocked and betrayed.\n“Now I feel like the worst mom ever, because I trusted this other mom,” she shared.\nThe comment section of her video was mixed, but many backed Lauren.\n“Dropping off kids at a birthday party is COMPLETELY NORMAL. Leaving before all the kids at the birthday party have been picked up is INSANE!” one commenter wrote.\n“Oh party mom KNEW what she did. It wasn’t an accident,” a second said.\nA third pointed out: “Red flag for her to be dodging your calls.”\nOthers were keen to hear if there was another perspective.\n“I hope my algorithm takes me to the other mom’s story time so I can hear the complete story lol,” wrote one person.\nAnother argued: “If you don’t know the parents well enough, you don’t leave your kid.”\n“There has to be more to this story… something is not adding up,” a third said.\nAt the end of the day, Lauren’s story is a reminder that as parents, we trust others with our children’s care and when that trust is broken, it cuts deep."
    },
    {
      "url": "https://nypost.com/2025/09/02/lifestyle/delta-air-lines-permanently-stops-flights-to-this-airport-in-november/",
      "text": "Delta Air Lines will permanently stop all flights to major US airport in just two months’ time\nDelta Air Lines announced that it’s cutting all flights to one major U.S. airport starting in November.\nThe airline’s flights to Midland, a major airport in Texas, will be completely phased out, with the last flights from that airport being Nov. 8, The Street reported.\nWhile Delta reported strong earnings in the second quarter of 2025, CEO Edward Bastian explained that the airline would be “adjusting our capacity to match demand.”\nRoutes being canceled include those between Austin Bergstrom International Airport (AUS) and Midland International Air and Space Port (MAF).\nThe flight route is to be discontinued largely due to a lack of demand, with data from the U.S. Department of Transportation showing that load factors were under 60% in the past year.\nDelta has consistently flown three routes daily to the airport and is now pulling out entirely, with no flights at all going to Midland from any destination.\nAccording to The Street, some have theorized that the only reason Delta was operating this route was to maintain access to gates at the Austin airport, where there’s set to be a major expansion by the airline.\n“While I am disappointed to learn that Delta Airlines will no longer be servicing our airport, it does not diminish our commitment to ensuring Midland International Air & Space Port continues to thrive and meet the needs of our residents and those traveling through the Permian Basin,” Councilwoman Robin Poole, the City Council’s liaison to the Airports Department, said in a statement.\nThose who currently have flights booked through Delta from this airport will need to book with a different carrier to get there.\nDelta will contact passengers who already have tickets through this airport to give them a refund, though passengers are encouraged not to cancel the flight before being contacted by Delta to ensure that they receive their refund.\nLuckily, Southwest Airlines operates one daily flight from Midland to Austin, which is likely going to continue as is.\nHowever, reports have shown that Midland officials are looking into ways to expand connections from the airport and will be investing tens of millions into a terminal expansion as well as improvements in customer service.\nMeanwhile, Delta will continue to have a strong presence in Austin, with new routes to Cancun and Cabo San Lucas leaving from the city."
    },
    {
      "url": "https://nypost.com/2025/09/02/lifestyle/flight-from-hell-sees-six-passengers-sickened-with-mystery-illness-ground-crews-enter-in-hazmat-suits-pure-panic-mode/",
      "text": "‘Flight from hell’ sees six passengers sickened with mystery illness, ground crews enter in hazmat suits: ‘Pure panic mode’\nCabin fever?\nA British Airways flight devolved into pure “pandemonium” after passengers and crew fell ill, prompting hazmat-suited workers to swarm the plane after an emergency landing.\n“It was definitely a flight from hell,” Melanie Wells, 61, told Kennedy News while recounting the ill-fated trip, which occurred during a flight from London, UK, to Egypt.\nThe East Sussex native and her 19-year-old daughter had planned to embark on a $10,000 all-inclusive vacation to Sharm El Sheikh — a scenic city on the Red Sea — to help boost her spirits as she hadn’t been feeling well.\n“I hadn’t been away for ages, it was definitely much-needed,” Wells recalled.\nUnfortunately, the Brit’s dreams of a relaxing trip fizzled after she became violently sick on the plane.\n“When we boarded, the temperature was so extreme that I started to feel unwell,” the vacationer alleged. “It was supersonically hot. I ended up getting a really bad headache.”\nWells initially attributed her symptoms to the heat until she noticed she wasn’t the only one feeling green around the gills.\n“About an hour and a half in the air, crew members suddenly began running down the aisle backward and forward. I didn’t know what was going on,” she said. “There was one mom whose eyes rolled into the back of her head. The crew looking after them had actually collapsed.”\nAccording to Wells, a total of six people fell ill aboard the aircraft. Wells, who felt “nauseous” with a headache, said she believes her symptoms were caused by noxious fumes on board.\nFollowing an emergency landing in Venice, Italy, ambulances and fire engines surrounded the plane. Then, emergency crews wearing hazmat suits and breathing apparatuses scrambled aboard and began administering tests to afflicted passengers and crew.\n“I was absolutely terrified,” recounted Wells. “I was thinking, have we all been inhaling toxic fumes?”\nShe added that the usually stalwart airline staff was in “pure panic mode” as well.\nUnfortunately, she claims that the flyers were kept in the dark. “At no point did the captain give us any information,” the petrified passenger lamented.\nAfter an eight-hour delay in Italy, the plane returned to London. It then landed in Egypt the next morning.\nWells dubbed the experience “horrific,” venting “we were traveling for 40 hours. We were utterly exhausted.”\nThe bedraggled traveler reportedly submitted a complaint to British Airways, which reportedly offered her nearly $3,000 in compensation for the cancelled flight, meal expenses and other hardships.\nBut Wells claimed that the carrier refused to refund her the $667 for their first night that they missed in Egypt due to the delays.\n“BA have performed in the most cavalier manner,” she declared. “The distress and trauma we went through, it was utterly traumatic. It ruined the start of our holiday.”\nReps for the airline have yet to specify the source of the inflight illness, instead claiming the aircraft was diverted “as a precaution because of a technical issue.”\n“We’ve apologized to our customers for their experience and have offered compensation accordingly,” said the spokesperson.\nThey added that there was no evidence of fumes on board and that the plane was inspected and put back in service the next day.\nThe Post has reached out to BA for comment."
    },
    {
      "url": "https://nypost.com/2025/09/01/us-news/indiana-walmart-employee-is-beaten-by-mob-of-women-in-disturbing-viral-video/",
      "text": "Indiana Walmart employee is beaten by mob of women in disturbing viral video\nA shocking viral video shows a group of irate women beating up an Indiana Walmart employee as her co-workers desperately try to break up the mayhem.\nThe disturbing footage, filmed on Friday at an Indianapolis Walmart and posted to Facebook by witness Kind Butler, shows a woman in black restraining the female employee as two other women attack her at the checkout aisle.\nAs the employee is being held down, a woman in a pink shirt is seen savagely raining punches down on the victim, as another suspect starts to viciously stomp on her.\nThe mayhem escalates as a blood-curdling scream rings out in the background: “Where he at, bitch?!”\nTwo bystanders then rush to the employee’s aid and struggle to pry the woman in pink off.\nHowever, as they attempt to break up the violence, a male suspect jumps in and kicks the downed employee while another woman in a blue-and-white shirt continues to wail on the victim with punches.\nA co-worker eventually is able to help the victim to their feet, but as they begin to separate, the woman in pink hurls an object, then yanks the employee by the hair and keeps swinging.\nThe male suspect then attempts to re-enter the chaos, but is stopped by Walmart staff.\nFinally, workers are able to pull the employee away from the violent mob, while two good Samaritans step in to hold back her attackers as they hurl insults at the victim before the video comes to an end.\n“It was instantly on site,” Butler, who shops at the Walmart almost daily, told Fox 59.\n“There wasn’t any questioning, no anything. Just as soon as they saw the girl, the whole family came over and started beating her up.”\nButler, however, shared that before the brawl broke out, he overheard relatives of an alleged rape victim searching for someone they believed was connected to the assault.\nThe victim of the attack, Tikerra Hicks, said that prior to being attacked at work, she had been getting calls about how her friend allegedly raped another friend.\nHicks then shared that she was ambushed by the mob moments after coming out of the bathroom.\n“I just hear, ‘There she go’ and then boom on the side of my head I feel somebody hitting me,” Hicks told Fox 59.\nHicks claimed to have known the woman accusing her friend of rape for years, but was left puzzled as to why the mob targeted her, since she was not involved in the incident.\n“(The alleged rape) have nothing to do with me,” Hicks shared.\n“I wasn’t there, even if it did happen, to protect he. And I wasn’t there to defend him either.”\nA Beech Grove police report for a rape investigation obtained by Fox 59 allegedly named Hicks as an “other person” in the document.\nHowever, Hicks said those allegations have been fabricated and she hasn’t “talked to any officers besides after the fight.”\nThe beaten employee told the outlet that she was suspended by Walmart after the brawl.\nThe Post has reached out to Walmart for comment."
    },
    {
      "url": "https://nypost.com/2025/07/23/business/target-drops-popular-perk-for-shoppers-after-more-than-a-decade/",
      "text": "Target drops popular perk for shoppers after more than a decade\nTarget is dropping its price-matching policy with rivals Walmart and Amazon after more than a decade as the company aims to reposition itself amid slowing sales and competitive pressure.\nUnder its new Price Match Guarantee policy, taking effect July 28, customers of the Minneapolis-based retail giant will be able to price match other Target products in the store or online within 14-days of a purchase, but the policy will no longer apply to its rivals.\nThe company said the decision was driven by the fact that its “guests overwhelmingly price match Target and not other retailers.”\n“Target’s Price Match Guarantee, paired with our commitment to being priced right daily, ensures guests get great prices when shopping Target,” the company said.\nTarget rolled out its very first price match policy, called the Low Price Promise, in 2009.\nIf a customer found a lower price at another brick-and-mortar store, the company matched it.\nEventually, the company expanded this policy, matching prices from certain online retailers including Amazon.com, Walmart.com, BestBuy.com and ToysRUs.com during the holiday season.\nIn 2013, the company began price matching top online retailers year-round, which then-CEO Gregg Steinhafel said that the move effectively made the company an “unbeatable value” compared to its competitors in the highly competitive sector.\nThe recent change, however, comes as CEO Brian Cornell works to turn around the company, which has been trying to drum up traffic and return to growth in back-to-back quarters. However, Cornell characterized the environment over the past few months in particular as “highly challenging.”\nTarget missed Wall Street expectations and cut its guidance for the year during its latest earnings call in May as it contends with tariff uncertainty, declining consumer confidence and backlash over its rollback of its diversity, equity and inclusion (DEI) efforts.\nTo try and get back to long-term profitable growth, the company developed a new multi-year growth initiative, called Enterprise Acceleration Office, and made changes to its executive suite.\nThe Enterprise Acceleration Office initiative, led by Target Chief Operating Officer Michael Fiddelke, will specifically help the company operate more nimbly, “creating conditions for speed, adaptability, innovation and resilience,” Cornell said.\nTarget said in its latest earnings that it expects a low-single digit decline in sales for fiscal 2025, down from its previous forecast of net sales growth of about 1%."
    },
    {
      "url": "https://nypost.com/2025/08/26/opinion/trumps-tariffs-could-slice-a-stunning-4-trillion-from-the-us-deficit/",
      "text": "Here’s another unappreciated benefit of President Donald Trump’s tariffs: They’re now projected to slice the federal deficit by a whopping $4 trillion over the next decade.\nThat’s the latest estimate by the nonpartisan Congressional Budget Office, which projects new tariff revenue will fuel a $3.3 trillion drop in federal red ink through 2035, plus another $700 billion in interest-cost savings.\nThe new figures are based, in part, on the new revenue now streaming in to Uncle Sam’s coffers: CBO now sees tariff proceeds totaling $200 billion this year, up from the $80 billion it projected as recently as January.\nJuly revenues alone were stunning, setting a record at nearly $30 billion — 242% more than the tariff take in July 2024.\nAll told, the $4 trillion slashed from the deficit eclipses the CBO’s official projection that One Big Beautiful Bill Act meant a $3.4 trillion bump — an estimate grounded in the fact that OBBBA prevented a enormous tax hike.\nThat’s good news: Not only does a lower deficit reduce the pressure on future budgets, it can also juice up the economy, pushing down interest rates and freeing money for the private sector.\nAnd all that would be on top of all the other economic benefits of Trump’s program, like boosting US-based supply-chain sources, creating jobs and sparking investment in American businesses.\nTrump’s deals — with the European Union, Japan, the Philippines, South Korea, Vietnam, the United Kingdom and, in part, China — have also gotten countries to lower their tariffs and open their markets to US goods and to commit to funneling trillions into America via purchases and investments.\nThe prez has also used the threat of tariffs to press for more cooperation on non-economic issues, from border control to undermining Vladimir Putin’s war machine.\nMeanwhile, the economy is humming along, with low inflation and healthy growth.\nYes, tariffs are a form of taxation, though there’s considerable debate on who exactly pays how much of this tax — and at current levels are likely to mean less overall economic pain than, say, the income-tax hikes that OBBBA aborted.\nThe final verdict on Trump’s tariffs and the rest of his program is far from in.\nBut so far the results are pretty good.\nJust don’t expect his critics to admit any part of it."
    },
    {
      "url": "https://nypost.com/2025/03/17/us-news/nyc-target-bars-kids-under-age-18-without-adult-after-rash-of-delinquent-fights/",
      "text": "NYC Target bars kids under age 18 without adult after rash of delinquent fights\nA Brooklyn Target has banned kids under 18 from shopping at the store without adult supervision — just the latest business in the area using drastic measures to curb delinquent behavior.\nThe Target — located in the Triangle Junction mall on the corner of Flatbush Avenue and Avenue H — recently began posting security guards at its front doors and carding anybody who doesn’t look of age, a store worker told The Post.\n“All guests under the age of 18 must be accompanied by an adult at this Target store,” a sign stationed inside the door reads.\nAnybody who doesn’t meet the age requirement and is without an adult is banned, and those who sneak in and get caught are escorted out.\nThe measure was reportedly put in place to cut down on recent fights and other rowdy behavior among groups of teens who have been loitering in the store and around the mall, said a 25-year-old security guard working the Target’s door Monday.\n“It’s just regular. They play around. They come in groups, you know, and a lot of kids — and they’re not really friends,” the guard told The Post.\nThe teen problem has less to do with shoplifting — a rampant problem for Target and other stores that has grabbed headlines in recent years — and more to do with general delinquent behavior and loitering, he explained.\n“We try to make sure everybody doesn’t have a hangout spot after school,” the guard said.\nHe said that just the other day, he had to intervene in a fight that began on the store’s second floor and eventually spilled down into its basement lobby.\nThe dispute only heated up when he and colleagues stepped in to throw the rowdy kids out, he said.\n“They started cursing at each other. We sent them back down the stairs. One of them threw a punch. Stuff like that,” he said. “I’m assuming it’s the reason why this [age policy] happened in the first place. Because it makes guests uncomfortable.\n“We try our best,” he said.\nSome customers are fully onboard with the new rules.\n“I kind of think it’s a good idea because you can’t predict what these kids are going to do, especially after school,” said 20-year-old Kaela Ramsey, who was shopping at the Target with her three teenage nieces.\n“They’re not going to no activities. They aren’t going to no programs or nothing. I see a lot of kids come in here and do a lot of nonsense,” she said. “I’ve seen so many people get jumped. I’ve seen kids get milked — they throw milk on the kids, fighting with milk.”\nBut her 15-year-old niece, Kayla, called the age restriction “stupid.\n“Not every kid comes in here and destroys Target and stuff,” the teen said, explaining she was even thrown out recently with an underage friend who was trying to buy “emergency” medication for her mother.\n“I feel like they need to give everybody a fair opportunity to shop,” Kayla said. “I feel like it’s very dumb.”\nCustomer Festus Adogu, 80, who was in the Starbucks cafe at the Target, said that if the kids “sit down, do their work, alright.\nBut when they “play and shout, [workers] call police all the time.”\nThe Target is just down the street from a McDonald’s which last month barred anybody under 20 from entering without a parent — and hired a bouncer to work the door and card everyone passing through.\nThe fast-food location rolled out the drastic measures after enduring more than a year of harassment from groups of kids — upwards of 20 at a time — who would roll in after school to trash the place and snatch food from customers.\nThe final straw came after one group charged in wearing ski masks and broke a glass door.\nRetail crime has been on the decline in the neighborhood in recent years, NYPD data shows, but some businesses still remain a notorious hotspot for bad behavior.\nMore than 100 911 calls were made from that McDonald’s in each of the past three years, and so far this year, there have been 29.\nThe Target guard said while he didn’t like that businesses have to card kids, he knows managers have little choice — but that it was a shame well-behaved kids now have to miss out.\n“I know when I was in high school, I was interested in getting some fast food after school,” he said.\n“I get it, I understand it,” he said of the restrictions. “But the kids who actually took $10 from their mom in the morning time to look forward to get something to eat after school, after a long day. So I feel bad for those kids.”\nTarget did not respond to a Post request for comment Monday."
    },
    {
      "url": "https://www.the-sun.com/money/15086246/walmart-confirms-new-price-policy-shopper/",
      "text": "WALMART has confirmed that individual price tags are being removed from certain items in its stores.\nIt comes after both Walmart and Target employees have claimed on social media that they've been instructed to pull them off.\nWalmart confirmed to The U.S. Sun that its labeling process has been restructured as it looks toward evolving prices once tariffs fully come into play.\n“As we strive to provide the best value for our customers while remaining flexible and competitive, earlier this year we implemented a change to our labeling process for some items,\" the chain said in a statement.\n\"Customers will now see prices for some items displayed on peg or shelf instead of hang tags.\n\"Some hang tags will also be stickered versus printed.\nRead more in Money\n\"We remain committed to providing the low prices our customers expect from Walmart,\" the statement added.\nIt did not confirm if the policy change was directly tariff related.\nWalmart confirmed the change after social media videos claimed to show employees having to rip off the tags.\nIn one TikTok post, a video of a woman claiming to be a Target employee shows her ripping the tags off of women's underwear in the store.\nMost read in Money\n\"[H]aving to rip off EVERY individual price ... [S]pent almost an 8 hour shift just doing this,\" the caption read.\nSimilar TikToks have popped up from Walmart workers, too.\nA woman, allegedly a Walmart employee, is seen ripping off tags from children's clothing in one video.\n\"Removing the prices when working freight,\" the post said.\n\"I'm over it.\"\nThe caption claimed the move was being made as a result of Trump's sweeping tariff policies.\n\"Can it just come in without tags already,\" it asked.\n\"Processing/ working freight takes longer just because of the tariffs and prices going up.\"\nCustomers have noticed a change, too.\nOn Facebook, a woman claimed that there were no price tags on any of the clothes and that a worker said she'd now have to check their app to see the prices.\n\"What in the world are we coming to,\" she said.\nAnother post claimed that tags were missing.\n\"Anyone else notice the price tags being removed from items at Walmart,\" the user wrote on Facebook.\n\"Last weeks workout shorts in the sale aisle were $3. Today they are $6. All other items I checked with the app had their prices increase too. Is this due to boycotts, tariffs or both?\"\nMany commenters claimed it was due to the tariffs.\n\"It’s the tariffs,\" one user said.\n\"Walmart decided to not retag everything so they are just physically removing it covering the tags from the original manufacturer.\"\n\"Yes they are doing that all over the country,\" another commented.\n\"Got to love those tariffs.\"\nJaeme Laczkowski, Walmart’s director of media relations, told recently told Retail Brew that Walmart started a new labeling process for its fashion department in May which may have led to employees removing tags, and that some, but not all, of the prices were changed.\nWalmart CEO Doug McMillon last week told investors that increased prices at the chain may still come during its second-quarter earnings call.\nYet the chain said it had so far been able to mitigate the tariff extra costs and back-to-school products had been kept cheaper than last year.\n\"We've continued to see our costs increase each week, which we expect will continue into the third and fourth quarters,\" he said.\n\"The impact of tariffs has been gradual enough that any behavioral adjustments by the customer have been somewhat muted.\"\nRead More on The US Sun\nTrump had previously called on Walmart to \"eat the tariffs\" after the bob-box retailer complaining about increased costs.\nLast week, Walmart Chief Financial Officer John David Rainey admitted that despite tariff fears it had “ultimately realized lower markups than anticipated.”\nWalmart's secret shopper policy\nSOME retailers have hired so-called secret shoppers to go undercover and review the customer experience for market research.\nHowever, Walmart has taken a strict stance against the programs.\nWalmart's corporate website explains, \"Mystery shopping, sometimes referred to as secret shopping, is where an individual' acts' like a customer and evaluates services at a business.\n\"Walmart does not utilize these services or hire associates to perform services on behalf of other retailers or companies.\nHowever, scammers take advantage of these types of programs by sending fraudulent solicitations via mail, text, or email to entice consumers to evaluate the retail experience.\nOften times these offers of employment are accompanied by a fake check made out for a large amount of money or otherwise offer immediate employment with a good salary and minimal effort required.\""
    },
    {
      "url": "https://www.cnbc.com/2025/08/21/walmart-wmt-q2-2026-earnings.html",
      "text": "Walmart on Thursday raised its full-year earnings and sales outlook as its online business posted another quarter of double-digit gains, even as the company said costs are rising from higher tariffs.\nThe big-box retailer topped Wall Street's quarterly sales estimates but fell short of earnings expectations, the first time it missed on quarterly earnings since May 2022. The company said it felt pressure on profits for the period, including from some one-time expenses, such as restructuring costs, pricier insurance claims and litigation settlements.\nWalmart said it now expects net sales to grow between 3.75% and 4.75% for the fiscal year, up from its previous expectations for 3% to 4%. It raised its adjusted earnings per share outlook slightly to $2.52 to $2.62, up from a prior range of $2.50 to $2.60 per share.\nIn an interview with CNBC, Chief Financial Officer John David Rainey said the company is working hard to keep prices low – including speeding up imports from overseas and stepping up the number of Rollbacks, or limited-time discounts, in its stores.\n\"This is managed on an item-by-item and category-by-category basis,\" he said. \"There are certainly areas where we have fully absorbed the impact of higher tariff costs. There are other areas where we've had to pass some of those costs along.\"\nBut he added \"tariff-impacted costs are continuing to drift upwards.\"\nEven so, Rainey said Walmart hasn't seen a change in customer spending. For example, sales of private-label items, which typically cost less than national brands, were roughly flat year over year, he said.\n\"Everyone is looking to see if there are any creaks in the armor or anything that's happening with the consumer, but it's been very consistent,\" he said. \"They continue to be very resilient.\"\nYet on the company's earnings call, CEO Doug McMillon said middle- and lower-income households have been more sensitive to tariff-related price increases, particularly in discretionary categories.\n\"We see a corresponding moderation in units at the item level as customers switch to other items, or in some cases, categories,\" he said.\nHere's what the big-box retailer reported for the fiscal second quarter compared with what Wall Street expected, according to a survey of analysts by LSEG:\n- Earnings per share: 68 cents adjusted vs. 74 cents expected\n- Revenue: $177.40 billion vs. $176.16 billion\nWalmart shares fell 4% in morning trading Thursday.\nWalmart's net income jumped to $7.03 billion, or 88 cents per share, in the three-month period that ended July 31, compared with $4.50 billion, or 56 cents per share, in the year-ago quarter. Adjusting for one-time items, including legal charges, Walmart reported adjusted earnings per share of 68 cents.\nRevenue rose from $169.34 billion in the year-ago quarter.\nComparable sales for Walmart U.S. climbed 4.6% in the second quarter, excluding fuel, compared with the year-ago period, as both the grocery and health and wellness category saw strong growth. That was higher than the 4% increase that analysts expected. The industry metric, also called same-store sales, includes sales from stores and clubs open for at least a year.\nAt Sam's Club, comparable sales jumped 5.9% excluding fuel, higher than the 5.2% that analysts anticipated.\nE-commerce sales jumped 25% globally and 26% in the U.S., as both online purchases and advertising grew. In the U.S., Walmart said sales through store-fulfilled delivery of groceries and other items grew nearly 50% year over year, with one-third of those orders expedited. The company charges a fee for some of those faster deliveries, and others are included as a benefit of its subscription-based membership program, Walmart+.\nIts global advertising business grew 46% year over year, including Vizio, the smart TV maker it acquired for $2.3 billion last year. Its U.S. advertising business, Walmart Connect, grew by 31%.\nAs Walmart's online business drums up more revenue from home deliveries, advertising and commissions from sellers on its third-party marketplace, e-commerce has become a profitable business. The company marked a milestone in May — posting its first profitable quarter for its e-commerce business in the U.S. and globally.\nRainey said Thursday that Walmart doubled its e-commerce profitability in the fiscal second quarter from the prior quarter.\nIn the U.S., shoppers both visited Walmart more and spent more on those trips during the quarter. Customer transactions rose 1.5% year over year and the average ticket increased 3.1% for Walmart's U.S. business.\nAs the largest U.S. retailer, Walmart offers a unique window into the financial health of American households. As higher duties have come in fits and starts — with some getting delayed and others going into effect earlier this month — Wall Street has tried to understand how those costs will ripple through the U.S. economy.\nWalmart warned in May that it would have to raise some prices due to higher levies on imports, even with its size and scale. The company's comments drew the ire of President Donald Trump, who said in a social media post that Walmart should \"EAT THE TARIFFS.\"\nAbout a third of what Walmart sells in the U.S. comes from other parts of the world, with China, Mexico, Canada, Vietnam and India representing its largest markets for imports, Rainey said in May.\nAccording to an analysis by CNBC of about 50 items sold by the retailer, some of those price changes have already hit shelves. Items that rose in price at Walmart over the summer included a frying pan, a pair of jeans and a car seat.\nRainey on Thursday declined to specify items or categories where Walmart had increased prices, saying the company is \"trying to keep prices as low as we can.\"\nHe said one of the company's strategies has been bringing in inventory early, particularly for Sam's Club as it gets ready for the second half of the fiscal year and its crucial holiday season. At the end of the quarter, inventory was up about 3.5% at Sam's Club, Rainey said. It was up 2.2% for Walmart U.S.\nOn the company's earnings call, McMillon said the impact of tariffs has been \"gradual enough that any behavioral adjustments by the customer have been somewhat muted.\"\n\"But as we replenish inventory at post-tariff price levels, we've continued to see our costs increase each week, which we expect will continue into the third and fourth quarters,\" he said.\nYet even with higher costs from tariffs, Walmart has fared better than its retail competitors as it has leaned into its reputation for value, competed on faster deliveries to customers' homes and attracted more business from higher-income households.\nThe Arkansas-based retailer's performance has diverged sharply from rival Target, which posted another quarter of sales declines on Wednesday and named the new CEO who will be tasked with trying to turn around the company.\nWalmart has gained from Target's struggles. It has followed the Target playbook by launching more exclusive and trend-driven brands, including grocery brand BetterGoods and activewear brand Love & Sports. It has also expanded its third-party marketplace to include prestige beauty brands and more.\nSales of general merchandise, items outside of the grocery department, were a bright spot for Walmart in the fiscal second quarter, Rainey said. That category struggled during peak inflation in recent years, as consumers spent less on discretionary items because of rising grocery bills.\nComparable sales for general merchandise rose by a low single-digit percentage and accelerated throughout the quarter, Rainey told CNBC. He added clothing and fashion sales \"really shined for us.\""
    },
    {
      "url": "https://nypost.com/2025/07/23/business/target-drops-popular-perk-for-shoppers-after-more-than-a-decade/#",
      "text": "Target drops popular perk for shoppers after more than a decade\nTarget is dropping its price-matching policy with rivals Walmart and Amazon after more than a decade as the company aims to reposition itself amid slowing sales and competitive pressure.\nUnder its new Price Match Guarantee policy, taking effect July 28, customers of the Minneapolis-based retail giant will be able to price match other Target products in the store or online within 14-days of a purchase, but the policy will no longer apply to its rivals.\nThe company said the decision was driven by the fact that its “guests overwhelmingly price match Target and not other retailers.”\n“Target’s Price Match Guarantee, paired with our commitment to being priced right daily, ensures guests get great prices when shopping Target,” the company said.\nTarget rolled out its very first price match policy, called the Low Price Promise, in 2009.\nIf a customer found a lower price at another brick-and-mortar store, the company matched it.\nEventually, the company expanded this policy, matching prices from certain online retailers including Amazon.com, Walmart.com, BestBuy.com and ToysRUs.com during the holiday season.\nIn 2013, the company began price matching top online retailers year-round, which then-CEO Gregg Steinhafel said that the move effectively made the company an “unbeatable value” compared to its competitors in the highly competitive sector.\nThe recent change, however, comes as CEO Brian Cornell works to turn around the company, which has been trying to drum up traffic and return to growth in back-to-back quarters. However, Cornell characterized the environment over the past few months in particular as “highly challenging.”\nTarget missed Wall Street expectations and cut its guidance for the year during its latest earnings call in May as it contends with tariff uncertainty, declining consumer confidence and backlash over its rollback of its diversity, equity and inclusion (DEI) efforts.\nTo try and get back to long-term profitable growth, the company developed a new multi-year growth initiative, called Enterprise Acceleration Office, and made changes to its executive suite.\nThe Enterprise Acceleration Office initiative, led by Target Chief Operating Officer Michael Fiddelke, will specifically help the company operate more nimbly, “creating conditions for speed, adaptability, innovation and resilience,” Cornell said.\nTarget said in its latest earnings that it expects a low-single digit decline in sales for fiscal 2025, down from its previous forecast of net sales growth of about 1%."
    }
  ],
  "argos_summary": "Walmart and Target have begun removing price tags from items, a move linked to anticipated tariff‑driven price increases. Employees have posted videos showing them ripping off tags to reprice goods more quickly, while both chains say the change is part of a new labeling process. Walmart confirmed the policy shift and noted rising costs from tariffs, while Target has not publicly responded. The practice has sparked customer frustration and raised questions about transparency and pricing strategy amid ongoing trade tensions.",
  "argos_id": "SMU8NNRK6"
}