{
  "url": "https://www.forbes.com/sites/williamdunkelberg/2025/09/02/everyone-wants-lower-interest-rates-right/",
  "authorsByline": "William Dunkelberg",
  "articleId": "67391606669a48d982f1d02cd8d85dfc",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/68b6e98e162e16da84ec0795/0x0.png?format=png&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T13:00:11+00:00",
  "addDate": "2025-09-02T13:17:19.918017+00:00",
  "refreshDate": "2025-09-02T13:17:19.918022+00:00",
  "score": 1.0,
  "title": "Everyone Wants Lower Interest Rates, Right?",
  "description": "Not everyone is a debtor, hoping for lower interest rates on loans. The flip side is that there is no loan without a lender, someone collecting...",
  "content": "Not everyone is a debtor, hoping for lower interest rates on loans. The flip side is that there is no loan without a lender, someone collecting the interest rate revenue. U.S. Treasury Bonds are loans to the government and are held as assets in individual investment portfolios. Banks lend out their depositors’ money and share the interest revenue from the loans with their depositors. Most small business loans are made by commercial banks; many are small, community banks.\n\nIn general, interest rates are set by financial markets, not by the Federal Reserve, whose job it is to enforce financial regulations and maintain orderly financial markets. The Fed does set its policy rate, which specifies how much it will pay on excess reserves that are deposited by banks at the Fed and not otherwise loaned out. The higher this rate, the more inclined banks are to keep safe reserves at the Fed rather than make a more risky loan to a real business that will put the funds to work.\n\nEvery month, NFIB surveys a random sample of its small business members. The average interest rate reported on their most recent loan over the past 50 years is shown in Chart 1. The graph illustrates the damaging effects of inflation. Owners paid nearly 20% interest (which means the projects financed must have earned far higher rates of return) in the 1980s, and as little as 4% in 2020. Owners are active searchers for favorable loan terms when they need a loan and, when interest rates are changing, look for opportunities to refinance with more favorable terms. More than half of all small firms use at least two financial institutions for their financial services (Bank Competition, NFIB, 2005). Mortgage interest rates are very sensitive to Fed policy because mortgages are very long-term loans, and Chart 1 shows how volatile interest rates can be over time.\n\nWhen asked to identify their most important business problem from a list of nine issues (Chart 2), 26% of owners selected labor costs, followed closely by government regulations and red tape, chosen by 22%. Taxes ranked third with 14%, followed by insurance cost and availability, with 11% of the votes. Inflation and labor quality tied at 9%.\n\nBy industry, firms in agriculture and retail sales most frequently identified finance and interest rates as their single most important problem (just 6% and 5% respectively), a tribute to the financial industry because all firms must finance their operations, and apparently the markets do a pretty good job of providing the needed financial services.\n\nCurrently, the Fed is under fire from all sides due to its “dual mandate” (Congress told the Fed to maintain maximum employment and stable prices at the Fed’s annual 2% inflation target, requiring contradictory policies at times). Achieving full employment is best as a responsibility of fiscal policy, while inflation is the province of monetary policy. Low inflation brings low interest rates. The Fed has a tough job at times, and now is one of those times, making sure they achieve both sides of their mandate.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "interest rates",
      "weight": 0.12365479
    },
    {
      "name": "Lower Interest Rates",
      "weight": 0.120985255
    },
    {
      "name": "low interest rates",
      "weight": 0.120985255
    },
    {
      "name": "lower interest rates",
      "weight": 0.120985255
    },
    {
      "name": "Mortgage interest rates",
      "weight": 0.11792319
    },
    {
      "name": "Most small business loans",
      "weight": 0.098237365
    },
    {
      "name": "favorable loan terms",
      "weight": 0.093084894
    },
    {
      "name": "Fed policy",
      "weight": 0.088698655
    },
    {
      "name": "loans",
      "weight": 0.08669106
    },
    {
      "name": "financial markets",
      "weight": 0.08049509
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Banking/Other",
      "score": 0.62890625
    },
    {
      "name": "/Finance/Credit & Lending/Loans",
      "score": 0.62890625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.426025390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.349853515625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.300537109375
    }
  ],
  "sentiment": {
    "positive": 0.13350475,
    "negative": 0.30056387,
    "neutral": 0.56593144
  },
  "summary": "The article discusses the importance of interest rates to lenders, not the Federal Reserve, who set them. Most small business loans are made by commercial banks and many are small, community banks. The Federal Reserve does set its policy rate on excess reserves deposited by banks at the Fed and not otherwise loaned out. This higher this rate encourages banks to keep safe reserves at the bank rather than lending risky loans. The average interest rate reported on their most recent loan over the past 50 years is shown in Chart 1. The article also discusses the impact of inflation on mortgage interest rates, highlighting how volatile interest rates can be over time. It also highlights the difficulty of the Fed's dual mandate to maintain maximum employment and stable prices at its annual 2% inflation target.",
  "shortSummary": "Despite interest rate concerns, many small business owners seek favorable loan terms based on revenue generated by the Fed’s interest rate policies.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "da276075c501402a9900c8e6215387bc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article explains that while borrowers seek lower interest rates, lenders—such as banks and the government—must earn revenue from those rates. It highlights how the Federal Reserve’s policy rate influences banks’ willingness to lend, especially for long‑term mortgages, and shows historical small‑business loan rates reflecting inflationary pressures. Small firms often use multiple banks and actively refinance when rates change, with finance and interest rates being a top business concern, particularly in agriculture and retail. The Fed’s dual mandate to maintain employment and price stability creates tension, as low inflation supports low rates but may conflict with employment goals.",
  "argos_id": "TDI5LPM6M"
}