{
  "url": "https://finance.yahoo.com/news/acen-australias-900-mw-robbins-010000132.html?_guc_consent_skip=1756861701",
  "authorsByline": "PR Newswire",
  "articleId": "1742fd2357c34720aa3dac226f08ffeb",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/098f399d2623df00b61b393b8f411d76",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T01:00:00+00:00",
  "addDate": "2025-09-03T01:09:53.712182+00:00",
  "refreshDate": "2025-09-03T01:09:53.712183+00:00",
  "score": 1.0,
  "title": "ACEN Australia's 900 MW Robbins Island wind project secures federal approval",
  "description": "ACEN Australia's 900 MW Robbins Island Wind project has secured Federal Government approval – a major step in unlocking one of the largest private investments in Tasmania's history and positioning the state as a major player in Australia's clean energy transition.",
  "content": "• Community and environment – AUD$ 27M benefits program and eight years of rigorous environmental studies.\n\nSYDNEY, Sept. 3, 2025 /PRNewswire/ -- ACEN Australia's 900 MW Robbins Island Wind project has secured Federal Government approval – a major step in unlocking one of the largest private investments in Tasmania's history and positioning the state as a major player in Australia's clean energy transition.\n\nThe AUD$3 billion development is expected to generate enough power for up to 500,000 homes, create up to 400 construction jobs, and deliver more than AUD$30 million annually into the Tasmanian economy, alongside a AUD$27 million community benefits program for the Circular Head region.\n\nACEN Australia Managing Director, David Pollington, said the milestone was a key achievement for ACEN, and important for the Tasmanian economy, the nation's energy transition and the renewable energy industry more broadly.\n\n\"The decision shows that large, complex projects can be delivered responsibly, balancing overall impacts and conserving biodiversity, with the need for clean energy to address climate change,\" he said.\n\n\"It comes at a time when Australia faces a stalling energy transition and looming power shortages as coal exits the system.\n\n\"It also reflects the depth and rigour of ACEN's work to address the assessment criteria and scrutiny applied through the approvals process.\"\n\nThe approval follows more than eight years of assessment by all levels of government, including detailed studies of Robbins Island's natural values.\n\nThis has produced the most comprehensive understanding of its plants and animals to date, giving confidence the project can proceed and manage any environmental risks.\n\nThe project will deliver jobs, training and long-term community benefits. Wind then provides low cost baseload generation backed by hydro. As a result, hydro will be able to play to its real strength as flexible on-demand generation and storage, rather than a traditional baseload generation.\n\nThe project will also help the state and federal governments reach legislated emissions commitments, including Tasmania's goal to double clean energy production by 2040, half by 2030. The project is expected to start generating power in 2030.\n\n\"This is particularly important for Victoria, which will lose half of its coal generation by 2035, making investment in Marinus Link and the North West Transmission Developments a smart and timely move,\" Mr. Pollington added. Three weeks ago, the Federal Governments of Victoria and Tasmania reached Final Investment Decision to proceed with the new Marinus Link Stage 1 undersea transmission line, allowing new generation in Tasmania to serve the growing energy needs of Victoria and the city of Melbourne.",
  "medium": "Article",
  "links": [
    "https://mma.prnewswire.com/media/1934929/ACEN_LOGO_HORIZONTAL_FULL_COLOR_RGB_Logo.html"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "clean energy",
      "weight": 0.08459902
    },
    {
      "name": "clean energy production",
      "weight": 0.08147976
    },
    {
      "name": "ACEN Australia",
      "weight": 0.07957885
    },
    {
      "name": "ACEN Australia Managing Director",
      "weight": 0.07715885
    },
    {
      "name": "new generation",
      "weight": 0.073708646
    },
    {
      "name": "low cost baseload generation",
      "weight": 0.071649276
    },
    {
      "name": "Robbins Island",
      "weight": 0.06901759
    },
    {
      "name": "Federal Government approval",
      "weight": 0.064046934
    },
    {
      "name": "Tasmania",
      "weight": 0.06213786
    },
    {
      "name": "federal approval",
      "weight": 0.062096823
    }
  ],
  "topics": [
    {
      "name": "Australia"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Energy & Utilities/Renewable & Alternative Energy",
      "score": 0.8935546875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.8447265625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.7900390625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.71923828125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.615234375
    },
    {
      "name": "/Business & Industrial/Energy & Utilities/Electricity",
      "score": 0.456298828125
    },
    {
      "name": "/News/Local News",
      "score": 0.4345703125
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.376953125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.305419921875
    }
  ],
  "sentiment": {
    "positive": 0.7671542,
    "negative": 0.03498072,
    "neutral": 0.19786505
  },
  "summary": "ACEN Australia's 900 MW Robbins Island Wind project has been approved by the Federal Government, a significant step towards unlocking one of the largest private investments in Tasmania's history. The development is expected to generate enough power for up to 500,000 homes, create up to 400 construction jobs, and deliver over AUD$30 million annually into the Tasmanian economy. The decision follows eight years of rigorous environmental studies. The project will deliver jobs, training, and long-term community benefits. It is also expected to help the state and federal governments reach legislated emissions commitments.",
  "shortSummary": "ACEN Australia's 900 MW Robbins Island wind project secured federal approval, aiming to boost the Tasmanian economy, reduce carbon dioxide, and meet climate change commitments.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "190eaf98f4a74dc484ae6c312da06f26",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "ACEN Australia's 900 MW Robbins Island wind project has received federal approval, marking a significant step in Tasmania’s clean energy transition and one of the largest private investments in the state. The AUD 3 billion development will supply power for up to 500,000 homes, create up to 400 construction jobs, and inject more than AUD 30 million annually into the Tasmanian economy, alongside a AUD 27 million community benefits program. The project is expected to begin generating power in 2030, helping Australia meet emissions targets and address looming power shortages as coal exits the system.",
  "argos_id": "TKM3J60L3"
}