{
  "url": "https://www.livescience.com/planet-earth/geology/giant-sandy-slug-crawls-through-floodplains-in-kazakhstan-but-it-could-soon-be-frozen-in-place-earth-from-space",
  "authorsByline": "Harry Baker",
  "articleId": "ade24fb9b6cd49a2882e011254d68052",
  "source": {
    "domain": "livescience.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://cdn.mos.cms.futurecdn.net/Bh6CJAnh9t4EFKdeoqE5Yn-1280-80.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T07:00:00+00:00",
  "addDate": "2025-09-02T07:06:49.212751+00:00",
  "refreshDate": "2025-09-02T07:06:49.212753+00:00",
  "score": 1.0,
  "title": "Giant sandy 'slug' crawls through floodplains in Kazakhstan, but it could soon be frozen in place — Earth from space",
  "description": "A 2022 astronaut photo shows a peculiar, slug-shaped dune field in the heart of the Kazakh Steppe. Signs of vegetation among the sand suggest these dunes are in the process of being fixed in place.",
  "content": "Where is it? Oyyl dune field, Kazakhstan [49.0485097, 54.776320616] What's in the photo? A large field of sand dunes in the shape of a slug Who took the photo? An unnamed astronaut on board the International Space Station When was it taken? June 15, 2022\n\nThis intriguing astronaut photo shows off an oddly shaped field of dunes in Kazakhstan that strongly resembles a giant slug meandering across the landscape. The mollusk mimic is covered with clusters of vegetation, suggesting its sands are slowly being frozen in place.\n\nThe dune field is located around 175 miles (280 kilometers) northeast of the Caspian Sea in the western reaches of the Kazakh Steppe — a vast region of open grassland covering north Kazakhstan and parts of Russia. It is sandwiched between the village of Oyyl to the west (left in the image) and a large floodplain to the east (right in the image).\n\nIt covers an area of around 75 square miles (190 square kilometers), around three times the size of Manhattan, and measures approximately 13 miles (21 km) across at its widest point, according to .\n\nDune fields form in natural depressions, or sinks, within the surrounding landscape, normally in regions with high winds capable of depositing sand in these holes. In this case, the slug-shaped sink sits approximately 300 feet (90 meters) below the elevation of the surrounding landscape.\n\nMost of the sand within this sink originates from the adjacent floodplain, as well as another floodplain located to the south (not shown in the image). Floodplains generate lots of sand when they dry out, as previously trapped coarse sediments get scattered across the land and blown away by the wind, according to .\n\nRelated: See all the best images of Earth from space\n\nThe parallel lines visible across the dunes are ridges of sand built up as the prevailing wind pushes the sand northward. Over time, the positions of these ridges subtly shift in the same direction.\n\nThe dark patches littered across the dune field are plants that have taken root in the ridges. If the concentration of this vegetation gets high enough, it can fix a ridge into place and prevent it from moving, similar to some of the dunes frozen in place along various coastlines across the globe.\n\nMost of the vegetation is concentrated along the southern and western edges of the dune field, likely due to water coming from the Uil River, which snakes around the outskirts of Oyyl, according to the Earth Observatory.\n\nScientists are currently uncertain if the rest of the dune field will follow suit and become overrun by plant life in the future.",
  "medium": "Article",
  "links": [
    "https://www.livescience.com/planet-earth/geology/earth-from-space-otherworldly-stripes-and-shadowy-dunes-share-center-stage-in-hottest-place-on-earth",
    "https://earthobservatory.nasa.gov/images/150271/oyyl-dune-field-kazakhstan",
    "https://www.livescience.com/planet-earth/trio-of-stripy-glaciers-merging-in-earths-highest-battleground-are-part-of-a-major-anomaly-scientists-dont-fully-understand-earth-from-space",
    "https://www.livescience.com/planet-earth/volcanos/earth-from-space-massive-field-of-ancient-lava-casts-an-eerie-gold-specked-shadow-in-the-sahara",
    "https://www.livescience.com/planet-earth/rivers-oceans/rare-milky-plumes-paint-stunning-swirls-in-worlds-largest-soda-lake-earth-from-space",
    "https://education.nationalgeographic.org/resource/flood-plain/",
    "https://www.google.com/maps/place/Oyyl,+Kazakhstan/@49.0599845,54.6334984,31569m/data=!3m1!1e3!4m6!3m5!1s0x419c4d961d6b51db:0xdd09a274fa0f10cd!8m2!3d49.0746012!4d54.6686485!16s%2Fg%2F120nkyrv?entry=ttu&g_ep=EgoyMDI1MDgxMy4wIKXMDSoASAFQAw%3D%3D",
    "https://www.livescience.com/tag/earth-from-space",
    "https://www.livescience.com/planet-earth/lake-filled-impact-crater-in-africa-transforms-into-a-giant-silver-mirror-via-rare-phenomenon-earth-from-space",
    "https://www.livescience.com/planet-earth/geology/earth-from-space-giant-pyramid-like-star-dunes-slowly-wander-across-moroccan-desert"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Oyyl dune field",
      "weight": 0.118383266
    },
    {
      "name": "Dune fields",
      "weight": 0.11763488
    },
    {
      "name": "sand dunes",
      "weight": 0.1148643
    },
    {
      "name": "dunes",
      "weight": 0.09414456
    },
    {
      "name": "sand",
      "weight": 0.07732939
    },
    {
      "name": "high winds",
      "weight": 0.07015191
    },
    {
      "name": "Floodplains",
      "weight": 0.069350265
    },
    {
      "name": "floodplains",
      "weight": 0.069350265
    },
    {
      "name": "north Kazakhstan",
      "weight": 0.06919043
    },
    {
      "name": "ridges",
      "weight": 0.06623679
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.7041015625
    },
    {
      "name": "/Arts & Entertainment/Offbeat/Other",
      "score": 0.63232421875
    },
    {
      "name": "/Pets & Animals/Wildlife",
      "score": 0.53857421875
    },
    {
      "name": "/Science/Astronomy",
      "score": 0.4189453125
    },
    {
      "name": "/News/Other",
      "score": 0.38671875
    }
  ],
  "sentiment": {
    "positive": 0.09702246,
    "negative": 0.3578516,
    "neutral": 0.5451259
  },
  "summary": "An astronaut photo taken by an unnamed astronaut on board the International Space Station in Kazakhstan has revealed a large, oddly shaped field of sand dunes that resembles a giant slug. The photo, taken around 175 miles northeast of the Caspian Sea, is taken near the village of Oyyl and a large floodplain in the Kazakh Steppe. The dune field, which covers an area of around 75 square miles (190 square kilometers), is three times the size of Manhattan and measures approximately 13 miles (21 km) across at its widest point. Most of the sand within this sink originates from the adjacent floodplain and another floodplain located to the south. The landscape is covered in clusters of vegetation, suggesting that its sands are slowly being frozen in place.",
  "shortSummary": "An astronaut's image shows a large sand dune field in Kazakhstan's Kazan Steppe, formed by sand dunes shaped like a giant slug, slowly becoming frozen in place amid high winds.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ba4d5919f21d4075aae0c292ad30bc38",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://education.nationalgeographic.org/resource/flood-plain/",
      "text": "ARTICLE\nARTICLE\nFloodplain\nFloodplain\nA floodplain is a generally flat area of land next to a river or stream.\nGrades\n9 - 12+\nSubjects\nEcology, Earth Science, Geology, Geography, Physical Geography\nLoading ...\nA floodplain (or floodplain) is a generally flat area of land next to a river or stream. It stretches from the banks of the river to the outer edges of the valley.\nA floodplain consists of two parts. The first is the main channel of the river itself, called the floodway. Floodways can sometimes be seasonal, meaning the channel is dry for part of the year. The floodway of the Todd River in Australia’s Northern Territory, for instance, is an ephemeral stream, meaning its channel can be dry for months at a time.\nBeyond the floodway is the flood fringe. The flood fringe extends from the outer banks of the floodway to the bluff lines of a river valley. Bluff lines, also called valley walls, mark the area where the valley floor begins to rise into bluffs. The flood fringe of the seasonal Todd River extends the floodplain to 445 square kilometers (170 square miles).\nSome floodplains are extraordinarily wide. The Barotse floodplain of the Zambezi River, for example, is a vast wetland stretching thousands of kilometers through Angola, Zambia, and Botswana. The Barotse floodplain includes the sandy Kalahari basin, which is waterlogged during the rainy season and an extension of the nearby Kalahari Desert during the dry season.\nSome rivers have very narrow floodplains. In fact, some rivers, or parts of rivers, seem to have no floodplain at all. These rivers usually have a steep stream gradient—a very deep, fast-moving channel. Ngonye Falls, Zambia, marks a remote stretch of the Zambezi River where the floodplain is extremely narrow. As the Zambezi leaves the wide floodplain of the sandy Kalahari, it enters a narrow basalt channel as fast-moving whitewater rapids.\nGeology of a Floodplain\nThere are two major processes involved in the natural development of floodplains: erosion and aggradation. The erosion of a floodplain describes the process in which earth is worn away by the movement of a floodway. Aggradation (or alluviation) of a floodplain describes the process in which earthen material increases as the floodway deposits sediment.\nA river erodes a floodplain as it meanders, or curves from side to side. The massive lowland floodplain of the Amazon River, for instance, is carved with hundreds of oxbow lakes that document the meandering river and its tributaries over time. Oxbow lakes are formed when a meander, or bend, in the river is cut off from the river’s mainstem. Features such as oxbow lakes and seasonal wetlands are often a part of floodplains created through erosion and deposition.\nA meandering stream can contribute to a floodplain’s aggradation, or build-up in land elevation, as well as its erosion. A typical aggradation environment is a wide, shallow, braided river. Braided rivers often include river deltas, where the main floodway is separated into discrete channels and tiny islands. The process of subsidence, in which the elevation of a delta may sink due to sea-level rise or human activity, often offsets aggradation in the floodplains in these areas. The huge aggradation of sediment around the Nile Delta, for instance, is subsiding due to the rising level of the Mediterranean Sea.\nThe alluvium, or sediment, of a floodplain varies. Its coarseness and composition depend on the surrounding landscape and the velocity of the currents that created the floodplain. Some floodplains are mostly fine-grained silt, while others are sandy.\nThe deposit of alluvium created as a river or stream breaks, or breaches, its bank is called a crevasse splay. The formation of a crevasse splay is very similar to the formation of an alluvial fan. The thickest layer of sediment is nearest the breach, while the thinnest and youngest sediments are fanned out.\nThe layered sediments of many floodplains can create important aquifers. Clay, sand, and gravel filter water as it seeps downward. Water purification systems often take advantage of this natural phenomenon in a process called bank filtration. In bank filtration, water is deliberately filtered through the banks or floodplain of a river or lake. Nearby wells then collect the filtered water, which is then ready for more intense purification processes.\nFluvial Terraces\nThe sedimentary patterns of floodplains often provide scientists with evidence of past geologic activity. Thick layers of sand may indicate flash flooding, for instance, while thin, evenly spaced layers of silt may indicate more moderate and predictable flood patterns.\nOne of the most important geologic features of a floodplain is its fluvial terraces. Fluvial terraces are step-shaped areas of land that flank the banks of a river or stream. Fluvial terraces mark the older, higher-elevation paths of the stream, before erosion and aggradation created the current mainstem of the stream or river. Fluvial terraces can mark the bluff lines—outer edges—of a floodplain.\nThere are two major types of fluvial terraces: fill terraces and cut terraces. Fill terraces are formed as a valley or gorge is filled with alluvium. Alluvium can aggregate as a river meanders and overflows its banks, or it can be deposited by a glacier.\nWhile fill terraces are associated with aggradation, cut terraces are associated with erosion. Cut terraces are often formed below fill terraces, as water erodes sediment.\nOlder floodplains and river valleys can have many fluvial terraces. The Rhine Valley of Central Europe, for instance, has dozens of fluvial terraces created by the meandering Rhine as well as intense glaciation. Fluvial terraces in the Rhine allow geologists to examine more than 100,000 years of Europe’s past.\nLiving on the Plain\nFloodplains have dazzling arrays of biodiversity. These seasonal riparian wetlands boast greater biodiversity than the rivers themselves.\nThe floodplains of Congo River tributaries, for instance, boast one of the most unusual fish on the planet: the West African lungfish. The lungfish is adapted to the two seasons in the Congo floodplain. It uses its gills during the rainy season, and its primitive lung during the dry season.\nThe Murray-Darling floodplain in Southeast Australia has remained remarkably unchanged for thousands of years. This floodplain is home to endemic species such as the hairy-nosed wombat, the wedge-tailed eagle, and several types of orchid.\nTugay forests are unusual ecosystems that stretch along the floodplains of Central Asia, including western China, the Stans, and Azerbaijan. Tugay forests are sometimes called riparian forests due to their proximity to winding rivers. Tugay forests often serve as green migration corridors through arid or semi-arid environments. Vegetation in tugay forests, such as willow, poplar, and tamarisk, is largely dependent on the water supplied by the floodplain’s rivers and aquifers—not precipitation.\nPeople and Floodplains\nFloods are usually seasonal and can be predicted months ahead of time. This predictability can make floodplains ideal locations to develop urban areas. Rivers provide both a natural transportation network and source of water for irrigation and industry. The relatively level land can be developed either as agricultural fields or sites for habitation or business.\nThe three most ancient civilizations on Earth all developed on fertile floodplains. The floodplains between the Tigris and Euphrates rivers, in what are today Syria and Iraq, are known as Mesopotamia, “the land between the rivers.” Ancient civilizations of Mesopotamia include Sumeria, Akkadia, Assyria, and Babylonia. The floodplains of the Indus River, in what is today Afghanistan, India, and Pakistan, gave rise to the Indus River Civilization, also known as the Harappan civilization. Finally, ancient Egyptian culture developed around the fertile floodplains of the Nile.\nAgriculture\nFloodplains are usually very fertile agricultural areas. Floods carry nutrient-rich silt and sediment, and distribute it across a wide area. floodplains are flat and often have relatively few boulders or other large obstacles that may prevent farming.\nThe rich floodplains of the Pampas, for example, are nicknamed the “Breadbasket of Argentina.” These lowlands are susceptible to floods, but are also home to some of South America’s most lucrative grain farms and cattle ranches.\nTransportation\nA floodplain’s flat terrain and slow-flowing rivers can provide excellent transportation corridors. Roads, bridges, railways, and even airports can be constructed on the even surface. Ships and barges can often haul cargo faster and more efficiently than roadways.\nThe floodplains of the mighty Mississippi-Missouri river system in the central United States, for example, have served as vital transportation corridors for centuries. Native Americans deftly navigated the floodplains, making trade between the East Coast and West Coast of North America possible. During the 19th century, cities on Mississippi floodplains—St. Louis, Missouri; Memphis, Tennessee; New Orleans, Louisiana—became crucial centers of culture and commerce.\nFlooding\nFloodplains are natural flooding outlets for rivers. People, agriculture, and businesses on floodplains are always at some risk.\nThe most devastating floods of the 20th century occurred on the floodplains of the Yellow River in China, for example. The 1931 floods were some of the worst natural disasters ever recorded. The 1931 Yellow River floods followed years of drought that left the topsoil on floodplains brittle and eroded. Heavy rains swelled the river and forced it to break its banks, drowning wide swaths of land as the floodplain was unable to efficiently absorb the river’s excess water or dissipate its energy.\nManaging development of floodplains is a critical responsibility for regional and urban planners. The benefits of floodplains, including prime agricultural land and desirable housing locations, must be balanced with the personal and economic threats posed by floods.\nFlood Meadows and Water Meadows\nMany floodplain settlements maintain flood meadows and water meadows to reduce the impact of seasonal flooding. Flood meadows are natural areas of grassland immediately adjacent to a floodway. Flood meadows are often used as pastures for livestock when they are not saturated with water.\nWater meadows are also grasslands adjacent to floodways. Unlike flood meadows, water meadows are created and maintained by people. Water meadows are continuously irrigated through channels from the river. Water meadows were common features of the agricultural landscape in Western Europe throughout the 19th century. The nutrient-rich, silty soils of water meadows supported rich pastures used for livestock, as well as growing hay and other fodder.\nUrban Planning\nCities built on floodplains, such as St. Louis or New Orleans, must incorporate flood-control infrastructure into their organization and architecture. Evacuation procedures, emergency shelters, and building codes must be in place. Levees or other barriers must be a part of the city design. Urban planners try to keep areas near the floodway, called a Special Flood Hazard Area, as free from development as possible.\nSometimes, residents on floodplains must relocate entirely. The small U.S. town of English, Indiana, for instance, was established on the floodplain of the Blue River, a tributary of the Ohio River. Damage caused by frequent floods encouraged the town’s residents and businesses to relocate the town center to elevated agricultural land several kilometers away. About 75% of English was torn down or relocated in 1990.\nFloodways and Floodplain Restoration\nIn many floodplains, a mass relocation is impossible for logistical and economic reasons. In such cases, engineers can divert the path the floodway—the river—itself. Artificial floodways are a sort of man-made river channel.\nThe Red River floodway, for example, can divert the path of the Red River around the urban area of Winnipeg, Manitoba, Canada. During flooding episodes, the channel can divert up to 4,000 cubic meters (140,000 cubic feet) of water per second before it reaches the Winnipeg area. The floodway carries this outflow around the city before rejoining the mainstem of the Red River in a less-populated area of the floodplain. Since its construction in 1968, the Red River floodway has saved Manitoba more than $32 billion in flood damage.\nIn other places, conservationists and engineers have engaged in floodplain restoration. Floodplain restoration is the process of returning a floodplain to its condition before people modified the landscape for development or agriculture. floodplain restoration may include removing dikes and levees, as well as flooding previously drained marshes and swamps.\nOne of the most ambitious floodplain restoration projects is underway in the Lower Danube floodplains of Bulgaria, Romania, Moldova, and Ukraine. The extensive projects aim to reduce flood damage by restoring flood meadows, which will absorb excess water. floodplain restoration projects will also provide habitats for endangered species and reduce pollution in the Danube. (Flood meadows absorb chemicals from agricultural and industrial runoff.)\nInsurance\nHouses and businesses that are built on floodplains often require more insurance coverage than buildings constructed on higher ground, because flood damage is more likely to occur.\nA FIRM is a flood insurance rate map. FIRMs display Special Flood Hazard Areas within a floodplain. A Special Flood Hazard Area is simply an area that falls within boundary of a 100-year flood.\nFIRMs are used to balance the risk of flood against the rate of insurance. FIRMs are divided into different zones based on the zone’s proximity to the floodway. Buildings in the A- or V-zones, for example, are near the banks of the river. All buildings in A zones are required to have flood insurance due to their extremely high risk of flood damage. The floors and service facilities of A-zone buildings (such as air-conditioning units and plumbing) must meet a “base high flood elevation.” Base high flood elevations vary depending on the floodplain and risk posed by a 100-year flood. In the Charlotte, North Carolina, floodplain, for example, the base high flood elevation is one foot above the expected depth of floodwater in a 100-year flood.\nThere are strict rules for constructing or remodeling buildings in the A-zone of a floodplain. Basements in A-zones must not be used as living spaces, for example.\nUrban planners frequently use FIRMs to establish a city’s land-use policies and development zones. Industrial zones, which can include factories with toxic chemicals, may be located far from the floodway in order to prevent pollution of a community’s source of water. Residential zones, which are more difficult to evacuate than hotel-designated zones, may also be more limited along a floodway. Areas closest to the floodway, in contrast, are often designated as “green spaces” and parks.\nFast Fact\nExner Equation\nA mathematical calculation known as the Exner equation helps geologists and hydrologists determine the extent of a floodplain. The Exner equation describes the relationship between the sediment that is transported by a river and the sediment that is deposited by a river. The equation is dominated by the density and distribution of sediment in a river.\nFast Fact\nFloodway\nThe term “floodway” is sometimes used for a road built at ground level on a flood plain. Floodways are usually constructed on floodplains with low traffic and rare floods.\nArticles & Profiles\nCredits\nMedia Credits\nThe audio, illustrations, photos, and videos are credited beneath the media asset, except for promotional images, which generally link to another page that contains the media credit. The Rights Holder for media is the person or group credited.\nEditors\nProducer\nother\nLast Updated\nOctober 19, 2023\nUser Permissions\nFor information on user permissions, please read our Terms of Service. If you have questions about how to cite anything on our website in your project or classroom presentation, please contact your teacher. They will best know the preferred format. When you reach out to them, you will need the page title, URL, and the date you accessed the resource.\nMedia\nIf a media asset is downloadable, a download button appears in the corner of the media viewer. If no button appears, you cannot download or save the media.\nText\nText on this page is printable and can be used according to our Terms of Service.\nInteractives\nAny interactives on this page can only be played while you are visiting our website. You cannot download interactives."
    },
    {
      "url": "https://www.livescience.com/planet-earth/volcanos/earth-from-space-massive-field-of-ancient-lava-casts-an-eerie-gold-specked-shadow-in-the-sahara",
      "text": "Earth from space: Massive field of ancient lava casts an eerie, gold-specked shadow in the Sahara\nA stunning composite image, made up of three years' worth of satellite photos, shows the ancient lava of Libya's Haruj volcanic field interspersed with patches of golden sand.\nWhere is it? Haruj volcanic field, Libya [27.30184638, 17.50182896]\nWhat's in the photo? An ancient lava flow in the middle of the Sahara desert\nWhich satellite took the photo? Landsat 8\nWhen was it taken? Between July 24, 2013, and April 13, 2016\nA giant patch of black, fossilized lava that was spewed across the Sahara desert over millions of years looks like an eerie, gold-speckled shadow in this stunning composite of three years' worth of satellite photos.\nThe shadowy mass, known as the Haruj volcanic field, covers around 17,000 square miles (44,000 square kilometers) in central Libya and contains roughly 150 extinct volcanoes, ranging from small vents and chimneys to larger shield volcanoes, according to the U.S. Geological Survey.\nSome of the volcanic rocks are up to 6 million years old, while others were left by eruptions that happened as recently as a few thousand years ago, according to the Global Volcanism Program at the Smithsonian's National Museum of Natural History.\nWhile the dark color of the petrified lava makes the field look smooth and flat from above, the field is extremely uneven, with areas where multiple eruptions have caused layers of rock to pile up above their surroundings. The site is also littered with raised vents and at least 30 cones that stand more than 330 feet (100 meters) tall, according to the Global Volcanism Program.\nThe tallest peak in the field stands roughly 3,900 feet (1,200 m) above sea level.\nRelated: See all the best images of Earth from space\nThe satellite image above is what is known as a \"best pixel mosaic\" and was made using a computer program that sorts through multiple images of the same spot pixel by pixel to create a final image that is free from obscuring elements, such as clouds or dust storms, according to NASA's Earth Observatory.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nThis model also selected pixels where patches of sand that have settled in between gaps in the lava catch the sunlight, which has created the golden speckles littered across the field. These sandy spots are much less obvious in other satellite images of the area.\nVolcanic history\nMost volcanoes are born along fault lines that intersect Earth's tectonic plates, because this is where the planet's crust is weakest and magma from the mantle can easily rise to the surface.\nHowever, the Haruj volcanic field is not located near any known fault lines. Instead, the lava there was likely dragged up directly from the mantle by a surge of hot, rocky material — known as a mantle plume — which created a reservoir of magma below the field.\nAs a result, lava from the Haruj volcanoes would have slowly bubbled up and oozed out from the field's multiple vents, similar to modern eruptions that occur at Hawaii's Kilauea volcano, rather than being ejected in explosive eruptions, according to the Earth Observatory.\nSome researchers think Haruj is made up of two separate volcanic fields: Al Haruj al Aswad, which is located in the north and contains much older lava; and Al Haruj al Abyad, which is located in the south and was created more recently. However, it is hard to tell where one of these fields ends and the other begins, so it is more commonly thought of as a single entity.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series."
    },
    {
      "url": "https://www.livescience.com/planet-earth/lake-filled-impact-crater-in-africa-transforms-into-a-giant-silver-mirror-via-rare-phenomenon-earth-from-space",
      "text": "Lake-filled impact crater in Africa transforms into a giant silver 'mirror' via rare phenomenon — Earth from space\nA 2024 astronaut photo shows a rare \"sunglint\" shining off Lake Iro and a nearby zig-zagging river in Chad. The shimmering bodies of water were likely both shaped by an ancient meteor impact.\nWhere is it? Lake Iro, Chad [10.10150087, 19.41766527]\nWhat's in the photo? Sunlight reflecting off the lake and the surrounding river\nWho took the photo? An unnamed astronaut on board the International Space Station (ISS)\nWhen was it taken? Dec. 21, 2024\nThis stunning astronaut photo shows a rare phenomenon, known as a \"sunglint\", transforming a potential meteor crater lake into a giant silver mirror in the heart of Africa.\nLake Iro, known locally as Lac Iro, is an approximately 7-mile-wide (12 kilometers) body of water in Chad, located around 60 miles (100 km) north of the country's border with the Central African Republic. The lake lies in the heart of Africa's Sahel region — an extensive savannah that separates the Sahara Desert and the rainforests of Central Africa.\nIro is partly surrounded by Bahr Salamat, a roughly 125-mile-long (200 km) waterway that splits and feeds into the lake. The river is renowned for being exceptionally windy, especially where it bends around Iro's southern shore, according to NASA's Earth Observatory.\nThe lake and large sections of the river shine brightly in the image as sunlight reflects off their watery surfaces, giving them a metallic-like sheen. If you look closely, parts of its surface appear to have a whiter color than the rest. These areas are most likely reflections of the clouds hanging high over the lake.\nThis phenomenon is known as a sunglint, and only occurs when the observer is perfectly aligned with the sun, relative to the object reflecting the light. As a result, this effect is best observed from space.\nRelated: See all the best images of Earth from space\nAstronauts are particularly well-suited to capturing sunglints because they can alter their angle relative to the reflecting object, unlike satellites that have a fixed view. In recent years, ISS inhabitants have also spotted a massive sunglint around a pair of Greek islands, which revealed several unusual oceanographic phenomena, and another that painted a \"sea of clouds\" in a volcanic lake nestled between nesting Russian volcanoes.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nSuspected impact crater\nRecent research suggests Lake Iro may lie within an ancient meteor impact crater leftover from when a sizable space rock slammed into Earth millions of years ago.\nThis theory was first put forward in the 1980s, when geologists discovered bits of ancient crystal in the rocks surrounding the lake, according to a 2014 study reviewing African impact structures.\nIn a more recent study, published in 2024, researchers investigated the geological features of Lake Iro. They noted that an impact may have significantly altered the shape and direction of Bahr Salamat, which may explain why there are so many twists and turns to the winding river.\nLake Iro is also highly cyclical, meaning that its depth fluctuates seasonally and can almost completely drain during periods of extreme drought, which is a common characteristic among other impact crater lakes.\nBased on this evidence, the researchers of the most recent study wrote that Lake Iro \"cannot be readily explained by any process other than [a meteor] impact.\"\nMore research is needed to confirm if this is the case, and this \"should be a priority\" due to its size. The researchers added that evidence of the impact may have been well preserved by the lake.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.livescience.com/planet-earth/geology/earth-from-space-otherworldly-stripes-and-shadowy-dunes-share-center-stage-in-hottest-place-on-earth",
      "text": "Earth from space: Otherworldly stripes and shadowy dunes share center stage in 'hottest place on Earth'\nThis 2012 satellite photo shows a series of giant windblown ridges, known as yardangs, and a group of towering sand dunes at the heart of Iran's Lut Desert.\nWhere is it? Lut Desert, Iran [30.42887793, 58.92226083]\nWhat's in the photo? Otherworldly ridges alongside a mysterious shadowy patch\nWhich satellite took the photo? European Space Agency's Envisat\nWhen was it taken? April 2, 2012\nThis striking false-color image shows massive wind-carved ridges and a \"shadowy\" patch of sand dunes at the heart of Iran's Lut Desert — one of the most extreme environments on Earth.\nThe Lut Desert covers more than 7,000 square miles (18,000 square kilometers) in southeast Iran. It is a salt desert, meaning its sand contains a mixture of salts and other minerals leftover from an ancient lake, and contains almost no water or vegetation. The desert's Persian name, Dasht-e Lūt, means \"emptiness plain.\"\nThe region is often called the \"hottest place on Earth,\" but this is open to interpretation. The highest air temperature on Earth within the last century — 130 degrees Fahrenheit (54.4 degrees Celsius) — was recorded at Furnace Creek Ranch in California's Death Valley in 2020. But, the ground surface temperature of the Lut Desert reached a maximum of 177.4 F (80.8 C) in 2018, which is a joint record shared with Mexico's Sonoran Desert, according to NASA. The sands get so hot in the Lut Desert partly because of large, dark patches of ancient lava that cover the surface and lie just below the sand.\nThe satellite image above shows two geological features: an area of parallel ridges, known as yardangs, on the left; and a giant, shadowy patch of sand dunes on the right. The photo was taken using the solar reflective spectral range — a mix of ultraviolet, visible light and infrared — which has made these features appear dark purple. When viewed from above with visible light only, these features are much less distinguishable from their surroundings, as more recent images from NASA's Terra satellite show.\nRelated: See all the best images of Earth from space\nYardangs are tall ridges carved from the bedrock of a desert by millennia of wind blasting. The ridges are particularly interesting because they are some of the best examples of this feature anywhere in the world, according to UNESCO. They are around 25 miles (40 kilometers) long and stand around 500 feet (150 meters) above the surrounding area.\nThe Lut Desert is also home to some of the world's tallest sand dunes, which are up to 1,500 feet (460 m) high, according to NASA's Earth Observatory. However, the dunes in the image only reach up to 1,000 feet (300 m) tall.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nThe heat and dryness of the Lut Desert make it nearly completely inhospitable to life, or an abiotic environment. However, there is a small, shallow body of water dozens of miles to the northeast of the dunes, which does enable some species to survive in this harsh landscape, according to the European Space Agency (ESA).\nBut away from this water source, there are likely some truly barren areas in the Lut Desert where even microbes cannot survive. \"Some reports claim that research groups brought sterilized milk to the desert and left it uncovered in the shade, but the milk remained sterile,\" ESA representatives wrote. However, there is no record of this research online.\nThe region is prone to tectonic activity due to several fault lines that run below Iran and contributed to the region's ast volcanic activity. In 2003, a 6.6-magnitude earthquake rocked the country, and the epicenter was around 100 miles (160 km) south of the dunes and yardangs in the image, according to the ESA.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series."
    },
    {
      "url": "https://earthobservatory.nasa.gov/images/150271/oyyl-dune-field-kazakhstan",
      "text": "An astronaut looking down from the International Space Station (ISS) photographed this dune field near the village of Oyyl, Kazakhstan. The dunes are situated on the Kazakh Steppe and within a broad floodplain where three rivers converge. The dunes span approximately 190 square kilometers (75 square miles) in area and are located 280 kilometers (175 miles) northeast of the Caspian Sea.\nDune fields grow in regions where there is a significant supply of sand and sufficient wind speeds to transport the grains. Fluvial floodplains are one common source of sand, so dune fields often form immediately downwind of them. Floodplains and dune fields often occupy regions known as “sinks”—topographic low areas where sediment is deposited. The sink shown here sits approximately 90 meters (300 feet) below the elevation of the surrounding steppe.\nAlthough sand dunes dominate the landscape, vegetation adds a variety of small, darker-colored patches to the interdune areas. Clusters of vegetation are more abundant on the lower-elevation south side of the dune field, where the surface is likely closer to the water table. The presence of vegetation may indicate that some dunes are in the process of becoming anchored in place.\nBeyond the landscape features, the photo also shows human-made signatures. Most evident is a road between the villages of Oyyl and Kumzhargan. An agricultural field is also visible on the northern outskirts of Kumzhargan.\nAstronaut photograph ISS067-E-133142 was acquired on June 15, 2022, with a Nikon D5 digital camera using a focal length of 400 millimeters. It is provided by the ISS Crew Earth Observations Facility and the Earth Science and Remote Sensing Unit, Johnson Space Center. The image was taken by a member of the Expedition 67 crew. The image has been cropped and enhanced to improve contrast, and lens artifacts have been removed. The International Space Station Program supports the laboratory as part of the ISS National Lab to help astronauts take pictures of Earth that will be of the greatest value to scientists and the public, and to make those images freely available on the Internet. Additional images taken by astronauts and cosmonauts can be viewed at the NASA/JSC Gateway to Astronaut Photography of Earth. Caption by Cadan Cummings, Jacobs, JETS Contract at NASA-JSC."
    },
    {
      "url": "https://www.livescience.com/planet-earth/trio-of-stripy-glaciers-merging-in-earths-highest-battleground-are-part-of-a-major-anomaly-scientists-dont-fully-understand-earth-from-space",
      "text": "Trio of stripy glaciers merging in 'Earth's highest battleground' are part of a major anomaly scientists don't fully understand — Earth from space\nThis 2023 astronaut photo shows three glaciers merging into a single massive ice mass in the Karakoram mountains. The stripy glaciers have gained ice in recent decades, despite the effects of human-caused climate change.\nWhere is it? Karakoram mountain range, Kashmir region, central Asia [35.50982304, 76.99307626]\nWhat's in the photo? Three striated glaciers merging into a single ice mass\nWho took the photo? An unnamed astronaut on board the International Space Station\nWhen was it taken? Aug. 15, 2023\nThis intriguing astronaut photo shows a trio of \"anomalous\" ice masses merging in the heart of central Asia. The stripy glaciers are bucking a global trend by gaining volume, despite the effects of human-caused climate change.\nThe aerial image shows the Lolofond glacier (top) and Teram Shehr glacier (bottom) merging with the Siachen glacier (center), along with a smaller unnamed tributary glacier. The ice masses are located in the Karakoram mountain range, a largely uninhabited area situated alongside the Himalayas in the Kashmir region, where the borders of India, Pakistan, China, Afghanistan and Tajikistan meet.\nSiachen is Earth's second-longest glacier outside of Greenland and Antarctica, and is around 47 miles (76 kilometers) long and 2.2 miles (3.5 km) across at its widest point, according to NASA's Earth Observatory. The glacier starts around 19,000 feet (5,800 meters) above sea level, while its end, or terminus, sits at an altitude of around 11,800 feet (3,600 m).\nEach of the glaciers in the photo is made up of parallel striations, or lines, known as moraines, which are folds of ice rich in dust and rock that get trapped in between merging glaciers, according to the National Park Service. There is a particularly thick and dark moraine where Teram Shehr and the smaller unnamed glacier merge with Siachen.\nEagle-eyed readers may be able to spot some other unusual features in the image, including a green-hued lake and two large chunks of white ice trapped in a moraine within Siachen (both located near the far left of the photo).\nRelated: See all the best images of Earth from space\nUnlike most of Earth's glaciers, which are rapidly losing their ice as a result of climate change, the Karakoram glaciers have expanded slightly in volume over recent decades. \"These gains — known as the 'Karakoram anomaly' — are yet to be fully explained, and scientists question how long they will persist,\" Earth Observatory representatives wrote.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nSome researchers believe that the anomaly can be explained by local weather patterns, while others argue that the dust and dirt in the glaciers' moraines help to insulate the ice from warming temperatures, according to the National Snow and Ice Data Center. Neither explanation is fully accepted by the scientific community.\nSiachen is disputed territory, claimed by both India and Pakistan. Both countries have had a military presence near the glacier's summit since 1984 and have clashed on multiple occasions. As a result, the Siachen glacier holds the title of Earth's highest battleground, according to Guinness World Records (GWR).\nAround 2,000 soldiers have died during the conflict, but almost all of them were killed by \"extreme weather conditions,\" according to GWR.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.livescience.com/planet-earth/geology/earth-from-space-giant-pyramid-like-star-dunes-slowly-wander-across-moroccan-desert",
      "text": "Earth from space: Giant, pyramid-like 'star dunes' slowly wander across Moroccan desert\nThis 2023 astronaut photo shows a series of slowly moving \"star dunes\" in the Erg Chebbi region of Morocco. Most of these massive structures are likely several centuries old.\nWhere is it? Erg Chebbi, Morocco [31.07988204, -3.986015555]\nWhat's in the photo? A group of large \"star dunes\" near the edge of the Sahara desert\nWho took the photo? An unnamed astronaut on board the International Space Station\nWhen was it taken? Dec. 21, 2023\nThis intriguing astronaut photo shows around a dozen giant \"star dunes\" as they slowly dance across a sandy field near the edge of the Sahara desert. The rare dunes, which are often confused with human-made pyramids, are likely several centuries old, recent research has revealed.\nThe unusual structures are located in Erg Chebbi. This field of open, windswept sand — or erg — covers around 65 square miles (170 square kilometers) in southwest Morocco along the northwestern edge of the Sahara. The erg is surrounded by flat lowlands but contains some of the tallest dunes in the Sahara, making it stand out like a mountain range when viewed from afar.\nThe town of Merzouga is also visible in the bottom right of the image. This settlement is built on top of a large aquifer, or underground reservoir, which allows palm groves to flourish alongside the desolate landscape and draws in tourists who are looking to explore the erg's sandy peaks.\nA star dune is a type of sand dune that has at least three ridges coming from a central peak, which gives it a star-like shape when viewed from above, according to NASA's Earth Observatory. But when they're viewed from the side, their multiple smooth slopes, known as \"slip faces,\" can make the star dunes look very similar to pyramids from ground level.\nThese dunes, which can grow to be over 300 feet (90 meters) tall, form only in locations where wind directions change constantly, which allows their different slopes to form, according to the National Park Service. As a result, they move by just a couple of inches every year in the direction of the strongest prevailing wind. That's a lot slower than some other wandering dunes, which can travel up to 1,000 feet (300 m) annually when blown in a single direction.\nRelated: See all the best images of Earth from space\nThe largest star dune in Erg Chebbi, Lala Lallia, is 330 feet (100 m) tall and is located slightly to the north (left) of the dunes in the satellite image. In March 2024, researchers revealed that this dune is around 900 years old, which is much younger than previous estimates had suggested.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nThe same study also revealed that some of the sand buried at the base of this dune is up to 13,000 years old. These grains predate an 8,000-year period of climatic change that occurred after the end of the last ice age. During this time, the Sahara was temporarily transformed into a swampy environment covered in vegetation — a shift that ended only around 4,000 years ago, researchers wrote at the time.\nOn Earth, star dunes are also found in China, Namibia, Algeria, Saudi Arabia and several U.S. states, including California and Colorado. But very similar structures can be found on Mars, according to NASA.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.livescience.com/tag/earth-from-space",
      "text": "Earth from space — Incredible images of our planet from above\nSatellite imagery provides a unique perspective on our planet and can encompass a wide range of different scientific disciplines including climate change, weather, volcanic eruptions and even animal behavior. Every week, we take a bird's eye view of Earth, and see how it affects the people living on it.\nSee more stunning pictures of Earth\nLatest about Earth from space\nGiant sandy 'slug' crawls through floodplains in Kazakhstan, but it could soon be frozen in place\nBy Harry Baker published\nEarth from space A 2022 astronaut photo shows a peculiar, slug-shaped dune field in the heart of the Kazakh Steppe. Signs of vegetation among the sand suggest these dunes are in the process of being fixed in place.\nRare milky plumes paint stunning swirls in world's largest 'soda lake'\nBy Harry Baker published\nEarth from space A 2016 astronaut photo shows surprising plumes of milky material swirling in the waters of Turkey's Lake Van, the largest alkaline lake on Earth.\nSupervolcanic 'hell' caldera in Japan is home to 17 different volcanoes\nBy Harry Baker published\nEarth from space A 2012 astronaut photo shows the striking beauty of Japan's Aso Caldera, a \"supervolcanic\" structure home to more than a dozen volcanoes and \"hellish\" hot springs. It was formed by several major eruptions spanning more than 200,000 years.\n10 bizarre 'dark voids' appear in the skies over uninhabited island near Antarctica\nBy Harry Baker published\nEarth from space A 2016 satellite photo shows nearly a dozen swirling dark spots that emerged in the clouds over Heard Island in the Indian Ocean.\nLake-filled impact crater in Africa transforms into a giant silver 'mirror' via rare phenomenon\nBy Harry Baker published\nEarth from space A 2024 astronaut photo shows a rare \"sunglint\" shining off Lake Iro and a nearby zig-zagging river in Chad. The shimmering bodies of water were likely both shaped by an ancient meteor impact.\n'Ghost island' appears after underwater eruption, then vanishes into the Caspian Sea\nBy Harry Baker published\nEarth from space A series of photos taken between 2022 and 2024 shows the emergence and rapid disappearance of a volcanic \"ghost island\" off the coast of Azerbaijan.\nTrio of stripy glaciers merging in 'Earth's highest battleground' are part of a major anomaly scientists don't fully understand\nBy Harry Baker published\nEarth from space This 2023 astronaut photo shows three glaciers merging into a single massive ice mass in the Karakoram mountains. The stripy glaciers have gained ice in recent decades, despite the effects of human-caused climate change.\nRussian volcano grows 'devil horns' and spits out 1,000-mile-long river of smoke\nBy Harry Baker published\nEarth from space A false-color satellite photo from 2023 shows a devilish pair of lava flows and an enormous plume of smoke spewing from Klyuchevskoy, the tallest volcano in Europe and Asia.\nPerfect trio of prehistoric atolls shine like tropical gems off Australian coast\nBy Harry Baker published\nEarth from space This 2011 astronaut photo shows the atolls of Rowley Shoals lined up in a near-perfect line off the coast of Australia. The island trio was once part of an ancient barrier reef system that stretched over 1,200 miles.\nStunning cloud vortices swirl off 6 different Atlantic islands\nBy Harry Baker published\nEarth from space A 2015 satellite photo captured a series of stunning \"von Kármán vortices\" swirling off Madeira and the Canary Islands. The giant swirls are collectively one of the best examples of this meteorological phenomenon ever seen.\nGet the world’s most fascinating discoveries delivered straight to your inbox."
    },
    {
      "url": "https://www.google.com/maps/place/Oyyl,+Kazakhstan/@49.0599845,54.6334984,31569m/data=!3m1!1e3!4m6!3m5!1s0x419c4d961d6b51db:0xdd09a274fa0f10cd!8m2!3d49.0746012!4d54.6686485!16s%2Fg%2F120nkyrv?entry=ttu&g_ep=EgoyMDI1MDgxMy4wIKXMDSoASAFQAw%3D%3D",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till Google\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll utan anpassning påverkas bland annat av vad du tittar på för tillfället, aktivitet i din aktiva söksession och din plats. Innehåll utan anpassning påverkas bland annat av vad du tittar på för tillfället och din ungefärliga plats. Innehåll och annonser med anpassning kan även omfatta mer relevanta resultat, rekommendationer och anpassade annonser utifrån tidigare aktivitet i webbläsaren, till exempel tidigare sökningar på Google. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://www.livescience.com/planet-earth/rivers-oceans/rare-milky-plumes-paint-stunning-swirls-in-worlds-largest-soda-lake-earth-from-space",
      "text": "Rare milky plumes paint stunning swirls in world's largest 'soda lake' — Earth from space\nA 2016 astronaut photo shows surprising plumes of milky material swirling in the waters of Turkey's Lake Van, the largest alkaline lake on Earth.\nWhere is it? Lake Van, Turkey [38.91395038, 43.12483070]\nWhat's in the photo? Rare plumes of mostly inorganic matter swirling in an alkaline lake\nWho took the photo? NASA astronaut Kate Rubins, on board the International Space Station\nWhen was it taken? Sept. 12, 2016\nThis stunning astronaut photo shows a series of milky swirls that appeared in the waters of Turkey's Lake Van, the largest \"soda lake\" on Earth. While the swirls look like a common natural phenomenon, they're actually something much rarer.\nLake Van is the largest lake in Turkey with a surface area of around 1,200 square miles (3,100 square kilometers), which is slightly smaller than Rhode Island. Its surface is located at an altitude of 5,380 feet (1,640 meters) above sea level and has a pH of around 10, which is highly alkaline.\nThe photo above shows a section of Lake Van around the city of Erciş, which is located along the lake's north shore. The swirls in the image look very similar to shapes that appear during algal blooms, when rapidly multiplying plankton species get caught up in wind-driven currents. However, this was not the cause of these swirls.\nInstead, the milky material in the lake is mostly made up of calcium carbonate, as well as smaller concentrations of detritus — waste organic material left over from living and dead animals, according to NASA's Earth Observatory.\nThis milky swirls are known as \"turbidity plumes,\" clouds of suspended material that are triggered by natural or human-caused disturbances to the lake floor. These plumes are more likely to appear in this part of the lake because the water level is shallower than the rest of the lake, which reaches a maximum depth of around 1,450 feet (450 m).\nRelated: See all the best images of Earth from space\nLake Van also has one of Earth's highest concentrations of \"microbialite,\" a collection of free-floating organo-sedimentary structures formed by the trapping, binding and precipitation of minerals by various microbes. Microbialite production peaks in the spring and fall, when microbial communities multiply. However, this is not thought to be the cause of these particular swirls, according to the Earth Observatory.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nThe lake's high pH levels are caused by high concentrations of carbonate salts, which have built up over time because the lake is \"endorheic,\" meaning it does not have an outlet. Therefore, as water evaporates from the lake, the concentration of salts increases.\nThe salt concentration in the lake is so high that the water rarely freezes, even though its temperature frequently drops below 32 degrees Fahrenheit (0 degrees Celsius) during the winter months.\nLake Van's water levels have changed significantly over the last 600,000 years as changes in Earth's climate have altered the rates of water input and evaporation. A 2014 study estimated that its depth has fluctuated by around 2,000 feet (600 m) during this time.\nWhile the large milky swirls in the photo are not caused by algal blooms, you can see small concentrations of phytoplankton that have accumulated along Erciş' coastline, as well as within a smaller lake located near the top of the image.\nHarry is a U.K.-based senior staff writer at Live Science. He studied marine biology at the University of Exeter before training to become a journalist. He covers a wide range of topics including space exploration, planetary science, space weather, climate change, animal behavior and paleontology. His recent work on the solar maximum won \"best space submission\" at the 2024 Aerospace Media Awards and was shortlisted in the \"top scoop\" category at the NCTJ Awards for Excellence in 2023. He also writes Live Science's weekly Earth from space series.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    }
  ],
  "argos_summary": "A 2022 astronaut photo shows a giant slug‑shaped dune field in Kazakhstan’s Oyyl dune field, covering about 190 km². The dunes, formed from floodplain sand, are slowly being anchored by vegetation, especially along the southern and western edges. The image highlights the interplay between wind‑driven sand deposition and plant colonisation in a remote steppe environment.",
  "argos_id": "TZY6GQ6H3"
}