{
  "url": "https://www.usatoday.com/story/money/taxes/2025/08/31/1099-k-rules-ticket-resale/85922110007/",
  "authorsByline": "Susan Tompor",
  "articleId": "7a2d88d09a81459ca66b9a3dc9611f1a",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/31/USAT/85922416007-20240121-t-000549-z-16873461-mt-1-usatoday-22338747-rtrmadp-3-nflnfcdivisionalroundgreenbaypackersatsanfrancisco-49-ers.JPG?crop=4156,2339,x0,y13&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-31T19:50:42+00:00",
  "addDate": "2025-08-31T19:57:20.637459+00:00",
  "refreshDate": "2025-08-31T19:57:20.637463+00:00",
  "score": 1.0,
  "title": "Selling your football tickets for big money? When you can expect a 1099-K",
  "description": "The rules for when you'll be issued a 1099-K for online ticket sales and other transactions changed again.",
  "content": "• New rules are yet again in store for 2025 sales of tickets and other goods and services online.\n• Sellers flagged as 'business' or 'professional' sellers on platforms may get 1099-K forms at lower internal thresholds, experts say, even without hitting the federal limits.\n• If casual sellers lose money on ticket sales, they shouldn't expect a tax break.\n\nNo time is better than late summer to be optimistic about our sports teams, and season ticket holders who are eager to defray high costs could start thinking about selling some tickets at a profit to recoup expenses.\n\nBut seller beware: You'll want to take a timeout to review the tax rules.\n\nWe're talking about one of the more confusing shifts in tax rules relating to paperwork in recent years. And if you blinked in 2025, well, the tax rules involving when you'll be issued a 1099-K this year for online ticket sales and other transactions changed yet again, thanks to a provision in the tax-and-spending package signed into law this summer by President Donald Trump.\n\nOne minute in early 2025, fans were warned that they could be issued a trackable tax form if they made off with a football field of cash by reselling NFL game tickets at outlandish prices, far above the original value. Now, forget about it. Sure, it does make your head spin.\n\nMake no mistake, you still could owe taxes on those ticket sales even if you do not receive a 1099-K.\n\nTaxpayers are legally required to report profits from ticket sales regardless of whether they receive a 1099-K, said Scott Klein, senior manager for tax policy and advocacy with the American Institute of CPAs.\n\n\"If you sell a ticket at a profit, the gain – sale price minus original cost, including fees – is taxable,\" he said.\n\nKlein noted that failing to report income can trigger an IRS audit and may result in taxes owed, penalties and interest.\n\nHis suggestion: Take the time to maintain detailed records of your ticket purchases and sales. Sellers should retain receipts, confirmations, or screenshots for all transactions in case the IRS requests proof. You'd pay taxes on any profits that exceed your costs.\n\nOccasional ticket sales are generally treated as sales of personal items, Klein told the Detroit Free Press, part of the USA TODAY Network.\n\n\"Losses from the resale of tickets purchased for personal use are typically not deductible and cannot be used to offset gains from the sale of other tickets.\"\n\nIf you buy tickets with the intent to resell them regularly, Klein said, the IRS may classify this as a business activity. In such cases, you may be eligible to deduct related expenses on Schedule C. The IRS considers factors like frequency of sales, intent to make a profit and regularity of the activity to determine whether it is a business.\n\nHow 1099-K forms used to work\n\nFirst, some history: Just a few years ago, an exceptionally high threshold existed for issuing a tax form called a 1099-K. The tax form was sent only to those who had received more than $20,000 from sales and had more than 200 transactions on third-party payment processing platforms in 2023 and earlier years.\n\nThose platforms sent copies of the 1099-K to both the IRS and the taxpayer.\n\nThen, the American Rescue Plan Act of 2021 revamped reporting requirements for third-party networks and required triggering a 1099-K if you had more than $600 in transactions.\n\nA low threshold meant a bigger paper trail for the Internal Revenue Service to track taxable transactions.\n\nBut we never saw a flood of 1099-Ks once that $600 threshold was hit. The IRS kept delaying the implementation of the $600 threshold, and, instead, phased in different thresholds to better manage the administrative challenges of issuing millions of tax forms to people who never received them.\n\nEarlier this year, for example, ticket sellers were warned that they'd receive a 1099-K from credit card companies, payment apps and online marketplaces during next year's tax season if they sold tickets, other goods or services online for more than $2,500 in 2025. That was half of the threshold for sales in 2024.\n\nThe threshold was set to plunge to more than $600 in sales in 2026.\n\nBut wait, as I said, the rules are changing yet again.\n\nWhen you'd be issued a 1099-K now\n\nThe tax and spending package signed into law this summer changed the reporting requirements for Form 1099-K ‒ and far fewer people should be dealing with this paperwork next tax season.\n\n\"The reporting requirements have been retroactively restored to $20,000 in payments and over 200 transactions,\" said Mark Luscombe, principal analyst for Wolters Kluwer Tax & Accounting in Riverwoods, Illinois.\n\nFor example, the changes in the rules mean that if a seller falls short on either component ‒ for instance, making $15,000 through 50 sales in a year ‒ the aggregate sales would not generate a 1099‑K, said Tom O’Saben, enrolled agent and director of tax content and government relations for the National Association of Tax Professionals.\n\n\"Casual ticket resellers, such as Lions season ticket holders, likely won’t receive a 1099-K unless they exceed both that high-dollar and high-transaction threshold in a year,\" O'Saben said.\n\nYet, O'Saben warns that there might be some glitches. Some payment processors, he said, could choose to issue 1099-Ks even below the legal threshold as a conservative measure, to simplify compliance or maintain uniform reporting.\n\nAnd he warned that mistakes also happen with mismatched records, duplicate accounts, or misclassification that can generate forms for amounts under the threshold.\n\nIn addition, O'Saben said a handful of states have their own lower 1099-K thresholds, including Massachusetts, Vermont and Virginia. In those states, for example, sellers could still see a 1099-K at $600 or less, regardless of federal law.\n\nWhile each platform reports separately, O'Saben said, if a seller is close to the threshold across different platforms, sometimes a platform might issue a form even if each platform is under the $20,000 and 200 transactions mark.\n\nSellers flagged as “business” or “professional” sellers on platforms may get 1099-K forms at lower internal thresholds, even without hitting the federal limits.\n\nO'Saben said it's best not to ignore a 1099-K if you get one, as the IRS has received that paperwork too, even if you received the 1099-K in error.\n\nThe 1099-K only shows your gross receipts, not your profit. So, the number you see on any 1099-K might not be fully taxable and that's why you must have good records.\n\nNo doubt, taxpayers could be more befuddled than ever, especially if they paid attention to earlier announced changes in the 1099-K rules that now will no longer take place.\n\nLuscombe noted that the IRS has announced that it will not adjust 1099 forms for changes in the mega tax bill until 2026.\n\n\"If the IRS does not update the 1099-K instructions for 2025, taxpayers may have some confusion as the 1099-K instructions may still refer to a $2,500 filing threshold for 2025 when the threshold is in fact much higher,\" Luscombe said.\n\nThe same $20,000 and 200 transactions threshold will apply for 2026. Things would be less confusing when people file 2026 tax returns in 2027, Luscombe said, because the IRS promises to update the 1099-K form by then.\n\nThe IRS had yet to update some of its 1099-K tips as of late August, several weeks after Trump signed the tax and spending package into law.\n\nAgain, the new rules do not change what counts as income or how tax is calculated.\n\nTechnically, a profit is taxable whether you receive a 1099-K or not. You'd owe taxes on the income you generate that exceeds the cost of what you sold, whether we're talking about selling college football tickets or culling your closet.\n\n\"Whether or not you receive a Form 1099-K,\" the IRS states online, \"you must still report any income on your tax return. This includes payments for any goods you sell (including personal items such as clothing or furniture sold at a gain) or services you provide.\"\n\nIf you sell an old leather blazer for $150 and you originally paid $600 for it, for example, you're not going to face a tax bill. You lost $450 on that deal and casual sellers cannot claim the loss to reduce their tax bill.\n\nResale platforms such as StubHub, Ticketmaster, Etsy, eBay and others all list information online about when they're sending out a 1099-K. But you will have to look at your own numbers to know more about when you're going to owe taxes and when you're not.",
  "medium": "Article",
  "links": [
    "https://support.stubhub.com/articles/61000276811-overview-of-1099k-regulations",
    "https://www.usatoday.com/sports/",
    "https://help.ticketmaster.com/hc/en-us/articles/9584873455889-1099-K-Form-Answers-to-Some-Common-Questions",
    "https://www.usatoday.com/story/money/personal-finance/susan-tompor/2025/01/10/new-1099-k-tax-rules-2025-detroit-lions-reselling-tickets/77514457007/",
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.usatoday.com/story/news/politics/2025/08/26/donald-trump-one-big-beautiful-bill-taxes-medicaid/85835827007/",
    "https://www.usatoday.com/story/money/personalfinance/2025/07/17/trump-one-big-beautiful-bill-tax-benefits/85193287007/",
    "https://puzzles.usatoday.com/quick-cross",
    "https://www.usatoday.com/story/money/taxes/2025/03/18/1099k-venmo-paypal-payments-tax-irs/82232780007/",
    "https://www.irs.gov/newsroom/form-1099-k-faqs-general-information",
    "https://www.usatoday.com/story/money/personal-finance/susan-tompor/2025/01/28/1099-k-meaning-form-tax-irs-2024-filing/77925001007/",
    "https://www.irs.gov/businesses/understanding-your-form-1099-k#threshold",
    "https://www.usatoday.com/story/money/2025/01/31/what-is-1099k-tax-form/78063074007/",
    "https://www.usatoday.com/story/money/2025/08/30/trump-accounts-1000-one-big-beautiful-bill/85855571007/",
    "https://www.usatoday.com/picture-gallery/news/politics/2025/01/20/donald-trumps-47th-presidency-in-pictures/77839237007/",
    "https://bit.ly/4mHnjNp"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ticket sales",
      "weight": 0.0927495
    },
    {
      "name": "tax forms",
      "weight": 0.089476466
    },
    {
      "name": "online ticket sales",
      "weight": 0.08843249
    },
    {
      "name": "ticket sellers",
      "weight": 0.08681362
    },
    {
      "name": "Occasional ticket sales",
      "weight": 0.08644446
    },
    {
      "name": "tax rules",
      "weight": 0.08628329
    },
    {
      "name": "tax",
      "weight": 0.07817204
    },
    {
      "name": "tax content",
      "weight": 0.07720822
    },
    {
      "name": "tax policy",
      "weight": 0.077155896
    },
    {
      "name": "other tickets",
      "weight": 0.07628727
    }
  ],
  "topics": [
    {
      "name": "Football"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.7822265625
    },
    {
      "name": "/News/Sports News",
      "score": 0.67626953125
    },
    {
      "name": "/Finance/Accounting & Auditing/Tax Preparation & Planning",
      "score": 0.43798828125
    }
  ],
  "sentiment": {
    "positive": 0.06773874,
    "negative": 0.5814707,
    "neutral": 0.35079062
  },
  "summary": "New rules are in place for 2025 sales of tickets and other goods and services online, with potential 'business' or 'professional' sellers potentially receiving 1099-K forms at lower internal thresholds. If casual sellers lose money on ticket sales, they may not expect a tax break. Taxpayers are legally required to report profits from ticket sales regardless of receiving a 1079-K. Failure to report income can trigger an IRS audit and result in taxes owed, penalties and interest. If you plan to resell tickets regularly, the IRS may classify this as a business activity, which can be eligible to deduct related expenses on Schedule C. The previous high threshold for issuing a tax form was set to more than $20,000 from sales and had more than 200 transactions on third-party payment processing platforms in 2023 and earlier years.",
  "shortSummary": "New tax rules, including 1099-Ks, for online ticket sales, raise concerns about potential tax evasion and improper accounting practices, especially if they involve casual sellers.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d5f1f0b4533646afb73197e2560f20ce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/news/politics/donald-trump/",
      "text": "How to watch the next episode of ‘South Park’ Season 27\nTV\nTrump moves Space Command to Alabama\nPolitics\nChicago leaders slam Trump's planned National Guard deployment\nNation\nTrump threatens National Guard for Chicago\nPolitics\nPresident Trump announces Space Command will move to Huntsville, Alabama\nNews\nSen. Cory Booker is engaged: What to know\nPolitics\nTrump says he was 'very active' despite public absence\nPolitics\nDeleted T1 Phone photo causes confusion. When will it be released?\nMoney\nTrump on social media reports questioning his health: 'It's fake news'\nNews\nTrump says he will ask Supreme Court to rule quickly on his tariffs\nPolitics\nElectric vehicles are here — but is your garage ready for a charger?\nEVs"
    },
    {
      "url": "https://www.usatoday.com/story/money/taxes/2025/03/18/1099k-venmo-paypal-payments-tax-irs/82232780007/",
      "text": "Use Venmo, PayPal? Why you're being sent a 1099-K this tax season\nIf you’re a freelancer, business owner, or just have a small side hustle, you should know about the new tax requirement this year for electronic payments through Venmo, PayPal, online marketplaces and other third-party apps.\nAs part of former President Joe Biden’s attempt to ensure everyone pays their fair share of taxes, Congress lowered in 2021 the threshold for reporting income on payment apps from $20,000 and 200 transactions annually to $600 for a single transaction. Income at or above those thresholds would trigger a Form 1099-K, or report of payments you received for goods or services during the year.\nThe law was supposed to go into effect in 2022 but was delayed twice because financial firms complained it couldn’t get its systems ready to send people a 1099-K at that $600 threshold in time to comply. The IRS decided to phase in the changes, starting with a $5,000 annual threshold in 2024, $2,500 in 2025 and finally, $600 in 2026 and later.\nWith the reporting threshold dropping, more people than ever are expected to receive a 1099-K. Here is how the new reporting rules around 1099-Ks work:\nWhat is a 1099-K and who sends them?\nForm 1099-K is a report of payments you got for goods or services during the year from credit, debit, or stored value cards, such as gift cards or payment cards and third-party payment apps or online marketplaces like eBay. If your transaction reaches a certain threshold, these firms are required to send you and the IRS a 1099-K.\nNote that payment platform Zelle isn’t included in the list of senders. Zelle is a tool that simply moves money directly from one account to another. You can’t hold a balance on Zelle the way you can on other platforms like Venmo or PayPal, which means Zelle’s different. It never takes possession of the money.\nPersonal payments on these apps shouldn’t trigger a 1099-K because those aren’t taxable income, the IRS said. But you need to note these types of payments as nonbusiness in the payment apps when possible, it said.\nWhat if you receive a 1099-K that you shouldn’t have?\nMillions of Americans also use these payment platforms to send money to friends and family as gifts or to split a meal or other bill. Rest assured. Those payments shouldn’t generate a tax form and trigger an income tax bill if you mark them as such, but mistakes happen.\nIf you receive a 1099-K that you shouldn’t have, you should contact the issuer immediately, the IRS said. Under \"Filer\" on the top left corner of Form 1099-K, you can find the name and contact information of the issuer. Ask for a corrected Form 1099-K that shows a zero amount. Keep a copy of the original form and all correspondence with the issuer for your records, the agency said.\nDon’t delay filing your tax return even if your 1099-K is incorrect, the IRS said. For example, if the taxpayer ID on your 1099-K is incorrect, enter the amount of the 1099-K on your return as income along with other income sources, it said.\nIf the amount on the 1099-K is incorrect, report it atop Schedule 1, it said. The amount on a 1099-K may include fees, credits, refunds, shipping, cash equivalents, or discounts – none of which are taxable income and should be subtracted, the IRS said. This is why it’s imperative to keep good records to support the income and deductible expenses you report on your tax return.\nThe IRS also provides examples on its website of how people can handle shared amounts.\nWhat if I don’t report a 1099-K?\nIf you fail to report what’s on your 1099-K, you may get audited.\nA 2017 report by the Treasury Inspector General for Tax Administration suggested the IRS underutilized the 1099-K to select tax returns for audit. The IRS said it agreed with the report and would make a better effort to do so.\nWhat if I receive a 1099-K for something I sold for a loss?\nIf you sold an item for a loss (or for less than what you paid), you may receive a 1099-K for the amount you received, but the money isn’t taxable or deductible.\nTo zero out the amount of money you received, the IRS said you can either:\n◾Report the payment on your tax return at the top of Schedule 1 (Form 1040).\n◾Or, report the loss on Form 8949, Sales and Other Dispositions of Capital Assets, which carries to Schedule D, Capital Gains and Losses.\nIf you receive a Form 1099-K for a personal item sold at a gain, only the profit, or difference between what you paid and what you sold it for, is taxable. You’ll need to figure out the profit and report the gain on both:\n◾Form 8949, Sales and other Dispositions of Capital Assets\n◾Schedule D (Form 1040), Capital Gains and Losses\nMedora Lee is a money, markets, and personal finance reporter at USA TODAY. You can reach her at mjlee@usatoday.com and subscribe to our free Daily Money newsletter for personal finance tips and business news every Monday through Friday."
    },
    {
      "url": "https://www.irs.gov/newsroom/form-1099-k-faqs-general-information",
      "text": "Find answers to frequently asked questions (FAQs) about general information on Form 1099-K.\nWhat's new\nThe IRS is currently working on updating the frequently asked questions. For current information, please refer to:\n- What to do with Form 1099-K\n- Form 1040 Instructions PDF\n- IR-2024-299, IRS provides transition relief for third-party settlement organizations; Form 1099-K threshold is $5,000 for calendar year 2024\n- Notice 2024-85\nUpdated and new FAQs were released to the public in Fact Sheet 2024-03 PDF, Feb. 6, 2024.\nOn Nov. 21, 2023, in Notice 2023-74, the IRS announced that calendar year 2023 would be a transition year for third party settlement organizations (TPSOs). TPSOs, which include popular payment apps and online marketplaces, must file with the IRS and provide taxpayers a Form 1099-K that reports payments for goods or services where gross payments exceed $20,000 and there are more than 200 transactions during the calendar year.\nGeneral information FAQs\nA1. Form 1099-K, Payment Card and Third Party Network Transactions, is an information return used to report payments you received during the year from:\n- Credit, debit or stored value cards such as gift cards (payment cards)\n- Payment apps or online marketplaces for goods or services (third party settlement organizations or TPSOs)\nYou should receive a Form 1099-K if you sold a good or provided a service and were paid a gross amount in excess of the reporting threshold through a payment app or an online marketplace or accepted a payment from a payment card. You may have a tax obligation if you had a gain on the sale or received payment for services you provided.\nForm 1099-K is an information return that popular payment apps and online marketplaces provide when you use them for selling goods or providing a service. You can use the information on the Form 1099-K with your other tax records to determine your correct tax owed. See Understanding your Form 1099-K for more information.\nThird party information reporting for certain payments is required by law and has been shown to increase voluntary tax compliance, improve tax collections and assessments within the IRS, and thereby reduce the tax gap.\nA2. For payment cards, there is no threshold amount that has to be met to receive a Form 1099-K due to payments received through a payment card transaction. Therefore, if you received $0.01 of payments from a payment card transaction, you should receive a Form 1099-K for those payments.\nThe federal reporting threshold for TPSOs for calendar year 2023 remains the same as previous years, which is for total gross payments for goods or services that exceed $20,000 and for which there are more than 200 transactions for a payee. Your state may have a lower reporting threshold for TPSOs, which could result in you receiving a Form 1099-K, even if the total gross payments you received in the year did not exceed the federal reporting threshold.\nFor background: The ARPA lowered the reporting threshold to impose a reporting requirement on TPSOs on Form 1099-K from gross payments of more than $20,000 and 200 transactions for a payee to gross payments totaling more than $600 (regardless of the number of transactions) for a payee.\nFor 2022: The IRS issued Notice 2023-10, which temporarily delayed the enforcement of the lowered reporting requirement on TPSOs only. However, you may have received a Form 1099-K at the lower threshold, despite Notice 2023-10.\nFor 2023: The IRS determined in Notice 2023-74 that calendar year 2023 will be regarded as another transition year for the new reporting requirements for TPSOs only. However, you may have received a Form 1099-K at the lower threshold, despite Notice 2023-74.\nA3. The term “payment card” includes credit cards, debit cards, and stored-value cards (including gift cards), as well as payment through any distinctive marks of a payment card (such as a credit card number).\nA payment card is issued according to an agreement that provides all of the following: one or more issuers of the cards; a network of persons unrelated to each other, and to the issuer, who agree to accept the cards as payment; and standards and mechanisms for settling the transactions between the merchant acquiring entities and the persons who agree to accept the cards as payment.\nA4. A TPSO is the central organization that has the contractual obligation to make payments to participating payees (generally, a merchant or business) of third party network transactions. An example could include apps used to handle the money transfer between buyers and sellers.\nA5. Not necessarily. The 2023 federal reporting threshold of over $20,000 and 200 transactions is a reporting requirement for TPSOs, but companies may still send a Form 1099-K for payments for goods or services payments that are less than that amount. For example, you may receive a Form 1099-K from other payment settlement entities, such as merchant acquiring entities. In addition, those TPSOs that have performed backup withholding under section 3406(a) for a payee during calendar year 2023 must file a Form 945 and a Form 1099-K with the IRS and furnish a copy to the payee if total reportable payments to the payee exceeded $600 for the calendar year. Also, your state may have a lower reporting threshold for TPSOs, which could result in you receiving a Form 1099-K, even if the total gross payments you received in the year did not exceed the federal reporting threshold.\nFor more information see Backup Withholding.\nA6. The entity submitting the instructions to transfer funds to the participating payee's account is responsible for reporting payment card transactions. In this case, the electronic payment facilitator is responsible for reporting because it is the entity submitting the instructions to transfer the funds in settlement of the payment card transactions.\nA7. Yes, the Form 1099-K reporting threshold doesn’t affect whether payments are taxable or whether a tax return must be filed.\nAll income, no matter the amount, is taxable unless the tax law says it isn’t – even if you don’t get a Form 1099-K. Income also includes amounts not reported on forms, such as payments you receive in cash, property, or services.\nA8. The gross payment amount (Box 1a) on Form 1099-K reports the total, or gross, dollar amount of reportable payment transactions. It doesn't include adjustments for fees, credits, refunds, shipping, cash equivalents or discounts. Those items are not income. Taxpayers can deduct those items from the gross amount when including the income on their tax return.\nThe gross payment amount also does not account for the original purchase price, or basis, of any items sold and whether the items were sold at a gain or loss. For more information on how to establish this basis, go to IRS.gov: Publication 551, Basis of Assets PDF.\nTaxpayers will need to use their Form 1099-K with other tax records to help figure and report their correct income on their tax return.\nA9. No. You should not receive a Form 1099-K for making purchases. Form 1099-K is used to report certain payments that you received for selling goods or providing services.\nPrevious updates to FAQs\n- Fact Sheet 2023-06 PDF, March 22, 2023\n- Fact Sheet 2022-41 PDF, Dec. 28, 2022"
    },
    {
      "url": "https://www.usatoday.com/story/money/personal-finance/susan-tompor/2025/01/10/new-1099-k-tax-rules-2025-detroit-lions-reselling-tickets/77514457007/",
      "text": "Selling your Detroit Lions tickets at super-sized prices? Expect a 1099-K and a tax bill\nSo, you just made off with a football field of cash by reselling NFL game tickets at outlandish prices, far above the original value, for the Detroit Lions' first postseason game at Ford Field.\nMaybe, just maybe you did get \"five large\" when you sold two decent seats.\nThe Detroit Lions are one flaming hot ticket, but you could easily get burned by an unexpected tax bill on your 2025 federal income tax return. Sorry to be the one to break the bad news, but it's better to know what you could be up against, if you turn a profit by selling tickets.\nA possible flag on the field at tax time\nIt's cautionary advice that I've shared in the past as the Detroit Lions gave us all a refresher course on the meaning of grit. And more people with popular tickets to sell should pay attention, especially when you're seeing online ticket marketplaces selling seats for the Lions at $2,000 or $5,000 or more.\nThe rules for when you'll be hit with tax forms when you sell tickets online keep changing, adding to some of the confusion. And a key rule changes again in 2025.\nYou'd receive a 1099-K form that would report payments you got for tickets, as well as other goods or services in a year, if you had transactions that are more than $2,500 in 2025.\nReselling tickets for more than you paid for them has always counted as taxable income. The new threshold for paperwork will make it easier for the Internal Revenue Service to spot those sales and collect taxes on the profits.\nBut timeout here: Who would resell Detroit Lions tickets?\nOK, spoken like a fan girl who admires the work being done by both Detroit Lions head coach Dan Campbell and the team's principal owner Sheila Ford Hemp. (As my husband will quickly tell you, I don't like football. Never have. But I walk in and out of the living room when the Lions are playing and often say things like, \"Don't worry about it. He's got this. All they need is another touchdown.\" I eagerly anticipate those spirited, motivational Campbell game ball locker room speeches. I love the way the Lions get the job done and the way this team has made Detroit feel.)\nBut, yeah, sure, it's the NFL and plenty of tickets are up for sale for the Jan. 18 or Jan. 19 divisional round at Ford Field, date and time yet to be determined by the wild card matchups Sunday and Monday.\nSome people sell tickets when they know they won't be able to attend a given game. Some Detroit Lions season ticket holders see a chance to recover much of their investment by reselling tickets to key games, even playoff games at Ford Field. The prices being asked are astronomical.\nOn Jan. 7, two tickets for the NFC Divisional Round at Ford Field were selling at $1,500 — or $750 each — in Section 339, Row 17 via Ticketmaster on NFL.com.\nIf you searched under \"best seats,\" though, you could find two tickets for $5,200 — or $2,600 each — in Section 208C, Row 6.\nTwo tickets were being offered for $10,000 in Section 280C, Row 1.\nAnother posting offered two seats for $12,000 — or $6,000 each — in Section 203C, Row 1.\nGiven those kind of prices, it would not be surprising to see 1099-Ks getting triggered in 2025 for NFL playoff games that are resold in the aftermarket on spots like Ticketmaster, StubHub or Vivid Seats.\nThe Detroit Lions turned out to be one hot ticket\nStubHub shared some insights with me on the online ticket action roughly 10 days before the Detroit's first postseason game at Ford Field.\nThe upcoming Detroit Lions playoff game is the best-selling divisional round game on StubHub, according to the ticket marketplace that allows users to buy and sell tickets for live events. The Lions tickets were outselling the Kansas City Chiefs game by 85% in early January.\nThe upcoming Detroit Lions playoff game also has the highest average price — $1,000 — of tickets sold of all divisional round games. However, StubHub notes that demand can shift as matchups are locked in after this weekend’s wild card games.\nAt the end of 2024, the Detroit Lions were the No. 2 best-selling team for the regular season on StubHub, only behind the Dallas Cowboys.\nDuring the regular season, the Detroit Lions had the second-highest average ticket price in the league of $390, based on StubHub sales. The average price of tickets sold to Lions regular season games increased 57% compared with the 2023-24 season. The average price of tickets sold is based on tickets people bought.\nThe Lions would host the NFC Championship in Detroit if they win their divisional game. StubHub notes that the contingent matchup currently is the best-selling game of the championship round.\n\"Demand typically rises as the stakes get higher, especially with iconic matchups,\" according to StubHub.\nLast year, the average prices of tickets sold jumped from $822 for the divisional round matchup between the Tampa Bay Buccaneers and the Detroit Lions to $912 for the NFC Championship game between the Detroit Lions and the San Francisco 49ers, according to StubHub data.\nYes, tickets are already being sold for an NFC Championship game at Ford Field, even if we don't know if that will take place. Games are refunded if they’re not played, according to StubHub.\nWhat's the dollar amount in sales that will trigger a 1099-K?\nThis tax season, we're talking about getting a 1099-K when transactions during 2024 are more than $5,000. Many taxpayers are likely to see these 1099-K forms arrive in January to report on their 2024 federal income tax returns this year.\n1099-K forms must be supplied to you on or before Jan. 31 to be used when you file a 2024 tax return this year.\nNext year, more people are going to be body slammed with 1099-K forms. The threshold is currently set to fall in half to transactions that are more than $2,500 in 2025.\nHow much season ticketholders pay in taxes on those profits from ticket sales would be based on your individual income tax bracket. Someone in a 22% federal income tax bracket for the sake of easy math would owe an extra $220 on a $1,000 profit. Marginal tax rates range from 10% to 37% based on income.\nIn Michigan, the individual state income tax rate is 4.25% across the board, triggering another $42.50 in taxes for Michigan residents.\nThe 1099-K crush could have been even more daunting.\nA much lower, new $600 threshold would have gone into place for 2022 for the sale of goods and services. Meaning, if you sold more than $600 worth of tickets on Ticketmaster and StubHub, you would have received a 1099-K and so would the IRS.\nThe new requirement for 1099s was put into place in the American Rescue Plan of 2021 to encourage compliance for gig workers and others. Not surprisingly, the IRS said that \"tax compliance is higher when amounts are subject to information reporting, like the Form 1099-K.\"\nBut the IRS did an end run around the draconian new reporting rule to prepare for a flood of paperwork. Actually, the IRS did two similar plays.\nThe IRS announced a one-year delay on Dec. 23, 2022, to \"help smooth the transition and ensure clarity for taxpayers, tax professionals and industry.\"\nThen, on Nov. 21, 2023, the IRS announced another timeout.\nInstead, the requirement for 1099-K paperwork remained the same for 2023, based on the IRS' actions. A 1099-K was required to be sent to those who had received more than $20,000 and had more than 200 transactions on payment platforms in 2023.\nNow, we're in what the IRS has called a two-year phase-in plan.\nYep, if you sell those Lion's tickets in 2025, you could easily be looking at a much tougher tax-time paper trail.\nThis is true, whether you sell one high-priced ticket or if you sell a bunch of tickets at a profit over the year and the gross proceeds from your sales totaled more than $2,500 in 2025. You could expect to be issued a 1099-K, which the IRS would also receive, said Katharina Reekmans, an enrolled agent with TurboTax.\n\"If reselling at face value for no profit, there’s no taxable event,\" Reekmans said.\nBut, she noted, you could still generate a 1099-K from the third party settlement organization if the transactions meet the annual reporting threshold.\nTicketmaster notes online: \"If your gross transactional amount reaches the federal or state reporting thresholds, you’ll get a Form 1099-K from Ticketmaster to use when filing your taxes.\"\nThe website notes that just receiving a Form 1099-K from Ticketmaster doesn’t necessarily mean you’ll have to pay taxes on your ticket sales. You'd pay taxes on the profits.\nThe 1099-K, according to Ticketmaster, \"just provides the total gross transactional amount processed by Ticketmaster during that calendar year.\"\nIt's important to track your own ticket selling activity.\nEven if you don’t get a 1099-K for 2024 or 2025, \"you are still required to report any profits from reselling tickets on your tax return,\" TurboTax's Reekmans said.\nAnother consideration: Someone who is in the business of reselling tickets and has a net earnings of $400 or more, generally, also may owe self-employment tax. \"But, if this is a one-time transaction for you, then it is not likely you will prompt self-employment tax for these earnings,\" Reekmans said.\nWhile such transactions were taxable, many people could ignore the rules at their own risk when they weren't getting hit with a 1099-K. Not so much now or in the future.\nIt's wise to expect to see more 1099-K paperwork.\n“If someone sold tickets, property, cars, baseball cards, or any other goods and had proceeds in excess of the thresholds, and the sales are not clearly marked as 'personal payment' on the platform, then they will likely get a 1099-K,\" said Mark Steber, chief tax officer at Jackson Hewitt Tax Service.\n\"This doesn’t necessarily mean it’s taxable income, but does mean 'gross proceeds,' \" Steber said.\nThe potentially taxable gain would be above what you paid for the item or services being sold.\n“This could turn into a headache if someone has taxable gains and they are not reporting them on a tax return, especially if and when the IRS and the taxpayer receives a 1099-K,\" Steber said.\n\"If a taxpayer hasn’t been reporting taxable gains on a tax return now or in the past, even from a side gig or hustle, then risk is even higher.\"\nBut remember, Steber said, money received from friends and family as a gift or repayment for a personal expense via apps like Venmo or PayPal should not be reported on a Form 1099-K or on a tax return. \"These payments aren't taxable income,” Steber said.\nAll 1099-K forms won't trigger more taxes\nJust getting a 1099-K doesn't mean you'd owe more in taxes.\n\"You might get a 1099-K for a transaction that wasn't even taxable,\" said Mark Luscombe, principal analyst for Wolters Kluwer Tax & Accounting in Riverwoods, Illinois.\n\"That's one issue to watch for.\"\nMaybe the 1099-K will show the sale of a personal item that's sold at a loss and you'd have to reconcile that on your tax return. Or maybe the amount on a 1099-K was included in error. Ways exist to reconcile that on your 2024 tax return.\nYou'd enter those amounts that were included in error or involving personal items sold at a loss at the very top line on Schedule 1 for 2024 returns. This area is even above the section called \"Part 1: Additional Income.\"\nAnd yes, the rules could change again when it comes to when a 1099-K will be issued.\nNot surprisingly, some say Congress could raise the threshold to $10,000 in the future, instead of $600 in 2026.\n\"Technically, it always has been a tax headache if you are making profit on your ticket sales,\" said George Smith, a CPA with Andrews Hooper Pavlik in Bloomfield Hills.\nThat's true, he said, even if no 1099-K is issued.\n\"This 'side gig' falls under the jurisdiction of the Internal Revenue Code,\" Smith said.\nSecondhand ticket sellers need to make sure that they take time to document what they paid for the tickets and keep records, Smith said. You don't want to pay more taxes that you'd owe.\nThe 1099-K will show how much you received when you sold the tickets. But you faced a cost when you bought them. Not every ticket sold generates big profits.\nA sports fan that buys 10 tickets for $100 each for a dog of a team might end up unloading those tickets for $600 and wouldn't report a profit. But you'd need to make adjustments.\nOh, yes, you couldn't deduct selling those tickets at a loss — which, thankfully, doesn't seem to be the case anymore for Detroit Lions ticket holders.\nContact personal finance columnist Susan Tompor: stompor@freepress.com. Follow her on X @tompor."
    },
    {
      "url": "https://www.usatoday.com/story/money/personal-finance/susan-tompor/2025/01/28/1099-k-meaning-form-tax-irs-2024-filing/77925001007/",
      "text": "1099-K tax form new to you this year? What it means when filing for 2024\nDid you just receive a form called a 1099-K, a form that you never, ever saw in your lifetime? Well, do not ignore any 1099-K that pops up. Take your time to understand this one.\nMore taxpayers will be bewildered when a 1099-K hits the mailbox this tax season. And the temptation might be to pitch it, which would be exactly the wrong thing to do.\nThis year, taxpayers will receive a 1099-K from payment card companies, payment apps, and online marketplaces when the amount of their business transactions during 2024 was more than $5,000.\n\"How many people have sold something online? Or otherwise taken a payment through an online app, like PayPal or Venmo?\" asked Andy Phillips, vice president of The Tax Institute at H&R Block.\nPlenty of people. But most people didn't get a 1099-K in the past, Phillips said, because a \"super high threshold\" existed for issuing a 1099-K.\nUnder the old standard, the 1099-K was only sent to those who had received more than $20,000 and had more than 200 transactions on third-party payment processing platforms in 2023 and earlier years.\nA lower threshold of $5,000 for 2024 means a bigger paper trail for the Internal Revenue Service to follow relating to taxable transactions.\nThis year, \"a lot more people are going to get a 1099-K and not know what to do with it,\" Phillips said.\nThe threshold is currently set to drop again in 2025, which means you'd receive a 1099-K during next year's tax season if you have transactions for more than $2,500 this year.\nCommon examples for when people could be surprised by a 1099-K include selling concert tickets for substantially elevated prices, like those for the Taylor Swift Eras Tour, which ran through 2024.\nOr maybe you sold football tickets online — such as Detroit Lions or Philadelphia Eagles tickets, another in-demand ticket — during the past season or the playoffs. You would have to have pushed above that $5,000 threshold in 2024 to receive a 1099-K for this tax season.\nResale platforms such as StubHub, Ticketmaster, Etsy, eBay, and others all list information online about when they're sending out a 1099-K. But you'd want to know more about what's taxable and what's not.\nThe American Rescue Plan Act of 2021 revamped reporting requirements for third-party networks and initially was to trigger a 1099-K if you had more than $600 in transactions. We've not seen such a drastic change yet.\n\"The IRS has been delaying implementation,\" said Mark Luscombe, principal analyst for Wolters Kluwer Tax & Accounting in Riverwoods, Illinois.\nThe IRS is phasing in changes in the threshold, which, according to the IRS, would allow the agency to address the complex administrative challenges that will pop up once millions of additional 1099-K forms start being issued. The phase-in also gives taxpayers more time to adjust.\nRight now, we're set to hit that $600 threshold — the limit that the law technically requires — in 2026 and afterward to cover transactions that are more than $600.\nLuscombe said it's possible that Congress will change the law before the $600 threshold goes into place and raise the limit back up by some amount again to avoid an onslaught of 1099-Ks.\n\"People should start seeing 1099-Ks that they hadn't been used to getting in the past,\" Luscombe said.\nWhat Trump says on 'no tax on tips'\nRepublicans have been critical of the efforts by the IRS to delay a flood 1099-K forms hitting mailboxes, and at the same time GOP leaders are calling for repealing the American Rescue Plan Act provision involving the expansion of 1099-K paperwork to more taxpayers.\nJason Smith, chairman of the U.S. House Ways and Means Committee, posted a statement in October titled: \"Will the IRS save Democrats from implementation of their own unpopular 1099-K surveillance scheme?\"\nThe statement noted that gig workers use apps like Venmo and PayPal to sell services and receive tips and indicated that lowering the threshold to $600 would trigger a massive burden on more middle income taxpayers.\nThe Missouri Republican said the burden will be the hardest on taxpayers earning less than $200,000 a year.\n“In fact, it will operate like an additional tax on tips — making life harder for hairdressers, Uber drivers, and other gig workers just trying to make a living,\" Smith stated.\n\"If even the IRS is afraid to implement this monster, then repealing it is just common sense,\" Smith said in October.\nPresident Donald Trump on Jan. 25 said a legislative package he's working on with Republican lawmakers to enact his domestic agenda will include his campaign pledge to eliminate taxes on tips.\nWhite House and Republican congressional leaders are discussing using the budget reconciliation process to pass some broader proposals, including the extension of Trump's Tax Cuts and Jobs Act of 2017, which is set to expire at the end of 2025, and initiating a no tax on tips rule.\nWhat's taxable and what's not\nGranted, the IRS has noted, that all income, no matter the amount, is taxable unless it’s excluded by law whether a Form 1099-K is sent or not.\nWhat taxpayers need to know, though, is that receiving the extra 1099-K paperwork does not mean you're always dealing with a taxable situation. Yes, it could get really tricky.\nYou pay taxes on a gain, not a loss. And the 1099-K only shows your gross receipts. The number you see on the 1099-K might not be fully taxable.\nYou'd pay taxes on the profit, so you'd need to take into account what you paid for an item that you sold online too, such as Detroit Lions or Taylor Swift tickets, as well.\n\"Always remember that the amount reported on a tax form is not necessarily the full amount that's taxable,\" Phillips said.\nIf you sold something online, Phillips said, you probably paid something for whatever you sold. Or he said if you provided a service, you probably have expenses related to providing that service.\nIf you sell a designer handbag for $200 and you paid $500 for it, you're not going to face a tax bill. You lost $300 on that deal.\nOn the other hand, the IRS notes, if you bought concert tickets for a $500 purchase price and sold them for $900 to someone else, you have a gain of $400. And the gain on a sale of a personal item is taxable.\nA key point to know here: The loss on the sale of a personal item is not deductible. Don't expect a tax break there.\nThe IRS notes online that if you had a seasonal crafts business and accepted money through payment cards or payment apps, you'd receive a 1099-K \"for the gross payment amounts sent to you through the use of a payment card during the calendar year, no matter how much the total.\"\n\"This reporting requirement for payment cards has not changed, and there is no minimum reporting threshold for these types of payment transactions,\" the IRS states.\nIf the 1099-K shows the sale of a personal item that was sold at a loss, you'd have to reconcile that on your tax return.\nYou'd enter those amounts that were included in error or involving personal items sold at a loss at the very top line on Schedule 1 for 2024 returns. This area is even above the section called \"Part 1: Additional Income.\"\n\"The place at the top of Schedule 1 to enter incorrect 1099-K information is new,\" Luscombe said.\nIn addition, third-party networks might not necessarily know whether some transactions are personal transfers, such a money sent to a friend to split the cost of a meal, or taxable business deals, such as selling your football tickets online at a profit.\n\"You might get a 1099-K for a transaction that wasn't even taxable,\" Luscombe said.\nOne example of an amount included on a 1099-K in error, he suggested, might include a situation such as when a roommate reimburses you via a third-party payment provider for the rent you paid to a landlord if you covered the full cost.\nIt's important not just to toss that 1099-K aside and ignore it. \"The IRS would have gotten that also and won't know it's not taxable unless you tell them,\" Luscombe said.\nContact personal finance columnist Susan Tompor: stompor@freepress.com. Follow her on X @tompor."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/30/trump-accounts-1000-one-big-beautiful-bill/85855571007/",
      "text": "'Trump Accounts' are $1k of free money. Here's how to claim it.\nEvery child born between 2025 and 2028 is getting a baby shower gift from Congress and the president: a $1,000 deposit into a “Trump Account.”\nIt’s free money, but your baby can’t spend it. Think of \"Trump Accounts\" as seed money, basically, to encourage children and families to save and build wealth for the many expenses of adulthood.\n“It’s an IRA for kids,” said Evan Morgan, a principal in the tax advisory group at Kaufman Rossin, an accounting and advisory firm.\nTrump Accounts are part of the tax and spending package signed into law this summer by President Donald Trump. They join a crowded field of tax-advantaged savings plans that help Americans navigate the costs of education, health care and retirement, among other things.\nWhat’s unusual, in this case, is that the accounts start at birth, and with a $1,000 balance.\n“To me, if I drew a best-case scenario on that thousand dollars, it would be sitting in that IRA, compounding, until I retired,” said J. Spencer Williams, founder and CEO of the Retirement Clearinghouse, a financial technology firm.\nHow do 'Trump Accounts' work?\nHere’s how the accounts work, according to analyses from Morningstar, the Tax Foundation and other sources:\nThe government pledges to create an account for any baby born between 2025 and 2028, and to fund it with a one-time deposit of $1,000. To qualify, the baby need only have a Social Security number.\nParents and others may contribute up to $5,000 a year into the accounts until the child turns 18. An employer may contribute up to $2,500 toward the $5,000 cap. State and local governments and private charities will be allowed to make broad contributions.\nNo one may contribute to the accounts until July 2026. Other details are still being ironed out.\nTo claim an account, parents probably will have to check a box on a tax form testifying that they are new parents, said Williams of the Retirement Clearinghouse.\nThe new law requires that Trump Account funds be invested in low-cost stock index funds, which mirror the performance of an index such as the S&P 500.\nAfter age 18, Trump Accounts act like IRAs\nParent contributions are after-tax, but that money is not taxable when it is withdrawn. Any earnings on the contributions, however, are taxed when you withdraw them.\nYou can’t generally withdraw money from a Trump Account until the year a child turns 18. After that, it functions like a traditional Individual Retirement Account.\nThat means, 20 or 30 years from now, a young adult with a Trump Account will be able to withdraw money to cover education expenses or a first-time home purchase without penalties.\nYou can also hold onto the money until retirement. At age 59 ½, the early-withdrawal penalties go away.\nThe accounts originally were designed to be spent by children in young adulthood. The Senate restructured them into something more like a conventional IRA.\n“This became nothing but a retirement account, at the end of the day. And there’s nothing wrong with that,” said Miklos Ringbauer, a CPA in Southern California.\nThe last-minute changes left many people confused about Trump Accounts. Ringbauer said he has fielded questions from clients.\n“We have to correct all the misinformation that’s out there,” he said.\nAre Trump Accounts a good investment?\nGiven the promise of free money from the government, Ringbauer said, it’s hard to imagine many parents will pass up a chance to acquire the accounts.\n“Anything is better than nothing,” he said. “There are so many kids who start out with nothing.”\nThe harder question, perhaps, is whether parents should actively contribute to the accounts over the next 18 years.\n“It’s free money. The question is whether you would add onto it,” said Monique Morrissey, a senior economist at the left-leaning Economic Policy Institute.\nIf your goal is to save for a child’s education, a 529 education savings account “offers more flexibility and tax benefits,” according to a Tax Foundation analysis.\n“I think most parents are going to be better off saving in a 529 for their children rather than this new Trump Account, but it certainly makes sense to collect on the $1,000 contribution,” said Romina Boccia, director of budget and entitlement policy at the Cato Institute, a libertarian think tank.\nBoccia calls Trump Accounts “a blatant giveaway, and a way for the Trump administration, in their hopes, to leave a permanent mark by naming a rather useless savings account after the current president.”\nMorrissey predicts Trump Accounts will become “a niche thing,” favored by parents with large portfolios and paid investment advisers. “I don’t think these are going to take off in a big way,” she said.\nThe Tax Foundation notes that the U.S. tax code already provides for “at least 11 different tax-advantaged savings vehicles, each with different rules, limitations and regulations.”\nTrump Accounts encourage long-term saving\nOn the other hand, a Trump Account encourages the kind of long-term retirement saving that financial planners generally recommend. The earlier you invest, the more your investments are likely to grow before you cash them out.\n“I’d call it an 18-year head start to retirement,” said Neal Ringquist, executive vice president of the Retirement Clearinghouse.\nTrue, Trump Accounts add another layer of complexity to the tax code. But there’s nothing to stop account holders from consolidating their Trump Accounts with other retirement accounts once they reach adulthood.\n“If the money isn’t used, it becomes an ordinary, traditional IRA in its adult life,” Williams said.\nThe initiative will cost an estimated $15 billion through 2034, at a time when the U.S. government faces a $37 trillion national debt.\nEven so, proponents hope the new accounts will inspire a generation of children to gain financial literacy as they build wealth for adulthood.\n“This is a really big step forward,” Williams said, “in terms of using the American free market and the opportunity for growth and compounding to help people save for whatever comes next.”"
    },
    {
      "url": "https://www.irs.gov/businesses/understanding-your-form-1099-k#threshold",
      "text": "Form 1099-K is a report of payments you got for goods or services during the year from:\n- Credit, debit or stored value cards such as gift cards (payment cards)\n- Payment apps or online marketplaces, also called third party settlement organizations or TPSOs\nThese organizations are required to fill out Form 1099K and send copies to the IRS and to you.\nPayments you got from family and friends should not be reported on Form 1099-K.\nUse Form 1099-K with other records to help you figure and report your taxable income when you file your tax return.\nDid you get a Form 1099-K? Find what to do with it on IRS.gov/1099khelp.\nOn this page\n- Who sends Form 1099-K\n- Who gets Form 1099-K\n- Reporting threshold\n- Personal payments from family and friends\nWho sends Form 1099-K\nPayment card companies, payment apps and online marketplaces are required to fill out Form 1099-K and send it to the IRS each year. They must also send a copy to you by January 31.\nWho gets Form 1099-K\nYou should get Form 1099-K for these situations:\nIf you take direct payment by credit or bank card for selling goods or providing services\nIf your customers or clients pay you directly by credit, debit or gift card, you'll get a Form 1099-K from your payment processor or payment settlement entity, no matter how many payments you got or how much they were for.\nFind what to do with Form 1099-K.\nIf you used a payment app or online marketplace\nA payment app or online marketplace is required to send you a Form 1099-K if the payments you received for goods or services total over $5,000. However, they can send you a Form 1099-K with lower amounts.\nThe payments can be made through any:\n- Payment app\n- Online community marketplace\n- Craft or maker marketplace\n- Auction site\n- Car sharing or ride-hailing platform\n- Ticket exchange or resale site\n- Crowdfunding platform\n- Freelance marketplace\nIf you accept payments on different platforms, you could get more than one Form 1099-K.\nFind what to do with Form 1099-K.\nReporting threshold\nThird party settlement organizations (TPSOs) – which means (payment apps and online marketplaces – are required to report payments on Form 1099-K when the total amount of payments you receive for goods or services through the platform exceeds:\n- $5,000 in 2024\n- $2,500 in 2025\n- $600 in 2026 and after\nAlthough the reporting threshold is phased, you may receive a Form 1099-K even when total payments are less than the reporting threshold. No matter the amount of reported payments, if you receive payments for selling goods or services, you must report all income on your tax return.\nFind additional guidance on the phased reporting threshold for third party settlement organizations in Notice 2024-85. There are no changes to what counts as income or how tax is calculated.\nReminder: Whether or not you receive a Form 1099-K, you must still report any income on your tax return. This includes payments for any goods you sell (including personal items such as clothing or furniture sold at a gain) or services you provide.\nPersonal payments from family and friends\nMoney you received from friends and family as a gift or repayment for a personal expense should not be reported on a Form 1099-K. These payments aren't taxable income.\nFor example: Sharing the cost of a car ride or meal, receiving money for birthday or holiday gifts or getting repaid by a roommate for rent or a household bill.\nBe sure to note these types of payments as non-business in the payment apps when possible.\nIf you receive a Form 1099-K when you shouldn't have, take these steps.\nRelated\n- What to do with Form 1099-K\n- Form 1099-K FAQs\n- Publication 5951, IRS Form 1099-K MYTHS vs FACTS PDF\n- Publication 5731-B, Are you making money selling things or providing a service? PDF\n- Recordkeeping\n- Crowdfunding\n- Hobby v. Business\n- Gig economy tax center\n- Small business and self-employed tax center\n- Sole proprietorships\n- Tax information for businesses\n- Estimated taxes"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/26/donald-trump-one-big-beautiful-bill-taxes-medicaid/85835827007/",
      "text": "Trump rebrands 'Big Beautiful Bill' amid poor polling\nCorrections & Clarifications: In an earlier version of this story, the Congressional Budget Office projection of how many Americans will lose health insurance was not correct.\nPresident Donald Trump’s signature legislative achievement is getting a rebrand amid polling indicating it is unpopular.\nTrump said during an Aug. 26 Cabinet meeting in the White House that he’s no longer referring to the new law as the One Big Beautiful Bill, the name he coined that was turned into the bill’s formal title as it advanced.\nThe law’s name isn’t helping with the White House’s sales pitch, Trump said.\n“So the bill, I’m not going to use the term great big beautiful,” Trump said. “That was good for getting it approved, but it’s not good for explaining to people what it’s all about.”\nInstead, Trump is focusing on the tax provisions in the law, which extended his 2017 tax reductions and added new tax cuts.\n“It’s a massive tax cut for the middle class,” Trump said on Aug. 26, something Vice President JD Vance also has been touting at events around the country.\nThe new law also increased spending on immigration enforcement and the military and includes deep spending reductions to Medicaid that Democrats and some Republicans have strongly criticized.\nDemocrats were united against the measure, saying that it disproportionately benefited the wealthy and hurt lower-income Americans. The Congressional Budget Office projects it will result in 10 million more people without health insurance by 2034, while the Senate Joint Economic Committee Minority estimates that about 20 million people could lose coverage. Medicaid is being cut by nearly $1 trillion.\nA Pew Research Center survey from earlier this month found a plurality of Americans oppose the law. The Pew survey found that 46% of Americans disapprove of the law, while 32% approve and 23% said they are unsure. A SSRS survey conducted for CNN after Trump signed the measure on July 4 found 61% of adults oppose the new law.\nVance is traveling to Wisconsin on Aug. 27 for a rally to pitch the legislation. He held previous events in Pennsylvania and Georgia.\nIt could be a challenge for the GOP to pivot when it comes to touting Trump’s new law. Some Trump Cabinet members continued to refer to the law as the \"One Big Beautiful Bill.\"\n“I will continue to say, for a little bit longer, until I heard you today, the 'One Big Beautiful Bill,'” said Labor Secretary Lori Chavez-DeRemer."
    },
    {
      "url": "https://www.usatoday.com/story/money/personalfinance/2025/07/17/trump-one-big-beautiful-bill-tax-benefits/85193287007/",
      "text": "'One Big Beautiful Bill' offers Americans lots of tax benefits. Here are a few to plan for\nTax season isn’t even close, but now is the time to start planning to take advantage of new provisions in the massive tax and spending bill that became law earlier in July, experts say.\nNo tax on tips and overtime and the $6,000 bonus deduction for seniors have been well publicized, but there’s much more that can change your taxes. Other highlights include charitable contributions deductions, auto loan interest deduction for certain new vehicles, and increased deductions and credits for families.\n“Everyday taxpayers who received the standard deduction had no tax planning opportunities under the 2017 TCJA (Tax Cuts and Jobs Act),” said Brian Gray, certified public accountant and tax partner at Gursey Schneider. Now, there are many.\nCharitable contributions are no longer just for itemizers\nOBBB permanently brings back a charitable contributions deduction for those who take the standard deduction beginning in 2026.\nDuring the pandemic in 2020, the CARES Act allowed a temporary deduction of up to $300 for cash donations for individuals taking the standard deduction. The temporary deduction was extended and expanded to $600 for married couples filing jointly for 2021 and then expired.\nUnder OBBB, “year-end charitable deduction planning could be beneficial,” Gray said. “You can deduct $1,000 per person, or $2,000 per couple, in above-the-line charitable contribution deductions if you cannot itemize.”\nAn above-the-line deduction can be taken without itemizing. It’s valuable because it lowers your adjusted gross income, which lowers your tax liability and may help you qualify for other deductions or tax credits.\nInterest deduction on personal auto loans\nOBBB has made new personal auto loan interest deductible for non-itemizers for the first time ever, said Brian Schultz, certified public accountant in Plante Moran Wealth Management’s tax practice.\nPersonal auto loan interest used to be deductible but only as an itemized deduction until the Tax Reform Act of 1986 eliminated it.\nUnder OBBB, Americans can deduct up to $10,000 of interest on their taxes, beginning in 2025 through 2028.\nThere are specific requirements to qualify for the deduction that could make it harder to take advantage of, some warn. For example, the purchase must be a new, U.S.-assembled vehicle for personal use, and income limitations apply.\nBut if you can find a qualified car and are eligible for the deduction, the calculus could change when deciding whether to buy or lease a car and how much each cost, Schultz said.\nMore benefits for families\nThere are two benefits families should be aware of even if they take the standard deduction, Schultz said.\n- If your employer offers a Dependent Care Flexible Spending Account (DCFSA), funds are withdrawn from your paycheck before taxes are deducted and can generally be used for care for a child or adult unable to care for themselves.\nThe OBBB permanently increases the annual maximum contribution to $7,500 (or $3,750 for married couples filing separately) from $5,000. Though the increase begins next year, enrollment in these plans starts soon in 2025, Schultz said.\nOther than a temporary increase during the pandemic to $10,500, (or $5,250 for married individuals filing separately) in 2021 from the American Rescue Plan Act, the contribution level had been stuck at $5,000 for 40 years, according to insurance brokerage Newfront.\n- The Child and Dependent Care Credit (CDCC) gets a double boost, starting in 2026, Schultz said.\nFirst, the credit rate increased to 50% from 35% of qualifying expenses, up to $3,000 for one child and up to $6,000 for two or more children, for families with the lowest incomes. The percentage gradually decreases as income rises.\nSecond, the way the new credit rate phases down for taxpayers, the income threshold to receive the lowest 20% credit has jumped to $206,000 for a married couple filing jointly and $103,000 for individuals from pre-OBBB income levels of $86,000 and $43,000, respectively.\nThese changes will result in nearly 4 million families seeing an increased tax credit, according to First Five Years Fund, a nonprofit focused on ensuring families have affordable access to quality child care and early learning programs.\n“Under current law, a family with two young children making less than $150,000 typically receives around $1,200,” said Sarah Rittling, the organization’s executive director, in a statement after Congress passed the OBBB. With the “enhancements, that benefit would see a $900 boost that can make a meaningful difference for parents managing tight budgets.”\nWith some planning, Americans may also be able to score a larger credit, Schultz said. For example, boosting a 401(k) contribution could reduce your taxable income enough to pick up a larger CDCC in 2026.\n“A lot of new changes with income phaseouts,” he said. “Be mindful of income levels.”\n(This story was republished to fix a typo.)\nMedora Lee is a money, markets, and personal finance reporter at USA TODAY. You can reach her at mjlee@usatoday.com and subscribe to our free Daily Money newsletter for personal finance tips and business news every Monday through Friday."
    },
    {
      "url": "https://bit.ly/4mHnjNp",
      "text": "Selling your Detroit Lions or Pistons tickets for big money? When you can expect a 1099-K\nNo time is better than late summer to be optimistic about our sports teams, including both the Detroit Lions and the Detroit Pistons. And season ticket holders who are eager to defray high costs could start thinking about selling some tickets at a profit to recoup expenses.\nBut seller beware: You'll want to take a timeout to review the tax rules.\nWe're talking about one of the more confusing shifts in tax rules relating to paperwork in recent years. And if you blinked in 2025, well, the tax rules involving when you'll be issued a 1099-K this year for online ticket sales and other transactions changed yet again, thanks to a provision in the tax-and-spending law called the One Big Beautiful Bill Act.\nOne minute in early 2025, fans were warned that they could be issued a trackable tax form if they made off with a football field of cash by reselling NFL game tickets at outlandish prices, far above the original value, say for the Detroit Lions' first postseason game at Ford Field in 2025.\nNow, forget about it. Sure, it does make your head spin.\nMake no mistake, you still could owe taxes on those ticket sales even if you do not receive a 1099-K.\nTaxpayers are legally required to report profits from ticket sales regardless of whether they receive a 1099-K, said Scott Klein, senior manager for tax policy and advocacy with the American Institute of CPAs.\n\"If you sell a ticket at a profit, the gain — sale price minus original cost, including fees — is taxable,\" he said.\nKlein noted that failing to report income can trigger an IRS audit and may result in taxes owed, penalties and interest.\nHis suggestion: Take the time to maintain detailed records of your ticket purchases and sales. Sellers should retain receipts, confirmations, or screenshots for all transactions in case the IRS requests proof. You'd pay taxes on any profits that exceed your costs.\nOccasional ticket sales, Klein told the Free Press, are generally treated as sales of personal items.\n\"Losses from the resale of tickets purchased for personal use are typically not deductible and cannot be used to offset gains from the sale of other tickets.\"\nIf you buy tickets with the intent to resell them regularly, Klein said, the IRS may classify this as a business activity. In such cases, you may be eligible to deduct related expenses on schedule C. The IRS considers factors like frequency of sales, intent to make a profit and regularity of the activity to determine whether it is a business.\nHow 1099-K forms used to work\nFirst, some history: Just a few years ago, an exceptionally high threshold existed for issuing a tax form called a 1099-K. The tax form was sent only to those who had received more than $20,000 from sales and had more than 200 transactions on third-party payment processing platforms in 2023 and earlier years.\nThose platforms sent copies of the 1099-K to both the IRS and the taxpayer.\nThen, the American Rescue Plan Act of 2021 revamped reporting requirements for third-party networks and required triggering a 1099-K if you had more than $600 in transactions.\nA low threshold meant a bigger paper trail for the Internal Revenue Service to track taxable transactions.\nBut we never saw a flood of 1099-Ks once that $600 threshold was hit. The IRS kept delaying the implementation of the $600 threshold, and, instead, phased in different thresholds to better manage the administrative challenges of issuing millions of tax forms to people who never received them.\nEarlier this year, for example, ticket sellers were warned that they'd receive a 1099-K from credit card companies, payment apps and online marketplaces during next year's tax season if they sold tickets, other goods or services online for more than $2,500 in 2025. That was half of the threshold for sales in 2024.\nThe threshold was set to plunge to more than $600 in sales in 2026.\nBut wait, as I said, the rules are changing yet again.\nWhen you'd be issued a 1099-K now\nThis summer, the One Big Beautiful Bill Act changed the reporting requirements for Form 1099-K — and far fewer people should be dealing with this paperwork next tax season.\n\"The reporting requirements have been retroactively restored to $20,000 in payments and over 200 transactions,\" said Mark Luscombe, principal analyst for Wolters Kluwer Tax & Accounting in Riverwoods, Illinois.\nThose thresholds are key.\nFor example, the changes in the rules mean that if a seller falls short on either component — for instance, making $15,000 through 50 sales in a year — the aggregate sales would not generate a 1099‑K, said Tom O’Saben, enrolled agent and director of tax content and government relations for the National Association of Tax Professionals.\n\"Casual ticket resellers, such as Lions season ticket holders, likely won’t receive a 1099-K unless they exceed both that high-dollar and high-transaction threshold in a year,\" O'Saben said.\nYet, O'Saben warns that there might be some glitches. Some payment processors, he said, could choose to issue 1099-Ks even below the legal threshold as a conservative measure, to simplify compliance or maintain uniform reporting.\nAnd he warned that mistakes also happen with mismatched records, duplicate accounts, or misclassification that can generate forms for amounts under the threshold.\nIn addition, O'Saben said a handful of states have their own lower 1099-K thresholds, including Massachusetts, Vermont and Virginia. In those states, for example, sellers could still see a 1099-K at $600 or less, regardless of federal law.\nWhile each platform reports separately, O'Saben said, if a seller is close to the threshold across different platforms, sometimes a platform might issue a form even if each platform is under the $20,000 and 200 transactions mark.\nSellers flagged as “business” or “professional” sellers on platforms may get 1099-K forms at lower internal thresholds, even without hitting the federal limits.\nO'Saben said it's best not to ignore a 1099-K if you get one, as the IRS has received that paperwork too, even if you received the 1099-K in error.\nThe 1099-K only shows your gross receipts, not your profit. So, the number you see on any 1099-K might not be fully taxable and that's why you must have good records.\nPrepare to be confused\nNo doubt, taxpayers could be more befuddled than ever, especially if they paid attention to earlier announced changes in the 1099-K rules that now will no longer take place.\nLuscombe noted that the IRS has announced that it will not adjust 1099 forms for changes in the mega tax bill until 2026.\n\"If the IRS does not update the 1099-K instructions for 2025, taxpayers may have some confusion as the 1099-K instructions may still refer to a $2,500 filing threshold for 2025 when the threshold is in fact much higher,\" Luscombe said.\nThe same $20,000 and 200 transactions threshold will apply for 2026. Things would be less confusing when people file 2026 tax returns in 2027, Luscombe said, because the IRS promises to update the 1099-K form by then.\nThe IRS had yet to update some of its 1099-K tips as of late August, several weeks after President Donald Trump signed the \"One Big, Beautiful Bill\" into law on July 4.\nAgain, the new rules do not change what counts as income or how tax is calculated.\nTechnically, a profit is taxable whether you receive a 1099-K or not. You'd owe taxes on the income you generate that exceeds the cost of what you sold, whether we're talking about selling University of Michigan football tickets or culling your closet.\n\"Whether or not you receive a Form 1099-K,\" the IRS states online, \"you must still report any income on your tax return. This includes payments for any goods you sell (including personal items such as clothing or furniture sold at a gain) or services you provide.\"\nIf you sell an old leather blazer for $150 and you originally paid $600 for it, for example, you're not going to face a tax bill. You lost $450 on that deal and casual sellers cannot claim the loss to reduce their tax bill.\nResale platforms such as StubHub, Ticketmaster, Etsy, eBay and others all list information online about when they're sending out a 1099-K. But you will have to look at your own numbers to know more about when you're going to owe taxes and when you're not.\nContact personal finance columnist Susan Tompor: stompor@freepress.com. Follow her on X @tompor."
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/01/31/what-is-1099k-tax-form/78063074007/",
      "text": "1099-K tax form new to you this year? What it means when filing for 2024\nDid you just receive a form called a 1099-K, a form that you never, ever saw in your lifetime? Well, do not ignore any 1099-K that pops up. Take your time to understand this one.\nMore taxpayers will be bewildered when a 1099-K hits the mailbox this tax season. And the temptation might be to pitch it, which would be exactly the wrong thing to do.\nThis year, taxpayers will receive a 1099-K from payment card companies, payment apps and online marketplaces when the amount of their business transactions during 2024 was more than $5,000.\n\"How many people have sold something online? Or otherwise taken a payment through an online app, like PayPal or Venmo?\" asked Andy Phillips, vice president of The Tax Institute at H&R Block.\nPlenty of people. But most people didn't get a 1099-K in the past, Phillips said, because a \"super high threshold\" existed for issuing a 1099-K.\nUnder the old standard, the 1099-K was only sent to those who had received more than $20,000 and had more than 200 transactions on third-party payment processing platforms in 2023 and earlier years.\nA lower threshold of $5,000 for 2024 means a bigger paper trail for the Internal Revenue Service to follow relating to taxable transactions.\nThis year, \"a lot more people are going to get a 1099-K and not know what to do with it,\" Phillips said.\nThe threshold is currently set to drop again in 2025, which means you'd receive a 1099-K during next year's tax season if you have transactions for more than $2,500 this year.\nCommon examples for when people could be surprised by a 1099-K include selling concert tickets for substantially elevated prices, like those for the Taylor Swift Eras Tour, which ran through 2024.\nOr maybe you sold football tickets online — such as Detroit Lions or Philadelphia Eagles tickets, another in-demand ticket — during the past season or the playoffs. You would have to have pushed above that $5,000 threshold in 2024 to receive a 1099-K for this tax season.\nResale platforms such as StubHub, Ticketmaster, Etsy, eBay and others all list information online about when they're sending out a 1099-K. But you'd want to know more about what's taxable and what's not.\nThe American Rescue Plan Act of 2021 revamped reporting requirements for third-party networks and initially was to trigger a 1099-K if you had more than $600 in transactions. We've not seen such a drastic change yet.\n\"The IRS has been delaying implementation,\" said Mark Luscombe, principal analyst for Wolters Kluwer Tax & Accounting in Riverwoods, Illinois.\nThe IRS is phasing in changes in the threshold, which, according to the IRS, would allow the agency to address the complex administrative challenges that will pop up once millions of additional 1099-K forms start being issued. The phase-in also gives taxpayers more time to adjust.\nRight now, we're set to hit that $600 threshold — the limit that the law technically requires — in 2026 and afterward to cover transactions that are more than $600.\nLuscombe said it's possible that Congress will change the law before the $600 threshold goes into place and raise the limit back up by some amount again to avoid an onslaught of 1099-Ks.\n\"People should start seeing 1099-Ks that they hadn't been used to getting in the past,\" Luscombe said.\nWhat Trump says on 'no tax on tips'\nRepublicans have been critical of the efforts by the IRS to delay a flood 1099-K forms hitting mailboxes, and at the same time GOP leaders are calling for repealing the American Rescue Plan Act provision involving the expansion of 1099-K paperwork to more taxpayers.\nJason Smith, chairman of the U.S. House Ways and Means Committee, posted a statement in October titled: \"Will the IRS save Democrats from implementation of their own unpopular 1099-K surveillance scheme?\"\nThe statement noted that gig workers use apps like Venmo and PayPal to sell services and receive tips and indicated that lowering the threshold to $600 would trigger a massive burden on more middle income taxpayers.\nThe Missouri Republican said the burden will be the hardest on taxpayers earning less than $200,000 a year.\n“In fact, it will operate like an additional tax on tips — making life harder for hairdressers, Uber drivers and other gig workers just trying to make a living,\" Smith stated.\n\"If even the IRS is afraid to implement this monster, then repealing it is just common sense,\" Smith said in October.\nPresident Donald Trump on Jan. 25 said a legislative package he's working on with Republican lawmakers to enact his domestic agenda will include his campaign pledge to eliminate taxes on tips.\nWhite House and Republican congressional leaders are discussing using the budget reconciliation process to pass some broader proposals, including the extension of Trump's Tax Cuts and Jobs Act of 2017, which is set to expire at the end of 2025, and initiating a no tax on tips rule.\nWhat's taxable and what's not\nGranted, the IRS has noted, that all income, no matter the amount, is taxable unless it’s excluded by law whether a Form 1099-K is sent or not.\nWhat taxpayers need to know, though, is that receiving the extra 1099-K paperwork does not mean you're always dealing with a taxable situation. Yes, it could get really tricky.\nYou pay taxes on a gain, not a loss. And the 1099-K only shows your gross receipts. The number you see on the 1099-K might not be fully taxable.\nYou'd pay taxes on the profit, so you'd need to take into account what you paid for an item that you sold online too, such as Detroit Lions or Taylor Swift tickets, as well.\n\"Always remember that the amount reported on a tax form is not necessarily the full amount that's taxable,\" Phillips said.\nIf you sold something online, Phillips said, you probably paid something for whatever you sold. Or he said if you provided a service, you probably have expenses related to providing that service.\nIf you sell a designer handbag for $200 and you paid $500 for it, you're not going to face a tax bill. You lost $300 on that deal.\nOn the other hand, the IRS notes, if you bought concert tickets for a $500 purchase price and sold them for $900 to someone else, you have a gain of $400. And the gain on a sale of a personal item is taxable.\nA key point to know here: The loss on the sale of a personal item is not deductible. Don't expect a tax break there.\nThe IRS notes online that if you had a seasonal crafts business and accepted money through payment cards or payment apps, you'd receive a 1099-K \"for the gross payment amounts sent to you through the use of a payment card during the calendar year, no matter how much the total.\"\n\"This reporting requirement for payment cards has not changed, and there is no minimum reporting threshold for these types of payment transactions,\" the IRS states.\nIf the 1099-K shows the sale of a personal item that was sold at a loss, you'd have to reconcile that on your tax return.\nYou'd enter those amounts that were included in error or involving personal items sold at a loss at the very top line on Schedule 1 for 2024 returns. This area is even above the section called \"Part 1: Additional Income.\"\n\"The place at the top of Schedule 1 to enter incorrect 1099-K information is new,\" Luscombe said.\nIn addition, third-party networks might not necessarily know whether some transactions are personal transfers, such a money sent to a friend to split the cost of a meal, or taxable business deals, such as selling your football tickets online at a profit.\n\"You might get a 1099-K for a transaction that wasn't even taxable,\" Luscombe said.\nOne example of an amount included on a 1099-K in error, he suggested, might include a situation such as when a roommate reimburses you via a third-party payment provider for the rent you paid to a landlord if you covered the full cost.\nIt's important not just to toss that 1099-K aside and ignore it. \"The IRS would have gotten that also and won't know it's not taxable unless you tell them,\" Luscombe said.\nContact personal finance columnist Susan Tompor: stompor@freepress.com. Follow her on X @tompor."
    },
    {
      "url": "https://www.usatoday.com/sports/",
      "text": "NBA power rankings: How teams stack up as training camps loom\nNBA\nMercury upend Fever for fifth straight win as WNBA playoffs loom\nWNBA\nColorado coach Deion Sanders to play freshman QB Lewis against Delaware\nBig 12\nVenus Williams' US Open doubles run ends with loss to No. 1 seeds\nUS Open\nCollege basketball hall of fame coach George Raveling dead at 88\nMen's College Basketball\nBuccaneers' Goedeke signs extension, per reports\nNFL\nPenn State holds off Ohio State at top of NCAA Re-Rank 1-136 after Week 1\nCollege Football\nCan this Super Bowl winner make history again just one season later?\nNFL\nBelichick's humiliating debut shows UNC isn't ready for SEC spotlight\nCollege Football\nMicah Parsons agent denies Jerry Jones' version about contract offer\nNFL\nOklahoma State, Oregon coaches trade shots about money ahead of matchup\nCollege Football"
    },
    {
      "url": "https://help.ticketmaster.com/hc/en-us/articles/9584873455889-1099-K-Form-Answers-to-Some-Common-Questions",
      "text": "The answers below to common questions are for information purposes only. Ticketmaster cannot provide tax advice. If you have questions about your taxes, you should consult your tax advisor.\nTo ensure there aren’t any issues or delays with your payout, please follow these steps to submit your taxpayer information:\n- Go to the Seller Tax Details form and sign in using the email and password associated with your Ticketmaster account.\n- Select an option under My Location to certify your citizenship.\n- Note: If you are a non-U.S. citizen or resident, the IRS still requires us to ask for certain information to verify your non-U.S. status.\n- Fill in your legal name used for tax purposes under My Info.\n- Provide your Tax Identification Number (TIN) under My Tax Info. Your TIN is usually your Social Security Number.\n- Fill in your permanent residence address under My Address.\n- Click Submit.\nThe Internal Revenue Service (IRS) and some U.S. state tax authorities require online marketplaces, including but not limited to Ticketmaster, to report the amounts you earn from sales. If your gross transactional amount reaches the federal or state reporting thresholds, you’ll get a Form 1099-K from Ticketmaster to use when filing your taxes. Receiving a Form 1099-K from Ticketmaster doesn’t necessarily mean you’ll have to pay taxes on your ticket sales, it just provides the total gross transactional amount processed by Ticketmaster during that calendar year.\nReporting thresholds are subject to change. Federal reporting thresholds can be found here. State reporting thresholds can be found on state tax authority pages.\nBefore you receive payout for selling on Ticketmaster, you’ll be asked to complete our secure Seller Tax Details form. You’ll need to provide your Name, Address, Phone Number, and Taxpayer Identification Number (this can be a Social Security Number, Individual Taxpayer Identification Number or Employer Identification Number). To avoid delays in processing your payout, it’s important to make sure that the information you provide on the form matches what you use for tax purposes. As a safety note, Ticketmaster will never ask you to provide this information directly over the phone or via email.\nOnce you login and submit your taxpayer information on our secure Seller Tax Details page, Ticketmaster will submit your information to the IRS for verification. To avoid issues with processing, please ensure that the name you provide in the form matches the name that you use for tax purposes, and that all fields are entered accurately. Ticketmaster will never ask you to provide this information over the phone or in an email. Once verified, Ticketmaster will send you a confirmation via email.\nYour Seller Tax Details will be stored within Ticketmaster's secure database. For more information regarding Ticketmaster's use of this data, please refer to our Privacy Policy.\nFor any tax year in which a Form 1099-K is required, Ticketmaster will typically provide a copy of the form by January 31 of the following year. If your annual gross transactional amount does not exceed the federal or state reporting thresholds, you will not receive a Form 1099-K for that tax year. If you have any questions about tax reporting or filing, please consult your tax adviser. Learn more about the Form 1099-K.\nIf you exceeded the federal or state thresholds for the previous year, Ticketmaster will send you a Form 1099-K. You may also download it directly online via our Download Your 1099-K page. If you do not exceed the annual threshold, you will not receive a Form 1099-K. Learn more about the Form 1099-K.\nWhen we refer to the “gross transactional amount,” that’s the total value of your sale. This total value includes the price you sold your tickets for, plus fees and any other amounts related to your ticket sales. The gross transactional amount is not adjusted for credits, discounts or refunds. As a note, the gross transactional amount will be greater than your total seller payout. Learn more about the Form 1099-K.\nIf you sold tickets through more than one Ticketmaster account, you’ll need to sign in to each account to submit your taxpayer information via our secure Seller Tax Details form. If the annual gross transactional amount of your combined sales across your accounts exceeds the federal or state reporting thresholds, we’ll provide a separate Form 1099-K for each account — even if the individual accounts do not exceed those thresholds. Learn more about the Form 1099-K.\nTo accurately report sales information, Ticketmaster collects taxpayer information (or confirmation of exemption from U.S. tax law). If the annual gross transactional amount of your sales does not exceed federal or state reporting thresholds, you will not receive a Form 1099-K from Ticketmaster. Learn more about the Form 1099-K.\nIf you are not a U.S. citizen or resident, you may not be subject to reporting or withholding requirements. However, Ticketmaster is required to verify your non-U.S. status to comply with IRS regulations. To avoid delays with processing your payout, please make sure that all fields are entered accurately. As a reminder, Ticketmaster will never ask you to provide this information directly over the phone or via email. Learn more about the Form 1099-K.\nCorporations are subject to withholding thresholds and Form 1099-K reporting. Learn more about the Form 1099-K."
    }
  ],
  "argos_summary": "The article explains that the IRS has again altered the 1099‑K reporting thresholds for online ticket sales, setting a $2,500 threshold for 2025 (though the law retroactively restored the $20,000/200‑transaction rule for that year) and a $600 threshold in 2026.  Casual resellers who fall below these limits may not receive a 1099‑K, but they still must report any profits on their tax returns.  The piece stresses the importance of detailed record‑keeping and warns that even if a 1099‑K is issued, the form only reports gross receipts, not taxable profit, and errors or state‑level lower thresholds can still trigger the form.",
  "argos_id": "V45BUL36R"
}