{
  "url": "https://www.businessinsider.com/ghislaine-maxwell-federal-prison-camp-transfer-bryan-texas-2025-8",
  "authorsByline": "Jacob Shamsian,Natalie Musumeci",
  "articleId": "bc75233c3178430cbd8c1daa8dd2dc9f",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/68b1dfc2194a2d49b8af73f8?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-01T09:31:01+00:00",
  "addDate": "2025-09-01T09:36:49.250262+00:00",
  "refreshDate": "2025-09-01T09:36:49.250264+00:00",
  "score": 1.0,
  "title": "Ghislaine Maxwell joins Jen Shah at 'Club Fed.' The 'Real Housewives' star's prison consultant calls it a major upgrade.",
  "description": "Jeffrey Epstein's associate has moved to the same prison camp as Elizabeth Holmes and Jen Shah. It's an improvement, according to a prison consultant.",
  "content": "Life at Ghislaine Maxwell's new prison may not compare to Jeffrey Epstein's New York and Caribbean island properties, but it's a vast improvement over her previous digs.In July, the Bureau of Prisons moved Maxwell, who is serving a 20-year prison sentence for trafficking girls to Epstein for sex, to FPC Bryan, a prison camp in Texas that also houses Theranos founder Elizabeth Holmes and former \"Real Housewives\" star Jen Shah.The minimum-security facility resembles a community college or a small office park, said Justin Paperny, a prison consultant who has advised Shah, along with other women who have served sentences there.But the most important aspect of Maxwell's new environment may be the attitudes of the people around her.The biggest difference between a camp like FPC Bryan and higher-security prisons is that \"cooperation isn't frowned upon,\" said Paperny, who himself was sentenced to 18 months in prison for his role in a hedge fund fraud and now runs the consultancy White Collar Advice.In other prisons, inmates might ostracize or retaliate against other prisoners who provide information to the Justice Department to continue criminal investigations. The people incarcerated in FPC Bryan have no such stigma, Paperny said.Maxwell's recent interview with Deputy Attorney General Todd Blanche, where she answered questions about Epstein and his connections with other powerful people, likely gave her the opportunity to make the move, Paperny said.\"She has leverage,\" Paperny said. \"Because she has information she can give to the Department of Justice that could have helped their interests in moving forward in the investigation.\"During the interview, which took place in a Tallahassee courthouse near the prison where she had been incarcerated following her 2021 sex-trafficking conviction, Maxwell praised Trump and said she was unaware of any sexual abuse involving him. Blanche said he wanted to speak with Maxwell after the public fallout around the Justice Department's decision not to release its Epstein files.She maintained the defense her lawyers presented during her trial, during which they argued that Epstein compartmentalized his life and she wasn't privy to any abuse. Maxwell is appealing her conviction and sentence.Paperny said he believes Maxwell's role in Epstein's life gave her the ability to ask for a better setup.\"Because they want information from her so badly, she was able to say, 'Cool, you send me down to a minimum security camp where there won't be any threats of violence, because I cooperated, and because so many people inside of that camp cooperated,'\" he said.An attorney for Maxwell declined to comment.The Bureau of Prisons did not respond to Business Insider's inquiries about Maxwell's move to the Texas prison camp, which is about 100 miles outside Houston.Aside from a more relaxed environment, FPC Bryan has other advantages, including the potential for a furlough, which allows her to leave the prison for up to 48 hours, according to a handbook published by the BOP in 2023.While it would be unusual for a sex offender like Maxwell to be granted a furlough, it was possible depending on her level of cooperation, Paperny said.\"It depends on how much information she can give,\" he said. \"Things really change and open up when you're in a camp.\"The former British socialite's move to the cushy \"Club Fed,\" as it is known, is a major upgrade from her previous home.For the last three years, Maxwell spent her days locked up at the low-security Federal Correctional Institution in Tallahassee, Florida, alongside nearly 1,200 other male and female inmates.The minimum-security facility where Maxwell now lives houses about 600 other women in a much more relaxed and less confined environment.Minimum-security facilities like FPC Bryan have dormitory housing, a \"relatively low\" staff-to-inmate ratio, and limited or no perimeter fencing,\" according to the Bureau of Prisons website. Those kinds of institutions are \"work-and program-oriented,\" the federal agency says.On the other hand, low-security facilities like FCI Tallahassee feature double-fenced perimeters and have more staff per prisoner.Maxwell appears to have made the best of her time there. The Daily Mail reported that she taught etiquette and yoga classes and worked in the prison library.A Department of Justice watchdog report released in 2023 highlighted \"alarming\" conditions at FCI Tallahassee, including moldy bread, rotting food, rodents, and leaks being plugged up with menstrual products.\"Among the most concerning were the alarming conditions of its food service and storage operations,\" the report by the Justice Department's Office of the Inspector General said at the time.Paperny said Shah, the former \"The Real Housewives of Salt Lake City\" star convicted of financial fraud, could offer Maxwell some insights from her experience.Instead of wallowing around, Paperny said, Shah is making the most of her time in prison — including feeling remorse for the victims she financially defrauded.Sitting around and doing \"the bare minimum\" will make \"every day feel like Groundhog Day,\" Paperny said. FPC Bryan, he said, offers opportunities to work, exercise, and more easily correspond with friends and family members.\"If Ghislaine can do that, they set themselves up for more success,\" he said. \"If people don't do that, what happens is the prison term feels like an eternity because you just sit around playing the blame game, and it's just absolutely miserable.\"The biggest difference between a camp like FPC Bryan and other prisons is that it provides work opportunities. According to the 2023 handbook, FPC Bryan requires all inmates to hold a job assignment.It's not clear how appealing the positions will be for Maxwell, an Oxford University graduate. The handbook says opportunities are available through the company UNICOR, which produces services and operates factories that make products for the federal government. Examples of UNICOR products and services listed in the handbook include \"electronic cable assemblies, executive and systems furniture, metal pallet racks, stainless steel food service equipment, mattresses, towels, utility bags, brooms, data entry, signage, and printing.\"Maxwell may also have the opportunity to teach yoga, pilates, and other physical fitness classes. The handbook says FPC Bryan also offers arts and crafts, though Maxwell would be required to ship her projects out of the facility after they are completed.The facility's commissary list offers some intriguing food options. Maxwell could buy Thai noodles, caramel candies, Nutella, salmon, shredded beef, and dozens of other options.The commissary list also includes a large selection of shampoos and cosmetics, like lip gloss and hair dye.If Maxwell were to stick to the standard BOP \"National Menu,\" which includes a \"no flesh option,\" Paperny said she would be disappointed.\"I worked in the kitchen,\" Paperny said. \"I would see meat that had expiration dates that had passed. I mean, veggies — they don't look like vegetables. They look like they've been in the sun for 2,000 years.\"",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "other prisons",
      "weight": 0.087849766
    },
    {
      "name": "Maxwell",
      "weight": 0.07906569
    },
    {
      "name": "Ghislaine Maxwell",
      "weight": 0.078814134
    },
    {
      "name": "prison",
      "weight": 0.0721123
    },
    {
      "name": "FPC Bryan",
      "weight": 0.0690025
    },
    {
      "name": "other powerful people",
      "weight": 0.06257425
    },
    {
      "name": "other options",
      "weight": 0.062216472
    },
    {
      "name": "other women",
      "weight": 0.061286908
    },
    {
      "name": "other prisoners",
      "weight": 0.060444083
    },
    {
      "name": "other advantages",
      "weight": 0.05909339
    }
  ],
  "topics": [
    {
      "name": "TV"
    },
    {
      "name": "Epstein Case"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97802734375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.890625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.79150390625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.7802734375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.456298828125
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.4453125
    }
  ],
  "sentiment": {
    "positive": 0.14365678,
    "negative": 0.5016563,
    "neutral": 0.35468695
  },
  "summary": "Ghislaine Maxwell, a former British socialite known for her role in the 'Real Housewives' star, has moved to a minimum-security prison in Texas, where she is serving a 20-year prison sentence for trafficking girls to billionaire Jeffrey Epstein for sex. The Bureau of Prisons moved Maxwell to FPC Bryan, a prison camp in Texas that also houses Theranos founder Elizabeth Holmes and former \"Real Housewife\" star Jen Shah. The difference between the two camps is that they offer more freedom for cooperation and fewer threats of violence towards other prisoners who provide information to the Justice Department for criminal investigations. Maxwell's move to the Texas prison camp is seen as a major upgrade from her previous home, where the facility houses about 600 other women in a more relaxed and less confined environment. The potential for a furlough, which could be granted to Maxwell depending on her level of cooperation, could be dependent on her cooperation. An attorney for Maxwell declined to comment on the matter.",
  "shortSummary": "Ghislaine Maxwell, now in FPC Bryan, a Texas prison camp housing Jen Shah and Elizabeth Holmes, has improved her life under supervision and potential for a furlough.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a79073120aca41f1b82989533e24a745",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ghislaine Maxwell has been transferred from a low‑security facility in Florida to the minimum‑security FPC Bryan camp in Texas, a move described as a significant upgrade. The new camp, which also houses Elizabeth Holmes and Jen Shah, offers a more relaxed environment, work opportunities, and the possibility of furloughs for cooperative inmates. Maxwell’s transfer is linked to her cooperation with the Justice Department, providing her leverage for better conditions. The move reflects the broader practice of rewarding inmates who provide valuable information with improved living arrangements.",
  "argos_id": "VJVEJQIIX"
}