{
  "url": "https://www.forbes.com/sites/zakdoffman/2025/09/03/microsoft-warns-stop-using-google-chrome-windows-users-change-browser/",
  "authorsByline": "Zak Doffman",
  "articleId": "87980095b9b8435c9264f95f26e7d060",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/5e66cbd8e1e6170007593a74/0x0.jpg?format=jpg&crop=3146,1770,x424,y554,safe&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T08:26:13+00:00",
  "addDate": "2025-09-03T08:40:44.844083+00:00",
  "refreshDate": "2025-09-03T08:40:44.844085+00:00",
  "score": 1.0,
  "title": "Microsoft Warns Stop Using Google Chrome—Windows Users Change Browser",
  "description": "But it's bad news for Microsoft, as Chrome suddenly surges to huge 70% market share.",
  "content": "Between 50 and 100 million Windows users have switched browsers in recent weeks, just as Microsoft reveals its new warning to stop using Google Chrome. The problem is that this switch has not gone as planned — for Microsoft at least.\n\nMicrosoft’s latest campaign against Chrome generated plenty of headlines (1,2,3), with most complaining the tactics crossed a line. Pre-release Windows software targets heavy Chrome users with a push to the Edge. Now it seems Windows users have voted with their feet — or rather their keyboards. Chrome has just hit new heights.\n\nUntil July, Chrome’s desktop market share had been flat for some time, hoovering at around 65%, per Statcounter’s representative data. Not any more. Google’s browser is now even more dominant, increasing its share to more than 70%. Edge, meanwhile, has lost around 10% of its own much smaller share, now down to under 12%.\n\n“Browse securely now,” Microsoft warns Windows users installing Google Chrome, adding that “Microsoft Edge runs on the same technology as Chrome with the added trust of Microsoft.\" A rethink could now be required, as the campaign has not even maintained Edge’s existing market share. The question now is what happens when Gemini and Copilot are fully integrated to fend off new pureplay AI offerings.\n\nThis new data caps a good few days for Google on the Chrome front, with a U.S. federal antitrust ruling that enables the search giant to keep Chrome in-house. The browser is a money machine at the heart of Google’s search and ad empire, a shop window between its huge user base and the data- and ad-driven web it dominates.\n\nFor Windows users, nothing has come close to unseating Chrome’s de facto default status in the Windows ecosystem or even denting its market share. And my sources at Google shrug off Microsoft’s attempts, given the stickiness of their product. Even so, for Chrome to add as many new users as implied by this data is a major surprise.",
  "medium": "Article",
  "links": [
    "https://www.forbes.com/sites/zakdoffman/2025/09/02/if-you-see-this-warning-your-facebook-is-being-hacked/",
    "https://www.xda-developers.com/microsoft-target-google-chrome-edge/",
    "https://www.bloomberg.com/news/articles/2025-09-02/google-not-required-to-sell-chrome-in-court-antitrust-ruling",
    "https://www.forbes.com/sites/zakdoffman/2025/09/02/google-issues-critical-update-for-all-25-billion-gmail-users/",
    "https://gs.statcounter.com/browser-market-share/desktop/worldwide",
    "https://www.windowslatest.com/2025/08/12/microsoft-edge-tests-windows-11-taskbar-pin-alert-if-youre-a-google-chrome-addict/",
    "https://www.techradar.com/computing/windows/sorry-microsoft-your-latest-attempt-to-get-people-to-switch-over-to-edge-in-windows-11-is-crossing-a-line",
    "https://www.forbes.com/sites/zakdoffman/2025/08/13/microsoft-warns-windows-users-to-stop-using-google-chrome/",
    "https://www.bgr.com/1938645/microsoft-campaign-move-chrome-users-to-edge/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google Chrome",
      "weight": 0.13398984
    },
    {
      "name": "heavy Chrome users",
      "weight": 0.13169551
    },
    {
      "name": "Windows Users",
      "weight": 0.120889455
    },
    {
      "name": "Windows users",
      "weight": 0.120889455
    },
    {
      "name": "Chrome",
      "weight": 0.11285022
    },
    {
      "name": "Microsoft Edge",
      "weight": 0.10502726
    },
    {
      "name": "Microsoft",
      "weight": 0.09002728
    },
    {
      "name": "Windows",
      "weight": 0.08738726
    },
    {
      "name": "Google",
      "weight": 0.08638441
    },
    {
      "name": "Pre-release Windows software",
      "weight": 0.085407734
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.95166015625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.69482421875
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.3115234375
    }
  ],
  "sentiment": {
    "positive": 0.062167402,
    "negative": 0.7621767,
    "neutral": 0.1756559
  },
  "summary": "Microsoft has warned Windows users to stop using Google Chrome, citing a recent increase in its desktop market share to over 70%, and that between 50 and 100 million Windows users have switched to another browser. The warning comes after Microsoft's pre-release Windows software targeted Chrome users with a push to the Edge. However, this shift has not been successful, with only 10% of Edge's market share now down to under 12%. This could be a wake-up call for Microsoft, as the campaign has not even maintained Edge's existing market share.",
  "shortSummary": "Microsoft's warning to Windows users to stop using Google Chrome has prompted significant switchbacks, with Chrome gaining market dominance and Edge declining.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0d371ba033fe4f26ab044c85f709d52a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.windowslatest.com/2025/08/12/microsoft-edge-tests-windows-11-taskbar-pin-alert-if-youre-a-google-chrome-addict/",
      "text": "If you use Google Chrome and open Microsoft Edge sometimes, but then proceed to close it, you might soon see an alert that recommends you pin the browser to the Windows 11 taskbar. This is an internal experiment that may or may not ship, but it makes it obvious that Microsoft really wants you to stop using Google Chrome and open Edge instead.\nIt’s a well-known fact that Microsoft likes to promote Edge on Windows 11. For example, see the above screenshot. It’s also facing an antitrust complaint by Opera in Brazil for anti-competitive behaviour. I’m not going to get into those, as Google is more culpable in that than Microsoft. But a recent Microsoft Edge experiment caught my attention.\nAs first spotted by Windows Latest, Edge’s Canary update that began rolling out about two hours ago today, comes with Edge growth flags for a “pin Edge when you close the browser” prompt. The “Pin Microsoft Edge” campaign isn’t exactly new, but the flags have a specific mention of Google Chrome.\nWe found the new feature flags in Edge Canary, and it could be an internal experiment and may or may not ship to consumers. These feature flags do not work right now.\nOne flag is called “msOptimizeChromePBSignalForPinningOnCloseCampaigns,” which has an obvious hint “PinningOnClose”. “PBSignal” is an internal behaviour signal used to decide who should see that pop-up. Do you meet the specified internal Chrome threshold to see the alert? If not, you’ll not see it if you exit the browser.\nMicrosoft doesn’t want to annoy you if you like to use multiple browsers in your workflow, including Edge.\nI’m not making up this “Heavy Chrome sure” segment by the way. It’s literally mentioned in another flag called “msPinningCampaignChromeUsageGreaterThan90Trigger.” The campaign does not appear for everyone, but you’ll only see the pop-up to pin Microsoft Edge to the taskbar when Chrome’s usage is greater than 90%.\nNow, we don’t know how Microsoft determines Chrome usage. Could it be the default browse stats? Or import signals? Or does Microsoft collect telemetry? We don’t know, and I’m not going to speculate anything here, as these are feature flags that do not work and could be an internal idea that will never ship.\nRegardless, the intent is clear. Microsoft wants to show a “pin to taskbar” pop-up for Edge if you use Chrome most of the time.\nThere’s another variant pin campaign called “msPinningOnCloseCampaignsChromeEngagedUser.”\nIt targets those who are designated as “Chrome engaged” (either those who use Chrome more frequently than other browsers). Finally, there’s a flag that would target users who do not use Chrome, so it could be more subtle or worded differently.\nPerhaps, Microsoft may ask those who use Edge to pin the browser to the taskbar, even if they don’t use Chrome.\nEverything suggests that this is an exit-time nudge that asks you to pin Edge to the taskbar/Start. Whether you see it, and which version you see, depends on an internal “should we show this?” signal and on how heavily you use Chrome, with a hard trigger at a “>90% Chrome usage” threshold.\nDo you think an experiment that recommends you to pin Microsoft Edge will help improve the browser’s market share in the long run? Let us know in the comments below."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/09/02/google-issues-critical-update-for-all-25-billion-gmail-users/",
      "text": "In a surprise update, Google has just slammed the viral news story warning all 2.5 billion Gmail users to beware a mass data breach as “entirely false.” Google and Gmail newsfeeds have been littered for days with the story, which is not true. But Google has also issued some critical advice for users on how to protect their accounts.\nGoogle’s almost unprecedented decision to warn all 2.5 billion Gmail users to ignore headline claims (1,2,3) of a mass data breach was prompted by the news getting “out of hand.” Prior to Google’s update, the fake news showed little sign of slowing down.\nIn a Workspace blog On Monday, Google posted that “several inaccurate claims surfaced recently that incorrectly stated that we issued a broad warning to all Gmail users about a major Gmail security issue. This is entirely false.”\nBut Google also cautioned users that “it’s always the case that phishers are looking for ways to infiltrate inboxes,” assuring that “our protections continue to block more than 99.9% of phishing and malware attempts from reaching users.”\nThe blog came a day after Google told me “several inaccurate claims surfaced this week incorrectly claiming we issued a broad warning to all Gmail users about a major Gmail security issue. This is entirely false.” But two days later, even Google News still brands the story as “Google warns Gmail users of data breach, urges password changes.”\nThe danger in conflating different stories into a data breach that never was is that users become inured to the real advice. It’s true that most Google account holders do not update passwords regularly — which they should. And it’s also true that most Gmail users should add passkeys to their email and other accounts.\nGoogle reiterated this advice in its fake news update: “For additional protection, we encourage users to use a secure password alternative like passkeys.” It would be good to think that some good will come out of this furor. And if millions more of Gmail’s 2.5 billion users take this opportunity to add passkeys, it will be worth it.\nGoogle’s own research says only 34% of U.S. account holders use passkeys. And so perhaps that’s the real critical update from Google here — to add a passkey now, rather than the short-term news cycle which will fade within days and soon be forgotten.\nAs ever with passkey advice, it’s also imperative to remind users that even if you add a passkey, your password remains a vulnerability if it provides access to your account. That’s why Microsoft and others recommend deleting passwords, albeit Google isn’t there yet. Make sure your password is strong and unique and that you enable two-step verification using something other than SMS. An authenticator app is fine."
    },
    {
      "url": "https://www.techradar.com/computing/windows/sorry-microsoft-your-latest-attempt-to-get-people-to-switch-over-to-edge-in-windows-11-is-crossing-a-line",
      "text": "Sorry, Microsoft: your latest attempt to get people to switch over to Edge in Windows 11 is crossing a line\n- Microsoft has a new plan to target Chrome addicts to use Edge more\n- A planned pop-up is only hidden in testing right now, though\n- It may never be enabled, even in preview builds of Windows 11 - and I hope that's the case, as I think this is a dangerous road for Microsoft to go down\nMicrosoft is apparently testing another way to drive Edge adoption and attempt to cajole Chrome users into switching to its browser in Windows 11.\nWindows Latest reports that in a new preview build of Windows 11 (in the Canary channel) there's some work hidden in the background pertaining to a new campaign to promote Edge.\nThis is targeting those who use Google's Chrome browser with a pop-up to get them to pin Edge to the taskbar when they close Microsoft's browser. Specifically, it's aimed at those who use Chrome a lot, and Edge a little (obviously you have to use Edge a bit to be exiting the browser in order to be shown the nag screen).\nWindows Latest observes that one of the hidden flags - and remember, they are just lurking in the background, and not activated yet, even in testing - is for 'pin Edge when you close the browser' (so with it pinned permanently to the taskbar, you're more likely to come back and use it).\nBut the shadier move here is another flag which is for 'msPinningCampaignChromeUsageGreaterThan90Trigger' - and the key bit here is that the trigger for the pop-up appearing is if the Windows 11 user's Chrome usage is greater than 90 (meaning 90%.)\nSo, this means that those who run Edge more - who are using Chrome less than 90% of the time - won't see this pop-up. The reason why, presumably, is because Microsoft doesn't want to annoy people who already use its web browser a fair chunk of the time.\nHowever, those who almost exclusively run with Chrome (90% of the time, or more) will see this nag prompt, and the question is: how might Microsoft quantify whether any given person's Chrome usage is 90% or more?\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAnalysis: Microsoft needs to tread carefully\nOkay, so we can't jump to any conclusions about Microsoft snooping on folks on the basis of some flags hidden in testing - all of this remains theoretical and speculation. But this does appear to indicate that some sort of measurement is being mulled - and how would Microsoft gauge a heavy Chrome user? The obvious assumption is that it must be through some kind of telemetry (data collection).\nAnd regardless of the true answer behind this question, or indeed whether this feature is ever enabled - remember, it's not even live in preview, as noted - this kind of flag is not going to do anything to assuage the fears of those who believe Microsoft is 'spying' on them with Windows 11. And there's a good deal of paranoia around that issue, because Microsoft does, of course, utilize some telemetry with Windows 11. (Some of which may be justified, and some of which can be turned off - though notably not all of it, not unless you go to considerable lengths).\nSo, while we know that Microsoft collects some data on Windows 11 users, glimpses of the inner workings of the operating system laid bare like this aren't going to help the company's reputation. In my opinion, the software giant needs to tread very carefully in areas like this - and gauging browser usage to determine whether or not an Edge pop-up is shown (to Chrome addicts) is crossing a line.\nNo, it might not ever happen - and I hope it doesn't, because this really isn't a path Microsoft needs to be going any further down. With some of the pop-ups and various suggestions in Windows 11, Microsoft can argue that it's helping the user in some way - prompting to make a backup might be useful in some scenarios, for example, that's not inconceivable by any means. But in this case, Microsoft is only helping itself (and Edge).\nFrom a broader perspective, we don't need any more nagging to use the Edge browser anyway - there's already far too much of this kind of activity going on in Windows 11 (which I feel is very much counterproductive anyway).\nYou might also like\n- Microsoft finally fixes one frustrating Windows 11 pop-up – just as a more irritating one arrives to take its place\n- Microsoft promises to crack one of the biggest problems with Windows 11: slow performance\n- Microsoft has all but given up on Windows 11 SE – and it looks like the war against Chromebooks has been lost\nDarren is a freelancer writing news and features for TechRadar (and occasionally T3) across a broad range of computing topics including CPUs, GPUs, various other hardware, VPNs, antivirus and more. He has written about tech for the best part of three decades, and writes books in his spare time (his debut novel - 'I Know What You Did Last Supper' - was published by Hachette UK in 2013).\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name."
    },
    {
      "url": "https://www.bgr.com/1938645/microsoft-campaign-move-chrome-users-to-edge/",
      "text": "Microsoft Is Testing Another Awful Campaign To Get Chrome Users To Move To Edge\nIt seems Microsoft just can't get over the stranglehold that Chrome has on the browser market. According to new reports, users who mostly rely on Chrome could soon start getting pop-up notifications urging them to switch to Edge, Microsoft's Chromium-based browser.\nThis kind of behavior isn't exactly new. Microsoft has been desperate to get Chrome users to ditch Google's browser for years, even going to some extreme lengths to try to make it happen. While many of those attempts have put a target on the back of the Internet Explorer replacement, Microsoft seems intent on continuing to try its luck.\nThe latest attempt, according to Windows Latest, includes a pop-up that asks you to pin Edge to your Windows taskbar whenever the system detects extensive Chrome usage. The experiment is currently only visible in Microsoft Edge's Canary build, and it appears to have rolled out just recently. While the basic idea behind the campaign isn't new — Microsoft has been trying to get users to pin Edge for years now — the method it's using to push the notification is novel.\nWatching how much you use Chrome\nWindows Latest says that it spotted a new flag in Edge that mentions Chrome specifically. The flags don't currently work at the moment, and it's worth noting that this could just be an experimental feature that never ships to customers. But, on the off-chance it does, Chrome users will likely want to know why Windows has started trying to get them to move to Edge again.\nOne flag, which is titled \"msOptimizeChromePBSignalForPinningOnCloseCampaigns,\" appears to trigger upon closing Edge. Windows Latest says that the \"PBSignal\" mention here is an internal signal used to decide exactly which users should see the notification. This seems to feed off another flag, called \"msPinningCampaignChromeUsageGreaterThan90Trigger.\" I wasn't able to find the flags in my own version of Edge Canary, but there's a chance that only a limited number of users received them.\nIt's unclear exactly how Microsoft will measure Chrome usage here, but it does raise some questions about how much data the company is pulling from your system to control these triggers. Based on the wording, it seems likely that Chrome users will only see the notification when their usage of the browser is at or above 90%.\nNo matter how you break it down, though, the intent here is clear: Microsoft wants you to ditch Chrome and give Edge another chance. It also seems likely that the company will continue to do whatever it can to find ways to implant the idea in your brain, especially as it continues to update Edge with new features like Copilot mode."
    },
    {
      "url": "https://gs.statcounter.com/browser-market-share/desktop/worldwide",
      "text": "| Desktop Browsers | Percentage Market Share |\n|---|---|\n| Desktop Browser Market Share Worldwide - August 2025 | |\n| Chrome | 70.25% |\n| Edge | 11.8% |\n| Safari | 6.34% |\n| Firefox | 4.94% |\n| Opera | 2.06% |\n| Brave | 1.48% |\nDesktop Browser Market Share Worldwide\nEdit Chart Data\nSorry, JavaScript is required to view Global Stats charts.\nView desktop browser market share by platform\nView desktop browser market share by region\n- Worldwide\n- Africa\n- Asia\n- Europe\n- North America\n- Oceania\n- South America\n- Sweden\n- United States Of America\n- United Kingdom\n- India\n- Canada\nView desktop browser market share by year\nView all years...View all stats\nSubscribe to Global Stats by email\nWe respect your privacy and will never share your email address with any third party.\nUnderstand your visitors with Statcounter\nSee why over 1,500,000 bloggers, web designers, marketing and SEO professionals and small business owners use Statcounter to grow their business.\nLearn More"
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/08/13/microsoft-warns-windows-users-to-stop-using-google-chrome/",
      "text": "Republished on August 13 with the media response to Microsoft’s latest move.\n“Browse securely now,” Microsoft warns Windows users installing Google Chrome. “Microsoft Edge runs on the same technology as Chrome,” it says, “with the added trust of Microsoft.” This warning is not new, but it’s about to ramp up.\nChrome remains the de facto default browser for most Windows users, with almost six-times the market share of Microsoft’s Edge browser. The ongoing campaign to push Windows users to the Edge has not relented in years. Just as with Bing versus Google itself or Copilot versus Gemini, Microsoft wants its Windows users to go all-in.\nIf there are any remaining doubts that Microsoft is specifically targeting Chrome users, urging them to switch to Edge, then a new report from Windows Latest might put those to rest. A targeted campaign that “makes it obvious that Microsoft really wants you to stop using Google Chrome and open Edge instead.”\nThis latest ruse includes taskbar flags now in Canary (pre-release) which “pin Edge when you close the browser.” Per Windows Latest, this approach “isn’t exactly new, but the flags have a specific mention of Google Chrome.”\nThose flags include “msOptimizeChromePBSignalForPinningOnCloseCampaigns,” which triggers when exiting the browser. But more starkly, a new flag is called “msPinningCampaignChromeUsageGreaterThan90Trigger” and pushes users to pin Edge to their taskbar “when Chrome’s usage is greater than 90%.”\n“The intent is clear,” Windows Latest says. “Microsoft wants to show a ‘pin to taskbar’ pop-up for Edge if you use Chrome most of the time.” And this “exit-time nudge” will have “a hard trigger at a ‘>90% Chrome usage’ threshold.\nThese flags are in development for now, and perhaps this publicity will tone them down before anything is generally released. But the Chrome installation alerts and advice to change browser in attack notifications are already live in the real world.\nGoogle has accused Microsoft of dirty tricks before, as it tries to steer Windows users away from Chrome. It’s a battle that is not yet making much difference to browsing behaviors. But many enterprise users will know that Microsoft’s approach also includes mandating Edge as the browser in secure company ecosystems.\nThe response to this latest campaign has been unsurprising.\n“Microsoft Is testing another awful campaign to get Chrome users to move to Edge,” BGR says. “This kind of behavior isn’t exactly new. Microsoft has been desperate to get Chrome users to ditch Google’s browser for years, even going to some extreme lengths to try to make it happen.”\nWhile XDA Developers says “from entering your search for ‘Google Chrome download’ on Bing to clicking the website and visiting the download page, Microsoft will do its utmost best to remind you that, hey, it worked really hard on Edge, and it’s running on Chromium now, so there's no need to use another browser, honest.”\n“Sorry, Microsoft: your latest attempt to get people to switch over to Edge in Windows 11 is crossing a line,” Tech Radar says, taking an even firmer line: “It might not ever happen - and I hope it doesn’t, because this really isn’t a path Microsoft needs to be going any further down.” Put more simply, “Microsoft is only helping itself (and Edge).”\nAs to whether this will go live, XDA Developers says that while “Microsoft is still working on the flags, there’s a chance that the company decides not to go ahead with the plan. However, knowing how Microsoft has targeted Chrome in the past, I would wager that Microsoft will forge ahead and make this feature a reality, unfortunately.”\nI have approached both Microsoft and Google to get any views on this latest twist, as the browser war between the two dominant tech giants continues unabated."
    },
    {
      "url": "https://www.xda-developers.com/microsoft-target-google-chrome-edge/",
      "text": "Summary\n- Microsoft Edge may target Chrome users to pin Edge to the taskbar.\n- Variable flags monitor user activity and target Chrome-engaged users.\n- The feature is still in development, but Microsoft may proceed with implementation.\nIf you ever want to feel noticed, just try downloading Google Chrome using a clean install of Edge. On pretty much every step of the way, from entering your search for \"Google Chrome download\" on Bing to clicking the website and visiting the download page, Microsoft will do its utmost best to remind you that, hey, it worked really hard on Edge, and it's running on Chromium now, so there's no need to use another browser, honest.\nOnce you have Google Chrome installed, the pestering stops. However, Microsoft may introduce a new feature that will single out people who predominantly use Chrome and ask them if they wouldn't mind pinning Microsoft Edge to the taskbar, pretty please.\nMicrosoft is trying out making Edge even more of a pest\nWindows Latest did some digging through the latest Microsoft Edge Canary build, and it found some interesting variables. One of them has a really long name, \"msOptimizeChromePBSignalForPinningOnCloseCampaigns,\" which has a few elements to it that can be broken down to understand what it's up to.\nThe last bit, \"PinningOnCloseCampaigns,\" refers to a behavior where the user opens Edge and closes it. This triggers a notification to inform the user to try pinning Microsoft Edge to the taskbar, presumably informing them that Edge uses the same tech behind Chrome.\nThe part of that variable that reads \"PBSignal\" refers to a specific user behavior being met. Windows Latest did some more digging and found some flags related to monitoring how the user is acting: \"msPinningCampaignChromeUsageGreaterThan90Trigger\" and \"msPinningOnCloseCampaignsChromeEngagedUser\". The former will likely fire if it notices that you've used Chrome over 90% of the time versus other browsers, and the latter triggers if it thinks you're a \"Chrome-engaged user.\"\nInterestingly, Windows Latest found a flag that specifically doesn't target Chrome users, which may try to capitalise on reasons why people don't use Google's web browser. Whatever the situation, it seems to trigger only when you open and close Edge. This is pretty easily done if you accidentally click a link within Windows and quickly close it when you realize that it's opening in Edge.\nFortunately, the feature isn't quite ready to go yet, if it ever will. Given how Microsoft is still working on the flags, there's a chance that the company decides not to go ahead with the plan. However, knowing how Microsoft has targeted Chrome in the past, I would wager that Microsoft will forge ahead and make this feature a reality, unfortunately.\nIf you're curious as to how Edge holds out against the competition, check out these Edge features that are so helpful we wish Chrome had them too, plus these reasons Microsoft Edge is better than Google Chrome. Or you can ditch them both and go for a lesser-used third option."
    },
    {
      "url": "https://www.forbes.com/sites/zakdoffman/2025/09/02/if-you-see-this-warning-your-facebook-is-being-hacked/",
      "text": "Most people reading this will have a Gmail account and a Facebook account, which makes this a busy week on the security front. Gmail attack warnings are already front and center in most news feeds. And now there’s a new Facebook warning as well.\nCourtesy of Kaspersky’s Global Research and Analysis Team, users are being warned that a new threat campaign is disguised as a warning from Facebook itself that your account “has been blocked” or will be suspended after 7 days.\nThe message includes an “Appeal” button, which links to a “fraudulent support page.” From there you’re ‘tricked into downloading malware disguised as an 'appeal’ script.”\nThe payload is StealC v2 malware, which can “harvest passwords, cookies, cryptocurrency wallet data, and even access screenshots.” Suffice to say, you really don’t want to give the hackers behind these attacks access to that data on your device.\nThe attack has started in Asia and is now “likely to begin targeting more countries.” Thus the warning for users in the U.S., Europe and elsewhere to beware the accounts suspension message and the strict instruction not to click that ‘Appeal’ button.\nKaspersky says “cybercriminals often exploit users’ fear of losing account access and a perceived sense of urgency. This pressure can lead individuals to act without caution, increasing the risk of infection by malware such as StealC v2.”\n“Phishing attacks can come in many different forms,” Facebook says. “These links may appear harmless, but they can lead you to dangerous or fraudulent websites that look legitimate, where your personal information or login credentials can be stolen.”\nThis malware is a 2025 evolution on the original StealC, and “significantly enhances the malware’s capabilities and elevates the risk to both individual and corporate users.”\nKaspersky’s advice is simple and extends across the board, not just for this latest malware campaign that has been caught in the act:\n“Look for urgency or threats. Phishing attempts frequently try to create a sense of urgency or fear. Be cautious of emails demanding immediate action, such as changing a password or providing personal information.” And always “verify unsolicited messages, calls, or links, even if they appear legitimate, and never share 2FA codes.”\nThis is the latest such attack, and follows a similar warning last month. Facebook’s advice if your account is hacked can be found here."
    }
  ],
  "argos_summary": "Microsoft’s latest push to steer Windows users away from Google Chrome and toward Edge has backfired, as Chrome’s desktop share climbed to over 70% while Edge fell below 12%. The campaign, which includes pop‑ups nudging heavy Chrome users to pin Edge, failed to preserve Edge’s market share and may prompt Microsoft to rethink its strategy as AI features like Gemini and Copilot roll out.",
  "argos_id": "VQ9SIYPT5"
}