{
  "url": "https://www.inc.com/phil-rosen/economic-outlook-pharma-tariffs-trump-trade-war-lilly-novo-nordisk-fed-rate-cuts/91223624",
  "authorsByline": "Phil Rosen",
  "articleId": "792aef0470574bfa9fe0116c61d423eb",
  "source": {
    "domain": "inc.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://img-cdn.inc.com/image/upload/f_webp,q_auto,c_fit/vip/2025/08/trump-tariffs-pharma-inc.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T10:00:00+00:00",
  "addDate": "2025-08-06T10:16:22.054905+00:00",
  "refreshDate": "2025-08-06T10:16:22.054907+00:00",
  "score": 1.0,
  "title": "President Trump Is Targeting Big Pharma With Tariffs",
  "description": "Pharma stocks like Novo Nordisk and Pfizer have dropped amid trade war risks.",
  "content": "On Tuesday, Trump told CNBC he plans to impose levies of up to 250 percent on imported pharmaceuticals, a jump from the 200 percent figure he floated in July. While no action has rolled out yet, pharma stocks dipped on the news, adding pressure to what’s already been a historically bad stretch for healthcare investors. Novo Nordisk has dropped 46 percent in 2025, while Pfizer and Eli Lilly are lagging the S&P 500. Gilead is the only major drugmaker ahead of the benchmark year-to-date, while the rest of the sector has stalled.\n\nThe current setup resembles a “sequel to the purge movies,” said Todd Sohn, technical strategist at Strategas Securities. Nearly $26 billion has exited healthcare ETFs since early 2023, making it one of the few sectors facing sustained outflows in a rising market. Trump’s latest threat injects new uncertainty. The proposed tariffs follow his push to revive the “most favored nation” status for the U.S. and his campaign to pressure drugmakers to slash prices. All that leaves pharma stocks in a perfect storm of declining sentiment, policy pressure, and now a potential trade war.\n\nBut the risks go beyond Washington. High interest rates have weighed on pharmaceuticals’ business model all year. The industry relies on multi-year R&D timelines and capital-intensive manufacturing, making it particularly vulnerable to higher financing costs. With Jerome Powell and the Fed hesitant to cut rates, that’s eroded margins and investment appetite for Big Pharma. Meanwhile, structural shifts in the market have also undermined the health sector. Data from Strategas shows passive flows have rotated into cash, crypto, and cyclical ETFs and out of defensives such as healthcare.\n\nConcentration risk exacerbates the issue. The 10 largest S&P 500 stocks now make up roughly 40 percent of the index, leaving little room for the beaten-down corner of the market to gain traction.",
  "medium": "Article",
  "links": [
    "https://www.openingbelldailynews.com/subscribe",
    "https://incpowerpartners.secure-platform.com/a",
    "https://www.openingbelldailynews.com/p/figma-stock-ipo-market-outlook-investors-wall-street-trading-debut-nyse",
    "https://www.openingbelldailynews.com/p/economic-outlook-fed-rate-cut-waller-powell-trump-policy",
    "https://www.openingbelldailynews.com/p/big-short-investor-danny-moses-wall-street-stock-market-economy-recession-outlook-trump",
    "https://www.openingbelldailynews.com/p/economic-outlook-fed-rate-cuts-morgan-stanley-bank-america-recession-trump-powell",
    "https://www.openingbelldailynews.com/p/economic-outlook-fed-jerome-powell-rate-cuts-trump-bessent-treasury-investors",
    "https://www.openingbelldailynews.com/p/fed-rate-cut-economic-outlook-trump-powell-investors-markets-stocks"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "pharma stocks",
      "weight": 0.07799282
    },
    {
      "name": "multi-year R&D timelines",
      "weight": 0.06861541
    },
    {
      "name": "High interest rates",
      "weight": 0.06780268
    },
    {
      "name": "healthcare ETFs",
      "weight": 0.066920616
    },
    {
      "name": "policy pressure",
      "weight": 0.06394072
    },
    {
      "name": "Big Pharma",
      "weight": 0.06377123
    },
    {
      "name": "multi-year",
      "weight": 0.06188666
    },
    {
      "name": "Concentration risk",
      "weight": 0.06080929
    },
    {
      "name": "cyclical ETFs",
      "weight": 0.060628995
    },
    {
      "name": "imported pharmaceuticals",
      "weight": 0.060465273
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94970703125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.86865234375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.79541015625
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.7783203125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.69189453125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.53662109375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.4248046875
    }
  ],
  "sentiment": {
    "positive": 0.022338867,
    "negative": 0.90625,
    "neutral": 0.07165527
  },
  "summary": "President Trump has threatened to impose up to 250 percent tariffs on imported pharmaceuticals, a move from the 200 percent figure he originally proposed. This has added pressure to already a difficult period for healthcare investors. Nearly $26 billion has been out of healthcare ETFs since early 2023, making it one of the few sectors facing sustained outflows in a rising market. The proposed tariffs follow President Trump's efforts to revive the \"most favored nation\" status for the U.S. and pressure drugmakers to lower prices. High interest rates have also impacted pharmaceuticals' business model, which relies on multi-year R&D timelines and capital-intensive manufacturing, leaving it vulnerable to higher financing costs. The 10 largest S&P 500 stocks now make up roughly 40 percent of the index.",
  "shortSummary": "President Trump's proposed 250% tariffs on pharmaceuticals add to a historically bad year for healthcare, with declining investor sentiment and high interest rates.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "66a8440eba084bd8bfa67cce33d52940",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.openingbelldailynews.com/p/fed-rate-cut-economic-outlook-trump-powell-investors-markets-stocks",
      "text": "Good morning, investors. After a few days off for my wedding in California, I’m glad to be back in your inbox — now as a married man!\nNaturally, I had to come back in time to report on the key Federal Reserve meeting today. No one expects policymakers to change interest rates this afternoon, but tensions continue to rise inside the Eccles Building.\nFracturing Fed\nJerome Powell’s authority at the Federal Reserve keeps chipping at the edges.\nFor the first time since 1993, more than one Fed governor could vote against the chairman in an official policy decision.\nThat won’t change the outcome — prediction markets see 97% odds of no adjustment to interest rates — but a fractured consensus undermines the central bank’s tradition of unity and its leader’s grip on policy.\nTwo of the seven sitting governors, Michelle Bowman and Christopher Waller, have made the case for a rate cut in recent weeks.\nAssuming they both follow through with dissenting votes Wednesday afternoon, it would be the first time that at least two governors have done so in 259 official meetings.\n“If they don't dissent, then the stock and bond markets could rally significantly on expectations that the FOMC participants are leaning toward cutting [in September], thus placating the two potential dissenters,” said veteran strategist Ed Yardeni of Yardeni Research.\nBoth Bowman and Waller are Trump appointees, and they have taken some political flak for aligning themselves with the president’s calls for immediate rate cuts.\nThat said, Bowman and Waller have argued that the labor market is not as strong as consensus economists believe.\nTheir case for lower rates is rooted in signs of cooling wage growth and slowing job creation — an assessment that quietly contradicts the White House’s narrative of economic strength.\nWage growth has moderated the last year (Chart courtesy of Exhibit A)\nIn other words, while their stance aligns with Trump’s preferred policy outcome, it does so for reasons that challenge his messaging.\nRegardless of whether Powell & Co. move forward with rate cuts this summer, his ability to project a sense of cohesion is increasingly in doubt.\nA visible split among the Fed’s ranks risks eroding investors’ confidence in the central bank, adding fuel to Trump’s push to name Powell’s successor well before his term ends in May 2026.\nThe labor market isn’t as strong as most economists think, according to Waller and Bowman (Chart courtesy of Exhibit A)\nA recent CNBC survey found that the leading contenders for the top Fed job include Treasury Secretary Scott Bessent, former Fed official Kevin Warsh, and National Economic Council director Kevin Hassett.\nAs Opening Bell Daily has reported all year, Trump has engaged in a colorful war of words with Powell:\n“Mr. Too Late”\n“Jerome Powell is a real dummy”\n“He should cut rates by 3%”\n“Powell is a knucklehead”\nWith the name-calling from the Oval Office and successors circling, even symbolic dissent within the Fed could move markets as much as a tangible policy change.\nMarket snapshot\nA message from our partner, BitcoinIRA\nWhy smart investors use BitcoinIRA:\nTax Savings: When you trade in an IRA, you don't have to pay capital gains taxes that can be as high as 37%\nTop-Level Security: Assets are custodied with a US based custodian and insured up to $250M²\nWorld Class Customer Service: BitcoinIRA has a team of IRA specialists that will help guide you through every step of the process\nP.S. As an Opening Bell Daily reader, you can earn up to $500 in rewards* when you add funds to your account.\nElsewhere\n📉The S&P 500 snapped a 6-day win streak. Equities fell while gold climbed after US officials said no trade deal yet with China and a closely-watched Treasury auction saw stronger-than-expected demand. (Barron’s)\n🌎 Treasury Secretary Scott Bessent isn’t worried about the tariff deadline. If the April 2 tariffs begin after months of uncertainty, it would not be “the end of the world” for US businesses, he said Tuesday. The White House plans to implement a 15-20% blanket levy on countries that haven’t reached a deal by Friday. (CNBC)\n📊 The US hiring rate hit a 7-month low in June. Job openings also declined, according to government data out Tuesday, while the quits rate — a sign of confidence among workers — hovered at 2%. (Yahoo Finance)\nRapid-fire\nVisa’s solid earnings suggest consumers just keep spending (Barron’s)\nPrediction markets see 97% odds the Fed doesn’t change rates today (Kalshi)\nAn 8.7-magnitude earthquake off the coast of Russia triggered tsunami evacuation warnings across the US West Coast (WSJ)\nStarbucks stock climbed even as same-store sales dropped for the sixth quarter in a row (CNBC)\nJPMorgan aims to take over Apple’s credit card program (WSJ)\nGoogle wants its employees to be more “AI-savvy” with competition ramping up (CNBC)\nNew York’s deadliest shooting in over two decades resulted in the killing of four people, including a Blackstone exec and police officer (Semafor)\n‘Big Short’ investor Danny Moses is worried about the rise of meme stocks, meme coins, and weakening protections for retail investors (Opening Bell Daily)\nSteal the trades of world-class investors\nJoin our Best Ideas Club to unlock our members-only stock tracker, where you can see the names in a high-conviction portfolio that’s up 15% in five months, outpacing the S&P 500.\nLast thing\nThe SEC just approved in-kind creations and redemptions for the bitcoin ETFs.\nBitcoin is taking over Wall Street.\n— #Anthony Pompliano 🌪 (#@APompliano)\n8:30 PM • Jul 29, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected]."
    },
    {
      "url": "https://www.openingbelldailynews.com/p/figma-stock-ipo-market-outlook-investors-wall-street-trading-debut-nyse",
      "text": "Happy Friday, investors. Big Tech’s strong earnings continued Thursday, with Apple reporting its best revenue growth since 2021 and Amazon beating analyst expectations.\nThat said, a splashy, outlandish IPO stole the spotlight in the trading session.\nBreaking news: The US will raise tariffs on scores of nations at 12:01 AM on August 7, according to a new executive order signed by President Trump late Thursday. The EU, Japan, and South Korea face a 15% tariff, while others including Vietnam and Indonesia will face 20% and 19% levies, respectively.\nFigma the moonshot\nWall Street has plenty of appetite for risk even without Fed rate cuts.\nFigma surged 250% in its trading debut Thursday, closing above $117 after pricing its IPO at $33.\nAfter hours, it hovered near $150.\nThe rally not only confirms investor demand for splashy tech upstarts, but it serves as the clearest sign yet that the years-long IPO ice age is finally thawing.\nIt was only a couple years ago that UK regulators effectively blocked Adobe’s $20 billion acquisition of the software design firm. The company is now worth more than double that after its first day in public markets, which saw multiple trading halts due to volatility.\nThe IPO market has shown a resurgence in recent months, with other fintech names notching impressive rallies on their first day of trading:\nCircle: +167%\nChime: +37%\neToro: +29%\nMeanwhile, Coreweave, which debuted March 28, had a relatively muted IPO but it’s gained 185.33% as of Thursday’s close.\nFigma, however, stands out in particular because its astonishing one-day gains came after the company raised its pricing range and still saw massive upside from there.\nInvestor enthusiasm was simply baked in to an extreme degree.\n“Who needs fundamentals when you have vibes,” one retail investor told me Thursday.\nStock market sentiment has rebounded from its April lows (Chart courtesy of Exhibit A)\nThrough most of 2023 and 2024, IPO activity stagnated as companies opted to stay private.\nMixed macro conditions, higher interest rates, and geopolitical flare-ups kept early-stage companies on the sidelines.\nEven though many of those factors persist in 2025, not to mention added uncertainty from tariffs, dealmaking has ramped up anyway.\nFigma is positioned as a growth company with expanding revenue — up 46% year-over-year — enviable enterprise penetration — it’s reportedly used by three in four Forbes Global 2000 companies — and a compelling narrative.\nBig Tech stocks have nearly caught up to rest-of-market stocks (Chart courtesy of Exhibit A)\nWhether this triggers a meaningful tipping point for IPOs remains to be seen, but markets at this moment seem to be optimistic to the tune of a $80 billion valuation.\nIn a vacuum, Figma as a business may not be worth that much.\nThat figure puts it in the range of legacy brands including Target, Allstate, Macquarie, Aflac, and Volkswagen.\nBut when a digital whiteboard company can add $30 billion in value in a matter of hours, the takeaway goes beyond a single stock.\nWall Street is simply risk-on.\nMarket snapshot\nHow can AI power your income?\nReady to transform artificial intelligence from a buzzword into your personal revenue generator\nHubSpot’s groundbreaking guide \"200+ AI-Powered Income Ideas\" is your gateway to financial innovation in the digital age.\nInside you'll discover:\nA curated collection of 200+ profitable opportunities spanning content creation, e-commerce, gaming, and emerging digital markets—each vetted for real-world potential\nStep-by-step implementation guides designed for beginners, making AI accessible regardless of your technical background\nCutting-edge strategies aligned with current market trends, ensuring your ventures stay ahead of the curve\nDownload your guide today and unlock a future where artificial intelligence powers your success. Your next income stream is waiting.\nElsewhere\n🍎 Apple beat third-quarter earnings estimates. Overall revenue grew 10% and iPhone sales jumped 13% compared to a year ago. The stock moved 3% higher in after-hours trading Thursday. (CNBC)\n📦 Amazon reported a 13% revenue increase in the second quarter. Profit rose 35% and cloud computing sales jumped 17.5% yet the stock fell in after-hours trading. Those results did not include the impact of Prime Day, which the company extended into a four-day event in July. (WSJ)\n📈 Enjoying Opening Bell Daily? You’ll want The Daily Upside in your inbox, too — it’s packed with in-depth market analysis and fresh perspectives from Wall Street insiders. Join 1M investors and subscribe free today.\nRapid-fire\nJuly non-farm payrolls projected to rise by 115,000 (FactSet)\nReddit stock soared 20% after beating earnings estimates (Investing.com)\nPresident Trump extended Mexico’s tariff reprieve for 90 days (Yahoo Finance)\nCoinbase profits soared in the quarter but its revenue missed estimates (WSJ)\nPresident Trump said he asked major drugmakers to slash US drug prices within 60 days (CNBC)\nCopper prices plunged more than 20% Thursday for the biggest one-day drop on record (WSJ)\nMicroStrategy reported a sizable earnings beat and plans to buy more bitcoin (Barron’s)\nThe US dollar has lost 28% of its purchasing power since January 2020 (Pomp Letter)\nBillionaire Ray Dalio has sold the last of his stake in Bridgewater (WSJ)\nSteal the trades of elite investors\nJoin our Best Ideas Club to unlock access to our members-only stock tracker and get a new investment idea every Sunday. Our portfolio of trades has beat the S&P 500 all year.\nLast thing\nMarket cap:\nAdobe: $151 billion\nFigma: $85 billion— #Brew Markets (#@brewmarkets)\n10:38 PM • Jul 31, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected].\n📩 Want to get in front of 185,000+ investors who get this newsletter and the 350,000 professionals who can access it on Bloomberg Terminals? Hit reply to this email and tell us why we should work together."
    },
    {
      "url": "https://www.openingbelldailynews.com/p/big-short-investor-danny-moses-wall-street-stock-market-economy-recession-outlook-trump",
      "text": "Lessons from the end of the financial world\nAnyone can beat the S&P 500 in a good year, but calling the crash that rewrote history requires far more conviction.\nDanny Moses did just that with his team in 2008, immortalized in Michael Lewis’ book The Big Short and the Hollywood movie of the same name. He joined us to explain how that trade reshaped his worldview, what concerns him in today’s markets and what he’s most bullish on this year.\nThis Q&A has been lightly edited for clarity.\nYou were early and right on the trade of a generation. How did that experience reshape your trust in financial markets and the people who run them?\nDanny Moses: It is very difficult to see the literal end of the financial world and then unsee it.\nYou always need to pay attention to how the people peddling financial products are compensated, especially when they are using a bank’s balance sheet to take on risk. It’s always leverage that causes financial chaos.\nNobody, not even us, had any idea how levered the entire system was to really one thing — home prices.\nThe entire thesis was “home prices never go down.” Rating agencies didn’t even have a model with declining home prices.\nWhen the defaults began and demand dried up, Wall Street pulled the warehouse lines they were providing to mortgage originators, which caused the MBS market to freeze. In some cases, they bought those mortgage companies and brought them in-house.\nI agree that banks became over-regulated after 2008, but it also spawned the proliferation of private equity and private debt. These asset classes lie outside the traditional banking system and, while not posing a systemic threat, should warrant caution — especially as the product finds its way to retail investors.\nThe same way investors believed that home prices would never drop, it’s similar to the “mark to model” vs. “mark to market” we are seeing in the private markets.\nWhat concerns you most about today’s financial landscape?\nDM: I’m concerned that investor and consumer protections are being weakened through changes at the SEC, CFPB and other government agencies.\nThe advent of meme stocks, meme coins and giving retail investors access to sophisticated products — including private investments — screams “caveat emptor.”\nThe biggest risk to the entire system is higher long-term rates [10-year Treasury yields]. A financialized economy can’t grow or function smoothly in that scenario.\nThe same way the GFC was all about home prices, that’s what 10-year yields represent today. We shifted risk from banks post-2008 to the government balance sheet. Gold and BTC are rallying while the dollar weakens — all signs of concern.\nWe are kicking the can on deficits and debt-to-GDP. We’re not pricing in a recession.\nWhat happens to government receipts if the economy begins to contract?\nThe S&P 500 versus recession periods in last 75 years (Chart courtesy of Exhibit A)\nWhat risks do you think retail investors are underestimating today?\nDM: This market has been the antithesis of behavioral finance — it’s been about fastest access to information and execution vs. fundamental research and valuations.\n“This time is different” can work for periods of time but not over the long run.\nEven secular themes like AI eventually become cyclical. Stick to quality and express themes through great companies like Alphabet that have great balance sheets, a global presence, and exposure to growth trends.\nLook no further than some public companies shifting their strategy and using their balance sheets to buy crypto — and in some cases issuing debt and equity to do it. Some of these companies trade at 2-4x their underlying asset value.\nAs an investor, why not just buy the crypto in an ETF to express that theme? It’s inevitable that the gap narrows over time.\nThe moral hazard created post-GFC has baked in a BTFD [buy the f*cking dip] mentality.\nWhich sectors or themes are you most optimistic about over the next 12 months?\nDM: Energy. Especially nuclear. It’s rare to find a theme both sides of the aisle agree on.\nWith the advent of AI, energy supply is needed and we are seeing capex and dealmaking in every area — the grid, nuclear plant construction, uranium mining.\nThe traditional energy sector [oil and gas] has gone through a massive transformation over the last several years because of ESG initiatives and M&A.\nThat’s left fewer companies with healthier balance sheets. Current rig counts are at five-year lows and with oil in the mid-$60s, the sector looks undervalued.\nThe energy sector is under a 4% weighting in the S&P 500, and the long-term average is 7%.\nThe S&P 500 energy sector has lagged in 2025 (Chart courtesy of Exhibit A)\nWhat’s your current view on bitcoin, and how has it changed over time?\nThe advent of Bitcoin ETFs created not only a new avenue for buyers — including institutional capital — but also credibility, given that firms such as BlackRock and Fidelity are sponsors.\nThe reasons to own Bitcoin have changed over the years, and have evolved to a “store of value” and a hedge against central bank and government incompetence, as no real commercial use case has developed. I personally choose gold for that theme.\nThe irony is that crypto enthusiasts now welcome regulation, when that is the complete opposite of the original thesis.\nThere is a fine line between validation and government oversight.\nYou can follow Danny Moses on X, and tun into his podcast “On the Tape.”\nThe best stocks beat the market\nJoin our Best Ideas Club to unlock access to our members-only stock tracker, where you can see the names in a high-conviction portfolio that’s up double-digits against the S&P 500.\nIn the coming weeks, we’ll be sending members Danny Moses’ favorite investment for 2025.\nRapid-fire\nTesla earnings were better than expected and Elon Musk talked up robotaxis (Barron’s)\nAlphabet beat earnings expectations and raised its spending forecast (CNBC)\nPrediction markets see 17% odds Powell is out as Fed Chair before 2026 (Kalshi)\nDetroit carmakers don’t sound happy about the Japan trade deal but their stocks are rallying anyway (WSJ)\nThe US dollar has lost 30% of its purchasing power in the last five years (Pomp Letter)\nJune home sales drop as home prices hit a record high (CNBC)\nThe Magnificent 7 is no longer the unified Big Tech trade it was a year ago (Opening Bell Daily)\nGoPro and Krispy Kreme have joined the meme stock surge (CNBC)\nLast thing\nThe S&P 500's price to peak earnings ratio has moved up to 26.5, its highest level since 2000 and 54% above the historical median. $SPX\nVideo: youtube.com/watch?v=lzCnAL…\n— #Charlie Bilello (#@charliebilello)\n4:25 PM • Jul 23, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected].\n📩 Want to get in front of 185,000+ investors who get this newsletter and the 350,000 professionals who can access it on Bloomberg Terminals? Hit reply to this email and tell us why we should work together."
    },
    {
      "url": "https://incpowerpartners.secure-platform.com/a",
      "text": "Worldwide Recognition\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\ndouble-click to edit, do not edit in source\ndouble-click to edit, do not edit in source\n(Fee: $1,295)\nBe Recognized as the Force Behind Business Success\nAre you the engine that helps businesses grow, scale, and thrive? Whether you deliver game-changing software, essential logistics, cutting-edge marketing, or top-tier customer service, your company could be recognized as an Inc. Power Partner—the ultimate honor for B2B excellence.\nInc.’s Power Partner Awards celebrate and promote the companies that entrepreneurs and small businesses trust the most—the partners that truly move the needle. This prestigious list highlights the very best B2B providers in the United States and around the globe.\nIf your company has a proven track record of helping others win and happy clients who can back you up, apply today to become an Inc. Power Partner—and let the world know you're a B2B powerhouse.\nLet Inc. show the world that your company is devoted to providing entrepreneurs with the tools and resources they need to start, run, and grow their businesses. Here’s what to expect if your company makes this year’s list:\nBusiness owners across the U.S. and the world will know that your company is a true B2B partner and worthy of building a meaningful relationship with.\nAll honorees will be featured on Inc.com and receive a custom profile page touting your firm's recognition as a top B2B partner.\nYou’ll receive the Inc. seal of approval that your firm has an impressive track record of helping entrepreneurs and owners of small to medium-size businesses.\nInc.’s validation will help you land new clients to continue growing your business.\nBe proud of the business you’ve created. Take a few minutes to apply and let Inc. magazine declare your company one of the best to partner with.\nEvery application will be reviewed directly by Inc. editors. You may apply to as many of the below categories as fit your company, creating multiple opportunities for recognition in Inc. magazine and on Inc.com. Multiple honorees will be named in each category.\nOpen to all companies, in any industry, that help business owners start, run, or grow their businesses.\nCompanies based in the United States that have exceptionally empowered their partners to start, run, and grow their businesses at all levels\nCompanies that help organizations grow through strategic campaigns, lead generation, market research, and more.\nCompanies based outside the U.S. that are power partners to local businesses, or have helped companies source, distribute, sell, market, and build internationally.\nBusinesses that provide products and services exclusively to other businesses.\nFirms that help businesses build and develop brand identities and create compelling assets, from website design to corporate branding.\nCompanies that provide the physical infrastructure and services that keep businesses running, including maintenance, cleaning, office management, workspace solutions, and more.\nFirms that provide essential financial services to organizations—from accounting to investment—or legal expertise for compliance, litigation, and more.\nCompanies that support hiring, training, benefits management, compliance, and employee engagement.\nCompanies that keep businesses operating smoothly and efficiently through supply chain management, logistics solutions, fulfillment services, and more.\nFirms that create and maintain a positive public image for the individuals, groups, or organizations they represent.\nCompanies that deliver services through the internet, including data storage, servers, databases, networking, and software.\nCompanies that provide tech expertise, from software development to IT infrastructure to digital transformation.\nSmall businesses that thrive at powering other businesses, often without the resources of their larger peers or competitors. These are the companies that have done the most with the least.\nEstablished businesses that have significantly grown in size while never losing their focus on serving the best products and services to other businesses.\nMidsize companies that have started growing in size but haven’t let that growth distract from their top priority of addressing the unique needs of other businesses.\nApplications are open to small-to-midsize companies, in all industries and locations, including government-funded agencies. Public, private, non-profit, subsidiary, U.S.-based, and international companies are all encouraged to apply.\n1. Complete Your Short Application: Complete the short application here by filling in basic information about your company and selecting the categories you’d like to apply for.\n(Fee: $1,295)\n2. Provide Customer References: In the application, you'll provide Inc. with at least three, and up to 10, companies that have used your products or services over the past year. Inc. will send a survey containing four straightforward questions asking how likely your customer is to recommend your product or service. Inc. will score these results and combine them with our own research to produce a list of hundreds of winners. See our full methodology here.\nImportant Note: Past honorees may renew their Inc. Power Partner seal of approval each year without providing additional customer references. Simply complete the application and Inc. will vet your company to ensure it is still in good standing.\n3. Watch for Our Announcement of the 2025 Inc. Power Partners: The list goes live on Inc.com in late-October 2025. Whether or not you make the list, you will be notified via email in September, before it is released to the general public.\n(Fee: $1,295)\nFor full application details see our FAQs here.\nQuestions? Email Inc. at PowerPartners@inc.com."
    },
    {
      "url": "https://www.openingbelldailynews.com/p/economic-outlook-fed-rate-cuts-morgan-stanley-bank-america-recession-trump-powell",
      "text": "Good morning, investors! In our Monday newsletter, I made the case that the Fed is late on rate cuts. For today’s edition, we’re unpacking why the central bank may skip rate cuts entirely until next year.\nLet’s dive in.\nWhat if the Fed doesn’t cut at all?\nBond traders, prediction markets, and traditional data all point to rate cuts starting as soon as September, yet two of Wall Street’s biggest banks aren’t buying it.\nStrategists at Bank of America and Morgan Stanley told clients they do not expect a single rate cut until at least 2026, even after Friday’s dismal jobs data, which showed the US added just 73,000 jobs in July, far weaker than expected.\nWhile Opening Bell Daily remains in the camp that the central bank should have started lowering interest rates months ago, the no-cut argument should still be taken seriously.\nInterest rates still hover at multi-decade highs (Chart courtesy of Exhibit A)\nBank of America’s view hinges on a key distinction — markets are mistaking stagflation for a recession.\n“Labor supply has cratered due to immigration restrictions,” BofA economists wrote. “So while demand has also weakened, labor slack hasn’t increased.”\nThey point to stable unemployment and steady wage growth as evidence that the slowdown stems more from constrained supply than collapsing demand.\n“The downward revisions to job growth in May and June were undeniably concerning,” BofA economists added.\n“But the silver lining is that more than half of the revisions were due to seasonal factors and public payrolls.”\nMorgan Stanley agrees that the labor market has softened, though its team argues that inflation remains too sticky to justify rate cuts.\n“Tariff-related inflation could limit the Fed’s dovish reaction function,” according to Morgan Stanley strategists.\nFed Chair Powell has similarly pointed out that inflationary pressures from President Trump’s trade policy still haven’t fully filtered through to consumer prices.\n“Our house view continues to be that the Fed won’t cut this year, but will end up cutting more than expected next year,” Morgan Stanley strategists said.\nInflation has come in cooler-than-expected every month this year (Chart courtesy of Exhibit A)\nIncidentally, both banks are now at odds with futures markets, which assign a roughly 90% probability for a 25-basis-point rate cut in September.\nThey also contrast with Goldman Sachs, which reiterated its view Monday that the US economy is near “stall speed” and so the Fed will deliver three rate cuts in a row starting next month.\nGoldman’s economists estimate that underlying job growth has cratered to less than 50,000 payrolls a month — a level that has historically triggered rate cuts.\nPayroll growth has slowed over recent months (Chart courtesy of Exhibit A)\nUltimately, the debate comes back to Powell’s own words: “It’s the unemployment rate.”\nTo policymakers, that figure takes precedent over payroll growth or economic activity.\nAnd while hiring and job growth have lost momentum, the jobless rate remains historically low at 4.2%.\nThe unemployment rate ticked up from 4.1% to 4.2% last month (Chart courtesy of Exhibit A)\nFor Bank of America and Morgan Stanley, that’s not enough to justify rate cuts, regardless of markets betting on looser monetary policy.\nFrom the banks’ perspective — though Opening Bell Daily disagrees — the Fed still risks moving too early rather than too late.\nMarket snapshot\nA message from our partner, BitcoinIRA\nWhy smart investors use BitcoinIRA:\nTax Savings: When you trade in an IRA, you don't have to pay capital gains taxes that can be as high as 37%\nTop-Level Security: Assets are custodied with a US based custodian and insured up to $250M²\nWorld Class Customer Service: BitcoinIRA has a team of IRA specialists that will help guide you through every step of the process\nP.S. As an Opening Bell Daily reader, you can earn up to $500 in rewards* when you add funds to your account.\nElsewhere\n📈 American Eagle stock surges again. President Trump posted on Truth Social about Sydney Sweeney having the “HOTTEST” ad for jeans and retail investors pushed shares more than 23% higher in Monday’s trading session. The stock is up roughly 34% over the last four weeks. (Axios)\n💰Tesla granted Elon Musk a $29 billion stock package. It’s an interim compensation solution for 96 million shares of the company, and it’s set to vest over two years as long as Musk stays on as an executive. The Delaware Supreme Court is still weighing a legal battle for Musk’s prior pay package. (CNBC)\n📊 President Trump’s sons will own millions of shares of a new SPAC. Eric and Donald Trump Jr. will back the New America SPAC, which aims to merge with companies that revitalize domestic manufacturing. It will target a $300 million public offering. (WSJ)\n📉 Another US jobs market indicator weakened in July. The Conference Board’s Employment Trends Index fell to 107.55 last month, from 108.19 in June, according to a report out Monday. It’s now hovering at its lowest point since October 2024. (Barron’s)\nRapid-fire\nThe EU will delay its planned US tariffs for 6 months to allow for trade talks (CNBC)\nPalantir crushed stratospheric earnings expectations for its Monday earnings (Barron’s)\nEarnings growth for S&P 500 companies remains robust, which bodes well for stock returns (Carson Research)\nTrend-following hedge funds have lost nearly 10% through the first half of the year (WSJ)\nPresident Trump threatened India with “substantially” higher tariffs over Russian oil buys (Yahoo Finance)\nFirefly Aerospace lifted its IPO range to value the company at over $6 billion (CNBC)\nRolex and other luxury watchmakers are bracing for US tariffs on Swiss imports (Yahoo Finance)\nSteal the trades of the world’s best investors\nJoin our Best Ideas Club to unlock our members-only stock tracker, where you can see every single stock in our high-conviction portfolio that’s handily beating the S&P 500.\nLast thing\nJobs report accuracy has suffered in recent years because the response rate to the BLS's establishment survey has fallen off a cliff since Covid.\nHas nothing to do with ideology or politics.\n— #Dominic Pino (#@DominicJPino)\n9:19 PM • Aug 1, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected]."
    },
    {
      "url": "https://www.openingbelldailynews.com/p/economic-outlook-fed-jerome-powell-rate-cuts-trump-bessent-treasury-investors",
      "text": "Good morning, investors. Earnings season is underway and stocks keep hitting new records, yet the most important topic across Wall Street and Washington is Fed independence and what a post-Jerome Powell Fed looks like.\nBigger problem than Powell\nInvestors may finally get the rate cuts they’ve been waiting for, but they may not like the way they arrive.\nMarkets should be asking how the Fed eases policy as much as they ask when. If political pressure — rather than economic data — drives the next move, it risks weakening the central bank’s credibility and undermining global trust in US monetary policy.\nThat tension has come into sharper focus over the last several days:\nTreasury Secretary Scott Bessent called for a sweeping review of the entire Federal Reserve system\nRepublican US Representative Anna Paulina Luna formally referred Fed Chair Jerome Powell to the Justice Department over alleged misleading testimony to Congress\nFed Governor Christopher Waller said he will vote for an immediate rate cut\n“[H]as the organization succeeded in its mission? If this were the FAA and we were having this many mistakes, we would go back and look at why this has happened.” Bessent said.\nThe Fed’s benchmark interest rate hovers near multi-decade highs (Chart courtesy of Exhibit A)\nAnd while President Trump has denied rumors that he plans to fire Powell, he has repeatedly slammed him for mismanaging the Fed. Among the president’s recent quotes on the chairman:\n“Powell is a knucklehead.”\n“Jerome Powell is a real dummy.”\n“Mr. Too Late”\n“He should cut interest rates by 3% and do it immediately.”\nTo be clear, the president, investors, and everyday Americans are right to be frustrated with Powell’s inaction.\nOpening Bell Daily does believe the data warrants rate cuts.\nBut even so, eroding the Fed’s credibility poses a long-term risk to markets.\nCPI has come in cooler-than-expected every month of the year (Chart courtesy of Exhibit A)\nAs Opening Bell Daily reported Monday, Fed Governor Waller’s call for a cut is logically consistent — inflation has indeed moderated and the labor market is cracking.\nBut the timing of his speech has raised political questions. If Waller or someone like him succeeds Powell, then markets will be justified in questioning whether the Fed’s decisions are driven by data or the White House.\nThe global financial system rests, in part, on the idea that the Fed operates above the political fray.\nUndermining that now — with US debt at record highs — could invite far more volatility than any single rate decision.\n“Firing Powell might be the quickest way to incentivize central banks to find [an alternative to US Treasurys],” wrote veteran economist Ed Yardeni in a note to clients early Monday.\nMarkets will continue to cheer the prospect of lower rates. But if global investors sense even a whiff of political coercion, it may not matter how low the Fed goes.\nCredibility, once shaken, is harder to restore than interest rates are to adjust.\nIn the near-term, monetary easing will likely lift asset prices.\nBut beyond that, a Fed that appears politically compromised could send bond yields higher, weaken the dollar, and prompt foreign holders of US Treasurys to question America’s economic leadership.\nMarket snapshot\nA message from our partner, BitcoinIRA\nWhy smart investors use BitcoinIRA:\nTax Savings: When you trade in an IRA, you don't have to pay capital gains taxes that can be as high as 37%\nTop-Level Security: Assets are custodied with a US based custodian and insured up to $250M²\nWorld Class Customer Service: BitcoinIRA has a team of IRA specialists that will help guide you through every step of the process\nP.S. As an Opening Bell Daily reader, you can earn up to $500 in rewards* when you add funds to your account.\nElsewhere\n✅ Stocks hit another record closing high. The Nasdaq Composite closed higher for the sixth trading day in a row, and the S&P 500 eked out an all-time high of its own despite a late-day pullback.\n🏦Jerome Powell has been referred to the DOJ for criminal charges. A Republican lawmaker said it’s based on his $2.5 billion renovation to the Federal Reserve building, and Powell is accused of lying about the project’s scope. However, no formal charges have been filed. (Reuters)\n📈Consumers are ramping up spending. Fears of an economic downturn have eased in the last several months, and major financial institutions are pulling back their recession calls. Small-business owners are increasingly optimistic, and consumer confidence is suddenly bouncing back. (WSJ)\nRapid-fire\nPrediction markets see 94% odds the Fed doesn’t change rates at the July meeting (Kalshi)\nOpendoor Technologies is the market’s newest meme stock and it rallied 42% Monday (Barron’s)\nThe new CEO of Astronomer gave his first statement after the Coldplay kiss-cam scandal (CNBC)\nAI is splintering the fortunes of Big Tech names as stock returns diverge (WSJ)\nPositive earnings results from Alphabet and other Mag-7 names could bode well for Nvidia’s outlook (Barron’s)\nDigital asset products just saw their largest weekly inflows on record at $4.39 billion (CoinShares)\nSteal the trades of elite investors\nJoin our Best Ideas Club to unlock our members-only stock tracker, where you can see the names in a high-conviction portfolio that’s up 13% in five months, outpacing the S&P 500.\nLast thing\nBTIG's Jonathan Krinsky: \"Party Like it's 1999. As we discussed last week, the Nasdaq 100 has now gone 60 trading days without closing below its 20 DMA, the second-longest streak in its history (back to 1985). The longest was ended in early 1999.\"\n— #Lisa Abramowicz (#@lisaabramowicz1)\n10:21 AM • Jul 21, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected]."
    },
    {
      "url": "https://www.openingbelldailynews.com/p/economic-outlook-fed-rate-cut-waller-powell-trump-policy",
      "text": "Welcome back from the weekend, investors. Investors just took in a slate of “good news” economic data and the stock market is hovering at record highs as a result. Equities would rise even further if one Fed official gets his out-of-consensus preference next week.\nClear and present dissent\nAt least one policymaker at the Federal Reserve will dissent against Jerome Powell at the July meeting.\nIn a bold and unusually direct speech to close out last week, Fed Governor Christopher Waller laid out the case for an immediate rate cut.\nHe made it clear that he’s prepared to vote for it before the end of the month, even if others aren’t.\nHe built his argument with two core reasons:\nInflation is near the Fed’s 2% target\nThe labor market is weaker than it looks\nIn an explicit divergence from Powell, he asserted that talk of tariffs fueling inflation is mostly noise.\n“Tariff increases are a one-time boost to prices that do not sustainably increase inflation,” Waller said in prepared remarks in New York.\nWaller does not believe tariffs will cause sustained inflation increases (Chart courtesy of Exhibit A)\nHe pointed out that wage growth has cooled, productivity is improving, and inflation expectations remain anchored — which together point to no threat of rebounding prices.\nMeanwhile, as solid as the economic data has appeared, Waller maintained that beneath the headline numbers cracks are indeed beginning to form.\n“With inflation near target and the upside risks to inflation limited, we should not wait until the labor market deteriorates before we cut the policy rate,” the Fed Governor said.\nWaller sees policy as too restrictive (Chart courtesy of Exhibit A)\nIn his view, the recent string of government job revisions suggests that private-sector job growth has stalled and job openings are evaporating faster than people assume.\nOn top of that, new grads face the worst job market in years.\nJobs data has held up better than expected all year (Chart courtesy of Exhibit A)\nThe Fed’s current policy rate range is simply too restrictive, according to Waller.\n“If the slowing of economic and employment growth were to accelerate and warrant moving toward a more neutral setting more quickly, then waiting until September or even later in the year would risk us falling behind the curve of appropriate policy,” Waller said.\nAs Opening Bell Daily has reported, Waller’s boss Powell has a lengthy track record of delayed policy responses to economic data, dating back to the pandemic’s four-decade high inflation spike.\nOne of our most popular charts of the year\nHowever, because Waller’s latest speech aligns with President Trump’s calls for Powell to cut rates, Waller has taken some political heat for aligning with the White House.\nBut to Neil Dutta, head of economics for Renaissance Macro, those attacks are unjustified.\nFor Waller to argue that the economy is not in fact as good as the White House claims doesn’t exactly come across as supportive of the administration.\nPolitics aside, Waller’s case is at least intellectually consistent.\n“If President Trump's goal is to leave his mark on the Fed, then he should proceed in a way that likely ensures that he is able to quickly fill the most seats,” Dutta said.\n“Elevating Waller to the top job is the most obvious path to afford him that opportunity. Going the other route runs the risk of having a Chairman in Name Only no one respects.”\nMarket snapshot\nElsewhere\n📊 Tesla and Alphabet report earnings in a busy week ahead. The giants will headline the 112 total S&P 500 companies reporting earnings this week as stocks hover at record highs. Other than corporate news, the economic data will be quiet ahead of the Fed’s July 29-30 meeting. (Yahoo Finance)\n🏦 Scott Bessent made the case for Trump not to fire Jerome Powell. The Treasury Secretary cited practical obstacles and economic hazards to the president, who had been weighing his options on relieving the Fed Chair from his duties. Trump, however, disputed the report that Bessent talked him out of firing Powell. (CNBC)\n📈 TSMC stock joined the trillion-dollar club. Taiwan Semiconductor Manufacturing surged over the last week on continued optimism for AI demand and innovation. It’s up roughly 50% from its April lows, and it now rivals Berkshire Hathaway in total market cap. (Bloomberg)\nBeat the market with the best stocks\nJoin our Best Ideas Club to unlock access to our members-only stock tracker, where you can see the names in a high-conviction portfolio that’s up nearly 15% in five months, handily beating the S&P 500.\nRapid-fire\nAugust 1 is a “hard deadline” for tariffs, Howard Lutnick said (CNBC)\nBank earnings are sending the message that the economy is still on solid footing (Barron’s)\nChina’s shipments of rare earth magnets in June skyrocketed after the trade truce with the US (Bloomberg)\nChina kept its benchmark lending rate unchanged early Monday (CNBC)\n110 of the 300 largest US housing markets have falling home prices (ResiClub)\nTech bull Dan Ives’ shared his highest conviction stock for the next 12 months (Best Ideas Club)\nStocks won’t stop breaking records even as Fed rate cut odds fall (Opening Bell Daily)\nLast thing\nIn 2008, Foreigners owned 57% of U.S. Treasuries 🚨Today, they only own 32% 👀\n— #Barchart (#@Barchart)\n12:11 AM • Jul 21, 2025\nAbout me\n📰 I’m Phil Rosen, co-founder and editor-in-chief of Opening Bell Daily. I’ve published books, lived on three continents, and won awards for my journalism, which has appeared in Business Insider, Fortune, Yahoo Finance, Bloomberg and Inc. Magazine.\nI write our flagship newsletter to prepare you for each trading day — unpacking markets, economic data and Wall Street with analysis you won’t find anywhere else.\nFeedback? Reply to this email, ping me on X @philrosenn, or write me directly at [email protected].\n📩 Want to get in front of 185,000+ investors who get this newsletter and the 350,000 professionals who can access it on Bloomberg Terminals? Hit reply to this email and tell us why we should work together."
    }
  ],
  "argos_summary": "President Trump announced plans to impose up to 250% tariffs on imported pharmaceuticals, raising uncertainty for the pharma sector. The move has already weighed on pharma stocks, with major names like Novo Nordisk, Pfizer, and Eli Lilly falling below the S&P 500. High U.S. interest rates and a shift of passive flows away from defensive sectors add to the pressure on the industry. The tariff threat could further erode margins and investment appetite for big pharma.",
  "argos_id": "XHIP1IV5U"
}