{
  "url": "https://finance.yahoo.com/news/allianz-trade-awarded-gold-medal-063000856.html?_guc_consent_skip=1756881436",
  "authorsByline": "PR Newswire",
  "articleId": "6518eeb4eff74f0d9658831c6cc815a4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/prnewswire.com/c862eb47b7f540aa1e1bb5f082705d7d",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-03T06:30:00+00:00",
  "addDate": "2025-09-03T06:39:12.806642+00:00",
  "refreshDate": "2025-09-03T06:39:12.806645+00:00",
  "score": 1.0,
  "title": "Allianz Trade has been awarded the Gold Medal by EcoVadis in their 2025 sustainability assessment",
  "description": "EcoVadis is one of the world's most trusted providers of business sustainability ratings. The EcoVadis assessment evaluates 21 sustainability criteria across four core themes: Environment, Labor & Human Rights, Ethics, and Sustainable Procurement. After evaluating Allianz Trade's environmental, social, and ethical performance, EcoVadis has awarded the global leader in trade credit insurance a Gold Medal, placing Allianz Trade in the top 2% of all companies assessed globally in the past 12 months",
  "content": "PARIS, Sept. 3, 2025 /PRNewswire/ -- EcoVadis is one of the world's most trusted providers of business sustainability ratings. The EcoVadis assessment evaluates 21 sustainability criteria across four core themes: Environment, Labor & Human Rights, Ethics, and Sustainable Procurement. After evaluating Allianz Trade's environmental, social, and ethical performance, EcoVadis has awarded the global leader in trade credit insurance a Gold Medal, placing Allianz Trade in the top 2% of all companies assessed globally in the past 12 months (1). This milestone marks an improvement, since Allianz Trade had received a Silver Medal from EcoVadis in 2024.\n\nAn acknowledgement of Allianz Trade's sustainability performance and progress\n\nEcoVadis states that Allianz Trade's main strengths lie in its advanced management systems for environmental, ethical, and carbon-related matters. This acknowledgment from EcoVadis underscores Allianz Trade's continuous commitment to embedding sustainability throughout its business strategy and operations.\n\nIn 2024, Allianz Trade made significant progress in advancing its sustainability agenda. The company achieved a substantial reduction in greenhouse gas emissions per employee, cutting them by 60%, while also reducing energy consumption per employee by 78%. They established dedicated teams in Germany, Italy and Northern Europe to promote sustainability principles and drive the implementation of the company's sustainability roadmap at local scale. Allianz Trade also steered the decarbonization of its portfolio by integrating sustainability in risk assessment and commercial underwriting processes. Eventually, the world leader in trade credit insurance created value for corporates through sustainable insurance solutions, with the launch of Surety Green2Green.\n\nSustainability in motion: leading by example \n\nThis Gold Medal also reflects Allianz Trade's progress since the previous assessment, including the implementation of new policies, additional industry recognition and improved reporting practices. These efforts are a key part of Allianz Trade's broader decarbonisation strategy. Looking ahead, Allianz Trade is stepping up its commitment to sustainability. By year-end 2029, the company aims to reduce its operational GHG emissions per employee by 65%, engaging all employees in this collective journey toward decarbonization.\n\n\"Our sustainability transition is accelerating at full speed. We are proud that our efforts have been recognized by such a reputable and expert third party. However, we are ready to go even further and to achieve our ambitious target: our goal is to reach Net-Zero by 2050 and to assist in the sustainability transition of businesses and the broader economy. I have total confidence in our teams to achieve these targets and want to thank them all for their work and dedication. Together, we are shaping the future of sustainable trade\", ends Florence Lecoutre, Group Board Member in charge of Sustainability, Data Analytics & AI, Human Resources, Compliance and Communications at Allianz Trade.",
  "medium": "Article",
  "links": [
    "https://www.allianz-trade.com/en_global.html",
    "https://www.allianz-trade.com/en_global/news-insights/news/surety-green2green.html",
    "https://mma.prnewswire.com/media/2762765/Allianz_Trade_Logo.html",
    "https://ecovadis.com/"
  ],
  "labels": [
    {
      "name": "Press Release"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Allianz Trade",
      "weight": 0.12464981
    },
    {
      "name": "sustainability principles",
      "weight": 0.0948518
    },
    {
      "name": "business sustainability ratings",
      "weight": 0.09479059
    },
    {
      "name": "Sustainability",
      "weight": 0.09464759
    },
    {
      "name": "sustainability",
      "weight": 0.09464759
    },
    {
      "name": "Allianz Trades sustainability performance",
      "weight": 0.08567485
    },
    {
      "name": "trade credit insurance",
      "weight": 0.07343451
    },
    {
      "name": "Allianz Trades broader decarbonisation strategy",
      "weight": 0.0730449
    },
    {
      "name": "Allianz Trades continuous commitment",
      "weight": 0.072228126
    },
    {
      "name": "Allianz Trades progress",
      "weight": 0.072103165
    }
  ],
  "topics": [
    {
      "name": "ESG"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/Business & Industrial/Business Operations/Management",
      "score": 0.58935546875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Green Living & Environmental Issues",
      "score": 0.4921875
    }
  ],
  "sentiment": {
    "positive": 0.86946213,
    "negative": 0.022611547,
    "neutral": 0.10792635
  },
  "summary": "Allianz Trade has been awarded the Gold Medal by EcoVadis in their 2025 sustainability assessment. The assessment assesses 21 sustainability criteria across four core themes: Environment, Labor & Human Rights, Ethics, and Sustainable Procurement. This recognition marks an improvement from the Silver Medal given in 2024. AllianzTrade's main strengths lie in its advanced management systems for environmental, ethical, and carbon-related matters. The company has made significant progress in advancing its sustainability agenda, including significant reductions in greenhouse gas emissions per employee and energy consumption. Looking ahead, AllianZ Trade aims to reduce its operational GHG emissions per worker by 65 by 2025.",
  "shortSummary": "EcoVadis awarded Allianz Trade a Gold Medal for its sustainability performance, highlighting progress and ongoing efforts to achieve Net-Zero by 2050.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d64de7c0555f422a9cd099145560a50a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://ecovadis.com/",
      "text": "Sustainability Solutions for Every Stage of Your Journey\nFrom Risk & Compliance to Value & Impact\nThe EcoVadis platform helps you manage ESG risk and compliance, meet corporate sustainability goals, and drive impact at scale by guiding the sustainability performance improvement of your company and your value chain.\nGain full visibility into supply chain risks across 100% of your supply base. Leverage automated tools, actionable insights, and light questionnaires to streamline due diligence, reduce risk, and support compliance with ready-to-submit reports.\nMeasure, monitor, and reduce Scope 3 carbon emissions with accurate supplier-specific data. Assess carbon risk, engage suppliers and collect reliable data to ensure compliance, mitigate risk, and drive supply chain decarbonization.\nBuild a sustainable procurement strategy with a globally recognized, and evidence backed sustainability rating. Leverage verified data, and increase supply chain transparency. Scale supplier collaboration and drive improvement that meets your ESG goals.\nAwards and Recognitions\nHear from our Customers\nEcoVadis Rating is 30% of our overall vendor rating. It is one of the messages from which our stock value can benefit.\nWe're winning business because of sustainability which means our sales increase, our turnover goes up, and ultimately that positively impacts the people that work at CEF.\nOur EcoVadis Gold Medal resulted in more than €37 million from clients who monitor our EcoVadis performance from 2023.\nOur sustainable procurement program is driving business value through the help of EcoVadis Solutions.\nWe leverage Ratings to explain to our suppliers that sustainability clearly isn't just a score; it's the cornerstone of our reputation and success.\nThe Carbon Action Manager is a unique solution that consolidates the data we need from our suppliers in one place.\nIQ Plus enables us to proactively identify and mitigate risks around modern slavery, human rights and ethics.\nToyota Material Handling Group Europe\nFor vendors that aren’t able to do the full Ratings assessment, Vitals gives us a sense of what they’re doing, whether it’s meeting our expectations, and if there’s anything that we should be concerned about.\nBeing assessed by EcoVadis and also assessing our suppliers is a differentiating factor for CEF, helping us win more business."
    }
  ],
  "argos_summary": "Allianz Trade was awarded a Gold Medal by EcoVadis in its 2025 sustainability assessment, placing it in the top 2% of companies evaluated globally. The award follows a year‑long improvement from a previous Silver Medal, highlighted by a 60% cut in GHG emissions per employee and a 78% reduction in energy use. The company’s sustainability gains are tied to advanced environmental, ethical, and carbon‑management systems, and its decarbonisation strategy now targets a 65% reduction by 2029 and net‑zero by 2050. This recognition underscores Allianz Trade’s commitment to embedding sustainability across its operations and underwriting practices.",
  "argos_id": "YE8U3QY3D"
}