{
  "url": "https://www.foxnews.com/sports/trump-attend-yankees-game-new-york-24th-anniversary-sept-11th-attacks-sources",
  "authorsByline": "Ryan Morik",
  "articleId": "a3fc0af548fd41059e0270d068f5a38c",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/09/931/523/trump-baseball-9225.jpg?ve=1&tl=1",
  "country": "us",
  "language": "en",
  "pubDate": "2025-09-02T22:52:06-04:00",
  "addDate": "2025-09-03T03:00:37.269514+00:00",
  "refreshDate": "2025-09-03T03:00:37.269516+00:00",
  "score": 1.0,
  "title": "Trump to attend Yankees game in New York on 24th anniversary of Sept. 11 attacks: sources",
  "description": "President Donald Trump will attend the New York Yankees game against the Detroit Tigers on Sept. 11, marking the 24th anniversary of the 9/11 attacks.",
  "content": "President Donald Trump will be attending the New York Yankees game in the Bronx on Sept. 11, the 24th anniversary of the 9/11 terrorist attacks, sources told Fox News Digital.The Yankees, in the midst of an AL East race, will face the AL Central-leading Detroit Tigers in a potential postseason preview.Trump has attended numerous sporting events over the years, but has not attended a baseball game during his second presidency.CLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM In 2019, Trump, then president for the first time, attended Game 5 of the World Series between the Washington Nationals and Houston Astros in the nation's capital. He also attended the Astros-Braves World Series in 2021, roughly a year after losing the 2020 election to former President Joe Biden.Trump said in 2020 that he was set to throw out the first pitch at a Yankees game, but it never occurred due to a \"strong focus\" on the pandemic.Before his political career, Trump also attended Game 7 of the National League Championship Series between the New York Mets and St. Louis Cardinals at Shea Stadium.MARK TEIXEIRA DISCUSSES POLITICAL DIVIDE, SAYS HE CAN’T TALK TO PEOPLE THAT BELIEVE ‘MEN CAN GET PREGNANT'Trump has been at the forefront of UFC recently, as fights are slated to take place on the White House Lawn on July 4 next year to commemorate the United States' 250th birthday.The Yankees were in the World Series last year but lost to the Los Angeles Dodgers in five games.Next year, the Yankees and Mets will play a game on Sept. 11 at Yankee Stadium to commemorate the 25th anniversary of 9/11. They did the same in 2021 at Citi Field, with the Mets wearing specialized \"New York\" uniforms, as opposed to their normal home \"Mets\" jerseys.Sources say Vice President JD Vance will represent the administration at a commemoration ceremony at Ground Zero in Lower Manhattan, with Trump scheduled to attend a memorial event at the Pentagon in northern Virginia earlier in the day.Trump will also attend the Ryder Cup in New York on Sept. 26, he said. He attended the FIFA Club World Cup championship in July at MetLife Stadium.Follow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/person/jd-vance",
    "https://www.foxnews.com/sports",
    "https://www.foxnews.com/sports/mark-teixeira-discusses-political-divide-says-he-cant-talk-people-believe-men-can-get-pregnant",
    "https://twitter.com/FoxNewsSports_",
    "https://www.foxnews.com/video/6360647968112",
    "https://www.foxnews.com/category/sports/mlb/new-york-yankees",
    "https://www.foxnews.com/newsletters",
    "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
    "https://www.foxnews.com/category/person/donald-trump"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "New York Yankees",
      "weight": 0.10052149
    },
    {
      "name": "New York Mets",
      "weight": 0.09838286
    },
    {
      "name": "Yankees game",
      "weight": 0.09303958
    },
    {
      "name": "New York",
      "weight": 0.08916469
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0822484
    },
    {
      "name": "Fox News Digital",
      "weight": 0.07841272
    },
    {
      "name": "Next year",
      "weight": 0.07744564
    },
    {
      "name": "next year",
      "weight": 0.07744564
    },
    {
      "name": "Donald Trump",
      "weight": 0.0742635
    },
    {
      "name": "Fox News Sports Huddle",
      "weight": 0.07412922
    }
  ],
  "topics": [
    {
      "name": "MLB"
    },
    {
      "name": "Baseball"
    },
    {
      "name": "New York Yankees"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.91748046875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.82861328125
    },
    {
      "name": "/News/Sports News",
      "score": 0.78515625
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.7333984375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.451904296875
    }
  ],
  "sentiment": {
    "positive": 0.11561246,
    "negative": 0.39466092,
    "neutral": 0.48972657
  },
  "summary": "President Donald Trump is set to attend a New York Yankees game on the 24th anniversary of the 9/11 terrorist attacks. This follows a series of sporting events, including the World Series between the Washington Nationals and Houston Astros in 2019 and the Astros-Braves World Series in 2021. However, he has not attended a baseball game during his second presidency. The Yankees and the Mets will play a game on Sept. 11 at Yankee Stadium next year to commemorate the 25th anniversary. Vice President JD Vance will represent the administration at a commemoration ceremony at Ground Zero.",
  "shortSummary": "President Donald Trump will attend a New York Yankees game on the 24th anniversary of the 9/11 terrorist attacks, marking his first sports attendance in two years.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "bd8ce84f42c14fcfab2c386058bad1d6",
  "places": [
    {
      "osmId": "24801630",
      "road": "East 161st Street",
      "suburb": "The Bronx",
      "city": "New York",
      "state": "New York",
      "postcode": "10451",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.82958275,
        "lon": -73.92652118491901
      }
    },
    {
      "osmId": "604023701",
      "road": "Seaver Way",
      "suburb": "Queens",
      "city": "New York",
      "state": "New York",
      "postcode": "11368",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 40.757277849999994,
        "lon": -73.84587884942417
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/category/sports/mlb/new-york-yankees",
      "text": "New York Yankees 54 mins ago Trump to attend Yankees game in New York on 24th anniversary of Sept. 11 attacks: sources President Donald Trump will attend the New York Yankees game against the Detroit Tigers on Sept. 11, marking the 24th anniversary of the 9/11 attacks.\nMLB 6 hours ago Mark Teixeira discusses political divide, says he can’t talk to people that believe ‘men can get pregnant' Mark Teixeira said that he can't have conversations with people who \"truly believe\" that men can get pregnant during an appearance on OutKick's \"Don't @ Me with Dan Dakich.\"\nNew York Yankees 9 hours ago 2025 MLB MVP Race, Odds: Can Kyle Schwarber Catch Shohei Ohtani? Does Kyle Shwarber have a chance at the NL MVP award? Or will Shohei Ohtani win two straight? See the latest odds?\nArizona Diamondbacks 1 day ago 2025 MLB Contender Rankings: The Toughest Final Month Before the Postseason? One more left before the MLB playoffs! So which contenders are facing a very tricky stretch ahead of October?\nNew York Mets 1 day ago MLB Stock Report: Walker Buehler’s Impact On the Phillies, Plus Players of the Week Walker Buehler and his recent postseason pedigree could be what the Phillies need.\nEugenio Suarez 1 day ago 2025 MLB Home Run Records Tracker: Raleigh Reaches 50, Schwarber's Right Behind MLB's sluggers are targeting a number of home run records in 2025, and we're keeping track of their progress for the rest of the season.\nNew York Yankees 2 days ago Aaron Judge ties Yankees legend Yogi Berra with historic 358th career home run milestone Yankees captain Aaron Judge tied Yogi Berra's franchise record with his 358th career homer in Sunday's game against the White Sox at Chicago.\nNew York Yankees 2 days ago Trump renews pitch to get Roger Clemens into Hall of Fame: 'If it were me, I’d sue them' President Donald Trump renewed his support for Roger Clemens to get into the Baseball Hall of Fame on Sunday and said the pitcher may have a credible lawsuit on his hands.\nNew York Yankees 4 days ago Mark Teixeira has a message for Texas Dems after redistricting: 'Have better policies' World Series champion Mark Teixeira gave Democrats upset with Texas’ new congressional map a message during an appearance on Fox News’ “America Reports.\"\nHouston Astros 4 days ago MLB's Biggest Deadline Trades, Re-Ranked: Tigers, Padres Happy? How have they worked out? Re-ranking the 15 most impactful MLB trade deadline deals, one month later.\nMLB 4 days ago 2025 MLB Home Run Leader Odds: Schwarber Favored After 4-Homer Night Kyle Schwarber made MLB history on Thursday. Can he finally overtake Cal Raleigh for the home run lead? See the latest odds.\nCongress 5 days ago World Series champion Mark Teixeira announces congressional campaign in Texas Former New York Yankees first baseman and World Series champion Mark Teixeira announced his campaign for Congress in Texas’ 21st District on Wednesday.\nMLB 6 days ago Judge, Bellinger Hit Back-to-Back Homers in Yankees Rout Over Nats Aaron Judge hit a two-run homer and Cody Bellinger homered on the next pitch as the Yanks rocked the Nationals.\nMLB August 26 Babe Ruth namesake in Tennessee faces charges for alleged use of deceased MLB stars' IDs in fraud scheme A Tennessee man named George Herman “Babe\" Ruth has been charged after allegedly using names of dead professional baseball players in a six-figure fraud scheme.\nMLB August 25 MLB Stock Report: Anthony Volpe Trending Downward, But Who Is Going Up? What to make of the Yankees' decision to bench a struggling starter? Taking stock on Anthony Volpe and other players from around MLB.\nNew York Yankees August 25 Roger Clemens thanks Trump for Baseball Hall of Fame support, hits back at critics New York Yankees legend Roger Clemens expressed his gratitude for President Donald Trump's support for his case to get into the Baseball Hall of Fame.\nNew York Yankees August 24 Trump demands Roger Clemens be inducted into Baseball Hall of Fame: 'Put him in NOW' President Donald Trump threw his support behind New York Yankees legend Roger Clemens' Baseball Hall of Fame candidacy on Sunday afternoon.\nNew York Yankees August 23 Time Running Out on Yankees to Show They're Playoff Caliber After Red Sox Beating After an eighth straight loss against the Red Sox, the Yankees are running out of time to prove they belong in the playoffs.\nMLB August 22 A Squirrel Interrupts Rivalry Between Red Sox and Yankees in the 4th inning A squirrel ran onto the Yankee Stadium field and put a halt to the Red Sox-Yankees game in the fourth inning.\nBoston Red Sox August 20 Stellar Pitchers, Big Bats, and a Pennant Race: Red Sox-Yankees Will Have It All Two teams with plenty still to prove. Here's why this week's Red Sox-Yankees series will have postseason implications.\nTexas Rangers August 20 2025 World Series Odds: Will Dodgers Go Back-to-Back? With just a month left in the regular season, the Dodgers continue to lead the World Series odds. Can they capture a second straight title? See the odds.\nNew York Yankees August 20 Yankees make history with remarkable home run showing in win over Rays The New York Yankees made MLB history in their 13-3 thrashing of the Tampa Bay Rays as they clubbed nine home runs in their victory on Tuesday.\nNew York Yankees August 19 Yankees' Manager Aaron Boone on Aaron Judge's Health: 'I Don't Know Yet' Giancarlo Stanton is back from sitting with general soreness, prompting the question of Aaron Judge's own health.\nNew York Yankees August 19 Yankees World Series champion says he'd be 'very surprised' if team misses postseason despite struggles David Cone optimistic about the Yankees' playoff chances, highlighting improved pitching rotation and return of key players, Aaron Judge and Giancarlo Stanton.\nMLB August 19 Ex-MLB star hypes current wife when asked about Halle Berry remarks: 'She can cook' World Series champion David Justice was asked on Friday whether he wanted to clear anything up regarding his comments about his marriage to Halle Berry.\nAtlanta Braves August 19 What MLB Could Look Like After Expansion: Eight Divisions, New Rivalries?! How would divisions and rivalries get affected if MLB expanded and was realigned? We’ve got an idea.\nNew York Yankees August 18 Yankees broadcaster David Cone reveals secret behind his legendary 'Coney-isms' commentary style Former New York Yankees pitcher David Cone loves to bring wit and baseball insight to YES Network broadcasts with unique phrases influenced by Dennis Eckersley, pop culture and more.\nMLB August 15 MLB Roundtable: Mariners or Astros in AL West? Yankees and Mets in Trouble? Could we really see no playoff baseball in the Big Apple? Answering the biggest questions in MLB this week.\nNew York Yankees August 11 Yankees' Cody Bellinger faces ridicule for outfield flub in loss to Astros The New York Yankees have been a frustrating team to watch, and their play on Sunday underscored that notion as they dropped another game to the Houston Astros.\nNew York Yankees August 10 Yankees broadcasters crack 'Seinfeld' jokes as team faces Astros pitcher named Jason Alexander Houston Astros pitcher Jason Alexander faced the New York Yankees, prompting \"Seinfeld\" jokes from announcers as Paul O’Neill recalled his cameo and shared show memories."
    },
    {
      "url": "https://www.foxnews.com/category/person/jd-vance",
      "text": "JD Vance, a venture capitalist, author and politician won big in the 2022 Midterm elections where he defeated his Democratic opponent, Tim Ryan in Ohio’s Senate election. The Republican is a bestselling author with his book, “Hillbilly Elegy” that went on to be turned into a Netflix movie in 2020.\nVance ran as former President Donald Trump's vice presidential running mate in the 2024 presidential elections. The pair succeeded in their campaign and were elected into office by the American people. Vance was sworn into office as the Vice President of the United States serving during the Trump administration's second term on January 20, 2025.\nVance was born in Middletown, Ohio where his father left when he was young and his mother battled a drug addiction. Growing up, he spent a lot of time with his grandmother, who he called Mamaw.\nVance is a Marine who served in the Iraq War. After that, he went to The Ohio State University, where he received a bachelors degree in political science and philosophy.\nVance continued his education further by attending Yale Law School, where he graduated and received his law degree.\n\"Hillibilly Elegy: A Memoir of a Family and Culture in Crisis” was written by Vance in 2016. The book was a New York Times Bestseller.\nThe popular book was turned into a movie that came out in 2020. The film was directed by Ron Howard and starred Amy Adams, Glenn Close and Gabriel Basso.\nIn 2022, Vance went for the open Senate seat left by Republican Sen. Rob Portman, who was retiring. Vance went up against U.S. House Rep. Tim Ryan and defeated the Democrat in the midterm elections.\nVance is married to Usha Vance since 2014. The pair have three children together."
    },
    {
      "url": "https://www.foxnews.com/newsletters",
      "text": "Newsletters and Alerts\nSign up for our free email newsletters and alerts\n-\nBreaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Breaking News Alerts\nFast, 24/7 alerts to keep you in the know on the most important business moments around the world.\nArrives 24/7By entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News First\nGet all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nAntisemitism Exposed\nFox News' Antisemitism Exposed\" newsletter brings you stories on the rising anti-Jewish prejudice across the U.S. and the world.\"\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Politics\nGet the latest updates on the Trump administration and Congress, exclusive interviews and more Fox News politics content.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox Business Rundown\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Entertainment\nGet a daily look at the top news in music, movies, television and more in the entertainment industry.\nArrives WeekdaysBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox True Crime\nThe hottest stories ripped from the headlines, from crime to courts, legal and scandal.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nBest of Opinion\nGet the recap of top opinion commentary and original content throughout the week.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Lifestyle\nA look at the top-trending stories in food, relationships, great outdoors and more.\nArrives Twice a weekBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Health\nStay up-to-date on the biggest health and wellness news with our weekly recap.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Sports Huddle\nReceive your weekly recap of all the happenings around the world of sports.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Artificial Intelligence\nStay up-to-date on the latest AI technology advancements and learn about the challenges and opportunities AI presents now and for the future.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nFox News Autos\nGet revved up with the week's hottest stories from the new and classic car worlds.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\n-\nLearn More About Fox Nation\nFox Nation is an entertaining streaming service featuring your favorite Fox News personalities, with original shows and documentaries that Celebrate America.\nArrives WeeklyBy entering your email and clicking the Subscribe button, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.\nSubscribed\nYou've successfully subscribed to this newsletter!\nUnsubscription Successful\nYou have successfully unsubscribed from the newsletter. To re-subscribe or to subscribe to any of our other newsletters, please close this prompt and follow the directions on the page."
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    },
    {
      "url": "https://www.foxnews.com/sports/mark-teixeira-discusses-political-divide-says-he-cant-talk-people-believe-men-can-get-pregnant",
      "text": "World Series champion Mark Teixeira said he can’t have a conversation with people who say men can get pregnant, citing how the political divide in the United States has grown.\nTeixeira, who launched his campaign for the U.S. House of Representatives last week, said he has \"no problem\" talking to Democrats about tax rates or national security, but not about men getting pregnant.\n\"I have no problem talking to you about tax rates or national security or things that are maybe going to make our country better. But when you say that men can get pregnant, where do I go with that?\" Teixeira said in an appearance on OutKick’s \"Don’t @ Me with Dan Dakich.\"\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"I can’t have a conversation with you if that’s what you truly believe, and I think that so many people on the left have gone off the map that it creates this huge divide, that it’s tough to bridge that gap.\"\nThe former New York Yankees star said people have asked him why he chose to go into politics when it’s so divided. Teixeira said that conservatives haven’t moved that much further right, while Democrats \"have moved completely off the map to the left.\"\nOutKick’s Dan Dakich said the shift to the left has created a distraction from what’s real, and Teixeira agreed with that assessment.\n\"Dan, one of the reasons I’m running is because people are real. People that need better jobs, people that want lower tax rates, people that want their cities and their streets to be safe, those are the people that I’m running for. My district is the most beautiful district in Texas, it’s the hill country, hard-working people,\" Teixeira said.\nPADRES ALL-STAR RELIEVER CARTED OFF FIELD AFTER COLLAPSING WITH APPARENT SEASON-ENDING INJURY\n\"These men and women, they go to church on Sundays and barbecue afterward. These are just good patriots and they want the government to work for them. They don’t want to be controlled by the government or be told what to do, be told to wear masks, be told you can’t go to school, be told that if you build a company it’s because the government built it for you. That’s baloney.\"\n\"I think the American people are waking up, that the America First agenda is the one that is working for them.\"\nThe three-time All-Star is campaigning for Texas’ 21st Congressional District. Teixeira’s announcement followed Rep. Chip Roy’s decision not to seek re-election as he runs for Texas attorney general.\nCLICK HERE TO GET THE FOX NEWS APP\nThe 45-year-old played for four teams in his major league career. Teixeira debuted with the Texas Rangers and spent five seasons with the team before being traded to the Atlanta Braves.\nHe was later traded to the Los Angeles Angels after parts of two seasons with the Braves and then signed with the Yankees.\nThe five-time Gold Glove winner was a key part of the 2009 Yankees team that beat the Philadelphia Phillies in the World Series. Teixeira finished his career with a .268 batting average, 409 home runs and 1,298 RBI.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    }
  ],
  "argos_summary": "President Donald Trump will attend a New York Yankees baseball game against the Detroit Tigers on September 11, marking the 24th anniversary of the 9/11 attacks. The event is part of a broader commemoration that includes a ceremony at Ground Zero and a memorial at the Pentagon. Trump’s attendance follows his previous appearances at sporting events during his first presidency, though he has not yet thrown a first pitch in his second term. The Yankees, contending in the AL East, face the Tigers, who lead the AL Central, in a game that could serve as a postseason preview.",
  "argos_id": "YKV9Q9HB0"
}