{
  "url": "https://www.sfchronicle.com/news/world/article/us-announces-sanctions-against-armed-group-and-20814450.php",
  "authorsByline": "JUSTIN KABUMBA, By MARK BANCHEREAU, Associated Press, JEAN-YVES KAMALE",
  "articleId": "43c2471418ff46c1a7de985564ac5b6a",
  "source": {
    "domain": "sfchronicle.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:28:29+00:00",
  "addDate": "2025-08-12T19:35:00.066834+00:00",
  "refreshDate": "2025-08-12T19:35:00.066836+00:00",
  "score": 1.0,
  "title": "US announces sanctions against armed group and companies profiting from conflict minerals in Congo",
  "description": "The U.S. government has sanctioned an armed group accused of illicit trading in minerals in eastern Congo. On Tuesday, officials said the CODECO group controlled a key coltan mining site from 2022 to...",
  "content": "DAKAR, Senegal (AP) — The U.S. government on Tuesday sanctioned an armed group accused of illicit trading in minerals in eastern Congo as Washington tries to spearhead peace efforts there while pushing for U.S. access to the region’s minerals.\n\nA senior U.S. government official who spoke on condition of anonymity ahead of the formal announcement said the State and Treasury departments are sanctioning the CODECO armed group, which controlled the key coltan mining site of Rubaya from 2022 to early 2024.\n\n“During this period, CODECO generated revenue by overseeing mining operations, collecting illegal fees and taxes for miners and engaging in mineral smuggling. It also imposed forced labor and executed civilians in mining areas under its control,” the official said in Washington.\n\nThe U.S. is also sanctioning the Congolese mining company CDMC, saying it sold minerals which were sourced and smuggled from mines near Rubaya, and two Hong Kong exporters, East Rise and Star Dragon, that purchased minerals from the mining area.\n\nThe State Department said it is freezing the assets of the armed group and companies in the U.S. or under U.S. control and banning all transactions with them.\n\nRubaya is currently under control of the M23 rebel group, which is already targeted by U.S. sanctions.\n\nThe mining site lies in the heart of eastern Congo, a mineral-rich part of the Central African nation, which for decades has been ripped apart by violence from government forces and different armed groups, including the Rwanda-backed M23, whose recent resurgence has escalated the conflict, worsening an already acute humanitarian crisis.\n\nIn June, Congo and Rwanda signed a peace deal facilitated by the U.S. to help end the conflict while helping the U.S. government and American companies gain access to critical minerals in the region.\n\nCongo and the M23 rebels have also agreed to sign a permanent peace deal by Aug. 18 but renewed fighting has threatened this effort.\n\nOn Tuesday, Congo and M23 both accused each other of violating the agreement by attacking the others forces.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "armed group",
      "weight": 0.104912534
    },
    {
      "name": "different armed groups",
      "weight": 0.10164193
    },
    {
      "name": "conflict minerals",
      "weight": 0.09629608
    },
    {
      "name": "U.S. control",
      "weight": 0.096162416
    },
    {
      "name": "U.S. access",
      "weight": 0.09277647
    },
    {
      "name": "U.S. sanctions",
      "weight": 0.08911274
    },
    {
      "name": "mining areas",
      "weight": 0.08726391
    },
    {
      "name": "critical minerals",
      "weight": 0.08599079
    },
    {
      "name": "U.S.",
      "weight": 0.085612595
    },
    {
      "name": "mining operations",
      "weight": 0.08493883
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "World"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.95361328125
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.91650390625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.89111328125
    },
    {
      "name": "/News/World News",
      "score": 0.87744140625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.64990234375
    },
    {
      "name": "/News/Other",
      "score": 0.63427734375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.599609375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.304443359375
    }
  ],
  "sentiment": {
    "positive": 0.056226246,
    "negative": 0.76451904,
    "neutral": 0.17925467
  },
  "summary": "The United States has sanctioned an armed group accused of illicit trading in minerals in eastern Congo. The CODECO armed group controlled the key coltan mining site of Rubaya from 2022 to early 2024, according to a senior U.S. government official. The State Department is also freezing the assets of the group and companies under U.K. control and banning all transactions with them. This comes as Washington continues to spearhead peace efforts in the country and seeks access to the region's minerals. The sanctions come after a peace deal between Congo and the M23 rebels was signed by the United States.",
  "shortSummary": "The US has sanctioned the CODECO armed group for illicit trading in minerals, aiming to facilitate peace efforts and facilitate US-based operations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "a34d8ee4425e412b8e1630f93404ecf2",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The U.S. government has sanctioned the CODECO armed group for illicit mineral trading in eastern Congo, where it controlled the Rubaya coltan mining site and engaged in forced labor and violence. Alongside CODECO, sanctions were also imposed on the Congolese mining company CDMC and two Hong Kong exporters for their involvement in smuggling operations. This move is part of U.S. efforts to promote peace in the region while securing access to its mineral resources, amidst ongoing conflict and a humanitarian crisis exacerbated by the M23 rebel group's resurgence.",
  "argos_id": "0K1I5PBLW"
}