{
  "url": "https://money.usnews.com/investing/news/articles/2025-08-12/cavas-shares-crater-after-first-annual-sales-growth-target-cut-since-ipo",
  "authorsByline": "Reuters",
  "articleId": "f364254a58e8483c87ad9f40027f9db7",
  "source": {
    "domain": "money.usnews.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.usnews.com/dims4/USNEWS/3a9c607/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2Fc0%2Fb76fc1edc14aab727a144ee2a80935%2Ftag%3Areuters.com%2C2025%3Anewsml_LYNXMPEL7B0Z3%3A12025-08-12T211633Z_1_LYNXMPEL7B0Z3_RTROPTP_3_USA-STOCKS.JPG",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:16:00-04:00",
  "addDate": "2025-08-12T21:33:31.221058+00:00",
  "refreshDate": "2025-08-12T21:33:31.221060+00:00",
  "score": 1.0,
  "title": "Cava's Shares Crater After First Annual Sales Growth Target Cut Since IPO",
  "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
  "content": "(Reuters) -Shares of Cava dropped 21% in extended trading on Tuesday, after the Mediterranean restaurant chain lowered its annual same-store sales growth target for the first time since it listed on the New York Stock Exchange two years ago.\n\nAn uncertain macroeconomic environment has forced consumers to opt for more affordable meals at home, dampening demand for dining out over the last several months, impacting the results of other restaurant chains, including burrito giant Chipotle Mexican Grill and salad-focused Sweetgreen.\n\nCava had reported a double-digit rise in same-store sales for the last four quarters, helped by demand for its pita wraps and salad bowls. However, customer traffic remained almost flat in the second quarter, with its same-store sales rising 2.1%, below estimates of 6.47%, according to data compiled by LSEG.\n\nCava now expects full-year same-restaurant sales growth between 4% and 6%, compared with its prior target of 6% to 8%.\n\nConsumers were less confident than they were a year ago as economic uncertainties weighed, which led to weaker traffic in June and early July, but visits have improved since, said Brett Schulman, Cava's co-founder and CEO.\n\nCava is opening more stores to capitalize on the resilient demand for its menu items and has raised its target for annual new restaurant openings to a range of 68 to 70, from 64 to 68 expected earlier.\n\nThe company does not plan to increase prices and would try to absorb any inflationary costs from tariffs, Schulman added.\n\n\"As we've seen the last few weeks, I don't know that these recent announcements (on tariffs) will be the same announcements in a couple of weeks. So we're staying nimble,\" he said.\n\nThe company reported a profit of 16 cents per share for the quarter ended July 13, compared with estimates of 13 cents apiece.\n\nAs of last close, Cava's shares have more than doubled to $84.50 since its blockbuster IPO in June 2023.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "First Annual Sales Growth Target",
      "weight": 0.099976696
    },
    {
      "name": "annual new restaurant openings",
      "weight": 0.08335636
    },
    {
      "name": "other restaurant chains",
      "weight": 0.082497865
    },
    {
      "name": "Cava",
      "weight": 0.08191277
    },
    {
      "name": "more stores",
      "weight": 0.07231782
    },
    {
      "name": "last close",
      "weight": 0.069405034
    },
    {
      "name": "burrito giant Chipotle Mexican Grill",
      "weight": 0.066859804
    },
    {
      "name": "Brett Schulman",
      "weight": 0.06429007
    },
    {
      "name": "same-store sales",
      "weight": 0.064028814
    },
    {
      "name": "its annual same-store sales growth target",
      "weight": 0.062958956
    }
  ],
  "topics": [
    {
      "name": "Markets"
    },
    {
      "name": "IPO"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97802734375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.84765625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.72900390625
    },
    {
      "name": "/Food & Drink/Restaurants/Other",
      "score": 0.442626953125
    }
  ],
  "sentiment": {
    "positive": 0.073326156,
    "negative": 0.82737446,
    "neutral": 0.09929945
  },
  "summary": "Shares of Cava fell 21% after the company announced it had reduced its annual growth target. This is the first time since it listed on the New York Stock Exchange two years ago that the company has reduced its target. The decrease in same-store sales is attributed to an uncertain macroeconomic environment that has reduced demand for dining out. Cava now expects full-year growth between 4% and 6%, compared to its previous target of 6-8%. The company plans to open more stores to meet the strong demand for its menu items.",
  "shortSummary": "Cava's shares plummeted 21% after lowering its annual sales growth target due to economic uncertainties, despite rising customer traffic and increased investment plans.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "8f359d19592c43c6998818f98bc7133f",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Cava's shares fell 21% after the restaurant chain lowered its annual same-store sales growth target for the first time since its IPO, citing an uncertain economic environment that has led consumers to choose more affordable meals at home. The company reported a 2.1% increase in same-store sales, below expectations, and now anticipates growth of 4% to 6%, down from a previous target of 6% to 8%. Despite these challenges, Cava plans to open more locations and absorb inflationary costs without raising prices.",
  "argos_id": "0URV0N1PM"
}