{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/bloomberg-crypto-8-12-2025-video",
  "authorsByline": "bn",
  "articleId": "9bd4db2ccf654f13990605208f4f5332",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iq51cK7H58M0/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:08:36.788000+00:00",
  "addDate": "2025-08-12T18:32:00.705398+00:00",
  "refreshDate": "2025-08-12T18:32:00.705399+00:00",
  "score": 1.0,
  "title": "SEC Addressing Tokenization Regulation",
  "description": "\"Bloomberg Crypto\" covers the people, transactions, and technology shaping the world of decentralized finance. Today's guests: SEC Commissioner Hester Peirce, Bloomberg's Allison Schrager and Anthony Hughes. (Source: Bloomberg)",
  "content": "KATIE: WELCOME TO BLOOMBERG CRYPTO. A LOOK AT THE PEOPLE, TRANSACTIONS AND TECHNOLOGY SHAPING THE WORLD OF DECENTRALIZED FINANCE. THE SEC COMMISSIONER WILL JOIN US FOR AN EXCESSIVE INTERVIEW ON THE CRYPTO, AND PRIVATE ASSETS. WE WILL HEAR FROM BLOOMBERG OPINIONS'S ALLISON SCHRAGER. AND BULLISH SET TO START TRADING TOMORROW. WE DISCUSSED THE CRYPTO TRADING PLATFORM BACKED BY PETER THIEL. HERE IS A SNAPSHOT OF THE WHAT THE CRYPTO MARKET LOOKS LIKE. WE ARE KEEPING AN EYE ON BITCOIN , TOUCHING ALL-TIME HIGHS TRADING NEAR $120,000 ADDING ANOTHER 1% TO ITS RALLY. YOU ALSO HAVE ETHER SURGING, WHERE A LOT OF THE ACTION HAS BEEN. THEY COLLECTIVELY PULLED IN $1 BILLION SO INVESTORS PUTTING MONEY BEHIND THE ETHER RALLY. I WANT TO CHECK IN ON CIRCLE, CLIMBING AFTER THE FIRST EARNINGS REPORT AS A PUBLIC COMPANY. REVENUE CLIMBED 53% LAST QUARTER ALONE, BOOSTING CONFIDENCE ON WALL STREET YOU CAN SEE THE CONFIDENCE WITH A 6.3% RALLY IN SHARES. ANOTHER BIG STORY IS THE EXECUTIVE ORDER THAT PRESIDENT TRUMP SIGNED LAST WEEK THAT COULD PAVE THE WAY FOR 401(K) ACCOUNTS TO INVEST IN CRYPTO. WE SPOKE WITH THE SEC CHAIRMAN BACK IN JULY ABOUT THE POSSIBILITY OF CREDIT MARKETS IN RETIREMENT ACCOUNTS. HERE IS WHAT HE HAD TO SAY. > > WE'VE HEARD A LOT OF INPUT FROM BOTH THE INVESTORS WHO WANT ACCESS TO THE PRIVATE MARKETS AND PRODUCTS IN OBVIOUSLY FROM THE PEOPLE WHO ARE PRODUCING THE PRODUCTS WHO ARE ABOUT TO MEET THAT DEMAND. WE HAVE TO DO IT CAREFULLY BECAUSE THE PRIVATE MARKETS ARE A LOT DIFFERENT FROM THE PUBLIC THAT WAS PAUL ATKINS BEFORE PRESIDENT TRUMP SIGNED THE EXECUTIVE ORDER AND NOW THAT IT HAS BEEN SIGNED, I'M PLEASED TO SAY WE ARE JOINED BY THE SEC COMMISSIONER, HESTER PEIRCE:. . GREAT TO HAVE YOU WITH US. IT AND STOCKS THEM TO ADJUST RULES AND REGULATIONS TO ALLOW RETIREMENT ACCOUNTS TO INVEST IN CRYPTO ARE AT LEAST ALLOW IT. HOW WILL THE SEC APPROACH IT? HESTER: I THINK WE HAVE ALREADY STARTED THE PROCESS OF OPENING THE CREDIT MARKETS TO RETAIL AND THINKING ABOUT WAYS WE CAN GET THEM ACCESS AND A WAY THAT IS DIVERSIFIED, PROFESSIONALLY MANAGED AND CONSISTENT WITH THEIR INVESTING TIME FRAMES. I THINK WE WILL JUST CONTINUE WITH THAT WORK. KATIE: I APPRECIATE THAT CONTEXT. AS YOU APPROACH THIS, TALK US TO THE RISKS YOU ARE THINKING ABOUT BECAUSE CERTAINLY A LOT OF FOLKS ON WALL STREET AND ELSEWHERE HAVE BEEN ANTICIPATING THE RULE CHANGES THAT THERE IS CONCERN ABOUT PUTTING WHAT OUR RISKY ASSETS IN RETIREMENT ACCOUNTS. HESTER: I THINK THOSE ARE LEGITIMATE CONCERNS. WHAT WE HAVE SEEN IS THAT THE PUBLIC MARKETS ARE DOMINATED BY AT SEVERAL LARGE COMPANIES AND ALSO COMPANIES WAITING LONGER TO GO PUBLIC AND WE ARE LOOKING FOR A WAY FOR RETAIL TO GET EARLIER ACCESS TO THE GROWTH OF COMPANIES AND THAT IS THE GOAL OF IT. BUT YOU WANT TO DO IT IN A WAY THAT MAKES SURE WE ARE NOT JUST USING RETAIL AS IT DUMPING GROUND. I THINK IT IS MAKING SURE THERE IS PROFESSIONAL MANAGEMENT AND THAT IT IS DONE IN A WAY THAT IS CAREFUL AND WE ARE PAYING ATTENTION TO THE RISKS ASSOCIATED WITH IT. KATIE: A CONVERSATION I HAVE BEEN HAVING AROUND THIS TOPIC IS HOW IT IS NOT AS SIMPLE AS SWITCHING A LIGHT SWITCH AND THAT YOU WILL NOT SEE PRIVATE ASSETS IN CRYPTO IN RETIREMENT ACCOUNTS OVERNIGHT FOR YOU SAID YOU HAVE ALREADY STARTED THE PROCESS ON YOUR END AND ARE WORKING TO THE CHECKLIST. WHAT DO YOU SEE AS THE TIMELINE HERE? HESTER: I THINK EVEN ALREADY WE HAVE LOOSENED SEC IT MADE RESTRICTIONS THAT WERE NOT BASED IN LAW ON THE PERCENTAGE OF PRIVATE ASSETS THAT COULD BE AVAILABLE IN RETAIL ACCOUNTS IN FUNDS AVAILABLE TO RETAIL INVESTORS. I THINK THE PROCESS HAS BEGUN. WE HAVE A NEW HEAD OF OUR DIVISION OF INVESTMENT MANAGEMENT AND HE IS WORKING CLOSELY WITH THE STYLE AND WORKING ALSO WITH PEOPLE WHO HAVE BEEN THINKING ABOUT HOW TO DO THIS IN THE PRIVATE SECTOR. IT IS A COMBINATION OF THOSE THINGS. KATIE: I APPRECIATE THE UPDATE. I HOPE TO KEEP TALKING ABOUT THAT. I WANT TO MOVE ON AND TALK ABOUT TOKENIZATION, A BIG TOPIC OF THE MOMENT. WHEN WE ARE TALKING ABOUT EVERYDAY INVESTORS GETTING INVOLVED WITH TOKENIZATION, WHAT ARE THE RISKS, AND YOUR VIEW, THAT COULD POTENTIALLY COME ABOUT? HESTER: I THINK THERE HAS BEEN A LOT OF INTEREST IN TOKEN ICING SECURITIES AND OTHER REAL-WORLD ASSETS AND THAT IS SOMETHING THAT REALLY OPENED UP AFTER THE SEC CHANGED ITS PERSPECTIVE ON CRYPTO. WE ARE SEEING A LOT OF INTEREST FROM TRADITIONAL FINANCIAL FIRMS AND NATIVE CRYPTO FIRMS. THERE ARE DIFFERENT APPROACHES THAT ARE BEING TAKEN TO TOKEN ICING. SO WE WILL WORK WITH PEOPLE AND ARE WILLING TO WORK WITH PEOPLE WHO ARE TAKING DIFFERENT APPROACHES. IT IS REALLY IMPORTANT THAT PEOPLE BE VERY CAREFUL ABOUT DISCLOSING ABOUT WHAT THE NATURE OF THE ASSET IS WEN YU TOKENIZED SOMETHING. IT IS STILL A SECURITY IF YOUR TOKEN ICING A SECURITY BUT IT MAY BE WITH DIFFERENT CHARACTERISTIC AND THAT IS SOMETHING THAT NEEDS TO BE CONVEYED TO INVESTORS. IT IS ALSO IMPORTANT TO BE AWARE OF IT SOMETIMES THERE ARE TRADING RESTRICTIONS ON WHO CAN ACCESS PARTICULAR TYPES OF SECURITIES. THAT IS SOMETHING PEOPLE HAVE TO PAY ATTENTION TO. KATIE: THAT IS A POINT YOU HAVE MADE IN THE PAST THAT TOKENIZED SECURITIES ARE STILL SECURITIES. SOME FIRMS COME I THINKING A ROBINHOOD, FOR EXAMPLE, ROLLING OUT TOKENIZED STOCK TRADING. DO YOU SEE THAT AS A POTENTIAL AREA WHERE YOU COULD RUN INTO SOME OF THESE CONFRONTATIONS OVER FIRMS TRYING TO REALLY REGULATE AND INNOVATE AND INTRODUCE MEASURES SUCH AS THAT BUT POTENTIALLY COMING UP AGAINST SOME REGULATIONS YOU ARE PUTTING IN PLACE? HESTER: WITHOUT TALKING ABOUT ANY PARTICULAR FIRM'S APPROACH, THE BOTTOM LINE IS WE ENCOURAGE FIRMS TO COME IN AND TALK TO US AND WE EXPECT THERE WILL BE SOME DIFFERENT APPROACHES TAKEN TO TOKEN ICING AND WE ARE LOOKING FORWARD TO WORKING WITH FOLKS TO TRY THE DIFFERENT MODELS OUT AND SEE WHAT THE MARKETS LIKE AND SEE WHETHER OR NOT TOKENIZATION OF EQUITY SECURITIES TAKES HOLD. THAT REALLY WILL ULTIMATELY BE UP TO THE MARKET BUT WHAT THE MESSAGE IS WE ARE WILLING TO WORK THROUGH DIFFERENT POTENTIAL MODELS WITH PEOPLE. KATIE: YOU SAID SOMETHING INTERESTING, IF TOKENIZED EQUITIES TAKE HOLD AND THAT IS A GOOD REMINDER THAT THIS IS VERY NASCENT AND WE ARE ONLY SEEING THE FIRST FEW ATTEMPTS AT THIS COME ABOUT WHAT SHOULD THE TOKENIZED REAL-WORLD ASSETS AND EQUITIES REALLY TAKE OFF? SHOULD WE EXPECT A FORMAL PILOT PROGRAM FROM THE SEC TOKENIZED SECURITIES? HESTER: I THINK THE PILOT PROGRAM IS MORE LIKELY TO LOOK LIKE AN AWFUL PILOTS WITH DIFFERENT PEOPLE COMING IN AND TRYING TO DO THIS IN DIFFERENT WAYS. WE ARE NOT TRYING TO BE THE PICKER OF WINNERS AND LOSERS BUT LETTING THE MARKET DECIDE. SO WE EXPECT THERE WILL BE MULTIPLE OPTIONS. KATIE: I WANT TO TALK ABOUT HOW YOU INTERACT WITH SOME OF THE OTHER REGULATORY BODIES IN BC. FOR A LOT OF FOLKS IT IS LIKE ALPHABET SOUP. HOW DO YOU WORK WITH THE CFTC ON CRYPTO RIGHT NOW, IF AT ALL? WHAT IS THE RELATIONSHIP? HESTER: WE HAVE A GOOD RELATIONSHIP WITH THE CFTC GOOD I HAVE WORKED PERSONALLY WITH THEM ON A NUMBER OF ISSUES INCLUDING SECURITY BASED SWAPS. SO RIGHT NOW, BOTH AGENCIES ARE COMING OFF THE PRESIDENT'S WORKING GROUP REPORT RECOMMENDATIONS AND BOTH TRYING TO IMPLEMENT THOSE RECOMMENDATIONS, THE ONES WE CAN START ALREADY ABSENT MARKET STRUCTURE LEGISLATION. WE ARE COORDINATING WITH THE CFTC ON MOVING FORWARD WITH THOSE RECOMMENDATIONS. KATIE: ONE OF THE RECOMMENDATIONS WAS THAT CRYPTO EXCHANGE'S AND OTHER ENTITIES ARE REGISTERED AND SHOULD HAVE TO PAY TRANSACTION FEES THE SAME WAY TRADITIONAL BROKERAGES DO. DO YOU AGREE WITH THAT? HESTER: I CERTAINLY UNDERSTAND THAT WE NEED TO HAVE THE FISA FALL ON THE PEOPLE WHO ARE BENEFITING FROM THE REVENUE OF THE FEES AND AS THE MARKETS CHANGE THOSE CHANGES SHOULD BE IN FEET REVENUES. KATIE: YOU BROUGHT UP MARKET STRUCTURE AND WE KNOW THE CRYPTO MARKET STRUCTURE BILL IS WORKING ITS WAY THROUGH. THE SENSE SEEMS TO BE THAT IT FACES MUCH TOUGHER GO-AHEAD THAN THE STABLECOIN. I WOULD LOVE TO HEAR YOUR THOUGHTS. HESTER: I DON'T PROGNOSTICATE ABOUT LEGISLATION MORE THAN I DO ABOUT THE MARKETS AND WHICH ONES WE MIGHT EMBRACE BUT I DO THINK THE WORK HAS BEEN IMPRESSIVE ON THE PART OF THE HOUSE AND THE SENATE IS NOW LOOKING AT THE ISSUES. IT IS A VERY COMPLICATED PIECE OF LEGISLATION TO WORK OUT BUT IMPORTANT AND WE ARE HAPPY TO WORK WITH PEOPLE IN BOTH THE HOUSE AND SENATE IN TRYING TO GET IT TO THE PLACE WHERE IT WILL HELP TO GUIDE THE SHAPING OF THE INDUSTRY. KATIE: LET'S SAY THAT CONGRESS ISN'T ABLE TO FINISH THE MARKET STRUCTURE BUILT BY NOVEMBER. WHAT DOES THAT MEAN FOR THE SEC AND THE APPROACH TO REGULATION? HESTER: ONE THING THAT IS IMPORTANT TO UNDERSCORE IS THAT WE ARE NOT WAITING FOR LEGISLATION TO WORK. WE HAVE A LOT OF WORK WE CAN DO UNDER THE EXISTING 30 WE HAVE AND WE THINK THE PRESIDENT'S WORKING GROUP REPORT URGED US TO TAKE STEPS AND WE HAVE BEEN WORKING SINCE JANUARY ON PROVIDING GUIDANCE ON WHERE THE SECURITY APPLY AND HELPING FIRMS TO NAVIGATE THE RULES. THAT IS SOMETHING WE ARE HARD AT WORK ON RULEMAKING AND WEIGHT THINK THAT WHAT WE DO WILL BE CONSISTENT WITH WHATEVER MARKET STRUCTURE LEGISLATION COMES OUT. KATIE: DO YOU WANT TO TALK A LITTLE BIT ABOUT CRYPTO PUT TOGETHER TO IMPLEMENT THE WORKING GROUP RECOMMENDATIONS. HOW IS THAT PROJECT GOING AND WHAT DOES IT LOOK LIKE? HESTER: IT IS GOING WELL. WE ARE WORKING COLLABORATIVELY WITH THE STAFF OF THE SEC. WE ARE MEETING WITH INDUSTRY AND OTHER INTERESTED PARTIES, TAKING WRITTEN COMMENTS AND PUTTING THAT TOGETHER INTO A PACKAGE OF REFORMS. WE HAVE GOTTEN GUIDANCE OUT THE DOOR BUT HOPING TO GET SOME RULEMAKING PROPOSED OF THE DOOR AS WELL. KATIE: WE APPRECIATE YOU TAKING THE TIME TODAY. THAT IS THE SEC COMMISSIONER, HESTER PEIRCE. COMING UP NEXT, WE WILL BE SPEAKING WITH BLOOMBERG'S ALLISON SCHRAGER ABOUT BLOOMBERG AND CRYPTO. A $20 BILLION EQUITY OFFERING TO PURCHASE EITHER AFTER EITHER PRICES CLIMB IN A BIG WAY TRADING NEAR THE HIGHEST LEVEL SINCE 2021. WE WILL DIG INTO THAT AND MORE NEXT. THIS IS BLOOMBERG CRYPTO. > > I SEE THE ARGUMENT FOR LET'S OPEN UP THE SPACE. I CANNOT IMAGINE BUT THE IMPLEMENTATION OF THAT LOOKS LIKE BECAUSE THEY ARE AT FIDUCIARIES. IT IS ON THEM TO DO DUE DILIGENCE AND BUT THE OPTIONS TOGETHER FOR THE INVESTORS AND FIGURE OUT WHAT MAKES SENSE. IT IS A HUGE HURDLE FROM IDEA TO IMPLEMENTATION. KATIE: THAT WAS CYNTHIA MURPHY WITH TMX ON ETF IQ SPEAKING TO ME AND THE CREW YESTERDAY. EVEN IF ALL OF THE HURDLES CAN BE CLEARED FOR ALTERNATE ACCESS IN RETIREMENT ACCOUNTS, NOT EVERYONE IS ON BOARD. TO SOME, IT IS LIKE JUST BECAUSE YOU CAN DOESN'T MEAN YOU SHOULD. THAT IS THE VIEW OF THE OPINION COLUMNISTS ALLISON SCHRAGER. GREAT TO SEE YOU IN PERSON. ALLISON: GREAT TO SEE YOU. KATIE: WHY SHOULD THIS TAKE PAUSE ON THE PART OF THE FIDUCIARIES AND WHETHER OR NOT TO PUT IT INTO THE RETIREMENT ACCOUNTS? ALLISON: THE REASON WHY WANT CERTAIN ASSETS AS IT GETS PEOPLE CLOSER TO THE RETIREMENT GOALS BUT DOESN'T EXPOSE THEM TO UNDUE RISK IT AND THAT RISK RETURN TRADE-OFF IS THERE AND IS SUPPOSED TO BE A VALENCE. QUESTION IS WHAT IS CRYPTO ADDING. THE BOOSTERS HAVE ONLY SEEN IT GO UP BUT IT IS A SUPER RISKY ASSET. IT APPEARS TO HAVE A VERY HIGH BETA. QUESTION IS, WOULD YOU GIVE PEOPLE THE OPTION TO SELL A LOT OF LEVERAGE TO THE STOCK PORTFOLIO, PROBABLY NOT. THE BIG QUESTION IS WHETHER OR NOT IT QUALIFIES AS A DEFAULT. 5% OF PEOPLE SAY WHAT THE DEFAULT INVESTMENT IS. PLAN SPONSORS CAN SAY WE ARE GIVING PEOPLE THE OPTION BUT BURIED IN THE OPTIONS. I THINK WHEN THEY OFFER IT AS A DEFAULT INVESTMENT IN PEOPLE INVEST IN IT, THAT WILL BE A MIX -- BIGGER HURDLE. KATIE: SO FOR EXAMPLE HE WILL GET A COMPANY THAT HAS A 401(K) AND INCLUDED IN A TARGET DATE FUND. ALLISON: YES. KATIE: IF IT'S NOT COME TO THOSE ADDING IT TO THE 401(K) REALLY NEED IT. ALLISON: THAT IS MORE DEFENDABLE. THIS PERSON SEEKS THIS OUT AND WENT TO THE MENU OPTION AND FEEL STRONGLY AND WANT CRYPTO IN THEIR 401(K). I WOULD ADVISE THAT BUT YOU DO YOU AND THAT IS PART OF THE 401(K) WORLD. I GUESS THAT IS MORE DEFENDABLE AND ALSO WITHOUT TAKING ANY FIDUCIARY LIABILITY THEY COULD ARGUE THAT. KATIE: WHAT DO YOU MAKE OF ALL OF THE GROWTH AND INNOVATION NOT CAPTURED BY THE U.S. PUBLIC MARKETS ANYMORE, WE ARE TALKING ABOUT PRIVATE COMPANIES. A LOT OF THINGS I HEAR IN THE ARGUMENT OF WHY YOU SHOULD BE ABLE TO INVEST IN YOUR 401(K) IS THE MOST EXCITING COMPANIES ARE NOT GOING PUBLIC ANYMORE AND YOU'RE MISSING OUT ON A LONG TERM GAINS. WHAT YOU MAKE OF THAT? ALLISON: EXCITEMENT IS SUPPOSED TO BE IN YOUR 401(K). LOOKING AT PLANS IN UPON HEAVILY INTO PRIVATE ASSET, THEY ARGUED THAT YOU'RE NOT TOUCHING THE MONEY FOR YEARS AND THERE IS THE LIQUIDITY PREMIUM BUT WE ARE STARTING TO SEE BENEFIT PLANS NOT GETTING THEIR MONEY BACK OR RETURNING TO THE SECONDARY MARKET. THESE ARE ASSETS THAT HAVE MARKET PRICING AND ALREADY IF YOU ARE RUNNING THAT ARE YOU BETTER AND A LOT OF THEM AREN'T DOING WELL. HERE IS THE QUESTION OF WHY WOULD WE ALLOW THIS FOR THE 401(K) MARKET WHEN YOU HAVE SOME OF THE LEAST SOPHISTICATED INVESTORS STARTING TO INVEST IN SOMETHING THAT IS THE LEAST TRANSPARENT AND WELL REGULATED. KATIE: I COVER ETS PRIMARILY AND IT IS STRIKING THAT WE ARE GOING TO HAVE CRYPTO IN YOUR 401(K) BEFORE WE SEE THE ETS TO BE AVAILABLE TO GET INTO THE SYSTEM. ALLISON: I THINK IT IS JUST THERE IS A LOT OF APPETITE WITH THIS ADMINISTRATION TO GIVE PEOPLE MORE FINANCIAL RISK. THAT MIGHT BE PART OF THE JUSTIFICATION IS THAT THERE ARE ASSETS AND IN THE LAST COUPLE OF DECADES THEY ONLY SEEM TO HAVE GONE UP AND IF THEY ONLY GO UP, THEN PEOPLE SHOULD HAVE ACCESS TO THEM BUT WE ALL KNOW THAT NOTHING ALWAYS GOES UP AND IF IT HAS EXTRA RETURNS, IT PROBABLY ALSO NEEDS MORE RISK. KATIE: GREAT TO GET YOUR PERSPECTIVE ON THINGS. THAT IS OUR BLOOMBERG OPINION COLUMNISTS, ALLISON SCHRAGER. WE WILL SPEAK ABOUT THE BULLISH IPO AND TO ACCESS ALL THE LATEST DATA, CHECK OUT THE BLOOMBERG TERMINAL. THIS IS \"BLOOMBERG CRYPTO.\" ♪ > > IT IS DIGITAL GOLD AND WILL ACCELERATE THE CAPITAL FROM PHYSICAL TO DIGITAL GOLD. BITCOIN LIVES IN CYBERSPACE. NO TARIFFS IN CYBERSPACE. KATIE: THAT WAS THE STRATEGY FOUNDER AND CEO MICHAEL SAILOR SPEAKING TO ME LAST WEEK. STRATEGY BUT EVEN MORE BITCOIN AGAIN THIS PAST WEEK. THE NUMBER OF PUBLICLY TRADED CRYPTO COMPANIES HAS BEEN INCREASING ALMOST WEEKLY THIS SUMMER. ONE SET IPO IS BULLISH, THE OWNER OF CRYPTO PUBLICATION COINDESK. OUR REPORTER, AND ANY USE, IS ON THE STORY AND HE JOINS US ON SET. TALK TO US ABOUT THIS IPO. IT HAS BEEN A GOOD SUMMER FOR IPOS IN GENERAL AND THIS ONE IN PARTICULAR LOOKS TO BE FACING HEFTY DEMAND. > > THAT HAS ALREADY BEEN REVISED UP. BULLISH IS LOOKING TO RAISE 900 MILLION DOLLARS WHICH IS INTERESTING GIVEN IN 2021, 20 22, THEY TRY TO DO A SPAC MERGER AT 9 BILLION, WHICH IS A LOT MORE THAN WHAT WE ARE TALKING ABOUT AND THAT WOULD ALLOW THEM TO RAISE IT AS WELL. IT IS INTERESTING THE COMPANY IS GOING PUBLIC AT A LOWER EVALUATION BUT THAT IS WHAT WE HAVE SEEN WITH RECENT IPOS SUCH AS CIRCLE AND SIGMA. IT HAS BEEN MUCH APPRECIATION AND SHARE PRICES ONCE IT IS GOING PUBLIC WITH COINBASE, A MARKET CAP OF 80 BILLION AND A CIRCLE WITH THE MARKET CAP AROUND 40 MILLION, WE HAVE BULLISH COMING IN AND THERE IS A GOOD CHANCE OF EXPANDING FOR PEOPLE TO SEE OPPORTUNITY. KATIE: YOU MAKE AN APPOINTMENT POINT COME USING CIRCLE, IT IS UP SOMETHING CLOSE TO 130% SINCE ITS IPO. I HAVE TO IMAGINE THE FOLKS OVER AT THE BULLISH CEASE WE ARE HOPING FOR SOMETHING SIMILAR. ANTHONY: THE BUSINESSES ARE A LITTLE DIFFERENT BUT BULLISH IS NOT SO MUCH FOCUSED ON STABLECOIN SPECIFICALLY BUT HAS A CRYPTO EXCHANGE THAT HAS BEEN GROWING MARKET SHARE SUBSTANTIALLY IN RECENT YEARS AFTER IT STARTING FAIRLY RECENTLY IN 2021. PEOPLE WILL BE LOOKING HOW THAT COMPARES WITH COINBASE WHICH IS MUCH LARGER AND DOMINATES THE MARKET SHARE IN THE U.S., CERTAINLY. OBVIOUSLY BULLISH OWNS A LOT OF BITCOIN AS WELL. THERE ARE A FEW DIFFERENT WAYS TO LOOK AT THIS BUSINESS. THERE IS A LOT OF ENTHUSIASM AND WHETHER IT IS JUSTIFIED AT IS NOT IN QUESTION BUT CERTAINLY IT LOOKING LIKE THERE WILL BE A LOT OF DEMAND. KATIE: YOU COVER THE EQUITY CAPITAL MARKETS AND THAT MEANS YOU COVER CRYPTO. WHEN YOU LOOK AT THE REST OF THE YEAR, WHAT DOES THE PIPELINE LOOK LIKE FOR MORE CRYPTO COMPANIES ENTERING THE PUBLIC MARKET? ANTHONY: THERE WILL BE A LOT OF IPOS AFTER LABOR DAY, A SUBSTANTIAL NUMBER. AND A GOOD NUMBER OF THEM WILL BE CRYPTO. THEY WON'T ALL BE CRYPTO BUT THERE ARE THEY ARE -- THERE ARE OTHER AREAS BUT PEOPLE WANT TO INVEST IN GROWTH AND CRYPTO, AI AND AREAS SUCH AS DEFENSE AND AEROSPACE HAVE BEEN WHERE A LOT OF THE ACTION HAS BEEN. COMPANIES OUTSIDE THOSE INDUSTRIES MAY NOT FIND AS MUCH DEMAND BUT CERTAINLY AT THE MOMENT, CRYPTO, THERE IS A LOT OF MOMENTUM AND PROBABLY THAT IS BECAUSE CRYPTO HAS BEEN MOVED INTO THE MAINSTREAM, MORE REGULATED BUSINESSES. CERTAINLY BULLISH IS SELLING ITSELF AS HOPING INSTITUTIONS LEND THEMSELVES TO CRYPTO. AFTER THIS, YOU COULD ARGUE THAT IT HAS BEEN DRIVEN BY RETAIL INVESTORS BUT THE BIG PART OF THE THESIS IS BEHIND BULLISH. KATIE: IT WILL BE INTERESTING TO SEE HOW THE PRICING SETTLES. THAT IS ANTHONY HUGHES WITH BLOOMBERG NEWS. THAT DOES IT FOR \"BLOOMBERG CRYPTO.\" WE WILL SEE YOU AGAIN NEXT WEEK. THIS IS BLOOMBERG. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "MORE CRYPTO COMPANIES",
      "weight": 0.07076492
    },
    {
      "name": "DIFFERENT PEOPLE",
      "weight": 0.06815535
    },
    {
      "name": "MARKET STRUCTURE",
      "weight": 0.06392563
    },
    {
      "name": "MARKET SHARE",
      "weight": 0.06366566
    },
    {
      "name": "BLOOMBERG CRYPTO",
      "weight": 0.063008904
    },
    {
      "name": "CREDIT MARKETS",
      "weight": 0.062188666
    },
    {
      "name": "MARKET",
      "weight": 0.06202003
    },
    {
      "name": "NATIVE CRYPTO FIRMS",
      "weight": 0.06119363
    },
    {
      "name": "CRYPTO",
      "weight": 0.06049348
    },
    {
      "name": "ABSENT MARKET STRUCTURE LEGISLATION",
      "weight": 0.05980327
    }
  ],
  "topics": [
    {
      "name": "Cryptocurrency"
    },
    {
      "name": "SEC"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.833984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8251953125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.6044921875
    }
  ],
  "sentiment": {
    "positive": 0.4082643,
    "negative": 0.15002714,
    "neutral": 0.4417085
  },
  "summary": "The SEC (SEC) Commission is addressing Tokenization Regulation (Tokenization Regulation), which allows for the creation of public credit markets in 401(K) accounts to reinvest in CRYPTO. The SEC Commissioner, HESTER PEIRCE, joined in an exclusive interview with BLOOMBERG OPINIONS''S ALLISON SCHRAGER and the CEO of the company for this discussion. The company's revenue has increased by 53% last quarter, with a 6.3% increase in shares compared to the previous year. The Executive Order signed by President Donald Trump could allow 401 (K) Accounts to be used to invest in CrYPTO, potentially opening the CRCREDIT MARKETS to the public and potentially creating a fairer, more diverse market for these types of products. HESter: The SEC has begun the process of opening CREDIT markets to retail and is considering ways to manage these markets differently.",
  "shortSummary": "The SEC is addressing the implications of the Bloomberg CRYPTO and PRIVATE Markets reforms, focusing on transparency and efficiency to attract investment.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9ca8ac31adcd42638e3d6e50b39ccfe5",
  "places": [
    {
      "osmId": "447018423",
      "road": "Wall Street",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10005",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Financial District",
      "coordinates": {
        "lat": 40.7059917,
        "lon": -74.0087767
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "The Bloomberg Crypto segment discusses the current state of the cryptocurrency market, highlighting Bitcoin's rise to near $120,000 and Ether's significant rally, which has attracted $1 billion in investments. SEC Commissioner Hester Peirce addresses the potential for retirement accounts to invest in cryptocurrencies following a recent executive order by President Trump, emphasizing the need for careful regulation to manage risks. Additionally, the segment covers the upcoming IPO of Bullish, a crypto trading platform, and the broader trend of increasing public interest in crypto investments.",
  "argos_id": "1IKD0ZOZM"
}