{
  "url": "https://nypost.com/2025/08/12/sports/odell-beckham-jr-angrily-responds-to-fake-retirement-report/",
  "authorsByline": "Dylan Svoboda",
  "articleId": "f3fa201ab1ac4670b9d9b631791eb154",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-rleafzyv4-1755032406207.jpg?quality=75&strip=all&1755018023&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:11:27+00:00",
  "addDate": "2025-08-12T21:13:53.522888+00:00",
  "refreshDate": "2025-08-12T21:13:53.522890+00:00",
  "score": 1.0,
  "title": "Odell Beckham angrily responds to fake retirement report",
  "description": "Fake news took another victim in Odell Beckham Jr. on Tuesday.",
  "content": "Fake news took another victim in Odell Beckham Jr. on Tuesday.\n\nOn Tuesday morning, an X account parodying ESPN’s Adam Schefter spread a fake rumor that the former Giants star was retiring from the NFL.\n\n“After 10 seasons in the NFL, Odell Beckham Jr. has decided to retire,” the account, which goes by @AdamSche1fer, wrote. “Beckham Jr. played for the Giants, Browns, Rams, Ravens, and Dolphins. He announced Tuesday.”\n\nThe post apparently made it to Beckham, currently a free agent with Opening Night less than a month away.\n\nThe three-time Pro Bowler set the record straight with a reply to the post, saying “LOL WTF… when was that announced and by who? That’s funny, appreciate the concerns but this Shxt ain’t over yet.”\n\nA minute later, Beckham doubled down, writing “Not done yet… thanks for hr concerns and have a blessed day.”\n\nAnd he didn’t stop there.\n\n“No seriously,” Beckham wrote on the platform a little over an hour later. “Plz stop reading everything on the internet, and stop texting me happy retirement b4 u piss me off. That will get no response. I promise u the day I’m done I will let u kno. Again if u text me happy retirement im just gon have to block u. Thanks.”\n\nBeckham, 32, is without a job after playing nine games and catching nine passes for 55 yards with the Dolphins last season.\n\nHe began his career in 2014 with the Giants, who drafted him 12th overall, and was later traded to the Browns in March 2019 and spent time with the Ravens, Rams and Dolphins after his time in Cleveland.\n\nIn 10 NFL seasons, Beckham has totaled 575 receptions for 7,987 receiving yards and 59 touchdowns. He won Super LVI with the Rams.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/12/sports/tyrod-taylor-undergoes-knee-surgery-to-throw-wrench-into-jets-qb-plans/",
    "https://nypost.com/2025/08/12/sports/a-twist-emerges-in-6-billion-celtics-sale-as-new-owner-readies-for-control/",
    "https://nypost.com/2025/08/12/sports/amanda-balionis-lounges-in-a-bikini-during-relaxing-ibiza-trip/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Odell Beckham Jr.",
      "weight": 0.12110029
    },
    {
      "name": "Odell Beckham",
      "weight": 0.11759398
    },
    {
      "name": "Beckham Jr.",
      "weight": 0.11715577
    },
    {
      "name": "Beckham",
      "weight": 0.10697821
    },
    {
      "name": "fake retirement report",
      "weight": 0.08820988
    },
    {
      "name": "happy retirement",
      "weight": 0.08545585
    },
    {
      "name": "hr concerns",
      "weight": 0.07810067
    },
    {
      "name": "last season",
      "weight": 0.07320658
    },
    {
      "name": "Fake news",
      "weight": 0.072406314
    },
    {
      "name": "Giants",
      "weight": 0.07178703
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97900390625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.93603515625
    },
    {
      "name": "/News/Sports News",
      "score": 0.927734375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.74853515625
    }
  ],
  "sentiment": {
    "positive": 0.094500646,
    "negative": 0.54781127,
    "neutral": 0.3576881
  },
  "summary": "Ollll Beckham Jr. was targeted by an X account parodying ESPN's Adam Schefter, claiming he was retiring from the NFL after 10 seasons. Beckham responded angrily to the fake news, stating that when was the announcement made, \"LOL WTF\", and that he would not be publishing happy retirement. The former Giants star is currently a free agent after nine games and nine catches for the Dolphins last season. He has played for the Giants, Browns, Rams, Ravens, and Dolphins since his retirement.",
  "shortSummary": "Ollie Beckham Jr. rebuts a fake retirement report, insisting: “I'm still here.\"",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f3e7f5c828484957bb6b63e5eb225612",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/12/sports/amanda-balionis-lounges-in-a-bikini-during-relaxing-ibiza-trip/",
      "text": "CBS reporter Amanda Balionis enjoyed some R&R in Ibiza before she hits the sidelines for the 2025 NFL season.\nTaking to Instagram, Balionis shared a carousel of snapshots from the trip she took with her grade school friends and their partners.\n“Hey Ibiza.. It was really nice to meet ya 🤝 Never take for granted that many of my best friends are the ones I met in elementary school,” Balionis, 39, captioned the Saturday post. “To take this trip with them… well I think 5th grade us would be really proud of how far we’ve come, and that we continue to choose to do it together ❤️❤️ also shoutout to the guys for marrying the most fun partners 🫡.”\nBalionis looked stunning in a white bikini as she enjoyed a coconut cocktail under the sun.\nOther images spotlighted group dinners, sightseeing and partying in fluorescent-lit clubs.\nBalionis took some well-deserved time off after 19 weeks on the road with “Golf on CBS.”\nLast week, she shared a tribute to her broadcast team, including photos from the season.\n“Hard to put into words what 19 weeks on the road really looks like,” Balionis wrote. “For us announcers, we have it easy — we show up to work with hotel rooms already booked, everything we need waiting at check-in. Our headsets and mics work flawlessly, our sets are stocked, and our camera operators have been setting the scene for days.”\nBalionis made headlines off the course last May when a Daily Mail report linked her and McIlroy after he filed for divorce from his wife of seven years, Erica Stoll.\nMcIlroy, 36, and Stoll have since reunited, and his divorce petition was voluntarily dismissed.\nFans noticed Balionis wasn’t wearing her wedding ring last February while covering the Genesis Invitational.\nBalionis married former North Carolina quarterback Bryn Renner, who also had a brief career in the NFL, in 2022.\nBalionis, who wasn’t wearing her ring in the Ibiza photos, has not publicly addressed speculation about a divorce, but Renner no longer appears on her social media pages.\nUs Weekly confirmed last spring that Balinois and the reigning Masters champ “are not dating and only have a professional relationship.”\nBalionis joined CBS Sports in 2017 as a golf reporter and also serves as a sideline reporter for select NFL ON CBS games and CBS Sports Network college football games."
    }
  ],
  "argos_summary": "Odell Beckham Jr. was the target of a fake retirement rumor spread by a parody account on X, which he quickly debunked, emphasizing that he is not retiring and urging fans to stop sending him retirement messages. Beckham, a free agent after a season with the Dolphins, has had a successful NFL career with notable achievements, including a Super Bowl win. In a separate note, CBS reporter Amanda Balionis shared her recent trip to Ibiza with childhood friends, reflecting on their long-lasting friendships and her experiences in broadcasting.",
  "argos_id": "1M4P9HRSJ"
}