{
  "url": "https://www.usatoday.com/story/money/2025/08/12/capital-one-class-action-settlement/85629590007/",
  "authorsByline": "Sara Chernikoff",
  "articleId": "77ba18ae8dd047e4a6fe58a7423768f9",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/04/10/USAT/83028622007-20211112-t-235751-z-485193184-rc-29-tq-9-nhjv-1-rtrmadp-3-capitalonefinresults.JPG?crop=7181,4040,x0,y718&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:02:52+00:00",
  "addDate": "2025-08-12T23:05:38.611209+00:00",
  "refreshDate": "2025-08-12T23:05:38.611211+00:00",
  "score": 1.0,
  "title": "Capital One $425 million class action settlement reached: See if you qualify",
  "description": "If you had a Capital One 360 savings account between Sept. 2019 and June 2025, you may qualify for payments in the class action settlement.",
  "content": "If you had a Capital One 360 savings account between Sept. 2019 and June 2025, you may be eligible to receive payment as part of a $425 million settlement.\n\nAccording to a notice filed in the United States federal court in Alexandria, Virginia, Capital One customers filed a class action lawsuit against the bank in 2024. Earlier this year, the Consumer Financial Protection Bureau (CFPB) also sued Capital One, alleging the company froze its rate at a low level for years, despite increasing national rates. As a result, customers were cheated out of more than $2 billion in lost interest payments, according to the Bureau.\n\nIn a statement, the Bureau said Capital One marketed its 360 Savings account as “high interest” with a variable rate that was “one of the nation’s best,\" and that consumers would earn much more interest than the average savings or money market account. The Bureau called these representations \"false or otherwise misleading.\"\n\nThe CFPB dropped the lawsuit in February, but Capital One has agreed to pay $425 million in a separate class action lawsuit settlement.\n\nHere's what you need to know about the class action settlement.\n\nCapital One advertised its 360 Savings account as its high-interest savings account, Kiplinger, a finance news outlet, reported, adding that it later froze interest rates on that account at 0.3%. At the same time, rates on its newer account called \"360 Performance Savings\" increased to a peak of 4.3% in 2022 after the Federal Reserve did a rapid series of rate hikes.\n\nCustomers of the older savings account, the Capital One 360 savings account, allegedly weren't notified of the new and higher-earning account.\n\nCurrent and former customers who maintained a Capital One 360 Savings account between Sept. 18, 2019, and June 16, 2025, qualify for payments.\n\nHow much will customers receive?\n\nAccount holders will receive payments totalling what they \"would have earned if their 360 Savings account(s) had paid the interest rate then applicable to the 360 Performance Savings account,” according to the settlement.\n\nThe remaining payments will go towards customers who still have a 360 savings account. Their accounts will earn an interest rate that is \"at least two times the national average rate for savings deposit accounts as calculated by the FDIC,\" the settlement stated.\n\nThe settlement awaits court approval, with a hearing slated for Nov. 6. The deadline to submit a claim or write to the court objecting to the settlement is Oct. 2.",
  "medium": "Article",
  "links": [
    "https://puzzles.usatoday.com/",
    "https://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-capital-one-for-cheating-consumers-out-of-more-than-2-billion-in-interest-payments-on-savings-accounts/",
    "https://capitalone360savingsaccountlitigation.com/Login",
    "https://www.usatoday.com/picture-gallery/money/2024/03/13/here-are-the-16-states-you-need-a-million-dollars-to-retire/72964711007/",
    "https://www.kiplinger.com/personal-finance/banking/the-425-million-capital-one-settlement-find-out-whos-eligible-for-a-payout-and-what-happened",
    "https://business.cch.com/BFLD/Capital-One-360-Savings-Account-Litigation-EDVa-Joint-Notice-Class-Action-Settlement-Terms-ECF-05162025.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "interest rates",
      "weight": 0.11534436
    },
    {
      "name": "savings deposit accounts",
      "weight": 0.1116107
    },
    {
      "name": "lost interest payments",
      "weight": 0.100126565
    },
    {
      "name": "360 Performance Savings",
      "weight": 0.098665126
    },
    {
      "name": "360 Savings",
      "weight": 0.09766039
    },
    {
      "name": "Account holders",
      "weight": 0.097246304
    },
    {
      "name": "national rates",
      "weight": 0.09194184
    },
    {
      "name": "high interest",
      "weight": 0.090600155
    },
    {
      "name": "Capital",
      "weight": 0.09010525
    },
    {
      "name": "rate hikes",
      "weight": 0.087894656
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.853515625
    },
    {
      "name": "/Finance/Banking/Other",
      "score": 0.767578125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.7666015625
    },
    {
      "name": "/Law & Government/Legal/Business & Corporate Law",
      "score": 0.70654296875
    },
    {
      "name": "/Shopping/Consumer Resources/Consumer Advocacy & Protection",
      "score": 0.6240234375
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.439453125
    },
    {
      "name": "/Finance/Credit & Lending/Other",
      "score": 0.358154296875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.30517578125
    }
  ],
  "sentiment": {
    "positive": 0.07496157,
    "negative": 0.6255039,
    "neutral": 0.29953447
  },
  "summary": "If you had a Capital One 360 savings account between Sept. 2019 and June 2025, you may be eligible for payment as part of a $425 million settlement. The bank allegedly froze its rate at a low level for years, despite increasing national rates, leading to more than $2 billion in lost interest payments. The Consumer Financial Protection Bureau (CFPB) also sued Capital One, alleging that the company marketed its 360 Savings account as \"high interest\" with a variable rate and claimed consumers would earn significantly more interest than the average savings or money market account. The CFPB called these representations \"false or otherwise misleading\". The settlement is pending court approval, with a hearing scheduled for Nov. 6.",
  "shortSummary": "Capital One is paying $425 million to settle a class action lawsuit and CFPB claims over misleading interest rates and misleading claims, including one involving Capital One's 360 Savings account.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "7b7a2163b33b46278679239ab340017b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.kiplinger.com/personal-finance/banking/the-425-million-capital-one-settlement-find-out-whos-eligible-for-a-payout-and-what-happened",
      "text": "Capital One $425M Class Action Settlement: Do You Qualify?\nCapital One agreed to a $425 million settlement over its 360 Savings account interest rates. Here’s what you need to know.\nCapital One agreed to pay a total of $425 million to customers who filed a class action lawsuit against the bank in 2024, according to a notice filed in the U.S. federal court in Alexandria, Virginia in May. The settlement is still awaiting the judge’s approval before payments can be sent out.\nWhile there has been a ton of attention on the Capital One-Discover merger, the major bank has also been fighting a class action lawsuit regarding its savings account since last year. The lawsuit claims that Capital One pulled a bait and switch on savings account customers.\nIt advertised the 360 Savings account as its high interest savings account and later froze rates on that account at 0.3% while rates on its newer, similarly-named 360 Performance Savings account soared to a peak of 4.3% when the Federal Reserve began rapidly increasing interest rates.\nSign up for Kiplinger’s Free E-Newsletters\nProfit and prosper with the best of expert advice on investing, taxes, retirement, personal finance and more - straight to your e-mail.\nProfit and prosper with the best of expert advice - straight to your e-mail.\nAs a result, the lawsuit alleges, Capital One avoided paying over $2 billion in interest to its customers between 2019 and 2025. As part of the agreement, Capital One denies any wrongdoing. Here’s what we know so far.\nWhat are the accusations in the Capital One lawsuit?\nWhen Capital One first launched its 360 Savings account in February 2019, it was advertised as a high interest savings account. By September of that year, the bank had removed all references to that account, stopped offering it to new customers and replaced it with information about the new 360 Performance Savings account.\nThe new 360 Performance Savings account opened with a 1.9% APY, while the previous 360 Savings account earned just 1% APY. The lawsuit alleges that Capital One actively deceived customers by advertising the 360 Savings account as its high interest product, but then later creating a new, higher-earning account without automatically converting the older account type or notifying existing customers.\nWhen the pandemic hit in 2020 triggering even lower interest rates, Capital One dropped rates on the older account type to just 0.3%, while the 360 Performance Savings account earned 0.4%.\nThe crux of the suit is what happened after this. When the Federal Reserve began a rapid series of rate hikes in 2022, the Capital One 360 Performance Savings account saw its APY soar to 4.3%, while the older 360 Savings accounts were frozen at the 0.3% rate.\nThe claimants allege that Capital One avoided paying over $2 billion in interest between 2019 and 2025 as a result.\nThe Consumer Financial Protection Bureau (CFPB) announced in January that it was also suing Capital One over the same issue. The agency accused the bank of actively obscuring the newer, higher-earning 360 Performance Savings from existing 360 Savings accountholders.\nThe CFPB suit alleged that Capital One did this by:\n- Giving the new account an almost identical name, along with all the same terms and conditions (aside from the interest rate)\n- Replacing all references to the original 360 Savings account on its website with information about the new 360 Performance Savings account, without notifying accountholders that it was maintaining the older account type as a distinct product (and that that product would no longer be its highest-earning savings account option)\n- Forbidding employees from proactively telling 360 Savings accountholders about the new 360 Performance Savings product\n- Excluding existing 360 Savings accountholders from an advertising campaign about the newer account – a campaign that showcased the higher earning product to all of Capital One’s other existing customers who didn’t currently have the older savings account\nBy February, the Trump administration dropped the Capital One case along with dozens of others. But if the CFPB’s suit had moved forward, it would have forced Capital One to pay even more into a victims' relief fund that could help Capital One customers recoup even more of the potential earnings they missed out on between 2019 and 2025.\nWho is eligible for a payout from the Capital One settlement?\nThe settlement will apply to both current and former customers who have or had a Capital One 360 Savings account at some point between September 18, 2019 and the date the judge approves the settlement.\nHow much will members of the class action lawsuit get?\nThe $425 million settlement will be paid out in two ways:\n- $300 million will be used to pay all members of the class action lawsuit the amount of interest they would have earned if their account had been earning the same rates as the 360 Performance Savings account. The amount each member gets will be based on the length of time they held the account and what the rates were for the 360 Performance Savings account during the time that they had the older 360 Savings account.\n- The remaining $125 million will go toward customers who still have a 360 Savings account. Their accounts will now earn at least double the national average rate for savings accounts, as defined by the FDIC.\nThe exact amount each eligible recipient will get has not been calculated yet. However, it's currently estimated that those who have already closed their 360 Savings account (or who do so before October 2, 2025) will receive a 15% larger payout than those who keep the savings account open.\nFor those who keep it open, the payout will be smaller, but you will also receive additional interest payments in your savings account. Whether those additional payments outweigh the estimated 15% cut to your class action settlement payout remains to be seen.\nIf you want to try to calculate that additional interest yourself, the formula used is available. The amount will be the approximate amount of additional interest your account would have earned during the class period (September 18, 2019 through June 16, 2025) if your account had the same interest rate as the 360 Performance Savings account.\nSo, calculating it yourself would involve looking back through your records to find out when you opened the account. Then, find out what the 360 Performance Savings interest rate was for each month during that class period that your account was open. Finally, calculate the difference between the interest you would have earned in the higher yield account and the interest you actually earned.\nIf that sounds like too much math, you'll just have to make an educated guess. If you only had the account for a couple of months during that eligible window, closing your account now and opting for the larger cash payout might make more sense. But if you've had the account for a year or more or you have a large balance in that account, it probably makes more sense to keep the account open and take the additional interest payments.\nWhen will Capital One begin sending out payments?\nThe settlement is still pending court approval, which is scheduled for November 6, 2025. In the meantime, the date that payouts start going out is still to be determined. If you think you're eligible for a payout, you will automatically receive a check. There's no need to file a claim.\nBut, if you'd like to choose a specific payment method or update your address, go to the Capital One 360 Savings Account Litigation website to learn more. You have until October 2, 2025 to choose a payment method. If you don't choose, the default method will be a physical check sent to you by mail to your last known address.\nThe same applies to customers who still have an open Capital One 360 Savings account. Since you are also entitled to backpay for unpaid interest under the settlement, you'll automatically receive the additional interest in your savings account.\nHow to make sure you’re really getting the best rate on your savings account\nWhether you’re a Capital One customer or not, one thing this case highlights is the importance of being vigilant about your finances. Savings accounts – even high yield savings accounts – have variable interest rates by nature.\nSo, even if the account you opened offered the best rate at the time, that same bank or its competitors may be offering an even better rate now. Here are some steps you can take to make sure you’re always earning as much as possible on your savings:\n- Check the best high yield savings account offers available every few months and compare today’s best rates to what your existing account is earning. Opening a new account online takes as little as five minutes, so it’s easier than ever to move your savings around as often as needed to make sure you’re always earning the best rate.\n- Stash any savings you don’t need immediate access to in a high-yield CD account. Unlike savings accounts, a CD offers a fixed rate for the entire term so you won’t see your initially high APY dwindle over the next few months or years. With terms ranging from as little as three months up to five years, you can pick a time frame that fits with your savings goals. These are great to use for short-term savings goals, like a vacation you’re planning next year or a down payment on a new car.\n- Check for fees and account requirements before opening an account. Some banks have minimum balance requirements, maintenance fees or other restrictions that can result in charges that eat into your savings. Taking a slightly lower interest rate on a no-fee savings account might end up earning you more than the higher-yield account with hard-to-meet requirements.\nRelated content\nProfit and prosper with the best of Kiplinger's advice on investing, taxes, retirement, personal finance and much more. Delivered daily. Enter your email in the box and click Sign Me Up.\nRachael Green is a personal finance eCommerce writer specializing in insurance, travel, and credit cards. Before joining Kiplinger in 2025, she wrote blogs and whitepapers for financial advisors and reported on everything from the latest business news and investing trends to the best shopping deals. Her bylines have appeared in Benzinga, CBS News, Travel + Leisure, Bustle, and numerous other publications. A former digital nomad, Rachael lived in Lund, Vienna, and New York before settling down in Atlanta. She’s eager to share her tips for finding the best travel deals and navigating the logistics of managing money while living abroad. When she’s not researching the latest insurance trends or sharing the best credit card reward hacks, Rachael can be found traveling or working in her garden.\n-\nThe Fall Garden 'Tax': What to Plant and How to Prepare\nTax Tips Fall gardening could increase your taxes this season. Here’s what to know while planting in 2025.\n-\nJuly CPI Report Boosts Rate-Cut Odds: What the Experts Say\nThe July CPI report shows that tariffs are having a slight impact on inflation, though not enough to keep the Fed from cutting interest rates.\n-\nFor Savers Who Hate Surprises, This Strategy Delivers\nThis approach gives you peace of mind, regardless of whether rate cuts happen.\n-\nHigh-Yield Saving Options Before Rate Cuts Hit\nSavers can still access higher savings rates. However, with inflation rising and potential rate cuts looming, you have a tighter window to capitalize.\n-\nYou'll Kick Yourself in the Fall if You Don't Make This Savings Move Now\nInflation will likely prevent the Fed from cutting rates until the fall. However, does a long-term CD provide enough of a return to outpace climbing prices?\n-\nIs Your Money in the Wrong Place? Why More Savers Are Shifting Money Away from Big Banks\nTraditional savings accounts aren’t cutting it — here’s where the money is going instead.\n-\nThe Rules of 'Revenge Saving' to Take Control of Your Finances\nFrom post-pandemic spending to rising prices, Americans are saving with new urgency. Here's how to channel that momentum into lasting change.\n-\nDave Ramsey Calls Out These 5 Money Mistakes — Are You Guilty?\nYour debt can prevent you from reaching your financial goals. Per financial advisor Dave Ramsey, here are the common reasons keeping you in it.\n-\n3 Things Dave Ramsey Says to Stop Buying — and 2 That Are Worth It\nDebt-free living starts with smart choices. Here's what Ramsey says to avoid and where your money is well spent.\n-\nThis is the Best CD to Get Amid Rate Uncertainty\nThis CD helps you earn more than 4%, with quick access to your cash if you need it."
    },
    {
      "url": "https://www.consumerfinance.gov/about-us/newsroom/cfpb-sues-capital-one-for-cheating-consumers-out-of-more-than-2-billion-in-interest-payments-on-savings-accounts/",
      "text": "CFPB Sues Capital One for Cheating Consumers Out of More Than $2 Billion in Interest Payments on Savings Accounts\nBank unlawfully misled consumers about its 360 Savings accounts and obscured its higher-interest savings product from them\nWASHINGTON, D.C. – Today, the Consumer Financial Protection Bureau (CFPB) sued Capital One, N.A., and its parent holding company, Capital One Financial Corp., for cheating millions of consumers out of more than $2 billion in interest. The CFPB alleges that Capital One promised consumers that its flagship “360 Savings” account provided one of the nation’s “best” and “highest” interest rates, but the bank froze the interest rate at a low level while rates rose nationwide. Around the same time, Capital One created a virtually identical product, “360 Performance Savings,” that differed from 360 Savings only in that it paid out substantially more in interest—at one point more than 14 times the 360 Savings rate. Capital One did not specifically notify 360 Savings accountholders about the new product, and instead worked to keep them in the dark about these better-paying accounts. The CFPB alleges that Capital One obscured the new product from its 360 Savings accountholders and cost millions of consumers more than $2 billion in lost interest payments. The CFPB’s lawsuit seeks to stop the companies’ unlawful conduct, provide redress for harmed consumers, and impose civil money penalties, which would be paid into the CFPB’s victims relief fund.\n“The CFPB is suing Capital One for cheating families out of billions of dollars on their savings accounts,” said CFPB Director Rohit Chopra. “Banks should not be baiting people with promises they can’t live up to.”\nCapital One, N.A. is a national bank with more than $480 billion in assets and is a wholly owned subsidiary of Capital One Financial Corp. (NYSE: COF). Both entities are headquartered in McLean, VA. Capital One offers multiple deposit account products.\nIn 2012, Capital One acquired online bank ING Direct USA, including its online savings account product, “ING Direct,” which was known for having higher-than-average interest rates. In 2013, Capital One rebranded “ING Direct” as “360 Savings,” and started offering 360 Savings accounts to the general public.\nCapital One marketed its 360 Savings account as a “high interest” account with a variable interest rate that was “one of the nation’s” “top,” “best,\" and “highest,” and would earn much more interest than the average savings account. It also assured former ING Direct savings accountholders that, with 360 Savings, they would “still have great rates.” However, from late 2019 to mid-2024, Capital One lowered and then froze the 360 Savings account rate to just 0.30%, even as rates increased nationwide. In contrast, starting in early 2022, Capital One increased the 360 Performance Savings account rate. In fact, the rate went from 0.40% in April 2022 to 3.30% as of January 2023, and 4.35% as of January 2024.\nThe CFPB alleges that Capital One schemed to keep 360 Savings accountholders in their lower-yielding accounts by obscuring 360 Performance Savings’ existence as a distinct product with a higher rate from 360 Savings accountholders. For example, Capital One named and marketed the two products similarly; it eliminated nearly all references to the 360 Savings account product on its website and replaced them with references to the essentially identical 360 Performance Savings account, without notice that 360 Savings continued to exist as a distinct product; it excluded 360 Savings accountholders from a marketing campaign advertising 360 Performance Savings to Capital One’s other existing customers; and it forbade its employees from proactively telling 360 Savings accountholders about 360 Performance Savings. Specifically, the CFPB alleges that Capital One:\n- Misled consumers about “high interest” accounts: Capital One illegally deceived consumers and Capital One, N.A. violated the Truth in Savings Act by representing that 360 Savings provided a variable interest rate that was “one of the nation’s” “top,” “best,\" and “highest,” and would earn much more interest than the average savings account.\n- Kept consumers in the dark to maintain a two-tier system: Capital One misrepresented to existing customers that its 360 Savings account was and would be its only 360 high-interest savings product with the features, terms, and conditions of 360 Savings and obscured from those customers its newer, much-higher-interest 360 Performance Savings accounts, which otherwise had all the same terms, conditions, and features of 360 Savings. Capital One used 360 Performance Savings to attract new depositors without paying existing depositors the interest they were promised. Capital One avoided paying more than $2 billion in additional interest to millions of customers because of these actions.\nEnforcement Action\nUnder the Consumer Financial Protection Act, the CFPB has the authority to take action against institutions violating consumer financial protection laws, including the Truth in Savings Act. It also has the authority to enforce the Consumer Financial Protection Act’s prohibitions on unfair, deceptive, or abusive acts or practices. The CFPB seeks to stop Capital One’s unlawful conduct, provide redress for harmed consumers, and impose civil money penalties, which would be paid into the CFPB’s victims relief fund.\nConsumers can submit complaints about financial products and services by visiting the CFPB’s website or by calling (855) 411-CFPB (2372).\nEmployees who believe their company has violated federal consumer financial protection laws are encouraged to send information about what they know to whistleblower@cfpb.gov. To learn more about reporting potential industry misconduct, visit the CFPB’s website.\nThe Consumer Financial Protection Bureau is a 21st century agency that implements and enforces Federal consumer financial law and ensures that markets for consumer financial products are fair, transparent, and competitive. For more information, visit www.consumerfinance.gov."
    }
  ],
  "argos_summary": "Capital One has agreed to a $425 million settlement related to a class action lawsuit over its 360 Savings account, which allegedly misled customers by freezing interest rates at 0.3% while offering a higher-yielding 360 Performance Savings account without notifying existing account holders. The settlement will compensate current and former customers who held the 360 Savings account between September 2019 and June 2025, with payments based on the interest they would have earned had their accounts received the same rates as the newer account. The settlement is pending court approval, with a hearing scheduled for November 6, 2025.",
  "argos_id": "1QC7F3X3U"
}