{
  "url": "https://www.express.co.uk/life-style/cars/2094110/over-70s-driving-rules-eyesight-test",
  "authorsByline": "Luke Chillingsworth",
  "articleId": "54efa2018b07461f90cbfca68996b21c",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/24/1200x630/6354574.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T07:52:00+01:00",
  "addDate": "2025-08-12T07:08:03.504383+00:00",
  "refreshDate": "2025-08-12T07:08:03.504385+00:00",
  "score": 1.0,
  "title": "Four new driving rules set to affect over 70s including new eye test rule",
  "description": "Labour is looking into a major overhaul of UK motoring rules with new eye checks, drink-driving limits and tough seatbelt penalties among the updates.",
  "content": "Four new driving rules are set to come into force across the UK as part of a major Labour crackdown in motoring. The headline announcement for over 70s is the introduction of new eyesight testing rules to monitor the safety of elderly road users. However, three new announcements affecting everything from alcohol drink-drive limits to seatbelt rules and insured drivers were also listed. These will affect all road users regardless of their age, but over 70s are set to also feel the impact of the updates. Express.co.uk looks at what is set to change in one of the biggest motoring overhauls in years.\n\nThis is the big one for elderly drivers with new mandatory eyesight rules looking set to be introduced. The UK is only one of three European countries to rely on motorists self-reporting any issues when renewing their driving licence. Although details have not been fleshed out, the rule means older individuals may be required to sit through an eye test every three years. Optometrists who notice any visual impairments should then notify the DVLA, with motorists likely to have a new licence blocked.\n\nOfficials are understood to be considering a drastic reduction to the drink-drive limits in England and Wales, bringing the policy into line with Scotland and the rest of Europe. The current cut-off sits at 35 micrograms of alcohol per 100ml of breath but this could be slashed to just 22 micrograms. New roadside saliva tests could also be rolled out as evidence, helping police prosecute drivers by the side of the road instead of having to wait for a blood test.\n\nMotorists caught not wearing a seatbelt are already set to face a £100 bill with penalties rising to £500 in extreme cases. But under the current rules, motorists are not issued any penalty points on their driving licence for the simple offence. This looks likely to change with plans to issue points as well as financial penalties to road users in a hefty blow.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/life-style/cars/2093612/older-drivers-70-fail-test-eyesight-tests-licence",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/latest/eye-health",
    "https://www.express.co.uk/life-style/cars/2093670/should-drivers-70-banned-driving-eyesight-poll",
    "https://www.express.co.uk/news/uk/2093620/drink-driving-limit-uk-slashed-road-safety-crackdown",
    "https://www.express.co.uk/life-style/cars/2089894/older-driver-car-crash-rules",
    "https://www.express.co.uk/latest/driving-laws",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/life-style/cars/2093698/drivers-penalty-points-seat-belt-change",
    "https://www.express.co.uk/finance/personalfinance/2092897/DVLA-warning-to-all-older-drivers-who-risk-losing-licence-over-70",
    "https://www.express.co.uk/latest/alcohol",
    "https://www.express.co.uk/life-style/cars/2043589/dvla-older-driver-eyesight-rules"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "new eye test rule",
      "weight": 0.12251056
    },
    {
      "name": "new eyesight testing rules",
      "weight": 0.11624789
    },
    {
      "name": "new mandatory eyesight rules",
      "weight": 0.11607232
    },
    {
      "name": "seatbelt rules",
      "weight": 0.104105435
    },
    {
      "name": "New roadside saliva tests",
      "weight": 0.09649101
    },
    {
      "name": "elderly road users",
      "weight": 0.088627115
    },
    {
      "name": "road users",
      "weight": 0.08551655
    },
    {
      "name": "Four new driving rules",
      "weight": 0.07396353
    },
    {
      "name": "elderly drivers",
      "weight": 0.07290204
    },
    {
      "name": "financial penalties",
      "weight": 0.072569795
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Autos & Vehicles/Vehicle Codes & Driving Laws/Other",
      "score": 0.83203125
    }
  ],
  "sentiment": {
    "positive": 0.04548755,
    "negative": 0.6545465,
    "neutral": 0.299966
  },
  "summary": "Four new driving rules are set to come into force across the UK as part of a major Labour crackdown on motoring. The main announcement is the introduction of new eyesight testing rules to monitor the safety of elderly road users. Other announcements include changes to alcohol drink-drive limits, seatbelt rules and insured drivers. These changes will affect all road users regardless of their age. The UK is only one of three European countries to rely on motorists self-reporting issues when renewing their driving licence. Officials are also considering a drastic reduction to the drink-driving limits in England and Wales, bringing them into line with Scotland and the rest of Europe.",
  "shortSummary": "Four new UK driving rules, including new eyesight testing rules and penalties for drivers over 70, will affect all road users, including over 70s, as part of a major Labour crackdown.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3c0ff39be6ca4d439b259beff8f14d87",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "The Chancellor has sunk the UK economy, but the stock market stands firm. That could change.\nBrooklyn Beckham and Nicola Peltz's vow renewal took an unexpected turn as family...\nMinister asked about reports more than 50,000 migrants have crossed the Channel in...\nThe latest person taking part in this year's Strictly Come Dancing was revealed on...\nEuropean leaders, including Sir Keir Starmer, will speak to Donald Trump ahead of his...\nExpress Sport provides all the latest transfer news LIVE.\nThe closure has been expected as queues build on the M25.\nThe Russian Embassy in London has hit out at the UK ahead of Putin-Trump peace talks.\nAn Emmy Award winner who worked on Prison Break, 24 and Homeland has sadly died\nAfternoons are peak activity time and this year's colonies are bigger and more...\nEXCLUSIVE: More than 50,000 people have entered the country via small boat crossings...\nAs Donald Trump prepares for a pivotal meeting with Vladimir Putin, his unexpected...\nDaily Express\nEducation minister Baroness Jacqui Smith spoke to BBC Breakfast after new figures...\nGoogle is set to launch its new phones very soon, but Amazon has a big discount on the...\nThe news comes as Russian President Vladimir Putin warned of nuclear war when he...\nJamie Stevens, 51, carried on living in the flat as the body of Anouska Sites, 45,...\nAmazon is dishing out the Galaxy Tab S10 FE+ at a handsomely discounted rate.\nThe chairs come in a twin pack and a choice of colours.\nLabour is looking into a major overhaul of UK motoring rules with new eye checks,...\nWidespread misconceptions have led many people to believe certain foods and chemicals...\nEXCLUSIVE: Anna Williamson is a professional life coach, author, and podcaster known...\nHere's what the major banks have done since the Bank of England reduced the base rate\nA couple has shared their fool-proof way of how to hang a painting or frame onto a...\nA royal book claims Meghan Markle deliberately undermined a royal aide in a \"very...\nThe BBC historical films are a series of adaptations of some of Shakespeare's most gripping history plays\nThe border has become a symbol of anti-immigrant division in Europe after lying...\nThe pretty town is loved by locals and popular with holiday makers for several reasons...\nThe world's best tennis players are in action at the Cincinnati Open ahead of the last...\nEXCLUSIVE: Meghan Markle could soon make her As Ever products available in the UK.\nPolice have issued CCTV images of two women they want to speak to after a man in his...\nThe Duke of Sussex could return to his home country next month.\nThree people, including a child, have died after a shooting in the parking lot of a...\nOne of the first web pioneers is finally about to hang up the phone.\nEXCLUSIVE: A royal expert has revealed how the Royal Family will be feeling after...\nPeter Phillips' royal wedding is on the cards as he recently announced his engagement...\nIt had been reported that Prince Harry and Meghan Markle's Netflix deal was coming to...\nRussia risks losing 130 small towns amid collapsing industries, poor infrastructure...\nI recently had air conditioning fitted in my home by BOXT - it's completely changed my...\nThe 2025 Strictly cast announcements have officially begun\nFox News paused their broadcast as they went live from the White House\nTennis stars are in action at the Cincinnati Open this weekend.\nAn extractor fan is key in any kitchen, but it will only work effectively when it's...\n49 stores will be closing across the UK over the coming weeks.\nActress Alex Kingston, who is best known for playing River Song in Doctor Who, is set...\nGardening is an excellent activity providing fresh produce, beautiful flowers, and a...\nThe Queen legend's former girlfriend has spoken out on the bombshell claims he...\nThe former aide had a very direct message to give to Prince Harry.\nThe Karcher LTR 18-30 grass trimmer is a quick and easy way to remove long grass and...\n\"I don't know that he would have made it another 24 hours without us recovering him,\" a rescuer said.\nTo speed up the ripening process of avocados, a food enthusiast has shared the...\nA US company is making progress on its first UK-based £200 million attraction housing...\nGardeners are being urged to help hedgehogs this week.\nThis \"brilliant\" murder mystery, which left viewers on the edge of their seats, will...\nIt had been reported that Prince Harry and Meghan Markle's Netflix deal was over.\nThe supermarket's Labour-backing chairman previously said should stop \"wallowing\" and...\nDonald Trump held a major press conference on Monday, focused on homelessness in...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "The UK is set to implement four new driving rules as part of a Labour initiative aimed at improving road safety, particularly for elderly drivers. Key changes include mandatory eyesight tests for those over 70, a potential reduction in drink-drive limits, and increased penalties for not wearing seatbelts, including points on driving licenses. These updates mark one of the most significant overhauls of motoring regulations in years.",
  "argos_id": "1SSKZFA99"
}