{
  "url": "https://nypost.com/2025/08/12/business/overseas-travel-to-us-continues-to-tumble-as-trump-imposes-travel-bans-tariffs/",
  "authorsByline": "Lisa Fickenscher",
  "articleId": "a5689e66e0624a568e4b04801a4d5080",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-63z35vl3z-1755016896010.jpg?quality=75&strip=all&1755002507&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:11:23+00:00",
  "addDate": "2025-08-12T18:14:41.479697+00:00",
  "refreshDate": "2025-08-12T18:14:41.479698+00:00",
  "score": 1.0,
  "title": "Overseas travel to US continues to tumble as Trump imposes travel bans, tariffs",
  "description": "The most recent drop was fueled by a steep pullback from Germany, China and Switzerland, which were down 14.7%, 13.8% and 12.7% respectively, according to the National Travel and Tourism Office",
  "content": "Travel to the US tumbled 3.1% in July — the latest in a slew of monthly declines as the Trump administration imposes strict curbs on travel and pursues tough negotiations on trade.\n\nThe most recent drop was fueled by a steep pullback from Germany, China and Switzerland, which were down 14.7%, 13.8% and 12.7% respectively, according to the National Travel and Tourism Office, a government agency that works with the Department of Homeland Security and US Customs and Border Protection.\n\nThe latest data does not include travel from Canada and Mexico, the two largest feeder markets to the US, but lately both have seen steep drops.\n\nCanadians in particular have been canceling trips to the US, offended by President Trump’s suggestion that they be annexed to the US as the 51st state.\n\nIn June, flights from Canada were down 22% and car crossings were down 33%, according to a report by travel trade publication Skift.\n\nApril represents the only exception to the downward trend, possibly because Easter fell in April instead of March. Overseas visitors increased 0.4% in April, but have been down since then.\n\nAmong the top 20 countries, six increased their travel to the US in July, including Japan by 9.1%, Dominican Republic, by 7.3%, Spain by 6.7% Italy, by 6.3%, Israel by 6.1% and Ireland up by 2.9%, according to NTTO.\n\nSpending on promoting the US as a destination was decimated after the the “Big Beautiful Bill” was passed in April.\n\nBrand USA, a public-private partnership that promotes travel here, saw its federal funds cut by 80% this year.\n\nInternational travelers are especially coveted because they spend more and stay longer.\n\nEvery 40 international visit supports one US job, according to NTTO.\n\nLast week, the largest hotel company in the world, Marriott International, cut its full year forecast for revenue and profits on slowing travel demand for its properties in the US.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/05/business/marriott-trims-full-year-forecast-for-revenue-profit-as-travel-demand-to-us-falters/",
    "https://nypost.com/2025/08/09/business/gasparino-inside-the-enormous-biden-effort-to-debank-trump-after-jan-6/",
    "https://nypost.com/2025/08/11/business/coding-students-whose-jobs-were-taken-by-ai-forced-to-work-at-chipotle/",
    "https://nypost.com/2025/04/18/business/nyc-tourism-poised-to-tank-as-tariffs-stock-market-rattle-travelers/",
    "https://nypost.com/2025/02/22/us-news/canadians-cancelling-us-travel-en-masse-in-face-of-tariff-threats/",
    "https://nypost.com/2025/08/12/business/spirit-airlines-says-it-could-soon-go-out-of-business-after-declaring-bankruptcy/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Customs",
      "weight": 0.11065652
    },
    {
      "name": "US",
      "weight": 0.110417575
    },
    {
      "name": "Overseas travel",
      "weight": 0.10316517
    },
    {
      "name": "Travel",
      "weight": 0.10195795
    },
    {
      "name": "travel",
      "weight": 0.10195795
    },
    {
      "name": "travel bans",
      "weight": 0.10142331
    },
    {
      "name": "slowing travel demand",
      "weight": 0.10068344
    },
    {
      "name": "travel trade publication Skift",
      "weight": 0.097390376
    },
    {
      "name": "Trump",
      "weight": 0.062347542
    },
    {
      "name": "April",
      "weight": 0.061389577
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.89599609375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.88134765625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.7255859375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.6240234375
    },
    {
      "name": "/Travel & Transportation/Other",
      "score": 0.62158203125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.374267578125
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.313720703125
    }
  ],
  "sentiment": {
    "positive": 0.015939701,
    "negative": 0.9264064,
    "neutral": 0.057653878
  },
  "summary": "Travel to the US fell by 3.1% in July, the latest monthly decline due to the Trump administration's strict curbs on travel and tough negotiations on trade. The most recent drop was driven by a decrease in travel from Germany, China, and Switzerland, with Germany, Switzerland seeing a decline of 14.7%, 13.8% and 12.7% respectively. This does not include Canada and Mexico, the two largest US feeder markets, which have seen significant decreases in travel. The National Travel and Tourism Office reported that Canada, the country's largest market, has seen a decline in travel since June, with flights from Canada dropping 22% and car crossings dropping 33%. The decline is blamed on President Trump's proposal to annexe the 51st state of Canada.",
  "shortSummary": "As the Trump administration imposes travel curbs and trade tariffs, US travel to the US has declined 3.1% in July, with significant declines affecting Germany, China, and Switzerland.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "148f5e08151f4fd99f3ba9e20823a2d5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/09/business/gasparino-inside-the-enormous-biden-effort-to-debank-trump-after-jan-6/",
      "text": "Inside the enormous Biden effort to ‘debank’ Trump after Jan. 6\nThe scale of the effort to “debank” Donald Trump because of pressure from Biden administration regulators went far beyond JPMorgan and Bank of America, The Post has learned.\nAt least 10 other financial institutions closed their windows to the billionaire real estate tycoon over his role in the Jan. 6 Capitol Hill melee.\nThe moves came in the months after Trump left the White House in 2021, sources inside the Trump Organization told me.\nThe stunning scale of the blacklisting is being revealed here for the first time.\nIt should be reported as much as possible for the simple reason that if any big bank can cancel a former president over politics as opposed to illegality, then every American citizen is in danger of facing the same mistreatment.\nFor expressing an opinion, or starting a business out of step with the progressive culture norms that have infected so much of society, you too can see your economic livelihood go up in smoke and “debanked.”\nDebanking is such an odd word for one of the most insidious parts of cancel culture, and its sponsors like it that way.\nIt sanitizes, via clumsy, obtuse lingo, what is essentially something of dangerous Orwellian magnitude: negating an American citizen’s ability to save, and conduct business through a big bank.\nThat’s why Trump and Republicans like South Carolina Sen. Tim Scott are taking steps to end the politicization of banking.\nKeep in mind, there are already laws preventing the likes of JPMorgan, BofA and Capital One — the banks Trump has publicly stated canceled him — from being conduits for drug kingpins and Mafiosi.\n(Trump has sued Capital One, which denied Trump’s allegations.)\nDebanking takes it further. It forces banks to remove customers who might pose nothing more than “reputational risk,” a flighty rule enforced by bank regulators in recent years to keep financial institutions from doing business with people like Jeffrey Epstein.\nThe now-deceased convicted child sex predator was a JPMorgan customer for years, and in theory making it impossible for Epstein to finance his illegality sounds like what should be happening.\nThat is until you dig deeper.\nUnder pressure from the Biden administration, just after Trump lost the 2020 election and started to act out (which the last time I checked was his constitutional right), the enforcement of reputational risk took a decidedly political turn, bank officials tell me.\nIf you believe people at the two largest banks, Jamie Dimon’s JPMorgan and Brian Moynihan’s BofA, the Biden administration unleashed its bank regulatory cops at the Office of Comptroller of Currency, the FDIC and the semi-independent Federal Reserve to go beyond nixing perverted financiers from their platform.\nThey used the amorphous nature of what is reputational risk to enforce a political regime, the bank officials said.\nThe Bidenistas hated crypto, thought it was an affront to their power to control the economy, and pressured banks from doing business with this somewhat heterodox emerging industry, according to the bank sources.\nSo was anything related to guns and certain conservative religious organizations, they added.\nAnd most of all, anything MAGA, including the multibillion-dollar real estate and resort empire of Mr. MAGA himself, Donald J. Trump.\nSuch an effort isn’t easy to prove because there’s no direct smoking gun, no memo (at least not yet) telling banks to cancel Trump from their system.\nThe banks say the pressure was more subtle but still real: Failure to remove Trump or crypto types and others would result in heightened enforcement, harassment and possibly fines.\nThe banks decided to drop customers, even rich ones like Trump, because it wasn’t worth the hassle.\nI have covered finance for three decades now and thought I saw it all: Bernie Madoff, Epstein, the 2008 financial crisis, Wall Street scandals, penny stock scams and hedge fund implosions.\nBut what happened to Trump in 2021 was truly surprising given the breadth of big banks dropping him as a client and scary given their rationale.\nAs bad as the events of Jan. 6 were, Trump did tell the crowd that crazy afternoon to protest peacefully.\nTrump didn’t break the law holding a rally.\nYou may disagree with his rhetoric that day.\nHe had just lost a closely fought election against Joe Biden.\nTrump said he really won it.\nMillions of people seemed to agree.\nHe wouldn’t be the first politician to pull that lever. Democrat Stacey Abrams never really fully conceded when she lost in her first attempt to become governor of Georgia against Republican Brian Kemp.\nHow many times did Hillary Clinton say Trump was an “illegitimate president” after she lost the 2016 contest to him?\nDuring the violent social justice protests of 2020, Gwen Walz, the wife of Minnesota Gov. and 2024 Democrat VP candidate Tim Walz, said she “kept the windows” open to smell the burning debris.\n“I felt like that was such a touchstone of what was happening,” she said.\nOr how about what Kamala Harris proudly said around the same time.\nThe then-Biden VP candidate, who went on to get trounced by Trump in 2024, supported the defunding of the police movement that led to much more mayhem than what occurred on Jan. 6.\nHer rationale for the “largely peaceful protests” that burned cities to the ground, delivered to fellow-traveler lefty late-night host Stephen Colbert, is at least as cringey as anything Trump said on Jan. 6.\n“They’re not going to stop,” she said during an appearance on the show.\n“They’re not. This is a movement. I’m telling you. They’re not going to stop, and everyone, beware . . . That they’re not going to let up. And they should not, and we should not.”\nDid Jamie Dimon tell Harris that her money isn’t good at JPM?"
    },
    {
      "url": "https://nypost.com/2025/08/11/business/coding-students-whose-jobs-were-taken-by-ai-forced-to-work-at-chipotle/",
      "text": "Coding students whose jobs were taken by AI forced to find work at Chipotle\nWhen Manasi Mishra began studying computer science, she envisioned a future writing code for major tech companies, not rolling burritos.\nBut the recent Purdue University graduate has been unable to land a job in her chosen field as tech companies increasingly turn to artificial intelligence to perform entry-level tasks.\n“I just graduated with a computer science degree, and the only company that has called me for an interview is Chipotle,” the frustrated Mishra said in a TikTok video earlier this summer, which has been viewed nearly 150,000 times.\nMishra’s experience underscores a jarring shift in the job market for new coders.\nAccording to the Federal Reserve Bank of New York, the unemployment rate for recent computer science graduates is 6.1%, and 7.5% for computer engineering majors — both above the 5.3% average for all recent graduates and roughly double the 3% rate for majors like biology and art history.\n“I’m very concerned,” Jeff Forbes, a former program director for computer science education and workforce development at the National Science Foundation, told the New York Times.\n“Computer science students who graduated three or four years ago would have been fighting off offers from top firms — and now that same student would be struggling to get a job from anyone.”\nFor more than a decade, tech leaders, billionaires and even US presidents encouraged young people to “learn to code,” promising that programming skills would all but guarantee a six-figure starting salary and job security.\nWhile there have been a handful of winners in the AI economy, with some commanding enormous paychecks as valuations of AI firms skyrocket. the majority of those companies employ relatively few people.\nDario Amodei, chief executive of AI developer Anthropic, has warned that AI could wipe out half of all entry-level white-collar jobs within the next one to five years.\nThe arrival of AI coding assistants such as GitHub Copilot, CodeRabbit and others has accelerated the decline for entry-level programming roles, which are among the easiest for companies to automate.\nEconomists and industry executives say the hiring slowdown is also tied to post-pandemic overstaffing, aggressive cost-cutting, high interest rates and widespread hiring freezes.\nWhile experts debate how much of the current downturn is directly caused by AI versus the business cycle, there’s little disagreement that junior coding positions are under intense pressure.\nThe result is a labor market that looks very different from a few years ago.\nZach Taylor, a 2023 graduate of Oregon State University, told the Times he’s applied for nearly 5,800 tech jobs, leading to just 13 interviews and zero offers.\nEven the company where he interned couldn’t take him on full-time.\nAfter trying to land a role at McDonald’s and being rejected “for lack of experience,” he moved back home to Sherwood, Ore., and began collecting unemployment.\n“It is difficult to find the motivation to keep applying,” he told the Times.\nFor many job seekers, the application process has become a gauntlet: online coding assessments, live technical tests and multiple interviews, only to be turned down or ignored.\nSome describe the experience as “bleak” or “soul-crushing.” Others say they feel “gaslit” by an industry that once told them software skills were a golden ticket.\nIn San Francisco, billboards advertise AI coding tools that promise to write or debug code faster than humans.\nCodeRabbit, while not as widely used as Copilot, is praised for features like real-time collaboration and context-aware code reviews. These tools, coupled with a glut of applicants, mean companies can produce more software with fewer junior engineers.\nAudrey Roller, who recently graduated with a degree in data science from Worcester, Mass.-based Clark University, told the Times she writes her own applications without AI tools in hopes of standing out from the automated crowd.\nBut when one company sent a rejection email just three minutes after she applied, she suspected an algorithm had made the decision.\n“Some companies are using AI to screen candidates and removing the human aspect,” she told the Times.\nThe downturn has also gutted a parallel pipeline into tech: coding bootcamps.\nFor over a decade, these intensive programs offered a route into high-paying engineering jobs for people without traditional computer science degrees.\nNow, many are seeing their job placement rates collapse, Reuters reported.\nJonathan Kim, who paid nearly $20,000 for a part-time program at Codesmith in 2023, has applied to more than 600 software engineering roles with no offers.\nHe now works at his uncle’s ice cream shop in Los Angeles while continuing to code on open-source projects.\n“They sold a fake dream of a great job market,” he told Reuters.\nAt Codesmith, just 37% of students in the 2023 part-time cohort landed full-time tech jobs within six months, down from 83% in late 2021, according to the Council on Integrity in Results Reporting.\nPlacement rates at other bootcamps have similarly fallen into the 37–50% range for some cohorts.\nThe company told Reuters that the market is “tough” but notes that 70% of its full-time graduates found jobs within a year.\nIndustry veterans say this environment is pushing tech companies back toward a traditional hiring model that favors graduates of elite universities such as MIT and Stanford, reversing some of the diversity gains bootcamps once supported.\n“They’re sending their recruiters to MIT and Stanford and wining and dining the top students,” Michael Novati, co-founder of Formation Dev, which trains experienced engineers for interviews, told Reuters.\nWith Post wires"
    },
    {
      "url": "https://nypost.com/2025/08/12/business/spirit-airlines-says-it-could-soon-go-out-of-business-after-declaring-bankruptcy/",
      "text": "Spirit Airlines could soon go out of business — months after declaring bankruptcy\nSpirit Airlines is warning that it may not survive the next year unless it can quickly raise more cash — just five months after emerging from bankruptcy protection.\nThe budget airline said in a report Monday that fewer people are booking leisure trips within the US and tough competition from other carriers is making it hard to hit the money targets it promised after bankruptcy.\nThe company cautioned that failure to secure additional funds could trigger loan defaults and force it to sell assets, including planes, airport gates and real estate.\nThe airline’s management said it faces “substantial doubt” about its ability to keep operating beyond the next 12 months without fresh capital, citing uncertainty over the success of cost-cutting efforts and ongoing talks with stakeholders.\nSpirit also disclosed it may have to provide more collateral to its credit card processing partner to keep that relationship in place.\nSpirit’s warning marks the latest setback in a turbulent period for the Florida-based airline, known for its bright yellow planes and low-cost fares.\nIt filed for Chapter 11 bankruptcy in November, becoming the first major US carrier to do so since 2011.\nThe filing followed years of mounting losses, a failed takeover bid by JetBlue Airways, shifting passenger preferences toward more premium services and a large-scale engine recall that left many of its jets grounded.\nCOVID-19’s lingering effects, supply chain disruptions and heavy debt loads added to the strain.\nAfter rejecting a merger offer from Frontier Airlines in February, Spirit completed its Chapter 11 restructuring in March.\nThe plan wiped out roughly $795 million in debt, brought in $350 million in new equity and set up a $275 million credit line.\nThen-CEO Ted Christie remained in place to lead a new strategy aimed at appealing to higher-spending travelers, revamping the frequent flyer program and boosting partnerships to increase revenue per passenger.\nBut the recovery has been rocky.\nChristie, who was due to receive a $3.8 million retention bonus, stepped down as CEO in late April. He was replaced by Dave Davis, former president and chief financial officer of Sun Country Airlines.\nChristie left the airline having received more than $4 million in bonuses as part of his 2024 compensation — plus a $1.5 million separation payment after leaving the company.\nIn June, Spirit reported a $143 million net loss for the first quarter of 2025, along with a warning that it still faced “going concern” risks.\nBy late July, the airline announced plans to furlough 270 pilots and reassign 140 others in a bid to conserve cash, even as it promoted new routes to Key West and the Cayman Islands starting later this year.\nThe company hoped that adding destinations could help drive bookings, but industry headwinds continued to mount.\nIn its latest earnings report, Spirit posted a second-quarter net loss of $245.8 million, widening from $192.9 million in the same period last year.\nThe company said elevated capacity in the domestic market — meaning more seats for sale than demand could absorb — has kept ticket prices under pressure.\nHigher operating costs, combined with tariffs imposed earlier this year, have further eroded margins. These challenges have hit low-cost carriers like Spirit especially hard because they rely heavily on price-sensitive leisure travelers.\nThe airline’s troubles also reflect broader difficulties in the aviation industry. While some competitors have been able to offset weaker domestic demand with strong international traffic, Spirit’s business is still centered on short-haul leisure routes, leaving it more exposed when vacation travel slows.\nManagement said that without significant improvement in its finances or a major infusion of cash, it may not be able to comply with the minimum liquidity requirements in its credit agreements.\nSpirit’s latest moves to shore up its finances include exploring the sale of non-core assets such as surplus planes, airport gates and slots.\nHowever, the company acknowledged in its filing that there is no guarantee these efforts will succeed or be completed quickly enough to prevent further strain."
    },
    {
      "url": "https://nypost.com/2025/08/05/business/marriott-trims-full-year-forecast-for-revenue-profit-as-travel-demand-to-us-falters/",
      "text": "Marriott trims full-year forecast for revenue, profit as travel demand to US falters\nMarriott International – the largest hotel company in the world – cut its full-year forecast for revenue growth and profit as travel demand in the US slows, the company said on Tuesday.\nTotal room revenue in the US and Canada was flat for the second quarter, up just 1%, compared to a year ago, the Bethesda, Md.-based reported.\nThe slowdown is mostly hitting its lower-cost hotels that include Marriott Courtyard, Fairfield Inn and SpringHill Suites, which were also hard hit by a 17% decline in bookings from government workers, the company said.\n“The low end of the travel segment is underperforming across the board right now,” Morningstar analyst Dan Wasiolek said. “There is still elevated inflation in areas of the economy that is impacting budget-conscious customers.”\nMarriott said it now expects 2025 revenue growth of 1.5% to 2.5%, below its previous guidance of 1.5% to 3.5% growth. It also lowered its profit guidance to $9.82 to $10.08 per share down, from $9.85 to $10.08.\nThe company blamed “heightened macro-economic uncertainty” due to trade policy changes.\nMarriott’s luxury hotel brands, including the Ritz-Carlton, St. Regis and JW Marriott, saw a 4.1% increase in room revenue in the US and Canada in second the quarter.\nThe average room rate for luxury properties was $417 compared with $161 for its budget properties, according to Wasiolek.\nMarriott’s total revenue rose 5% to $6.74 billion, fueled by its upscale properties and overseas business.\nThe company did not address international tourism to the US but there have been widespread reports of a pullback in visitors from Canada, Mexico and other countries due to blowback over President Trump’s tariffs.\nMarriott CEO credited the signing of Trump’s Big Beautifull Bill into law last month, for helping to curtail uncertainty that had depressed business.\n“In some ways, the best thing about [the bill] is that it’s done. The level of uncertainty, both among consumers and among our owners and franchisees, improves meaningfully with the signature on that bill,” Capuano said on an earnings call."
    },
    {
      "url": "https://nypost.com/2025/02/22/us-news/canadians-cancelling-us-travel-en-masse-in-face-of-tariff-threats/",
      "text": "‘Mad as hell’ Canadians cancel US travel en masse as trade war escalates\nCanadians are cancelling their American vacations en masse — as the next front in the US-Canada trade war is being fought at airports, gas stations and gift shops, The Post Has learned.\nBoth air and land travel have been impacted, as the US northern neighbors protest the impact of tariffs on their country’s economy — an offensive that could cost the American economy $2.1 billion and 14,000 jobs, the US Travel Association has estimated.\nCarlo Tarini from Montreal traded his family’s April vacation to New York City for the Bahamas instead.\n“We’re mad as hell and we’re not going to take it anymore,” Tarini told The Post, adding that the US is wiped off the map for the next four years as far as his family’s travels are concerned.\nFor Tarini, what did it was US President Donald Trump’s threat to impose 25% tariffs on Canadian imports, and the impact it’s already had on the country’s economy – the Canadian dollar tumbled to a two-decade low after the announcement, before going back up only slightly at the news of a 30-day reprieve.\n“He’s threatening our economy,” said Tarini. “It’s a family decision and we’re sticking with it.”\nQuebec’s Minister of Education has even urged 10th graders — who plan annual sojourns from Montreal to the Big Apple — to rethink their plans.\n“We are all on the front lines,” Bernard Drainville said earlier this month at Quebec’s National Assembly.\nSchools in Quebec – and also in Manitoba – have since traded in trips to the Empire State for the city of Toronto.\nIn a letter to parents, Nancy Paquet, general secretary of the Monts-et-Marées school service center, cited “decisions by the US government which could have a significant impact on the parents’ employment,” as the reason, referring to jobs that would be lost if the tariffs get the go-ahead.\nFor others, it’s the sheer insult of the jokes around Canada being the 51st American state.\n“With each passing day of more annexation threats, our family decided we have to cancel our March break Florida trip,” wrote a self-described “angry Canuck” and mother of four in a Reddit group where Canadians trade tales of US boycott.\nThe travel rebellion is already having an impact.\nCanadian airlines are considering cutting down on their flights to the US this spring in the face of a decreasing demand of around 25%, according to WestJet.\nAnd the number of Canadians returning from the US by car has fallen by about 15,000 in January, the first drop since the pandemic, according to Statistics Canada.\nFlorida is one state that’s sure to feel the pain – it’s a darling of Canadian travelers, with many retirees – “snowbirds” as they’re known, spending the winters in the Sunshine State. The Fort Lauderdale area especially is flush with Canadians, with many returning to the same spots winter after winter. This year the area had been expecting between 1.3 and 1.5 million Canadian visitors, spending $950-975 million dollars.\n“Canadian snowbirds are just part of the fabric of this community all winter long, and have been for decades – at least 50 years,” Stacy Ritter, CEO of Visit Lauderdale, told The Post.\nRitter said she’s already been fielding emails from regulars who explained why they’re not coming back.\nIt felt like a “gut punch” lamented Ritter. “It makes me want to cry.”\nNorth of the 49th parallel, the owner of Maple Leaf Tours, who sells packaged group travel, told The Post an “alarming” number of vacationers cancelled US tours this year.\n“It’s taken a turn for the worse across the industry,” said Kristine Geary.\nShe estimates US cancellations at 40%, and her losses in the hundreds of thousands of dollars.\n“I’ve never seen this,” said Geary, whose family has owned the business for more than 30 years.\nAmericans, meanwhile, haven’t been boycotting Canadian travel.\nIn January, the number of US travelers to Canada by car was 707,000, up more than 23% from the same month last year, according to Statistics Canada data.\nThat same Reddit group sees the occasional American asking if it’s still okay for them to visit Canada.\n“I’m all for Americans coming up and supporting us!” writes one Canuck.\n“Just don’t make any jokes towards us becoming a 51st state. I’ll lose my s–t.”\nRep. Nick LaLota (R-NY) offered somewhat of an olive branch to the Great White North.\n“We’ll happily welcome our little brother back—whether it’s as our 51st state or a trading partner at a table that’s more balanced,” he said."
    },
    {
      "url": "https://nypost.com/2025/04/18/business/nyc-tourism-poised-to-tank-as-tariffs-stock-market-rattle-travelers/",
      "text": "Big Apple tourism is at risk of tanking as travelers get rattled by swooning stock markets and rising geopolitical tensions, according to industry experts and data reviewed by The Post.\nHospitality executives say it’s too early to call, but they’re increasingly on edge because of recent declines in hotel bookings, as well as drops in foot traffic and ticket sales to key attractions.\nJust 22.5% of the city’s hotel rooms were booked for July as of April 7, according to industry data tracker CoStar. That’s down a whopping 11.5% from the same time a year ago, when 25.4% of rooms had been booked.\nTravelers still may end up booking rooms closer to the date if consumer moods improve, according to Jan Frietag, CoStar’s national director of hospitality. Still, he said the data show how skittish travelers have lately become.\n“We are not quite ready to call it a prolonged downturn,” Freitag told The Post. But New York City “probably hasn’t seen this kind of deceleration since 2020.”\nThe sluggish trend extends all the way to the holidays, with New York City hotel bookings for October, November and December down 20.6%, 19% and 19%, respectively, according to the data.\nThe Big Apple’s tourism bureau – NYC Tourism + Conventions – still expects the city to finally shake off its COVID hangover and exceed the 66.6 million visitors it lured in 2019. The city currently estimates that 12.9 million overseas travelers came to the Big Apple in 2024 versus the 13.5 million that came in 2019.\n“We are committed to adapting to the ever-evolving landscape while continuing to market NYC worldwide,” said Julie Coker, President and CEO of NYC Tourism + Conventions.\nNevertheless, trade wars and hassles at US borders for overseas travelers are starting to take a toll, according to industry players.\nThe Statue of Liberty and Ellis Island have seen ticket sales drop 5% through April, said Mike Burke, Chief Operating Officer of Statue City Cruises, which is owned by Hornblower.\n“All of our competitors and other attractions are down as well,” Burke said, adding that peers in the tourism industry regularly compare notes. “We share the trends and they are all headed the same way.”\nFoot traffic in Times Square rose by just 1.8% this year through April 16 versus a year ago. That’s well short of the 7.3% jump it saw last year during the same time period, according to the Times Square Alliance.\nAt the Park Lane New York, which has stunning views of Central Park South, front office executives are worried about attracting visitors from the United Kingdom, Germany, Mexico and Brazil this summer, said managing director Niles Harris.\n“We are starting to see a pullback from those countries,” Harris told The Post. “It’s enough to get our attention.”\nThe Park Lane also is getting more queries over the phone from guests who are looking for deals and promotions.\n“People are more value conscious than they were a year ago,” Harris said. “They want a better deal.”\nLast year, New York metro area airports had their “busiest year ever” in 2024, according to the Port Authority of New York and New Jersey. New York City’s hotel occupancy rate of 84.3% in 2024 was the highest of the top 25 markets in the country, according to CoStar data.\nBut business lately has ducked in and out of positive territory. This month, occupancy was 83.8% as of April 12, up 0.3% versus last year. In March, it dropped 1.1% after rising 2.3% and 1.3% in January and February, respectively.\n“We are seeing the booking pace slow from Europe, Canada and Asia,” said one hotelier who did not want to be identified, adding that “NYC is a global city. The international segment is a very important business.”\nNew York City is hardly alone.\nThe number of non-citizen arrivals by plane to the US dropped by nearly 10% in March, according to data from the International Trade Administration.\nCanadian flight reservations to the US alone are down a whopping 70% through September compared to the same period last year, according to an OAG Aviation Worldwide report.\n“US tariff announcements and a more aggressive stance toward historical allies have hurt global opinions about the US,” Goldman Sachs economists Joseph Briggs and Megan Peters said in a March 31 report."
    }
  ],
  "argos_summary": "Travel to the US declined by 3.1% in July, largely due to significant drops from Germany, China, and Switzerland, as well as a notable decrease in Canadian travelers reacting to US trade policies. The downturn in international travel is compounded by a broader slowdown in the tech job market, where recent graduates struggle to find positions due to AI automation and hiring freezes. Additionally, Spirit Airlines faces potential bankruptcy again, citing reduced leisure travel and competition, while Marriott has lowered its revenue forecasts amid similar trends in hotel bookings.",
  "argos_id": "1VZEWOD9C"
}