{
  "url": "https://www.newsweek.com/sports/nfl/former-dolphins-giants-superstar-addresses-retirement-rumors-2112612",
  "authorsByline": "Aaliyan Mohammed",
  "articleId": "5a11d950497348028d94ad6a21742217",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2701352/miami-dolphins-wide-receiver-odell-beckham-jr.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:35:31-04:00",
  "addDate": "2025-08-13T00:38:08.543151+00:00",
  "refreshDate": "2025-08-13T00:38:08.543153+00:00",
  "score": 1.0,
  "title": "Former Dolphins, Giants Superstar Retires? Odell Beckham Jr. Clears Air",
  "description": "The Miami Dolphins signed Odell Beckham Jr. last season. The former superstar addressed retirement rumors on Tuesday, after a fake report went viral.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nThe Miami Dolphins signed Odell Beckham Jr. last offseason. The former New York Giants superstar did not have a huge impact and is currently a free agent.\n\nWhile Beckham is not on a team, he has not retired. However, on Tuesday, a fake report on social media went viral, suggesting Beckham had retired. Countless accounts started congratulating him on a great career, but the wide receiver quickly addressed the report and shut it down.\n\nBeckham implored everyone to \"stop reading everything on the internet\" while letting everyone know that he's not ready to retire yet.\n\n\"Not done yet,\" Beckham added in a follow-up post. \"Thanks for ... concerns and have a blessed day.\"\n\nBeckham is a three-time Pro Bowler, two-time Second-Team All-Pro, Super Bowl champion and 2014 Associated Press Rookie of the Year. Beckham also made what many regard as the best catch of all time.\n\nBeckham's best years came with the New York Giants, and he has not really had much of an impact since 2021. He was traded to the Los Angeles Rams that season and ended up being an important piece in their Super Bowl victory.\n\nHe had just 55 yards on nine catches last season with the Dolphins. He was once one of the best players in the entire NFL, but he has since declined. He is still available for a team to sign.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/sports/nfl/vikings-confirm-rondale-moore-will-miss-entire-2025-season-2112567",
    "https://x.com/obj/status/1955344809389928712",
    "https://twitter.com/obj/status/1955344809389928712?ref_src=twsrc%5Etfw",
    "https://www.newsweek.com/sports/nfl"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Odell Beckham Jr.",
      "weight": 0.11668989
    },
    {
      "name": "Beckham",
      "weight": 0.10704564
    },
    {
      "name": "New York Giants",
      "weight": 0.094780676
    },
    {
      "name": "Super Bowl champion",
      "weight": 0.08883662
    },
    {
      "name": "Super Bowl",
      "weight": 0.0843846
    },
    {
      "name": "last season",
      "weight": 0.07930809
    },
    {
      "name": "Giants",
      "weight": 0.07141285
    },
    {
      "name": "social media",
      "weight": 0.068380825
    },
    {
      "name": "Beckhams best years",
      "weight": 0.06826459
    },
    {
      "name": "The former New York Giants superstar",
      "weight": 0.066351265
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    },
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.96875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.966796875
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.78466796875
    }
  ],
  "sentiment": {
    "positive": 0.11789241,
    "negative": 0.51915073,
    "neutral": 0.3629569
  },
  "summary": "Ovell Beckham Jr. is a former New York Giants and Miami Dolphins player, but despite not having a significant impact on the team, he has not retired. A fake report on social media falsely suggested that he had retired, prompting numerous congratulatory posts. Despite this, Beckham quickly addressed the concerns and insisted that he is not ready to retire yet.",
  "shortSummary": "Ollie Beckham Jr. remains a free agent, despite a fake retirement report, having played a significant role in boosting his career.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5404113cf6b044ac9aaa4dea51638ed5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/sports/nfl/vikings-confirm-rondale-moore-will-miss-entire-2025-season-2112567",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nThough it was widely expected to happen, the Minnesota Vikings have confirmed that wide receiver Rondale Moore suffered a season-ending knee injury in preseason.\nMore news: Odell Beckham Jr Addresses Viral Rumor That He is Retiring\nThis is heartbreaking news for Moore, who had been having a great camp, according to reports. The receiver was engaged in preseason action against the Houston Texans on Saturday when he was tackled by Texans linebacker Jamal Hill.\nMoore had been pulled awkwardly over his left leg, leading to the injury. He was visibly upset as a cart came to take him to the locker room.\nMore news: Jon Gruden Wastes No Time Picking the Best Current NFL Quarterback\nVikings engaged in tests and an MRI to determine the extent of the injury, and head coach Kevin O'Connell confirmed that it was \"significant.\" Now, he is confirmed to be out for the entire season.\nWhat makes the injury even more heartbreaking for Moore is that he also suffered a season-ending injury to his right knee in 2024 as a member of the Atlanta Falcons. He would also not make it past training camp with the Falcons after suffering a dislocated knee.\nMoore has now suffered two season-ending knee injuries in the past two seasons, which begs the question of whether he can make it back to play at all. This is just speculation, but his missing two full seasons might produce a much larger conversation about his health.\nMoore also missed games in the 2021 and 2022 seasons due to various other injuries. The former second-round pick had a high ceiling, but he has not been able to stay healthy.\nIt was not revealed what injury Moore suffered during Saturday's preseason showdown with the Texans, but those details might be released soon. Considering it's a knee injury, he may have been hit with a meniscus tear or ACL.\nEither way, Moore will miss another season that could have been his resurgence with J.J. McCarthy taking over under center moving forward.\nWith Moore out and the Vikings dealing with a three-game suspension for Jordan Addison, the team could look to pick up some wide receivers via available free agents or when teams start to cut their rosters down to 53.\nMore NFL:\nRams' Matthew Stafford Not Spotted at Practice Amid Injury Concerns\nJets' Tyrod Taylor Will Miss Significant Time After Undergoing Surgery\nFor more on the Vikings and NFL, head to Newsweek Sports.\nAbout the writer\nJames Brizuela is a contributing sports and entertainment writer located in Los Angeles. His focus is on Comics, Comic Book ... Read more"
    }
  ],
  "argos_summary": "Odell Beckham Jr. addressed a viral false report claiming he had retired, confirming he is still a free agent and not done with his career. Meanwhile, Minnesota Vikings wide receiver Rondale Moore suffered a season-ending knee injury during preseason, marking his second consecutive season-ending injury after a similar incident in 2024. This raises concerns about his future in the league, as he has struggled with injuries since being drafted.",
  "argos_id": "1Z7MNX2KQ"
}