{
  "url": "https://www.nytimes.com/2025/08/12/us/politics/trump-dc-crime-data-fact-check.html",
  "authorsByline": "Linda Qiu",
  "articleId": "7f7900de8e31452bb32c89ee8a0b4fc4",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/12/multimedia/DC-FACTCHECK-qwfg/DC-FACTCHECK-qwfg-facebookJumbo.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:19:35.392000+00:00",
  "addDate": "2025-08-13T00:28:23.662889+00:00",
  "refreshDate": "2025-08-13T00:28:23.662891+00:00",
  "score": 1.0,
  "title": "Trump Misstates D.C. Crime Data to Justify Takeover",
  "description": "The president cited a number of false and misleading claims about homicides and youth crime in the nation’s capital.",
  "content": "The president cited a number of false and misleading claims about homicides and youth crime in the nation’s capital.\n\nPresident Trump cast the nation’s capital as overwhelmed by record-breaking levels of violent crime as he announced a federal takeover of the city. On Monday, Mr. Trump and his newly confirmed federal prosecutor for Washington cited an array of inaccurate statistics about murders in the city and crimes committed by children. It was part of a broader bid by his administration to rail against crime in urban, largely liberal cities, often turning to exaggerated and inaccurate figures to portray soaring violence and lawlessness. Here’s an assessment of some of their claims. “Murders in 2023 reached the highest rate probably ever. They say 25 years, but they don’t know what that means because it just goes back 25 years.”\n\n— Mr. Trump in the news conference on Monday False. There were 274 homicides in Washington in 2023 for a population of about 679,000 people, a rate of about 40.4. That was the highest rate in over 20 years, but not “ever.” Moreover, the homicide rate has since declined.\n\nThe number of murders declined by more than half in 2024 to 187 while the population grew to over 702,000 people, for a rate of 26.6 per 100,000. The recent trend of declining homicides appears to be holding, with 100 homicides as of Aug. 12, compared with 112 at the same point last year. The 274 homicides in 2023 was the highest number since 1997, when the city reported 301 homicides, according to police data compiled by the F.B.I. And the rate was the highest since 2003, which had a rate of 44 per 100,000, according to an analysis by Jeff Asher, a crime analyst based in New Orleans. But Mr. Trump is wrong that it was the highest rate “ever” or that the data only extends to the early 2000s. Records dating back to the 1960s show that Washington’s homicide rate peaked in the 1990s at more than 80 per 100,000 people in 1991 or about double that of the rate in 2023. “Look at the kind of numbers we have: D.C., 41 per 100,000, No. 1 that we can find anywhere in the world. Other cities are pretty bad, but they’re not as bad as that.”\n\n— Mr. Trump in the news conference False. Mr. Trump held up a chart that first appeared on Fox News and shared by Vice President JD Vance last week purportedly comparing Washington’s homicide rate to that of eight other “capitals.” (One, Lagos, is not a capital.) But the chart cites outdated data and also omits several other capitals and many other cities with much higher murder rates.\n\nThe chart cited a murder rate of 41 per 100,000 people, which was close to Washington’s homicide rate for 2023. But again, the rate declined to 26.6 per 100,000 in 2024. Mr. Trump has a point that Washington’s homicide rate is much higher than many capitals, but its rate is nowhere near the highest “anywhere in the world.” In 2023, according to data compiled by the Igarapé Institute, a Brazilian think tank, capitals with higher homicide rates included Port-au-Prince, Haiti, with a rate of 67.2 per 100,000 people; Cape Town, South Africa, with 66.8; Kingston, Jamaica, with 64.2; Caracas, Venezuela, with 47.9; Guatemala City at 47.8. The think tank reported a slightly lower homicide rate for Washington at 39.1, based on data from the Council on Criminal Justice and its higher population estimate. Overall, 47 cities had a higher homicide rate than 40.4 and 49 cities had rates higher than 39.1, including six in the United States. (They are Memphis, New Orleans, St. Louis, Baltimore, Cleveland, and Detroit.)\n\nThis is exaggerated. Total arrests of youths under 18 did increase from 2021 to 2023, but declined in 2024. Juvenile arrests through the first six months of 2025 are slightly higher compared with the same time period last year. But arrests of youths still remained below prepandemic levels and have significantly declined over the past 20 years. According to data compiled by the city’s Criminal Justice Coordinating Council, the police made about 1,500 arrests of children in 2020; 1,400 in 2021; 1,700 in 2022; 2,200 in 2023; and 2,000 in 2024. Juvenile arrests totaled 1,128 through the first half of 2025, compared with 1,114 in the first half of 2024. In comparison, the police arrested 2,300 to 2,900 youths annually from 2016 to 2019 and 3,400 to 4,000 annually from 2006 to 2010. “They know, these young gangs — or as they’re called here, crews — they know that if they’re 14, 15, 16, or 17, they’re below the age of criminal responsibility unless they commit the crime of murder, rape, armed robbery or burglary in the first degree.\n\nAnd that means if you shoot someone and they don’t die, I don’t even get the case as a prosecutor. And understand I’m not just a federal prosecutor, I’m the local D.A., so to speak here for D.C.: All of the cases go to family court and the goal of family court — the 14- through 17-year-olds — and those cases go to family court where the focus is rehabilitation and they talk about ice cream socials and yoga.”\n\n— Jeanine Pirro, the U.S. attorney for the District of Columbia, in an interview with Fox News on Monday night This is misleading. It is true Ms. Pirro, who was nominated by Mr. Trump to her role and confirmed by the Senate this month, does not have jurisdiction over most crimes committed by a child 17 years and under. But that does not mean arrested youth are not prosecuted at all; rather, a local prosecutor handles those cases. Similarly, many youth are detained at a center criticized for violence and overcrowding, not simply engaged in “ice cream socials and yoga.” By “family court,” Ms. Pirro is most likely referring to the role of the D.C. Superior Court’s family court social services division as the city’s probation agency for children. The agency decides whether arrested youth are released to parents or a guardian, placed in a shelter or confined to a juvenile detention center as they await trial or sentencing. Nearly half of youth arrests in Washington result in detention before an initial hearing, which is higher than the national average of about a quarter. Ms. Pirro is correct that she can directly charge a child as an adult if the child commits one of four serious crimes: murder, rape, armed robbery or burglary. But youth arrested on other offenses can be prosecuted by the city’s elected attorney general, who prosecuted 84 percent of violent crimes committed by children in 2024, and about 73 percent of all crimes.",
  "medium": "Article",
  "links": [
    "https://dcjusticelab.org/juvenile-transfer/#:~:text=In%20DC%2C%20if%20a%20sixteen%20or%20seventeen,no%20way%20to%20undo%20the%20prosecutor's%20decision.",
    "https://www.washlaw.org/district-of-columbia-sued-over-dc-youth-rehabilitation-services-abuse-of-youth/",
    "https://dcist.com/story/23/07/21/dc-youth-detention-confinement-staffing-crisis/",
    "https://www.foxnews.com/media/us-attorney-pirro-says-administration-wont-tolerate-out-control-crime-nations-capital",
    "https://jasher.substack.com/p/assessing-dcs-violent-crime-trends",
    "https://oag.dc.gov/public-safety/prosecution",
    "https://www.wusa9.com/article/news/legal/a-predator-was-given-the-keys-woman-who-was-sexually-assaulted-at-17-in-dcs-youth-jail-sues-corrections-officer-city-kelvin-powell/65-2951cafa-870c-44bd-a1ee-8babf9ff1f44",
    "https://www.washingtonpost.com/investigations/interactive/2025/dc-dyrs-youth-crime-rehabilitation/",
    "https://mayor.dc.gov/release/new-census-data-shows-dc%E2%80%99s-population-surpasses-700000-first-time-five-years",
    "https://homicide.igarape.org.br/",
    "https://dyrs.dc.gov/page/dc-juvenile-justice-system",
    "https://www.nytimes.com/2025/08/11/us/politics/trump-washington-dc-police.html",
    "https://jsat.cjcc.dc.gov/public-safety-and-justice-dashboard/monthly-reports/9cef0f31-8f43-43f3-add2-577380295cc6",
    "https://counciloncj.org/crime-trends-in-u-s-cities-year-end-2023-update/",
    "https://mpdc.dc.gov/sites/default/files/dc/sites/mpdc/publication/attachments/MPD%20Annual%20Report%202019__lowres.pdf#page=26",
    "https://mpdc.dc.gov/sites/default/files/dc/sites/mpdc/publication/attachments/MPD%20Annual%20Report%202017_lowres.pdf#page=26",
    "https://cde.ucr.cjis.gov/LATEST/webapp/#/pages/explorer/crime/query",
    "https://ojjdp.ojp.gov/publications/delinquency-cases-in-juvenile-court-2021.pdf",
    "https://mpdc.dc.gov/dailycrime",
    "https://mpdc.dc.gov/sites/default/files/dc/sites/mpdc/publication/attachments/ar_2010_lowres%20_revised11.pdf#page=27",
    "https://x.com/JDVance/status/1953528808008466920",
    "https://www.nytimes.com/2025/08/03/us/politics/senate-confirmation-jeanine-pirro-us-attorney.html",
    "https://igarape.org.br/en/where-are-the-worlds-most-homicidal-cities-in-2023/#:~:text=At%20the%20top%20of%20the%202023%20list%20is%20a%20surprising,which%20come%20as%20little%20surprise.",
    "https://jsat.cjcc.dc.gov/public-safety-and-justice-dashboard/quarterly-reports/juvenile/24066adf-57a2-41a5-9349-fb58f18de815/6b5d5ec8-1101-449d-8e1d-59d31ecf545a",
    "https://mayor.dc.gov/release/2023-census-data-highlights-continued-population-growth-washington-dc"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "higher homicide rates",
      "weight": 0.105167
    },
    {
      "name": "youth crime",
      "weight": 0.08411266
    },
    {
      "name": "D.C. Crime Data",
      "weight": 0.0828702
    },
    {
      "name": "declining homicides",
      "weight": 0.07642578
    },
    {
      "name": "rates",
      "weight": 0.07450927
    },
    {
      "name": "Other cities",
      "weight": 0.072687715
    },
    {
      "name": "many other cities",
      "weight": 0.07198576
    },
    {
      "name": "violent crime",
      "weight": 0.07142745
    },
    {
      "name": "violent crimes",
      "weight": 0.07142745
    },
    {
      "name": "Mr. Trump",
      "weight": 0.07012847
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97802734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.96435546875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.94482421875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.837890625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.63623046875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.421630859375
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.37841796875
    }
  ],
  "sentiment": {
    "positive": 0.03384803,
    "negative": 0.84361905,
    "neutral": 0.12253292
  },
  "summary": "President Donald Trump has announced a federal takeover of Washington, alleging that the city is experiencing record-breaking levels of violent crime and youth crime. The president and his newly confirmed federal prosecutor for Washington, Michael Bennett, cited inaccurate statistics about murders and crimes committed by children in a news conference. These claims were part of a broader effort by the administration to combat crime in urban, liberal cities. The claim was refuted by fact that 274 homicides in 2023, the highest rate in over 20 years, and that the homicide rate has since declined. However, the number of murders in 2024 to 187 while the population grew to over 702,000 people, for a rate of 26.6 per 100,000, was incorrect. The Igarapé Institute, a Brazilian think tank, reported that Washington's homicide rate was higher than any other major city in 2025 and that total arrests of youths under 18 were slightly higher compared to the same period.",
  "shortSummary": "President Trump exaggerated Washington’s homicide rates and youth crime, using inaccurate statistics to justify his federal takeover of the city.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "0f8afd7e55dd44039246b52ee8176d8d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://dyrs.dc.gov/page/dc-juvenile-justice-system",
      "text": "The DC Juvenile Justice system is a unique blend of federal and local entities collaborating to ensure the well-being and rehabilitation of young offenders. The system is governed by both federal laws and local regulations, creating a complex framework that aims to provide comprehensive support to juveniles in conflict with the law. Overall, the DC Juvenile Justice system prioritizes juvenile rehabilitation and successful reintegration into society and promotes positive outcomes for young people.\nIn the District of Columbia, a juvenile is defined as an individual under the age of 18. The following steps outline the typical journey through the District’s juvenile justice system.\nArrest and Processing\nAfter an arrest, the youth can be processed by the Metropolitan Police Department (MPD) at the Youth Services Center (YSC). In some cases, MPD may choose to dismiss or divert the youth to a program outside of the juvenile justice system. Otherwise, the Superior Court of the District of Columbia’s Family Court Social Services Division (CSSD) conducts a screening to determine whether the youth should be held at YSC or released to a guardian until the next court action.\nPre-Adjudication Stage\nIf the DC Office of the Attorney General (OAG) petitions the case in the juvenile system, an initial hearing is held to determine whether the case will move forward and, if so, where the youth will be placed before adjudication. There are three options for pre-adjudication placement:\n-\nCommunity release, in which the youth resides with an approved guardian and is monitored by CSSD;\n-\nA detention alternative, such as a shelter home; or\n-\nSecure detention at YSC. If a youth is aged 15 to 17 and charged with certain violent crimes, OAG may transfer the case to the adult system.\nAdjudication and Disposition\nIf a youth is found involved in a delinquent act, either through a plea or Court ruling, there is a hearing to determine the youth’s disposition. For the period between adjudication and disposition, the Court can place the youth on community release, in a shelter facility, or at YSC. At the dispositional hearing, the Court will determine whether the youth should be placed on probation with CSSD or committed to DYRS custody. This decision is informed by a pre-disposition report prepared by CSSD, which includes an assessment of the youth’s emotional, social, educational, and delinquency history and recommends a plan for treatment and disposition. If CSSD plans to recommend the youth for commitment with DYRS, then DYRS will also submit a pre-disposition report that outlines the youth’s supervision and treatment needs.\nA DYRS commitment can be for a specific or indeterminate period, so long as the commitment does not exceed the youth’s twenty-first birthday. The Court can require that DYRS obtain approval before ending the youth’s commitment, or it can grant DYRS authority to end the commitment when the agency deems it appropriate.\nDYRS Placement Process\nOnce a youth is committed to DYRS, the agency is responsible for all decisions regarding the youth’s placement and rehabilitation plans. This determination involves the following process:\n-\nReview of Court Recommendations: When making placement decisions, DYRS gives great weight to the Court’s recommended plans for treatment and supervision.\n-\nReview of Reports and Assessments: DYRS staff reviews disposition reports, social studies prepared by CSSD, psychological and psychiatric evaluations, psycho-educational evaluations, and discharge summaries from other programs and placements.\n-\nMental Health and Substance Abuse Needs Assessments: For youth placed at YSC and New Beginnings, DYRS staff, including licensed clinicians and behavioral health specialists, conduct mental health and substance abuse needs assessments such as the Child and Adolescent Service Intensity Instrument (CASII), the Massachusetts Youth Screening Instrument (MAYSI), the Trauma Symptom Checklist (TSC), and the Substance Abuse Subtle Screening Inventory (SASSI).\n-\nRisk Assessments: DYRS conducts risk assessments using the Structured Decision Making (SDM) tool. SDM takes into account various factors, including offense severity, number and type of prior adjudications, number of out-of-home placements, school discipline/attendance, substance abuse issues, and peer relationships. The outcome of the SDM risk assessment guides the level of restrictiveness in which the youth will receive services.\n-\nYouth Family Team Meetings: DYRS convenes Youth Family Team Meetings (YFTMs) to help develop placement and service plans tailored to each youth’s strengths and needs. In addition to DYRS staff and providers, participants in the YFTMs may include parents, family members, mentors, teachers, and other individuals who are involved in the youth’s life.\nReentry Process\nWhile committed to DYRS, youth who have been removed from the community receive services aimed at preparing them for successful community reentry. These services can include individual and family counseling, educational programs, vocational and employment training, substance abuse monitoring and counseling, independent living skills training, home assessments, tutoring, mentoring, recreational activities, job placements, and ongoing YFTMs. When placed in the community, committed youth are monitored by DYRS staff and service providers, and some youth also wear electronic monitoring (GPS) devices."
    },
    {
      "url": "https://mayor.dc.gov/release/new-census-data-shows-dc%E2%80%99s-population-surpasses-700000-first-time-five-years",
      "text": "(Washington, DC) – Today, the U.S. Census Bureau released new population data that shows the District of Columbia’s population grew by approximately 15,000 people from July 2023 to July 2024, bringing the city’s population to 702,250 residents. This marks the first time since 2019 that DC’s population has surpassed the 700,000 milestone, underscoring DC’s comeback and its place as a top destination to live, work, and build a future.\n“People from across the nation and the world are choosing Washington, DC because of our vibrant communities, world-class schools, dynamic job market and strong talent pool, and rich cultural opportunities,” said Mayor Bowser. “DC is a strong, well-run city and people want to be here, and we’re happy about that. We’ll continue to support our residents, attract great employers, and invest in schools, public safety, and economic opportunity – the pillars of our comeback.”\nOver the past year, the District had an annual growth rate of 2% and its largest population increase in 11 years. This growth was fueled by a combination of natural increase, with 2,761 more births than deaths, and migration, with 12,165 more people moving into the District than moving out. The District’s population increased across all age groups. Notably, international migration has surged, increasing by 21% compared to the previous year, surpassing pre-pandemic levels.\nFor more information on the population data, visit www.census.gov. Additional demographic insights about the District are available through the DC Office of Planning’s Demographic Data Hub at opdatahub.dc.gov.\nMayor Bowser X: @MayorBowser\nMayor Bowser Instagram: @Mayor_Bowser\nMayor Bowser Facebook: facebook.com/MayorMurielBowser\nMayor Bowser YouTube: https://www.bit.ly/eomvideos"
    },
    {
      "url": "https://oag.dc.gov/public-safety/prosecution",
      "text": "Background on Prosecutions\nThe Office of the Attorney General (OAG) is committed to using every legal tool available to reduce violent crime across the District. Effective prosecution plays a critical role in driving down crime and making our communities safer. In the District of Columbia, OAG is responsible for prosecuting crimes committed by juveniles, as well as some adult misdemeanors. Adult felonies, which make up the vast majority of violent offenses, are prosecuted by the federally-appointed US Attorney for the District of Columbia (USAO DC).\nYoung people must face consequences when they break the law, and OAG prosecutes every serious violent offense when we have enough evidence to do so. Successfully bringing a case to trial requires a significantly higher evidentiary standard (“proof beyond a reasonable doubt”) than making an arrest (“reasonable suspicion”). As a result, not all arrests lead to prosecutions. After juveniles are arrested, OAG works with our partners at the Metropolitan Police Department (MPD) to find cooperating witnesses, DNA evidence, video surveillance footage, and other evidence to prosecute cases as consistently as possible.\nOAG's efforts, in partnership with MPD and all District and federal public safety agencies, contributed to a 35% decrease in violent crime and a 15% decrease in crime overall in 2024 following an unacceptable spike in 2023. Overall, violent crime in DC has been trending downward for decades and reached a 30-year low last year.\nProsecuting Juvenile Crime in 2024\nIn 2024, OAG prosecuted 84.3% of violent juvenile offenses.\nFor the most serious juvenile offenses, OAG’s prosecution rates per arrest were:\n- Over 90% of homicide and attempted homicide cases\n- 87.1% of carjacking cases\n- 85.7% of gun possession cases\n- 78.9% of robbery cases\n- 88.1% of violent assault cases\nIn 2024, OAG prosecuted the highest percentage of cases for both violent juvenile offenses and all juvenile offenses since before 2019.\nOAG Juvenile Prosecution Statistics for 2019-2024\nProsecutions as Part of a Comprehensive Public Safety Strategy\nOAG uses every legal tool available to drive down crime. Effective prosecution and policing are critical parts of a comprehensive public safety strategy. To make DC safer in the long term, we must also take proactive measures to stop crimes from happening in the first place.\nIn addition to holding youth accountable when they break the law, OAG works closely with DC agencies to ensure youth receive effective intervention to prevent them from reoffending. In 2024, we worked with the DC Council to pass the ROAD Act to lower recidivism in the District’s juvenile justice system.\nOAG also:\n- Partners with the Alcoholic Beverage and Cannabis Administration (ABCA) and MPD to shut down illegal cannabis shops operating in DC — closing 18 illegal shops in 2024 alone.\n- Seeks Extreme Risk Protection Orders (ERPOs) to remove firearms and ammunition from those who pose a danger to themselves or others.\n- Addresses criminal activity at properties with a pattern of illegal drug, firearm, or prostitution activities by enforcing the Nuisance Abatement Act.\n- Oversees Cure the Streets, a community violence interruption program with a strong track record of reducing gun violence across its ten focus areas.\n- Runs ATTEND, a program that is helping ensure kids show up to school consistently by working with families at 11 schools to improve their children’s school attendance.\n- Holds dangerous drivers accountable by prosecuting the overwhelming majority of DUIs (97%) and reckless and aggravated reckless driving cases (96%).\n- Funds Leaders of Tomorrow, a $1.5 million public-private violent prevention grant program that supports high-impact local nonprofits that provide mentorship, academic support, health services, and employment opportunities for DC youth and families.\n- Addresses the underlying drivers of crime — poverty, housing instability, and pollution — by using our civil authority to protect DC residents’ pocketbooks, defend the rights of workers, combat financial exploitation, provide safe and affordable housing, and protect our environment."
    },
    {
      "url": "https://www.wusa9.com/article/news/legal/a-predator-was-given-the-keys-woman-who-was-sexually-assaulted-at-17-in-dcs-youth-jail-sues-corrections-officer-city-kelvin-powell/65-2951cafa-870c-44bd-a1ee-8babf9ff1f44",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://igarape.org.br/en/where-are-the-worlds-most-homicidal-cities-in-2023/#:~:text=At%20the%20top%20of%20the%202023%20list%20is%20a%20surprising,which%20come%20as%20little%20surprise.",
      "text": "Where are the world’s most homicidal cities in 2023?\nMay 2024\nRecent findings from the Homicide Monitor demonstrate that Latin American and Caribbean cities exhibit persistently high homicide rates compared to other regions.\nCities are powerful indicators of the progress of nations. When cities prosper, so do the prospects of countries. When they suffer from fragility, cities can experience deficits in everything from quality of life to investment to tourism. One critical measure of insecurity is lethal violence, including homicide. While hardly the only metric of safety and security, and in some cases not the most influential when it comes to public perception, lethal violence nevertheless provides a useful marker of the health of cities. Tracking changes in homicide can provide insight into progress on other fronts, including public security, governance and development.\nWhile there are plenty of indices of liveable cities, there are only a handful that focus on monitoring urban violence. Part of the reason for this is the limited availability of standardized data on violence in cities. Fortunately, one of the world’s largest public repositories of intentional homicide, the Homicide Monitor, takes the pulse of cities with populations of at least 250,000 inhabitants. The latest update provides a sobering reminder of how murders concentrate not just at the national, but also the city-scale. Latin American and Caribbean cities continue to register among the highest levels of homicide in the world – both in terms of absolute numbers and prevalence – though trends there are also changing.\nAs in previous years, over 40 of the top 50 murderous cities in the world are located in the region. Cities reporting the highest homicide rates per 100,000 are found in Brazil (13), Mexico (11) and South Africa (6), the United States (7), Ecuador (5), Colombia (3), followed by Venezuela, Guatemala, Jamaica, Haiti, and Lesotho with one apiece (see Figure 1). Notwithstanding the continued clustering of Latin American and Caribbean cities at the top of the list, new cities have emerged while others have dropped off. These shifts in ranking are a result of organized crime dynamics and the outcomes of national and local public security interventions across the region.\nAt the top of the 2023 list is a surprising new entrant, Durán, an Ecuadorian city of roughly 305,000 people. Registering a homicide rate of 142.7 per 100,000, Duran has borne the brunt of the country’s rapidly escalating drug war involving rival Colombian, Mexican, and Albanian crime organizations. In fact, five Ecuadorian cities – Duran, Manta, Guayaquil, Machala and Portoviejo – are included in the top 10. Coming in second is the South African city of Nelson Mandela Bay, home to roughly 1.3 million residents in South Africa. Rounding out the top 20 are large and medium-sized cities located in Brazil, Colombia, Haiti, Jamaica, Mexico and South Africa, many of which come as little surprise.\nFigure 1. Top 20 most homicidal cities: 2020-2023 (homicide per 100,000)\n| Rank | City | Country | Rate per 100,000 | Number | Population |\n| 1 | Durán | Ecuador | 148.00 | 453 | 306,045 |\n| 2 | Nelson Mandela Bay | South Africa | 102.82 | 1247 | 1,212,836 |\n| 3 | Manta | Ecuador | 95.60 | 261 | 273,050 |\n| 4 | Camaçari | Brazil | 90.93 | 272 | 299,132 |\n| 5 | Cajeme | Mexico | 88.99 | 432 | 485,453 |\n| 6 | Tijuana | Mexico | 87.88 | 1638 | 1,863,973 |\n| 7 | Guayaquil | Ecuador | 83.80 | 2319 | 2,765,695 |\n| 8 | Machala | Ecuador | 77.50 | 239 | 308,461 |\n| 9 | eThekwini – Durban | South Africa | 76.89 | 3138 | 4,080,930 |\n| 10 | Portoviejo | Ecuador | 76.00 | 247 | 325,193 |\n| 11 | Feira de Santana | Brazil | 74.65 | 459 | 614,872 |\n| 12 | Kingston | Jamaica | 70.73* | 475 | 671,596 |\n| 13 | Celaya | Mexico | 68.07 | 370 | 543,570 |\n| 14 | Macapá | Brazil | 67.75 | 341 | 503,327 |\n| 15 | Port-au-Prince | Haiti | 67.20** | 827 | 1,231,788 |\n| 16 | Cape Town | South Africa | 66.80 | 3231 | 4,837,094 |\n| 17 | uMgungundlovu (Msunduzi) | South Africa | 66.25 | 758 | 1,144,103 |\n| 18 | Ciudad Juárez | Mexico | 66.20 | 986 | 1,489,507 |\n| 19 | Buffalo City | South Africa | 65.59 | 521 | 794,389 |\n| 20 | Caucaia | Brazil | 65.58 | 237 | 361,400 |\n*Only 2022 data available. ** Port-au-Prince estimate is based on a review of absolute reported homicides and census data at the national and departmental level\nThe explosion of lethal violence in Ecuadorian cities in 2023 is a tragedy foretold. In 2023, Durán had a homicide rate akin to other cities that graced the top spot including San Salvador in 2016 (174 per 100,000). Four other Ecuadorian cities also registered homicide rates exceeding 70 per 100,000 in 2023. Indeed, in 2022, three Ecuadorian cities had already crept into the top 50 most homicidal cities: Guayaquil (22 out of 50), Santo Domingo (33 out of 50), and Machala (36 out of 50). This is in stark contrast to the 2017-2021 period, however, when Brazilian, Colombia, Mexican, Venezuela and South African cities dominated the list. Conspicuously absent in 2023, however, are large Central American cities from El Salvador and Honduras that have featured prominently over the past decade.\nThe rising number of violent cities from South Africa, the United States, and Caribbean countries is also cause for concern. Alongside Nelson Mandela Bay with a homicide rate of 102 per 100,000 is eThekwini/Durban with a homicide rate 76.9 per 100,000 and four other cities – Cape Town, uMgungundlovu (Msunduzi), Buffalo City, and Johannesburg. Although homicides have decreased in several US cities in 2023, 7 still rank among the top 50 in the world: New Orleans, St. Louis, Baltimore, Cleveland, Detroit, Washington D.C., and Memphis (with the highest US murder rate in 2023). Meanwhile, Kingston (78 per 100,000) has figured among the upper echelons of the list over the past five years. Port-au-Prince, the capital of Haiti, joined the top 50 rankings for the first time, with a projected homicide rate of roughly 67 per 100,000 in 2023, three times the estimated rate in 2021.\nTo be sure, heavily populated countries stand a greater chance of having more cities included in the top 50 than smaller countries (see Figure 3). That said, the concentration of cities with high homicide rates from a relatively small number of nations is noteworthy. Consider Brazil, which has 13 cities included in the top 50 in 2023 compared to 29 cities in 2015. Likewise, Mexico features 11 cities in the top 50 in 2023 as opposed to just 3 in 2015. Ditto with South Africa (6) and the United States (7) which are featured in the top 50 in 2023 in contrast to just 1 and 2 respectively in 2015. Notably, cities from other countries with sizable populations – India, China, Indonesia, Nigeria, Pakistan, Bangladesh, Russia, Ethiopia, and Japan – did not make the list.\nFigure 3. Countries featuring cities in the top 50 most homicidal (2015-2023)\n| Country | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 |\n| Bahamas | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 1 |\n| Brazil | 13 | 13 | 9 | 15 | 14 | 20 | 22 | 22 | 30 |\n| Colombia | 3 | 2 | 4 | 2 | 2 | 2 | 2 | 2 | 3 |\n| Ecuador | 5 | 4 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| El Salvador | 0 | 0 | 1 | 1 | 1 | 1 | 3 | 3 | 3 |\n| Guatemala | 1 | 1 | 1 | 0 | 2 | 2 | 2 | 2 | 3 |\n| Haiti | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |\n| Honduras | 0 | 1 | 2 | 2 | 2 | 1 | 1 | 3 | 3 |\n| Jamaica | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 0 | 0 |\n| Lesotho | 1 | 1 | 1 | 1 | 0 | 0 | 0 | 0 | 0 |\n| Mexico | 11 | 12 | 13 | 10 | 10 | 9 | 7 | 4 | 3 |\n| Puerto Rico | 0 | 0 | 0 | 0 | 1 | 0 | 0 | 0 | 0 |\n| South Africa | 6 | 5 | 5 | 4 | 5 | 2 | 1 | 2 | 1 |\n| United States | 7 | 6 | 7 | 6 | 3 | 2 | 2 | 1 | 2 |\n| Venezuela | 1 | 4 | 6 | 8 | 9 | 10 | 9 | 11 | 1 |\nAs noted in Figure 3, Latin America’s largest country, Brazil, featured the largest number of cities in the top 50 in 2023, albeit half the number almost a decade ago.1 Among the 13 Brazilian cities were 5 in the top 30. These include cities such as Camacari, Feira de Santana, and Salvador in the state of Bahia; Macapá in the Amazonian state of Amapá; and Caucaia in Ceará. While overall levels of homicide have decreased in Brazil in recent years, it is sharpening in parts of the Amazon and the northeast. Concerns with the “interioralization” of homicide have likewise grown, particularly among the nine states that make up the Legal Amazon which have murder rates that far exceed the national average.\nSeveral cities in Latin America’s second largest country, Mexico, have consistently ranked among the top 10 since 2020 (see Figure 3). Cities such as Cajeme (Sonora), Tijuana (Baja California), and Celaya (Guanajuato) stand out. Indeed, Cajeme was the world’s most violent city in 2022-21, while Tijuana ranked first in 2018 and 2019, and second between 2020 to 2022. Other Mexican cities that made appearances have since dropped out the top 10 in recent years, including Ciudad Juárez (which had the highest rate in 2009), Salamanca (top 1 in 2020), Uruapan, Los Cabos, and Acapulco. Prior to 2017, Acapulco was the only Mexican city that entered the top 10 ranking.\nMeanwhile, Colombia has registered between 2 and 4 cities in the top 50 since 2017 (see Figure 3). Yet Colombia has experienced unprecedented declines in homicidal violence over the past decade. Cities such as Medellín (Antioquia) and Cali (Valle del Cauca) were considered to be among the most violent in the world in the 1990s and 2000s. Yet most cities have dropped off the list with the exception of Cali that clings on stubbornly at 43 of 50 in 2023. Other intermediate cities entering the ranking last year are Sincelejo (top 29 in 2023 and the highest in Colombia) and Buenaventura (45 of 50). The presence of cities located in the Colombian Pacific stand out, including Tumaco, which ranked 6th in the world in 2022, and Buenaventura, which ranked 16th in 2021.\nArguably the biggest surprise in 2023 is the absence of several Central American cities from the the top 50 ranking (see Figure 3, Figure 4, and Figure 5). Cities such as San Salvador, San Miguel, and Soyapango in El Salvador were among the most homicidal cities in recent years. However, in the wake of controversial tough-on-crime crackdowns on violent gangs in El Salvador, lethal violence reportedly dropped by over 70 percent in 2023 alone. Meanwhile, the Honduran city of San Pedro Sula ranked as the most violent city in the world in 2014 with a homicide rate of 142 per 100,000. By 2023, the city had fallen outside the top 100 and registered a homicide rate of 25.8 per 100,000. Other cities such as the capital, Tegucigalpa, and Choloma also slipped off the top 50. By contrast, Guatemala City has experienced a recent increase in violent crime and reported a homicide rate of 47.8 per 100,000 in 2023.\nFigure 4. Ranking of most violent cities between 2017 and 2023 (homicides per 100,000)\n| Country name | City name | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 |\n| Ecuador | Durán | 1 | 50 | 124 | 189 | 301 | 301 | 437 |\n| South Africa | Nelson Mandela Bay | 2 | 4 | 10 | 13 | 24 | 38 | 50 |\n| Ecuador | Manta | 3 | 76 | 192 | 254 | 394 | 309 | 339 |\n| Brazil | Camaçari | 4 | 5 | 5 | 11 | 11 | 18 | 8 |\n| Mexico | Cajeme | 5 | 1 | 1 | 6 | 13 | 51 | 63 |\n| Mexico | Tijuana | 6 | 2 | 2 | 2 | 1 | 1 | 9 |\n| Ecuador | Guayaquil | 7 | 22 | 84 | 239 | 279 | 368 | 361 |\n| Ecuador | Machala | 8 | 36 | 146 | 217 | 261 | 381 | 311 |\n| South Africa | eThekwini – Durban | 9 | 11 | 36 | 32 | 41 | 59 | 78 |\n| Ecuador | Portoviejo | 10 | 102 | 306 | 442 | 338 | 434 | 353 |\n| Brazil | Feira de Santana | 11 | 13 | 12 | 12 | 19 | 17 | 32 |\n| Jamaica | Kingston and St. Andrew | 12 | 8 | 3 | 10 | 8 | 22 | 23 |\n| Mexico | Celaya | 13 | 3 | 7 | 5 | 68 | 91 | 177 |\n| Brazil | Macapá | 14 | 39 | 15 | 39 | 20 | 35 | 61 |\n| Haiti | Port-au-Prince | 15 | 90 | 138 | 592 | 657 | 125 | 134 |\n| South Africa | Cape Town | 16 | 14 | 13 | 14 | 14 | 23 | 45 |\n| South Africa | uMgungundlovu | 17 | 10 | 25 | 31 | 40 | 71 | 86 |\n| Mexico | Ciudad Juárez | 18 | 16 | 4 | 4 | 5 | 15 | 76 |\n| South Africa | Buffalo City | 19 | 21 | 48 | 53 | 44 | 73 | 72 |\n| Brazil | Caucaia | 20 | 27 | 6 | 3 | 2 | 3 | 5 |\nAnother country with surprising reduction in highly violent cities is Venezuela (see Figure 3 and Figure 4). Only Caracas was included in the top 50 most homicidal cities in 2023, a sharp contrast from 2021 when 11 Venezuelan cities were featured in the list.\nLocal researchers associated with the Observatory of Violence in Venezuela attribute the apparent reduction in violent deaths to the limited opportunities for crime as well as an increase in the number of deaths “under investigation”. Even so, sudden and dramatic reductions in homicide – as noted in places like El Salvador, Honduras, and Venezuela – should be approached with caution. It is likely there are either changes in reporting methodologies or even regime changes which can result in the public availability and credibility of official sources.\nAlthough the Homicide Monitor sheds light on city-scale trends, it suffers from several limitations, notably excluding cities with populations under 250,000. This exclusion results in the omission of small yet violent cities in Central America and the Caribbean. Importantly, there are many cities below the top 50 threshold and potentially below the population threshold that have experienced sharp increases in homicide rates. These cities are akin to ‘canaries in the mine,’ providing early warning signs of underlying shifts in the structure of organized crime. Examples include San José in Costa Rica which experienced a sharp increase in homicide from 15.1 per 100,000 in 2022 to 23 per 100,000 by 2023. Other cities registering increases are located in northern Chile and Rosario in Argentina. Likewise, a host of cities in Caribbean countries such as the Bahamas, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines and Trinidad and Tobago all experienced sharp increases in recent years.\nAnother factor that frustrates comparative analysis of homicide in cities is that many countries in Africa and Asia simply do not generate or make available disaggregated city-level information. Even when requested by UNODC, national authorities are unable or unwilling to supply information on lethal and nonlethal violence at the subnational level. Data availability and quality is likewise uneven in both regions. For example, large\nAfrican cities with millions of inhabitants such as Kinshasa (DRC), Lagos (Nigeria), Cairo and Giza (Egypt), Luanda (Angola), Dar es Salaam (Tanzania), Khartoum (Sudan), and Abidjan (Côte d’Ivoire) simply lack basic official information or fail to report statistics on murder publicly. While it is unlikely that many cities in these regions register homicide rates exceeding the top 50 listed in 2023 (especially considering their comparatively low officially reported national homicide rates), the reality is that greater transparency and investment in data collection is needed.\nIt is also the case that countries and cities beset by wars and conflict often lack robust data collection on homicide. In Afghanistan, Myanmar, the Occupied Palestinian Territories, Sudan, Syria, and Ukraine, information on lethal violence is often gathered piecemeal from hospitals, humanitarian organizations, and media outlets. Another example is Haiti, which has been affected by an unprecedented crisis since 2021. The country experienced at least 4,789 homicides in 2023, more than double that of 2022. Using historical and disaggregated data, we estimate that the city’s homicide rate was roughly 67 per 100,000. Yet it is likely that even this rate underestimates the extent of homicidal violence, not least since there are extremely limited capacities in Haiti to even register fatalities. Ultimately, there are other data collection systems available to count conflict deaths, including from ACLED, Action on Armed Violence, and Uppsala University, each with differing methodologies and sources.\nA focus on lethal violence in cities demonstrates homicide clusters in space. Indeed, an even more granular analysis would reveal the hyper-concentration of homicide at the neighborhood and even street corner scale. The focus on temporal changes in lethal violence also provides a potent reminder that it is not static and that city residents have agency. While a reflection on the top 50 most homicidal cities can help draw attention to the public security challenges confronting cities, it is important to recall that all urban centers face multiple forms of insecurity that warrant engagement and investment.\nAnnex 1. Top 50 most homicidal cities (2017-2023)\n| Rank 2023 | Country name | City | 2017 | 2018 | 2019 | 2020 | 2021 | 2022 | 2023 |\n| 1 | Ecuador | Durán | 3.8 | 9.0 | 9.1 | 15.5 | 23.3 | 39.8 | 148.0 |\n| 2 | South Africa | Nelson Mandela Bay | 54.6 | 54.1 | 61.9 | 68.3 | 71.3 | 80.0 | 102.8 |\n| 3 | Ecuador | Manta | 7.8 | 8.5 | 5.0 | 11.4 | 16.0 | 33.2 | 95.6 |\n| 4 | Brazil | Camaçari | 95.0 | 67.8 | 72.5 | 75.3 | 82.1 | 79.0 | 90.9 |\n| 5 | Mexico | Cajeme | 49.9 | 50.6 | 70.5 | 92.8 | 125.6 | 104.4 | 89.0 |\n| 6 | Mexico | Tijuana | 94.7 | 129.4 | 113.4 | 101.9 | 97.0 | 98.9 | 87.9 |\n| 7 | Ecuador | Guayaquil | 6.9 | 6.3 | 10.0 | 12.1 | 31.4 | 52.6 | 83.8 |\n| 8 | Ecuador | Machala | 8.9 | 5.7 | 10.8 | 14.5 | 22.5 | 42.8 | 77.5 |\n| 9 | South Africa | eThekwini – Durban | 44.1 | 46.2 | 47.0 | 50.4 | 46.5 | 69.7 | 76.9 |\n| 10 | Ecuador | Portoviejo | 7.3 | 3.8 | 7.2 | 3.7 | 8.3 | 29.7 | 76.0 |\n| 11 | Brazil | Feira de Santana | 65.7 | 68.9 | 64.7 | 70.5 | 66.3 | 66.9 | 74.6 |\n| 12 | Jamaica | Kingston and St. Andrew | 70.3 | 66.3 | 77.9 | 78.0 | 87.3 | 70.7 | n.a |\n| 13 | Mexico | Celaya | 18.6 | 36.1 | 38.0 | 92.9 | 76.0 | 83.4 | 68.1 |\n| 14 | Brazil | Macapá | 50.3 | 55.3 | 64.6 | 47.8 | 63.6 | 41.4 | 67.7 |\n| 15 | Haiti | Port-au-Prince | n.a | 26.7 | n.a | n.a | 22.7 | n.a | n.a |\n| 16 | South Africa | Cape Town | 58.1 | 65.4 | 69.9 | 67.1 | 65.7 | 66.5 | 66.8 |\n| 17 | South Africa | uMgungundlovu | 41.4 | 42.4 | 47.1 | 50.4 | 52.9 | 69.8 | 66.3 |\n| 18 | Mexico | Ciudad Juárez | 44.7 | 69.4 | 88.0 | 97.4 | 82.7 | 58.7 | 66.2 |\n| 19 | South Africa | Buffalo City | 46.3 | 42.1 | 46.1 | 42.3 | 41.8 | 54.2 | 65.6 |\n| 20 | Brazil | Caucaia | 98.0 | 101.9 | 101.9 | 99.4 | 78.1 | 49.6 | 65.6 |\n| 21 | United States of America | Memphis | 27.7 | 28.8 | 29.2 | 44.4 | 47.1 | 45.9 | 63.9 |\n| 22 | Mexico | Salamanca | 28.7 | 97.9 | 101.8 | 107.4 | 51.7 | 58.0 | 63.1 |\n| 23 | Mexico | Uruapan | 29.0 | 43.3 | 68.8 | 59.2 | 73.0 | 70.3 | 56.1 |\n| 24 | Mexico | Acapulco de Juarez | 100.3 | 100.5 | 70.8 | 42.6 | 52.4 | 51.6 | 52.9 |\n| 25 | United States of America | New Orleans | 39.5 | 37.1 | 30.7 | 51.0 | 53.3 | 71.0 | 52.2 |\n| 26 | Brazil | Salvador | 51.6 | 43.4 | 37.6 | 47.8 | 55.5 | 54.8 | 52.1 |\n| 27 | Lesotho | Maseru | n.a | n.a | n.a | 56.8 | 53.3 | 51.8 | n.a |\n| 28 | Brazil | Petrolina | 38.2 | 41.9 | 27.2 | 37.5 | 34.5 | 39.3 | 51.0 |\n| 29 | Colombia | Sincelejo | 16.9 | 14.4 | 15.7 | 13.9 | 25.5 | 27.6 | 50.3 |\n| 30 | United States of America | St. Louis | 66.1 | 60.9 | 64.6 | 88.1 | 64.0 | 68.0 | 50.3 |\n| 31 | Mexico | Cuernavaca | 20.2 | 26.2 | 42.4 | 34.5 | 43.0 | 42.4 | 50.0 |\n| 32 | Venezuela | Caracas | 73.4 | 55.2 | 74.7 | 65.2 | 72.5 | 61.1 | 47.9 |\n| 33 | Guatemala | Guatemala | 64.3 | 51.6 | 55.0 | 31.8 | 43.1 | 50.9 | 47.8 |\n| 34 | Mexico | Chilpancingo | 94.2 | 89.5 | 50.7 | 31.7 | 23.1 | 32.0 | 47.4 |\n| 35 | Brazil | Imperatriz | 45.2 | 49.6 | 43.7 | 44.3 | 41.2 | 37.5 | 47.2 |\n| 36 | United States of America | Baltimore | 55.8 | 51.0 | 58.3 | 51.5 | 54.0 | 58.0 | 46.0 |\n| 37 | United States of America | Cleveland | 27.8 | 22.4 | 24.1 | 42.2 | 43.5 | 45.7 | 45.7 |\n| 38 | Mexico | León | 20.6 | 21.3 | 27.4 | 37.7 | 41.8 | 36.1 | 45.2 |\n| 39 | Brazil | Olinda | 42.0 | 40.8 | 38.0 | 33.8 | 33.3 | 34.6 | 44.8 |\n| 40 | Brazil | Marabá | 76.2 | 73.8 | 51.9 | 33.9 | 39.6 | 47.2 | 44.4 |\n| 41 | Brazil | Jaboatão dos Guararapes | 58.6 | 45.9 | 42.6 | 46.8 | 39.5 | 40.7 | 43.9 |\n| 42 | Brazil | Manaus | 49.4 | 47.2 | 46.0 | 35.9 | 53.6 | 46.8 | 43.8 |\n| 43 | Colombia | Cali | 56.0 | 51.7 | 49.7 | 47.7 | 54.0 | 43.1 | 43.7 |\n| 44 | Brazil | Palmas | 22.7 | 26.0 | 30.8 | 33.6 | 24.6 | 31.7 | 42.8 |\n| 45 | Colombia | Buenaventura | 22.3 | 29.5 | 36.4 | 35.6 | 61.6 | 34.8 | 42.8 |\n| 46 | South Africa | Johannesburgo | 29.2 | 30.7 | 31.7 | 32.1 | 27.4 | 35.8 | 42.7 |\n| 47 | Brazil | Maceió | 64.4 | 51.7 | 34.1 | 30.2 | 32.0 | 37.3 | 41.8 |\n| 48 | United States of America | Detroit | 39.5 | 39.2 | 41.5 | 49.7 | 45.0 | 50.0 | 40.6 |\n| 49 | Mexico | Juarez | 10.3 | 18.2 | 25.1 | 25.4 | 19.9 | 29.9 | 39.8 |\n| 50 | United States of America | Washington DC | 16.7 | 22.7 | 23.4 | 27.8 | 31.8 | 28.4 | 39.1 |\nAnnex 2. Sources of data for the top 50 most homicidal cities 2023\n| Rank | Country | City | Rate per 100,000 | Number | Population | Source |\n| 1 | Ecuador | Durán | 148.00 | 453 | 306,045 | Ministerio del Interior/DINASED |\n| 2 | South Africa | Nelson Mandela Bay | 102.82 | 1247 | 1,212,836 | South African Police Service |\n| 3 | Ecuador | Manta | 95.60 | 261 | 273,050 | Ministerio del Interior/DINASED |\n| 4 | Brazil | Camaçari | 90.93 | 272 | 299,132 | Compiled from Secretaries of Security |\n| 5 | Mexico | Cajeme | 88.99 | 432 | 485,453 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 6 | Mexico | Tijuana | 87.88 | 1638 | 1,863,973 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 7 | Ecuador | Guayaquil | 83.80 | 2319 | 2,765,695 | Ministerio del Interior/DINASED |\n| 8 | Ecuador | Machala | 77.50 | 239 | 308,461 | Ministerio del Interior/DINASED |\n| 9 | South Africa | eThekwini – Durban | 76.89 | 3138 | 4,080,930 | South African Police Service |\n| 10 | Ecuador | Portoviejo | 76.00 | 247 | 325,193 | Ministerio del Interior/DINASED |\n| 11 | Brazil | Feira de Santana | 74.65 | 459 | 614,872 | Compiled from Secretaries of Security |\n| 12 | Jamaica | Kingston and St. Andrew | 70.73 | 475 | 671,596 | Jamaica Constabulary Police Force (2022) |\n| 13 | Mexico | Celaya | 68.07 | 370 | 543,570 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 14 | Brazil | Macapá | 67.75 | 341 | 503,327 | Compiled from Secretaries of Security |\n| 15 | Haiti | Port-au-Prince | 67.20 | 827 | 1,231,788 | Projections based on departmental data |\n| 16 | South Africa | Cape Town | 66.80 | 3231 | 4,837,094 | South African Police Service |\n| 17 | South Africa | uMgungundlovu | 66.25 | 758 | 1,144,103 | South African Police Service |\n| 18 | Mexico | Ciudad Juárez | 66.20 | 986 | 1,489,507 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 19 | South Africa | Buffalo City | 65.59 | 521 | 794,389 | South African Police Service |\n| 20 | Brazil | Caucaia | 65.58 | 237 | 361,400 | Compiled from Secretaries of Security |\n| 21 | United States of America | Memphis | 63.90 | 397 | 621,056 | Police office |\n| 22 | Mexico | Salamanca | 63.12 | 190 | 300,994 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 23 | Mexico | Uruapan | 56.06 | 203 | 362,116 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 24 | Mexico | Acapulco de Juarez | 52.91 | 449 | 848,647 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 25 | United States of America | New Orleans | 52.20 | 193 | 369,749 | Police office |\n| 26 | Brazil | Salvador | 52.08 | 1496 | 2,872,347 | Compiled from Secretaries of Security |\n| 27 | Lesotho | Maseru | 51.79 | 181 | 350,000 | Lesotho Bureau of Statistics (data 2022) |\n| 28 | Brazil | Petrolina | 50.98 | 178 | 349,145 | Compiled from Secretaries of Security |\n| 29 | Colombia | Sincelejo | 50.32 | 153 | 304,026 | Policía Nacional |\n| 30 | United States of America | St. Louis | 50.25 | 518 | 314,428 | Police office |\n| 31 | Mexico | Cuernavaca | 50.02 | 205 | 409,831 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 32 | Venezuela | Caracas | 47.91 | 1284 | 2,680,297 | Observatorio Venezolano de la Violencia |\n| 33 | Guatemala | Guatemala | 47.80 | 584 | 1,221,739 | Policía Nacional Civil |\n| 34 | Mexico | Chilpancingo De Los Bravo | 47.40 | 137 | 289,043 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 35 | Brazil | Imperatriz | 47.16 | 122 | 258,682 | Compiled from Secretaries of Security |\n| 36 | United States of America | Baltimore | 46.00 | 262 | 569,931 | Police office |\n| 37 | United States of America | Cleveland | 45.70 | 168 | 367,615 | Police office |\n| 38 | Mexico | León | 45.15 | 777 | 1,720,754 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 39 | Brazil | Olinda | 44.84 | 176 | 392,482 | Compiled from Secretaries of Security |\n| 40 | Brazil | Marabá | 44.39 | 124 | 279,349 | Compiled from Secretaries of Security |\n| 41 | Brazil | Jaboatão dos Guararapes | 43.86 | 308 | 702,298 | Compiled from Secretaries of Security |\n| 42 | Brazil | Manaus | 43.84 | 957 | 2,182,763 | Compiled from Secretaries of Security |\n| 43 | Colombia | Cali | 43.75 | 1005 | 2,297,230 | Policía Nacional |\n| 44 | Brazil | Palmas | 42.79 | 128 | 299,127 | Compiled from Secretaries of Security |\n| 45 | Colombia | Buenaventura | 42.77 | 136 | 318,003 | Policía Nacional |\n| 46 | South Africa | Johannesburg | 42.66 | 2656 | 6,225,275 | South African Police Service |\n| 47 | Brazil | Maceió | 41.81 | 426 | 1,018,948 | Compiled from Secretaries of Security |\n| 48 | United States of America | Detroit | 40.60 | 252 | 620,376 | Police office |\n| 49 | Mexico | Juarez | 39.83 | 168 | 421,798 | SESNSP -Secretariado del Ejecutivo del Sistema Nacional de Seguridad Pública |\n| 50 | United States of America | Washington DC | 39.05 | 274 | 701,665 | Police office |"
    },
    {
      "url": "https://mpdc.dc.gov/dailycrime",
      "text": "2025 Year-to-Date Crime Comparison*\nAs of August 12, 2025\nThe statistics below reflect the data entered into MPD's records management system as of 12 am on the date above. These numbers are based on DC Code Offense definitions and do NOT reflect Part I crime totals as reported to the FBI’s National Incident-Based Reporting System (NIBRS). This report should be considered ‘preliminary’ in nature. The reports are subject to change due to subsequent determinations related to amendments in classification, unfounded cases or changes in offense definitions.\n| Offense | 2024 | 2025 | Percent Change |\n|---|---|---|---|\n| Homicide | 112 | 100 | -11% |\n| Sex Abuse | 110 | 55 | -50% |\n| Assault w/ a Dangerous Weapon | 668 |\n534 |\n-20% |\n| Robbery | 1,252 | 899 | -28% |\n| Violent Crime - Total |\n2,142 |\n1,588 | -26% |\n| Burglary | 546 |\n443 |\n-19% |\n| Motor Vehicle Theft | 2,915 | 2,919 | 0% |\n| Theft from Auto | 3,876 | 3,739 | -4% |\n| Theft (Other) | 7,459 | 7,047 | -6% |\n| Arson | 3 | 4 | 33% |\n| Property Crime - Total | 14,799 | 14,152 | -4% |\n| All Crime - Total | 16,941 | 15,740 | -7% |\n2024 Year End Crime Data\nYear-end 2024 data accurate as of January 1, 2025.\n| Offense | 2023 | 2024 | Percent Change |\n|---|---|---|---|\n| Homicide | 274 | 187 | -32% |\n| Sex Abuse | 191 | 143 | -25% |\n| Assault w/ a Dangerous Weapon | 1,412 |\n1,026 |\n-27% |\n| Robbery | 3,468 | 2,113 | -39% |\n| Violent Crime - Total |\n5,345 |\n3,469 | -35% |\n| Burglary | 1,095 | 1.001 |\n-9% |\n| Motor Vehicle Theft | 6,809 | 5,139 | -25% |\n| Theft from Auto | 7,795 | 6,698 | -14% |\n| Theft (Other) | 13,314 | 13,037 | -2% |\n| Arson | 11 | 4 | -64% |\n| Property Crime - Total | 29,024 | 25,879 | -11% |\n| All Crime - Total | 34,369 | 29,348 | -15% |\nRecovered Firearms\n| 2015 | 2016 | 2017 | 2018 | 2019 | 2020 | 2021 | 2022 | 2023 | 2024 |\n|---|---|---|---|---|---|---|---|---|---|\n| 1,706 | 1,870 | 2,191 | 1,928 | 2,299 | 2,371 | 2,310 | 3,152 | 3,135 | 2,895 |\n20-Year Homicide Trend\n| 2024 | 2023 | 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 |\n|---|---|---|---|---|---|---|---|---|---|\n| 187 | 274 | 203 | 226 | 198 | 166 | 160 | 116 | 135 | 162 |\n| 2014 | 2013 | 2012 | 2011 | 2010 | 2009 | 2008 | 2007 | 2006 | 2005 |\n|---|---|---|---|---|---|---|---|---|---|\n| 105 | 104* | 88 | 108 | 132 | 144 | 186 | 181 | 169 | 196 |\n*The citywide 2013 homicide statistics include the 12 victims of the Washington Navy Yard shooting incident that occurred on September 16, 2013."
    },
    {
      "url": "https://jasher.substack.com/p/assessing-dcs-violent-crime-trends",
      "text": "Assessing DC's Violent Crime Trends\nMurder is plunging in DC but what about overall violent crime?\nTo paraphrase Bart Simpson, Washington DC’s violent crime data and trends make it a land of many contrasts. As such, the theme of this post on DC’s violent crime trends is that multiple things are true.\nDC’s publicly available crime data is mostly good with the city publishing some innovative datasets. DC has incident-level crime data available going back almost 15 years. They publish monthly staffing reports, a carjacking dashboard, clearances, arrests, ShotSpotter, and much more. But the agency's publicly available data may be overstating the degree that violent crime is declining right now.\nReviewing the agency’s data clearly shows the city’s trends:\nMurder has consistently fallen since peaking in late 2023 and is tracking the city’s pre-COVID trend so far in 2025.\nCarjackings in DC had an enormous surge in 2023 but have fallen consistently since then to levels consistent with the start of the pandemic (and are still falling). Yet carjackings are more frequent now than they were before COVID.\nMeasuring DC’s overall violent crime trend is a bit more complicated. Violent crime in DC is down a huge amount from where it was in the early 1990s and down a good bit from where it was a decade ago. Violent crime in DC fell in 2024 after increasing in 2023, that much is clear from DC’s reporting to the FBI. The exact picture for 2025 is a bit murkier though violent crime is likely falling this year. DC’s open data is likely overstating the degree of the city’s decline in violent crime right now though.\nLet’s start with murder.\nWashington DC recorded 482 murders in 1991 placing the city’s murder rate as the highest in the United States. That fell to an astoundingly low 88 murders in 2012 but has picked up in the last 10 years following trends seen in many US cities.\nMurders in DC peaked in 2023, began falling in 2024, and have been steadily falling through July 2025. There were 96 murders through July 2025 in DC, down 11 percent relative to the same timeframe in 2024, down 34 percent relative to the first 7 months of 2023, and exactly the same number as was reported through July 2019.\nNext, carjackings.\nDC has an excellent carjackings dashboard which clearly shows the city’s trends. Carjackings increased in 2020 and then nearly doubled in 2023 before peaking and firmly declining since the start of 2024. Carjackings are still reported more frequently now than they were before COVID, but there has been a consistent drop for more than 18 months. The 16 carjackings reported in DC in July 2025 were the fewest reported in a month since May 2020 — before the surge — and represented an 87 percent drop from July 2023’s total.\nThe available data suggests that carjackings tend to be disproportionately committed by juveniles. Less than 8 percent of Washington, DC arrests in 2024 were juveniles per MPDC data, but more than half of carjacking arrests involve a juvenile. So it’s also noteworthy the degree to which juvenile arrests for carjackings have fallen, at least through 2024 (2025 arrest data isn’t available yet).\nMurder’s falling, carjacking’s falling, but what about DC’s overall violent crime trend?\nThe bottom line is that violent crime in DC is currently declining and the city’s reported violent crime rate is more or less as low now as it has been since the 1960s (Standard disclaimer that not all crimes are reported to police). The city’s official violent crime rate in 2024 was the second lowest that has been reported since 1966.\nAt the same time, the publicly available data from MPDC appears to be overstating the degree of the decline in 2025. If you go by DC’s publicly available data, you'll see that violent crime is down 26 percent as of early August compared to the same timeframe in 2024.\nBut, as Lee Corso might say, “not so fast, my friend.”\nIf you look closely, you might see something unexpected in the above table from MPDC’s website. The city publishes crime categories loosely based around Uniform Crime Report Part I offense types, but not exactly. As explained on DC’s website, “These numbers are based on DC Code Offense definitions and do NOT reflect Part I crime totals…”\nSo instead of publishing data on aggravated assaults, we get assaults with a deadly weapon. Instead of data on rapes, we get sex abuse offenses. That’s not inherently problematic, but comparing what is being published by DC to the numbers being reported to the FBI suggests that the department’s website is overstating the decline in violent crime over the last two years. Violent crime is still declining, but probably not as much as is being reported.\nDC reported 1,026 aggravated assaults with a dangerous weapon in 2024 per MPDC’s website, but they reported 3,004 aggravated assaults to the FBI. The growing discrepancy between data reported to the FBI and the publicly available website can be seen in the below graph comparing aggravated assaults reported to the FBI to DC’s publicly available data rolling over 12 months.\nDC reported a 7 percent increase in aggravated assaults in 2024 (which was offset in the violent crime count by large drops in robberies, rapes, and murder) but MPDC’s public data showed a 27 percent drop in assaults with a dangerous weapon. This contrasts sharply with 2020 when DC reported a 3.6 percent increase in assaults with a dangerous weapon compared to a 2.1 percent increase in aggravated assaults.\nMPDC’s public data and the data reported to the FBI mostly agreed about 2023 (+39 percent increase in violent crime vs + 41 percent respectively). The data for 2024 (and most likely) 2025 is more problematic though given just how sharply the decline in MPDC’s public data differs from the decline reported by DC to the FBI via the Crime Data Explorer (CDE). Note that in the below chart that there’s no data from the FBI in 2021 and 2022 because of the NIBRS transition.\nAs you can see, it’s not unusual for MPDC’s publicly available data to suggest a larger drop in violent crime than is reported to the FBI (probably due to the former measuring incidents vs the latter measuring victims), but the percent changes are usually reasonably close. For 2024, however, the FBI’s data shows a 9 percent drop while MPDC’s public data shows a 35 percent drop.\nWe don’t have 2025 data from the FBI to know for sure that the department’s 26 percent decline from 2024 is an overstatement, but I’d be very surprised if it was accurate.\nThere’s still tons of evidence pointing to declining violent crime in DC in 2025, especially gun violence.\nWe trust the MPDC’s murder and carjacking figures which both show sizable declines in 2025 — especially compared to 2023. There is also separate data from ShotSpotter showing a 16 percent drop in alerts through the first half of 2025 compared to the first half of 2024 and a 45 percent drop relative to the first half of 2023.\nI’m not sure why the discrepancy between MPDC’s public data and what’s being reported to the FBI has grown, but the enormous quantity and quality of open data provided by MPDC points strongly towards a data reporting issue rather than an intentional misrepresentation (though if you want to take the preceding paragraphs in bad faith and immediately jump to that conclusion, I guess that’s your prerogative.)\nSo while we don’t really confidently know exactly how much violent crime is falling in DC in 2025 from the public data, the drops in murder, and robbery this year — which conform much closer to what has been reported to the FBI — suggest violent crime is indeed dropping. Even if we can’t say for certain from the publicly available data how far it’s falling, there’s no reason to suspect the overall trend being reported isn’t correct.\nOne could rightly argue that 96 murders and 188 carjackings so far this year is still far too many heinous tragedies. But one must be able to differentiate between a crime’s level leaving room for improvement while also acknowledging a strong downward trends in the crimes with the highest cost to society in the nation’s capital.\nFrom NBC News in Washington July 18, 2025:\nThe union claims police supervisors in the department manipulate crime data to make it appear violent crime has fallen considerably compared to last year.\n“When our members respond to the scene of a felony offense where there is a victim reporting that a felony occurred, inevitably there will be a lieutenant or a captain that will show up on that scene and direct those members to take a report for a lesser offense,” Fraternal Order of Police Chairman Gregg Pemberton said. “So, instead of taking a report for a shooting or a stabbing or a carjacking, they will order that officer to take a report for a theft or an injured person to the hospital or a felony assault, which is not the same type of classification.”\nThe union has been gathering evidence for some time now by looking at reports and talking with officers all over the city, Pemberton said.\nAlmost all of the crime figures you present have tripled over the last 10 years, but you suggest that because they’ve fallen in the last few years that they’re meaningfully in decline… compared to what?? And how do current DC crime figures compare to other major metros? Spoiler alert- some of the highest in the entire country by orders of magnitude."
    },
    {
      "url": "https://www.foxnews.com/media/us-attorney-pirro-says-administration-wont-tolerate-out-control-crime-nations-capital",
      "text": "Jeanine Pirro, the United States attorney for the District of Columbia, said President Donald Trump’s decision to place the D.C. police under temporary federal control and deploy the National Guard to the nation’s capital was a first step toward cracking down on crime.\n\"We are now in the process of bringing to the attention of law-abiding citizens, not just in D.C., but throughout the country, that we're not going to tolerate crime that is out of control in the nation's capital,\" she said Monday on \"Hannity.\"\n\"This is the shining city on the hill that our forefathers talked about. This is the place where Ronald Reagan talked about looking up to. And in the end, it is an incredibly violent area.\"\nPirro, a former Fox News co-host, joined Trump and other top administration officials at the White House briefing room when the commander-in-chief announced the changes and a surge in federal law enforcement.\nTrump wrote on his Truth Social account that he wants to make the federal district one of the safest cities in the world and called for teenagers as young as 14 to be charged as adults.\nThe comments came after ex-DOGE employee Edward Coristine, nicknamed \"Big Balls,\" was allegedly assaulted during an attempted carjacking.\nTwo 15-year-olds have since been arrested and face charges of unarmed carjacking in connection with the Coristine attack, according to the Metropolitan Police Department (MPD).\nDC US ATTORNEY SAYS ‘ENOUGH IS ENOUGH’ AS YOUTH CRIME PUTS SPOTLIGHT ON NATION’S CAPITAL\nPirro told Fox News host Sean Hannity that D.C.’s juvenile justice system is focused more on rehabilitation than accountability.\n\"We've got an area where criminals are emboldened for a variety of reasons,\" said the top federal prosecutor.\n\"They know these young gangs – or, as they're called here, crews – they know that if they're 14, 15, 16, or 17, they are below the age of criminal responsibility unless they commit the crime of murder, rape one, armed robbery or burglary in the first degree. And that means if you shoot someone and they don't die, I don't even get the case as a prosecutor.\"\nShe added: \"Unless and until we get our hands on them and unless and until we have the ability to punish them, they are emboldened and they are laughing at us.\"\nMPD reported a 7% decrease in overall crime and a 26% reduction in violent crime in Washington, D.C., as of Monday, compared to the same period in 2024.\nD.C. Mayor Muriel Bowser cited a decline in crime incidents since the COVID-19 pandemic, after a spike in 2023, and noted that the city is at a 30-year low in violent crime.\nShe called the deployment of National Guard troops \"unsettling and unprecedented\" but pledged to work with federal officials to ensure residents are safe."
    },
    {
      "url": "https://mayor.dc.gov/release/2023-census-data-highlights-continued-population-growth-washington-dc",
      "text": "(Washington, DC) – Today, the U.S. Census Bureau released new population data that shows that the District’s population grew by 8,023 people from July 1, 2022 to July 1, 2023, making this the second consecutive year that DC’s population increased.\n“DC’s Comeback is underway, and you can see it in these numbers,” said Mayor Muriel Bowser. “In our Comeback Plan, we are clear: we are focused on keeping people in DC, bringing people to DC, and making sure that every neighborhood is a vibrant place for people to live, work, visit, and play. We are going to continue to attract great employers, to invest in housing and economic opportunity, and to prioritize our city’s greatest asset: our people.”\nThe District is showing strong signs of growth with two consecutive years of population increase, reversing population declines during COVID-19. The growth from 2022 to 2023 is larger than the growth between 2021 and 2022 when the District gained 1,912 people. As of the July 1, 2023, DC’s population was at 678,972, with a population increase of 1.2% year over year. With this increase, DC ranks 7th among all states in terms of population percentage growth from 2022 to 2023.\nThis growth is attributed to the District having 2,607 more births than deaths in the year. Additionally, this is the first year since 2019 that the District has a positive net migration, with 5,460 more people moving into the District than moving out. International migration has surpassed pre-pandemic levels, with a net gain of 6,969 people moving into the District – almost 150% more than in 2019. Domestic migration trends are also shifting, with a significant decline in people moving out of the District to other states.\nFor more information on this data release, visit the U.S. Census Bureau’s website. Additional demographic data about the District is available on DC Office of Planning’s Demographic Data hub at opdatahub.dc.gov.\nSocial Media:\nMayor Bowser Twitter: @MayorBowser\nMayor Bowser Instagram: @Mayor_Bowser\nMayor Bowser Facebook: facebook.com/MayorMurielBowser\nMayor Bowser YouTube: https://www.bit.ly/eomvideos"
    }
  ],
  "argos_summary": "President Trump inaccurately portrayed Washington D.C. as experiencing unprecedented violent crime rates during a recent announcement of federal intervention in the city. His claims about homicide statistics were challenged, revealing that while 2023 saw a spike in murders, the rates were not the highest in history and have since declined significantly in 2024. Additionally, juvenile crime statistics were misrepresented, as arrests of youths have decreased compared to previous years, contradicting the narrative of rampant youth crime.",
  "argos_id": "1ZUHM5HPT"
}