{
  "url": "https://www.slashgear.com/1934296/most-stolen-cars-by-us-state/",
  "authorsByline": "Mikael Trench",
  "articleId": "cc3447ca0ef04e608a70db06776e99c0",
  "source": {
    "domain": "slashgear.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://www.slashgear.com/img/gallery/these-are-the-states-with-the-most-car-thefts-in-the-us/l-intro-1754635512.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:15:00+00:00",
  "addDate": "2025-08-13T00:20:34.471632+00:00",
  "refreshDate": "2025-08-13T00:20:34.471634+00:00",
  "score": 1.0,
  "title": "These Are The States With The Most Car Thefts In The US",
  "description": "Car theft is far worse in some states than others, but these take the cake as the most dangerous.",
  "content": "These Are The States With The Most Car Thefts In The US\n\nFor many people, one of the biggest deciding factors when choosing where to live is how safe the area is. This not only applies to ourselves, our families, and our homes, but also to our cars. Depending on where you live, your vehicle and its contents might be at greater risk for theft. Elements such as population density, common models found within the area, and economic factors can all be contributors to how prone your city or state is to car theft. The good news is that a combination of sophisticated data tracking technology, increased efforts by law enforcement and car manufacturers, and knowledge of how to prevent car theft from occurring being more widespread have contributed to the lowest car theft rates in decades. In fact, the U.S. saw a steep decline in just one year, dropping from a peak of 1,020,729 in 2023 to 850,708 in 2024 according to stats from the National Insurance Crime Bureau. Even though every top-ranking car theft state has seen a crime decline, it doesn't change the fact that they are still higher risk areas than other parts of the country. Whether you're looking to visit one of these states, have been considering moving to one entirely, or are curious if your hometown makes the list, it pays to know what risks your ride faces.\n\nKicking things off is none other than the Silver State itself, Nevada. According to the National Insurance Crime Bureau, Nevada had a car theft rate of 394.42 per 100,000 people in 2024. While that's certainly not a statistic to sneeze at, Nevada has actually seen the most significant drop in car robberies of all the states on this list. Between 2023 and 2024, it went a rate of 572.70 to 394.42, a 31% decrease, second only to Washington state's slightly higher 32% drop. As with much of the country, Nevada saw a major uptick in car theft rates after the COVID-19 pandemic. In fact, Las Vegas alone saw a nearly 40% increase in car thefts within a two-year stretch between 2020 and 2022. These stats have been attributed to aspects such as the state's high population density and the viral Kia challenge on TikTok that resulted in widespread Kia theft in recent years. Despite not being as high as on the list as other states, Nevada sports higher annual insurance costs than anywhere else in the country with an average of $3,439 spent annually. Hopefully the state's theft rates will continue to decline and act as a positive indicator that such costs will go down alongside them.\n\nThe Southwestern state once ranked at the top of theft rates in the country, with 661.21 thefts for every 100,000 citizens reported in 2021. But Colorado is yet another state that has been moving in the right direction as far as car thefts go. As of this writing, that's thankfully gone down to a rate of 430.04 with a 26% decline in thefts between 2023 and 2024 alone. Many of the top stolen cars within Colorado have been average commercial vehicles and light trucks such as Chevrolet Silverados, Kia Optimas, Honda Accords, and Hyundai Elantra. As a result, many Colorado authorities have attributed these crimes to thieves intending to use the car for other purposes rather than finding value in the vehicle itself. Speaking with Fox 21 in April 2024, Colorado Auto Theft Prevention Authority Public Outreach Coordinator Cale Gould stated, \"Auto theft is not as much these days about, you know, stealing a car because the car's cool ... You don't see that 'Gone in 60 Seconds' model anymore. People don't steal cars because they want the car. They [steal cars] very literally to commit other crimes like drive-by shootings.\" Regardless of the reason, significant efforts have been made to cut down on car crimes, with positive results. Units such as Arapahoe County's Special Response Team and Denver's Auto Theft Team have employed advanced tactics and technology to aid in catching perpetrators and even recover stolen vehicles.\n\nWe're sticking in the Southwest for the next state on our list, New Mexico. Even though New Mexico's car theft rates have been going down, it hasn't yet fixed the problem enough. Whereas Nevada and Colorado have moved down on the 2024 list, New Mexico jumped from fourth to third place between 2021 and 2024 respectively. It currently possesses a theft rate of 458.24 for every 100,000 people. Many of the common car theft causes we've gone over also apply to much of New Mexico. However, some stolen cars have also been used to travel across the Mexican border, either for reselling the vehicle and its parts or for transporting contraband. Once again, average consumer cars such as the Hyundai Elantra, Nissan Altima, and Kia Optima are among the most targeted models according to reports. Although New Mexico authorities have taken steps to reduce the number of car thefts, they have yet to see the same aggressive stateside level of action that others have. The city of Albuquerque has perhaps seen the most substantial progress given its historically high theft rates. Officials have kept tighter tabs on arrested thieves and repeat offenders, with technology such as license readers and cameras being heavily employed for such purposes.\n\nIt's perhaps unsurprising to see California be near the top of such a list. Many of the state's major metropolitan areas such as Los Angeles, San Francisco, and Riverside rank among the most likely cities to experience car theft. It's another location that has moved up a spot in the overall ranking in recent years, with 463.21 thefts per 100,000 being recorded in 2024. It doesn't take a rocket scientist to figure what makes California such a hotspot for car thieves. Along with many of the same problems we've discussed before, the immense population density of certain cities and less secure parking options such as street parking being common across the state can also be seen as contributors to the problem. Given the expense of living in California, car theft can also be attributed to socioeconomic conditions as purchasing a car may be impractical for some. The severity of the problem seems to vary between different cities and counties, with San Jose authorities putting out a warning in April 2025 that criminals have begun to adopt technology that can override keyless ignition systems. Thankfully, it appears that things are taking a turn for the best as the California Highway Patrol announced that the state had seen a 13% decrease in car theft in 2024, with 85% of vehicles successfully recovered.\n\nWith a staggering car theft rate of 842.40 per 100,000 people in 2024, our nation's capital takes the cake for the most car thefts in the U.S., as if a high number of terrible drivers wasn't bad enough. While this most recent statistic is certainly an improvement over its 2023 rate of 1,149.71, it's still hard to ignore the disproportionate difference it presents when compared to any other state. In many ways, D.C.'s infrastructure makes it all too easy for thieves. Similar to many California cities, D.C.'s lack of secure parking lots means that residents and visitors are often forced to resort to street parking, leaving their vehicles prone to theft attempts. The city's layout also provides easy access to major highways which can allow criminals to more easily make a getaway. Combined with a general lack of ability to catch thieves on the city's part and increasingly sophisticated tactics to override anti-theft systems, it is easy to see how D.C. has become a hotspot for such chaos. The city has taken some unique steps to helping its citizens. Among these has been the distribution of Apple AirTags and sharing the MyFind information with law enforcement officials. The move has seen some controversy, as some see it as a step in the right direction while others worry if the use of AirTags will entice victims to take action in their own hands and track down thieves themselves, which could lead to even greater trouble.",
  "medium": "Article",
  "links": [
    "https://www.nicb.org/news/news-releases/vehicle-thefts-united-states-fell-17-2024",
    "https://www.slashgear.com/1536565/tips-prevent-car-from-being-stolen/",
    "https://www.fox21news.com/news/colorado-tops-the-list-nationally-for-car-theft/",
    "https://www.slashgear.com/1909335/cities-with-most-car-theft/",
    "https://www.slashgear.com/1883345/worst-drivers-us-state-according-to-insurance/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "car theft rates",
      "weight": 0.11861124
    },
    {
      "name": "car theft",
      "weight": 0.118370846
    },
    {
      "name": "car thefts",
      "weight": 0.118370846
    },
    {
      "name": "car thieves",
      "weight": 0.098708734
    },
    {
      "name": "car crimes",
      "weight": 0.09594146
    },
    {
      "name": "cars",
      "weight": 0.094397515
    },
    {
      "name": "theft rates",
      "weight": 0.09355819
    },
    {
      "name": "car manufacturers",
      "weight": 0.09119116
    },
    {
      "name": "car robberies",
      "weight": 0.09091604
    },
    {
      "name": "average consumer cars",
      "weight": 0.08598557
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.640625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.474853515625
    }
  ],
  "sentiment": {
    "positive": 0.03305397,
    "negative": 0.8925123,
    "neutral": 0.07443375
  },
  "summary": "The list includes the states with the highest car theft rate in the US, Nevada, Colorado, and New Mexico, with the lowest car theft rates in decades. Factors such as population density, common models, and economic factors can determine the risk of car theft. The National Insurance Crime Bureau has reported that the U.S. saw a significant decline in car thefts in just one year, dropping from a peak of 1,020,729 in 2023 to 850,708 in 2024. However, while these states have seen a decrease in crime, they are still higher risk areas than other parts of the country. Nevada saw the most significant drop in car robberies of all the states on this list, with a car theft level of 394.42 per 100,000 people in 2024, a 31% decrease, second only to Washington state's 32%. Despite this, Nevada has higher annual insurance costs than any other state and has seen a 26% decline in thefts between 2023 and 2024 alone. New Mexico's theft rates have also dropped significantly, but efforts have been made to reduce these crimes. The most common car theft model is the Hyundai Elantra, which is often used for transporting parts or transporting contraband or transporting goods across the border.",
  "shortSummary": "The US states of Nevada, Colorado, New Mexico, and New Mexico have the highest car theft rates, though overall crime rates remain relatively low, driven by advanced technology and economic factors.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "99a34bcbeaa341809971a4a09ff0b023",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.slashgear.com/1909335/cities-with-most-car-theft/",
      "text": "These Are The Cities (CBSA) With Most Car Theft In The US\nCar theft is an unfortunate reality of the world in which we live. While authorities usually recover nearly half of all stolen vehicles within a couple of days, that still doesn't diminish how unpleasant it can be. Nor does it make up for how pervasive the problem is across the U.S. According to the National Insurance Crime Bureau's (NICB) data, thieves stole just over 3.5 million vehicles nationwide from 2020 to 2024. On a positive note, there was a significant 17% reduction nationwide from 2023 to 2024, which is great. However, that still leaves the country with 850,708 thefts, with a handful of metro areas proving to be notable hot spots. You're probably expecting Los Angeles and San Francisco to be among those, and you'd be right, but what other cities rank highly for car thefts?\nWe've compiled a list of the core-based statistical areas (CBSAs) that had the most reported car thefts in 2024, based on data provided to us by the NICB. Note that we're not implying anything about the safety or quality of life in these cities. This is purely about the total number of vehicle thefts — nothing more, nothing less. We'll also discuss theft rates (i.e., thefts per 100,000 inhabitants), but that metric hasn't impacted how we sorted the cities. Is your city on the list? Only one way to find out.\nAtlanta, Georgia\nThe first CBSA of this baker's dozen of criminality is the Atlanta-Sandy Springs-Roswell metro area, which is the state of Georgia's only representation here. As will become a trend across all the following CBSAs, the Atlanta area recorded a pleasing 20% drop in thefts between 2023 and 2024, with 2024's 15,894 thefts a significant decrease from the 19,815 that the NICB recorded for 2023. Thefts in the Atlanta CBSA accounted for about 67% of the 23,495 recorded in the entire state — 750 of which were Hyundai Elantras, the most-stolen vehicle nationwide in 2024.\nResidents — or anyone who has a soft spot for Atlanta — can find some extra solace in the fact that it also has one of the lowest theft rates of the cities on this list. Its population of around 6.4 million makes for just 252 thefts per 100,000 people. This gives it the honor of being one of only two cities on this list with a theft rate of around 250, and one of three below 300.\nMiami, Florida\nDespite being one of the most populated states in the U.S., with an estimated 23.37 million inhabitants as of 2024, Florida only has one CBSA that makes it onto this list, the Miami-Fort Lauderdale-West Palm Beach CBSA. It's roughly 6.4 million inhabitants suffered 16,317 thefts in 2024, with 8,530 of those occurring in Miami-Dade County proper. Both CBSA and county-level thefts saw major drops from 2023, though, with 18% and 20% drops from 20,014 and 10,627 thefts, respectively. Things are definitely looking up for the Sunshine State in terms of vehicle thefts, at least.\nThe combination of a large population on a CBSA level and its 12th place in terms of total theft volume means that the theft rate in Miami is also quite low. It's one of the three cities with fewer than 300 thefts per 100,000 people, although its theft rate of 263.89 per NICB data means it can't quite join the 250-and-below club. And if you were wondering what the most-stolen car in Florida was in 2024, it was — surprise, surprise — the Hyundai Elantra.\nDenver, Colorado\nWe continue with single-entry states and move into the Rocky Mountains city of Denver, Colorado. Even though the Denver CBSA is one of the least-populated ones on our list, with a hair over 3 million inhabitants as of 2024, the city's vehicle thieves stole 17,984 vehicles in 2024, with many of those likely being the ever-popular Hyundai Elantra. On the plus side, that number represents a massive 27% reduction from 2023, when 24,711 cars were stolen. That makes Denver the second-most-improved city on this list in terms of theft volume.\nThe small population means that the theft rate isn't quite so great, though. At 598.44 thefts per 100,000 Denverites, the city is well into the top 10 nationwide, coming in at 7th if we go by theft rate. But even that is a huge improvement over the numbers in the early 2020s. According to the NICB, the Denver CBSA had a staggering theft rate of 964.92 in 2021, giving it the dubious honor of the second-worst theft rate nationwide after Bakersfield, California. So while it's still not great, it's certainly way better.\nRiverside, California\nThe Riverside metro area is the first of three Californian cities on this list, an honor that the Golden State shares with no other (at least, as far as the confines of our list go). But Riverside can't hold a candle to the other two Californian cities, both of which you won't read about for quite a while. But let's not get ahead of ourselves here. The NICB recorded 18,548 vehicle thefts in 2024, with 8,075 recorded in Riverside County — a cool 25% drop from the 10,836 of 2023.\nWith a population of 4.7 million as of 2024, that makes for a not-terrible, but not-great theft rate of 395.64 stolen vehicles per 100,000 people. That makes Riverside one of the 25 most theft-prone CBSAs in the country, although its 24th place means it's still a ways away from many other major cities in California. Riverside also offers the first departure from the trend of Hyundai Elantras being the most-stolen vehicle, but what takes its place may surprise you: Despite all the state's eco-friendly connotations, not least thanks to its now-repealed EV mandate, thieves made away with more Chevrolet Silverado 1500s than any other vehicle in California, undoubtedly helping it earn the dubious accolade of the most-stolen pickup in the U.S.\nPhiladelphia, Pennsylvania\nIt's time to go cross-country, switching from the sunny climes of the West Coast to the northeastern U.S. for a one-two punch of theft-prone CBSAs. The first is the border-crossing Philadelphia-Camden-Wilmington urban area, which, according to the NICB's numbers, saw 18,873 cars stolen in 2024, with 12,166 of those reported thefts occurring in Philadelphia County. Both the Philly CBSA and county follow the nationwide trend, with similar drops of 20% and 23%, respectively, from the previous year's numbers. For the record, those numbers stood at 23,591 and 15,845 in 2023.\nThe Delaware Valley's population of 6.3 million makes for a middling theft rate of 302.15 stolen vehicles per 100,000, placing it at the lower end of the scale for this list. It also means that Philly is well outside of the top 50 nationwide — it's 61st, if you're wondering — which is an honor that few of the metro areas on our list have.\nWashington, D.C.\nWe'll stay in the northeast for a while and move just a tiny bit westward from Philly to cover the Washington-Arlington-Alexandria CBSA. The Washington metropolitan area isn't just geographically close to the previous entrant on our list. The numbers are also remarkably similar, with barely anything to split the two.\nAccording to the NICB, 2024 saw 19,933 vehicle thefts in the Washington metro, just over 1,000 more than in Philly. Even the reduction in incidents from 2023 mirrors that of its neighbouring metro, with a drop from 24,312, making for an 18% decrease. It's worth noting that this is the last city to record fewer than 20,000 incidents in 2024, so that's perhaps something to be proud of if you happen to hail from this part of the U.S. Even though the two cities have a similar population, with roughly 6.4 million inhabitants each, the slight uptick in thefts makes for 316.15 stolen vehicles per 100,000 people, according to the NICB's calculations. Fun (or not so fun) fact: Washington, D.C., also has some of the worst drivers in the country, according to insurers.\nSeattle, Washington\nFrom Washington, D.C., we cross the nation to Washington state and the Seattle metropolitan area. It's the first of these to break past 20,000 thefts in 2024, with 21,335 per the NICB data. But while that's not necessarily the best look, it's a huge change from 2023, during which 31,499 cars were liberated, so to speak, from their owners. Yes, you read right: Seattle car owners suffered 10,000 fewer thefts from one year to the next, making for a 32% decrease — good enough for a most improved award, were we giving any awards away for this particular list.\nKing County did very well, too, with a 25% decrease from 19,353 to 14,455 thefts. Unfortunately, while a 32% drop in total thefts is a great result no matter how you cut it, the theft rate is still quite problematic at 527.46 thefts for every 100,000 people in the Seattle-Tacoma-Belleveue area. That puts it in eighth place nationwide and is still well ahead of the 465.11 thefts that the NICB recorded there in 2020. That's somewhat troubling, especially considering that the estimated population has increased slightly to 4.14 million in 2024, up from around 4.02 million in 2020.\nChicago, Illinois\nThere are four CBSAs with between 20,000 and 30,000 thefts in 2024, but the next three occupy the total opposite end of that spectrum from the Seattle metro. The Chicago-Naperville-Elgin CBSA is the first of the three, with its 29,202 total thefts putting it closer to the city in second place than the city immediately before it in our reverse ranking. Now, to be fair, that's still a decent 20% drop from the 36,422 in 2023, but it's still not all that great compared to all the metros that have come before it.\nOn the plus side, the 9.4 million Americans who call the Chicago metro area home means that it has a relatively low theft rate that bests all but one of the cities coming up. A rate of 315.26 thefts per 100,000 puts it in 53rd nationwide, which really isn't all that bad, especially once you see how the next handful of cities fare in both metrics.\nDallas-Fort Worth, Texas\nWe come to the first of two Texas metro areas to sport a disturbingly high number of thefts. The Dallas-Fort Worth-Arlington nexus is the first of the two, with its 29,340 thefts in 2024 earning it a place in the top five and putting it quite close to its neighboring metro area to the south, which is coming up right after this.\nThe NICB's data shows 362.22 thefts per 100,000 people in Dallas. The rate remains high, but low enough to keep it well out of the top 30 nationwide, likely benefiting from the extra half million or so Texans that call the Dallas-Fort Worth metro area home compared to the other Texas CBSA on this list. And while we're loath to parrot hackneyed clichés about those from the South, it's worth noting that the most-stolen vehicles in Texas were pickups. Thieves stole 6,453 Chevolet Silverado 1500s — possibly including some examples of the highly-rated Silverado 1500 ZR2 — from their owners in 2024, with 4,073 GMC Sierra 1500s suffering the same fate.\nHouston, Texas\nThe final CBSA on this list to record fewer than 30,000 car thefts in 2024 is the Houston-Pasadena-Woodlands metro area, which just squeaked under that threshold with 29,689 thefts — a 16% reduction from 2023's 35,414 thefts, and nearly identical to the DFW area's 15% drop. Harris County, which counts Houston as one of the cities within its jurisdiction, contributed the vast majority of those nearly 30,000 thefts.\nNICB data reveals that 25,888 of the thefts in the Houston CBSA occurred in Harris County, making it the U.S. county with the second-highest number of thefts by total volume. And that's with a matching 16% drop in county-level thefts between 2023 and 2024, too. The situation isn't quite as grim if we turn to the theft rate, however, although if it's not exactly great, either. According to the NICB, the Houston CBSA recorded 395.31 thefts per 100,000 inhabitants in 2024, which isn't the worst but enough to put it in the top 25 nationwide — and near the top of our particular list, too.\nNew York, New York\nThe top three CBSAs with the most thefts are all coastal cities, with third place going to the Big Apple and its environs. The New York-Newark-New Jersey CBSA is the first of three to record more than 30,000 car thefts in 2024, with the area's thieves stealing 30,181 vehicles over those 12 months. Interestingly, thieves in this corner of the northeast seemed to prefer Hondas more than those in other states, with the Honda CR-V coming top in New York and the ever-present Honda Accord leading the charts in New Jersey.\nAs was the trend nationwide, fewer cars were stolen in New York in 2024 than in 2023, although the 11% reduction from 33,828 makes it one of the least-improved metropolitan areas on our list. But fewer thefts are fewer thefts, and we're sure car owners in New York and New Jersey will appreciate it nonetheless. It's worth noting that the N.Y. area's 30,000 thefts occurred in an area with just under 20 million inhabitants, making for a theft rate that's by far the lowest on our list at just 154.79 thefts per 100,000 inhabitants. But that's to be expected, considering how few New Yorkers own vehicles: According to The City University of New York's Hunter College Urban Policy and Planning, New Yorkers only have 0.62 vehicles per household, compared to 1.63 in LA and 1.79 nationwide.\nSan Francisco, California\nThe top two cities with the most theft are both in California, which probably shouldn't surprise you, given how California's nearly 39.5 million inhabitants (as of 2024) make it the most populous state in the U.S. Coming just behind the top entry is the San Francisco-Oakland-Fremont CBSA. The San Fran CBSA has the second-highest number of car thefts in 2024 by volume, with 34,876.\nHowever, that doesn't tell the whole story. The San Francisco CBSA had just over 4.6 million inhabitants in 2024, significantly less than many other metro areas on this list. What this means, then, is that the San Francisco-Oakland-Fremont conurbation has the worst theft rate in the country at 763.33 stolen cars per 100,000 inhabitants. In even worse news for those living in this section of the Bay Area, things have deteriorated over the past few years. NICB data from 2021 shows that the San Francisco-Oakland-Berkeley CBSA had a theft rate of 675.86. So, while the outright numbers have gone down, the theft rate hasn't gotten any better. Might want to pay attention to those tips to prevent your car from being stolen if you're around San Francisco.\nLos Angeles, California\nAt just under 13 million residents at the end of 2024, it's probably not a shock to see the Los Angeles CBSA at the top of our list. The population may also explain why traffic is so bad in the city, but we'll leave that for another time. What you may not have expected, though, is just how far ahead the Los Angeles-Long Beach-Anaheim metro area is of the rest of the pack.\nAccording to the NICB's data, 66,565 thefts were recorded in this CBSA for 2024. Sure, that's an okay reduction from 2023's 73,142 thefts, but it still leaves LA with nearly double that of the next-closest metro area. It's also only a 9% drop, which is the worst of all the metro areas listed. Of these, the vast majority occurred in Los Angeles County proper, with the NICB recording 59,058 thefts — again, not that shocking given that nearly 10 million people call LA County home. The theft rate isn't great, either, with 520.08 car thefts per 100,000 people. That's enough to put it in ninth place nationwide, which is quite surprising considering how many people live there.\nInterestingly, the LA CBSA didn't even crack the top 10 for theft rate in 2021 according to the NICB, showing that there's been a definite shift in theft demographics over the past few years. All in all, our top two show that California isn't just one of the most expensive states in which to own a car, but it may also be one of the riskiest if you're worried about theft.\nOur methodology\nWe based this list entirely on data provided to us by the National Insurance Crime Bureau. At the time of writing, the association has not released its full findings for 2024, with only a report highlighting the significant drop in vehicle thefts from 2023 to 2024 available for public consumption. But the NICB gathered more data than that report reveals, including thefts (both total thefts and theft rate) for CBSAs and counties, both of which we relied on extensively here. We sourced all population estimates from the United States Census Bureau's data, with CBSA specifics coming from the metropolitan and micropolitan statistical area population totals it released in March 2025.\nIt's worth reiterating that our list ranks U.S. metropolitan areas by total number of vehicle thefts, not the theft rate. We acknowledge that theft rates may be more representative of the risk of getting one's car stolen (it's certainly the metric that the NICB itself prefers to highlight in its press releases), but our focus is on the cities with the most thefts outright, not the ones that pose the highest risk to car owners — even if that means our selection is skewed slightly toward those metropolitan areas with a large number of inhabitants."
    },
    {
      "url": "https://www.slashgear.com/1536565/tips-prevent-car-from-being-stolen/",
      "text": "5 Tips To Prevent Your Car From Being Stolen\nIn 2023, the National Insurance Crime Bureau (NICB) sounded the alarm on the rising incidence of car theft in the United States. Citing that over a million Americans became victims of car theft in 2022 alone, the NICB cautions that this is the first time it has happened in over a decade. In fact, the NICB also shared that the state of Illinois even experienced a whopping 35% increase in reports in the same year.\nDespite car manufacturers always trying to innovate new features designed to improve our driving experience, including ones to keep us safe, there will always be bad actors who will try to exploit them. For example, reports of thieves using side headlights to access a car's Controller Area Network (CAN) came about in 2023. The CAN controls several modern electronic car features, like parking assist, self-diagnostics, and, of course, the important feature of being able to unlock your vehicle.\nBecause most of the stolen motor vehicles in America are composed of passenger vehicles, it's only natural that car owners are racking their brains about all the ways that they can keep their cars safe. Unfortunately, whether it is due to the ease of hot wiring, how hot the demand is in the resale market, or how expensive its parts are, some cars are just more likely to get stolen than others. So, if you own a car model that thieves like to target, here are some tips that you can follow to keep it from going missing.\nLock doors and secure windows\nOne of the most straightforward ways to prevent your car from being stolen is to lock your doors. Locking doors should be a standard safety practice for everyone from the moment you enter your car to when you leave.\nWhile some cars will have a feature that automatically locks doors, including apps to support it, it's still a good idea to make it a habit to check regularly. After all, you may own several cars, including some that don't have this feature. By leaving car doors unlocked, you not only put your car at risk of being stolen but also put your life in danger when driving.\nAside from doors, another potential entry point that thieves can use to enter your car is your windows. Although some of us may appreciate fresh air during a road trip, it can be easy to forget to close it when you're back in dense areas like the city, where crime is more likely to happen.\nThese days, there are many tools that thieves can use to break car windows, such as claw hammers. However, breaking your windows can be easier if there is already an existing crack that is affecting its structural integrity. So, while it's possible to use super glue on cracked windshields, this should only be a temporary fix, and it's still recommended to go to an auto glass specialist to repair it properly to avoid trouble.\nMind your keys\nIt is also a good idea to make sure that you never leave your car key in the ignition, even if you're only planning to step out for a short period. After all, it only takes a few seconds for a potential car thief to jump into your vehicle, start the engine, and drive away. Because of this, it's recommended to turn your car off completely and always bring your keys with you when you need to step out of your vehicle.\nIf you do find your car keys stuck in the ignition, it's likely just an issue with the car settings. So, if you're having trouble removing it, check if your selector is in park mode, the ignition is turned off all the way, or if the steering wheel is properly set at the center. Drivers of cars with automatic transmissions can also try to jiggle the gear selector or their keys; just make sure to do it gently to avoid accidentally damaging the keys or the car.\nAlthough the average person probably won't be able to unlock your car with a similar remote, it may be possible for enterprising thieves who may have acquired black market technology to do so. Unfortunately, with the rise of digital car keys, so do the potential risks that come with them.\nPark strategically\nWhen possible, always opt for closed garages or paid parking areas where there are attendants. In addition, parking in a well-lighted area always beats parking in dark or dim areas. Should there be no paid parking garages near you, the next place you should aim to park is near businesses that store high-value items, like banks, that will likely have security cameras in constant operation. Alternatively, some buildings will have 24/7 security, who you may be able to refer to as a witness.\nAside from where you park your car, when you park can also impact the likelihood of car theft. In an analysis of FBI data, Value Penguin shares that the hour after midnight is when the most number of motor vehicle thefts occur. However, it's important to note that the number of thefts drops significantly after 1 a.m., and almost a quarter of motor vehicle thefts occur in the p.m. hours.\nIf you suspect your home parking is at risk, there are also ways to introduce deterrents inside your garage. For example, you can install garage alarm systems and camera systems or even remove the garage door, so they will need another remote to open it. Lastly, if you own an expensive classic car that you don't take out that often, you can take it to another level by blocking your car's path with objects or removing a few things from under your car's hood to make sure it doesn't start properly.\nHide your valuables\nIn some cases, what's in your car can be just as valuable as the car itself. For many of us who use our cars daily, we can sometimes leave things like expensive gadgets, bags, or shoes in the car. Unfortunately, while insurance companies tend to cover any damages to your car during a break-in, they will likely not cover the value of the items stolen inside of it.\nWhile it should be a general practice not to leave expensive things unattended, even inside your own vehicle, there are times when it can't be prevented. If you do find yourself having to leave valuables in your car, you should at least make an effort to hide them skillfully.\nFor example, instead of just leaving your bag out in the open on top of a car seat, you can store it in the trunk of your car, behind cleaning materials, or other unassuming objects. You can even tuck thin items, like laptops or tablets, under the seat, where thieves can't see them easily.\nFor smaller items, you can also buy storage options designed specifically to conceal. Typically, these come in the form of soda cans, sunblock containers, water bottles, or other ordinary-looking, everyday items with hidden compartments.\nInvest in anti-car theft devices\nIf you live in an area prone to theft, it might make sense to rely not just on your various strategies but also invest in actual anti-car theft devices. For example, the rise in TikTok-fueled car thefts led car manufacturers Hyundai and Kia to offer free steering wheel locks for car owners who own the affected models in 2023.\nAt the time, the targeted cars were 20 times more likely to be stolen, so aside from the steering wheel locks, the manufacturers also introduced software updates as well as window stickers informing thieves that their cars had additional anti-theft mechanisms.\nDepending on how often you use your car or where it is usually stored, you can also invest in brake pedal locks, remote battery kill switches, and wheel clamps. Not to mention, having a dashboard camera or dash cam can also put off potential thieves, especially if their goal is simply to take things from inside the car.\nAside from this, you may also want to include a GPS tracker in your list, which you can use to increase the chances of retrieving your car in the event that it's stolen. Alternatively, the NYPD has also recommended that drivers put AirTags in their cars, sharing that it can be a useful tool for car theft investigations."
    },
    {
      "url": "https://www.slashgear.com/1883345/worst-drivers-us-state-according-to-insurance/",
      "text": "This Is The US State With The Worst Drivers, According To Insurance Researchers\nIt's not uncommon to get behind the wheel and feel like nobody around you has any idea what they are doing. Whether it be failing to use signals or gunning it through an intersection before the light turns from yellow to red, there is no shortage of ways that drivers can make others on the road feel unsafe. It's enough to make one think that the people around them must be the worst drivers in the country. Of course, that can't be possible everywhere. One state has to have the worst drivers in the U.S.\nAfter poring through a year's worth of data, lending marketplace LendingTree found that Massachusetts has the worst drivers in the country. It determined this by examining driving incidents — anything from a speeding ticket to something as drastic as a DUI — in each state between November 5, 2023, and November 4, 2024. LendingTree found that there were 61.1 incidents per 1,000 drivers in Massachusetts. The biggest reason it ranks at the top is car crashes: 44.4 of those 61.1 incidents are traffic accidents, which is nearly five more incidents per 1,000 drivers than the second-most accident-prone state.\nInsurance rates tend to spike in states with a lot of accidents, but that doesn't necessarily mean Massachusetts has the highest insurance prices. LendingTree estimates that the cost of insuring a car with any of the major car insurance companies in Massachusetts is the 13th-lowest in the country. So, a collective of bad drivers doesn't necessarily spell high premiums.\nThe east coast has a lot of issues\nEast coast states make up the majority of the top five states with the worst drivers, with Rhode Island, Washington D.C., and New Jersey joining Massachusetts at the top of the list. Rhode Island is very close to having as many incidents as Massachusetts, with 60.7 per 1,000 drivers, while D.C. and New Jersey have 54.6 and 45.8 incidents, respectively.\nThe primary reason for these states' high ranking is automobile accidents. After all, these are all small, densely populated states. When you are piled on top of each other like that, you are just bound to have more collisions. Washington D.C. and New Jersey also rank among the top five states in terms of DUI rates, with D.C. taking the top spot with 3.6 per 1,000 drivers. Despite these states being high on the list, Rhode Island and New Jersey are the only states that rank among the top ten highest insurance premiums per state, landing at sixth and 10th, respectively.\nCalifornia rounds out the top five states with the worst drivers, coming in at number three with 55 incidents per 1,000 drivers. Considering that California is the most populous state in the country, with over 39 million people, its high place makes a lot of sense. It's tied with Rhode Island for the most accidents per 1,000 drivers with 39.7, and comes in just behind D.C. with regards to DUIs, at 3.5 incidents. However, California's insurance premiums aren't too crazy, being the 30th most expensive on average, according to LendingTree. Of course, that doesn't mean car insurance in California is cheap, though."
    }
  ],
  "argos_summary": "The article discusses the states and cities in the U.S. with the highest car theft rates, highlighting a significant decline in thefts nationwide from 2023 to 2024. Nevada, Colorado, and New Mexico are among the states with notable theft rates, while Washington D.C. has the highest rate at 842.40 per 100,000 people. Major cities like Los Angeles and San Francisco lead in total thefts, with Los Angeles recording 66,565 thefts in 2024. The article also emphasizes the importance of vehicle security measures and provides tips for preventing car theft.",
  "argos_id": "23TUCMF36"
}