{
  "url": "https://www.yahoo.com/news/articles/christian-groups-arkansas-lawmakers-defend-225345205.html",
  "authorsByline": "Sonny Albarado",
  "articleId": "c041fd6ab3d84727baabf336538f4ba2",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/8df562a81385f6e73e4bf2f3adffb268ecc43e3ee19ad45095a93d72707f3259/ynews/resizefill_w1200/https://media.zenfs.com/en/arkansas_advocate_articles_351/a17ff0081748fdb6a69cfa000cff76a6",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:53:45+00:00",
  "addDate": "2025-08-12T23:27:54.165473+00:00",
  "refreshDate": "2025-08-12T23:27:54.165475+00:00",
  "score": 1.0,
  "title": "Christian groups, Arkansas lawmakers defend Ten Commandments law",
  "description": "Backers of Arkansas’ law requiring public display of the Christian commandments asserted Tuesday that the law is constitutional and based on historical tradition rather than religion. A federal judge in Fayetteville on Aug. 4 temporarily blocked enforcement of Act 573 of 2025 in a lawsuit brought by parents of public schoolchildren in Northwest Arkansas school […]",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nFirst Liberty Senior Counsel Jeremy Dys (left) speaks about Arkansas' Ten Commandments law as the law's lead sponsors Sen. Jim Dotson (center) and Rep. Alyssa Brown listen. Behind them are Rep. Harlan Breaux and Sen. Dan Sullivan. (Photo by Sonny Albarado/Arkansas Advocate)\n\nBackers of Arkansas’ law requiring public display of the Christian commandments asserted Tuesday that the law is constitutional and based on historical tradition rather than religion.\n\nA federal judge in Fayetteville on Aug. 4 temporarily blocked enforcement of Act 573 of 2025 in a lawsuit brought by parents of public schoolchildren in Northwest Arkansas school districts. The ruling affects only Fayetteville, Springdale, Bentonville and Siloam Springs schools.\n\nPine Bluff schools put up posters of the Decalogue donated by local ministers on Aug. 5, the day the law took effect, The Pine Bluff Commercial reported. The website of RestoreAmericanSchools, a group that supplies Ten Commandment posters for schools, says 288 Arkansas schools have been “adopted” by donors.\n\nAt a press conference in the state Capitol’s Old Supreme Court room Tuesday, the law’s principal sponsors — Sen. Jim Dotson, R-Bentonville, and Rep. Alyssa Brown, R-Heber Springs — told a small gathering that Act 573 remains in effect elsewhere in Arkansas. They and other speakers encouraged people to donate to a campaign to place posters of the Ten Commandments in public schools and buildings.\n\n“You cannot separate the history of our nation and the founding of our laws and justice system from the Ten Commandments,” Brown said. “We stand behind this law and believe it will be upheld in a higher court.”\n\nSUPPORT: YOU MAKE OUR WORK POSSIBLE\n\nOther speakers Tuesday repeated the message that the Ten Commandments traditionally have been displayed in public spaces and schools and that only since the 1980s have U.S. Supreme Court rulings chipped away at that tradition.\n\nDavid Barton, a Texas political activist and founder of the conservative Christian organization Wallbuilders, said a 2019 Supreme Court ruling changed the criteria for determining whether Christian symbols and monuments violated the Constitution. In that case, Barton said, the high court shifted to presuming constitutionality if it could be shown to be historical and traditional.\n\nJeremy Dys, senior counsel with religious freedom legal group First Liberty Institute, also talked about the 2019 high court ruling, saying “the burden of proof now rests” upon those who want to take down public displays of religious symbols to show how the memorials and monuments are “out of step … with American history, with our traditions as a country.”\n\nDys said the Aug. 4 decision by U.S. District Judge Timothy Brooks was “exactly backwards from what the Supreme Court said in the American Legion case.”\n\nBrooks’ ruling noted that Arkansas’ law is “most likely … [a] part of a coordinated strategy among several states to inject Christian religious doctrine into public-school classrooms. These states view the past decade of rulings by the Supreme Court on religious displays in public spaces as a signal that the Court would be open to revisiting its precedent on religious displays in the public-school context.”\n\nBut, Brooks said, the Supreme Court 45 years ago struck down a state law nearly identical to Arkansas’ law. That precedent remains binding, he wrote, until the Supreme Court “puts its foot down.”\n\nEducation news outlet The 74 reported last month that a data analysis of 28 bills similar to Arkansas’ law “exposes how their language, structure and requirements are inherently identical. In dozens of instances, they match model legislation pitched by Barton verbatim.”\n\nAt Tuesday’s press conference, Patriot Mobile CEO Glenn Story presented a framed copy of a Ten Commandments poster to Secretary of State Cole Jester. Patriot Mobile describes itself as a Christian conservative wireless provider and was one of about 20 organizations whose logos were displayed with Ten Commandments posters at the press conference.\n\nSUBSCRIBE: GET THE MORNING HEADLINES DELIVERED TO YOUR INBOX",
  "medium": "Article",
  "links": [
    "https://patriotmobile.com/",
    "https://firstliberty.org/",
    "https://www.the74million.org/article/state-laws-requiring-ten-commandments-in-schools-are-the-product-of-a-far-right-bill-mill/",
    "https://arkleg.state.ar.us/Bills/Detail?id=SB433&ddBienniumSession=2025%2F2025R",
    "https://www.pbcommercial.com/news/2025/aug/05/pastors-on-patrol-post-ten-commandments-amid-act/",
    "https://www.npr.org/2019/06/20/731824045/supreme-court-cross-can-stand-on-public-land-in-separation-of-church-and-state-c",
    "https://www.yahoo.com/news/articles/court-blocks-arkansas-law-requiring-023739626.html",
    "https://www.supremecourt.gov/opinions/18pdf/17-1717_4f14.pdf",
    "https://wallbuilders.com/",
    "https://arkansasadvocate.com/donate",
    "https://arkansasadvocate.com/subscribe"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ten Commandments law",
      "weight": 0.09958979
    },
    {
      "name": "Ten Commandments posters",
      "weight": 0.08568817
    },
    {
      "name": "U.S. Supreme Court rulings",
      "weight": 0.085443534
    },
    {
      "name": "Ten Commandments",
      "weight": 0.08125153
    },
    {
      "name": "Supreme Court",
      "weight": 0.08098
    },
    {
      "name": "U.S. Supreme Court",
      "weight": 0.080246165
    },
    {
      "name": "public schools",
      "weight": 0.0800675
    },
    {
      "name": "Old Supreme Court",
      "weight": 0.077702396
    },
    {
      "name": "Northwest Arkansas school districts",
      "weight": 0.07612037
    },
    {
      "name": "Ten Commandment posters",
      "weight": 0.07206664
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.96044921875
    },
    {
      "name": "/Law & Government/Government/Legislative Branch",
      "score": 0.9326171875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.93017578125
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.873046875
    },
    {
      "name": "/News/Local News",
      "score": 0.443603515625
    }
  ],
  "sentiment": {
    "positive": 0.15009566,
    "negative": 0.45839348,
    "neutral": 0.3915108
  },
  "summary": "Yahoo is using AI to generate takeaways from this article, which may not always match what's in the article but helps improve the user's experience. The law, which requires public display of the Christian commandments, was temporarily blocked by a federal judge in Fayetteville on Aug. 4 in response to a lawsuit brought by parents of public schoolchildren in Northwest Arkansas school districts. Supporters of the law, including Sen. Jim Dotson, Rep. Alyssa Brown, and Rep. Harlan Breaux, and Sen. Dan Sullivan, defended the law in a press conference, arguing that it is constitutional and based on historical tradition rather than religion. A Texas political activist and founder of the conservative Christian organization Wallbuilders said a 2019 Supreme Court ruling changed the criteria for determining whether Christian symbols and monuments violated the Constitution, shifting to presuming constitutionality if it could be shown to be historical and traditional.",
  "shortSummary": "Yahoo's AI generates inconsistent takeaways from its AI-based takeaways, while Arkansas lawmakers defend the Ten Commandments law, arguing it is constitutional and based on historical tradition.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d8549f4891c04fb2a8c743385535a3a5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.the74million.org/article/state-laws-requiring-ten-commandments-in-schools-are-the-product-of-a-far-right-bill-mill/",
      "text": "Political operative David Barton held up a thick Bible with years of wear on its dark brown cover and proclaimed its pages put Protestant Christianity at the center of the country’s very foundation.\n“This is actually printed by the official printer of Congress,” said Barton, a best-selling author and influential far-right Christian nationalist. Barton has spent the last 40 years arguing that the separation of church and state is a myth — and has built a multimillion-dollar media and lobbying operation to influence public opinion and shape laws around the belief that the United States was founded as a Judeo-Christian nation.\nAt this particular hearing in April, Barton appeared before the Texas House education committee and testified in favor of legislation, since signed into law, requiring that posters of the Ten Commandments be placed inside every classroom in the state’s nearly 9,100 public schools by September. With him, Barton brought a small collection of books he claims were foundational to the country’s public education system until the 20th Century.\nBarton isn’t just a primary pitchman for the Ten Commandments law in Texas, his home state, an investigation by The 74 reveals. His fingerprints appear on 28 bills that have cropped up before the legislatures in 18 states this year. A data analysis of the bills exposes how their language, structure and requirements are inherently identical. In dozens of instances, they match model legislation pitched by Barton verbatim.\nAt the Texas hearing, Barton’s eyes fixated on the cover of the rare 1782 Aitken Bible.\n“It also says it’s ‘a neat Edition of the Holy Scriptures for the use of schools,’” he continued. “It has the Ten Commandments.”\nIn actuality, Barton lifted language from Philadelphia printer Robert Aitken calling on Congress to sanction a Bible that could also be for “the use of schools.” Christian nationalists have for years falsely claimed the Revolutionary-era printing includes a government promotion of Christianity. Barton has long been accused of taking historical quotes out of context, and in 2012, the Christian publisher of his bestselling book on Thomas Jefferson ceased its production because “basic truths just were not there.”\nTexas is one of three states in the last two years to pass a law requiring that the Ten Commandments be posted in public schools. The mandates are part of a coordinated nationwide effort to overturn a 1980 Supreme Court ruling forbidding Kentucky from requiring Ten Commandments displays in classrooms.\nAs the influence of Barton and the burgeoning Christian nationalist movement find favor in state legislatures, the White House and with U.S. House Speaker Mike Johnson — who cites Barton as a “profound influence” — the lobbyists and lawmakers behind the state Ten Commandments bills told The 74 they’re confident the current Supreme Court’s conservative super-majority is on their side, too.\nThe analysis by The 74 reveals how language in virtually every state bill matches model legislation created by Project Blitz, a Barton-steered Christian “bill mill” that’s long flooded statehouses with legislative templates that promote Christianity in public schools, legalize discrimination against LGBTQ+ people and restrict abortion.\nA dozen bills specify, for example, that the Ten Commandments displays must be hung in a “conspicuous” location. Another 11 specify they should be at least 11-by-14 inches in size. Nearly all of the bills — 25 — mandate a Christian version of the religious and ethical directives be displayed as a “poster or framed.” The 74 tallied 96 instances where bills introduced this year match Project Blitz’s model legislation, including template bills to require the Ten Commandments or the phrase “In God We Trust” in public schools.\nAmong the architects of Project Blitz is the Barton-founded influence machine, WallBuilders. The flurry of state bills were introduced after WallBuilders — the name is an Old Testament reference to rebuilding the walls of Jerusalem — convened its annual national conference of state legislators in November where the model legislation was promoted.\nAfter Louisiana passed its first-in-the-nation Ten Commandments law last year, new mandates approved in Arkansas and Texas this year follow the same Project Blitz template.\n‘No such thing as separation of God and government’\nTexas state Sen. Mayes Middleton is the joint author of the state’s new Ten Commandments law and the author of another new law permitting a daily prayer period and Bible readings in public schools statewide. Republican Gov. Greg Abbott signed both in June.\nMiddleton, whose district southeast of Houston includes his hometown of Galveston, acknowledged Barton’s influence over not just his own legislative agenda, but Texas’ broader conservative movement. Barton previously served as vice chair of the state Republican Party.\n“Of course, WallBuilders is very supportive of the bill,” Middleton told The 74, as were the conservative legal groups Alliance Defending Freedom and the First Liberty Institute. “And, of course, all of their missions is to advance religious liberties, especially in the public realm where there is no such thing as separation of God and government.”\nFounded by Barton in 1988, WallBuilders promotes theories — discredited by serious scholars — about Christianity’s central role in the formation of the United States through its podcasts, books and a museum with “one of the largest private collections of United States historical documents.”\nThrough WallBuilders’ lobbying arm, the Pro-Family Legislative Network, Barton leads direct outreach to lawmakers and educators at its annual conferences at a four-star waterfront resort in suburban Dallas. It was at this gathering where Indiana Rep. J.D. Prescott, a Republican, got the idea for Ten Commandments legislation in his state, he told The 74.\nPrescott proposed a bill requiring a “durable poster or framed picture” of the commandments in each library and classroom at all public schools statewide. The legislation ultimately failed to garner support. Bills in other states also failed to gain traction, including in South Dakota where the bill’s critics — including some Republicans — said a government mandate was the wrong way to spread Christianity and ran afoul of the Constitution.\n“Our early common school system was really designed to teach biblical principles in the Bible, so it’s just getting back to that point,” said Prescott, who described himself as a “student of history.”\nThe Pro-Family Legislative conference offers lawmakers scholarships and discounted hotel rates to attend the event. In at least one instance, a New Hampshire state lawmaker filed a disclosure form reporting that he had received $859.47 from the Pro-Family Legislative Network, including $500 reimbursing him for air fare, to attend the November 2024 conference.\nPrescott told The 74, “I learned a lot of it at a WallBuilders conference hosted by David Barton. They’ve got a great conference for legislators down in Texas every November. I did look at the WallBuilders model legislation and it’s a good place to start.”\nNot everyone’s Ten Commandments\nExperts said the bills seek to do more than require “durable” Ten Commandments posters in every public school classroom. The campaign is part of a broader, well-organized and deep-pocketed assault, they argue, on the separation of church and state.\nAlthough WallBuilders isn’t required to disclose its donors, the nonprofit Center for Media and Democracy analyzed federal tax filings with the Internal Revenue Service to bring its finances into focus. In 2021, WallBuilders reported $5.9 million in revenue and $6.3 million in total assets.\nThe group relies heavily on donor-advised giving, a tax loophole that allows anonymous supporters across the political spectrum to contribute to contentious causes without scrutiny. For example, donor-advised funds have been exploited by far-right activists to leverage global campaigns against the civil rights of women and the LGBTQ+ community, according to a 2023 investigation by openDemocracy.\nMercury One, a nonprofit founded by high-profile conservative pundit and media personality Glenn Beck, is both a WallBuilders donor and primary sponsor of Barton’s annual Pro-Family Legislative Conference to brief elected officials “on pressing issues from a constitutional perspective.”\nBarton, who didn’t respond to multiple requests for comment, describes himself as a self-taught historian and the owner of the largest private collection of historical documents about the Founding Fathers. His critics pan the graduate of the Oral Roberts University as a discredited pseudohistorian and propagandist.\nBarton is “the granddaddy of Christian nationalist disinformation,” constitutional attorney Andrew Seidel, who serves as vice president of strategic communications at Americans United for Separation of Church and State, told The 74.\nJohn Fea, an American history professor and history department chair at Messiah University, a private evangelical Christian institution in Pennsylvania, accused Barton of cherry-picking historical information to present a misleading portrayal of the past, one that bolsters his own present-day political agenda.\n“This is clearly an attempt by Christian nationalists to try to advance their own version of what America should be,” Fea said, noting that even as historians challenge Barton, he’s amassed influence among Republican lawmakers interested in leveraging a distorted accounting of history for political gain.\n“Barton provides that history for these lawmakers. It adds a certain depth, even though it’s hollow.”\nDarcy Hirsh, the senior director of government relations and advocacy at the nonprofit National Council for Jewish Women, said the Ten Commandments laws present an attack on “the strict wall of separation” between church and state.\n“Any efforts to perpetuate the falsehood that the United States is a Christian nation is something that we find deeply alarming,” Hirsh said. Requiring a protestant Christian version of the Ten Commandments in schools, she said, is “exclusionary and coercive” to children from diverse backgrounds.\n“A Protestant interpretation of the Ten Commandments is different than the Jewish interpretation of the Ten Commandments, in fact, they are numbered differently,” she said. Constitutional protections separating church and state, she said, are critical to the country’s democratic society.\n“It’s that protection that has really allowed the Jewish community and other minority faith communities to flourish in the U.S.”\nThe laws successfully passed in Louisiana, Arkansas and Texas now face lawsuits from parents alleging they violate the separation of church and state. The issue could soon appear again before the nation’s highest court. In June, the Fifth Circuit Court of Appeals in New Orleans, among the nation’s most conservative, struck down Louisiana’s Ten Commandments display mandate, finding it “plainly unconstitutional.”\nParents with diverse religious identities are being backed by the American Civil Liberties Union and Americans United for Separation of Church and State in challenging the laws. In a complaint filed in Arkansas, parents allege students will be “unconstitutionally coerced into religious observance” and “pressured to suppress their personal religious beliefs.”\nFea, the evangelical historian, told The 74 the far-right campaign isn’t about the Ten Commandments’ place in the nation’s founding but about advancing the influence of Christianity in society.\n“They’re using this historical argument to disguise the fact that they believe that somehow — and I don’t know how this happens, by osmosis or whatever — a student sitting in a classroom where the Ten Commandments is displayed will somehow buy into those ideals and values and become more Christian,” he said.\n‘The hostility is gone’\nAt the Texas House education committee hearing in April, Barton held up a second book. This one was much smaller than the first, but just as old and, Barton testified, just as significant.\nBarton lectured the Republican-controlled state legislature on The New England Primer, a widely used Colonial-era reading text. The book, he said, drilled first graders with 43 questions about the Ten Commandments.\nThen he introduced a third book, and a fourth.\n“The courts have pointed to the Ten Commandments as the reason we have all types of laws,” Barton testified. “So there’s a lot of history and tradition for that document that’s not there for other documents.”\nBarton’s prop-focused presentation isn’t just scripted — it’s well rehearsed. This year, the 71-year-old has traveled across the country with his books and a small team of collaborators to spread the gospel of Christian nationalism. Like the bills before the state legislatures, Barton’s speech was replicated again and again.\nAs Barton testified on the Ten Commandment bills nationally, legislative sponsors routinely parroted his talking points, not just about Christianity’s role in the country’s origin, but the Supreme Court’s support for their movement.\nDuring his recent appearances in Nebraska and other states, Barton’s testimonies invoked the court’s 2022 opinion upholding the rights of a Washington state high school football coach to lead prayers with his team on the 50-yard line after games.\nPrescott, the Indiana lawmaker, said he became interested in introducing his bill after learning of the implications of the coach’s Supreme Court victory.\nTo Barton and other members of his coalition, the court’s opinion in Kennedy v. Bremerton School District creates a clear path to require Ten Commandments in schools — and inject Christianity into other facets of public life — by proving they’re part of a longstanding traditional practice.\nIn finding for Coach Kennedy, the Supreme Court abandoned its 1971 opinion ruling that religious displays don’t violate the Constitution if they have significant secular or nonreligious purposes. The court’s new standard revolves around whether the religious displays are part of historical practices. In other words, the heart of Barton’s pitch.\n“That is the new standard, so the hostility is gone,” he testified. “Showing that this is something that is longstanding practice, you go back to The New England Primer.”\nBought and paid for — according to specs\nEven as bill proponents championed states’ rights as one legal justification for their Ten Commandments display mandates, Middleton, the Texas legislative leader, said there is a key benefit to the near-identical requirements in the bills across the 18 states.\n“We just wanted uniformity in these displays. We thought that was important,” the oil company president and cattle rancher told The 74. “Obviously, these are primarily going to be donated as well, so it’s probably going to be primarily private funds funding these.”\nProject Blitz model legislation devises a funding scheme that revolves around donated displays without the reliance on public funds — a provision that appears in 16 states’ bills. Others invoke the model legislation by encouraging donated displays, but broaden the mandate so schools are also free to spend taxpayer dollars to comply.\nMirroring the Project Blitz model legislation, the new Arkansas law requires the Ten Commandments display be composed of a “durable poster or framed copy” of the document and that it be “prominently” positioned in each public classroom and library across the state. The law also stipulates that the posters should be donated by outside groups, meaning the same private entities who had a hand in crafting the specifications, supporting the bills and getting them on legislators’ radars, will also be the ones buying the versions of the Ten Commandments that wind up in schools.\nEven as the Louisiana law is caught up in federal court, religious groups who lobbied for the law’s passage and have close ties to the WallBuilders have plans to donate the displays set to appear in classrooms across the state.\nIn April, First Liberty Institute and The Louisiana Family Forum announced that Patriot Mobile, which describes itself as “America’s ONLY Christian conservative wireless provider,” had donated 3,000 Ten Commandments displays “as part of a project to provide, at no cost to the Louisiana taxpayer, displays in schools throughout Louisiana.”\nGet stories like these delivered straight to your inbox. Sign up for The 74 Newsletter"
    },
    {
      "url": "https://arkleg.state.ar.us/Bills/Detail?id=SB433&ddBienniumSession=2025%2F2025R",
      "text": "SB433 - REGARDING THE DISPLAY OF THE NATIONAL MOTTO AND THE TEN COMMANDMENTS.\nMeetings\nDate\nMeeting\nDocuments\nBill Status History\nChamber\nDate\nAction\nVote\nSenate\n4/14/2025 5:31:48 PM\nNotification that SB433 is now Act 573\nSenate\n4/9/2025 9:11:14 AM\nDELIVERED TO GOVERNOR.\nSenate\n4/9/2025 9:11:10 AM\nReported correctly enrolled and ordered delivered to the Governor.\nSenate\n4/8/2025 1:14:58 PM\nORDERED ENROLLED\nSenate\n4/8/2025 1:14:51 PM\nReturned from the House as passed.\nHouse\n4/8/2025 8:43:03 AM\nReturned to the Senate as passed.\nHouse\n4/7/2025 8:42:58 PM\nRead the third time and passed and ordered transmitted to the Senate.\nHouse\n4/2/2025 2:58:40 PM\nReturned by the Committee Do Pass\nHouse\n3/19/2025 5:26:38 PM\nRead the first time, rules suspended, read the second time and referred to the Committee on STATE AGENCIES & GOVT'L AFFAIRS- HOUSE\nHouse\n3/19/2025 4:34:35 PM\nRECEIVED FROM THE SENATE\nSenate\n3/19/2025 3:59:13 PM\nOrdered immediately transmitted to the House.\nSenate\n3/18/2025 1:48:37 PM\nReturned by the Committee, with the recommendation that it Do Pass\nSenate\n3/17/2025 5:01:41 PM\nRe-referred to STATE AGENCIES & GOVT'L AFFAIRS-SENATE\nSenate\n3/17/2025 5:01:34 PM\nREPORTED CORRECTLY ENGROSSED\nSenate\n3/17/2025 4:15:30 PM\nAmendment # 1 read the first time, rules suspended, read the second time and adopted, ordered engrossed.\nSenate\n3/17/2025 4:15:24 PM\nWithdrawn from Committee and placed on 2nd reading for purpose of amendment # 1\nSenate\n3/17/2025 4:15:18 PM\nRules suspended.\nSenate\n3/12/2025 1:58:10 PM\nRead first time, rules suspended, read second time, referred to STATE AGENCIES & GOVT'L AFFAIRS-SENATE\nSenate\n3/11/2025 4:37:40 PM\nFiled\nAmendments\nChamber\nNo.\nSponsor\nIntroduction Date\nDocument"
    },
    {
      "url": "https://wallbuilders.com/",
      "text": "News & Updates\nAmerica is Built\non a Firm\nFoundation\nHave you been looking for documented\ntruth about our nation’s history?\nDo you support Christian ideals of\nfreedom in America?\nDo you struggle knowing where to start\nlooking for answers?\nWe’ll help you discover the intent of our\nFounding Fathers regarding freedom, justice,\nand equality.\nMany “academics” deliberately ignore, change, and revise the facts of\nhistory in order to better suit their own agendas. Truth is constantly\nbecoming harder to find. We’re here to help.\nThe information we share does not rely on “expert opinions” but on the\nactual historical documents. We cite the original sources in all our\nresources.\nThe Path to Truth is Clear\nLearn the\nAmerican Story\nFind Indisputable\nInformation\nKnow and Discern\nthe Truth\nLatest Resources\nWe care about the future of freedom in America.\nMany Americans don’t understand the Christian foundation of our nation. Through original source documents, we strive to reveal the historical truths about our Founding Fathers’ faith and the religious principles they established. We are driven to equip people to discover this truth with documents and artifacts from the first 400+ years of US history.\nThe service we provide is not a reaction to today’s political climate. We’ve worked to share and defend the truth since the 1980s.\nOur explanation of truth comes from the historical writings and documents themselves.\nWe have access to one of the largest private collections of United States historical documents and we want to share them with you.\nEvents\nExplore the various WallBuilder events, and come join us to learn more about America's heritage! Click below for more information..\nRestore America's\nBiblical Foundation\nLearn the truth about our nation’s Godly heritage today!\nFind Your Path\nUnderstand America’s forgotten history\nFeel confident talking about current issues\nKnow where to find historical records\nGovernment\nClear strategy advice, conferences, legislative positioning, and voter guides.\nChurch\nConferences, year-round church teaching, books, and semi-annual pastor briefings.\nStay Informed with the Latest Resources\nEnter your email address to receive our regular newsletter, with important information and updates right in your inbox!"
    },
    {
      "url": "https://www.npr.org/2019/06/20/731824045/supreme-court-cross-can-stand-on-public-land-in-separation-of-church-and-state-c",
      "text": "Supreme Court: Cross Can Stand On Public Land In Separation Of Church And State Case\nSupreme Court: Cross Can Stand On Public Land In Separation Of Church And State Case\nUpdated at 9:04 p.m. ET\nThe U.S. Supreme Court ruled Thursday that a 40-foot World War I memorial cross can stay on public land at a Maryland intersection.\nThe cross \"has become a prominent community landmark, and its removal or radical alteration at this date would be seen by many not as a neutral act but as the manifestation of a hostility toward religion that has no place in our Establishment Clause traditions,\" wrote Justice Samuel Alito, who penned the majority opinion for the court.\nAlito added that contrary to the challengers' intimation, \"there is no evidence of discriminatory intent in the selection of the design of the memorial or the decision of a Maryland commission to maintain it. The Religion Clause of the Constitution aims to foster a society in which people of all beliefs can live together harmoniously, and the presence of the Bladensburg Cross on the land where it has stood for so many years is fully consistent with that aim.\"\nThe decision was 7 to 2, but it had multiple parts and not all of the seven agreed on every aspect. The decision reverses a lower-court ruling that said the memorial is unconstitutional, because it is on public land and maintained at taxpayer expense. The high court's ruling is a major victory for religious groups and the American Legion, which warned that if this cross had to be moved, so, too, would other crosses that serve as war memorials.\nIn his opinion for the court, Alito said that the cross had essentially become secular. He invoked the history of World War I memorials. He pointed to the rows and rows of crosses that marked the graves of U.S. soldiers across Europe and said that established in people's minds the idea of crosses as war memorials back then.\nJustice Ruth Bader Ginsburg, in dissent, disagreed with Alito's history. She noted that it's clear what the purpose and meaning of the cross was from the start — it was religious. She argued Americans knew what it meant then and know what it means now.\n\"Decades ago,\" Ginsburg wrote, \"this Court recognized that the Establishment Clause of the First Amendment to the Constitution demands governmental neutrality among religious faiths, and between religion and non-religion. ... Numerous times since, the Court has reaffirmed the Constitution's commitment to neutrality. Today the Court erodes that neutrality commitment, diminishing precedent designed to preserve individual liberty and civic harmony in favor of a 'presumption of constitutionality for longstanding monuments, symbols, and practices.' \"\n\"The Latin cross,\" she said, \"is the foremost symbol of the Christian faith, embodying the 'central theological claim of Christianity: that the son of God died on the cross, that he rose from the dead, and that his death and resurrection offer the possibility of eternal life.' ... Precisely because the cross symbolizes these sectarian beliefs, it is a common marker for the graves of Christian soldiers. For the same reason, using the cross as a war memorial does not transform it into a secular symbol, as the Courts of Appeals have uniformly recognized.\"\nJoining Alito's opinion were the court's four other conservative justices, though two of them — Justices Clarence Thomas and Neil Gorsuch — only signed on to the outcome. Thomas restated his view that the Constitution's clause banning the establishment of religion does not apply to the states, and Gorsuch said he would have dismissed the challenge to the cross because, in his view, the objectors didn't have legal standing to sue.\nThe decision could have sweeping implications in terms of symbols, like crosses and the Ten Commandments that have long been in place. Those that are already there are unlikely to be removed, but putting up new crosses or other religious symbols on public property very likely would not stand under Thursday's ruling.\nPossible landmines for future cases\nReaction to the court's ruling varied. Though most experts saw the decision as narrow, some also saw landmines in the footnotes that could lead to far broader decisions in cases involving religious practices in the public sphere and religious involvement with the government.\nMichael McConnell, director of the Constitutional Law Center at Stanford Law School, saw the case as mainly about symbols. \"What it's saying is that symbols that have been around for a long time will be upheld,\" but \"no one should think that necessarily applies to new symbols.\"\nDavid Strauss, co-editor of the Supreme Court Review at the University of Chicago agreed, but said that there \"are intimations\" in the court's opinions that \"a majority is willing to go quite a bit further in allowing the government to signal its support for religion in various ways.\"\nHe said that there are suggestions in the decision that if a practice was acceptable at the time the Constitution was written, those practices would be acceptable today.\n\"If that is what the court means,\" Strauss said, \"that would be a big change, because the country is a lot more religiously diverse now than it was then\" and \"turning back the clock that way... would be a big deal.\"\nUniversity of Pennsylvania law professor Marci Hamilton, who, like McConnell and Strauss, has written extensively about the the religious clauses of the Constitution, pointed to a full-page footnote in the Alito opinion categorizing the different kinds of religion cases that the Supreme Court has been faced with over the last 70 years.\nThe footnote, she suggested, is loaded with landmines for the future expansion of religion in the public sphere, from prayer in public schools to \"church involvement in governmental decision-making.\"\nThe implication, she said, is \"that maybe it's OK to have churches making governmental decisions.\"\nUniversity of Virginia law professor Douglas Laycock, though, was relieved by what he viewed as a limited opinion. He filed a brief opposing the Maryland memorial on behalf of Christian groups and the Jewish War Veterans, but he said that \"From a true state separation perspective, this could have been much worse.\"\nThe Trump administration, he noted, had argued that \"'the cross is a universal symbol of sacrifice,' which is just nonsense. And the court didn't go there. So there's good news here.\"\nHow the cross got there\nThe concrete cross at the center of the court's decision is located in the middle of a busy median strip and directly across the street from a large pawnshop in Bladensburg, Md.\nIt was erected nearly 100 years ago when bereaved mothers in Bladensburg decided to build a World War I memorial to honor their fallen sons. When they ran out of money, the American Legion took over the project. But by the 1930s, a local parks commission had taken over the memorial and the responsibility for its maintenance.\nToday, the cross is more grungy than grand. The concrete is crumbling; a canvas tarp covers the top, and without the $100,000 that the parks commission has budgeted for repair, the monument looks like it may not be long for this world.\nThe American Humanist Association challenged the placement of the cross, contending that \"there is no meaning to the Latin cross, other than Christianity.\"\nA federal appeals court agreed, declaring that its placement violated the Constitution's ban on establishment of religion. The appeals court ruled that the cross should be moved to a private location and funded without taxpayer money.\nNow, the Supreme Court has reversed that ruling."
    },
    {
      "url": "https://www.pbcommercial.com/news/2025/aug/05/pastors-on-patrol-post-ten-commandments-amid-act/",
      "text": "Interested in getting The Pine Bluff Commercial's Newsletter delivered to your inbox every morning?\nMore than 12 hours after a preliminary injunction of Arkansas Act 573 was issued in federal court, Pine Bluff's Pastors on Patrol ceremonially posted the first framed copy of the Ten Commandments inside the halls of Pine Bluff High School's Jack Robey campus Tuesday.\nThe pastors, who volunteer in the local schools as part of the Pine Bluff Faith Community Coalition Ministerial Alliance, gathered for the symbolic move the morning after Judge Timothy Brooks of the U.S. District Court for the Western District of Arkansas issued the injunction in a 35-page ruling in the case of seven families against four northwest Arkansas school districts.\n\"It's very important for the children to have some kind of morale standard,\" said the Rev. Leon Jones, one of the Pastors on Patrol. \"We don't recommend any teachers teaching it, but if the children can see it and read it for themselves, it will get into their minds and hearts. It will change their whole lives. I think they'll know then they have something that says 'Thou shalt not' do certain things, things they come up on, on a regular basis.\"\nThe families of Samantha and Jonathan Stinson, Stephen Caldwell, Joseph Armendariz, Talara and Shane Taylor, Carol Vella, Daniel Rix and Leah Bailey sued the Fayetteville, Springdale, Bentonville and Siloam Springs school districts on June 11, charging that Act 573 violates civil rights under the First and 14th Amendments. The stay is limited to the four districts, \"pending a final disposition of the issues on the merits,\" Brooks concluded in the order.\nTurner emailed late Monday that the Pastors on Patrol would present the poster at the Jack Robey campus, where PBHS students temporarily attend while construction of the high school at its original West 11th Avenue location is ongoing, as well as 34th Avenue Elementary School. He called again for the poster to be presented after getting clearance from a state legislator whom he said got clarification from state Attorney General Tim Griffin's office that the injunction was not a blanket ruling across the state.\n\"We wanted to keep our commitment to putting them in the high school,\" Turner said.\nA request for comment has been made to Griffin's press representatives, but Turner said he hopes Griffin will decide to appeal the ruling.\nWhen asked about the injunction Monday night, Turner responded: \"I was not aware of this. It is unfortunate that our scholars face such discouragement when they need all the encouragement they can get. The judge should have set aside ideological views and considered what truly helps our scholars. Anything that can inspire more positive behavior would benefit our scholars.\"\nThe Ministerial Alliance hosted a meeting with other faith leaders July 28 to plan how the 16-inch-by-20-inch framed copies of the Ten Commandments – the directives God gave to Moses in Exodus 20:3-17 – would be delivered in Arkansas K-12 schools and classrooms. Turner said during a July 3 news conference near the Jefferson County Courthouse the Ten Commandments are the basis for positive behavioral intervention and support, a method to improve conduct among students in local schools.\nAbout 800 posters will be framed and delivered to local schools to be placed in each classroom once they are framed, Turner said.\n\"As the law stands, we're going to do our part to fulfill the tenets of the law,\" said PBHS Principal Ronald Laurent, who helped display one of the posters. \"If it changes, we'll adjust. The Ten Commandments are a part of Judeo-Christian beliefs, so it's OK.\"\nDistrict Superintendent Jennifer Barbaree, who did not attend the ceremonial posting at the Robey campus, said following a teacher convocation last month she is a Christian and believes in the Ten Commandments. Asked for her thoughts on Act 573, Barbaree said the district would post the Commandments in each classroom per the law, expressing thanks to the Ministerial Alliance for providing the framed posters.\nAct 573 also calls for an 11-inch-by-14-inch display of \"In God We Trust,\" the national motto found on U.S. currency."
    }
  ],
  "argos_summary": "Arkansas' Act 573, which mandates the display of the Ten Commandments in public schools, is facing legal challenges after a federal judge temporarily blocked its enforcement in certain districts, citing concerns over the separation of church and state. Proponents argue the law is constitutional and rooted in historical tradition, while critics, including parents and civil rights groups, claim it coerces religious observance among students. The law is part of a broader trend influenced by Christian nationalist groups, with similar legislation emerging in multiple states, raising concerns about the implications for religious freedom and diversity in public education.",
  "argos_id": "23YDY5C60"
}