{
  "url": "https://www.androidauthority.com/youtube-age-estimation-us-rollout-3586621/",
  "authorsByline": "Adamya Sharma",
  "articleId": "39cf34c2a0f443b38b1ab204e69c5291",
  "source": {
    "domain": "androidauthority.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "",
      "county": "",
      "city": "",
      "coordinates": {
        "lat": 0.0,
        "lon": 0.0
      }
    }
  },
  "imageUrl": "https://www.androidauthority.com/wp-content/uploads/2022/04/YouTube-on-smartphone-stock-photo-16.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:00:06+00:00",
  "addDate": "2025-08-13T04:12:40.433377+00:00",
  "refreshDate": "2025-08-13T04:12:40.433378+00:00",
  "score": 1.0,
  "title": "PSA: YouTube will start guessing your age from today",
  "description": "Starting today, YouTube will use AI to guess the age of its US viewers and will automatically apply age restrictions for those under 18.",
  "content": "YouTube will start rolling out its new AI-powered age estimation system in the US beginning today, August 13. First announced last month, the feature uses artificial intelligence to determine whether a user is likely under 18, based on factors such as their viewing habits, YouTube search history, and how long their account has been active. This process applies to all YouTube accounts, regardless of the birthdate entered during sign-up.\n\nIf YouTube’s AI concludes you’re under 18, you’ll receive a notification informing you of the same. You can dispute this by verifying your age through a government-issued ID, a selfie, or a credit card.\n\nFor accounts flagged as belonging to teens, YouTube will automatically enable its age-appropriate features, which include:\n• Turning on digital wellbeing tools like “take a break” and bedtime reminders by default\n• Reducing recommendations for videos that could be problematic if watched repeatedly And has been YouTube’s rule for years, you must be 18 or older to view age-restricted videos.\n\nWhile YouTube intends to protect young viewers, some users haven’t taken well to its new age estimation efforts. Many worry the system might label them as teenagers based solely on certain viewing patterns.\n\n“I let my cousins’ kids watch some of their shows when I’m babysitting them, and I don’t care to give my ID to YouTube, especially since I have had a Google account for like 20 odd years now,” a user noted on Reddit.\n\n“Pokémon, Minecraft, Anime, and Roblox are for everyone! We understand that users on YouTube have a variety of interests. Our age estimation model does not look at one form of content in isolation to determine if an account is under the age of 18. The model assesses many different signals to reach this determination, including but not limited to YouTube activity and longevity across a user’s account. It is not focused on any specific genre or type of video,” the company had said.\n\n“With this rise of AI and increased demand for users’ personal information, I truly believe that the internet will be so fundamentally different in 5 years that parts of it will simply become broken,” a user wrote on\n\nYouTube emphasizes that ID submission is optional, and those who opt out can still use the platform with the standard teen protections applied. Teen accounts can access most content on YouTube, except for age-restricted videos containing excessive violence or nudity.",
  "medium": "Article",
  "links": [
    "https://www.androidauthority.com/tag/youtube/",
    "https://www.androidauthority.com/news/",
    "https://www.reddit.com/r/news/comments/1mo9557/youtube_to_begin_testing_a_new_aipowered_age/",
    "https://www.androidauthority.com/android-authority-comment-policy/",
    "https://support.google.com/youtube/thread/356191968?hl=en",
    "https://support.google.com/youtube/thread/356191968/extending-protections-to-more-us-based-teens?hl=en",
    "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
    "https://www.androidauthority.com/tag/youtube-premium/",
    "https://www.androidauthority.com/youtube-age-checks-3582141/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "YouTube",
      "weight": 0.10678196
    },
    {
      "name": "YouTube activity",
      "weight": 0.106353246
    },
    {
      "name": "YouTube search history",
      "weight": 0.10261354
    },
    {
      "name": "Teen accounts",
      "weight": 0.08508052
    },
    {
      "name": "users",
      "weight": 0.082154974
    },
    {
      "name": "accounts",
      "weight": 0.07359057
    },
    {
      "name": "video",
      "weight": 0.068391584
    },
    {
      "name": "videos",
      "weight": 0.068391584
    },
    {
      "name": "ID submission",
      "weight": 0.067375585
    },
    {
      "name": "many different signals",
      "weight": 0.06617775
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.8759765625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.8095703125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.5732421875
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.47705078125
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.45068359375
    }
  ],
  "sentiment": {
    "positive": 0.14076945,
    "negative": 0.3634384,
    "neutral": 0.4957921
  },
  "summary": "YouTube will begin rolling out its new AI-powered age estimation system in the US starting on August 13. The system uses artificial intelligence to determine if a user is likely under 18 based on factors such as viewing habits, search history, and account activity. If found to be under 18, the system will notify users of the same age, which can be disputed by using a government-issued ID, a selfie, or a credit card. For accounts flagged as teens, YouTube will automatically enable age-appropriate features such as \"take a break\" and bedtime reminders. However, some users have expressed concern about the system's potential impact on personal information.",
  "shortSummary": "YouTube will introduce its AI-powered age estimation system in the US, automatically identifying users as under 18 based on viewing habits and activity, but some users are concerned about this trend.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b2a0bb439c38432db81e658114818e8c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.androidauthority.com/news/",
      "text": "News\nAudioComputingGamingGeneral technologyMobileSmart homeStreaming and entertainmentWearables and health\nGboard now has new shortcut for seamless access to your credentials and cards\nThe new \"Autofill\" shortcut that makes it easier and faster to fill out passwords and payment information.\nAdamya Sharma\nPSA: YouTube will start guessing your age from today\nAdamya Sharma2 hours ago\n0\nGot a weird security text from T-Mobile? It's genuine, but you're right to worry\nAdamya Sharma3 hours ago\n0\nHot sale: Samsung's new smartwatches still come with freebies!\nEdgar Cervantes6 hours ago\n0\nSave $69.01 on the Apple AirPods Max, the best headphones for iPhone users\nLooking for the best headphones? If you use Apple devices, these are the ones.\nEdgar Cervantes\nDeal: Get the Sony WH-1000XM6 headphones at their record low price!\nEdgar Cervantes8 hours ago\n0\nVisible users won't have to wait much longer to jump on the new Inner Circle plan\nRyan McNeal11 hours ago\n0\nChrome isn’t for sale, but Perplexity just offered $34.5 billion anyway\nMatt Horne11 hours ago\n0\nOur latest\nPixel 10 Pro Fold takes center stage in Google's latest teaser\nStephen Schenck12 hours ago\n0\nSamsung's latest One UI 8 beta is causing a hilarious moon-related camera glitch\nRyan McNeal13 hours ago\n0\nThis so-called Android 'antivirus' is just a front for spyware\nMatt Horne13 hours ago\n0\nStudy finds your smartwatch might be way off on one key health stat\nMatt Horne14 hours ago\n0\nForget the Steam Deck, this 12.5-inch handheld can play games at 4K 100FPS\nRyan McNeal14 hours ago\n0\nT-Mobile wants you to stay hydrated with its latest Tuesday giveaway\nAndrew Grush14 hours ago\n0\nOne of Google's YouTube channels looks like it was hacked to promote crypto\nStephen Schenck15 hours ago\n0\nPreferred Sources wants to fix your Google Search results — here's how to set it up\nAamir Siddiqui15 hours ago\n0\nWant more Android Authority? How to set us as your preferred source in Google Search\nOliver Cragg15 hours ago\n0\nWith this final change, T-Mobile now charges taxes and fees on everything\nAndrew Grush15 hours ago\n0\nSamsung's second One UI 8 Watch beta is finally here\nHadlee Simons16 hours ago\n0\nGoogle is streamlining how you send money abroad — and getting new tools for spending it at home\nStephen Schenck17 hours ago\n0"
    },
    {
      "url": "https://www.androidauthority.com/youtube-age-checks-3582141/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nGet ready to be embarrassed: YouTube will start using your view history to guess if you're an adult\nJuly 29, 2025\n- Earlier this year, YouTube announced plans to bring an age-verification system to the US.\n- Tests are starting over the next few weeks, with plans to expand widely later on.\n- YouTube will use AI to flag accounts based on teen-like usage patterns, and ask these users to prove their age.\nWe’re currently in the middle of a rather regrettable trend taking hold across the globe, as online services increasingly demand that users positively authenticate themselves — or at the very least establish their ages. Over in the UK they’re all having a bunch of fun* (fun not guaranteed) with the Online Safety Act right now, and the US is likely to face a new wave of similar requirements, after a bad Supreme Court ruling last month. Earlier this year, YouTube shared some of its own plans for age verification, and it’s now getting ready to flip the switch.\nOver the next few weeks, YouTube will begin testing its age-checking tools on a small group of US users. Rather than initially demanding to see a copy of your ID, the system will start by attempting to guess your age based on your YouTube usage.\nWhile YouTube is obviously not going to provide a detailed breakdown of the sort of things that might flag you as a teen, it attempts to explain in broad strokes:\nWe will use AI to interpret a variety of signals that help us to determine whether a user is over or under 18. These signals include the types of videos a user is searching for, the categories of videos they have watched, or the longevity of the account.\nIt’s not hard to read that and see there being plenty of edge cases where new adult accounts viewing more youth-oriented content could easily trigger YouTube’s suspicions. If that does happen, it’s at this point that you’ll have the option to share a copy of your ID or a credit card with the site, proving your actual age. If you do not, you won’t be able to view age-restricted content and YouTube will activate its additional teen safeguards.\nWe’ll be very curious to see just how many YouTube viewers end up complaining about being singled-out based on their habits for this extra check — and how many might feel a tad embarrassed by their YouTube history not looking “adult” enough to pass. Feel free to run a few searches for videos on setting up a 401(k) to get ahead of YouTube’s AI scans.\nThank you for being part of our community. Read our Comment Policy before posting."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-comment-policy/",
      "text": "Android Authority is a community of technology enthusiasts. We’re brought together by our interest in all things tech, regardless of brand, platform, and price point. Our writers care deeply about the topics they cover, and so do our readers.\nBecause we’re all passionate, it’s easy for discussions around certain topics to become heated, but that’s not an excuse for discussions to degenerate.\nHere are the general rules that cover commenting on Android Authority platforms, including on-site comment sections, YouTube, and various social media channels.\nDo’s\n- Always be civil.\n- Read the content before commenting.\n- Post thoughtful comments that meaningfully contribute to the discussion.\n- Give constructive criticism in response to posts and other comments.\n- Ignore the trolls, they crave attention.\n- Downvote low-quality comments. Flag spam and abusive comments.\nDon’ts\n- Attack commenters, Android Authority staff, or other individuals.\n- Post off-topic comments.\n- Post abusive, insulting, threatening, harassing, sexist, racist, misogynist, homophobic comments.\n- Reveal personal information of any individuals.\n- Spam, self-promote, impersonate.\n- Post low-effort comments that don’t add anything to the discussion.\n- Post porn, gore, or other NSFW content.\n- Post or link to pirated content of any type.\n- Post slanderous or defamatory comments.\nHouse rules\n- Comments are solely the opinions of the individuals leaving them. In no way does Android Authority endorse or condone them.\n- Failure to comply with the guidelines above may result in your comments being deleted or moderated.\n- Repeat and serious offenders will be banned.\n- We reserve the right to delete or moderate comments at any time and at our sole discretion.\n- This policy may be changed at any time and at our sole discretion."
    },
    {
      "url": "https://www.androidauthority.com/android-authority-preferred-source-google-search-3586296/",
      "text": "Affiliate links on Android Authority may earn us a commission. Learn more.\nWant more Android Authority? How to set us as your preferred source in Google Search\n15 hours ago\nSince 2007, Android Authority has strived to bring all of our readers the very best coverage of Android and the mobile tech world. And even after 18+ years as a proudly independent media outlet, we’re as driven as we’ve ever been to bring you all the latest exclusive reports, app teardowns, leaks, hands-on reviews, experience-based features, lab testing, and other expert analysis.\nOf course, how we’ve been able to get that coverage to you has changed in countless ways during that time, be it via our website, YouTube channel, social media, or new projects like Authority Insights, which combines our elite reporting with a podcast and a newsletter, as well as our brand new YouTube channel from Android Authority‘s Pixel guy, C. Scott Brown.\nWe want to continue to bring you the very best Android and mobile tech coverage, and you can help us do that.\nWe know and deeply appreciate that so many of you repeatedly visit our website and other channels to constantly see what we’ve been working on, often every day. Every one of those clicks or interactions helps us remain independent and every bit as innovative and ambitious as we’ve been since day one.\nSo, if you want to see even more of our content, guarantee you don’t miss anything from us, or just want to continue to support our mission, we’d like to ask you a big favor and set Android Authority as a preferred source in Google Search. It only takes a few seconds, it doesn’t cost you anything, and it will help us continue to bring you the best possible content for the next decade and beyond.\nThis feature is currently only available in the US and India, but we’ll let you know when other regions are included in this new feature. For those who already have it, here’s how to do it:\nHow to set Android Authority as a preferred source\n- Search for a topic that’s in the news and find the “Top stories” header. If you don’t see this, you might need to input a different query. “Galaxy S26 Pro” worked for us at the time of writing.\n- Click on the icon on the right of the “Top stories” header. That’s the icon with the stacked squares and a star on top.\n- Search for “Android Authority” and select it to set it as a preferred source. You can add other websites at this stage, too — support your favorite publications!\n- Refresh your search results to see more from your favorite sites.\nOnce again, a big thank you to all our readers, viewers, and followers — your passion for Android and tech is what pushes us forward. We hope you’ll add us as a preferred source (and please feel free to encourage any other tech enthusiasts you know to do the same!), but even if you don’t, we’re grateful for every one of you that supports our work in any way possible. And as ever, if you have any feedback for us, please drop an email to contact@androidauthority.com.\nThank you for being part of our community. Read our Comment Policy before posting."
    }
  ],
  "argos_summary": "YouTube has begun rolling out an AI-powered age estimation system in the US, which assesses user behavior to determine if they are likely under 18. If flagged as a minor, users will receive a notification and can dispute this by providing age verification through ID or other means. The system aims to enhance safety for younger viewers by enabling age-appropriate features, but some users express concerns about being misidentified based on their viewing habits.",
  "argos_id": "29A3QYU22"
}