{
  "url": "https://www.newsweek.com/ice-migrants-hmong-laos-vietnam-war-2111676",
  "authorsByline": "Alia Shoaib",
  "articleId": "851a9c00716b4a529a1a61fd51ec4d78",
  "source": {
    "domain": "newsweek.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://d.newsweek.com/en/full/2700225/hmong-soldiers.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T04:12:46-04:00",
  "addDate": "2025-08-12T08:20:34.857938+00:00",
  "refreshDate": "2025-08-12T08:20:34.857939+00:00",
  "score": 1.0,
  "title": "ICE Arrests 16 migrants from community that helped US in Vietnam War",
  "description": "Immigration and Customs Enforcement arrested 16 Hmong and Laotian immigrants in Detroit, and they now face deportation.",
  "content": "Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources.\n\nMore than a dozen migrants from Southeast Asian communities that historically allied with the U.S. during the Vietnam War have been detained by Immigration and Customs Enforcement (ICE) and now face deportation.\n\nThe Department of Homeland Security has confirmed that ICE arrested 16 migrants in Detroit on July 30.\n\n\"This operation resulted in the arrest of multiple criminal illegal aliens, including child sex abusers, drug traffickers, a known gang member who obstructed a murder investigation, and other Laotian nationals with extensive criminal histories,\" the department told Newsweek in an emailed statement.\n\nThe detentions come amid ongoing concerns from immigrant rights advocates over aggressive enforcement tactics that expanded under the Trump administration, with ICE ramping up arrests and deportations.\n\nWhat To Know\n\nMembers of the Hmong community, an ethnic group from Southeast Asia, were recruited by the CIA to assist the U.S. against Communist forces during the Vietnam War and a related conflict in Laos.\n\nMany later resettled in the U.S. as refugees after facing persecution in their home country of Laos and went on to live, work and have families in the United States.\n\nOf the 16 migrants ICE arrested in Michigan, 15 were detained after being summoned to their Detroit field office for routine appointments, the Detroit Free Press reported.\n\nThe final man was arrested at his workplace in Lansing, according to Christine Sauvé, a manager at Michigan Immigrant Rights Center.\n\nThe migrants were taken to a detention center in northwestern Michigan, then on to facilities in Louisiana and Texas.\n\nNewsweek previously reported that Pang Nhia Hang Bailey from the Hmong community, a mother of four who had been living in the U.S. for more than four decades, was detained on July 30.\n\nICE officials told the Detroit Free Press that the detainees had criminal records and had been ordered to be removed by immigration judges over the course of years.\n\nThey added that the agency was now taking action because it had obtained travel documents from the government of Laos to send them there.\n\nDeportations to Laos have historically been difficult, but the Trump administration has pressured the country into taking deportees, the outlet reported.\n\nA group of 27 Michigan lawmakers have called for the detainees to be immediately released in a letter to Kevin Raycraft, the field director of ICE's Detroit office.\n\nState Representative Mai Xiong, Michigan's first Hmong American legislator, said in a Facebook video that many of the detainees had never been to Laos, having been born in refugee camps in other countries, or had been brought to the U.S. as children.\n\nMaiyia Xiong, the wife of Wa Kong Lor, one of the detained immigrants, said in a statement read out at a news conference: \"This appeared to be a targeted operation, an easy way for ICE officers to detain people without going to their homes.\"\n\n\"My husband, like many others that day, was taken without warning,\" she said.\n\nSufeng Yang, who arrived in the U.S. as a young child with his mother, is also among the detainees.\n\nAnissa Lee, his daughter, said Yang arrived \"seeking safety and a better life after the war,\" the Detroit Free Press reported.\n\n\"He was raised here. He was educated here, and he built his life here. The United States is all he's ever known. It's his only home. He's not just a resident here. He's a taxpayer, a provider, a father and a caregiver,\" Lee said.\n\nWhat People Are Saying\n\nThe Department of Homeland Security told Newsweek in a statement: \"Secretary [Kristi] Noem has unleashed ICE to target the worst of the worst—including gang members, murderers, and rapists. Criminal illegal aliens are not welcome in the U.S.\"\n\nMichigan state Representative Donavan McKinney said at a news conference: \"It's cruel, it's wrong, it's unjust, and it must end. We are calling for their release. Families belong together, not torn apart in secrecy. We also call for transparency and accountability so these horrific events stop happening.\"\n\nWhat Happens Next\n\nThe detainees remain in ICE custody, and their attorneys and local lawmakers continue to push for their release.",
  "medium": "Article",
  "links": [
    "https://www.newsweek.com/topic/cia",
    "https://www.newsweek.com/green-card-mom-us-47-years-detained-ice-2110263",
    "https://www.newsweek.com/topic/facebook",
    "https://www.newsweek.com/topic/department-of-homeland-security",
    "https://www.newsweek.com/priests-daughter-detained-ice-routine-visa-hearing-new-york-2108286",
    "https://www.newsweek.com/trump-deportation-quota-ice-immigration-2108379",
    "https://www.newsweek.com/topic/ice"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ICE custody",
      "weight": 0.07440836
    },
    {
      "name": "ICE officers",
      "weight": 0.07419782
    },
    {
      "name": "ICE",
      "weight": 0.07370483
    },
    {
      "name": "ICE officials",
      "weight": 0.07271825
    },
    {
      "name": "northwestern Michigan",
      "weight": 0.06322233
    },
    {
      "name": "U.S.",
      "weight": 0.063131474
    },
    {
      "name": "Michigan state Representative Donavan McKinney",
      "weight": 0.06247385
    },
    {
      "name": "Michigan",
      "weight": 0.060188543
    },
    {
      "name": "Michigan Immigrant Rights Center",
      "weight": 0.060108244
    },
    {
      "name": "Criminal illegal aliens",
      "weight": 0.05964742
    }
  ],
  "topics": [
    {
      "name": "Vietnam War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.8720703125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.86767578125
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.73828125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.5830078125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.53271484375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.50634765625
    },
    {
      "name": "/News/Other",
      "score": 0.417724609375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.408935546875
    },
    {
      "name": "/People & Society/Other",
      "score": 0.330322265625
    }
  ],
  "sentiment": {
    "positive": 0.045429632,
    "negative": 0.745835,
    "neutral": 0.20873532
  },
  "summary": "Immigration and Customs Enforcement (ICE) has arrested 16 migrants from the Hmong community who have historically supported the US during the Vietnam War. The Department of Homeland Security confirmed that the arrests were made in Detroit and resulted in multiple criminal illegal aliens, including child sex abusers, drug traffickers, and Laotian nationals with extensive criminal histories. The detentions come amid concerns about ICE's aggressive enforcement tactics under the Trump administration. The detainees were taken to a detention center in Michigan before being transferred to facilities in Louisiana and Texas. Many of the detainees had never been to Laos, having been born in refugee camps in other countries or had been brought to the US as children.",
  "shortSummary": "ICE arrested 16 migrants from Southeast Asian communities, including members of the Hmong community, in Detroit and other areas, amid concerns over aggressive enforcement tactics under the Trump administration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d50745dd6d214d69a6727893715f4ffd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.newsweek.com/topic/ice",
      "text": "ICE Arrests 16 migrants from community that helped US in Vietnam War\nImmigration and Customs Enforcement arrested 16 Hmong and Laotian immigrants in Detroit, and they now face deportation.\nICE detains woman in green card process and son at Canadian border\nThe mother of three thought she had her paperwork in order when making a quick trip to Vancouver.\nICE detains green card holder returning from vacation after 23 years in US\nThe Filipino immigrant helped the government over a decade ago to arrest narcotics co-conspirators, receiving a reduced sentence and monetary fine.\nDean Cain hits back at John Oliver jab amid plans to join ICE\nThe Superman actor announced last week that he signed up for the ICE recruitment program.\nMan applying for green card detained by ICE after decades in US\nA Chinese national with a decades-old removal warrant was arrested while pursuing a green card application.\nIRS chief forced out after immigrant tax data pushback—Report\nThe IRS previously agreed to a data-sharing scheme with the Department of Homeland Security to use some sensitive information to identify illegal immigrants.\nBill Maher confronts Dr. Phil on joining Trump admin's ICE raids\nMaher pressed Dr. Phil on \"going on\" some of the Trump administration's immigration raids.\nTrump administration suffers double legal blow within hours\nThe courts have developed into one of the main impediments of Trump administration policy.\nMom in green card process detained by ICE after 25 years in US\nA GoFundMe for the Pennsylvania mother raised more than $32,000.\nSupreme Court receives new request from Donald Trump\nThe Trump administration argued that a lower court ruling poses a significant barrier to enforcing federal immigration laws.\nMom in US for 47 years who previously had green card detained by ICE\nA mother of four who has been living in the U.S. for over four decades has been detained by immigration officials.\nICE to buy eye-scanning tech that could identify migrants in seconds\nThe agency announced on Wednesday that it would be contracting top-level biometric services.\nSydney Sweeney's \"Great Jeans\" Illuminate Resurgence of Eugenics | Opinion\nConsumers should stand up for the diversity we want by boycotting companies like American Eagle that reject these values.\nTrump administration says teenagers can now be ICE agents\nICE is offering incentives including signing bonuses of up to $50,000, student loan forgiveness and extensive overtime opportunities.\nDACA recipient detained by ICE at airport before boarding domestic flight\nA DHS official said the community activist's criminal history included charges for trespassing and narcotics possession.\nNew details emerge after ICE arrest Trump Burger co-owner\nRoland Beainy was detained by immigration enforcement over alleged false statements regarding an immigration application.\n\"Superman\" star Dean Cain says he joined ICE: What to know\nThe former \"Ripley's Believe It or Not!\" host praised President Donald Trump on social media.\nSouth Park mocks White House over Homeland Security ICE post\n\"Wait, so we ARE relevant?\" South Park said in reference to the White House previously calling it irrelevant.\nIndiana prepping \"Speedway Slammer\" similar to \"Alligator Alcatraz\"\nDHS is preparing another ICE detention facility as deportation efforts continue.\nFull list of cities Trump admin accuses of impeding ICE efforts\nThe list signals a renewed effort to sanction communities that limit cooperation with Immigration and Customs Enforcement (ICE).\nICE Agent pulls gun on woman during raid, Ring camera shows\nRing camera footage shows the moment a home is raided in South Carolina.\nDACA recipient dad in US since age 10 hoping for green card detained by ICE\nThe man, who legally came to the U.S. as a child, faces deportation, according to his wife.\nCalifornia cannabis farm announces changes after deadly ICE raid\n\"The company has made significant changes to labor practices that are above and beyond legal requirements,\" Glass House Brands Inc. said in a statement.\nWoman with green card detained by ICE after 14 years in US, boyfriend says\nThe Oklahoma resident originally from Colombia was married to an American citizen and has three children living in the U.S.\nNurse in US for 40 years self-deports—\"It's really gotten insane\"\n\"I've come full circle,\" Matthew Morrison said. \"I came here as an immigrant and I am leaving as an immigrant, despite everything in between.\"\nGreen card applicant arrested by ICE while driving to grocery store\nRami Othmane's wife, a California doctor, told how she watched it happen over FaceTime.\nTrump's deportation quota comes under scrutiny\nLawyers for the DOJ said \"neither ICE leadership nor its field offices\" were directed to meet any numerical quota for arrests.\nPriest's daughter detained by ICE after routine visa hearing\nYeonsoo Go, a South Korean native, immigrated from Seoul with her mother on a religious visa roughly four years ago and was switching to a student visa.\nIt's the worst time to be an American farmer in decades\nRising debt, falling crop prices and labor force struggles are pushing America's farmers to the limit in 2025.\nICE detains man in US since he was a teenager at traffic court\nICE agents arrested Pablo Grave de la Cruz outside of a Rhode Island traffic court in June."
    },
    {
      "url": "https://www.newsweek.com/trump-deportation-quota-ice-immigration-2108379",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nAttorneys for the Trump administration have denied that Immigration and Customs Enforcement (ICE) agents were directed to meet a daily quota for arrests or deportations.\nIn a court filing submitted on Friday, lawyers for the Department of Justice (DOJ) said \"neither ICE leadership nor its field offices have been directed to meet any numerical quota or target for arrests, detentions, removals, field encounters, or any other operational activities that ICE or its components undertake in the course of enforcing federal immigration law.\"\nWhy It Matters\nWhite House officials have previously referenced a daily goal of at least 3,000 arrests. President Donald Trump has ordered his administration to remove millions of migrants without legal status to fulfill his campaign pledge of mass deportations. The Republicans' hard-line immigration policy has raised concerns over racial profiling from immigrant rights advocates.\nWhat To Know\nIn May, Axios reported that Trump aide Stephen Miller and Secretary of Homeland Security Kristi Noem were pressuring ICE to increase daily immigration arrests to three times the number recorded at the beginning of Trump's presidency, signaling a shift toward a more aggressive enforcement strategy.\nMiller, the White House deputy chief of staff for policy and a homeland security adviser, told Fox News host Sean Hannity at the time that the agency was looking to hit 3,000 ICE arrests per day.\nIn the government's filing on Friday, attorneys said claims of a policy mandating 3,000 immigration arrests per day appeared to stem from media reports quoting a White House adviser, who characterized the number as a \"goal\" the administration was \"looking to set\" rather than an official directive or mandate.\n\"That quotation may have been accurate, but no such goal has been set as a matter of policy, and no such directive has been issued to or by DHS or ICE,\" attorneys wrote in court filings.\nThe filing is part of an ongoing lawsuit in Southern California, where immigrant advocacy organizations have accused the Trump administration of carrying out unconstitutional immigration enforcement operations in the Los Angeles area.\nWhen federal judges sought clarification about that number last week, the administration denied the existence of any quota. This denial contradicted claims made in a lawsuit alleging that the high pressure to meet arrest targets led ICE to carry out unlawful raids in Los Angeles.\nDuring the July 28 appeal hearing, Judge Ronald M. Gould pressed Department of Justice attorney Jacob Roth to explain the origin of the reported 3,000 daily arrest target, asking whether it came from ICE, the president or another official, Los Angeles Daily News reported. Roth said he was not aware of any such policy, according to the outlet.\nThere were about 11 million undocumented immigrants living in the United States as of 2022, according to Pew Research Center. Trump has vowed to deport 1 million people in a year.\nWhat People Are Saying\nWhite House deputy chief of staff Stephen Miller told Hannity in May: \"We are looking to set a goal of a minimum of 3,000 arrests for ICE every day and President Trump is going to keep pushing to get that number up higher each and every single day so we can get all of the Biden illegals that were flooded into our country for four years out of our country.\"\nA Department of Justice spokesperson told Newsweek: \"The entire Trump Administration is united in fully enforcing our nation's immigration laws, and the DOJ continues to play an important role in vigorously defending the President's deportation agenda in court.\"\nTricia McLaughlin, a spokesperson for the Department of Homeland Security, said in a statement shared with Newsweek: \"Under Secretary Noem, we are delivering on President Trump's and the American people's mandate to arrest and deport criminal illegal aliens to make American safe. Secretary Noem unleashed ICE to target the worst of the worst and carry out the largest deportation operation of criminal aliens in American history.\"\nDepartment of Justice attorney Jacob Roth wrote in a letter to the court: \"Enforcement activity is firmly anchored in binding legal constraints—constitutional, statutory, and regulatory requirements that apply at every stage, from identification to arrest to custody—with multiple layers of supervisory review to ensure compliance with the law. This framework, not anonymous reports in the newspapers, governs ICE's operations.\"\nWhat Happens Next\nA ruling is expected in the coming months as the court weighs the scope of ICE's enforcement authority.\nUpdate 8/4/25, 10:06 a.m. ET: This article was updated with comments from the Department of Justice and the Department of Homeland Security.\nAbout the writer\nBillal Rahman is an immigration reporter based in London, U.K. He specializes in immigration policy and border security. He has ... Read more"
    },
    {
      "url": "https://www.newsweek.com/topic/cia",
      "text": "RFK assassination: what newly released files reveal\nThe CIA has released 54 declassified documents about Robert F. Kennedy's 1968 assassination.\nCIA locks front gates of HQ as female driver shot\nThe CIA gates are closed \"until further notice\" after the security incident at its headquarters in Virginia.\nMichael Gloss obituary removed after he died fighting for Russia\nMichael Gloss, the son of a senior CIA official and an Iraq War veteran, died in April 2024 while fighting in Ukraine.\nTop CIA official's son killed fighting for Russia: Father speaks out\nMichael Gloss died on April 4, 2024, of massive blood loss during an artillery barrage in Ukraine, trying to aid a wounded comrade, his father said.\nSignal war plans messages disappear from CIA director's phone\nHurley Blankenship, CIA's chief data officer, said \"substantive messages\" were not present.\nWho is Arthur Petrov? Man accused of stealing US tech returned to Russia\nRussia's Federal Security Service (FSB) confirmed his return to Russia on Thursday.\nJessica Aber death update as police say no foul play suspected\nConspiracy theories have swirled about the death of the former US Attorney for the Eastern District of Virginia.\nUnredacted JFK files reveal details of \"most valuable defector\" in Cold War\nDetails regarding Anatoliy Golitsyn have been unredacted in the latest release of files about the assassination of President John F. Kennedy.\nWhat JFK files release says about Lee Harvey Oswald\nThe new JFK files show that Oswald was determined not to be a KGB asset.\nMan making threats at CIA HQ, bomb squad called in\nA man was seen making threats at the CIA headquarters in Virginia.\nCIA \"responsible\" for JFK assassination, agent says in released files\nA file released by the Trump administration repeats allegations from a CIA agent that the agency had a hand in Kennedy's death.\nLee Harvey Oswald was 'poor shot,' JFK files release reveals\nKGB files also documented Oswald's \"stormy\" relationship with his wife, Marina\nWhat we know about the alleged CIA facility briefly revealed by DOGE\nMuch of the Virginia complex housing what is believed to be a CIA facility was listed as for sale by DOGE this week.\nU.S. cut Ukraine off NATO's intelligence channel: Reports\nThe U.S. has removed its top-level security classification, the head of the CIA appeared to confirm amid a flurry of reports in the British media.\nUS \"spies abroad\" could be exposed via payments accessed by DOGE: Report\nDOGE employees accessing the Treasury's payment system could endanger American spies, according to one official.\nCIA names risk exposure after Trump demands unclassified email list\nThe CIA sent an email to the White House listing its recent hires, potentially exposing new hires' identities and risking their security.\nNew CIA director initiates buyouts to align agency with Trump admin goals\nJohn Ratcliffe has promised big changes, saying the agency has strayed from its original focus.\nCIA offers buyouts to entire workforce in intelligence agency first: Report\nThe CIA on Tuesday reportedly became the first intelligence agency to offer buyouts to its entire workforce.\nMissouri sues China: What we know\nThe Show Me State vows to seize $25 billion in Chinese assets if Beijing doesn't pay damages related to the outbreak of COVID-19.\nCIA backs COVID lab leak theory: What we know\nThe virus that started the COVID-19 pandemic most likely originated from a lab in China, the CIA said in a new assessment, though it has no conclusive evidence.\nTrump's order declassifying JFK files praised by his detractors\nJohn F. Kennedy's assassination has been the subject of enduring public fascination since he was killed in 1963.\nDonald Trump's second Cabinet member confirmed, John Ratcliffe to lead CIA\nA former federal prosecutor and Texas Republican, Ratcliffe gained prominence as a congressman as a staunch defender of Trump.\nTrump CIA pick John Ratcliffe: \"We're not where we're supposed to be\"\nRatcliffe identified China as the U.S.'s greatest geopolitical rival as he testified before the Senate on Wednesday.\nSteve Bannon counters Donald Trump's CIA demand: \"Part of the problem\"\nTrump ally Steve Bannon breaks with the president-elect over calls for the CIA to become involved in domestic affairs.\nEx-CDC director says \"possible\" US created viruses in China\nRobert Redfield, who led the CDC during Trump's first term, said \"it's possible\" that U.S. intelligence agencies were helping create viruses in a Wuhan lab.\nCIA \"greatly complicated\" Havana Syndrome treatment: Senate\nWhile a Senate report has brought renewed attention to Havana Syndrome, many questions remain unanswered.\nWhat is MKULTRA? CIA secret 'mind control' program records unsealed\nThe collection includes over 1,200 documents detailing experiments with drugs, hypnosis and other mind control techniques.\nWhat Donald Trump has said about JFK's assassination\nPresident-elect Donald Trump has vowed to release the remaining files related to President John F. Kennedy's assassination.\nDaughters of Malcolm X sue law enforcement agencies over his assassination\nThe late civil rights leader's family accuses law enforcement agencies of being involved in the1965 assassination plot.\nChina blasts CIA for attempt to recruit Chinese spies\nEarlier this month, the CIA uploaded a video guide advising Chinese speakers on how to securely share information with the agency."
    },
    {
      "url": "https://www.newsweek.com/topic/department-of-homeland-security",
      "text": "Green-card applicants face major change after court ruling\nCourt sides with immigrant investors, reshaping EB-5 timeline and easing green-card hurdles.\nTrump administration says teenagers can now be ICE agents\nICE is offering incentives including signing bonuses of up to $50,000, student loan forgiveness and extensive overtime opportunities.\nSouth Park mocks White House over Homeland Security ICE post\n\"Wait, so we ARE relevant?\" South Park said in reference to the White House previously calling it irrelevant.\nMap shows countries with highest US visa overstay rates\nA map shows countries that would be affected by a State Department plan to require some visitors to pay visa bonds of up to $15,000.\nTrump administration issues new warning to states\nThe requirement is the Trump administration's latest effort to use federal funding to promote its views on Israel.\nTrump's deportation quota comes under scrutiny\nLawyers for the DOJ said \"neither ICE leadership nor its field offices\" were directed to meet any numerical quota for arrests.\nDonald Trump scores major win in Harvard fight\nThe university said it will comply with demands to turn over employment forms for thousands of university staff.\nICE denies giving Taco Bell number to immigration lawyer\nAn immigration attorney told Newsweek it was \"crazy\" that DHS accused her of fabricating a viral TikTok story about being given a Taco Bell number by ICE.\nDelta pilot arrested as Homeland Security agents raid cockpit\nOfficers \"stormed the cockpit\" of a Delta flight after it landed in San Francisco, according to one passenger on board.\nTrump admin makes fighting deportations over 400 percent more expensive\nThe U.S. Citizenship and Immigration Service (USCIS) also introduced updated fees for green card and TPS applicants.\nDHS responds to \"Cartel-Tok\" videos of drug smuggling going viral\nThe content appears to be of cocaine being processed and transported and includes footage of what seem to be dismembered limbs.\nTrump administration considering new method to issue H-1Bs\nThe lottery-based visa program could be replaced with a new weighted selection process.\nICE accessing Medicaid data raises privacy, health concerns\nICE will use Medicaid data to \"receive identity and location information on aliens,\" an agreement with the Health Department said.\nTrump admin makes major TPS change\nThe U.S. Citizenship and Immigration Service has begun updating the fees it charges applicants.\nICE says illegal immigrant dragged agent for a block in his van\nPresident Trump has granted federal immigration agents \"total authorization\" to defend themselves following recent clashes.\nCalifornia man in US for 30 years detained by ICE on 4th of July\nOn Independence Day, federal authorities carried out a workplace raid at The Santa Monica Palm Car Wash.\nTrump's new immigration rule targets undocumented residents\nTrump ends bond hearings for undocumented immigrants, sparking legal challenges and expanding detention nationwide. Newsweek's live blog is closed.\nTrump backs ICE crackdown as farmworkers say they feel 'hunted\nICE raids surge under Trump, leaving farmworkers fearing arrest, injury, and loss of income amid immigration crackdown. This live blog is closed.\nDonald Trump wants FEMA \"remade,\" not eradicated—DHS Secretary\nThe administration supported search and rescue operations in Kerr County, Texas, after at least 120 people died and dozens went missing in deadly floods.\nKristi Noem defends Texas floods response at TPUSA\nNoem and others have faced criticism for their response to the tragedy in which more than a hundred are dead or missing.\nHere's how much ICE agents earn and what their benefits look like\nThe agency is set to hire about 10,000 new officers following the passage of President Donald Trump's reconciliation bill.\nTrump admin reacts to Mahmoud Khalil's $20 million lawsuit against DHS\nThe legal claim marks a significant step toward potential civil litigation and comes as Khalil's case continues in immigration court.\nWho is Benjamin Song? Hunt launched for US veteran after ICE 'ambush'\nAuthorities are searching for Song in connection with an attack outside a U.S. Immigrations and Customs Enforcement detention facility in Texas on July 4.\nKristi Noem describes emotional visit to Texas camp ravaged by flood\nSecretary of Homeland Security Kristi Noem's voice broke as she recounted her emotional visit to Camp Mystic in Texas.\nTrump administration ends 25-year migrant protections for two countries\nThe Department of Homeland Security is revoking Temporary Protected Status for thousands more immigrants.\nOfficer shot during attack on Texas ICE detention facility\nAn unknown number of suspects vandalized the Immigration and Customs Enforcement detention facility outside Prairieland, Texas.\nL.A. protesters, law enforcement clash in July Fourth demonstration\nThe Los Angeles demonstrators gathered on the Fourth of July to protest federal immigration enforcement.\nMexican President Claudia Sheinbaum responds to renowned boxer's ICE arrest\nSheinbaum commented on the arrest of boxer Julio César Chávez Jr. at a news briefing on Friday.\nNewlywed detained by ICE for 140 days says she was treated 'like cattle'\n\"I was handcuffed for 16 hours without any water or food on the bus,\" Ward Sakeik said at a press conference after her release from ICE detention."
    },
    {
      "url": "https://www.newsweek.com/green-card-mom-us-47-years-detained-ice-2110263",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nPang Nhia Hang Bailey, a mother of four who has been living in the U.S. for over four decades, has been detained by Immigration and Customs Enforcement (ICE) since late July.\nNewsweek has confirmed in the ICE detention database that she is being held in South Louisiana ICE Processing Center.\nNewsweek has reached out to ICE and U.S. Citizenship and Immigration Services (USCIS) for comment via email on Thursday.\nWhy It Matters\nPresident Donald Trump pledged to launch the largest mass deportation operation in U.S. history and has overseen an immigration crackdown since returning to office.\nImmigrants residing in the country illegally and legally, with valid documentation such as green cards and visas, have been detained. The Trump administration has deported thousands of people to their countries of origin, as well as a smaller percentage to third countries with U.S. agreements. It has also encouraged individuals without proper documentation to self-deport.\nWhat To Know\nPang Bailey, 53, was born in Laos in 1972 and shortly after was brought to France as a refugee in 1973, her husband Scott Bailey wrote in a GoFundMe set up on her behalf.\nHe noted in the post that she then came to the U.S. as a refugee in 1978. Pang Bailey is of Hmong descent, an ethnic group that played a significant role in assisting the U.S. in the Vietnam War. There are an estimated 360,000 people in the U.S. who identify as Hmong according to 2023 estimates published by the U.S. Census Bureau, and the majority live in California and Minnesota.\nPang Bailey married her husband in 1999 and the couple share four children. According to the GoFundMe page her green card expired in 1995.\nPang Bailey and her husband were involved in a fraud scheme, according to two court cases reviewed by Newsweek. According to a June 1999 court docket, Magistrate Judge Donald Scheer dismissed a case alleging that Bailey and Pang Bailey \"knowingly execute[d] a scheme to defraud and to obtain money and funds under the care and custody of a financial institution by means of false and fraudulent pretenses and representations.\"\nMonths later, in February 2000 Bailey and Pang Bailey were indicted related to bank fraud. According to the court docket reviewed by Newsweek, Pang Bailey entered a plea of guilty in May 2000. It is not clear what her sentencing was.\nPang Bailey was detained on July 30, at what her husband called an \"annual report\" to immigration services. Bailey said that his wife was detained during her meeting with ICE, stating that she was then moved to Port Isabel Service Detention Center in Texas. She currently is held in the South Louisiana ICE Processing Center.\nMichigan state Representative Mai Xiong, Michigan's first Hmong American legislator wrote in an organizing Facebook post that around \"15 Hmong refugees were unexpectedly detained by ICE when they were asked to report to an ICE field office for an 'interview'.\"\nShe noted that many of the detained have never lived in Laos, but were born in refugee camps or quickly left after birth. Bailey noted in the GoFundMe that his wife has \"never lived\" in Laos. It is unclear where she may be deported to.\nThe Trump administration has maintained that it will arrest and deport illegal immigrants.\nWhat People Are Saying\nMichigan state Representative Mai Xiong, Michigan's first Hmong American legislator wrote in a Facebook post: \"These individuals were born in refugee camps in Thailand and came to the U.S. legally as children of Hmong veterans who served alongside America during the Vietnam War/Secret War in Laos. They are fathers, sons, husbands, one is a wife/daughter, loyal employees, taxpayers, and members of our community. Some lack legal representation while others are unable to speak English fluently.\"\nThe Asian Law Caucus said in a July 29 website post: \"Laos does not have a formal repatriation agreement with the U.S. Historically, Laos rarely issued travel documents for deportation. In June, 2025, the U.S. placed a partial travel ban on Laos and cut off visas for certain Lao individuals citing visa overstays and failure to cooperate with U.S. deportation policy.\"\nWhat Happens Next\nXiong is organizing a rally against ICE's recent actions toward Hmong refugees. The rally will take place in Lansing, Michigan outside of the State Capitol on August 8 at 5:30 p.m.\nAbout the writer\nMandy Taheri is a Newsweek reporter based in Brooklyn. She joined Newsweek as a reporter in 2024. You can get ... Read more"
    },
    {
      "url": "https://www.newsweek.com/topic/facebook",
      "text": "Mom in hospital was missing beloved cat—Her twins knew exactly what to do\nThe twins decided to surprise their mother with a special visit.\nCat doesn't like dachshund, viewers not prepared for what happens next\n\"It's a Trap! Run!!!!\" wrote one online viewer, while another commented: \"Do not let your guard down!\"\nHuskies left behind after owners moved out now seek a forever home\n\"Our humane agents just removed two young, beautiful huskies from a residence after the owners moved out and left them behind,\" the shelter wrote.\n13-year-old complained of \"shoulder pain,\" then came devastating diagnosis\nWhen Ashley Williams's son Dakarai complained about his shoulder, she put it down to \"growing pain.\" But something was very wrong.\nWoman sells couch on Facebook Marketplace, then gets urgent call from buyer\nThe woman went to the buyer's house and attempted to get her cat out from the couch.\nWoman goes to pick golden retriever—Shares moment puppy \"chose\" her instead\nDuring Valerie's visit, many puppies stood up against the pen, wagging their tails. But exhaustion took over and they all fell asleep, except for Beaux.\n5 ways Gen Z has changed the business world\nGeneration Z has rewritten the marketing rule book—fast, emotional, and funnel-free. Here is how they are changing everything.\nGolden retriever spends days in ICU—then brother's visit changes everything\nThe dog suffered a heart attack on July 6.\nAfter years of silence, nonverbal boy's favorite phrase has mom in stitches\nApril Perri told Newsweek her son started to be able to have conversations at 8 or 9, and it \"unlocked\" a different side of him.\nCheryl Hines drops big announcement after RFK Jr. anniversary message\nThe \"Curb Your Enthusiasm\" star posted on X for the first time since October.\nNationwide economic blackout on August 9: What to know about boycott\nThose organizing the boycott have urged Americans to refrain from making any purchases for 24 hours.\nGolden retriever has enough of dog's tantrum—proceeds to silence her\nThe begging dog wanted some of the owner's cheese and crackers.\nAbandoned dog found tied up with heartbreaking note: \"don't want him back\"\n\"We decided to foster him while we figure out who was the perfect home for him,\" Erica Loring told Newsweek\nAnne Burrell Food Network announcement branded 'tone-deaf' after death\n\"This is so distasteful,\" one fan wrote on social media.\nTears at dog's reaction to his human sisters coming home\n\"Their bond is truly something special. They've been inseparable from Day One,\" Ione Harvey told Newsweek.\nTeacher fired over Facebook post launches legal action\nSimon Pearson was fired after he described a jail sentence handed to a woman who made racially inflammatory comments as an example of \"two tier policy.\"\nLaura Loomer files new Supreme Court petition—\"Accountability is coming\"\n\"Everyone involved in what happened to me will pay a price,\" the conservative said on X.\nCheryl Hines sends message to RFK Jr. on anniversary\nThe Health and Human Services secretary responded to a fan's viral message about the \"Curb Your Enthusiasm\" star.\nJessie J gives update on cancer diagnosis: 'I couldn't breathe'\nThe singer detailed the scary experience to her social media followers on Monday.\nShelter scans stray dog's microchip—unprepared for the call that follows\nShelter operations manager Kylie Betler told Newsweek that \"microchipping and licensing your animals is the best way to reunite them back home.\nAre you the \"attractive\" one? Here's how it secretly shapes your love life\nExperts told Newsweek how being seen as the more-attractive partner can reshape intimacy, power, and emotional security.\nMom relaxes on couch with son and bump—4 days later, life changes forever\nEmmy Quinana told Newsweek: \"Looking back, it is definitely obvious that what I was feeling was not normal.\"\nPet parents play dog a recording of her cries—Her response is priceless\nThe pet camera captured the maltipoo's dramatic cries.\nTears as shelter dog with broken teeth patiently waits to be noticed\nCherie Wachter, VP of marketing at Humane Society of Broward County, told Newsweek that S'mores is a \"gentle girl.\"\nMillennial's theory on why \"we cannot complain\" about loneliness goes viral\nThe viral post called out millennials for canceling plans, sparking debate on loneliness and finding community.\n80 Years of 'Cool Girl': actor shares eye-opening take on female archetype\nTawny Platis broke down the \"cool girl\" trope by decade, telling Newsweek why women today are rejecting it entirely.\nMan thinking he got \"docile\" puppy quickly realizes he was wrong\nThe pup's energy level did a 180 after living at home with him.\nWoman loses husband to alcoholism, unprepared for message she then receives\n\"I share because society tends to have addiction all wrong,\" Annie Parker told Newsweek.\nTourists get dangerously close to bear—park ranger puts them in their place\nElizabeth told Newsweek that she and her husband \"see this a lot, going to many, many national parks, state parks, or really anywhere.\"\nJason Momoa shaves off beard for first time in six years\nMomoa showed off his new look in a video on Instagram, where he said, \"I hate it.\""
    },
    {
      "url": "https://www.newsweek.com/priests-daughter-detained-ice-routine-visa-hearing-new-york-2108286",
      "text": "🎙️ Voice is AI-generated. Inconsistencies may occur.\nYeonsoo Go, the 20-year-old daughter of local Episcopal priest Kyrie Kim, was detained by U.S. Immigration and Customs Enforcement (ICE) agents immediately following a routine visa hearing at Federal Plaza Immigration Court on Thursday, according to local news station ABC7 NY.\nNewsweek has reached out to ICE via email on Sunday afternoon for comment.\nWhy It Matters\nPresident Donald Trump has pledged to launch the largest mass deportation operation in U.S. history, with immigrants residing in the country both illegally and legally, including those with valid documentation such as green cards and visas, being detained.\nThe administration's deportation plan has seen an intensification of ICE raids across the country as well as reports of people being arrested at immigration appointments.\nWhat To Know\nGo, a South Korean native and Scarsdale High School graduate, immigrated from Seoul with her mother on a religious visa roughly four years ago and was in the process of switching to a student visa. After finishing her freshman year at Purdue University, where she is studying to become a pharmacist, Go was back home in Scarsdale, Westchester County, with her mother for the summer.\nHowever, conflicting accounts exist regarding her immigration status. Department of Homeland Security Assistant Secretary Tricia McLaughlin said Go \"overstayed her visa that expired more than two years ago\" and was placed in expedited removal proceedings following her July 31 arrest.\nGo's lawyer said the 20-year-old was ordered to appear in court on Thursday for a procedural hearing on her visa renewal application, ABC7 NY reported. However, after being given a date in October to return from the judge, she was detained by ICE agents once she left the building.\nA second woman, a 59-year-old named Ketty, a Peruvian asylum seeker, was also detained by federal agents as she left her routine asylum hearing the same day Go was.\nKetty had worked at her family's successful bakery in Peru until \"organized thugs\" threatened them with violence and death if they didn't pay a large sum of money, forcing them to flee the country, according to the New York Daily News. After crossing the border alone and arriving in New York three years ago, Ketty applied for asylum and followed all required procedures.\nThe two women are currently being held at 26 Federal Plaza, a facility that lacks basic amenities such as showers, beds, or hot food. Go has complained to her mother that agents \"barely let her have her glasses\" and hasn't been given a change of clothes, the newspaper reported.\nBoth detentions sparked weekend protests, with approximately 75 faith leaders and advocates gathering outside 26 Federal Plaza on Saturday morning to demand their release.\nWhat People Are Saying\nDHS Assistant Secretary Tricia McLaughlin said in a statement: \"President Trump and Secretary [Kristi] Noem are committed to restoring integrity to the visa program and ensuring it is not abused to allow aliens a permanent one-way ticket to remain in the U.S.\"\nShe added: \"Those who are in our country illegally have a choice—they can leave the country voluntarily or be arrested and deported. The United States taxpayer is generously offering free flights and a $1,000 to illegal aliens who self-deport using the CBP Home app. If they leave now, they preserve the potential opportunity to come back the legal, right way. The choice is theirs.\"\nEpiscopal Diocese of New York Reverend Matthew Heyd told ABC7 NY: \"Her mother gets regular calls from Yeonsoo and she's staying at 26 Federal Plaza, which, as we know, is not actually a facility that has showers or beds or hot food. And so the detentions here are not only illegal, but they're immoral.\"\nNew York Immigration Coalition President Murad Awawdeh told the New York Daily News: \"They are showing up, following the rules of the letter of the law. And what is this telling people? That if you go to your court hearing, you may not make it out, but if you miss it, you definitely will be deported? This is not a system of justice. This is a system of injustice.\"\nWhat Happens Next?\nImmigration advocates recommend that anyone with upcoming immigration court hearings contact the New York State Office of New Americans hotline, create a family preparedness plan, and work with lawyers to arrange virtual hearings when possible.\nCommunity members continue to rally for both women's release, while their cases proceed through the immigration system.\nIs This Article Trustworthy?\nIs This Article Trustworthy?\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nNewsweek is committed to journalism that is factual and fair\nWe value your input and encourage you to rate this article.\nAbout the writer\nAdeola Adeosun is the Newsweek Weekend Night Editor based in Atlanta, Georgia. Her focus is reporting on U.S. national news, ... Read more"
    }
  ],
  "argos_summary": "ICE has detained 16 migrants from Southeast Asian communities, primarily Hmong and Laotian, in Detroit, sparking concerns from immigrant rights advocates. The arrests, which included individuals with criminal records, occurred during routine appointments, raising fears of aggressive enforcement tactics reminiscent of the Trump administration's policies. Local lawmakers and community members are advocating for the immediate release of the detainees, many of whom have never lived in Laos and were brought to the U.S. as children.",
  "argos_id": "2M20W3S14"
}