{
  "url": "https://www.bloomberg.com/news/videos/2025-08-07/balance-of-power-late-edition-8-06-2025-video",
  "authorsByline": "bn",
  "articleId": "70da58b6a6a3468ba8169dd97d980f46",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/isU4lfK8_Qtg/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-07T00:22:57.837000+00:00",
  "addDate": "2025-08-07T00:47:49.883768+00:00",
  "refreshDate": "2025-08-07T00:47:49.883769+00:00",
  "score": 1.0,
  "title": "Apple Invests $600B in US After Trump Tariff Threats",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, President Trump and Apple CEO Tim Cook announce Apple investing a total of $600 billion dollars into the US and the President stating he will place 100% tariffs on chips and semiconductors. (Source: Bloomberg)",
  "content": "TODAY WITH BREAKING NEWS. THE PRESIDENT OF THE UNITED STATES HOLDING AN EVENT AT THE WHITE HOUSE ANNOUNCING A $100 BILLION COMMITMENT COMMITMENT BY APPLE FOR DOMESTIC MANUFACTURING. APPLE'S CEO TIM COOK IS ON HAND FOR THE ANNOUNCEMENT. IT COULD BEGIN AT ANY TIME. ON BLOOMBERG TV, WE HAVE A LIVE VIEW OF THE WHITE HOUSE. WE ARE STANDING BY TO HEAR FROM THE PRESIDENT. WE ARE ALSO GOING TO BRING YOU NEWS ON THE POTENTIAL MEETING BETWEEN PRESIDENT TRUMP AND VOLODYMYR ZELENSKYY. PRESIDENT TRUMP ABOUT TO JOIN THINGS PRETTY CLOSE TO THE TOP OF THE HOUR HERE. ACCUSING TWO OF THE NATION'S LARGEST BANKS OF THE BANKING, SOMETHING WE MIGHT GET TO IN A MOMENT WITH SEVERAL BANKING CEOS. WE START OFF WITH LAURA DAVIS IN WASHINGTON. IT'S A BIG MOMENT FOR THE PRESIDENT AND TIM COOK, THE LATEST IN A SERIES OF ANNOUNCEMENT. IN MANY CASES IT IS MONEY THAT HAS ALREADY BEEN ANNOUNCED. IS THIS NEW CASH? WHERE IS THIS GOING? > > WE HAVE SEEN NVIDIA AND OTHER COMPANIES ANNOUNCING BIG NUMBERS THAT TRUMP LIKES. CLEARLY TIM COOK KNOWS HOW TO PLAY THE GAME WITH TRUMP. HE WAS THE ONLY CEO FIRST TERM THAT WAS ABLE TO CRACK THE CODE WITH TRUMP AND AVOID A LOT OF TARIFFS. IT SHOULDN'T BE SURPRISING THIS ANNOUNCEMENT IS COMING JUST AN HOUR AFTER THEY FIRST ROUND OF TARIFFS ARE SET TO HIT AT MIDNIGHT. TIM COOK HAS BEEN GOOD ABOUT TRYING TO GET SOME OF THESE EXCEPTIONS. > > APPLE STOCK TODAY UP $10, LITTLE MORE THAN 5%. DO WE BELIEVE IPHONES WILL START BEING MADE IN THE U.S.? > > THEY SAY IT IS DOMESTIC MANUFACTURING BUT ANY OTHER PLANTS WILL TAKE YEARS TO GET UP AND RUNNING. PLUS, LABOR FORCE ISSUES, GETTING COMPONENTS TO MAKE THEM HERE. IT'S NOT CLEAR IF THIS IS JUST AN ANNOUNCEMENT OR IF THERE WILL BE FOLLOW-THROUGH AFTERWARDS. JOE: THAT SAID, WE WILL HEAR FROM THE PRESIDENT AND BRING THE REMARKS TO OUR AUDIENCE LIVE IN A MOMENT. HE IS SPENDING TIME WITH A LOT OF CEOS AT THE WHITE HOUSE. IT FULFILLS THE IDEA OF MORE INVESTMENT IN THE U.S., FREQUENTLY CITED BY THE ADMINISTRATION AS A REASON TO WORRY LESS ABOUT THE COST OF TARIFFS. THAT THE INVESTMENT IS HAPPENING. REASSURING IS TAKING PLACE IN THE COUNTRY. WILL TIM COOK AGREE WITH THAT FEEL? > > IT IS INTERESTING. TRUMP LIKES TO SURROUND HIMSELF WITH CEOS. WE SAW BANK CEOS LAST WEEK. JAMIE DIMON AND GOLDMAN SACHS CEO JAMIE'S SOLOMON AS WELL. HE LIKES TO BOUNCE IDEAS. HE ASKS WHAT DO YOU THINK ABOUT THIS TARIFF, THIS POLICY, OR THIS PERSON AS FED CHAIR? JOE: FOR A LOOK AT THE ECONOMIC IMPLICATIONS AROUND THE EVENT AND THE NEWS ABOUT THE SOON TO BE VACANCY ON THE FEDERAL RESERVE, BLOOMBERG'S MICHAEL MCKEE JOINS US LIVE. THE ADMINISTRATION HAS A STORY TO TELL. YOU TALK TO THE PRESIDENT'S ECONOMIC ADVISERS ABOUT CORPORATE INVESTMENT DOMESTICALLY. APPLE IS THE POSTER CHILD TODAY. TO WHAT EXTENT WILL THIS HELP GROW THE ECONOMY AND PRODUCE JOBS? MICHAEL: IF -- IT WOULD IF THERE IS A LOT OF FOLLOW-THROUGH, BUT WE DON'T KNOW IF THIS IS AN ACTUAL COMMITMENT FROM A SIGNED CONTRACT SORT OF THING. OR IF THIS IS JUST TELLING DONALD TRUMP WHAT HE WANTS TO HEAR. APPLE ANNOUNCED THEY WOULD PUT IN FIVE HUNDRED BILLION DOLLARS OVER THE NEXT FOUR YEARS IN INVESTMENTS. THAT IS EXACTLY WHAT THEY TOLD THE DIED WHEN THEY BEGAN. AND WHAT THEY TOLD THE FIRST TRUMP ADMINISTRATION. IT'S NOT CLEAR HOW MUCH OF THIS STUFF GETS DONE. IF WE GET A LOT OF INVESTMENT IN PLANTS, IT WOULD BE GOOD NEWS FOR THE ECONOMY OVERALL. JOE: THE IDEA OF A FILLON FED GOVERNOR. THE PRESIDENT GAVE US INSIGHTS INTO THE SEARCH FOR A NEW FED GOVERNOR YESTERDAY. LET'S LISTEN. PRES. TRUMP: I WILL BE MAKING THAT DECISION BEFORE THE END OF THE WEEK. WE WILL EITHER DECIDE ON ONE FOR PERMANENCE OR A FOUR MONTHS PERIOD. THERE IS A TERM OF ABOUT THE NUMBER OF MONTHS. WE HAVE A COUPLE CANDIDATES. EVERYBODY WANTS IT. IT IS NOT A COUPLE. BUT WE NARROWED IT TO A COUPLE CANDIDATES. WE ARE LOOKING AT THE FED CHAIR. IT IS DOWN TO FOUR PEOPLE RIGHT NOW. JOE: BLOOMBERG IS REPORTING THE SELECTION MIGHT TAKE SOME TIME. THE WAY TO BUY TIME IS TO BASICALLY APPOINT A TEMPORARY FED GOVERNOR. MICHAEL MCKEE, HOW DOES THIS WORK? WHAT IS THE POINT? SONALI: -- MICHAEL: TWO GOOD QUESTIONS. YOU COULD NOMINATE SOMEBODY TO BE A TEMPORARY REPLACEMENT. THE FIVE MONTHS LEFT IN THE TERM. GIVEN THE SENATE CALENDAR AND THE WAY CONGRESS WORKS IT IS DOUBTFUL THIS PERSON WOULD GET MORE THAN THREE MONTHS OR TWO MONTHS IN OFFICE. THERE WILL ONLY BE AFTER SEPTEMBER 17, THREE MORE MEETINGS AT WHICH THAT PERSON COULD VOTE. SO PROBABLY IT IS ALSO MEANINGLESS IN TERMS OF WHAT THE POLICY WILL BE OF THE FED. WE HAVE A MORE AND MORE FED OFFICIALS INCLUDING LISA COOK AND MARY DALY SUGGESTING THEY ARE OPEN TO THE IDEA OF A RATE CUT IN SEPTEMBER. THAT MIGHT HAPPEN NO MATTER WHAT HAPPENS WITH THE APPOINTMENT. WHETHER THE PRESIDENT APPOINTS SOMEBODY THAT WOULD ADVOCATE FOR A RATE CUT OR GIVE JAY POWELL A HARD TIME. IF THE MAJORITY STARTS THINKING THEY SHOULD CUT RATES, WE SHOULD PROBABLY -- WE WILL PROBABLY GET A RATE CUT AND THIS SEAT WON'T MATTER. JOE: WE TURN BACK TO THE INVESTMENT FROM APPLE AND TIM COOK'S DECISION TO ATTEND THE EVENT OF THE WHITE HOUSE THAT COULD BEGIN ANY TIME. BLOOMBERG'S APPLE EXPERT MARK GURMAN JOINS US FROM OUR LOS ANGELES BUREAU. YOU HAVE TOLD US THAT APPLE WILL NEVER MAKE THE IPHONE IN THE UNITED STATES. WHAT IS THE INVESTMENT FOR? MARK: I DON'T WANT TO SAY NEVER BECAUSE THE FUTURE IS LONG. BUT IF YOU PUT NEVER IN THE CATEGORY OF FOR AS LONG AS TRUMP IS NEVER, WE CAN SEE NEVER. THEY WILL START MANUFACTURING 100% OF THE DISPLAY COVER CLASS ON APPLES AND IPHONES IN THE U.S. VIA CORNING IN KENTUCKY. CORNING HAS PRODUCED A GLASS FOR IPHONES IN KENTUCKY SINCE THE ORIGINAL IPHONE. STEVE JOBS MADE THAT DECISION WITH TIM COOK AND APPLES FORMER COO JEFF WILLIAMS. NOW IT IS EXPANDING TO THE WATCH AND ALL IPHONES SOLD GLOBALLY. IT IS A BIG WIN FOR TRUMP, FAR FROM THE MASS MANUFACTURING HE HAD BEEN HOPING FOR. > > APPLE'S STOCK MOVED UP 5% ON THIS DELAY. > > YES, IT IS A WIN FOR APPLE BECAUSE THE EXPECTATION IS TIM COOK DID SOMETHING NICE FOR TRUMP. NOW HE CAN SAY HE GOT ONE OF THE BIGGEST COMPANIES IN THE HISTORY OF THE COUNTRY TO DO SOMETHING REALLY BIG IN THE U.S., EVEN IF THEY HAVE ALREADY BEEN DOING IT, FOR THE MOST PART, IN THE U.S.. NOW THEY CAN GIVE TIM COOK A NICE BOOK -- BREAK ON TARIFFS. THAT IS HOW IT ROLLS WITH THE PRESIDENT AND TIM COOK IS PLAYING THE GAME. YOU CAN'T REALLY FAULT HIM FOR IT. JOE: IN THE OVAL OFFICE A PODIUM HAS BEEN SET UP NEXT TO THE RESOLUTE DESK. DO WE EXPECT TIM COOK TO SPEAK AT THE EVENT? HOW DO WE DESCRIBE THEIR RELATIONSHIP? IT SEEMS ON AGAIN OFF AGAIN. BUT IT HAS TO BE A GOOD SIGN. > > I EXPECT TIM COOK TO SPEAK. I WOULD BE SHOCKED IF HE DID NOT. OTHERWISE I DON'T SEE THE REASON FOR HIM TO BE THERE. IT IS A SIGNIFICANT FOCUS THERE. THERE ARE A BUNCH OF PEOPLE FROM THE APPLE BRASS THEY'RE EXPECTING TO REITERATE HIS REMARKS ABOUT COMMITTING TO THE U.S.. AS FOR THEIR FURTHER RELATIONSHIP, I CAN'T SPEAK TO HOW THEY FEEL ABOUT EACH OTHER ON A PERSONAL LEVEL. ALL THINGS CONSIDERED, IT LOOKS LIKE AN EXTREMELY HARMONIOUS BUSINESS WORKING RELATIONSHIP. JOE: GREAT TO HAVE YOU. WE WILL BRING YOU IN THE EVENT WHEN IT BEGINS. VONNIE QUINN HAS BEEN ON HAND MONITORING THE EVENT PREPARING FOR IT TO BEGIN WITH MARKET REACTION TO APPLE IS TODAY. SHE JOINS US FROM HEADQUARTERS IN NEW YORK. VARNEY: EVEN WITH THE RALLY TODAY, 5% FOR APPLE, THE STOCK IS ONLY UP 3% YEAR-OVER-YEAR. YEAR-TO-DATE IT IS DOWN ALMOST 15%. IT'S NOT LIKE THE RALLY WILL DO MUCH FOR THE STOCK OVERALL. IT DID HELP TODAY'S MARKET ENVIRONMENT. I WANT TO POINT OUT THAT $800 BILLION HAD TO BE EATEN BY APPLE AND IN THE LATEST QUARTER. WE HEARD THAT FROM TIM COOK'S ON HIS EARNINGS CALL. HE PROJECTED 1.1 BILLION DOLLARS THANKS TO TARIFFS EATEN IT NEXT QUARTER. WITH THOSE TWO FIGURES, $600 BILLION OVER THE NEXT FEW YEARS PALES IN COMPARISON. THERE IS AN INTEREST IN THE -- ON THE PART OF APPLE TO BE INVESTING IN AMERICA TO THAT EXTENT. IF THERE IS ANY CHANCE THAT HELPS WITH CARVEOUTS OR 232 INVESTIGATIONS, THAT IS ALL TO COME. I WANT TO POINT OUT TODAY'S ACTION. THE APPLE STORY SET THE TONE FOR TODAY'S EQUITY RALLY. WE SAW THAT RESUME AGAIN. THE S & P 500 UP .75% AFTER A DOWN DAY YESTERDAY. THE NASDAQ 100 UP 1.3 PERCENT. OTHER MAGNIFICENT 7 NAMES PULLED BACK A LITTLE BIT. IN RELATION TO APPLE, NVIDIA IS UP 17% YEAR-OVER-YEAR. WE ARE REALLY SEEING SOME OF THE MAGNIFICENT 7 STEP OUT AND OTHER IT'S A AGAIN. TESLA AND APPLE TODAY. WE ALSO SAW TREASURIES NOT DOING TOO MUCH. I WILL LEAVE IT THERE AND JOE CAN EXPLAIN MORE LATER. JOE: OBVIOUSLY IT WAS A BIG DAY FOR APPLE, ONE THAT IS NOT OVER YET WHEN THE PRESIDENT STARTS SPEAKING. IN THE OVAL OFFICE WE HAVE SECRETARY BESSENT AND SECRETARY LUTNICK STANDING BY. AS WE AWAIT FOR THE PRESIDENT WE TURN TO THE CONGRESSMAN JAKE OFTEN TOSSED OF MASSACHUSETTS. THERE HAS BEEN A LOT OF TALK ABOUT TOWN HALLS AND REDISTRICTING AND I KEEP HEARING MASSACHUSETTS,. THE PRESIDENT MENTIONED YOUR STATE LAST EVENING AS AN EXAMPLE OF DEMOCRATS GERRYMANDERING THEMSELVES INTO AN ALL DEMOCRATIC DELEGATION. I APOLOGIZE TO IT YOU IN ADVANCE IF WE HAVE TO INTERRUPT YOU. WHAT IS YOUR THOUGHTS ON TEXAS. IF REPUBLICANS SUCCEED IN RETRYING THE CONGRESSIONAL MAP, WHAT WILL BE THE DEMOCRATS ANSWER? > > WE WILL PUT ON OUR BRASS KNUCKLES TOO. WE CAN'T ALLOW REPUBLICANS TO RIG THE MAPS TO DISENFRANCHISE AMERICANS IN PURSUIT OF CRAVEN POLITICAL POWER. AS WE WRESTLE IN THE MUD WE WANT TO AIM AMERICANS TO A HIGHER PLANE. WE SHOULD CAMPAIGN ON AN ANTICORRUPTION PLATFORM INCLUDING ABOLISHING PARTISAN PRIMARIES, INDEPENDENT REDISTRICTING COMMISSIONS, AND TO OVERTURNING CITIZENS UNITED TO GET DARK MONEY OUT OF POLITICS. JOE: IT COULD BE CALIFORNIA THAT WILL COME FIRST. WE ARE SEEING PRESIDENT TRUMP THE OVAL OFFICE NOW, STANDING BESIDE APPLE'S CEO, TIM COOK. WE WILL JOIN THIS CONVERSATION IN A MOMENT WHEN THEY GET TO THE BUSINESS AT HAND. CALIFORNIA HAS BEEN CITED AS THE MOST LIKELY OPPORTUNITY FOR DEMOCRATS TO REDRAW MAP AND MEET REPUBLICANS IN THIS EXERCISE. DO YOU SEE IT THAT WAY? WE WILL JOIN DONALD TRUMP NOW. THE PRESIDENT IS LIVE ON BLOOMBERG. PRES. TRUMP: THIS HORRIBLE PERSON. THIS AFTERNOON WE ARE PLEASED TO WELCOME TO THE WHITE HOUSE ONE OF THE GREAT AND MOST ESTEEMED BUSINESS LEADERS AND GENIUSES AND INNOVATORS ANYWHERE IN THE WORLD, APPLE CEO TIM COOK. AMAZING JOB. THANK YOU AS WELL TO SECRETARY OF THE TREASURY SCOTT BESSENT AND SEC. OF COMMERCE HOWARD LUTNICK FOR BEING HERE, WHEREVER YOU MAY BE. TODAY, APPLE IS ANNOUNCING IT WILL INVEST $600 BILLION INTO THE UNITED STATES OVER THE NEXT FOUR YEARS. IT IS ONE HUNDRED BILLION DOLLARS MORE THAN THEY WERE ORIGINALLY GOING TO INVEST. IT IS THE LARGEST INVESTMENT APPLE HAS EVER MADE IN AMERICA. AND ANYWHERE ELSE. IT IS AN HONOR TO HAVE YOU. APPLE HAS BEEN AN INVESTOR AROUND THE COUNTRY. I WON'T SAY WHICH ONES, BUT A COUPLE. THEY ARE COMING HOME. $600 BILLION. IT IS THE BIGGEST THERE IS. THE COMPANY IS UNVEILING ITS AMBITIOUS NEW AMERICAN MANUFACTURING PROGRAM THAT WILL BRING FACTORIES AND ASSEMBLY LINES ACROSS OUR COUNTRY ALL ROARING TO LIFE. AREAS THAT WEREN'T DOING WELL ARE DOING VERY WELL. WE HAVE ABOUT $17 TRILLION COMING INTO THE UNITED STATES, MORE THAN EVER BEFORE. IT HAS NOT EVEN COME CLOSE. THERE HAS NOT BEEN ANYTHING LIKE IT. WE HAVE COMMITMENTS OF MORE THAN $17 TRILLION AS OF A COUPLE WEEKS AGO. THESE INVESTMENTS WILL DIRECTLY CREATE MORE THAN 20,000 BRAND-NEW AMERICAN JOBS AND MANY THOUSANDS MORE AT APPLE SUPPLIERS LIKE CORNING, BROADCOM, TEXAS INSTRUMENTS, AND SAMSUNG. THEY WILL ALL DEAL IN THAT WORLD. AS PART OF THE HISTORIC COMMITMENT, APPLE WILL MASSIVELY INCREASE SPENDING ON ITS DOMESTIC SUPPLY CHAIN FOR THE IPHONE AND BUILD THE LARGEST, MOST SOPHISTICATED SMART PRODUCTION LINE IN THE WORLD. IN HARRISBURG, KENTUCKY, AND I DID VERY WELL THERE. I LIKE IT BECAUSE I SEE I DID VERY WELL THERE. I DID VERY WELL IN KENTUCKY. IT IS A GREAT PLACE. YOU WILL BE VERY HAPPY. I THOUGHT I WOULD ENTER MY OWN SPEECH. TO SHOW MORE ABOUT THE PRODUCT YOU WILL BE DOING IN KENTUCKY. > > THIS WAS MADE IN THE U.S. IN CALIFORNIA. THIS ONE COMES OFF THE CORNING LAWN. IT IS A UNIQUE UNIT OF ONE. IT WAS DESIGNED BY A U.S. MARINE CORPS CORPORAL. AND, THE BASE COMES FROM UTAH. IT IS 24 KARAT GOLD. JOE: TIM COOK IS SPEAKING TO THE FOLKS ASSEMBLED IN THE OVAL OFFICE NOW. WE WATCH ON BLOOMBERG TV LISTENING ON BLOOMBERG RADIO AS HE SHOWS A PIECE OF GLASS TO THOSE IN THE ROOM. THE COMPANY WILL BE USING CORNING CLASSMATE HERE IN THE U.S., IN KENTUCKY. THE PRESIDENT IS BACK AT THE PODIUM. > > IT IS NICE WE ARE NOW DOING THESE THINGS IN THE UNITED STATES INSTEAD OF IN OTHER, FAR AWAY COUNTRIES. IT IS A STEP TOWARDS THE GOAL OF ENSURING IPHONES SOLD IN THE UNITED STATES OF AMERICA ARE ALSO MADE IN AMERICA WITH A MASSIVE INFUSION OF CAPITAL. APPLE WILL BUILD A 250,000 SQUARE-FOOT SERVER MANUFACTURING FACILITY IN HOUSTON AND INVESTED BILLIONS OF DOLLARS TO CONDUCT DATA CENTERS ACROSS THE COUNTRY FROM NORTH CAROLINA TO IOWA TO OREGON. APPLE WILL OPEN A STATE-OF-THE-ART MANUFACTURING ECONOMY. IT WILL BE A MANUFACTURING ACADEMY IN DETROIT. IT IS A GREAT PLACE TO DO THAT. BIG THINGS ARE HAPPENING IN MICHIGAN AND DETROIT. THEY ARE COMING IN BECAUSE OF WHAT WE HAVE DONE WITH THAT GREAT BIG BEAUTIFUL BILL. I ADDED ONE WORD. GREAT. WE PROBABLY HAVE THE BIGGEST, MOST COMPREHENSIVE PIECE OF LEGISLATION EVER PASSED. IT WILL MEAN UNBELIEVABLE NUMBERS OF JOBS. THINK OF THIS. WHETHER IT IS TIPS OR OVERTIME OR SOCIAL SECURITY, NO TAX. NO TAX ON TIPS. NO TAX ON SOCIAL SECURITY. NO TAX ON OVERTIME. IT IS A SMALL BIT OF IT. FOR APPLE AND OTHER BUSINESSES, TALKING ABOUT THE DEDUCTIONS AND ALL THE THINGS. PEOPLE GO OUT AND BUY A CAR. THE FIRST TIME IT HAS EVER BEEN DONE. YOU TALK ABOUT DEDUCTIONS FOR COMPANIES. THEY WILL BE ABLE TO DEDUCT INTEREST WHEN THEY BORROW MONEY TO BUY A CAR IF IT IS MADE IN AMERICA. IT HAS TO BE MADE IN AMERICA. ONE OF THE REASONS I CAN SAY APPLE IS COMING HERE BECAUSE OF LEGISLATION WE JUST PASSED WITH THIS KIND OF INVESTMENT. APPLE WILL OPEN OTHER FACILITIES, RARE EARTH MAGNETS FROM TEXAS. AND TO BUILD A NEW RARE EARTH RECYCLING LINE IN MOUNTAIN PASS, CALIFORNIA. I KNOW THEY HAVE A LOT OF TRULY RARE EARTH. IT IS FANTASTIC. APPLE WILL DEVELOP AND MAINTAIN SEMICONDUCTORS AND SEMICONDUCTOR EQUIPMENT IN TEXAS, UTAH, ARIZONA, AND NEW YORK. FOR YEARS, AMERICANS HAVE WATCHED AS MEANING -- MANY OF OUR LEADING TECHNOLOGY GIANTS BUILD FACTORIES OVERSEAS AND EXPORTED AMERICAN JOBS ABROAD. UNDER THE TRUMP ADMINISTRATION WE ARE DOING EVERYTHING POSSIBLE TO MAKE THIS THE BEST PLACE ON EARTH TO BUILD A FACTORY OR GROW BUSINESSES. I AM ALLOWING THEM TO BUILD AN ELECTRIC PRODUCING PLANTS WITH THEIR FACTORY. OTHERWISE THEY HAVE TO HOOK INTO THE GRID. IT IS ONE OF THE BIGGEST THINGS WE HAVE DONE. WHERE YOU CAN BUILD YOUR OWN ELECTRICITY. YOU BECOME YOUR OWN ELECTRIC MANUFACTURER. IT GOES ALONG WITH THE PLAN. IF YOU BECOME A UTILITY. CONGRATULATIONS. NOW ARE -- YOU ARE IN UTILITIES. I HOPE THEY DON'T VALUE YOUR COMPANY BASED ON UTILITY. BUT THAT IS OK. YOU WILL BE MAKING YOUR OWN ELECTRICITY. FOR THE THINGS WE ARE DOING, ESPECIALLY WITH AI, YOU CAN DOUBLE. IT IS MASSIVE ELECTRIC. IF THEY WILL BE ABLE TO MAKE THEIR OWN. THEY ARE GETTING FANTASTIC APPROVALS. LEE ZELDIN IS DOING A FANTASTIC JOB INCLUDING WITH 100% EXPENSING ON THE ONE, BIG, BEAUTIFUL BILL. IN RETURN WE ARE ASKING OUR BUSINESSES TO INVEST IN AMERICA AND THEY ARE COMING AT LEVELS WE HAVE NEVER SEEN BEFORE. I DO NOT KNOW WHEN IT SHOWS UP. BUT THERE ARE A LOT OF FACTORIES AND PLANTS THAT ARE EITHER UNDER CONSTRUCTION OR WILL SOON BE STARTING CONSTRUCTION. I CANNOT TELL YOU EXACTLY WHEN. BUT I WANT TO BE AROUND IN A YEAR FROM NOW OR TWO YEARS FROM NOW. WE WILL SEE AN EXPLOSION LIKE THIS COMPANY HAS NEVER SEEN BEFORE, NEVER. TODAY'S ANNOUNCEMENT IS ONE OF THE LARGEST COMMITMENTS ON WHAT HAS BECOME ONE OF THE GREATEST INVESTMENT BOOMS IN OUR NATIONS HISTORY. WE HAVE THE HOTTEST COUNTRY IN THE WORLD. I TOLD YOU THE STORY. TIM, I WILL TELL YOU. I WENT TO THE MIDDLE EAST. I WAS WITH QATAR. I WAS WITH THE UAE AND THE KING OF SAUDI ARABIA. I WENT TO TOMATO AND I SAW MANY GREAT LEADERS. WE FINISHED ABOUT FOUR WEEKS AGO. VIRTUALLY EVERYONE SAID WE WERE A DEAD COUNTRY ONE YEAR AGO. WE WERE DYING. WE WERE DEAD. NOW YOU HAVE THE HOTTEST COUNTRY IN THE WORLD. THIS WOULD HAVE NEVER HAPPENED EXCEPT FOR CERTAIN PEOPLE. THANK YOU VERY MUCH. I APPRECIATE IT. NVIDIA IS INVESTING $500 BILLION TO GO ALONG WITH APPLE'S $600 BILLION. MICRON, A GREAT COMPANY, INVESTING 200 BILLION DOLLARS. IBM IS INVESTING MORE THAN $150 BILLION. SOFTBANK IS INVESTING SUBSTANTIALLY MORE THAN $100 BILLION. TSMC IS INVESTING 200 BILLION DOLLARS. JOHNSON & JOHNSON, $55 MILLION. MARK, STELLANTIS, AND GENERAL MOTORS ARE PUTTING MANY BILLIONS IN. THEY HAVE NOT DETERMINED THE FINAL NUMBER. MANY OTHER COUNTRIES ARE INVESTING TENS OF BILLIONS OF DOLLARS. I WANT TO GIVE YOU THE WHOLE LIST, BECAUSE IT IS TOO LONG TO READ. BUT IT IS HUNDREDS OF BILLIONS OF DOLLARS, EVEN TRILLIONS OF DOLLARS BEING INVESTED RIGHT NOW . LAST WEEK IT WAS ANNOUNCED IN THE ECONOMY GREW AT 3% SECOND QUARTER. CONSUMER CONFIDENCE IS SURGING. BLUE-COLLAR WAGES ARE RISING RAPIDLY. COSTS ARE WAY DOWN. I LISTEN TO THESE HORRENDOUS FRAUDS ON CNN AND VARIOUS OTHER FAKE NEWS NETWORKS. THEY SAY COSTS ARE UP. NO. COSTS ARE DOWN. GASOLINE IS DOWN. SOON I BELIEVE IT WILL BE LESS THAN TWO DOLLARS PER GALLON. IT IS AROUND $2.40 NOW. OTHER THAN CALIFORNIA HAD A COUPLE OTHER PLACES. GASOLINE IS WAY DOWN. THE PRICE OF GROCERIES ARE DOWN. HOW ABOUT EGGS? MY FIRST WEEK HERE AT THE PRESENT HIT ME VERY HARD ON EGGS. EGGS HAD QUADRUPLED OR SOMETHING. I SAID I DID NOT KNOW ABOUT IT. I HAVE JUST BEEN HERE FOR DAYS. EGGS ARE DOWN. THE ONLY THING THAT IS UP OUR STOCK PRICES AND THEY ARE THROUGH THE ROOF. THE STOCK MARKET HAS BEEN HITTING ALL-TIME RECORDS, ALL-TIME HIGHS. LAST WEEK IT WAS ANNOUNCED AS THE ECONOMY GREW AT LEVELS WE HAVE NOT SEEN IN A LONG TIME. BUT THE REAL LEVELS OF GROWTH WILL BE JUDGED IN A YEAR FROM NOW, WHEN YOU START SEEING THESE INCREDIBLE PLANTS. WE HAVE CAR PLANTS OPENING, COMING IN FROM CANADA, MEXICO, ALL OVER THE WORLD. BECAUSE THEY LIKED THE WAY THE ELECTION WORKED OUT AND THEY DON'T WANT TO PAY TARIFFS. THE TARIFFS, I THINK, WE ARE TAKING IN HUNDREDS OF BILLIONS OF DOLLARS IN TARIFFS. I WON'T BE SO SPECIFIC. WE DON'T EVEN KNOW THE FINAL NUMBER. WE JUST MADE A DEAL WITH THE EU WHERE THEY ARE PAYING HUNDREDS OF BILLIONS OF DOLLARS. JAPAN IS PAYING HUNDREDS OF BILLIONS OF DOLLARS. NUMEROUS OTHER COUNTRIES ARE PAYING HUNDREDS OF BILLIONS OF DOLLARS. WE ARE NOT EVEN COMPLETED THERE. THEY FOUND 20 $5 BILLION IN THREE WEEKS AGO. THEY SAID WE HAVE A SURPLUS OF $25 BILLION. THEY SAID WHERE DID THIS COME FROM? I SAID CHECK THE TARIFFS. I WAS RIGHT. THAT IS WHERE IT CAME FROM. WE HAVE JUST STARTED. THIS IS JUST IN ITS INFANCY. WE HAVE A GREAT COUNTRY. WE HAVE A COUNTRY THAT WILL BE VERY RICH. IT IS A COUNTRY THAT WE ARE VERY PROUD OF. BUT IT WILL BE VERY RICH. COMPANIES LIKE APPLE ARE COMING HOME. WE WANT THEM TO COME HOME. THEY HAVE TO COME HOME. WE WILL TREAT THEM VERY WELL. WE WILL BE PUTTING A LARGE TARIFF ON SHIPS AND SEMICONDUCTORS. THE GOOD NEWS FOR COMPANIES LIKE APPLE IS IF YOU ARE BUILDING IN THE UNITED STATES OR YOU HAVE COMMITTED TO BUILD WITHOUT QUESTION IN THE UNITED STATES, THERE WILL BE NO CHARGE. WE WON'T BE CHARGING. A LOT OF COUNTRIES AND COMPANIES ARE LEAVING VARIOUS OTHER PLACES AND COMING TO THE U.S.. SO IN OTHER WORDS WE WILL BE PUTTING A TARIFF OF APPROXIMATELY 100% ON CHIPS AND SEMICONDUCTORS. BUT IF YOU ARE BUILDING IN THE UNITED STATES OF AMERICA, THERE IS NO CHARGE. EVEN THOUGH YOU ARE BUILDING AND NOT PRODUCING YET IN TERMS OF THE BIG NUMBERS OF JOBS AND ALL THE THINGS YOU ARE BUILDING. IF YOU ARE BUILDING, THERE WILL BE NO CHARGE. I WANT EVERYONE TO KNOW THAT. I DID NOT EVEN TELL YOU THAT. INSIDE, WE DISCUSSED THE CONCEPT. BUT IT IS A BIG FACTOR. IN 100% TARIFF ON ALL CHIPS AND A COMING INTO THE U.S.. IF YOU HAVE MADE A COMMITMENT TO BUILD, OR IF YOU ARE IN THE PROCESS OF VOTING, AS MANY ARE, THERE IS NO TARIFFS. OK? IF YOU SAY YOU ARE BUILDING AND YOU DON'T BUILD, WE GO BACK AND ADD IT UP. IT ACCUMULATES. WE CHARGE YOU AT A LATER DATE. YOU HAVE TO PAY. THAT IS A GUARANTEE. THAT IS A BIG STATEMENT. I THINK THE CHIP COMPANIES ARE ALL COMING BACK HOME. THEY ARE ALL COMING BACK. WE STARTED WITH INTEL. GRADUALLY, INTEL WAS JUST TAKEN OVER. THEY WERE TAKEN TO THE CLEANERS, FRIENDLY. THEY WERE MOVED TO OTHER PLACES. IN PARTICULAR, TAIWAN. I THINK THAT A LOT OF THOSE COMPANIES ARE COMING BACK, COMING BACK RAPIDLY. THAT IS A BIG STATEMENT. A 100% TARIFF. THANK YOU VERY MUCH. TIM, WOULD YOU LIKE TO SAY A FEW WORDS ABOUT YOUR COMPANY? TIM: GOOD AFTERNOON, EVERYONE. MR. PRESIDENT, THANK YOU FOR HAVING ME TODAY. YOU HAVE BEEN A GREAT ADVOCATE FOR AMERICAN INNOVATION AND MANUFACTURING. I AM GRATEFUL FOR YOUR LEADERSHIP AND COMMITMENT. IT IS A COMMITMENT WE SHARE AT APPLE BECAUSE AMERICAN INNOVATION IS CENTRAL TO EVERYTHING WE DO. OUR PRODUCTS ARE DESIGNED HERE. WE ARE HIRING AND GROWING HERE AND WE SUPPORT 450,000 JOBS WITH THOUSANDS OF SUPPLIERS AND PARTNERS IN ALL 50 STATES. EARLIER THIS YEAR, WE MADE OUR LARGEST EVER SPENDING COMMITMENT. $500 BILLION TO THE U.S. OVER THE NEXT FOUR YEARS. IT IS ALREADY YIELDING RESULTS. EARLIER THIS YEAR WE BROKE GROUND ON A NEW FACTORY IN HOUSTON TO MAKE ADVANCED AI SERVERS AND LAST MONTH, THE FIRST UNIT ROLLED OFF THE FACTORY LAWN, PROUDLY MADE IN AMERICA. PRESIDENT TRUMP SHARED KIND WORDS ABOUT THAT WORK. HE ALSO ASKED US TO THINK ABOUT WHAT MORE WE COULD COMMIT TO DOING. MR. PRESIDENT, WE TOOK THE CHALLENGE VERY SERIOUSLY. I AM GLAD TO BE WITH YOU HERE TODAY, AND I AM HAPPY TO SAY TODAY WE ARE COMMITTING AN ADDITIONAL $100 BILLION TO THE UNITED STATES BRINGING OUR TOTAL U.S. INVESTMENT TO $600 BILLION OVER THE NEXT FOUR YEARS. AS A PART OF THIS WE ARE LAUNCHING APPLE'S AMERICAN MANUFACTURING PROGRAM. IT WILL SPUR MORE PRODUCTION IN AMERICA. FOR CRITICAL COMPONENTS USED IN APPLE PRODUCTS ALL AROUND THE WORLD. WE ARE THRILLED TO ANNOUNCE WE HAVE ALREADY SIGNED NEW AGREEMENTS WITH 10 COMPANIES ACROSS AMERICA TO DO THAT. FIRST, WITH TODAY'S ANNOUNCEMENTS, I AM PROUD TO SAY APPLE IS LEADING THE CREATION OF AN END TO END SILICONE SUPPLY CHAIN HERE IN AMERICA FROM DESIGN TO EQUIPMENT AWAY FROM PRODUCTION TO FABRICATION TO PACKAGING. IN TEXAS, WE ARE WORKING WITH MANUFACTURERS LIKE TEXAS INSTRUMENTS, GLOBAL WAFERS AMERICA, AND APPLIED MATERIALS. WE ARE WORKING WITH AMCOR IN ARIZONA AND BROADCOM AND GLOBAL FOUNDRIES IN NEW YORK. THANKS TO PRESIDENT TRUMP'S VISION AND WITH HIS HELP FIRST TERM, WE LED THE WAY TO BRING TSMC TO ARIZONA BY COMMITTING TO BEING THERE FIRST AND LARGEST CUSTOMER. TODAY THEY ARE PRODUCING TENS OF MILLIONS OF CHIPS FOR APPLE USING ONE OF THE MOST ADVANCED PROCESS TECHNOLOGIES IN AMERICA TODAY. TODAY WE WILL KEEP WORKING WITH SUPPLIERS TO MOVE EVEN MORE ADVANCED WORK TO AMERICA. THIS YEAR AMERICAN MANUFACTURERS ARE ON TRACK TO MAKE 19 BILLION CHIPS FOR APPLE IN 24 FACTORIES ACROSS 12 STATES. WE ARE COMMITTED TO BUYING AMERICAN-MADE ADVANCED RARE EARTH MAGNETS DEVELOPED BY MP MATERIALS, PART OF APPLE DEVICES SHIPPED AROUND THE WORLD. MP IS THE ONLY FULLY INTEGRATED RARE EARTH PRODUCER IN THE U.S.. WITH THIS PARTNERSHIP, THEY WILL SIGNIFICANTLY EXPAND THEIR FLAGSHIP FACILITY IN FORT WORTH, TEXAS. WE ARE THRILLED TO WORK TOGETHER ON A CUTTING EDGE RECYCLING LINE IN MOUNTAIN PASS, CALIFORNIA. THIRD, IN KENTUCKY, WE HAVE WORKED WITH OUR PARTNERS AT CORNING TO BUILD THE WORLD'S LARGEST GAS PRODUCTION LINE. I AM PLEASED TO ANNOUNCE THAT SOON, FOR THE FIRST TIME EVER, EVERY SINGLE NEW IPHONE, AND EVERY SINGLE NEW APPLE WATCH SOLD ANYWHERE IN THE WORLD WILL CONTAIN A COVER GLASS MADE IN KENTUCKY. IN ADDITION TO THE AMERICAN MANUFACTURING PROGRAM, WE ARE SIGNIFICANTLY GROWING INVESTMENTS IN AI INCLUDING EXPANDING DATA CENTER CAPACITY IN NORTH CAROLINA, NEVADA, ARIZONA, AND OREGON. WE WILL CONTINUE MAKING ITS ASSESSMENTS -- INVESTMENTS IN AMERICA. WE WILL KEEP HIRING IN AMERICA AND BUILDING TECHNOLOGIES AT THE HEART OF OUR PRODUCTS RIGHT HERE IN AMERICA. BECAUSE WE ARE A PROUD AMERICAN COMPANY AND WE BELIEVE DEEPLY IN THE PROMISE OF THIS GREAT NATION. THANK YOU ALL. THANK YOU, PRESIDENT, FOR PUTTING AMERICAN INNOVATION AND AMERICAN JOBS FRONT AND CENTER. PRES. TRUMP: I APPRECIATE IT. WHAT A JOB HE HAS DONE. WHAT A JOB. INCREDIBLE. I WANT TO THANK YOU VERY MUCH. THANK YOU, JD, FOR HELPING. REALLY GOOD JOB. ANY QUESTIONS? REPORTER: YOU MENTIONED A $17 TRILLION IN YOUR FIRST SEVEN MONTHS. CAN YOU TALK ABOUT HOW AN INVESTMENT LIKE THIS COULD POSITIVELY IMPACT THE MILLIONS OF AMERICANS THAT TRUST YOU DO THE VOTE? PRES. TRUMP: IT CHANGES OUR COUNTRY. OUR COUNTRY IS A VERY DIFFERENT COUNTRY THAN IT WAS SIX MONTHS AGO. PEOPLE LIKE TIM ARE COMING. WE HAD MACRON IN YESTERDAY. WE HAVE ALL OF THE BIG GREAT COMPANIES YOU DON'T KNOW ABOUT, BUT YOU READ ABOUT. MANY OF THEM WERE MAKING PRODUCTS OUTSIDE OF OUR COUNTRY. FOOLISHLY WE LOST THEM. IF WE HAVE THE RIGHT PERSON IN THAT SEAT IT WOULD HAVE NEVER HAPPENED 20 OR 30 YEARS AGO. THE CHIP BUSINESS WOULD NOT HAVE LEFT OUR SHORES. WE HAD 100% CHIPS ORIGINALLY AND SLOWLY WE WERE TAKEN DOWN TO NOTHING. WE HAVE THE BIGGEST CHIP COMPANIES IN THE WORLD COMING IN. THEY ARE GOING TO ARIZONA AND BEYOND. WE WILL HAVE, IN A SHORT PERIOD OF TIME, ALMOST 50% OF THE CHIPS FROM STARTING OUT NOTHING. THAT IS SOMETHING. WE HAVE THE GREATEST COMPANIES IN THE WORLD COMING TO OUR COUNTRY. IT MEANS IT -- IT MEANS JOBS. IT MEANS WEALTH. WEALTH MEANS SECURITY FOR OUR PEOPLE. REPORTER: CONGRATULATIONS ON THIS INVESTMENT. WHAT IS THE LABOR FORCE LOOKING LIKE TO FILL THE JOBS YOU HAVE? DO WE HAVE ENOUGH SKILLED AMERICAN WORKERS TO FILL THESE? PRES. TRUMP: WE DO HAVE A LOT OF WORKERS. WE HAVE PEOPLE LIKE TIM LOOKING FOR TREMENDOUS SCHOOLS AND TRAINING CENTERS ALONG WITH THEIR BIG PLANTS WHERE THEY TRAIN PEOPLE, WHETHER IT IS GLASS, LIKE IN KENTUCKY, OR COMPUTERS, WHATEVER THEY MIGHT BE DOING. IT IS A NEW WORKFORCE. WE HAVE A LOT OF THEM IN ENERGY. THEY HAVE ALWAYS LIKED ENERGY. COAL HAS OPENED UP BIG. WE BROUGHT IT BACK IN A LARGE WAY. CHINA IS NOW BUILDING 58 COAL-FIRED PLANTS. BIG ONES. AND HERE WE WERE SAYING WE HAVE MORE COAL THAN ANYBODY ELSE IN THE WORLD, MORE OIL AND GAS THAN ANYBODY ELSE IN THE WORLD. WE HAVE TREMENDOUS ENERGY JOBS. WE ARE BOOMING WITH ENERGY. THAT IS WHY GASOLINE PRICES ARE DOWN. THE COSTS ARE DOWN. I HOPE WHEN THEY WATCH THESE SHOWS, AND I WON'T USE NAMES BECAUSE I JUST MAKE THEM BETTER KNOWN. NOBODY KNOWS WHO THEY ARE. BUT I WATCHED A GROUP OF PEOPLE ON CNN. WHERE THEY SAY COSTS HAVE GONE UP. COSTS HAVE NOT GONE UP. THEY HAVE GONE DOWN. THE THINGS THAT HAVE GONE UP OUR STOCK PRICES AND THE SUCCESS OF OUR COUNTRY. OUR COUNTRY IS REALLY, REALLY DOING WELL. > > HAVE YOU AGREED TO A SUMMIT YET? > > THERE IS A GOOD PROSPECT THAT THEY WILL. WE HAVE NOT DETERMINED WHERE, BUT WE HAD GOOD TALKS WITH PRESIDENT PUTIN TODAY. THERE IS A GOOD CHANCE WE COULD BE ENDING THE ROAD. THAT ROAD WAS LONG AND CONTINUES TO BE LONG. BUT THERE IS A GOOD CHANCE THERE WILL BE A MEETING VERY SOON. REPORTER: HOW CLOSE DO YOU THINK YOU ARE? PRES. TRUMP: I DON'T WANT TO SAY BECAUSE I HAVE BEEN DISAPPOINTED BEFORE WITH THIS ONE. WE HAVE SOLVED FIVE WARS. ADD TO THAT IRAN WHERE WE WIPE OUT THEIR NUCLEAR CAPACITY FOR WEAPONS. THEY WOULD HAVE HAD A WEAPON IN TWO MONTHS, MAYBE LESS. THAT WAS TOTALLY OBLITERATED. IT WAS A TOTAL OBLITERATION. THE PILOTS AND THE PEOPLE THAT DID THAT JOB, WE HAVE THE GREATEST ARMED FORCES IN THE WORLD. THAT WASN'T REALLY SOMETHING. A MODEL OF THE PLANE IS RIGHT THERE. YOU HAVE TO BRING THAT UP, SUSIE. WE HAVE TO SEE DATA. THIS WAS JUST GIVEN TO ME. WE ORDERED A BRAND-NEW B-2 BOMBERS. THIS IS A PLAIN THAT OVER A PERIOD OF 36 HOURS OF CONSTANT FLYING, LOOK AT THIS. THIS IS THE BRAND-NEW ONE IF THEY JUST ORDERED. SIMILAR, BUT ACTUALLY QUITE DIFFERENT. IT IS NEW AND ENHANCED. IT IS AN AMAZING MACHINE. 36 HOURS. WE HAD 52 TANKERS IN THE AIR LOADING UP OUR PLANES. THIS WAS SURROUNDED BY F-22S AND F-35S AND IT WAS FLAWLESS, TIM. EVERY ONE OF THE BOMBS HIT THEIR TARGET. WE HAD TOMAHAWK SHOT IN FROM A SUBMARINE 300 MILES AWAY. THEY HIT. EVERY SINGLE TOMAHAWK HIT ITS TARGET. THAT WAS A BIG THREAT. IT WAS A NUCLEAR THREAT. HERE IS THE NEW ONE THAT WE JUST ORDERED A LARGE NUMBER OF THEM. REPORT: MR. PRESIDENT, WHAT WAS THE BREAKTHROUGH TODAY? DID VLADIMIR PUTIN MAKE A CONCESSION HE HAS NOT MADE BEFORE? PRES. TRUMP: THERE ARE THOUSANDS OF YOUNG PEOPLE DYING. MOSTLY SOLDIERS. ALSO, MISSILES BEING HIT INTO KYIV AND OTHER PLACES. I THINK RUSSIA HAS LOST OVER 20,000 SOLDIERS SINCE THE BEGINNING OF THE YEAR, 20,000. I GUESS THE ESTIMATE FOR UKRAINE IS ABOUT 9000. IT IS A TERRIBLE SITUATION. WE DON'T HAVE AMERICAN SOLDIERS THERE, BUT I FEEL LIKE I HAVE AN OBLIGATION. THIS WAR WOULD HAVE NEVER STARTED. NOT EVEN A CHANCE. IT DID NOT START FOR FOUR YEARS. IT WENT FOUR YEARS AND IT DID NOT START. THIS WAS BIDENS WAR. IT WAS ON HIS WATCH. WE HAD NO LAND TAKEN FROM TRUMP. IT WAS TAKEN FROM BUSH. IT WAS TAKEN FROM BIDEN. THE WHOLE THING WAS TAKEN FROM BIDEN. TAKE A LOOK AT WHAT WAS TAKEN, WITH ALL OF THE LAND TAKEN. NOTHING WAS TAKEN FROM RUSSIA BY US. NOT ONE OUNCE OF LAND. IT WOULD HAVE NEVER STARTED IF I WAS PRESIDENT AND WE ARE HERE TO GET THE DESK STOPPED. -- DEATH STOPPED. REPORTER: WHAT IS THE CONFIDENCE? PRES. TRUMP: I CAN'T ANSWER THAT QUESTION YET. WE HAVE MADE A LOT OF PROGRESS. WE PUT A 50% TARIFF ON INDIA. THEY ARE THE SECOND LARGEST. IN TERMS OF THE PURCHASE OF OIL. BUT WE HAVE HAD VERY PROTECTIVE TALKS TODAY. REPORTER: ARE YOU CONSIDERING TAKING OVER THE D.C. POLICE? PRES. TRUMP: WE ARE CONSIDERING IT, BECAUSE OF THE CRIME IS RIDICULOUS. I COULD SHOW YOU A CHART COMPARING D.C. TO OTHER LOCATIONS. YOU DON'T WANT TO SEE WHAT IT LOOKS LIKE. IT WAS JUST ON TELEVISION. THEY WERE SHOWING IT. WE WANT A SAFE CAPITAL. WE WILL HAVE IT. IT INCLUDES CLEANLINESS. IT INCLUDES OTHER THINGS. WE HAVE A CAPITAL THAT IS VERY UNSAFE. WE JUST LOST A YOUNG MAN. A BEAUTIFUL, HANDSOME GUY THAT GOT THE HELL KNOCKED OUT OF HIM THE NIGHT BEFORE LAST. WE WANTED TO GIVE HIM A LITTLE RECOVERY TIME. WE JUST PUT A CALL TO HIM. CALLING BACK IN A LITTLE WHILE. HE WENT THROUGH A BAD SITUATION. THERE IS TOO MUCH OF IT. WE ARE GOING TO DO SOMETHING ABOUT IT. WHETHER YOU CALL IT FEDERALIZED OR WHAT. IT INCLUDES THE GRAFFITI, THE PAPER ALL OVER THE PLACE, THE ROADS IN BAD SHAPE, THE MEDIANS FALLING DOWN. THE MEDIAN IN BETWEEN ROADS FALLING DOWN. WE WILL BEAUTIFY THE CITY. WE WILL MAKE IT BEAUTIFUL. WHAT A SHAME. THE RATE OF CRIME, MUGGINGS, KILLINGS, EVERYTHING. IT INCLUDES BRINGING IN THE NATIONAL GUARD. > > DO YOU WANT CONGRESS TO LOOK AT OVERTURNING THE D.C. HOME ROLE ACT QUEST -- RULED ACT? PRES. TRUMP: THIS HAS TO BE THE BEST RUN PLAYS IN THE COUNTRY, NOT THE WORST. IT HAS SO MUCH POTENTIAL AND WE WILL TAKE CARE OF IT. YOU ARE GOING TO BE SAFE. WALKING DOWN THE STREETS, YOU WON'T GET MUGGED. REPORTER: IF YOU DO REACH A DEAL WITH UKRAINE AND RUSSIA WILL YOU DROP THE ADDITIONAL TARIFFS ON INDIA? AND ONE FOR MR. COOK AS WELL. THE PRESIDENT WANTS A MADE IN THE USA IPHONE. WHAT ARE THE CHANCES YOU CAN MAKE THAT HAPPEN? TIM: YOU LOOK AT THE BULK OF IT AND WE ARE DOING A LOT OF SEMICONDUCTORS HERE. WE ARE DOING THE CLASS HERE. AND WE ARE DOING THESE FOR PRODUCTS SOLD ELSEWHERE IN THE WORLD. THERE IS A LOT OF CONTENT IN THERE FROM THE U.S.. REPORTER: CAN YOU MAKE THE WHOLE THING HERE? TIM: IT WILL BE UNCLEAR FOR A WHILE. PRES. TRUMP: HE MAKES MANY OF THE COMPONENTS HERE AND WE HAVE BEEN TALKING ABOUT IT. IF THE WHOLE THING IS SET UP IN OTHER PLACES AND IT HAS BEEN HERE A LONG TIME. IN TERMS OF COSTS, WE MIGHT INCENTIVIZE THEM ENOUGH THAT ONE DAY HE WILL BE BACK. HE ISN'T MAKING THIS KIND OF INVESTMENT IN THE WORLD ANYWHERE, IT EVEN CLOSE. APPLE IS COMING BACK TO AMERICA. LET ME GO, PLEASE. REPORTER: INDIAN OFFICIALS HAVE SAID OTHER COUNTRIES ARE BUYING RUSSIAN OIL. PRES. TRUMP: THAT'S OK. YES. REPORTER: WHY ARE YOU SINGLING INDIA OUT FOR ADDITIONAL SANCTIONS? PRES. TRUMP: IT HAS ONLY BEEN EIGHT HOURS. YOU WILL SEE A LOT MORE COME UP SO MUCH SECONDARY SANCTIONS. REPORTER: YOU WERE THE DRIVING FORCE BEHIND OPERATION WARP SPEED, THE MRNA VACCINES SETTING THE GOLD STANDARD. YOUR HEALTH SECRETARY IS PULLING BACK FUNDING FOR RESEARCH SAYING THAT THE RISKS OUTWEIGH THE BENEFITS, PUTTING HIM AT ODDS WITH THE ENTIRE MEDICAL COMMUNITY, AND YOU. PRES. TRUMP: WE WILL LOOK AT THAT. WE ARE TALKING ABOUT IT. THEY ARE DOING A VERY GOOD JOB. WITH OPERATION WARP SPEED, WHETHER YOU ARE A REPUBLICAN OR DEMOCRAT, IT WAS CONSIDERED ONE OF THE MOST INCREDIBLE THINGS EVER DONE FOR THE COUNTRY. THE EFFICIENCY, THE WAY IT WAS DONE, THE DISTRIBUTION. EVERYTHING ABOUT IT HAS BEEN AMAZING. THAT WAS A LONG TIME AGO. WE ARE ONTO OTHER THINGS. WE ARE SPEAKING ABOUT IT. WE HAVE MEETINGS ABOUT IT, TOMORROW AT 12:00. WE ARE LOOKING FOR OTHER ANSWERS TO OTHER PROBLEMS, OTHER SICKNESSES AND DISEASES. I THINK WE ARE DOING VERY WELL. > > YOU HAVE SAID MANY TIMES YOU WANT TO STOP WARS IN THE MIDDLE EAST. NOW BENJAMIN NETANYAHU IS CONSIDERING RE-OCCUPYING GAZA ENTIRELY. IF YOU DO FIND YOU? PRES. TRUMP: WE HAVE STOP WARS IN THE MIDDLE EAST BY STOPPING IRAN FROM HAVING A NUCLEAR WEAPON. IF THEY CAN SAY THEY WILL START ALL OVER AGAIN. IT IS A VERY DANGEROUS THING FOR THEM TO DO BECAUSE AS SOON AS THEY START, WE WILL BE BACK. THEY UNDERSTAND IT IS JUST WORDS. WE HAVE STOPPED A LOT OF IN THE MIDDLE EAST. IRAN WAS A PERPETRATOR OF HATE, A VERY EVIL PLACE. IT WILL BE A LOT DIFFERENT IN THE COMING YEARS. > > YOU HAVE SIMILAR PLANS TO ENACT MORE TARIFFS ON CHINA? PRES. TRUMP: IT COULD HAPPEN. IT DEPENDS ON HOW WE DO. REPORTER: STEPHEN COLBERT ANNOUNCED HE WAS LEAVING HIS SHOW. HOWARD STERN ANNOUNCED HE HAD SIRIUS XM RADIO ARE PARTING WAYS. DO YOU THINK THE HATE TRUMP BUSINESS MODEL IN THE MEDIA IS GOING OUT OF STYLE? PRES. TRUMP: IT HAS BEEN TRUE FROM THE BEGINNING. STEPHEN COLBERT HAS NO TALENT. I COULD GO OUTSIDE ON THE BEAUTIFUL STREETS AND PICK UP ONE OR TWO PEOPLE THAT WOULD DO BETTER. JIMMY FALLON HAS NO TALENT. TO BECOME A HAS NO TALENT. -- JIMMY KIM HAS NO TALENT. HOWARD STERN IS A NAME I HAVE NOT HEARD IN A LONG TIME. I USED TO DO HIS SHOW. DID HE GET TERMINATED? REPORTER, THEY WENT SEPARATE WAYS. JOE: PRESIDENT TRUMP SPEAKING LIVE IN THE OVAL OFFICE. THE CONVERSATION HAS MADE ITS WAY FROM APPLE'S DOMESTIC INVESTMENT ALL THE WAY TO THE STYLINGS OF HOWARD STERN AND DEVELOPMENT IN THE ENTERTAINMENT BUSINESS. WE WANT TO TALK ABOUT THE NEWS TODAY WITH A HEADLINE CROSSING THE TERMINAL. DURING THE PRESIDENT'S OPENING REMARKS THAT HE PLANS TO PUT A 100% TARIFF ON CHIPS AND A SEMICONDUCTORS COMING INTO THE U.S.. WASHINGTON DEPUTY BUREAU CHIEF LAURA DAVIDSON IS WITH US IN STUDIO AS WE KEEP OUR EYES AND EARS ON THE PRESIDENT. IT IS A PRETTY MASSIVE DEVELOPMENT AND A STORY WE SAW COMING BUT NEVER HAD A NUMBER FOR. LAURA: IT'S A HUGE NUMBER THAT TELLS YOU TRUMP ESSENTIALLY WANTS TO CUT OFF THE FLOW OF FOREIGN SEMICONDUCTORS IN THE U.S. AND WANTS THEM ALL MADE HERE. APPLE GETS THE EXCEPTION. IF YOU ARE STARTING TO BUILD. IF YOU HAVE COMMITTED AND YOU ARE STARTING TO BUILD A RELATED ENTITIES HERE, YOU DON'T HAVE TO PAY THAT TARIFF. THIS IS WHERE WE MIGHT SEE OTHER COMPANIES COME OUT AND SAY WE ARE GOING TO START BUILDING SOMETHING. > > IT IS INTERESTING. YOU THINK ABOUT TAIWAN SEVEN. IT CAME UP IN THE CONVERSATION AND HAS A MASSIVE FAB IN ARIZONA, BUILDING OTHERS NOW. NOW WE TURN TO A LOOK AT HOW OIL MARKETS MOVED ON THE PRESIDENT'S ANNOUNCEMENT. VONNIE QUINN IS WITH US FROM WORLD HEADQUARTERS IN NEW YORK. I KNOW YOU ARE COVERING A COUPLE MOVES HERE AS WELL AS THE REACTION WE ARE SEEING TO CHIPS AFTER HOURS. WHAT DO YOU HAVE? VONNIE: OIL WENT DOWN ON THE LIST OF PRIORITIES WOULD WE SAW ACTION POST MARKET AFTER WE GOT THE PRESIDENT SAYING HE WAS GOING TO TARIFF CHIPMAKERS 100%. IF THE CHIPS WERE COMING FROM OUTSIDE THE U.S.. THAT IS DEFINITELY A MAXIMALIST APPROACH. WE ARE WAITING ON THE SECTORAL TARIFFS. OF COURSE IT IS JUST SOMETHING THE PRESIDENT SAID. HE HAS NOT DONE THIS YET AND WE ARE WAITING TO SEE WHAT THE CHIPMAKERS WILL DO. JENSEN HUANG WAS AT THE WHITE HOUSE TODAY AND THE PRESIDENT GAVE AWAY SOMETHING INTERESTING THERE. HE SAID MICRON WITHOUT THE WHITE HOUSE YESTERDAY. THAT HAD NOT BEEN REPORTED ANYWHERE. YOU LOOK AT THE ACTION. IMMEDIATELY, THE CHIPMAKERS WERE DOWN AND THEN LITTLE BY LITTLE THEY CREEP HIGHER. NVIDIA IS UP FRACTIONALLY. APPLIED MATERIALS, WHICH JUST ANNOUNCED, MAYBE A HALF HOUR AGO THAT IT WOULD INVESTED $200 MILLION IN ARIZONA IS HIGHER. INTEL IS UP 3%. YOU ARE SEEING A VARIETY OF MARKET REACTIONS TO THESE ANNOUNCEMENTS. OF COURSE, IT WAS APPLES DAY TODAY BECAUSE APPLE MADE A $100 BILLION COMMITMENT ON TOP OF THE $500 BILLION IT HAD ALREADY DONE SAYING IT WILL BUILD A MANUFACTURING ECONOMY IN DETROIT, A RARE EARTH RECYCLING LINE IN CALIFORNIA, AND MAKE ITS OWN ELECTRICITY TO POWER ITS OWN PLANTS. PRESIDENT TRUMP IS OBVIOUSLY LEVERAGING WHAT HE CAN OVER THE CEOS AND IT WILL BE INTERESTING TO HEAR WHAT THE CHIP CEOS COME BACK WITH OVER THE NEXT SEVERAL DAYS BEFORE THE SECTORAL ANNOUNCEMENTS ARE MADE OFFICIAL. JOE: THAT'S FOR SURE. THE PRESIDENT JUST MADE A COUPLE MENTIONS ABOUT THE FED, KNOWING THERE HAS BEEN DISCUSSION TODAY ABOUT A POTENTIAL TEMPORARY INSTALLMENT OF A NEW FED GOVERNOR, ONCE THE SEAT IS VACATED. HE SAYS THEY ARE DOWN TO THREE FED CANDIDATES. HE DOES NOT THINK SCOTT BESSENT WOULD TAKE THE FED JOB. HE SAID EARLIER THIS WEEK SCOTT BESSENT HAD TAKEN HIM OUT OF THE RUNNING. AN INTERESTING QUOTE. PROBABLY GOING TEMPORARY AND PERMANENT, HE SAYS, ACKNOWLEDGING BLOOMBERG REPORTING FROM EARLIER TODAY. OBVIOUSLY, THAT COULD BE A MARKET MOVER AT SOME POINT HERE. I WANT TO ASK YOU ABOUT OIL. WHERE WE MIGHT HAVE STARTED OUR CONVERSATION IN THE OTHER DAY, THE PRESIDENT TALKING ABOUT TARIFFS ON INDIA, 25% WHEN IT COMES TO HIS REACTION, WHAT HE LIKES TO CALL HELPING FUND THE RUSSIAN WAR MACHINE. WE ALSO HAVE THE POTENTIAL FOR SECONDARY SANCTIONS ON A NUMBER OF OTHER NATIONS AT THE END OF THIS WEEK. WHAT DOES THE OIL MARKET THINK? VONNIE: THE OIL MARKET HAD BARRELS BROUGHT BACK TO THE MARKET BY THE EIGHT COUNTRIES IN OPEC-PLUS WHO DECIDED THEY WERE NOT GOING TO RESTRICT THEMSELVES AS MUCH. SO WE HAD A MEETING FROM THOSE EIGHT COUNTRIES OVER THE WEEKEND AND THE DECISION MEANT LOTS MORE BARRELS WERE BROUGHT BACK ONLINE. WE HAVE A VERY SOFT MARKET AT THE MOMENT WITH BRENT CRUDE TRADING AT 6694. WDI IN NEW YORK TRADING AT 6435 AT THE END OF THE SESSION. THE RELATIONSHIP WITH INDIA SEEMS TO BE DETERIORATING, AT LEAST AT THE MOMENT. IF INDIA COMES BACK WITH SOMETHING OR IF THERE IS ANOTHER PROMISE THAT INDIA WILL DIVERT ITS PURCHASES OF OIL AWAY FROM RUSSIA, PERHAPS, THAT RELATIONSHIP WILL IMPROVE. FOR THE MOMENT, THAT IS HAPPENING. RUSSIA'S OIL WILL STILL GO INTO THE MARKET. IT IS NOT LIKE IT WILL DISAPPEAR. AT THE MOMENT, PRESIDENT TRUMP DOES NOT WANT INDIA BUYING THAT OIL. ALL OF THAT SAID, THE OIL MARKET IS SATURATED. THERE ARE PLENTY OF BARRELS OUT THERE FOR EVERYBODY AND YOU CAN SEE THAT REFLECTED IN THE PRICE. JOE: YOU CAN. THEY DID IT WRAPPED UP IN THE OVAL OFFICE. JOINING US NOW ON BALANCE OF POWER IS HERE. THE FOUNDER AND CEO OF THE MESSINA GROUP, OUR DEMOCRATIC STRATEGIST ALONG WITH SARAH CHAMBERLAIN, THE PRESIDENT AND CEO OF THE REPUBLICAN MAIN STREET PARTNERSHIP. IT'S GREAT TO HAVE YOU BOTH WITH US. JIM, YOU KNOW WHAT IT IS LIKE TO BE IN THE OVAL OFFICE WHEN THE CHIEFS OF CORPORATE AMERICA COME TO TOWN. THE PRESIDENT HAS MADE A HABIT OF THIS. NOW CORRALLING TIM COOK. HE HAD SEVERAL OTHERS FOR UNRELATED EVENTS IN THE OVAL OFFICE TO TALK ABOUT THIS GRAND DOMESTIC INVESTMENT. IS THIS SOMETHING REPUBLICANS AND DEMOCRATS CAN SEE EYE TO EYE ON? TIM: ABSOLUTELY. THE CHIPS ACT PASSED LAST YEAR AND THE YEAR BEFORE WITH BIPARTISAN SUPPORT GROWING OUR CHIPS AND AI CAPABILITIES IS A NONPARTISAN ISSUE. WHEN YOU WORK IN THE WHITE HOUSE YOU REALIZE THE WHITE HOUSE IS THE BULLY PULPIT. THE PLACE YOU CAN PULL PEOPLE TOGETHER AND CAJOLE THEM TO DO A BUNCH OF THINGS. THAT LOOKS LIKE WHAT PRESIDENT TRUMP DID, BUILDING OFF THE CHIPS ACT. TIM COOK'S COMMITMENTS ARE GREAT AND CONTINUE TO BUILD REAL STRENGTH AS WE LOOK TOWARDS A FUTURE THAT IS AI DRIVEN IN THE AMERICAN SECTOR. JOE: THIS COULD BE CONSIDERED ONE OF THE HALLMARKS OF THIS ADMINISTRATION. DONALD TRUMP WASN'T A FAN OF THE CHIPS ACT LEGISLATION. HE HAS HIS OWN APPROACH MAKING DEALS DIRECTLY WITH COMPANIES. IS THAT MORE THAN TRUMP OR REPUBLICAN BRAND? HOW DOES THAT WORK FOR YOU? SARAH: DONALD TRUMP IS A DEALMAKER AND WE ARE EXCITED ABOUT THIS. THE CHIPS ACT PASSED. A LOT OF REPUBLICAN PARTNERS VOTED FOR IT. NO GROUND WAS BROKEN. WE ARE EXCITED ABOUT TODAY. IT IS A GREAT STEP FORWARD FOR ALL AMERICAN PEOPLE. WE ARE EXCITED AT APPLE. IT IS A COMPANY WHERE EVERYBODY USES THEIR PRODUCTS. IT WAS WONDERFUL TO HAVE TIM COOK IN THE WHITE HOUSE TODAY DOING THIS. JOE: 100% TARIFF ON CHIPS AND SEMICONDUCTORS COMING INTO THE U.S.. DOESN'T THAT APPROACH TO SUPPORT OR NEGATE THE PROCESS -- PROGRESS MADE BY THE CHIPS ACT AND IT DEALS LIKE THIS ONE TODAY ? JIM: WE HAVE TALKED ABOUT THE TALK TRADE. TRUMP CHICKENING OUT. I THINK THERE IS A 0% CHANCE OF EVER GETS DONE. HE THREATENS A 100% TARIFF. EVERYBODY RACES IN TO CUT THE DEAL THAT SARAH WAS TALKING ABOUT. THEN IT DOES IT APPLY TO APPLE OR ANY OF THESE PEOPLE? COLOR ME SKEPTICAL AS TO IF ANYBODY WILL PAY THE 100%. JOE: CHIPS GO WELL WITH TACOS. DO YOU AGREE? SARAH: I AGREE. 100% ISN'T REALISTIC. I THINK IT WILL BE 40%-50%. I DO NOT THINK IT WILL GO BACK TO NOTHING. THE PRESIDENT LOVES TO THROW NUMBERS OUT. IT GETS A LOT OF ATTENTION. HE IS A BUSINESSMAN. HE LIKES TO NEGOTIATE AND THIS IS A NEGOTIATING TOOL. JOE: OTHER TARIFFS WILL TAKE EFFECT IN THE DAYS AND WEEKS AHEAD WITH A STRING OF DEADLINES, INCLUDING TOMORROW WHEN RECIPROCAL TARIFFS WILL BE THE STORY. IT IS INTERESTING TO HEAR THE PRESIDENT. AND ALSO TO HEAR FROM TIM COOK. AT THE LINE THAT JUMPED OUT TO ME. APPLE IS LEADING THE CREATION OF AN END TO END SILICONE SUPPLY IN AMERICA. IT'S NOT JUST LIP SERVICE. IS THIS SOMETHING APPLE CAN REALLY PULL OFF WHILE DONALD TRUMP IS IN OFFICE? JIM: THEY HAVE COMMITTED TO 100% OF CLASS BEING IN THE U.S.. THE AI IT'S THERE. YOU SAW HIM STOP VERY CAREFULLY AND SAY, THERE WILL STILL BE IN LINE ASSEMBLY DONE SOMEWHERE ELSE. WE WON'T HAVE 100%. THE PRESIDENT IS STARTING TO ACKNOWLEDGE THAT DURING HIS PRESS CONFERENCE. ONCE I DO NOT KNOW IF THE AIM IS TO ACTUALLY MAKE IPHONES IN THE U.S.. A LOT OF PEOPLE ARE SKEPTICAL ABOUT THAT BUT IT IS A STORY WE WILL BE FOLLOWING AT BLOOMBERG. WE APPRECIATE ALL OF YOUR INSIGHTS. SARAH CHAMBERLAIN AND JIM MESSINA, OUR PANEL. THANK YOU FOR YOUR TIME. TO LEARN MORE ABOUT WHAT HAPPENED TODAY AT THE WHITE HOUSE FIND IT ON THE TERMINAL OR ONLINE. THANK YOU FOR JOINING US ON BALANCE OF POWER. WE WILL DO IT AGAIN TOMORROW. WE WILL MEET YOU BACK HERE ON BLOOMBERG TV AND RADIO.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9482421875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.86279296875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.79931640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.7724609375
    }
  ],
  "sentiment": {
    "positive": 0.26489258,
    "negative": 0.24853516,
    "neutral": 0.48632812
  },
  "summary": "Apple has announced a $100 BILLION COMMITMENT COMMITment by Apple (APPLE) in the US for DOMestic Automotive Industry (DOMESTIC MANUFACTURING) following threats from President Trump. The announcement was made at an event at the White House where Apple's CEO, CEO TIM COOK, was present. This announcement comes just an hour after the first round of Tariff Threats are set to hit. The company's stock was up $10, a mere 5% when the announcement was announced. The investment is seen as a significant investment in the U.S. However, it is unclear if this announcement will be followed-followed by further developments in the industry.",
  "shortSummary": "Apple is investing $600B in the US to support DOMESTIC manufacturing, amid tariff threats and potential for a face-to-face meeting with President Trump.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "224436b85fce4a91af329c69b34eb6f7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "President Trump announced a significant $100 billion commitment from Apple for domestic manufacturing, bringing the total investment to $600 billion over the next four years. This investment aims to create over 20,000 American jobs and enhance the U.S. supply chain for Apple products, including the production of components like glass in Kentucky. The announcement comes amid ongoing discussions about tariffs and the economic implications of corporate investments in the U.S.",
  "argos_id": "2NP54NYOP"
}