{
  "url": "https://www.latimes.com/world-nation/story/2025-08-12/us-grand-jury-indicts-one-of-haitis-most-powerful-gang-leaders-and-one-of-his-friends",
  "authorsByline": "Dánica Coto and Ashraf Khalil",
  "articleId": "bfa5911cec0c46cb91bbc36645c94c33",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/7a300f6/2147483647/strip/true/crop/5020x2636+0+356/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F31%2F12%2F39a13f3de5882470378d422b2a8d%2F10e59fec86434552967720e6824aa3e0",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:56:38.443000+00:00",
  "addDate": "2025-08-13T03:02:04.987389+00:00",
  "refreshDate": "2025-08-13T03:02:04.987392+00:00",
  "score": 1.0,
  "title": "U.S. grand jury indicts one of Haiti's most powerful gang leaders and one of his friends",
  "description": "Jimmy Chérizier, best known as “Barbecue,” is a leader of a gang federation called Viv Ansanm that the U.S. has designated as a foreign terrorist organization.",
  "content": "Haitian gang leader Jimmy Chérizier, better known as Barbecue, shouts slogans with his gang members after giving a speech, as he leads a march through La Saline neighborhood in Port-au-Prince on Oct. 22, 2021.\n\nA federal grand jury has indicted one of Haiti’s most powerful gang leaders and a U.S. citizen accused of conspiring with him to violate U.S. sanctions and fund gang activities in the troubled Caribbean country, the U.S. Justice Department announced Tuesday.\n\nJimmy Chérizier, best known as “Barbecue,” is a leader of a gang federation called Viv Ansanm that the U.S. designated as a foreign terrorist organization in May.\n\nChérizier lives in Haiti, and the U.S. is offering up to $5 million for information leading to his arrest or conviction.\n\nChris Landberg, a senior U.S. State Department official, said Chérizier’s “reign of terror and mass violence against Haiti must end.”\n\nBut Jake Johnston, author of “Aid State” and international research director at the Washington-based Center for Economic and Policy Research, questioned the government’s reason for offering a bounty.\n\n“This is a guy who is giving international media interviews regularly. I don’t think the issue is being able to find him,” Johnston said, adding that the indictment doesn’t represent a threat to Chérizier because he lives in Haiti. “It’s hard to see how it’ll have much of an effect.”\n\nChérizier is a former elite police officer who was fired in December 2018 and was later accused of organizing large-scale massacres in the slums of Grand Ravine in 2017, in La Saline in 2018 and in Bel-Air in 2019. More than 100 people were killed in the massacres, which Chérizier has denied organizing.\n\n“Haiti is a hotspot right now … there is incredible violence going on there,” U.S. Atty. Jeanine Pirro said Tuesday, calling La Saline killings “notorious because [Chérizier] both planned and participated” in the slaughter.\n\nIn June 2020, Chérizier created the “G9 Family and Allies,” an alliance that grew from nine gangs in lower Delmas and the Cite Soleil and La Saline slums to include more than a dozen gangs, according to a United Nations Security Council report.\n\nThe alliance was blamed for the killings of about 145 people in Cite Soleil and the rapes of multiple women.\n\nIn December 2020, the U.S. Treasury Department issued civil sanctions against Chérizier and others accused of being involved in the massacres.\n\nThe G-9 alliance later became part of the Viv Ansanm gang federation created in September 2023 that saw the merging of Haiti’s two biggest gangs that were once bitter enemies: G-9 and G-Pèp.\n\nSince then, the federation has taken control of 90% of Port-au-Prince, the capital. It launched multiple attacks on key government infrastructure in February 2024 and raided Haiti’s two biggest prisons, releasing more than 4,000 inmates. It also forced Haiti’s main international airport to close for nearly three months.\n\nThe surge in violence led to the resignation of Prime Minister Ariel Henry, who was locked out of his country while on an official visit to Kenya.\n\nThe gang federation continues to attack once peaceful communities in Port-au-Prince, and it is accused of helping gangs in Haiti’s central region.\n\nAlso indicted is Bazile Richardson, who officials say is a naturalized U.S. citizen from Haiti who grew up with Chérizier and lives in Fayetteville, N.C.\n\nBoth are accused of leading a “wide-ranging conspiracy” by directly soliciting money transfers from members of the Haitian diaspora to raise funds for Chérizier’s gang activities in Haiti, according to the indictment. It stated that the money was used to pay the salaries of gang members and buy weapons from illegal dealers in Haiti. Most of the firearms are smuggled in from the U.S. since Haiti does not produce weapons.\n\nAccording to the indictment, there are two other unnamed co-conspirators from Haiti who live in New York and Massachusetts, and five others who live in Haiti.\n\nChérizier could not be immediately reached for comment. It was not immediately clear whether Richardson had an attorney.\n\nThe indictment noted that Chérizier and Richardson have acknowledged the sanctions against Chérizier, adding that the alleged conspiracy began around December 2020 and continued through January of this year.\n\nOne voice memo that an unidentified co-conspirator in Haiti allegedly sent to Richardson stated: “If I have backup, we will take the power, and you will be able to come back to your country. You will need to serve in the new government.”\n\nRichardson forwarded the alleged memo to Chérizier in June 2022, nearly a year after then-President Jovenel Moise was killed at his private residence.\n\nAnother person identified only as a Haitian co-conspirator allegedly sent a voice memo to Richardson saying, “We want to start a revolution in Haiti and are trying to collect funds.” Part of the plan was to have 1,000 individuals give $20 each or 1 million Haitians abroad give $1 each, as well as collect money from 1,000 people for each of Haiti’s 10 regions, according to the indictment.\n\n“With this money, they can buy pickup trucks, weapons, ammunition, clothing to include T-shirts, boots and hats. We want to change everything in Haiti,” according to one alleged voice memo.\n\nIn June 2021, Chérizier held a news conference announcing the start of a revolution.\n\nThe indictment comes as gang violence continues to surge in Haiti’s capital and beyond, with gunmen kidnapping an Irish missionary and seven other people, including a 3-year-old, from an orphanage this month.\n\nThe office of Haiti’s prime minister did not immediately return a message seeking comment on the indictment.\n\nJohnston said the broader strategy in the fight against gangs remains unclear.\n\n“It does seem like there’s sort of an escalatory framework happening both in Haiti and the U.S.,” he said. “Where does that actually go?”\n\nDarren Cox, acting assistant director of the FBI’s Criminal Investigative Division, said the bureau’s Miami office is leading the effort to apprehend Chérizier.\n\n“The FBI is focused more than ever on crushing violent crime,” Cox said. “There is no safe haven for them, or the people like them.”\n\nCoto and Khalil write for the Associated Press. Khalil reported from Washington.",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/california/story/2025-03-20/reputed-mexican-cartel-leaders-seek-lawyers",
    "https://www.latimes.com/california/story/2025-03-09/mexican-mafia-shotcallers-heroin-los-angeles-sheriffs-deputy",
    "https://www.latimes.com/california/story/2025-05-16/ms-13-murder-fbi-informant",
    "https://www.latimes.com/topic/for-la-times-subscribers"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Haitian gang leader Jimmy Chérizier",
      "weight": 0.08847086
    },
    {
      "name": "Haiti",
      "weight": 0.08602096
    },
    {
      "name": "gang violence",
      "weight": 0.080820896
    },
    {
      "name": "gang members",
      "weight": 0.07926924
    },
    {
      "name": "gang activities",
      "weight": 0.076578744
    },
    {
      "name": "gangs",
      "weight": 0.07537849
    },
    {
      "name": "Chérizier",
      "weight": 0.07427197
    },
    {
      "name": "Jimmy Chérizier",
      "weight": 0.07420406
    },
    {
      "name": "U.S. State Department",
      "weight": 0.07142442
    },
    {
      "name": "U.S. sanctions",
      "weight": 0.07063534
    }
  ],
  "topics": [
    {
      "name": "Organized Crime"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.9931640625
    },
    {
      "name": "/News/Other",
      "score": 0.9931640625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.91845703125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.8720703125
    },
    {
      "name": "/News/Local News",
      "score": 0.75537109375
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.73291015625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5849609375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.4794921875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.32568359375
    }
  ],
  "sentiment": {
    "positive": 0.047970686,
    "negative": 0.7603461,
    "neutral": 0.1916832
  },
  "summary": "A federal grand jury has indicted Jimmy Chérizier, a Haitian gang leader known as Barbecue, and a U.S. citizen, Bazile Richardson, for conspiring to violate U.K. sanctions and fund gang activities in Haiti. The U.N. Justice Department designated the Viv Ansanm gang federation as a foreign terrorist organization in May. The indictment alleges that the money was used to pay the members' salaries and illegal weapons purchases from illegal dealers in Haiti, which is not producing weapons. The State Department has offered a $5 million bounty for information leading to Chérezier's arrest or conviction. Chézier, who lives in Haiti and is accused of orchestrating large-scale massacres in the slums of Grand Ravine in 2017, in La Saline in 2018 and in 2019.",
  "shortSummary": "A federal grand jury indicted Haiti's gang leader Jimmy Chérizier and U.S citizen for conspiring to violate sanctions and fund gang activities in the country.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "56efc54d1327437fb637f13d8df557d8",
  "places": [
    {
      "osmId": "613013099",
      "suburb": "La Saline",
      "city": "Port-au-Prince",
      "state": "West",
      "postcode": "6114",
      "country": "Haiti",
      "countryCode": "ht",
      "coordinates": {
        "lat": 18.5591708,
        "lon": -72.3425377
      }
    },
    {
      "osmId": "620045030",
      "suburb": "Bel Air",
      "city": "Commune Cap-Haïtien",
      "stateDistrict": "Arrondissement de Cap-Haïtien",
      "state": "Département du Nord",
      "postcode": "1100",
      "country": "Haiti",
      "countryCode": "ht",
      "coordinates": {
        "lat": 19.7536678,
        "lon": -72.2090939
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/california/story/2025-05-16/ms-13-murder-fbi-informant",
      "text": "MS-13 gangsters in L.A. killed member who was FBI informant, feds say\n- Share via\nHerlyn Barrientos wasn’t happy to run into a fellow member of his gang in the produce section of his local grocery store.\nA burly man with tattoos inked on his head and face, Barrientos was from MS-13, a group notorious for savage killings. Federal prosecutors alleged the Honduran national, nicknamed “Doctorazo,” supplied methamphetamine to MS-13 members across Los Angeles, who sold the drug and kicked up a cut to the gang’s imprisoned leader.\nCharged with drug trafficking in 2023, Barrientos decided to turn on his gang and cooperate with the FBI. A judge signed off on his release from jail, and Barrientos, 47, returned to South Los Angeles.\nFederal prosecutors on Friday announced three reputed MS-13 members are charged with killing Barrientos on the orders of gang leaders.\nBarrientos’ deal was supposed to remain secret, but the FBI now says Barrientos’ status as an informant was “widely” known, calling into question why he was still living in his old neighborhood when he was killed on Feb. 18.\nAn FBI spokeswoman declined to comment.\nJust before his death, Barrientos called an FBI agent to report seeing a man with a gun, the handler wrote in an affidavit. The agent said he was on the phone with Barrientos as he was shot to death.\nSidney Barrett Morris, who held a high-level post at Cal State Northridge, was gunned down as he ate dinner on Nov. 28, 2023. The suspected killers appeared in court recently, but a motive in the crime remains unclear.\n“It’s a terrible thing what happened to him,” said Michael Crain, an attorney who represented Barrientos in his drug trafficking case. Crain declined to comment further.\nThe affidavit said evidence made clear Barrientos was killed because he was cooperating.\nAfter his death, another informant working for the FBI called the leader of Barrientos’ MS-13 clique, who said people higher up in the gang had given him instructions: “They told me I had to clean out my garbage, you understand?”\n“That work you cannot say no to,” he said, according to the affidavit.\nAround 7 p.m. on the last day of his life, Barrientos drove to a Superior Grocers on Figueroa and 91st streets, Joseph Carelli, an FBI special agent, wrote in an affidavit.\nA black SUV followed Barrientos into the parking lot. Three men stepped out of the SUV and entered the store. In the produce section, they appeared to exchange greetings with Barrientos, Carelli wrote, citing footage from store cameras.\nOne of the three men, identified by Carelli as Roberto Carlos Aguilar, walked away and started making calls. Aguilar is a Salvadoran national who illegally entered the United States, a spokesman for the U.S. attorney’s office in Los Angeles said.\nAguilar and Barrientos talked in the parking lot of the grocery store for about 30 minutes, Carelli wrote. Aguilar got two calls during that time that went to voicemail. One was from Dennis Anaya Urias, a legal permanent resident of the U.S. and reputed member of MS-13’s Bagos clique, according to Carelli and the U.S. attorney’s office spokesman.\nBarrientos was also from the Bagos clique, a subset of MS-13 that is based in the Mid-City neighborhood, Carelli wrote.\nLanai Dees was driving her white Mercedes Benz in an alley off Century Boulevard in the Westmont neighborhood last November when someone in a dark-colored SUV opened fire, investigators said Thursday.\nT-Mobile records showed that Urias’ phone traveled from Koreatown to the area of the Superior Grocers around 7:50 p.m., when surveillance footage showed a gray Honda CR-V park across from the store, according to the agent.\nAguilar, meanwhile, walked off and Barrientos called 911. He told the operator he’d seen a man armed with a pistol. The suspect wore black, his face covered by a handkerchief, Barrientos said.\nBarrientos then called Carelli, his handler. A man whose face was covered just tried to shoot him, he told the agent, but the gun didn’t go off.\nAs they were talking, Carelli heard gunshots. Barrientos stopped responding. The agent heard the sounds of police and other first responders in the background, he wrote.\nA month later, California Highway Patrol officers found a burned CR-V in North Hollywood, Carelli wrote. The agent believed the car was the one shown in surveillance footage driven by Barrientos’ killers.\nArrested on May 12, Urias — whose phone records showed he’d traveled from Koreatown to South L.A. just before the shooting — told a jailhouse informant the order to kill Barrientos came “straight from the top,” Carelli wrote.\nAn abandoned car full of drugs allegedly led to the kidnapping and attempted murder of a Bell Gardens man, a case that authorities say offers a rare example of extreme cartel violence on U.S. soil.\nUrias said he and another MS-13 member, Grevil Zelaya Santiago, got a call from Aguilar, who said he’d found the “son of a whore,” according to the agent.\nUrias said he and Zelaya drove in the CR-V to South L.A., covered their faces and shot Barrientos to death, Carelli wrote.\nAttorneys for Urias and Zelaya didn’t immediately return request for comment. It wasn’t clear who was representing Aguilar.\nAll three defendants have pleaded not guilty to charges of murder in aid of racketeering."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-03-09/mexican-mafia-shotcallers-heroin-los-angeles-sheriffs-deputy",
      "text": "Inside the alleged Mexican Mafia plot to smuggle heroin with an L.A. jail deputy\n- Share via\n- L.A. County Sheriff’s Deputy Michael Meiser has pleaded not guilty to charges of conspiring to distribute drugs within a jail and participating in a gang conspiracy.\n- Meiser is accused of conspiring with gang “shot-callers” to smuggle more than a pound of heroin into a Los Angeles jail.\nEven after it was deciphered, the coded message from jail seemed strange.\nIn a recorded call, a Los Angeles County inmate recited a string of numbers to a woman on the other end of the line: “84, 89, 17, 17, 31 ...”\nSheriff’s deputies had seized a handwritten key from inside the jail that allowed them to decode it. “I need you to go buy two big Pringles chips,” it began, according to law enforcement records reviewed by The Times.\nThe exchange from April 2024 is at the heart of an arrest by sheriff’s investigators of one of their own: Deputy Michael Meiser, assigned to a specialized unit that monitored gang activity in the nation’s largest jail complex. He is now charged with conspiring with gang “shot-callers” to smuggle heroin into lockups.\nDeputies arrested Meiser on April 30, 2024. Inside a bag that Meiser allegedly brought onto jail grounds, investigators found more than a pound of heroin hidden inside two tubes of Pringles.\nWithin the jails, where inmates sell heroin in tiny smears called “papers,” that amount was worth $226,000, a sheriff’s lieutenant wrote in a report.\nMeiser has pleaded not guilty to charges of conspiring to distribute drugs within a jail and participating in a gang conspiracy. His lawyer didn’t return a request for comment.\nOther deputies assigned to Operation Safe Jails have not been implicated in the drug trafficking scheme. But a report filed by the Sheriff’s Department’s Internal Criminal Investigations Bureau portrayed a squad that accepted gang leaders wielded more authority over inmates than their jailers.\nAllan Roshanski and Ruslan Magomedgadzhiev were gunned down in Lomita in 2020. A witness revealed why the Aryan Brotherhood wanted them dead.\nMeiser’s partner spoke of being “on the same page” with inmate “shot-callers” on such issues as overdoses and violence, which deputies felt they were powerless to prevent. Deputy Jose Munguia said in his internal affairs interview, he and Meiser asked the gang leaders to avoid killing anyone or hurting deputies when they dispensed their own brand of discipline.\nSheriff’s Department officials didn’t directly address questions about how Meiser’s unit engaged with gang leaders. “We hold our employees to the highest standards and expect them to safeguard individuals within our custody,” the department said in an unsigned, emailed statement. “When they violate the law they will be held accountable.”\nRecords show Meiser’s partner said their approach was intended to minimize chaos in the jail system. Meiser became friendly with inmates who wanted the deputy’s ear — but it also brought him closer to hardened criminals who used violence to keep drug and extortion rackets running smoothly.\nBy the time of his partner’s arrest, Munguia said, “We would walk through a building and all you would hear is, ‘Meiser. Meiser. Meiser. Meiser.’ All the inmates are like just trying to talk to him. They’re all yelling his name from the bars.”\nMeiser, 39, was assigned to North County Correctional Facility, one of eight county jails that together hold more than 12,000 inmates.\nAbout half of those prisoners are Latino, and Munguia told internal investigators the Mexican Mafia dictates their lives behind bars. A prison-based syndicate of about 140 senior Latino gang members, the Mexican Mafia designates inmates to oversee drug and extortion schemes in specific jails or modules.\nIt was Meiser and Munguia’s job to investigate these “shot-callers” by listening to their phone calls, monitoring surveillance cameras within the jail and interviewing informants, Munguia told internal investigators.\nThe “shot-caller” at North County Correctional Facility was Jose Rodriguez, a reputed member of the Pacoima Project Boys gang called “Benji,” Munguia said.\nRodriguez, 47, issued inmates “driver’s licenses” — handwritten notes giving them permission to sell drugs — and imposed discipline in the form of beatings, the deputy said.\n“If they had to do any smash-outs, any narcotics, everything went through him,” Munguia said.\nInmates and their jailers might be expected to be sworn enemies, but Munguia described taking a less-than-adversarial approach to Rodriguez.\n“Let’s say there’s a riot, Hispanics versus Black inmates in the dorm,” Munguia explained to internal investigators. “Of course we would — we would go to him and ask him to make sure, like, it’s not going to continue.”\nRodriguez often sent his right-hand man, Jackie Triplett, to speak on his behalf, according to Munguia. Triplett, 40, and Meiser had a “rapport” because they had mutual friends in the Antelope Valley, Munguia said.\nTestimony delivered at the ongoing trial of three accused Aryan Brotherhood members delved into Los Angeles County’s underbelly: Cheap hotels, gambling parlors and crash pads from Lancaster to Long Beach, drug dealers and fraudsters.\nThe main issues they discussed were keeping overdoses and racial tensions to a minimum, Munguia said. The gang leaders appear to have taken the talks seriously. According to the internal affairs report, deputies seized a list of “rules and expectations” from Rodriguez’s bunk that was addressed to Latino inmates.\nFentanyl, a powerful opioid that has driven a surge in fatal overdoses, was prohibited. So was “disrespecting” jail staff and buying drugs from inmates of other races.\n“ANYONE THAT CHOOSES TO GO AGAINST THIS IS TO BE DEALT WITH ACCORDINGLY,” the message warned.\nAnother note seized from Rodriguez’s living area listed the discipline meted out for the week. Infractions ranged from using fentanyl to “gossiping” to failing to repay a debt. Violators were punished with beatings — the least severe lasting 13 seconds, the harshest a “smash-out” that so badly injured an inmate deputies were required to remove him from the jail module.\nMunguia told internal investigators he and Meiser did not believe they could prevent gang leaders from ordering violence. Instead, they reasoned with Rodriguez and Triplett to “mitigate” it, he said.\n“If you’re going to assault someone, we don’t want any deputies hurt,” he recalled telling them. “We don’t want — obviously, we don’t want the inmates to die. So let’s try to do it as minimal as possible and pretty much not cause too much attention.”\nThe internal investigator sounded puzzled.\n“It would seem to me like that practice would almost empower the inmates,” he said. “You’re kind of acknowledging their authority by doing that? Is that correct?”\nMunguia said he didn’t agree with the approach, which he claimed he learned from Meiser, but “the way I was taught was, like, it had to be done.”\nStarting in February 2024, investigators from an FBI task force noticed a series of strange phone calls made by Triplett and Rodriguez, according to the internal affairs report.\nTriplett spoke to a woman who said she’d bought “white Jordans” and “black Jordans” — coded language for methamphetamine and heroin, investigators suspected.\nThe next day, Meiser was shown on the jail’s surveillance cameras handing Triplett a bag and bedroll, the report says. Later that night, Triplett called to thank the woman, who said it was his “time to shine,” according to the report.\nTwo months later, an inmate in Rodriguez’s module read off the string of numbers that were later decoded to be a request for Pringles.\n“Whatever girlfriend give you put half in one half in the other,” the rest of the message said, according to the internal affairs report. “Put a few chips on top and sual it like its brand new.”\nRodriguez was recorded on a jail call asking his sister to send a “1 o’clock” and a “5 o’clock” — code for $1,000 and $5,000, investigators believed — to the CashApp account of Meiser’s brother-in-law, the report says.\nThe day after the call, internal affairs detectives got a warrant to place a tracking device on Meiser’s white 2018 BMW 530i.\nFederal prosecutors alleged Ronaldo Ayala, reputed to be a powerful member of the Mexican Mafia prison gang, conspired with the Sinaloa cartel and offered to protect its notorious former leader, Joaquín “El Chapo” Guzmán.\nMeiser appeared to his partner to be living beyond the means of a sheriff’s deputy. Along with the BMW, Munguia said, Meiser drove an Infiniti and was building a custom Ford truck.\n“He just said everything was on credit,” Munguia told internal investigators.\nThe morning of April 30, 2024, internal affairs detectives tailed Meiser from his home in Lancaster to a gas station in Valencia, the report says. He parked next to a red SUV. Someone in the driver’s seat handed him a bag, according to the report.\nMeiser drove to Munguia’s apartment and the two carpooled to the jail in Mungia’s truck. In the parking lot, Meiser unlocked a police car and put something in the trunk before entering the jail, the report says.\nDetectives searched the police car. Inside a Sprouts grocery bag were two tubes of Pringles. Stuffed down beneath the chips were plastic-wrapped blocks of black tar heroin — 1.128 pounds, the report says.\nMeiser, apparently unaware of the search, asked a colleague to drive the police car into the jail’s secured area, according to the report. “Just wanted the radio car brought around if you were coming because I’m lazy. Lol,” he wrote in a text message cited in the report.\nMunguia told internal investigators it was unlike Meiser to ask a favor of the deputy, whom Meiser “hated.” The deputy told Meiser he wasn’t at the jail and couldn’t do it.\nAfter their shift, Munguia and Meiser were leaving the jail grounds in Munguia’s truck when a police car stopped them. Munguia recalled thinking it was a training exercise or a joke. Then sheriff’s deputies ordered them out at gunpoint.\n“Oh s—,” Meiser said, according to Munguia. “Are they being f—ing serious?”\nIn Meiser’s bag, internal affairs detectives found two envelopes containing $15,000, according to the report. Detectives seized another $10,500 from his sock drawer after serving a warrant at his house.\nMeiser refused to speak with investigators.\nIn his internal affairs interview, Munguia said there were signs in hindsight that Meiser had grown too close to the men he was supposed to be investigating.\n“How vocal he was with inmates. Their rapport — well, what we thought was rapport,” Munguia said. “Obviously, [it] was more than that.”"
    },
    {
      "url": "https://www.latimes.com/topic/for-la-times-subscribers",
      "text": "Latest\nExperts are divided: Is any new development in California’s housing crisis welcome, or are certain types of housing more needed?\nExperts are divided: Is any new development in California’s housing crisis welcome, or are certain types of housing more needed?\nAuthorities say illegal card games hosted at mansions in Encino, Sherman Oaks and the Hollywood Hills bring together Israeli organized crime figures, Latino gang members and gamblers who racked up debts as high as $1.5 million.\nBetween the destination-worthy margarita bar, the matcha martinis, the dives with killer cocktails, and the new Big Easy beverages, the only question is where to begin.\nFrom Windansea to Moonlight Beach to Swami’s Beach to North Torrey Pines State Beach to Fletcher Cove, here are the best beaches in San Diego County.\nDespite a growing narrative that California is hostile to businesses, experts say the state still has unmatched advantages.\nMore than a hot spot for buzzy restaurants and boba shops, this neighborhood reflects the legacy of Japanese immigrants.\nMexico once vowed to reform its police. That has been abandoned as the country deploys soldiers to fight cartels.\nCalifornia has new homeowners association rules. For most homeowners, fines are now capped at $100, thanks to a new housing bill.\nThe dispute drew in some of the city’s top lawyers, triggered calls to police, and led the Annenberg children to march into Los Angeles County Superior Court in a frantic effort to dislodge Vikki Levine from overseeing their mother’s medical care.\nManuel Quintero, alleged to be a member of the Mexican Mafia prison syndicate, is charged with killing the owner of El Farallon, a popular Lynwood nightclub.\nAI is supplying powerful new tools at a fraction of the cost, forcing below-the-line artists to wonder if the future of filmmaking has a place for them."
    },
    {
      "url": "https://www.latimes.com/california/story/2025-03-20/reputed-mexican-cartel-leaders-seek-lawyers",
      "text": "What’s it like to defend a Mexican cartel boss? Reputed drug lords seek lawyers in U.S.\n- Share via\nOn a single day late last month, the Mexican government shipped 29 accused drug lords north across the border to face U.S. justice.\nPlucked from Mexican prison cells, hustled onto planes in shackles and express-delivered into the waiting hands of American authorities were several notorious capos, whose alleged narco exploits have been chronicled in films, TV series and federal indictments spanning decades.\nAmong them are brothers said to be behind the brutal group known as the Zetas; reputed leaders of the Gulf, Juarez and Jalisco New Generation cartels; and the elusive Rafael Caro Quintero, wanted since the 1980s in connection with the torture and killing of a U.S. Drug Enforcement Administration agent.\nAll are now housed at jails across the country on charges including drug trafficking and murder. At least six could face the death penalty, an unusual twist due to the unique circumstances of their arrival.\nWith their cases now in U.S. courts, there’s been a scramble to find lawyers willing and able to defend such high-stakes clients. President Trump has complicated the situation by designating several cartels as terrorist organizations, raising concerns the Treasury Department could seek to freeze assets used to pay attorneys.\nNearly three weeks after their arrival, several notable defendants sent by Mexico on Feb. 27 — including Caro Quintero — still have court-appointed counsel, meaning U.S. taxpayers are footing their legal bills.\nMultiple lawyers who specialize in complex federal drug and conspiracy cases described the current moment as unprecedented. Each week seems to bring fresh chaos as Trump ratchets up pressure on Mexico to topple the cartels and stanch the flow of fentanyl.\nThere is growing evidence to suggest Ismael ‘El Mayo’ Zambada was hauled against his will from Mexico to El Paso in an effort by El Chapo’s son to curry favor with U.S. authorities.\nIt should be boom times for the so-called white powder bar, as the practice of lawyering for the world’s most prolific drug pushers has been dubbed. But some veteran attorneys are proceeding with caution, warning of unforeseen consequences from Trump’s crackdown and preexisting conflicts that limit who can join certain cases.\n“This is sort of like a niche practice,” said Bonnie Klapper, a former federal narcotics prosecutor turned defense attorney. “I guarantee you a lot of the usual suspects won’t be able to represent these people.”\nKlapper once helped take down Colombia’s Norte del Valle cartel, but she has since switched sides, operating as private counsel. Her past work as a prosecutor precludes her from cases in which she helped craft the indictment, and she’s heard from colleagues who have spotted other conflicts, such as representing potential witnesses.\nThe death penalty charges further narrow the field. Capital cases require experienced “learned counsel” and bring their own unique set of challenges, not least the possibility of the client being executed. Three of the 29 prisoners sent over by Mexico are charged in California federal courts, including one death penalty case in Los Angeles.\nAdding terrorism designations and pursuing the death penalty while restricting ways for former cartel members to remain in the U.S. also risk making it harder for federal authorities to flip informants, Klapper said.\n“I don’t think anybody has thought through the implications of this for the criminal justice system,” she said. “Because who is going to cooperate if the U.S. won’t protect them and their families?”\nMexico has abolished capital punishment and typically does not extradite citizens who could be put to death under U.S. law. But officials on both sides of the border have tiptoed around using the word “extradition” for the recent handover. A news release from the Department of Justice said the U.S. simply “secured custody” of the wanted men.\nWilliam Purpura was one of three lawyers who defended former Sinaloa cartel leader Joaquin “El Chapo” Guzman during a three-month trial that ended with a conviction in 2019. That case did not involve the death penalty, but Purpura has worked on a number of others that did. He said it’s a grueling endeavor, requiring “complete dedication to one client.”\n“A death verdict will haunt trial counsel to the execution and beyond,” Purpura said. “This is not an undertaking for the usual cast of characters. It is the Chapo trial on steroids.”\nPurpura and others in private practice said they typically find work through referrals, relying on lawyers in Mexico and meeting with a prospective client’s family to build trust before taking on a case.\nDefense attorneys have allegedly broken the law in pursuit of business. Last month, a prominent Miami lawyer was charged with a bribery scheme in which prosecutors say two former DEA supervisors leaked confidential information in exchange for Yankees tickets and five-figure secret payments. The tips were about active investigations, which prosecutors said enabled the lawyer to get a head start on wooing the targets as clients.\nThe lawyer, David Macey, has pleaded not guilty to charges that include bribery of a public official and perjury.\n“David is a devoted father and husband and a highly respected attorney with an impeccable record as a member of the bar for nearly 30 years. He did not bribe anyone,” Macey’s attorney, David Patton, said in a statement. “The government’s allegations are false, and we are confident that the evidence will prove his innocence at trial.”\nSome of the highest-powered operators have taken on generations of relatives from the same family. Jeffrey Lichtman, the lead trial attorney for El Chapo, now defends his client’s two sons, known as Los Chapitos, in their pending U.S. cases. Court records also show Lichtman was recently added to the case of a suspected high-ranking Chapitos member who was among the 29 men handed over by Mexico.\nLichtman did not respond to a request for comment.\nThe case of ‘El Menchito’ has highlighted the generational divide between boomer-aged drug cartel bosses and their millennial children.\nBefore representing the Chapo clan, Lichtman once helped New York mob figure John Gotti Jr. beat racketeering charges.\n“I’m used to dealing with clients that society has already discarded, already convicted, and being able to convince [jurors] that maybe everything the government and the press says is not 100% accurate,” Lichtman said in a 2017 interview about his decision to represent El Chapo.\nOne of El Chapo’s sons is accused of kidnapping their father’s longtime Sinaloa cartel partner, Ismael “El Mayo” Zambada, and delivering him to U.S. authorities in the summer. The alleged betrayal triggered an ongoing war between cartel factions in Mexico, and left Zambada, 75, facing a possible death sentence for drug and murder charges in the Eastern District of New York. He has pleaded not guilty.\nZambada’s lawyer, Frank Perez, 70, had careers as an air traffic controller and Dallas narcotics detective before building up his law practice. Perez also tried his hand at politics, launching an unsuccessful bid for Congress as a Democrat in 2014. He recently found himself thrust into the spotlight, with Zambada’s case becoming a source of international intrigue and controversy.\nPerez has issued statements on the jailed Zambada’s behalf, leveling the kidnapping claims against El Chapo’s son and denying rumors of a secret surrender deal. Recently, Perez and two lawyers in Mexico petitioned to have Zambada returned to his home country, arguing he was “coercively transferred from Mexican territory.”\nIn the escalating war among rival factions of Mexico’s Sinaloa cartel, sons of Joaquín “El Chapo” Guzmán are suspected of ordering the destruction of elaborate mausoleums that belong to rival families, including one for a fallen grandson of Ismael “El Mayo” Zambada.\nThe federal judge presiding over Zambada’s case in Brooklyn raised concerns that Perez has a potential conflict of interest. Perez also represented his client’s son, Vicente Zambada Niebla, a key witness against El Chapo who could now potentially be called to testify against his own father.\nThe elder Zambada said at a Jan. 15 hearing that he understood the situation and trusted his lawyer.\n“He may have to withhold information he learns from speaking with Vicente that he can’t share with me,” Zambada said, reading a prepared statement in Spanish. “But I don’t want a different attorney. I want Frank Perez to represent me.”\nPerez declined to comment, except to reiterate his recent public statements that his client is not cooperating with U.S. authorities and fighting to avoid the death penalty.\nZambada, a Sinaloa cartel founder, was long believed to have police, soldiers, political leaders in his pocket. In a rare public statement, he acknowledges those ties -- and contradicts Mexican officials’ version of his capture.\nCourt records show Perez also recently took on another high-profile client: Miguel Angel Treviño-Morales, nicknamed Z-40. Treviño-Morales was arraigned last week in Washington, where he pleaded not guilty to an array of drug and murder conspiracy charges for his alleged leadership of the Zetas.\nOriginally a squad of elite Mexican military defectors who became guns for hire, the Zetas formed a ruthless cartel blamed by authorities for a long list of atrocities over the last three decades. A splinter group, the Northeast cartel, was among those designated as a terrorist organization last month by the Trump administration.\nThe terror designation, several lawyers said, has created uncertainty about whether some standard operating procedures for cartel cases may no longer apply.\nThe U.S. Treasury’s Office of Foreign Assets Control has long maintained a so-called kingpin list of suspected drug traffickers and front companies that are banned from doing business with U.S. citizens or accessing the banking system. Usually, defense lawyers said, if they provide proper notification, disclosing how much money was received and what it was for, the agency will allow transactions for legal services.\nSoldiers and civilians have been killed in separate incidents in recent months involving ‘narco mines’ planted in western Mexico.\nFor one thing, the system ensures tax dollars aren’t unnecessarily spent on court-appointed counsel.\nEduardo Balarezo, another El Chapo trial attorney, said it’s in the government’s interest to allow private counsel, especially when the defendant is willing to negotiate a plea.\nThe deals can ensure the client has a chance of someday walking free, net the government millions of dollars in surrenders of illicit cash — and also make less work for all of the lawyers involved.\n“It doesn’t take that much to go in with your client to the government and listen to him talk,” Balarezo said. “You have to prepare him, but it’s not the same as a trial.”\nBut with Trump rebranding cartels as terrorists, some lawyers worry the government may change its stance on payments and pleas.\n“That’s a huge question for all these people: Do they have assets to pay for lawyers, and is the government going to do anything about it?” said César de Castro, a New York defense attorney who has worked on several major drug cases.\nAlthough U.S. prosecutors have accused top-level traffickers of being billionaires, some can show on paper that they can’t afford an attorney.\nAccording to federal prosecutors, Genaro García Luna, once his country’s equivalent of J. Edgar Hoover, enabled El Chapo and others to operate with impunity.\nDe Castro served as the court-appointed lawyer for Genaro García Luna, a former Mexican security official sentenced last year to 38 years in prison for taking millions in cartel bribes.\nThe case was under a media and political microscope, forcing De Castro to tread carefully.\n“Every phrasing of everything is important,” he said. “Every fricking word matters.”\nDe Castro faced backlash during the trial when Mexico’s former president took offense to the lawyer’s questions about alleged cartel payments. Death threats ensued — a hazard of the job, the lawyer said.\n“I don’t want to be threatened or chased outside the courthouse. I have a family too. I don’t need voicemails telling me I should die. But I had to do it for my client,” he said."
    }
  ],
  "argos_summary": "Jimmy Chérizier, a notorious Haitian gang leader known as 'Barbecue,' has been indicted by a U.S. federal grand jury for conspiring to violate U.S. sanctions and fund gang activities in Haiti. Chérizier, who leads the gang federation Viv Ansanm, is accused of orchestrating violent acts and massacres in Haiti, while a U.S. citizen, Bazile Richardson, is also indicted for allegedly soliciting funds from the Haitian diaspora to support Chérizier's operations. The indictment comes amid escalating gang violence in Haiti, which has led to significant political instability and the resignation of Prime Minister Ariel Henry.",
  "argos_id": "30TEHPQ03"
}