{
  "url": "https://www.express.co.uk/showbiz/tv-radio/2094109/good-morning-britain-breaking-news-keir-starmer",
  "authorsByline": "Fran Winston",
  "articleId": "a55b19d9d50744f0b25ccbfb66e0736e",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/20/1200x630/6354567.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T07:53:00+01:00",
  "addDate": "2025-08-12T07:05:28.216280+00:00",
  "refreshDate": "2025-08-12T07:05:28.216282+00:00",
  "score": 1.0,
  "title": "Good Morning Britain halted for 'breaking news' – it's crushing blow to Starmer",
  "description": "Good Morning Britain newsreader Marverine Cole delivered an update that marks some bad news for the Prime Minister",
  "content": "Good Morning Britain's Marverine Cole delivered some devastating breaking news for Labour as she announced a huge increase in unemployment in the UK. In what will be a huge blow to Keir Starmer she revealed that the figures for those out of work rose by 26,000. \"Breaking news now,\" she said. \"And unemployment rose by 26,000 between May and June of this year according to the Office of National Statistics. It says, unemployment is now risen in 10 of the last 12 months, driven by job losses in hospitality and retail sectors.\"\n\nThis is a breaking live TV story, the Showbiz Express.co.uk team will be updating this story with the latest information as soon as we receive it. For further updates, please refresh the page\n\nGet all the very best news, pictures, opinion and video on your favourite TV shows by following Express.co.uk every time you see our name.\n• None Follow Express on Apple News -_ CLICK HERE__ available on Apple devices_\n• None Follow Express on _Flipboard - _CLICK HERE and click follow\n\nYou can also sign up for Twitter alerts for breaking news and all the latest updates by following @‌Daily_Express, or for the latest TV and showbiz news, follow @‌expressceleb\n\nKeep up-to-date with your must-see TV stories, features, videos and pictures throughout the day by following us on Facebook at Express Celebrity",
  "medium": "Article",
  "links": [
    "https://news.google.com/publications/CAAqBwgKMIyk_AownOOIAw?hl=en-GB&gl=GB&ceid=GB%3Aen",
    "https://www.express.co.uk/latest/keir-starmer",
    "https://apple.news/TlxeO-iIJSlueUSws1ZSHJg",
    "https://news.google.com/publications/CAAqBwgKMPfd-QowntHmAg?hl=en-GB&gl=GB&ceid=GB%3Aen",
    "https://flipboard.com/@DailyExpress",
    "https://www.express.co.uk/",
    "https://twitter.com/starbreaksnews",
    "https://twitter.com/Daily_Express",
    "https://www.express.co.uk/latest/good-morning-britain",
    "https://twitter.com/expressceleb",
    "https://www.facebook.com/ExpressCelebrity",
    "https://www.express.co.uk/showbiz"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "breaking news",
      "weight": 0.118713476
    },
    {
      "name": "TV stories",
      "weight": 0.106605776
    },
    {
      "name": "Good Morning Britain",
      "weight": 0.083992526
    },
    {
      "name": "Express Celebrity",
      "weight": 0.076358765
    },
    {
      "name": "job losses",
      "weight": 0.07541244
    },
    {
      "name": "Keir Starmer",
      "weight": 0.073174916
    },
    {
      "name": "Express",
      "weight": 0.07201077
    },
    {
      "name": "unemployment",
      "weight": 0.06932271
    },
    {
      "name": "some devastating breaking news",
      "weight": 0.06915548
    },
    {
      "name": "crushing blow",
      "weight": 0.06887425
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.9453125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.68017578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.59521484375
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.384033203125
    }
  ],
  "sentiment": {
    "positive": 0.27957442,
    "negative": 0.51010543,
    "neutral": 0.21032017
  },
  "summary": "The Office of National Statistics has reported a significant increase in unemployment in the UK, with a rise of 26,000 people out of work between May and June, driven by job losses in the hospitality and retail sectors. This is expected to be a significant blow to Labour leader Keir Starmer.",
  "shortSummary": "Good Morning Britain's Marverine Cole reported a 26,000-page gap between employment and income, devastatingly affecting Labour's Keir Starmer.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a5d21a66a068466bb16e6f592bf469e0",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://news.google.com/publications/CAAqBwgKMIyk_AownOOIAw?hl=en-GB&gl=GB&ceid=GB%3Aen",
      "text": "- EnglishUnited Kingdom\n- Deutsch\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited Kingdom\n- Deutsch\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to 'Accept all', we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalised content, depending on your settings\n- Show personalised ads, depending on your settings\nIf you choose to 'Reject all', we will not use cookies for these additional purposes.\nNon-personalised content is influenced by things like the content that you’re currently viewing, activity in your active Search session, and your location. Non-personalised ads are influenced by the content that you’re currently viewing and your general location. Personalised content and ads can also include more relevant results, recommendations and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect 'More options' to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://flipboard.com/@DailyExpress",
      "text": "Express Newspapersflipped into TV & RADIONowEamonn Holmes rips apart Labour over migrant crisis with just 8 brutal wordsexpress.co.uk - Holly FleetAs whispers of discontent echo across the UK, Eamonn Holmes' startling observations on small boat crossings reveal a nation on the brink of political …\nExpress Newspapersflipped into TV & RADIO1 hour agoBBC Breakfast viewers 'switch off' as they fume 'enough now'express.co.uk - Sara BaallaBBC Breakfast viewers issued the same complaint during an interview on Tuesday's show BBC Breakfast viewers claimed to \"switch off\" as they fumed over …\nExpress Newspapersflipped into TV & RADIO1 hour agoGood Morning Britain halted for 'breaking news' – it's crushing blow to Starmerexpress.co.uk - Fran WinstonGood Morning Britain newsreader Marverine Cole delivered an update that marks some bad news for the Prime Minister Good Morning Britain's Marverine …\nExpress Newspapersflipped into TV & RADIO1 hour agoStrictly Come Dancing next contestant confirmed and it's huge EastEnders iconexpress.co.uk - Fran WinstonThe latest person taking part in this year's Strictly Come Dancing was revealed on Good Morning Britain The latest contest on this year's Strictly …\nExpress Newspapersflipped into Showbiz1 hour agoEmmy Award-winning Hollywood legend famed for 24 role dies as tributes pour inexpress.co.uk - Jess PhillipsAn Emmy Award winner who worked on Prison Break, 24 and Homeland has sadly died Michael Klick, Emmy Award winning producer who worked on shows like …\nExpress Newspapersflipped into FOOTBALLNowIsak agreement struck, Garnacho warns Man Utd, Spurs hijack Arsenal transferexpress.co.uk - Alex TurkExpress Sport provides all the latest transfer news LIVE. All eyes are on the return of the Premier League this weekend as a new campaign beckons, but …"
    },
    {
      "url": "https://www.express.co.uk/",
      "text": "The Chancellor has sunk the UK economy, but the stock market stands firm. That could change.\nBrooklyn Beckham and Nicola Peltz's vow renewal took an unexpected turn as family...\nMinister asked about reports more than 50,000 migrants have crossed the Channel in...\nThe latest person taking part in this year's Strictly Come Dancing was revealed on...\nEuropean leaders, including Sir Keir Starmer, will speak to Donald Trump ahead of his...\nExpress Sport provides all the latest transfer news LIVE.\nThe closure has been expected as queues build on the M25.\nThe Russian Embassy in London has hit out at the UK ahead of Putin-Trump peace talks.\nAn Emmy Award winner who worked on Prison Break, 24 and Homeland has sadly died\nAfternoons are peak activity time and this year's colonies are bigger and more...\nEXCLUSIVE: More than 50,000 people have entered the country via small boat crossings...\nAs Donald Trump prepares for a pivotal meeting with Vladimir Putin, his unexpected...\nDaily Express\nEducation minister Baroness Jacqui Smith spoke to BBC Breakfast after new figures...\nGoogle is set to launch its new phones very soon, but Amazon has a big discount on the...\nThe news comes as Russian President Vladimir Putin warned of nuclear war when he...\nJamie Stevens, 51, carried on living in the flat as the body of Anouska Sites, 45,...\nAmazon is dishing out the Galaxy Tab S10 FE+ at a handsomely discounted rate.\nThe chairs come in a twin pack and a choice of colours.\nLabour is looking into a major overhaul of UK motoring rules with new eye checks,...\nWidespread misconceptions have led many people to believe certain foods and chemicals...\nEXCLUSIVE: Anna Williamson is a professional life coach, author, and podcaster known...\nHere's what the major banks have done since the Bank of England reduced the base rate\nA couple has shared their fool-proof way of how to hang a painting or frame onto a...\nA royal book claims Meghan Markle deliberately undermined a royal aide in a \"very...\nThe BBC historical films are a series of adaptations of some of Shakespeare's most gripping history plays\nThe border has become a symbol of anti-immigrant division in Europe after lying...\nThe pretty town is loved by locals and popular with holiday makers for several reasons...\nThe world's best tennis players are in action at the Cincinnati Open ahead of the last...\nEXCLUSIVE: Meghan Markle could soon make her As Ever products available in the UK.\nPolice have issued CCTV images of two women they want to speak to after a man in his...\nThe Duke of Sussex could return to his home country next month.\nThree people, including a child, have died after a shooting in the parking lot of a...\nOne of the first web pioneers is finally about to hang up the phone.\nEXCLUSIVE: A royal expert has revealed how the Royal Family will be feeling after...\nPeter Phillips' royal wedding is on the cards as he recently announced his engagement...\nIt had been reported that Prince Harry and Meghan Markle's Netflix deal was coming to...\nRussia risks losing 130 small towns amid collapsing industries, poor infrastructure...\nI recently had air conditioning fitted in my home by BOXT - it's completely changed my...\nThe 2025 Strictly cast announcements have officially begun\nFox News paused their broadcast as they went live from the White House\nTennis stars are in action at the Cincinnati Open this weekend.\nAn extractor fan is key in any kitchen, but it will only work effectively when it's...\n49 stores will be closing across the UK over the coming weeks.\nActress Alex Kingston, who is best known for playing River Song in Doctor Who, is set...\nGardening is an excellent activity providing fresh produce, beautiful flowers, and a...\nThe Queen legend's former girlfriend has spoken out on the bombshell claims he...\nThe former aide had a very direct message to give to Prince Harry.\nThe Karcher LTR 18-30 grass trimmer is a quick and easy way to remove long grass and...\n\"I don't know that he would have made it another 24 hours without us recovering him,\" a rescuer said.\nTo speed up the ripening process of avocados, a food enthusiast has shared the...\nA US company is making progress on its first UK-based £200 million attraction housing...\nGardeners are being urged to help hedgehogs this week.\nThis \"brilliant\" murder mystery, which left viewers on the edge of their seats, will...\nIt had been reported that Prince Harry and Meghan Markle's Netflix deal was over.\nThe supermarket's Labour-backing chairman previously said should stop \"wallowing\" and...\nDonald Trump held a major press conference on Monday, focused on homelessness in...\nDaily Express uses notifications to keep you updated"
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMPfd-QowntHmAg?hl=en-GB&gl=GB&ceid=GB%3Aen",
      "text": "- EnglishUnited Kingdom\n- Deutsch\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited Kingdom\n- Deutsch\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to 'Accept all', we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalised content, depending on your settings\n- Show personalised ads, depending on your settings\nIf you choose to 'Reject all', we will not use cookies for these additional purposes.\nNon-personalised content is influenced by things like the content that you’re currently viewing, activity in your active Search session, and your location. Non-personalised ads are influenced by the content that you’re currently viewing and your general location. Personalised content and ads can also include more relevant results, recommendations and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect 'More options' to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    }
  ],
  "argos_summary": "Good Morning Britain's Marverine Cole reported a significant rise in UK unemployment, with an increase of 26,000 jobless individuals between May and June, according to the Office of National Statistics. This marks a troubling trend, as unemployment has risen in 10 of the last 12 months, primarily due to job losses in the hospitality and retail sectors, posing a challenge for Labour leader Keir Starmer.",
  "argos_id": "3AB4TZN48"
}