{
  "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/12/michael-j-fox-back-to-the-future-40th-anniversary/85633151007/",
  "authorsByline": "KiMi Robinson",
  "articleId": "3a469b45a7a149a883aa35c6d28c2944",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/12/USAT/85633351007-mjf-shp-1.JPG?crop=2507,1410,x1655,y1204&width=2507&height=1410&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:22:25+00:00",
  "addDate": "2025-08-12T23:25:01.404580+00:00",
  "refreshDate": "2025-08-12T23:25:01.404581+00:00",
  "score": 1.0,
  "title": "Michael J. Fox makes rare appearance to celebrate 'Back to the Future' 40th anniversary",
  "description": "Michael J. Fox – Marty McFly himself – discussed his life with Parkinson's and the legacy of \"Back to the Future\" 40 years after its release.",
  "content": "Forty years after \"Back to the Future's\" release, Michael J. Fox isn't done delighting fans.\n\nThe Emmy-winning actor, 64, on Aug. 10 attended a Southampton, New York, IMAX screening of the film that jump started his career on the big screen.\n\nThe crowd at the sold-out stayed afterward for his conversation with Southampton Playhouse's artistic director, Eric Kohn, with topics ranging from the twists in Fox's life and career over the past four decades – including his life with Parkinson's disease – to his work with his Michael J. Fox Foundation.\n\n\"Michael’s insights into his relationship to acting, and how it changed — first via blockbuster success and then through his diagnosis — made for a conversation that was by turns emotional, endearing, and inspirational,\" Kohn wrote in an Aug. 12 Instagram post.\n\nThe Oscar-winning film from Robert Zemeckis was made on a $19 million budget and released in theaters on July 3, 1985. It went on to earn $224 million at the worldwide box office and has since become a Hollywood classic, even getting inducted into the Library of Congress' National Film Registry in 2007.\n\nFox reprised his role as teen Marty McFly, alongside Christopher Lloyd as Doc Brown, in two more \"Back to the Future\" movies.\n\nLloyd, 86, has also continued to appear in films and TV shows, most recently the second season of \"Wednesday\" and \"Hacks.\" He made a rare public appearance alongside wife Lisa Loiacono at the Hollywood premiere of his latest project, the Bob Odenkirk-starring \"Nobody 2,\" on Aug. 11.\n\nSince publicly revealing his Parkinson's diagnosis in 1998 – seven years after his diagnosis – Fox has continued to act in Hollywood while also advocating for and funding Parkinson's research through his foundation.\n\nIn January, President Joe Biden awarded him the Presidential Medal of Freedom as he \"warms hearts and captivates audiences as a fearless advocate for those with Parkinson's disease.\"\n\nThe fastest-growing neurodegenerative condition in the U.S., Parkinson’s is an incurable brain disorder, a progressive disease \"that causes unintended or uncontrollable movements, such as shaking, stiffness, and difficulty with balance and coordination,\" according to the National Institute on Aging.\n\nOver the years, Fox has sustained multiple broken bones, including both arms, his shoulder, his orbital bone and cheek and his hand, which resulted in a serious infection.\n\nFox combats his symptoms, such as paralysis of his facial muscles, through medication and trains to preserve his ambulatory skills.\n\n\"One day I’ll run out of gas,\" Fox told Town & Country magazine in 2023. \"One day I’ll just say, 'It’s not going to happen. I’m not going out today.' If that comes, I’ll allow myself that.\n\n\"Certainly, if I were to pass away tomorrow, it would be premature, but it wouldn’t be unheard of. And so, no, I don’t fear that.\"",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/entertainment/movies/2025/06/05/back-to-the-future-guitar-search/84028520007/",
    "https://www.michaeljfox.org/",
    "https://www.usatoday.com/news/politics/joe-biden/",
    "https://www.usatoday.com/story/entertainment/celebrities/2023/11/03/michael-j-fox-parkinsons-broken-bones/71441558007/",
    "https://www.usatoday.com/picture-gallery/life/people/2019/04/04/selma-blair-sarah-hyland-and-more-stars-vocal-health-struggles/3364175002/",
    "https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2025/01/04/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-3/",
    "https://puzzles.usatoday.com/",
    "https://www.boxofficemojo.com/release/rl2974385665/",
    "https://www.nia.nih.gov/health/parkinsons-disease#causes",
    "https://www.southamptonplayhouse.com/movie/back-to-the-future/",
    "https://www.usatoday.com/story/entertainment/celebrities/2024/06/30/michael-j-fox-performs-glastonbury-coldplay-chris-martin/74260789007/",
    "https://www.loc.gov/programs/national-film-preservation-board/film-registry/complete-national-film-registry-listing/",
    "https://www.townandcountrymag.com/society/money-and-power/a45549670/michael-j-fox-philanthropy-parkinsons-foundation-interview/",
    "https://www.instagram.com/p/DNRHMTKpnnk/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Michael J. Fox",
      "weight": 0.09187264
    },
    {
      "name": "Michael J. Fox Foundation",
      "weight": 0.08816867
    },
    {
      "name": "Fox",
      "weight": 0.084188126
    },
    {
      "name": "Parkinson",
      "weight": 0.06504257
    },
    {
      "name": "his Michael J. Fox Foundation",
      "weight": 0.056241732
    },
    {
      "name": "rare appearance",
      "weight": 0.055629108
    },
    {
      "name": "Hollywood",
      "weight": 0.055628166
    },
    {
      "name": "films",
      "weight": 0.055196937
    },
    {
      "name": "multiple broken bones",
      "weight": 0.05416703
    },
    {
      "name": "National Film Registry",
      "weight": 0.053597238
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9892578125
    },
    {
      "name": "/Arts & Entertainment/Movies/Movie Reference",
      "score": 0.77880859375
    },
    {
      "name": "/Arts & Entertainment/Movies/Other",
      "score": 0.6865234375
    },
    {
      "name": "/Arts & Entertainment/Entertainment Industry/Film & TV Industry",
      "score": 0.466796875
    },
    {
      "name": "/Arts & Entertainment/Movies/Drama Films",
      "score": 0.317138671875
    }
  ],
  "sentiment": {
    "positive": 0.45508978,
    "negative": 0.16873126,
    "neutral": 0.37617895
  },
  "summary": "Michael J. Fox, an Emmy-winning actor, attended a Southampton, New York, IMAX screening of \"Back to the Future\" 40 years ago. Afterwards, he had a conversation with Southampton Playhouse's artistic director, Eric Kohn, about his life and career, including his life with Parkinson's disease. The Oscar-winning film, which earned $224 million worldwide, was a Hollywood classic and was inducted into the Library of Congress' National Film Registry in 2007. Fox has continued to act in Hollywood while also advocating for and funding Parkinson's research through his foundation. In January, he received the Presidential Medal of Freedom for his advocacy of Parkinson's patients.",
  "shortSummary": "Michael J. Fox attended a rare event to celebrate \"Back to the Future\" 40th, discussing his career and Parkinson's disease, and his charity work.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e5ab74598d5f4a5f9689c0e05ff2a1ed",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2024/06/30/michael-j-fox-performs-glastonbury-coldplay-chris-martin/74260789007/",
      "text": "Michael J. Fox plays guitar with Coldplay at Glastonbury Festival: 'Mind blowing'\nThe crowd at Glastonbury wasn't ready for that yet, but their kids are gonna love it.\nMichael J. Fox, 63, joined Coldplay onstage to play guitar during the band's Glastonbury festival performance on Saturday.\nChris Martin took a moment to thank the \"Back to the Future\" star, who has Parkinson's disease and performed in a wheelchair.\n\"The main reason why we're in a band is because of watching 'Back to the Future,' so thank you to our hero forever, and one of the most amazing people on Earth, Mr. Michael J. Fox,\" Martin, 47, told the crowd. \"Thank you so much, Michael.\"\nJoin our Watch Party! Sign up to receive USA TODAY's movie and TV recommendations right in your inbox\nFox's character in \"Back to the Future,\" Marty McFly, famously plays guitar during a key scene at a school dance in 1955. Marty performs \"Johnny B. Goode\" years before the song's debut, inspiring Chuck Berry to record it, and stuns the crowd into silence with his forward-looking guitar solo.\n\"I guess you guys aren't ready for that yet,\" McFly tells the flabbergasted audience, \"but your kids are gonna love it.\"\nOn \"The Kelly Clarkson Show\" in 2022, Martin said this scene \"made me want to be in a band.\"\nAs Fox played the guitar at Glastonbury, Martin nodded to the movie's \"Johnny B. Goode\" scene by singing, \"Go, Johnny, go, go, go!\"\nThis isn't the first time Fox has performed with Coldplay. In 2016, he joined the band at a show in New Jersey to play \"Earth Angel\" and \"Johnny B. Goode,\" both songs from the \"Back to the Future\" school dance scene. Onstage, Martin described \"Back to the Future\" as his and his son Moses' \"favorite movie of all time.\"\n'You had to be talented': Michael J. Fox says actors in the '80s were 'tougher'\nIn last year's raw documentary \"Still: A Michael J. Fox Movie,\" Fox explored his career and battle with Parkinson's, which he was diagnosed with at age 29. He released a memoir, \"No Time Like the Future: An Optimist Considers Mortality,\" in 2020.\nIn February, Fox received a standing ovation at the British Academy Film Awards as he got up from his wheelchair and presented the best film award. Host David Tennant described the actor as a \"true legend of cinema.\"\n'Still' documentary: Michael J. Fox says sobriety after Parkinson’s diagnosis was 'a knife fight in a closet'\nMichael J. Fox raves about Coldplay performance at Glastonbury Festival\nThe day after his Glastonbury Festival appearance, Fox took to Instagram to reflect on his performance with Coldplay.\nThe actor shared photos from the music festival and thanked the band's team for taking \"such great care of us.\"\n\"In case you were wondering…it was f***king mind blowing,\" Fox wrote in the June 30 post. \"There is a time for every band and a band for every time. This is @coldplay’s time.\"\nTom Cruise spotted at Glastonbury with Simon Pegg after Taylor Swift Eras Tour show\nOther highlights from Glastonbury on Saturday include a Tom Cruise sighting.\nThe actor was spotted with his \"Mission: Impossible\" co-star Simon Pegg, who sang along to Oasis' \"Don't Look Back in Anger,\" according to videos shared on social media.\nThe appearance came a week after Cruise attended Taylor Swift's Eras Tour in London alongside other stars including Mila Kunis, Ashton Kutcher, Liam Hemsworth, Hugh Grant and Greta Gerwig.\nContributing: Edward Segarra, USA TODAY; Bryan West, USA TODAY Network"
    },
    {
      "url": "https://www.townandcountrymag.com/society/money-and-power/a45549670/michael-j-fox-philanthropy-parkinsons-foundation-interview/",
      "text": "A couple of years ago, Davis Guggenheim experienced a confounding emotion familiar to anyone who spends time with Michael J. Fox. The director was in Fox’s Central Park West apartment, midway through his first day of interviewing the now 62-year-old actor and philanthropist for the 2023 biographical documentary Still.\nFox, who was diagnosed with Parkinson’s disease in 1991, is not physically well, though he’s lucky to be alive, having survived 33 years with an incurable degenerative disease that kills most patients within 20 years of diagnosis. In order to speak clearly, Fox takes pills to combat paralysis of facial muscles. The more the disease advances, the more medicine it takes to animate the muscles, until the inevitable point when the side effects outweigh the benefits of the medication, or it stops working altogether. One of the worst side effects of Fox’s medication is dyskinesia—involuntary movements and tics. So, while the constant bobbing and careering may appear distressing for Fox, it is in fact the best version of himself available. He regularly acknowledges that he’s long into the journey he once referred to as the “gradual paring away of my physical self.” And yet, after listening to Fox explain his outlook on the world, Guggenheim had a realization that he had encountered a man who had achieved a spiritual state known to few. He felt the need to confess. “I want what you have,” Guggenheim told Fox.\nSoon the director called for a break. “I walked 30 blocks to my hotel,” Guggenheim recalls, “and the whole time I was like, ‘Why do I feel this way? He’s got this really tough diagnosis. I don’t. But he has something that I wish I had.’ ” Fox recalls his rejoinder. “I told him, ‘Be careful what you wish for.’ ” Still, Fox understands what Guggenheim was getting at. “It’s very complicated,” he says. “I’ve said Parkinson’s is a gift. It’s the gift that keeps on taking, but it has changed my life in so many positive ways.”\nFox used to be a well-liked and funny TV and film star, a master pratfaller and teller of witty stories on talk show couches—a virtuoso of a light art. In the last 20 years he has evolved into something deeper: a philosopher, an exemplar of courage, and the exceedingly rare figure in this polarized moment that a country can unite behind. In a recent CBC TV profile, the journalist Harry Forestell, who was himself diagnosed with Parkinson’s in 2015, characterized Fox’s example using words only a fellow Parkinson’s patient could, calling Fox’s public reckoning with the disease “both futile and deeply inspiring.” He is not only an inspiration to Parkinson’s patients through his public appearances and the candor of his four moving memoirs, he’s also the co-founder of the Michael J. Fox Foundation for Parkinson’s Research, which in its 23 years has funded nearly $2 billion in research. He inspires not only his fans but his intimates. “They describe some people when playing a great sport as poetry in motion,” says the novelist Harlan Coben, a close friend of more than a decade. “Mike’s bravery in motion.”\nFew would have predicted this trajectory. After winning a couple of acting credits as a kid, Fox dropped out of high school in Burnaby, British Columbia, at 17 and drove to Hollywood. There were a couple of lean years spent landlord-ducking and dumpster-diving before Fox landed Family Ties in 1982, which begat Back to the Future three years later. Untold fame and riches arrived overnight. During his go-go ’80s run, he was by his own admission a conspicuous consumer, a luxury automobile collector who recalls being able to light a cigarette in his Ferrari going 100 mph. “I’m sure that if you talked to him when he decided to drop out of high school, move to Hollywood, and become a movie star, that he had no intention of doing anything other than making money and being famous,” Guggenheim says. “He didn’t say, ‘I’m going to make money, be famous, and inspire people.’”\nParkinson’s didn’t change Fox overnight. When he was diagnosed at 29, a doctor told him he probably had a decade before the symptoms would end his career. And by that point, as Fox admits in his 2002 book Lucky Man, his movie career was foundering. The Back to the Future franchise was over, and he’d made a series of box office flops like Doc Hollywood and For Love or Money. The diagnosis sometimes felt like the karmic price for his success, “the bill being brought to a sloppy table after an ill-deserved and underappreciated banquet,” as he wrote.\nFox hid his Parkinson’s, collected checks for movies that felt beneath his talents, and hit the pillow hammered every night. Predictably, a breakdown followed. He went to his first AA meeting and got sober. He found a Jungian analyst named Joyce and confessed that he felt as if his life were “in flames.” Today he recalls the moment in the mid-’90s when he experienced an epiphany on Joyce’s couch. “My therapist said, ‘How are you feeling?’ ” he recalls. “I said, ‘I’m just waiting for the other shoe to drop.’ And she said, ‘Michael, you have Parkinson’s! The other shoe dropped a long time ago.’ ”\nDifficult days, Fox understood, lay ahead. There was no better option than to surrender to appreciating the gifts of the present day. His taxonomy of what mattered and what didn’t was turned on its head. Family landed on top. Fox and his wife, the actress Tracy Pollan, had been married only three years before his diagnosis. Divorce following a Parkinson’s diagnosis is common, yet Pollan stuck around.\n“Everybody says ‘in sickness and in health,’ but sometimes it’s not that easy,” says the couple’s friend Cam Neely, the former hockey star and longtime president of the Boston Bruins. “Everybody thinks about what Mike goes through, but one can only imagine what Tracy goes through. You can just tell how much she loves him, but one thing about Tracy, she’s a strong, tough woman, and doesn’t put up with any BS.” Fox had one request before he would allow Guggenheim to make a film about him. “No violins,” he said, meaning no treacly music scoring scenes of his physical struggles. And Fox offered only one note after screening a rough cut of Still: “More family.” Still’s most affecting scenes are those of Fox collapsing in joyful laughter when Pollan or one of his four kids ribs him.\nFox kept his Parkinson’s a secret until 1998, when he made an announcement to Barbara Walters and People. It was made under duress: The National Enquirer was close to breaking the story of the health issue that was affecting the schedule of Fox’s sitcom, Spin City. Despite the circumstances, the unburdening brought unexpected joy—and then an idea. “When I went public, I felt like I stood there naked in the town square and said, ‘Look at me. This is what it is,’ ” he says. “What I didn’t realize was how many other people had been dying to do that.”\nOvernight, various Parkinson’s foundations clamored to land Fox as their spokesman. “Early on someone from a foundation gave me their pitch as to why I should come on,” he says. Fox politely demurred, saying he appreciated the group’s efforts. “But then they said the most unusual thing,” he recalls. “They said, ‘But if you don’t help us, don’t help them,’ pointing to another foundation. I got so mad. I said, ‘I’ve got to get in here and get this straightened out.’”\nIn 2000 he founded the Michael J. Fox Foundation for Parkinson’s Research with the goal of funneling money to scientists with the best shot of finding a cure. The monumental ambition of the mission didn’t just occur to him. “It seemed straightforward to me,” he says. “I’m a short kid from Canada who at 17 moved to another country and somehow within five years was a millionaire. I’m of the mind that anything you want to do you can do.” He went on a listening tour of scientists, politicians, and patient advocates. His conclusion: Foundations were mostly covering the unmet needs of patients while also lobbying the government to fund research. But despite these efforts the government wasn’t coughing up enough money to make sufficient advances. “The science was ahead of the money,” he says. “We just have to throw the money at the right people.”\nTo find a CEO for his foundation, Fox met with candidate after highly qualified candidate from the nonprofit world, but he decided he wanted something different, someone who could innovate like a startup founder. After spending nine years making other people money at Goldman Sachs, Deborah Brooks was looking to do some good. “I thought, Wouldn’t it be amazing if nonprofits were more efficient, if they were bolder?” Brooks tells me. Fox hired her after one meeting; she’s both co-founder and CEO.\nThe pair agreed on a revolutionary fiscal philosophy. While many foundations rely on an endowment model, amassing a nest egg designed to assure long-term survival by parceling out small percentages to recipients, Fox’s foundation would attempt to go broke annually. “The goal is to go out of business,” Fox has said. In 2020 the foundation brought in $199 million in private donations and the next year funded $233 million in grants. According to Brooks, after spending nearly $2 billion on research, the foundation in 2022 had allocated more on Parkinson’s research than the U.S. government—and it seems to be paying off. In April, Lancet Neurology published the results of a decadelong Fox foundation–led study demonstrating that Parkinson’s can now be detected in living people by locating a particular biomarker protein, abnormal alpha-synuclein, a discovery that has the potential to lead to a treatment that can delay, or even eliminate altogether, the onset of symptoms. “When I was diagnosed, it was like a drunk driving test,” Fox says. “Now we can say, ‘You have this protein, and we know that you have Parkinson’s.’ It opens the gates for pharmaceutical companies to come in and say, ‘We’ve got a target and we’re going to dump money into it,’ and when they dump money into it, good things happen.”\nFor many years the ability to turn lemons into lemonade was Fox’s brand. His 2009 memoir, Always Looking Up, was subtitled The Adventures of an Incurable Optimist. In 2018, when a spinal tumor unrelated to his Parkinson’s threatened to paralyze him, he opted for surgery that required months of physical therapy to get him walking again. Freshly rehabilitated and finally on two feet, on a rare night alone in his apartment he tripped and did a header in the kitchen, breaking his upper arm. Fox recalls the words that he uttered while splayed on his floor: “I said, ‘Fuck lemonade. I’m out of the lemonade business.’ ” He chronicled his medical misadventures and attendant depression two years later in his book No Time Like the Future. “That was nothing,” he says now. He has since broken his other arm and shoulder, smashed his orbital bone and cheek, and broken his hand. “My hand got infected and then I almost lost it,” he says. “It was a tsunami of misfortune.”\nBut Fox is smiling. There’s no self-pity in the litany, more pride in showing off battle scars. He often refers to himself as a “tough son of a bitch,” a trait reflected by his daily training to remain ambulatory, despite the damage he faces from his now daily falls. I ask if anything scares him, and he thinks for a moment. “Anything that would put my family in jeopardy,” he says. He has nightmares about falling into Tracy or one of the kids on the street, and them getting hit by a bus. But fear for himself, the future, the ultimate other shoe dropping? Not so much.\n“One day I’ll run out of gas,” he says. “One day I’ll just say, ‘It’s not going to happen. I’m not going out today.’ If that comes, I’ll allow myself that. I’m 62 years old. Certainly, if I were to pass away tomorrow, it would be premature, but it wouldn’t be unheard of. And so, no, I don’t fear that.”\nPhotography by Sebastian Kim. Styled By Britt McCamey. Grooming by Kristan Serafino at Walter Schupfer Management. Shot at Corner Studio NYC. Production by Area1202. Table by Kristina Dam\nIn the photograph at the top of this story: Brioni sweater; Breguet watch ($18,000)\nThis story appears in the November 2023 issue of Town & Country.\nSUBSCRIBE NOW"
    },
    {
      "url": "https://www.boxofficemojo.com/release/rl2974385665/",
      "text": "Back to the Future\nMarty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.\nSee full company information\n1,420 theaters\n| Date | DOW | Rank | Daily | %± YD | %± LW | Theaters | Avg | To Date | Day |\n|---|---|---|---|---|---|---|---|---|---|\n| Jul 3 | Wednesday | 1 | $1,729,890 | - | - | 1,341 | $1,290 | $1,729,890 | 1 |\n| Jul 4 Independence Day | Thursday | 1 | $1,862,649 | +7.7% | - | 1,341 | $1,389 | $3,592,539 | 2 |\n| Jul 5 | Friday | 1 | $3,660,760 | +96.5% | - | 1,420 | $2,578 | $7,253,299 | 3 |\n| Jul 6 | Saturday | 1 | $4,285,380 | +17.1% | - | 1,419 | $3,020 | $11,538,679 | 4 |\n| Jul 7 | Sunday | 1 | $3,206,360 | -25.2% | - | 1,420 | $2,258 | $14,745,039 | 5 |\n| Jul 8 | Monday | 1 | $1,789,200 | -44.2% | - | 1,420 | $1,260 | $16,534,239 | 6 |\n| Jul 9 | Tuesday | 1 | $1,942,611 | +8.6% | - | 1,419 | $1,369 | $18,476,850 | 7 |\n| Jul 10 | Wednesday | 1 | $1,817,600 | -6.4% | +5.1% | 1,420 | $1,280 | $20,294,450 | 8 |\n| Jul 11 | Thursday | 1 | $1,731,180 | -4.8% | -7.1% | 1,419 | $1,220 | $22,025,630 | 9 |\n| Jul 12 | Friday | 1 | $3,124,799 | +80.5% | -14.6% | 1,435 | $2,177 | $25,150,429 | 10 |\n| Jul 13 | Saturday | 1 | $3,854,477 | +23.4% | -10.1% | 1,435 | $2,686 | $29,004,906 | 11 |\n| Jul 14 | Sunday | 1 | $3,575,857 | -7.2% | +11.5% | 1,435 | $2,491 | $32,580,763 | 12 |\n| Jul 15 | Monday | 1 | $1,915,725 | -46.4% | +7.1% | 1,435 | $1,335 | $34,496,488 | 13 |\n| Jul 16 | Tuesday | 1 | $1,935,900 | +1.1% | -0.3% | 1,434 | $1,350 | $36,432,388 | 14 |\n| Jul 17 | Wednesday | 1 | $1,763,820 | -8.9% | -3% | 1,434 | $1,230 | $38,196,208 | 15 |\n| Jul 18 | Thursday | 1 | $1,720,800 | -2.4% | -0.6% | 1,434 | $1,200 | $39,917,008 | 16 |\n| Jul 19 | Friday | 1 | $3,027,485 | +75.9% | -3.1% | 1,433 | $2,112 | $42,944,493 | 17 |\n| Jul 20 | Saturday | 1 | $4,081,080 | +34.8% | +5.9% | 1,437 | $2,840 | $47,025,573 | 18 |\n| Jul 21 | Sunday | 1 | $3,206,740 | -21.4% | -10.3% | 1,438 | $2,230 | $50,232,313 | 19 |\n| Jul 22 | Monday | 1 | $1,689,650 | -47.3% | -11.8% | 1,438 | $1,175 | $51,921,963 | 20 |\n| Jul 23 | Tuesday | 1 | $1,817,805 | +7.6% | -6.1% | 1,437 | $1,265 | $53,739,768 | 21 |\n| Jul 24 | Wednesday | 1 | $1,708,840 | -6% | -3.1% | 1,436 | $1,190 | $55,448,608 | 22 |\n| Jul 25 | Thursday | 1 | $1,724,400 | +0.9% | +0.2% | 1,437 | $1,200 | $57,173,008 | 23 |\n| Jul 26 | Friday | 1 | $3,085,905 | +79% | +1.9% | 1,509 | $2,045 | $60,258,913 | 24 |\n| Jul 27 | Saturday | 1 | $3,714,755 | +20.4% | -9% | 1,507 | $2,465 | $63,973,668 | 25 |\n| Jul 28 | Sunday | 1 | $2,665,620 | -28.2% | -16.9% | 1,506 | $1,770 | $66,639,288 | 26 |\n| Jul 29 | Monday | 1 | $1,559,745 | -41.5% | -7.7% | 1,507 | $1,035 | $68,199,033 | 27 |\n| Jul 30 | Tuesday | 1 | $1,695,375 | +8.7% | -6.7% | 1,507 | $1,125 | $69,894,408 | 28 |\n| Jul 31 | Wednesday | 1 | $1,760,560 | +3.8% | +3% | 1,492 | $1,180 | $71,654,968 | 29 |\n| Aug 1 | Thursday | 1 | $1,506,920 | -14.4% | -12.6% | 1,492 | $1,010 | $73,161,888 | 30 |\n| Aug 2 | Friday | 1 | $2,449,440 | +62.5% | -20.6% | 1,512 | $1,620 | $75,611,328 | 31 |\n| Aug 3 | Saturday | 1 | $3,342,912 | +36.5% | -10% | 1,514 | $2,208 | $78,954,240 | 32 |\n| Aug 4 | Sunday | 1 | $2,636,100 | -21.1% | -1.1% | 1,515 | $1,740 | $81,590,340 | 33 |\n| Aug 5 | Monday | 1 | $1,467,610 | -44.3% | -5.9% | 1,513 | $970 | $83,057,950 | 34 |\n| Aug 6 | Tuesday | 1 | $1,497,870 | +2.1% | -11.6% | 1,513 | $990 | $84,555,820 | 35 |\n| Aug 7 | Wednesday | 1 | $1,493,000 | -0.3% | -15.2% | 1,496 | $997 | $86,048,820 | 36 |\n| Aug 8 | Thursday | 1 | $1,503,480 | +0.7% | -0.2% | 1,496 | $1,005 | $87,552,300 | 37 |\n| Aug 9 | Friday | 1 | $2,319,465 | +54.3% | -5.3% | 1,531 | $1,515 | $89,871,765 | 38 |\n| Aug 10 | Saturday | 1 | $3,261,030 | +40.6% | -2.4% | 1,531 | $2,130 | $93,132,795 | 39 |\n| Aug 11 | Sunday | 1 | $2,493,900 | -23.5% | -5.4% | 1,530 | $1,630 | $95,626,695 | 40 |\n| Aug 12 | Monday | 1 | $1,275,880 | -48.8% | -13.1% | 1,528 | $835 | $96,902,575 | 41 |\n| Aug 13 | Tuesday | 1 | $1,390,480 | +9% | -7.2% | 1,528 | $910 | $98,293,055 | 42 |\n| Aug 14 | Wednesday | 1 | $1,324,140 | -4.8% | -11.3% | 1,522 | $870 | $99,617,195 | 43 |\n| Aug 15 | Thursday | 1 | $1,369,800 | +3.4% | -8.9% | 1,522 | $900 | $100,986,995 | 44 |\n| Aug 16 | Friday | 1 | $2,096,220 | +53% | -9.6% | 1,519 | $1,380 | $103,083,215 | 45 |\n| Aug 17 | Saturday | 1 | $2,926,000 | +39.6% | -10.3% | 1,520 | $1,925 | $106,009,215 | 46 |\n| Aug 18 | Sunday | 1 | $2,229,920 | -23.8% | -10.6% | 1,517 | $1,469 | $108,239,135 | 47 |\n| Aug 19 | Monday | 1 | $1,174,125 | -47.3% | -8% | 1,515 | $775 | $109,413,260 | 48 |\n| Aug 20 | Tuesday | 1 | $1,280,175 | +9% | -7.9% | 1,515 | $845 | $110,693,435 | 49 |\n| Aug 21 | Wednesday | 1 | $1,195,270 | -6.6% | -9.7% | 1,513 | $790 | $111,888,705 | 50 |\n| Aug 22 | Thursday | 1 | $1,089,360 | -8.9% | -20.5% | 1,513 | $720 | $112,978,065 | 51 |\n| Aug 23 | Friday | 1 | $1,843,200 | +69.2% | -12.1% | 1,536 | $1,200 | $114,821,265 | 52 |\n| Aug 24 | Saturday | 1 | $2,826,240 | +53.3% | -3.4% | 1,536 | $1,840 | $117,647,505 | 53 |\n| Aug 25 | Sunday | 1 | $2,257,920 | -20.1% | +1.3% | 1,536 | $1,470 | $119,905,425 | 54 |\n| Aug 26 | Monday | 1 | $941,565 | -58.3% | -19.8% | 1,531 | $615 | $120,846,990 | 55 |\n| Aug 27 | Tuesday | 1 | $982,400 | +4.3% | -23.3% | 1,535 | $640 | $121,829,390 | 56 |\n| Aug 28 | Wednesday | 1 | $896,220 | -8.8% | -25% | 1,532 | $585 | $122,725,610 | 57 |\n| Aug 29 | Thursday | 1 | $889,140 | -0.8% | -18.4% | 1,533 | $580 | $123,614,750 | 58 |\n| Aug 30 | Friday | 1 | $1,784,429 | +100.7% | -3.2% | 1,550 | $1,151 | $125,399,179 | 59 |\n| Aug 31 | Saturday | 1 | $2,765,127 | +55% | -2.2% | 1,550 | $1,783 | $128,164,306 | 60 |\n| Sep 1 | Sunday | 1 | $2,599,789 | -6% | +15.1% | 1,550 | $1,677 | $130,764,095 | 61 |\n| Sep 2 Labor Day | Monday | 1 | $1,900,323 | -26.9% | +101.8% | 1,550 | $1,226 | $132,664,418 | 62 |\n| Sep 3 | Tuesday | 1 | $569,060 | -70.1% | -42.1% | 1,538 | $370 | $133,233,478 | 63 |\n| Sep 4 | Wednesday | 1 | $483,525 | -15% | -46% | 1,535 | $315 | $133,717,003 | 64 |\n| Sep 5 | Thursday | 1 | $460,800 | -4.7% | -48.2% | 1,536 | $300 | $134,177,803 | 65 |\n| Sep 6 | Friday | 1 | $1,444,867 | +213.6% | -19% | 1,519 | $951 | $135,622,670 | 66 |\n| Sep 7 | Saturday | 1 | $2,448,982 | +69.5% | -11.4% | 1,519 | $1,612 | $138,071,652 | 67 |\n| Sep 8 | Sunday | 1 | $1,320,816 | -46.1% | -49.2% | 1,519 | $869 | $139,392,468 | 68 |\n| Sep 9 | Monday | 1 | $322,500 | -75.6% | -83% | 1,500 | $215 | $139,714,968 | 69 |\n| Sep 10 | Tuesday | 1 | $397,235 | +23.2% | -30.2% | 1,499 | $265 | $140,112,203 | 70 |\n| Sep 11 | Wednesday | 1 | $352,030 | -11.4% | -27.2% | 1,498 | $235 | $140,464,233 | 71 |\n| Sep 12 | Thursday | 1 | $330,660 | -6.1% | -28.2% | 1,503 | $220 | $140,794,893 | 72 |\n| Sep 13 | Friday | 1 | $1,137,992 | +244.2% | -21.2% | 1,472 | $773 | $141,932,885 | 73 |\n| Sep 14 | Saturday | 1 | $2,019,132 | +77.4% | -17.6% | 1,472 | $1,371 | $143,952,017 | 74 |\n| Sep 15 | Sunday | 1 | $977,133 | -51.6% | -26% | 1,472 | $663 | $144,929,150 | 75 |\n| Sep 16 | Monday | 1 | $327,375 | -66.5% | +1.5% | 1,455 | $225 | $145,256,525 | 76 |\n| Sep 17 | Tuesday | 1 | $370,260 | +13.1% | -6.8% | 1,452 | $255 | $145,626,785 | 77 |\n| Sep 18 | Wednesday | 1 | $290,200 | -21.6% | -17.6% | 1,451 | $200 | $145,916,985 | 78 |\n| Sep 19 | Thursday | 1 | $269,730 | -7.1% | -18.4% | 1,458 | $185 | $146,186,715 | 79 |\n| Sep 20 | Friday | 1 | $1,014,308 | +276% | -10.9% | 1,448 | $700 | $147,201,023 | 80 |\n| Sep 21 | Saturday | 1 | $1,908,639 | +88.2% | -5.5% | 1,448 | $1,318 | $149,109,662 | 81 |\n| Sep 22 | Sunday | 1 | $1,001,203 | -47.5% | +2.5% | 1,448 | $691 | $150,110,865 | 82 |\n| Sep 23 | Monday | 1 | $221,495 | -77.9% | -32.3% | 1,429 | $155 | $150,332,360 | 83 |\n| Sep 24 | Tuesday | 1 | $321,525 | +45.2% | -13.2% | 1,429 | $225 | $150,653,885 | 84 |\n| Sep 25 | Wednesday | 1 | $283,600 | -11.8% | -2.3% | 1,418 | $200 | $150,937,485 | 85 |\n| Sep 26 | Thursday | 1 | $250,075 | -11.8% | -7.3% | 1,429 | $175 | $151,187,560 | 86 |\n| Sep 27 | Friday | 1 | $992,910 | +297% | -2.1% | 1,439 | $690 | $152,180,470 | 87 |\n| Sep 28 | Saturday | 1 | $2,014,600 | +102.9% | +5.6% | 1,439 | $1,400 | $154,195,070 | 88 |\n| Sep 29 | Sunday | 1 | $964,130 | -52.1% | -3.7% | 1,439 | $670 | $155,159,200 | 89 |\n| Sep 30 | Monday | 1 | $239,530 | -75.2% | +8.1% | 1,409 | $170 | $155,398,730 | 90 |\n| Oct 1 | Tuesday | 1 | $260,665 | +8.8% | -18.9% | 1,409 | $185 | $155,659,395 | 91 |\n| Oct 2 | Wednesday | 1 | $245,700 | -5.7% | -13.4% | 1,404 | $175 | $155,905,095 | 92 |\n| Oct 3 | Thursday | 1 | $239,020 | -2.7% | -4.4% | 1,406 | $170 | $156,144,115 | 93 |\n| Oct 4 | Friday | 1 | $872,754 | +265.1% | -12.1% | 1,350 | $646 | $157,016,869 | 94 |\n| Oct 5 | Saturday | 1 | $1,749,992 | +100.5% | -13.1% | 1,350 | $1,296 | $158,766,861 | 95 |\n| Oct 6 | Sunday | 1 | $759,912 | -56.6% | -21.2% | 1,350 | $562 | $159,526,773 | 96 |\n| Oct 7 | Monday | 1 | $170,820 | -77.5% | -28.7% | 1,314 | $130 | $159,697,593 | 97 |\n| Oct 8 | Tuesday | 1 | $210,400 | +23.2% | -19.3% | 1,315 | $160 | $159,907,993 | 98 |\n| Oct 9 | Wednesday | 1 | $198,450 | -5.7% | -19.2% | 1,323 | $150 | $160,106,443 | 99 |\n| Oct 10 | Thursday | 1 | $213,440 | +7.6% | -10.7% | 1,334 | $160 | $160,319,883 | 100 |\n| Oct 11 | Friday | 1 | $723,138 | +238.8% | -17.1% | 1,270 | $569 | $161,043,021 | 101 |\n| Oct 12 | Saturday | 1 | $1,397,434 | +93.2% | -20.1% | 1,272 | $1,098 | $162,440,455 | 102 |\n| Oct 13 | Sunday | 1 | $858,847 | -38.5% | +13% | 1,264 | $679 | $163,299,302 | 103 |\n| Oct 14 Indig. Peoples' Day | Monday | 1 | $308,619 | -64.1% | +80.7% | 1,242 | $248 | $163,607,921 | 104 |\n| Oct 15 | Tuesday | 1 | $179,945 | -41.7% | -14.5% | 1,241 | $145 | $163,787,866 | 105 |\n| Oct 16 | Wednesday | 1 | $160,420 | -10.9% | -19.2% | 1,234 | $130 | $163,948,286 | 106 |\n| Oct 17 | Thursday | 1 | $179,510 | +11.9% | -15.9% | 1,238 | $145 | $164,127,796 | 107 |\n| Oct 18 | Friday | 1 | $717,090 | +299.5% | -0.8% | 1,289 | $556 | $164,844,886 | 108 |\n| Oct 19 | Saturday | 1 | $1,434,440 | +100% | +2.6% | 1,284 | $1,117 | $166,279,326 | 109 |\n| Oct 20 | Sunday | 1 | $729,590 | -49.1% | -15.1% | 1,278 | $570 | $167,008,916 | 110 |\n| Oct 21 | Monday | 1 | $158,125 | -78.3% | -48.8% | 1,265 | $125 | $167,167,041 | 111 |\n| Oct 22 | Tuesday | 1 | $189,750 | +20% | +5.4% | 1,265 | $150 | $167,356,791 | 112 |\n| Oct 23 | Wednesday | 1 | $170,505 | -10.1% | +6.3% | 1,263 | $135 | $167,527,296 | 113 |\n| Oct 24 | Thursday | 1 | $165,230 | -3.1% | -8% | 1,271 | $130 | $167,692,526 | 114 |\n| Oct 25 | Friday | 1 | $623,724 | +277.5% | -13% | 1,284 | $485 | $168,316,250 | 115 |\n| Oct 26 | Saturday | 1 | $1,085,574 | +74% | -24.3% | 1,284 | $845 | $169,401,824 | 116 |\n| Oct 27 | Sunday | 1 | $535,013 | -50.7% | -26.7% | 1,284 | $416 | $169,936,837 | 117 |\n| Oct 28 | Monday | 1 | $144,785 | -72.9% | -8.4% | 1,259 | $115 | $170,081,622 | 118 |\n| Oct 29 | Tuesday | 1 | $176,680 | +22% | -6.9% | 1,262 | $140 | $170,258,302 | 119 |\n| Oct 30 | Wednesday | 1 | $144,555 | -18.2% | -15.2% | 1,257 | $115 | $170,402,857 | 120 |\n| Oct 31 Halloween | Thursday | 1 | $157,750 | +9.1% | -4.5% | 1,262 | $125 | $170,560,607 | 121 |\n| Nov 1 | Friday | 1 | $556,116 | +252.5% | -10.8% | 1,149 | $484 | $171,116,723 | 122 |\n| Nov 2 | Saturday | 1 | $1,215,990 | +118.7% | +12% | 1,145 | $1,062 | $172,332,713 | 123 |\n| Nov 3 | Sunday | 1 | $588,130 | -51.6% | +9.9% | 1,142 | $515 | $172,920,843 | 124 |\n| Nov 4 | Monday | 1 | $130,410 | -77.8% | -9.9% | 1,134 | $115 | $173,051,253 | 125 |\n| Nov 5 | Tuesday | 1 | $181,280 | +39% | +2.6% | 1,133 | $160 | $173,232,533 | 126 |\n| Nov 6 | Wednesday | 1 | $140,500 | -22.5% | -2.8% | 1,124 | $125 | $173,373,033 | 127 |\n| Nov 7 | Thursday | 1 | $145,340 | +3.4% | -7.9% | 1,118 | $130 | $173,518,373 | 128 |\n| Nov 8 | Friday | 1 | $568,700 | +291.3% | +2.3% | 1,034 | $550 | $174,087,073 | 129 |\n| Nov 9 | Saturday | 1 | $996,480 | +75.2% | -18.1% | 1,038 | $960 | $175,083,553 | 130 |\n| Nov 10 | Sunday | 1 | $658,350 | -33.9% | +11.9% | 1,045 | $630 | $175,741,903 | 131 |\n| Nov 11 | Monday | 1 | $302,670 | -54% | +132.1% | 1,026 | $295 | $176,044,573 | 132 |\n| Nov 12 | Tuesday | 1 | $143,360 | -52.6% | -20.9% | 1,024 | $140 | $176,187,933 | 133 |\n| Nov 13 | Wednesday | 1 | $117,415 | -18.1% | -16.4% | 1,021 | $115 | $176,305,348 | 134 |\n| Nov 14 | Thursday | 1 | $123,360 | +5.1% | -15.1% | 1,028 | $120 | $176,428,708 | 135 |\n| Nov 15 | Friday | 1 | $509,236 | +312.8% | -10.5% | 1,048 | $485 | $176,937,944 | 136 |\n| Nov 16 | Saturday | 1 | $977,783 | +92% | -1.9% | 1,048 | $932 | $177,915,727 | 137 |\n| Nov 17 | Sunday | 1 | $460,642 | -52.9% | -30% | 1,048 | $439 | $178,376,369 | 138 |\n| Nov 18 | Monday | 1 | $95,135 | -79.3% | -68.6% | 1,033 | $92 | $178,471,504 | 139 |\n| Nov 19 | Tuesday | 1 | $139,185 | +46.3% | -2.9% | 1,031 | $135 | $178,610,689 | 140 |\n| Nov 20 | Wednesday | 1 | $111,024 | -20.2% | -5.4% | 1,028 | $108 | $178,721,713 | 141 |\n| Nov 21 | Thursday | 1 | $108,465 | -2.3% | -12.1% | 1,033 | $105 | $178,830,178 | 142 |\n| Nov 22 | Friday | 1 | $440,995 | +306.6% | -13.4% | 1,027 | $429 | $179,271,173 | 143 |\n| Nov 23 | Saturday | 1 | $838,032 | +90% | -14.3% | 1,027 | $816 | $180,109,205 | 144 |\n| Nov 24 | Sunday | 1 | $415,042 | -50.5% | -9.9% | 1,027 | $404 | $180,524,247 | 145 |\n| Nov 25 | Monday | 1 | $101,800 | -75.5% | +7% | 1,018 | $100 | $180,626,047 | 146 |\n| Nov 26 | Tuesday | 1 | $142,100 | +39.6% | +2.1% | 1,015 | $140 | $180,768,147 | 147 |\n| Nov 27 | Wednesday | 1 | $280,800 | +97.6% | +152.9% | 1,080 | $260 | $181,048,947 | 148 |\n| Nov 28 Thanksgiving | Thursday | 1 | $405,000 | +44.2% | +273.4% | 1,125 | $360 | $181,453,947 | 149 |\n| Nov 29 | Friday | 1 | $808,962 | +99.7% | +83.4% | 1,133 | $714 | $182,262,909 | 150 |\n| Nov 30 | Saturday | 1 | $933,832 | +15.4% | +11.4% | 1,128 | $827 | $183,196,741 | 151 |\n| Dec 1 | Sunday | 1 | $380,120 | -59.3% | -8.4% | 1,118 | $340 | $183,576,861 | 152 |\n| Dec 2 | Monday | 1 | $70,980 | -81.3% | -30.3% | 1,092 | $65 | $183,647,841 | 153 |\n| Dec 3 | Tuesday | 1 | $108,200 | +52.4% | -23.9% | 1,077 | $100 | $183,756,041 | 154 |\n| Dec 4 | Wednesday | 1 | $86,785 | -19.8% | -69.1% | 1,021 | $85 | $183,842,826 | 155 |\n| Dec 5 | Thursday | 1 | $76,650 | -11.7% | -81.1% | 1,022 | $75 | $183,919,476 | 156 |\n| Dec 6 | Friday | 1 | $252,571 | +229.5% | -68.8% | 898 | $281 | $184,172,047 | 157 |\n| Dec 7 | Saturday | 1 | $467,373 | +85% | -50% | 898 | $520 | $184,639,420 | 158 |\n| Dec 8 | Sunday | 1 | $265,524 | -43.2% | -30.1% | 898 | $295 | $184,904,944 | 159 |\n| Dec 9 | Monday | 1 | $53,100 | -80% | -25.2% | 885 | $60 | $184,958,044 | 160 |\n| Dec 10 | Tuesday | 1 | $70,080 | +32% | -35.2% | 876 | $80 | $185,028,124 | 161 |\n| Dec 11 | Wednesday | 1 | $60,075 | -14.3% | -30.8% | 801 | $75 | $185,088,199 | 162 |\n| Dec 12 | Thursday | 1 | $55,860 | -7% | -27.1% | 798 | $70 | $185,144,059 | 163 |\n| Dec 13 | Friday | 1 | $175,291 | +213.8% | -30.6% | 724 | $242 | $185,319,350 | 164 |\n| Dec 14 | Saturday | 1 | $317,651 | +81.2% | -32% | 716 | $443 | $185,637,001 | 165 |\n| Dec 15 | Sunday | 1 | $207,290 | -34.7% | -21.9% | 714 | $290 | $185,844,291 | 166 |\n| Dec 16 | Monday | 1 | $46,150 | -77.7% | -13.1% | 710 | $65 | $185,890,441 | 167 |\n| Dec 17 | Tuesday | 1 | $60,095 | +30.2% | -14.2% | 707 | $85 | $185,950,536 | 168 |\n| Dec 18 | Wednesday | 1 | $63,720 | +6% | +6.1% | 708 | $90 | $186,014,256 | 169 |\n| Dec 19 | Thursday | 1 | $60,775 | -4.6% | +8.8% | 715 | $85 | $186,075,031 | 170 |\n| Dec 20 | Friday | 1 | $197,715 | +225.3% | +12.8% | 807 | $245 | $186,272,746 | 171 |\n| Dec 21 | Saturday | 1 | $363,150 | +83.7% | +14.3% | 807 | $450 | $186,635,896 | 172 |\n| Dec 22 | Sunday | 1 | $344,589 | -5.1% | +66.2% | 807 | $427 | $186,980,485 | 173 |\n| Dec 23 | Monday | 1 | $202,725 | -41.2% | +339.3% | 795 | $255 | $187,183,210 | 174 |\n| Dec 24 | Tuesday | 1 | $104,676 | -48.4% | +74.2% | 793 | $132 | $187,287,886 | 175 |\n| Dec 25 Christmas Day | Wednesday | 1 | $229,593 | +119.3% | +260.3% | 841 | $273 | $187,517,479 | 176 |\n| Dec 26 | Thursday | 1 | $369,750 | +61% | +508.4% | 870 | $425 | $187,887,229 | 177 |\n| Dec 27 | Friday | 1 | $548,208 | +48.3% | +177.3% | 911 | $601 | $188,435,437 | 178 |\n| Dec 28 | Saturday | 1 | $681,606 | +24.3% | +87.7% | 911 | $748 | $189,117,043 | 179 |\n| Dec 29 | Sunday | 1 | $630,034 | -7.6% | +82.8% | 911 | $691 | $189,747,077 | 180 |\n| Dec 30 | Monday | 1 | $432,974 | -31.3% | +113.6% | 875 | $494 | $190,180,051 | 181 |\n| Dec 31 New Year's Eve | Tuesday | 1 | $401,356 | -7.3% | +283.4% | 864 | $464 | $190,581,407 | 182 |\n| Jan 1 New Year's Day | Wednesday | 1 | $560,860 | +39.7% | +144.3% | 864 | $649 | $191,142,267 | 183 |\n| Jan 2 | Thursday | 1 | $328,000 | -41.5% | -11.3% | 801 | $409 | $191,470,267 | 184 |\n| Jan 3 | Friday | 1 | $466,922 | +42.4% | -14.8% | 722 | $646 | $191,937,189 | 185 |\n| Jan 4 | Saturday | 1 | $661,607 | +41.7% | -2.9% | 722 | $916 | $192,598,796 | 186 |\n| Jan 5 | Sunday | 1 | $358,985 | -45.7% | -43% | 722 | $497 | $192,957,781 | 187 |\n| Jan 6 | Monday | 1 | $114,235 | -68.2% | -73.6% | 737 | $155 | $193,072,016 | 188 |\n| Jan 7 | Tuesday | 1 | $117,920 | +3.2% | -70.6% | 737 | $160 | $193,189,936 | 189 |\n| Jan 8 | Wednesday | 1 | $110,550 | -6.2% | -80.3% | 737 | $150 | $193,300,486 | 190 |\n| Jan 9 | Thursday | 1 | $106,720 | -3.5% | -67.5% | 736 | $145 | $193,407,206 | 191 |\n| Jan 10 | Friday | 1 | $330,147 | +209.4% | -29.3% | 691 | $477 | $193,737,353 | 192 |\n| Jan 11 | Saturday | 1 | $624,799 | +89.2% | -5.6% | 691 | $904 | $194,362,152 | 193 |\n| Jan 12 | Sunday | 1 | $295,849 | -52.6% | -17.6% | 691 | $428 | $194,658,001 | 194 |\n| Jan 13 | Monday | 1 | $84,125 | -71.6% | -26.4% | 673 | $125 | $194,742,126 | 195 |\n| Jan 14 | Tuesday | 1 | $94,220 | +12% | -20.1% | 673 | $140 | $194,836,346 | 196 |\n| Jan 15 | Wednesday | 1 | $87,490 | -7.1% | -20.9% | 673 | $130 | $194,923,836 | 197 |\n| Jan 16 | Thursday | 1 | $92,340 | +5.5% | -13.5% | 684 | $135 | $195,016,176 | 198 |\n| Jan 17 | Friday | 1 | $287,100 | +210.9% | -13% | 580 | $495 | $195,303,276 | 199 |\n| Jan 18 | Saturday | 1 | $553,900 | +92.9% | -11.3% | 580 | $955 | $195,857,176 | 200 |\n| Jan 19 | Sunday | 1 | $446,600 | -19.4% | +51% | 580 | $770 | $196,303,776 | 201 |\n| Jan 20 MLK Day | Monday | 1 | $168,000 | -62.4% | +99.7% | 560 | $300 | $196,471,776 | 202 |\n| Jan 21 | Tuesday | 1 | $94,860 | -43.5% | +0.7% | 558 | $170 | $196,566,636 | 203 |\n| Jan 22 | Wednesday | 1 | $74,790 | -21.2% | -14.5% | 554 | $135 | $196,641,426 | 204 |\n| Jan 23 | Thursday | 1 | $69,625 | -6.9% | -24.6% | 557 | $125 | $196,711,051 | 205 |\n| Jan 24 | Friday | 1 | $253,777 | +264.5% | -11.6% | 601 | $422 | $196,964,828 | 206 |\n| Jan 25 | Saturday | 1 | $459,531 | +81.1% | -17% | 601 | $764 | $197,424,359 | 207 |\n| Jan 26 | Sunday | 1 | $171,886 | -62.6% | -61.5% | 601 | $286 | $197,596,245 | 208 |\n| Jan 27 | Monday | 1 | $40,950 | -76.2% | -75.6% | 585 | $70 | $197,637,195 | 209 |\n| Jan 28 | Tuesday | 1 | $78,435 | +91.5% | -17.3% | 581 | $135 | $197,715,630 | 210 |\n| Jan 29 | Wednesday | 1 | $58,300 | -25.7% | -22% | 583 | $100 | $197,773,930 | 211 |\n| Jan 30 | Thursday | 1 | $58,100 | -0.3% | -16.6% | 581 | $100 | $197,832,030 | 212 |\n| Jan 31 | Friday | 1 | $155,400 | +167.5% | -38.8% | 444 | $350 | $197,987,430 | 213 |\n| Feb 1 | Saturday | 1 | $288,600 | +85.7% | -37.2% | 444 | $650 | $198,276,030 | 214 |\n| Feb 2 | Sunday | 1 | $166,600 | -42.3% | -3.1% | 444 | $375 | $198,442,630 | 215 |\n| Feb 3 | Monday | 1 | $39,870 | -76.1% | -2.6% | 443 | $90 | $198,482,500 | 216 |\n| Feb 4 | Tuesday | 1 | $44,300 | +11.1% | -43.5% | 443 | $100 | $198,526,800 | 217 |\n| Feb 5 | Wednesday | 1 | $41,300 | -6.8% | -29.2% | 413 | $100 | $198,568,100 | 218 |\n| Feb 6 | Thursday | 1 | $37,530 | -9.1% | -35.4% | 417 | $90 | $198,605,630 | 219 |\n| Feb 7 | Friday | 1 | $149,625 | +298.7% | -3.7% | 399 | $375 | $198,755,255 | 220 |\n| Feb 8 | Saturday | 1 | $285,285 | +90.7% | -1.1% | 399 | $715 | $199,040,540 | 221 |\n| Feb 9 | Sunday | 1 | $159,600 | -44.1% | -4.2% | 399 | $400 | $199,200,140 | 222 |\n| Feb 10 | Monday | 1 | $25,740 | -83.9% | -35.4% | 386 | $66 | $199,225,880 | 223 |\n| Feb 11 | Tuesday | 1 | $42,020 | +63.2% | -5.1% | 382 | $110 | $199,267,900 | 224 |\n| Feb 12 | Wednesday | 1 | $32,130 | -23.5% | -22.2% | 378 | $85 | $199,300,030 | 225 |\n| Feb 13 | Thursday | 1 | $32,130 | - | -14.4% | 378 | $85 | $199,332,160 | 226 |\n| Feb 14 | Friday | 1 | $106,500 | +231.5% | -28.8% | 355 | $300 | $199,438,660 | 227 |\n| Feb 15 | Saturday | 1 | $221,875 | +108.3% | -22.2% | 355 | $625 | $199,660,535 | 228 |\n| Feb 16 | Sunday | 1 | $186,375 | -16% | +16.8% | 355 | $525 | $199,846,910 | 229 |\n| Feb 17 Presidents' Day | Monday | 1 | $99,120 | -46.8% | +285.1% | 336 | $295 | $199,946,030 | 230 |\n| Feb 18 | Tuesday | 1 | $46,340 | -53.2% | +10.3% | 331 | $140 | $199,992,370 | 231 |\n| Feb 19 | Wednesday | 1 | $43,290 | -6.6% | +34.7% | 333 | $130 | $200,035,660 | 232 |\n| Feb 20 | Thursday | 1 | $36,520 | -15.6% | +13.7% | 332 | $110 | $200,072,180 | 233 |\n| Feb 21 | Friday | 1 | $136,000 | +272.4% | +27.7% | 340 | $400 | $200,208,180 | 234 |\n| Feb 22 | Saturday | 1 | $246,500 | +81.2% | +11.1% | 340 | $725 | $200,454,680 | 235 |\n| Feb 23 | Sunday | 1 | $144,500 | -41.4% | -22.5% | 340 | $425 | $200,599,180 | 236 |\n| Feb 24 | Monday | 1 | $31,825 | -78% | -67.9% | 335 | $95 | $200,631,005 | 237 |\n| Feb 25 | Tuesday | 1 | $36,960 | +16.1% | -20.2% | 336 | $110 | $200,667,965 | 238 |\n| Feb 26 | Wednesday | 1 | $33,400 | -9.6% | -22.8% | 334 | $100 | $200,701,365 | 239 |\n| Feb 27 | Thursday | 1 | $33,700 | +0.9% | -7.7% | 337 | $100 | $200,735,065 | 240 |\n| Feb 28 | Friday | 1 | $116,640 | +246.1% | -14.2% | 324 | $360 | $200,851,705 | 241 |\n| Mar 1 | Saturday | 1 | $217,750 | +86.7% | -11.7% | 325 | $670 | $201,069,455 | 242 |\n| Mar 2 | Sunday | 1 | $123,585 | -43.2% | -14.5% | 321 | $385 | $201,193,040 | 243 |\n| Mar 3 | Monday | 1 | $31,000 | -74.9% | -2.6% | 310 | $100 | $201,224,040 | 244 |\n| Mar 4 | Tuesday | 1 | $36,840 | +18.8% | -0.3% | 307 | $120 | $201,260,880 | 245 |\n| Mar 5 | Wednesday | 1 | $22,875 | -37.9% | -31.5% | 305 | $75 | $201,283,755 | 246 |\n| Mar 6 | Thursday | 1 | $22,875 | - | -32.1% | 305 | $75 | $201,306,630 | 247 |\n| Mar 7 | Friday | 1 | $122,500 | +435.5% | +5% | 350 | $350 | $201,429,130 | 248 |\n| Mar 8 | Saturday | 1 | $238,000 | +94.3% | +9.3% | 350 | $680 | $201,667,130 | 249 |\n| Mar 9 | Sunday | 1 | $140,000 | -41.2% | +13.3% | 350 | $400 | $201,807,130 | 250 |\n| Mar 10 | Monday | 1 | $40,680 | -70.9% | +31.2% | 339 | $120 | $201,847,810 | 251 |\n| Mar 11 | Tuesday | 1 | $48,720 | +19.8% | +32.2% | 336 | $145 | $201,896,530 | 252 |\n| Mar 12 | Wednesday | 1 | $45,495 | -6.6% | +98.9% | 337 | $135 | $201,942,025 | 253 |\n| Mar 13 | Thursday | 1 | $43,680 | -4% | +91% | 336 | $130 | $201,985,705 | 254 |\n| Mar 14 | Friday | 1 | $131,636 | +201.4% | +7.5% | 330 | $398 | $202,117,341 | 255 |\n| Mar 15 | Saturday | 1 | $225,511 | +71.3% | -5.2% | 330 | $683 | $202,342,852 | 256 |\n| Mar 16 | Sunday | 1 | $141,668 | -37.2% | +1.2% | 328 | $431 | $202,484,520 | 257 |\n| Mar 17 | Monday | 1 | $33,400 | -76.4% | -17.9% | 334 | $100 | $202,517,920 | 258 |\n| Mar 18 | Tuesday | 1 | $47,040 | +40.8% | -3.4% | 336 | $140 | $202,564,960 | 259 |\n| Mar 19 | Wednesday | 1 | $36,300 | -22.8% | -20.2% | 330 | $110 | $202,601,260 | 260 |\n| Mar 20 | Thursday | 1 | $32,800 | -9.6% | -24.9% | 328 | $100 | $202,634,060 | 261 |\n| Dec 27 | Friday | 17 | $475,835 | - | - | - | - | $212,326,307 | 14,423 |"
    },
    {
      "url": "https://www.michaeljfox.org/",
      "text": "The Parkinson's Progression Markers Initiative (PPMI) is recruiting more volunteers to explore the link between sense of smell and brain disease. Now, PPMI scientists are calling on people with and without Parkinson's disease to take a free scratch-and-sniff test. You can help move research forward.\nBig News: Our Landmark Study Has Expanded\nNews Carousel Gallery\nThe Latest from the Foundation\nOur single, urgent goal: Eliminate Parkinson's disease in our lifetime.\nOver $ 2 billion funded in research programs to date\nFeatured Carousel Gallery\nYou too can make a difference.\n“Parkinson's patients are the experts on what we have. We have a responsibility as patients to share our experience — what works for us, what we respond to, what we can contribute to research.”\n— Michael J. Fox\nFundraise for a Cure\nThousands of Team Fox members worldwide are turning their passions and interests into millions in funding for Parkinson's research.\nBe Part of the Answer\nYou have the power to impact your future and the future of millions living with Parkinson's disease. Explore participating in clinical research today.\nPublic Policy Matters\nYour voice and your story can shape policymakers' decisions on issues of importance to the Parkinson's community.\n“Participating in research changes how you view your diagnosis… and the world around you. It makes you feel like you are playing an important role in solving a problem that affects millions of people.”\n— Dan Kinel, Rochester, NY"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/movies/2025/06/05/back-to-the-future-guitar-search/84028520007/",
      "text": "'Back to the Future' cast seeks help in search for red guitar\n\"Back to the Future\" co-creator Bob Gale described the red electric guitar as an important piece of cinema history and memorabilia.\nMarty McFly's iconic red guitar from the original \"Back to the Future\" is missing, and the movie's cast and filmmakers are asking for the public's help to bring it back to the present.\nMusical instrument chain Gibson uploaded a video on Tuesday, June 2, revealing the cherry red Gibson ES-345 guitar hasn't been seen since 1985, when the film premiered. The video featured several stars from the movie, including Michael J. Fox (Marty McFly), Lea Thompson (Lorraine Baines McFly), Christopher Lloyd (Dr. Emmett Brown) and Harry Waters Jr. (Marvin Berry).\n\"It's somewhere lost in the space time continuum, or it's in some teamster's garage,\" Fox said in the video. \"If you know where it is, if you know who has it, call us, text us. We need that guitar. I need it.\"\n\"Back to the Future\" co-creator Bob Gale said the electric guitar is an important piece of cinema history and memorabilia.\nIt's unclear who last had the instrument, with Lloyd saying \"somehow it's vanished,\" but added the team will be forever grateful for its return.\nWhere was the Gibson guitar last seen?\nThe team behind the sci-fi adventure film rented the Gibson guitar from Los Angeles business Norman’s Rare Guitars and returned it to them following production, according to The Hollywood Reporter. However, \"Lost to the Future\" director Doc Crotzer and Gibson’s Brand Experience Director, Mark Agnesi, clarified they have no clue where it is now.\n\"We’ve been looking into leads and rumors for a long time, and as you can imagine, we’re talking 40 years ago, so memories fade,\" Crotzer told the outlet. \"We weren’t in the era of digital trails, or of receipts and things like that. There are conflicting reports too. You can find about as many different rumors as you can people.\"\nCrotzer and Agnesi said there have been many stories about where the guitar went, including the likely scenario that it was sold at the LA store. Yet, they are hoping the global search could lead to more concrete answers.\n\"I knew that guitar came from Norm’s, the first day on the job, I was looking in cases,\" Agnesi told The Hollywood Reporter. \"Every time I’d go to storage to Norm’s warehouse, I was checking ES-cases to see if he still had it. I’ve been looking since 2009, 15 years of looking for this thing. It’s cool we’re going to let the world know we’re looking for it and everyone gets to join in.\"\nAnyone with information on the instrument's whereabouts is encouraged to submit a tip to the new Lost To The Future website or contact (855) 345-1955 through a text message or a phone call."
    },
    {
      "url": "https://bidenwhitehouse.archives.gov/briefing-room/statements-releases/2025/01/04/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-3/",
      "text": "President Biden Announces Recipients of the Presidential Medal of Freedom\nToday, President Biden named nineteen recipients of the Presidential Medal of Freedom.\nThe Presidential Medal of Freedom is the Nation’s highest civilian honor, presented to individuals who have made exemplary contributions to the prosperity, values, or security of the United States, world peace, or other significant societal, public or private endeavors.\nPresident Biden believes great leaders keep the faith, give everyone a fair shot, and put decency above all else. These nineteen individuals are great leaders who have made America and the world a better place. They are great leaders because they are good people who have made extraordinary contributions to their country and the world.\nThe awards will be presented at the White House on January 4, 2025. The following individuals will be awarded the Presidential Medal of Freedom:\nJosé Andrés\nJosé Andrés is a renowned Spanish-American culinary innovator who popularized tapas in the United States. His World Central Kitchen provides large-scale relief to communities affected by natural disasters and conflict around the world.\nBono\nBono is the frontman for legendary rock band U2 and a pioneering activist against AIDS and poverty. He brought together politicians from opposing parties to create the United States PEPFAR AIDS program, and is co-founder of campaigning organizations ONE and (RED).\nAshton Baldwin Carter (posthumous)\nAsh Carter served as the 25th Secretary of Defense and devoted his career to making the nation safer for all. Throughout his career, he served under 11 Secretaries of Defense in both Democratic and Republican administrations.\nHillary Rodham Clinton\nSecretary Clinton made history many times over decades in public service, including as the first First Lady elected to the United States Senate. After serving as Secretary of State, she became the first woman nominated for president by a major United States political party.\nMichael J. Fox\nMichael J. Fox is an actor who has won five Emmy Awards, four Golden Globe Awards, two Screen Actors Guild Awards, and a Grammy Award. He is a world-renowned advocate for Parkinson’s disease research and development.\nTim Gill\nTim Gill is a visionary entrepreneur whose work has advanced LGBTQI rights and equality. After transforming the publishing industry through groundbreaking software, he leveraged his success to secure key victories in the fight for marriage equality and anti-discrimination protections.\nJane Goodall\nDr. Jane Goodall is a world-renowned ethologist and conservationist whose research transformed our understanding of primates and human evolution. She is a passionate advocate for empowering individuals and communities to protect and preserve the natural world.\nFannie Lou Hamer (posthumous)\nMrs. Fannie Lou Hamer transformed the struggle for racial justice in America. As a founder of the Mississippi Freedom Democratic Party, she challenged the exclusion of Black voices in the political system and laid the groundwork for the 1965 Voting Rights Act.\nEarvin “Magic” Johnson\nEarvin “Magic” Johnson is a legendary retired basketball player who led the Los Angeles Lakers to five championships. Off the court, he is a successful entrepreneur and philanthropist who supports underserved communities through his Magic Johnson Foundation.\nRobert Francis Kennedy (posthumous)\nRobert Francis Kennedy is remembered as an Attorney General who fiercely combatted racial segregation, and as a United States Senator who sought to address poverty and inequality in the country. His legacy continues to inspire those committed to justice, equality, and public service.\nRalph Lauren\nRalph Lauren is a fashion designer who redefined the fashion industry with a lifestyle brand that embodies timeless elegance and American tradition. He has influenced culture, business, and philanthropy, notably in the fight against cancer and the preservation of the Star-Spangled Banner.\nLionel Messi\nLionel Messi is the most decorated player in the history of professional soccer. He supports healthcare and education programs for children around the world through the Leo Messi Foundation and serves as a UNICEF Goodwill Ambassador.\nWilliam Sanford Nye\nBill Nye has inspired and influenced generations of American students as “Bill Nye the Science Guy.” His dedication to science education continues through his work as CEO of the Planetary Society and as a vocal advocate for space exploration and environmental stewardship.\nGeorge W. Romney (posthumous)\nGeorge Romney was a businessman who served as the chairman and president of American Motors Corporation. A public servant, he later served as both the 43rd Governor of Michigan and the 3rd Secretary of Housing and Urban Development.\nDavid M. Rubenstein\nDavid Rubenstein is co-founder and co-chairman of The Carlyle Group, where he built one of the most successful global investment firms. He is renowned for his philanthropy and generous support for the restoration of historic landmarks and the country’s cultural institutions.\nGeorge Soros\nGeorge Soros is an investor, philanthropist, and founder of the Open Society Foundations. Through his network of foundations, partners and projects in more than 120 countries, Soros has focused on global initiatives that strengthen democracy, human rights, education, and social justice.\nGeorge Stevens, Jr.\nGeorge Stevens, Jr. is an award-winning writer, director, author, and playwright. His career has been dedicated to preserving and celebrating the best of American film and the performing arts, including by founding the American Film Institute and creating the Kennedy Center Honors.\nDenzel Washington\nDenzel Washington is an actor, director, and producer who has won two Academy Awards, a Tony Award, two Golden Globes, and the 2016 Cecil B. DeMille Lifetime Achievement Award. He has also served as National Spokesman for the Boys & Girls Clubs of America for over 25 years.\nAnna Wintour\nAnna Wintour is a renowned fashion icon who has led Vogue as editor-in-chief since 1988. A champion for philanthropic causes, she is also the leading architect behind the annual Met Gala fundraiser and chief content officer of Condé Nast.\n###"
    },
    {
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2023/11/03/michael-j-fox-parkinsons-broken-bones/71441558007/",
      "text": "Michael J. Fox calls breaking bones due to Parkinson's symptoms a 'tsunami of misfortune'\nMichael J. Fox knows a thing or two about resilience after living with Parkinson's Disease for 30 years.\nIn an interview with Town & Country magazine published Thursday, the \"Back to the Future\" actor, 62, detailed the injuries he's sustained in recent years, since breaking his upper arm while recovering from a risky spinal surgery to remove a noncancerous tumor in 2018. That fall was Fox's \"darkest moment,\" he told People magazine in 2020.\nYet “that was nothing,” he said of the broken arm, which threatened Fox's pervasive optimism and inspired his 2020 memoir, \"No Time Like the Future: An Optimist Considers Mortality.\" Fox shared that he has broken his other arm and shoulder, smashed his orbital bone and cheek and broken his hand since that injury.\n“My hand got infected and then I almost lost it,” he said. “It was a tsunami of misfortune.”\nFox, who takes pills that help him speak by combatting paralysis of his facial muscles, also trains daily to preserve his ambulatory skills, despite the risk of further injuries from daily falls. But he doesn't appear too concerned about it.\n“One day I’ll run out of gas,” he said. “One day I’ll just say, ‘It’s not going to happen. I’m not going out today.’ If that comes, I’ll allow myself that. I’m 62 years old.\n\"Certainly, if I were to pass away tomorrow, it would be premature, but it wouldn’t be unheard of. And so, no, I don’t fear that.”\nFox keeps moving despite frequent falling\nIn the documentary that came out earlier this year, \"Still: A Michael J. Fox Movie,\" Fox frequently falls while walking and incurs multiple injuries over the course of filming.\n\"People around me are going, 'Be careful, be careful,' \" Fox says. \"And I'm like: 'This has nothing to do with being careful. This happens.' \"\nFox was diagnosed with Parkinson's when he was 29 and publicly shared the news seven years later, in 1998.\nThe fastest-growing neurodegenerative condition in the U.S., Parkinson’s is an incurable brain disorder, a progressive disease \"that causes unintended or uncontrollable movements, such as shaking, stiffness, and difficulty with balance and coordination,\" according to the National Institute on Aging.\n'Still: A Michael J. Fox Movie': Actor says he became an alcoholic, hid Parkinson's diagnosis\nBreaking his arm in 2018 was a 'breakthrough moment' for Michael J. Fox\nIn 2008, Fox published a book titled \"Always Looking Up: The Adventures of an Incurable Optimist.\" Ten years later, he started questioning his blind optimism after falling while recovering from surgery.\n\"I was lying on the floor in my kitchen with a shattered arm waiting for the ambulance to show up,\" Fox told USA TODAY in 2020. \"I kind of went, 'What an idiot. All this time you've been telling everybody to be optimistic, chin-up, and you're miserable now. There's nothing but pain and regret. There's no way to put a shine on this.'\"\nIt's this fall that kicks off Fox's book, \"No Time Like the Future: An Optimist Considers Mortality,\" in which the actor goes on to detail his harrowing recovery from spinal surgery, insights from his battle with Parkinson's disease and his return to positivity after, quite literally, falling into despair.\n\"That was a real breakthrough moment for me, because I realized that I've been selling that optimism to people for so long,\" he said. \"I believe it's true to my core, but it struck me that at that point I questioned it, and I questioned it really severely. And so the rest of the book is this journey through finding my way back with gratitude. And I think gratitude is what makes optimism sustainable.\"\nThrough his recovery, falling and then needing to recover again, Fox said he realized the importance of being realistic while still maintaining optimism.\n\"I think the first thing you have to do is accept if you're faced with a difficult situation,\" Fox said. \"And once I do that, that doesn't mean I can't ever change it. I can change it, but I have to accept it for what it is first, before I can change it. And I have to be real about it. And once I do that, then it opens all doors.\"\nThe Michael J. Fox Foundation has reportedly spent nearly $2 billion in Parkinson's research since being established in 2000. Earlier this year, the nonprofit announced the discovery of \"a monumental leap forward for our disease\": a spinal fluid test – which is in the clinical trial phase – that can detect early stages of Parkinson’s in a person's cells.\nMichael J. Fox says sobriety after Parkinson’s diagnosis was 'a knife fight in a closet'\nContributing: Charles Trepany, USA TODAY"
    },
    {
      "url": "https://www.loc.gov/programs/national-film-preservation-board/film-registry/complete-national-film-registry-listing/",
      "text": "Complete National Film Registry Listing\nSort films by title, year of release, and year inducted into the Registry by using the up and down arrows at the top of each column.\nBrief descriptions and expanded essays are available for many Registry titles.\nView a list of all expanded essays\n| Film Title | Year of Release | Year Inducted |\n|---|---|---|\n| American Me | 1992 | 2024 |\n| Angels with Dirty Faces | 1938 | 2024 |\n| Annabelle’s Serpentine Dance | 1895 | 2024 |\n| Beverly Hills Cop | 1984 | 2024 |\n| The Chelsea Girls | 1966 | 2024 |\n| Common Threads: Stories From the Quilt | 1989 | 2024 |\n| Compensation | 1999 | 2024 |\n| Dirty Dancing | 1987 | 2024 |\n| Ganja and Hess | 1973 | 2024 |\n| Invaders from Mars | 1953 | 2024 |\n| Koko’s Earth Control | 1928 | 2024 |\n| Mi Familia | 1995 | 2024 |\n| The Miracle Worker | 1962 | 2024 |\n| My Own Private Idaho | 1991 | 2024 |\n| No Country for Old Men | 2007 | 2024 |\n| Powwow Highway | 1989 | 2024 |\n| The Pride of the Yankees | 1942 | 2024 |\n| The Social Network | 2010 | 2024 |\n| Spy Kids | 2001 | 2024 |\n| Star Trek: The Wrath of Khan | 1982 | 2024 |\n| The Texas Chain Saw Massacre | 1974 | 2024 |\n| Up in Smoke | 1978 | 2024 |\n| Uptown Saturday Night | 1974 | 2024 |\n| Will | 1981 | 2024 |\n| Zora Lathan Student Films | 1975-76 | 2024 |\n| 12 Years a Slave | 2013 | 2023 |\n| 20 Feet From Stardom | 2013 | 2023 |\n| Alambrista! | 1977 | 2023 |\n| Apollo 13 | 1995 | 2023 |\n| Bamboozled | 2000 | 2023 |\n| Bohulano Family Film Collection | 1950-78 | 2023 |\n| Cruisin' J Town | 1975 | 2023 |\n| Desperately Seeking Susan | 1985 | 2023 |\n| Dinner at Eight | 1933 | 2023 |\n| Edge of the City | 1957 | 2023 |\n| Fame | 1980 | 2023 |\n| Helen Keller in her Story | 1954 | 2023 |\n| Home Alone | 1990 | 2023 |\n| Lady and the Tramp | 1955 | 2023 |\n| The Lighted Field | 1987 | 2023 |\n| Love & Basketball | 2000 | 2023 |\n| Matewan | 1987 | 2023 |\n| Maya Lin: A Strong Clear Vision | 1994 | 2023 |\n| Movie Trip Through Filmland | 1921 | 2023 |\n| The Nightmare Before Christmas | 1993 | 2023 |\n| Passing Through | 1977 | 2023 |\n| Queen of Diamonds | 1991 | 2023 |\n| Terminator 2: Judgment Day | 1991 | 2023 |\n| The Wedding Banquet | 1993 | 2023 |\n| We're Alive | 1974 | 2023 |\n| Attica | 1974 | 2022 |\n| The Ballad of Gregorio Cortez | 1982 | 2022 |\n| Behind Every Good Man | 1967 | 2022 |\n| Betty Tells Her Story | 1972 | 2022 |\n| Bush Mama | 1979 | 2022 |\n| Cab Calloway Home Movies | 1948-51 | 2022 |\n| Carrie | 1976 | 2022 |\n| Charade | 1963 | 2022 |\n| Cyrano de Bergerac | 1950 | 2022 |\n| Hairspray | 1988 | 2022 |\n| House Party | 1990 | 2022 |\n| Iron Man | 2008 | 2022 |\n| Itam Hakim, Hopiit | 1984 | 2022 |\n| The Little Mermaid | 1989 | 2022 |\n| Manzanar | 1971 | 2022 |\n| Mardi Gras Carnival | 1898 | 2022 |\n| Mingus | 1968 | 2022 |\n| Pariah | 2011 | 2022 |\n| Scorpio Rising | 1964 | 2022 |\n| Super Fly | 1972 | 2022 |\n| Titicut Follies | 1967 | 2022 |\n| Tongues Untied | 1989 | 2022 |\n| Union Maids | 1976 | 2022 |\n| When Harry Met Sally | 1989 | 2022 |\n| Word is Out: Stories of Our Lives | 1978 | 2022 |\n| Chicana | 1979 | 2021 |\n| Cooley High | 1975 | 2021 |\n| Evergreen | 1965 | 2021 |\n| Flowers and Trees | 1932 | 2021 |\n| The Flying Ace | 1926 | 2021 |\n| Hell-Bound Train | 1930 | 2021 |\n| Jubilo | 1919 | 2021 |\n| The Long Goodbye | 1973 | 2021 |\n| The Lord of the Rings: Fellowship of the Ring | 2001 | 2021 |\n| The Murder of Fred Hampton | 1971 | 2021 |\n| A Nightmare on Elm Street | 1984 | 2021 |\n| Pink Flamingos | 1972 | 2021 |\n| Requiem 29 | 1970 | 2021 |\n| Return of the Jedi | 1983 | 2021 |\n| Richard Pryor: Live in Concert | 1979 | 2021 |\n| Ringling Bros. Parade Film | 1902 | 2021 |\n| Selena | 1997 | 2021 |\n| Sounder | 1972 | 2021 |\n| Stop Making Sense | 1984 | 2021 |\n| Strangers on a Train | 1951 | 2021 |\n| Wall-E | 2008 | 2021 |\n| The Watermelon Woman | 1996 | 2021 |\n| What Ever Happened to Baby Jane | 1962 | 2021 |\n| Who Killed Vincent Chin | 1987 | 2021 |\n| The Wobblies | 1979 | 2021 |\n| The Battle of the Century | 1927 | 2020 |\n| The Blues Brothers | 1980 | 2020 |\n| Bread | 1918 | 2020 |\n| Buena Vista Social Club | 1999 | 2020 |\n| Cabin in the Sky | 1943 | 2020 |\n| A Clockwork Orange | 1971 | 2020 |\n| The Dark Knight | 2008 | 2020 |\n| The Devil Never Sleeps | 1994 | 2020 |\n| Freedom Riders | 2010 | 2020 |\n| Grease | 1978 | 2020 |\n| The Ground | 1993-2001 | 2020 |\n| The Hurt Locker | 2009 | 2020 |\n| Illusions | 1982 | 2020 |\n| The Joy Luck Club | 1993 | 2020 |\n| Kid Auto Races at Venice | 1914 | 2020 |\n| Lilies of the Field | 1963 | 2020 |\n| Losing Ground | 1982 | 2020 |\n| The Man with the Golden Arm | 1955 | 2020 |\n| Mauna Kea: Temple Under Siege | 2006 | 2020 |\n| Outrage | 1950 | 2020 |\n| Shrek | 2001 | 2020 |\n| Suspense | 1913 | 2020 |\n| Sweet Sweetback’s Baadasssss Song | 1971 | 2020 |\n| Wattstax | 1973 | 2020 |\n| With Car and Camera Around the World | 1929 | 2020 |\n| Amadeus | 1984 | 2019 |\n| Becky Sharp | 1935 | 2019 |\n| Before Stonewall | 1984 | 2019 |\n| Body and Soul | 1925 | 2019 |\n| Boys Don't Cry | 1999 | 2019 |\n| Clerks | 1994 | 2019 |\n| Coal Miner's Daughter | 1980 | 2019 |\n| Emigrants Landing at Ellis Island | 1903 | 2019 |\n| Employees Entrance | 1933 | 2019 |\n| Fog of War | 2003 | 2019 |\n| Gaslight | 1944 | 2019 |\n| George Washington Carver at Tuskegee Institute | 1937 | 2019 |\n| Girlfriends | 1978 | 2019 |\n| I am Somebody | 1970 | 2019 |\n| Last Waltz, The | 1978 | 2019 |\n| My Name Is Oona | 1969 | 2019 |\n| A New Leaf | 1971 | 2019 |\n| Old Yeller | 1957 | 2019 |\n| Phenix City Story, The | 1955 | 2019 |\n| Platoon | 1986 | 2019 |\n| Purple Rain | 1984 | 2019 |\n| Real Women Have Curves | 2002 | 2019 |\n| She's Gotta Have it | 1986 | 2019 |\n| Sleeping Beauty | 1959 | 2019 |\n| Zoot Suit | 1981 | 2019 |\n| Bad Day at Black Rock | 1955 | 2018 |\n| Broadcast News | 1987 | 2018 |\n| Brokeback Mountain | 2005 | 2018 |\n| Cinderella | 1950 | 2018 |\n| Days of Wine and Roses | 1962 | 2018 |\n| Dixon-Wanamaker Expedition to Crow Agency | 1908 | 2018 |\n| Eve's Bayou | 1997 | 2018 |\n| The Girl Without a Soul | 1917 | 2018 |\n| Hair Piece: A Film for Nappy Headed People | 1984 | 2018 |\n| Hearts and Minds | 1974 | 2018 |\n| Hud | 1963 | 2018 |\n| The Informer | 1935 | 2018 |\n| Jurassic Park | 1993 | 2018 |\n| The Lady from Shanghai | 1947 | 2018 |\n| Leave Her to Heaven | 1945 | 2018 |\n| Monterey Pop | 1968 | 2018 |\n| My Fair Lady | 1964 | 2018 |\n| The Navigator | 1924 | 2018 |\n| On the Town | 1949 | 2018 |\n| One-Eyed Jacks | 1961 | 2018 |\n| Pickup on South Street | 1953 | 2018 |\n| Rebecca | 1940 | 2018 |\n| The Shining | 1980 | 2018 |\n| Smoke Signals | 1998 | 2018 |\n| Something Good – Negro Kiss | 1898 | 2018 |\n| Ace in the Hole (aka Big Carnival) | 1951 | 2017 |\n| Boulevard Nights | 1979 | 2017 |\n| Die Hard | 1988 | 2017 |\n| Dumbo | 1941 | 2017 |\n| Field of Dreams | 1989 | 2017 |\n| 4 Little Girls | 1997 | 2017 |\n| Fuentes Family Home Movies Collection | 1920s and 1930s | 2017 |\n| Gentleman’s Agreement | 1947 | 2017 |\n| The Goonies | 1985 | 2017 |\n| Guess Who’s Coming to Dinner | 1967 | 2017 |\n| He Who Gets Slapped | 1924 | 2017 |\n| Interior New York Subway, 14th Street to 42nd Street | 1905 | 2017 |\n| La Bamba | 1987 | 2017 |\n| Lives of Performers | 1972 | 2017 |\n| Memento | 2001 | 2017 |\n| Only Angels Have Wings | 1939 | 2017 |\n| The Sinking of the Lusitania | 1918 | 2017 |\n| Spartacus | 1960 | 2017 |\n| Superman | 1978 | 2017 |\n| Thelonious Monk: Straight, No Chaser | 1988 | 2017 |\n| Time and Dreams | 1976 | 2017 |\n| Titanic | 1997 | 2017 |\n| To Sleep with Anger | 1990 | 2017 |\n| Wanda | 1971 | 2017 |\n| With the Abraham Lincoln Brigade in Spain | 1937-38 | 2017 |\n| The Atomic Café | 1982 | 2016 |\n| Ball of Fire | 1941 | 2016 |\n| The Beau Brummels | 1928 | 2016 |\n| The Birds | 1963 | 2016 |\n| Blackboard Jungle | 1955 | 2016 |\n| The Breakfast Club | 1985 | 2016 |\n| The Decline of Western Civilization | 1981 | 2016 |\n| East of Eden | 1955 | 2016 |\n| Funny Girl | 1968 | 2016 |\n| Life of an American Fireman | 1903 | 2016 |\n| The Lion King | 1994 | 2016 |\n| Lost Horizon | 1937 | 2016 |\n| Musketeers of Pig Alley | 1912 | 2016 |\n| Paris Is Burning | 1990 | 2016 |\n| Point Blank | 1967 | 2016 |\n| The Princess Bride | 1987 | 2016 |\n| Putney Swope | 1969 | 2016 |\n| Reverend Solomon Sir Jones films | 1924-28 | 2016 |\n| Rushmore | 1998 | 2016 |\n| Steamboat Bill, Jr. | 1928 | 2016 |\n| Suzanne, Suzanne | 1982 | 2016 |\n| Thelma & Louise | 1991 | 2016 |\n| 20,000 Leagues Under the Sea | 1916 | 2016 |\n| A Walk in the Sun | 1945 | 2016 |\n| Who Framed Roger Rabbit? | 1988 | 2016 |\n| 3:10 to Yuma | 1957 | 2012 |\n| The 7th Voyage of Sinbad | 1958 | 2008 |\n| 12 Angry Men | 1957 | 2007 |\n| 13 Lakes | 2004 | 2014 |\n| 42nd Street | 1933 | 1998 |\n| 2001: A Space Odyssey | 1968 | 1991 |\n| Abbott and Costello Meet Frankenstein | 1948 | 2001 |\n| Adam’s Rib | 1949 | 1992 |\n| The Adventures of Robin Hood | 1938 | 1995 |\n| The African Queen | 1951 | 1994 |\n| Airplane! | 1980 | 2010 |\n| Alien | 1979 | 2002 |\n| All About Eve | 1950 | 1990 |\n| All My Babies | 1953 | 2002 |\n| All Quiet on the Western Front | 1930 | 1990 |\n| All That Heaven Allows | 1955 | 1995 |\n| All That Jazz | 1979 | 2001 |\n| All the King’s Men | 1949 | 2001 |\n| All the President’s Men | 1976 | 2010 |\n| Allures | 1961 | 2011 |\n| America, America | 1963 | 2001 |\n| American Graffiti | 1973 | 1995 |\n| An American in Paris | 1951 | 1993 |\n| Anatomy of a Murder | 1959 | 2012 |\n| Annie Hall | 1977 | 1992 |\n| Antonia: A Portrait of the Woman | 1974 | 2003 |\n| The Apartment | 1960 | 1994 |\n| Apocalypse Now | 1979 | 2000 |\n| Applause | 1929 | 2006 |\n| The Asphalt Jungle | 1950 | 2008 |\n| Atlantic City | 1980 | 2003 |\n| The Augustas | 1930s-1950s | 2012 |\n| The Awful Truth | 1937 | 1996 |\n| Baby Face | 1933 | 2005 |\n| Back to the Future | 1985 | 2007 |\n| The Bad and the Beautiful | 1952 | 2002 |\n| Badlands | 1973 | 1993 |\n| Bambi | 1942 | 2011 |\n| The Band Wagon | 1953 | 1995 |\n| The Bank Dick | 1940 | 1992 |\n| The Bargain | 1914 | 2010 |\n| The Battle of San Pietro | 1945 | 1991 |\n| Beauty and the Beast | 1991 | 2002 |\n| Being There | 1979 | 2015 |\n| Ben-Hur (1925) | 1925 | 1997 |\n| Ben-Hur (1959) | 1959 | 2004 |\n| Bert Williams Lime Kiln Club Field Day | 1913 | 2014 |\n| The Best Years of Our Lives | 1946 | 1989 |\n| Big Business | 1929 | 1992 |\n| The Big Heat | 1953 | 2011 |\n| The Big Lebowski | 1998 | 2014 |\n| The Big Parade | 1925 | 1992 |\n| The Big Sleep | 1946 | 1997 |\n| The Big Trail | 1930 | 2006 |\n| The Birth of a Nation | 1915 | 1992 |\n| Black and Tan | 1929 | 2015 |\n| The Black Pirate | 1926 | 1993 |\n| The Black Stallion | 1979 | 2002 |\n| Blacksmith Scene | 1893 | 1995 |\n| Blade Runner | 1982 | 1993 |\n| Blazing Saddles | 1974 | 2006 |\n| Bless Their Little Hearts | 1984 | 2013 |\n| The Blood of Jesus | 1941 | 1991 |\n| The Blue Bird | 1918 | 2004 |\n| Bonnie and Clyde | 1967 | 1992 |\n| Born Yesterday | 1950 | 2012 |\n| Boyz N the Hood | 1991 | 2002 |\n| Brandy in the Wilderness | 1969 | 2013 |\n| Breakfast at Tiffany’s | 1961 | 2012 |\n| The Bride of Frankenstein | 1935 | 1998 |\n| The Bridge on the River Kwai | 1957 | 1997 |\n| Bringing Up Baby | 1938 | 1990 |\n| Broken Blossoms | 1919 | 1996 |\n| A Bronx Morning | 1931 | 2004 |\n| The Buffalo Creek Flood: An Act of Man | 1975 | 2005 |\n| Bullitt | 1968 | 2007 |\n| Butch Cassidy and the Sundance Kid | 1969 | 2003 |\n| Cabaret | 1972 | 1995 |\n| The Cameraman | 1928 | 2005 |\n| Carmen Jones | 1954 | 1992 |\n| Casablanca | 1942 | 1989 |\n| Castro Street (The Coming of Consciousness) | 1966 | 1992 |\n| Cat People | 1942 | 1993 |\n| Chan Is Missing | 1982 | 1995 |\n| The Cheat | 1915 | 1993 |\n| The Chechahcos | 1924 | 2003 |\n| Chinatown | 1974 | 1991 |\n| A Christmas Story | 1983 | 2012 |\n| Chulas Fronteras | 1976 | 1993 |\n| Cicero March | 1966 | 2013 |\n| Citizen Kane | 1941 | 1989 |\n| City Lights | 1931 | 1991 |\n| The City | 1939 | 1998 |\n| Civilization | 1916 | 1999 |\n| Clash of the Wolves | 1925 | 2004 |\n| Close Encounters of the Third Kind | 1977 | 2007 |\n| Cologne: From the Diary of Ray and Esther | 1939 | 2001 |\n| Commandment Keeper Church, Beaufort, South Carolina (May 1940) | 1940 | 2005 |\n| A Computer Animated Hand | 1972 | 2011 |\n| The Conversation | 1974 | 1995 |\n| Cool Hand Luke | 1967 | 2005 |\n| The Cool World | 1963 | 1994 |\n| Cops | 1922 | 1997 |\n| Corbett-Fitzsimmons Title Fight | 1897 | 2012 |\n| A Corner in Wheat | 1909 | 1994 |\n| The Court Jester | 1956 | 2004 |\n| Crisis: Behind a Presidential Commitment | 1963 | 2011 |\n| The Crowd | 1928 | 1989 |\n| Cry of Jazz | 1959 | 2010 |\n| The Cry of the Children | 1912 | 2011 |\n| A Cure for Pokeritis | 1912 | 2011 |\n| The Curse of Quon Gwon | 1916-1917 | 2006 |\n| Czechoslovakia 1968 | 1969 | 1997 |\n| D.O.A. | 1950 | 2004 |\n| Dance, Girl, Dance | 1940 | 2007 |\n| Dances with Wolves | 1990 | 2007 |\n| Daughter of Dawn | 1920 | 2013 |\n| Daughter of Shanghai | 1937 | 2006 |\n| Daughters of the Dust | 1991 | 2004 |\n| David Holzman’s Diary | 1968 | 1991 |\n| The Day the Earth Stood Still | 1951 | 1995 |\n| Days of Heaven | 1978 | 2007 |\n| Dead Birds | 1964 | 1998 |\n| Decasia | 2002 | 2013 |\n| The Deer Hunter | 1978 | 1996 |\n| Deliverance | 1972 | 2008 |\n| Demolishing and Building Up the Star Theatre | 1901 | 2002 |\n| Destry Rides Again | 1939 | 1996 |\n| Detour | 1945 | 1992 |\n| Dickson Experimental Sound Film | 1894-1895 | 2003 |\n| Dirty Harry | 1971 | 2012 |\n| Disneyland Dream | 1956 | 2008 |\n| Do the Right Thing | 1989 | 1999 |\n| The Docks of New York | 1928 | 1999 |\n| Dodsworth | 1936 | 1990 |\n| Dog Day Afternoon | 1975 | 2009 |\n| Dog Star Man | 1964 | 1992 |\n| Don’t Look Back | 1967 | 1998 |\n| Double Indemnity | 1944 | 1992 |\n| Down Argentine Way | 1940 | 2014 |\n| Dr. Strangelove | 1964 | 1989 |\n| Dracula | 1931 | 2000 |\n| Dracula (Spanish language version) | 1931 | 2015 |\n| The Dragon Painter | 1919 | 2014 |\n| Dream of a Rarebit Fiend | 1906 | 2015 |\n| Drums of Winter (aka Uksuum Cauyai) | 1988 | 2006 |\n| Duck Amuck | 1953 | 1999 |\n| Duck and Cover | 1951 | 2004 |\n| Duck Soup | 1933 | 1990 |\n| E.T. The Extra-Terrestrial | 1982 | 1994 |\n| Eadweard Muybridge, Zoopraxographer | 1974 | 2015 |\n| Early Abstractions | 1939-1956 | 2006 |\n| Easy Rider | 1969 | 1998 |\n| Eaux d’artifice | 1953 | 1993 |\n| Edison Kinetoscopic Record of a Sneeze | 1894 | 2015 |\n| El Mariachi | 1992 | 2011 |\n| El Norte | 1983 | 1995 |\n| Electronic Labyrinth: THX 1138 4EB | 1967 | 2010 |\n| Ella Cinders | 1926 | 2013 |\n| The Emperor Jones | 1933 | 1999 |\n| Empire | 1964 | 2004 |\n| The Empire Strikes Back | 1980 | 2010 |\n| The Endless Summer | 1966 | 2002 |\n| Enter the Dragon | 1973 | 2004 |\n| Eraserhead | 1977 | 2004 |\n| The Evidence of the Film | 1913 | 2001 |\n| The Exiles | 1961 | 2009 |\n| The Exorcist | 1973 | 2010 |\n| The Exploits of Elaine | 1914 | 1994 |\n| A Face in the Crowd | 1957 | 2008 |\n| Faces | 1968 | 2011 |\n| Fake Fruit Factory | 1986 | 2011 |\n| The Fall of the House of Usher | 1928 | 2000 |\n| Fantasia | 1940 | 1990 |\n| Fargo | 1996 | 2006 |\n| Fast Times at Ridgemont High | 1982 | 2005 |\n| Fatty’s Tintype Tangle | 1915 | 1995 |\n| Felicia | 1965 | 2014 |\n| Ferris Bueller's Day Off | 1986 | 2014 |\n| Film Portrait | 1972 | 2003 |\n| Five Easy Pieces | 1970 | 2000 |\n| Flash Gordon Serial | 1936 | 1996 |\n| Flesh and the Devil | 1927 | 2006 |\n| Flower Drum Song | 1961 | 2008 |\n| A Fool There Was | 1915 | 2015 |\n| Foolish Wives | 1922 | 2008 |\n| Footlight Parade | 1933 | 1992 |\n| Forbidden Planet | 1956 | 2013 |\n| Force of Evil | 1948 | 1994 |\n| The Forgotten Frontier | 1931 | 1996 |\n| Forrest Gump | 1994 | 2011 |\n| The Four Horsemen of the Apocalypse | 1921 | 1995 |\n| Fox Movietone News: Jenkins Orphanage Band | 1928 | 2003 |\n| Frank Film | 1973 | 1996 |\n| Frankenstein | 1931 | 1991 |\n| Freaks | 1932 | 1994 |\n| Free Radicals | 1979 | 2008 |\n| The French Connection | 1971 | 2005 |\n| The Freshman | 1925 | 1990 |\n| From Here to Eternity | 1953 | 2002 |\n| From Stump to Ship | 1930 | 2002 |\n| From the Manger to the Cross | 1912 | 1998 |\n| The Front Page | 1931 | 2010 |\n| Fuji | 1974 | 2002 |\n| Fury | 1936 | 1995 |\n| The Gang's All Here | 1943 | 2014 |\n| Garlic Is As Good As Ten Mothers | 1980 | 2004 |\n| The General | 1927 | 1989 |\n| George Stevens’ World War II Footage | 1943-1946 | 2008 |\n| Gerald McBoing-Boing | 1951 | 1995 |\n| Gertie The Dinosaur | 1914 | 1991 |\n| Ghostbusters | 1984 | 2015 |\n| Giant | 1956 | 2005 |\n| Gigi | 1958 | 1991 |\n| Gilda | 1946 | 2013 |\n| Glimpse of the Garden | 1957 | 2007 |\n| The Godfather Part II | 1974 | 1993 |\n| The Godfather | 1972 | 1990 |\n| Going My Way | 1944 | 2004 |\n| Gold Diggers of 1933 | 1933 | 2003 |\n| The Gold Rush | 1925 | 1992 |\n| Gone With the Wind | 1939 | 1989 |\n| Goodfellas | 1990 | 2000 |\n| The Graduate | 1967 | 1996 |\n| Grand Hotel | 1932 | 2007 |\n| The Grapes of Wrath | 1940 | 1989 |\n| Grass | 1925 | 1997 |\n| The Great Dictator | 1940 | 1997 |\n| The Great Train Robbery | 1903 | 1990 |\n| Greed | 1924 | 1991 |\n| Grey Gardens | 1976 | 2010 |\n| Groundhog Day | 1993 | 2006 |\n| Growing Up Female | 1971 | 2011 |\n| Gun Crazy aka Deadly Is the Female | 1949 | 1998 |\n| Gunga Din | 1939 | 1999 |\n| H2O | 1929 | 2005 |\n| Hail the Conquering Hero | 1944 | 2015 |\n| Hallelujah! | 1929 | 2008 |\n| Halloween | 1978 | 2006 |\n| Hands Up! | 1926 | 2005 |\n| Harlan County, U.S.A. | 1976 | 1990 |\n| Harold and Maude | 1971 | 1997 |\n| The Heiress | 1949 | 1996 |\n| Hell’s Hinges | 1916 | 1994 |\n| Heroes All | 1920 | 2009 |\n| Hester Street | 1975 | 2011 |\n| High Noon | 1952 | 1989 |\n| High School | 1969 | 1991 |\n| Hindenburg Disaster Newsreel Footage | 1937 | 1997 |\n| His Girl Friday | 1940 | 1993 |\n| The Hitch-Hiker | 1953 | 1998 |\n| The Hole | 1963 | 2013 |\n| Hoop Dreams | 1994 | 2005 |\n| Hoosiers | 1986 | 2001 |\n| Hospital | 1970 | 1994 |\n| The Hospital | 1971 | 1995 |\n| Hot Dogs for Gauguin | 1972 | 2009 |\n| Hours for Jerome: Parts 1 and 2 | 1980-82 | 2012 |\n| The House I Live In | 1945 | 2007 |\n| The House in the Middle | 1954 | 2001 |\n| House of Usher | 1960 | 2005 |\n| House of Wax | 1953 | 2014 |\n| How Green Was My Valley | 1941 | 1990 |\n| How the West Was Won | 1962 | 1997 |\n| Humoresque | 1920 | 2015 |\n| The Hunters | 1957 | 2003 |\n| The Hustler | 1961 | 1997 |\n| I Am a Fugitive from a Chain Gang | 1932 | 1991 |\n| I Am Joaquin | 1969 | 2010 |\n| I, an Actress | 1977 | 2011 |\n| Imitation of Life | 1934 | 2005 |\n| Imitation of Life | 1959 | 2015 |\n| The Immigrant | 1917 | 1998 |\n| In a Lonely Place | 1950 | 2007 |\n| In Cold Blood | 1967 | 2008 |\n| In the Heat of the Night | 1967 | 2002 |\n| In the Land of the Head Hunters | 1914 | 1999 |\n| In the Street | 1948 | 2006 |\n| The Incredible Shrinking Man | 1957 | 2009 |\n| The Inner World of Aphasia | 1968 | 2015 |\n| Into the Arms of Strangers: Stories of the Kindertransport | 2000 | 2014 |\n| Intolerance | 1916 | 1989 |\n| Invasion of the Body Snatchers | 1956 | 1994 |\n| The Invisible Man | 1933 | 2008 |\n| The Iron Horse | 1924 | 2011 |\n| It | 1927 | 2001 |\n| It Happened One Night | 1934 | 1993 |\n| It's a Gift | 1934 | 2010 |\n| It's a Wonderful Life | 1946 | 1990 |\n| The Italian | 1915 | 1991 |\n| Jailhouse Rock | 1957 | 2004 |\n| Jam Session | 1942 | 2001 |\n| Jammin’ the Blues | 1944 | 1995 |\n| Jaws | 1975 | 2001 |\n| Jazz on a Summer’s Day | 1959 | 1999 |\n| The Jazz Singer | 1927 | 1996 |\n| Jeffries-Johnson World’s Championship Boxing Contest | 1910 | 2005 |\n| Jezebel | 1938 | 2009 |\n| John Henry and the Inky-Poo | 1946 | 2015 |\n| Johnny Guitar | 1954 | 2008 |\n| Judgment at Nuremberg | 1961 | 2013 |\n| The Jungle | 1967 | 2009 |\n| Kannapolis, N.C. | 1941 | 2004 |\n| The Kid | 1921 | 2011 |\n| Kidnapper's Foil | 1930s | 2012 |\n| Killer of Sheep | 1977 | 1990 |\n| The Killers | 1946 | 2008 |\n| King Kong | 1933 | 1991 |\n| King of Jazz | 1930 | 2013 |\n| King: A Filmed Record... Montgomery to Memphis | 1970 | 1999 |\n| The Kiss | 1896 | 1999 |\n| Kiss Me Deadly | 1955 | 1999 |\n| Knute Rockne, All American | 1940 | 1997 |\n| Koyaanisqatsi | 1983 | 2000 |\n| L.A. Confidential | 1997 | 2015 |\n| The Lady Eve | 1941 | 1994 |\n| Lady Helen’s Escapade | 1909 | 2004 |\n| Lady Windermere’s Fan | 1925 | 2002 |\n| Lambchops | 1929 | 1999 |\n| The Land Beyond the Sunset | 1912 | 2000 |\n| Lassie Come Home | 1943 | 1993 |\n| The Last Command | 1928 | 2006 |\n| The Last of the Mohicans | 1920 | 1995 |\n| The Last Picture Show | 1971 | 1998 |\n| Laura | 1944 | 1999 |\n| Lawrence of Arabia | 1962 | 1991 |\n| The Lead Shoes | 1949 | 2009 |\n| A League of Their Own | 1992 | 2012 |\n| The Learning Tree | 1969 | 1989 |\n| Let There Be Light | 1946 | 2010 |\n| Let’s All Go to the Lobby | 1957 | 2000 |\n| Letter from an Unknown Woman | 1948 | 1992 |\n| The Life and Death of 9413: a Hollywood Extra | 1927 | 1997 |\n| The Life and Times of Rosie the Riveter | 1980 | 1996 |\n| The Life of Emile Zola | 1937 | 2000 |\n| Little Big Man | 1970 | 2014 |\n| Little Caesar | 1930 | 2000 |\n| Little Fugitive | 1953 | 1997 |\n| Little Miss Marker | 1934 | 1998 |\n| Little Nemo | 1911 | 2009 |\n| The Living Desert | 1953 | 2000 |\n| Lonesome | 1928 | 2010 |\n| The Lost Weekend | 1945 | 2011 |\n| The Lost World | 1925 | 1998 |\n| Louisiana Story | 1948 | 1994 |\n| Love Finds Andy Hardy | 1938 | 2000 |\n| Love Me Tonight | 1932 | 1990 |\n| The Lunch Date | 1989 | 2013 |\n| Luxo Jr. | 1986 | 2014 |\n| M*A*S*H | 1970 | 1996 |\n| Mabel’s Blunder | 1914 | 2009 |\n| Magical Maestro | 1952 | 1993 |\n| The Magnificent Ambersons | 1942 | 1991 |\n| The Magnificent Seven | 1961 | 2013 |\n| Make Way for Tomorrow | 1937 | 2010 |\n| The Making of an American | 1920 | 2005 |\n| Malcolm X | 1992 | 2010 |\n| The Maltese Falcon | 1941 | 1989 |\n| The Man Who Shot Liberty Valance | 1962 | 2007 |\n| The Manchurian Candidate | 1962 | 1994 |\n| Manhatta | 1921 | 1995 |\n| Manhattan | 1979 | 2001 |\n| March of Time: Inside Nazi Germany | 1938 | 1993 |\n| The March | 1964 | 2008 |\n| Marian Anderson: the Lincoln Memorial Concert | 1939 | 2001 |\n| The Mark of Zorro | 1920 | 2015 |\n| The Mark of Zorro | 1940 | 2009 |\n| Martha Graham Dance Films | 2013 | |\n| Marty | 1955 | 1994 |\n| Mary Poppins | 1964 | 2013 |\n| Master Hands | 1936 | 1999 |\n| Matrimony’s Speed Limit | 1913 | 2003 |\n| The Matrix | 1999 | 2012 |\n| McCabe & Mrs. Miller | 1971 | 2010 |\n| Mean Streets | 1973 | 1997 |\n| Medium Cool | 1969 | 2003 |\n| Meet Me in St. Louis | 1944 | 1994 |\n| Melody Ranch | 1940 | 2002 |\n| Memphis Belle | 1944 | 2001 |\n| Men and Dust | 1940 | 2013 |\n| Meshes of the Afternoon | 1943 | 1990 |\n| The Middleton Family at the New York World’s Fair | 1939 | 2012 |\n| Midnight | 1939 | 2013 |\n| Midnight Cowboy | 1969 | 1994 |\n| Mighty Like a Moose | 1926 | 2007 |\n| Mildred Pierce | 1945 | 1996 |\n| The Miracle of Morgan’s Creek | 1944 | 2001 |\n| Miracle on 34th Street | 1947 | 2005 |\n| Miss Lulu Bett | 1922 | 2001 |\n| Modern Times | 1936 | 1989 |\n| Modesta | 1956 | 1998 |\n| Mom and Dad | 1944 | 2005 |\n| Moon Breath Beat | 1980 | 2014 |\n| Morocco | 1930 | 1992 |\n| Motion Painting No. 1 | 1947 | 1997 |\n| A MOVIE | 1958 | 1994 |\n| Mr. Smith Goes to Washington | 1939 | 1989 |\n| Mrs. Miniver | 1942 | 2009 |\n| Multiple SIDosis | 1970 | 2000 |\n| The Muppet Movie | 1979 | 2009 |\n| The Music Box | 1932 | 1997 |\n| The Music Man | 1962 | 2005 |\n| My Darling Clementine | 1946 | 1991 |\n| My Man Godfrey | 1936 | 1999 |\n| The Naked City | 1948 | 2007 |\n| The Naked Spur | 1953 | 1997 |\n| Nanook of the North | 1922 | 1989 |\n| Nashville | 1975 | 1992 |\n| National Lampoon’s Animal House | 1978 | 2001 |\n| National Velvet | 1944 | 2003 |\n| Naughty Marietta | 1935 | 2003 |\n| Navajo Film Themselves (Through Navajo Eyes) | 1966 | 2002 |\n| The Negro Soldier | 1944 | 2011 |\n| Network | 1976 | 2000 |\n| Newark Athlete | 1891 | 2010 |\n| Nicholas Brothers' Home Movies | 1930s-'40s | 2011 |\n| A Night at the Opera | 1935 | 1993 |\n| The Night of the Hunter | 1955 | 1992 |\n| Night of the Living Dead | 1968 | 1999 |\n| Ninotchka | 1939 | 1990 |\n| No Lies | 1973 | 2008 |\n| Norma Rae | 1979 | 2011 |\n| North By Northwest | 1959 | 1995 |\n| Nostalgia | 1971 | 2003 |\n| Notes on the Port of St. Francis | 1951 | 2013 |\n| Nothing But a Man | 1964 | 1993 |\n| Notorious | 1946 | 2006 |\n| Now, Voyager | 1942 | 2007 |\n| The Nutty Professor | 1963 | 2004 |\n| OffOn | 1968 | 2004 |\n| Oklahoma! | 1955 | 2007 |\n| The Old Mill | 1937 | 2015 |\n| On the Bowery | 1957 | 2008 |\n| On the Waterfront | 1954 | 1989 |\n| Once Upon a Time in the West | 1968 | 2009 |\n| One Flew Over the Cuckoo’s Nest | 1975 | 1993 |\n| One Froggy Evening | 1956 | 2003 |\n| One Survivor Remembers | 1995 | 2012 |\n| One Week | 1920 | 2008 |\n| Our Daily Bread | 1934 | 2015 |\n| Our Day | 1938 | 2007 |\n| Our Lady of the Sphere | 1969 | 2010 |\n| Out of the Past | 1947 | 1991 |\n| The Outlaw Josey Wales | 1976 | 1996 |\n| The Ox-Bow Incident | 1943 | 1998 |\n| Parable | 1964 | 2012 |\n| Pass the Gravy | 1928 | 1998 |\n| Paths of Glory | 1957 | 1992 |\n| Patton | 1970 | 2003 |\n| The Pawnbroker | 1965 | 2008 |\n| The Pearl | 1948 | 2002 |\n| Peege | 1972 | 2007 |\n| The Perils of Pauline | 1914 | 2008 |\n| Peter Pan | 1924 | 2000 |\n| The Phantom of the Opera | 1925 | 1998 |\n| The Philadelphia Story | 1940 | 1995 |\n| Pillow Talk | 1959 | 2009 |\n| The Pink Panther | 1963 | 2010 |\n| Pinocchio | 1940 | 1994 |\n| A Place in the Sun | 1951 | 1991 |\n| Planet of the Apes | 1968 | 2001 |\n| Please Don't Bury Me Alive! | 1976 | 2014 |\n| The Plow That Broke the Plains | 1936 | 1999 |\n| Point of Order | 1964 | 1993 |\n| The Poor Little Rich Girl | 1917 | 1991 |\n| Popeye the Sailor Meets Sindbad the Sailor | 1936 | 2004 |\n| Porgy and Bess | 1959 | 2011 |\n| Porky in Wackyland | 1938 | 2000 |\n| Portrait of Jason | 1967 | 2015 |\n| The Power and the Glory | 1933 | 2014 |\n| The Power of the Press | 1928 | 2005 |\n| Powers of Ten | 1978 | 1998 |\n| Precious Images | 1986 | 2009 |\n| Preservation of the Sign Language | 1913 | 2010 |\n| President McKinley Inauguration Footage | 1901 | 2000 |\n| Primary | 1960 | 1990 |\n| Princess Nicotine; or, The Smoke Fairy | 1909 | 2003 |\n| The Prisoner of Zenda | 1937 | 1991 |\n| The Producers | 1968 | 1996 |\n| Psycho | 1960 | 1992 |\n| The Public Enemy | 1931 | 1998 |\n| Pull My Daisy | 1959 | 1996 |\n| Pulp Fiction | 1994 | 2013 |\n| Punch Drunks | 1934 | 2002 |\n| Pups Is Pups | 1930 | 2004 |\n| Quasi at the Quackadero | 1975 | 2009 |\n| The Quiet Man | 1952 | 2013 |\n| Raging Bull | 1980 | 1990 |\n| Raiders of the Lost Ark | 1981 | 1999 |\n| A Raisin in the Sun | 1961 | 2005 |\n| Rear Window | 1954 | 1997 |\n| Rebel Without a Cause | 1955 | 1990 |\n| The Red Book | 1994 | 2009 |\n| Red Dust | 1932 | 2006 |\n| Red River | 1948 | 1990 |\n| Regeneration | 1915 | 2000 |\n| Reminiscences of a Journey to Lithuania | 1971-1972 | 2006 |\n| Republic Steel Strike Riot Newsreel Footage | 1937 | 1997 |\n| Return of the Secaucus 7 | 1980 | 1997 |\n| The Revenge of Pancho Villa | 1930-1936 | 2009 |\n| Ride the High Country | 1962 | 1992 |\n| The Right Stuff | 1983 | 2013 |\n| Rio Bravo | 1959 | 2014 |\n| Rip Van Winkle | 1896 | 1995 |\n| The River | 1938 | 1990 |\n| Road to Morocco | 1942 | 1996 |\n| Rocky | 1976 | 2006 |\n| The Rocky Horror Picture Show | 1975 | 2005 |\n| Roger & Me | 1989 | 2013 |\n| Roman Holiday | 1953 | 1999 |\n| Rose Hobart | 1936 | 2001 |\n| Rosemary's Baby | 1968 | 2014 |\n| Ruggles of Red Gap | 1935 | 2014 |\n| Sabrina | 1954 | 2002 |\n| Safety Last! | 1923 | 1994 |\n| Salesman | 1968 | 1992 |\n| Salomé | 1923 | 2000 |\n| Salt of the Earth | 1954 | 1992 |\n| Samsara: Death and Rebirth in Cambodia | 1990 | 2012 |\n| San Francisco Earthquake and Fire, April 18, 1906 | 1906 | 2005 |\n| Saturday Night Fever | 1977 | 2010 |\n| Saving Private Ryan | 1998 | 2014 |\n| Scarface | 1932 | 1994 |\n| Schindler’s List | 1993 | 2004 |\n| Scratch and Crow | 1995 | 2009 |\n| The Searchers | 1956 | 1989 |\n| Seconds | 1966 | 2015 |\n| Serene Velocity | 1970 | 2001 |\n| Sergeant York | 1941 | 2008 |\n| Seven Brides for Seven Brothers | 1954 | 2004 |\n| Seventh Heaven | 1927 | 1995 |\n| The Sex Life of the Polyp | 1928 | 2007 |\n| sex, lies, and videotape | 1989 | 2006 |\n| Shadow of a Doubt | 1943 | 1991 |\n| Shadows | 1959 | 1993 |\n| Shaft | 1971 | 2000 |\n| Shane | 1953 | 1993 |\n| The Shawshank Redemption | 1994 | 2015 |\n| She Done Him Wrong | 1933 | 1996 |\n| Sherlock Jr. | 1924 | 1991 |\n| Sherman’s March | 1986 | 2000 |\n| Shock Corridor | 1963 | 1996 |\n| Shoes | 1916 | 2014 |\n| The Shop Around the Corner | 1940 | 1999 |\n| Show Boat | 1936 | 1996 |\n| Show People | 1928 | 2003 |\n| Siege | 1940 | 2006 |\n| The Silence of the Lambs | 1991 | 2011 |\n| Singin' in the Rain | 1952 | 1989 |\n| Sink or Swim | 1990 | 2015 |\n| Sky High | 1922 | 1998 |\n| Slacker | 1991 | 2012 |\n| Snow White | 1933 | 1994 |\n| Snow White and the Seven Dwarfs | 1937 | 1989 |\n| So’s Your Old Man | 1926 | 2008 |\n| Some Like It Hot | 1959 | 1989 |\n| The Son of the Sheik | 1926 | 2003 |\n| Sons of the Desert | 1933 | 2012 |\n| The Sound of Music | 1965 | 2001 |\n| The Spook Who Sat by the Door | 1973 | 2012 |\n| St. Louis Blues | 1929 | 2006 |\n| Stagecoach | 1939 | 1995 |\n| Stand and Deliver | 1988 | 2011 |\n| A Star Is Born | 1954 | 2000 |\n| Star Wars | 1977 | 1989 |\n| Stark Love | 1927 | 2009 |\n| State Fair | 1933 | 2014 |\n| Steamboat Willie | 1928 | 1998 |\n| The Sting | 1973 | 2005 |\n| Stormy Weather | 1943 | 2001 |\n| The Story of G.I. Joe | 1945 | 2009 |\n| The Story of Menstruation | 1946 | 2015 |\n| Stranger Than Paradise | 1984 | 2002 |\n| A Streetcar Named Desire | 1951 | 1999 |\n| The Strong Man | 1926 | 2007 |\n| A Study in Reds | 1932 | 2009 |\n| Study of a River | 1996-1997 | 2010 |\n| Sullivan’s Travels | 1941 | 1990 |\n| Sunrise | 1927 | 1989 |\n| Sunset Boulevard | 1950 | 1989 |\n| Sweet Smell of Success | 1957 | 1993 |\n| Swing Time | 1936 | 2004 |\n| Symbiopsychotaxiplasm: Take One | 1968 | 2015 |\n| The T.A.M.I. Show | 1964 | 2006 |\n| Tabu | 1931 | 1994 |\n| Tacoma Narrows Bridge Collapse | 1940 | 1998 |\n| The Tall T | 1957 | 2000 |\n| Tarantella | 1940 | 2010 |\n| Tarzan and His Mate | 1934 | 2003 |\n| Taxi Driver | 1976 | 1994 |\n| The Tell-Tale Heart | 1953 | 2001 |\n| The Ten Commandments | 1956 | 1999 |\n| The Terminator | 1984 | 2008 |\n| Tess of the Storm Country | 1914 | 2006 |\n| Tevye | 1939 | 1991 |\n| Theodore Case Sound Test: Gus Visser and His Singing Duck | 1925 | 2002 |\n| There It Is | 1928 | 2004 |\n| They Call It Pro Football | 1966 | 2012 |\n| The Thief of Bagdad | 1924 | 1996 |\n| The Thin Blue Line | 1988 | 2001 |\n| The Thin Man | 1934 | 1997 |\n| The Thing from Another World | 1951 | 2001 |\n| Think of Me First as a Person | 1960-1975 | 2006 |\n| This Is Cinerama | 1952 | 2002 |\n| This Is Spinal Tap | 1984 | 2002 |\n| The Three Little Pigs | 1933 | 2007 |\n| Michael Jackson’s Thriller | 1983 | 2009 |\n| A Time for Burning | 1966 | 2005 |\n| A Time Out of War | 1954 | 2006 |\n| The Times of Harvey Milk | 1984 | 2012 |\n| Tin Toy | 1988 | 2003 |\n| To Be or Not to Be | 1942 | 1996 |\n| To Fly! | 1976 | 1995 |\n| To Kill a Mockingbird | 1962 | 1995 |\n| Tol’able David | 1921 | 2007 |\n| Tom, Tom, the Piper's Son | 1969-1971 | 2007 |\n| Tootsie | 1982 | 1998 |\n| Top Gun | 1986 | 2015 |\n| Top Hat | 1935 | 1990 |\n| Topaz | 1943-1945 | 1996 |\n| Touch of Evil | 1958 | 1993 |\n| Toy Story | 1995 | 2005 |\n| Traffic in Souls | 1913 | 2006 |\n| Trance and Dance in Bali | 1936-1939 | 1999 |\n| The Treasure of the Sierra Madre | 1948 | 1990 |\n| A Tree Grows in Brooklyn | 1945 | 2010 |\n| A Trip Down Market Street | 1906 | 2010 |\n| Trouble in Paradise | 1932 | 1991 |\n| Tulips Shall Grow | 1942 | 1997 |\n| Twelve O’Clock High | 1949 | 1998 |\n| Twentieth Century | 1934 | 2011 |\n| Two-Color Kodachrome Test Shots No. III | 1922 | 2012 |\n| Two-Lane Blacktop | 1971 | 2012 |\n| Uncle Tom's Cabin | 1914 | 2012 |\n| Under Western Stars | 1938 | 2009 |\n| Unforgiven | 1992 | 2004 |\n| Unmasked | 1917 | 2014 |\n| V-E Day +1 (May 9, 1945) | 1945 | 2014 |\n| Verbena tragica | 1939 | 1996 |\n| Vertigo | 1958 | 1989 |\n| A Virtuous Vamp | 1919 | 2013 |\n| War of the Worlds | 1953 | 2011 |\n| Water and Power | 1989 | 2008 |\n| The Way of Peace | 1947 | 2014 |\n| The Wedding March | 1928 | 2003 |\n| West Side Story | 1961 | 1997 |\n| Westinghouse Works 1904 | 1904 | 1998 |\n| What’s Opera, Doc? | 1957 | 1992 |\n| Where Are My Children? | 1916 | 1993 |\n| White Fawn’s Devotion | 1910 | 2008 |\n| White Heat | 1949 | 2003 |\n| Who’s Afraid of Virginia Woolf? | 1966 | 2013 |\n| Why Man Creates | 1968 | 2002 |\n| Why We Fight | 1943-1945 | 2000 |\n| Wild and Woolly | 1917 | 2002 |\n| Wild Boys of the Road | 1933 | 2013 |\n| The Wild Bunch | 1969 | 1999 |\n| Wild River | 1960 | 2002 |\n| Will Success Spoil Rock Hunter? | 1957 | 2000 |\n| Willy Wonka and the Chocolate Factory | 1971 | 2014 |\n| Winchester '73 | 1950 | 2015 |\n| The Wind | 1928 | 1993 |\n| Wings | 1927 | 1997 |\n| The Wishing Ring: an Idyll of Old England | 1914 | 2012 |\n| Within Our Gates | 1920 | 1992 |\n| The Wizard of Oz | 1939 | 1989 |\n| Woman of the Year | 1942 | 1999 |\n| A Woman Under the Influence | 1974 | 1990 |\n| The Women | 1939 | 2007 |\n| Woodstock | 1970 | 1996 |\n| Wuthering Heights | 1939 | 2007 |\n| Yankee Doodle Dandy | 1942 | 1993 |\n| Young Frankenstein | 1974 | 2003 |\n| Young Mr. Lincoln | 1939 | 2003 |\n| Zapruder Film | 1963 | 1994 |"
    }
  ],
  "argos_summary": "Michael J. Fox, now 64, continues to inspire fans as he reflects on his life and career during a recent screening of 'Back to the Future' in Southampton, New York. The actor, who has lived with Parkinson's disease since his diagnosis in 1991, discussed his journey, including the challenges he faces and his advocacy work through the Michael J. Fox Foundation, which has funded nearly $2 billion in Parkinson's research. Fox's resilience and positive outlook have made him a beloved figure, earning him the Presidential Medal of Freedom in recognition of his contributions to the fight against the disease.",
  "argos_id": "3E6CZP23W"
}