{
  "url": "https://www.independent.co.uk/news/treasury-department-republicans-washington-donald-trump-joe-biden-b2806449.html",
  "authorsByline": "Fatima Hussein",
  "articleId": "9f7c9bd3870a4075b5ed0d0d34edc2cd",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2025/07/26/06/China_US_Trade_Talks_04425.jpg?width=1200&auto=webp&crop=3%3A2",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T20:29:13+00:00",
  "addDate": "2025-08-12T20:42:01.473325+00:00",
  "refreshDate": "2025-08-12T20:42:01.473327+00:00",
  "score": 1.0,
  "title": "US national debt reaches a record $37 trillion, the Treasury Department reports",
  "description": "The U.S. government’s gross national debt has surpassed $37 trillion, setting a new record",
  "content": "The U.S. government’s gross national debt has surpassed $37 trillion, a record number that highlights the accelerating debt on America’s balance sheet and increased cost pressures on taxpayers.\n\nThe $37 trillion update is found in the latest Treasury Department report issued Tuesday which logs the nation's daily finances.\n\nThe national debt eclipsed $37 trillion years sooner than pre-pandemic projections. The Congressional Budget Office’s January 2020 projections had gross federal debt eclipsing $37 trillion after fiscal year 2030. But the debt grew faster than expected because of a multi-year COVID-19 pandemic starting in 2020 that shut down much of the U.S. economy, where the federal government borrowed heavily under then-President Donald Trump and former President Joe Biden to stabilize the national economy and support a recovery.\n\nAnd now, more government spending has been approved after Trump signed into law Republicans' tax cut and spending legislation earlier this year. The law set to add $4.1 trillion to the national debt over the next decade, according to Congressional Budget Office estimates.\n\nChair and CEO of the Peter G. Peterson Foundation, Michael Peterson said in a statement that government borrowing puts upward pressure on interest rates, “adding costs for everyone and reducing private sector investment. Within the federal budget, the debt crowds out important priorities and creates a damaging cycle of more borrowing, more interest costs, and even more borrowing.”\n\nWendy Edelberg, a senior fellow in Economic Studies at the Brookings Institution said Congress has a major role in setting in motion spending and revenue policy and the result of the Republicans' tax law \"means that we’re going to borrow a lot over the course of 2026, we’re going to borrow a lot over the course of 2027, and it’s just going to keep going.\"\n\nThe Government Accountability Office outlines some of the impacts of rising government debt on Americans — including higher borrowing costs for things like mortgages and cars, lower wages from businesses having less money available to invest, and more expensive goods and services.\n\nPeterson points out how the trillion-dollar milestones are “piling up at a rapid rate.”\n\nThe U.S. hit $34 trillion in debt in January 2024, $35 trillion in July 2024 and $36 trillion in November 2024. “We are now adding a trillion more to the national debt every 5 months,\" Peterson said. \"That’s more than twice as fast as the average rate over the last 25 years.”\n\nThe Joint Economic Committee estimates at the current average daily rate of growth an increase of another trillion dollars to the debt would be reached in approximately 173 days.\n\nMaya MacGuineas, president of the Committee for a Responsible Federal Budget said in a statement that “hopefully this milestone is enough to wake up policymakers to the reality that we need to do something, and we need to do it quickly.”",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/topic/republicans",
    "https://www.independent.co.uk/topic/treasury-department",
    "https://www.independent.co.uk/topic/donald-trump",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/topic/joe-biden",
    "https://www.independent.co.uk/topic/michael-peterson"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US national debt",
      "weight": 0.105458066
    },
    {
      "name": "rising government debt",
      "weight": 0.10496823
    },
    {
      "name": "gross federal debt",
      "weight": 0.101562575
    },
    {
      "name": "debt",
      "weight": 0.09822128
    },
    {
      "name": "more government spending",
      "weight": 0.08503
    },
    {
      "name": "more interest costs",
      "weight": 0.07713992
    },
    {
      "name": "government borrowing",
      "weight": 0.0769491
    },
    {
      "name": "higher borrowing costs",
      "weight": 0.07315496
    },
    {
      "name": "more borrowing",
      "weight": 0.07207587
    },
    {
      "name": "Congressional Budget Office",
      "weight": 0.070178345
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.98828125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97412109375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.9453125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.7607421875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.673828125
    }
  ],
  "sentiment": {
    "positive": 0.15279172,
    "negative": 0.5788868,
    "neutral": 0.26832154
  },
  "summary": "The US government's gross national debt has surpassed $37 trillion, a record number, according to a Treasury Department report. The debt grew faster than expected due to a multi-year COVID-19 pandemic in 2020, which shut down much of the U.S. economy and heavily borrowed heavily under then-President Donald Trump and former President Joe Biden to stabilize the national economy and support a recovery. The increase in debt has led to increased cost pressures on taxpayers and increases in interest rates and borrowing costs for things like mortgages and cars. The Congressional Budget Office's January 2020 projections had the gross federal debt eclipsing $37 billion after fiscal year 2030. The Peter G. Peterson Foundation CEO, Michael Peterson, highlighted the rapid growth of the debt and the increasing cost of government borrowing.",
  "shortSummary": "The US government's gross national debt surpassed $37 trillion, driven by rapid growth and increased borrowing costs, despite recent tax cut and spending increases.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "2bf31188064c44ab8e969f1a90e04080",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The U.S. gross national debt has exceeded $37 trillion, a significant increase accelerated by the COVID-19 pandemic and subsequent government spending measures. This milestone was reached earlier than expected, with projections indicating that the debt would not surpass this figure until after fiscal year 2030. Experts warn that rising debt levels will lead to higher borrowing costs, reduced private sector investment, and increased pressure on taxpayers, urging policymakers to take immediate action to address the situation.",
  "argos_id": "3ESOFBB5O"
}