{
  "url": "https://apnews.com/article/alaska-glacial-flooding-dam-0454d452237bbd81d5d32ce5fe25471f",
  "authorsByline": "",
  "articleId": "3b438c2ac3b54d8d8d99d2572a92094c",
  "source": {
    "domain": "apnews.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://dims.apnews.com/dims4/default/df099f2/2147483647/strip/true/crop/5184x2916+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fb1%2F580083856339b5393e7f85b3e9ad%2F57bba6537d2c4bd08b0bd6417c1db574",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:37:13+00:00",
  "addDate": "2025-08-12T18:47:03.057383+00:00",
  "refreshDate": "2025-08-12T18:47:03.057384+00:00",
  "score": 1.0,
  "title": "Ice dam at Alaska’s Mendenhall Glacier releases floodwater toward downstream homes",
  "description": "A huge basin of rainwater and snowmelt dammed by Alaska’s Mendenhall Glacier has started to release, sending a potentially record surge of flooding toward parts of Juneau in what has become an annual concern for residents.",
  "content": "A huge basin of rainwater and snowmelt dammed by Alaska’s Mendenhall Glacier has started to release, and officials on Tuesday urged residents in some parts of Juneau to evacuate ahead of what could be a record surge of floodwater downstream.\n\nOfficials in recent days have been warning people in the flood zone to be ready to evacuate. On Tuesday morning they confirmed water had started escaping the ice dam and flowing downstream, with flooding expected late Tuesday into Wednesday.\n\nFlooding from the basin has become an annual concern, and in recent years has swept away houses and swamped hundreds of homes.\n\nThe Mendenhall Glacier — a thinning, retreating glacier that is a major tourist attraction in southeast Alaska — acts as a dam for Suicide Basin, which fills each spring and summer with rainwater and snowmelt. The basin itself was left behind when a smaller glacier nearby retreated.\n\nWhen the water in the basin builds up enough pressure, it forces its way under or around the ice dam, entering Mendenhall Lake and eventually the Mendenhall River. Before the basin reached the limit of its capacity and began overtopping over the weekend, the water level was rising rapidly — as much as 4 feet (1.22 meters) per day during especially sunny or rainy days, according to the National Weather Service.\n\nThe threat of so-called glacier outburst flooding has troubled parts of Juneau since 2011. In some years, there has been limited flooding of streets or properties near the lake or river.\n\nBut 2023 and 2024 marked successive years of record flooding, with the river last August cresting at 15.99 feet (4.9 meters), about 1 foot (0.3 meters) over the prior record set a year earlier, and flooding extending farther into the Mendenhall Valley.\n\nLast year, nearly 300 residences were damaged.\n\nA large outburst can release up to 15 billion gallons of water, according to the University of Alaska Southeast and Alaska Climate Adaptation Science Center. That’s the equivalent of nearly 23,000 Olympic-size swimming pools. During last year’s flood, the flow rate in the rushing Mendenhall River was about half that of Niagara Falls, the researchers say.\n\nCity officials responded to concerns from property owners this year by working with state, federal and tribal entities to install a temporary levee along roughly 2.5 miles of riverbank in an attempt to guard against widespread flooding. The installation of about 10,000, four-foot (1.2-meter) tall barriers is intended to protect more than 460 properties from flood levels similar to last year, said Nate Rumsey, deputy director with the city’s engineering and public works department.\n\nThe U.S. Army Corps of Engineers is at the start of what’s expected to be a yearslong process of studying conditions in the region and examining options for a more permanent solution. The timeline has angered some residents, who say it’s unreasonable.\n\nOutburst floods are expected to continue as long as the Mendenhall Glacier acts as an ice dam to seal off the basin, which could span another 25 to 60 years, according to the university and science center researchers.\n\nAssociated Press writer Becky Bohrer in Juneau contributed to this report.",
  "medium": "Article",
  "links": [
    "https://apnews.com/article/trump-putin-alaska-meeting-ukraine-war-942638dc7d3b7b8e61698f8574bdc890",
    "https://apnews.com/article/juneau-alaska-flood-ice-dam-2216df650049dd41c2a1d17354ea187c",
    "https://apnews.com/article/alaska-glacier-dam-flooding-jokuhlaup-95f06f4e0d82445705d3126aac004f5a",
    "https://apnews.com/article/alaska-glacial-outburst-flooding-mendenall-adda278e6e9e1ec0f9bdcd778cf528d9",
    "https://apnews.com/article/juneau-alaska-glacial-dam-flood-41113277d75767d9b3bae33b111e5683",
    "https://apnews.com/article/juneau-tourism-mendenhall-glacier-recedes-281e736286abb62d7cee9c6bb6dc8dc9",
    "https://apnews.com/article/alaska-juneau-glacial-dam-flooding-781b1fad39fa1ce0f6800b1a47bfa3c1",
    "https://www.whatsapp.com/channel/0029Va7Tv2j59PwNEyqGCi1y",
    "https://apnews.com/article/russia-ukraine-war-putin-trump-summit-zelenskyy-a01a6dbae85b10cc710c48f1558c1401"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Last year",
      "weight": 0.08996879
    },
    {
      "name": "last year",
      "weight": 0.08996879
    },
    {
      "name": "recent years",
      "weight": 0.08510306
    },
    {
      "name": "Mendenhall Glacier",
      "weight": 0.084584884
    },
    {
      "name": "successive years",
      "weight": 0.08047537
    },
    {
      "name": "record flooding",
      "weight": 0.07841315
    },
    {
      "name": "Mendenhall River",
      "weight": 0.0763308
    },
    {
      "name": "Ice dam",
      "weight": 0.0745801
    },
    {
      "name": "widespread flooding",
      "weight": 0.07329994
    },
    {
      "name": "limited flooding",
      "weight": 0.07256632
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Weather"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.95263671875
    },
    {
      "name": "/News/Weather",
      "score": 0.8603515625
    },
    {
      "name": "/News/Local News",
      "score": 0.837890625
    },
    {
      "name": "/Travel & Transportation/Tourist Destinations/Other",
      "score": 0.392822265625
    }
  ],
  "sentiment": {
    "positive": 0.06492847,
    "negative": 0.68991435,
    "neutral": 0.24515717
  },
  "summary": "A large basin of rainwater and snowmelt from the Mendenhall Glacier in Alaska has started to release, leading to a potential record surge of floodwater downstream. Residents in some parts of Juneau have been urged to evacuate due to the potential for flooding. The glacier, which acts as a dam for the Suicide Basin, has been causing flooding that has destroyed hundreds of homes in recent years. The University of Alaska Southeast and Alaska Climate Adaptation Science Center estimates that a large outburst can release up to 15 billion gallons of water, equivalent to nearly 23,000 Olympic-size swimming pools. The U.S. Army Corps of Engineers is beginning a yearslong process of studying conditions in the region and exploring options for a permanent solution.",
  "shortSummary": "The Mendenhall Glacier is releasing floodwater from its basin, causing warnings for Juneau residents and potential long-term flooding.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6a2e7bf325d24a319a25a0d3a9c0ccce",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://apnews.com/article/juneau-tourism-mendenhall-glacier-recedes-281e736286abb62d7cee9c6bb6dc8dc9",
      "text": "Crammed with tourists, Alaska’s capital wonders what will happen as its magnificent glacier recedes\nCrammed with tourists, Alaska’s capital wonders what will happen as its magnificent glacier recedes\nJUNEAU, Alaska (AP) — Thousands of tourists spill onto a boardwalk in Alaska’s capital city every day from cruise ships towering over downtown. Vendors hawk shoreside trips and rows of buses stand ready to whisk visitors away, with many headed for the area’s crown jewel: the Mendenhall Glacier.\nA craggy expanse of gray, white and blue, the glacier gets swarmed by sightseeing helicopters and attracts visitors by kayak, canoe and foot. So many come to see the glacier and Juneau’s other wonders that the city’s immediate concern is how to manage them all as a record number are expected this year. Some residents flee to quieter places during the summer, and a deal between the city and cruise industry will limit how many ships arrive next year.\nBut climate change is melting the Mendenhall Glacier. It is receding so quickly that by 2050, it might no longer be visible from the visitor center it once loomed outside.\nThat’s prompted another question Juneau is only now starting to contemplate: What happens then?\n“We need to be thinking about our glaciers and the ability to view glaciers as they recede,” said Alexandra Pierce, the city’s tourism manager. There also needs to be a focus on reducing environmental impacts, she said. “People come to Alaska to see what they consider to be a pristine environment and it’s our responsibility to preserve that for residents and visitors.”\nThe glacier pours from rocky terrain between mountains into a lake dotted by stray icebergs. Its face retreated eight football fields between 2007 and 2021, according to estimates from University of Alaska Southeast researchers. Trail markers memorialize the glacier’s backward march, showing where the ice once stood. Thickets of vegetation have grown in its wake.\nWhile massive chunks have broken off, most ice loss has come from the thinning due to warming temperatures, said Eran Hood, a University of Alaska Southeast professor of environmental science. The Mendenhall has now largely receded from the lake that bears its name.\nScientists are trying to understand what the changes might mean for the ecosystem, including salmon habitat.\nThere are uncertainties for tourism, too.\nMost people enjoy the glacier from trails across Mendenhall Lake near the visitor center. Caves of dizzying blues that drew crowds several years ago have collapsed and pools of water now stand where one could once step from the rocks onto the ice.\nManoj Pillai, a cruise ship worker from India, took pictures from a popular overlook on a recent day off.\n“If the glacier is so beautiful now, how would it be, like, 10 or 20 years before? I just imagine that,” he said.\nOfficials with the Tongass National Forest, under which the Mendenhall Glacier Recreation Area falls, are bracing for more visitors over the next 30 years even as they contemplate a future when the glacier slips from casual view.\nThe agency is proposing new trails and parking areas, an additional visitor center and public use cabins at a lakeside campground. Researchers do not expect the glacier to disappear completely for at least a century.\n“We did talk about, ‘Is it worth the investment in the facilities if the glacier does go out of sight?’” said Tristan Fluharty, the forest’s Juneau district ranger. “Would we still get the same amount of visitation?”\nA thundering waterfall that is a popular place for selfies, salmon runs, black bears and trails could continue attracting tourists when the glacier is not visible from the visitor center, but “the glacier is the big draw,” he said.\nAround 700,000 people are expected to visit this year, with about 1 million projected by 2050.\nOther sites offer a cautionary tale. Annual visitation peaked in the 1990s at around 400,000 to the Begich, Boggs Visitor Center, southeast of Anchorage, with the Portage Glacier serving as a draw. But now, on clear days, a sliver of the glacier remains visible from the center, which was visited by about 30,000 people last year, said Brandon Raile, a spokesperson with the Chugach National Forest, which manages the site. Officials are discussing the center’s future, he said.\n“Where do we go with the Begich, Boggs Visitor Center?” Raile said. “How do we keep it relevant as we go forward when the original reason for it being put there is not really relevant anymore?”\nAt the Mendenhall, rangers talk to visitors about climate change. They aim to “inspire wonder and awe but also to inspire hope and action,” said Laura Buchheit, the forest’s Juneau deputy district ranger.\nAfter pandemic-stunted seasons, about 1.6 million cruise passengers are expected in Juneau this year, during a season stretching from April through October.\nThe city, nestled in a rainforest, is one stop on what are generally week-long cruises to Alaska beginning in Seattle or Vancouver, British Columbia. Tourists can leave the docks and move up the side of a mountain in minutes via a popular tram, see bald eagles perch on light posts and enjoy a vibrant Alaska Native arts community.\nOn the busiest days, about 20,000 people, equal to two-thirds of the city’s population, pour from the boats.\nCity leaders and major cruise lines agreed to a daily five-ship limit for next year. But critics worry that won’t ease congestion if the vessels keep getting bigger. Some residents would like one day a week without ships. As many as seven ships a day have arrived this year.\nJuneau Tours and Whale Watch is one of about two dozen companies with permits for services like transportation or guiding at the glacier. Serene Hutchinson, the company’s general manager, said demand has been so high that she neared her allotment halfway through the season. Shuttle service to the glacier had to be suspended, but her business still offers limited tours that include the glacier, she said.\nOther bus operators are reaching their limits, and tourism officials are encouraging visitors to see other sites or get to the glacier by different means.\nLimits on visitation can benefit tour companies by improving the experience rather than having tourists “shoehorned” at the glacier, said Hutchinson, who doesn’t worry about Juneau losing its luster as the glacier recedes.\n“Alaska does the work for us, right?” she said. “All we have to do is just kind of get out of the way and let people look around and smell and breathe.”\nPierce, Juneau’s tourism manager, said discussions are just beginning around what a sustainable southeast Alaska tourism industry should look like.\nIn Sitka, home to a slumbering volcano, the number of cruise passengers on a day earlier this summer exceeded the town’s population of 8,400, overwhelming businesses, dragging down internet speeds and prompting officials to question how much tourism is too much.\nJuneau plans to conduct a survey that could guide future growth, such as building trails for tourism companies.\nKerry Kirkpatrick, a Juneau resident of nearly 30 years, recalls when the Mendenhall’s face was “long across the water and high above our heads.” She called the glacier a national treasure for its accessibility and noted an irony in carbon-emitting helicopters and cruise ships chasing a melting glacier. She worries the current level of tourism isn’t sustainable.\nAs the Mendenhall recedes, plants and animals will need time to adjust, she said.\nSo will humans.\n“There’s too many people on the planet wanting to do the same things,” Kirkpatrick said. “You don’t want to be the person who closes the door and says, you know, ‘I’m the last one in and you can’t come in.’ But we do have to have the ability to say, ‘No, no more.’”"
    },
    {
      "url": "https://apnews.com/article/juneau-alaska-flood-ice-dam-2216df650049dd41c2a1d17354ea187c",
      "text": "Residents in Alaska capital clean up swamped homes after an ice dam burst and unleashed a flood\nResidents in Alaska capital clean up swamped homes after an ice dam burst and unleashed a flood\nJUNEAU, Alaska (AP) — In her yard under the blazing sun Wednesday, Debbie Penrose Fischer leafed through a water-logged cookbook with sentimental value that she hoped to salvage but doubted she could. Nearby, friends helped carry boxes out of her family’s garage, which was inundated this week after a lake dammed by the Mendenhall Glacier let rip — sending floodwaters into neighborhoods like hers that never had to worry about that threat before.\n“We’re blessed,” she said. “Nobody was hurt. Lots of things I love are gone, and I don’t like that. But it’s just stuff, you know?”\nAbout 100 homes and some businesses were damaged by rapidly rising floodwaters that crested around 3:15 a.m. Tuesday, according to initial estimates. In some areas, cars floated as people scrambled to evacuate. Fischer’s daughter, Alyssa, who lives across the street, said the water in the road at one point reached her hips.\nThe waters began receding Tuesday, and water levels had returned to the normal range for this time of year by Wednesday afternoon, the National Weather Service said.\nThe flooding happens because a smaller glacier near Mendenhall Glacier had retreated — a casualty of the warming climate — and left a basin that fills with rainwater and snowmelt each spring and summer. When the water creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier and enters Mendenhall Lake and eventually the Mendenhall River, as it did this week.\nSince 2011, the phenomenon has at times flooded streets or homes near the lake and river, and last year floodwaters devoured large chunks of the riverbank, inundated homes and sent at least one residence crashing into the raging river.\nBut the extent of this week’s flooding was unprecedented, officials said, and left residents shaken as they tried to dry out furniture, books and other belongings during a stretch of warm, sunny weather. On Wednesday, piles of garbage bags and other items — wood, boxes, sodden insulation and carpeting — dotted the curbs. A street sweeper was tackling the gray, silty grime the retreating waters had left behind.\nWhile the basin was created by glacial retreat, climate change plays almost no role in the the year-to-year variations in the volume of the flooding in Juneau, said Eran Hood, a professor of environmental science at the University of Alaska Southeast who has studied the Mendenhall Glacier for years.\n“It’s very clear that these floods will persist for some amount of time, again, on a sort of decadal timescale into the future,” he said. “But there are so many different competing factors that work to either increase the volume of the flood or decrease the volume of the flood that we need to be able to quantify that it’s difficult to say how large floods will be in the future without much more detailed modeling of the glacier dynamics.”\nAt some point, Mendenhall Glacier will retreat and thin enough that it can no longer act as a dam, Hood said.\nThe flooding is a reminder of the global risk from bursting snow-and-ice dams — a phenomenon called a jökulhlaup, which is little known in the U.S. but could threaten about 15 million people around the world.\nJuneau, a city of about 30,000 people in southeast Alaska, is reachable only by plane or boat. It’s the height of the tourist season, and the city is already struggling with a housing shortage that could limit temporary accommodations available for flood victims that might need them. Juneau also has limited rental car agencies for those whose vehicles were swamped.\nThe Mendenhall River crested at 15.99 feet (4.9 meters), a new record, topping the level during last year’s flood by about a foot, and the water reached farther into the Mendenhall Valley, officials said. The city said the water reached some homes outside expected flood areas. The valley is roughly a 15 to 20 minute drive from downtown Juneau.\nAlyssa Fischer said that when she went to sleep Monday night, she didn’t think she had to worry about flooding where she lives. Her dad woke her up hours later via FaceTime and alerted her to rising water outside. She helped him move his cars to higher ground, as well as her quails, before evacuating with her 4- and 8-year-old children and pets to a shelter at a local school. She said she noticed the license plate on her truck was bent from the water current.\nOn Wednesday she was relieved that damage to her property was mostly limited to a crawl space and the garage. She had boxes, rugs and other items in her yard and had a fan going to help dry out the garage.\nBut she worries about the future. When she bought the house earlier this year, it was a selling point for her that it was not on the river. After they returned home Tuesday, her 8-year-old daughter asked when the floodwaters would return.\n“I think next year around this time, I’ll be stressed out for sure,” she said. She said she would like to see community meetings about addressing future floods events."
    },
    {
      "url": "https://apnews.com/article/trump-putin-alaska-meeting-ukraine-war-942638dc7d3b7b8e61698f8574bdc890",
      "text": "What to know about the Putin-Trump summit in Alaska\nThe U.S.-Russia summit in Alaska is happening at a site where East meets West — quite literally — in a place familiar to both countries as a Cold War front line of missile defense, radar outposts and intelligence gathering.\nWhether it can lead to a deal to produce peace in Ukraine more than 3 1/2 years after Moscow’s invasion remains to be seen.\nHere’s what to know about the meeting between Russian President Vladimir Putin and U.S. President Donald Trump, the first summit in four years:\nWhen and where is it taking place?\nThe summit will take place Friday in Alaska, although where in the state is still unknown.\nIt will be Putin’s first trip to the United States since 2015, for the U.N. General Assembly in New York. Since the U.S. is not a member of the International Criminal Court, which in 2023 issued a warrant for Putin on war crimes accusations, it is under no obligation to arrest him.\nIs Zelenskyy going?\nBoth countries confirmed a meeting between only Putin and Trump, even though there were initial suggestions that Ukrainian President Volodymyr Zelenskyy might be part of it. But the Kremlin has long pushed back against Putin meeting Zelenskyy -– at least until a peace deal is reached by Russia and Ukraine and was ready to be signed.\nPutin said last week he wasn’t against meeting Zelenskyy “but certain conditions need to be created” for it to happen and were “still a long way off.”\nThat raised fears about excluding Ukraine from negotiations. Ukrainian officials last week talked with European allies, who stressed that peace cannot be achieved without Kyiv’s involvement.\nWhat’s Alaska’s role in Russian history?\nIt will be the first visit by a Russian leader to Alaska, even though it was part of the czarist empire until 1867, the state news agency Tass said.\nAlaska was colonized by Russia starting from the 18th century until Czar Alexander II sold it to the United States in 1867 for $7.2 million. When it was found to contain vast resources, it was seen as a naïve deal that generated remorse and self-reproach.\nAfter the USSR’s collapse, Alaska was a subject of nostalgia and jokes for Russians. One popular song in the 1990s went: “Don’t play the fool, America … give back our dear Alaska land.”\nSam Greene of King’s College London said on X the symbolism of Alaska as the site of a summit about Ukraine was “horrendous — as though designed to demonstrate that borders can change, land can be bought and sold.”\nWhat’s the agenda?\nTrump has appeared increasingly exasperated with Putin over Russia’s refusal to halt the bombardment of Ukrainian cities. Kyiv has agreed to a ceasefire, insisting on a truce as a first step toward peace.\nMoscow presented ceasefire conditions that are nonstarters for Zelenskyy, such as withdrawing troops from the four regions Russia illegally annexed in 2022, halting mobilization efforts, or freezing Western arms deliveries. For a broader peace, Putin demands Kyiv cede the annexed regions, even though Russia doesn’t fully control them, and Crimea, renounce a bid to join NATO, limit the size of its armed forces and recognize Russian as an official language along with Ukrainian.\nZelenskyy insists any peace deals must include robust security guarantees for Ukraine to protect it from future Russian aggression.\nPutin has warned Ukraine it will face tougher conditions for peace as Russian troops forge into other regions to build what he described as a “buffer zone.” Some observers suggested Russia could trade those recent gains for territory still under Ukrainian control in the four annexed regions annexed by Moscow.\nZelenskyy said Saturday that “Ukrainians will not give their land to the occupier.”\nBut Trump said Monday: “There’ll be some land swapping going on. I know that through Russia and through conversations with everybody. To the good, for the good of Ukraine. Good stuff, not bad stuff. Also, some bad stuff for both.”\nWhat are expectations?\nPutin sees a meeting with Trump as a chance to cement Russia’s territorial gains, keep Ukraine out of NATO and prevent it from hosting any Western troops so Moscow can gradually pull the country back into its orbit.\nHe believes time is on his side as Ukrainian forces are struggling to stem Russian advances along the front line amid swarms of Moscow’s missiles and drones battering the country.\nThe meeting is a diplomatic coup for Putin, isolated since the invasion. The Kremlin sought to portray renewed U.S. contacts as two superpowers looking to resolve various global problems, with Ukraine being just one.\nUkraine and its European allies are concerned a summit without Kyiv could allow Putin to get Trump on his side and force Ukraine into concessions.\n“Any decisions that are without Ukraine are at the same time decisions against peace,” Zelenskyy said. “They will not bring anything. These are dead decisions. They will never work.”\nEuropean officials echoed that.\n“As we work towards a sustainable and just peace, international law is clear: All temporarily occupied territories belong to Ukraine,” European Union foreign policy chief Kaja Kallas said. “A sustainable peace also means that aggression cannot be rewarded.”\nNATO Secretary General Mark Rutte said Sunday he believed Trump was “making sure that Putin is serious, and if he is not, then it will stop there.”\n“If he is serious, then from Friday onwards, the process will continue. Ukraine getting involved, the Europeans being involved,” Rutte added.\nSince last week, Putin spoke to Chinese leader Xi Jinping, Indian Prime Minister Narendra Modi, Brazilian President Luiz Inácio Lula da Silva, as well as the leaders of South Africa, Kazakhstan, Uzbekistan, Belarus and Kyrgyzstan, the Kremlin said.\nThat suggested Putin perhaps wanted to brief Russia’s most important allies about a potential settlement, said pro-Kremlin analyst Sergei Markov.\n—-\nAssociated Press writer Lorne Cook in Brussels contributed."
    },
    {
      "url": "https://apnews.com/article/russia-ukraine-war-putin-trump-summit-zelenskyy-a01a6dbae85b10cc710c48f1558c1401",
      "text": "Zelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations\nZelenskyy rejects formally ceding Ukrainian territory, says Kyiv must be part of any negotiations\nKYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskyy on Saturday rejected the idea that his country would give up land to end the war with Russia after U.S. President Donald Trump suggested a peace deal could include “some swapping of territories.”\nZelenskyy said Ukraine “will not give Russia any awards for what it has done” and that “Ukrainians will not give their land to the occupier.”\nLater Saturday, European and Ukrainian officials met with U.S. Vice President JD Vance in England to discuss how to end the more than three-year war. The talks came after Trump said he would meet with Vladimir Putin even if the Russian leader would not meet with Zelenskyy.\nRepresentatives from the UK, France, Germany, Italy, Finland and Poland attended the meeting in Kent, Zelenskyy said in a post on X, calling the talks constructive.\n“I have not heard any partners express doubts about America’s ability to ensure that the war ends,” Zelenskyy said. “The President of the United States has the levers and the determination.”\nEarlier in the day, Zelenskyy dismissed the planned Trump-Putin summit, scheduled for Friday in Alaska, warning that any negotiations to end Europe’s biggest conflict since World War II must include Kyiv.\n“Any decisions that are without Ukraine are at the same time decisions against peace. They will not bring anything. These are dead decisions. They will never work,” he said.\nUkrainian officials previously told The Associated Press privately that Kyiv would be amenable to a peace deal that would de facto recognize Ukraine’s inability to regain lost territories militarily.\nThe Trump-Putin summit\nThe Trump-Putin meeting may prove pivotal in a war that began when Russia invaded its western neighbor and has led to tens of thousands of deaths, although there’s no guarantee it will stop the fighting since Moscow and Kyiv remain far apart on their conditions for peace.\n“It seems entirely logical for our delegation to fly across the Bering Strait simply, and for such an important and anticipated summit of the leaders of the two countries to be held in Alaska,” Putin’s foreign affairs adviser, Yuri Ushakov, said Saturday in a statement posted to the Kremlin’s news channel.\nThe president of the European Union and leaders of France, Germany, Italy, Poland, Finland and the UK issued a joint statement late Saturday in support of Ukraine and ending the war.\n“We are convinced that only an approach that combines active diplomacy, support to Ukraine and pressure on the Russian Federation to end their illegal war can succeed,” the statement said.\nIn his comments at the White House Friday, Trump gave no details on the “swapping of territories.” Analysts, including some close to the Kremlin, have suggested that Russia could offer to give up territory it controls outside of the four regions it claims to have annexed.\nTrump said his meeting with Putin would come before any sit-down discussion involving Zelenskyy. His announcement that he planned to host one of America’s adversaries on U.S. soil broke with expectations that they’d meet in a third country.\nNigel Gould-Davies, a senior fellow for Russia and Eurasia at the International Institute for Strategic Studies, told the AP that the “symbology” of holding the summit in Alaska was clear and that the location “naturally favors Russia.”\n“It’s easy to imagine Putin making the point. … We once had this territory and we gave it to you, therefore Ukraine had this territory and now should give it to us,” he said, referring to the 1867 transaction known as the Alaska Purchase when Russia sold Alaska to the United States for $7.2 million.\nReactions in Kyiv\nOn the streets of Kyiv, reactions to the idea of Ukraine ceding territory to Russia ranged from skepticism to quiet resignation.\n“It may not be capitulation, but it would be a loss,” said Ihor Usatenko, a 67-year-old pensioner, who said he would consider ceding territory “on condition for compensation and, possibly, some reparations.”\nAnastasia Yemelianova, 31, said she was torn: “Honestly, I have two answers to that question. The first is as a person who loves her country. I don’t want to compromise within myself,” she told the AP. “But seeing all these deaths and knowing that my mother is now living in Nikopol under shelling and my father is fighting, I want all this to end as soon as possible.”\nSvitlana Dobrynska, whose son died fighting, rejected outright concessions but supported halting combat to save lives.\n“We don’t have the opportunity to launch an offensive to recapture our territories,” the 57-year-old pensioner said, “But to prevent people from dying, we can simply stop military operations, sign some kind of agreement, but not give up our territories.”\nUltimatums and sanctions\nBefore Trump announced the summit, his efforts to pressure Russia to stop the fighting had delivered no progress.\nTrump had moved up an ultimatum to impose additional sanctions on Russia and introduce secondary tariffs targeting countries that buy Russian oil if the Kremlin did not move toward a settlement. The deadline was Friday. The White House did not answer questions Saturday about possible sanctions.\nThe Kremlin’s bigger army is slowly advancing deeper into Ukraine at great cost in troops and armor while it relentlessly bombards Ukrainian cities.\nRussia and Ukraine trade attacks\nOn Saturday, two people died and 16 were wounded when a Russian drone hit a minibus in the suburbs of the Ukrainian city of Kherson, regional Gov. Oleksandr Prokudin said. Two others died after a Russian drone struck their car in the Zaporizhzhia region, according to regional Gov. Ivan Fedorov.\nUkraine’s air force said it intercepted 16 of the 47 Russian drones launched overnight, while 31 drones hit targets across 15 different locations. It also said it shot down one of the two missiles Russia deployed.\nRussia’s Defense Ministry said its air defenses shot down 97 Ukrainian drones over Russia and the Black Sea overnight and 21 more Saturday morning.\n___\nThe final line of this story has been corrected to say that 97 drones were shot down over Russia overnight and 21 on Saturday morning.\n___\nMorton reported from London. Associated Press reporter Michelle L. Price contributed from Washington.\n___\nFollow the AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine."
    },
    {
      "url": "https://apnews.com/article/juneau-alaska-glacial-dam-flood-41113277d75767d9b3bae33b111e5683",
      "text": "An estimated 290 residences damaged by flooding from lake dammed by Alaska glacier, officials say\nJUNEAU, Alaska (AP) — Roughly 290 residences in Alaska’s capital city were damaged last week by flooding from a lake dammed by the Mendenhall Glacier, officials said.\nIn addition to the homes and apartment and condo units, at least two businesses were damaged, Deputy City Manager Robert Barr said in an email Monday.\nThe threat of this kind of flooding has become a yearly concern in parts of Juneau, though the extent of last week’s flooding, which reached farther into the Mendenhall Valley, was unprecedented, officials have said.\nThe flooding occurs because a smaller glacier near Mendenhall Glacier retreated, leaving a basin that fills with rainwater and snowmelt each spring and summer. When the water creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier, entering Mendenhall Lake and eventually the Mendenhall River.\nSince 2011, the phenomenon has sporadically flooded streets or homes near the lake and river, but the impacts of flooding this year and last were significant. The river crested early last Tuesday at 15.99 feet (4.9 meters), the National Weather Service said, beating the prior record set a year earlier by about 1 foot (0.3 meters).\nThe state has an assistance program that can help with costs to repair damaged homes, with a maximum for an individual or family of $21,250. Other programs including aid to replace essential items, like clothing, and temporary housing assistance for residents displaced by the flooding. Barr did not have an estimate of how many people will need such aid."
    },
    {
      "url": "https://apnews.com/article/alaska-glacial-outburst-flooding-mendenall-adda278e6e9e1ec0f9bdcd778cf528d9",
      "text": "Residents in Alaska’s capital city prepare for possible glacial flooding\nResidents in Alaska’s capital city prepare for possible glacial flooding\nANCHORAGE, Alaska (AP) — Residents and officials in Alaska’s capital city prepared Friday for the possibility of glacial flooding that in past years has swept away houses, swamped several hundred homes and eroded the river fed by the popular Mendenhall Glacier.\nThe state, federal, city and tribal officials who would run an incident command center during any flooding held a briefing to outline steps and to issue pleas to the public to be prepared.\nThe threat of so-called glacier outburst flooding has become an annual concern in parts of Juneau since 2011. The Mendenhall Glacier — a thinning, retreating glacier that is a major tourist attraction in southeast Alaska — acts as a dam for a basin that fills each spring and summer with rainwater and snowmelt. The basin itself was left behind when a smaller, nearby glacier retreated.\nWhen the water in the basin creates enough pressure, it forces its way under or around the ice dam created by the Mendenhall Glacier, entering Mendenhall Lake and eventually the Mendenhall River.\nThe water level in the basin as of Friday stood at 1,353 feet (412 meters) and continues to rise, said Nicole Ferrin with the National Weather Service. It’s just 15 feet (1.5 meters) from topping the ice dam.\nThe basin has been rising at an unpredictable rate, so there is no way to pinpoint when water would go over the top, she said.\n“Some days when there’s no rain, it only rises by a foot (0.30 meters),” she said. “Other days when there is heavy rain or a lot of sunshine, it rises by 4 feet (1.22 meters), so it’s a variable.”\nIn some years, there has been limited flooding of streets or properties near the lake or river. But 2023 and 2024 marked successive years of record flooding, with the river last August cresting at 15.99 feet (4.9 meters), about 1 foot (0.3 meters) over the prior record set a year earlier, and flooding extending farther into the Mendenhall Valley.\nLast year, nearly 300 residences were damaged in the flooding.\nCapital City Fire/Rescue Chief Rich Etheridge warned people to stay away during flood stages because logs and other debris in the river can put would-be rescuers “at extreme peril.”\nOnce the water tops the dam, the city will set up a hotline where people can get information.\nA large flood event can release up to 15 billion gallons of water, according to the University of Alaska Southeast and Alaska Climate Adaptation Science Center. That’s the equivalent of nearly 23,000 Olympic-size swimming pools. During last year’s flood, the flow rate in the rushing Mendenhall River was about half that of Niagara Falls, the researchers say.\nCity officials responded to concerns from property owners this year by working with state, federal and tribal entities to install a temporary levee along roughly 2.5 miles of riverbank in an attempt to guard against widespread flooding. The installation of about 10,000, four-foot (1.2-meter) tall barriers is intended to protect more than 460 properties from flood levels similar to last year, said Nate Rumsey, deputy director with the city’s engineering and public works department.\nThe U.S. Army Corps of Engineers is at the start of what’s expected to be a yearslong process of studying conditions in the region and examining options for a more permanent solution. The timeline has angered some residents, who say it’s unreasonable.\nOutburst floods are expected to continue as long as the Mendenhall Glacier acts as an ice dam to seal off the basin, which could span another 25 to 60 years, according to the university and science center researchers.\n___\nAssociated Press writer Becky Bohrer in Juneau contributed to this report."
    },
    {
      "url": "https://apnews.com/article/alaska-juneau-glacial-dam-flooding-781b1fad39fa1ce0f6800b1a47bfa3c1",
      "text": "Picturesque glacier releases water down a river in Alaska. More than 100 homes are damaged\nPicturesque glacier releases water down a river in Alaska. More than 100 homes are damaged\nJUNEAU, Alaska (AP) — An outburst of flooding from a lake dammed by Juneau’s Mendenhall Glacier damaged at least an estimated 100 homes in what has become a perennial hazard for nearby neighborhoods.\nThe lake formed in a basin that was left behind when a nearby glacier retreated. It fills with rainwater and snowmelt during the spring and summer and at a certain point builds enough pressure to force its way out through channels it carves beneath Mendenhall Glacier. Since 2011, the phenomenon has at times caused flooding of streets or homes near Mendenhall Lake and Mendenhall River.\nLast year, a two-story home was swept away by raging floodwaters that also undermined a condo building, prompting some residents to reinforce the riverbank near their properties. Monday night’s damage was less dramatic but more widespread: Local leaders adopted an emergency resolution saying hundreds of homes were affected, including some outside expected flood areas.\nDeputy City Manager Robert Barr said Tuesday that officials were still trying to get a handle on the extent of the damage.\n“I would say over a hundred homes right now,” he wrote in an email. “I’m less certain about multiple hundreds. Either still possible.”\nThe National Weather Service said the Mendenhall River crested early Tuesday at 15.99 feet (4.9 meters), higher than the 14.97-foot (4.6-meter) crest from last year’s ferocious flood, which devoured huge chunks of riverbank.\nThis year’s flooding reached farther into Mendenhall Valley. There was “a lot more water in the valley, on the streets, in people’s homes,” Barr said. Some streets at one point had 3 to 4 feet (0.9 to 1.2 meters) of water, possibly more, he said.\nHowever, there appeared to be less erosion than last year, he said.\nNo injuries were reported. Gov. Mike Dunleavy issued a disaster declaration to aid the response and recovery.\nThe river level dropped quickly Tuesday.\nThe weather service late last week said the water level in the basin had reached the top of the glacier and warned people to prepare for flooding.\nThe city also had urged residents to have an evacuation plan and to spend Monday night elsewhere. The city opened an emergency shelter, and about 40 people were there overnight, Barr said.\nHe credited increased monitoring by agencies and use of technology with helping provide more preparation time this year."
    },
    {
      "url": "https://apnews.com/article/alaska-glacier-dam-flooding-jokuhlaup-95f06f4e0d82445705d3126aac004f5a",
      "text": "Bursting ice dam in Alaska highlights risks of glacial flooding around the globe\nBursting ice dam in Alaska highlights risks of glacial flooding around the globe\nJUNEAU, Alaska (AP) — The gray, two-story home with white trim toppled and slid, crashing into the river below as rushing waters carried off a bobbing chunk of its roof. Next door, a condo building teetered on the edge of the bank, its foundation already having fallen away as erosion undercut it.\nThe destruction came over the weekend as a glacial dam burst in Alaska’s capital, swelling the levels of the Mendenhall River to an unprecedented degree. The bursting of such snow-and-ice dams is a phenomenon called a jökuhlaup, and while it’s relatively little-known in the U.S., researchers say such glacial floods could threaten about 15 million people around the world.\n“We sat down there and were just watching it, and all of a sudden trees started to fall in,” Amanda Arra, whose house continued hanging precariously over the river bank Monday, told the Juneau Empire. “And that’s when I started to get concerned. Tree after tree after tree.”\nThe flooding in Juneau came from a side basin of the awe-inspiring Mendenhall Glacier, which acts as a dam for the rain and melted snow that collect in the basin during the spring and summer. Eventually, the water gushed out from under the glacier and into Mendenhall Lake, from which it flowed down the Mendenhall River.\nWater released from the basin has caused sporadic flooding since 2011. But typically, the water releases more slowly, over a number of days, said Eran Hood, a University of Alaska Southeast professor of environmental science.\nSaturday’s event was astonishing because the water gushed so quickly, raising the river’s flows to about 1 1/2 times the highest previously recorded — so much that it washed away sensors that researchers had placed to study the glacial outburst phenomenon.\n“The flows were just way beyond what anything in the river could withstand,” Hood said.\nTwo homes were completely lost and a third partially so, Robert Barr, Juneau’s deputy city manager, said Monday. There were no reports of injuries or fatalities.\nEight buildings, including those that fell into the water, have been condemned, but some might be able to be salvaged by substantial repairs or bank stabilization, he said. Others suffered lesser damage.\nWhile climate change is melting the Mendenhall and other glaciers around the world, its relationship to such floods is complicated, scientists say.\nThe basin where the rain and meltwater collect was formerly covered by the Suicide Glacier, which used to flow into the Mendenhall Glacier, contributing ice to it. But the Suicide Glacier has retreated as the climate warms, leaving a lake in the basin dammed by the Mendenhall.\nWhile that part can be linked to climate change, the unpredictable ways that those waters can burst through the ice dams and create floods downstream is not, they said.\n“Climate change caused the phenomenon, but not the individual floods,” Hood said.\nThe variability in the timing and volume of such floods makes it hard to prepare for them, said Celeste Labedz, an environmental seismologist at the University of Calgary.\nMore than half of the people at risk from glacial outburst floods are in just four countries — India, Pakistan, Peru and China, according to a study published this year in Nature Communications.\nOne of the more devastating such events killed up to 6,000 people in Peru in 1941. A 2020 glacial lake outburst flood in British Columbia, Canada, caused a surge of water about 330 feet (100 meters) high, but no one was hurt.\nBecause the ground along the Mendenhall River is largely made up of loose glacial deposits, it’s especially susceptible to erosion, Hood said. The damage could have been much worse if the flood coincided with heavy rains, he said.\nChris and Bob Winter built their house about 50 feet (15.2 meters) off the Mendenhall River in 1981. It flooded for the first time in 2014, an event that prompted them to raise their house 3 feet. It flooded again on Saturday with about 3 inches of standing water, enough to soak the carpets, subflooring and drywall.\n“You just got to rip it all out,” Chris Winter said. “I just don’t know what’s going to happen, but we can’t live in our house right now.”\nShe said her biggest concern is that they are both in their mid-70s and will probably have to move south at some point.\n“We raised our family, and they’re gone and nobody’s in Juneau,” she said. “And I don’t know that we’ll be able to sell it.”\n___\nThiessen reported from Anchorage. Associated Press writer Gene Johnson in Seattle and researcher Jennifer Farrar in New York contributed to this report."
    }
  ],
  "argos_summary": "The Mendenhall Glacier in Juneau, Alaska, has begun releasing a significant amount of water from a dammed basin, prompting officials to urge evacuations due to expected record flooding downstream. This annual phenomenon, exacerbated by climate change, has previously caused extensive damage to homes and infrastructure, with nearly 300 residences affected last year alone. As the glacier continues to retreat, the risk of glacier outburst flooding is anticipated to persist for decades, leading to ongoing concerns for residents and city officials.",
  "argos_id": "466Q65M2K"
}