{
  "url": "https://variety.com/2025/tv/news/danielle-spencer-dead-whats-happening-1236487498/",
  "authorsByline": "Andrew McGowan",
  "articleId": "abc867b987674c59ab4c5212fa6c947e",
  "source": {
    "domain": "variety.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://variety.com/wp-content/uploads/2025/08/GettyImages-140814643-e1755023298635.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:29:49+00:00",
  "addDate": "2025-08-12T18:35:28.500812+00:00",
  "refreshDate": "2025-08-12T18:35:28.500815+00:00",
  "score": 1.0,
  "title": "Danielle Spencer, Child Star of ‘What’s Happening!!’ Dies at 60",
  "description": "Danielle Spencer, who played Dee Thomas in 1970s sitcom 'What's Happening!!' has died at 60.",
  "content": "Danielle Spencer, the actress best known for playing the quick-witted little sister Dee Thomas on the 1970s sitcom “What’s Happening!!” died on Monday at a hospital in Richmond, Va., her brother announced on Instagram. She had previously been diagnosed with breast cancer and undergone a double mastectomy and emergency surgeries. She was 60.\n\nBorn in Trenton, N.J. in 1965, Spencer started acting after her family relocated to New York City early in her life. At the age of 11, she was cast as Dee Thomas in “What’s Happening!!,” an ABC sitcom created by Eric Monte and executive produced by “All In The Family’s” Bud Yorkin.\n\nBased on of the 1975 coming-of-age film “Cooley High,” “What’s Happening!!” chronicled the lives and teenage antics of Raj Thomas (Ernest Thomas), Dwayne Nelson (Haywood Nelson) and Freddy “Rerun” Stubbs (Fred Berry). Dee was Raj’s younger sister with a sharp tongue and even sharper attitude, quick to tattle on her brother and his friends for their adolescent shenanigans. Buoyed by Spencer’s earnest performance, Dee was a consistent fan favorite on the show.\n\nInitially greenlit for a four-episode replacement summer run, “What’s Happening!!” was so well received that ABC renewed it for a full season. The series ran for three seasons total between 1976 and 1979. During production of the second season, Spencer was in a car accident on the Pacific Coast Highway that killed her stepfather. Spencer was in a coma for three weeks following the accident and she underwent physical therapy for the next six months.\n\nAfter “What’s Happening!!’s” cancellation, Spencer and her mother moved to the Ivory Coast for the remainder of her childhood before she returned to the United States for college. Spencer attended the U. of California Davis, where she studied veterinary science.\n\nWhile Spencer was in college, she occasionally reprised her role as Dee Thomas in episodes of the “What’s Happening Now!!,” a sequel series which ran for an additional three seasons between 1985 and 1988.\n\nSpencer later went to Tuskegee University Veterinary School, where she earned her doctorate in 1993. During her two-decade career as a veterinarian in the Los Angeles area, she occasionally acted, making brief appearances in James L. Brooks’ “As Good as It Gets” and the NBC series “Days of Our Lives.” In 2004, she was diagnosed with spinal stenosis and underwent a surgery that left her paralyzed from the waist down for eight months.\n\nIn 2010, Spencer wrote a memoir titled “Through the Fire … Journal of a Child Star,” which sparked a resurgence in interest in her career. Following the book, she appeared on “The Wendy Williams Show” and reunited with her “What’s Happening!!” cast members on “Life After” and “Unsung Hollywood.”\n\nShe moved from Los Angeles to Richmond, Va. in 2014. There, she hosted a regular morning segment on the local CBS affiliate, WTVR-TV about pet care. The same year that she moved, she was also inducted into the National Museum of African American History and Culture in Washington, D.C.\n\nSpencer was diagnosed with breast cancer in 2014.\n\nSpencer was married twice, first to her marketing manager and publicist Garry Fields between 1999 and their divorce in 2013, and then to fashion designer and entrepreneur David L. David in 2014. Spencer and David co-hosted the podcast “Living with Danielle and David,” where they discussed love, marriage, and their work in entertainment with guests.\n\nSpencer is survived by her mother, Cheryl Pelt, her brother, Jeremy Pelt, a jazz trumpeter.",
  "medium": "Article",
  "links": [
    "https://variety.com/2025/tv/news/love-island-usa-ratings-1236481901/",
    "https://variety.com/t/danielle-spencer/",
    "https://www.instagram.com/jeremypeltthegriot/p/DNPmWWytyb-/",
    "https://variety.com/2025/tv/news/hostel-tv-series-eli-roth-paul-giamatti-peacock-1236475465/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Danielle Spencer",
      "weight": 0.09143048
    },
    {
      "name": "Spencer",
      "weight": 0.08785639
    },
    {
      "name": "Dee Thomas",
      "weight": 0.076053455
    },
    {
      "name": "What",
      "weight": 0.070831366
    },
    {
      "name": "David L. David",
      "weight": 0.066651
    },
    {
      "name": "Raj Thomas",
      "weight": 0.06431995
    },
    {
      "name": "Ernest Thomas",
      "weight": 0.06034877
    },
    {
      "name": "Dee",
      "weight": 0.056138925
    },
    {
      "name": "Tuskegee University Veterinary School",
      "weight": 0.05203447
    },
    {
      "name": "Los Angeles",
      "weight": 0.0510376
    }
  ],
  "topics": [
    {
      "name": "In Memoriam"
    },
    {
      "name": "TV"
    }
  ],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.97509765625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.921875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.86181640625
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.3076171875
    }
  ],
  "sentiment": {
    "positive": 0.17305715,
    "negative": 0.393097,
    "neutral": 0.43384585
  },
  "summary": "Danielle Spencer, the actress known for her role as Dee Thomas on the 1970s sitcom \"What's Happening!!,\" has died at 60. She had previously been diagnosed with breast cancer and underwent a double mastectomy and emergency surgeries. Born in Trenton, N.J. in 1965, Spencer started acting after her family moved to New York City early in her life. At 11, she was cast in “What’s Happening!!!” an ABC sitcom created by Eric Monte and executive produced by Bud Yorkin. The series ran for three seasons between 1976 and 1979. After its cancellation, Spencer and her mother moved to the Ivory Coast for her childhood before returning to the United States for college. She later earned her doctorate in 1993.",
  "shortSummary": "Danielle Spencer, best known for playing Dee Thomas in 1970s sitcom “What’s Happening!!” died at 60 after battling breast cancer and multiple surgeries.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ff6845060d5247b6ab76ba17648cb546",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://variety.com/2025/tv/news/love-island-usa-ratings-1236481901/",
      "text": "“Love Island USA” achieved its best viewership ever during the week of July 7-13, reaching 1.9 billion minutes watched. That total marked not only a series high for the Peacock reality dating series, but the first time any Peacock show has ever reached the No. 1 position on Nielsen‘s weekly streaming rankings.\nNielsen measures U.S. television screens alone, meaning viewership in other countries and on mobile devices is not included in this tally. Additionally, it’s important to note that Nielsen combines all viewership of a show into one total rather than separating totals by season, meaning that any viewership of Seasons 1-6 would also be accounted for within the week’s 1.9 billion minutes. Still, it’s presumable that the vast majority of viewership would have come from the currently airing season. Nielsen also notes that throughout the run of Season 7, which premiered on June 3 and concluded on July 13, “Love Island USA” accrued a total of 8.8 billion minutes watched, with 54% of that viewership coming from adults age 18-34. That makes it the biggest show among adults under 35 by a “significant margin,” per Nielsen.\nThe viewership record coincided with the final week of Season 7, with Episodes 31-36 rolling out during the viewership window. In the finale, which aired July 13, Amaya Espinal won the season and chose to split the $100,000 prize money with her partner, Bryan Arenales, while fellow fan favorites Olandria Carthen and Nic Vansteenberghe were runners-up.\nPopular on Variety\nSee Nielsen’s weekly streaming rankings for the week of July 7-13 below, beginning with the overall Top 10 and followed by the Top 10 streaming originals, acquired titles and movies."
    },
    {
      "url": "https://variety.com/2025/tv/news/hostel-tv-series-eli-roth-paul-giamatti-peacock-1236475465/",
      "text": "The “Hostel” TV series has found a home at Peacock.\nVariety has learned exclusively that the TV extension of the horror film franchise is currently in development at the NBCUniversal streamer. The show was previously reported to be in the works in June 2024, but no platform was attached at that time.\nAs originally reported, Paul Giamatti is attached to star in the series, with “Hostel” mastermind Eli Roth set to write, direct, and executive produce. Chris Briggs and Mike Fleiss, who have produced all the “Hostel” films, are also executive producers. Fifth Season is the studio. Exact plot details are being kept under wraps.\nPopular on Variety\nIn the “Hostel” franchise, innocent tourists are kidnapped by a mysterious group known as the Elite Hunting Club operating out of Eastern Europe, with the group’s rich clientele paying to torture and murder the tourists. The first film was released in theaters in 2006, with Roth writing, directing, and producing. Roth also wrote, directed, and produced “Hostel: Part II” in 2007. A third film was released direct to video in 2011, though Roth was not involved in the production.\nCollectively, the first two films in the franchise grossed nearly $120 million globally despite costing just $4.8 million and $10.2 million respectively to produce.\nGiamatti is one of the finest actors of his generation. He is a two-time Oscar nominee — first for “Cinderella Man” and then for “The Holdovers.” He is also a six-time Golden Globe nominee, winning the award for his work in the HBO series “John Adams” as well as for the films “Barney’s Vision” and “The Holdovers.” Giamatti had previously told Variety‘s Marc Malkin that he was interested in pursuing more horror roles, naming “The Texas Chainsaw Massacre” as his favorite film in the genre."
    }
  ],
  "argos_summary": "Danielle Spencer, known for her role as Dee Thomas on the 1970s sitcom \"What’s Happening!!,\" passed away at 60 after battling breast cancer. She began her acting career at age 11 and later pursued veterinary medicine, earning her doctorate in 1993. Spencer's life included a successful veterinary career, occasional acting roles, and a memoir that reignited interest in her past, along with hosting a pet care segment in Richmond, Virginia.",
  "argos_id": "494YYNFNV"
}