{
  "url": "https://www.independent.co.uk/news/business/shares-germany-london-france-asia-b2805954.html",
  "authorsByline": "Pa Business Staff",
  "articleId": "fef3384fa85f41718dac1689216e7210",
  "source": {
    "domain": "independent.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://static.independent.co.uk/2023/01/11/12/11115516-79e769bd-99e3-4c2d-8cf5-5cd7b7238204.jpg?width=1200&height=800&crop=1200:800",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T08:13:09+00:00",
  "addDate": "2025-08-12T08:33:25.663547+00:00",
  "refreshDate": "2025-08-12T08:33:25.663548+00:00",
  "score": 1.0,
  "title": "PageGroup profits dive as recruiter cuts more jobs",
  "description": "Shares in the business moved lower in early trading after it also posted a slump in revenues.",
  "content": "Your support helps us to tell the story From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference.\n\nRecruitment firm PageGroup has revealed that its profits plummeted over the first half of the year after it was hit by a wide slowdown in hiring.\n\nThe company also cut more than 200 jobs across its operations amid efforts to improve its finances.\n\nShares in the business moved lower in early trading after it also posted a slump in revenues.\n\nBosses at the company said it came after it reported a “slight deterioration” in activity, particularly in Germany and France.\n\nPageGroup revealed that pre-tax profits sank by 99% to £0.2 million over the six months to June 30, compared with a £27.7 million profit a year earlier.\n\nThe London-listed firm said the sharp fall in profits was partly linked £13 million in one-off costs linked to restructuring efforts.\n\nIn April, the company revealed plans to cut senior manager jobs as part of an overhaul designed to reduce costs.\n\nOn Tuesday, the group said it reduced its headcount of fee-earner roles by 207 to 5,163 at the end of June as it responded to “more challenging trading conditions”.\n\nIt said the majority of job cuts took place in its European business and in the UK.\n\nIt also revealed that revenues fell by 11.1% to £798.4 million for the half-year.\n\nNicholas Kirk, chief executive officer, said: “The group delivered a resilient performance in H1 despite ongoing macro-economic uncertainty.\n\n“Whilst activity levels remained robust across most of our markets, we experienced a slight deterioration in activity levels and trading in continental Europe towards the end of the period, particularly in our two largest markets, France and Germany.\n\n“Elsewhere, we saw some improvement in activity, trading and customer confidence in Asia and the US.”\n\nShares in PageGroup were down 3% on Tuesday morning.",
  "medium": "Article",
  "links": [
    "https://www.independent.co.uk/topic/france",
    "https://www.independent.co.uk/topic/germany",
    "https://www.independent.co.uk/topic/asia",
    "https://www.independent.co.uk/donate?regSourceMethod=Donations",
    "https://www.independent.co.uk/topic/shares"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PageGroup profits",
      "weight": 0.08066727
    },
    {
      "name": "pre-tax profits",
      "weight": 0.077571765
    },
    {
      "name": "activity levels",
      "weight": 0.06988991
    },
    {
      "name": "reproductive rights",
      "weight": 0.06680472
    },
    {
      "name": "more jobs",
      "weight": 0.06675852
    },
    {
      "name": "early trading",
      "weight": 0.065896526
    },
    {
      "name": "ongoing macro-economic uncertainty",
      "weight": 0.06572011
    },
    {
      "name": "senior manager jobs",
      "weight": 0.06538776
    },
    {
      "name": "Recruitment firm PageGroup",
      "weight": 0.0644747
    },
    {
      "name": "job cuts",
      "weight": 0.064431295
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.92919921875
    },
    {
      "name": "/News/Other",
      "score": 0.8017578125
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.63720703125
    },
    {
      "name": "/Jobs & Education/Jobs/Job Listings",
      "score": 0.46875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.40185546875
    },
    {
      "name": "/Jobs & Education/Jobs/Career Resources & Planning",
      "score": 0.366943359375
    }
  ],
  "sentiment": {
    "positive": 0.025803361,
    "negative": 0.8946237,
    "neutral": 0.079573
  },
  "summary": "Recruitment firm PageGroup has reported a 99% decrease in pre-tax profits over the first half of the year, largely due to a slowdown in hiring and job cuts. The company also cut over 200 jobs across its operations in an effort to improve its finances. The fall in profits was partly attributed to £13 million in one-off costs linked to restructuring efforts. The firm also reduced its headcount of fee-earner roles by 207 to 5,163 at the end of June due to challenging trading conditions.",
  "shortSummary": "Recruitment firm PageGroup's profits plummeted 99% due to a slowdown in hiring, despite strong European and US markets, prompting a 3% drop in its share price.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "c891c1db7b7840ea8ed98f4650bf14f9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "PageGroup reported a significant decline in profits, with pre-tax profits dropping 99% to £0.2 million for the first half of the year, attributed to a slowdown in hiring and £13 million in restructuring costs. The company also cut over 200 jobs, primarily in Europe and the UK, in response to challenging trading conditions, as revenues fell by 11.1% to £798.4 million. Despite these challenges, the CEO noted some improvement in activity in Asia and the US.",
  "argos_id": "4EWGVVEXH"
}