{
  "url": "https://www.miamiherald.com/sports/nfl/miami-dolphins/article311681682.html",
  "authorsByline": "Barry Jackson",
  "articleId": "4f8aa27e8d474858b8cd08d62e3fc523",
  "source": {
    "domain": "miamiherald.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Miami-Dade County",
      "city": "Miami",
      "coordinates": {
        "lat": 25.7741728,
        "lon": -80.19362
      }
    }
  },
  "imageUrl": "https://www.miamiherald.com/public/latest-news/9hdrmd/picture296801664/alternates/LANDSCAPE_1140/239_Jets_at_Dolphins_DS.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:13:07-04:00",
  "addDate": "2025-08-12T22:15:06.868303+00:00",
  "refreshDate": "2025-08-12T22:15:06.868305+00:00",
  "score": 1.0,
  "title": "Ramsey sheds light on his departure from Dolphins with eyebrow-raising comments",
  "description": "Steelers cornerback Jalen Ramsey discussed his departure from the Dolphins",
  "content": "Former Dolphins cornerback Jalen Ramsey reportedly disrespected coach Mike McDaniel by showing up late to practices or meetings on multiple occasions.\n\nSo it was curious when Ramsey said this week that he wanted to play for a team “where there’s a lot of respect for the head coach.”\n\nTo be clear, Ramsey did not publicly say that there is a lack of respect for Dolphins coach Mike McDaniel. But that could be inferred from how he phrased his comments on The Pivot podcast.\n\nRamsey also indicated the trade to the Steelers was a positive because he was able to join “a team that’s going to be able to compete.”\n\nThough Ramsey made clear to the Dolphins that he wanted out, the team said it was a mutual decision.\n\nDolphins tight end Tanner Conner, without naming names, said last month that “Mike hasn’t changed at all. I think maybe the emphasis around him and respecting him more as players has changed as we’ve gotten some players out who might have not been as respectful.”\n\nRamsey offered one bit of praise for the Dolphins, saying “I do appreciate the Dolphins and them working with me and” his agent, David Mulugheta, and “not just [saying] this team called and we are going to send you there. It was very open communication. You all have been good to us. I’ve been good to ya’all.\n\n“Let’s go to a team that’s going to be able to compete, where there’s a lot of respect for the head coach and the staff and a place I can continue to play at a high level… and maybe be versatile… We all had to come to a consensus on what it would be. The Steelers wanted me here, and I wanted to be here.”\n\nHe said “he prayed to God” when mulling his future this offseason, indicated that he asked God to “please reveal what you want from me.”\n\nRamsey’s comments on the podcast marked the first time he has publicly discussed the Dolphins since general manager Chris Grier disclosed in April that the team would try to trade him.\n\nOn the first night of the draft, he posted a photo of rotten oranges, alongside a caption that read as an indictment of the Dolphins organization.\n\n“Who you surround yourself with matters,” the first part of the caption read, followed by a short inscription underneath the picture that said “If you surround yourself with people who are okay with mediocre, you too will start to be okay with it... surround yourself with people who desire GREATNESS!”\n\nOn June 30, Miami dealt two disgruntled players -- Ramsey and tight Jonnu Smith -- and a 2027 seventh-round pick to the Steelers. In return, Miami received former Pro Bowl safety Fitzpatrick (who was the Dolphins’ 2018 first-round pick), as well as a 2027 fifth-round pick.\n\nSmith preferred to stay in Miami but prioritized getting a better contract and remained away from the team’s offseason program in search of one.\n\nAs part of the trade, Ramsey received a $1.5 million raise this season, increasing his salary to $26.6 million, and the Dolphins agreed to pay $7 million of that total salary.\n\nRamsey, 30, has played for the Jaguars (who selected him fifth overall out of FSU in 2016), Rams and Dolphins during a nine-year career. But he became disgruntled in Jacksonville and was traded to the Rams in October 2019.\n\nIn March of 2023, the Rams shipped him to Miami for a third-round pick and tight end Hunter Long. “When I got traded from L.A., I was literally praying to go to Miami,” Ramsey said on the podcast. “It was probably not for all the right reasons. Football will always be very important for me.\n\n“But I had other things in the back of my mind. I want to live in a good city, want my kids to enjoy life, be in the sun... I want my family to like coming to visit me. It was other stuff that added on to that as well.”\n\nRamsey sustained a torn meniscus during his first Dolphins training camp and made his Dolphins debut on Oct. 28 of that 2024 season.\n\nLast year, he was ranked 25th by his fellow players on the NFL Top 100 player list.\n\nLast September, the Dolphins signed Ramsey to a three–year, $72.3 million contract extension that included $24.3 million guaranteed upon signing, making him the highest-paid cornerback in the NFL. He asked out less than six months later.",
  "medium": "Article",
  "links": [
    "https://www.miamiherald.com/sports/nfl/miami-dolphins",
    "https://www.facebook.com/MiamiHeraldSports/",
    "https://www.miamiherald.com/profile/218643880",
    "https://twitter.com/flasportsbuzz"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Former Dolphins cornerback Jalen Ramsey",
      "weight": 0.10430452
    },
    {
      "name": "Dolphins coach Mike McDaniel",
      "weight": 0.09594838
    },
    {
      "name": "Dolphins",
      "weight": 0.094109096
    },
    {
      "name": "Dolphins tight end Tanner Conner",
      "weight": 0.089309126
    },
    {
      "name": "Ramsey",
      "weight": 0.08523167
    },
    {
      "name": "Jalen Ramsey",
      "weight": 0.0850255
    },
    {
      "name": "coach Mike McDaniel",
      "weight": 0.06438943
    },
    {
      "name": "Last year",
      "weight": 0.061234377
    },
    {
      "name": "his first Dolphins training camp",
      "weight": 0.059949715
    },
    {
      "name": "Miami",
      "weight": 0.059737727
    }
  ],
  "topics": [
    {
      "name": "NFL"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.9853515625
    },
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    }
  ],
  "sentiment": {
    "positive": 0.1169601,
    "negative": 0.53556234,
    "neutral": 0.34747756
  },
  "summary": "Former Dolphins cornerback Jalen Ramsey has made controversial comments about his departure from the team, where he reportedly disrespected coach Mike McDaniel by showing up late to practices or meetings multiple times. Ramsey stated that he wanted to play for a team where there was a lot of respect for the head coach. However, he also indicated that the trade to the Steelers was a positive as he joined a team that could compete. Despite expressing his dissatisfaction with the Dolphins, Ramsey praised them for their open communication and professionalism. This comments were made on The Pivot podcast. This is not the first time Ramsey has publicly discussed the Dolphins since they announced they would try to trade him.",
  "shortSummary": "Jalen Ramsey's departure from the Dolphins was marked by controversial remarks about coach Mike McDaniel, highlighting his desire to play competitive football again.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5d13b4a25b884527a74b545ab644d7c8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Former Dolphins cornerback Jalen Ramsey expressed a desire to play for a team that respects its head coach, which raised eyebrows given his reported disrespect towards Dolphins coach Mike McDaniel through tardiness at practices. After being traded to the Steelers, Ramsey noted the positive aspects of the move, emphasizing the importance of respect within the team environment. Despite his grievances, he acknowledged the Dolphins for their open communication during the trade process.",
  "argos_id": "4IP7E6FKU"
}