{
  "url": "https://www.computerworld.com/article/4038675/is-perplexitys-34-billion-offer-to-buy-chrome-real-or-a-marketing-stunt.html",
  "authorsByline": "By Agam Shah, By JR Raphael",
  "articleId": "1fb2673c787843318bd00b531957eed5",
  "source": {
    "domain": "computerworld.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Middlesex County",
      "city": "Framingham",
      "coordinates": {
        "lat": 42.3095704,
        "lon": -71.4413097
      }
    }
  },
  "imageUrl": "https://www.computerworld.com/wp-content/uploads/2025/08/4038675-0-25812900-1755059374-shutterstock_2596654899.jpg?quality=50&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:30:03+00:00",
  "addDate": "2025-08-13T04:37:38.431307+00:00",
  "refreshDate": "2025-08-13T04:37:38.431308+00:00",
  "score": 1.0,
  "title": "Is Perplexity’s $34 billion offer to buy Chrome real or a marketing stunt?",
  "description": "Tuesday’s disclosure that Perplexity wants to buy Chrome may be intended to influence a federal judge more than Google/Alphabet. Either way, it’s getting a lot of attention, which might have been Perplexity’s primary goal.",
  "content": "AI startup Perplexity has sent Google/Alphabet an offer to buy Chrome for $34.5 billion. The offer was made in a letter from Perplexity CEO Aravind Srinivas to Sundar Pichai, who serves as the CEO of both Alphabet and Google. A copy of the letter, provided to Computerworld by Perplexity, pledges to maintain Google as the browser’s default search engine, although it points out that users can always change that via settings. The letter promises to maintain, support, and promote Chromium, the open source project underpinning Chrome. “We intend for this commitment to be legally binding, subject to regulatory approval,” it said.\n\nIt also promises to invest “$3 billion over 24 months in reliability, performance, security, and customer support scale; pursue appropriate security certifications; maintain a quarterly customer-facing roadmap and convene an Open Web Advisory Board within 120 days post-close.” However, the letter does not promise to retain all Chrome employees, but said that Perplexity will “extend offers to a substantial portion of designated key personnel and implement retention programs to preserve expertise and continuity.” It also said, “this proposal is designed to satisfy an antitrust remedy in [the] highest public interest by placing Chrome with a capable, independent operator focused on continuity, openness, and consumer protection.”\n\nThe backdrop to the story, and potentially the sole reason for the acquisition offer, is a federal court case to determine whether Google should be forced to sell off units to undercut its supposedly monopolistic hold on web search. US District Court Judge Amit Mehta is currently considering a decision about the actions the court will order. Analysts were mixed on the implications of such a move. “My brain says ‘marketing stunt,’” said Jason Andersen, a VP/principal analyst with Moor Insights & Strategy. Perplexity has been quiet for the last few months, Andersen said, “and this is them taking a shot to get their name out there so people don’t forget them. Their competition is making a lot of noise right now.”\n\nBrian Jackson, a principal research director at Info-Tech Research Group, had a more charitable take. Jackson said that “part of the genius of Perplexity’s play” is that it comes right before the judge’s decision. Jackson saw it as a way to let Google avoid an unfavorable judicial decision by moving Chrome to a third party. The financial portion of the offer also raised some issues. Some questioned whether Perplexity can justify spending $34.5 billion on a browser, and even whether it can raise that much money at all, given that Chrome users could easily abandon the browser if it is disconnected from the Google universe of products.\n\nJackson said he thinks that the price tag Perplexity placed on Chrome is too low. “I don’t think it is fair market value. It probably [should sell for] twice as much, at least.” Google did not initially report the offer to the United States Securities and Exchange Commission (SEC), but given that parent company Alphabet reported $350 billion in annual revenue last year, the offer might not have been considered material. While it is noteworthy that the letter promises to not change the default search engine from Google, it doesn’t address Chrome’s most compelling feature: The browser’s seamless integration with a large number of Google services, including Gmail, Google Docs, Google Drive and YouTube.\n\nThere are pros and cons to whether the tight Google app integration would survive a Perplexity acquisition. Perplexity might want to instead integrate its own services, but doing so might risk alienating the users it is paying for. Given that the browser is free, its users have no financial reason to stay if the value seems diminished. But would Google permit that integration to survive? Depending on the judge’s order, it might have little reason not to. That tight integration delivers a lot of revenue. If Google/Alphabet is not permitted to create a browser for those services, it might simply let Chrome remain so linked. “A lot of the entrenched value is in the [Google apps] integration,” Jackson said.\n\nAndersen said that Comet, a recent Perplexity extension to Chrome which allows interaction with the AI from within Chrome, might help explain Perplexity’s interest. Andersen said he has been testing Comet and found it unimpressive, adding that it was “a little slow” and “there were certain tasks that I could do faster on my own. It was intriguing but still early. Maybe not there yet.” But, Andersen said, “if Perplexity was to buy the Chrome browser, they could remedy the complaints I had” because they would have direct access to, and control over, the browser source code.\n\nAndersen also said that Perplexity might welcome keeping the Google app integrations. “Perplexity only has one or two services to plug into Chrome, whereas Google has hundreds,” he said. He also said that he sees a different path if the judge orders Google to sell Chrome. Google parent Alphabet could simply shift it to another part of the company and then strictly wall it off to address the judge’s concerns, not unlike the way many financial firms isolate sensitive business units to maintain compliance. “If they lose [in court], they are not going to sell it,” Andersen said. “They are going to find a way around it.”",
  "medium": "Article",
  "links": [
    "https://www.infotech.com/profiles/brian-jackson",
    "https://www.computerworld.com/article/4022818/hands-on-an-early-look-at-comet-and-how-ai-browsers-could-change-the-internet.html",
    "https://www.computerworld.com/article/3977562/perplexity-ais-quiet-coup.html",
    "https://www.computerworld.com/article/3970174/analysts-weigh-in-on-enterprise-impact-if-google-forced-to-sell-chrome.html",
    "https://moorinsightsstrategy.com/team/jason-andersen/",
    "https://www.computerworld.com/article/3801560/tech-giants-join-forces-to-better-support-chromium-based-browsers.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Google services",
      "weight": 0.08974579
    },
    {
      "name": "Google parent Alphabet",
      "weight": 0.08578189
    },
    {
      "name": "Google",
      "weight": 0.08369953
    },
    {
      "name": "Google Docs",
      "weight": 0.082392685
    },
    {
      "name": "Chrome users",
      "weight": 0.08236753
    },
    {
      "name": "Google Drive",
      "weight": 0.08169814
    },
    {
      "name": "Perplexity",
      "weight": 0.07646425
    },
    {
      "name": "Chrome",
      "weight": 0.07572011
    },
    {
      "name": "Perplexity CEO Aravind Srinivas",
      "weight": 0.07239276
    },
    {
      "name": "AI startup Perplexity",
      "weight": 0.07103758
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Tech"
    },
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97412109375
    },
    {
      "name": "/News/Technology News",
      "score": 0.96337890625
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.53271484375
    }
  ],
  "sentiment": {
    "positive": 0.20482501,
    "negative": 0.2938284,
    "neutral": 0.5013466
  },
  "summary": "AI startup Perplexity has offered to buy Chrome for $34.5 billion, in a letter from CEO Aravind Srinivas to Google/Alphabet CEO Sundar Pichai. The letter pledges to maintain Google as the browser’s default search engine and invest $3 billion over 24 months in reliability, performance, security, and customer support scale. It also promises to maintain, support, and promote Chromium, the open source project underpinning Chrome. However, it does not promise to retain all Chrome employees. The acquisition may be the sole reason for the offer due to a federal court case to determine if Google should be forced to sell off units to counter its monopolistic hold on web search. Analysts were mixed on the implications of such a move, with some calling it a marketing stunt.",
  "shortSummary": "Perplexity’s $34.5 billion offer for Chrome is a marketing stunt designed to appease antitrust regulators but faces mixed reactions as it promises to maintain Google as the default search engine.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "de5f36f37bf2453cbc8f120115a69bc6",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.computerworld.com/article/3977562/perplexity-ais-quiet-coup.html",
      "text": "Perplexity managed to use Apple’s own APIs to supersede Siri, Google and everyone else as the iPhone’s best place to get information. Credit: iStock/Tippapatt “Just Google it.” That’s how most people found information they were interested in for more than a quarter-century. All that is changing now. Today, the main reason fewer people are “Googling it” is that users are turning to AI chatbots like ChatGPT, Claude, Jasper, Chatsonic, HuggingChat, Socratic, Grok, DeepSeek, IBM watsonx Assistant, Pi, and Character AI. Or even more powerfully, they’re using tools that integrate old-fashioned search results with LLM-powered chatbot information, including Google Search (with Gemini), Microsoft Bing (with Copilot), You.com, and Perplexity AI. Old-school search engines used to give you links to websites that contained the information people were seeking. Nowadays, more and more want the answers directly — even if the tool also provides links. This just-give-me-the-answer idea is perfect for a future in which people will ask an always-present assistant for the kind of information they used to get from Google. Smart glasses, of course, will be the main interface to arbitrary information, but other wearables, mobile devices, IoT devices and general purpose computers will enable a personal assistant that knows all about the world and knows all about us, individually and personally. I’ve been living in this future recently, and I can tell you that it will prove irresistible to most people. Perplexity’s great leap forward Perplexity AI is a Retrieval-Augmented Generation (RAG) system launched in 2022 that answers questions directly by searching the web in real time, pulling from news sites, academic journals, and databases, then writing up a summary with accompanied search links. It uses AI models like GPT-4 and Claude 3 to understand your question, find the best information, and explain it in plain English. In February, Perplexity added a feature called “Deep Research,” which reads hundreds of sources, and reasons through the material to produce a very detailed, well-organized report. Then in April, Perplexity unveiled a new version of the company’s iPhone app, which provides a glimpse into the future of getting information from an always-present assistant. For starters, it became an actual assistant, rather than just being an AI search tool. It can now do things even Siri, Apple’s own assistant, can’t do — which is somewhat astonishing, given how closed and Apple-centric the company’s operating systems tend to be. For example, you can use your voice to ask Perplexity on your iPhone to play a song from Apple Music, open a podcast, set reminders, schedule calendar events, or even book a ride with Uber. It can scan your Apple Calendar and read out your appointments or add a reminder. It can bring up Apple Maps and give you directions or send an email through Apple Mail. Perplexity also goes beyond what Siri can do by opening third-party apps like OpenTable or YouTube and pre-filling reservation requests or video searches. For example, if you ask it to find a dinner reservation, it’ll fill in the date, time, and number of guests in OpenTable, so all you have to do is tap “Book.” If you want to find a specific moment in a YouTube video, just describe it, and Perplexity will queue it up instantly. One of the most practical features is that Perplexity saves every conversation as a “Thread” in the app, so you can revisit or continue a previous task anytime. You can even add shortcuts to Perplexity on your home or lock screen for fast access. Of course, there are limits to what Apple lets Perplexity do. It can’t send text messages directly, set alarms, control core iPhone functions like muting notifications, or access the camera for live object recognition. At this point, Android users are yawning at the mention of these features. The Android version of Perplexity got many of these capabilities and more back in January. On Android, Perplexity Assistant can write emails, set reminders, book rides, make reservations, play media, and even use your phone’s camera to answer questions about what it sees or what’s on your screen. It acts as a layer on top of your device, integrating with many apps so you don’t have to switch between them, and supports multimodal input and multi-app actions. Some features, like screen sharing and camera access for contextual awareness, are available on Android though not yet on iOS. But the most futuristic thing Perplexity can do, it can do on iPhone exclusively. The persistent assistant Perplexity AI’s new iPhone app offers something the company calls “persistent listening.” When enabled, the assistant keeps listening for your voice even after you leave the app or switch to something else. You tap the voice icon or use the Action Button to start, and from that point, the assistant keeps the microphone open, so you don’t have to keep pressing anything or reopening the app to continue the conversation. This continuous listening works as long as the app or its background process is allowed by iOS to run, which means it can keep going for extended periods unless you close the app or revoke microphone access. The assistant is designed to pick up your voice even with background noise (it doesn’t always work). It doesn’t use a wake word like “Hey Siri,” so it won’t accidentally respond to other conversations; it’s only listening for input after you’ve started a session. If you stop interacting for about a minute or so, or close the session, it stops listening; until that point, it holds onto the context and keeps the channel open, making it feel like a real assistant that doesn’t lose track of what you were talking about. Lately, I’ve been taking advantage of the continuous listening feature via both my Ray-Ban Meta glasses and my AirPods. And this combination of continuous listening and hearing the answers privately from close-to-the-ears speakers, feels very much like something we’re all going to do all the time in the near future. Perplexity’s quiet coup is quite a feat. It’s actually got me never using Siri anymore, even to do things like set reminders in Apple’s Reminders app. (I’m also no longer using Meta AI in my Ray-Ban Meta glasses anymore, at least for arbitrary information.) The tech industry is currently fighting a brutal, winner-take-all war for the future of personal assistants that do things for us, use our apps for us, get information for us and generally help us out all day, every day, even when we’re walking around, driving or doing the dishes. Once the public gets in the habit of using one specific tool, it could be another quarter-century before that habit can be changed by new technologies. I’d have to say that — for now — Perplexity AI is winning that war. SUBSCRIBE TO OUR NEWSLETTER From our editors straight to your inbox Get started by entering your email address below. Please enter a valid email address Subscribe"
    },
    {
      "url": "https://www.computerworld.com/article/4022818/hands-on-an-early-look-at-comet-and-how-ai-browsers-could-change-the-internet.html",
      "text": "A bit over 30 years ago, the Netscape browser took the online world by storm with a graphical interface that provided a lens to enjoy the internet in color. Now it’s Comet’s turn to shake things up. Credit: Agam Shah/Foundry The next browser revolution — this time with an AI interface — is just around the corner. At least, that’s how OpenAI, The Browser Company, and Perplexity see it. These companies are all developing AI browsers designed to do an even better job of presenting information available on the web. Perplexity’s Comet is among the earliest such browsers. And once users latch onto it, using Google’s Chrome will feel like using a Walkman. (That’s how Perplexity sees it, anyway.) To cut through the hype, Computerworld tested an early version of Comet to understand how AI could change browsing in much the same way Netscape shift the online landscape three decades ago. Comet, which is only available for now by invitation only, uses AI’s best attributes to cut down the manual slog of clicking through links, creating tabs, finding files, and completing web-based work. The centerpiece is a built-in assistant, where users can type in search queries or ask the browser to complete tasks. A chatbot pops up in a side panel of the browser, while the main window shows web pages. The goal was to compare how an AI-powered web browser and a generic browser would complete the same task. I tested an early version of Comet, with Perplexity promising to add more functionality over time. Writing emails First, I connected Comet to my Gmail account; that allowed the browser chatbot to list and summarize my latest emails. The chatbot was also able to auto-compose and send an email from the Gmail account and it could search through emails by broadening the context beyond just keywords. (Typical Gmail searches look for specific words.) The AI browser saved time and effort from the conventional click-through process of composing and sending email. Automatically create tabs Even better was Comet’s ability to automatically create multiple tabs based on queries to the AI assistant. Using this query, “Keith Shaw’s Today in Tech — create tabs in Comet browser for last 5 episodes” delivered as promised. It automatically created five tabs linking to Apple Podcasts of the most recent Today in Tech episodes, which is hosted by my Foundry colleague Keith Shaw. Comet browser used AI to create five browser tabs linking to five recent episodes of Today in Tech. Agam Shah/Foundry The AI assistant used reasoning to determine the most recent episodes and browsed the web to find them. The automation saved time compared to the conventional browsing experience of manually determining the last five episodes and finding links via Google search. Create a shopping cart with one click Similarly, the query “Create a shopping cart for enchiladas for 1 person on Instacart” automated the creation of a shopping cart on Instacart. It determined that the enchilada was for one person, identified six ingredients, browsed nearby stores, and automatically created a shopping cart. (The checkout and use of coupons required a manual process.) The AI assistant also followed up by providing directions on how to make enchiladas with the ingredients purchased on Instacart. A typical browsing experience would require knowing the ingredients and browsing through multiple stores to see whether the items were in stock. The automated experience using Comet was a real time saver. The Comet browser AI assistant filled up an Instacart shopping cart with ingredients for enchiladas. Agam Shah/Foundry Automating productivity Comet’s AI features can also summarize, edit, and suggest improvements to documents. A few weeks ago, my martial arts instructor asked me to document the belt syllabus of Nintai, an eclectic martial art with cross-training in Korean and Japanese styles. Creating the syllabus is proving to be a highly involved manual task and includes putting together information scattered through different files. I wanted to see whether Comet would help me automate the process. I loaded the brown-belt syllabus from a document in Google Drive in the browser. The AI was able to summarize the text and provide suggestions to modify the document. Furthermore, the suggestions drew context from references to Nintai and my instructor in my browsing and email history. The AI also summarized videos about the style, which improved the document even further. I also asked the Comet chatbot to find documents related to Nintai in my Google Drive. Comet made an attempt, and it was fascinating to see how AI automated the entire browsing process. The browser window showed in real-time Comet trying multiple ways to access and open files to determine the content, which would help locate files related to Nintai’s syllabus. It couldn’t open the files, but it provided a hint at how AI browsers in the future could understand documents and boost productivity. Final thoughts Comet isn’t perfect and retains the traditional manual browsing experience (because it’s built on Chromium). It did take me a while to get used to a AI-assisted browsing and filling up shopping carts, much like the first time I sat in a Waymo. But Comet is still in beta and will likely mature. OpenAI has teased a possible web browser of its own (the latest speculation is it’ll be called “Aura” and arrive this summer), and is already planning an AI-powered productivity suite. Meanwhile, The Browser Company’s Dia is available for download for Mac users on a waitlist. Dia was introduced after the company ditched its conventional Arc browser, which was known for its slick design but deemed irrelevant in the AI era. Who knows what will happen with Apple’s Safari, given the company’s slow start on AI? A Gemini add-on isn’t available for Chrome, and Firefox, Chrome and Opera will also need AI extensions. But it seems likely that conventional browsers without AI features won’t survive what’s coming. SUBSCRIBE TO OUR NEWSLETTER From our editors straight to your inbox Get started by entering your email address below. Please enter a valid email address Subscribe"
    }
  ],
  "argos_summary": "AI startup Perplexity has proposed a $34.5 billion acquisition of Google's Chrome browser, aiming to maintain its default search engine and support the underlying Chromium project. The offer comes amid a federal court case regarding Google's monopolistic practices, with analysts divided on its implications, viewing it as either a strategic move or a marketing stunt. Perplexity plans to invest significantly in Chrome's reliability and security, but the proposal raises questions about the browser's integration with Google services and its overall valuation.",
  "argos_id": "4LMQ4D6N7"
}