{
  "url": "https://www.pymnts.com/cybersecurity/2025/russian-government-allegedly-involved-in-us-court-filing-system-data-breach/",
  "authorsByline": "PYMNTS",
  "articleId": "52a378bd9629477db3dbc4f9e2cd3ba2",
  "source": {
    "domain": "pymnts.com",
    "location": {
      "country": "us",
      "state": "MA",
      "county": "Suffolk County",
      "city": "Boston",
      "coordinates": {
        "lat": 42.3602534,
        "lon": -71.0582912
      }
    }
  },
  "imageUrl": "https://www.pymnts.com/wp-content/uploads/2025/08/US-Courts-PACER-cybersecurity-Russia.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:29:26+00:00",
  "addDate": "2025-08-13T01:41:27.577526+00:00",
  "refreshDate": "2025-08-13T01:41:27.577531+00:00",
  "score": 1.0,
  "title": "Russian Government Allegedly Involved in US Court Filing System Data Breach",
  "description": "The Russian government is allegedly “at least in part responsible” for a data breach targeting the U.S. court filing system, PACER. The hackers searched",
  "content": "The Russian government is allegedly “at least in part responsible” for a data breach targeting the U.S. court filing system, PACER.\n\nBy completing this form, you agree to receive marketing communications from PYMNTS and to the sharing of your information with our sponsor, if applicable, in accordance with our Privacy Policy and Terms and Conditions .\n\nComplete the form to unlock this article and enjoy unlimited free access to all PYMNTS content — no additional logins required.\n\nThe hackers searched for “midlevel criminal cases” in several jurisdictions, including New York City, TechCrunch reported Tuesday (Aug. 12), citing a paywalled article by The New York Times that is based on anonymous sources.\n\nThe report also cited a Politico article that said the hack of the system could expose the identities of confidential informants as well as other documents that are not yet public or may never be made publicly available.\n\nThe Administrative Office of the United States Courts said in a Thursday (Aug. 7) press release that it is working to strengthen protections for sensitive case documents and enhance the security of its case management system. It also said it is working with courts to mitigate the impact on litigants and collaborating with Congress and the executive branch to mitigate the risks of cyberattacks.\n\nThe agency said it was doing so in response to “recent escalated cyberattacks of a sophisticated and persistent nature on its case management system.”\n\n“As other federal government and private entities likewise continue to experience, cyber risks continue to evolve as threat actors grow more sophisticated and change and adapt their tactics, and safeguarding legacy systems poses a particularly difficult challenge,” the Administrative Office of the United States Courts said in its press release. “In tackling cybersecurity threats, the Judiciary embraces its security obligations and remains committed to leveraging all available resources to include collaboration with law enforcement, national security and cybersecurity organizations, and other information sharing entities.”\n\nData breaches that compromised millions of user records placed cybersecurity center stage in 2024 and highlighted the need for security in 2025, PYMNTS reported in December.\n\nIn April, the Office of the Comptroller of the Currency (OCC) said in a press release that it notified Congress of a “major security incident” in which there was unauthorized access to OCC email and email attachments.\n\nThe OCC said that the unauthorized access included “highly sensitive information relating to the financial condition of federally regulated financial institutions.”",
  "medium": "Article",
  "links": [
    "https://www.uscourts.gov/",
    "https://www.pymnts.com/cybersecurity/2024/what-2024s-worst-cyberattacks-tell-us-about-staying-safe-in-2025/",
    "https://techcrunch.com/2025/08/12/russian-government-hackers-said-to-be-behind-us-federal-court-filing-system-hack-report/",
    "https://www.politico.com/news/2025/08/06/federal-court-filing-system-pacer-hack-00496916",
    "https://occ.gov/index.html",
    "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system",
    "https://www.pymnts.com/cybersecurity/2025/occ-notifies-congress-of-major-security-incident-involving-email-access/",
    "https://www.nytimes.com/2025/08/12/us/politics/russia-hack-federal-court-system.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US Court Filing System Data Breach",
      "weight": 0.08710046
    },
    {
      "name": "other information sharing entities",
      "weight": 0.07549164
    },
    {
      "name": "sensitive case documents",
      "weight": 0.075131066
    },
    {
      "name": "legacy systems",
      "weight": 0.0740448
    },
    {
      "name": "security",
      "weight": 0.070466846
    },
    {
      "name": "other documents",
      "weight": 0.06769487
    },
    {
      "name": "cybersecurity threats",
      "weight": 0.06724955
    },
    {
      "name": "midlevel criminal cases",
      "weight": 0.066696666
    },
    {
      "name": "New York City",
      "weight": 0.06541354
    },
    {
      "name": "unauthorized access",
      "weight": 0.064146504
    }
  ],
  "topics": [
    {
      "name": "Security Breach"
    },
    {
      "name": "Cyber Crime"
    },
    {
      "name": "Security"
    },
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.84912109375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Network Security",
      "score": 0.787109375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.78662109375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.6796875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.64990234375
    },
    {
      "name": "/News/Technology News",
      "score": 0.6064453125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.429443359375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.427490234375
    },
    {
      "name": "/Computers & Electronics/Computer Security/Hacking & Cracking",
      "score": 0.39453125
    }
  ],
  "sentiment": {
    "positive": 0.11721018,
    "negative": 0.47805724,
    "neutral": 0.4047326
  },
  "summary": "The Russian government is suspected to be behind a data breach targeting the U.S. court filing system, PACER. The hackers reportedly searched for \"midlevel criminal cases\" in several jurisdictions, including New York City. The Administrative Office of the United States Courts has responded to cyberattacks that could expose the identities of confidential informants and other documents not yet public. The agency is working to strengthen protections for sensitive case documents and enhance the security of its case management system.",
  "shortSummary": "The Russian government is alleged to have been behind a data breach targeting the US court filing system, PACER, which includes confidential information and sensitive case documents.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "60add0c7f3ed4ae4b866ea2fd4f7fbdb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://techcrunch.com/2025/08/12/russian-government-hackers-said-to-be-behind-us-federal-court-filing-system-hack-report/",
      "text": "The Russian government is allegedly behind the data breach affecting the U.S. court filing system known as PACER, according to The New York Times.\nCiting anonymous sources, the newspaper said Russia “is at least in part responsible” for the cyberattack, without saying what part of the Russian government is behind the hack.\nThe hackers searched for “midlevel criminal cases in the New York City area and several other jurisdictions, with some cases involving people with Russian and Eastern European surnames,” per the article.\nLast week, Politico reported that hackers had broken into the federal judiciary’s electronic case filing system, potentially accessing the identities of confidential informants, which are redacted and not publicly known, putting those people at risk of retaliation from the criminals they are helping authorities apprehend.\nPolitico reported that the stolen data could include sealed criminal dockets and indictments, arrest warrants, and other documents not yet public, or may never actually be included in public dockets.\nThe Administrative Office of the U.S. Courts, the agency that oversees the U.S. federal court system, confirmed a cyberattack in a statement on August 7.\nThe New York Times also quoted a memo sent to Justice Department officials, clerks, and chief judges by the court system’s administrators, which said that “persistent and sophisticated cyber threat actors have recently compromised sealed records.” The email said “this remains an URGENT MATTER that requires immediate action.”\nThis may not be Russia’s first rodeo targeting the U.S. federal court system.\nIn 2020, a long-running Russian cyberattack targeted the SolarWinds software, used by large tech companies and government agencies, to deliver a tainted software update allowing Russian government hackers backdoor access to the networks of SolarWinds customers.\nThe widespread hack affected several U.S. government departments, including PACER, allowing the theft of sealed court documents.\nThe U.S. Courts, in its statement on August 7, said that the agency was “enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants.”"
    },
    {
      "url": "https://www.uscourts.gov/data-news/judiciary-news/2025/08/07/cybersecurity-measures-strengthened-light-attacks-judiciarys-case-management-system",
      "text": "The federal Judiciary is taking additional steps to strengthen protections for sensitive case documents in response to recent escalated cyberattacks of a sophisticated and persistent nature on its case management system. The Judiciary is also further enhancing security of the system and to block future attacks, and it is prioritizing working with courts to mitigate the impact on litigants.\nThe Administrative Office of the United States Courts has continued to collaborate with Congress as well as the Department of Justice, the Department of Homeland Security and other partners in the executive branch to mitigate the risks and impacts of these cyberattacks.\nThe vast majority of documents filed with the Judiciary’s electronic case management system are not confidential and indeed are readily available to the public, which is fundamental to an open and transparent judicial system. However, some filings contain confidential or proprietary information that are sealed from public view.\nThese sensitive documents can be targets of interest to a range of threat actors. To better protect them, courts have been implementing more rigorous procedures to restrict access to sensitive documents under carefully controlled and monitored circumstances.\nEnhancing the security of its systems is a top priority for the Judiciary. Over the past few years, the Judiciary has added significant cybersecurity protections and safeguards to the case management system. The Chairman of the Judicial Conference’s Committee on Information Technology, Court of Appeals Judge Michael Y. Scudder, briefed the Conference and the media in September 2024 on potential threats to Judiciary IT systems and steps taken by the Judiciary to address them. Subsequently, in June of this year Judge Scudder testified before a House Judiciary subcommittee and underscored the Judiciary’s ongoing commitment to investing in and modernizing its IT systems in order to confront the constant and increasingly sophisticated cybersecurity threats the branch faces.\nAs other federal government and private entities likewise continue to experience, cyber risks continue to evolve as threat actors grow more sophisticated and change and adapt their tactics, and safeguarding legacy systems poses a particularly difficult challenge. In tackling cybersecurity threats, the Judiciary embraces its security obligations and remains committed to leveraging all available resources to include collaboration with law enforcement, national security and cybersecurity organizations, and other information sharing entities.\nSubscribe to News Updates\nSubscribe to be notified when the news section is updated."
    },
    {
      "url": "https://www.pymnts.com/cybersecurity/2024/what-2024s-worst-cyberattacks-tell-us-about-staying-safe-in-2025/",
      "text": "Cybersecurity took center stage in 2024 as some of the most sophisticated and damaging attacks in history underscored the vulnerabilities of an increasingly digital operating landscape.\nFrom ransomware attacks crippling critical infrastructure to data breaches compromising millions of user records, the year’s events highlighted the need for robust, proactive security measures in a hyper-connected world.\nAmong the most damaging breaches were the Change Healthcare ransomware attack that led to billions in losses, to the breached defenses at background check firm National Public Data that led to the stolen information of 2.9 billion individuals, as well as the Snowflake data breach that snowballed to include AT&T, Santander Bank, Advance Auto Parts, Ticketmaster parent company LiveNation and over 160 of the world’s largest companies.\nBut those attacks only scratched the surface of emerging enterprise vulnerabilities.\nAs we enter 2025, the lessons from these breaches are more relevant than ever for businesses navigating the digital frontier.\nSee also: 2024 Is Already the Year of the Cyberattack\nKey Trends Shaping the Cyber Threat Landscape\nAmong the top themes shaping the cyberthreat landscape are the rise of Ransomware as a Service (RaaS), artificial intelligence (AI)-driven threats, zero-day exploits, supply chain attacks and more.\n“It is essentially an adversarial game; criminals are out to make money and the [business] community needs to curtail that activity. What’s different now is that both sides are armed with some really impressive technology,” Michael Shearer, chief solutions officer at Hawk, told PYMNTS.\nThe rise of RaaS platforms lowered the barrier to entry for cybercriminals, enabling even low-skilled actors to launch sophisticated attacks. Combined with the ability of AI to automate phishing campaigns, identify vulnerabilities and evade detection systems, the threat landscape of 2024 grew.\nAt the same time, the prevalence of zero-day vulnerabilities highlighted the need for rapid detection and response capabilities, while third-party software and hardware continued to be a significant vector for attacks, requiring businesses to adopt stricter supply chain risk management practices.\nThe road to cybersecurity resilience is a marathon, not a sprint. As cybercriminals become more sophisticated, so must the defenses designed to thwart them. In an era where data is the new oil, securing it is no longer optional — it’s imperative.\n“Everyone has been dealing with cybersecurity for a long time,” XiFin Chief Financial Officer Erik Sallee told PYMNTS in an interview posted in June. “There’s no way around it other than blocking and tackling, doing the right thing every day keeping all your systems up to date, making sure you’re working with good vendors and investing in it.”\nRead more: Digital Evolution of Finance Function Sees CFOs Embracing Cyber Duty\nThe Need for Vigilance, Adaptability and Innovation\nIn interviews for the “What’s Next in Payments“ series, a panel of executives explained to PYMNTS that a multilayered security strategy, also known as defense in depth, reduces risks at various levels.\nAs we move into 2025, organizations and individuals must prioritize cybersecurity as a strategic imperative. Staying secure in 2025 demands an approach that combines technology, education and preparedness. Companies should consider taking steps such as implementing zero-trust architectures, performing regular penetration testing and deploying advanced endpoint detection and response (EDR) systems to reduce vulnerabilities.\nAPIs, a critical component of modern systems, can be particularly vulnerable to attacks. To mitigate these risks, robust authentication and authorization protocols should be implemented, and API usage should be continuously monitored and audited to detect anomalies. Adopting API gateways can further enhance security by centralizing and enforcing controls.\nEducation and training remain key components of a strong cybersecurity strategy, as people often represent the most vulnerable point in any system. Employees should be regularly updated on the latest phishing tactics and cyber threats, while simulated real-world attack scenarios can help build preparedness and resilience.\nAI also plays a vital role in cybersecurity, providing tools for detecting and responding to known attack patterns automatically while identifying anomalies in real time. Businesses can leverage machine learning models to analyze data and predict emerging threats, staying one step ahead of potential attackers.\nPYMNTS Intelligence’s 29-page report, “Leveraging AI and ML to Thwart Scammers,” a collaboration with Hawk, contains eight charts of proprietary data examining the role of ML and AI to help keep fraudsters from getting the upper hand."
    },
    {
      "url": "https://www.pymnts.com/cybersecurity/2025/occ-notifies-congress-of-major-security-incident-involving-email-access/",
      "text": "The agency discovered some unusual activity on Feb. 11, activated its incident response protocols on Feb. 12, provided public notice of the incident on Feb. 26 and, while the review is still ongoing, determined that the incident should be classified as a major incident, it said in a Tuesday press release.\n“The OCC discovered that the unauthorized access to a number of its executives’ and employees’ emails included highly sensitive information relating to the financial condition of federally regulated financial institutions used in its examinations and supervisory oversight processes,” the release said.\nIn its ongoing review, the OCC and independent third parties are analyzing the compromised email messages to determine their contents, according to the release.\nThe agency is working with third-party cybersecurity experts, is evaluating its current IT security policies and procedures, and is sharing information about its findings with the Department of the Treasury, per the release.\n“I have taken immediate steps to determine the full extent of the breach and to remedy the long-held organizational and structural deficiencies that contributed to this incident,” Acting Comptroller of the Currency Rodney E. Hood said in the release. “There will be full accountability for the vulnerabilities identified and any missed internal findings that led to the unauthorized access.”\nIn its Feb. 26 public notice of the incident, the OCC said it had analyzed all email logs since 2022 and disabled a “limited number” of accounts that it identified as affected.\n“The OCC reported the incident to the Cybersecurity and Infrastructure Security Agency, as required,” the notice said. “There is no indication of any impact to the financial sector at this time.”\nBloomberg reported Tuesday that hackers intercepted the emails of about 100 OCC employees for more than a year and had access to more than 150,000 emails.\nIt was reported Dec. 30 that Treasury Department workstations were breached earlier that month by China-backed hackers who then stole unclassified documents."
    }
  ],
  "argos_summary": "The Russian government is reportedly involved in a data breach affecting the U.S. court filing system, PACER, with hackers targeting midlevel criminal cases and potentially exposing confidential informants' identities. The Administrative Office of the U.S. Courts is enhancing security measures in response to this sophisticated cyberattack and collaborating with various government entities to mitigate risks. This incident highlights ongoing vulnerabilities in cybersecurity, particularly as threat actors become more advanced.",
  "argos_id": "4WQJ90ZBI"
}