{
  "url": "https://www.usmagazine.com/celebrity-body/pictures/the-hottest-celeb-bikini-moments-of-2025/",
  "authorsByline": "Grace Riley",
  "articleId": "6e761c8fc58d48c7abc194ba890c17d4",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/kaylor-swimsuit.jpg?crop=369px%2C123px%2C1129px%2C592px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:01:30+00:00",
  "addDate": "2025-08-12T21:53:03.659589+00:00",
  "refreshDate": "2025-08-12T21:53:03.659592+00:00",
  "score": 1.0,
  "title": "Celebrity Bikini Moments 2025: Millie Bobby Brown, Sofia Richie",
  "description": "From Brooks Nader showing off her curves post-split from Gelb to Elizabeth Hurley flaunting her new bikini design, see the best celeb swim looks of 2025",
  "content": "The Hottest Celeb Bikini Moments of 2025: Sami Sheen, Kaylor Martin, More Stars have no shortage of stylish swimsuits. This year, Hollywood’s favorites, including Gisele Bundchen, Simone Biles, Bella Hadid, Kim Kardashian, Brittany Mahomes, Hailey Bieber and more have shown off their bikini style in super sexy looks. Take Mahomes, who slayed in a bubblegum pink suit only one month after giving birth to her daughter Golden, whom she shares with Patrick Mahomes. The number featured thick straps, a square neckline and a textured silhouette. She paired the look with clear Saint Laurent sunnies and smiled softly at the camera. Biles also looked effortlessly cool in a leopard-print bikini on February 20 while enjoying a trip to South Africa with her husband, Jonathan Owens. Her set featured a halter triangle top and cheeky bottoms, which she accessorized with layered necklaces and black shades. Keep scrolling to see the sultriest bikini moments of 2025: Sheen showed off a green floral bandeau top while enjoying a picnic with her friend on August 11. “Bikinis & beer,\" she captioned the social media post. The Love Island USA alum showed off a navy blue Scuffers one-piece via Instagram on August 8 while enjoying a vacation in her “bucket list” destination, Paros, Greece. Moakler showed off her curves in a sexy black-and-white one-piece that plunged to her waist. Martin rocked a red-and-white gingham bikini while soaking up the sun in the Hamptons on August 5. Slater showed off her toned figure in a gold bikini top with red straps and matching bottoms while cuddling up with her boyfriend — and Dancing With the Stars costar Alan Bersten — on July 28. Biles showed off her sizzling bikini style in a black triangle top and polka dot sarong on July 28. She added even more drama to the look with a black cowgirl hat by Miu Miu. Alba flexed her abs in a strapless brown bikini top and low-waisted bottoms while enjoying a boat day on July 25. Union got cheeky in a floral Skims set featuring thong bottoms and a triangle top on July 25. The actress showed off her figure in a black triangle top and high-cut bottoms on July 19. The model rocked a plunging black top while floating in the sea on July 13. Culpo showed off her growing baby bump in a cherry red balconette bikini top while celebrating the 4th of July. The influencer slayed in an itty-bitty yellow triangle top with a sun pendant on her staps while posing in an outdoor kitchen on June 27. The Dance Moms alum got cheeky in a brown bikini on June 28. The influencer showed off her engagement ring from Miles McFly in a sexy plunging one-piece on June 27. DeSorbo flaunted her figure in a white cutout Jacquemus swimsuit while vacationing in Italy on June 27. Larter looked as hot as ever in a triangle bikini top and low-waisted bottoms on June 23. The singer stunned in a cherry red bikini featuring a triangle top while being buried in the sand on June 21. While honeymooning with her husband, Jordan “Jutes” Lutes, on June 17, Lovato stunned in a scoop-neck red bikini top and high-waisted bottoms. Miller showed off her toned physique in a neon bikini on June 16. Riche looked trendy while posing in a striped bikini top and zebra-print pants on June 14. The Dance Moms alum rocked a baby blue triangle top and boy shorts on June 13. Hyland was pretty in a pink patterned set and matching scrunchie while posing in front of fuchsia flowers on June 10. The Dance Moms alum showed off her birthday suit in an itty-bitty bikini while celebrating another trip around the sun on June 9. Bieber looked cool as ever in a black triangle bikini, which she paired with a cowgirl hat, on June 8. The Summer House star left little to the imagination in a leopard-print bikini on June 1. Alba posed in a brown-and-white floral bikini while tanning poolside on June 1. The Bachelor Nation alum beamed while wearing a pink pearl-embellished set while sailing through Capri, Italy, on May 31. On May 31, the former supermodel and Commence haircare founder celebrated her 60th birthday in a black-and-white bikini on the beach, as seen via Instagram. Tran glowed in an emerald green bikini while soaking up the sun on May 29. Kardashian looked chic in a white triangle top and cheeky bottoms as she tanned on a boat on May 28. The actress flexed her muscles while posing in a red-and-white gingham bikini on May 19. The former supermodel took a break from the 2025 Cannes Film Festival on May 17 to make a splash at the Hotel du Cap-Eden-Roc in a seafoam maillot with a multicolored bird motif. Nader showed off her curves and toned figure in a white triangle top and matching bottoms while posing for the Sports Illustrated Swimsuit issue on May 13. Photographed by Ben Watts and shot in Bermuda, Nader teamed her sexy look with a bombshell blowout. The influencer rocked a sultry polka-dot navy blue top and cheeky bottoms while enjoying a day at the pool on May 13. On May 7, the actress wished her husband of just under one year, Jake Bongiovi, a happy birthday in an honorary Instagram tribute filled with the couple’s sweetest snapshots. One photo showed them together on a white-sand beach with Brown in a plunging maillot monogrammed with Bongiovi’s initials, J.B. “Happy birthday, hubby ❤️❤️❤️. There’s no one like you,” she captioned the post. Jenner flaunted her curves in an itty-bitty Khy bikini featuring a black triangle top and high-cut bottoms on May 2. Kardashian flaunted her abs in a cherry-print halter bikini and cheeky bottoms while posing with her daughter, True, on April 28. Glanville sizzled in a leopard-print bikini with hot pink straps on April 28. Mahomes rocked a cutout one-piece that hugged her curves on April 21. She teamed the sexy suit with a sparkly skirt cover-up and a floppy straw hat. The former Bachelorette turned heads in a teal Montce Swim strapless set complete with strappy bottoms while posing on a lounge chair on April 20. Hayek soaked up the sun in a black-and-white patterned bikini as she enjoyed a sunset boat ride on April 20. Richie flaunted her abs in a striped triangle top and blue shorts set on April 20. She accessorized with rubber flip-flops by The Row and a printed vest. Hadid proved that tankinis are making a comeback in a trendy red-and-white plaid set featuring a halter top and cheeky bottoms from her collaboration with Frankies Bikinis. Brown sizzled in a leopard-print bikini featuring cherry red piping as she showed off her Florence by Mills Coastal Chic Hair & Body Mist. The influencer looked hot in a gray Skims bikini adorned with black lace while soaking up the sun on a boat ride on April 15. The model lounged by a pool in a triangle top featuring swirls on her cups on April 14. Chamberlain rocked a black bikini featuring a triangle top and low-waisted bottoms during Coachella weekend on April 13. On vacation in the Maldives, Hurley turned up the heat, literally, when she posted an Instagram photo on April 10 in a red-hot bikini with gold chain-link straps from her eponymous swim line. Fresh off her split from Gleb Savchenko, the Dancing with the Stars alum turned heads on April 9 during a girls’ trip to Miami, where she showed off her curves in a skimpy white string bikini and no shortage of chunky gold jewelry. On April 8, the former model, author and Commence haircare founder flaunted her enviable figure in an itty-bitty plunging bikini (by India Hicks x Sea Level Australia) on a white-sand beach with her adorable pup, Tuzi, in tow. Brinkley, 71, was proof that age is just a number when she went snorkeling on April 7 in a tiny red string bikini that showed off her preternaturally toned figure. Arnold showed off her figure post-breast augmentation in a Bydee bikini featuring a colorful design on April 6. The actress flaunted her figure in a red printed set featuring cheeky bottoms while tanning on a beach on April 6. Union showed off her cheeks in a mismatched bikini featuring red bottoms and a black strapless top on March 17. On March 6, the influencer flaunted her curves in a strapless band cutout top and matching bottoms, finished with beaded straps. The Bachelor Nation alum looked sizzling hot while soaking up the sun in a mint-green Peppermayo bikini featuring a balconette top and cheeky bottoms. Kardashian showed off her curves in a slate gray Rick Owens triangle halter top and high-cut bottoms on March 29. The former supermodel showcased her runway-worthy abs in a black criss-cross top and sarong while riding water bikes in Miami on March 30 with her partner Joaquim Valente. They welcomed their first baby in February, which is why her latest swimwear look ranks among the top bikini moments of 2025. Brown rocked a Bananhot Luna Paisley triangle top ($125) while soaking up the sun on a beach on March 29. She also showed off her freshly dyed brunette strands, which were previously blonde. On March 26, Lipa modeled a bikini from her tour merch, the Radical Optimism print set, which retails for $100. The top featured teal cups with red star outlines, while the bottoms were complete with horizontal stripes. On March 24, after swiping on her Kylie Cosmetics Powder Blush Stick in \"Make Him Blush,\" Jenner looked radiant as she snapped a selfie underneath a beach cabana in a vintage 2018 red Chanel bikini. The former supermodel wasted no time in packing on the PDA while boating with her partner, Joaquim Valente, in a sexy leopard-string bikini on March 23 — a mere two months post-partum. Lautner sizzled in a strapless hot pink bikini as she sipped out of a coconut on March 12. On March 10, McKnight wore a black tankini with a halter top and a bow at the center. She paired the top with high-cut bottoms. “Hell yeah, I had a baby!!” she captioned the post. On March 4, the White Lotus alum wore a wine-red bikini that showed off her rock-hard abs. The set featured a halter top and cheeky bottoms adorned with gold hoops on the straps. Ratajkowski flaunted her enviable figure in a colorful two-piece while lounging on a white sand beach in Brazil on March 4. The former Bachelorette showed off her figure in a glittery blue bikini featuring a triangle top and string bottoms while vacationing with her fiancé Dotun Olubeko on February 23. Rodrigo celebrated her 22nd birthday while wearing a plunging red swimsuit on February 20. Biles embraced her wild side in a leopard bikini during a trip to South Africa on February 20. Mahomes rocked a pink design while tanning one month after giving birth to her daughter Golden on February 18. Bieber celebrated the new year in a pink-and-white bikini by With Jean and a leopard-print coat. In order to view the gallery, please allow Manage Cookies",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/wp-content/uploads/2025/02/Brittany-Mahomes-Rocks-Barbie-Pink-Bikini-While-Soaking-Up-the-Sun-01.jpg?quality=86&strip=all",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/celebrities/bella-hadid/",
    "https://www.instagram.com/p/DJV8KPzs72Y/?img_index=2",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/oliviaculpo.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/kalanihilliker.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/simonebils.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/celebrities/olivia-rodrigo/",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/the-hottest-celeb-bikini-moments-of-2025-millie-bobby-brown-april.jpg?quality=78&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/The-Hottest-Celeb-Bikini-Moments-of-2025-Kim-Kardashian-Bella-Hadid-More-Brooklyn-and-Bailey-093.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/bikiniupdate.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/jessicaalba.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/https-www.instagram.compDKVoRGRtUO1img_index1-.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/Update-Bikini-Gallery-Paige-DeSorbo-Ciara-Miller-More-016.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/celebrities/helena-christensen/",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/the-hottest-celeb-bikini-moments-of-2025-kelsey-anderson-april-2025-02.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Celebs-in-Bikinis.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/The-Hottest-Celeb-Bikini-Moments-of-2025-Brittany-Mahomes-Kylie-Jenner-More-02-.jpg?quality=70&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/New-Mom-Gisele-Bundchen-Is-Our-Bikini-Season-Inspo-293.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Elizabeth-Hurley-Brooks-Nader-More.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/irinashayk.jpg?quality=74&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/Brooks-Nader-2025-Sports-Illustrated-Swimsuit-Issue.jpg?quality=62&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/camilamorrone.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/KenzieZieglerBikini.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/celebrities/christie-brinkley/",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/The-Hottest-Celeb-Bikini-Moments-of-2025-Kim-Kardashian-Bella-Hadid-More-Meghann-Fahy-687.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/stylish/news/brittany-mahomes-rocks-pink-swimwear-1-month-postpartum/",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Celebs-in-Bikinis-Khloe-Kardashian.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
    "https://www.usmagazine.com/celebrities/gigi-hadid/",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/Celebs-in-Bikinis-Gisele-Bundchen.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/Bikoni-Moments-2025-Millie-Bobby-Brown-Dua-Lipa-More-Millie.jpg?quality=47&strip=all",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-obituary-reveals-he-had-a-loving-partner/",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/The-Hottest-Celeb-Bikini-Moments-of-2025-Brittany-Mahomes-Kylie-Jenner-More.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-son-and-ex-wife-speak-out-after-his-death/",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/HaileyBieberBikini01.jpg?quality=62&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/The-Hottest-Celeb-Bikini-Moments-of-2025-Taylor-Lautner.jpg?quality=47&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/sofiarichie.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/BrookeHyland.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Brooke-Shields-Bella-Hadid-More-465.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/1-Celebs-in-Bikinis.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/celebrities/elizabeth-hurley/",
    "https://www.usmagazine.com/celebrities/hailey-baldwin/",
    "https://www.usmagazine.com/celebrities/simone-biles/",
    "https://www.usmagazine.com/wp-content/uploads/2025/08/kaylor-swimsuit.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/BikiniGallery.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/The-Hottest-Celeb-Bikini-Moments-of-2025-Brittany-Mahomes-Kylie-Jenner-More-02.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Update-Bikini-Gallery-Salma-Jenn-Tran-Brittany-Mahomes-Sofia-Richie-2.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Influencer-Ken-Eurich-Model-Alex-Consani.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/stylish/news/simone-biles-embraces-her-wild-side-in-leopard-bikini-on-africa-trip/",
    "https://www.usmagazine.com/wp-content/uploads/2025/08/applemartin.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Influencer-Ken-Eurich-Model-Alex-Consani-promo.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/Kylie-Jenner-Bikini-Gallery-Update.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/02/Simone-Biles-Slays-in-Leopard-Bikini-on-South-African-Trip-1.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/celebrities/millie-bobby-brown/",
    "https://www.usmagazine.com/celebrities/brooks-nader/",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Gisele-Bundchen-Kylie-Jenner-More-01-2025.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/chappellroanbikini.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/Celebs-in-Bikinis-Update-Kylie-Jenner.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/celebrities/brooke-shields/",
    "https://www.usmagazine.com/celebrities/gisele-bundchen/",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/The-Hottest-Celeb-Bikini-Moments-of-2025-Brittany-Mahomes-Kylie-Jenner-More.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/DemiLovato.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/The-Hottest-Celeb-Bikini-Moments-of-2025-Elizabeth-Hurley-Brooks-Nader-More-Emma-Chamberlain-826.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Brooks-Nader-Hottest-Celeb-Bikini-Moments-of-2025.jpg?quality=47&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Update-Bikini-Gallery-Salma-Jenn-Tran-Brittany-Mahomes-Sofia-Richie-4.jpg?quality=70&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/Emily-Ratajkowski-Shows-Off-Her-Curves-in-a-Bikini-3.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Olivai-Jade-Bikini-Moments-.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Update-Bikini-Gallery-Salma-Jenn-Tran-Brittany-Mahomes-Sofia-Richie.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/ciaramiller.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/BrookeSchofield.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/gabunion.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/millie-bobby-brown-celebrities-in-swimsuits-in-2025.jpeg?quality=86&strip=all",
    "https://www.usmagazine.com/celebrities/brittany-mahomes/",
    "https://www.usmagazine.com/wp-content/uploads/2025/02/The-Hottest-Celeb-Bikini-Moments-of-2025-Kim-Kardashian-Bella-Hadid-More-update.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/08/sami-sheen-bikini.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Brandi-Glanville-Wows-in-Pink-Bikini-Following-Hospital-Visit-for-Facial-Disfiguration-1.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/01/justin-bieber-dedicates-NYE-post-to-wife-hailey-bieber2.jpg?quality=86&strip=all",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/wp-content/uploads/2025/06/kenzieziegler-1.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/02/Olivia-Rodrigo-Stuns-in-Red-Swimsuit-While-Celebrating-Her-Birthday-lead.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/08/shannamoalker.jpg?quality=74&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Hottest-Bikini-Moments-of-2025-Lindsay-Arnold-Millie-Bobby-Brown-1.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Hottest-Bikini-Moments-of-2025-Lindsay-Arnold-Millie-Bobby-Brown-2.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/celebrities/kim-kardashian/",
    "https://lvnta.com/lv_vTSndw2UdfDcJuPkAl",
    "https://www.usmagazine.com/wp-content/uploads/2025/03/Bikoni-Moments-2025-Millie-Bobby-Brown-Dua-Lipa-More-2.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/Celeb-Bikini-udpate.jpg?quality=55&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Update-Bikini-Gallery-Salma-Jenn-Tran-Brittany-Mahomes-Sofia-Richie-3.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/MEGA1311815_003.jpg?quality=86&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/Christie-Brinkley-Red-Bikini-Instagram-Hot-Pics.jpg?quality=47&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/04/the-hottest-celeb-bikini-moments-of-2025-bella-hadid-plaid-april.jpg?quality=40&strip=all",
    "https://swimsuit.si.com/swimsuit/model/brooks-nader-2025-si-swimsuit-photos",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/camilamendes.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/07/emmaslater.jpg?quality=40&strip=all",
    "https://www.usmagazine.com/wp-content/uploads/2025/05/The-Hottest-Celeb-Bikini-Moments-of-2025-Brittany-Mahomes-Kylie-Jenner-More-01.jpg?quality=86&strip=all"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "red bottoms",
      "weight": 0.07582219
    },
    {
      "name": "cheeky bottoms",
      "weight": 0.070280835
    },
    {
      "name": "a cherry red balconette bikini top",
      "weight": 0.06566972
    },
    {
      "name": "a triangle bikini top",
      "weight": 0.064665854
    },
    {
      "name": "matching bottoms",
      "weight": 0.06411698
    },
    {
      "name": "string bottoms",
      "weight": 0.06399287
    },
    {
      "name": "a strapless brown bikini top",
      "weight": 0.061841995
    },
    {
      "name": "a gold bikini top",
      "weight": 0.059724007
    },
    {
      "name": "red straps",
      "weight": 0.059559915
    },
    {
      "name": "a striped bikini top",
      "weight": 0.05944519
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.990234375
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.876953125
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.86865234375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.50146484375
    },
    {
      "name": "/People & Society/Other",
      "score": 0.3388671875
    }
  ],
  "sentiment": {
    "positive": 0.3064573,
    "negative": 0.15424699,
    "neutral": 0.5392957
  },
  "summary": "The list of the hottest celebrity bikini moments of 2025 includes Gisele Bundchen, Simone Biles, Bella Hadid, Kim Kardashian, Brittany Mahomes, Hailey Bieber, Sami Sheen, Kaylor Martin, and more. This year, Hollywood's favorites, including Hollywood’s favorites, have shown off their stylish swimsuits in stylish looks. Other notable bikini moments included a bubblegum pink suit worn by Mahomes a month after giving birth to her daughter, Golden. Other celebrities featured in the list include Giseled Bundchen in a leopard-print bikini and a halter triangle top. Other stars featured in this list include Ashley DeSorbo, Lauren Hiddon, Ashley Taylor, and Millie Bobby Brown.",
  "shortSummary": "The Hottest Celeb Bikinis of 2025: Samantha Sheen, Simone Biles, Sofia Richie, and others in stylish swimsuits showcased by Gisele Bundchen, Simone biles, and more.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5bbe6a64e3a84f80b14ff1969550accb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/stylish/news/simone-biles-embraces-her-wild-side-in-leopard-bikini-on-africa-trip/",
      "text": "Simone Biles is drawing fashion inspiration from her latest vacation destination..\nBiles, 27, took to Instagram on Thursday, February 20, to show off her new swimwear style while vacationing with her husband Jonathan Owens in South Africa. While catching some rays, Biles lounged in front of a bright blue pool. She posed in a leopard-print bikini featuring a halter tangle top and cheeky string bottoms.\nBiles elevated the sexy suit, which accentuated her abs and curves, with layered necklaces and bracelets. She tied her look together with black sunglasses and highlighted braids.\nElsewhere in her steamy photoshoot, Biles put on a spotted tank top while sipping Champagne.\n“Copycat 🐆,” she cheekily captioned the post, then added via her Instagram story that she was “just trying to fit in” with the wildlife surrounding her.\nOwens thirsted over Biles’ scantily clad snaps in the comments section, gushing, “My queen 🔥❤️🫶🏽.” More friends, including Kayla Nicole and Joscelyn Roberson, also praised the gymnast. Kayla, for her part, wrote, “I KNOW THATS RIGHT! Meeeoow 😂🐆,” while Roberson, 19, commented, “Obsessedddd.”\nDuring their getaway, Biles and Owens, 29, went on a safari where they saw lions, elephants, cheetahs, rhinos, giraffes, hippos, zebras and more. Biles dressed the part, wearing white cargo pants and a nude long-sleeve top for their adventure.\nThe couple is making the most of their trip and even went for a helicopter ride “to start the morning off” right on Friday, February 21. Biles looked as cool as ever, taking in the views in a soft white jacket and ribbed top. She added a pop of glam to her ensemble with black oval shapes and a diamond necklace. Owens coordinated in a cream top, black sunglasses and a diamond chain necklace."
    },
    {
      "url": "https://www.usmagazine.com/celebrities/kim-kardashian/",
      "text": "Kim Kardashian\nThe daughter of one of O.J. Simpson‘s head trial lawyers, Robert Kardashian, Kim Kardashian first hit the scene as one of Paris Hilton‘s party pals. The socialite, born October 21, 1980, became known outside the gossip circuit when a sex tape featuring her and her then-boyfriend, rapper Ray J, appeared on the internet in 2006.\nIn 2007, Kim — along with sisters Kourtney and Khloé Kardashian, brother Rob Kardashian, mom Kris Jenner, stepparent Caitlyn Jenner and stepsisters Kendall and Kylie Jenner — became the subject of an E! reality show titled Keeping Up With the Kardashians. The show launched the family into extraordinary fame as it delved into their personal lives and chronicled the sisters’ work on their co-owned clothing store, Dash.\nIn 2015, Kim published Selfish, a coffee-table book of her selfies, followed by Selfish: More Me! With New Selfies 2015-2016 one year later. She launched her own makeup line, KKW Beauty, in 2017 and continued her business success with Skims, a shapewear and underwear line, in 2019. Kim officially achieved billionaire status in April 2021.\nFollowing in her late father’s footsteps, Kim is studying to be a lawyer and hopes to take the bar in 2025. She is passionate about criminal justice reform and has advocated for clemency for several prisoners, including Alice Marie Johnson, who was released from federal prison in 2018\nFollowing her romance with Ray J, Kim dated NFL star Reggie Bush and NBA player Kris Humphries. She was famously married to Humphries for 72 days in 2011 before exchanging vows with rapper Kanye West in 2014.\nThe pair share four children: daughter North (born in June 2013), son Saint (born in December 2015), daughter Chicago (born January 2018, via surrogate) and son Psalm (born May 2019, via surrogate). Kim filed for divorce in February 2021 after nearly seven years of marriage. The proceedings were finalized in November 2022.\nAmid her divorce, Kim confirmed her relationship with comedian Pete Davidson in November 2021 after sparking romance rumors one month prior. Us Weekly confirmed in August 2022 that Pete and Kim had “amicably” called it quits after nine months of dating.\nAfter KUWTK came to an end in 2021, the famous family moved to streaming with their new series, The Kardashians, which premiered on Hulu in April 2022. The show picks up where its predecessor left off, with higher production value and more of a docuseries style."
    },
    {
      "url": "https://www.usmagazine.com/stylish/news/brittany-mahomes-rocks-pink-swimwear-1-month-postpartum/",
      "text": "Brittany Mahomes is (still) embracing Barbiecore to the max.\nMahomes, 29, took to Instagram on Tuesday, February 18, to show off her chic swimwear moment while tanning. She rocked a pink textured suit featuring a square neckline and thick straps in the snap. Mahomes teamed her look with Saint Laurent pink translucent sunglasses.\nMahomes showed off her dewy skin as she soaked up the rays.\n“The happiest in the sun 😎,” she captioned the post.\nThis is hardly the first time Brittany, who welcomed her third baby, daughter Golden, last month with husband Patrick Mahomes, has shown off her swimwear collection. (Brittany and Patrick, 29, are also the parents of daughter Sterling, who turns 4 years old on Thursday, February 20, and son Bronze, 2.)\nIn February 2024, she made her debut as a Sports Illustrated Swimsuit model, rocking a number of sexy red bikinis.\nFirst, she stunned in a cherry Mugler one-piece that left little to the imagination. The design featured a strappy halter top with a massive cutout over her chest that cascaded past her navel. The back of the number was just as slinky with high-cut legs and thong bottoms.\nElsewhere in her photoshoot, Brittany slayed in an itty-bitty bikini featuring small triangle cups that exposed her side and underboob and dainty string bottoms. Brittany paired the look with a red cowgirl hat and beachy waves.\nLater that month, Brittany again gave fans a look at her sultry swimwear while enjoying a boat ride on a tropical getaway. While posing on the ship, she opted for a black one-piece with cutouts over her chest and abs. The design was finished with gold rings and a cheeky back.\nBrittany glammed up the look even more with stacked brackets, a dainty necklace and ombré shades."
    },
    {
      "url": "https://www.usmagazine.com/celebrities/elizabeth-hurley/",
      "text": "Elizabeth Hurley\nModel and actress Elizabeth Hurley was first noticed when she won a “Face of the Year” competition sponsored by a local newspaper, winning a yearlong contract with a local agency in the late 1980s. She made several small appearances on British film and television, one of which was produced by actor Hugh Grant.\nGrant helped propel Hurley into the Hollywood scene when she attended the premiere of his film Four Weddings and a Funeral as his plus-one. Shortly after that red carpet appearance, Hurley secured her longtime spokesmodel contract with Estée Lauder.\nIn 1997, Hurley landed a starring role in Austin Powers: International Man of Mystery. Over the next few years, she had roles in several major Hollywood films, including Bedazzled (2000) and Serving Sara (2002). She later starred in 14 episodes of Gossip Girl as Diana Payne and 40 episodes of The Royals as Queen Helena. Son Damien Hurley directed her in 2024’s Strictly Confidential.\nElizabeth dated Grant from 1987 to 2000. She moved on with producer Stephen Bing, but their relationship ended when Bing refused to acknowledge he fathered Elizabeth’s son, Damien. (A paternity test later confirmed that Bing is the father.) The actress was married to Indian businessman Arun Nayar from 2007 to 2010, and she rebounded with Australian cricketer Shane Warne, to whom she was briefly engaged. They split in 2013. Elizabeth’s next public relationship wasn’t until April 2025, when she revealed via Instagram that she was dating Billy Ray Cyrus."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
      "text": "Billy Joel’s ex-wife Elizabeth Weber is opening up about where she stands with the famed singer after their infamous affair and nearly decade-long marriage.\n“If I wanna talk to him or if I have something to say, I am able to contact him whenever I want to,” Weber exclusively told Us Weekly on Friday, August 8. “But he has a wife and he has children and right now, he’s struggling with something that’s… that’s a big thing.”\nIn May, Joel, 76, canceled the remaining dates of his 2025 tour after revealing he had been diagnosed with normal pressure hydrocephalus, a brain condition in which an abnormal amount of cerebrospinal fluid builds up, causing walking, memory, balance and bladder control problems.\n“So, [our relationship] is as close as it needs to be for two people who decided to divorce 40 years ago,” Weber continued, adding that “of course” she reaches out to her ex amid his health diagnosis.\nWeber first met Joel when she was married to his best friend and former bandmate, Jon Small. The pair engaged in a subsequent affair, which led to the band breaking up and Joel battling a severe depression that included two suicide attempts. (The affair and its aftermath were discussed in the two-part HBO documentary Billy Joel: And So It Goes, which premiered in July.)\nThe pair later reconnected after Weber’s divorce and married in 1973, going on to spend nearly 10 years together before ending their marriage in 1982. Joel went on to marry Christie Brinkley in 1985, welcoming daughter Alexa Ray Joel before calling it quits in 1994. Joel then married cookbook author Katie Lee in 2004 — the pair divorced five years later in 2009. In 2015, Joel married Alex Roderick. The pair share two children, Della Rose Joel and Remy Anne Joel.\nWeber, for her part, shares a son, Sean Weber-Small, with her first husband.\nWhile speaking with Us, Weber said that her son and her grandchildren also know and are even somewhat close to Joel.\n“I have my grandchildren that he knows and they know him,” she explained. “My granddaughter Ella taught Bill what TikTok was and showed him what was happening. And his relationship with Sean is important to both of them.”\nShe added, “So, we’re not distant but we’re, you know, and he lives in Florida and I live in California. But it’s all good. “\nWeber said that her son Sean and Joel “were very close,” adding that during their marriage the three “lived on top of the mountain.”\n“We entertained each other,” she explained. “Bill and I worked all day long and the whole writing process was never done — in the years that Bill and I were together — was never done remotely or in [a] studio. It happened in our living room, and Sean was an integral part.”\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org."
    },
    {
      "url": "https://www.usmagazine.com/celebrities/helena-christensen/",
      "text": "Celebrity Body\nHelena Christensen\nAdd to favorites\nView gallery\nYou might also be interested in:\nArticles about Helena Christensen\nKids\nEvery Time Celebrities Named Their Babies After Other Stars and Why\nCelebrity Style\nHelena Christensen Celebrates 55 With a Cold Plunge in Pink One-Piece\nLove Lives\nLeonardo DiCaprio's Complete Dating History\nBirthdays\nHelena Christensen Celebrates Her 54th 'Merry Birthday' in a Sexy Swimsuit: Pics\nBFFs\nCindy Crawford, Christy Turlington, Helena Christensen Enjoy Reunion: Pics\nPics\nHottest Celebs Over 40\nCelebrity Style\nHelena Christensen Shares Terrifying Story From a 'Vogue' Shoot\nPodcast\nRamy Brook Reveals the 1 Top to Wear to Every Holiday Party\nLove Lives\nHappy Birthday, Leonardo DiCaprio! Relive His Past Romances\nCelebrity Style\n13 Pics That Prove Helena Christensen Can Wear Anything She Wants\nCelebrity Sightings\nLarsa Pippen and Shanina Shaik Struck a Pose at Coachella Party\nCelebrity Style\nFront Row Report: The Chanel Show Was Truly Epic\nCelebrity Sightings\nChrissy Teigen and Daughter Luna Enjoyed a Fun Day Out\nFashion Week\nThe Model Mix on the Dolce & Gabbana Runway Was Truly Out of the Ordinary\nFamily Time\nNorman Reedus, Ex Helena Christensen 'Incredibly Sweet' at Son's Graduation\nCeleb Sightings\nOlivia Culpo Hosted a Beauty Event for Best Buddies at Blushington\nFashion Week\nSee All of the Stars at the Versace Fashion Show\nNYFW\nNYFW Front Row Report: Lupita Nyong'o and More Stars at Calvin Klein\nCelebrity News\nStill a Babe! See Helena Christensen's Amazing Bikini Bod at 44\nCelebrity Body"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-son-and-ex-wife-speak-out-after-his-death/",
      "text": "Brandon Blackstock‘s son Seth and ex-wife Melissa Ashworth Wells have spoken out about the talent manager’s death.\n“I lost my hero yesterday, words can’t describe how proud of you I am on raising me and your 3 other kids,” Seth, 18, wrote via Instagram on Saturday, August 9, alongside a series of throwback photos with his late dad. “You were a father, a son, a brother, and most importantly my best friend.”\nSeth shared that while his father is no longer with him physically, his spirit will live on in other ways.\n“You’ll have to watch me grow up from a Birds Eye view now but that’s OK with me. There’s no one else on this earth that I would want to be my dad because no one can be half the man you were to me,” he continued. “I’ll see you everyday when the sun rises and falls. I can confidently say all the deer and elk took a sigh of relief when the best hunter I’ve ever known laid his rifle down for the last time.”\n“I love you so much and can’t wait to throw a line in the water with you again. Love you dad. Be good or good at it -love your son Seth,” he concluded.\nBrandon welcomed Seth with Ashworth Wells in 2007. The exes, who were married from 1999 to 2012, also shared daughter Savannah, 23. Savannah, for her part, shares son Lake with husband Quentin Lee. Following his split from Ashworth Wells, Brandon moved on with Kelly Clarkson. The pair tied the knot in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. Clarkson filed for divorce in 2020 after seven years of marriage.\nOne day before Seth’s tribute, Ashworth Wells shared an emotional post dedicated to Brandon.\n“Brandon was full of charm, wit, and just an absolute gentleman who happened to wear cowboy boots, wrangler jeans, and a cowboy hat. He was by far, hands down, the best Daddy and Pa. He loved hard and he fought hard,” she wrote via Instagram on Friday, August 8. “The best thing Brandon has left for his children is they know where he is. I’ve heard it said, ‘Nothing is lost when you know where it is’ and Brandon is with Jesus his Savior. Savannah, Seth, and our grandchildren are the best parts of who Brandon and I are. Thank you all for your prayers and condolences. ✝️.”\nBrandon died on August 7 following a private battle with cancer.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us Weekly in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nBrandon’s cause of death was due to melanoma, which is a form of skin cancer, and the manner of his death was natural causes."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-obituary-reveals-he-had-a-loving-partner/",
      "text": "Brandon Blackstock’s obituary is revealing details about his private life after his divorce from Kelly Clarkson.\n“After more than 20 years in the music business, Brandon found his way back to the mountains and the cowboy way of life he always wanted to live. He found a homestead and a love in Butte, Montana,” the tribute read.\nThe message continued, “Brandon, along with his beautiful and loving partner in life and business, Brittney Marie Jones, started building a life, building companies, and working tirelessly to create Headwaters Livestock Auction and what will live on as his legacy, The Valley View Rodeo in Bozeman, Montana.”\nThe news comes days after Blackstock died at age 48 following a private battle with cancer.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us Weekly in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nBlackstock’s cause of death was confirmed to be melanoma, a form of skin cancer, by Silver Bow County Coroner Dan Hollis. His manner of death is listed as natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement to People on Monday, August 11.\nBlackstock is survived by his four children. He shared son Seth and daughter Savannah with ex-wife Ashworth Wells, and daughter River and son Remington with ex-wife Clarkson. (Blackstock and Clarkson were married from 2013 until she filed for divorce in 2020. The pair’s divorce was finalized in 2022.\nWells has since paid tribute to Blackstock in an emotional Instagram post shared on Friday, August 8.\n“Brandon was full of charm, wit, and just an absolute gentleman who happened to wear cowboy boots, wrangler jeans, and a cowboy hat. He was by far, hands down, the best Daddy and Pa. He loved hard and he fought hard,” she wrote.\nShe continued, “The best thing Brandon has left for his children is they know where he is. I’ve heard it said, ‘Nothing is lost when you know where it is’ and Brandon is with Jesus his Savior. Savannah, Seth, and our grandchildren are the best parts of who Brandon and I are. Thank you all for your prayers and condolences. ✝️.”\nSeth, for his part, also honored his dad alongside a series of throwback photos with Blackstock. “I lost my hero yesterday, words can’t describe how proud of you I am on raising me and your 3 other kids,” Seth wrote via Instagram on Saturday, August 9. “You were a father, a son, a brother, and most importantly my best friend.”"
    },
    {
      "url": "https://www.usmagazine.com/celebrities/hailey-baldwin/",
      "text": "Hailey Bieber\nBorn Hailey Rhode Baldwin, Hailey Bieber is the daughter of actor Stephen Baldwin and graphic designer Kennya Deodato Baldwin.\nBieber began modeling in 2014 when she was signed to the New York agency Ford Models. In October of that year, she walked her first runway for Topshop. Bieber has also walked the runway for Tommy Hilfiger, Moschino, Tory Burch and Dolce & Gabbana, and she has appeared in campaigns for Ralph Lauren and Guess. She has since retired from runway modeling.\nIn 2017, she joined the TBS show Drop the Mic as a cohost alongside Method Man. She has appeared in music videos for Cody Simpson, DJ Khaled and her husband, Justin Bieber. Hailey has often made cameos on the Kardashian-Jenner family’s reality series as a family friend.\nIn March 2021, Hailey started her own YouTube channel to share beauty and lifestyle content and give fans a behind-the-scenes look at her projects. She announced the launch of her skincare line, Rhode Skin, in April 2022.\nHailey began dating Justin in December 2015, and the couple were linked on and off before splitting in 2016. After a brief relationship with Shawn Mendes, she reconciled with Justin in June 2018. The pair got engaged one month later in the Bahamas. They secretly tied the knot at a New York City courthouse in September 2018 before holding a second wedding in South Carolina in September 2019."
    },
    {
      "url": "https://swimsuit.si.com/swimsuit/model/brooks-nader-2025-si-swimsuit-photos",
      "text": "Nader won Swim Search back in 2019 and has shot with the brand every year since. Earning her first cover in 2023, this Baton Rouge native was deemed an SI Swimsuit legend in the 60th anniversary issue. After competing on Dancing With The Stars in 2024, Nader will make her return to reality TV in the summer of 2025, joining her three younger sisters—Grace Ann, Mary Holland and Sarah Jane—for a new show about their lives in the modeling industry titled Love Thy Nader.\nWith stunning turquoise waters and powdery shorelines, Bermuda is a tranquil yet vibrant backdrop for any photo shoot. Sitting 650 miles off the North Carolina coast, the 21-square-mile island is home to one of the world’s top beaches, Horseshoe Bay Beach. For those in need of an activity, visitors can cruise around the North Atlantic on a boat ride or get up close to the action by exploring the island’s coral reefs.\nLearn more about Bermuda, including where to stay, what to eat, and all of the can’t-miss activities here.\nAiming to channel an ethereal energy, the styling in Bermuda was heavily influenced by natural materials. The use of shells and pearls by the SI Swimsuit fashion team was intentionally balanced with lucite jewelry and other pieces meant to feel natural with just a hint of sparkle. The final looks were intended to be soft and feminine.\nHair: Brian Buenaventura at The Wall Group using Orlando Pita Play, Color Wow, and Olaplex. Makeup: Jodie Boland at The Wall Group using Supergoop!, Jones Road Beauty, Loving Tan and LilFox Beauty Photographer: Ben Watts\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Heidi Fish. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by It’s Now Cool. Top by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Andi Bagus. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Thats So Fetch. Earrings by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Norma Kamali. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by It’s Now Cool. Top by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Heidi Fish. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Lybethras. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Heidi Fish. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Thats So Fetch. Earrings by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Heidi Fish. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Andi Bagus. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Thats So Fetch. Earrings by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Lybethras. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Lybethras. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by bond-eye. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Top by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Lybethras. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Thats So Fetch. Earrings by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Elisabetta Franchi. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by It’s Now Cool. Top by JÉBLANC. / Ben Watts/Sports Illustrated\nBrooks Nader was photographed by Ben Watts in Bermuda. Swimsuit by Norma Kamali. / Ben Watts/Sports Illustrated\nKatie Austin and Brooks Nader were photographed by Ben Watts in Bermuda. Katie swimsuit by Andi Bagus. Brooks swimsuit by Andi Bagus. / Ben Watts/Sports Illustrated\nKatie Austin and Brooks Nader were photographed by Ben Watts in Bermuda. Katie swimsuit by Andi Bagus. Brooks swimsuit by Andi Bagus. / Ben Watts/Sports Illustrated"
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
      "text": "Machine Gun Kelly publicly addressed rumors of a romance with Sydney Sweeney.\nDuring an appearance on the Sunday, August 10, episode of Watch What Happens Live With Andy Cohen, MGK, whose real name is Colson Baker, was asked point-blank about his relationship with Sweeney, 27.\nAndy Cohen read from a question card that contained a viewer query from “Kyle P.” The TV host said, “MGK, Kyle P wants to know if there’s any truth to the rumor that you and Sydney Sweeney were more than just friends.”\nMGK, 35, responded while shaking his head and looking directly down the camera barrel, “Kyle P, shut up, dude,” at which Cohen and the audience laughed loudly.\nIn May, photos published by Page Six showed the musician and Sweeney hugging at a Las Vegas club opening. Later that month, MGK shared an Instagram carousel that included a snap of himself posing alongside Sweeney as they flashed peace signs at the camera. (Patrick Schwarzenegger and Hollywood hair stylist Glen Oropeza were also in the snap.)\nAn Instagram Story shared by Sweeney at the time, published by the outlet, also featured a photo of herself posing with Schwarzenegger, 31, and MGK at the Vegas event.\nBoth MGK and Sweeney are currently single after the musician’s split from Megan Fox was confirmed by Us Weekly in December 2024, and Sweeney’s engagement to Jonathan Davino was called off in May. (MGK shares a daughter, Saga, 4 months, with Fox, 39, in addition to daughter Casie, 16, whom he shares with ex Emma Cannon.)\nMGK and Sweeney have been friends for years, with Sweeney starring in MGK’s 2021 directorial debut, Downfalls High. The pair also appeared in the 2019 film Big Time Adolescence alongside MGK’s close friend Pete Davidson.\nMGK’s appearance on WWHL also saw an audience member ask him who his dream musical collaboration would be, living or dead, to which he responded, “ I like Frank, man, Frank Sinatra. I’ll do that.”\nHe was also asked by Cohen about how age, which garnered an interesting response from MGK: “It’s a weird thing, dude, I don’t know if it exists.”\nCohen likened MGK’s “connection to” his age to that of Mariah Carey, who told Harper’s Bazaar in July that she doesn’t “allow” herself to age, which drew MGK to say, “I just don’t know many facts about my life, so I’m starting to just be like, like, my skin, if it just rips open, it heals really quick, there’s just things where I’m starting to be, like, who’s my dad, you know?”\nHinting that he may have otherworldly origins, MGK noted that he once asked his mother if there was any “period of time where you went missing,” which provided an unusual answer.\n“She told me she got abducted at one point so I was just, like,” MGK said with a shrug."
    },
    {
      "url": "https://www.usmagazine.com/celebrities/gigi-hadid/",
      "text": "Gigi Hadid\nGigi Hadid was born Jelena Noura Hadid to real estate developer Mohamed Hadid and The Real Housewives of Beverly Hills star and former model Yolanda Hadid. After being discovered by designer Paul Marciano, Gigi began modeling at 2 years old for Baby Guess. (Her siblings Bella and Anwar are also models, and she has two half-sisters, Marielle and Alana.)\nGigi signed with IMG Models in 2011. She continued to work with Marciano before she was chosen as the face of a Guess campaign in 2012. She has been on several magazine covers since, including Vogue, Teen Vogue, Elle, Harper’s Bazaar, Sports Illustrated, Vanity Fair and Galore Magazine.\nGigi made her New York Fashion Week runway debut in February 2014, walking in Desigual’s show, and went on to walk in shows for Marc Jacobs, Versace, Elie Saab, Miu Miu, Balmain, Diane von Furstenberg, Tommy Hilfiger, Fenty x Puma, Chanel, Michael Kors, Jean Paul Gaultier, MaxMara and Giambattista Valli.\nIn December 2015, Gigi modeled in the Victoria’s Secret Fashion Show for the first time, returning in 2016 and 2018. As the face of Tommy Hilfiger, she codesigned a collection called Tommy x Gigi which was shown on the runway during the brand’s fall 2016 New York Fashion Week presentation.\nGigi dated singer Cody Simpson in 2013, but they called it quits in 2015. Later that year, she was briefly linked to Joe Jonas. She began dating Zayn Malik a few weeks after splitting from Jonas, and the couple were together on and off from 2015 to 2021.\nUs confirmed in April 2020 that Gigi was pregnant with her and Malik’s first baby. Their daughter, Khai, arrived in September 2020. Us confirmed in October 2021 that the pair had parted ways for good after a domestic dispute between Malik and Gigi’s mother.\nFollowing her split from Malik, Gigi was romantically linked to Leonardo DiCaprio, Cole Bennett and Bradley Cooper."
    },
    {
      "url": "https://www.usmagazine.com/celebrities/simone-biles/",
      "text": "Simone Biles\nSimone Biles is the most-decorated gymnast in history with 11 Olympic medals and 30 World medals. She made her Olympic debut at the 2016 Games in Rio de Janeiro, winning individual gold medals in all-around, vault and floor. She returned for the 2020 Tokyo Olympics but withdrew from the team competition and individual all-around meets to focus on her mental health. Biles won bronze in the balance beam competition and earned a silver medal for the team all-around. In 2023, Biles won her eighth U.S. Gymnastics title, breaking the 90-year-old U.S. title record previously held by Alfred Jochim. She returned for the 2024 Paris Olympics, winning gold with the team and individually for vault and all-around. She took home silver in the floor exercise.\nBiles came forward in 2018 as one of the many elite gymnasts who accused former Team USA doctor Larry Nassar of sexual assault. Nassar was sentenced to 40 to 175 years in state prison after pleading guilty to sexual assault of minors and an additional 60 years in federal prison.\nBiles previously dated fellow gymnast Stacey Ervin Jr. from 2017 to 2020. She started dating NFL star Jonathan Owens in 2020, and the couple tied the knot in 2023."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
      "text": "The official cause of death for Kelly Clarkson’s ex-husband, Brandon Blackstock, has been confirmed.\nSilver Bow County Coroner Dan Hollis told Us Weekly on Monday, August 11, that Blackstock’s cause of death was melanoma, a form of skin cancer, and the manner of his death was natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement.\nBlackstock died on August 7 after privately battling cancer for three years. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, Clarkson, 43, alerted fans to Blackstock’s illness when she put her Las Vegas residency on pause, though she didn’t reveal the nature of his condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she announced via Instagram on August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock wed in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. During their marriage, Blackstock worked as the singer’s manager. Clarkson ultimately filed for divorce in June 2020 after nearly seven years. The pair finalized the proceedings in March 2022 following a messy legal battle.\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The exes shared daughter Savannah, 23, and son Seth, 18.\nIn January 2022, Blackstock became a first-time grandfather when Savannah gave birth to her and now-husband Quentin Lee’s son, Lake. Savannah announced in July that the couple are expecting their second baby.\nOutside of his marriage to Clarkson, Brandon had another Hollywood connection via his father, Narvel Blackstock, who was Clarkson’s manager earlier in her career. Narvel was previously married to Reba McEntire from 1989 to 2015, during which time she was stepmom to Brandon and his two sisters, Chassidy and Shawna. Narvel and McEntire’s son, Shelby, who was born in 1990, was Brandon’s half-brother."
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    }
  ],
  "argos_summary": "In 2025, numerous celebrities showcased their stunning bikini styles, including Gisele Bundchen, Simone Biles, and Kim Kardashian, each flaunting unique swimwear looks during vacations and events. Brittany Mahomes made headlines for her chic bubblegum pink bikini just a month after giving birth, while Biles embraced a leopard-print bikini during a trip to South Africa. The article highlights various stars' fashionable swimwear moments throughout the year, emphasizing their confidence and style.",
  "argos_id": "50F1YGC2X"
}