{
  "url": "https://www.bostonglobe.com/2025/08/12/sports/jordan-hicks-red-sox/",
  "authorsByline": "Tim Healey",
  "articleId": "71eb1567260e4e99a6fdde9dc3c0aacc",
  "source": {
    "domain": "bostonglobe.com",
    "location": null
  },
  "imageUrl": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/v2/OPR7MT4HI6UEFVYF3KGT3KCBCI.jpg?auth=bfcf6f90e482c1d8505395335d8fcb5343fd5ee18d3ccb1ecbc3397f704b84c2&width=1440",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:36:57.834000+00:00",
  "addDate": "2025-08-13T00:42:35.695279+00:00",
  "refreshDate": "2025-08-13T00:42:35.695280+00:00",
  "score": 1.0,
  "title": "Red Sox reliever Jordan Hicks believes taking control of his pitch selection can turn his season around",
  "description": "“If I’m going to be giving up these kind of runs out of the bullpen, I should really be throwing the pitch I want to throw,” Hicks said after posting a 6.23 ERA in his first 14 appearances with the Sox.",
  "content": "However, after his latest mishap, giving up a two-run home run to the Astros’ Ramón Urías on Monday, Hicks has ideas on how to turn it around: throw his fastball more, ditch his sweeper, and get comfortable telling his catcher no.\n\nBut through six weeks, it hasn’t really worked out that way. Hicks has struggled, posting a 6.23 ERA and 1.69 WHIP in 14 appearances. He has as many walks and hit batters (11 total) as strikeouts. He has picked up just one hold (plus two saves) and hasn’t entered in such a spot in two weeks.\n\nHOUSTON — In the aftermath of trading Rafael Devers, when the Red Sox added to the active roster their first — and so far only — major league piece received in return, they put a lofty label on Jordan Hicks : late-inning reliever. He looked like a righthanded flamethrowing complement to lefthanded closer Aroldis Chapman.\n\n“If I’m going to be giving up these kind of runs out of the bullpen, I should really be throwing the pitch I want to throw,” Hicks said Tuesday. “It’s something I had to realize. That’s probably my mind-set moving forward. You have to throw what feels good in the situation. If you have any second thoughts, you’re not going to throw your best pitch.”\n\nStart with the fastball — or fastballs, since Hicks likes both, his four-seamer and his sinker. Against the latter, opposing hitters are slugging about .260 since Hicks joined the Sox.\n\nHe lamented that in several key spots recently, he didn’t trust his gut. He instead threw the breaking ball the catcher called. He cited his strikeout of Mauricio Dubón on Monday — on a 99-mph sinker over the heart of the plate that the hitter whiffed on — as an example of why he needs to be more insistent about what he wants.\n\n“I already use it a ton, so it’s more about knowing when to use the fastball,” Hicks said. “I just struck out Dubón on a heater the other day. Why am I throwing the slider or the sweeper? That’s on me. I need to take some ownership, throw the pitch I know is right and have that conviction. It all comes down to taking some ownership, throwing what I know is best in that situation and trusting myself.”\n\nHicks sometimes hasn’t used the pitch he wants because, he said, “being on a new team and trusting your catcher and just trusting what they might be seeing also, I feel like I’m kind of in that middle ground.” It’s a gray area, getting caught in between, that Hicks needs and wants to escape.\n\n“It’s more seeing how dominant in my eyes the fastball has been, how late everybody is on it,” he said. “Why am I even throwing anything else when the only hits they’ve really gotten [off the fastball] have been through the shift and in the infield, on the ground?”\n\nAnd then there is the matter of his slider (a harder breaking pitch that moves less) and his sweeper (a little slower but with more movement). This has been a source of frustration for Hicks, too.\n\nWhen he came off the injured list and made his Red Sox debut, he was excited about switching to the slider. It was going great, he said, but after he hung one against the Royals last week — deposited over the wall by Jonathan India — the Sox suggested mixing in a sweeper. So he did. Then he hung one of those to Urías.\n\nHicks is not confident in his sweeper in game action. He would rather stick with the slider, which he believes pairs better with his sinker.\n\n“I like the new one, the newer slider, because it’s more firm, it kind of looks like a heater longer,” he said. “After watching the slider and the sweeper, having a good enough sample size, they are kind of blending. I’d rather have one versus two that are kind of similar.”\n\nManager Alex Cora said: “He’s throwing the ball well. He hung a [sweeper] yesterday. We trust this guy. He’s a big part of what we’re trying to accomplish.”\n\nHicks, who has two years and $24 million left on his contract after this season, said he has had “open communication” with Red Sox pitching people on all this.\n\n“Which ones aren’t getting hit in the zone? It’s the harder, shorter one,” he said. “I have to see the ball go out to realize it. OK, maybe take a deeper look into which one is more effective.”\n\nThe Astros put closer Josh Hader on the injured list with a strained right shoulder Tuesday. That’s why he was not available in Houston’s narrow 7-6 win over the Red Sox on Monday.\n\nManager Joe Espada called it a “punch to the gut.”\n\nHader was getting further tests, so the club wasn’t immediately sure how severely he is hurt.\n\nThe Astros also designated Héctor Neris for assignment, a day after he reached 10 years of major league service time.\n\nRighthander Hunter Dobbins had surgery to repair his torn right ACL . . . Reliever Luis Gurrero (right elbow strain) threw a 25-pitch live batting practice in Fort Myers, Fla. . . . The Red Sox released righthander Robert Stock from Triple A Worcester. He had two appearances in two stints with the major league team … Garrett Whitlock’s 46th appearance, a two-inning stint Monday, matched the personal high he set in 2021, his rookie year.\n\nTim Healey can be reached at timothy.healey@globe.com. Follow him @timbhealey.",
  "medium": "Article",
  "links": [
    "https://www.twitter.com/timbhealey",
    "https://www.bostonglobe.com/2025/08/12/sports/mlb-world-series-postseason-schedule/?p1=Article_Inline_Related_Link",
    "https://www.bostonglobe.com/2025/08/12/sports/hunter-dobbins-red-sox/",
    "https://www.bostonglobe.com/2025/08/11/sports/red-sox-astros-game/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Red Sox reliever Jordan Hicks",
      "weight": 0.0922452
    },
    {
      "name": "Red Sox",
      "weight": 0.08058653
    },
    {
      "name": "Jordan Hicks",
      "weight": 0.07825938
    },
    {
      "name": "Hicks",
      "weight": 0.0748134
    },
    {
      "name": "Sox",
      "weight": 0.06412473
    },
    {
      "name": "major league",
      "weight": 0.05690213
    },
    {
      "name": "major league service time",
      "weight": 0.05461921
    },
    {
      "name": "fastballs",
      "weight": 0.054388307
    },
    {
      "name": "right elbow strain",
      "weight": 0.051960055
    },
    {
      "name": "closer Josh Hader",
      "weight": 0.05140194
    }
  ],
  "topics": [
    {
      "name": "Baseball"
    },
    {
      "name": "Boston Red Sox"
    },
    {
      "name": "MLB"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.97802734375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.94140625
    }
  ],
  "sentiment": {
    "positive": 0.07545588,
    "negative": 0.6262559,
    "neutral": 0.29828814
  },
  "summary": "Red Sox reliever Jordan Hicks has been struggling this season, posting a 6.23 ERA and 1.69 WHIP in 14 appearances, with as many walks and hit batters as many as strikeouts. Hicks has suggested that he should throw his fastball more and become more comfortable with telling his catcher no. He believes this strategy could help him turn around his season. Hicks, who has two years left on his contract with the Red Sox, expressed his desire to take more control of his pitch selection. He also expressed frustration over his decision to switch to the slider over the sweeper, which he believes pairs better with his sinker.",
  "shortSummary": "Jordan Hicks, despite a strong fastball and sweeper performance, believes controlling his pitch selection can improve his season, despite inconsistent performances and inconsistent performances.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f249646766fc45fca6c959f40521a021",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.bostonglobe.com/2025/08/11/sports/red-sox-astros-game/",
      "text": "HOUSTON — More than four months into his first season, Garrett Crochet had his first truly bad game with the Red Sox on Monday night.\nThey lost to the Astros, 7-6, at Daikin Park after Crochet got pummeled for five runs in four innings.\nIt was the first time in 24 starts this year that he failed to finish five frames. The runs allowed matched his total from his previous 30 innings — a span that stretched back more than a month.\n“Obviously, my worst one since I’ve worn the Red Sox uniform, so it’s tough,” Crochet said. “It’s not like there’s a good time for it ever, but it’s tough to come right now for sure. We’ve got a lot of goals as a team right now and I’d like to contribute in any way possible and keep stacking wins, whether it be gaining in the division or standings as a whole.\n“It’s a tough line, but overall, execution wasn’t bad. Just chalk it up to their approach was better than mine tonight and move on.”\nAdvertisement\nThe Red Sox (65-55) have lost three consecutive games for the first time since late June, when they dropped six in a row as they were finding themselves following the Rafael Devers trade.\nCrochet’s outing was split in half. In the first two innings, the Astros went 1 for 7 with four strikeouts. In the next two, they went 6 for 12 with a home run, three doubles, a walk, and just one strikeout.\nThe problem, according to Crochet, was his game plan. The first time through the order, he threw more sweepers than normal, instead of his usual fastball-heavy approach. He decided on that because of “their aggressive tendencies,” which was “just something that revealed itself when doing my scouting,” he said.\nAdvertisement\nIt worked, but it left Crochet in a weird spot the second time through the order. Normally, that is when he introduces his breaking ball more regularly. This time, the Astros (67-52) already had seen it a bunch.\n“They were able to be a little bit closer to pitches,” he said. “They weren’t exactly hammering all of them, but it was foul balls that ultimately forced me to come back into the zone.\n“I felt like as a whole — even the spin, the four-seamers, in general — I was executing well. I kind of pegged this lineup for a team that I didn’t have to use the four-seam to, knowing their aggression. But then after I got to two strikes, it was just continued battle from their side.”\nThe Sox led, 2-0, when Houston struck back for three runs in the third inning. The big blow was Christian Walker’s booming, go-ahead, two-out, two-run double to left-center field.\nIn the fourth, Chas McCormick banged a two-run homer off the back wall beyond the Crawford Boxes in left field.\n“Especially with two strikes, it seems like they took the humble approach instead of trying to go big,” manager Alex Cora said.\nCora and Crochet conversed in the dugout after the pitcher came out of the game.\n“We agreed that there was some bad luck involved and also he didn’t execute some pitches,” Cora said.\nCrochet said: “I didn’t feel like I struggled with execution outside of three pitches, and two of them were hit hard and that ultimately decided my stat line for the night.”\nAdvertisement\nAstros righthander Cristian Javier was largely effective in his return from Tommy John surgery, holding the Sox to two runs in five innings in his first start in nearly 15 months.\nThe Red Sox started off with a bang. Roman Anthony hammered Javier’s first pitch to left-center field for a single. Former Astros star Alex Bregman — moments after tipping his cap to a round of applause from adoring Houston fans — hit a home run to left.\nFour pitches into the game, the Sox led by a pair. They went 1 for 15 the rest of Javier’s outing. Their only other hit was Jarren Duran’s two-out single in the third.\nBregman’s long ball was a storybook moment of sorts in his first game back in Houston after leaving the Astros for the Red Sox via free agency last offseason. The club honored him with a tribute video before the game, and the crowd followed suit with a standing ovation.\n“Every time you hit a homer in the big leagues, it’s pretty special,” Bregman said. “But to be able to do it the first at-bat back here was a pretty cool moment I’ll never forget.”\nAlex Bregman marks his return to Houston with a blast 💥 pic.twitter.com/tJvyg9r64x\n— MLB (@MLB) August 12, 2025\nWhen he stepped to the plate for his second at-bat, the crowd booed, seemingly in good fun.\n“It was great,” Bregman said with a big smile. “I loved it. I loved it. I was hoping they would. It’s two good teams getting after it. They want to win. Both teams want to win really badly. It’s fun. It’s good for the game.”\nAdvertisement\nTrailing, 7-2, the Red Sox got within one partially because of Anthony’s two-run homer in the seventh.\nAnthony also batted with the would-be tying run on second base in the ninth, but he struck out swinging against Bennett Sousa to end the game. That stranded Bregman in the on-deck circle.\n“I was just praying,” Bregman said, “for that at-bat.”\nTim Healey can be reached at timothy.healey@globe.com. Follow him @timbhealey."
    },
    {
      "url": "https://www.bostonglobe.com/2025/08/12/sports/mlb-world-series-postseason-schedule/?p1=Article_Inline_Related_Link",
      "text": "NEW YORK — Major League Baseball dropped its plan to start the World Series early if both League Championship Series are short, announcing Tuesday that this year’s Fall Classic will start on Oct. 24.\nMLB last year said Game 1 would move up from Oct. 25 to Oct. 22 if the LCS ended by Oct. 19, when both leagues were scheduled to be through Game 5. But the Mets won Game 5 of the NL Championship Series before losing to the Dodgers in Game 6.\nSince the LCS expanded to best-of-seven in 1985, both leagues ended in four or five games in 1989, 2001, 2002, 2014, and 2022. Last year was the first in which MLB announced a flexible schedule.\nGame 7 of this year’s World Series would be on Nov. 1. The World Series ended in November in 2001, ‘09, ’10, ‘15, ’16, ‘17, ’21, ‘22 and ’23, going as late as Nov. 5 in 2022.\nThe World Series is scheduled to start on a Friday for the fifth straight year. Before 2022, the Series had not started on a Friday since 1915.\nAdvertisement\nNL Division Series will have an extra scheduled off day between Games 1 and 2, a format that allows a team to have the same pitchers start Games 1 and 4, and Games 2 and 5 on normal four days’ rest. Last year, AL Division Series had the extra off day.\nAll four best-of-three Wild Card Series are scheduled for consecutive days from Sept. 30 to Oct. 2 at the site of the higher seed.\nTwelve teams make the playoffs under the format that began in 2022. The top two teams in each league get first-round byes, while the No. 3 seed faces No. 6 and No. 4 plays No. 5. The higher seed will be home in each best-of-three series.\nAdvertisement\nIn the best-of-five Division Series, the top seed plays the 3-vs.-6 winner and the No. 2 seed plays the 4-vs.-5 winner. The Division Series will have the familiar format of the higher seed home for Games 1 and 2, and, if necessary, Game 5.\nAL Division Series also will start Oct. 4-5 followed by a travel day and switch to the other sites for games on Oct. 7-8. Game 5s would be Oct. 10.\nNL Division Series start on Oct. 4, have an off day followed by Game 2 on Oct. 6, then switch to the other cities on Oct. 8-9. After another travel day, Game 5s would be played Oct. 11.\nThe AL Championship Series starts Oct. 12 and the NL Championship Series the following day, with off days after Game 2s and Game 5s."
    }
  ],
  "argos_summary": "Jordan Hicks of the Red Sox is struggling as a late-inning reliever, posting a 6.23 ERA and 1.69 WHIP in 14 appearances, with equal walks and strikeouts. He plans to focus more on his fastball and assert his pitch preferences to improve his performance. Meanwhile, the Red Sox recently lost to the Astros 7-6, with Garrett Crochet experiencing his first poor outing of the season, allowing five runs in four innings. Additionally, MLB has announced that the World Series will start on October 24, maintaining a fixed schedule despite previous flexibility.",
  "argos_id": "52T86TEAA"
}