{
  "url": "https://www.morningstar.com/news/marketwatch/2025081292/if-the-inflation-data-go-trumps-way-will-you-trust-it",
  "authorsByline": "",
  "articleId": "0c7487227c944931b932742cad83cdf3",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T13:54:00-05:00",
  "addDate": "2025-08-12T19:23:55.016284+00:00",
  "refreshDate": "2025-08-12T19:23:55.016286+00:00",
  "score": 1.0,
  "title": "If the inflation data go Trump's way, will you trust it?",
  "description": "",
  "content": "Federal statistics staff just won a reprieve from the president's ire\n\nHeritage Foundation economist E.J. Antoni, tapped by President Trump to take over as commissioner of the Bureau of Labor Statistics.\n\nWhen news broke that former President Calvin Coolidge had died, Dorothy Parker is reported to have joked: \"How can they tell?\"\n\nA cynic is tempted to make much the same response about the latest inflation figures.\n\nYes, they look better than expected. And they will make President Trump happy.\n\nBut it's also true that a mere 10 days after the head of the federal Bureau of Labor Statistics got fired for reporting numbers that the president didn't like, her remaining staff have reported numbers that the president ... er ... seems to like.\n\nHis temporary proxy heading to the Federal Reserve's board, Stephen Miran, said the consumer-price index released on Tuesday showed no evidence of inflation.\n\nIt's almost like a bunch of middle-class statisticians with mortgages and kids didn't want to lose their jobs, and be personally named and shamed before the MAGA army as an enemy of the American people.\n\nDoes this mean the latest monthly inflation data were cooked to fit the president's political agenda? Let's assume for the sake of argument that they haven't been. Let's assume, instead, that the BLS staff just got lucky.\n\nBut here's the Dorothy Parker-type question, only serious: How can you be sure?\n\nProof that the president is determined to assert direct, partisan political control of economic data came Monday night. Hours after he had ensured that the headlines would be dominated by his D.C. takeover, he disclosed his new nominee for commissioner of the Bureau of Labor Statistics. It was, as they say, a good day to bury bad news.\n\nThe nominee, E.J. Antoni, is an economist at the Heritage Foundation, the right-wing think tank that birthed \"Project 2025.\" His appointment is even being derided by the professional economists at conservative-friendly Manhattan and Cato Institutes. On the other hand, Steve Bannon is a big fan.\n\nAt least President Trump didn't nominate Laura Loomer or Sean Hannity. Maybe he's waiting to nominate one of them for the Fed.\n\nWhat does the crisis at the BLS mean?\n\nThe thing about statistics is that they are easy to manipulate. It was Benjamin Disraeli who first coined the joke about \"lies, damned lies, and statistics,\" and the situation hasn't gotten much better since.\n\nYou don't believe me? Just look at the latest numbers.\n\nWhat's the latest inflation number? Take your pick. The latest consumer-price index for all consumers is supposedly 2.7% if you take the national average, but 3.2% in the Northeast and 2.3% - nearly a full point lower - in the South. It's 4.0% in and around San Diego, and just 0.9% around Dallas-Fort Worth.\n\nFood prices account for 14% of the official inflation calculations. What happened to your food prices last month? That didn't just depend on what you ate and where you live, but how much you ate out. According to the new BLS, food prices for people who ate at home fell 0.1% from June to July last month, while food prices for people who ate out rose by 0.3%.\n\nMeat prices in the grocery store apparently rose 1% last month, or at an annualized rate of about 13%. But egg prices reportedly fell 3.9% in a month - which works out at an astonishing annualized rate of inflation of minus 38%.\n\n\"Give us this day our daily bread,\" goes the prayer. But what kind? White-bread prices apparently fell last month, by 0.1%. But all other bread rose by 1.2%.\n\nYou can check out all these numbers here.\n\nSo what is inflation for a meat eater? What about a vegetarian who eats lots of eggs? What about a vegan? Who is the \"average\" consumer and what did they eat? And how do you account for sales and specials?\n\nAnd that's nothing compared to the biggest problem: The official inflation costs for housing.\n\nThis, in total, accounts for as much as 44% of the government's inflation calculations. So any changes to the housing numbers would have a major effect on the overall inflation data. And the housing numbers are astonishingly easy to manipulate.\n\nThat's because nobody can really agree on what they are. Do you take new-home prices? New rents? Mortgage rates? And that's before you get into things like taxes, utilities and insurance.\n\nThe biggest part of the government's calculations by far - 26% of the total inflation data - comes from something called \"owner's equivalent rent.\" The way they calculate this is that they ask homeowners to estimate - to guess, in other words - how much their home would cost to rent.\n\nBut this raises all sorts of issues. For example, who do you ask? How do they reach their estimates? How accurate are their estimates? And, maybe most importantly, how relevant are these estimates anyway?\n\nFor example, according to BLS data, \"owner's equivalent rent\" nationwide rose 6% during the COVID crisis, from February 2020 to February 2022. But during that time many rents collapsed, especially in cities, as landlords struggled to find tenants. And many or most homeowners also saw their homeownership costs plummet, as they refinanced their 30-year mortgages at epically low interest rates. During that period, the rate on long-term mortgages fell as low as 2.6%.\n\nSo you could argue the cost of homeownership, at least as it was reflected in the inflation figures, should have gone down, not up.\n\nAnd, just to show that I like to annoy Democrats as well as Republicans, let me point out that, right now, these numbers may be grossly overestimating actual inflation. (In other words, Trump may well have a point.)\n\nThe latest inflation numbers say that average housing costs have risen 3.9% in the last year. And owner's equivalent rent has risen 4.2%.\n\nYet during the same period, Realtor.com reports that average starting rents fell by 2.5%. (Realtor.com is owned by News Corp, which also owns MarketWatch). Its latest data also show average listings prices have risen just 0.5%. And the Case-Shiller index of national U.S. home prices has risen, but only by 2.2% (through May). The average interest cost of a new 30-year mortgage has risen about 2.5%. (The latest average rate is 6.63%; a year ago, it was 6.47%.)\n\nBut the BLS says housing costs are up around 4%. Take your pick.\n\nThe main takeaway is that these data are ripe for all the conspiracy theories you want - left or right, democratic socialist or MAGA. The numbers are wide open to manipulation without anyone actually lying. All you'd have to do is change some of your assumptions.\n\nIf you wanted, say, to make the inflation numbers miraculously go down, it's easy. If you replaced owner's equivalent rent with, say, data from new rents, the CPI (at the moment) would plunge. Ditto if you assume people ate a little less beef and a little more pork: Beef is apparently up 11% in a year, while pork has risen just 1%.\n\nThe bottom line? Inflation data are easy to manipulate. After the shock firing of the commissioner of labor statistics, the new data have gone Trump's way. If they continue to do so, don't be surprised.\n\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Inflation data",
      "weight": 0.08555592
    },
    {
      "name": "BLS data",
      "weight": 0.06762993
    },
    {
      "name": "inflation",
      "weight": 0.067611374
    },
    {
      "name": "actual inflation",
      "weight": 0.06655927
    },
    {
      "name": "average listings prices",
      "weight": 0.06494075
    },
    {
      "name": "Food prices",
      "weight": 0.06338056
    },
    {
      "name": "food prices",
      "weight": 0.06338056
    },
    {
      "name": "national U.S. home prices",
      "weight": 0.06265128
    },
    {
      "name": "New rents",
      "weight": 0.061945483
    },
    {
      "name": "new rents",
      "weight": 0.061945483
    }
  ],
  "topics": [
    {
      "name": "Inflation"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.95361328125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.93359375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.9248046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.7158203125
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.7041015625
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.6142578125
    }
  ],
  "sentiment": {
    "positive": 0.051222045,
    "negative": 0.7313275,
    "neutral": 0.2174504
  },
  "summary": "President Trump has appointed E.J. Antoni, an economist at the Heritage Foundation, to take over as commissioner of the Bureau of Labor Statistics. This follows the dismissal of the head of the federal Bureau of Employment and Statistics, who was fired for reporting numbers that the president didn't like. However, his remaining staff has reported numbers that appear to align with the president's agenda. This comes as Stephen Miran, the temporary representative for the Federal Reserve's board, said the consumer-price index released on Tuesday showed no evidence of inflation. This suggests that statistics are easy to manipulate, as housing numbers are often difficult to interpret. Food prices account for 14% of the official inflation calculations, and housing costs account for 44% of total government's inflation calculations.",
  "shortSummary": "President Trump's pick for Labor Statistics, E.J. Antoni, faces criticism for allegedly manipulating inflation data, which are better than expected but politically influenced.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "363f3c079c9244039aebfd2d2c89da42",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The recent inflation figures reported by the Bureau of Labor Statistics (BLS) appear favorable to President Trump, raising concerns about potential manipulation of data following the firing of the previous commissioner for reporting unfavorable numbers. The new nominee, E.J. Antoni, has ties to the Heritage Foundation, prompting skepticism about the integrity of the statistics. The article highlights the complexities and potential biases in calculating inflation, particularly regarding housing costs and food prices, suggesting that the data can be easily influenced to fit political agendas.",
  "argos_id": "55N644VK4"
}