{
  "url": "https://www.usatoday.com/story/news/politics/2025/08/12/trumps-bls-nominee-suggests-suspending-jobs-reports/85627644007/",
  "authorsByline": "Joey Garrison",
  "articleId": "21043f705bd64dad988e3139cb56b986",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/12/USAT/85631184007-2228882322.jpg?crop=4479,2521,x0,y231&width=3200&height=1802&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:11:44+00:00",
  "addDate": "2025-08-12T20:18:42.437131+00:00",
  "refreshDate": "2025-08-12T20:18:42.437133+00:00",
  "score": 1.0,
  "title": "Trump's BLS commissioner pick suggests suspending monthly jobs reports",
  "description": "E.J. Antoni, Trump's pick as commissioner of Labor Statistics, recently endorsed halting monthly jobs reports until the methodology is changed.",
  "content": "WASHINGTON ― President Donald Trump's nominee to be the new U.S. commissioner of Labor Statistics recently suggested the agency stop issuing monthly jobs reports until the methodology used to compute the figures is changed.\n\nE.J. Antoni, a Heritage Foundation economist who Trump tapped on Aug. 11 to replace the Bureau of Labor Statistics commissioner he fired, proposed the idea during an Aug. 4 interview to Fox News Digital. He questioned the agency's methodology and economic assumptions because of recent jobs revisions, calling it a \"serious problem that needs to be fixed immediately.\"\n\n\"Until it is corrected, the BLS should suspend issuing the monthly job reports but keep publishing the more accurate, though less timely, quarterly data,\" Antoni said. \"Major decision-makers from Wall Street to DC rely on these numbers, and a lack of confidence in the data has far-reaching consequences.\"\n\nIf confirmed by the Senate, Antoni would replace Erika McEntarfer, an appointment of former President Joe Biden who Trump fired on Aug. 1. Trump accused McEntarfer without evidence of manipulating data for \"political purposes\" after the Bureau of Labor Statistics reported the U.S. added a disappointing 73,000 jobs in July. Trump also complained about revisions that reduced job gains in May and June by about 258,000 and portrayed a much weaker labor market than Trump has touted.\n\nWhite House press secretary Karoline Leavitt downplayed Antoni's recent remarks, saying he only \"floated the idea of possibly\" suspending the months jobs reports. She said it is \"the plan and the hope\" for the BLS to continue releasing monthly jobs reports.\n\n\"We need to look at the means and the methods, and how the United States is acquiring this very important data, and all of that is going to be done,\" Leavitt said during an Aug. 12 briefing with reporters. \"And the goal, of course, is to provide honest and good data for the American people.\"\n\nThe Aug. 1 revisions for May and June marked the largest two-month revision ever outside of recessions, according to an anlaysis from Goldman Sachs.\n\nEach month, the BLS provides an initial reading of job gains for the previous month and revises figures from the prior two months twice based on follow-up surveys.\n\nTo come up with its monthly job growth estimates, the agency surveys 631,000 job sites operated by 121,000 businesses and government agencies across the country. The bureau revises the data twice because many employers don’t respond to the first survey or because officials modify the factors it uses to seasonally adjust the figures.\n\nMost economic forecasters say this year's large revisions have cleared up a disparity between surprisingly resilient job gains and other economic indicators, such as gross domestic product, that have been feeble this year.",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/news/politics/donald-trump/",
    "https://www.usatoday.com/story/news/politics/2025/08/11/donald-trump-ej-antoni-bureau-of-labor-statistics/85618859007/",
    "https://www.foxbusiness.com/politics/trumps-bls-pick-could-pause-monthly-jobs-report-over-accuracy-concerns",
    "https://www.usatoday.com/story/money/2025/08/06/jobs-downward-revisions-data-trump-bls-chief/85534445007/",
    "https://www.usatoday.com/news/politics/joe-biden/",
    "https://www.usatoday.com/story/money/2025/08/01/jobs-report-july-2025-data/85467514007/",
    "https://truthsocial.com/@realDonaldTrump/115012532470689820",
    "https://www.usatoday.com/picture-gallery/news/politics/2025/08/04/trump-white-house-rose-garden-transformation-photos/85507074007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "monthly jobs reports",
      "weight": 0.1059836
    },
    {
      "name": "recent jobs revisions",
      "weight": 0.10332013
    },
    {
      "name": "job gains",
      "weight": 0.09955785
    },
    {
      "name": "data",
      "weight": 0.07728974
    },
    {
      "name": "Donald Trump",
      "weight": 0.069820315
    },
    {
      "name": "Trump",
      "weight": 0.06838623
    },
    {
      "name": "Labor Statistics",
      "weight": 0.0656237
    },
    {
      "name": "revisions",
      "weight": 0.062558234
    },
    {
      "name": "the monthly job reports",
      "weight": 0.06254822
    },
    {
      "name": "White House press secretary Karoline Leavitt",
      "weight": 0.062385533
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9404296875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.90771484375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.88134765625
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.64208984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Work & Labor Issues",
      "score": 0.406005859375
    },
    {
      "name": "/Business & Industrial/Business Operations/Human Resources",
      "score": 0.339599609375
    }
  ],
  "sentiment": {
    "positive": 0.03842401,
    "negative": 0.77327573,
    "neutral": 0.18830031
  },
  "summary": "President Donald Trump's nominee, E.J. Antoni, has suggested that the Bureau of Labor Statistics (BLS) should suspend issuing monthly jobs reports until the methodology used to compute the figures is changed. This comes after Antoni questioned the agency's methodology and economic assumptions following recent job revisions. If confirmed by the Senate, Antoni would replace Erika McEntarfer, who Trump previously accused of manipulating data for political reasons. The White House downplayed Antoni's suggestion, stating it is the plan and the hope for the BLS to continue publishing monthly jobs report.",
  "shortSummary": "President Donald Trump's nominee, E.J. Antoni, suggests suspending monthly jobs reports due to concerns over the BLS' methodology and economic assumptions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "d3c8a5b40c9048158f3b297a7eda4656",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/money/2025/08/06/jobs-downward-revisions-data-trump-bls-chief/85534445007/",
      "text": "Why jobs revisions that led Trump to fire statistics head were so huge\n- Downward revisions to U.S. job growth numbers are attributed to a slowing economy and job market impacted by trade and immigration policies.\n- Economists believe the revisions reflect a genuine economic slowdown rather than data manipulation, citing factors like declining survey response rates and the impact of tariffs.\nThe massive downward revisions to U.S. job growth that led President Donald Trump to fire the head of the agency that reported the numbers can be explained by a rapidly slowing economy and job market amid Trump’s trade and immigration policies – not data manipulation, forecasters say.\nTrump on Aug. 1 fired Erika McEntarfer, the commissioner of the Bureau of Labor Statistics, hours after the agency reported a disappointing 73,000 job gains for July, and more significantly, revised down payroll growth for May and June by an outsize 258,000.\nThat marked the largest two-month revision ever outside of recessions, Goldman Sachs said. It left monthly job gains averaging an anemic 35,000 from May through July.\n“Important numbers like this must be fair and accurate, they can't be manipulated for political purposes,” Trump said on Truth Social. He added that “today's jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad.”\nBut forecasters said the revisions actually clear up a disparity between surprisingly resilient job gains and other economic indicators, such as gross domestic product, that have been feeble this year.\n“I think the revisions have really resolved a discrepancy between GDP data and payrolls,” said Samuel Tombs, chief economist of Pantheon Macroeconomics. “I don't see any reason to suspect manipulation here.”\n“Taken together, the economic data confirm our view that the U.S. economy is growing at a below-potential pace,” Goldman Sachs wrote in a note to clients.\nWhat is the state of the economy?\nTrump’s tariffs hammered activity in the first quarter by pumping up imports (which are subtracted from growth) as retailers and manufacturers stocked up on foreign goods to avoid the imminent levies. That led to a second-quarter reversal that juiced GDP. After the tariff effects canceled each other out, the economy grew at a meager annual rate of 1.2% the first half of the year.\nThere are two ways to grow the economy – by adding workers and by increasing productivity, or output per worker. Since the 1.2% average rise in GDP can be entirely explained by strong productivity gains, the economy’s sluggish performance is consistent with virtually no net job gains from May through July, Tombs said.\nThere are other signs that the economy and job market are losing steam. Just 42% of CEOs of small and midsize companies plan to add to their staffs in the next year, the lowest on record dating to 2003, according to a June survey by Vistage, a CEO networking group.\nHow does the jobs report work?\nEach month, the BLS provides an initial reading of job gains for the previous month and revises figures from the prior two months twice based on follow-up surveys. The downgrade of 133,000 jobs for June marked the first revision for that month, and May's 125,000 drop was its second and final revision.\nTo come up with its monthly job growth estimates, the agency surveys 631,000 job sites operated by 121,000 businesses and government agencies across the country. The bureau revises the data twice because many employers don’t respond to the first survey or because officials modify the factors it uses to seasonally adjust the figures, Goldman said. For example, since hiring is traditionally weak in the summer, the seasonal adjustment would boost the employment tally to account for that dip.\nEven before Aug. 1’s stunning revisions to May and June, job growth for January through April was revised down each month by an average of 52,000 ‒ based on changes from the first to the third estimates. Last year saw an average downward revision as well, but it was just 20,000. Since 1979, the median two-month combined estimate change was an upward revision of 10,000.\nHere's why economists believe the payroll revisions for May and June were so large:\nFalling response rates, slowing economy\nA declining share of employers have been responding to the BLS’s job surveys. In July, 58% responded, similar to July 2024 but down from 68% in the same period in 2022 and 2023 and an average 74% in the 2010s, according to Tombs and BLS figures.\nSmall businesses, in particular, have struggled to cope with Trump’s tariffs, which must be passed along to consumers through higher prices or absorbed by the companies, squeezing their profits, Tombs said.\nAmid those troubles, “Responding to BLS is not a high priority” for small- and midsize firms, said Jonathan Millar, senior U.S. economist at Barclays.\nSome firms also may be hesitant to acknowledge they've pared back hiring, even though the surveys are anonymous, Tombs said.\nWhen they ultimately do report their staffing numbers – the response rate for the third payroll estimates has topped 90% – they likely have decreased from the previous month. Companies increasingly have been holding off on hiring due to the uncertainty generated by the tariffs, Millar and Tombs said.\nThat likely has sparked sharp downward revisions to job gains throughout 2025, but the hiring pullback may have reached “an inflection point” in May and June that more dramatically dimmed the jobs picture, Millar said.\n“I don’t think we've faced a situation where we had such a profound supply shock,” Millar said, referring to the constraint on foreign parts and products caused by tariffs.\nHow the government interprets slowing job gains\nWhen job growth slows, BLS in its first estimate mistakenly attributes the downshift to changes in seasonal trends, Goldman Sachs said. But as subsequent readings also come in softer, the agency's model learns it’s not the result of a seasonal adjustment quirk but rather a genuine pullback in hiring and revises down the jobs totals, the research firm said.\nThe immigration crackdown\nFormer President Joe Biden began restricting crossings at the Southern border in June 2024 and Trump stepped up enforcement and launched massive deportations in 2025, Millar said. Since it takes six to nine months for migrants to settle into jobs, the crackdown likely started to show up more prominently in the jobs numbers in May and June, he said.\nLittle hiring, few layoffs\nFor many months, employers haven’t hired lots of workers, but also haven’t laid off many after grappling with dire worker shortages during the pandemic. That unusual dynamic could be throwing off seasonal adjustment factors that expect ramped-up hiring and layoffs at certain times of the year, causing officials to revise down job gains more sharply, Goldman suggested.\nState and local government jobs\nAbout 20% of the big downward revision in May and June was due to the challenges of making seasonal adjustments to state and local education employment figures at the end of the school year, when many teachers and other employees come off the payroll, Goldman said. Initially, BLS overestimated total job numbers in that sector after seasonal adjustments and then revised down the figure by 51,000 for the two months, Goldman said.\nContributing: Joey Garrison, USA TODAY; Reuters"
    },
    {
      "url": "https://www.usatoday.com/story/money/2025/08/01/jobs-report-july-2025-data/85467514007/",
      "text": "July jobs report reveals employers added 73,000 jobs; unemployment rises\nU.S. employers added a disappointing 73,000 jobs in July as payroll growth slowed amid President Donald Trump's sweeping import tariffs, intensifying immigration crackdown and massive federal layoffs.\nEven more concerning: Job gains for May and June were revised down by a whopping 258,000, portraying a much weaker labor market than believed in late spring and early summer and raising the odds the Federal Reserve will cut interest rates in September.\nThe unemployment rate rose from 4.1% to 4.2%, the Labor Department announced on Friday, Aug. 1.\nBefore the report was released, economists had estimated that 105,000 jobs were added in July.\n\"The cracks in the labor market have widened substantially and add further pressure on the Federal Reserve to lower interest rates,” Nationwide chief economist Kathy Bostjancic wrote in a note to clients.\nHow's the job market right now?\nEconomists believed the labor market has been remarkably resilient in recent months despite Trump's economic policies, adding well over 100,000 jobs per month from April through June. But payroll gains for May have now been revised from 144,000 to 19,000 and June’s additions were downgraded from 147,000 to 14,000.\nOver the past three months, U.S. job gains have averaged just 35,000.\n\"To me, today’s jobs report is what entering a recession looks like,\" Josh Bivens, chief economist of the left-leaning Economic Policy Institute, said in a statement.\nWhile layoffs have remained low, hiring has been soft and fell to a 12-month low in June. June's overall job gains appeared to be bolstered by state and local government hiring but even that silver lining has faded with the outsize revisions to job growth in the spring.\nThe dismal report adds to a dimming outlook for the U.S. economy. The broader economy grew at a healthy 3% annual rate in the second quarter, the Commerce Department said the week of July 28. But the numbers were pumped up by the reversal of a tariff-related surge in imports that caused the economy to contract early in the year.\nWhat industries are in high demand?\nHealth care, a reliable job generator the past couple of years, again drove the payroll gains with 55,000 but few other sectors added jobs. Professional and business services lost 14,000; manufacturing shed 11,000 and leisure and hospitality, which includes restaurants and bars, added just 5,000. For months, private-sector job creation has been concentrated in health care, leisure and hospitality and little else.\nIn July, businesses added a relatively meager 83,000 jobs but it marked progress compared to the paltry 3,000 added in June following the latest revisions. Economist Thomas Ryan of Capital Economics said it may be a sign of firms feeling more confident adding workers as uncertainty from Trump's early April \"Liberation Day\" reciprocal tariffs has eased.\nIs there a federal hiring freeze in 2025?\nMeanwhile, the federal government is shedding workers in droves, shedding 12,000 in July and a total of 84,000 since January. A federal hiring freeze was extended from July to October, while 154,000 federal employees have accepted buyouts and tens of thousands more have been laid off. Only a small portion of the layoffs have shown up in the monthly job numbers because they were being challenged in court. The Supreme Court, however, recently lifted that injunction, possibly curtailing employment further last month, Capital Economics said.\nGoldman Sachs, though, said the high court ruling likely came too late to affect Labor’s July survey.\nHow do tariffs affect the job market?\nPrivate-sector hiring has been sluggish and increasingly concentrated in just a few sectors, such as health care and leisure and hospitality. Trump's tariffs have generated uncertainty about their impact on consumer prices and spending, as well as corporate profit margins, causing many businesses to hold off hiring.\nPrivate companies added fewer than 100,000 jobs in June. Manufacturers, which have been hit hardest by the import fees, lost an average of 5,000 jobs a month in the April-June quarter, Goldman noted.\nJuly 31, ahead of a midnight negotiating deadline, the White House announced it would maintain its base 10% tariff on imports from 100 countries but push the fee to 15% for another 40 nations and up to 40% for an additional 30 countries. Economists have estimated the average U.S. tariff would leap from about 3% early this year to 15% to 20% and possibly higher, driving a key inflation measure from 2.8% to upwards of 3%.\nHow do deportations affect the labor market?\nArrests and deportations of migrants who lack permanent legal status have picked up, hampering hiring in industries such as agriculture, construction and leisure and hospitality. From March through May, those sectors lost an average of 7,000 jobs a month, Goldman said.\nDeportations may have ratcheted up further in July after the Supreme Court lifted a judge's order requiring that migrants be granted the chance to show they would be harmed if removed to certain countries, Capital Economics said.\nThe crackdown, which also restricts the flow of migrants to the U.S., has served as the biggest factor in a labor force that has shrunk by more than 300,000 since January, said economist Dante DeAntonio of Moody’s Analytics.\nThe labor force participation rate - the share of Americans working or looking for jobs dimmed to 62.2% last month, the lowest since November 2022.\nOn the one hand, a smaller workforce curbs hiring since employers attract fewer job candidates. But it also has kept the unemployment rate from rising as weaker employer demand is balanced by a smaller pool of job seekers, DeAntonio said.\nContributing: Joey Garrison; Reuters"
    },
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/08/11/donald-trump-ej-antoni-bureau-of-labor-statistics/85618859007/",
      "text": "Trump names conservative economist E.J. Antoni to lead Bureau of Labor Statistics\nE.J. Antoni, an economist with the conservative Heritage Foundation, is President Donald Trump's pick to lead the Bureau of Labor Statistics after he fired the previous chief following a disappointing jobs report.\n\"E.J. will ensure that the Numbers released are HONEST and ACCURATE,\" Trump said in a social media post. \"I know E.J. Antoni will do an incredible job in this new role.\"\nTrump fired Erika McEntarfer, the U.S. commissioner of Labor Statistics, earlier this month, accusing her without evidence of manipulating data for \"political purposes\" after the Labor Department reported the United States added a disappointing 73,000 jobs in July.\nThe firing raised concerns about the future accuracy and integrity of the nation’s job numbers.\nFormer BLS Commissioner William Beach, who was nominated by Trump during his first term as president and also worked at the Heritage Foundation, said on CNN that McEntarfer's termination is \"damaging\" and will cause people to \"suspect political influence\" in the jobs data.\n\"I don’t think there’s any grounds at all for this firing and it really hurts the statistical system, it undermines credibility in BLS,\" Beach said.\nThe Senate in January 2024 confirmed McEntarfer, an appointment of former President Joe Biden. McEntarfer, a labor economist, had worked 20 years in the federal government, including previous stints at the U.S. Census Bureau and Treasury Department.\nAntoni has criticized how the BLS collects jobs numbers, saying during an Aug. 4 discussion on C-SPAN that \"there have been serious problems with the data.\" He pointed to downward revisions in prior months' jobs data to argue \"there are clearly problems with the numbers.\"\nBeach noted that BLS gathers jobs data through a survey and that not all respondents submit it on time. He said studies show the initial BLS monthly jobs reports, before they are revised, are more accurate now than they were 30 years ago.\nTrump declared in his social media post announcing Antoni's nomination that \"our economy is booming.\" But recent BLS reports indicate an economic slowdown.\nThe July report also revised payroll gains for May and June down by 258,000. That left May’s additions at 19,000 and June’s at 14,000, the weakest performance since the nation was climbing out of the COVID-19 recession in December 2020.\nContributing: Joey Garrison and Paul Davidson, USA TODAY"
    },
    {
      "url": "https://www.foxbusiness.com/politics/trumps-bls-pick-could-pause-monthly-jobs-report-over-accuracy-concerns",
      "text": "Trump’s pick to lead labor stats agency could pause monthly jobs report over accuracy concerns\n'Major decision-makers from Wall Street to DC rely on these numbers, and a lack of confidence in the data has far-reaching consequences'\nEditor’s Note: This article was updated to clarify that the interview with E.J. Antoni was conducted by Fox News Digital on Monday, August 4, 2025, and not during an on-air appearance on Fox Business Network. The story has been corrected to reflect this distinction.\nE.J. Antoni, the economist tapped by President Donald Trump to lead the Bureau of Labor Statistics, suggested suspending the agency’s closely watched monthly jobs report, arguing that its underlying methodology, economic modeling and statistical assumptions are fundamentally flawed.\nIn an Aug. 4 interview with Fox News Digital ahead of Monday’s nomination announcement, Antoni criticized the data behind the monthly jobs report as unreliable and frequently overstated, warning that it misleads key economic decision-makers from Washington to Wall Street.\nFORMER BLS COMMISSIONER SAYS THERE ARE BETTER WAYS TO COLLECT DATA FOR JOBS REPORTS\n\"How on earth are businesses supposed to plan – or how is the Fed supposed to conduct monetary policy – when they don’t know how many jobs are being added or lost in our economy? It’s a serious problem that needs to be fixed immediately,\" Antoni told Fox News Digital.\n\"Until it is corrected, the BLS should suspend issuing the monthly job reports but keep publishing the more accurate, though less timely, quarterly data,\" he said, adding, \"Major decision-makers from Wall Street to D.C. rely on these numbers, and a lack of confidence in the data has far-reaching consequences.\"\nAntoni, the Heritage Foundation’s chief economist, must face Senate confirmation before ascending to the top spot at the Bureau of Labor Statistics.\n\"Our Economy is booming, and E.J. will ensure that the Numbers released are HONEST and ACCURATE,\" Trump wrote in an Aug. 12 Truth Social post announcing Antoni's nomination. \"I know E.J. Antoni will do an incredible job in this new role. Congratulations E.J.!\"\nAntoni did not immediately respond to Fox News Digital's' request for comment.\nKevin Roberts, president of The Heritage Foundation, called Antoni a \"stellar choice\" to lead the Bureau of Labor and Statistics.\n\"EJ Antoni is one of the sharpest economic minds in the nation—a fearless truth-teller who grasps that sound economics must serve the interests of American families, not globalist elites,\" Roberts wrote in a statement. \"His leadership as chief economist at The Heritage Foundation has been instrumental in advancing our mission to protect American families and rebuild a resilient economy rooted in free enterprise,\" he added.\nTRUMP ORDERS TERMINATION OF LABOR STATISTICS OFFICIAL AFTER JOBS REPORT\nAntoni's appointment follows Trump’s abrupt dismissal of the agency’s former commissioner, Erika McEntarfer. Her removal came hours after the agency released new data showing that job growth had been significantly overstated. The bureau revised its May and June figures downward by 258,000 jobs, marking an unusually large correction that drew sharp criticism from Trump.\n\"In my opinion, today's Jobs Numbers were RIGGED in order to make the Republicans, and ME, look bad,\" Trump wrote in an Aug. 1 Truth Social post.\nAntoni told Fox News Digital that he doesn’t believe the jobs data was intentionally manipulated, as some have suggested, but instead argues that persistent flaws in the Bureau of Labor Statistics' methodology have gone unaddressed.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nHe pointed to a declining response rate – now below 50% – as a key factor contributing to inaccuracies, saying that \"no one in a position of power fixed the problems in the data.\"\n\"The problems in the BLS data have been evident for three years now, and they still haven’t been fixed,\" Antoni said.\n\"The fact that you consistently have large downward revisions means that there are other things wrong with your models and methodologies. Statistical assumptions that may have worked fine before COVID no longer work in today’s economy and therefore need to be revised.\""
    }
  ],
  "argos_summary": "E.J. Antoni, President Trump's nominee for U.S. commissioner of Labor Statistics, has suggested suspending the monthly jobs reports due to concerns over the agency's methodology and accuracy, particularly following significant downward revisions in job growth figures for May and June. Trump fired the previous commissioner, Erika McEntarfer, after a disappointing jobs report, claiming without evidence that the data was manipulated for political purposes. While White House officials downplayed Antoni's remarks, economists argue that the revisions reflect genuine economic trends rather than manipulation, indicating a slowing labor market influenced by trade policies and declining survey response rates.",
  "argos_id": "57BT80DXB"
}