{
  "url": "https://www.bloomberg.com/news/videos/2025-08-11/bloomberg-brief-8-11-2025-video?srnd=phx-technology",
  "authorsByline": "bn",
  "articleId": "b5b093d2e5844195a1fa3109b9ca5e7a",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ieo_CP8_qY6c/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T10:45:45.473000+00:00",
  "addDate": "2025-08-11T11:56:13.794176+00:00",
  "refreshDate": "2025-08-11T11:56:13.794178+00:00",
  "score": 1.0,
  "title": "Stocks Waver Ahead of Busy Week of Data, Trump-Putin Meeting",
  "description": "US equity futures edge slightly higher as investors head into a week full of key economic data. Oil reverses earlier declines as Presidents Trump and Putin are set to meet on Friday to discuss ending the war in Ukraine. Gold futures in New York fall as traders seek clarification from the White House over its surprise tariff policy last week. Nvidia and AMD agree to pay the US government 15% of their revenues from Chinese AI chip sales. Ella Hoxha of Newton Investment Management says the current complacency in markets will likely be tested in the second half of the year. Lauren Saidel-Baker of ITR Economics discusses her outlook for US data. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda.  (Source: Bloomberg)",
  "content": "♪ DANI: IT’S 5AM IN NEW YORK CITY, GOOD MORNING, I’M DANI BURGER WITH YOUR BLOOMBERG BRIEF, HERE'S WHAT YOU NEED TO KNOW ON THIS MONDAY MORNING. CUTTING AN UNPRECEDENTED DEAL. NVIDIA AND AMD WILL PAY 15% OF THEIR CHINA AI CHIP SALES TO THE U.S. GOVERNMENT. AWAITING TRUMP-PUTIN TALKS, OIL EXTENDED DECLINE DECLINE AT A MEETING BETWEEN THE U.S. AND RUSSIA ON FRIDAY. GOLD FUTURES FLY, TRADERS WAIT FOR THE WHITE HOUSE TO CLARIFY LAST YEAR'S SURPRISE TARIFF. WE ARE BASICALLY AT THIS MOMENT, A ROUNDING EVER AWAY FROM AN ALL-TIME HIGH. WE CLOSED 0.01% AWAY FROM AN ALL-TIME HIGH SO EVEN IF WE OPEN UP SIMPLY UNCHANGED, WE WILL GET THERE. S & P AND NASDAQ FUTURES. CITI BOOSTED THEIR YEAR-END TARGETS. THE LATEST BANK OF AMERICA SURVEY SAYS THAT INVESTORS ARE THE MOST BULLISH, SO WE ARE GETTING THIS SENTIMENT SEEPING INTO THE MARKET. THE MAIN SHOW IS TOMORROW, TUESDAY, THE CPI RELEASE. WE HAD SOME BONDS UNDER PRESSURE LAST WEEK. TODAY WE ARE LOWER BY ABOUT THREE BASIS POINTS. LET'S GET YOU SOME STOCKS MOVING UNDERNEATH THE SURFACE. > > LET'S START WITH NVIDIA AND AMD AFTER NEWS THAT THEY HAVE AGREED TO PAY THE U.S. GOVERNMENT 15% OF THE REVENUE FROM THEIR CHINESE CHIP SALES. WE ARE SEEING BOTH OF THEM ON THE BACK FOOT THIS MORNING, NVIDIA DOWN OVER 1%, AMD DOWN NEARLY 2.5%. BOTH OF THESE COMPANIES HAVE FAILED TO GIVE ANY GUIDANCE ON WHAT KIND OF REVENUE THAT WOULD BE SO WHEN IT COMES TO HOW MUCH MONEY THE U.S. GOVERNMENT COULD MAKE, THAT REMAINS A BIG QUESTION. THIS IS AN ENTERPRISE SOFTWARE FIRM THAT HELPS COMPANIES OPTIMIZE ANYTHING FROM SUPPLY CHAINS TO INVENTORY, FALLING NEARLY 30% IN PREMARKET TRADE AFTER WHAT ANALYSTS CALL A CATASTROPHIC ROUND OF RESULTS, FLUSHING THEIR REVENUE GUIDANCE BY ONE THIRD. M & A MONDAY AS REPORTED BY THE WALL STREET JOURNAL, WE COULD CEASE OF MERGER ACTIVITY IN THE LOCAL TV BROADCASTING SPACE. TAKEN A HAS BECOME -- TEGNA HAS BECOME A TAKEOVER TARGET OF NEXTAR. TEGNA HAS BEEN THE I HAVE SOME TAKEOVER INTEREST BEFORE, BUT THOSE DEALS HAVE FALLEN APART DUE TO REGULATION HURDLES. THIS COULD BE A NEW TEST FOR TRUMP'S NEW LEADERSHIP AT THE FCC IF THEY APPROVE THIS TYPE OF MERGER. DANI: ALSO IN THIS HOUR, WE WILL WITH ELLA HOXHA AND TOMORROW, WE WILL BE SPEAKING WITH LAUREN SAIDEL-BAKER. \"CURRENT COMPLACENCY AND MARKETS IS LIKE THAT INTESTATE IN THE SECOND HALF STARTING WITH CORE BOND AND INTEREST RATE EXPECTATIONS. I'M PLEASED TO SAY THAT ELLA JOINS US NOW. ALWAYS A JOY TO SEE YOU AND LOOK AT THE STRANGE TIME WE ARE LIVING IN THAT BONDS CAN BE PRICING IN NEARLY 90% CERTAINTY THAT WE ARE GOING TO GET A CUT IN THE NEXT MEETING THEIR FEARS OF THIS LABOR MARKET WITH RISK ASSETS AT ALL-TIME HIGHS AND CREDIT SPREADS AT NEW TIGHTS. WHAT DO YOU THINK IS DRIVING THAT COMPLACENCY? ELLA: THE DATA HAS BEEN SUPPORTIVE MINUS THE LAST PRINT WHICH WE CAN DEBATE AND DISCUSS WHETHER THAT IS TOTALLY RELIABLE. THAT IS ON THE BASIS THAT A LOT OF WHAT HAS BEEN DRIVING THE LABOR MARKETS LAST TWO OR THREE YEARS HAS BEEN DEMAND EXCEEDING SUPPLY. I THINK THAT A LITTLE UNUSUAL, SO YOU COULD ARGUE THE FACT THAT YOU ARE NOW HAVING NEGATIVE NET MIGRATION IN THE U.S. COULD BE PUTTING THE NUMBERS LOWER, THOUGH IT DOESN'T NECESSARILY HAVE TO BE A BAD PRINT ON ITSELF. EVEN IF YOU TAKE THAT ASIDE, DATA HAS GENERALLY BEEN OK AND SUPPORTED IN THE U.S. MARKETS GENERALLY WENT THROUGH THIS MASSIVE FEAR PHASE BACK IN THE SPRING'S ANOTHER PRESSURE HAS BEEN UPWARDS. JUST MORE BROADLY, THE EUPHORIA IS IN PLAY. THE BANK OF AMERICA SURVEY WHICH HIT MY DESK THIS MORNING WAS TALKING ABOUT THE MOST BULLISH FOR 2025. BASICALLY, PRETTY BOUGHT UP. DANI: YOU SAY THAT YOUR CONCERN STARTS WITH CORE BONDS. WE DID SEE SOME PRETTY TEPID BOND SALES LAST WEEK. HOW MUCH OF THAT IS DUE TO JUST LOWER YIELDS FOLLOWING THOSE WEAK NFPS VS. SOME REAL STRESS, BE IT CONCERNS ABOUT FED INDEPENDENCE, UPLOADING DEFICIT? IS THAT PART OF YOUR CALL? ELLA: WE ARE TRADING FLATWARE BUREAU CASH. THE SECOND PART THAT CONCERNS US IS BASICALLY THIS TICK UP IN INFLATION EXPECTATIONS WHICH IS NOT CONSISTENT WITH THE LEVEL OF PRICE CUTS WE HAVE IN THE CURVE NOW. SO WHAT THE MARKET HAS BEEN PRICING. ACTUALLY, WE THINK THE COMING QUARTER OR TWO WE WILL START TO SEE THE TICK UP IN INFLATION. NOTHING DRAMATIC, BUT ENOUGH TO CAUSE A BIT OF A HEAD SCRATCHER FOR THE FED. WITH THAT IN MIND, IF THAT IS CONFIRMED, WE PROBABLY EXPECT TO REDUCE FURTHER. DANI: COULD THAT HAPPEN TOMORROW AND WHAT THE VULNERABILITY OF THIS BOND MARKET IF CPI DOES APPEAR TO BE STICKIER THAN EXPECTED? ELLA: I'M NOT A BIG FAN OF FORECASTING. NOT BECAUSE WE CANNOT HAVE A VIEW, BUT BECAUSE I THINK IT IS A BIT OF A POINTLESS EXERCISE. IT IS MORE ABOUT WHERE THE RISKS LIVE. ARE THERE RISKS TO THE UPSIDE OR DOWNSIDE? I CAN ONLY SEE THAT AS REALLY THE HIGHER PROBABILITY RISK TO DISRUPT THIS RISK ON MODE WE ARE SEEING IN MARKETS. THAT'S WHY THAT IS SORT OF THE TAIL RISK THAT WE LIKE TO HATCH. DANI: THE OTHER THING THAT IS MAYBE SUPPORTING THIS MARKET HAS BEEN EARNINGS. EVEN OVERALL ON A HEADLINE BASIS, THEY LOOK STRONG. THEN WE GET THIS REPORTING OVERNIGHT FROM THE WALL STREET JOURNAL THAT AMD AND NVIDIA MIGHT BE GIVING 15% OF THEIR PROFITS ON THEIR MOST ADVANCED AI CHIP THAT THEY SELL TO CHINA TO THE U.S. THAT'S A COMPLETELY DIFFERENT DYNAMIC FOR COMPANIES TO TRY TO DEAL WITH. JUST IN GENERAL IT DOES MEAN SLIMMER PROFITS. HOW DO YOU THINK ABOUT THAT AND AS WE EVOLVE, DELIVER TARIFFS AND EXTRA AND POLITICAL DYNAMICS FOR COMPANIES TO TRY TO NAVIGATE PREG RIGHT NOW? ELLA: THEY DO HAVE TO NAVIGATE THIS TERRAIN BUT IT IS PART OF THIS NEW REGIME. IT IS A MUCH MORE VOLATILE REGIME. AS AN INVESTOR YOU SHOULD DEMAND MORE RISK PREMIUM BUT THAT IS NOT THE CASE. A LOT OF THE GOODS PRICES ARE BAKED IN, SO YOU COULD COME IF YOU WANTED, SAY MAYBE ALL THE GOOD NEWS ARE IN, BUT HOW DO YOU DEAL WITH IT? AS A PORTFOLIO MANAGER, THE SIZING OF THAT AND PROBABLY STAYING AWAY FROM EXTREME CASES OR EXTREME VIEWS. THOSE ARE POTENTIALLY BLIND SPOTS THAT CAN OPEN PROBLEMS IN THE FUTURE. VERY DIFFICULT TO PREDICT A GEOPOLITICAL ANGLE OTHER THAN TO SAY WHEN THE GOVERNMENT KEEPS ON PLAYING A. THE ROLE. -- PLAYING A VERY BIG ROLE. DANI: IT'S IMPOSSIBLE TO AVOID THE CONVERSATION OF POLITICS. BEFORE THE WEEKEND THERE RESULTS REPORTED FROM THE WALL STREET JOURNAL THAT TO NEW FIGURES HAVE EMERGED IN THE FED CHAIR SWEEPSTAKES. THAT ADDS TO THE KEVINS AND WALLER AS A POTENTIAL CANDIDATE. MUCH MORE TRADITIONAL-TYPE CANDIDATES. DOES THAT TAKE SOME OF THE RISK PREMIUM OUT OF THIS BOND MARKET, THE FACT THAT WE COULD GET SOMEONE ALONG THE LIKES OF THOSE TWO FIGURES TO LEAD THE FED? ELLA: ABSOLUTELY, THE MORE TRADITIONAL THE BETTER FOR THE MARKET AS AN INVESTOR. I SAY IS THIS FED GOING TO BE MORE HAWKISH OR DOVISH GOING FORWARD? WHAT IS THE PREFERENCE FOR THE GUY OR GIRL THAT IS GOING TO TAKE THIS ROLE ON? THE ANSWER IS QUITE SIMPLE. MORE LIKELY TO BE MORE DOVISH FED. WITH THAT IN MIND, YOUR EXPECTATIONS OF TERM PREMIUM GO UP, NOT DOWN. I THINK WE ARE ONLY HALFWAY THROUGH BAKING THAT TERM PREMIUM INTO BOND MARKETS WHEN WE LOOK AT THE LONGER-TERM HISTORY OF YIELD CURVES. WITH THAT IN MIND, I WOULD STILL AIR ON THE SIDE OF CAUTION. DANI: TO THE POINT OF A WOMAN BEING THE NEXT FED CHIEF, NIKKI BOWMAN TALKING ABOUT THREE CUTS THIS YEAR, SO MAYBE SHE IS INDEED TRYING TO GET THAT NOMINATION. THANK YOU SO MUCH FOR JOINING US, GREAT TO SEE YOU AS ALWAYS. LET'S LOOK AT SOME OF THE TOP STORIES TRENDING ON THE TERMINAL THIS MORNING. LITHIUM PRICES AND STOCKS SPIKED EARLIER TODAY AFTER CHINESE BATTERY GIANT CATL SUSPENDED ACTIVITY AT A MAJOR THE MIND IN CHINA. THE COMPANY SAID IT WILL RESUME PRODUCTION AFTER ITS LICENSE IS RENEWED IN THAT THEY WOULD BE NO MATERIAL IMPACT ON OPERATIONS. PIMCO CEO SIGNALING CAUTION OVER PRIVATE MARKETS. HE WARNED THAT PRIVATE MARKETS HAVEN'T BEEN TESTED BY A STEEP ECONOMIC DOWNTURN. HE WAS SPEAKING WITH THE FT AND FURTHER URGED ON THE NEED TO CONSTANTLY THINK ABOUT WHAT CAN GO WRONG. AND BITCOIN HAS RISEN TO WITHIN STRIKING DISTANCE OF AN ALL-TIME HIGH. DEMAND FROM INSTITUTIONAL INVESTORS AND CORPORATE TREASURY BUYERS LIFTED THE WIDER MARKET FOR ASSETS. THE GAMES COME OFF THE BACK OF MOUNTING INTEREST IN CRYPTO AMONG LARGE INVESTORS. DIGITAL AS A TREASURY COMPANIES HAVE BUILT A STOCKPILE WITH ONE UNDER $30 BILLION. COMING UP, NVIDIA AND AMD AGREEING TO PAY THE U.S. GOVERNMENT 15% OF THEIR ADVANCED AI CHIP SALES TO CHINA. MORE ON THAT UNPRECEDENTED MOVE COMING UP NEXT. ♪ ♪ > > YOU KNOW, THE WORLD IS RECONFIGURING ITSELF, AND WE ARE A COMPANY AND WE JUST HAVE TO ADAPT. TO WHATEVER THE WORLD TRADE AND TAX AND TARIFF CONDITIONS ARE. SO THIS IS SOMETHING WE ALL HAVE TO ADAPT TO. BUT THE VERY INCREDIBLE THING IS THAT NVIDIA IS A VERY ADAPTABLE COMPANY. OUR SUPPLY CHAIN WILL HAVE TO ADAPT AND WE WILL FIND A NEW WAY. DANI: AND ADAPT THEY HAVE. THAT WAS THE NVIDIA CEO SPEAKING LAST MONTH ABOUT NAVIGATING THE CHANGING TRADE ENVIRONMENT. HOW ABOUT THIS, U.S. CHIPMAKERS AMD AND NVIDIA ARE UNDER PRESSURE NOW IN THE AGREED TO PAY THE U.S. GOVERNMENT 50% OF THE REVENUE FROM CHINESE CHIP SALES, PART OF A DEAL THAT WOULD HELP SECURE AN EXPORT LICENSE. JOINING US FOR MORE ON THIS IS LAUREN WHO HELPS LEAD ARE BREAKING NEWS COVERAGE OUT OF D.C.. PEOPLE HAVE LOOKED AT THIS DEAL AND SAID OK, ARE WE TARIFFING EXPORTS NOW? WHAT EXACTLY ARE THE DETAILS OF WHAT WE UNDERSTAND IS HAPPENING WITH AMD AND NVIDIA? > > ONE THING YOU WILL HEAR MORE THAN ANYTHING IS THAT THE SUN PRESIDENT. FOR U.S. COMPANIES TO BE PAYING 15% OF REVENUE FOR THESE SPECIFIC CHIP SALES TO CHINA AGAIN IS UNPRECEDENTED. REALLY, WE'VE SEEN JENSEN HUANG OF NVIDIA AS WELL AS OTHER CHIP COMPANIES PUSHING THE U.S. GOVERNMENT TO REALLY DO WHATEVER THEY CAN TO UNLOCK THE CHINESE MARKET AS WELL AS OTHERS AND I THINK AGAIN, ACT OF UNPRECEDENTED POINT, IT GOES TO SHOW THAT THIS TRUMP ADMINISTRATION IS REALLY INTERESTED IN DOING WHATEVER IT CAN TO NOT ONLY UNLOCK UNEXPECTED SECTORS, BUT TO ALSO EXTRACT WHAT THEY WANT FROM COMPANIES. THEY ARE EXTRACTING CONCESSIONS. IT'S ESTIMATED THAT THIS 15% OUT OF NVIDIA AT LEAST DEGENERATE ROUGHLY $1 BILLION A YEAR. THAT WOULD OBVIOUSLY GO INTO U.S. TREASURIES OR INTO U.S. RESERVES, RATHER. THE IDEA THAT THIS ADMINISTRATION IS LOOKING AT OTHER WAYS OF WORKING WITH THESE COMPANIES AND EVEN JUST SEEING HOW THESE COMPANIES HAVE TO ADAPT TO THIS ADMINISTRATION, I MEAN, LOOK NO FURTHER THAN THE PRESIDENTS TO THE SOCIAL FEET AND HAVE HIM INTERACT WITH VARIOUS CEOS. THIS IS AN ENTIRELY DIFFERENT LANDSCAPE, AND SO IT'S CLEAR THAT THESE CEOS AS WELL AS THIS ADMINISTRATION ARE JUST INKING DIFFERENTLY IN TERMS OF HOW THEY HAVE TO NAVIGATE THIS CURRENT ENVIRONMENT. DANI: IT'S NOT JUST PRESSURE ON COUNTRIES, IT'S TURNING THE PRESSURES ON COMPANIES WHICH BY THE WAY, PREVIOUSLY THIS WASN'T GOING THROUGH BECAUSE OF SECURITY CONCERNS. BUT THE COUNTRIES STILL ARE UNDER PRESSURE. TOMORROW WE GET THE DEADLINE FOR GETTING A CHINA TRADE DEAL DONE. DO WE SEEM ANY CLOSER TO AT LEAST AN EXTENSION? > > IT SOUNDS LIKE IT WILL BE ANOTHER 90 DAYS. WE WON'T KNOW UNTIL TRUMP HIMSELF SAYS IT, HOWEVER THE TRUMP ADMINISTRATION OFFICIALS LIKE HOWARD LUTNICK HAVE INDICATED THAT THE EXPECTED 90 DAY TRUCE WILL COME TO FRUITION. THE DEADLINE IS TOMORROW, SO WE WILL HAVE TO SEE. THIS IS ANOTHER CLASSIC EXAMPLE OF WE DON'T KNOW THE DECISION UNTIL TRUMP HIMSELF SAYS IT OR POST IT. WE DO KNOW AFTER THE TALKS IN STOCKHOLM, NEGOTIATORS HAVE THAT 90 DAY DEAL THAT DID APPEAR THAT WAS GOING TO BE WHAT THE AGREEMENT WAS. THAT'S WHAT THE CHINESE SIDE SAID, IN THE U.S. SIDE SAID WE WILL HAVE TO WAIT TO SEE WHAT TRUMP SAYS. WE ARE STILL HERE WAITING. DANI: A LOT OF WAITING THIS YEAR. THANK YOU SO MUCH, ACCIDENT REPORTING. FROM CHINA TO RUSSIA, TRUMP AND PUTIN ARE PLANNING TO MEET IN ALASKA ON FRIDAY DISCUSSING THE WAR IN UKRAINE. AT THE MOMENT TALKS DON'T APPEAR TO INCLUDE PRESIDENT ZELENSKYY. HERE IS THE NATO SECRETARY AHEAD OF THE BIG MEETING. > > I THINK IT IS IMPORTANT THAT A MEETING TAKES PLACE NEXT FRIDAY. PRESIDENT TRUMP BROKE A DEADLOCK WITH PUTIN IN FEBRUARY THAT WAS VERY IMPORTANT. ONLY A COUPLE OF WEEKS AGO HE DECIDED TO AGAIN OPEN THE FLOODGATES OF LEGAL SUPPORT INTO UKRAINE AND TO PUT SECONDARY SANCTIONS ON COUNTRIES LIKE INDIA. SO HE CLEARLY IS PUTTING PRESSURE ON PUTIN. NEXT FRIDAY WILL BE IMPORTANT BECAUSE IT WILL BE ABOUT TESTING PUTIN, HAVE SERIOUS HE IS ON BRINGING THIS TERRIBLE WAR TO AN END. DANI: PROCESSING OIL DECLINING THIS MORNING AS INVESTORS GAUGE UKRAINE -- SORRY, 2/10 OF 1%. THE LEGATION BUT THIS MIGHT MEAN FOR CRUDE SUPPLY. PLEASED TO SAY THAT I'M JOINED BY TONY WHO LEADS OUR RUSSIA COVERAGE. WHAT ARE THE EXPECTATIONS FOR THIS FRIDAY IN ALASKA? > > THAT DEPENDS ON WHO YOU ARE. EUROPEANS AND UKRAINE ARE PRETTY ALARMED BY THE PROSPECT OF FRIDAY'S MEETING BECAUSE THEY ARE NOT AT THE TABLE AND WHAT THEY ARE REALLY WORRIED ABOUT IS THAT PRESIDENT TRUMP AND PRESIDENT PUTIN WILL CUT A DEAL TOGETHER THAT ALLOWS PUTIN TO HOLD ON TO UKRAINIAN TERRITORY AND THAT THEY WILL HAVE VERY LITTLE SAY IN THIS DEAL. TRUMP, AS YOU'VE NOTED IN THE PIECE, IS KEY TO TEST PUTIN'S SINCERITY ON REACHING A CEASE-FIRE. SO FAR HE'S RESISTED ALL EFFORTS AND ALL CALLS FROM THE U.S. FOR A TRUCE AND PUTIN OF COURSE IS VERY KEEN TO LOCK IN HIS GAINS. DANI: PART OF WHAT TRUMP HAS TALKED ABOUT IS SOME SWAPPING OF TERRITORIES. TONY, IS THAT A NONSTARTER WITH ZELENSKYY, WITH EUROPE? > > WE HAVE TO REMEMBER THAT WHEN YOU TALK ABOUT SWAPPING TERRITORY, THIS IS ALL UKRAINIAN TERRITORY TO BEGIN WITH AND RUSSIA IS ILLEGALLY OCCUPYING IT. THIS IS A NONSTARTER SYMBOL BECAUSE AS ZELENSKYY SAID, HE IS NOT IN A POSITION TO CEDE TERRITORY AND THE UKRAINIAN CONSTITUTION DOESN'T LET THEM DO SO. NEITHER EUROPE NOR UKRAINE CURRENTLY BELIEVE THEY CAN RECLAIM THAT TERRITORIES IS GOING TO BE A LOT OF SUBTLE PLAY AROUND THE IDEA OF RUSSIA HOLDING ONTO TERRITORY WHILE UKRAINE AND EUROPE DON'T RECOGNIZE ITS POSSESSION OF THAT TERRITORY. BUT WE WILL HAVE TO SEE WHAT COMES OUT ON FRIDAY. DANI: SO FAR PRIOR TO THE STOCKS IT SEEMED LIKE A TRUMP RESTRICTION THAT WANTED TO PUT ECONOMIC PRESSURE ON RUSSIA, TARGETING COUNTRIES LIKE INDIA FOR THEIR PURCHASING OF RUSSIAN OIL. IS THERE A RISK THAT THIS CHANGES THE OUTCOME OF THAT, THAT THIS SOFTENS TRUMP HAVING A ONE-ON-ONE MEETING WITH PRESIDENT PUTIN? > > LET'S NOT FORGET THE DEADLINE FOR PUTIN TO AGREE TO A TRUCE WAS IN FACT ON FRIDAY AND THAT DEADLINE CAME AND WENT AND THERE WASN'T A GENERAL APPLICATION OF SECONDARY TARIFFS ON COUNTRIES THAT PURCHASE RUSSIAN OIL. THERE WAS ONE PLACE ON INDIA BUT CHINA IS THE BIGGEST PURCHASER, NOTHING HAS HAPPENED THERE. TURKEY IS ANOTHER MAJOR PURCHASER, NOTHING HAS HAPPENED THERE. WE PROBABLY WON'T SEE MUCH ACTION UNTIL TRUMP AND PUTIN COME TOGETHER AND TEST EACH OTHER'S SINCERITY. IF THERE ISN'T A DEAL I SUSPECT WE WILL NO LONGER HEAR MUCH OF SECONDARY SANCTIONS. DANI: THANK YOU FOR JOINING US WITH THAT UPDATE. COMING UP, THE INTEL CEO IS MEETING WITH PRESIDENT TRUMP ACCORDING TO THE WALL STREET JOURNAL. WE WILL HAVE THAT AND THE OTHER HEADLINES IN THE FRONT PAGES OF YOUR PAPERS. STAY WITH US ON YOUR \"BLOOMBERG BRIEF.\" ♪ ♪ DANI: YOU'RE WATCHING \"BLOOMBERG BRIEF ,\" LET'S TAKE A LOOK AT THE FRONT PAGES THIS MORNING. FIRST UP IN THE WASHINGTON POST, THE FBI IS DISPATCHING AGENTS TO WASHINGTON, D.C. TO TACKLE INCREASED CARJACKINGS AND CRIMES. THIS COMES AFTER PRESIDENT TRUMP RECENTLY THREATENED TO CALL ON THE NATIONAL GUARD. TRUMP WILL BE HOLDING A NEWS CONFERENCE AT 10:00 A.M. EASTERN TO ADDRESS THE SITUATION. NEXT UP, AL JAZEERA IS CONDEMNING THE KILLING OF ONE OF ITS JOURNALISTS BY ISRAELI FORCES IN GAZA. PROMINENT AL JAZEERA JOURNALIST HAS BEEN KILLED ALONG WITH FOUR COLLEAGUES IN AN ISRAELI AIRSTRIKE ON A TENT NEAR A HOSPITAL IN EASTERN GAZA CITY. ISRAEL'S MILITARY SAID IT TARGETED HIM, ALLEGING HE HAD A HAMAS CEL. AND ON THE WALL STREET JOURNAL, INTEL CEO SINGLED OUT BY PRESIDENT TRUMP TO VISIT THE WHITE HOUSE. THIS AFTER THE PRESIDENT RECENTLY CALLED FOR HIS REMOVAL OVER TIES TO BUSINESS IN CHINA. SOURCES SAY THAT THE CEO HOPES TO SHOW HIS COMMITMENT TO THE U.S. COMING UP NEXT, IT IS A MARKET AWAITING CPI. WHAT WITH THE INFLATIONARY REPORT MEAN FOR THE FED AT THEIR NEXT MEETING? LAUREN WILL BE JOINING US NEXT ON BLOOMBERG. DANI: GOOD MORNING, I AM DANI BURGER WITH YOUR BLOOMBERG BRIEF. HERE'S WHAT YOU NEED TO KNOW THIS MONDAY. CUTTING AN UNPRECEDENTED DEAL. NVIDIA AND AMD WILL PAY 50% OF THEIR CHINA AI CHIP SALES TO THE U.S. GOVERNMENT. AWAITING TRUMP-PUTIN TALKS, OIL EXTENDED KLEIN AT A MEETING BETWEEN THE U.S. AND RUSSIA ON FRIDAY. AND TRADERS WAIT FOR THE WHITE HOUSE TO CLARIFY LAST WEEK'S SURPRISE TARIFFS ON BUOYANT BARS. WE ARE A ROUNDING ERROR AWAY FROM AN ALL-TIME HIGH. LESS THAN 0.01%. SO IF WE OPEN WHERE WE ARE THIS MORNING WITH -- WHICH IS LITTLE CHANGE, WE WILL GET TO THOSE ALL-TIME HIGHS. THE BULLISHNESS IS EVIDENT. CITI UPGRADING THEIR PRICE TARGET. THE LATEST FUND MANAGER SURVEY SHOWS US THE MOST BULLISH SINCE FEBRUARY. MEANWHILE FOR THIS BOND MARKET, IT WAS YIELDS HIGHER THIS WEEK. WE TAKE A BREATHER THIS MORNING. WE WILL GET CPI TOMORROW. GOLD FUTURES AT LOWE'S, THE SESSION DOWN 2% AFTER RALLYING ON FRIDAY AFTER A SURPRISE 39% TARIFF FROM GOLD COMING FROM SWITZERLAND. THE WHITE HOUSE IS THAT THEY WILL CLARIFY THAT. WE ARE STILL WAITING FOR THAT CLARIFICATION. LET'S GET YOU SOME STOCKS TO WATCH. WITH THAT IS VALERIE. > > LET'S START WITH NVIDIA AND AMD AFTER THEY'VE AGREED TO PAY 15% OF THEIR CHINESE REVENUES FOR THOSE EXPORT LICENSES. WE ARE SEEING BOTH OF THEM IN THE READING PREMARKET TRADE. NVIDIA DOWN AROUND 1%, AMD RIGHT OVER 2%. IT COULD BE ARGUED THERE'S GOOD THINGS ABOUT THIS AGREEMENT BECAUSE IT DOES DEFINITELY SOUND LIKE THEY ARE GOING TO GET THOSE EXPERT LICENSES. NIFTY WAS ACTUALLY APPROVED ON FRIDAY. AMD STILL WAITING FOR THE APPROVAL FOR THEIRS. LET'S MOVE OVER TO A SOFTWARE COMPANY THAT DEALS WITH AI APPLICATIONS FOR BUSINESSES, GIVING SOME CATASTROPHIC GUIDANCE IN ITS RESULTS. IT'S GUIDANCE FOR REVENUE CAME IN ONE THIRD LESS THAN ESTIMATED AND WE ARE SEEING THAT STOCK FALL AROUND NEARLY 30% IN PREMARKET TRADE. THIS COMPANY OFFERS SOFTWARE TO BUSINESSES THAT HELPS OPTIMIZE SUPPLY CHAINS TO INVENTORY SO THEY ARE NOT SEEING THAT KIND OF GROWTH HAPPENING IN THE REST OF AI. LASTLY, LET'S END WITH LITHIUM MINERS LISTING IN THE U.S., SEEING A DECENT BOOST IN PREMARKET TRADE. THIS IS ALL DOWN TO CHINA SHUTTING DOWN ONE OF CATLS BIGGEST LITHIUM MINES. THIS IS IMPORTANT BECAUSE IT MAY BE THE BEGINNING SIGNS THAT CHINA IS BEGINNING TO CLAMP DOWN ON OVERCAPACITY IN SOME KEY INDUSTRIES. THEY ARE STARTING WITH LITHIUM. DANI: INVESTORS ARE ALSO GEARING UP FOR ANOTHER BUSY WEEK OF ECONOMIC DATA. THIS U.S. CPI TOMORROW, PPI AND JOBLESS CLAIMS ON THURSDAY. FINALLY, U.S. RETAIL SALES AND THE SENTIMENT SURVEY TO CLOSE OUT THE WEEK ON FRIDAY. LAUREN WEIGHING IN AND WRITING \"INFLATION WILL LIKELY REBOUND IN THE SECOND HALF OF 2025 AND INTO NEXT YEAR. OUR ANALYSIS SUGGESTS ABLE TAKE BETWEEN 90 TO 18 MONTHS FOR TERROR-RELATED INFLATION TO BECOME EVIDENT IN THE DATA. GREAT TO SEE YOU THIS MORNING, THANK YOU FOR JOINING. SO IT WILL TAKE SOME TIME FOR INFLATION TO SHOW UP. SO WHAT ARE YOU EXPECTING TOMORROW, HOW MUCH TARIFF-DRIVEN INFLATION MIGHT SEE THROUGH? > > EVERYONE IS LOOKING FOR THE IMPACT OF TARIFF AND I JUST DON'T THINK WE ARE SEEING IT YET. THAT'S NOT TO SAY WE AREN'T SEEING BUILDING INFLATIONARY PRESSURES, THOSE ARE JUST FOR NONTARIFF RELATED REASONS. WE HAD A LOT OF FUNDAMENTAL DRIVERS THAT ARE JUST NOW STARTING TO FLOW THROUGH THE DATA. WE SAW THIS LAST MONTH, AS EARLY WARNING SIGNS THAT PRESSURES ARE BUILDING. I THINK IT'S GOING TO BE IMPORTANT TO DIFFERENTIATE AND CRITICALLY IMPORTANT FOR THE FED TO DIFFERENTIATE WHAT IS A ONE-TIME STEP OFTEN PRICES, AND WHAT ARE THESE MORE LINGERING FUNDAMENTAL PRESSURES THAT AREN'T GOING AWAY ANYTIME SOON? DANI: IT'S SUCH AN INTERESTING POINT TO GET THE FED GOVERNORS HAVE BEEN TALKING ABOUT THE IDEA THAT TARIFFS ARE ONE-OFF. SO WHAT YOU'RE SAYING IS THAT EVEN IF TARIFFS ARE IN ONE-OFF WAS TO INFLATION, SOMETHING ELSE IS STILL GOING ON THAT SHOULD MAYBE KEEP THE FED MORE RESTRICTIVE AT THIS POINT. > > YES, WE ABSOLUTELY SEE THAT. THERE ARE THINGS THAT ARE BAKED INTO THE NUMBERS FOR A YEAR, EVEN CLOSE TO TWO YEARS AT THIS POINT. IN ADDITION TO THE TYPICAL MONETARY AND KIND OF FISCAL POLICY THAT WE'VE SEEN, WE ALSO JUST HAVE THOSE PERSISTENT WAGE PRESSURES. BECAUSE THEY'VE COME DOWN, AND A LOT OF BUSINESSES AND MARKET WATCHERS THINK THAT THEY ARE DONE, WE DON'T HAVE TO WORRY ABOUT THAT ANYMORE WE ARE SEEING BUILDING ENERGY PRICES, ELECTRICITY COSTS BEING MUCH HIGHER. MANY OF THOSE INDIVIDUAL THREADS THAT WE COULD TRY TO PULL THROUGH TO SEE EACH ONE, IN CONCERT, ALL OF THOSE PRESSURES ARE NOW KIND OF COMING TOGETHER AT THIS MOMENT IN TIME TO BUILD SOME INFLATION AND PRICING PRESSURE. DANI: WHAT DOES THAT MEAN THE BAR IS? > > BY OUR ANALYSIS ON A NOT SEASONALLY ADJUSTED BASIS, THEY WERE A SOFT YES, BUT AT THE LOW-END END OF THE NORMAL RANGE. THIS WAS NOT THE BOTTOM FALLING OUT FROM THE LABOR MARKET. IN TERMS OF BALANCE, WE REALLY DO STILL SEE SOME BALANCE BETWEEN THE NUMBER OF UNEMPLOYED WORKERS AND JOB OPENINGS. BOTH OF THOSE NUMBERS ARE A LITTLE BIT LOWER NOW, SO I THINK A BIT LIKE A SCALE THAT CAN BE IN BALANCE WHETHER THERE IS A LOT OF WEIGHT OR VERY LITTLE WAY, WE CAN STILL BE IN BALANCE. IT'S JUST IN ONE OF THOSE CASES IT IS A LITTLE EASIER TO NOT OUT OF BALANCE. DANI: THERE ARE SOME ARGUMENTS THAT THE REASON THERE ARE FEWER JOBS BEING CREATED IS BECAUSE THERE ARE FEWER WORKERS HERE. AND IF YOU CUT, THAT DOESN'T SUDDENLY CREATE MORE WORKERS IN THE U.S. HOW DO YOU SEE THE DRIVERS OF THIS LABOR MARKET IN SOME OF THE WEAKER DATA THAT WE'VE BEEN GETTING? > > I THINK THAT'S A VERY REAL IMPACT WE ARE GOING TO SEE ESPECIALLY LATER THIS YEAR. WE EXPECT TO SEE NEGATIVE NET IMMIGRATION, SO TAKING THOSE WORKERS OUT OF THE JOB MARKET MAYBE DOESN'T MAKE A BIG DIFFERENCE BUT IN CERTAIN SECTORS, CERTAIN SKILL SETS, THAT'S GOING TO BE A REAL DETRIMENT TO LABOR AVAILABILITY. DANI: YOU ALSO CAN'T TALK ABOUT WHAT THE FED DOES WITHOUT THINKING ABOUT WHO IS THE HEAD OF THE FED. WALL STREET JOURNAL HAD REPORTING OVER THE WEEKEND THAT YOU MIGHT GET SOMEONE LIKE SUMMERLIN OR A PICK THAT SHOWS THAT WE MAYBE ARE GETTING SCOTT BESSENT TO RUN THIS PROCESS. JUST LOOKING AT THESE NAMES OF CANDIDATES, HOW MUCH DOES IT CHANGE YOUR OUTLOOK FOR WHAT THE FED DOES IN 2026? > > I THINK IT'S NO SURPRISE THAT WE WILL SEE MORE DOVISH INDIVIDUAL IN THE FED CHAIR. MOST OF THESE PIX, THEY ARE NOT SO FAR OUT OF THE RANGE OF CONSENSUS. NO ONE IS REALLY AN ODDBALL FROM LEFT FIELD SO WE WILL BE WATCHING CLOSELY. IT IS JUST A MORE DOVISH TONE THAT WILL BE TAKING HOLD. DANI: A MORE DOVISH TONE, BUT WE WERE SPEAKING WITH NEIL ON FRIDAY WHO SAID THAT THERE IS A RISK THAT IF CHAIR POWELL STAYS ON THE GOVERNORSHIP, HE ACTS ALMOST AS A SHADOW FED CHAIR AND TRIES TO KIND OF NAVIGATE DIVERGENCE. IF ANYTHING IT JUST SHOWS A MORE SPLIT AND MORE DISAGREEMENT WITHIN FOMC MEMBERS. MAYBE THAT IS SOMETHING THAT LOOKS MORE AKIN TO THE BOE. HOW WOULD THAT SHAPE POLICY IF IT IS A FED THAT IS MORE DIVIDED AND HAS LESS OF THE CONSENSUSBUILDING THAT WE COME TO EXPECT? > > WE SEE THIS IN THE PAST COUPLE OF MEETINGS LIKE TWO CAMPS ARE EMERGING IN THE FED BOTH IN TERMS OF THE DOT PLOT AND THE MOST RECENT DECISION, I THINK THERE'S SOME AMOUNT OF DISSENT AMONGST THE RANKS ALREADY. HOWEVER, YOU HAVE TO CONSIDER THAT WHEN THERE IS DISSENT, EVEN JUST TWO, STILL, THE VAST MAJORITY OF THOSE INDIVIDUALS ARE STILL ALIGNED. DANI: YOU SHOULD PROBABLY NOTE THAT THIS IS GOING TO BE THE FIRST CPI REPORT WITHOUT A CHIEF. I'M SURE TRUMP WILL HAVE SOMETHING TO SAY OF WHAT IT IS, MAYBE DEPENDING ON HOW THE NUMBERS ARE. WHEN YOU LOOK AT THE ECONOMIC DATA, A LOT HAS BEEN SET ABOUT FEWER RESPONSES, MAYBE LESS RELIABILITY. IF YOU LOOK AT A MORE POLITICAL APPOINTMENT, HOW WOULD YOU APPROACH THE DATA COMING IN? DO YOU LOOK FOR MORE ALTERNATIVE SOURCES? MAYBE YOU ALREADY ARE AT THIS MOMENT. > > WITH REGARDS TO WHO IS IN CHARGE, THAT IS NOT SOMEONE WHO HAS THEIR HANDS ON THE DATA. SO I WOULD NOT EXPECT EITHER THE PREVIOUS COMMISSION OR ANY FUTURE COMMISSIONERS TO REALLY BE PUSHING ON THE SCALE ONE WAY OR ANOTHER. I'M ACTUALLY MORE CONCERNED ABOUT AS YOU MENTIONED ARE THE LOWER RESPONSE RATES, BUT WE'VE ALSO JUST SEE MORE DATA POINTS. OVER ONE THIRD OF CPI DATA POINTS ARE NOW BEING IMPUTED IN AT LEAST THE MOST RECENT MONTH OF DATA. SO WE ARE LOOKING FOR THAT DIVERGENCE. IT WON'T HAPPEN AT FIRST. ANYTIME WE GET A DRIFT AWAY WE WOULD EXPECT THAT DIVERGENCE TO WIDEN OVER TIME. IF ANYTHING I THINK THE RISK IS TO UNDERSTATING CPI, JUST GIVEN WHERE THE STRUCTURAL FACTORS ARE. BUT AT THE END OF THE DAY ALL HE CAN DO IS LOOK FOR ADDITIONAL DATA SOURCES TO EITHER REFUTE OR DENY IT OR COLLABORATE WHAT WE SEE COMING OUT OF THE CPI, BUT WE WILL BE WATCHING OTHER DATA SETS CLOSELY AS WELL. DANI: THANK YOU SO MUCH FOR JOINING, THIS WAS FANTASTIC AS ALWAYS. COMING UP ON THE SHOW, AND UNPRECEDENTED ARRANGEMENT. SHARES OF NVIDIA AND AMD LOWER IN THE PREMARKET TRADING AFTER AN AGREEMENT WITH THE U.S. GOVERNMENT. WE ARE GOING TO HAVE MORE OF THAT NEXT COMING UP ON YOUR \"BRIEF.” WELCOME BACK, I'M DANI BURGER IN NEW YORK. LET'S GET YOU THE LATEST ON TRADE, WHERE PRESIDENT TRUMP IS URGING CHINA TO QUADRUPLE WITH PURCHASES OF U.S. SOYBEANS. IT COMES JUST A DAY BEFORE THE U.S.-CHINA TRADE TRUCES EXPIRING. FOR MORE WE ARE JOINED BY BRENDAN MURRAY WHO LEADS OUR GLOBAL TRADE COVERAGE FOR US. A AGO, HOW ARE THINGS LOOKING BETWEEN THE U.S. AND CHINA NEGOTIATIONS? > > IT SOUNDS LIKE PRESIDENT TRUMP IS TRYING TO NUDGE HIS COUNTERPART TO ENGAGE. HE SAID THANK, PRESIDENT XI AND HERE WE ARE LESS THAN 24 HOURS BEFORE THAT DEADLINE AND WE STILL DON'T SEE ANY MOVEMENT TOWARD A TRUCE. AT LEAST PUBLICLY. WE WILL HAVE TO SEE HOW THINGS PLAY OUT IN WASHINGTON TODAY, BUT THOSE TARIFFS THAT THE U.S. AND CHINA HAD ON EACH OTHER ARE GOING TO SNAP BACK IF NOTHING HAPPENS BETWEEN NOW AND MIDNIGHT WASHINGTON TIME TONIGHT. DANI: AND AGAIN, THE LATEST CALL HERE IS FOR SOYBEAN PURCHASES. DO WE UNDERSTAND WHAT SOME OF THE STICKING POINTS CONTINUE TO BE BETWEEN THE TWO COUNTRIES? > > THEY CONTINUE TO BE, AND HAVE BEEN FOR WEEKS NOW, THE SUPPLY OF MAGNETS THAT CHINA CONTROLS, AND RESUPPLY OF ADVANCED CHIPS THAT THE U.S. CONTROLS, SO WE ARE SEEING SOME HORSETRADING GOING ON. COMMERCE SECRETARY HOWARD LUTNICK HAS CALLED IT AS SUCH, SO I THINK WE ARE SEEING BOTH SIDES TRYING TO POSITION THEMSELVES TO GIVE A LITTLE IN THAT AREA, BUT NOT GIVE TOO MUCH. SO THOSE ARE THE MAIN THINGS THAT ARE BOGGING DOWN THE TWO SIDES FROM REACHING ANY SORT OF AGREEMENT. BUT WE COULD SEE SOMETHING BEFORE THE END OF TODAY, AND SOYBEANS IS SORT OF THAT CLASSIC AMERICAN EXPORTS TO CHINA HAS TRADITIONALLY BOUGHT A LOT OF, BUT HAS BEEN GOING TO SOUTH AMERICA MORE RECENTLY. IN THE PRICE OF SOYBEANS IN THE U.S. HAS BEEN PRETTY FLAT FOR A WHILE. SO PRESIDENT TRUMP IS TRYING TO OFFER CHINA A WAY TO KICKSTART THOSE NEGOTIATIONS WHILE ALSO SORT OF JUICING THE SOYBEAN MARKET FOR AMERICAN FARMERS WHO ARE SITTING THERE LOOKING AT THEIR SOYBEAN FIELDS GOING WE ARE NOT GOING TO MAKE A WHOLE LOT OF MONEY THIS YEAR UNLESS PRICES GO HIGHER. DANI: YOU'RE GOING TO CATCH UP SHORTLY ABOUT AMD AND NVIDIA AGREEING TO GIVE THE U.S. GOVERNMENT 15% OF THEIR SALES REVENUE TO CHINA ON AI CHIPS, BUT CAN WE JUST HANG FOR A MINUTE ON THE POLITICS OF THIS? SOME PEOPLE LOOK AT THIS AND SAY OK, WE ARE TERROR THINK EXPORTS NOW -- TARIFFING EXPORTS NOW? HOW UNUSUAL IS THIS MOVE? > > GETS PRETTY UNUSUAL AND THE CHINA HAWKS INSIDE AND OUTSIDE THE MINISTRATION IN WASHINGTON ARE GOING TO CRITICIZE THIS AS YOU ARE BASICALLY SELLING WHAT USED TO BE NATIONAL SECURITY LEVERAGE AND THE WAY OF EXPORT CONTROLS. PRESIDENT TRUMP MIGHT TURN THAT AROUND AND SAY WE NEED TO FIND A WAY TO DEAL WITH CHINA AND WHY NOT CHARGE THE COMPANY AT THE 15% AND MAYBE THEY WILL PASS THAT ON THE CHINESE BUYERS THE SAME WAY THAT THE PRESIDENT IS CHARGING AMERICAN IMPORTERS TARIFFS THAT HE SAYS WILL BE PAID ULTIMATELY BY FOREIGN TRADING PARTNERS. DANI: THANK YOU VERY MUCH. LET'S GET MORE ON THAT STORY. CHARLES JOINS US NOW FOR MORE ON THIS, GIVING UP 50% OF THEIR AI REVENUE FROM CHINA CHIP SALES TO THE U.S. GOVERNMENT. CHARLES, HOW DOES THIS CHANGE THE BUSINESS MODEL AND WHERE AMD AND NVIDIA GO FROM HERE? > > THIS IS ACTUALLY A VERY NEW MOVEMENT BECAUSE THEY ACTUALLY SHOWCASED FOR THE REVENUE SHARING WILL BE PART OF A NEW EXPORT POLICY ON THE TRUMP ADMINISTRATION. GOING FORWARD FROM AN INVESTOR PERSPECTIVE, ACTUALLY, POLICY WILL BE PART OF THE MODEL. THEY HAVE TO COUNT HOW MANY PERCENTAGES HAVE TO BE SHARED WITH THE GOVERNMENT, AND ALSO, THE POLICY WILL BE A PART OF THE COMPETITION FOR THE FIRE AND THE SELLER TO ALSO CONSIDER. IN THE NEAR FUTURE, WHO KNOWS WHEN THAT GOES TO 25% OR EVEN MORE. THAT IS SOMETHING THAT I THINK FROM INVESTORS PERSPECTIVE, THEY HAVE TO CONSIDER. DANI: WHILE WE ARE TALKING ABOUT CORPORATE AMERICA AND TECH COMPANIES UNDER PRESSURE, THERE IS THE INTEL CEO. THE JOURNAL REPORTING THAT HE'S GOING TO BE VISITING THE WHITE HOUSE. WHAT IS THE LIKELIHOOD THAT HE CAN STAY ON, IS THERE ANY WIGGLE ROOM FOR HIM AT THIS MOMENT IN NEGOTIATING WITH THIS WHITE HOUSE? > > THAT'S A VERY GOOD QUESTION. I THINK THAT A VERY BIG QUESTION THAT THE CEO HAS TO ANSWER. WHETHER INTEL WILL CONTINUE TO MAINTAIN ITS BIG INVESTMENT IN U.S. CHIPMAKING HAS MENTIONED THAT INTEL WILL INVEST ABOUT 100 BILLION U.S. DOLLARS IN A CHIPMAKING CAPACITY OVER FIVE YEARS. BUT SINCE THE NEW CEO COMES ON BOARD AT THE EARNINGS CALL, HE JUST MENTIONED THAT HE WILL ACTUALLY BE FOCUSED ON BRINGING THAT BACK, ON ALL THE MONEY SPENT. INTEL WILL STILL COMMIT TO CHIPMAKING EXPANSION. DANI: THANK YOU VERY MUCH UPDATES. THAT IS CHARLES OF BLOOMBERG INTELLIGENCE. MEANWHILE GOLD FUTURES ARE FALLING AS TRADERS AWAIT FURTHER CLARIFICATION FROM THE WHITE HOUSE OVER TARIFF POLICY, DOWN 2.1% THIS MORNING AFTER A RALLY ON FRIDAY OVER THOSE SURPRISE TARIFFS FROM THE CUSTOMS AND BORDER PATROL THAT THEY WERE CHARGING ON GOLD FROM SWITZERLAND. JACK RYAN JOINS US FOR MORE. JACK, WHAT SORT OF CLARIFICATION MIGHT WE GET FROM THE WHITE HOUSE TODAY? > > THAT'S WHAT EVERYONE IS WATCHING FOR. WE ARE NOT SURE IF IT'S GOING TO COME TODAY OR LATER THIS WEEK. THEY SAID FRIDAY THAT THEY WOULD BE ISSUING AN EXECUTIVE ORDER TO ADDRESS WHAT THEY CALLED MISINFORMATION AND THE GOLD MARKET, AND THAT WAS BASICALLY COMING AFTER THURSDAY AND THROUGH FRIDAY, WE HAD THIS QUITE DRAMATIC CUSTOMS AND BORDER PROTECTION AGENCY RULING WHICH ESSENTIALLY SAID THAT BARS OF GOLD, THE MOST COMMON TYPE TRADED IN THE UNITED STATES, WOULD BE SUBJECT TO TARIFFS. THAT CAME AS A REAL SHOCK TO THE MARKET. AND SO THE WHITE HOUSE WAS QUICK TO ADDRESS THAT, BUT NO ONE KNOWS EXACTLY WHAT THEY'RE GOING TO SAY. DANI: SO WHAT ARE REFINERS DOING IN THE MEANTIME, IS THIS A MARKET THAT IS FROZEN? > > EXACTLY. I DON'T THINK THERE'S ANY GOLD ON THE WAY TO THE UNITED STATES NOW. FROM SPEAKING TO REFINERS MYSELF, THEY ARE TERRIFIED BY THIS, AND ESSENTIALLY THEY DON'T WANT TO TAKE THE RISK OF TAKING A POTENTIALLY 39% TARIFF ON GOLD BARS THAT THEY ARE EXPORTING TO THE UNITED STATES BECAUSE THE MARGINS IN THIS INDUSTRY ARE SUPERSLIM. THEY CAN'T WEAR 39% SO THEY ARE REALLY WORRIED ABOUT THIS AND ESSENTIALLY NOT TAKING ANY RISKS. DANI: IF WE DON'T GET SOME SORT OF CLARIFICATION, OR MAYBE EVEN IF WE DO, JUST THE DISRUPTION ITSELF, HOW DOES THAT CHANGE THE GLOBAL GOLD TRADE? WHAT HAPPENS IF WE DO GET SOMETHING THAT LOOKED LIKE A 39% TARIFF? > > I GUESS THE STRANGE THING IS THAT THIS ISN'T REALLY A MARKET FOR GOODS, IT IS REALLY AN INVESTMENT ASSET. NO ONE I THINK WOULD REALLY BE WILLING TO PAY A 39% PREMIUM ON A BAR OF GOLD ANY MORE THAN THEY WOULD PAY A 39% PREMIUM ON AN INVESTMENT SECURITY ABOVE THE MARKET PRICE. SO REALLY, THAT WOULD MAKE IT IMPOSSIBLE TO SHIP GOLD TO THE UNITED STATES. BECAUSE THESE BARS, THEY UNDERPIN THE BIGGEST GOLD FUTURES MARKET IN THE WORLD AND NEW YORK, THERE'S A LOT OF PEOPLE THAT I'VE SPOKEN TO, PEOPLE IN THE MARKET WHO SAID THIS MARKET ACTUALLY BEEN FUNCTION IF YOU HAD TARIFFS I'M GOLD IN THIS WAY. I THINK FOR A LOT OF PEOPLE THE EXPECTATION IS THAT THIS IS THE MAYBE A MISUNDERSTANDING AND PERHAPS WILL BE ROLLED BACK, BUT WE STILL DOVE KNOW YET. DANI: THANK YOU VERY MUCH FOR THAT UPDATE, WE WILL SEE IF WE GET ANY CLARIFICATION FROM THE WHITE HOUSE IN THE NEXT COMING DAYS. GOLD IN THE MEANTIME DOWN 2.2% AFTER THE RALLY ON FRIDAY THAT SO U.S. GOLD AN INTERNATIONAL MOVE FURTHER APART. FOR THIS MARKET IT IS LITTLE CHANGED FOR THE S & P TO SLIGHTLY HIGHER. WE ARE GOING TO HIT AN ALL-TIME HIGH, THOUGH, IF WE CLOSE AT A LEVEL THAT IS CURRENTLY TRADING AT. THE BULLS ARE EMERGING ,CITI UPGRADING THEIR YEAR-END TARGET. BANK OF AMERICA LATEST FUND MANAGER SAYS THAT IT IS THE MOST BULLISH INVESTOR BASED FEBRUARY. COMING UP, A BUSY WEEK OF DATA THAT WILL KICK WITH INFLATION IN AMERICA TOMORROW. WE WILL LAY OUT THE MARKET MOVING EVENTS FOR YOUR TRADING DIARY, COMING UP NEXT. ♪ DANI: YOU ARE WATCHING \"BLOOMBERG BRIEF\" LET'S GET YOU SET UP FOR YOUR TRADING WEEK THIS WEEK. IT IS A BIG PIECE OF DATA COMING OUT TOMORROW, YOUR U.S. CPI OUT ON TUESDAY. EXPECTATION IS FOR 3% AND 2.8% FOR CORE. THAT WILL BE FOLLOWED BY PPI AND JOBLESS CLAIMS THURSDAY. FINALLY WE ARE ROUNDING OUT THE WEEK WITH RETAIL SALES AND THE UNIVERSITY OF MICHIGAN SENTIMENT SURVEY. THOSE BOTH COME OUT FRIDAY. SOME OF THE INDIVIDUAL MOVERS THIS MORNING, BOTH NVIDIA AND AMD FALLING IN THE PREMARKET, AN UNPRECEDENTED DEAL BY ANY STRETCH OF THE IMAGINATION. THE TWO COMPANIES AGREEING TO PAY 15% OF THEIR CHINESE ADVANCED AI CHIP SALES REVENUE TO THE U.S. INTEL SHARES OF 1.6%. THE WALL STREET JOURNAL REPORTED THAT INTEL CEO WILL VISIT THE WHITE HOUSE TODAY. HE CAME UNDER FIRE FROM TRUMP LAST WEEK WITH TRUMP SAYING THAT HE WAS CONFLICTED AND SHOULD RESIGN. MEANWHILE, LITHIUM STOCKS OFF TO THE RACES. 10% FOR LITHIUM, THEY ARE SEARCHING AFTER THEY HALTED THEIR OPERATIONS AT ONE OF THE WORLD'S LARGEST LITHIUM LINES. QUESTIONS WHETHER CHINA IS MOVING BACK ON SOME OF ITS OVERCAPACITY POLICIES. MEANWHILE YOUR BOND MARKET THIS MORNING, WE ARE LOOKING AT A RALLY. YIELDS ARE LOWER BY NEARLY THREE BASIS POINTS. WE MOVED HIGHER BY 6.6 BASIS POINTS. LAST WEEK SOME SOFT OPTIONS ABOUT BIG DATA PIECES COMING UP THAT COULD YET AGAIN SHAKE THIS BOND MARKET. THAT IS IT NOW. \"SURVEILLANCE\" WILL TAKE THINGS FROM HERE.",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. COMPANIES",
      "weight": 0.058956284
    },
    {
      "name": "BOND MARKETS",
      "weight": 0.055686116
    },
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.05152476
    },
    {
      "name": "U.S. CHIPMAKERS AMD",
      "weight": 0.05121048
    },
    {
      "name": "MARKETS",
      "weight": 0.05103484
    },
    {
      "name": "U.S. RETAIL SALES",
      "weight": 0.050955497
    },
    {
      "name": "U.S. TREASURIES",
      "weight": 0.05016952
    },
    {
      "name": "U.S.",
      "weight": 0.050134648
    },
    {
      "name": "U.S. SOYBEANS",
      "weight": 0.05008783
    },
    {
      "name": "CHINA CHIP SALES",
      "weight": 0.049918354
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.93603515625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91748046875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.83544921875
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.8291015625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.377685546875
    }
  ],
  "sentiment": {
    "positive": 0.06021118,
    "negative": 0.73095703,
    "neutral": 0.20910645
  },
  "summary": "Stocks have been trading down ahead of a busy week of data, including a potential meeting between the U.S. and Russia. NVIDIA and AMD have agreed to pay 15% of their CHINA AI CHIP SALES to the US. However, both companies have not provided specific guidance on the size of the revenue they would generate. Meanwhile, Goldman Sachs has boosted its year-end target for its shares, while CITI has boosted their year-ending targets. This could be a test for President Donald Trump's FCC leadership if they approve this type of merger. The following article discusses the potential impact of this merger on the local TV broadcast.",
  "shortSummary": "Stocks waver as investors await crucial economic data and a potential deal between NVIDIA and AMD to boost investor confidence.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f6d7072a6c1e442284d931ef12a09db7",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "NVIDIA and AMD have agreed to pay 15% of their revenue from AI chip sales to China to the U.S. government, marking an unprecedented deal that has led to declines in their stock prices. The market is also anticipating a significant CPI release tomorrow, with bullish sentiment reflected in recent investor surveys. Meanwhile, geopolitical tensions are highlighted by upcoming Trump-Putin talks, with concerns over potential agreements affecting Ukraine's territorial integrity.",
  "argos_id": "5AJ318FNH"
}