{
  "url": "https://www.bloomberg.com/news/videos/2025-08-12/lng-projects-will-drive-gas-prices-up-bkv-ceo-video?srnd=phx-economics-v2",
  "authorsByline": "bn",
  "articleId": "0c8c951db85a4970943c2a27ace7a64e",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iHce9.nUcrVc/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:44:52.996000+00:00",
  "addDate": "2025-08-12T21:52:16.533422+00:00",
  "refreshDate": "2025-08-12T21:52:16.533423+00:00",
  "score": 1.0,
  "title": "LNG Projects Will Drive Gas Prices Up: BKV CEO",
  "description": "BKV Corp., the largest natural gas producer in Texas’ Barnett shale basin, expects strong gas demand in 2026 as liquefied natural gas export terminals come online, driving up prices for the fuel. BKV's CEO Christopher Kalnin has more on the story.  (Source: Bloomberg)",
  "content": "Chris, I have to ask you first about natural gas prices. They were in the tank. They got out of the tank and now suddenly we're well below $3 again. Where do they go from here and why are companies putting on more rigs if the price is so low? Vonnie a first of all, thanks. You know, I think when it comes to natural gas, as you know, it's very seasonal. We're in a shoulder season right now. You know, summer's kind of ending. And so I think there's just some views of supply coming on. The demand hasn't quite hit yet. You know, one of the things that people are waiting for is a lot of the LNG demand that starts to really ramp as we get into the fall and the end of the year here and then especially into 2026 big projects like Golden Pass, you know, other LNG projects that'll be coming online next year are going to be sucking up a lot of gas. And that combined with kind of continued normal weather, is expected to really drive prices up. And that's why you see kind of the strip for 26 still very robust at $4 ish. What are your overall long term good? Yeah. What are your plans for the rest of the year in terms of rig count? So, you know, we're running one rig in the Barnett right now. We can expect to continue that. You know, we have a very kind of large production base. And so for us it's really about gently growing that production in line with the curve. So I think we'll continue those plans along with the 2000 refract candidates that we have in the Barnett, which is tremendous. Low carbon has been suffering under the President currently. I'm curious as to what your plans are in terms of, you know, hydrogen and wind in particular, and whether that can be a profitable, productive business for you. Well, so, Bonnie, we're really big into carbon capture. And I think one of the winners of the one big Beautiful Bill Act was the carbon capture business. So those 45 Q tax credits remained robust. We've always said it's a bipartisan supported agenda item, and Becky believes that one of the most important ways to decarbonize the planet is through carbon capture. So we're going you know, we've stayed big on carbon capture, we're leading the space. We've got multiple projects that are coming online next year and we've already been injecting CO2 for the last over a year now. So we're excited about the future of it. With regards to hydrogen and wind, we'll let other folks make those investments. That's not our core. But with regards to carbon capture, gas and power, that's the winning formula for us and that's where we think a lot of these data centers are going to be very excited about that, that source of energy. Any other positives out of the one beautiful bill, as the president used to call it? Well, so there's there's there's other things that we think are very prospective for us. One, as you know, in terms of the accounting for capital, when you spend lots of capital investing in that, you can, you know, obviously use that to offset your income early on. And that's we think that's very constructive. We think the the plans to kind of streamline the regulation around permitting and other things that are coming down the pike are are also very attractive. And then, of course, just the carbon capture business and the ability to kind of grow nuclear alongside of that. We think those things are synergistic with both decarbonization as a planet, but also for businesses that we are very focused on. Chris, How confident are you that we'll see more pipelines being built in the next couple of years? I mean, you were very bullish during Trump 1.0. Are you still as positive now several years later? That's a good question, Bonnie. I think when you look at the pace at which we expect pipelines to be built, I don't think we're going to see, you know, back to sort of ten, 20 years ago, but we will see pipelines get built. I do think that there is a big push. This administration has made it very clear that they want to get rid of the red tape. I think we are going to see key pipelines get accelerated. So I do expect more. I think as you think about the Gulf Coast in particular, where you have to move, you know, 20 Bcf of gas into the corridors that supply LNG, most of that around Texas and Louisiana. You absolutely need a new pipe to be built. And so I do expect many of those projects to go forward. As you look at areas that are harder to build, maybe the Northeast, I think that is more challenging. So I think it will depend on where you're talking about.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "carbon capture",
      "weight": 0.08569321
    },
    {
      "name": "other LNG projects",
      "weight": 0.08359082
    },
    {
      "name": "next year",
      "weight": 0.07886803
    },
    {
      "name": "other things",
      "weight": 0.077286705
    },
    {
      "name": "big projects",
      "weight": 0.07594035
    },
    {
      "name": "natural gas prices",
      "weight": 0.074885316
    },
    {
      "name": "Gas Prices",
      "weight": 0.07244321
    },
    {
      "name": "Low carbon",
      "weight": 0.07028959
    },
    {
      "name": "natural gas",
      "weight": 0.06997944
    },
    {
      "name": "LNG Projects",
      "weight": 0.06857387
    }
  ],
  "topics": [
    {
      "name": "Business Leaders"
    },
    {
      "name": "Energy Sector"
    },
    {
      "name": "Oil & Gas"
    },
    {
      "name": "Oil Sector"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Energy & Utilities/Oil & Gas",
      "score": 0.92236328125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.75830078125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.548828125
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.3505859375
    }
  ],
  "sentiment": {
    "positive": 0.30490673,
    "negative": 0.27293324,
    "neutral": 0.42216
  },
  "summary": "BKV CEO Vonnie Watts discusses natural gas prices, which have dropped from $3 to $4, suggesting that LNG projects like Golden Pass, Golden Pass and other LNG developments are expected to drive prices up. He also discusses plans to continue running one rig in the Barnett area, which he believes will continue this trend. Watts also highlighted the potential for carbon capture in the future, citing multiple projects that are coming online next year and ongoing normal weather conditions as reasons for this. The company also highlighted its commitment to streamline regulation and streamline permitting, and its potential for growth in the carbon capture business. Finally, Watts mentioned the future of hydrogen and wind, but noted that the company's focus is on carbon capture, gas and power, and that a lot of data centers are excited about this source of energy. He expressed confidence in the ability to grow nuclear alongside carbon capture and other potential benefits of this technology. Watts mentioned that the administration's plans to streamify permitting and other things coming down the pike were also considered attractive. Finally discussed the potential impact on natural gas pipelines, particularly in the Northeast.",
  "shortSummary": "BKV CEO Chris Kv CEO discusses natural gas prices, predicting increased LNG demand and carbon capture, and plans for future growth in carbon capture and hydrogen fuel economy.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1622704f11a345b79d5549656004748c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Natural gas prices are currently low, but demand is expected to rise as LNG projects come online, particularly in 2026. Companies are maintaining rig counts to gradually increase production, with a focus on carbon capture as a key strategy for decarbonization. The administration's efforts to streamline regulations may lead to more pipeline construction, especially in regions like the Gulf Coast, although challenges remain in areas like the Northeast.",
  "argos_id": "5BPUDC29V"
}