{
  "url": "https://www.fastcompany.com/91383723/michigans-governor-meets-trump-deliver-message-u-s-auto-industry-he-doesnt-want-hear",
  "authorsByline": "Associated Press",
  "articleId": "2f741e45e3df474c97c4468deafa20ab",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/08/p-1-91383723-whitmer-trump-michigan-auto-jobs.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T13:27:03+00:00",
  "addDate": "2025-08-11T14:00:31.074307+00:00",
  "refreshDate": "2025-08-11T14:00:31.074308+00:00",
  "score": 1.0,
  "title": "Michigan’s governor meets with Trump to deliver a message from the U.S. auto industry that he doesn’t want to hear",
  "description": "In a private meeting, Whitmer told Trump that Michigan's auto industry would be severely impacted from his tariffs.",
  "content": "Michigan Gov. Gretchen Whitmer met privately in the Oval Office with President Donald Trump to make a case he did not want to hear: The automotive industry he said he wants to save was being hurt by his tariffs.\n\n\n\nThe Democrat came with a slide deck to make her points in a visual presentation. Just getting the meeting Tuesday with the Republican president was an achievement for someone viewed as a contender for her party’s White House nomination in 2028.\n\n\n\nWhitmer’s strategy for dealing with Trump highlights the conundrum for her and other Democratic leaders as they try to protect the interests of their states while voicing their opposition to his agenda. It’s a dynamic that Whitmer has navigated much differently from many other Democratic governors.\n\n\n\nThe fact that Whitmer had “an opening to make direct appeals” in private to Trump was unique in this political moment, said Matt Grossman, a Michigan State University politics professor.\n\n\n\nIt was her third meeting with Trump at the White House since he took office in January. This one, however, was far less public than the time in April when Whitmer was unwittingly part of an impromptu news conference that embarrassed her so much she covered her face with a folder.\n\n\n\nOn Tuesday, she told the president that the economic damage from the tariffs could be severe in Michigan, a state that helped deliver him the White House in 2024. Whitmer also brought up federal support for recovery efforts after an ice storm and sought to delay changes to Medicaid.\n\n\n\nTrump offered no specific commitments, according to people familiar with the private conversation who were not authorized to discuss it publicly and spoke only on condition of anonymity to describe it.\n\n\n\nWhitmer is hardly the only one sounding the warning of the potentially damaging consequences, including factory job losses, lower profits and coming price increases, of the import taxes that Trump has said will be the economic salvation for American manufacturing.\n\n\n\nWhite House spokesman Kush Desai said no other president “has taken a greater interest in restoring American auto industry dominance than President Trump.” Trade frameworks negotiated by the administration would open up the Japanese, Korean and European markets for vehicles made on assembly lines in Michigan, Desai said.\n\n\n\nBut the outreach Trump has preferred tends to be splashy presentations by tech CEOs. In the Oval Office on Wednesday, Apple CEO Tim Cook gave the president a customized glass plaque with a gold base as Cook promised $600 billion in investments. Trump claims to have brought in $17 trillion in investment commitments, although none of those numbers has surfaced yet in economic data.\n\n\n\nUnder his series of executive orders and trade frameworks, U.S. automakers face import taxes of 50% on steel and aluminum, 30% on parts from China and a top rate of 25% on goods from Canada and Mexico not covered under an existing 2020 trade agreement. That puts America’s automakers and parts suppliers at a disadvantage against German, Japanese and South Korean vehicles that only face a 15% import tax negotiated by Trump last month.\n\n\n\nOn top of that, Trump this past week threatened a 100% tariff on computer chips, which are an integral part of cars and trucks, though he would exclude companies that produce chips domestically from the tax.\n\n\n\nWhitmer’s two earlier meetings with Trump resulted in gains for Michigan. But the tariffs represent a significantly broader request of a president who has imposed them even more aggressively in the face of criticism.\n\n\n\nMaterials in the presentation brought by Whitmer to the meeting and obtained by The Associated Press noted how trade with Canada and Mexico has driven $23.2 billion in investment to Michigan since 2020.\n\n\n\nGeneral Motors, Ford, and Stellantis operate 50 factories across the state, while more than 4,000 facilities support the auto parts supply chain. Altogether, the sector supports nearly 600,000 manufacturing jobs, forming the backbone of Michigan’s economy.\n\n\n\nWhitmer outlined the main points of the materials to Trump and left copies with his team.\n\n\n\nTo Grossman, the Michigan State professor, a key question is whether voters who expected to be helped by tariffs would react if Trump’s import taxes failed to deliver the promised economic growth.\n\n\n\n“Everyone’s aware that Michigan is a critical swing state and the auto industry has outsized influence, not just directly, but symbolically,” Grossman said.\n\n\n\nAP VoteCast found that Trump won Michigan in 2024 largely because two-thirds of its voters described the economic conditions as being poor or “not so good.” Roughly 70% of the voters in the state who felt negatively about the economy backed the Republican. The state was essentially split over whether tariffs were a positive, with Trump getting 76% of those voters who viewed them favorably.\n\n\n\nThe heads of General Motors, Ford and Stellantis have repeatedly warned the administration that the tariffs would cut company profits and undermine their global competitiveness. Their efforts have resulted in little more than a temporary, monthlong pause intended to give companies time to adjust. The reprieve did little to blunt the financial fallout.\n\n\n\nIn the second quarter alone, Ford reported $800 million in tariff-related costs, while GM said the import taxes cost it $1.1 billion. Those expenses could make it harder to reinvest in new domestic factories, a goal Trump has championed.\n\n\n\n“We expect tariffs to be a net headwind of about $2 billion this year, and we’ll continue to monitor the developments closely and engage with policymakers to ensure U.S. autoworkers and customers are not disadvantaged by policy change,” Ford CEO Jim Farley said on his company’s earning call.\n\n\n\nSince Trump returned to the White House, Michigan has lost 7,500 manufacturing jobs, according to the Bureau of Labor Statistics.\n\n\n\nSmaller suppliers have felt the strain, too.\n\n\n\nDetroit Axle, a family-run auto parts distributor, has been one of the more vocal companies in Michigan about the impact of the tariffs. The company initially announced it might have to shut down a warehouse and lay off more than 100 workers, but later said it would be able to keep the facility open, at least for now.\n\n\n\n“Right now it’s a market of who is able to survive, it’s not a matter of who can thrive,” said Mike Musheinesh, owner of Detroit Axle.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/91325854/in-major-reversal-trump-signs-orders-giving-u-s-automakers-some-relief-tariffs",
    "https://www.fastcompany.com/91211264/gov-gretchen-whitmer-just-made-it-possible-for-35000-michigan-home-health-workers-to-unionize",
    "http://fastcompany.com/91311123/trumps-tariffs-will-hurt-the-entire-auto-industry-but-especially-evs"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Trump",
      "weight": 0.08264022
    },
    {
      "name": "President Trump",
      "weight": 0.082257815
    },
    {
      "name": "Donald Trump",
      "weight": 0.08082481
    },
    {
      "name": "President Donald Trump",
      "weight": 0.078095935
    },
    {
      "name": "Michigan Gov. Gretchen Whitmer",
      "weight": 0.072953805
    },
    {
      "name": "Michigan State",
      "weight": 0.06722643
    },
    {
      "name": "Michigan",
      "weight": 0.06483661
    },
    {
      "name": "Michigan State University",
      "weight": 0.06444553
    },
    {
      "name": "tariffs",
      "weight": 0.058143653
    },
    {
      "name": "Gretchen Whitmer",
      "weight": 0.057598237
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.994140625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.97998046875
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.8359375
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.8134765625
    }
  ],
  "sentiment": {
    "positive": 0.07736374,
    "negative": 0.6605345,
    "neutral": 0.2621018
  },
  "summary": "Michigan Gov. Gretchen Whitmer met with President Donald Trump to deliver a message from the U.S. auto industry that he did not want to hear. The meeting was part of Whitmer's strategy to protect the interests of her states while opposing his agenda. This was her third meeting with Trump at the White House since he took office in January. Whitmer warned that the economic damage from the tariffs could be severe in Michigan, a state that helped deliver him the White White House in 2024. The White House said that no other president has greater interest in restoring American auto industry dominance than Whitmer. The tariffs represent a broader request from a president who has imposed them more aggressively in the face of criticism.",
  "shortSummary": "Michigan Governor Gretchen Whitmer met President Donald Trump privately to warn him of the economic damage caused by his tariffs, emphasizing the need to protect the state's manufacturing sector.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6dc069ff5bd649f4b1e87f438ab635cd",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Michigan Governor Gretchen Whitmer met with President Donald Trump to discuss the negative impact of his tariffs on the automotive industry, which is crucial to Michigan's economy. Despite her efforts to present data highlighting potential job losses and economic damage, Trump did not make specific commitments to address her concerns. The tariffs have already resulted in significant financial burdens for major automakers like Ford and GM, contributing to job losses in the state. Whitmer's approach contrasts with other Democratic leaders, as she seeks to protect her state's interests while navigating a challenging political landscape.",
  "argos_id": "5LYYK9ZN4"
}