{
  "url": "https://www.foxnews.com/politics/youngkin-credits-trump-administration-with-bolstering-anti-trafficking-efforts",
  "authorsByline": "Ashley Oliver, Breanne Deppisch",
  "articleId": "a7f5050592164e609a3906e50e29d4d6",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/donald-trump-glenn-youngkin.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T15:44:36-04:00",
  "addDate": "2025-08-12T19:56:17.147768+00:00",
  "refreshDate": "2025-08-12T19:56:17.147769+00:00",
  "score": 1.0,
  "title": "Youngkin credits Trump administration with bolstering anti-human trafficking efforts",
  "description": "Gov. Glenn Youngkin outlines Virginia's human trafficking efforts at annual conference, crediting Trump administration support for enhanced federal cooperation.",
  "content": "Gov. Glenn Youngkin laid out his plans to address human trafficking during an annual conference Tuesday, saying the Trump administration has been a shot in the arm to state law enforcement as it attempts to tackle the elusive issue.\n\nYoungkin, joined by Virginia Attorney General Jason Miyares and other state attorneys general, compared human trafficking enforcement to addressing transnational gangs.\n\n\"We must have multi-state and federal support in order to dismantle the networks, not just arrest an individual, we've got to unpack the networks,\" Youngkin told a crowd of a few hundred.\n\nThe Trump administration has been a boon to human trafficking enforcement efforts, Youngkin said, noting he met with top Justice Department officials at the White House after the inauguration to discuss the matter and found them receptive. Virginia law enforcement has since been coordinating with the federal government to take down foreign gang operations, which Youngkin said overlaps with the human trafficking space. Youngkin used the example of gang crime inside correctional centers, which he said was the first \"thread\" his team pulled.\n\n\"We were able to unpick [MS-13 gangs] from their phones,\" Youngkin said. \"What we found was an immense network being run out of incarcerated criminals, and once the FBI tools and the Homeland Security tools and the state police tools could all be unleashed, in the FBI regional headquarters here in Northern Virginia, a map went up on the wall of the organization, and it's just like any other work chart.\"\n\nMiyares said in an interview with Fox News Digital he made requests to the Biden administration for an interagency task force to address MS-13, Tren de Aragua and other gangs but that the requests were made \"on deaf ears.\" He said that, by contrast, the Trump administration has acted quickly.\n\n\"It's not just drug trafficking. Human trafficking is a huge component of it.… Within 30 days, [the Trump administration] had both approved it and given us interagency space at the FBI field office in Manassas, a huge space where we had both federal, state and local law enforcement working together,\" Miyares said.\n\nIn March, the U.S. attorney for Eastern Virginia announced the task force had made 342 arrests, \"many of them with illegal status,\" and that 81 had \"gang or transnational crime affiliation.\"\n\nHuman trafficking violations are governed largely by the Trafficking Victims Protection Act, a law passed more than two decades ago. Incidents can involve a person forcing or coercing another person into performing labor or sexual acts. The perpetrators tend to target children, women and vulnerable people, such as those living in economic hardship, fleeing natural disasters or struggling psychologically.\n\nYoungkin said human trafficking is an \"ill-defined\" problem.\n\nMiyares echoed those sentiments, saying human trafficking violations were \"multifaceted.\" He cited instances of missing children in his state and an arrest made in 2022 after migrants were discovered working illegally in a laundry facility in Williamsburg.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWest Virginia Attorney General JB McCuskey told Fox News Digital in an interview after the event that trafficking cases \"all look so very different\" but that foster children in his state were particularly susceptible. He said he hopes to harness artificial intelligence to use data across agencies to get a firmer grasp on the issue.\n\n\"I think the biggest next step is building these communication bridges between agencies.… Because once a kid is found, [police] need to know everything immediately, and it needs to all be in one centralized place so that a correct decision can be made very, very quickly,\" McCuskey said. \"Because these things happen fast, and a kid's life can be ruined in a day and a half because an adult made the wrong decision based on bad intervention.\"",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/category/us/us-regions/southeast/west-virginia",
    "https://www.oag.state.va.us/media-center/news-releases/2509-december-9th-2022-attorney-general-miyares-hampton-roads-human-trafficking-task-force-secures-indictments",
    "https://www.foxnews.com/us/floridas-operation-dragon-eye-rescues-dozens-critically-missing-children-massive-sting",
    "https://www.foxnews.com/category/person/donald-trump",
    "https://www.foxnews.com/video/6375971838112",
    "https://www.foxnews.com/category/politics/justice-department",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.foxnews.com/politics/virginia-democrats-choose-nominee-challenge-gop-attorney-general-jason-miyares"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "human trafficking enforcement",
      "weight": 0.09282431
    },
    {
      "name": "human trafficking enforcement efforts",
      "weight": 0.089538366
    },
    {
      "name": "human trafficking",
      "weight": 0.08676904
    },
    {
      "name": "Human trafficking violations",
      "weight": 0.085144125
    },
    {
      "name": "state law enforcement",
      "weight": 0.082776345
    },
    {
      "name": "Virginia law enforcement",
      "weight": 0.07984376
    },
    {
      "name": "Human trafficking",
      "weight": 0.07645796
    },
    {
      "name": "human trafficking violations",
      "weight": 0.076350845
    },
    {
      "name": "other state attorneys",
      "weight": 0.07245617
    },
    {
      "name": "trafficking cases",
      "weight": 0.07173445
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Kidnapping"
    },
    {
      "name": "Sexual Exploitation"
    },
    {
      "name": "Environment-ESG"
    },
    {
      "name": "Human Trafficking"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Environment"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97607421875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.88037109375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.87060546875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.81640625
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.78759765625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.69921875
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.6982421875
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.379150390625
    }
  ],
  "sentiment": {
    "positive": 0.087649584,
    "negative": 0.5954768,
    "neutral": 0.31687364
  },
  "summary": "Gov. Glenn Youngkin of Virginia has praised the Trump administration for bolstering state law enforcement efforts against human trafficking, comparing it to addressing transnational gangs. Youngkin, joined by Virginia Attorney General Jason Miyares and other state attorneys general, compared human trafficking enforcement to addressing foreign gang operations. He emphasized the need for multi-state and federal support to dismantle networks rather than just arrest individuals. The Trump administration has been supportive in assisting in human trafficking efforts, with law enforcement coordinating with the federal government to take down foreign gangs. Miyares also commended the administration's swift action on an interagency task force to address MS-13, Tren de Aragua, and other gangs, stating that within 30 days, the administration had approved it and given us interagency space at the FBI field office in Manassas. Human trafficking violations are governed by the Trafficking Victims Protection Act, a law passed more than two decades ago. West Virginia attorney General JB McCuskey said he hopes to harness artificial intelligence to use data across agencies to help with the issue.",
  "shortSummary": "The Trump administration's support for state law enforcement in tackling human trafficking has led to significant arrests and collaborations, emphasizing the need for multidisciplinary efforts.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "98e3689efdfb4ee6b6646134afdfb7af",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/category/us/us-regions/southeast/west-virginia",
      "text": "Bernie Sanders 10 hours ago Bernie Sanders brings 'Fighting Oligarchy Tour' to Trump strongholds across deep-red West Virginia GOP officials point to 500,000 registered Republicans as evidence of political momentum in Mountain State.\nBernie Sanders 2 days ago Bernie Sanders addresses whether he’ll run in 2028 Sen. Bernie Sanders addressed the possibility of a 2028 presidential run while conducting Fighting Oligarchy Tour, focusing on working-class agenda.\nDonald Trump 5 days ago Charleston bishop rebukes Trump's 'harsh' deportations, cites George W Bush's 'acceptable' plans Catholic Bishop Mark Brennan condemns President Donald Trump's mass deportation efforts while praising former President George W. Bush's immigration approaches in West Virginia.\nOlympics July 9 Olympic gold medalist Mary Lou Retton in denial after failing field sobriety tests in DUI arrest, video shows Police bodycam footage showed Mary Lou Retton's DUI arrest in West Virginia, where the Olympic gymnastics legend failed sobriety tests before being cuffed.\nOlympics July 8 Olympic legend Mary Lou Retton's DUI mugshot comes out months after arrest Mary Lou Retton's mugshot was released after a May DUI charge in West Virginia for which she took full responsibility and entered a no-contest plea\nOpinion July 8 Supreme Court agrees to hear our women’s sports cases The Supreme Court will hear arguments from female athletes challenging males in women's sports, as they advocate for protecting opportunities and safety for future generations of women.\nSports July 3 Supreme Court to review state bans on transgender athletes' participation in school sports The Supreme Court decided Thursday to review state bans on transgender athletes participating in public school sports.\nElections July 2 ‘Crisis brewing’ in Trump Country as hospitals shutter at alarming rate, top ER doc warns Healthcare crisis impacts rural America as emergency rooms struggle with unpaid services, overcrowding and staff safety issues, while federal officials consider potential solutions\nVIDEO June 27 Nationwide injunctions 'endanger' public perception of the court, West Virginia AG says West Virginia Attorney General John McCuskey fires back at backlash against the Supreme Court's ruling limiting nationwide injunctions on 'The Story.'\nState And Local June 16 AG leading suit against NY effort to punish energy firms for climate change warns of major repercussions West Virginia Attorney General JB McCuskey warns New York and Vermont laws imposing billions in climate liabilities would have devastating economic impacts.\nPolitics June 14 Governors warn anti-Trump 'No Kings' protesters against becoming violent: 'You're going to get arrested' Republican governors take firm stance against anticipated unrest during President Donald Trump's commemoration of Army's 250th anniversary.\nRepublicans June 5 ‘Climate cult’ on notice as lawmakers push to let feds hop blue-state roadblocks to ‘US energy dominance' Legislation backed by 37 lawmakers aims to lower energy costs by preventing states from blocking interstate energy projects.\nFood June 4 Mobile teaching kitchens roll out in West Virginia to fight state's high obesity rate West Virginia launches mobile teaching kitchens and hiking trails under Gov. Morrisey's Make America Healthy Again initiative to reduce obesity and diabetes, plus promote wellness.\nWest Virginia May 28 West Virginia gov vows to protect women's sports as trans athlete competes for girls' state championship West Virginia Gov. Patrick Morrisey vowed to protect women's sports as a transgender athlete participated in girls state track and field championships.\nOlympics May 27 Olympic legend Mary Lou Retton arrested on DUI charge, records show Olympic gymnastics legend Mary Lou Retton was arrested in West Virginia earlier this month on a DUI charge, according to court records.\nTravel May 16 Angler shatters previous fish state record by reeling in black crappie A record-breaking 17.7-inch black crappie caught by Jerry Porter at East Lynn Lake highlights West Virginia's third fish record of 2025. The freshwater fish weighed 3.6 pounds.\nGreat Outdoors May 12 Lucky anglers break two state fishing records on same day: 'Dedication and passion' Two fishermen in West Virginia set records on the same day after they caught a record-breaking redhorse sucker and a redear sunfish, as announced by WVDNR officials.\nOpinion May 2 DAVID MARCUS: How I stumbled on the secret to overcoming political division in today's fractious USA Ultimately, a friend is not the person who can tell you what you want to hear. Anyone can do that. It is the person who can question your judgment.\nHealth April 24 This simple outdoor activity can improve Americans' health, says governor West Virginia has launched a \"Mountaineer Mile\" in an effort to get Americans outside and moving to increase physical and mental health. The state has been a leader in pushing for MAHA initiatives.\nPolitics April 11 Babydog Justice makes Energy Committee debut as Sen Jim Justice talks Trump, coal and grid reform Sen. Jim Justice backed Trump’s latest energy executive order during a Senate hearing — while Babydog charmed lawmakers and reminded them to smile.\nVIDEO April 8 Babydog 'not up for auction' at Senate Agriculture hearing Babydog, the English bulldog of Sen. Jim Justice, R-W.Va., made a surprise appearance at the Senate Agriculture Committee hearing, charming attendees and senators. (@BabydogJustice via X)\nPolitics March 30 RFK Jr talks Kennedy history on first trip as HHS chief, inspires gov to order ‘Mountaineer Mile’ for ‘MAHA' Health and Human Services Secretary Robert F. Kennedy Jr. joined Gov. Patrick Morrisey last week to announce a first in the nation ban on food dyes, and talk Kennedy history.\nHealth March 29 RFK Jr dares governor of America's fattest state to do regular public weigh-ins HHS Secretary Robert F. Kennedy Jr. is looking to make all of America healthy, and he's starting with the country's most obese state — and its governor.\nMAHA March 28 'Food is medicine' takes shape as RFK Jr. praises school menu changes in West Virginia Robert F. Kennedy Jr. joined West Virginia Gov. Patrick Morrisey in a vow to help \"Make America Healthy Again.\" MAHA advocate Calley Means discussed the significance of the moment.\nPolitics March 28 Babydog bridges 'pawtisan' divide in the Senate on social media: 'She knows no political bias' Sen. Jim Justice, R-W.Va., suggested to Fox News Digital that Babydog ought to be moderating \"spending discussions around here\" given her popularity on Capitol Hill.\nPolitics March 28 RFK Jr. backs work mandates, waivers for food benefits program in red state as part of MAHA mission West Virginia GOP Gov. Patrick Morrisey and HHS Secretary Robert F. Kennedy Jr. spoke together at a school in Martinsburg as part of the MAHA push.\nOpinion March 26 DAVID MARCUS: It’s all aid, no wokeness in Trump’s West Virginia flood response Fox News Digital columnist and West Virginia resident David Marcus says President Trump's FEMA is getting the job done after severe flooding, and doing it with a low-key, effective approach.\nWest Virginia March 26 West Virginia passes first-of-its-kind law banning food dyes and preservatives; Gov cites MAHA movement West Virginia will begin prohibiting certain synthetic dyes and additives used in food items, the most comprehensive effort to combat harmful food ingredients at the state level.\nWest Virginia March 12 Riley Gaines opens up on getting a law to ban trans athletes from women's locker rooms named after her Riley Gaines opened up on the experience of seeing a law named after her signed in West Virginia amid her mission to protect women from trans athletes.\nPolitics March 12 ‘Riley Gaines Act’ signed: WV governor inspired by 14-year-old shot-putter who refused to compete against male West Virginia Republican Gov. Patrick Morrisey was joined by lawmakers as well as Riley Gaines for the signing of the Riley Gaines Act."
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.oag.state.va.us/media-center/news-releases/2509-december-9th-2022-attorney-general-miyares-hampton-roads-human-trafficking-task-force-secures-indictments",
      "text": "Commonwealth of Virginia\nOffice of the Attorney General\nJason S. Miyares\nAttorney General\n202 North 9th Street\nRichmond, Virginia 23219\n804-786-2071\nFAX 804-786-1991\nVirginia Relay Service\n800-828-1120\nFor media inquiries only, contact:\nVictoria LaCivita\n(804) 588-2021\nAttorney General Miyares' Hampton Roads Human Trafficking Task Force Secures Indictments\nFour Charged in Connection with Labor Trafficking, Forced Labor, and Immigration Offenses at Williamsburg Laundry Facility\nNEWPORT NEWS, VA – A 33-count indictment was unsealed today charging four people with joining together to defraud and commit offenses against the United States, including human trafficking of individuals from Central America, benefiting from forced labor, money laundering, and various other immigration-related offenses, such as harboring undocumented non-citizens.\nThis investigation was conducted by the Hampton Roads Human Trafficking Task Force, a collaboration between federal, state, and local law enforcement and prosecutors, as well as non-governmental organizations, working together to combat human trafficking in the Hampton Roads Region. The task force was cofounded by the OAG and Homeland Security Investigations (HSI).\nAccording to allegations in the indictment, Ana Patricia Landaverde, 47, of Williamsburg, Jeffrey Dean Vaughan, 64, of Williamsburg, and George William Evans, 68, of Midlothian, engaged in a conspiracy to harbor, transport, and benefit from the employment of undocumented noncitizens at their commercial laundry business, Northstar Holdings of Virginia LLC, d/b/a Magnolia Cleaning Services, LLC. Between the first quarter of 2018 and the first quarter of 2022, the business's wage records reflect approximately 121 employees with alleged invalid or mismatched Social Security Numbers and wage payments of more than $1.2 million to these employees.\nThe fourth unnamed defendant is alleged to have acted as an illegal supplier of fraudulent identification documents. Prospective employees without proper documentation to work in the United States were allegedly referred to this defendant to purchase a counterfeit permanent resident card and social security card.\n\"Human trafficking can occur anytime, anywhere, oftentimes in plain sight and in this case, in our own backyard,” said Attorney General Miyares. \"I'm proud of the work the Hampton Roads Human Trafficking Taskforce did in leading this investigation.”\nAs further set forth in the indictment, Landaverde, Vaughan, and Evans also allegedly engaged in human trafficking of labor from Central America and benefitting from forced labor. One victim is alleged to have been brought to the United States when she was only 13 years old and forced to work nights while also attending school during the day. Allegations also include another victim being made to work under threats of deportation, physical violence, and other misuse of law and process. This same victim was made to pay rent to live in the commercial laundry facility where she lacked access to a kitchen, shower, or bath.\n\"These indictments are a great example of what can be accomplished when federal, state, and local law enforcement agencies work in collaboration,” said Acting Special Agent in Charge Derek W. Gordon of HSI Washington, D.C. \"We will continue our partnerships with our law enforcement partners, through the Hampton Roads Human Trafficking Task Force. HSI will work tirelessly to disrupt and dismantle criminal organizations, like this one, in order to keep our communities safe from all criminal elements who would do harm to our law-abiding residents.”\nMore information can be found on the website of the U.S. Attorney's Office for the Eastern District of Virginia. Related court documents and information are located on the website of the District Court for the Eastern District of Virginia or on PACER by searching for Case No. 4:22-cr-92.\n###"
    },
    {
      "url": "https://www.foxnews.com/category/person/donald-trump",
      "text": "Key facts about President Donald Trump: What to know\nDonald Trump served as the 45th President of the United States and was re-elected in 2024 to become the 47th President. He was sworn into office on January 20, 2025. With his 2024 presidential win, Trump became the second person in U.S. history to win non-consecutive terms, following Grover Cleveland, the 22nd and 24th President.\nDuring his first campaign, Trump, a real estate developer and reality TV host, successfully defeated Hillary Clinton for the White House. Although he lost the popular vote, he won the Electoral College, securing his first presidential victory.\nThe 2020 presidential election resulted in defeat for Trump, as he lost his re-election bid to Democratic challenger Joe Biden. In 2022, Trump announced his candidacy for the 2024 Presidential election, marking the start of his third campaign.\nIn July 2024, Trump announced Ohio Senator JD Vance as his running mate. The Republicans focused heavily on issues like the economy and border security during their campaign. Trump was victorious against Vice President Kamala Harris in the 2024 presidential election, winning both the popular vote and the Electoral College to regain his position as President of the United States.\nIn April 2025, Trump unveiled a series of historic tariffs during a \"Make America Wealthy Again\" event at the White House's Rose Garden. This event was part of a day his administration called \"Liberation Day\" for the United States. Trump argues that these tariffs will help bring manufacturing jobs back to the U.S. The Trump administration plans to impose tariffs on certain goods from countries such as Mexico, Canada, China, and others.\nPresident Trump is married to First Lady Melania Trump, and together they have one son, Barron Trump. Trump was previously married to Ivana Trump in 1977, with whom he had three children: Donald Trump Jr., Ivanka Trump, and Eric Trump. Ivana passed away in 2022. Trump married Marla Maples in 1993, and they have one daughter, Tiffany Trump.\nDonald Trump Jr., the eldest child of President Trump, has five children: Kai Trump, Donald J. Trump III, Tristan Trump, Spencer Trump, and Chloe Trump. Eric Trump is married to Lara Trump, who currently hosts FOX News Channel's \"My View with Lara Trump.\" Eric and Lara have two children, Eric Luke Trump and Carolina Trump. Ivanka Trump is married to Jared Kushner, and they have three children: Arabella Kushner, Joseph Kushner, and Theodore Kushner. Tiffany Trump welcomed her first child, Alexander Boulos, in 2025 with her husband, Michael Boulos."
    },
    {
      "url": "https://www.foxnews.com/politics/virginia-democrats-choose-nominee-challenge-gop-attorney-general-jason-miyares",
      "text": "Former Virginia state Del. Jay Jones secured the Democratic nomination for Virginia attorney general.\nThe Associated Press projects that Jones has won the Democratic primary and will challenge incumbent Republican Attorney General Jason Miyares this November.\nMiyares was elected attorney general in 2021 alongside Republican Gov. Glenn Youngkin, who is term-limited this year, and Lt. Gov. Winsome Earle-Sears, the Republican gubernatorial nominee. All three Republicans flipped Democratic seats during the statewide elections in 2021, and Democrats are seeking to regain control of Virginia later this year.\nPresident Donald Trump's name did not appear at the top of the ticket during Virginia's primary on Tuesday, but his sweeping second-term agenda took center stage up and down the ballot.\nTRUMP FACTOR: ELECTIONS IN THIS KEY STATE ARE SEEN AS A PARTIAL REFERENDUM ON THE PRESIDENT\nMiyares, the first Hispanic American to be elected to a statewide office in Virginia and the first child of an immigrant to be attorney general, has been supportive of Trump's agenda in Virginia – whereas Democratic attorneys general across the United States have led the judicial challenge to Trump's executive authority.\nTRUMP NOT ON BALLOT BUT PRESIDENT INFLUENCES TUESDAY'S HIGH-STAKES PRIMARY\nJones and his competitor, Henrico Commonwealth's Attorney Shannon Taylor, both tried to capitalize on primary voters’ anger over the Trump administration’s cuts to the federal government, including massive layoffs through the Department of Government Efficiency (DOGE).\nJones, a former assistant attorney general, identified his top campaign issue as protecting Virginia from the Trump administration.\n\"Donald Trump is waging an unprecedented assault on Virginia communities, jobs, and even civil rights,\" Jones included in a statement on his campaign website.\nJones applauded how attorneys general have stepped up to defend Americans by suing the Trump administration to unlock federal funding and reject executive overreach, \"but here in Virginia, MAGA extremist Attorney General Jason Miyares has put politics first and refused to join in the effort to defend against unconstitutional and un-American Trump policies.\"\nPublic safety, lowering costs through corporate accountability, protecting civil and constitutional rights and preserving the right to abortion were among Jones' additional campaign promises.\nTaylor's campaign focused on public safety, protecting abortion rights, lowering costs, preventing gun violence and building Virginia's economy to support the middle class.\nTaylor's first campaign ad featured images of Trump buying a Tesla at the White House and Elon Musk holding up a chainsaw at this year's Conservative Political Action Conference (CPAC).\n\"I'm running for Attorney General to beat back Trump and Musk,\" Taylor said.\nVirginia's elections will be used by political pundits and politicians as a bellwether for competitive midterm elections expected in 2026. They are an early opportunity to gauge how Americans are responding to Trump's second term, and see how they might vote next year when a congressional majority is on the line.\nVirginia is one of two gubernatorial elections in the United States this year, along with New Jersey, which held their primary election last week.\nCommonwealth Republicans broke a 12-year losing streak to the Democrats when they swept the elections for governor, lieutenant governor and attorney general in Virginia four years ago.\nBut Republicans haven't won the commonwealth in a White House contest since 2004.\nCLICK HERE TO GET THE FOX NEWS APP\nTrump lost the state by six points in last November's presidential election, which was a four-point improvement from his 2020 defeat.\nStill, Republicans are expected to face an upward battle in November. With only one exception since 1977, the party that holds the White House has lost Virginia's gubernatorial election.\nFox News Digital's Paul Steinhauser contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/us/floridas-operation-dragon-eye-rescues-dozens-critically-missing-children-massive-sting",
      "text": "Dozens of children were rescued in a blow to child sex trafficking operations in Florida, officials announced Monday.\nDubbed Operation Dragon Eye, the initiative was spearheaded by the U.S. Marshals Office for the Central District of Florida and supported by the state Attorney General James Uthmeier’s Office of Statewide Prosecution (OSP).\nThe effort involved 20 agencies working in tandem to locate 60 critically missing children and apprehend suspects tied to trafficking, drugs and child endangerment.\n\"The real heroes behind this operation are the law enforcement who built and executed this mission,\" Uthmeier said in a release. \"As your Attorney General and a father of three young kids, protecting children is my top priority. If you victimize children, you're going to prison, end of story.\"\nAuthorities said the recovered children ranged in age from 9 to 17, and many of them were missing and at risk of being exploited. The U.S. Marshals Service defines \"critically missing\" children as \"those at risk of crimes of violence or those with other elevated risk factors such as substance abuse, sexual exploitation, crime exposure or domestic violence.\"\nThe operation uncovered the gut-wrenching realities of sex trafficking — including several young girls who were pregnant, one of them carrying the child of her trafficker.\nOfficials stressed that the operation didn’t end with their rescue, but each child received immediate medical evaluations and psychological support, with long-term care protocols set in motion.\n\"The unique part of this operation was the fact that underaged critically missing children were not only recovered but were debriefed and provided with physical and psychological care,\" said U.S. Marshal William Berger. \"This operation further included follow-up assistance in hopes that these youths will not return back to the streets to be further victimized.\"\nThe Florida Department of Law Enforcement (FDLE) also played a central role in the operation. Commissioner Mark Glass assured the parents of missing children that the department will \"never stop searching.\"\n\"Sixty kids saved. That number sends the message that Florida will never be a safe place for traffickers,\" Glass said. \"At FDLE, we will continue to fight for those who cannot fight for themselves. And to any family still missing their child, we will never stop searching until we make sure they are brought home safely.\"\n205 ARRESTED IN FBI CHILD SEX OPERATION, PATEL AND BONDI ANNOUNCE\nEight individuals were arrested during the operation, the agency said. They face a variety of charges, including human trafficking, child endangerment, drug possession and drug trafficking. Authorities say the investigation is ongoing, and additional charges may follow.\nThe Office of Statewide Prosecution is handling the criminal cases, with support from state attorneys in the Sixth and Thirteenth Judicial Circuits. Special Counsel Rita Peters has been appointed to lead the prosecution in the human trafficking case, while two additional trafficking cases remain under investigation.\nSex trafficking continues to pose a persistent threat in Florida, with the state among the top three in the nation for reported human trafficking cases, alongside California and Texas, according to the National Human Trafficking Hotline.\nIn 2024 alone, according to the agency, Florida received over 1,830 signals, which led to the identification of 1,874 victims. The Florida Department of Children and Families (DCF) found that many victims are minors between the ages of 11 and 17, often lured through manipulation or online platforms.\nIn response, Florida leaders have stepped up both funding and legislative efforts. Gov. Ron DeSantis recently allocated $4.9 million to expand emergency shelter beds and staff support for trafficking victims, while an additional $900,000 in grant funding was provided to the FDLE.\nWATCH:\nCLICK HERE TO GET THE FOX NEWS APP\n\"Florida is being proactive about stopping human trafficking,\" DeSantis previously said. \"Though our open southern border invites criminal activity like human trafficking, states can combat it with stronger penalties and increased training for emergency personnel to recognize and respond to trafficking, and today I was pleased to institute those measures in Florida.\"\nState lawmakers have also passed legislation to increase penalties for traffickers and mandate trafficking-awareness training for hotel workers, healthcare providers and school staff.\nFox News Digital has reached out to Uthmeier's office for comment."
    }
  ],
  "argos_summary": "Governor Glenn Youngkin of Virginia outlined his plans to combat human trafficking, emphasizing the need for multi-state and federal collaboration to dismantle trafficking networks, similar to efforts against transnational gangs. He praised the Trump administration for enhancing state law enforcement's capabilities in this area, while Virginia Attorney General Jason Miyares criticized the Biden administration for not responding to requests for support. The discussion highlighted the complexities of human trafficking, including its impact on vulnerable populations, and the importance of inter-agency communication to effectively address the issue.",
  "argos_id": "5SMDO1022"
}