{
  "url": "https://gizmodo.com/spirit-airlines-admits-it-might-not-survive-another-year-2000642336",
  "authorsByline": "Luc Olinga",
  "articleId": "fa6dedc9832c4171aedb70a0edae22e5",
  "source": {
    "domain": "gizmodo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://gizmodo.com/app/uploads/2023/08/3d8c4ba3e97782418ab88ee3b9fb3a63.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:08:52+00:00",
  "addDate": "2025-08-13T02:12:26.938684+00:00",
  "refreshDate": "2025-08-13T02:12:26.938685+00:00",
  "score": 1.0,
  "title": "Spirit Airlines Admits It Might Not Survive Another Year",
  "description": "Fresh out of bankruptcy, the budget airline says it’s running out of cash and time.",
  "content": "Spirit Airlines has just admitted what many suspected: its future is in serious doubt.\n\nThe news, delivered in a filing with the Securities and Exchange Commission on August 11, sent the company’s stock into a freefall, plummeting 41% in a single trading session on Tuesday. Spirit’s total market value now sits at a paltry $54.3 million.\n\nIn the filing, the ultra-low-cost carrier said there is “substantial doubt” about its ability to continue operating for more than 12 months from the date of its financial statements. Translation: Spirit could disappear by August 2026. The company used the expression “going concern,” which is an official accounting term that a company is forced to use when it is in severe financial distress and may not have enough money to stay in business. It is one of the gravest signals a public company can send to its investors.\n\nThe airline — famous for its bright yellow planes and no-frills service — only emerged from Chapter 11 bankruptcy in March after a failed merger with JetBlue. The regulators blocked the merger between the two airlines, arguing that the deal would eliminate a key competitor and drive up fares for consumers. Without the merger, a weakened Spirit was forced to file for Chapter 11 bankruptcy, which it only emerged from in March.\n\nBut just months later, Spirit says it’s still in a deep financial crisis.\n\nSpirit blames a brutal mix of factors: too much domestic airline capacity, weak demand for leisure travel, and a tough pricing environment that has dragged down revenue. The company reported a $246 million net loss in the second quarter of 2025. In its SEC filing, Spirit said the downturn is expected to last at least through the rest of the year, even after cost-cutting moves like selling spare engines in sale-leaseback deals, reducing discretionary spending, and furloughing pilots in July.\n\nBut it hasn’t been enough. The company admitted that its financial results are not improving fast enough to meet the minimum cash requirements of its debt agreements and, crucially, its credit card processing agreement, which expires at the end of the year.\n\nThe airline is now in a last-ditch race for liquidity. It is considering selling off planes, real estate, and excess airport gate capacity. It is also in urgent discussions with its credit card processor, which has requested additional collateral to renew their contract, a deal Spirit cannot afford to lose.\n\nTime is running short. Without a dramatic turnaround or a new source of cash, one of America’s best-known budget airlines could soon be grounded for good.",
  "medium": "Article",
  "links": [
    "https://d18rn0p25nwr6d.cloudfront.net/CIK-0001498710/81fdccc5-e086-40d0-a49e-782d946ead78.pdf"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Spirit Airlines",
      "weight": 0.08339955
    },
    {
      "name": "Spirit",
      "weight": 0.07939846
    },
    {
      "name": "severe financial distress",
      "weight": 0.06751081
    },
    {
      "name": "excess airport gate capacity",
      "weight": 0.058598664
    },
    {
      "name": "Spirit’s total market value",
      "weight": 0.05081677
    },
    {
      "name": "discretionary spending",
      "weight": 0.050264854
    },
    {
      "name": "leisure travel",
      "weight": 0.05014735
    },
    {
      "name": "cash",
      "weight": 0.04959209
    },
    {
      "name": "too much domestic airline capacity",
      "weight": 0.04910669
    },
    {
      "name": "weak demand",
      "weight": 0.048989214
    }
  ],
  "topics": [
    {
      "name": "Airlines"
    },
    {
      "name": "Aviation"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9951171875
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.8974609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.89208984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.74658203125
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.640625
    }
  ],
  "sentiment": {
    "positive": 0.03020591,
    "negative": 0.85642266,
    "neutral": 0.11337142
  },
  "summary": "Spirit Airlines has admitted that its financial future is in serious doubt, with a filing with the Securities and Exchange Commission stating there is \"substantial doubt\" about its ability to continue operating for more than 12 months, potentially ending by August 2026. The news led to a 41% drop in Spirit's stock value and the company's total market value now stands at $54.3 million. The airline, known for its bright yellow planes and no-frills service, only emerged from Chapter 11 bankruptcy in March after a failed merger with JetBlue was blocked by regulators. Spirit blames a combination of factors including too much domestic airline capacity, weak demand for leisure travel, and a tough pricing environment. The company is now in a last-ditch race for liquidity, considering selling off planes, real estate, and excess airport gate capacity.",
  "shortSummary": "Spirit Airlines faces severe financial troubles, with significant losses and a severe downturn, prompting a significant stock drop and prompting a plea for liquidity and a potential turnaround.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "20e1f4917d754521b0c09a190506e102",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Spirit Airlines has acknowledged significant financial distress, stating there is 'substantial doubt' about its ability to continue operations beyond 12 months. Following a 41% drop in stock value, the airline, which recently emerged from Chapter 11 bankruptcy, reported a $246 million net loss in Q2 2025 and is struggling with high domestic capacity and weak leisure travel demand. The company is urgently seeking liquidity through asset sales and negotiations with its credit card processor, as it faces the risk of being unable to meet its financial obligations.",
  "argos_id": "5XU8DIXQ2"
}