{
  "url": "https://www.express.co.uk/showbiz/tv-radio/2094098/cnn-interrupted-breaking-trump-epstein",
  "authorsByline": "Jess Phillips",
  "articleId": "1e2c60d89a7a4e5d8d592a301e399c71",
  "source": {
    "domain": "express.co.uk",
    "location": {
      "country": "us",
      "state": "OH",
      "county": "Stark County",
      "city": "Hartville",
      "coordinates": {
        "lat": 40.9636685,
        "lon": -81.3312195
      }
    }
  },
  "imageUrl": "https://cdn.images.express.co.uk/img/dynamic/20/1200x630/6354520.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T07:24:00+01:00",
  "addDate": "2025-08-12T06:31:34.731493+00:00",
  "refreshDate": "2025-08-12T06:31:34.731496+00:00",
  "score": 1.0,
  "title": "CNN interrupted for breaking Trump and Epstein bombshell",
  "description": "CNN's senior data analyst Harry Enten exposed Donald Trump's approval ratings on the programme after the Epstein scandal",
  "content": "CNN was brought to a screeching halt for breaking news concerning US president Donald Trump and convicted sex offender Jeffrey Epstein, as bombshell statistics were exposed. The network’s senior data analyst Harry Enten was on the scene to confirm Trump’s approval ratings, showing new statistics on-screen. The stats showed that in August 2017, Trump had just 37% approval, which soared to 45% in July 2025 and dropped just slightly to 44% in August 2025. In addition, Google searches for Epstein have fallen 89% in comparison to three weeks prior – hinting that the American public have seemingly “moved on” from worrying about the Epstein files.\n\nEnten said on the show: “I would just say this, Donald Trump has some of the best political instincts of any politician I’ve seen and on this particular issue, you see it full well and clear because he has been saying, ‘You know what, the [Epstein files] are not an issue’ and it turns out a lot of the American public actually seem to agree with him.” He added: “Trump’s approval is still well within that margin of error here of 44% and you compare that to where he was in his first term at this point, he was 37%.\n\n“So he’s seven points higher, very much in a different political universe now. It’s significantly higher in terms of his overall approval rating than he was at this point in his first term… “So no, he hasn’t lost any of that base and when it comes to that centre of the electorate, he’s basically holding on there and his overall approval rating, 44%, is pretty darn gosh good for him considering where he was at this point in term number one.” Trump claimed on July 29 that he removed Epstein from his Mar-a-Lago resort after learning that he was hiring his female spa workers – including a 17-year-old Virginia Giuffre.",
  "medium": "Article",
  "links": [
    "https://www.express.co.uk/showbiz/tv-radio/2093533/greatest-ever-pirate-series-prime-video",
    "https://www.express.co.uk/",
    "https://www.express.co.uk/showbiz/tv-radio/2063614/cnn-paused-breaking-news-trump",
    "https://www.express.co.uk/latest/jeffrey-epstein",
    "https://www.express.co.uk/showbiz/tv-radio/2093518/breaking-ray-brooks-dead-coronation-street",
    "https://www.express.co.uk/showbiz/tv-radio/2042901/cnn-airs-shock-98-trump-poll-results",
    "https://www.express.co.uk/privacy-notice",
    "https://www.express.co.uk/latest/donald-trump",
    "https://www.express.co.uk/latest/cnn"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Donald Trump",
      "weight": 0.1081041
    },
    {
      "name": "US president Donald Trump",
      "weight": 0.10475793
    },
    {
      "name": "Jeffrey Epstein",
      "weight": 0.09919665
    },
    {
      "name": "Trump",
      "weight": 0.09820438
    },
    {
      "name": "Epstein",
      "weight": 0.09539086
    },
    {
      "name": "Trump’s approval ratings",
      "weight": 0.07516818
    },
    {
      "name": "Trump and Epstein bombshell",
      "weight": 0.07451162
    },
    {
      "name": "breaking news",
      "weight": 0.07108425
    },
    {
      "name": "Harry Enten",
      "weight": 0.068311684
    },
    {
      "name": "bombshell statistics",
      "weight": 0.06734541
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97314453125
    },
    {
      "name": "/News/Other",
      "score": 0.9267578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.84423828125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.79248046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Scandals & Investigations",
      "score": 0.53662109375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.50732421875
    }
  ],
  "sentiment": {
    "positive": 0.046285827,
    "negative": 0.7967484,
    "neutral": 0.15696569
  },
  "summary": "CNN interrupted by breaking news about US President Donald Trump and convicted sex offender Jeffrey Epstein, with senior data analyst Harry Enten revealing that statistics reveal that in August 2017, Trump's approval rating was 37%, which rose to 45% in July 2025, and only slightly slightly to 44% in August 2025. In addition, Google searches for Epstein have decreased by 89% compared to three weeks ago, suggesting that the American public has already moved on to the Epstein files. Enten noted that Trump's overall approval rating remained within the margin of error, indicating that he has some of the best political instincts of any politician I've seen.",
  "shortSummary": "CNN was interrupted for breaking news about President Donald Trump and convicted sex offender Jeffrey Epstein, with shocking statistics showing a significant rise in his approval ratings compared to his first term.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "6c233f8629a14771a4c3822fe4642937",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.express.co.uk/",
      "text": "The Chancellor has sunk the UK economy, but the stock market stands firm. That could change.\nEXCLUSIVE: More than 50,000 people have entered the country via small boat crossings...\nAs Donald Trump prepares for a pivotal meeting with Vladimir Putin, his unexpected...\nThe latest person taking part in this year's Strictly Come Dancing was revealed on...\nMinister asked about reports more than 50,000 migrants have crossed the Channel in...\nThe closure has been expected as queues build on the M25.\nAn Emmy Award winner who worked on Prison Break, 24 and Homeland has sadly died\nExpress Sport provides all the latest transfer news LIVE.\nThese beaches are stunning and untouched, as tourists largely don't know about them.\nEuropean leaders, including Sir Keir Starmer, will speak to Donald Trump ahead of his...\nThe Russian Embassy in London has hit out at the UK ahead of Putin-Trump peace talks.\nGood Morning Britain newsreader Marverine Cole delivered an update that marks some bad...\nDaily Express\nBuckingham Palace is synonymous with the Royal Family, but there are a number of...\nWidespread misconceptions have led many people to believe certain foods and chemicals...\nA British expat living in Benidorm has warned UK tourists of one \"dangerous\" area.\nAmazon is dishing out the Galaxy Tab S10 FE+ at a handsomely discounted rate.\nWARNING: DISTRESSING CONTENT A chilling broadcast left an Arizona family grappling with unimaginable trauma, as a live news segment broadcast their own father's death.\nThe BBC historical films are a series of adaptations of some of Shakespeare's most...\nThe Metropolitan Police worked with the Motor Insurers' Bureau (MIB) to impound...\nNewcastle striker Alexander Isak has reportedly made his views on his Magpies career...\nA new petition is calling for state pension to match the National Living Wage and...\nCNN's senior data analyst Harry Enten exposed Donald Trump's approval ratings on the...\nA plane has burst into flames after crashing at Kalispell Airport in Montana, US.\nBeijing Daxing International Airport opened in 2019 with hopes that it would one day...\nAs Tropical Storm Erin brews near Cabo Verde, forecasters are on edge. Will it transform into a hurricane and make its way to the UK?\nDonald Trump has officially taken control of the Washington, D.C. police and vowed to...\nWhether you're trying for a baby, going through perimenopause or struggling with...\nEXCLUSIVE: A royal expert has revealed how the Royal Family will be feeling after...\nPeter Phillips' royal wedding is on the cards as he recently announced his engagement...\nEmma Raducanu suffered another close defeat to Aryna Sabalenka in a thrilling match at...\nWho owns which side of the fence is often a sore subject for neighbours and the number...\nI recently had air conditioning fitted in my home by BOXT - it's completely changed my...\nThe 2025 Strictly cast announcements have officially begun\nThe taxman is set to target a host of new people this year who might have no clue they...\nA major star is set to call it quits after a year of shocking storylines leaving fans...\nVirgin Media is offering free TVs to those signing up for certain bundles but this...\nPrince Josef-Emanuel of Liechtenstein and his wife are now proud parents to two children.\nUncover the narratives that have defined generations, or see the tumultuous yet...\nPlay is suspended at the Cincinnati Open.\nA GB News panel erupted into chaos after fiery clashes over Reform UK's migrant crime...\nThe Queen legend's former girlfriend has spoken out on the bombshell claims he fathered a lovechild\nA US company is making progress on its first UK-based £200 million attraction housing...\nGardeners are being urged to help hedgehogs this week.\nThis \"brilliant\" murder mystery, which left viewers on the edge of their seats, will...\nRediscover the haunting allure of a British crime series that masterfully intertwines...\nBaby London Kerr was reportedly beaten with a wooden paddle and even shot at with a BB...\nClosing down sales are taking place at several stores across the UK.\nCristiano Ronaldo's partner Georgina Rodriguez has announced their engagement.\nDespite their efforts to keep a low profile, some locals in Montecito are frustrated by the influx of tourists and increased traffic.\nI recently discovered a way to keep my grapes firm and crunchy for two weeks, and it...\nEXCLUSIVE: This comes just days after Mark Labbett apologised for his behaviour on set\nBrits have been advised to spray peppermint oil on their windows this week as the...\nLiam and Noel Gallagher have been issued a blunt warning ahead of their US tour\nAnother person accused the London Mayor of being \"dishonest\" after he shared...\nEXCLUSIVE: Jeremy Clarkson has been offered help by a huge celebrity after sharing...\nPanda London's bamboo mattress topper, which is soft, breathable, and eco-friendly, is...\nDaily Express uses notifications to keep you updated"
    }
  ],
  "argos_summary": "CNN's senior data analyst Harry Enten reported on Donald Trump's fluctuating approval ratings, which rose from 37% in August 2017 to 44% in August 2025. Enten noted that public interest in Jeffrey Epstein has significantly declined, with Google searches dropping by 89%, suggesting that the American public is moving on from the Epstein files. Trump maintains strong political instincts, as indicated by his ability to hold onto his approval ratings despite controversies.",
  "argos_id": "6JY7ZRDKC"
}