{
  "url": "https://finance.yahoo.com/news/shoe-prices-started-climb-july-213126717.html",
  "authorsByline": "Vicki M. Young",
  "articleId": "7ba37878906245408ea6a4df6ed70cd4",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/footwear_news_finance_8/0096a07b5cb6d0f381d8e72a562035cf",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:31:26+00:00",
  "addDate": "2025-08-12T22:06:29.402483+00:00",
  "refreshDate": "2025-08-12T22:06:29.402484+00:00",
  "score": 1.0,
  "title": "Shoe Prices Started to Climb in July After Months of Declines",
  "description": "FDRA chief economist Gary Raines said shoe price increases in July is in lock-step with the 2.7 percent year-over-year rise in consumer prices.",
  "content": "Shoe prices in July started to rise after months of declines.\n\nThe increases appear in lock-step with rising inflation and sharply higher duties paid on footwear imports. According to the latest BLS data, consumer prices rose 2.7 percent year-over-year in July, representing the fastest increase in five months.\n• On Is Paying 40 Percent on Vietnam Imports to the US: Here's Why the Brand's CEO Isn't Worried\n• Where's the New Opportunity in Footwear Production? Jack Erwin President Sounds Off\n\nAccording to data from the Footwear Distributors and Retailers of America (FDRA), retail footwear prices rebounded 0.9 percent year-over-year, reversing five straight months of declines. Prices rose across the board, led by higher prices for men’s, which was up 1.2 percent — the most in nine months. Women’s and children’s footwear prices each also reversed five straight months of declines, with the former up a comparable 0.9 percent and the latter increasing 0.2 percent.\n\n“Despite these latest broad-based gains, retail footwear prices so far this year are modestly lower versus the same first seven months of last year,” said FDRA’s chief economist Gary Raines. “Even so, we continue to look for persistent inflation and rampant footwear duties to pressure retail prices higher in the remaining months of the year.”\n\nFootwear firms such as Crocs Inc., Rocky Brands and Steve Madden Ltd. have said on earnings calls that they’ve implemented select price increases on certain styles. And Nike said it raised some sneaker prices on June 1, but left intact current price points for the Jordan brand and for its Nike kids apparel and footwear.\n\nBut with persistent inflation headaches, shoe prices have been a concern for parents as they prepare their kids for back-to-school. A study from an AlixPartners and FDRA collaboration indicate that parents will either trade down or buy fewer pairs.\n\nAlso not helping has been the barrage of tariff headlines, with U.S. President Donald Trump doling out piecemeal disclosures on the framework for new trade agreements that lack specific details as the finer points still need to be negotiated. Thus far, the U.S. has a preliminary trade agreement calling for a 20 percent tariff on imports to the U.S. from Vietnam, the go-to country for the manufacture of performance athletic shoes. Indonesia, which also has captured a sizable market for footwear production, faces a 19 percent tariff.\n\nAnd for now, duties on China imports to the U.S. remain at 30 percent due to a 90-day extension that’s set to expire around Nov. 12.",
  "medium": "Article",
  "links": [
    "https://finance.yahoo.com/news/where-opportunity-footwear-production-jack-182001813.html",
    "https://wwd.com/footwear-news/shoe-industry-news/crocs-ceo-andrew-rees-vietnam-tariffs-china-prices-1237703747/",
    "https://finance.yahoo.com/news/rocky-brands-confirms-price-hikes-171522908.html",
    "https://finance.yahoo.com/news/shoe-prices-dip-june-tariff-194905770.html",
    "https://finance.yahoo.com/news/us-vietnam-trade-deal-20-205351547.html",
    "https://finance.yahoo.com/news/paying-40-percent-vietnam-imports-182701564.html",
    "https://finance.yahoo.com/news/fdra-elects-board-leadership-140915328.html",
    "https://wwd.com/footwear-news/shoe-industry-news/steve-madden-edward-rosenfeld-tariffs-china-prices-geiger-1237703776/",
    "https://finance.yahoo.com/news/sneaker-shock-yes-nike-raising-162947006.html",
    "https://finance.yahoo.com/news/tariffs-weighing-heavily-industry-shoe-210539202.html",
    "https://finance.yahoo.com/news/tariffs-parents-back-school-shoe-120000514.html",
    "https://finance.yahoo.com/news/shoe-firms-consumers-big-break-203557796.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "retail footwear prices",
      "weight": 0.12513642
    },
    {
      "name": "retail prices",
      "weight": 0.11093313
    },
    {
      "name": "Shoe Prices",
      "weight": 0.11053538
    },
    {
      "name": "Shoe prices",
      "weight": 0.11053538
    },
    {
      "name": "shoe prices",
      "weight": 0.11053538
    },
    {
      "name": "higher prices",
      "weight": 0.10806985
    },
    {
      "name": "Prices",
      "weight": 0.105129614
    },
    {
      "name": "current price points",
      "weight": 0.10506167
    },
    {
      "name": "select price increases",
      "weight": 0.104755014
    },
    {
      "name": "consumer prices",
      "weight": 0.10438021
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.75537109375
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.6826171875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.3740234375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.348876953125
    }
  ],
  "sentiment": {
    "positive": 0.4594117,
    "negative": 0.41372868,
    "neutral": 0.12685968
  },
  "summary": "Shoe prices began to rise in July after months of declines due to rising inflation and increased duties on footwear imports. Consumer prices rose by 2.7 percent year-over-year, the fastest increase in five months according to the latest BLS data. The Footwear Distributors and Retailers of America (FDRA) reported that retail footwear prices rebounded 0.9 percent year over the previous year, reversing five consecutive declines. Men's and women's footwear prices each increased by 1.2 percent, the most in nine months. Additionally, footwear companies such as Crocs Inc., Rocky Brands and Steve Madden Ltd. have implemented select price increases on certain styles.",
  "shortSummary": "Shoe prices rose 2.7% in July due to rising inflation, higher import duties, and concerns over consumer spending and trade agreements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "47281ebd032745bf90b38d792e105a8d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://finance.yahoo.com/news/shoe-prices-dip-june-tariff-194905770.html",
      "text": "Shoe Prices Dip in June but Tariff Pressures Could Lead to Increases Later This Year, FDRA and AAFA Say\nShoe prices were lower again in June as overall inflation climbed last month, according to the latest data from the Footwear Distributors and Retailers of America (FDRA).\nIn June, retail footwear prices dipped 0.6 percent, the smallest decline in the last four months, the FDRA noted. This comes as prices were mixed across each target market last month. Men’s footwear prices grew 0.2 percent, the first increase also in four months. But, women’s and children’s shoe prices both declined 1.1 percent from the same time last year.\nMore from WWD\n-\nSafilo's Net Profit, Sales Rise in the H1, Helped by Asia-Pacific and Tariff Offsetting Measures\n-\nTariff Headwinds Are Getting Real for Shoe Firms - And It's Just the Beginning\nGary Raines, chief economist at FDRA, told FN that last month’s declines “peg year-to-date footwear prices modestly lower from the same first half of last year.”\n“But we note up the supply chain average duties per pair on footwear imports are surging,” Raines said. “These sharply higher duties soon may push the average landed cost of footwear imports sharply higher, which in turn may pressure retail footwear prices to climb later this year.”\nSteve Lamar, president and chief executive officer of the American Apparel and Footwear Association (AAFA), added that “inflation continues to be on everybody’s minds, particularly with the high tariffs that have been imposed on all our supplier countries.”\n“Today’s data suggest that these costs are beginning to work their way through supply chains as cost and price increases on other parts of the economy, just as we expect they will thread their way through our supply chains too,” Lamar said. “Our hope is that new deals, with permanent and manageable tariff levels and rules, can quickly be negotiated and announced so we can get ahead of these expected cost pressures.”\nLast month’s drop in retail footwear prices also comes at the same time the Bureau of Labor Statistics reported that overall inflation ticked higher in June.\nThe bureau’s latest Consumer Price Index (CPI), a broad measure of goods and services costs across the U.S. economy, saw prices increase 0.3 percent on a seasonally adjusted basis in June, after rising 0.1 percent in May. Prices were also up 2.7 percent over the last 12 months, after rising 2.4 percent the prior month.\nExcluding volatile food and energy costs, the core CPI rose 0.2 percent in June and increased 2.9 percent over the same time last year.\nBest of WWD\nSign up for FN's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram."
    },
    {
      "url": "https://finance.yahoo.com/news/tariffs-weighing-heavily-industry-shoe-210539202.html",
      "text": "Expectations concerning higher costs form the tariff impact on many consumer discretionary items including apparel and shoes haven’t yet gained substantial traction on the sales floor.\nThat not surprising, according to an Goldman Sachs report from July 8 headed by Jan Hatzius, chief economist and head of global investment research. He said the largest tariff hikes went into effect in early April and goods already shipped were exempt. Moreover, the “front-loading of imports and uncertainty over whether tariffs would stick may have also helped to delay increases in consumer prices,” the report said.\nA separate Goldman report from July 11 led by economist Joseph Briggs said that tariff passthroughs to consumer prices so far seem more limited than in the 2018-2019 trade war when Trump was first in office. He noted that it might be too early to assess the full, adding that tariff payments can be delayed for up to 1.5 months and that any front-loading of imports likely delayed price increases.\nFor now, consumers are still spending at retail.\nThe U.S. Census Bureau on Thursday said retail sales for June rose 0.6 percent to $720.1 billion from May’s revised $715.5 billion, which reflects a 0.9 percent dip. Total retail sales for April 2025 through June 2025 were up 4.1 percent versus the same year-ago period.\nU.S. President Donald Trump’s broad global reciprocal tariff plan was disclosed on April 2. Data points from the report showed that apparel and accessories stores rose 0.9 percent in June to $26.34 billion, on an adjusted basis, which reflects season variation and holidays but not price changes. Sales at shoe stores were not available for June, but data indicates that sales rose 1.5 percent to $3.21 billion in May from $3.16 billion in April, on an adjusted basis.\n“June consumer spending was solid, with retail sales ex auto and gas up 4.1 percent relative to last year, similar to the recent trend,” noted David Silverman, senior director at Fitch Ratings. “Fitch continues to expect a sales moderation as the year progresses given the impact of somewhat moderating consumer health and reaction to the evolving tariff policy, despite the continued strength in recent months.”\nAs for back-to-school product and promotions, Silverman noted: “As expected, many of the largest retailers are targeting limited price inflation, as they manage their supply chain to offset the impact of tariffs and potentially absorb some of the increase to maintain pricing positions. Smaller retailers will be less able to mitigate and absorb tariffs, which could cause a widening price discrepancy over time.”\nWhich Shoes Are More Expensive?\nA report from Telsey Advisory Group (TAG) tracked the prices of a cross section of apparel, shoes and home products since April, when reciprocal tariffs were first announced by Trump. In the July 8 report, a Sam Edelman Felicia ballet flat priced at $100 remained at the same price without change since April. That was also true of a Steve Madden Klayton Bootie, priced at $119.95, as well as a Vans Old Skool Shoe at $70. An Ugg Tazz II shoe saw a $5 increase, or 3.6 percent increase, to $145 from week ago prices, while a Hoka Bondi 9 sneaker also rose $5, or 2.9 percent, to $175.\nIn other sneaker news, there was no price change for Adidas Samba OG, which has been $100 since April. There were week-over-week price changes for two On shoes. The Cloud 6 rose $10, or 6.7 percent, to $160, and the Cloudtilt was up $10, or 6.3 percent, to $170. The Nike Vomero 18 didn’t see a week-over-week increase, but did have a price increase of $5, or 3.3 percent, to $155 at some point since April. That increase likely occurred on June 1, when Nike began raising prices on select items. Also holding steady since April was an Asics Gel-1130, priced at $100 at Foot Locker, as well as a New Balance 1960 sneaker at $150, also sold at Foot Locker.\nThose shoe increases appear minimal, when compared to some apparel spikes.\nAmong the week-over-week price increases, a Victoria’s Secret Pink fleece campus sweatpant rose $24.95, or 71.3 percent, to $59.95, while a Victoria’s Secret Bombshell push-up bra was up $19.95, or 66.5 percent, to $49.95 and a Tommy Hilfiger men’s regular fit stretch polo shirt saw a $5.26 increase, or 19.5 percent, to $32.25. The TAG check also noted that the Tommy Hilfiger polo shirt saw an earlier price increase sometime between April and July 8 of $2.26, or 7.5 percent.\nIn addition, the $2,130.00 Louis Vuitton Neverfull MM bag didn’t see a week-over-week price change in the July 8 report, but the price was raised by $100, or 4.9 percent, at some point between April and July 8. That was also true for a girls’ Cat & Jack legging from Target, which didn’t see a week-over-week change, but did see a price uptick of $1.50, or 33.3 percent, to $6 over the same four-month period.\nAnd while some apparel items saw a price change — such as an Adidas Firebird Loose track pant, down $15 week-over-week, or 20 percent, to $60, and a Calvin Klein men’s cotton stretch 3-pack briefs, down $9.50, or 20 percent, to $38 at some point since TAG began keeping an eye on pricing in April — that wasn’t true of any of the footwear products on the research firm’s tracking list.\nThe Road Ahead\nPrice points thus far are likely to shift upwards going forward. And once that occurs on a broad range of everyday goods, that’s when consumer fatigue is expected to set in, according to consumer experts from financial advisory firm EY.\n“While the June retail sales data is encouraging and points to modest upside risk to our consumer spending growth estimate of 1.5 percent annualized in Q2, consumers have yet to experience the full impact of price increases,” said EY-Parthenon senior economist Lydia Boussour. She expects that continued tariff and policy volatility, coupled with a slowing labor market and rising inflation, will result in the easing of consumers’ personal consumption expenditures from “2.8 percent in 2024 to 1.9 percent in 2025, and 1.4 percent in 2026.”\n“June’s numbers show how consumers are prioritizing online retailers and apparel, but the remainder of the summer and back-to-school season could prove more fragile than expected,” EY Americas retail sector leader Mark Chambers said. “Retailers are weathering the storm when it comes to inventory management and supply chain flexibility with tariffs, but the latest numbers indicate they are so far managing price expectations and still delivering what consumers are looking for.”\nCrocs CEO Andrew Rees in May told investors at the firm’s first quarter earnings conference call that the company expects the shoe “industry to go up in terms of price” due to added costs, whether from tariffs or other factors. He also noted that the company has been “super strategic” on pricing, with some “very targeted price increases” to mitigate selective issues. But Rees also said that Crocs was in a “wait-and-see mode,” waiting to see what happens with tariff rates, among other factors, to determine how to manage future pricing.\nAnd Steven Madden Ltd. CEO Edward Rosenfeld said in his first quarter earnings conference call that the shoe firm has been “moving swiftly to adapt to the changing landscape,” including a focus on mitigating near-term impacts of tariff. Tools at its disposal included a shift in where some shoes are produced, as well as “selectively” raising prices to both consumers and wholesale customers for fall items."
    },
    {
      "url": "https://finance.yahoo.com/news/rocky-brands-confirms-price-hikes-171522908.html",
      "text": "Rocky Brands Inc. is moving quickly to mitigate the impact from tariffs.\n“While the situation is very fluid and the outcome of ongoing negotiations is uncertain, we moved quickly to mitigate the impact of the higher tariffs and believe we have a sound plan in place to protect our gross profit dollars under multiple scenarios,” Jason S. Brooks, chairman, president and CEO, told investors in a first quarter earnings conference call Tuesday. “Based on current tariff rates, we expect to implement price increases on the majority of our footwear styles in early June and will maintain flexibility to adjust prices accordingly based on any future changes as they are announced.”\nHe said the company is also “accelerating” its efforts to reduce the amount of products sourced from China. “This includes more footwear from partners in Vietnam, Cambodia, India, and as well, shifting production to our manufacturing facilities in the Dominican Republic and Puerto Rico,” Brooks said.\nAs for the higher prices and impact on consumer spending, Brooks said: “While we anticipate that higher prices will put some pressure on the consumer demand, we believe the strength of our brands and the functionality of our products, along with our diversified sourcing structure, has us well positioned to navigate [the] current situation and allow us to achieve our financial targets for the year.”\nBrooks said the company “hasn’t seen anything crazy from our retail partners” regarding possible price increases, and he said that while odd, “the consumer doesn’t seem to be freaking out about this right now.”\nThomas D. Robertson, chief operating and chief financial officer, said on the call that the company has about six or seven month, on average, of products to sell through in 2025.\n“We will be able to get through the majority of this year without feeling a lot of the pain from the tariffs yet. And it’s also going to give us ample time to transition product out of China and into Vietnam, India, Cambodia, and then also to transition to our own manufacturing facilities in Dominican Republic and Puerto Rico,” he said.\nRobertson said the total volume out of China is expected to be “just less than 20 percent by the end of this year,” clarifying that some of the product lines from China will be leveraged for shipment to Rocky’s international operations.\nHe also said that the company isn’t prepared to share information about the price increases, although there’s been “a lot of analysis on it,” since it is still waiting to see what other actions might occur this week in regarding to China tariffs. “So, we certainly welcome a reduction in the Chinese tariffs, but we’ll be announcing a price increase here — regardless of any changes with the Chinese tariffs over the next week or two — to go into effect in June,” Robertson said.\nHe added that the price increases are aimed at preserving gross profit dollars, and the plan is to cost average inventory on hand with inventory that will be coming in at a higher tariff, and take into account sourcing and manufacturing changes. That should result in a price increase “that’s going to not slowdown retail very much,” he said.\nRobertson also said the company is monitoring what its peers are doing, but said it seems many are waiting to see what happens with tariffs and that many, “including ourselves in some cases, [have] paused inventory coming from China.”\nRobertson also said the company is “trying to speculate” about whether there will be a scarcity of product on the shelves later this year when less inventory is flowing at a time when it normally builds inventory for fall and for holiday. And while he said it will be interesting to see how that plays out, Robertson said its facility in the Dominican Republic, where it has been making boots for over 40 years, will allow it to ramp production there.\nNet income for the first quarter ended March 31 rose 93.8 percent to $4.9 million, or 66 cents a diluted share, from $2.6 million, or 34 cents, in the same year-ago period. On an adjusted basis, net income was $5.5 million, or 73 cents a diluted share, versus $3.1 million, or 41 cents, a year ago. Net sales were up 1 percent to $114.1 million from $112.9 million.\nRocky’s brands include the Western boot brand Durango, as well as well as a number of rugged, workwear boot brands that include Rocky, Georgia Boot The Original Muck Boot Co., Xtratuf, Ranger, Lehigh, Shoe Angel, and Slipgrips.\nDescribing 2024 as “exceptional” for the Durango brand, Brooks said the sell-in to wholesale moderated in the first quarter due in part to difficult comparisons and timing shifts, including some first quarter orders being delivered early in late 2024. “We did see some underlying strength, particularly online and with our at-once business, which was positive for the quarter,” the CEO said, adding that “large volume orders in the back half of 2025” are expected as retailers optimize their inventory levels.\nBrooks said the longer winter season provided extended opportunities for the sale of insulated boots. The winter weather also helped its Muck brand, which saw an uptick in the brand’s performance, with the CEO citing a double-digit increase in the quarter in its women’s business.\nThe company said gross margin rose 210 basis points to 41.2 percent of net sales versus 39.1 percent a year ago. It noted that inventories rose 6.3 percent at quarter-end, while debt was down 17.5 percent from year-ago levels. Brooks said the company’s refinancing in April last year resulted in a “significant reduction in interest expense” as the company continues to pay down its debt."
    },
    {
      "url": "https://finance.yahoo.com/news/us-vietnam-trade-deal-20-205351547.html",
      "text": "The only certainty for the footwear industry is that price inflation for shoes is still on the horizon, even with a new trade deal supposedly unfolding between the U.S. and Vietnam.\nThe deal, once finalized, is critical for footwear as Vietnam accounts for about 25 percent of shoe manufacturing — and the country has become the go-to place for sneaker production.\nU.S. President Donald Trump revealed his latest trade move on Truth Social Wednesday, one week ahead of the July 9 deadline when the temporary pause on reciprocal rates are supposed to end.\n“Vietnam will pay the United States a 20 percent tariff on any and all goods sent into our territory, and a 40 percent tariff on a Transshipping,” he said, adding that Vietnam will also give the U.S. “total access” to their markets for trade. After pointing out that the access is something Vietnam has never done before, Trump also said the U.S. will be able to sell American product “into Vietnam at zero tariff.”\nThe transshipping component is aimed at barring Chinese manufacturers from circumventing China tariffs by shipping first to Vietnam before it heading to its final U.S. destination.\n“Vietnam is essential to the U.S. footwear supply chain, especially for athletic shoes. In 2024, we imported 274 million pairs from Vietnam, accounting for over half of all athletic footwear imports by volume and value,” Matt Priest, president and CEO of the Footwear Distributors and Retailers of America (FDRA), said in a statement. “With $10.6 billion in shipments last year, Vietnam is on pace to become our largest supplier in 2025. Disrupting that pipeline with additional tariffs would hit American consumers and our industry hard.”\nPriest has repeatedly called for the Trump administration to acknowledge the steep footwear duties already in place. He noted that many shoes, especially popular athletic shoes, already carry a 20 percent tariff, and that adding new tariffs on top of that is “bad economics.”\nIn a telephone interview, Priest said that “some of our own sources are saying that not everything’s been decided,” and that discussions are continuing to finalize the terms. He said that what the industry needs is certainty, and that’s what they don’t have yet since there’s still a lot of unknowns.\n“Will we get credit for what we already paid? We already paid 20 percent for sneakers out of Vietnam, so do we get credit for that or will this be on top of what we already pay? We’re still trying to figure all that out,” Priest said.\nAs for the transshipping component, Priest said what that might mean is also unclear.\nOne thing is clear, however, and that’s that shoe prices are going higher. According to Priest, duties on kids shoes in April alone were up nearly 300 percent year-over-year, and FDRA’s chief economist Gary Raines has already noted evidence “upstream in the supply chain of surging average duties per pair on footwear imports” that is expected to push the average landed cost of footwear imports higher, which in turn will pressure retail footwear prices to climb later this year.\nBTIG analyst Janine Stichter wrote in a note on Tuesday that while there have been some selective price increases already, most of the adjustments upwards won’t occur until this month. And even with temporary reductions in tariffs — 30 percent for China through Aug. 12 and 10 percent for all other countries through July 9 — to allow for negotiations on new trade deals, Stichter said “pricing is still likely a necessary lever to offset” some of those cost increases.\nAnd on Wednesday, she wrote that while the stated 20 percent tariff on Vietnam is higher than the temporary 10 percent pause rate, it is still “much less onerous than the initially proposed 46 percent reciprocal rate.” And while the rate adds incremental margin pressure for those with Vietnam exposure, Stichter said the 20 percent tariff “should be mitigated over time for most.”\nThe American Apparel and Footwear Association’s president and CEO Steve Lamar said the organization is “pleased that further progress” is being made on reciprocal trade deals.\n“With respect to Vietnam — the second largest supplier for footwear, apparel, and accessories sold into the U.S. market — we look forward to learning the details related to today’s news so that we, together with our members, can evaluate how well it will provide relief and certainty,” Lamar said. “Is vital that the final terms of this deal, and any future deals, enable U.S. brands and retailers, and our 3.6 million American workers, to continue to be able to supply American consumers with affordable, responsibly made, ethically sourced, and authentic fashion.”\nRick Helfenbein, an independent consultant and former AAFA chairman, president and CEO, said the 20 percent tariff increase remains a high number for apparel and footwear importers, but still 26 percent lower than where they started on April 2 when reciprocal tariffs were first announced by Trump. “Expect that USA importers and Vietnamese manufacturers might find a way to split the difference — resulting in some price inflation, but avoiding a serious retail disaster — especially for the footwear industry,” he concluded.\nMeanwhile, the U.S. is said to be working on tariff talks with China now that a U.S.-China rare earth minerals trade deal has deescalated tensions between the two countries. Trump at one point raised tariffs to 145 percent for China imports to the U.S., then lowered that to 55 percent, including previous tariffs stacked on top of the new rate. The rate was lowered temporarily in May to 30 percent so trade-deal talks can take place prior to Aug. 12.\nWith China and Vietnam having preliminary agreement status, there has been just one other trade deal finalized and that’s with the U.K.\nA fact sheet from the Holland & Knight law firm provided a status update for bilateral trade deal talks. There are 14 countries where negotiations remain ongoing: India, Japan, South Korea, Mexico, European Union, Canada, Thailand, Cambodia, Malaysia, Philippines, Taiwan, Indonesia, Pakistan and Switzerland. Argentina is also on the list, but there’s been no update since March 4, 2025.\nThe law firm noted that on Monday, Trump said that a “very big” deal with India, a footwear production hub, is likely to be finalized soon. Talks with Mexico are centered on a potential quota system to reduce the 50 percent tariffs on steel imports, while Cambodia has submitted a detailed proposal ahead of the July 9 deadline and the two countries are “now engaged in a multi-round negotiation process.”\nAlso as of Monday, the law firm said Indonesia has eased licensing requirements on import rules and offered to increase U.S. access to critical minerals as part of its effort to advance the talks that are in progress.\nWith July 9 right around the corner, Trump’s next move is anyone’s guess."
    },
    {
      "url": "https://finance.yahoo.com/news/tariffs-parents-back-school-shoe-120000514.html",
      "text": "According to data points from the 2025 AlixPartners U.S. Consumer Footwear Survey, in partnership with the Footwear Distributors and Retailers of America (FDRA), 16 percent respondents expect shoe prices to increase by 10 percent or less, with 34 percent noting price hikes will range from 10 percent to 25 percent and 30 percent expecting the uptick to be 25 percent or more.\nPrice was a key driver in purchasing decisions, and the only factor to see an increase in interest versus the 2024 study.\nSeventy-seven percent said “absolute lowest prices” was a major factor in their choice of store, either online or in person, versus 74 percent in 2024. It was also the determining factor in where consumers are choosing to shop, with mass market retailers the top retail destination at 23 percent due to brand range and perceived affordability. Specialty stores followed at 18 percent and branded store or website at 17 percent to round out the top three shopping channels for back-to-school (BTS) footwear.\nSticker shock is also forcing consumers to rethink their spending patterns. Half of the respondents said they expect brands and retailers to absorb a portion of the cost increases. This same group also said they are both trading down and seeking quality and versatility in what they buy, while they also plan on making fewer purchases.\nAlixPartners survey: deep dive\nAccording to Bryan Eshelman, a partner and managing director at AlixPartners and a co-author of the study, in the upper price tier product lines, brands still matter as well as quality. “People are willing to spend maybe a little bit more on a per-pair basis, but maybe [they will be] buying fewer pairs,” he said. “And so when they spend an extra $20 on a pair of shoes, they’ll want to make sure it’s the right brand, the right quality, and that it’s a versatile product that they can wear for a number of occasions so they’re getting more bang for their buck in that way.”\nAt the other end of the spectrum, the lower-income consumer will be harder hit by the price increases, largely because lower-priced shoes are produced in countries where tariffs are at a higher rate.\nAnd then there are brands such as Nike Inc., which said in May that it was raising prices on select goods, averaging between $2 and $10. But the brand won’t be increasing prices on any kids’ products, whether footwear or apparel, and there won’t be any price increases for any Jordan product. That seems to be a good marketing move for Nike.\n“Nike is in a reinvention phase right now, trying to regain their cool factor. So, I think they have a strong incentive to try to direct consumer sales towards the younger product lines to try to rebuild that cool factor,” Eshelman said, adding that “if I were them, … I’d want to give the impression to the consumer that I’m protecting kids and families from price increases.”\nHe also noted that brands with strong “brand heat” can probably “afford to take the price up and get away with it because people are willing to pay for a good product and a great brand.”\n“Footwear retailers are stuck between a rock and a hard place,” Matt Priest, FDRA’s president and CEO, said in a statement. “Tariffs raise wholesale costs across the board, but consumers aren’t willing — or able — to absorb those increases. That leaves retailers squeezed on both sides, eroding margins and forcing tough decisions on inventory, pricing, and sourcing.”\nWhen faced with a 25 percent to 30 percent increase, 33 percent of consumers said they would likely buy cheaper brands, while 35 percent they would reduce spend elsewhere to afford the brands they want, and 38 percent said they would buy fewer pairs to keep within their budget.\nIn addition to the focus on price, 34 percent said they would search for a similar or dupe product at a lower cost, while 33 percent said they would search for a promo code.\nThe survey determined that brands that offer value without compromising on comfort or style — such as the athletic category — are the mostly likely winners. In fact, the athletic/athleisure shoe category saw a projected 28 percent year-over-year increase in spend versus 2024 levels.\nIn contrast, fashion-first retailers and maybe even luxury brands, might struggle to get sales. The fashion/dress shoes or boots category only saw a 3 percent increase in projected spend when compared with 2024 levels. The study found that 73 percent of Gen Z and millennial parents said they’d skip trend-driven footwear styles in favor of “durability and price.” That also means that both shoe manufacturers and retailers should “design to value” as consumers trade down and scrutinize style features versus price points, strategists at AlixPartners advised.\nThe study found that consumers also have a preference for retailers that offer buy-now-pay-later options, loyalty rewards and real-time price comparison tools\nThe 2025 survey also took into account the possibility of inventory shortages. The advisory firm recommended that retailers have accurate and timely inventory visibility to meet consumer needs — whether via store-to-store transfer, shipping from store, or shipping from a distribution center — to avoid the risk of disappointing a consumer. And AlixPartners advised that retailers should know what their competitors are doing about pricing and promotional strategies. That’s one way to make sure they don’t stand out negatively from a pricing perspective.\nEshelman said he hasn’t seen any indication of low inventory, but noted that consumers are more aware of that possibility due to supply chain issues during the COVID-19 pandemic. He said most retailers have been bringing goods in and taking advantage of pauses in the implementation of higher tariff rates. The AlixPartner retail expert also believes that shoe firms and retailers are bringing more goods in again, now that the tariff deadline was moved out to Aug. 1. And that means consumers may not see price increases for some items until at least through mid-September. That’s because much of the assortment mix for BTS and early holiday have landed, and any spike in new tariffs takes effect when the goods “exit the country, not when they arrive” in the U.S., he explained.\nHibbett in June launched a new kids’-focused app for BTS, Adidas earlier this month released an early BTS sneaker collection featuring Sambas, available at Foot Locker and Kids Foot Locker. And in May when Shoe Carnival posted first quarter results, CEO Mark Worden said he was optimistic about BTS sales, given its lack of manufacturing or wholesale operations and the rebanner of Shoe Carnival stores to the Shoe Station brand. Worden said at the time that the company has been in “close collaboration with vendor partners” and that it has not yet experienced any massive product cost or price increases.\nThe AlixPartners study polled over 1,000 U.S. consumers in June. At that time, nearly half of respondents at 48 percent said they either already started BTS shoe shopping or plan to finish it before July 4, mostly due to concerns over rising prices. Forty-three percent planned to begin between July 5 and Aug. 15, and 9 percent said they would shop after Aug. 15. The peak BTS spend is typically July and August. And in general, those who expect to spend between $150 to $200 per child increased from 15 percent to 19 percent, while those who said they expect to spend between $100 to $150 fell to 24 percent from 29 percent in 2024. The consultancy firm also noted that consumers pulling forward their spend could mean there’s less available later on for holiday spend.\nNRF BTS Survey\nSeparately, the retail trade group National Retail Federation (NRF) said on Tuesday that two-thirds, or 67 percent, of BTS shoppers had already started purchasing items for the upcoming school year, mostly due to concerns that prices will rise because of tariffs. The early start is up from 55 percent in 2024. The 67 percent data point represents the highest since NRF started tracking early shopping in 2018.\n“Consumers are being mindful of the potential impacts of tariffs and inflation on back-to-school items, and have turned to early shopping, discount stores and summer sales for savings on school essentials,” said Katherine Cullen, NRF’s vice president of industry and consumer insights. The NRF survey found that 84 percent still have at least half of the purchases left to complete, mostly because 47 percent are holding out for the “best deals.” Another 39 percent aren’t sure of what items are need and 24 percent are planning to spread out their budgets"
    },
    {
      "url": "https://finance.yahoo.com/news/shoe-firms-consumers-big-break-203557796.html",
      "text": "American President Donald Trump doesn’t want to be the grinch that stole Christmas.\nOn Monday, he signed an executive order that extended the Aug. 12 deadline on higher tariffs for China imports to the U.S. for another 90 days. The pause was set to expire Tuesday at midnight.\nMore from WWD\n-\nOn Is Paying 40 Percent on Vietnam Imports to the US: Here's Why the Brand's CEO Isn't Worried\n-\nConsumer M&A Surges to $34.7B in Q2 Despite Tariff Uncertainty\nThe second extension on the bilateral tariff pause — the first 90-day pause began in May — wasn’t unexpected. Representatives for the U.S. and China were in Stockholm last month to continue trade talks and one of the agenda items was a second extension to allow for continued negotiations.\nBut it seemed that Trump was going to wait until the last possible minute to disclose where he stood on the talks. He held a press conference Monday morning where he disclosed the placement of D.C. police under federal control, as well as the deployment of the National Guard, that is expected to last 30 days to implement a crackdown on crime and homelessness in the area. It was then that Trump also declined to answer a press question about the China tariff deadline.\n“We’ll see what happens,” he said, adding only that the U.S. has been “dealing very nicely with China.”\nTariffs under the temporary pause remain at 30 percent, down from 55 percent, but could have risen to as high as 145 percent for some goods imported to the U.S. if the pause had not been extended for a second time.\nFor shoe companies and consumers, the new pause is good news.\nMany footwear firms were already shipping greater quantities of shoes to boost inventory levels ahead of possible higher tariffs if a deal couldn’t be reached. Now they don’t have to compete with other firms trying to do the same thing, a move that also has resulted in higher shipping costs as companies jostle to get their goods onto the ships ahead of competitors.\nIn addition, the delay gives footwear firms more flexibility on where their goods are produced. Steven Madden Ltd. CEO Edward Rosenfeld said last month in the company’s second quarter earnings call that the company did move some production for fall back to China in cases where it would be difficult to ensure on-time delivery, product quality and/or unreasonable pricing in an alternative country.\nAnd while much of the holiday assortment mix are on the waters for arrival by the end of August, there’s still a selection that come in later in the season. The extension also means that footwear firms can gauge consumer reception to some styles before they chase sales through re-orders. The 90-day extension runs through Nov. 12. It also now gives shoe firms and retailers the opportunity to bring in ahead of time some of their shoe assortment mix for spring, in case the threat of higher tariffs fails to result in a new U.S.-China trade agreement."
    },
    {
      "url": "https://finance.yahoo.com/news/sneaker-shock-yes-nike-raising-162947006.html",
      "text": "In this article:\nNike Inc. is in price-adjustment mode, but it’s also being strategic on which items will see an uptick in cost.\nThe sports apparel and footwear brand is raising retail prices at its U.S. stores — on average between $2 and $10 — but it won’t be for all goods. Nike apparel and equipment will see price increases at between $2 and $10, while footwear prices currently between $100 and $150 will see increases up to $5 and those starting at $150 and higher will see increases up to $10, according to a source familiar with the slated increases.\nMore from WWD\n-\nNike Think Tank Celebrates Five Years of Championing Women's Sports\n-\nJalen Brunson Will Get His First Nike Kobe Sneaker Release Later This Year\nThis person told Footwear News that a large portion of the merchandise assortment will remain at their current price range. There are no increases on any kids’ products, whether footwear or apparel. In addition, there will be no price increases for any Jordan product, whether apparel or accessories. And any product under $100 will remain at current price points. In addition, Nike’s Air Force 1 sneaker, which is priced at $115, will not see any increase.\n“The AF1’s are a popular shoe and is the work-horse” among service providers such as restaurant workers and UPS staff, this individual said. The person also emphasized that Nike is not raising prices on kids’ products because it is cognizant of the needs of “families and the upcoming back-to-school season.”\n“We regularly evaluate our business and make price adjustments as part of seasonal planning,” Nike said in a statement.\nOn the wholesale side, price increases reportedly will start in July when the fall 2025 season is set to begin. News of the price increases was first reported by Complex.\nNike is following in the steps of most footwear brands and retailers, selectively increasing prices based on the product and design features. Brands normally review their cost structure before each selling season and adjust as needed. In recent years, much of the change has been due to inflationary spikes. This year, with the return of Donald Trump as U.S. president and under his administration’s new trade policies, raising prices selectively could be the norm as they grapple with higher tariff rates.\nReciprocal tariffs are a big problem for shoe brands, particularly the 46 percent duty levied on Vietnam and the 145 percent that was later placed on imports from China. While there is currently a 90-day pause on most global goods that ends on July 9 and a separate 90-day pause on goods from China ending Aug. 14, there’s still much uncertainty over what will happen once the freeze on those periods end. Treasury Secretary Scott Bessent said this past Sunday that tariff rates will return to “reciprocal levels” if countries don’t negotiate new trade deals with the U.S."
    },
    {
      "url": "https://finance.yahoo.com/news/fdra-elects-board-leadership-140915328.html",
      "text": "In this article:\nThe Footwear Distributors and Retailers of America (FDRA) continues to look to the future.\nOn Wednesday, the FDRA said it has a newly elected leadership team for the 2025-2027 term. New board members include Josue Solano, CEO of BBC International as chairman; Dan Friedman, chief sourcing and supply chain officer at Caleres as vice chairman, and Lisa Tucker, president of Shoe Show Inc. as treasurer.\nMore from WWD\n-\nIndia Survives Another Round of Trump Tariff Letters: Could a Deal Help Spur More U.S. Shoe Exports?\n-\nDid Trump's Latest Tariff Move Give Shoe Shoppers A Holiday Reprieve?\n“FDRA is a vital force in our industry, and I’m honored to help shape the future of footwear alongside such an innovative and committed leadership team,” Solano said. “From tackling tariff challenges to enhancing industry collaboration, I look forward to working on the issues that matter most to our members.”\nAs chairman, Solano will provide strategic oversight and vision to the FDRA. With over two decades of experience in the industry, he also has a deep understanding of global sourcing, supply chain management, and corporate strategy.\n“Josue’s strategic acumen and deep industry knowledge make him the ideal leader for this moment. His commitment to innovation and his global perspective will help steer the industry through an increasingly complex business environment,” FDRA’s president and CEO Matt Priest said.\nThe organization’s incoming board is supported in the transition by current board members and Jennifer Bendall, the outgoing chair and current vice president, government and public affairs at Nike Inc.\nOther added board members include Crocs’ senior vice president and general counsel Sara Hoverstock, Aldo’s president Jonathan Frankel, Timberland’s vice president and general manager, Americas, Gautham Rao, and Reebok’s president and CEO Todd Krinsky.\nThe new leadership comes at a challenging time for the footwear sector, mostly due to the uncertainty over tariffs. Last month, more than 80 companies signed an FDRA letter urging U.S. President Donald Trump to exempt shoes from tariffs. Separately, executive sentiment in the first quarter reflected concern by footwear executives over weaker shoe demand, according to an FDRA survey. And the FDRA is also working closely with Footwear Innovation Foundation (FIF), a research think tank formed by veterans in the shoe industry who evaluate new ideas and ensure that forward thinking projects push the sector forward. The FIF just launched a contest to encourage game-changing ideas."
    },
    {
      "url": "https://finance.yahoo.com/news/paying-40-percent-vietnam-imports-182701564.html",
      "text": "On Holding AG is eyeing a business model that is expected to help insulate it somewhat from tariff surprises.\nMartin Hoffmann, CEO and CFO, said that during the company’s second quarter earnings conference call to investors Tuesday that On implemented selective price increases in the U.S. in early July. He also said raising prices had no impact on the firm’s second quarter profitability.\n“Considering our strong performance in Q2, continued powerful momentum in the first weeks of Q3, a strong order book for the fall/winter season and the continued efficiency tailwinds driven by our focus and commitment to operational excellence, we are increasing our 2025 guidance across all line items with high expectations for net sales growth, gross profit margin and adjusted EBITDA margin,” Hoffmann said. The company also raised guidance in the first quarter following an earnings report that was ahead of expectations.\nThe second quarter net loss was 40.9 Swiss francs, against net income of 30.8 million Swiss francs a year ago. Net sales grew by 38 percent to 749.2 million Swiss francs, from 567.7 Swiss francs a year ago.\nThe company now expects net sales at constant currency rates is forecasted to be up at least 31 percent year-over-year, ahead of prior guidance of at least 28 percent. Hoffmann said the increased outlook already includes the impact of a 20 percent incremental tariff on imports to the U.S. from Vietnam and the 10 percent assumed in previous guidance.\nWhile not thrilled about the higher tariff rates, Hoffmann also isn’t worried about them. The CEO said that On has been paying around 20 percent import duty on the majority of imported product to the U.S. from its Southeast Asian manufacturing countries, and now that’s shifting to 40 percent for imports from Vietnam and to 39 percent for imports from Indonesia.\nThe U.S. disclosed last month that it has the framework for a preliminary trade agreement with Vietnam for a 20 percent tariff, with final terms still to be negotiated. The framework for a trade deal with Indonesia also disclosed last month, calls for a 19 percent tariff rate. Specifics for Trump’s trade deals have not been disclosed, and Hoffmann’s projections suggest that the new tariffs are stacked on top of existing duties.\n“As a premium brand and as a fast-growing brand, we have multiple opportunities to compensate for these impacts of our cost sold,” he said. Hoffmann said investments and the upscaling of On’s abilities to drive more gross profit margin translates into innovative products that come at higher price points. Those factors have increased the DTC mix, created economies of scale on product cost and fostered supply chain optimization.\nAnd even though there have been select price increases, there’s still one more option that On hasn’t yet needed to do.\n“We have not even yet spoken to our retail partners, our factory partners, about mitigation efforts, which is still something we can do, but we haven’t needed it yet. So this gives us the confidence to raise basically all our financial numbers,” the CEO said.\nHoffman said that while the company is just a year-and-a-half into its three-year strategic plan, On is “far ahead of expectations.” He said the momentum for brand awareness growth will “carry forward with the launch of the Cloudboom MAX next week,” describing it as the first super shoe for the everyday runner and one that he and others at On will be wearing in their fall marathons.\nThe CEO also said that gross profit margin increased by 160 basis points year-over-year to 61.5 percent, an indication of the strength of the premium position of the brand. “The year-over-year increase was primarily driven by the high DTC share, lower freight expenses as well as a net foreign exchange tailwind from the further depreciation of the U.S. dollar during the quarter,” he said.\nAs On continues to build iconic footwear franchises, the company also is starting to merge sports with fashion as it aims for a premium lifestyle focus with higher price points that allow for high profit margins.\n“What truly excites me is that we’re not just creating footwear, we’re building iconic franchises. Today, we have nine distinct footwear franchises, each contributing more than 5 percent to our top line,” co-founder and co-chairman David Allemann said on the conference call. “That kind of balance isn’t an accident. It’s the result of a year’s long focused strategy to build resilience into our portfolio.”\nHe noted that the company is building a business that has the potential to have a “very high margin profile.” The business model has the brand expanding beyond footwear to include apparel. That transforms On to “somewhere between a sports brand and a fashion brand,” with a placement at the “intersection of performance, innovation and fashion” that allows it to have “very, very high price points,” the co-chairman said.\nIconic footwear franchises include Cloudsurfer and Cloudmonster, and the Swiss brand is seeing momentum with the newly launched Cloud 6. Footwear sales in the second quarter ended June 30 rose 36.0 percent at constant exchange. Apparel, representing just about 7 percent of total sales, is gaining traction. The Zurich-based brand previewed its Spring/Summer ’26 collection during Paris Fashion Week, and is set to launch an apparel line with brand ambassador Zendaya this fall. “What connects footwear and apparel is On’s strive in technological innovation and our routes in Swiss engineering and design,” Allemann said, noting that those factors allows the firm to “build a truly resilient portfolio.”\n“But our product resilience is about more than just footwear and apparel — it’s our commitment to win in multiple sports,” Allemann said. “We started in running, but we successfully expanded to trail, outdoor, tennis and training, moving us closer to our vision of being the most premium holistic sportswear brand.”\nHe also emphasized that while On is fundamentally a sports brand, the cultural shift towards sport as the new “uniform” creates a lifestyle focus that unlocks a much larger addressable market. One example cited was the recent Loewe x On Cloudtilt collaboration sneaker, which retailed at $590 a pair and was “sold out almost entirely within days.”\nThe co-chairman said that wholesale — up 23 percent in the quarter — remains a vital distribution channel, citing success with “over 11,000 stores globally from the biggest players to local running specialty.” But it is the direct-to-consumer (DTC) business that is the standout that has driven large gains, both online and in physical retail. DTC represents 41.1 percent of total sales and remains a huge growth area for On.\nThe company, which operates 54 company-owned stores worldwide, is also seeing untapped potential for stores across Europe, particularly in France, Italy and Spain, as well as triple-digit growth in Asia, especially in Singapore and Thailand.\nThe co-founder also noted that a few weeks ago, the company launched its first LightSpray factory in Zurich, with four robotic arms. “It’s a path to the future of manufacturing, faster, less labor-intensive, in various locations with a much simpler supply chain that’s closer to consumer demand,” Allemann said. LightSpray technology cuts a multi-part production process into a three-minute, minimal-waste step, creating the lightest racing shoe — its Cloudboom Strike LS — that weighs just 170 grams."
    },
    {
      "url": "https://finance.yahoo.com/news/where-opportunity-footwear-production-jack-182001813.html",
      "text": "Paul Farago, president of footwear brands Jack Erwin and Ace Marks, has been navigating the shifting tariff backdrop firsthand for years.\nMore importantly, he’s already seeing a structural change in footwear production, moving from central concentration to a new normal with distributed manufacturing networks and regional specialization.\n“I don’t believe there’s a single “new China” emerging. Rather, we’re moving toward a more regionalized production model where brands maintain manufacturing relationships across multiple countries to balance costs, capabilities, and risk. This diversification strategy is more resilient but requires more sophisticated supply chain management,” he said.\nFor more on the challenges and opportunities in global markets from Brazil and Mexico to Italy and Portugal, read on.\nFootwear News: The tariff plan for China imports to the U.S. could continue at the temporary 30 percent rate instead of the planned 55 percent for another 90 days. Will companies that have moved production out of China rethink that strategy?\nPaul Farago: The reduction from 55 percent to 30 percent on China tariffs is somewhat of a relief, but I don’t expect to see wholesale reversals of production decisions already made. Companies that have successfully diversified their manufacturing — particularly those with established relationships in Italy, Portugal, Mexico and Brazil — have discovered benefits beyond just tariff avoidance: reduced lead times, smaller minimum orders and greater supply chain resilience.\nHowever, this tariff adjustment will likely slow the pace of new production shifts. For firms still evaluating moves away from China, a 30 percent tariff significantly changes the economic calculus, especially for mass-market products where China’s volume capacity and component ecosystem remain unmatched. The lesson learned from this experience is not to have all of your eggs in one basket, and I don’t think it will soon be forgotten.\nFor countries like Vietnam, this could actually represent positive news. As flight from China loses its urgency, there’s less pressure to create new manufacturing capacity in alternative locations. This could lead to more stable, sustainable growth in Vietnam’s footwear sector rather than the boom-bust cycles we’ve seen in other countries when brands rush in during crises only to exit when conditions normalize.\nFN: What lessons were learned during COVID-19 that can be applied during this period?\nPF: COVID revealed that efficiency and resilience are often competing priorities in supply chains. The footwear brands that weathered the pandemic best weren’t necessarily those with the lowest production costs, but those with diversified manufacturing relationships.\nThe most significant lesson wasn’t just about geographical diversification — it was about relationship depth. Brands with transactional supplier relationships faced the worst disruptions, while those who had invested in partnership-based manufacturing relationships received preferential treatment when capacity was constrained.\nThe footwear industry now recognizes that concentrating production entirely in one region creates substantial vulnerability. However, the solution isn’t simply relocating — it’s developing flexible networks across multiple countries while acknowledging that each offers different capabilities and capacity constraints.\nFN: Given the specialized machinery involved, footwear manufacturing isn’t an easy category where one can pick up stakes and shift production elsewhere. Do you foresee China still maintaining its position as a footwear manufacturing hub?\nPF: China will remain indispensable for mass-market footwear production due to its unmatched capacity and comprehensive component ecosystem. Even manufacturers in Italy, Portugal, Mexico, and Brazil depend on China for many components, creating an interconnected global production network rather than truly independent alternatives.\nWhat we’re witnessing isn’t China’s replacement but a more nuanced evolution where different categories find their optimal production locations. Mass-market brands will continue leveraging China’s scale advantages, while creating secondary capacity in places like Vietnam and Indonesia. Midtier and premium brands have more geographic flexibility, and can explore alternatives with attractive quality-to-cost ratios.\nThe specialized machinery and infrastructure required for footwear manufacturing creates significant barriers to rapid relocation. This reality explains why, despite years of tariff pressures, we haven’t seen wholesale exodus from China — the capacity simply doesn’t exist elsewhere to absorb that volume.\nFN: Amid all of the upheaval, is there more opportunity for European footwear producers?\nPF: China’s dominance in mass-market footwear remains undeniable, but European manufacturing represents a fundamentally different approach rather than just a higher price point. In Italy, Portugal, and Spain, we’re seeing specialized expertise by product category — Italy excels in dress shoes and luxury sneakers, Portugal in casual and performance leather goods, and Spain in particular types of construction methods.\nPortugal, for instance, has brilliantly positioned itself as a middle ground — offering much of the craftsmanship associated with Italian production but at more accessible price points. This has made Portugal particularly attractive as tariffs have increased on Chinese goods.\nThe real advantage these European countries offer isn’t just quality — it’s flexibility. When we produce a run at our Italian factories, the minimum order quantities (MOQs) are much lower allowing us to test a larger variety of product with less risk. Many suppliers also have skilled technicians on site that can do a lot of the heavy lifting when it comes to product development, and they do it fast. This responsiveness has become increasingly valuable as consumer preferences change more rapidly.\nAs for prices, at the product level, you’d be hard-pressed to find China prices in a European country with comparable quality to China. However, when you factor in logistics costs, quality control requirements, MOQs, other operational factors, and of course the current tariff situation, what was once a huge pricing delta is now a much thinner spread that has to be seriously considered.\nFN: You’ve said that Brazil and Mexico have been manufacturing hubs for footwear for decades. What is the factory infrastructure? What is the main hurdle?\nPF: Brazil has maintained a robust domestic footwear industry due to its size and relative isolation, focused primarily on serving its internal market with some export capacity. Mexico’s proximity to the U.S. has positioned it well for certain categories, but has also historically focused on domestic production. Both countries have very ardently protected their domestic manufacturers through the decades, which is one of the reasons that they have a footwear manufacturing infrastructure today — unlike the U.S. which used to be a footwear manufacturing hub until the ’70s.\nThe infrastructure in both countries varies significantly by region. Brazil has well-developed industrial clusters, particularly around Novo Hamburgo, with sophisticated technical capabilities. Mexico’s footwear industry is concentrated in León and surrounding areas.\nThe primary hurdles aren’t necessarily technical capacity — both countries have skilled labor pools and understand footwear construction — although younger generations are not exactly flocking to work at footwear factories. The challenges are more systemic: inconsistent material supply chains, logistics infrastructure that wasn’t designed for export-oriented manufacturing, and business environments that can be challenging for international brands to navigate. And they often prioritize domestic production over export as they see it as more stable, which often leads to delays and results in the deterioration of trust between foreign brands and local manufacturers.\nFN: For shoe imports to the U.S., how realistic is the possibility for nearshoring — given the investments needed and the time required — to build out a new manufacturing infrastructure just for footwear?\nPF: Nearshoring for footwear faces significant challenges but is increasingly viable for specific product categories. The economics simply don’t work for mass-market athletic footwear, which requires massive scale and specialized technical capabilities currently concentrated in Asia.\nHowever, for certain types of leather footwear, particularly in the premium and luxury segments, nearshoring to Brazil, Mexico, Colombia and a few other countries in the Americas can be economically viable today. We’ve successfully produced dress shoes and leather casual styles in Brazil with quality comparable to our European manufacturing at competitive costs.\nFN: How do you think Trump’s current trade policy might impact the thinking around footwear production in the years to come?\nPF: Frustratingly, one trade policy that has not seen much change over the decades with regards to footwear is the unreasonably high duty rates that existed even before the current trade challenges.\nFootwear production and the related logistics is so complex and often reliant on the good graces of multiple domestic and foreign governments that it feels like we are always dealing with some sort of a crisis either caused by nature, man, or government. Just in the last decade we’ve had to deal with currency volatility, COVID, pirates, port congestion, canal closures, haphazard testing regulations, and now tariffs just to name a few. It’s a constant battle."
    }
  ],
  "argos_summary": "Shoe prices began to rise in July after months of decline, influenced by increasing inflation and higher import duties on footwear. Retail footwear prices increased by 0.9% year-over-year, with notable price hikes in men's shoes, while women's and children's footwear also saw slight increases. Despite these gains, overall prices remain modestly lower compared to the same period last year, and ongoing tariff pressures are expected to continue impacting retail prices throughout the year.",
  "argos_id": "6QPSSI6HT"
}