{
  "url": "https://www.yahoo.com/news/articles/sterling-breaks-ground-thomas-park-183300732.html",
  "authorsByline": "Brandon Clark, Daily Gazette, Sterling, Ill.",
  "articleId": "a1d7f69da775429bbd9529959d55eccc",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:33:00+00:00",
  "addDate": "2025-08-12T18:44:36.906255+00:00",
  "refreshDate": "2025-08-12T18:44:36.906256+00:00",
  "score": 1.0,
  "title": "Sterling breaks ground on Thomas Park improvements; Morrison's OSLAD grant falls through",
  "description": "Aug. 12—In Sterling, shovels are already in the ground for big park upgrades — but in Morrison, the wait for state grant money continues. Last year, both cities' park districts were notified that they were being awarded funding through the Open Space Land Acquisition and Development (OSLAD) program, a cost-sharing program between state and local governments for parks and outdoor recreation ...",
  "content": "Aug. 12—In Sterling, shovels are already in the ground for big park upgrades — but in Morrison, the wait for state grant money continues.\n\nLast year, both cities' park districts were notified that they were being awarded funding through the Open Space Land Acquisition and Development (OSLAD) program, a cost-sharing program between state and local governments for parks and outdoor recreation projects. The program was established by the Illinois General Assembly in 1986.\n\nAccording to the Illinois Department of Natural Resources, OSLAD grants are open to units of local government with the authority to develop and maintain public parks, such as park districts and municipalities.\n\nSterling Park District Executive Director Larry Schuldt said the park district applied for the grant last September, and was notified in December that it received the grant.\n\n\"But we didn't get all of the official paperwork until mid-June, and so we couldn't start anything until we got that,\" Schuldt said.\n\nThe Sterling Park District is using the $600,000 OSLAD grant it received to make several improvements to Thomas Park, including the construction of a new Americans With Disabilities Act-compliant playground, expanded parking and a fishing platform.\n\nBob Dickson of Sterling watches the work being done on the new parking area at Sterling's Thomas Park on Thursday, Aug. 7, 2025. Dickson is excited for the new lot to relieve the congestion, especially when school is back in session. (Alex T. Paschal)\n\nPhase One of the project is already underway with the construction of 21 parking stalls along 12th Avenue. Schuldt said he expects the work to wrap up this week.\n\n\"It looks like they've just got some more rock to put in and smooth out, level, and then asphalt,\" Schuldt said.\n\nPhase Two, set to begin next spring, will overhaul the park's pickleball courts. Schuldt said at least six courts will be renovated, with the potential for two more if the district can manage the extra cost and construction demands.\n\nPhase Three will bring the construction of a new ADA-compliant playground, a shaded picnic area, renovations to the basketball court and the installation of an accessible fishing pier at the park's pond. The work is expected to finish over the summer and fall of 2026.\n\nOriginally pegged at $700,000 with most costs covered by the OSLAD grant, the project's price tag has climbed, driven by higher playground equipment costs and the potential addition of two more pickleball courts.\n\n\"It's looking closer to $900,000 now,\" Schuldt said.\n\nThe city of Morrison was expecting to receive $81,500 through the OSLAD grant to help build a new ADA-compliant playground at the Morrison Sports Complex, 315 Bishop Road.\n\nHowever, Parks and Recreation Director Nathan Jacobs said the city was denied and is now trying for a third time to secure the grant.\n\nHe said the city missed out on qualifying points in the following areas:\n\n* Habitat/wetland/wildlife protection or enhancements, such as pollinator gardens, bird houses and others.\n\n* Incorporation of green technologies, such as solar power for the park.\n\n* Diversity of recreation — the project only had one recreational component.\n\n\"We still don't understand because with these points, other cities still received their OSLAD and we didn't,\" Jacobs said.\n\nApplications are scored and prioritized based on statewide outdoor recreation goals in Illinois' Statewide Comprehensive Outdoor Recreation Plan. Projects funded through OSLAD must remain dedicated to public outdoor recreation permanently.\n\nEligible projects range from acquiring land for new or expanded parks to building or renovating playgrounds, sports courts, trails, fishing piers, and other outdoor facilities.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "OSLAD grants",
      "weight": 0.09493951
    },
    {
      "name": "park districts",
      "weight": 0.087735
    },
    {
      "name": "public parks",
      "weight": 0.08146945
    },
    {
      "name": "outdoor recreation projects",
      "weight": 0.07828445
    },
    {
      "name": "parks",
      "weight": 0.07756414
    },
    {
      "name": "big park upgrades",
      "weight": 0.075965956
    },
    {
      "name": "Sterling Park District Executive Director Larry Schuldt",
      "weight": 0.075077794
    },
    {
      "name": "state grant money",
      "weight": 0.073851116
    },
    {
      "name": "Sterling Park District",
      "weight": 0.07159758
    },
    {
      "name": "OSLAD",
      "weight": 0.07151976
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.9921875
    },
    {
      "name": "/News/Local News",
      "score": 0.97607421875
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.8642578125
    },
    {
      "name": "/Finance/Grants, Scholarships & Financial Aid/Government Grants",
      "score": 0.53955078125
    }
  ],
  "sentiment": {
    "positive": 0.5068872,
    "negative": 0.07788565,
    "neutral": 0.41522712
  },
  "summary": "The Open Space Land Acquisition and Development (OSLAD) program, a cost-sharing program between state and local governments for parks and outdoor recreation projects, has fallen through a gap between Sterling and Morrison. The Sterling Park District is using the $600,000 OSLAD grant to make improvements to Thomas Park, including construction of a new Americans With Disabilities Act-compliant playground, expanded parking, and a fishing platform. However, Morrison's Parks and Recreation Director Nathan Jacobs was denied the grant due to several qualifying issues, including habitat/wetland/wildlife protection or enhancements, such as pollinator gardens, bird houses, and the potential addition of two more pickleball courts. The project's cost tag has since increased to $900,000.",
  "shortSummary": "Sterling and Morrison's OSLAD grants for park upgrades continue to falter, with both cities facing delays due to missed qualifying points and increased costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f7260ea2a01d4e6bb0ea9745b9dabe5b",
  "places": [
    {
      "osmId": "22049645",
      "road": "12th Avenue",
      "town": "Sterling",
      "county": "Whiteside County",
      "state": "Illinois",
      "postcode": "61081",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 41.8104853,
        "lon": -89.6822504
      }
    },
    {
      "osmId": "427913141",
      "town": "Sterling",
      "county": "Whiteside County",
      "state": "Illinois",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 41.810581049999996,
        "lon": -89.68324527128703
      }
    }
  ],
  "scraped_sources": [],
  "argos_summary": "Sterling is actively upgrading Thomas Park with a $600,000 OSLAD grant, focusing on improvements like a new ADA-compliant playground and expanded parking, with work expected to finish by fall 2026. In contrast, Morrison's Parks and Recreation Director reported that their application for an $81,500 OSLAD grant was denied for the third time due to insufficient qualifying points in areas like habitat protection and project diversity. The OSLAD program, established in 1986, supports local governments in developing public parks and outdoor recreation facilities.",
  "argos_id": "6T6T87TRD"
}