{
  "url": "https://www.usatoday.com/story/sports/golf/2025/08/12/bmw-championship-tee-times-schedule-pairings-groups/85631562007/",
  "authorsByline": "Mark Giannotto",
  "articleId": "648c7545aa984bf496b72252c461875d",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/02/10/USAT/78392215007-usatsi-23010010.jpg?crop=4682,2630,x0,y16&width=3200&height=1798&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:10:32+00:00",
  "addDate": "2025-08-12T21:17:20.211216+00:00",
  "refreshDate": "2025-08-12T21:17:20.211218+00:00",
  "score": 1.0,
  "title": "BMW Championship tee times, groups, schedule, golfers to watch in Rounds 1 and 2",
  "description": "Tee times and schedule for the first and second rounds at the BMW Championship, which is the second event of the PGA Tour's FedEx Cup Playoffs.",
  "content": "The two biggest stars in golf will play together at the second event of the PGA Tour's FedEx Cup Playoffs.\n\nThe PGA Tour announced tee times for the first two rounds of the 2025 BMW Championship on Tuesday, Aug. 12, and Scottie Scheffler and Rory McIlroy ‒ ranked No. 1 and 2 in the World Golf Ranking and FedEx Cup standings ‒ have been paired together in the same group.\n\nScheffler, who will again play with a replacement for normal caddie Ted Scott, is the tournament favorite after confirming his status as the sport's best by winning the PGA Championship and Open Championship in recent months. McIlroy, the 2025 Masters champion, is returning to PGA Tour play after skipping the first FedEx Cup playoff event at the FedEx St. Jude Championship in Memphis. But with only the top 50 golfers in the FedEx Cup standings in the field, they aren't the only group worth watching when first-round action gets underway on Thursday, Aug. 14 at Caves Valley Golf Club in Owings Mills, Maryland.\n\nJustin Rose and U.S. Open champion J.J. Spaun are in the same group after Rose beat Spaun in a playoff in Memphis last week. Justin Thomas and Tommy Fleetwood will tee off together in a potential preview of a Ryder Cup matchup next month. Keegan Bradley, the defending tournament champion and United States team captain at the 2025 Ryder Cup, is playing with Maverick McNealy, one of the Americans vying for a captain's pick. This is the last PGA Tour event in which golfers can earn points to be one of six automatic qualifiers on this year's Ryder Cup teams.\n\nHere's a breakdown of all the Round 1 and 2 tee times at the 2025 BMW Championship, as well as how to watch the PGA Tour's second FedEx Cup Playoffs event:\n\nHow to watch 2025 BMW Championship: TV, streaming for PGA Tour FedEx Cup Playoffs event\n\nThe 2025 BMW Championship, the second event of the PGA Tour's FedEx Cup Playoffs, will be televised nationally on the Golf Channel and NBC. It can be live streamed via ESPN+, Peacock and Fubo depending on the time. Here's the full broadcast schedule for all four rounds:",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/sports/golf/2024/08/22/2024-bmw-championship-first-round-leaderboard-updates-castle-pines/74911466007/",
    "https://sportsdata.usatoday.com/golf/pga/schedule",
    "https://www.usatoday.com/story/sports/golf/ryder-cup/2025/08/11/u-s-ryder-cup-team-j-j-spaun-xander-schauffele-qualify/85608214007/",
    "https://www.fubo.tv/stream/tv/?irad=343747&irmp=1205322&subId1=USAT&subId2=Golf&subId3=2025",
    "https://www.usatoday.com/story/sports/golf/2025/08/06/ryder-cup-2025-standings-points-format-date-bethpage/85542832007/",
    "https://www.usatoday.com/story/sports/golf/pga/2025/08/12/caddie-ted-scott-absent-scottie-scheffler-bmw-championship-prep/85626776007/",
    "https://www.usatoday.com/story/sports/golf/2025/08/04/rory-mcilroy-fedex-st-jude-championship-playoffs-field/85510766007/",
    "https://www.usatoday.com/story/sports/golf/2025/08/11/fedex-cup-standings-points-bmw-championship-playoff/85607878007/",
    "https://go.web.plus.espn.com/nLOZjx",
    "https://imp.i305175.net/anPaeY",
    "https://www.usatoday.com/picture-gallery/sports/golf/2025/03/11/pga-tour-2025-tournament-winners/82286157007/",
    "https://sportsdata.usatoday.com/golf/pga/players/scottie-scheffler/826546",
    "https://www.usatoday.com/story/sports/golf/pga/2025/08/10/2025-fedex-st-jude-championship-justin-rose-beats-jj-spaun-playoff/85602794007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "PGA Tour FedEx Cup Playoffs event",
      "weight": 0.13320681
    },
    {
      "name": "FedEx Cup Playoffs",
      "weight": 0.11890719
    },
    {
      "name": "FedEx Cup",
      "weight": 0.11655034
    },
    {
      "name": "FedEx Cup standings",
      "weight": 0.115338
    },
    {
      "name": "PGA Tour",
      "weight": 0.10812424
    },
    {
      "name": "BMW Championship tee times",
      "weight": 0.105986
    },
    {
      "name": "Ryder Cup",
      "weight": 0.10553849
    },
    {
      "name": "PGA Tour play",
      "weight": 0.1042444
    },
    {
      "name": "BMW Championship",
      "weight": 0.09668043
    },
    {
      "name": "Open Championship",
      "weight": 0.08980067
    }
  ],
  "topics": [
    {
      "name": "Golf"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Auto"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9931640625
    },
    {
      "name": "/Sports/International Sports Competitions/Other",
      "score": 0.8447265625
    },
    {
      "name": "/Sports/Individual Sports/Golf",
      "score": 0.5595703125
    }
  ],
  "sentiment": {
    "positive": 0.1931818,
    "negative": 0.1760229,
    "neutral": 0.63079524
  },
  "summary": "The second event of the PGA Tour's FedEx Cup Playoffs, the 2025 BMW Championship, will see top golfers Scottie Scheffler and Rory McIlroy, ranked No. 1 and 2 in the World Golf Ranking and FedEx Cup standings, paired together in the same group. The tournament will begin on August 12 at Caves Valley Golf Club in Maryland. Other notable matches include Justin Rose and J.J. Spaun, Justin Thomas and Tommy Fleetwood, and Keegan Bradley. The event will be televised nationally on the Golf Channel and NBC, and can be live streamed via ESPN+ Peacock and Fubo depending on the time.",
  "shortSummary": "The 2025 BMW Championship features notable players like Rory McIlroy, Scheffler, and Keegan Bradley, with Round 1 and 2 scheduled for August 14.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "efb0e75c69f24581a2a6bf428d4f5029",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/sports/golf/2024/08/22/2024-bmw-championship-first-round-leaderboard-updates-castle-pines/74911466007/",
      "text": "Keegan Bradley goes from last man in to top of the leaderboard, Scheffler tweaks his back among 5 things to know at 2024 BMW Championship\nCASTLE ROCK, Colo. — The PGA Tour returned to the Rocky Mountains for the first time in more than a decade. Playing at an elevation of more than 6,300 feet and dealing with the altitude was a hot topic of conversation as players tried to figure out how to adjust to the thin air.\n\"I think the highlight (of the day) was hitting it 430 down the 10th,\" said Adam Scott.\nCastle Pines Golf Club had been a fixture on the Tour for 21 years before bowing out at the start of the FedEx Cup era in 2007. Jack Nicklaus re-designed the course for the pros latest visit, stretching it to 8,130 yards. Justin Thomas, speaking on Sirius/XM PGA Tour Radio described Castles Pines as \"if Shadow Creek and Caves Valley had a baby.\"\nOn Thursday, Keegan Bradley, the last man in the field at No. 50, shot to the top of the leaderboard with an opening-round 66 before play was suspended due to lightning in the area. It would be his 11th lead or co-lead after the first round, and he's 0-for-10 in holding on to those previous leads, including at the 2022 BMW. Here are five things to know from the opening round of the BMW Championship.\nThe last in shall be first\nThe last man into the 50-man field at the BMW Championship is at the top of the leaderboard after the opening round.\nKeegan Bradley drilled his second shot at 18 from 176 yards to 10 feet and rolled in the birdie putt to shoot 6-under 66 at Castle Pines Golf Club and take a two-stroke clubhouse lead at the second leg of the FedEx Cup playoffs. Japan’s Hideki Matsuyama, who won last week, finished one stroke back at 67, waiting out a 3-hour, 10 minute suspension of play due to lightning in the area to complete his final hole. He stuffed his approach to 2 feet at 18 but somehow missed the putt.\nBradley, who was named the 2025 U.S. Ryder Cup captain in July, struggled last week at the FedEx St. Jude Championship, finishing T-59, and dropped from 39th place in the season-long race to a precarious position straddling the No. 50 cutoff and that was changing by the minute. After he completed his round in Memphis, he went back to his room and sweated it out seeing whether he’d advance to the second of three playoff events or go home and hang with his two kids.\n“I had the FedEx Cup standings, the coverage on, the featured holes, my phone. I had it all going,” said Bradley, who ended up as the ‘Bubble Boy’ at No. 50. “Sunday afternoon was one of the toughest afternoons of my PGA Tour career. It was really brutal. It's such a relief to be here. I just felt a lot calmer today.”\nIt showed as the 2018 BMW champ made six birdies and no bogeys, and holed a 10-foot par putt at No. 7 to keep his momentum going. He is projected to improve from bubble boy status to No. 4 heading into the FedEx finale. This week the new cut off is to make the top 30 and advance to the Tour Championship at East Lake, where the winner will earn $25 million in bonus money. Despite the pressure to crack the top 30, Bradley said he and his caddie talked about going about their normal routine and not force things.\n“Try to birdie any hole I can,” Bradley said. “That was the plan.”\nScheffler tweaks his back\nIt’s never good to see a professional golfer reaching for their lower back after hitting a shot and it’s even worse when that golfer is the world No. 1 Scottie Scheffler, who is trying to win the FedEx Cup for the first time and cap off a spectacular season.\nBut on the 17th hole, Scheffler hit his second shot and touched his lower back with his left hand.\nScheffler finished with a couple of pars and posted three birdies and two bogeys for an opening-round 1-under 71. Afterwards, Scheffler downplayed any potential injury, saying, “it's fine.”\nScheffler did concede that he woke up with a sore back and had trouble loosening it up.\n“It was hard for me to get through it and I was laboring most of the day to get through the ball,” he explained. “On 17 I was trying to hit a high draw, and that's a shot where I've really got to use a big turn, big motion.”\nAsked to elaborate on what happened, he said, “Maybe I hit a few too many balls yesterday or something. It was just a little sore. I'm sure I'll get some ice on it and stuff and I'll be totally fine tomorrow.”\nWould he be seeking any special treatment? “Just normal routine. Just like always,” he said.\nScheffler was paired on Thursday with Xander Schauffele, who is second in the FedEx Cup and shot 69 to best Scheffler, the FedEx Cup leader, by two strokes.\nSchauffele said he noticed that Scheffler was stiff when he tried to turn his head but joked that it may be a bigger problem for the field than for Scheffler, noting that he needed treatment on his neck at the Players Championship and elsewhere when he won. “I guess it's a bad sign for everyone else,” he said.\nScott returns 24 years later\nAdam Scott was among the pack that shared third after carding 4-under 68s. Scott made his Tour debut at Castle Pines at the International in 2000, a Tour event which was discontinued after 2006. Scott and Jason Day (2006) were the only two players in the field this week to play here before.\n“To think about however many events it is that I've played now and been successful out here for a long time, it was inspiring at the time, and it's fun to come back to where it all began,” said Scott.\nThe 44-year-old Aussie enters the week at No. 41 in the FedEx Cup but when asked whether he knew where he needed to finish to make the top 30, he said, “Good. I mean, I don't know. It moves around so much. Top 5 is kind of the goal, obviously. I think a top 5 would do it. Anything else, you never know. I feel like I've played on a bubble all year, and unless I'm running away by six shots on Sunday, I'm probably going to be on a bubble all week this week, as well, if I'm playing good.”\nConners' quest\nCorey Conners has a lot a stake this week. He started the week at No. 33 in the FedEx Cup and with work to do to make East Lake. That's nothing new for Conners who has been in this position before.\n\"Just business as usual,\" he said.\nHe's off to a strong start, shooting 4-under 68.\n\"Hit the ball really nicely,\" he said. \"A lot of fairways, a lot of greens, and that's the recipe I wanted to stick to today, and I was able to do that pretty well.\"\nAlso at stake for Conners is trying to secure an automatic spot on the International Team for the Presidents Cup. The Canadian entered the week at No. 7 in the point standings and only the top six will qualify automatically. The Presidents Cup is being held in late September in Montreal and he's bound and determined to make Mike Wier's team.\nFedEx Cup bubble watch\nOnly 30 players will advance to the Tour Championship, the FedEx Cup finale to be contested next week in Atlanta. When play during the first round was suspended due to lightning in the area, there were four players projected to move in and four players projected to move out.\nIN\nKeegan Bradley from No. 50 to No. 4.\nCorey Conners from No. 33 to No. 20.\nAdam Scott from No. 41 to No. 22.\nAlex Noren from No. 45 to No. 23.\nOUT\nBrian Harman (T-22) from No. 29 to No. 31.\nDenny McCarthy (T-15) from No. 30 to No. 32.\nJason Day (T-49) from No. 25 to No. 35.\nDavis Riley (T-44) from No. 26 to No. 36.\nBut there will be so much more volatility in the days to come. Nick Dunlap started the day at No. 49 and was 5 under thru 14 holes and had improved to No. 9. Then he made a double bogey at 15 and he dropped to No. 39. So get ready for some Sunday drama on who is headed to East Lake."
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/2025/08/06/ryder-cup-2025-standings-points-format-date-bethpage/85542832007/",
      "text": "Ryder Cup standings: Teams, format, selection process before 2025 FedEx Cup playoffs\nThe 2025 FedEx Cup playoffs begin this week with the FedEx St. Jude Championship in Memphis, but there's an bigger event looming for a select group of the world's best golfers when the PGA Tour concludes this year.\nThe biennial Ryder Cup is coming up soon and returns to the United States this year, with a team of the best American golfers and the best from Europe set to compete in match play at the Bethpage Black Course in Farmingdale, New York on Long Island. Keegan Bradley will serve as the captain for the United States and presents a potential player-coach dynamic given his relatively strong play on the PGA Tour this year. Luke Donald returns as the captain for Europe after successfully leading them to the Ryder Cup title in 2023 in Italy.\nThe selection process can be intense, with a points system based on performance in which the top six golfers from the United States and the top six golfers from Europe are automatically slotted into one of 12 available spots on each Ryder Cup team. The remaining six spots on each team are captain's picks.\nThe race to be inside the top six is tight and the debate is raging over what golfers should make the cut for each team should, especially involving some of the well known members of LIV Golf. Those jockeying for position have just a few weeks left to get more Ryder Cup points.\nHere's a breakdown of what the Ryder Cup points standings look like for the United States and Europe teams ahead of the start to the PGA Tour's FedEx Cup playoffs, as well dates and format information ahead of the 2025 Ryder Cup:\nWhen are Ryder Cup teams announced?\nThe qualification period for the United States Ryder Cup team ends after the conclusion of the BMW Championship on August 17. The top-six golfers in Ryder Cup points at that time will automatically qualify for the 2025 United States team. Points are earned through performance in major tournaments in 2024 and 2025, as well as the 2025 Players Championship and 2025 PGA Tour events through the BMW Championship.\nIt's unclear exactly when Bradley will announce his six captain's picks. Zach Johnson, the captain of the 2023 United States Ryder Cup team, announced his captain's picks on Tuesday, August 29 after the 2023 Tour Championship. The 2025 Tour Championship is scheduled for August 21-24.\nEurope team members earn Ryder Cup points from all DP World Tour Race to Dubai ranking tournaments (including major championships) between August 29, 2024, and August 24, 2025. They can also earn Ryder Cup points from 2025 PGA Tour FedExCup points events, excluding any tournament scheduled in the same week as a DP World Tour Rolex Series event.\nThe top-six golfers after the Betfred British Masters on August 24 will automatically qualify for the Europe Ryder Cup team. The other six spots will be captain's picks by Donald. He announced Europe's captain's picks on Monday, September 4 in 2023, one day after the conclusion of the Omega European Masters.\nWhen is the 2025 Ryder Cup?\nThe 2025 Ryder Cup is scheduled for September 26-28. The event will be broadcast nationally by NBC and USA Network and available via live stream on Peacock and Fubo. Times and schedule have not been announced yet.\nWhere is the Ryder Cup in 2025?\nThe 2025 Ryder Cup is being held on Long Island at the Bethpage Black Course in Farmingdale, New York. It's the first time Bethpage has played host to a Ryder Cup. The public course was the site of two U.S. Opens (2002, 2009) and the 2019 PGA Championship.\nRyder Cup format 2025\nThe three-day competition features four foursome and four four-ball matches on the first two days of competition. The winner of each match earns a point for their team. The order of the events each day is determined by the home team's captain.\nThe final day of Ryder Cup competition concludes with 12 singles matches in which a point is awarded to the team of the winning golfer. There are 28 total points to determine the Ryder Cup champion, with half-points awarded for matches that end in ties.\nRyder Cup standings: Before 2025 FedEx Cup playoffs\nTop six in points automatically qualify for their 2025 Ryder Cup teams. Points as of August 6, 2025.\nUnited States\n- Scottie Scheffler: 32,420.33 points\n- Xander Schauffele: 13,383.85\n- J.J. Spaun: 12,478.91\n- Russell Henley: 11,623.82\n- Bryson DeChambeau: 10,774.98\n- Harris English: 10,385.65\n- Justin Thomas: 10,208.09\n- Collin Morikawa: 9,743.61\n- Ben Griffin: 8,803.76\n- Keegan Bradley: 8,038.5\n- Maverick McNealy: 7,414.15\n- Brian Harman: 7,007.99\n- Andrew Novak: 6,560.15\n- Patrick Cantlay: 6,069.39\n- Cameron Young: 5,889.64\nEurope\n- Rory McIlroy: 3,440.78 points\n- Robert MacIntyre: 1,355.84\n- Tommy Fleetwood: 1,314.61\n- Tyrrell Hatton: 1,279.33\n- Shane Lowry: 1,234.11\n- Sepp Straka: 1,226.83\n- Rasmus Højgaard: 1,150.91\n- Justin Rose: 1,019.62\n- Ludvig Åberg: 1,006.83\n- Viktor Hovland: 930.31\n- Matt Wallace: 867.02\n- Matt Fitzpatrick: 787.48\n- Thomas Detry: 780.29\n- Aaron Rai: 711.36\n- Jordan Smith: 692.29"
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/pga/2025/08/12/caddie-ted-scott-absent-scottie-scheffler-bmw-championship-prep/85626776007/",
      "text": "Caddie Ted Scott to miss BMW Championship. Who is filling in for No. 1 Scottie Scheffler?\nOWINGS MILLS, Md. – Scottie Scheffler will be without regular caddie Ted Scott this week for the BMW Championship, the second leg of the FedEx Cup playoffs, Scheffler's agent, Blake Smith, confirmed in a text.\nScott, who has been on the bag for all 17 victories for Scheffler since they began working together in late 2021, skipped the final round of the FedEx St. Jude Championship on Sunday due to a private family matter. Scheffler used Brad Payne, a personal friend and the president of College Golf Fellowship. Payne drove to Memphis from his home in Dallas Saturday night. Scheffler shot 67 and finished T-3, his eighth consecutive top-10 finish.\nGolf Channel's Todd Lewis reported on Sunday that Scott left for his home in Louisiana on Saturday night.\nOn Tuesday, Scheffler was spotted playing a practice round at Caves Valley Golf Club with veteran caddie Michael Cromie on the bag. Cromie typically works for pro Chris Kirk, but Kirk finished 51st in the FedEx Cup season-long standings and, as a result, is out of the FedEx Cup playoffs. Only the top 50 in the field have advanced to the BMW Championship.\nScheffler already has clinched being first in the FedEx Cup point standings even if Rory McIlroy, who is currently second, were to win this week. Scheffler also has locked up the top FedEx Cup bonus at the end of the BMW and secured his spot in the Tour Championship, which no longer has the staggered start this year."
    },
    {
      "url": "https://sportsdata.usatoday.com/golf/pga/schedule",
      "text": "| Date | Tournament | Purse | |\n|---|---|---|---|\n| Aug 14-17 | BMW ChampionshipCaves Valley Golf ClubOwings Mills, MD $20,000,000 | $20,000,000 | |\n| Aug 21-24 | TOUR ChampionshipEast Lake Golf ClubAtlanta, GA - | - | |\n| Sep 11-14 | Procore ChampionshipSilverado Resort and Spa - North CourseNapa, CA $6,000,000 | $6,000,000 | |\n| Sep 26-28 | Ryder CupBethpage State Park - Black CourseFarmingdale, NY - | - | |\n| Oct 2-5 | Sanderson Farms ChampionshipCountry Club of JacksonJackson, MS $6,000,000 | $6,000,000 | |\n| Oct 9-12 | $8,500,000 | $8,500,000 | |\n| Oct 23-26 | Bank of Utah ChampionshipBlack Desert Golf CourseIvins, UT $6,000,000 | $6,000,000 | |\n| Nov 6-9 | World Wide Technology ChampionshipEl Cardonal at DiamanteCabo San Lucas, Mexico $6,000,000 | $6,000,000 | |\n| Nov 13-16 | Butterfield Bermuda ChampionshipPort Royal GCSouthampton, Bermuda $6,000,000 | $6,000,000 | |\n| Nov 20-23 | The RSM ClassicSea Island Golf Club - Seaside CourseSea Island, GA $6,000,000 | $6,000,000 | |\n| Dec 4-7 | Hero World ChallengeAlbanyAlbany, Bahamas $5,000,000 | $5,000,000 |\n| Date | Tournament | Winner | Winnings |\n|---|---|---|---|\n| Jan 2-5 | The SentryPlantation Course at KapaluaKapalua, HI Hideki Matsuyama-35 | $3,600,000 | |\n| Jan 9-12 | Sony Open in HawaiiWaialae Country ClubHonolulu, HI Nick Taylor-16 | Nick Taylor-16 | $1,566,000 |\n| Jan 16-19 | The American ExpressPete Dye Stadium Course PGA West, La Quinta, Jack Nicklaus Tournament Course at PGA WestLa Quinta, CA Sepp Straka-25 | Sepp Straka-25 | $1,584,000 |\n| Jan 22-25 | Farmers Insurance OpenTorrey Pines Golf Club (North), Torrey Pines Golf Club (South)La Jolla, CA Harris English-8 | $1,674,000 | |\n| Jan 30-Feb 2 | AT&T Pebble Beach Pro-AmSpyglass Hill Golf Course, Pebble Beach Golf LinksPebble Beach, CA Rory McIlroy-21 | Rory McIlroy-21 | $3,600,000 |\n| Feb 6-9 | WM Phoenix OpenTPC Scottsdale - Stadium CourseScottsdale, AZ Thomas Detry-24 | Thomas Detry-24 | $1,656,000 |\n| Feb 13-16 | The Genesis InvitationalTorrey Pines Golf Club (South)La Jolla, CA Ludvig Aberg-12 | Ludvig Aberg-12 | $4,000,000 |\n| Feb 20-23 | Mexico Open at VidantaWorldVidantaWorldVallarta, Mexico Brian Campbell-20 | $1,260,000 | |\n| Feb 27-Mar 2 | Cognizant Classic in The Palm BeachesChampion CoursePalm Beach Gardens, FL Joe Highsmith-19 | $1,656,000 | |\n| Mar 6-9 | Puerto Rico OpenGrand Reserve Country ClubRio Grande, Puerto Rico Karl Vilips-26 | Karl Vilips-26 | $720,000 |\n| Mar 6-9 | Arnold Palmer Invitational presented by MastercardArnold Palmer's Bay Hill Club & LodgeOrlando, FL Russell Henley-11 | $4,000,000 | |\n| Mar 13-17 | The Players ChampionshipTPC Sawgrass - THE PLAYERS Stadium CoursePonte Vedra Beach, FL Rory McIlroy-12 | Rory McIlroy-12 | $4,500,000 |\n| Mar 20-23 | Valspar ChampionshipInnisbrook Resort (Copperhead)Palm Harbor, FL Viktor Hovland-11 | $1,566,000 | |\n| Mar 27-30 | Texas Children's Houston OpenMemorial Park Golf CourseHouston, TX Min Woo Lee-20 | Min Woo Lee-20 | $1,710,000 |\n| Apr 3-6 | Valero Texas OpenOaks CourseSan Antonio, TX Brian Harman-9 | $1,710,000 | |\n| Apr 10-13 | Masters TournamentAugusta National Golf ClubAugusta, GA Rory McIlroy-11 | Rory McIlroy-11 | $4,200,000 |\n| Apr 17-20 | Corales Puntacana ChampionshipCoralesPunta Cana, Dominican Republic Garrick Higgo-14 | $720,000 | |\n| Apr 17-20 | RBC HeritageHarbour Town Golf LinksHilton Head Island, SC Justin Thomas-17 | $3,600,000 | |\n| Apr 24-27 | Zurich Classic of New OrleansTPC LouisianaAvondale, LA Novak/Griffin-28 | Novak/Griffin-28 | $1,329,400 |\n| May 1-4 | THE CJ CUP Byron NelsonTPC Craig RanchMcKinney, TX Scottie Scheffler-31 | $1,782,000 | |\n| May 8-10 | ONEflight Myrtle Beach ClassicDunes Golf and Beach ClubMyrtle Beach, SC Ryan Fox-15 | Ryan Fox-15 | $720,000 |\n| May 8-11 | Truist ChampionshipPhiladelphia Cricket Club - Wissahickon Golf CourseMontgomery, PA Sepp Straka-16 | Sepp Straka-16 | $3,600,000 |\n| May 15-18 | PGA ChampionshipQuail Hollow ClubCharlotte, NC Scottie Scheffler-11 | $3,420,000 | |\n| May 22-25 | Charles Schwab ChallengeColonial Country ClubFort Worth, TX Ben Griffin-12 | Ben Griffin-12 | $1,710,000 |\n| May 29-Jun 1 | the Memorial Tournament presented by WorkdayMuirfield Village Golf ClubDublin, OH Scottie Scheffler-10 | $4,000,000 | |\n| Jun 5-8 | RBC Canadian OpenNorth CourseCaledon, ON Ryan Fox-18 | Ryan Fox-18 | $1,764,000 |\n| Jun 12-15 | U.S. OpenOakmont Country ClubOakmont, PA J.J. Spaun-1 | $4,300,000 | |\n| Jun 19-22 | Travelers ChampionshipTPC River HighlandsCromwell, CT Keegan Bradley-15 | $3,600,000 | |\n| Jun 26-29 | Rocket ClassicDetroit Golf ClubDetroit, MI Aldrich Potgieter-22 | $1,728,000 | |\n| Jul 3-6 | John Deere ClassicTPC Deere RunSilvis, IL Brian Campbell-18 | $1,512,000 | |\n| Jul 10-13 | Genesis Scottish OpenThe Renaissance ClubNorth Berwick, Scotland Chris Gotterup-15 | $1,575,000 | |\n| Jul 10-13 | ISCO Championship Hurstbourne Country Club - Championship CourseLouisville, KY William Mouw-10 | William Mouw-10 | $720,000 |\n| Jul 17-20 | The Open ChampionshipRoyal Portrush Golf ClubPortrush, Northern Ireland Scottie Scheffler-17 | $3,100,000 | |\n| Jul 17-20 | Barracuda ChampionshipOld GreenwoodTruckee, CA Ryan Gerard47 | Ryan Gerard+47 | $720,000 |\n| Jul 24-27 | 3M OpenTPC Twin CitiesBlaine, MN Kurt Kitayama-23 | $1,512,000 | |\n| Jul 31-Aug 3 | Wyndham ChampionshipSedgefield Country ClubGreensboro, NC Cameron Young-22 | $1,476,000 | |\n| Aug 7-10 | FedEx St. Jude ChampionshipTPC SouthwindMemphis, TN Justin Rose-16 | Justin Rose-16 | $3,600,000 |\nGannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/2025/08/11/fedex-cup-standings-points-bmw-championship-playoff/85607878007/",
      "text": "FedEx Cup standings 2025: PGA Tour rankings after first playoff event\n- The top 30 in FedEx Cup points after the BMW Championship will advance.\n- Justin Rose won the FedEx St. Jude Championship in a playoff against J.J. Spaun.\n- Scottie Scheffler leads the FedEx Cup standings, followed by Rory McIlroy who skipped the St. Jude Championship.\nThe first FedEx Cup playoff event of 2025 is in the books and Justin Rose came away with a thrilling win at the FedEx St. Jude Championship that needed its own playoff to be completed. Rose surged past Tommy Fleetwood down the stretch of the back nine in regulation and then outlasted U.S. Open champion J.J. Spaun to emerge with the trophy.\nThe event in Memphis, Tennessee also served as a cut down for the BMW Championship in Owings Mills, Maryland beginning on Thursday, Aug. 14, which serves as the second playoff event before the Tour Championship in East Lake, Georgia. The top 50 in the FedEx Cup points standings after the conclusion of the FedEx St. Jude Championship qualified to play in the BMW Championship.\nOnly the top 30 in FedEx Cup points after the BMW Championship will play in the Tour Championship, which starts Aug. 21. The player with the lowest stroke total over 72 holes at the Tour Championship will win the FedExCup and earn a bonus of $10 million. Scottie Scheffler still holds a commanding lead, and Rory McIlroy – even though he chose to skip the St. Jude Championship – remains second in points this year.\nHere's a look at the current FedEx Cup standings heading into the PGA Tour's second playoff event at the BMW Championship in Owings Mills, Maryland:\nFedEx Cup playoff standings\nNote: These standings reflect results through the 2025 FedEx St. Jude Championship in Memphis, Tennessee.\n- Scottie Scheffler: 5,456 points\n- Rory McIlroy: 3,444 points\n- J.J. Spaun: 3,344 points\n- Justin Rose: 3,220 points\n- Sepp Straka: 2,783 points\n- Russell Henley: 2,579 points\n- Ben Griffin: 2,555 points\n- Tommy Fleetwood: 2,433 points\n- Justin Thomas: 2,395 points\n- Harris English: 2,269 points\n- Andrew Novak: 1,991 points\n- Cameron Young: 1,904 points\n- Ludvig Åberg: 1,839 points\n- Keegan Bradley: 1,792 points\n- Maverick McNealy: 1,787 points\n- Corey Conners: 1,651 points\n- Collin Morikawa: 1,573 points\n- Brian Harman: 1,559 points\n- Patrick Cantlay: 1,555 points\n- Robert MacIntyre: 1,550 points"
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/2025/08/04/rory-mcilroy-fedex-st-jude-championship-playoffs-field/85510766007/",
      "text": "Is Rory McIlroy playing this week to start PGA Tour's FedEx Cup playoffs?\nRory McIlroy found a loophole in the PGA Tour's FedEx Cup playoffs, and it has become an awkward subplot this week when golf's version of the postseason begins at the 2025 FedEx St. Jude Championship in Memphis.\nThe 2025 Masters champion said months ago he wanted to play less in 2025, and even hinted at the unorthodox move he might make to follow through on that promise.\n\"I’ll probably not play the first playoff event in Memphis,\" McIlroy told The Telegraph in November 2024. \"I mean, I finished basically dead last there this year (tied for 68th in a 70-man field) and only moved down one spot in the playoff standings.”\nMcIlroy has appeared in just 14 PGA Tour events this year after playing in 19 tournaments in 2024, but still ranks No. 2 behind Scottie Scheffler in the FedEx Cup standings. Since he began playing extensively on the PGA Tour in 2009, McIlroy has averaged 16 events per year. So did he follow through on his decision to not start the FedEx Cup playoffs in Memphis?\nHere's the latest on McIlroy's status heading into the FedEx Cup playoffs and the 2025 FedEx St. Jude Championship:\nIs Rory McIlroy playing at FedEx St. Jude Championship?\nNo. McIlroy was not included on the official field list for the 2025 FedEx St. Jude Championship, beginning Thursday, Aug. 7 at TPC Southwind in Memphis.\nHis decision to skip the tournament means the field will be set at 69 golfers instead of 70. The top 50 golfers advance to the next round of the FedEx Cup playoffs at the BMW Championships in Owings Mills, Maryland on Aug 14-17.\nThe PGA Tour also eliminated the stroke advantage for the Tour Championship that concludes its FedEx Cup playoffs this year. Instead of giving golfers with the most FedEx Cup points an advantage in the Tour Championship, all golfers will start from even par. In the past, the stroke advantage had made the first two FedEx Cup events more important because they helped determine starting position at East Lake.\nWhy is Rory McIlroy not playing?\nIn September, when McIlroy initially told reporters he wanted to decrease his playing schedule, he noted that he \"hit a wall\" during the 2024 season. He wound up skipping notable PGA Tour events like The Sentry, the RBC Heritage and Jack Nicklaus’ Memorial Tournament this season.\n\"It's been a long season, and I'm going to just have to think about trying to build in a few extra breaks here and there next year and going forward because I felt like I hit a bit of a wall sort of post-U.S. Open, and still feel a little bit of that hangover,\" McIlroy said last September.\nHe noted at the time that he planned to play 18 to 20 tournaments in 2025. By November, McIlroy had pinpointed the first playoff event in Memphis as one of those additional breaks. He also leads third-place Sepp Straka by more than 800 points in the FedEx Cup standings and already clinched a spot in the BMW Championship next week.\nContributing: Jonah Dylan, Memphis Commercial Appeal"
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/pga/2025/08/10/2025-fedex-st-jude-championship-justin-rose-beats-jj-spaun-playoff/85602794007/",
      "text": "Justin Rose goes on birdie binge, wins FedEx St. Jude Championship in playoff over J.J. Spaun\nJustin Rose believes in the Law of Large Numbers.\nIt is a principle of probability and statistics that as the average of the sample size grows, the average of the sample results will tend to get closer to the expected results. In Rose’s case, he couldn’t buy a putt through the first 12 holes of the final round but he trusted that if he stuck to his routine things would turn in his favor.\n“I was just kind of waiting, playing a waiting game before the hole opened up and I was able to see some putts fall,” he said. “Fortunately they began to fall at the right time.”\nIndeed, they did. Rose birdied four holes in a row in regulation starting at 14 to rally from three back with five holes to go and won with an 11-foot birdie putt on the third playoff hole to beat J.J. Spaun and collect his 12th PGA Tour title at the FedEx St. Jude Championship in Memphis.\n\"The last five holes, I played some of my best golf, and I kind of felt like I pulled it together when I really had to,\" he said.\nOn Sunday, the 45-year-old Englishman shot a final-round 3-under 67 at TPC Southwind and became the oldest Tour winner since Phil Mickelson at the 2021 PGA Championship. Rose also won for the first time on Tour since the 2023 AT&T Pebble Beach Pro-Am.\n“I feel like when I play my best golf, I'm able to compete with the best players in the world, and obviously today proved that I can win against the best players in the world,” Rose said.\nAt the start of the week, Rose didn’t see the stars aligning on his behalf. On Monday night, he started feeling under the weather, what he dubbed “the man flu,” and skipped a practice round on Tuesday, electing to walk a handful of holes instead. “By the time I did that, I was like, just get me to the car,” he said. “I was hoping to sleep it off. Woke up Wednesday morning kind of even worse. My resting heart rate was like 80, and it's normally mid 50s.”\nHe withdrew from Wednesday’s pro-am but fired 64 on Thursday to join the trophy chase and a birdie at the last on Saturday moved him into the final pairing, a stroke behind Tommy Fleetwood, the 54-hole leader.\nSunday’s final round didn’t get off to a rosy start for Rose, who bogeyed the first hole and hit into the water for the second straight day at the ninth for another dropped shot. He made his third and final bogey of the day at No. 12 and stood 1-over for the day. Arriving at the tee of the par-3 14th hole, he knew his chances of winning were bleak, but he took dead aim. “I knew I had just to give it everything,” he said.\nHe stuck a hold 6-iron 15 feet from the back-right pin and rolled in the putt for birdie, one of only two on the hole all day. That’s when the Law of Numbers took over and he proceeded to one-putt the next three holes, including at 17 from 22 feet to tie for the lead.\nUntil the final hour, it looked like a different Englishman would claim the title. Fleetwood struggled just as badly early, making a shaky bogey at the first and didn’t make a birdie until the 12th hole, pouring in a 33-foot putt. But then he made it two birdies in a row, sinking a 15-footer at 13. He regained the lead at 15 under and tacked on another birdie after wedging to 6 feet at 15. But he missed the green at 17, pitched to 7 feet and knew immediately that his par putt didn’t have a chance, missing to the right. It’s more heartache for Fleetwood, who has won seven times on the DP World Tour but winning on the PGA Tour has proved elusive in 162 career starts. He has endured six runner-up finishes, most recently at the Travelers Championship in June when he squandered a two-stroke lead with four holes to go. Fleetwood also finished second in the Olympics last year to Scheffler and settled for silver.\n“I’m getting close. That’s the good side of it,\" he said. \"I’m obviously disappointed, but when you look at the positives, I was right there with a chance. It’s hard to win. I just didn’t get it done.”\nHe settled for third, tying with Scheffler, the world No. 1 who was playing without regular caddie Ted Scott, who left to deal with a family matter. Scheffler tied for the lead early but made a costly bogey at 15 to fall two back. He shot 67 but had one of those days where he kept hitting the lip of the cup.\n“I did enough to have a really good round. Just putts weren't falling today for some reason,” he said.\nInstead, it was Spaun, who played alongside Scheffler, who surged into the lead at No. 9 with his fourth birdie of the day, and poured in back-to-back birdies at Nos. 16 and 17 to tie Fleetwood at the time at 16-under. The U.S. Open winner in June shot a pair of 65s on the weekend. Rose missed a 13-foot birdie putt for the win in regulation to give Spaun new life and set up three more holes of excitement. Both players had lost to Rory McIlroy in a playoff this season: Spaun at the Players Championship and Rose at the Masters. Afterwards, Rose mused that had things gone differently, the pain of losing another playoff may have been too much to bear. “It would have doubled down on the frustration maybe of Augusta,” he said.\nOn the first playoff hole, both competitors burned the cup but couldn’t get putts to drop. One hole later, Spaun poured in a 30-foot birdie putt and Rose answered from 7 feet. For the third playoff hole, Tour officials cut a new hole location. Both players went flag hunting with Rose flying his approach 11 feet past the hole and Spaun sticking his to 7 feet. Rose converted his sixth birdie in his last eight holes and tournament-best 26th for the week but Spaun failed to answer and the Englishman was a winner again.\n\"It sucks to miss a seven-footer, but tricky read and pulled it a little bit,\" Spaun said. \"I hung in there the best I could, and he beat me to the hole first. Just wasn't meant to be.\"\nIt meant everything to Rose, who locked up a spot on the European Ryder Cup team and secured a return to East Lake for the Tour Championship for the first time since 2019.\n“That's been bugging me, and that's obviously been a huge goal,” he said.\nHe’s flirted with winning majors last summer at Royal Troon, eventually tying for second at the British Open, and shot a memorable final-round 66 at the Masters in April only to get pipped in a sudden-death playoff at Augusta National for a second time. His victory in Memphis proved that his hard work to stay competitive – he’ll return to the top 10 in the Official World Golf Ranking for the first time in five years – at an age when most players are trying to hang on until they are eligible for PGA Tour Champions hasn’t been in vain. Rose isn’t sure if he’ll ever get back to world No. 1 again but there’s enough gas in the tank still to do something special.\n“I still feel like there is that golden summer of my career available to me,” he said. “That's what I've been pushing for.”"
    },
    {
      "url": "https://sportsdata.usatoday.com/golf/pga/players/scottie-scheffler/826546",
      "text": "Gannett may earn revenue from sports betting operators for audience referrals to betting services. Sports betting operators have no influence over nor are any such revenues in any way dependent on or linked to the newsrooms or news coverage. Terms apply, see operator site for Terms and Conditions. If you or someone you know has a gambling problem, help is available. Call the National Council on Problem Gambling 24/7 at 1-800-GAMBLER (NJ, OH), 1-800-522-4700 (CO), 1-800-BETS-OFF (IA), 1-800-9-WITH-IT (IN). Must be 21 or older to gamble. Sports betting and gambling are not legal in all locations. Be sure to comply with laws applicable where you reside.\nGambling involves risk. Please only gamble with funds that you can comfortably afford to lose. While we do our upmost to offer good advice and information we cannot be held responsible for any loss that maybe be incurred as a result of gambling. We do our best to make sure all the information that we provide on this site is correct. However from time to time mistakes will be made and we will not be held liable. Please check any stats or information if you are unsure how accurate they are. No guarantees are made with regards to results or financial gain. All forms of betting carry financial risk and it is down to the individual to make bets with or without the assistance of information provided on this site and we cannot be held responsible for any loss that maybe be incurred as a result of following the betting tips provided on this site. Past performances do not guarantee success in the future and betting odds fluctuate from one minute to the next. The material contained on this site is intended to inform, entertain and educate the reader and in no way represents an inducement to gamble legally or illegally. Betting is illegal in some countries, or areas of countries. It is the sole responsibility of the user to act in accordance with their local laws."
    },
    {
      "url": "https://www.usatoday.com/story/sports/golf/ryder-cup/2025/08/11/u-s-ryder-cup-team-j-j-spaun-xander-schauffele-qualify/85608214007/",
      "text": "J.J. Spaun, Xander Schauffele have now qualified for the U.S. Ryder Cup team. Who's left?\nThe Ryder Cup is just a half-dozen weeks away, and the home side is starting to take shape.\nAfter a runner-up finish in the FedEx St. Jude Championship, where he lost in a playoff, J.J. Spaun became an automatic qualifier for the U.S. side, an unlikely rise after starting the 2025 season outside the Official World Golf Ranking top 100. He's now up to No. 6.\nAlso, Xander Schauffele — who has made 70 straight cuts on the PGA Tour, the sixth-longest streak ever — has mathematically secured his spot on the team, meaning half of the six automatic slots have been filled. Scottie Scheffler locked up his position on Captain Keegan Bradley's side a while back.\nThe 2025 Ryder Cup at Bethpage Black in New York is just 46 days away. Team USA will be looking to recapture the Ryder Cup after the Europeans dominated Rome in 2023. The Europeans will be captained by Luke Donald in this year's edition.\nBradley has a big decision to make after his recent win at the Travelers Championship: Does he play, does he stay as captain, or both? Jordan Spieth jokingly said he hopes Bradley doesn't play, leaving an extra spot up for grabs.\nThe competition will be contested at Bethpage Black, a creation of legendary architect A.W. Tillinghast, which has been a part of golf history since its opening in 1936. Nestled in suburban Long Island, Bethpage State Park features five 18-hole regulation golf courses, including the esteemed Black Course.\nIt will be the first time the Ryder Cup graces its greens, but the course has previously hosted the U.S. Open in 2002 and 2009. The 2019 PGA Championship was also held at Bethpage Black, with Brooks Koepka emerging as the tournament champion."
    }
  ],
  "argos_summary": "Scottie Scheffler and Rory McIlroy, the top two players in golf, will play together at the 2025 BMW Championship, the second event of the PGA Tour's FedEx Cup Playoffs. Scheffler, who recently won the PGA and Open Championships, is the tournament favorite, while McIlroy returns after skipping the first playoff event. The BMW Championship will feature other notable pairings, including Justin Rose and J.J. Spaun, as players vie for points to qualify for the Ryder Cup and the Tour Championship.",
  "argos_id": "726GJOL4F"
}