{
  "url": "https://www.nasdaq.com/articles/prokidney-reports-78-percent-gain-q2",
  "authorsByline": "The Motley Fool",
  "articleId": "943d2fe64b304076acbd499e24cfae65",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:04:25+00:00",
  "addDate": "2025-08-13T02:38:31.310292+00:00",
  "refreshDate": "2025-08-13T02:38:31.310295+00:00",
  "score": 1.0,
  "title": "ProKidney Reports 78 Percent Gain in Q2",
  "description": "Key PointsThe Phase 2 REGEN-007 trial for rilparencel demonstrated a 78% reduction in the annual decline of kidney function (eGFR slope), according to topline results reported in July 2025; no serious safety issues reported.",
  "content": "Key Points\n• None The Phase 2 REGEN-007 trial for rilparencel demonstrated a 78% reduction in the annual decline of kidney function (eGFR slope), according to topline results reported in July 2025; no serious safety issues reported.\n• None The cash runway is projected to extend into mid-2027, aligning with the expected Phase 3 topline readout, based on cash, cash equivalents, and marketable securities as of June 30, 2025, but revenue remains minimal.\n• These 10 stocks could mint the next wave of millionaires ›\n\nProKidney (NASDAQ:PROK), a biopharmaceutical company developing cell therapies for chronic kidney disease (CKD), released its second quarter results on August 12, 2025. The main focus of the release was encouraging clinical updates for its lead product rilparencel, especially from the Phase 2 REGEN-007 study, and a regulatory milestone with the U.S. Food and Drug Administration (FDA) accepting eGFR slope as an accelerated approval endpoint. The company reported a net loss per share of $0.13 (GAAP) for the quarter. This was better than the $0.14 loss anticipated. Revenue (GAAP) was $221,000, an unexpected result, though still minimal and not core to operations. Overall, the quarter showed prudent cost management, ongoing R&D investment, and operational execution, supported by a solid liquidity position.\n\nAbout the Business and Strategic Priorities\n\nProKidney develops autologous cell therapies designed to slow or halt disease progression for patients with chronic kidney disease, especially those with diabetes-driven CKD. Its core approach centers on rilparencel, a therapy that uses cells from a patient’s own kidney tissue to help preserve kidney function.\n\nIn recent years, the business has prioritized moving rilparencel through large late-stage clinical trials. ProKidney’s success depends on demonstrating meaningful effectiveness and safety in humans, achieving timely regulatory approval, and scaling manufacturing to meet future demand if the product is approved. Its robust intellectual property portfolio and facility in North Carolina underpin its development efforts.\n\nQuarterly Highlights: Clinical, Regulatory, and Financial Developments\n\nClinical trial progress for rilparencel stood out as the most notable aspect of the quarter. In the Phase 2 REGEN-007 trial, patients who received rilparencel experienced a 78% reduction in the annual decline of estimated glomerular filtration rate (eGFR), a key marker for kidney function, based on topline results announced in July 2025. Specifically, the rate of decline improved from -5.8 to -1.3 mL/min/1.73m² following treatment in Group 1 of the Phase 2 REGEN-007 study, according to July 2025 topline results. No serious safety concerns related to rilparencel were reported among the 49 patients who received at least one injection. Although these results are promising, the relatively small sample size means that conclusions must await results from ongoing larger trials.\n\nAnother important development was regulatory. The FDA confirmed at a July 2025 meeting that eGFR slope could be used as a surrogate endpoint for accelerated approval of rilparencel, a significant de-risking step for its regulatory pathway. The agency also stated that a treatment effect size of at least 1.5 mL/min/1.73m² per year versus controls would be considered meaningful, as confirmed by the FDA in a July 2025 Type B meeting regarding the accelerated approval pathway for rilparencel. Over half the patients required for analysis in the Phase 3 PROACT 1 trial had enrolled as of the quarter, with topline data expected around Q2 2027.\n\nFinancial results reflected ProKidney’s development-stage focus. Research and development (R&D) expenses declined approximately 11.9% year-over-year as some earlier-phase trials finished and resources shifted to the main Phase 3 study, although overall investment in research remains significant. General and administrative expenses rose 2.2%, primarily driven by increases in cash compensation and other operational expenses. Revenue (GAAP) for the quarter, at $221,000, was higher than expected as analysts had forecast no incoming revenue.\n\nOn the balance sheet, ProKidney reported $294.7 million in cash, cash equivalents, and marketable securities as of the quarter. This is a decrease from $328.5 million as of March 31, 2025, reflecting operational spending. Management expects this liquidity to last into mid-2027, a timeline that aligns with completion of its pivotal trial. The company also completed a corporate “domestication” to Delaware during the quarter.\n\nThe company’s lead program, rilparencel, is an autologous cell therapy designed for advanced CKD patients. It is intended for patients with advanced CKD, primarily due to diabetes. By using a sample of the patient’s own kidney tissue, cells are isolated and expanded before being reintroduced in order to help preserve function and delay dialysis. The bulk of clinical and regulatory milestones in this quarter centered on this therapy.\n\nThe addressable market for rilparencel in the United States could include up to two million adults with stage 3b or 4 CKD and diabetes. The company operates in a crowded field, with other treatment options such as sodium-glucose cotransporter-2 inhibitors (SGLT2s), mineralocorticoid receptor antagonists (MRAs), and other advanced therapies. The ability of rilparencel to significantly stabilize or improve eGFR is critical to its future uptake. The evidence from ongoing trials, especially the upcoming Phase 3 data, will be watched closely given the high unmet need for therapies that can delay the need for dialysis.\n\nProKidney’s management did not provide specific forward financial guidance for the remainder of 2025. It did, however, state that existing resources should support operations well into mid-2027, which is when topline results from the pivotal Phase 3 study are expected. No guidance around possible commercialization timelines or revenue growth was provided.\n\nInvestors may wish to monitor multiple areas over the coming quarters: progress on patient enrollment for Phase 3, broader presentation and peer-review of clinical data from the Phase 2 study at ASN Kidney Week later in the year, and any developments related to manufacturing readiness or strategic collaborations. PROK does not currently pay a dividend.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,060%* — a market-crushing outperformance compared to 182% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=f16b19de-0986-476e-8405-a323e50cf756&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=19caed49-57db-45da-a4b3-c076931cf736&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=f4e2d52e-c75d-40ff-a0b3-068ae17be303",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=19caed49-57db-45da-a4b3-c076931cf736&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=f4e2d52e-c75d-40ff-a0b3-068ae17be303"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "rilparencel",
      "weight": 0.06449823
    },
    {
      "name": "topline results",
      "weight": 0.06347632
    },
    {
      "name": "Clinical trial progress",
      "weight": 0.06297605
    },
    {
      "name": "Phase",
      "weight": 0.0606071
    },
    {
      "name": "advanced CKD patients",
      "weight": 0.058847554
    },
    {
      "name": "autologous cell therapies",
      "weight": 0.057922997
    },
    {
      "name": "ongoing larger trials",
      "weight": 0.057251718
    },
    {
      "name": "Financial results",
      "weight": 0.056929704
    },
    {
      "name": "ongoing trials",
      "weight": 0.05685266
    },
    {
      "name": "cell therapies",
      "weight": 0.056728467
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94384765625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91162109375
    },
    {
      "name": "/News/Health News",
      "score": 0.43994140625
    },
    {
      "name": "/Health/Health Foundations & Medical Research",
      "score": 0.398193359375
    },
    {
      "name": "/Health/Pharmacy/Drugs & Medications",
      "score": 0.382568359375
    }
  ],
  "sentiment": {
    "positive": 0.66716284,
    "negative": 0.067360945,
    "neutral": 0.26547623
  },
  "summary": "ProKidney (NASDAQ:PROK) is developing cell therapies for chronic kidney disease (CKD), with a 78% reduction in the annual decline of kidney function (eGFR slope), according to topline results. The company's lead product, rilparencel, demonstrated this, and a regulatory milestone with the U.S. Food and Drug Administration (FDA) accepting eGFR slum as an accelerated approval endpoint. Despite these promising results, no serious safety concerns were reported among 49 patients who received at least one injection. Despite this, ProKidney's financial results were largely overlooked due to the small sample size and ongoing trials. The firm's cash runway is projected to extend into mid-2027, aligning with the expected Phase 3 toplined readout of its product.",
  "shortSummary": "ProKidney reported a 78% rise in Q2 profits to $1.13, driven by clinical updates and regulatory milestones for rilparencel, its main product.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "04389e3eced945cdab0f0a6e96a4b3a5",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "ProKidney reported promising results from its Phase 2 REGEN-007 trial for rilparencel, showing a 78% reduction in the decline of kidney function, with no serious safety issues noted. The company has a cash runway projected to last into mid-2027, aligning with the anticipated Phase 3 trial results, while revenue remains minimal at $221,000. The FDA has accepted eGFR slope as a surrogate endpoint for accelerated approval, marking a significant regulatory milestone for the therapy aimed at chronic kidney disease patients.",
  "argos_id": "75PKYBQKX"
}