{
  "url": "https://www.washingtontimes.com/news/2025/aug/12/deal-trump-administration-mexico-transfers-26-cartel-figures-wanted/",
  "authorsByline": "Alanna Durkin Richer and María Verza, Alanna Durkin Richer, María Verza, The Washington Times https://www.washingtontimes.com",
  "articleId": "ac9e4b95c8cf4c25bacbcd28f6b88a24",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/12/Justice_Department_Cartels_88448_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T00:35:22+00:00",
  "addDate": "2025-08-13T00:46:48.498081+00:00",
  "refreshDate": "2025-08-13T00:46:48.498083+00:00",
  "score": 1.0,
  "title": "Mexico transfers 26 cartel figures wanted by U.S. authorities in deal with Trump administration",
  "description": "Mexico sent 26 high-ranking cartel figures to the United States Tuesday in the latest major deal with the Trump administration as American authorities ratchet up pressure on criminal networks smuggling drugs across the border.",
  "content": "WASHINGTON — Mexico sent 26 high-ranking cartel figures to the United States Tuesday in the latest major deal with the Trump administration as American authorities ratchet up pressure on criminal networks smuggling drugs across the border.\n\nThose being handed over to U.S. custody include Abigael González Valencia, a leader of “Los Cuinis,” a group closely aligned with notorious cartel Jalisco New Generation or CJNG, a person familiar with the matter told The Associated Press. Another person, Roberto Salazar, is wanted in connection to the 2008 killing of a Los Angeles County sheriff’s deputy, the person said. Other defendants have ties to the Sinaloa Cartel, the Los Zetas cartel and other violent drug trafficking groups.\n\nThey were being flown to American soil after the Justice Department agreed not to seek the death penalty against any of the defendants or against any cartel leaders and members transferred to the U.S. in February, the person said. The person spoke to the AP on the condition of anonymity because they were not authorized to discuss an operation that was still ongoing.\n\nMexico’s Attorney General’s Office and Security ministry confirmed that 26 defendants were transferred but didn’t identify them. Mexican security officials had planned a news conference for Wednesday.\n\nIt’s the second time in months Mexico has expelled cartel figures accused of narcotics smuggling, murder and other crimes amid mounting pressure from the Trump administration to curb the flow of drugs across the border. In February, Mexico handed over to American authorities 29 cartel figures, including drug lord Rafael Caro Quintero, who was behind the killing of a U.S. DEA agent in 1985.\n\nThe February transfers came days before 25% tariffs on Mexican imports were to take effect. Late last month, President Donald Trump spoke with Mexico President Claudia Sheinbaum and agreed to put off threatened 30% tariffs for another 90 days to allow for negotiations.\n\nSheinbaum has shown a willingness to cooperate more on security than her predecessor, specifically being more aggressive in pursuit of Mexico’s cartels. But she has drawn a clear line when it comes to Mexico’s sovereignty, rejecting suggestions by Trump and others of intervention by the U.S. military.\n\nThe Trump administration made dismantling dangerous drug cartels a key priority, designating CJNG and seven other Latin American organized crime groups foreign terrorist organizations. Since the new designations in February, the Trump administration has begun bringing terror charges in some cartel related cases.\n\nAbigael González Valencia is the brother-in-law of CJNG leader Nemesio Rubén “El Mencho” Oseguera Cervantes, a top target of the U.S. government. Abigael González Valencia was arrested in February 2015 in Puerto Vallarta, Jalisco and had been fighting extradition to the United States since then. The U.S. government has offered a reward of up to $15 million for information leading to “El Mencho’s” arrest or conviction.\n\nAlongside his two brothers, Abigael González Valencia led “Los Cuinis,” which financed the the founding and growth of the CJNG, one of the most powerful and dangerous cartels in Mexico. CJNG traffics hundreds of tons of cocaine, methamphetamine, and fentanyl into the United States and other countries and is known for extreme violence, murders, torture, and corruption.\n\nOne of his brothers, José González Valencia, was sentenced in Washington’s federal court in June to 30 years in a U.S. prison after pleading guilty to international cocaine trafficking. Jose González Valencia was arrested in 2017 under the first Trump administration at a beach resort in Brazil while vacationing with his family under a fake name.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cartel figures",
      "weight": 0.08780529
    },
    {
      "name": "dangerous drug cartels",
      "weight": 0.08714333
    },
    {
      "name": "Trump administration",
      "weight": 0.08529487
    },
    {
      "name": "Abigael González Valencia",
      "weight": 0.077045225
    },
    {
      "name": "U.S. authorities",
      "weight": 0.07459617
    },
    {
      "name": "notorious cartel Jalisco New Generation",
      "weight": 0.07454121
    },
    {
      "name": "other violent drug trafficking groups",
      "weight": 0.0732775
    },
    {
      "name": "José González Valencia",
      "weight": 0.071789324
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0717733
    },
    {
      "name": "Jose González Valencia",
      "weight": 0.07116213
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.97509765625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.947265625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.89111328125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.666015625
    },
    {
      "name": "/News/Other",
      "score": 0.420654296875
    }
  ],
  "sentiment": {
    "positive": 0.05555388,
    "negative": 0.6864363,
    "neutral": 0.25800985
  },
  "summary": "Mexico has transferred 26 high-ranking cartel figures from Mexico to the United States in a deal with the Trump administration, part of a larger effort to clamp down on drug smuggling across the border. The individuals being transferred include Abigael González Valencia, a leader of \"Los Cuinis,\" a group closely aligned with the cartel Jalisco New Generation (CJNG). Another person, Roberto Salazar, is wanted in connection to the 2008 killing of a Los Angeles County sheriff’s deputy. The Justice Department has agreed not to seek the death penalty against any of the defendants or any cartel leaders transferred to the U.S. This is the second time Mexico has expelled cartel figures in recent months due to pressure from the Trump Administration to reduce the flow of drugs across the U., following 29 cartel figures handed over to American authorities in February. The Trump administration has designated CJNG and seven other Latin American organized crime groups as foreign terrorist organizations.",
  "shortSummary": "Mexico has transferred 26 cartel figures, including Abigael González Valencia, to the United States under a deal with the Trump administration to curb drug smuggling.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6344f00dd2aa4d8697b6a4640e1cdeb3",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Mexico has extradited 26 high-ranking cartel figures to the U.S., including Abigael González Valencia, a leader of the 'Los Cuinis' cartel, as part of ongoing efforts to combat drug trafficking. This transfer follows a previous handover of 29 cartel members in February, amid pressure from the Trump administration to curb drug smuggling. The U.S. has designated several Mexican cartels as foreign terrorist organizations and has offered substantial rewards for key cartel leaders, including González Valencia's brother-in-law, Nemesio Rubén 'El Mencho' Oseguera Cervantes.",
  "argos_id": "7APIG5NA7"
}