{
  "url": "https://www.usatoday.com/story/business/2025/08/12/goodyear-q2-earnings-miss-targets-widely-as-tariffs-inflation-pile-on/85615009007/",
  "authorsByline": "Patrick Williams",
  "articleId": "00965cc78f824034aec7606a1379d41d",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/-mm-/eaf853d38bee5249e8278a0cc6e40e5e03b7fedd/c=0-514-4659-3135/local/-/media/2020/08/23/Akron/ghows-OH-200829551-f0bb999c.jpg?width=3200&height=1801&fit=crop&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:42:11+00:00",
  "addDate": "2025-08-12T19:12:21.803902+00:00",
  "refreshDate": "2025-08-12T19:12:21.803905+00:00",
  "score": 1.0,
  "title": "Goodyear struggles with tariff impacts, sees layoffs continuing",
  "description": "Goodyear announced that its financial results for the second quarter of 2025 didn't meet its expectations, citing tariffs and inflation as factors.",
  "content": "• Goodyear announced that its financial results for the second quarter of 2025 didn't meet its expectations, citing tariffs and inflation as factors.\n• The Akron-based company tentatively plans to make changes in its supply chain to reduce tariff impacts and is encouraging trade partners to participate in the United-States-Mexico-Canada Agreement.\n• Goodyear is continuing with planned layoffs. The company laid off about 80 employees in its Americas and Corporate divisions months ago, and most of those positions were based in Akron.\n\nThe Goodyear Tire & Rubber Co. has told federal regulators it expects to initiate at least 1,800 layoffs in 2025 as it wrestles with rising tariffs and the effects of inflation.\n\nAbout 750 of these cuts were initiated in the first half of the year, filings with the Securities and Exchange Commission show — including 80 or fewer positions based at its Akron headquarters, a Goodyear spokesperson confirmed Aug. 11. The layoffs also include roughly 900 employed and contracted jobs in South Africa.\n\nThe company said during an Aug. 8 earnings call that its second-quarter results did not meet expectations. Goodyear reported an adjusted net loss of $48 million for the quarter ending June 30, down year-over-year from $48 million in adjusted net income for the second quarter of 2024.\n\nThe company's reported loss per share of 17 cents for the second quarter of 2025 was 54 cents below the Zacks Consensus Estimate of a 37-cent-per-share gain.\n\nThe stock has taken a hit since the quarterly earnings were announced Aug. 7 after the close of trading. As of 2:20 p.m. Aug. 12, its value had dropped $1.85 or nearly 18% over the last five days to $8.40.\n\nGoodyear's annualized tariff costs equate to about $350 million, Christina Zamarro, the company's executive vice president and chief financial officer, said on an earnings call on Aug. 8.\n\nThat's $50 million above the estimated $300 million in annualized tariff costs that Goodyear reported in May, when it announced results for the first quarter of 2025.\n\nFor the third quarter, Zamarro said, \"Inflation, tariffs and other costs are expected to be a headwind of approximately $180 million, reflecting higher costs given U.S. tariffs impacts and a global inflation rate of about 3%. This amount captures above-average increases in freight rates and transitory manufacturing costs associated with announced facility closures. We expect this amount to increase in the fourth quarter.\"\n\nGoodyear raised prices in the U.S. and Canada due to tariffs, company President and CEO Mark Stewart said on the call.\n\nZamarro said Goodyear will likely \"will make adjustments to our supply chain\" to reduce the risk of tariffs on the company's profit and loss statement for the remainder of 2024.\n\nGoodyear has talked with multiple partners in the supply chain about participating in more trade involving the United States, Mexico and Canada under the United States-Mexico-Canada Agreement, Stewart said.\n\nShippers of goods between the three North American countries can claim \"preferential treatment\" under the trade agreement, which was passed during President Donald Trump's first term, depending on how much of those goods were produced in the countries from which they are exported, according to Canada's Trade Commissioner Service.\n\nAside from the 1,800 layoffs initiated in 2025, Goodyear also ended the employment of about 700 employees in the first half of 2025 \"under plans initiated in prior years,\" the filing said.\n\nGoodyear also approved a plan in the second quarter to close a manufacturing facility in Kariega, South Africa, which includes the planned elimination of 900 employed and contracted positions, according to the SEC filing.\n\n\"Approximately 2,700 associates remain to be released under all ongoing rationalization plans,\" the filing said.\n\nThe 2,700 number includes layoffs at the South Africa facility and layoffs at a plant in Danville, Virginia, that the company announced in January, the Goodyear spokesperson said.\n\nGoodyear has about 68,000 employees, including roughly 2,500 at its Akron headquarters, the spokesperson said.\n\nPatrick Williams covers growth and development for the Akron Beacon Journal. He can be reached by email at pwilliams@gannett.com or on X, formerly known as Twitter, @pwilliamsOH. Sign up for the Beacon Journal's business and consumer newsletter, \"What's The Deal?\"",
  "medium": "Article",
  "links": [
    "https://www.zacks.com/stock/news/2697918/goodyear-q2-earnings-miss-expectations-revenues-decline-yy#:~:text=Goodyear%20Tire%20(%20GT%20Quick%20Quote,the%20year%2Dago%20period's%20levels.",
    "https://www.usatoday.com/story/business/2025/02/20/goodyear-separating-with-about-850-employees-contractors-at-danville-virginia-plant/79218269007/",
    "https://corporate.goodyear.com/us/en",
    "https://www.usatoday.com/story/news/local/2025/04/23/goodyear-raise-tire-prices-in-us-canada-effective-may-1/83227755007/",
    "https://goodyear.gcs-web.com/static-files/67e74d4f-08c0-4918-b761-15dfc3f70ebe",
    "https://www.tradecommissioner.gc.ca/en/market-industry-info/search-country-region/country/canada-united-states-export/us-tariffs/understanding-cusma-compliance.html",
    "https://profile.beaconjournal.com/newsletters/whats-the-deal/",
    "https://www.usatoday.com/story/business/2025/05/08/goodyear-reports-1q-earnings-fell-as-costs-grew-for-tiremaker/83511292007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "annualized tariff costs",
      "weight": 0.08300586
    },
    {
      "name": "U.S. tariffs impacts",
      "weight": 0.08134785
    },
    {
      "name": "tariff impacts",
      "weight": 0.08082616
    },
    {
      "name": "Goodyear",
      "weight": 0.07441338
    },
    {
      "name": "rising tariffs",
      "weight": 0.07348376
    },
    {
      "name": "tariffs",
      "weight": 0.07240181
    },
    {
      "name": "planned layoffs",
      "weight": 0.0643452
    },
    {
      "name": "transitory manufacturing costs",
      "weight": 0.06298379
    },
    {
      "name": "Goodyears annualized tariff costs",
      "weight": 0.06192229
    },
    {
      "name": "announced facility closures",
      "weight": 0.061767682
    }
  ],
  "topics": [
    {
      "name": "Unemployment"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.990234375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.54345703125
    },
    {
      "name": "/Business & Industrial/Automotive Industry",
      "score": 0.462158203125
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.36865234375
    }
  ],
  "sentiment": {
    "positive": 0.021198846,
    "negative": 0.9138064,
    "neutral": 0.06499486
  },
  "summary": "Goodyear Tire & Rubber Co. is experiencing financial difficulties, with its financial results for the second quarter of 2025 not meeting expectations due to tariffs and inflation. The company plans to make changes to its supply chain to reduce tariff impacts and is encouraging trade partners to participate in the United-States-Mexico-Canada Agreement. About 750 of these job cuts were initiated in the first half of 2025, including 80 or fewer positions based at its Akron headquarters. The layoffs also include approximately 900 employed and contracted jobs in South Africa. Goodyear's annualized tariff costs equate to about $350 million, $50 million above the estimated $300 million reported in May. Despite this, Goodyear has raised prices in the US.",
  "shortSummary": "Goodyear faces ongoing layoffs due to tariffs and inflation, while planning supply changes and price increases to reduce costs and participate in trade agreements.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5c0af733f28b41a380ef7f61f5fea134",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/business/2025/05/08/goodyear-reports-1q-earnings-fell-as-costs-grew-for-tiremaker/83511292007/",
      "text": "Goodyear optimistic its tangle with tariffs will be less expensive than competitors'\n- Goodyear leaders sayefforts to cut costs and strengthen U.S. operations are improving its finances with new import and export tariffs in effect.\n- Tariffs on finished goods and raw materials are expected to cost Goodyear about $300 million annually, according to a company investor presentation.\n- One of Goodyear's cost-cutting measures was the sale of Dunlop to Sumitomo Rubber Industries. The deal closed on May 7, with Goodyear receiving cash proceeds of $735 million.\nThe Goodyear Tire & Rubber Company on May 7 completed the sale of the Dunlop tire brand and announced that its efforts to shave costs and strengthen its U.S. operations are improving its financial outlook amid global trade uncertainties.\nAkron-based Goodyear, which has operations around the world and engages in international trade, is not impervious to tariffs, estimating $300 million in annual costs due to tariffs in a May 8 investor report.\nAfter the close of the stock market on May 7, the Akron-headquartered rubber company reported segment operating income of $195 million for the first quarter of 2025, down from $247 million in segment operating income for the same period a year ago.\nIn response to rising costs, the company confirmed with the Beacon Journal in April that it is increasing prices on consumer tires in the United States and Canada.\nPrice increases of 4% took effect on Goodyear's U.S. tire sales May 1, Christina Zamarro, Goodyear executive vice president and chief financial officer, said on a May 8 earnings call.\nYear-to-date, Goodyear stock has outpaced that of the \"Big Three\" U.S. car manufacturers — Ford, General Motors and Stellantis. Goodyear has seen a nearly 30% percentage gain since Jan. 1, compared to a less-than-10% gain for Ford and losses for GM and Stellantis.\nGoodyear stock closed May 8 at $10.94 per share, down 7 cents (0.64%).\nHow do tariffs affect Goodyear's financial outlook?\nTariffs on finished goods and raw materials are expected to cost Goodyear about $300 million annually, according to a company investor presentation.\n\"When you look at the $300 million that we laid out, I’d say you could think about 80% of that flowing through into our consumer business,\" Zamarro said. \"That equates to about $4 per tire. And I think that based on our analysis of the competitive set, our competitors will be anywhere in the area of three to four times that level of exposure.\"\nMark Stewart, Goodyear president and CEO, said on the call that company leadership assumes continued supply chain delays with imports from Southeast Asia.\n\"The timing is right to evolve and to build out our product portfolio,\" Stewart said. \"Likewise, the timing is right ... for the ramp-up of our U.S. factory modernization programs, increasing our capacity by 10 million additional premium tires this year in '25 and next year in '26.\"\nWhat other finances did Goodyear report?\nFor adjusted earnings per share for the first quarter of 2025, which are diluted, the company reported a 4-cent loss.\nZacks Investment Research published a 6-cent loss forecast for the quarter in its Zacks Consensus Estimate.\nMore broadly, Zacks ranks the rubber tire industry in the top 8% of industries, at 20 out of 246 ranked industries.\nHowever, the company reported gains in income before income taxes and net income year over year, landing at $131 million and $115 million, respectively, for 1Q 2025. In 1Q 2024, Goodyear reported a $52 million loss in income before income taxes and a $57 million loss in net income.\nGoodyear finalizes Dunlop sale\nAt closing for the sale of Dunlop to Sumitomo Rubber Industries, Goodyear received gross cash proceeds of $735 million, according to a news release.\nGoodyear will manufacture, sell and distribute Dunlop-branded consumer tires in Europe through the end of 2025, paying a royalty to Sumitomo during the transition period but retaining all profits from the sales, Zamarro said.\nPatrick Williams covers growth and development for the Akron Beacon Journal. He can be reached by email at pwilliams@gannett.com or on X, formerly known as Twitter, @pwilliamsOH. Sign up for the Beacon Journal's business and consumer newsletter, \"What's the deal?,\" at bit.ly/42LtqbS"
    },
    {
      "url": "https://www.tradecommissioner.gc.ca/en/market-industry-info/search-country-region/country/canada-united-states-export/us-tariffs/understanding-cusma-compliance.html",
      "text": "As of March 7, 2025, United States (U.S.) International Emergency Economic Powers Act (IEEPA) (i.e., border and fentanyl) tariffs have been paused for goods imported from Canada that qualify for duty-free preferential treatment under the Canada-United States-Mexico Agreement (CUSMA).\nFor the vast majority of goods (over 98% of tariff lines and over 99.9% of bilateral trade between Canada and the U.S.), traders can claim preference under the CUSMA if they meet the Agreement’s rules of origin.\nTo qualify for preferential treatment when imported into the U.S., a good must meet the CUSMA rules of origin, which determine how much production must be undertaken in North America for goods to be considered originating under the Agreement.\nIf a good meets the rules of origin, it is not automatically granted duty-free tariff treatment. This benefit must be claimed by the importer on the basis of a certification of origin. Goods that do not satisfy the rules of origin are considered non-originating and are not eligible for preferential tariff treatment under the Agreement.\nSome Canadian exporters have not sought preferential treatment under the CUSMA, because they previously traded with the U.S. under the broader tariff regime applicable to all World Trade Organization members (Most-Favoured Nation trade status), often with very low or zero tariff rates. These goods are now subject to the U.S. IEEPA (border and fentanyl) tariffs unless they meet the CUSMA rules of origin and make a claim for preferential tariff treatment."
    },
    {
      "url": "https://www.zacks.com/stock/news/2697918/goodyear-q2-earnings-miss-expectations-revenues-decline-yy#:~:text=Goodyear%20Tire%20(%20GT%20Quick%20Quote,the%20year%2Dago%20period's%20levels.",
      "text": "We use cookies to understand how you use our site and to improve your experience.\nThis includes personalizing content and advertising.\nBy pressing \"Accept All\" or closing out of this banner, you consent to the use of all cookies and similar technologies and the sharing of information they collect with third parties.\nYou can reject marketing cookies by pressing \"Deny Optional,\" but we still use essential, performance, and functional cookies.\nIn addition, whether you \"Accept All,\" Deny Optional,\" click the X or otherwise continue to use the site, you accept our Privacy Policy and Terms of Service, revised from time to time.\nYou are being directed to ZacksTrade, a division of LBMZ Securities and licensed broker-dealer. ZacksTrade and Zacks.com are separate companies. The web link between the two companies is not a solicitation or offer to invest in a particular security or type of security. ZacksTrade does not endorse or adopt any particular investment strategy, any analyst opinion/rating/report or any approach to evaluating individual securities.\nIf you wish to go to ZacksTrade, click OK. If you do not, click Cancel.\nGoodyear Q2 Earnings Miss Expectations, Revenues Decline Y/Y\nRead MoreHide Full Article\nKey Takeaways\nGT reports Q2 adjusted loss of 17 cents per share, missing earnings expectations.\nQ2 revenues fell 2.2% Y/Y to $4.47B, hurt by lower volume and the weak Americas segment.\nEMEA revenues rose 5.1% but the segment swung to a loss on higher raw material costs.\nGoodyear Tire (GT - Free Report) incurred an adjusted loss per share of 17 cents in the second quarter of 2025, in contrast to the Zacks Consensus Estimate of earnings of 37 cents. The company reported earnings of 19 cents per share in the year-ago quarter.\nThe company generated net revenues of $4.47 billion, which declined 2.2% on a year-over-year basis due to lower volume and lagged the Zacks Consensus Estimate of $4.53 billion.\nIn the reported quarter, tire volume was 37.9 million units, down 5.3% from the year-ago period’s levels.\nThe Goodyear Tire & Rubber Company Price, Consensus and EPS Surprise\nIn the reported quarter, the Americas segment generated revenues of $2.67 billion, which declined 1.3% year over year due to lower replacement volume. The segment registered an operating income of $141 million, which fell 41.5% from the year-ago period's figures. The operating income was hit by higher raw material costs, inflation and other costs, as well as unabsorbed fixed costs.\nRevenues in the Europe, Middle East and Africa segment were $1.34 billion, up 5.1% from the year-ago period's levels due to higher sales and positive price/mix actions. The operating loss for the segment was $25 million against the operating income of $30 million reported in the year-ago quarter due to higher raw material costs.\nRevenues in the Asia Pacific segment fell 22.7% year over year to $459 million due to lower replacement volume and the sale of the OTR tire business. The segment’s operating profit was $43 million, down 31.8% from the year-ago quarter’s figure due to the divestiture of the OTR tire business.\nFinancial Position\nSelling, general & administrative expenses fell to $692 million from $731 million in the year-ago period.\nGoodyear had cash and cash equivalents of $785 million as of June 30, 2025, down from $810 million as of Dec. 31, 2024.\nLong-term debt and finance leases amounted to $6.56 billion as of June 30, 2025, up from $6.4 billion as of Dec. 31, 2024.\nCapital expenditure in the first half of 2025 was $466 million, down from $634 million reported in 2024.\nRevised Outlook for 2025\nFor 2025, Goodyear expects capital expenditures to be $900 million, down from the previous estimate of $950 million. Interest expense is expected to be $450 million compared with the previous estimated range of $450 million and $475 million. Depreciation and amortization are expected to be approximately $925 million.\nGoodyear’s Zacks Rank & Key Pick\nGT currently carries a Zacks Rank #5 (Strong Sell).\nThe Zacks Consensus Estimate for RACE’s 2025 sales and earnings indicates year-over-year growth of 13.48% and 12.1%, respectively. EPS estimates for 2025 and 2026 have improved 5 cents and 9 cents, respectively, in the past 30 days.\nThe Zacks Consensus Estimate for PHIN’s 2025 sales and earnings implies year-over-year growth of 0.58% and 13.99%, respectively. EPS estimates for 2025 and 2026 have improved by 23 cents and 19 cents, respectively, in the past 30 days.\nThe Zacks Consensus Estimate for MOD’s fiscal 2026 sales and earnings indicates year-over-year growth of 11.31% and 14.32%, respectively. EPS estimates for fiscal 2026 and 2027 have improved 5 cents and 9 cents, respectively, in the past seven days.\nSee More Zacks Research for These Tickers\nNormally $25 each - click below to receive one report FREE:\nImage: Bigstock\nGoodyear Q2 Earnings Miss Expectations, Revenues Decline Y/Y\nKey Takeaways\nGoodyear Tire (GT - Free Report) incurred an adjusted loss per share of 17 cents in the second quarter of 2025, in contrast to the Zacks Consensus Estimate of earnings of 37 cents. The company reported earnings of 19 cents per share in the year-ago quarter.\nThe company generated net revenues of $4.47 billion, which declined 2.2% on a year-over-year basis due to lower volume and lagged the Zacks Consensus Estimate of $4.53 billion.\nIn the reported quarter, tire volume was 37.9 million units, down 5.3% from the year-ago period’s levels.\nThe Goodyear Tire & Rubber Company Price, Consensus and EPS Surprise\nThe Goodyear Tire & Rubber Company price-consensus-eps-surprise-chart | The Goodyear Tire & Rubber Company Quote\nSegmental Performance\nIn the reported quarter, the Americas segment generated revenues of $2.67 billion, which declined 1.3% year over year due to lower replacement volume. The segment registered an operating income of $141 million, which fell 41.5% from the year-ago period's figures. The operating income was hit by higher raw material costs, inflation and other costs, as well as unabsorbed fixed costs.\nRevenues in the Europe, Middle East and Africa segment were $1.34 billion, up 5.1% from the year-ago period's levels due to higher sales and positive price/mix actions. The operating loss for the segment was $25 million against the operating income of $30 million reported in the year-ago quarter due to higher raw material costs.\nRevenues in the Asia Pacific segment fell 22.7% year over year to $459 million due to lower replacement volume and the sale of the OTR tire business. The segment’s operating profit was $43 million, down 31.8% from the year-ago quarter’s figure due to the divestiture of the OTR tire business.\nFinancial Position\nSelling, general & administrative expenses fell to $692 million from $731 million in the year-ago period.\nGoodyear had cash and cash equivalents of $785 million as of June 30, 2025, down from $810 million as of Dec. 31, 2024.\nLong-term debt and finance leases amounted to $6.56 billion as of June 30, 2025, up from $6.4 billion as of Dec. 31, 2024.\nCapital expenditure in the first half of 2025 was $466 million, down from $634 million reported in 2024.\nRevised Outlook for 2025\nFor 2025, Goodyear expects capital expenditures to be $900 million, down from the previous estimate of $950 million. Interest expense is expected to be $450 million compared with the previous estimated range of $450 million and $475 million. Depreciation and amortization are expected to be approximately $925 million.\nGoodyear’s Zacks Rank & Key Pick\nGT currently carries a Zacks Rank #5 (Strong Sell).\nSome better-ranked stocks in the auto space are Ferrari N.V. (RACE - Free Report) , PHINIA Inc. (PHIN - Free Report) and Modine Manufacturing Company (MOD - Free Report) , each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nThe Zacks Consensus Estimate for RACE’s 2025 sales and earnings indicates year-over-year growth of 13.48% and 12.1%, respectively. EPS estimates for 2025 and 2026 have improved 5 cents and 9 cents, respectively, in the past 30 days.\nThe Zacks Consensus Estimate for PHIN’s 2025 sales and earnings implies year-over-year growth of 0.58% and 13.99%, respectively. EPS estimates for 2025 and 2026 have improved by 23 cents and 19 cents, respectively, in the past 30 days.\nThe Zacks Consensus Estimate for MOD’s fiscal 2026 sales and earnings indicates year-over-year growth of 11.31% and 14.32%, respectively. EPS estimates for fiscal 2026 and 2027 have improved 5 cents and 9 cents, respectively, in the past seven days."
    }
  ],
  "argos_summary": "Goodyear's financial results for the second quarter of 2025 fell short of expectations, reporting an adjusted net loss of $48 million and a loss per share of 17 cents, significantly below the anticipated gain. The company attributed its struggles to rising tariffs, inflation, and a decline in tire volume, leading to plans for approximately 1,800 layoffs in 2025, including cuts in its Akron headquarters and South Africa. Goodyear is also considering adjustments to its supply chain to mitigate tariff impacts and has raised prices in response to increased costs.",
  "argos_id": "84JN7S90I"
}