{
  "url": "https://nypost.com/2025/08/12/world-news/female-british-cops-wore-jogging-outfits-to-elicit-catcalls-and-then-arrested-some-men-who-hit-on-them-report/",
  "authorsByline": "Shane Galvin",
  "articleId": "452b42d80f8e41be9dbe9be507f95217",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/109516293.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:35:45+00:00",
  "addDate": "2025-08-12T22:37:46.458643+00:00",
  "refreshDate": "2025-08-12T22:37:46.458645+00:00",
  "score": 1.0,
  "title": "British cops wore jogging outfits to elicit catcalls and then arrested some men who hit on them: report",
  "description": "“This behavior is either a precursor to something more serious — or it’s ignorance and it’s fixable,” the cop said.",
  "content": "From catcalls to the doghouse.\n\nFemale cops in England went undercover as joggers, wearing tight-fitting clothes in a bid to elicit catcalls — and then arrested some of the men who hit on them, according to a report.\n\nThe Surrey Police Department created a trial task force, which lasted about a month, and led to 18 arrests for offences like sexual assault, harassment, and theft, The Telegraph reported.\n\nThe female officers were sent during rush hour to “hot spots” where open sexual harassment of women is commonplace and pretended to be joggers, the report stated.\n\n“One of our officers was honked at within 10 minutes — then another vehicle slowed down, beeping and making gestures just 30 seconds later — that’s how frequent it is,” Inspector Jon Vale of SPD told the outlet.\n\nOne of the officers in the group said the harassment she faced during the trial period reflects her everyday experience in Surrey.\n\n“We get catcalled. We get honked at. People slow down just to stare — or lean out the window to shout something. It’s so common, but it’s harassment and it needs to be recognized as such,” Officer Abby Hayward told the Telegraph.\n\n“This behavior is either a precursor to something more serious — or it’s ignorance and it’s fixable,” the cop said.\n\n“That’s where our interventions come in: to stop potential repeat offenders or help people understand that what they’re doing isn’t OK.”\n\nCritics of the program include the Free Speech Union, which said the tactic was a “bizarre social-psychology experiment,” and that police should enforce the laws on the books, according to the outlet.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/12/world-news/terrorists-killed-posing-as-world-central-kitchen-staff-in-gaza-idf/",
    "https://nypost.com/2025/08/12/world-news/moscow-troops-make-massive-advance-in-ukraine-just-days-before-trump-set-to-meet-with-putin/",
    "https://www.telegraph.co.uk/news/2025/08/12/undercover-officers-pose-as-joggers-to-stop-catcalling/",
    "https://nypost.com/2025/08/12/world-news/influencer-couple-known-for-off-roading-travel-adventures-die-in-crash/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "open sexual harassment",
      "weight": 0.09438217
    },
    {
      "name": "harassment",
      "weight": 0.081237555
    },
    {
      "name": "Female cops",
      "weight": 0.073712304
    },
    {
      "name": "potential repeat offenders",
      "weight": 0.07136172
    },
    {
      "name": "sexual assault",
      "weight": 0.06840857
    },
    {
      "name": "Inspector Jon Vale",
      "weight": 0.067060225
    },
    {
      "name": "Officer Abby Hayward",
      "weight": 0.06481751
    },
    {
      "name": "British cops",
      "weight": 0.06339959
    },
    {
      "name": "Jon Vale",
      "weight": 0.0596158
    },
    {
      "name": "catcalls",
      "weight": 0.059422854
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.986328125
    },
    {
      "name": "/News/Local News",
      "score": 0.9716796875
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.96435546875
    },
    {
      "name": "/News/Other",
      "score": 0.91015625
    }
  ],
  "sentiment": {
    "positive": 0.04502013,
    "negative": 0.75923026,
    "neutral": 0.19574961
  },
  "summary": "The Surrey Police Department has employed female officers to go undercover as joggers to elicit catcalls and arrest some men who hit on them. The trial task force, which lasted about a month, resulted in 18 arrests for offences such as sexual assault, harassment, and theft. The officers were sent to \"hot spots\" where open sexual harassment of women is common. Critics, including the Free Speech Union, argue that the tactic is a social-psychology experiment and police should enforce existing laws.",
  "shortSummary": "British police in England went undercover as joggers to combat sexual harassment, leading to 18 arrests, highlighting widespread prevalence and awareness of such incidents across the country.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9f857364e168415bbcdc083572ab336e",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/12/world-news/influencer-couple-known-for-off-roading-travel-adventures-die-in-crash/",
      "text": "Influencer couple known for off-roading travel adventures die in crash\nA popular influencer couple known for sharing off-road travel adventures with their tens of thousands of followers have tragically died in a crash in the Canadian wilderness.\nStacey Tourout and Matthew Yeomans, who had amassed a global following via their Toyota World Runners YouTube and social media accounts, were killed in the off-road wreck in British Columbia last Thursday, relatives said.\n“With unimaginable heartache, the families of Matthew Peter Yeomans and Stacey Tourout would like to advise that we lost them both tragically succumbing to injuries in an off-road accident on Aug 7, 2025 in the beautiful mountains of British Columbia that they loved so much,” the family said in a statement.\nIt wasn’t immediately clear if the couple, who were originally from B.C., were filming at the time of the fatal wreck.\n“They are together forever as we knew they would always be,” the statement added.\nThe exact cause of the accident is under investigation but authorities suspect they lost control on rough terrain.\nMark Jennings-Bates, a manager with Kaslo Search and Rescue, told CBC crews had a precise location for the couple when the emergency call first came in at about 7:30 p.m.\n“Our teams were able to get to them efficiently. It’s a long journey, but they got there efficiently,” he said.\n“And of course that means that the helicopter pilot could also fly straight to the destination with confidence that he was going to find them.”\nOne of the victims was already dead when rescue crews eventually arrived at the scene, while the other was rushed to a hospital where they later succumbed to their injuries.\nThe couple made a name for themselves by documenting their travels through North and South America and ran a popular blog that showed off their extensive car and RV retrofits."
    },
    {
      "url": "https://nypost.com/2025/08/12/world-news/terrorists-killed-posing-as-world-central-kitchen-staff-in-gaza-idf/",
      "text": "Armed terrorists killed while posing as World Central Kitchen staff in Gaza: IDF\nA group of five armed terrorists were killed after they were caught posing as members of the World Central Kitchen humanitarian group in central Gaza, the Israeli military said Tuesday.\nVideo from Deir al-Balah, one of the few cities largely spared by the 21-month Mideast war, shows a group of men in bright vests traveling in a vehicle marked with the WCK’s emblem.\n“The terrorists deliberately attached the [WCK] emblem and wore yellow vests in an attempt to disguise their activities and avoid being targeted, cynically exploiting the status and trust given to aid organizations,” the Israel Defense Force said in a statement.\nThe military said its unit that oversees the distribution of humanitarian aid contacted WCK about the group spotted near Deir al-Balah, with the nonprofit confirming that the vehicle was not affiliated with them.\nWhile the IDF only confirmed that five of the men were killed, the video showed at least 10 people huddled around the car and putting on the vests before the vehicle set off.\nThe IDF did not state if the men killed in the strike were specifically with Hamas or members of other terror groups or militias based in the Gaza Strip.\nWCK said it condemned anyone who would pose as one of their employees, warning that such actions endanger real aid workers operating in Gaza.\nThe agency, founded in 2010 by Spanish-American chef and restaurateur José Andrés, provides food relief to those around the world, with the humanitarian group currently focusing on trying to avoid the looming famine in Gaza.\nThe war in Gaza has repeatedly put humanitarian aid workers at risk, with at least 10 WCK staffers killed last year after they were hit by Israeli airstrikes, including seven who were unloading 100 tons of food.\nIsraeli officials have repeatedly apologized for the deaths, blaming Hamas for putting the aid workers at risk and accusing the group of routinely hiding behind the humanitarian efforts in Gaza."
    },
    {
      "url": "https://nypost.com/2025/08/12/world-news/moscow-troops-make-massive-advance-in-ukraine-just-days-before-trump-set-to-meet-with-putin/",
      "text": "Moscow troops make advance in Ukraine just days before Trump set to meet with Putin\nMoscow troops made one of their most dramatic advancements of the year Tuesday when they pushed deeper into the Donetsk region of Ukraine — just three days before President Trump is set to meet with his Russian counterpart Vladimir Putin.\nRussia’s invasion forces marched some six miles past the frontlines in Donetsk to encircle the towns of Kostyantynivka, Dobropillia and Pokrovsk, advancing Moscow’s goal of taking full control of the region, according to Ukraine’s authoritative DeepState war map.\n“The situation is quite chaotic, as the enemy, having found gaps in the defense, is infiltrating deeper, trying to quickly consolidate and accumulate forces for further advancement,” DeepState said in an update.\nDonetsk has seen some of the most intense fighting of the war, which is in its third year, with Moscow reportedly demanding full control of the region as part of the upcoming peace talks with Trump.\nThe latest advancement was centered on the coal mining town of Dobropillia, which lies just north of Pokrovsk, a key city Russia has been targeting for months.\nOleksandr Syrskyi, Ukraine’s top military commander, said Russia was using sheer numbers to overwhelm his forces along the frontlines to make small gains in the region, local Interfax-Ukraine reported.\nThe Russian forces have recently made 35 attempts to push back Kyiv’s defenses before making the six-mile gain, Andriy Kovalov, a spokesperson for the Ukrainian army, told the local outlet.\nSyrskyi has since ordered a new wave of reinforcements to the frontlines to end Moscow’s advancements.\nThe reinforcements are “to detect and destroy enemy sabotage groups that penetrate the line of defence,” Kovalov said.\nSergei Markov, a former Kremlin adviser, touted Tuesday’s advancement as the necessary leverage Putin needs ahead of his meeting with Trump.\n“This breakthrough is like a gift to Putin and Trump during the negotiations,” Markov told Reuters, suggesting it could put pressure on Ukraine to give up some of its land in exchange for peace.\nExperts, however, said Russia’s gains are not enough to boast a meaningful victory given the amount of soldiers and ammunition thrown into Moscow’s meat grinder for an advancement of just six miles.\nGeorge Barros, of the Washington-based Institute for the Study of War think tank, said there is no evidence to suggest whole Russian platoons made it through the frontlines on Tuesday.\n“Worst case, it’s a tactical penetration in the localized area which the Russians will hope to certainly snowball into a larger operational penetration,” he told The Post. “But it’s far from clear they can either do that.”\nBarros, instead, surmised that Moscow is likely playing up the attack to bolster the perception that Russia is winning the war despite the reality of months-long quagmires along the frontlines.\n“The Russians are counting on us to hyperbole it in order to give Putin more leverage and incorrectly manipulate Western presidents and his officials thinking about this,” Barros warned.\n“That’s the important thing. We really need the president to go into the meeting with a clear head about what this is and how Putin is trying to play this mind game.”\nMoscow has maintained that one of its conditions for ending the war in Ukraine would be for Kyiv to cede all the territory that Russia has taken in more than three years of fighting.\nDonetsk is one of the territories Russia is most keen on taking, with Moscow allegedly telling Trump last week that it would be open to withdrawing its forces out of Zaporizhzhia and Kherson in exchange for complete control of Donetsk, according to The Wall Street Journal.\nKyiv has maintained that it would not cede any territory to the Russian invaders, urging Trump to avoid any talks with Putin on surrendering land without Ukraine present at the negotiating table.\nWith Post wires"
    }
  ],
  "argos_summary": "Female police officers in England conducted an undercover operation as joggers to address rampant sexual harassment, resulting in 18 arrests for offenses including sexual assault and harassment. The initiative aimed to highlight the prevalence of such behavior and deter potential repeat offenders. Meanwhile, a tragic off-road accident claimed the lives of popular influencer couple Stacey Tourout and Matthew Yeomans in British Columbia. In Gaza, the Israeli military reported killing five armed terrorists disguised as humanitarian workers, while Russian troops advanced in Ukraine's Donetsk region ahead of a scheduled meeting between President Trump and President Putin.",
  "argos_id": "86LDD9A8W"
}