{
  "url": "https://abcnews.go.com/US/watch-perseid-meteor-shower-peak-tuesday/story?id=124580723",
  "authorsByline": "Doc Louallen",
  "articleId": "484d5296e2e04ae7a70acac304762ef0",
  "source": {
    "domain": "abcnews.go.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://i.abcnewsfe.com/a/d3f25150-7a70-4785-a92e-5b9fc59e9f6e/perseid-meteor-gty-jt-250812_1755029489602_hpMain_16x9.jpg?w=1600",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:29:15+00:00",
  "addDate": "2025-08-12T20:35:09.371500+00:00",
  "refreshDate": "2025-08-12T20:35:09.371501+00:00",
  "score": 1.0,
  "title": "Perseid meteor shower 2025: Best times and locations for viewing",
  "description": "Learn when and where to watch the 2025 Perseid meteor shower, with expert tips from NASA scientists for the best viewing experience.",
  "content": "Scientists predict up to 50 meteors per hour during peak viewing times.\n\nIn this Aug. 12, 2024, file photo, a meteor crosses the night sky over a monastery in the village of Wigry, Suwalki region, Poland, during the annual Perseids meteor shower.\n\nIn this Aug. 12, 2024, file photo, a meteor crosses the night sky over a monastery in the village of Wigry, Suwalki region, Poland, during the annual Perseids meteor shower.\n\nIn this Aug. 12, 2024, file photo, a meteor crosses the night sky over a monastery in the village of Wigry, Suwalki region, Poland, during the annual Perseids meteor shower.\n\nIn this Aug. 12, 2024, file photo, a meteor crosses the night sky over a monastery in the village of Wigry, Suwalki region, Poland, during the annual Perseids meteor shower.\n\nThe much-anticipated Perseid meteor shower, one of nature's most dazzling sky shows, is set to peak Tuesday night into early Wednesday morning, lighting up skies across the Northern Hemisphere.\n\n\"The Perseids are caused by Earth running into trails of debris left behind by Comet Swift-Tuttle,\" Bill Cooke, lead for NASA's Meteoroid Environments Office, told ABC News.\n\nThe shower has been captivating humans since it was first recorded by Chinese astronomers in 36 A.D., nearly 2,000 years ago.\n\nFor the best view of this celestial spectacle, timing is everything.\n\n\"The best time to see the Perseids would be in the wee hours of [Wednesday] morning, around 2 to 4 a.m.,\" Cooke said.\n\nIf you want to catch the show you won't need a telescope, Cooke said.\n\n\"You definitely do not want to use a telescope or binoculars, as the best way to see a meteor shower is to take in as much sky as possible,\" Cooke advised. \"Just use your eyes and enjoy the show!\"\n\nWhile this year's display will be affected by moonlight, determined sky-watchers can still catch plenty of meteors.\n\n\"The average person under dark skies could see somewhere between 40 and 50 Perseids per hour,\" Cooke said. \"Instead, you're probably going to see 10 to 20 per hour or fewer.\"\n\nThese \"shooting stars\" are actually space debris from Comet Swift-Tuttle, which last visited our cosmic neighborhood in 1992, according to NASA press release. (The comet is named for the two scientists who discovered the comet in 1862, Lewis Swift and Horace Tuttle).\n\nWhen these pieces hit Earth's atmosphere, they create brilliant streaks of light across the night sky. The shower gets its name because the meteors appear to shoot out from near the Perseus constellation, NASA said.\n\nFor the best viewing experience, find a safe, dark spot away from city lights with a wide view of the sky. The shower will remain active until Sept. 1, though Tuesday night offers peak viewing opportunities. Just remember to dress warmly, bring a comfortable chair and give your eyes about 30 minutes to adjust to the darkness.\n\n\"You're not going to see Perseids around suppertime,\" Cooke said. \"You're going to have to go out later.\"\n\nBut for those willing to stay up late, the celestial show promises to be worth the wait.",
  "medium": "Article",
  "links": [
    "https://abcnews.go.com/Politics/supreme-court-formally-asked-overturn-landmark-same-sex/story?id=124465302",
    "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=124336385",
    "https://abcnews.go.com/GMA/Culture/taylor-swift-fans-shell-guest-travis-jason-kelces/story?id=124557974",
    "https://abcnews.go.com/US/suspect-arrested-after-couple-killed-hiking-arkansas-park/story?id=124226970"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Perseid meteor shower",
      "weight": 0.10155442
    },
    {
      "name": "dark skies",
      "weight": 0.09483932
    },
    {
      "name": "skies",
      "weight": 0.089969724
    },
    {
      "name": "meteors",
      "weight": 0.08846412
    },
    {
      "name": "Tuesday night",
      "weight": 0.07942342
    },
    {
      "name": "Perseids",
      "weight": 0.074828394
    },
    {
      "name": "the annual Perseids meteor shower",
      "weight": 0.07370747
    },
    {
      "name": "Best times",
      "weight": 0.071779095
    },
    {
      "name": "Bill Cooke",
      "weight": 0.06954286
    },
    {
      "name": "peak viewing times",
      "weight": 0.06751544
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Science"
    }
  ],
  "taxonomies": [
    {
      "name": "/Science/Astronomy",
      "score": 0.8125
    },
    {
      "name": "/News/Other",
      "score": 0.35107421875
    }
  ],
  "sentiment": {
    "positive": 0.1507793,
    "negative": 0.33476362,
    "neutral": 0.5144571
  },
  "summary": "The annual Perseid meteor shower, one of nature's most dazzling sky shows, is set to peak on Tuesday night into early Wednesday morning, lighting up skies across the Northern Hemisphere. Scientists predict that up to 50 meteors per hour will be seen during peak viewing times. The shower is caused by Earth running into trails of debris left behind by Comet Swift-Tuttle. The best viewing experience will be in the early hours of Wednesday morning. While this year's display will be affected by moonlight, determined sky-watchers can still catch plenty of meteors.",
  "shortSummary": "The Perseid meteor shower peaks Tuesday night, with up to 50 meteors per hour, and best viewing locations are likely to be near darkness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "9d7dce94bc2b4625b1b9d090ba8d1373",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=124336385",
      "text": "President Trump has announced a summit with Russian President Vladimir Putin scheduled for Friday, Aug. 15 in Alaska.\nThe Trump administration is also once again escalating its clash with Harvard University, with Commerce Secretary Lutnick sending a letter Friday to Harvard President Alan Garber that accuses Harvard of violating its legal and contractual obligations related to federally funded research programs and patents.\nLutnick said the Commerce Department is launching an \"immediate comprehensive review\" of Harvard’s federally funded research programs.\nThe US military is preparing for possible activation of National Guard in DC\nThe U.S. military is preparing for the possible activation of a portion of the DC National Guard to be deployed to Washington, D.C., according to a U.S. official.\nIt’s unclear exactly how many Guardsmen might be activated, as a decision has not yet been made. There are 2,700 personnel in the D.C. National Guard.\nThe expectation is that if guardsmen are activated, it would be in a support role to local authorities.\nThe D.C. National Guard is unique in that, unlike other National Guards, it is not under the control of a governor or, in this case, the mayor of D.C., but the president.\nThat authority has been delegated to the defense secretary and the secretary of the Army.\n-ABC News’ Luis Martinez\nAug 10, 2025, 3:40 PM EDT\nVance denies meeting at his residence on Epstein\nVice President JD Vance dismissed reports that a meeting took place at his residence with top administration officials Thursday that involved discussions about convicted sex offender Jeffrey Epstein.\n\"There was no meeting at my house last night. There just wasn't,\" Vance told Fox News’ Maria Bartiromo in an interview that aired on “Sunday Morning Futures.”\n\"We did meet at the White House yesterday, but not at the time that they said that they -- that we were going to meet and not about the subject that we -- they said that we were going to meet about,\" Vance said in the interview that was taped on Friday.\n\"We actually didn't talk about the Epstein issue at all. That was never meant to be the subject of the meeting,\" he continued.\nVance said the reports came from someone leaking a calendar entry in which they assumed that it was about Epstein.\nVance reiterated that Trump has called for full transparency, and efforts are underway to compile documents.\n\"On the Epstein issue, what the president has said very clearly, because we have had other meetings about that, is that he wants us to be fully transparent and he wants the credible information out there. So, we're working to compile the thousands and thousands of documents that are out there for full transparency,\" Vance said.\nVance said he supported the decision by Rep. James Comer, chair of the House Oversight Committee, to subpoena Bill and Hillary Clinton in its investigation of the Epstein files.\n-ABC News’ Kelsey Walsh\nAug 10, 2025, 3:37 PM EDT\nTrump to hold Monday news conference on DC crime\nTrump announced on his social media platform that he’ll hold a news conference at 10 a.m. Monday to discuss crime in Washington, D.C.\nThe president said that he has given D.C. Mayor Muriel Bowser an opportunity to reduce crime rates but crime has gotten worse.\n\"The Mayor of D.C., Muriel Bowser, is a good person who has tried, but she has been given many chances, and the Crime Numbers get worse, and the City only gets dirtier and less attractive. The American Public is not going to put up with it any longer,\" Trump said in his post.\nContrary to the president's claim, Washington’s Metropolitan Police Department’s preliminary year-to-date crime rate comparison shows that crime in D.C. has decreased by 7% since last year, with violent crime down 26% and property crime reduced by 5%.\n“I will take care of our cherished Capital, and we will make it, truly, GREAT AGAIN! Before the tents, squalor, filth, and Crime, it was the most beautiful Capital in the World. It will soon be that again,” Trump wrote.\n-ABC News’ Kelsey Walsh\nAug 10, 2025, 1:35 PM EDT\nVance brushes off talk of 2028 ticket\nAfter Trump publicly suggested a Vance-Rubio ticket for 2028, the vice president shot down continued dialogue during an interview with Fox News’ Maria Bartiromo, saying that Rubio and he are not focused on politics right now.\n\"I saw Marco about a month ago. We just laughed at the whole thing, because neither one of us are focused on politics. We're focused on actually doing a good job for the American people,\" Vance said in the interview that aired on “Sunday Morning Futures.”\n\"If we do a good job, number one, that's the reward, in and of itself, that I will have made a big difference in the lives of our country for the last six months, the next 3.5 years. But if we do a good job, the politics will take care of itself,\" he continued.\nDespite Vance trying to navigate away from the topic, he did not dismiss the possibility of running for president in 2028 when asked.\n\"I'm not going to break that news today, Maria,\" he said. \"What I'm going to do is focus for the next year and a half on doing a really good job for the American people, winning the midterm elections in 2026. Then we can talk about politics after that.\""
    },
    {
      "url": "https://abcnews.go.com/Politics/supreme-court-formally-asked-overturn-landmark-same-sex/story?id=124465302",
      "text": "Supreme Court formally asked to overturn landmark same-sex marriage ruling\nKim Davis, a former clerk who refused gay couples, brought the appeal.\nTen years after the Supreme Court extended marriage rights to same-sex couples nationwide, the justices this fall will consider for the first time whether to take up a case that explicitly asks them to overturn that decision.\nKim Davis, the former Kentucky county clerk who was jailed for six days in 2015 after refusing to issue marriage licenses to a gay couple on religious grounds, is appealing a $100,000 jury verdict for emotional damages plus $260,000 for attorneys fees.\nIn a petition for writ of certiorari filed last month, Davis argues First Amendment protection for free exercise of religion immunizes her from personal liability for the denial of marriage licenses.\nMore fundamentally, she claims the high court's decision in Obergefell v Hodges -- extending marriage rights for same-sex couples under the 14th Amendment's due process protections -- was \"egregiously wrong.\"\n\"The mistake must be corrected,\" wrote Davis' attorney Mathew Staver in the petition. He calls Justice Anthony Kennedy's majority opinion in Obergefell \"legal fiction.\"\nThe petition appears to mark the first time since 2015 that the court has been formally asked to overturn the landmark marriage decision. Davis is seen as one of the only Americans currently with legal standing to bring a challenge to the precedent.\n\"If there ever was a case of exceptional importance,\" Staver wrote, \"the first individual in the Republic's history who was jailed for following her religious convictions regarding the historic definition of marriage, this should be it.\"\nLower courts have dismissed Davis' claims and most legal experts consider her bid a long shot. A federal appeals court panel concluded earlier this year that the former clerk \"cannot raise the First Amendment as a defense because she is being held liable for state action, which the First Amendment does not protect.\"\nDavis, as the Rowan County Clerk in 2015, was the sole authority tasked with issuing marriage licenses on behalf of the government under state law.\n\"Not a single judge on the U.S. Court of Appeals showed any interest in Davis's rehearing petition, and we are confident the Supreme Court will likewise agree that Davis's arguments do not merit further attention,\" said William Powell, attorney for David Ermold and David Moore, the now-married Kentucky couple that sued Davis for damages, in a statement to ABC News.\nA renewed campaign to reverse legal precedent\nDavis' appeal to the Supreme Court comes as conservative opponents of marriage rights for same-sex couples pursue a renewed campaign to reverse legal precedent and allow each state to set its own policy.\nAt the time Obergefell was decided in 2015, 35 states had statutory or constitutional bans on same-sex marriages, according to the National Conference of State Legislatures. Only eight states had enacted laws explicitly allowing the unions.\nSo far in 2025, at least nine states have either introduced legislation aimed at blocking new marriage licenses for LGBTQ people or passed resolutions urging the Supreme Court to reverse Obergefell at the earliest opportunity, according to the advocacy group Lambda Legal.\nIn June, the Southern Baptist Convention -- the nation's largest Protestant Christian denomination -- overwhelmingly voted to make \"overturning of laws and court rulings, including Obergefell v. Hodges, that defy God's design for marriage and family\" a top priority.\nSupport for equal marriage rights softening\nWhile a strong majority of Americans favor equal marriage rights, support appears to have softened in recent years, according to Gallup -- 60% of Americans supported same-sex marriages in 2015, rising to 70% support in 2025, but that level has plateaued since 2020.\nAmong Republicans, support has notably dipped over the past decade, down from 55% in 2021 to 41% this year, Gallup found.\nDavis' petition argues the issue of marriage should be treated the same way the court handled the issue of abortion in its 2022 decision to overturn Roe v Wade. She zeroes in on Justice Clarence Thomas' concurrence in that case, in which he explicitly called for revisiting Obergefell.\nThe justices \"should reconsider all of this Court's substantive due process precedents, including Griswold, Lawrence, and Obergefell,\" Thomas wrote at the time, referring to the landmark decisions dealing with a fundamental right to privacy, due process and equal protection rights.\n\"It is hard to say where things will go, but this will be a long slog considering how popular same-sex marriage is now,\" said Josh Blackman, a prominent conservative constitutional scholar and professor at South Texas College of Law.\nBlackman predicts many members of the Supreme Court's conservative majority would want prospective challenges to Obergefell to percolate in lower courts before revisiting the debate.\nThe court is expected to formally consider Davis' petition this fall during a private conference when the justices discuss which cases to add to their docket. If the case is accepted, it would likely be scheduled for oral argument next spring and decided by the end of June 2026. The court could also decline the case, allowing a lower court ruling to stand and avoid entirely the request to revisit Obergefell.\n\"Justices Brett Kavanaugh and Amy Coney Barrett seem wildly uninterested. Maybe Justice Neil Gorsuch, too,\" said Sarah Isgur, an ABC News legal analyst and host of the legal podcast Advisory Opinions.\n\"There is no world in which the court takes the case as a straight gay marriage case,\" Isgur added. \"It would have to come up as a lower court holding that Obergefell binds judges to accept some other kind of non-traditional marital arrangement.\"\nRuling wouldn't invalidate existing marriages\nIf the ruling were to be overturned at some point in the future, it would not invalidate marriages already performed, legal experts have pointed out. The 2022 Respect for Marriage Act requires the federal government and all states to recognize legal marriages of same-sex and interracial couples performed in any state -- even if there is a future change in the law.\nDavis first appealed the Supreme Court in 2019 seeking to have the damages suit against her tossed out, but her petition was rejected. Conservative Justices Thomas and Samuel Alito concurred with the decision at the time.\n\"This petition implicates important questions about the scope of our decision in Obergefell, but it does not cleanly present them,\" Thomas wrote in a statement.\nMany LGBTQ advocates say they are apprehensive about the shifting legal and political landscape around marriage rights.\nThere are an estimated 823,000 married same-sex couples in the U.S., including 591,000 that wed after the Supreme Court decision in June 2015, according to the Williams Institute at UCLA Law School. Nearly one in five of those married couples is parenting a child under 18.\nSince the Obergefell decision, the makeup of the Supreme Court has shifted rightward, now including three appointees of President Donald Trump and a 6-justice conservative supermajority.\nChief Justice John Roberts, among the current members of the court who dissented in Obergefell a decade ago, sharply criticized the ruling at the time as \"an act of will, not legal judgment\" with \"no basis in the Constitution.\" He also warned then that it \"creates serious questions about religious liberty.\"\nDavis invoked Roberts' words in her petition to the high court, hopeful that at least four justices will vote to accept her case and hear arguments next year."
    },
    {
      "url": "https://abcnews.go.com/US/suspect-arrested-after-couple-killed-hiking-arkansas-park/story?id=124226970",
      "text": "Teacher arrested for Arkansas double murder admits to killing married couple: Police\nClinton and Cristen Brink were killed in a state park, police said.\nA 28-year-old teacher has admitted to murdering the married couple found stabbed to death on a walking trail in an Arkansas park over the weekend in what appears to be a \"completely random\" attack, police said.\nAndrew James McGann, 28, of Springdale, Arkansas, was charged with two counts of capital murder in the killings of 43-year-old Clinton David Brink and his wife, 41-year-old Cristen Amanda Brink, Arkansas State Police announced Wednesday evening.\nThe Brinks were \"fatally attacked\" while out hiking with their two daughters at Devil's Den State Park on July 26, police said. The \"horrific\" assault occurred about a half mile into the park, with the husband attacked first, police said.\nThe children, ages 7 and 9, were not harmed in the incident thanks to the actions of their mother, police said.\n\"We believe that the mother took them to safety, and then returned to help her husband,\" Maj. Stacie Rhoads with the Arkansas State Police said during a press briefing Thursday.\nFollowing a dayslong manhunt for the suspect, McGann was arrested shortly before 5 p.m. local time Wednesday at a barbershop in Springdale, about 30 miles north of the park, police said.\nDuring an interview with police, he admitted to killing the couple, Arkansas State Police Director Col. Mike Hagar said during Thursday's press briefing.\nDNA from blood recovered from the crime scene also matched McGann's DNA, Hagar said. The suspect had sustained cuts on his hands during a struggle with the victims, according to a law enforcement official familiar with the investigation.\nItems recovered from his residence were \"consistent with being involved in this particular crime,\" Hagar said.\nMcGann had recently moved to the area from Oklahoma and had been hired to work at a local school, officials said.\nHe was hired to teach in the Springdale Public Schools district this upcoming school year but had not yet begun employment, according to the district's superintendent, Jared Cleveland.\n\"This individual has not at any time come into contact with Springdale students or the families we serve,\" Cleveland said in a statement, adding that no additional information is available at this time due to the ongoing investigation.\n\"Our entire team extends our deepest condolences to the Brink family. Their children are especially in our thoughts and prayers,\" he said.\nMcGann was a fifth grade teacher in Broken Arrows, Oklahoma, during the 2023-2024 school year, the school district said. He passed required background checks, a Broken Arrow Public Schools spokesperson said.\nThe prior school year, he was employed at an elementary school in Flower Mound, Texas, the Lewisville Independent School District confirmed. He was placed on administrative leave in the spring of 2023 \"following concerns related to classroom management, professional judgment, and student favoritism,\" and he ultimately resigned, the school district said.\n\"An internal investigation found no evidence of inappropriate behavior with students,\" the school district added.\nAsked about a motive in the double homicide, Hagar said it remains under investigation, though he did say it appeared to be a \"completely random event.\"\n\"We have no reason to believe that there was any known association between our suspects and our victims,\" Hagar said.\nThe victims died from stab wounds, and the murder weapon was a knife, Hagar said Thursday. Knives were recovered from the residence's home, but it is unclear if any was the murder weapon, Rhoads said.\nHagar said police received over 500 tips and credited the public's help with bringing the suspect into custody.\nArkansas State Police had also released a composite sketch and photo from behind of a man who was seen in Devil's Den State Park on Saturday, the day of the killings. Police asked for the public's help in identifying the man, who they said was wanted for questioning in connection with the double homicide.\nPolice previously said the suspect was seen leaving the area of the park in a black, four-door sedan, possibly a Mazda, with a license plate covered by tape, police said. The vehicle description was \"critical\" in identifying the suspect, Rhoads said.\nThough he took steps to conceal his identity, the suspect was \"very sloppy,\" Rhoads said.\nOnce they identified the suspect, McGann was arrested within an hour at the barbershop, she said.\nPolice do not believe the suspect was trying to alter his appearance in getting a haircut, according to Rhoads, saying, \"Could chalk that up to school starts next week.\"\nThe Brinks had recently moved to Prairie Grove from North Dakota, police said.\nThe children are safe and in the custody of relatives, according to police.\n\"Our entire state is grieving for the tragic loss and senseless and horrific crime that's taken place,\" Arkansas Gov. Sarah Huckabee Sanders said in a statement. \"One of the worst experiences that certainly I've ever had was making a phone call to the Brink family earlier this week. Nothing like that should ever have taken place.\"\nHagar said the Brinks were a loving couple, and credited their two young daughters with helping in the case, saying they are \"in awe\" of them.\n\"The information that they were able to provide to start us down this path, to be able to make this arrest, it all started with those two little girls,\" he said. \"It's incredible.\"\nHagar said the couple has a third daughter who wasn't at the trail that day.\n\"It is my intention to use the full weight of my office to bring this defendant to justice for the Brinks family,\" Brandon Carter, the prosecuting attorney for Washington County, said at Thursday's press briefing.\nThe prosecutor's office will not be waiving the death penalty in the case, Carter said.\nMcGann is scheduled to make his first court appearance on Friday, with an arraignment expected next week.\nAll trails at Devil's Den State Park, which were closed following the killings, will remain closed for now, Arkansas Secretary of Parks Shay Lewis said.\nABC News' Sasha Pezenik contributed to this report."
    },
    {
      "url": "https://abcnews.go.com/GMA/Culture/taylor-swift-fans-shell-guest-travis-jason-kelces/story?id=124557974",
      "text": "Taylor Swift will appear on Travis and Jason Kelce's 'New Heights' podcast\nThe new episode of \"New Heights\" will arrive on Wednesday at 7 p.m. ET.\nAre you ready for it? Taylor Swift is joining the New Heights podcast with Travis Kelce.\nOn Monday night, New Heights shared a video of Kelce and Swift on Instagram teasing the upcoming episode. Watch here.\nSwift appears, telling boyfriend Travis Kelce, who is wearing a blue hoodie, \"It's such a nice color on you.\"\nHe replies, \"Yeah, it's the color of your eyes, sweetie. That's why we match so well.\"\n\"We're about to do a f---ing podcast!\" Swift adds.\nThe news comes after tons of speculation earlier on Monday that Swift would make a guest appearance on the show.\nThe \"New Heights\" podcast, which is co-hosted by Travis and his brother Jason Kelce, teased on social media that \"a special episode with a VERY special guest\" will be released on Wednesday.\nThey illustrated the post with a picture of Jason wearing an Eras Tour tee and a vaguely Swift-shaped silhouette.\nSoon after that post went up, the official fan site Taylor Nation posted, \"Thinking about when she said 'See you next era.'\"\nThe post featured a number of onstage photos showing Swift wearing orange during the Eras Tour -- the same background color that was used on the New Heights post.\nAll this has, of course, convinced Swifties that she may use an appearance on New Heights to announce her next album.\nWhile Swift has never appeared on the brothers' podcast, she's been mentioned a few times on the show.\nIn July 2023, Travis Kelce talked about how he wanted to give Swift a friendship bracelet at her concert with his number on it.\nHe also reacted to the time she attended her first Chiefs game in September 2023.\nAfter Travis Kelce made a cameo during the Eras Tour in June 2024 in London, he also spoke about the experience on the podcast and said \"it was awesome.\"\nIn January, Travis Kelce said Swift \"listens every week\" to the \"New Heights\" podcast.\nThe next \"New Heights\" podcast with Swift arrives on Wednesday at 7 p.m. ET."
    }
  ],
  "argos_summary": "The Perseid meteor shower is expected to peak on Tuesday night into early Wednesday morning, with scientists predicting up to 50 meteors per hour under optimal conditions. The meteors are caused by Earth passing through debris from Comet Swift-Tuttle, and the best viewing time is around 2 to 4 a.m. local time. Despite moonlight affecting visibility, observers can still expect to see 10 to 20 meteors per hour. For the best experience, viewers should find a dark location and allow their eyes to adjust to the darkness.",
  "argos_id": "89ZBJJTYU"
}