{
  "url": "https://www.thestreet.com/travel/airlines-not-flying-to-dc-trump",
  "authorsByline": "Veronika Bondarenko",
  "articleId": "e721d84bf0444a3bb72f0536b358837c",
  "source": {
    "domain": "thestreet.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.thestreet.com/.image/ar_1.91%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_1200/MjEzODc2MjUyMzYzMjA0MDQ3/washington-reagan-national-airport.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T00:07:00+00:00",
  "addDate": "2025-08-12T00:11:54.937019+00:00",
  "refreshDate": "2025-08-12T00:11:54.937022+00:00",
  "score": 1.0,
  "title": "Multiple airlines have stopped flying to Washington, D.C.",
  "description": "Multiple airlines have significantly scaled back service.",
  "content": "On Aug. 11, President Donald Trump announced that he is federalizing the police and bringing over 800 National Guard troops into Washington, D.C., as part of his stated goal to crack down on crime.\n\nStating that crime is “totally out of control,” despite the fact that actual numbers are at a 30-year low and down 26% from August 2024, Trump made repeated comments about “crime, savagery, filth, and scum” without the White House clarifying what the role of the troops in the city would be.\n\nPresident Trump also put out several Truth Social posts telling homeless people to “leave now” and vowing to use military force to remove them from the city.\n\nDon't miss the move: SIGN UP for TheStreet's FREE Daily news\n\nAirline says it will \"continue to operate nonstop flights\" to six destinations\n\nWhile the decision is driven by shortages of its Boeing 787 (BA) planes as they go through a retrofitting and an airspace ban by Pakistan, this is the atmosphere under which Air India announced that it is canceling all of its flights between Washington Dulles International Airport (IAD) and Delhi in September 2026.\n\n“This extensive retrofit programme, aimed at significantly enhancing customer experience, necessitates a prolonged unavailability of multiple aircraft at any given time until at least end of 2026,\" Air India said in a statement.\n\nThis means that the flagship carrier will offer no flights between India and the capital of the U.S. for an undefined period.\n\n“Air India customers will continue to have the option of one-stop flights to Washington, D.C. via four U.S. getaways — New York (JFK), Newark (EWR), Chicago, and San Francisco — with the airline’s interline partners, United Airlines (UAL) , Alaska Airlines (ALK) , and Delta Air Lines (DAL) ,” Air India said in a statement.\n\n“Air India will continue to operate non-stop flights between India and six destinations in North America, including Toronto and Vancouver in Canada.”\n\nAt the start of August, American Airlines (AAL) ran its last flight to Bermuda L.F. Wade International Airport (BDA) as part of a seasonal adjustment that also significantly decreased service to the island nation from Miami.\n\nAmid a decrease in government travel, Alaska Airlines is also running its last flights to Washington Dulles from Los Angeles and San Francisco on Aug. 19. It flies to Ronald Reagan International Airport (DCA) closer to the city’s downtown from those two cities and will continue to run these routes.\n\n“We've seen a recent decrease in demand on our routes between San Francisco-Washington Dulles and Los Angeles-Washington Dulles, potentially connected to economic uncertainty and a decrease in government-related travel,\" the airline said in a press statement.\n• Another regional airline is now on the verge of bankruptcy\n• Another country just issued a new visa requirement for visitors\n\nFollowing the fatal crash between a military Black Hawk helicopter and a commercial American Airlines flight in January 2025, there has also been significant discussion of congestion in the D.C. airspace — with over 800 flights touching down and taking off from DCA on a given day, the low room for error opens up possibilities for disaster.\n\nWhile IAD is farther away from downtown D.C., it sees an even higher number of flights in close proximity as the main and larger airport serving the United States capital.\n\n(The Arena Group will earn a commission if you book a trip.)\n\n Make a free appointment with TheStreet’s Travel Agent Partner, Postcard Travel, or email Amy Post at amypost@postcardtravelplanning.com or call or text her at 386-383-2472.",
  "medium": "Article",
  "links": [
    "https://www.thestreet.com/quote/UAL",
    "https://calendly.com/amypost/trip-planning-consultation",
    "https://www.thestreet.com/travel/russian-airlines-kosmos-bankruptcy",
    "https://www.thestreet.com/travel/american-airlines-crash-with-u-s-army-copter-leaves-no-survivors",
    "https://www.thestreet.com/newsletters/daily?utm_source=article&utm_medium=top&utm_campaign=amazing_race_daily",
    "https://www.thestreet.com/quote/DAL",
    "https://www.thestreet.com/quote/BA",
    "https://www.thestreet.com/quote/ALK",
    "https://www.politico.com/news/2025/08/11/trump-national-guard-washington-00502705",
    "https://www.thestreet.com/quote/AAL",
    "https://www.thestreet.com/travel/air-traffic-control-tower-fight",
    "https://www.thestreet.com/travel/what-is-the-travel-advisory-for-belize",
    "https://www.thestreet.com/travel/air-india-suspends-flights-to-washington-dc-amid-ongoing-tensions",
    "https://www.thestreet.com/travel/air-india-ahmedabad-crash",
    "https://www.thestreet.com/travel/israel-new-visa-requirements-2025",
    "https://www.thestreet.com/travel/trump-report-national-park-signs"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "flights",
      "weight": 0.080438435
    },
    {
      "name": "nonstop flights",
      "weight": 0.08028383
    },
    {
      "name": "Air India customers",
      "weight": 0.07988421
    },
    {
      "name": "Washington Dulles International Airport",
      "weight": 0.07884044
    },
    {
      "name": "Air India",
      "weight": 0.078752406
    },
    {
      "name": "non-stop flights",
      "weight": 0.07496068
    },
    {
      "name": "Washington Dulles",
      "weight": 0.06924582
    },
    {
      "name": "United Airlines",
      "weight": 0.063414
    },
    {
      "name": "India",
      "weight": 0.06296932
    },
    {
      "name": "American Airlines",
      "weight": 0.06218396
    }
  ],
  "topics": [
    {
      "name": "Aviation"
    },
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.91943359375
    },
    {
      "name": "/News/Other",
      "score": 0.77685546875
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.6767578125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.60498046875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.568359375
    }
  ],
  "sentiment": {
    "positive": 0.03956059,
    "negative": 0.7735405,
    "neutral": 0.18689892
  },
  "summary": "Several airlines have stopped flying to Washington, D.C. due to shortages of its Boeing 787 (BA) planes and an airspace ban by Pakistan. Air India is canceling all flights between Washington Dulles International Airport (IAD) and Delhi in September 2026 due to a prolonged retrofit programme. The airline plans to continue to operate non-stop flights to six destinations in North America, including Toronto and Vancouver in Canada. Meanwhile, American Airlines has run its last flight to Bermuda L.F. Wade International Airport in August and Alaska Airlines has also stopped running its last flights to Washington DC.",
  "shortSummary": "Air India cancels all flights to Washington, D.C, due to severe shortage of Boeing 787s, while American Airlines and Air India continue operating non-stop flights to six destinations.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ef99dbd0ce84a3e995bf5e03380f942",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "On August 11, President Trump announced the federalization of police and the deployment of over 800 National Guard troops to Washington, D.C., citing a rise in crime despite statistics showing a 30-year low. He also urged homeless individuals to leave the city and threatened military action to remove them. In related news, Air India will cancel all direct flights between Washington D.C. and Delhi until at least the end of 2026 due to aircraft retrofitting, while other airlines are adjusting their services amid decreased demand and concerns over airspace congestion.",
  "argos_id": "8E87CZ9OH"
}