{
  "url": "https://www.newsmax.com/us/karoline-leavitt-white-house-donald-trump/2025/08/12/id/1222200/",
  "authorsByline": "Michael Katz",
  "articleId": "5facdb30e02d49ce98b3fe9e89769480",
  "source": {
    "domain": "newsmax.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "FL",
      "county": "Palm Beach County",
      "city": "Boca Raton",
      "coordinates": {
        "lat": 26.3586885,
        "lon": -80.0830984
      }
    }
  },
  "imageUrl": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=a5bfb99a-1561-48f7-87ac-dfa0a7ddb7b7&SiteName=Newsmax",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T14:37:21-04:00",
  "addDate": "2025-08-12T19:06:33.709252+00:00",
  "refreshDate": "2025-08-12T19:06:33.709254+00:00",
  "score": 1.0,
  "title": "WH Boasts Successes on 1st Day of D.C. Police Takeover",
  "description": "More than 800 law enforcement officers hit the streets in Washington D.C., on Monday and made more than 20 arrests, the first day that President Donald Trump ordered federal management of the city's police department...",
  "content": "More than 800 law enforcement officers hit the streets in Washington D.C., on Monday and made more than 20 arrests, the first day that President Donald Trump ordered federal management of the city's police department, White House Press Secretary Karoline Leavitt said.\n\n\"Yesterday, President Trump took bold action to finally restore law and order right here in our nation's capital,\" Leavitt said Tuesday during a news conference that aired live on Newsmax and the Newsmax2 online streaming platform.\n\n\"The president declared a crime emergency in the District of Columbia, federalized the D.C. police department, and mobilized the D.C. National Guard to end violent crime in our nation's capital as part of the president's massive law enforcement surge,\" Leavitt said. \"Last night, approximately 850 officers and agents were surged across the city. They made a total of 23 arrests, including multiple other contacts last night.\n\n\"These arrests consisted of homicide, firearms offenses, possession with intent to distribute narcotics, fare evasion, lewd acts, stalking, possession of a high-capacity magazine, fleeing to elude in a vehicle [with] no permits, driving under the influence, reckless driving, and a bench warrant.\"\n\nLeavitt added six illegal handguns were seized and that \"this is only the beginning.\"\n\n\"Over the course of the next month, the Trump administration will relentlessly pursue and arrest every violent criminal in the district who breaks the law, undermines public safety, and endangers law-abiding Americans,\" Leavitt said. \"President Trump will not be deterred by soft-on-crime Democrats and media activists who refuse to acknowledge this rampant violence on our streets.\n\n\"He is going to make our nation's capital the most beautiful and safe city on Earth, just as he promised on the campaign trail.\"\n\nTrump announced Monday that the city's police department would be put under federal control, and National Guard troops have been deployed after he declared a public safety emergency. Using temporary powers from the Home Rule Act of 1973, the president can oversee the police for up to 30 days, but any extension would need congressional approval or a legal amendment.",
  "medium": "Article",
  "links": [
    "https://www.whitehouse.gov/presidential-actions/2025/08/restoring-law-and-order-in-the-district-of-columbia/",
    "https://www.newsmaxtv.com/n2",
    "https://www.newsmax.com/live"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "President Trump",
      "weight": 0.08367048
    },
    {
      "name": "President Donald Trump",
      "weight": 0.0826421
    },
    {
      "name": "Donald Trump",
      "weight": 0.07499008
    },
    {
      "name": "White House Press Secretary Karoline Leavitt",
      "weight": 0.07165255
    },
    {
      "name": "Trump",
      "weight": 0.07138631
    },
    {
      "name": "Karoline Leavitt",
      "weight": 0.0697691
    },
    {
      "name": "violent crime",
      "weight": 0.0693701
    },
    {
      "name": "law",
      "weight": 0.06849659
    },
    {
      "name": "1st Day",
      "weight": 0.06771748
    },
    {
      "name": "Washington D.C.",
      "weight": 0.0669837
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.97412109375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.8984375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.8310546875
    },
    {
      "name": "/News/Local News",
      "score": 0.716796875
    },
    {
      "name": "/News/Other",
      "score": 0.57861328125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.56494140625
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.4599609375
    }
  ],
  "sentiment": {
    "positive": 0.060538277,
    "negative": 0.71726376,
    "neutral": 0.22219795
  },
  "summary": "On the first day of President Donald Trump's presidency, over 800 law enforcement officers in Washington D.C. made over 20 arrests, including those of homicide, firearms offenses, fare evasion, lewd acts, stalking, and a high-capacity magazine possession. The White House Press Secretary, Karoline Leavitt, praised the actions as a bold move to restore law and order in the city. The president declared a crime emergency in the District of Columbia and federalized the police department, and mobilized the D.c. National Guard troops were also deployed.",
  "shortSummary": "The White House praised the success of its federal police takeover in Washington, making over 20 arrests and deploying National Guard troops.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1d8806005a5c453a8740f0d60dc19249",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/08/restoring-law-and-order-in-the-district-of-columbia/",
      "text": "Memorandum for THE SECRETARY OF DEFENSE\nSUBJECT: Restoring Law and Order in the District of Columbia\nSection 1. Background. As President of the United States and Commander in Chief of the District of Columbia National Guard, it is my solemn duty to protect law-abiding citizens from the destructive forces of criminal activity. That obligation applies with special force in our Nation’s capital, where, as Commander in Chief of the District of Columbia National Guard, I must also ensure that all citizens can avail themselves of the right to interact with their elected representatives, and that the Federal Government can properly function, without fear of being subjected to violent, menacing street crime.\nThe local government of the District of Columbia has lost control of public order and safety in the city, as evidenced by the two embassy staffers who were murdered in May, the Congressional intern who was fatally shot a short distance from the White House in June, and the Administration staffer who was mercilessly beaten by a violent mob days ago. Citizens, tourists, and staff alike are unable to live peacefully in the Nation’s capital, which is under siege from violent crime. It is a point of national disgrace that Washington, D.C., has a violent crime rate that is higher than some of the most dangerous places in the world. It is my duty to our citizens and Federal workers to secure the safety and the peaceful functioning of our Nation, the Federal Government, and our city.\nSec. 2. Mobilizing the District of Columbia National Guard. Pursuant to my authority under the Constitution and laws of the United States and the District of Columbia, I direct the Secretary of Defense to mobilize the District of Columbia National Guard and order members to active service, in such numbers as he deems necessary, to address the epidemic of crime in our Nation’s capital. The mobilization and duration of duty shall remain in effect until I determine that conditions of law and order have been restored in the District of Columbia. Further, I direct the Secretary of Defense to coordinate with State Governors and authorize the orders of any additional members of the National Guard to active service, as he deems necessary and appropriate, to augment this mission.\nSec. 3. General Provisions. This memorandum is not intended to, and does not, create any right or benefit, substantive or procedural, enforceable at law or in equity by any party against the United States, its departments, agencies, or entities, its officers, employees, or agents, or any other person.\nDONALD J. TRUMP"
    }
  ],
  "argos_summary": "On Monday, President Trump declared a crime emergency in Washington D.C., federalizing the city's police department and mobilizing the National Guard to combat rising violence. Over 800 law enforcement officers were deployed, resulting in 23 arrests for various offenses, including homicide and firearms violations. Trump emphasized his commitment to restoring law and order in the capital, stating that his administration would relentlessly pursue violent criminals.",
  "argos_id": "8G3BGFL2Y"
}