{
  "url": "https://www.nytimes.com/athletic/6548221/2025/08/13/jack-grealish-manchester-city-aston-villa-everton-career/",
  "authorsByline": "Jordan Campbell",
  "articleId": "3e171db0de334ea381a5a3635f333f44",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12130733/GettyImages-2210993208-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:08:38+00:00",
  "addDate": "2025-08-13T04:15:43.475175+00:00",
  "refreshDate": "2025-08-13T04:15:43.475178+00:00",
  "score": 1.0,
  "title": "How do you assess Jack Grealish’s four season-spell at Manchester City?",
  "description": "Grealish won several major honours with City but only in 2022-23 did he take games by the scruff of the neck like he had at Villa",
  "content": "“There’s times where I think what might have happened if I had stayed at Villa… it would have been nice to stay there for my whole career,” says Jack Grealish in Waking the Giant, a book documenting Aston Villa’s resurgence, co-written by The Athletic’s Gregg Evans.\n\nWhat could have been is a concept Grealish has increasingly been able to contemplate at Manchester City.\n\nGrealish made only 17 Premier League starts over the last two seasons, with Jeremy Doku, Omar Marmoush, Phil Foden, Rayan Cherki, Savinho and Oscar Bobb all ahead of him.\n\nHis season-long loan to Everton ends the impasse, but Grealish has not always been cast in the wrong movie.\n\nThe £100million ($135m at current rates) fee paid to Aston Villa in 2021 made him a British record signing at the time and, in his second season, he was a starter who Pep Guardiola wholly trusted as City became only the second English team to win the Champions League, Premier League and FA Cup in the same year. An increasingly-integral Grealish started 41 games in that gilded campaign and provided 11 assists, both career-high figures in a single season, per Fbref.\n\nHowever, he was underwhelming in the three seasons either side of that treble, and, even in the periods Grealish proved valuable, it was his tactical diligence and conformity to the overarching script that was to be appreciated rather than the big-screen moments expected of a player who cost so much.\n\nGrealish’s performances were art house when he was expected to be blockbuster.\n\nThe apparent change to his game, the sacrifice and compromise of the individual in favour of the collective, has delivered five major trophies and taken him to the very top of the sport.\n\nThe trophies he won have vindicated his move but did the transfer to City fulfill him?\n\nDid it do his own game justice to become a cog in a more powerful machine than to be the brain, heart and engine of one he helped rebuild?\n\nBefore moving to Bayern Munich in 2023, aged 30, Harry Kane had spent his entire career at Tottenham Hotspur racking up individual accolades while being lamented for not being part of a team that won titles. The four years Grealish has spent at City represent the reverse.\n\nThe nine-figure price tag dictates that his time at the Etihad Stadium will be seen as a relative failure, but his exit leaves a strange CV to assess. He made 157 appearances, scored 17 goals, provided 23 assists, and regularly contributed to one of the most dominant teams in English football history — yet City could still consider themselves somewhat fortunate to ship him out on loan with an option-to-buy worth half of what he initially cost.\n\nThe loss of his sparkle returns us to the opening consideration of what could have happened had he resisted the ambition to play for the best team and manager in the world and stayed at his boyhood club.\n\nHow would he have developed had he remained the big fish in a small pond rather than the small fish in the big pond he became at City?\n\nThe vision of Grealish in claret and blue, dancing his way through impossible gaps and playing with the street footballer swagger, conjures far more colourful memories than the more considered, deliberate version witnessed at City.\n\nHe has not recaptured the feeling he transmitted of a young man overflowing with imagination and confidence.\n\nIn his final season at Villa, 2020-21, there was a reasonable argument that he was the best individual player in the league as he slalomed past crowds of players.\n\n“It was probably the best football I’ve ever played,” he says in Waking the Giant.\n\n“I was the fittest, strongest and fastest I have ever been, and obviously the most confident.”\n\nThe influence of Guardiola’s positional football is a factor. Grealish’s role was restricted in its scope given he was rigidly positioned on the left flank, but to suggest that Guardiola outlawed Grealish from dribbling is a fanciful explanation for his lack of flow.\n\nLeroy Sane, Raheem Sterling, Riyad Mahrez and Doku were all dribblers before working with Guardiola and remained so under Guardiola. Yes, he helped make some more efficient and helped pick their moments more precisely, but they are on record stating that the manager’s entire philosophy is based on working the ball to the wingers in one-v-one situations so that they can take on their opponent.\n\nThe more fundamental issue is more human. Grealish had grown up at his boyhood club and established himself as the best player in the team at an early age, which is why Villa team-mate John McGinn joked that his job was to simply “give the ball to Jack”.\n\nOnce he moved to City, that deference was gone. Grealish remained a very good player whose ability to retain possession and combine in tight areas is up there with the best, but it often felt like he internalised his role as being about working the ball to Kevin De Bruyne, Erling Haaland or Foden rather than being the one to produce magic.\n\nHe may have been considered as De Bruyne’s heir when he joined in 2021 but his status has slipped, even if, in December, it seemed like his manager may have had a belated epiphany as he started playing him in central midfield.\n\n“He has the attributes to play there,” said Guardiola.\n\n“Maybe it was my mistake to play him as a winger. But in Aston Villa with Dean (Smith) he started from, I would say, the left position, the winger position, and after going more inside. Here it’s a more fixed position, more in the places.”\n\nWhen assessing the motivations behind the option to stay at Villa in 2021, second behind loyalty is the England national team and whether his roaming style of play would have helped him become the talismanic creator many feel was missing under Gareth Southgate.\n\nGrealish accepted that he had to move this summer to play regularly. Next year’s World Cup in the U.S., Mexico and Canada could represent his last chance to leave an imprint on the national team.\n\nHaving made his England debut in August 2020, aged 24, Grealish has gone from a total of 12 caps and seven starts when he joined City in August 2021 to 39 caps and 18 starts.\n\nThe hair band, the trademark low socks, the mesmerising dribbling ability, the caring brotherly nature, the off-the-pitch antics — Jack the lad, literally.\n\nGrealish had everything to become English football’s poster boy. In some ways, he did. After his move to City in 2021, he was the face of the club and was a staple of their kit launches. A Gucci brand ambassador deal followed, as did contracts with Puma, Pepsi, Bose, Airwayz, Electronic Arts and Hellmann’s.\n\nThose are deals that players only get if they are playing at the very top level. If anything summed up the dichotomy between Grealish’s potential as the public’s golden boy and the flatlining four years at City, however, it is the last commercial endorsement in that list.\n\nHe spent the summer of 2024 plastered across the nations’s televisions as the face of the mayonnaise brand’s ‘Up Your Game’ barbecue campaign for Euro 2024, but was left out of Gareth Southgate’s 26-man squad.\n\nGrealish said it was the hardest moment of his career and vowed to use it as motivation but last season was essentially a write-off as Guardiola began leaving him out of squads completely.\n\nGrealish has realised his trophy ambitions during his time at City but he turns 30 next month. He will banking on rediscovering his spark and earn a place in Thomas Tuchel’s England squad next summer.\n\nEverton are a club starting a fresh chapter at their state-of-the-art stadium, searching for a new king after years of simply surviving. On paper, it looks as good a fit as Grealish could have hoped for.\n\nThere is a perception that has developed over the years that David Moyes is a manager who is inherently defensive and predisposed to athleticism over flair — but tell that to Steven Pienaar, Mikel Arteta, Leon Osman and Jarrod Bowen, just some of the smaller, technical-based players he helped thrive at Everton and West Ham United. Iliman Ndiaye is not exactly looking inhibited on Everton’s left wing.\n\nThey should provide Grealish with the platform to be the main man again and the freedom to take games by the scruff of the neck in a way that has been absent for far too long.\n\nIs it possible to rediscover that identity and to play with the same youthful after years of playing and thinking in a much less spontaneous way? It is difficult to imagine that gift being recycled once the genie has been put back in the bottle but, three days after Grealish reaches his milestone birthday, he will face his former club Villa.\n\nIt is a fixture that will cause him to once again ponder the varying roads that his career could have taken.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6549005/2025/08/12/jack-grealish-everton-transfer/",
    "https://www.nytimes.com/athletic/6538344/2025/08/11/jack-grealish-everton-loan-man-city/",
    "https://www.nytimes.com/athletic/5573043/2024/06/20/jack-grealish-mayonnaise-and-marketing-mishaps-what-happens-when-your-star-gets-dropped/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jack Grealish",
      "weight": 0.076314315
    },
    {
      "name": "Grealish",
      "weight": 0.07435312
    },
    {
      "name": "last season",
      "weight": 0.05675779
    },
    {
      "name": "Manchester City",
      "weight": 0.05596678
    },
    {
      "name": "City",
      "weight": 0.054963324
    },
    {
      "name": "Aston Villa",
      "weight": 0.05241659
    },
    {
      "name": "Villa",
      "weight": 0.046452887
    },
    {
      "name": "Pep Guardiola",
      "weight": 0.045015045
    },
    {
      "name": "players",
      "weight": 0.044546608
    },
    {
      "name": "Guardiola",
      "weight": 0.04359897
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97314453125
    },
    {
      "name": "/News/Sports News",
      "score": 0.9560546875
    }
  ],
  "sentiment": {
    "positive": 0.19871803,
    "negative": 0.40875828,
    "neutral": 0.39252362
  },
  "summary": "Jack Grealish's four-year spell at Manchester City has been questioned as he ponders his future at the club, where he made only 17 Premier League starts over the last two seasons. The £100m ($135m) fee paid to Aston Villa in 2021 made him a British record signing. Despite being an integral part of the team and winning five major trophies, he has not recaptured the flair of a young player. His departure from City leaves him with an option-to-buy worth half what he initially cost. Despite his successful loan spell, Grealishes has not fully developed his game at City. He credits his time at City to his former coach, Pep Guardiola, for his innovative positional football philosophy.",
  "shortSummary": "Jack Grealish's four season at Manchester City ended in disappointment, with limited starts, and his departure raising concerns about his future progression.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "1ec9907473f2477fbffb4cbe643b758c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6538344/2025/08/11/jack-grealish-everton-loan-man-city/",
      "text": "Everton have agreed a deal to take Jack Grealish on loan from Manchester City.\nThe deal still needs to be finalised but a medical is being scheduled today for the England international. An option to buy in the region of £50million ($67.3m) will be included.\nThe Athletic reported on August 6 that Everton had opened talks with City over a move for the 29-year-old, whose contract at the Etihad Stadium expires in 2027.\nAdvertisement\nGrealish made only 16 starts in all competitions last season and just seven in the Premier League. He was left out of the City squad for their final game of the Premier League season against Fulham — which manager Pep Guardiola described as “nothing personal” — and was not included in the squad that travelled to the United States for this summer’s Club World Cup. Phil Foden, Savinho, Jeremy Doku, Kevin De Bruyne, Omar Marmoush and Bernardo Silva have often been preferred to Grealish in City’s front line.\nAfter coming through the academy at Aston Villa and becoming club captain in 2019, Grealish joined City for a club record fee of £100million, also a record amount for a British player. He signed a six-year deal and has made 157 appearances for the club, scoring 17 goals and providing 23 assists.\nGrealish has won the Premier League three times with City, as well as the Champions League, FA Cup and the Club World Cup. He was an integral part of the team in the 2022-23 campaign, making 50 appearances as City won the treble, starting every knockout game in the Champions League.\nGuardiola had previously expressed a desire to see Grealish return to the level that she showed during that campaign. “Do I want the Jack that won the treble? Yeah, I want it, but I try to be honest with myself,” the Spaniard said in January.\n“I fought a lot for him, fought a lot to be here. I know that he can do it because I saw him. I saw his level and I want that, every single training session and every single game.”\nA deal for Grealish would see him become Everton’s fifth new arrival of the summer, with Thierno Barry, Mark Travers, Adam Aznou and Kiernan Dewsbury-Hall moving from Villareal, Bournemouth, Bayern Munich and Chelsea respectively. Carlos Alcaraz also joined the club permanently after his loan spell at Goodison Park last season.\n‘Grealish could be a talisman – but not a signing without risk’\nAnalysis by Everton correspondent Patrick Boyland\nGrealish would be a marquee signing, and one that would excite most Everton fans. The Merseyside team had the fourth-best defensive record in the Premier League last season, but have long lacked a game-changer in attack.\nAt his best, Grealish could be that player; a catalyst to drive the side on, and a talisman as Everton head into a new era in their 52,769-capacity Hill Dickinson Stadium.\nAdvertisement\nGrealish is expected to be the main man in David Moyes’ side, dictating play both from the centre and the left. In that sense, it will be intriguing to see how it all knits together.\nIliman Ndiaye, Everton’s most productive attacker last season, works in similar areas, while new £25million signing Kiernan Dewsbury-Hall lined up in the No 10 role at the weekend against Roma. Everton also still need to address the lack of pace and goal threat on the right flank.\nWith Everton expected to pay a sizeable chunk of Grealish’s £300,000-a-week wages, this is a costly signing not without an element of risk. One that may well define the early part of The Friedkin Group’s (TFG) tenure.\nThe total package, comfortably in excess of £10m, could end up looking like a bargain if the former Villa man returns to the levels of old and catapults the side up the table.\nBut there are, of course, no guarantees. Grealish spent last season on the periphery at City and needs minutes if he is to have a chance of reviving his fortunes and making the World Cup with England next summer.\nWhatever happens from here, American owner TFG has shown it will put its hand in the pocket and that the years of austerity at Everton are over. It will be fascinating to see how it all works out.\n(Top photo: Carl Recine/Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6549005/2025/08/12/jack-grealish-everton-transfer/",
      "text": "A gamble worth taking. That was the view of senior figures connected to Everton and owner The Friedkin Group (TFG) as the club weighed up an ambitious move to sign Jack Grealish from Manchester City.\nAs far as they were concerned, the risk attached did not outweigh the potential reward. Instead, the general feeling was that the move had the potential to be a game-changer, ushering in an ambitious new era for Everton.\nAdvertisement\nThey had long been aware Grealish could be available in this window, and kept tabs on his situation throughout the summer. They also knew he would not come cheap, with City initially favouring either a permanent transfer or a loan with all of his wages covered.\nEverton could not go quite that far, even with the billionaire backing of TFG. Internal estimates suggested they could stretch to an overall package of around £12million ($16.2m) for the season, which would make Grealish comfortably the highest-paid player at the club.\nAt certain points, there was a suspicion the 29-year-old would be pushed elsewhere, towards a more lucrative deal, or that a club offering Champions League football in a campaign leading up to the World Cup would lean on him to plug a gap that had emerged during their pre-season.\nGrealish, though, let it be known that he wanted Everton. Those regular checks, made throughout the off-season, paid dividends, as did the intervention of the manager David Moyes, who made a compelling case during talks.\nDiscussions, formal and otherwise, took place over a couple of months, then, as reported by The Athletic, accelerated last week between the clubs. Negotiations on the Everton side were handled by head of trading Nick Hammond and new chief executive Angus Kinnear.\nAt that stage, Grealish had already made up his mind.\nThe attacking midfielder had expected to be plying his trade away from City in the coming season since the end of the last one but, much like Everton, pushed for the move to happen now rather than right at the end of the window in late August, after the campaign had begun. His desire to join Everton helped to smooth out the process during talks. For him, hitting the ground running in a World Cup season is key, given his lingering international aspirations.\nThe momentum was such that much of the excitable chatter at Everton’s new Hill Dickinson Stadium on Saturday, as the first team played their final pre-season friendly against Italian visitors Roma, was about the prospect of Grealish being in situ before the opening fixture away at promoted Leeds United on Monday, August 18.\nAdvertisement\nAn outline agreement was subsequently reached between the two clubs on Monday. Though at that stage, some finer details were still being thrashed out. This was a complex deal, including discussions on how image rights and bonuses from his City contract could be translated into the new agreement. Yet there was enough confidence on both sides for the medical to happen at Everton’s usual facility in Newton-le-Willows, a small market town midway between Liverpool and Manchester. There, in his velour tracksuit, Grealish posed for photos with excited Everton fans ahead of the move being confirmed.\nHe joined officially on Tuesday, before heading to the stadium to go through his media duties with club channels. Grealish, who turns 30 on September 10, arrived at the new £800m facility on Liverpool’s waterfront to find his name up on the big screen and on the LED advertising boards around the pitch. It is early days, but the club are doing their best to make him feel at home.\nEverton see this as a statement signing — their first of those since Colombia captain James Rodriguez’s free-transfer arrival from Real Madrid in September 2020 and a potentially symbolic moment for the new ownership. After years of penny-pinching and doom-laden financial predictions, the club’s era of austerity looks very much over.\nEverton will cover around three-quarters of Grealish’s £300,000 a week salary, with City including a £50m purchase option in the deal, but a fee could still be negotiated if Everton want to make it permanent next summer.\nThat final bit is a conversation for another day, though. For now, the belief is that Everton have landed much-needed star quality for the first season of their new stadium — and a potential coup if Grealish can get anywhere close to recapturing the form of old.\nGrealish was not short of admirers, even if his situation at City created a considerable barrier to entry for interested parties. He had been disappointed with his lack of minutes last season and knew it was time to move on after four years at the Etihad, while the club had also planned for life without him.\nAdvertisement\nFellow Premier League side West Ham monitored the situation, while a potential move to Italian side Napoli was discussed. Celtic expressed interest, but Grealish never seriously considered a move to Scotland.\nTurkey’s Fenerbahce were among the most significant contenders, and could have got close to meeting City’s financial demands. There was a sense from others involved in the deal that Grealish was being pushed in that direction, but the midfielder was not keen on moving to Istanbul. He had sought advice from friends regarding a potential transfer to Turkish football and was keen to remain in the Premier League.\nA decisive intervention from Moyes swung the matter in Everton’s favour. During lengthy talks between the Scot, Grealish and the player’s camp, it was emphasised that he would be a key pillar in Moyes’ setup this season. Discussions also centred on where he would fit into the side, with Grealish likely to drift between the No 10 role and left flank. It was felt that Moyes was likely to be a positive influence on the player at a pivotal moment in his career.\nWhile Everton started the summer by bringing in youngsters such as 22-year-old Thierno Barry and Adam Aznou, 19, Moyes wanted to add more Premier League experience as well as a marquee signing to excite the supporters. He was backed in that pursuit by the owners and CEO Kinnear.\nAll of that was important to Grealish in what is a World Cup year. He is desperate to get back in the England fold, having not made a squad since winning the most recent of his 34 senior international caps against Finland last October, and has held positive talks with national-team manager Thomas Tuchel. He knows he needs to play regularly at club level to be considered, with the prospect of participation in the tournament in North America next summer a key motivation.\nEverton sold their project to him. Alongside the sense that he would be the main man in their attack, they are showing ambition with their new stadium and other work in the transfer market. Moyes is targeting another three or four new additions before the end of the window, with new wingers, a central midfielder and a right-back on his list.\nThere was a sense that Grealish needed to be somewhere he felt valued. During a summer trip to the Spanish resort of Marbella, he bumped into former Everton captain Alan Stubbs, who emphasised how much he would be loved by the club’s fanbase.\nPositive references about the place came from players who have featured more recently for Everton, with goalkeeper Jordan Pickford a friend from England duty and represented by the same CAA Stellar agency. Everton’s relationship with Stellar is positive following discussions with one of their other clients, striker Liam Delap, before his move from Ipswich Town to Chelsea earlier this summer. Also, in signing for Everton, Grealish will avoid having to relocate from his Cheshire home.\nAdvertisement\nHe will wear the No 18 shirt at his new club. The No 8 was also vacant, but the Birmingham-born midfielder decided to follow in the footsteps of two personal heroes, Paul Gascoigne and Wayne Rooney, who both wore 18 at Everton. “I spoke to Wayne before I came here and I mentioned that to him – about the number 18 – so I hope he’s happy as well,” Grealish said.\nThere is no guarantee this move will work out, but all parties felt confident enough to give it a go. Creating the right conditions for Grealish to succeed at Everton will be key if he is to return to the form that led to a British record £100million move from Aston Villa to City in the summer of 2021.\nWith no major national-team competition this summer and having been left out of City’s squad for the Club World Cup ahead of a potential move, Grealish has had a long break to relax and refresh.\nThere have been family holidays and trips to Marbella, while he also spent time working on his fitness with a personal trainer. Grealish is set to train with his new team-mates this week, making him available for that season opener at Leeds next Monday, if selected.\nAs stated earlier, he is understood to be desperate to hit the ground running and make an impression.\nEverton will afford him the opportunity to do just that, albeit at considerable cost.\nA gamble worth taking? We’re about to find out.\nWhatever happens, it’s likely to be fun. And Everton fans have not had anywhere near enough of that in recent seasons.\n(Top photo: Everton FC)"
    },
    {
      "url": "https://www.nytimes.com/athletic/5573043/2024/06/20/jack-grealish-mayonnaise-and-marketing-mishaps-what-happens-when-your-star-gets-dropped/",
      "text": "One is a beautifully constructed tale of despair and hope, starring England’s latest man of destiny, with cameos from David Beckham, Frank Lampard, Stormzy and Ian Wright, and its soundtrack is one of the most recognisable songs in the world, sung by an iconic musician.\nFilmed in multiple locations and combined with instantly recognisable archive footage, it has been universally praised by industry experts and should win plenty of advertising awards, even if Jude Bellingham, its star, and his England team-mates at this summer’s European Championship do not.\nThe other was shot in a studio in Manchester and features no dialogue, a non-specific setting, some bland music and Jack Grealish, who failed to make England’s squad for Euro 2024 after a lacklustre 2023-24 season for Manchester City.\nIt has been widely ridiculed on social media and in national news outlets.\nBut be honest, how many of you have seen or read about Adidas’ “Hey Jude” campaign? And, if you have, how many of you will definitely choose that brand next time you are shopping for a tracksuit?\nNow ask yourself if you have seen or heard about Grealish’s BBQ work for Hellmann’s mayonnaise?\nAdvertisement\nOK, this might not work for our readers outside the UK, particularly those of you who live west of the United States’ Rocky Mountains, where Hellmann’s sauces are sold under a different name but the same branding (yes, I have only just discovered this while researching this piece).\nBut if we are measuring the success of these adverts in terms of impact in their home markets, it is Germany 5 Scotland 1 territory and Jack Grill-ish, or maybe G-relish, is doing the cooking.\nFor example, the contrasting nature of the two campaigns was discussed by Richard Osman this week in his podcast, The Rest Is Entertainment, which the author and comedian co-hosts with journalist Marina Hyde. He mentioned Hellmann’s mayonnaise but forgot to say which brand Bellingham was advertising.\nThat is the problem with these mini-epics for global sports brands; we instantly recognise the genre but forget the trainers.\n“Grealish not making the team isn’t a big issue for Hellmann’s,” explains Tim Crow, former head of international sports marketing agency Synergy.\n“Hellmann’s is a European-wide sponsor, not just England, and this campaign has been going for weeks, so most of the media budget will be already spent. They’ve had their value out of Grealish.\n“Plus, for the ‘big eventers’ who Hellmann’s is targeting, his selection or non-selection is unlikely to alter their purchase behaviour.”\nCrow’s point about this campaign being bigger than Grealish is a good one, as Hellmann’s is one of dozens of brands owned by Unilever. The British-based multinational signed a sponsorship with UEFA, European football’s governing body, at the end of last year, allowing it to use the Euro 2024 logo to flog its deodorants, sauces and soaps all over Europe.\nThe Hellmann’s campaign, which is based on the simple premise that Europeans like barbecued food and big football tournaments played in their summers, often at the same time, has country-specific versions, featuring Italy’s Federico Chiesa and Germany’s Joshua Kimmich, both of whom did make their national squads for the finals, and former Czech Republic goalkeeper Petr Cech and ex-Spain striker David Villa.\nAdvertisement\nVery similar adverts to the one featuring Grealish, a hamburger and some BBQ tongs were shot with the aforementioned quartet in studios in Munich and Turin three months ago.\nAnd while the basic advert is unlikely to win any advertising-industry Oscars, Hellmann’s has been pumping out plenty of additional content, including a ‘Grilling Grealish’ Q&A with UK sports presenter Laura Woods, in which he reveals his dream guests for a summer BBQ would be England legend Paul Gascoigne, former Aston Villa team-mate John McGinn (in Scotland’s squad at these Euros), current City team-mate Kyle Walker (a senior member of England’s squad) and French great Zinedine Zidane. Presumably, he would only invite Albert Einstein, Helen of Troy and Napoleon to a proper dinner party.\nWoods, by the way, makes a fleeting appearance in the “Hey Jude” advert, too (and is also one of the hosts of ITV’s coverage of the tournament on British free-to-air television), so perhaps she is the real, must-have billboard of the British summer.\nHellmann’s declined to comment for this piece, but did so politely and without exuding “we’re gutted” vibes. In fact, the company seemed pretty happy that lots of us Brits are talking about a condiment made from egg yolk, oil and water. Job done.\nIt should also be noted that advertisers backing the wrong horses is hardly new or unusual.\nBritish consumers are currently being sold Google Pixel phones by Marcus Rashford, supermarket chain Marks & Spencer’s various wares by Ben Chilwell and EE mobile phone and broadband packages by Harry Maguire, none of whom joined Bellingham on England’s plane to the finals in Germany.\n“It is bad luck,” says AJ Abraham, co-founder of PLUS, a sports and entertainment consultancy based in Manchester. “Whatever is said and done, these guys still have big profiles and massive reach — that is why the brands chose them.\n“Brands can always make some changes to campaigns but the costs involved prohibit them from pushing the boat out. These campaigns would have been locked out months in advance (of the tournament starting last week), with planning, delivery and then media buys.”\nRicardo Fort, former head of global sponsorships at Coca-Cola and Visa, agrees.\n“I’ve seen this many times, and I have been a victim of guesswork,” says Fort.\n“Perhaps the best example of the risks you have to take is the Panini album before every World Cup. They must select and negotiate with the players months before the team is selected, so there are always a few players in the album who do not make the event.”\nAdvertisement\nFootballstickershop.com is selling Chilwell stickers from the unofficial Euro 2024 album Panini has produced with Marks & Spencer for just 25p (32 cents).\nAnd the official Euro 2024 album, made by Panini’s rival Topps, has Leicester City’s Luke Thomas in its England squad, despite him not playing once for his parent club last season in the second-tier Championship and also failing to make much of a mark on loan at Sheffield United of the Premier League and then Middlesbrough in the Championship. Topps went for Thomas because Panini had the image rights for all the other left-backs on coach Gareth Southgate’s (very) long list.\nNigel Currie, former chairman of the European Sponsorship Association, is another who makes the “there but for the grace of God go we” point when it comes to choosing the stars of your ad campaigns, but does wonder if Hellmann’s and Google should perhaps have been paying better attention to the seasons Grealish and Manchester United’s Rashford were having for their clubs, particularly now that England have a few options to choose from to be the face of them.\n“They are clearly pressing ahead with the campaigns, though, hoping that the players’ profiles and the buzz from the Euros will create the traction they want,” says Currie.\n“But I suspect there will be some muted disappointment from the agencies and brands involved. The dream scenario is having the player who scores a wondergoal or the winner for England promoting your product.”\nWhat he and all the other experts agree on is how cool it would be if Grealish and Hellmann’s could get the band back together for a second album, so to speak.\n“If I was the brand, I would pay these guys extra — if the players are up for it — to make even more great content and celebrate the England team as a fan,” Abraham says.\nAdvertisement\nRory McEntee, marketing director for British fitness company Gymbox, has posted on LinkedIn urging people to “say a prayer for the (Hellmann’s/Grealish) partnership” and adding “let’s use (LinkedIn) for good and throw them a few ideas to get through this”.\nHe suggested sending Grealish out to Germany to barbecue bratwurst with fans before an England game, while Australian-based brand director Anthony Smith pitched “Condiment Continent”, a campaign based on Grealish visiting the countries England play in the tournament and sampling their sauces.\nAs mentioned, Hellmann’s did not want to get involved in such banter. But I can’t help thinking it has something on the back burner.\nGO DEEPER\nThe Radar - The Athletic's 50 players to watch at Euro 2024\n(Top photo: Richard Sellers/Sportsphoto/Allstar via Getty Images; design: Eamonn Dalton)"
    }
  ],
  "argos_summary": "Jack Grealish's move from Aston Villa to Manchester City for a British record fee of £100 million has been a mixed journey, marked by significant achievements and personal struggles. While he played a crucial role in City's treble-winning season, his subsequent seasons saw him sidelined, leading to a loan transfer to Everton as he seeks to regain his form and secure a spot in the England national team ahead of the World Cup. The transition to Everton is seen as an opportunity for Grealish to reclaim his status as a key player, allowing him to showcase his talent and creativity that flourished during his time at Villa.",
  "argos_id": "8ITYROMJW"
}