{
  "url": "https://www.usmagazine.com/celebrity-news/news/alexis-gosselin-makes-rare-appearance-with-mom-kate-in-tiktok-video/",
  "authorsByline": "Elise Nelson",
  "articleId": "7d35e42fb6014783a63a20d37c5a1db4",
  "source": {
    "domain": "usmagazine.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://www.usmagazine.com/wp-content/uploads/2025/08/TCDKAPL_EC002-Kate-Gosselin-Kids.jpg?crop=0px%2C217px%2C2000px%2C1051px&resize=1200%2C630&quality=86&strip=all",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T16:29:25-04:00",
  "addDate": "2025-08-12T20:39:06.701812+00:00",
  "refreshDate": "2025-08-12T20:39:06.701814+00:00",
  "score": 1.0,
  "title": "Alexis Gosselin Makes Rare Appearance With Mom Kate in TikTok Video",
  "description": "Alexis Gosselin appeared on mom Kate Gosselin’s TikTok, days after Collin Gosselin shared an emotional message about being 'forced apart' from siblings",
  "content": "Alexis Gosselin made a rare appearance on mom Kate Gosselin’s TikTok page days after estranged brother Collin Gosselin spoke out about being “forced apart” from his siblings.\n\nAlexis, 21, briefly appeared in Kate’s TikTok video on Saturday, August 9. The clip showed the TLC personality, 50, packing her lunch and dinner ahead of her shift as a nurse. At one point, Alexis walked into the kitchen and gave her mom a hug before heading out for the day.\n\n“Ride carefully, and text me when you get there, please,” Kate called to her daughter, who replied, “Love you.”\n\nIn the comments section, fans marveled at how much Alexis has grown up while Kate shared more insight into her relationship with her kids.\n\n“Awe Lex with the surprise appearance!” one user wrote, while another person added, “How are you telling Lex to drive safely when she was just a baby 5 minutes ago?! 😭 Where does the time go?”\n\nA third follower wrote, “The way you can see the natural connection and love between you and Lexi is adorable.”\n\nKate replied, “I don’t see them much anymore. They come and go and I’m just left behind hoping they’ll stay longer …😩.”\n\nKate shares Alexis and her sextuplet siblings — Collin, Hannah, Aaden, Leah and Joel — as well as twins Mady and Cara, 24, with ex-husband Jon Gosselin. The family rose to fame on their reality show Jon & Kate Plus 8, which aired on the Discovery Health Channel and later TLC from 2007 to 2017. (The series became known as Kate Plus 8 following her divorce from Jon, 48, in 2009.)\n\nAlexis’ appearance on her mom’s page came days after Collin shared a throwback photo of himself and his siblings as children via TikTok, as well as a current selfie. Along with the photos, he shared a message about their estrangement.\n\n“Born to be a team, us against the world,” he wrote. “Forced to do it alone, and wonder every day what our lives could’ve looked like.”\n\nIn the caption, Collin added, “Forced apart, pitted against each other. All the fame and money in the world, but what about kids being kids? I will always love them more than anything. The tears I shed behind closed doors, thinking about the memories we could’ve shared. I love you guys.”\n\nIn 2018, Jon was granted custody of Collin after he wrote a letter to his father from a mental health facility, claiming that Kate had institutionalized him to cover up alleged abuse. Hannah also chose to live with their father in their home state of Pennsylvania. Meanwhile, Kate moved to North Carolina in 2021 with Alexis, Aaden, Leah, and Joel. Mady and Cara had already been attending separate colleges in New York at the time.\n\nKate denied Collin’s abuse claims after he made similar accusations in a July 2023 Vice TV interview.\n\n“My son Collin, whom I love with all my heart, has received multiple psychiatric diagnoses over the years,” she wrote via Instagram at the time. “For the safety of myself, his brothers and sisters and for his own well-being, he was placed in a facility following the years of outpatient treatment which proved insufficient for his needs. The decision to admit him was made by emergency room doctors following one of his many attacks/outbursts – this one involving his use of a weapon.”\n\nCollin said he would be open to reconciling with his mother in an October 2024 interview with The U.S. Sun.\n\n“So, first and foremost, my relationship with my brothers and sisters is of top priority to me,” he said. “And I think the only way that my mother and I would be able to reconnect and fix our relationship in the future is, if she would just come forward with the truth and all the things that she has kept under wraps.”",
  "medium": "Article",
  "links": [
    "https://www.usmagazine.com/entertainment/news/the-rookie-season-8-cast-whos-returning-and-whats-next/",
    "https://www.usmagazine.com/celebrities/kate-gosselin/",
    "https://www.usmagazine.com/celebrity-news/news/kate-gosselin-accused-of-tying-up-collin-keeping-him-in-the-basement/",
    "https://www.usmagazine.com/entertainment/news/collin-gosselin-says-siblings-were-forced-apart-in-emotional-message/",
    "https://www.amazon.com/MEROKEETY-Womens-Summer-Striped-Pockets/dp/B085WKKJ9V?&linkCode=sl1&tag=dotd-merokeety-striped-shirt-dress-sale-8-11-25-20&linkId=f7feced7a5edeb9678c4a84f1b3dacde&language=en_US&ref_=as_li_ss_tl",
    "https://www.usmagazine.com/celebrity-moms/pictures/kate-gosselins-relationship-with-son-collin-details/",
    "https://apple.news/TdBoH5or6Q0afHo2MxaGA6A",
    "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
    "https://www.usmagazine.com/celebrity-news/news/kate-gosselin-shares-rare-photo-of-sextuplets-on-21st-birthday/",
    "https://www.tiktok.com/@thecollingosselin/photo/7535960777837088031",
    "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-son-and-ex-wife-speak-out-after-his-death/",
    "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
    "https://www.tiktok.com/@kate.gosselin/video/7536557402766822686",
    "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mom Kate",
      "weight": 0.09692892
    },
    {
      "name": "Kate Gosselin",
      "weight": 0.09562052
    },
    {
      "name": "Kate Plus",
      "weight": 0.091140844
    },
    {
      "name": "Kate",
      "weight": 0.087033555
    },
    {
      "name": "Collin Gosselin",
      "weight": 0.085840195
    },
    {
      "name": "Alexis Gosselin",
      "weight": 0.07744478
    },
    {
      "name": "Collin",
      "weight": 0.07468769
    },
    {
      "name": "mom Kate Gosselin’s TikTok page",
      "weight": 0.06716281
    },
    {
      "name": "Jon Gosselin",
      "weight": 0.0664756
    },
    {
      "name": "ex-husband Jon Gosselin",
      "weight": 0.06563607
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.92822265625
    },
    {
      "name": "/Online Communities/Social Networks",
      "score": 0.79443359375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.7490234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/Online Video",
      "score": 0.59033203125
    },
    {
      "name": "/People & Society/Family & Relationships/Family/Other",
      "score": 0.48388671875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.358154296875
    }
  ],
  "sentiment": {
    "positive": 0.16236839,
    "negative": 0.45045292,
    "neutral": 0.38717872
  },
  "summary": "Alexis Gosselin made a rare appearance on her mom Kate Gossellin's TikTok page, shortly after her brother Collin spoke about being \"forced apart\" from his siblings. The appearance came in response to Collin's claim that he was institutionalized to cover up alleged abuse. Kate shared details about her relationship with her children, including how much Alexis has grown up and how she hopes they'll stay longer. The family rose to fame on their reality show Jon & Kate Plus 8 and later TLC from 2007 to 2017. Collin was granted custody of Collin in 2018 after he claimed custody of him from a mental health facility.",
  "shortSummary": "Alexis Gosselin made a rare appearance with her mother Kate on her TikTok page, following Collin's public statement about being separated from his siblings.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "ef14a11c940a44849f91a74774666497",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstocks-son-and-ex-wife-speak-out-after-his-death/",
      "text": "Brandon Blackstock‘s son Seth and ex-wife Melissa Ashworth Wells have spoken out about the talent manager’s death.\n“I lost my hero yesterday, words can’t describe how proud of you I am on raising me and your 3 other kids,” Seth, 18, wrote via Instagram on Saturday, August 9, alongside a series of throwback photos with his late dad. “You were a father, a son, a brother, and most importantly my best friend.”\nSeth shared that while his father is no longer with him physically, his spirit will live on in other ways.\n“You’ll have to watch me grow up from a Birds Eye view now but that’s OK with me. There’s no one else on this earth that I would want to be my dad because no one can be half the man you were to me,” he continued. “I’ll see you everyday when the sun rises and falls. I can confidently say all the deer and elk took a sigh of relief when the best hunter I’ve ever known laid his rifle down for the last time.”\n“I love you so much and can’t wait to throw a line in the water with you again. Love you dad. Be good or good at it -love your son Seth,” he concluded.\nBrandon welcomed Seth with Ashworth Wells in 2007. The exes, who were married from 1999 to 2012, also shared daughter Savannah, 23. Savannah, for her part, shares son Lake with husband Quentin Lee. Following his split from Ashworth Wells, Brandon moved on with Kelly Clarkson. The pair tied the knot in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. Clarkson filed for divorce in 2020 after seven years of marriage.\nOne day before Seth’s tribute, Ashworth Wells shared an emotional post dedicated to Brandon.\n“Brandon was full of charm, wit, and just an absolute gentleman who happened to wear cowboy boots, wrangler jeans, and a cowboy hat. He was by far, hands down, the best Daddy and Pa. He loved hard and he fought hard,” she wrote via Instagram on Friday, August 8. “The best thing Brandon has left for his children is they know where he is. I’ve heard it said, ‘Nothing is lost when you know where it is’ and Brandon is with Jesus his Savior. Savannah, Seth, and our grandchildren are the best parts of who Brandon and I are. Thank you all for your prayers and condolences. ✝️.”\nBrandon died on August 7 following a private battle with cancer.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us Weekly in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nBrandon’s cause of death was due to melanoma, which is a form of skin cancer, and the manner of his death was natural causes."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/the-rookie-season-8-cast-whos-returning-and-whats-next/",
      "text": "Fans must wait until 2026 for an all-new season of The Rookie — but Us Weekly already knows which cast members are, and aren’t, returning.\nShowrunner Alexi Hawley exclusively confirmed to Us in May that season 8 of the ABC series will feature both Oscar Hutchinson (Matthew Glave) and Monica Stevens (Bridget Regan) as villains.\n“It’s not the last we’re gonna see [of] him,” Hawley said of Oscar, who was able to escape police capture during the season 7 finale, but not with the stolen diamonds he acquired. “I think we’re heading for … a bit of an end game there, or at least the end of a chapter.”\nWhen it comes to Monica, Hawley told fans at San Diego Comic-Con in July that season 8 will begin overseas in Prague with the corrupt attorney — who made a deal with the FBI to close season 7 — front and center.\nOfficer John Nolan (Nathan Fillion) is confirmed to be making the trip alongside Detective Nyla Harper (Mekia Cox) and The Rookie: Feds’ FBI Supervisory Special Agent Matt Garza (Felix Solis), according to TVLine. But who else from the police force — and their inner circle — can fans expect to see next season?\nScroll down for everything we know about The Rookie’s season 8 cast:\nNathan Fillion\nFillion confirmed his return as officer John Nolan in April, while celebrating the season 8 renewal announcement.\n“I’ve been around long enough to know how truly challenging and rare it is to have a long running show. Thank you all for sticking around for these 7 seasons — it’s because of you that we are announcing season 8!!” the actor wrote via Instagram. “Congratulations to @alexihawley and the wonderful team that puts this show together. I am so very proud to work alongside all of you. Let’s do this! #therookie.”\nAlyssa Diaz\nDiaz’s Detective Angela Lopez is safe from the chopping block heading into season 8. She will be part of the LAPD force working to bring down Monica and Oscar — when he eventually resurfaces.\nEric Winter\nWinter will be back as Tim Bradford, who fans last saw asked Lucy Chen (Melissa O’Neil) to move in with him, but she dozed off and didn’t hear him.\n“I do think that cementing that conversation [between them] at the top of the next season and figuring out what the next [or] the right next step is, that’s gotta be our premiere, right?” Hawley told Us in May, noting that the writers will “figure it out from there” how Tim and Lucy proceed as a couple.\nWinter, meanwhile, confessed to TVLine in May that he’s unsure how Tim will proceed after putting his heart on the line. “I’m actually very curious about that,” he said. “He has to do a lot of damage control.”\nMelissa O’Neil\nO’Neil will reprise her role as Lucy Chen, but the new sergeant won’t be on the night shift much longer. “I don’t think it’s an obstacle,” Hawley teased. “The challenge of the night shift was fun in the finale but ultimately, I don’t think we’re gonna live in there for too long.”\nThe executive producer also told fans at San Diego Comic Con in July that Lucy will dive deeper into police work this season. “We have an undercover Lucy story that we’re working on in the writers’ room right now,” he said via People.\nMekia Cox\nCox will return as Nolan’s former training officer, detective Nyla Harper this season. While her story line has not been shared, Hawley told Us in May that fans will see more of Nyla and her husband, James Murray (Arjay Smith), after their rocky season 7.\n“They’ve been through the fire a bit for sure,” the showrunner said. “The inherent contradiction of his job and her job is still there. I do think that they’ve navigated it for now. They’re definitely in a stronger place than they were say early in season 7.”\nRichard T. Jones\nJones is returning as Lieutenant Wade Grey and his wife, Luna (Angela Parker), is expected to appear in several episodes as the couple is still going strong.\nWhen it comes to what Jones wants to see for Grey during season 8, he exclusively told Us in March that a cookoff between the lieutenant and rookie Miles Penn (Deric Augustine) would be fun. “I think that’d be just a great close out of an episode that, you know, everybody’s at a barbecue. That we’re having a competition. And they’ll be the judges,” he proposed.\nJenna Dewan\nHawley confirmed during San Diego Comic-Con in July that Nolan’s wife, Bailey Nune, played by Dewan, flew to Prague for the season 8 premiere alongside her TV husband. As in seasons’ past, she will continue to be part of the cast and remain Nolan’s No. 1 lady.\nShawn Ashmore\nAshmore will reprise his role as attorney Wesley Evers, but Hawley told Us that his and Angela’s marriage won’t be tested amid Monica’s return. (Corrupt attorney Monica dated Wesley prior to his relationship with the detective.)\n“At this point Monica’s got such bad blood with so many of our characters that I don’t know if she’d be shaking stuff up with Wesley and Angela,” Hawley said in the spring.\nThe showrunner also told TVLine in April that Wesley’s arc might include running for DA after his boss bowed out of the race. “We’re sniffing around a bit of where to take that story, and it would certainly make sense for Wesley, who was a defense attorney and believes very strongly in righting the wrongs of an unjust justice system,” Hawley mused. “He’s an assistant DA, they have not a ton of power, so becoming the DA would give him an ability to shake things up. So, we’re definitely kicking the tires on that idea.”\nLisseth Chavez\nChavez has been playing Celina Juarez since season 5, completing her rookie training during season 7. She is set to return for season 8 — and her romance with Rodge Bronson (Zander Hawley) could continue, according to Hawley.\n“I think they’re both young, and so I don’t know that we need to define everything [and it] doesn’t have to turn into a relationship,” Hawley explained to Us in May of Celina and Rodge’s story line. “I’m not 100 percent sure where it goes, but I do think that ultimately we are very aware that we have some very strong relationships on the show.”\nDeric Augustine\nAugustine joined the cast during season 7 as rookie officer Miles Penn. For season 8, the actor has been promoted to series regular, TVLine confirmed in July.\nShowrunner Hawley previously told Us that Miles’ “rookie year is not over,” so the writers are “going to live in his rookie year for a while.” He teased, “I think there’s a lot of places to push. I mean, he is still trying to find out who he is in Los Angeles. He tried to start dating and that went very badly in the finale. He’s living in his car. That’s obviously, you know, an obstacle for him as well to overcome. I’m excited to see where it goes.”\nPatrick Keleher\nKeleher played the controversial rookie Seth Ridley, who lied about his past and his cancer diagnosis before being cut from the LAPD Mid-Wilshire department. He returned later during season 7 after claiming that his cancer diagnosis was an insurance scam and was once again part of the training program. Seth got shot during season 7, episode 16, in the line of duty and needed his leg amputated.\nWhile fans thought it was the last they’d see of Seth, Hawley told TVLine that might not be the case. “Something shocking deserved to happen” to that character, the showrunner said in July, teasing, “And then we’ll see where it goes.”"
    },
    {
      "url": "https://news.google.com/publications/CAAqBwgKMM7UwQEwjJAU?hl=en-US&gl=US&ceid=US%3Aen",
      "text": "- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- EnglishUnited States\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Svenska\n- All languages\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Svenska\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nBefore you continue to Google\nWe use cookies and data to\n- Deliver and maintain Google services\n- Track outages and protect against spam, fraud, and abuse\n- Measure audience engagement and site statistics to understand how our services are used and enhance the quality of those services\nIf you choose to “Accept all,” we will also use cookies and data to\n- Develop and improve new services\n- Deliver and measure the effectiveness of ads\n- Show personalized content, depending on your settings\n- Show personalized ads, depending on your settings\nIf you choose to “Reject all,” we will not use cookies for these additional purposes.\nNon-personalized content is influenced by things like the content you’re currently viewing, activity in your active Search session, and your location. Non-personalized ads are influenced by the content you’re currently viewing and your general location. Personalized content and ads can also include more relevant results, recommendations, and tailored ads based on past activity from this browser, like previous Google searches. We also use cookies and data to tailor the experience to be age-appropriate, if relevant.\nSelect “More options” to see additional information, including details about managing your privacy settings. You can also visit g.co/privacytools at any time."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/brandon-blackstock-cause-of-death-revealed-after-cancer-battle/",
      "text": "The official cause of death for Kelly Clarkson’s ex-husband, Brandon Blackstock, has been confirmed.\nSilver Bow County Coroner Dan Hollis told Us Weekly on Monday, August 11, that Blackstock’s cause of death was melanoma, a form of skin cancer, and the manner of his death was natural causes. “Brandon Blackstock passed away peacefully at his home in Butte, Montana on August 7th under hospice care surrounded by his family,” Hollis said in a statement.\nBlackstock died on August 7 after privately battling cancer for three years. He was 48.\n“It is with great sadness that we share the news that Brandon Blackstock has passed away. Brandon bravely battled cancer for more than three years. He passed away peacefully and was surrounded by family,” a family rep told Us in a statement. “We thank you for your thoughts and prayers and ask everyone to respect the family’s privacy during this very difficult time.”\nOne day earlier, Clarkson, 43, alerted fans to Blackstock’s illness when she put her Las Vegas residency on pause, though she didn’t reveal the nature of his condition at the time.\n“Unfortunately, I need to postpone the remainder of the August Studio Session dates in Las Vegas,” she announced via Instagram on August 6. “While I normally keep my personal life private, this past year, my children’s father has been ill and at this moment, I need to be fully present for them. I am sincerely sorry to everyone who bought tickets to the shows and I so appreciate your grace, kindness and understanding.”\nClarkson and Blackstock wed in October 2013 and went on to welcome daughter River, 11, and son Remington, 9. During their marriage, Blackstock worked as the singer’s manager. Clarkson ultimately filed for divorce in June 2020 after nearly seven years. The pair finalized the proceedings in March 2022 following a messy legal battle.\nPrior to his relationship with Clarkson, Blackstock was married to Melissa Ashworth from 2001 to 2012. The exes shared daughter Savannah, 23, and son Seth, 18.\nIn January 2022, Blackstock became a first-time grandfather when Savannah gave birth to her and now-husband Quentin Lee’s son, Lake. Savannah announced in July that the couple are expecting their second baby.\nOutside of his marriage to Clarkson, Brandon had another Hollywood connection via his father, Narvel Blackstock, who was Clarkson’s manager earlier in her career. Narvel was previously married to Reba McEntire from 1989 to 2015, during which time she was stepmom to Brandon and his two sisters, Chassidy and Shawna. Narvel and McEntire’s son, Shelby, who was born in 1990, was Brandon’s half-brother."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-moms/pictures/kate-gosselins-relationship-with-son-collin-details/",
      "text": "Kate Gosselin and her son Collin have been through their fair share of ups and downs over the years.\nThe Kate Plus Date star welcomed Collin and his sextuplet siblings — Alexis, Hannah, Aaden, Leah and Joel — in 2004 with her now-ex-husband, Jon Gosselin. The little ones joined twins Madelyn and Cara, who arrived four years earlier.\nThe reality stars, who tied the knot in 1999, called it quits a decade after their nuptials. While the former couple were granted shared physical custody of their kids, Kate received legal custody of all eight children. (Per The Center for Family Law, legal custody “refers to the rights and the obligation to make decisions about a child,” while physical custody “refers to which parent the child is physically with at any given time.”)\nIn 2016, she revealed that she had sent Collin to Fairmont Behavioral Health Institute for behavioral issues. (Jon later told the Daily Mail: “Other than ADHD, which is extremely common, Collin has never been diagnosed with any known medical condition.”) In 2018, Jon had the teenager removed from the facility. Collin and Hannah now live with their dad.\nKeep scrolling for a closer look at Kate and Collin’s relationship over the years, from handwritten letters to shady Mother’s Day messages:"
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/billy-joels-ex-wife-elizabeth-weber-on-their-relationship-now/",
      "text": "Billy Joel’s ex-wife Elizabeth Weber is opening up about where she stands with the famed singer after their infamous affair and nearly decade-long marriage.\n“If I wanna talk to him or if I have something to say, I am able to contact him whenever I want to,” Weber exclusively told Us Weekly on Friday, August 8. “But he has a wife and he has children and right now, he’s struggling with something that’s… that’s a big thing.”\nIn May, Joel, 76, canceled the remaining dates of his 2025 tour after revealing he had been diagnosed with normal pressure hydrocephalus, a brain condition in which an abnormal amount of cerebrospinal fluid builds up, causing walking, memory, balance and bladder control problems.\n“So, [our relationship] is as close as it needs to be for two people who decided to divorce 40 years ago,” Weber continued, adding that “of course” she reaches out to her ex amid his health diagnosis.\nWeber first met Joel when she was married to his best friend and former bandmate, Jon Small. The pair engaged in a subsequent affair, which led to the band breaking up and Joel battling a severe depression that included two suicide attempts. (The affair and its aftermath were discussed in the two-part HBO documentary Billy Joel: And So It Goes, which premiered in July.)\nThe pair later reconnected after Weber’s divorce and married in 1973, going on to spend nearly 10 years together before ending their marriage in 1982. Joel went on to marry Christie Brinkley in 1985, welcoming daughter Alexa Ray Joel before calling it quits in 1994. Joel then married cookbook author Katie Lee in 2004 — the pair divorced five years later in 2009. In 2015, Joel married Alex Roderick. The pair share two children, Della Rose Joel and Remy Anne Joel.\nWeber, for her part, shares a son, Sean Weber-Small, with her first husband.\nWhile speaking with Us, Weber said that her son and her grandchildren also know and are even somewhat close to Joel.\n“I have my grandchildren that he knows and they know him,” she explained. “My granddaughter Ella taught Bill what TikTok was and showed him what was happening. And his relationship with Sean is important to both of them.”\nShe added, “So, we’re not distant but we’re, you know, and he lives in Florida and I live in California. But it’s all good. “\nWeber said that her son Sean and Joel “were very close,” adding that during their marriage the three “lived on top of the mountain.”\n“We entertained each other,” she explained. “Bill and I worked all day long and the whole writing process was never done — in the years that Bill and I were together — was never done remotely or in [a] studio. It happened in our living room, and Sean was an integral part.”\nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat at 988lifeline.org."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kate-gosselin-accused-of-tying-up-collin-keeping-him-in-the-basement/",
      "text": "Kate Gosselin was allegedly “physically aggressive” and “verbally” abused son Collin Gosselin as a child, the 20-year-old recently claimed.\n“My mother had a room built in our unfinished section of the storage basement. She had a room put up with cameras in it, a tiny window in the corner and it was bolt-locked from the outside,” Collin alleged in a bombshell interview released by The U.S. Sun on Tuesday, September 10. “It was like a containment room, literally, and it had a mattress on the floor and that’s how I lived.”\nCollin claimed that he “was 100 percent treated differently” than his siblings.\nKate, 49, shares 23-year-old twins Mady and Cara, 23, and 20-year-old sextuplets Collin, Hannah, Leah, Joel, Alexis and Aaden, with ex-husband Jon Gosselin. The former couple rose to fame with their children on the reality show Jon & Kate Plus 8, which aired from 2007 to 2017.\n“It was rough. I definitely went through it a lot as a kid from my mother’s end. So, it was tough,” Collin told The Sun. “I just remember being isolated from my siblings and constantly taking the fall for her emotions or the tough things going on in her life.”\nCollin said he felt like “a scapegoat” within the family. “I was isolated and I was taken away from them and I didn’t eat dinners with my family,” he alleged. (Us Weekly has reached out for comment.)\nThe alleged “containment” started when Collin was about 8 or 9 years old, he claimed.\n“I was there, you know, most of the day because I didn’t go to school after a certain point,” he alleged. “So, most of the day I was in that room, and I was away from my siblings, and I never really went outside.”\nCollin claimed that he was put in the isolation room “multiple times” and Kate had “zip-tied my hands and feet together and bolt locked the door, turned the lights off and had cameras there just watching me.”\nJon, 47, told The Sun that the room where Kate allegedly held Collin is “still” in the house.\n“My friends’ in-laws bought our house and one time they asked me, ‘Why is there a room in the basement with a bed and a lock on the outside?’ It must have been terrifying for him,” Jon said, alleging that the apparent abuse occurred after their split.\nKate and Jon got divorced in 2009 after 10 years of marriage. At the time, she received primary custody of all eight kids and Collin spent several years in a health institution. In 2022, Hannah and Collin decided to live with Jon full-time.\nKate has not publicly responded to the abuse claims. However, her lawyer Richard Puleo told The Sun that he didn’t believe she would do anything to “intentionally harm” Collin, who allegedly showcased “troubled behavior” as a child.\n“She did what she did to protect herself and her family,” he added.\nIf you or someone you know is experiencing child abuse, call or text Child Help Hotline at 1-800-422-4453."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/mgk-addresses-sydney-sweeney-dating-speculation/",
      "text": "Machine Gun Kelly publicly addressed rumors of a romance with Sydney Sweeney.\nDuring an appearance on the Sunday, August 10, episode of Watch What Happens Live With Andy Cohen, MGK, whose real name is Colson Baker, was asked point-blank about his relationship with Sweeney, 27.\nAndy Cohen read from a question card that contained a viewer query from “Kyle P.” The TV host said, “MGK, Kyle P wants to know if there’s any truth to the rumor that you and Sydney Sweeney were more than just friends.”\nMGK, 35, responded while shaking his head and looking directly down the camera barrel, “Kyle P, shut up, dude,” at which Cohen and the audience laughed loudly.\nIn May, photos published by Page Six showed the musician and Sweeney hugging at a Las Vegas club opening. Later that month, MGK shared an Instagram carousel that included a snap of himself posing alongside Sweeney as they flashed peace signs at the camera. (Patrick Schwarzenegger and Hollywood hair stylist Glen Oropeza were also in the snap.)\nAn Instagram Story shared by Sweeney at the time, published by the outlet, also featured a photo of herself posing with Schwarzenegger, 31, and MGK at the Vegas event.\nBoth MGK and Sweeney are currently single after the musician’s split from Megan Fox was confirmed by Us Weekly in December 2024, and Sweeney’s engagement to Jonathan Davino was called off in May. (MGK shares a daughter, Saga, 4 months, with Fox, 39, in addition to daughter Casie, 16, whom he shares with ex Emma Cannon.)\nMGK and Sweeney have been friends for years, with Sweeney starring in MGK’s 2021 directorial debut, Downfalls High. The pair also appeared in the 2019 film Big Time Adolescence alongside MGK’s close friend Pete Davidson.\nMGK’s appearance on WWHL also saw an audience member ask him who his dream musical collaboration would be, living or dead, to which he responded, “ I like Frank, man, Frank Sinatra. I’ll do that.”\nHe was also asked by Cohen about how age, which garnered an interesting response from MGK: “It’s a weird thing, dude, I don’t know if it exists.”\nCohen likened MGK’s “connection to” his age to that of Mariah Carey, who told Harper’s Bazaar in July that she doesn’t “allow” herself to age, which drew MGK to say, “I just don’t know many facts about my life, so I’m starting to just be like, like, my skin, if it just rips open, it heals really quick, there’s just things where I’m starting to be, like, who’s my dad, you know?”\nHinting that he may have otherworldly origins, MGK noted that he once asked his mother if there was any “period of time where you went missing,” which provided an unusual answer.\n“She told me she got abducted at one point so I was just, like,” MGK said with a shrug."
    },
    {
      "url": "https://www.usmagazine.com/celebrity-news/news/kate-gosselin-shares-rare-photo-of-sextuplets-on-21st-birthday/",
      "text": "Kate and Jon Gosselin’s kids are all grown up!\nOn Sunday, May 11, Kate shared a series of photos on Instagram featuring four of the pair’s sextuplets — Alexis, Aaden, Leah, and Joel — as they celebrated their 21st birthday. “And just like that, they turned 21! Happy Birthday to my 6! ❤️❤️❤️❤️❤️❤️ #GosselinSextuplets” she captioned the snaps.\nHannah and Collin Gosselin — who were notably missing from the post — live with their father, Jon. The pair also share twin daughters Mady and Cara, 24. The family sprang to notoriety via their reality show Jon & Kate Plus 8, which aired from 2007 to 2017.\nCollin and Kate have an especially fractured relationship, though there are plenty of signs the two could eventually mend things.\nIn October 2024, Collin told The U.S. Sun, “So, first and foremost, my relationship with my brothers and sisters is of top priority to me. And I think the only way that my mother and I would be able to reconnect and fix our relationship in the future is, if she would just come forward with the truth and all the things that she has kept under wraps.”\nHe added: “And you know the many times that she’s tried to soil my name and my father’s name. I just would want her to come forward with the truth. [But] yes, that door would be open, 100 percent.”\nJon was granted custody of Collin in 2018 after the young boy wrote a letter to his father from a mental health facility. At the time, Collin said Kate institutionalized him to cover up an alleged abuse. “I was starting to tell people what was going on at home, and she caught wind of that and had to put me somewhere where I wouldn’t be able to get the secrets out,” he claimed.\nCollin also told The U.S. Sun Kate forced him to live in a closet. “My mother had a room built in our unfinished section of the storage basement. She had a room put up with cameras in it, a tiny window in the corner and it was bolt-locked from the outside,” he told the outlet.“It was like a containment room, literally, and it had a mattress on the floor and that’s how I lived.”\nHe further insisted his mother “zip-tied my hands and feet together and bolt locked the door, turned the lights off and had cameras there just watching me.”\nKate denied the allegations in July 2023. She told People at the time Collin “received multiple psychiatric diagnoses” and had “many attacks/outbursts.”\n“All measures that were taken in our home were at the explicit recommendation of his pediatric psychiatrist and/or his team of specialists and were put into place to safeguard every member of our family, our friends as well as our family pets. … Collin remains a very troubled young man who continues to need a lot of help,” she added."
    },
    {
      "url": "https://www.usmagazine.com/entertainment/news/collin-gosselin-says-siblings-were-forced-apart-in-emotional-message/",
      "text": "Collin Gosselin issued an emotional message about his fractured relationship with his siblings amid his family’s estrangement.\nKate and Jon Gosselin‘s son Collin, 21, recently took to TikTok with a message for his seven siblings. He shared a photo of himself and his brothers and sisters as kids — with twins Mady and Cara, now 24, and his fellow sextuplets, Alexis, Hannah, Aaden, Leah and Joel, also 21, featured in the post.\n“Born to be a team, us against the world,” he wrote. “Forced to do it alone, and wonder every day what our lives could’ve looked like.”\nCollin reflected on how being in the spotlight affected his connection with his family, adding, “Forced apart, pitted against each other. All the fame and money in the world, but what about kids being kids?”\nHe concluded: “I will always love them more than anything. The tears I shed behind closed doors, thinking about the memories we could’ve shared. I love you guys.”\nIn 2007, Collin and his family rose to stardom with the premiere of Jon & Kate Plus 8, which ran for 11 seasons. (Kate, 50, and Jon, 48, welcomed twins Madelyn and Cara in 2000. Four years later, the sextuplets were born.)\nAfter a decade of marriage, Kate and Jon called it quits in 2009 and began battling for custody of their children. Jon was the primary guardian for Hannah and Collin until they turned 18 but has been estranged from his other children for several years.\nCollin, for his part, recently accused his mother of being “physically aggressive” and “verbally” abusive when he was a child.\n“It was rough. I definitely went through it a lot as a kid from my mother’s end. So, it was tough,” Collin alleged during an interview with The U.S. Sun in October 2024. “I just remember being isolated from my siblings and constantly taking the fall for her emotions or the tough things going on in her life.”\nCollin claimed the abuse started when he was around 8 years old and included him being put in an isolation room “multiple times.” Kate then allegedly “zip-tied my hands and feet together and bolt locked the door, turned the lights off and had cameras there just watching me.”\n“I was isolated and I was taken away from them and I didn’t eat dinners with my family,” he claimed. “I was there, you know, most of the day because I didn’t go to school after a certain point. So, most of the day I was in that room, and I was away from my siblings, and I never really went outside.”\nJon supported Collin’s account, telling the outlet, “My friends’ in-laws bought our house and one time they asked me ‘Why is there a room in the basement with a bed and a lock on the outside?’ It must have been terrifying for him.”\nKate’s attorney Richard Puleo defended her in a statement but declined to comment on Collin’s claims.\n“She never wants to comment because she always knows that this gets taken out of context,” Puleo told Fox News at the time. “She doesn’t want to comment. Doesn’t need to. The record speaks for itself.”\nAlong with his public plea on social media, Collin answered questions about what his relationship looks like with his siblings now.\n“I just saw [Hannah] today!” he wrote in the comments section. “She was worried her car wouldn’t pass inspection so I was looking at it for her. She’s so funny and I love her [so much]. It makes my day whenever I see her, but we’re both so busy with work, school etc.”\nCollin subsequently made it clear he hadn’t fixed his issues with Kate.\n“Being locked up, isolated, zip tied. Being sent away because I didn’t fit into an equation,” he claimed in a separate comment. “Having one visit from her after being completely cut off with no contact at 12 years old, in which the whole visit was her telling me how I deserved the situation I was in because I ‘destroyed our family.’ Yeah I’m sorry, but I will never ‘understand’ that. I will break the cycle that she couldn’t.”\nIn response to a question about his plans to have a family in the future, Collin added, “I can’t wait to have kids and teach them the importance of siblings. I tell all my friends who have siblings to always value their siblings and hold each other close.”"
    }
  ],
  "argos_summary": "Alexis Gosselin made a rare appearance on her mother Kate Gosselin's TikTok, shortly after her brother Collin expressed feelings of estrangement from his siblings. In the video, Alexis shared a moment with Kate, who reflected on her relationship with her children, noting that she doesn't see them much anymore. Collin, who has accused Kate of abusive behavior during their childhood, shared a heartfelt message about his desire for reconciliation with his siblings, emphasizing the pain of their separation.",
  "argos_id": "8MR6NJJ14"
}