{
  "url": "https://www.bloomberg.com/news/videos/2025-08-11/bloomberg-tech-8-11-2025-video",
  "authorsByline": "bn",
  "articleId": "eb24050f0f084dd48b5f4ea17b00eeee",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i2SykDbtLuX0/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-11T21:14:20.464000+00:00",
  "addDate": "2025-08-11T22:19:26.254149+00:00",
  "refreshDate": "2025-08-11T22:19:26.254152+00:00",
  "score": 1.0,
  "title": "Nvidia, AMD AI Deal, Intel CEO to Meet Trump",
  "description": "Bloomberg’s Caroline Hyde and Ed Ludlow discuss Nvidia’s and AMD’s agreement to pay 15% of their revenues from Chinese artificial intelligence chip sales to the US government. Analysts and investors react to the “unprecedented” deal. Plus, Intel CEO Lip-Bu Tan is set to meet with President Donald Trump, after the US leader called his resignation.  (Source: Bloomberg)",
  "content": "> > BLOOMBERG TECH IS LIVE. > > THIS IS BLOOMBERG TECH. COMING UP NVIDIA AND AMD -- > > PLUS, INTEL CEO IS SET TO VISIT THE WHITE HOUSE. > > LITHIUM PRICES AND STOCKS SPIKE. > > WE RETURN TO THESE MAJOR MARKETS. THIS IS AN ENTIRE SHOW FOCUSED ON THE SEMI CONDUCTOR WELL. BY BRINGING THE CHIP SECTOR IN PARTICULAR. THE MACRO PICTURE RIGHT NOW, INFLATIONARY DATA. WE ON THE SHOW ARE LOOKING AT SEMI CONDUCTORS. ED: MACRON IS RAISING GUIDANCE BECAUSE OF PRICING POWER. THE CEO, LIP-BU TAN, OFF TO THE WHAT HAS TO BE THE PRESIDENT. ACCORDING TO BLOOMBERG SOURCE, NVIDIA AND AMD HAVE AGREED TO GIVE THE UNITED STATES 15% OF ANY REVENUES OF AI CHIP SALES TO CHINA IN EXCHANGE FOR EXPORT LICENSES IN WHAT IS FAIRLY A QUID PRO QUO TARIFF. CAROLINE: IT'S UNPRECEDENTED. JOE MATHIEU IS WITH US FOR THE PERSPECTIVE OF THE ADMINISTRATION. I DO THIS, JOE? JOE: GREAT QUESTION. REMEMBERING THE GOLDEN SHARE THEY GOT IT'S A WHOLE NEW LEVEL THAT'S RAISING A LOT OF QUESTIONS BEGINNING HERE IN WASHINGTON WITH NATIONAL SECURITY. WALL STREET MIGHT HAVE SLIGHTLY DIFFERENT QUESTIONS, BUT REMEMBERING THAT THESE CHIPS WERE GOING TO BE OFF LIMITS TO THE CHINESE SOMETHING WE TALKED ABOUT A LOT HERE ON THE AIR. THEN USE SAW THE TURN TO MAKING THEM AVAILABLE, THE LICENSES AT THAT MOMENT WERE NOT ACTUALLY BEING GIVEN TO NVIDIA OR AMD FOR A COUPLE OF WEEKS. THIS APPARENTLY UNLOCKS THE LICENSE BUT MY GOODNESS, THE ROLE THAT THE ADMINISTRATION IS PLAYING IN BUSINESS, WE CAN OPENLY SAY THAT THE U.S. GOVERNMENT IS NOW A PART OF THE SEMICONDUCTOR INDUSTRY AND ARE INVESTED IN THE BUSINESS. THE BIG QUESTION IS, WHERE IS THE LINE? IF 15% IS ENOUGH TO GET THESE ON SALE IN CHINA, IS THERE A NUMBER THAT JENSEN HUANG CAN COME UP WITH TO SELL EVEN MORE? I WANT TO POINT OUT -- ED: I WANT TO POINT OUT THAT AMD HAS NOT SAID ANYTHING ABOUT THIS. NVIDIA HAS SAID A LOT, BUT THEY HAVE AN ADDRESS TO THE NUMBER. SO FAR AT LEAST IN THIS FISCAL YEAR THEY HAVEN'T SHIPPED ANY AGE 20'S TO CHINA. IMPORTANT FOR WALL STREET TO MODEL FOUR. BOY, THEY ARE REALLY INDICATING THAT THEY ARE GETTING WHAT THEY WANT IN SOME SENSE BECAUSE CHINA IS SUCH A KEY MARKET AND THE PRESIDENT SEEMS, RIGHT NOW, IF THIS REPORTING IS ACCURATE, TO BE WILLING TO OBLIGE THEM BECAUSE HE IS GETTING SOMETHING IN RETURN, HE'S DONE A DEAL. JOE: THAT'S RIGHT. THE SAME PRESIDENT THAT DAYS AGO ASKED FOR THE RESIGNATION OF THE CEO OF INTEL. AS YOU MENTIONED, IS AT THE WHITE -- LIP-BU TAN IS AT THE WHITE HOUSE TODAY. WE HAVE SEEN HIM DO THIS BEFORE, CALLING FOR BOYCOTTS OF CERTAIN GOODS, CALLING FOR PERSONNEL CHANGES, CALLING FOR POLICY CHANGES WITHIN COMPANIES. WE'VE SEEN THE IMPACT HE'S HAD WHEN IT COMES TO D.E.I., BUT EXCHANGING MONEY WITH THESE COMPANIES IS A NEW PROSPECT AND IT'S NOT CLEAR WHERE THIS 15% WOULD GO. WOULD IT BE USED TO PAY DOWN THE DEBT OR DO SOMETHING ELSE IN TERMS OF NATIONAL SECURITY? THE PRESIDENT, BY THE WAY, IS BRIEFING REPORTERS AT THE WHITE HOUSE TALKING ABOUT CRIME IN THE CITY IN HIS EFFORT TO FEDERALIZE WASHINGTON, D.C., A SEPARATE AND BIG STORY HERE. THEY WILL GO TO QUESTIONS AND I EXPECT THAT THESE WILL COME UP TODAY. CAROLINE: WE SUSPECT SO, TOO. ED: THANK YOU, JOE. LET'S GET A REACTION TO THE NVIDIA AND AMD NEWS FROM A DIRECTOR AT AN INDEPENDENT RESEARCH GROUP THAT ANALYZES ECONOMIC AND POLITICAL ISSUES, INCLUDING THOSE RELATED TO CHINA. YOU HAVE TWO DECADES OF EXPERIENCE AS A GEOPOLITICAL STRATEGIST ADVISING COMPANIES ON WHAT'S HAPPENING AROUND THE WORLD. HAVE YOU EVER SEEN THE UNITED STATES IMPOSE WHAT IS ESSENTIALLY AN EXPORT TAX IN EXCHANGE FOR THOSE COMPANIES BEING ABLE TO EXPORT TECHNOLOGY TO A SPECIFIC MARKET? > > UNORTHODOX IS THE UNDERSTATEMENT, RIGHT? THEN THERE'S THE PESKY DETAIL OF ARTICLE ONE SECTION NINE OF THE CONSTITUTION IT SAYS NO TAX OR DUTY SHOULD BE LEVIED ON ANY ARTICLES COMING FROM ANY STATE. WE ARE IN UNCHARTED TERRITORY HERE. BUT IT DOES FIT WITH A HIGHLY TRANSACTIONAL ADMINISTRATION. AS YOU JUST REFERENCED EARLIER, WHAT IS EXACTLY THE LINE HERE? IF THE ADMINISTRATION IS DRIVING TOWARDS REVENUE GENERATION IN EXPORT CONTROLS, INCLUDING HIGH-END SEMI CONDUCTORS, WHAT IS THE LINE ON WHAT IS CONSIDERED TOO ADVANCED AS IT BALANCES AGAINST THIS REVENUE GENERATION GOAL? CAROLINE: WE HAVE HEARD FROM NVIDIA AND AMD CONFIRMING THAT THEY RECEIVED THE CHINA AI CHIP EXPORT LICENSES. IT IS SOMETHING THAT WE QUIZZED LISA SUE ON JUST LAST WEEK. IT'S WHAT THE MARKET REALLY WANTED TO HEAR. BUT GO FURTHER AS TO, ULTIMATELY, COMPANIES LOOKING TO SELL INTO CHINA, THINKING LONGER TERM, IF THEY WILL REMAIN HAVING ACCESS. THE RESPONSE FROM CHINA HAS BEEN ONE OF CONCERN ABOUT THE AMOUNT OF INFORMATION AND THE BACKDOORS , PARTICULARLY WITH JENSEN HUANG. REVA: WELL, TRUMP HAS MADE HIMSELF INTRINSIC TO THE U.S. CHINA CHIP WARS, SO NOW WE NEED TO SEE HOW FAR THIS GOES. CAN LOUIS VUITTON PULL OFF A JENSEN? THAT REMAINS TO BE SEEN. INTEL HAS A LOT OF PROBLEMS ATTACHED TO IT. AND THERE IS AN IMPERATIVE TO CREATE A CHIP CHAMPION OUT OF INTEL SETBACKS. THERE'S A LOT MORE DEALMAKING TO COME OUT OF THAT AS WELL. WITH THIS LEVEL OF TRANSACTIONAL IS HIM, THERE IS ALWAYS A DEGREE OF UNCERTAINTY. HOW LONG DOES IT LAST? IF WE APPLY A SLIDING SCALE TO CHIP SALES, TO CHINA, AT WHAT POINT DOES THAT START TO RETRENCH AS U.S. CHINA AI COMPETITION IS UNDOUBTEDLY INTENSIFYING? WE ARE STILL IN THE EARLY STAGES OF DIFFUSION. AS WE START TO SEE MORE APPLICATIONS BECOME REAL AND WE WRAP OUR HEADS AROUND IT, AROUND THE COMPETITIVE ISSUES AROUND THAT, THE CRITICAL INPUTS WERE CHINA STILL HAS INTENSE LEVERAGE. WILL BE START TO SEE A DELAYED REACTION IN THE U.S.? THAT FREAK OUT MOMENT, SO TO SPEAK, WHERE THESE KINDS OF CONTROLS COULD FALL BACK TO A MORE RESTRICTED NATURE? CAROLINE: PUSH US FORWARD, REVA, HOW HAS THE AMERICAN PRESIDENT DECIDED TO FORGO NATIONAL SECURITY CONCERNS FOR WHAT 15% EARNS THEM? OR CAN THEY MANAGE TO, IN SOME WAY, LOCATION TRACK AND UNDERSTAND WHAT ULTIMATELY GETS INTO THAT AND HOW IT'S USED? REVA: THERE ARE A COUPLE OF DIFFERENT ISSUES. H20'S ARE USED FOR INFERENCE COMPUTE. THE ASSUMPTION BEING MADE IS THAT THAT'S NOT THE CHIEF NATIONAL SECURITY CONCERN. IT RAISES THE QUESTION OF IF HUAWEI IS ABLE TO PRODUCE COMPARABLE CHIPS, WILL WE SEE U.S. CHIP CONTROLS USING TO ALLOW U.S. TECHNOLOGY TO COMPETE HEAD-TO-HEAD? AGAIN, WHERE IS THE LINE DRAWN? STILL, IT'S A HIGHLY TRANSACTIONAL PHASE. WE NEED TO SEE TO WHAT DEGREE IS THE U.S. GOING TO BE CONCERNED ABOUT THE END USES AND THAT ECONOMIC COMPETITIVENESS CONCERN THAT STILL IN PLAY. ED: I DON'T KNOW, H20 CAN BE USED FOR TRAINING. IT HAS HAD PERFORMANCE ENGINEERED OUT OF IT, BUT TALKING TO A LOT OF PEOPLE IN THE COMPANY, YOU SAID IT A MINUTE AGO, DOING OR PULLING A JENSEN, THAT SO INTERESTING, BECAUSE HIS PRINCIPAL ARGUMENT IS THAT IF YOU DON'T EXPORT AMERICAN TECHNOLOGY, CHINA WILL USE DOMESTIC CHAMPION TECHNOLOGY AND START EXPORTING IT TO OTHER INTERNATIONAL MARKETS. FORGET THE REVENUE SIDE FOR A MINUTE. IS THIS SMART BY TRUMP TO HAVE THE PR EFFECT OF ALLOWING THEM TO EXPORT TECHNOLOGY TO AN ADVERSARY AND AT THE SAME TIME DOING A DEAL SHOWING THAT HE GOT SOMETHING OUT OF IT? REVA: IT'S A SLIPPERY SLOPE. AS WE HAVE SEEN THE PREPARATION FOR A U.S. CHINA SUMMIT BETWEEN TRUMP AND XI, WHAT IS BEIJING THINKING AT THIS POINT? OBVIOUSLY THEY WANT TO TAKE ADVANTAGE OF THIS EXPERIMENTAL TRANSACTIONAL PHASE. WHAT ARE THEY PUSHING FOR? WE KNOW THEY WANT AN E-ZINE ON CERTAIN TARIFFS AND ON CHIP CONTROLS THEY WILL WANT TO PUSH FOR AN EASING OF HIGH-BANDWIDTH MEMORY CHIP RESTRICTIONS. NOW, THAT'S REALLY TRICKY, BECAUSE IF YOU START TO SAY THAT'S OK, CHINESE MEMORY CHIP MAKERS ARE BECOMING COMPETITIVE, THE U.S. WILL THEN ALLOW MICRON, FOR EXAMPLE, SAMSUNG, TO EXPORT THE CHIPS TO THE U.S., IT DOESN'T HELP NVIDIA, PAULA IS GETTING ACCESS TO CHIPS THAT WILL IMPROVE THEIR PRODUCTION. YOU'VE SEEN SELECTIVE APPLICATIONS OF THAT SLIDING SCALE APPROACH. THE U.S. SO FAR IS ALSO NOT EASING SEMICONDUCTOR MANUFACTURING EQUIPMENT CONTROLS, RIGHT? THE TOOLS TO MAKE THE CHIPS, IF THE U.S. IMPERATIVE IS TO THROTTLE CHIP PRODUCTION AND REALLY CONSTRAIN IT SO THAT COMPANIES LIKE NVIDIA AND AMD CAN FLOOD THE ZONE AND GET THE CHINESE TECHNOLOGISTS INJECTED TO U.S. TECH, SO TO SPEAK, YOU DON'T NECESSARILY WANT TO HELP HUAWEI EITHER. CAROLINE: HOW DO YOU ANTICIPATE CHINA RESPONDING TO THIS? REVA: THEY HAVE A TON OF LEVERAGE AT THIS POINT WITH RARE EARTH METAL LICENSES. WHAT YOU CAN SEE FROM THE TALKS IS THAT THE ISSUE OF LICENSING FOR CRITICAL INPUTS SEEMS TO BE A MAJOR THEME OF THE U.S. CHINA BILATERAL'S. SO, IF THE U.S. RAISES THREATS ON TARIFFS OR RAISES TECHNOLOGY CONTROLS IN A SIGNIFICANT WAY, CHINA CAN BASICALLY SAY LOOK, THE TERMS OF STOCKHOLM, WHATEVER EUROPEAN CAPITAL, YOU ARE NOT GETTING YOUR LICENSES, YOUR PRODUCTION LINES WILL BE PARALYZED, GOOD LUCK WITH YOUR MANUFACTURING AMBITIONS FOR THIS BIG AI MANUFACTURING RENAISSANCE . WE HOLD THE CARDS. FOR THE DURATION OF THE TRUMP TERM, THAT IS AN UNCOMFORTABLE TRUTH. CAROLINE: FASCINATING TO TALK TO YOU, REVA. THANK YOU. COMING UP, LIP-BU TAN REPORTEDLY MEETING WITH THE PRESIDENT TODAY. THAT STORY IS NEXT AT -- WHAT ARE YOU LOOKING AT? ED: LOOKING AT MICRON, THEY HAVE UP TO THEIR GUIDANCE FOR THE CURRENT PERIOD, THE PREVIOUS AND WAS 2.2 $65. IT'S ALL ABOUT FAVORABLE -- 2.65 DOLLARS. IT'S ALL ABOUT THIS GREAT BUILD OUT ON THE DATA CENTER WITH A HISTORIC BUSINESS THAT HAS BEEN SO COMMODITIZED AND CYCLICAL. INVESTORS IN THIS MOMENT ARE PUTTING UP 3.5%. WE'LL BE RIGHT BACK. THIS IS \"BLOOMBERG TECH.\" ED: THE INTEL CEO, LIP-BU TAN, SET TO VISIT THE WHITE HOUSE DAYS AFTER TRUMP CALLED FOR HIS RESIGNATION BECAUSE OF POTENTIAL CONFLICTS OF INTEREST. IAN KING JOINS US ON WHERE THAT STRATEGY IS WITH THE WHITE HOUSE. WHAT DO WE UNDERSTAND HE WILL BE DISCUSSING WITH TRUMP LATER TODAY IN D.C.? > > IT'S STILL TBD, OBVIOUSLY, BUT THERE'S A LOT GOING ON. FUNDAMENTALLY WHAT THE TRUMP ADMINISTRATION WANTS IS AN AFFIRMATION THAT ALL OF THESE PROJECTS, ALL OF THIS PHYSICAL BUILDING OF SEMICONDUCTOR PLANTS IN THE U.S. IS GOING TO GO AHEAD. THEY DON'T WANT A SENSE THAT MAYBE WE WILL, MAYBE WE WON'T. THAT HAS BEEN THE MESSAGE THAT INTEL DELIVERED RECENTLY. FROM THE WALL STREET PERSPECTIVE WE DON'T WANT THEM TO BUILD THESE UNTIL THEY CAN FILL THEM. IT'S A KIND OF PUSH AND PULL WHERE THE INVESTORS WANT ONE THING AND FRANKLY THE WHITE HOUSE WANTS ANOTHER. THE TOPIC HAS GOT TO BE HOW DO WE GET THE TWO POSITIONS CLOSER TOGETHER. WHAT KIND OF LANGUAGE CAN INTEL COME UP WITH THAT WILL KEEP THE WHITE HOUSE HAPPY AND NOT SCARE INVESTORS? CAROLINE: ULTIMATELY, WHAT WOULD SCARE INVESTORS? LACK OF ACCESS TO CHIPS ACT MONEY? IS IT MORE WORRYING THAT THEY WILL BE FOLLOWING THE MONEY IN BEFORE THE DEMAND IS CERTAIN? IAN: INVESTORS DON'T CARE WHERE THE CHIPS ARE MADE. BUILDING THEM, IT'S A WAY FOR THE COMPANY TO GO OUT OF BUSINESS. ULTIMATELY THERE'S A LOT OF REALISM OUT THERE AND AS WE ARE DISCUSSING, THE SUPPLY CHAIN IS BECOMING MORE COMPLICATED IN THE GEOPOLITICAL IMPERATIVES ARE BECOMING STRONGER AND STRONGER. THERE WILL BE SOME UNDERSTANDING THAT HEY, MAYBE WE NEED TO BUILD CAPACITY, BUT INTEL HAS A LOT OF CAPACITY ALREADY, SO WHY DO THEY NEED TO BUILD THESE MEGA-FACTORIES UNLESS THAT’'S WHAT THEY WANT. MORE THAN ANYTHING ELSE IT'S THAT WE'VE GOT CUSTOMERS WHO WANT TO USE OUR FACTORY AND INTEL CANNOT SAY THAT. CAROLINE: FOR MORE ON INTEL IN THE BROADER CHIPS SECTOR, JOANNA SWEENEY. WHAT IS IT YOU WOULD LIKE TO SEE LIP-BU TAN NAVIGATE TODAY? IS IT BETTER TO PROMISE MORE MANUFACTURING AND INVESTMENT INTO THE U.S. AND HIS EXTRICATION FROM CHINA, OR DOES HE ULTIMATELY NEED TO STAND DOWN IN SOME WAY AS CEO? IT'S REALLY UNCLEAR -- JOANNA: IT'S HONESTLY REALLY UNCLEAR. I THINK HE CAN DEFEND HIMSELF FROM THE CONCERNS THAT HE'S CONFLICTED. I DON'T KNOW IF THAT MEANS HE NEEDS TO DO MORE TO SEPARATE FROM HIS PRIOR WORK AND INVESTMENTS. I DON'T KNOW HOW MUCH CAPACITY HE HAS TO DO THAT. IAN IS RIGHT, THE ADMINISTRATION WANTS TO BE ABLE TO PUSH THE NARRATIVE THAT THEY ARE DOING SOMETHING TO BRING MORE CHIP MANUFACTURING BACK TO THE U.S.. BUT THEY DON'T HAVE THE CUSTOMERS, YET. MAYBE HE CAN SAY HEY, THESE GUYS ARE ON THE LINE, WE ARE REELING THEM IN, THAT MIGHT BE REAL CURING. ULTIMATELY THEY NEED TO KEEP THE SUBSIDIES WITHOUT THE COSTS OF HAVING TO SPEND SO MUCH CAPEX WHEN THEY DON'T HAVE CUSTOMERS. IT'S A VERY FINE LINE FOR THE CEO TO WALK, HERE. ED: THE STOCK IS UP 6%, ON SOME LEVEL THE MARKET LIKES THIS IDEA, BUT THERE'S A LONG CAREER THEY IN SEMI CONDUCTORS. LIP-BU TAN HAS HAD A VERY LONG CAREER IN SEMI CONDUCTORS. A LOT OF THIS AFFILIATION WITH CHINA AND INDIRECTNESS HAS BEEN WELL KNOWN. WERE YOU AWARE OF IT? DID YOU UNDERSTAND HIS HISTORY? JOANNE: I DON'T KNOW HIM WELL, BUT HIS PRIOR WORK, ONE OF THOSE WAS MORE MEASURED WITH LESS CAPITAL SPENDING FORWARD THAN AT YOUR WANTED TO DO. IT'S WORRISOME, RIGHT, THAT HE MIGHT HAVE TO BE REMOVED BECAUSE OF CONCERNS THAT REALLY AREN'T WILL FOUNDED. HE SEEMS LIKE HE IS A VERY GOOD PERSON TO RUN INTO ALL OF THIS, BUT INTEL NEEDS TO HELP, THEY NEED TO TAKE THE COMPANY IN A DIFFERENT, MORE STREAMLINED DIRECTION WHILE THEY SPREAD OUT THE RECIPE FOR MANUFACTURING CHIPS, WHICH WAS A HUGE STUMBLING BLOCK FOR THEM. IT'S WHY AMD HAS TAKEN SO MUCH. THIS IS A COMPANY THAT WE WOULD AVOID AND ARE AVOIDING AT THIS POINT. WE DON'T THINK IT IS A GOOD PLACE FOR INVESTOR MONEY. THERE ARE TOO MANY UNCERTAINTIES AROUND THAT POTENTIAL TO MAKE A COMEBACK. CAROLINE: MEANWHILE, UNCERTAINTY LOOMS LARGE, BUT YOU MIGHT BE WILLING TO SELL IT IF THE UNDERLYING TAIL WINDS STRONG. TELL US WHAT YOU THINK ABOUT THOSE DEALS. JOANNE: CLEARLY THEY ARE BETTER OFF WITH ACCESS TO CHINA THAN WITHOUT. THE POTENTIAL REVENUE AT RISK, $30 BILLION FOR INTEL, 6 BILLION TO 10 BILLION THAT COULD GROW OVER TIME. PAYING 15% ON THAT WILL CUT INTO THEIR MARGINS, TO SOME DEGREE. THEY WILL PROBABLY GET A 60% MARGIN ON THE SALES. I THINK THAT THEY ARE GOING TO HAVE TO SWALLOW THIS, RIGHT? THEY ARE CHARGING WHAT THE MARKET WILL BEAR FOR THOSE CHIPS. I DON'T THINK THAT THEY WILL BE ABLE TO PASS ON THIS TARIFF OR THIS EXPORT TAX TO THE CHINESE CUSTOMER. THEY ARE GETTING AWAY WITH WHAT I CAN ALREADY GET AWAY WITH. IT IS DEFINITELY GOING TO BE A HIT TO MARGINS ON WHAT IS A MINORITY PART OF THEIR BUSINESS. I THINK THAT THE STOCKS ARE UP BECAUSE MAYBE THIS RESOLVES UNCERTAINTY. MAYBE PEOPLE SAY -- OK, WE HAVE TO PAY IT, BUT NOW WE CAN RELY ON THE FACT THAT THEY WILL HAVE THESE EXPORT LICENSES WHEREAS BEFORE IT WAS THIS VAGUE SECURITY CONCERN FOR YOU CAN'T SELL CHIPS TO CHINA. IT'S CLEARLY NOT NATIONAL SECURITY IF THE GOVERNMENT IS WILLING TO LET THEM PAY A FEE TO GAIN ACCESS. ED: AMD PUT OUT A STATEMENT THIS MORNING SAYING THEY HAD AN INITIAL LICENSE BUT THEY DIDN'T ADDRESS THE REVENUE SPLIT. NVIDIA SAID THEY HAD NOT YET SHIPPED ANY AGE 20 PASTA CHINA FOR MONTHS, BUT THAT THEY HOPE TO. CAN YOU AND YOUR ANALYSTS START MODELING FOR REAL CHINA REVENUES IN THE NEAR TERM FOR BOTH OF THOSE COMPANIES? JOANNE: FROM WHAT WE KNOW, YES, IT'S GOOD THAT THEY ARE CONFIRMING THOSE LICENSES. WE COULD DEFINITELY MODEL THAT 15% HIT TO REVENUE. IT'S NOT CLEAR, BY THE WAY, WHERE THIS GOES LEGALLY. IT'S UNCONSTITUTIONAL TO IMPOSE EXPORT TAXES LIKE THIS, BUT IT'S NOT CLEAR WHO WOULD HAVE THE LEGAL STANDING TO OBJECT TO THE TAX. NVIDIA AND AMD ARE NOT GOING TO, THEY DON'T WANT TO UNBALANCE THE APPLE CARD AND RISK THOSE LICENSES. PERHAPS ONE OF THE BUSINESS ASSOCIATIONS DOES. WE ARE SEEING MORE AND MORE OF THESE KINDS OF PAY TO PLAY ARRANGEMENTS BY THE U.S. GOVERNMENT THAT COULD INCREASINGLY PUT TAXES ON BUSINESSES. THIS IS AN EX POST TAX. THIS IS HAPPENING AFTER THE FACT WITH COMPANIES HAVING DESIGNED THESE CHIPS, THEY SOLD THEM AND WANT TO SOMEWHERE. WHAT WE WORRY ABOUT IS COMPANIES NOW TAKING THIS POTENTIALLY INTO ACCOUNT. DO I WANT TO DEVELOP THE NEXT CHIP FOR THE NEXT WHATEVER, MEDICAL DEVICE? SUBJECT TO A 15% REVENUE TAX? ED: COMING UP, FORD ANNOUNCES A TREMENDOUS PIVOT FOR ITS ELECTRICAL VEHICLE STRATEGY. THOSE DETAILS ARE NEXT. THIS IS \"BLOOMBERG TECH.\" ♪ CAROLINE: FORD PLANS TO INVEST $5 BILLION BUILDING A NEW LINE OF BUDGET EV'S. $30,000, THE MOVE REPRESENTS A MASSIVE SHIFT FOR FORD. EFFORTS LIKE THE F-150 LETTING PLUG-IN PICKUP FAILED TO MEET EXPECTATIONS WITH PARAMOUNT SPENDING 7.7 BILLION FOR EXCLUSIVE RIGHTS TO SHOW THE ULTIMATE FIGHTING CHAMPIONSHIP EVENTS IN THE UNITED STATES, THE DEAL COVERS THE NEXT SEVEN YEARS AND IS DESIGNED TO BOOST THEIR STREAMING SERVICE DAYS AFTER DAVE ELLISON PROPOSED HIS DEAL FOR CONTROL OF PARAMOUNT. ED: COMING UP, NVIDIA AND AMD AGREED TO PAY 15% OF CHIP REVENUES TO THE U.S. GOVERNMENT. THAT STORY, NEXT. FROM LONDON AND FROM NEW YORK CITY, THIS IS \"BLOOMBERG TECH.\" ♪ WELCOME BACK TO \"BLOOMBERG TECH HERE, NVIDIA AND AMD HAVE AGREED TO SHARE 15% OF THEIR REVENUES FROM CHINA AND I CHIP SALES WITH THE U.S. GOVERNMENT. BLOOMBERG IS REPORTING THAT CITING AN ANONYMOUS SOURCE. AMD PUSHED HIGHER SINCE IT CONFIRMED IT HAS BEEN GRANTED AN INITIAL EXPORT LICENSE. BUT NEITHER OF THOSE COMPANIES IN THEIR STATEMENTS TALKED ABOUT THE 15% REVENUE PAYMENT TO THE U.S. GOVERNMENT AT ALL. LOOKING AT THE SALES SIDE REACTION, IT'S PRETTY MIXED. YES, MANY SAY IT'S GOOD TO HAVE ACCESS TO THE CHINESE MARKET, BUT A NUMBER OF NAMES ON WALL STREET SAY IT SETS A BAD OR WORRYING PRESIDENT. CAROLINE: STACY, INITIALLY 85% LOOK BETTER THAN 0% IN TERMS OF REVENUES, BUT WHAT IS THAT PRESIDENT AND WHAT ABOUT THE LONG-TERM ACCESS TO CHINA? STACY: IT FEELS LIKE A SLIPPERY SLOPE. IT'S BETTER FOR THEM AND FOR THE U.S. IN GENERAL TO BE ABLE TO SELL INTO CHINA. YOU DON'T WANT TO HAND THE CHINESE MARKET FOR AI OVER TO HALLWAY. WE WANT TO BE ABLE TO COMPETE. IT'S GOOD. BUT THIS IDEA OF PAY FOR PLAY OR EXPORT TAX, WHATEVER YOU CALL IT, I DON'T LIKE IT. QUID PRO QUO. WHY EACH STOP WITH CHINA AI? WHY NOT OTHER PRODUCTS OR COMPANIES? I DON'T LIKE IT, I DON'T LIKE IT. YOU KNOW, IT'S NOT UP TO ME. ED: THE REASON I JUMPED IN, AND CAN -- FORGIVE ME, CAROLINE, THE REPORTING WAS CLEAR, IT'S A QUID PRO QUO IN THE SENSE THAT IT'S 15% IN EXCHANGE FOR AN EXPORT LICENSE. THAT'S WITH THE REPORTING TELLS US. HAVE YOU GOT ENOUGH INFORMATION ON YOUR TASK TO MODEL FOR WHAT AND WHEN YOU THINK THEY CAN START BOOKING THAT REVENUE? STACY: PUTTING ASIDE THE 15%, THEY HAVE TO RESET -- RESTART THESE SUPPLY CHAINS. NOT REALLY WITH JUST FINISHED GOODS THEY CAN SELL, BUT WORK IN PROGRESS THAT HAD BEEN HALTED THAT THEY CAN RESTART AND IT WILL TAKE EVEN MORE TIME IF THEY HAVE TO START NEW WAIVERS FROM THE BEGINNING OF THE PROCESS. IT COULD TAKE SIX MONTHS OR EVEN LONGER, NINE MONTHS, MAYBE. TO THE EXTENT THAT IT RAMPS UP, IT WILL TAKE SOME TIME. WE HAVE SPOKEN WITH NVIDIA, IT WAS ABOUT A MONTH AGO THAT THE LICENSES WE WERE GETTING -- CAROLINE: SORRY TO JUMP IN, THE PRESIDENT SPEAKING ON THIS TOPIC. TAKE A LISTEN. > > DO YOU UNDERSTAND? THIS WAR, WOULDN'T OF HAPPENED. IF I WAS PRESENT, PRESIDENT, WOULDN'T HAVE HAPPENED. IT WAS THE APPLE OF HIS EYE. LOOK UNDER BUSH. THEY TOOK A LOT OF TERRITORY. CAROLINE: HE PIVOTED QUICKLY AWAY, STACY, NOW TO RELATIONSHIPS WITH RUSSIA AND WITH UKRAINE. BUT HE WAS WHAT -- SHE WAS MENTIONING AMD IN THE CHINA RELATIONSHIP. GOING TO YOU ON THAT, LONGER-TERM, BUT WILL NVIDIA ACCESS BE TO CHINA? CHINA DOESN'T SEEM THRILLED BY THE SENTIMENT COMING OUT OF THE U.S.. IAN: -- STACY: NVIDIA SUPPOSEDLY HAS A LICENSE FOR A ROADMAP, I DON'T KNOW IF THEY WOULD HAVE TO KICK THAT BACK WHEN THEY GET PRODUCTS BELOW THAT THRESHOLD. THEY DO HAVE A ROADMAP TO SELL IN CHINA. AMD HAS BEEN LESS FORTHCOMING ABOUT THEIR FUTURE CHINA ROADMAPS. I DON'T KNOW WHAT PRODUCTS THEY HAVE, PRESUMABLY WE WILL HEAR ABOUT IT IN DUE COURSE. FOR THE LONG TERM, REMEMBER, THESE THRESHOLDS ARE FAIRLY PUNITIVE. CHINA HAS LOCAL PRODUCTS WITH BETTER PERFORMANCE THAN WHAT THEY ARE ALLOWED TO SELL. THE BENEFITS OF NVIDIA'S AROUND THE ECOSYSTEM, WHICH IS WHY WE DON'T WANT TO SHUT OFF, WE DON'T WANT TO LOCAL DEVELOPERS TO COALESCE AROUND OTHER LOCAL ALTERNATIVES. BUT YOU HAVE TO THINK THAT LIKE OVER TIME, THE GAP BETWEEN WHAT THEY ARE ALLOWED TO SELL IN CHINA VERSUS THE REST OF THE WORLD WILL GET BIGGER AND BIGGER. THEY WON'T REALLY BE ALLOWED TO IMPROVE THE PERFORMANCE OF THESE PRODUCTS IN CHINA TO THE EXTENT THAT THEY COULD DO IT ANYWHERE ELSE IN THE CHINESE WILL DO THEIR BEST TO IMPROVE THE PERFORMANCE OF THEIR OWN PRODUCTS AS MUCH AS THEY CAN GIVEN THE CONSTRAINTS THEY ARE UNDER. OVER TIME, CHINA, LOOK, IT'S A BIG MARKET AND HOPEFULLY THEY WILL GET SOME OF IT BUT IT IS LIKELY TO BE COMPETITIVE THAT IS IMPAIRED RELATIVE TO WHAT THEY WERE ABLE TO SELL IF THERE WERE NO CONSTRAINTS AT ALL. ED: WE HAD THE OPPORTUNITY TO QUIZ LISA SUE ABOUT THIS LAST WEEK. I WANTED TO PLAY HER THOUGHTS ON CHINA RIGHT NOW. > > 90 DAYS AGO WE DIDN'T THINK WE COULD SHIP TO CHINA BECAUSE OF THE REGULATION. THE GOVERNMENT THERE HAS BEEN OPEN TO TRYING TO FIND THAT RIGHT BALANCE BETWEEN NATIONAL SECURITY AND MAKING SURE THAT WE HAVE U.S. AI TECHNOLOGIES PROLIFERATED ACROSS THE WORLD. ED: WE HAVE TALKED ENDLESSLY ABOUT JENSEN HUANG AND HIS RELATIONSHIP WITH THE PRESIDENT, BUT HOW DO YOU THINK LISA SUE IS DOING? STACY: SHE SEEMS TO BE DOING WELL. JENSEN, HE'S A DOMINANT PLAYER HERE. ONE THING ABOUT THEM, AMD, THEY'VE DONE WELL GIVEN WHERE THEY ARE COMING FROM, BUT THEY WILL DO -- YOU KNOW, THEY DID 5 BILLION IN SALES OVERALL LAST YEAR. AMD SAID THAT THE CHINA BAND AT THE TIME BECAUSE THAN 1.5 BILLION. THIS YEAR NVIDIA WILL BE EVEN MORE. THEY ARE RELATIVELY SMALL. BUT LISA, LIKE IN TERMS OF BUILDING HER CASE IN THE ADMINISTRATION AND TRYING TO BUILD THAT RELATIONSHIP WITH TRUMP, WHICH WERE BETTER OR WORSE IS IMPORTANT, SHE'S DONE A GOOD JOB. SHE'S BEEN THERE, PRESENT, VISIBLE, RIGHT? SOME OTHER INDUSTRY PLAYERS HAVE BEEN LESS VISIBLE. ED: NOW WE HAD BACK TO BC WHERE THE PRESIDENT IS TALKING ABOUT VLADIMIR PUTIN AND RELATIONSHIPS WITH RUSSIA. > > THIRD. THIRD-PARTY PLACE. I THINK WE WILL HAVE CONSTRUCTIVE CONVERSATIONS. AFTER THAT MEETING -- IMMEDIATELY? MAYBE AS I'M FLYING OUT? MAYBE AS I'M LEAVING THE ROOM? I WILL CALL EUROPEAN LEADERS. I GET ALONG WITH THEM. VERY WELL. GREAT RELATIONSHIP. ALL OF THEM. I GET ALONG WITH ZELINSKI. BUT I DISAGREE WITH WHAT HE'S DONE. SEVERELY DISAGREE. THIS WAR SHOULDN'T HAVE HAPPENED. WOULDN'T HAVE HAPPENED. BUT I WILL BE SPEAKING TO HIM. THE NEXT MEETING WILL BE WITH ZIELINSKI AND PUTIN. AND ME. I WILL BE THERE IF THEY NEED. I WANT TO HAVE A MEETING SET UP BETWEEN THE LEADERS. I WAS BOTHERED BY ZIELINSKI SAYING HE NEEDED CONSTITUTIONAL APPROVAL. HE HAD -- HE NEEDED APPROVAL TO DO A LAND SWAP? THERE WILL BE LAND SWAPPING GOING ON. YOU KNOW? THROUGH RUSSIA. THROUGH CONVERSATIONS WITH EVERYBODY. TO THE GOOD. FOR THE GOOD OF UKRAINE. GOOD STUFF, NOT BAD STUFF. ALSO, BAD STUFF. THERE'S GOOD, THERE'S BAD. IT'S COMPLEX. LINES, THEY ARE UNEVEN. THERE WILL BE SWAPPING. THERE WILL BE CHANGES. THE WORD THAT THEY WOULD USE IS THEY MAKE CHANGES. THEY ARE GOING TO CHANGE THE BATTLE LINES. RUSSIA HAS OCCUPIED A BIG PORTION OF UKRAINE. THEY HAVE OCCUPIED PRIME TERRITORY. WE ARE GOING TO TRY TO GET THAT TERRITORY BACK. THEY HAVE TAKEN PRIME TERRITORY. LARGELY THEY HAVE TAKEN OCEAN. OCEANFRONT PROPERTY, ALWAYS MOST VALUABLE PROPERTY AND REAL ESTATE. LAKE, RIVER, OCEAN, ALWAYS THE BEST. UKRAINE, A LOT OF PEOPLE DON'T KNOW THAT UKRAINE WAS LARGELY 1000 MILES OF OCEAN. IT'S GONE. OTHER THAN ONE SMALL AREA, ODESSA. SMALL AREA. JUST A BIT OF WATER LEFT. SO, I'M GOING TO GO AND SEE THE PARAMETERS. I MAY LEAVE THEY MAY SAY GOOD LUCK. THAT COULD BE THE END. I MIGHT SAY THIS. WON'T BE SETTLED. THERE ARE THOSE WHO BELIEVE THAT VLADIMIR PUTIN WANTED ALL OF UKRAINE. I HAPPEN TO BE ONE OF THEM. I THINK THAT IF IT WEREN'T FOR ME, HE WOULDN'T EVEN BE TALKING TO ANYBODY ELSE RIGHT NOW. BUT I AM GOING TO MEET WITH HIM AND WE WILL SEE WHAT THE PARAMETERS ARE. THEN I'M GOING TO CALL UP ZIELINSKI AND THE EUROPEAN LEADERS RIGHT AFTER THE MEETING. YEAH. I'M NOT MAKING A DEAL. IT'S NOT UP TO ME TO MAKE A DEAL . THE DEAL SHOULD BE MADE FOR BOTH. RUSSIA HAS TO GET BACK TO BUILDING THEIR COUNTRY. IT'S A MASSIVE COUNTRY. THEY HAVE 11 TIME ZONES. CAN YOU BELIEVE IT? MASSIVE. BY FAR. FROM THE STANDPOINT OF LAND, THE LARGEST. TREMENDOUS POTENTIAL IN RUSSIA. THEY COULD DO WELL. THEY ARE NOT DOING WELL. THE ECONOMY IS NOT DOING WELL. IT'S BEEN DISTURBED BY THIS. DOESN'T HELP IF THE PRESIDENT OF THE UNITED STATES TELLS THEIR SECOND LARGEST OIL BUYER THAT WE ARE PUTTING A 50% TARIFF ON YOU IF YOU BUY OIL FROM RUSSIA. THAT WAS A BLOW. BIG BLOW. THEN THEY SAID G, SO TOUGH. NOBODY ELSE WOULD HAVE DONE THAT. I DIDN'T START -- I DIDN'T STOP THERE. I WAS SET TO DO THINGS BIGGER THAN THAT. BUT I GOT A CALL THAT THEY WOULD LIKE TO MEET AND I'D LIKE TO SEE WHAT THEY ARE MEETING ABOUT. I WOULD LIKE TO SEE A CEASE-FIRE. THE BEST DEAL THAT CAN BE MADE WITH BOTH PARTIES. IT TAKES TWO TO TANGO, RIGHT? ULTIMATELY THERE WILL BE A MEETING NEXT WEEK. GREAT RELATIONSHIP WITH HIM, CONSIDERING THE FACT THAT I WASN'T NICE TO THEM BECAUSE OF THE PIPELINE. I ENDED THE PIPELINE. I ALSO GAVE THE JAVELINS -- YOU EVER HEAR ABOUT JAVELINS? THEY: TAKE BUSTERS. THEY SAY OBAMA GAVE THEM SHEETS AND I GAVE THEM JAVELINS. IF IT WERE NOT FOR ME, THE TANKS DESTROYED IN THE FIRST DAYS OF THE WAR, BECAUSE THEY GOT STUCK IN THE MUD, SOME COMMANDER MADE A BETTER -- YOU KNOW, THEY WOULD'VE BEEN IN HE HAVE WITHIN FOUR HOURS. GOING DOWN THE HIGHWAY. A RUSSIAN GENERAL MADE A BRILLIANT DECISION TO GO THROUGH THE FARMLAND INSTEAD. THEY JUST HAD TORRENTIAL RAINS. THE RAIN WAS BAD. THE TANKS GOT STUCK IN THE MUD. I DON'T KNOW WHO THAT GENERAL IS, BUT VLADIMIR, KNOWING HIM, HE'S PROBABLY NOT AROUND ANY LONGER. I GAVE THEM THE JAVELINS. YOU KNOW THAT, RIGHT? I GAVE THEM JAVELINS, THEY GAVE THEM SHEETS. BUT I'M GOING TO MEET WITH PUTIN AND WE ARE GOING TO SEE WHAT HE HAS IN MIND. IF IT IS A FAIR DEAL, I WILL REVEAL IT TO THE EUROPEAN UNION LEADERS INTO THE NATO LEADERS AND ALSO TO ZIELINSKI. OUT OF RESPECT, I THINK I WILL CALL ZIELINSKI FIRST AND CALL THEM AFTER. I MAY SAY LOTS OF LUCK, KEEP FIGHTING. I MAY SAY, WE CAN MAKE A DEAL. I WILL TELL YOU THIS, I'VE SEEN A POLE COMING OUT OF UKRAINE. 88% OF THE PEOPLE WOULD LIKE TO SEE A DEAL MADE. IF YOU GO BACK THREE YEARS, EVERYBODY WAS GUNG HO FOR WAR. YOU KNOW, EVERYBODY IS GUNG HO FOR WAR UNTIL YOU HAVE IT. IT'S AMAZING. I HAD IT WITH A COUPLE OF COUNTRIES WHERE I COULDN'T GET A DEAL DONE WITH ONE PARTICULAR COUNTRY. JUST COULDN'T. THE GUY WAS GREAT. FRIEND OF MINE. GOOD LEADER. TOUGH AS HELL. COULDN'T GET THE DEAL DONE. HE WENT INTO WORK FOR SHORT TIME. YOU KNOW WHERE I'M TALKING ABOUT. FIRST TERM. IT WAS NASTY, GUYS WERE BEING KILLED ALL OVER THE PLACE. HE WENT THROUGH A WEEK OF WORK AND I GOT THE DEAL DONE. HE SAID IT'S NASTY. > > FOLLOWING UP ON WHAT YOU WERE SAYING, FIRST OF ALL VOLODYMYR ZELENSKYY IS NOT INVITED ON FRIDAY? > > HE'S NOT A PART OF IT. I WOULD SAY HE COULD. BUT HE'S BEEN TO A LOT OF MEETINGS. HE'S BEEN THERE FOR 3.5 YEARS, NOTHING HAPPENED. YOU WANT SOMEONE WHO DID IT FOR 3.5 YEARS? DEFINITION OF A GOOD DEAL? I WILL TELL YOU AFTER I HEAR IT. YOU ARE TALKING ABOUT A LARGE AND COMPLEX SITUATION. I WILL TELL YOU THE WAR THAT I JUST SETTLED WITH AZERBAIJAN AND WITH, AS YOU KNOW, ARMENIA, IT WAS ALMOST AS COMPLEX AS THIS ONE. > > WHAT ABOUT THIS MEETING WITH VLADIMIR PUTIN? > > WILL HAVE A MEETING AT THE END OF THE FIRST TWO MINUTES I WILL KNOW EXACTLY IF WE CAN MAKE A DEAL. > > HOW DO YOU KNOW? > > BECAUSE I JUST DO. I MAKE DEALS. > > TWO QUESTIONS, ONE ON CHINA, ONE ON RUSSIA. CHINA, THE ADMINISTRATION AGREED TO SEND THEIR MOST ADVANCED CHIPS -- > > OBSOLETE. THE 20'S? THIS IS AN OLD CHIP. AN OLD CHIP THAT CHINA ALREADY HAS. I DEAL WITH JENSEN, WHO IS A GREAT GUY. AND NVIDIA. THE CHIP THAT WE ARE TALKING ABOUT, IT'S AN OLD CHIP. CHINA ALREADY HAS IT IN A DIFFERENT FORM, DIFFERENT NAME. THEY HAVE IT. FOR THEY HAVE A COMBINATION OF TWO. WE COULD MAKE UP FOR IT AND THEN SOME. JENSEN, HE'S A BRILLIANT GUY. HE HAS A NEW CHIP. BLACKWELL. YOU KNOW WHAT IT IS? IT'S SUPERDUPER ADVANCED. I WOULD MAKE A DEAL WITH THAT. ALTHOUGH IT'S POSSIBLE I WOULD MAKE A DEAL FOR A SOMEWHAT ENHANCED IN A NEGATIVE WAY BLACKWELL. 30% TO 50% OFF IT. BUT THAT IS THE LATEST OF THE GREATEST IN THE WORLD. NOBODY ELSE HAS IT. WON'T HAVE IT FOR FIVE YEARS. BUT THE H20, THAT'S OBSOLETE. I SAID I WANT 20%. TO IMPROVE THE COUNTRY. I DON'T WANT FOR MYSELF. EVERY TIME I SAY I WANT -- IT'S FOR THE AIR FORCE. SO, WHEN I SAY I WANT 20, I ONLY CARE ABOUT THE COUNTRY. I DON'T CARE ABOUT MYSELF. HE SAID, MAKE IT 15. WE NEGOTIATE A LITTLE DEAL. SO, HE'S SELLING A ESSENTIALLY OLD CHIP THAT HUAWEI HAS A SIMILAR CHIP. A CHIP THAT DOES THE SAME THING. I SAID GOOD, BECAUSE IF THEM GOING TO GIVE IT TO YOU, YOU KNOW, THEY HAVE A STOPPER, WHAT WE CALL A STOPPER, NOT ALLOWED TO DO IT. KNOWN AS A RESTRICTIVE COVENANT. I SAID I'M DOING THAT, I WANT YOU TO PAY US AS A COUNTRY. I RELEASE THEM ONLY FROM THE H20 . NOW, ON THE BLACK WELL, I THINK HE IS COMING TO SEE ME ABOUT THAT. BUT THAT WILL BE AN ENHANCED VERSION OF THE BIG ONE. LIKE I DON'T KNOW IF YOU KNOW, WE WILL SOMETIMES SELL FIGHTER JETS TO A COUNTRY AND WE WILL GIVE THEM 20% LESS THEN WE HAVE. YOU KNOW WHAT I MEAN, RIGHT? > > DO YOU SEE A TIME WHERE THERE COULD BE NORMAL TRADE BETWEEN THE U.S. AND RUSSIA, SHOULD THE MEETING GO WELL AND THERE IS PEACE? > > I DO. YES. RUSSIA HAS VALUABLE LAND. IF VLADIMIR PUTIN WOULD HEAD TOWARDS BUSINESS INSTEAD OF WAR -- IT'S A WARRING NATION. THAT'S WHAT THEY DO. A FRIEND OF MINE SAID RUSSIA IS TOUGH BECAUSE THEY KEEP ON FIGHTING. THEY BEAT HIBOR. SO DID WE. THEY BEAT NAPOLEON. THEY'VE BEEN DOING THIS FOR A LONG TIME. I ASKED A QUESTION OF A VERY, VERY SMART MAN THAT SOME PEOPLE LIKE AND SOME PEOPLE DON'T LIKE, VIKTOR ORBAN. RIGHT? FROM HUNGARY. THE HEAD OF HUNGRY. HE'S IN THAT SAME AREA. HE KNOWS THE COUNTRIES VERY WELL. I SAID THAT THIS WAS BEFORE BIDEN DIDN'T DO ANYTHING TO GET US OUT OF IT. COULD'VE GONE THIS OUT OF IT. WOULD HAVE NEVER HAPPENED. I SAID -- SO, CAN RUSSIA BE BEATEN BY UKRAINE? YOU LOOKED AT ME LIKE -- WHAT A STUPID QUESTION. HE SAID RUSSIA IS A MASSIVE COUNTRY. WHEN THEIR COUNTRY WHEN THEIR LIFE THROUGH WARS. THEY FIGHT WARS. IT'S WHAT THEY DO. HE SAID CHINA, BEAT YOU WITH TRADE. RUSSIA, BEAT YOU WITH WAR. I WAS VERY INTERESTED. THAT STATEMENT. CHINA WON'T BEAT US. THEY BEAT BIDEN. NOT US. DON'T FORGET, CHINA HAD TO PAY $400 MILLION IN TARIFFS LAST TIME. THAT WAS LAST TIME. IF WE DIDN'T HAVE COVID, ALL OF THIS STUFF WOULD ALREADY, WE WOULD BE LOADED. WE ARE FINDING HUNDREDS OF BILLIONS OF DOLLARS OF CASH POURING INTO OUR COUNTRY NOW BECAUSE OF TARIFFS. AND ALL WE ARE DOING IS WE ARE DOING WHAT THEY DO TO US. IT'S SO BEAUTIFUL TO SEE IT. THEY FIND, THEY FOUND, LAST MONTH, $25 BILLION OF CASH FLOW. WHERE DID IT COME FROM? I SAID I WOULD TELL YOU WHERE IT CAME FROM. CAME FROM A PLACE CALLED TARIFFS AND WE ARE DOING REALLY WELL. VERY WELL. I EXPECT TO HAVE A MEETING WITH VLADIMIR PUTIN. I THINK IT WILL BE GOOD. COULD BE BAD. I HAVE -- HEY, I'M HERE FOR ONE REASON. TO GET RID OF A WAR THAT SOMEBODY ELSE STARTED. SHOULD HAVE NEVER HAPPENED. IF I CAN END IT, GREAT. COMPLEX WAR. A LOT OF BAD BLOOD. ZELINSKI HAS BEEN THERE FOR 3.5 YEARS. PUT THEM IN A ROOM. NOW, I WILL SAY THIS, ULTIMATELY I'M PUTTING THE TWO OF THEM IN A ROOM. I WILL BE THERE OR I WON'T BE THERE. I THINK IT WILL GET SOLVED. EXCUSE ME, COULD YOU -- DO YOU HAVE OTHER QUESTIONS? I DON'T WANT THEM. I DON'T WANT THEM TO BE -- WAIT, WAIT, THESE ARE INCREDIBLE PEOPLE. I DON'T WANT THEM TO BE STANDING UP HERE. THIS ANYBODY HAVE ANY QUESTIONS IN THEM? ANY OF YOU GUYS? OK. QUESTION, BRIAN. > > THANK YOU. > > BY THE WAY, THIS IS ONLY D.C., IT'S UNFAIR TO HAVE THEM STAND UP HERE ALL DAY LONG. TWO QUESTIONS FOR YOU. D.C., IT'S PERSONAL. LAST YEAR I WAS ROBBED ON THE STREET BY ONE OF THESE TEENAGE THUGS. HAD A GUN. CAROLINE: THAT WAS THE PRESIDENT SPEAKING AT THE WHITE HOUSE IN FRONT OF REPORTERS, CURRENTLY TALK ABOUT MEETING WITH VLADIMIR PUTIN THAT ZELINSKI WILL NOT BE A PART OF. WE UNDERSTAND THAT ZELINSKI HAS GONE TO A LOT OF MEETINGS ALREADY. THEN MAKING A PIVOT TO THE WORLD OF TECHNOLOGY INTO CHIPS, TRUMP SAID HE WOULDN'T MAKE A DEAL ON THE NEW NVIDIA CHIP THAT HE'S REFERENCING'S, THE BLACKWELL CHIP SYSTEM. INITIALLY WHEN TALKING ABOUT AGE 20, HE SAID HE WANTED A 20% TARIFF FOR EXPORTS, BUT SAID HE MANAGED TO NEGOTIATE HIM DOWN, WAS NEGOTIATED DOWN TO 15%, CONFIRMING CHIP PAYMENT GOING FROM NVIDIA TO THE U.S. GOVERNMENT. HE SAYS THAT THE H20 IS OBSOLETE BUT STILL HAS A MARKET AND HE THINKS THAT JENSEN HUANG IS COMING BACK TO SEE HIM, HE SAYS, ABOUT THE BLACKWELL CHIPS. LET'S GO TO JOE NOW, JOE MATHIEU, WHO IS BACK TO BREAK IT ALL DOWN WITH US. A LOT ABOUT RUSSIA AND GEOPOLITICS, CHINA AS WELL. FOR THE TECHNOLOGY AUDIENCE TALK TO US ABOUT WHAT YOU LEARNED IN THE NVIDIA CONTEXT. . JOE: CONFIRMING THAT 50%, AS USUAL BLOOMBERG WAS AHEAD OF THE CURVE WITHOUT REPORTING. BUT TO GO ON TO SUGGEST THAT THERE COULD BE A DEAL INVOLVING BLACKWELL COULD BE THE CLOSEST THING WE HAVE TO NEWS HE SAID I WOULDN'T MAKE A DEAL WITH THAT, REFERRING TO BLACKWELL, THEN SAID IT WAS POSSIBLE HE WOULD MAKE A DEAL, ENHANCED IN A NEGATIVE WAY, BLACKWELL TAKING OFF 30% TO 50%, SOMEHOW SUGGESTING THAT THERE WOULD BE A LOWER POWERED VERSION OF BLACKWELL. I EXPECT JENSEN HUANG WOULD HAVE SOME THINGS TO SAY ABOUT THAT WHEN THEY MEET AGAIN, BUT THIS IDEA THAT WE COULD SEE CONTINUED CHANGES IN THE NVIDIA EXPORT CONTROLS AND RELATIONSHIP WITH CHINA, I EXPECTED WOULD GO FOR AMD AS WELL, IT WAS REMARKABLE TO HEAR THE PRESIDENT RIFFING ABOUT THIS. THERE'S A LOT MORE COMING UP TO DISCUSS ON THE SHOW. THERE CERTAINLY IS. NVIDIA AMD, RETURNING IN A MOMENT. THIS IS \"BLOOMBERG TECH.\" ♪ ED: BLOOMBERG HAD REPORTED THAT NVIDIA AND AMD HAD AGREED TO PAY 15% OF THEIR REVENUE FROM CHIP SALES OF THE U.S. GOVERNMENT, AND TRUMP HAS CONFIRMED SOME OF THAT. TOM GILES IS IN SAN FRANCISCO. WHAT DO WE NEED TO KNOW? TOM: THIS HAD VERY LITTLE PRECEDENT. IT DEMONSTRATES JUST HOW IMPORTANT TO THE CHINESE MARKET IS TO THESE COMPANIES. THEY REALLY WANT TO BE ABLE TO SELL THEIR MOST ADVANCED CHIPS INTO THE CHINESE MARKET. THEY HAVE HIT A BUZZ SAW FROM THE TRUMP ADMINISTRATION, WHICH HAS PLACED REALLY STRICT LIMITS ON WHAT THEY CAN AND CANNOT DO. SO, THEY ARE IN THE MIDDLE OF NEGOTIATIONS WITH THE CHINESE GOVERNMENT OVER TARIFFS. SO, THIS SHOWS THAT THE TRUMP ADMINISTRATION WANTS TO CUT DEALS AND WANTS A CUT OF THE SALES OF THESE CHIPS AND ARE WILLING TO TURN A BLIND EYE TO THE SALE OF ADVANCED ARTIFICIAL INTELLIGENCE CHIPS INTO THE CHINESE MARKET IF THEY CAN GET A RETURN. BUT THIS IS GOING TO COMPLICATE TRADE NEGOTIATIONS GOING FORWARD. CAROLINE: THANK YOU, TOM, FOR WRAPPING UP THE LATEST SDC CROSSES PATHS WITH SAN FRANCISCO. THAT DOES IT FOR THIS EDITION OF \"BLOOMBERG TECH.\" ED: THE BID THAT WE DIDN'T GET TO, WE THINK THE INTEL CEO IS MEETING WITH THE PRESIDENT TODAY. SO MUCH COMING UP TO RECAP ON THE PODCAST. YOU KNOW WHERE TO FIND IT. APPLE, SPOTIFY, IR, ALL BLOOMBERG PLATFORMS. THIS IS “BLOOMBERG TECH.”",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. CHINA",
      "weight": 0.070204996
    },
    {
      "name": "U.S. CHIP CONTROLS",
      "weight": 0.06904557
    },
    {
      "name": "CHIP REVENUES",
      "weight": 0.06303464
    },
    {
      "name": "U.S. CHINA AI COMPETITION",
      "weight": 0.062499993
    },
    {
      "name": "REAL CHINA REVENUES",
      "weight": 0.061437804
    },
    {
      "name": "CHIP CONTROLS",
      "weight": 0.060397033
    },
    {
      "name": "CHIP SALES",
      "weight": 0.060358055
    },
    {
      "name": "MORE CHIP MANUFACTURING",
      "weight": 0.060235452
    },
    {
      "name": "MANUFACTURING CHIPS",
      "weight": 0.058476657
    },
    {
      "name": "AI CHIP SALES",
      "weight": 0.05792001
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Business Leaders"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9384765625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.587890625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.465576171875
    }
  ],
  "sentiment": {
    "positive": 0.30988604,
    "negative": 0.17001095,
    "neutral": 0.520103
  },
  "summary": "The article discusses the agreement between NVIDIA and AMD to give the United States 15% of any REVENUES of AI CHIP SALES to China in exchange for EXPORT LICENSES. This move raises questions about the role of the US government in this business, as it is now a part of the SEMICONDUCTOR INDUSTRY and is seen as a significant step forward in the industry. The article also discusses the potential impact of this deal on the future of the AI market in China, as China is a key market for both companies. The show also discusses a potential suspension of the CEO of Intel, LIP-BU TAN, who is set to meet with President Trump at the White House.",
  "shortSummary": "BloOMberG tech features a major AI deal, Intel CEO visits the White House, and questions arise about US-China trade tensions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d8be765a6bbf4ed485969e983dfc43bf",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "NVIDIA and AMD have reportedly agreed to pay 15% of their revenues from AI chip sales to China to the U.S. government in exchange for export licenses, marking a significant shift in U.S.-China trade relations. This arrangement raises questions about national security and the implications of the U.S. government becoming more involved in the semiconductor industry. The Intel CEO is also set to meet with the President amid ongoing discussions about semiconductor manufacturing and potential conflicts of interest.",
  "argos_id": "8NPEO83LC"
}