{
  "url": "https://nypost.com/2025/08/12/us-news/mexico-sends-26-fugitive-cartel-members-to-us-in-deal-with-trump-admin/",
  "authorsByline": "Caitlin McCormack",
  "articleId": "3d2619d6e4094e50aafa56c383d167d2",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/Untitled-1-98.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:48:03+00:00",
  "addDate": "2025-08-13T02:49:44.125400+00:00",
  "refreshDate": "2025-08-13T02:49:44.125402+00:00",
  "score": 1.0,
  "title": "Mexico sends 26 ‘fugitive’ cartel members to US for prosecution in deal with Trump administration",
  "description": "Mexico turned over 26 cartel members wanted for crimes in the US to American authorities as part of the latest deal with the Trump administration. The prisoners include leaders and managers of seve…",
  "content": "Mexico turned over 26 cartel members wanted for crimes in the US to American authorities as part of the latest deal with the Trump administration.\n\nThe prisoners include leaders and managers of several Mexican drug cartels and they’re facing charges like murder, hostage-taking, human smuggling and kidnapping, the US Department of Justice announced Tuesday.\n\nOne of the “fugitives” sent to the US is Abigael González Valencia, a high-ranking leader of the “Los Cuinis” organization that helped finance and grow the notorious cartel Jalisco New Generation, better known as CJNG, according to the DOJ.\n\nValencia is also the brother-in-law of CJNG leader Nemesio Rubén “El Mencho” Oseguera Cervantes, a top target who the US government is offering $15 million just for information that could lead to his capture or conviction.\n\nAnd one of Valencia’s brothers, José González Valencia, was sentenced in Washington’s federal court to 30 years in June after pleading guilty to international cocaine trafficking. He was originally busted in 2017 while vacationing at a beach resort in Brazil under a fake name.\n\nRoberto Salazar, another prisoner shipped to the states, had been sought in connection to the murder of Los Angeles County Sheriff’s Deputy Juan Escalante in 2008, according to the Justice Department.\n\nAnother man, Abdul Karim Conteh, is a national from Sierra Leone who was held in Mexico for allegedly smuggling migrants from countries in and around the Middle East, according to the DOJ. He had no listed affiliation with a cartel.\n\n“Today is the latest example of the Trump administration’s historic efforts to dismantle cartels and foreign terrorist organizations. These 26 men have all played a role in bringing violence and drugs to American shores — under this Department of Justice, they will face severe consequences for their crimes against this country. We are grateful to Mexico’s National Security team for their collaboration in this matter,” Attorney General Pamela Bondi said.\n\nUS Ambassador to Mexico Ronald Johnson added: “These fugitives will now face justice in U.S. courts, and the citizens of both of our nations will be safer from these common enemies.”\n\nIn February, 29 cartel figures were handed over to the US, including drug lord Rafael Caro Quintero who was previously linked to the murder of a US Drug Enforcement Administration agent in 1985. Since then, many have begun to face terror charges for their alleged crimes.\n\nThat same month, the Trump administration classified CJNG and seven other Latin American-based crime groups as foreign terrorist organizations and secretly authorized the military to fight them by land and sea.\n\nThe second round of inmates were all flown to US soil after the DOJ agreed not to seek the death penalty against any defendants or cartel affiliates in February’s transfer, a source close to the matter told The Associated Press.\n\nThe ongoing deal and second transfer is the culmination of ever-increasing pressure from the Trump administration to curb drug trafficking and smuggling across the US-Mexico border.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/02/19/us-news/tren-de-aragua-ms-13-mexican-cartel-gangs-designated-as-foreign-terror-groups-by-trump-state-department/",
    "https://nypost.com/2025/08/08/us-news/trump-secretly-authorized-military-force-against-latin-american-drug-cartels-classified-as-foreign-terrorist-organizations/",
    "https://nypost.com/2025/08/12/us-news/bryan-kohberger-kept-up-at-night-by-relentless-inmate-taunts-in-prison-report/",
    "https://nypost.com/2025/02/27/us-news/deas-most-wanted-drug-lord-rafael-caro-quintero-arrives-in-nyc-to-face-charges-after-mexico-hands-him-over-to-us/",
    "https://nypost.com/2025/08/12/us-news/martha-nolan-oslatarras-tragic-cause-of-death-on-montauk-boat-eyed-as-suspected-accidental-drug-overdose-sources/",
    "https://nypost.com/2025/02/28/us-news/mexican-drug-kingpin-narco-of-narcos-faces-judge-in-cuffs-of-dea-agent-he-killed-in-1985/",
    "https://nypost.com/2022/02/09/mexican-cartel-borrows-middle-east-terrorists-brutal-tactics/",
    "https://nypost.com/2025/08/12/us-news/wild-daylight-brawl-breaks-out-among-swimsuit-clad-boaters-at-florida-lake-in-front-of-families-kids-video/",
    "https://www.justice.gov/opa/pr/26-fugitives-wanted-violent-and-serious-crimes-returned-united-states-mexico-including-0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "US soil",
      "weight": 0.087416016
    },
    {
      "name": "US",
      "weight": 0.08716867
    },
    {
      "name": "several Mexican drug cartels",
      "weight": 0.08486902
    },
    {
      "name": "US Drug Enforcement Administration",
      "weight": 0.081755616
    },
    {
      "name": "cartel affiliates",
      "weight": 0.079669625
    },
    {
      "name": "cartels",
      "weight": 0.07829619
    },
    {
      "name": "Trump administration",
      "weight": 0.077354856
    },
    {
      "name": "drug trafficking",
      "weight": 0.064256035
    },
    {
      "name": "drug lord Rafael Caro Quintero",
      "weight": 0.063108765
    },
    {
      "name": "foreign terrorist organizations",
      "weight": 0.061644334
    }
  ],
  "topics": [
    {
      "name": "Crime"
    }
  ],
  "categories": [
    {
      "name": "General"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.97705078125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.9677734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.87744140625
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.46875
    },
    {
      "name": "/News/Other",
      "score": 0.406982421875
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.368896484375
    }
  ],
  "sentiment": {
    "positive": 0.06930015,
    "negative": 0.6714524,
    "neutral": 0.25924745
  },
  "summary": "Mexico has sent 26 'fugitives' from Mexican drug cartels to the US for prosecution in a deal with the Trump administration. The prisoners, including leaders and managers of several Mexican cartels, are facing charges such as murder, hostage-taking, human smuggling and kidnapping. One of the 'defendants' is Abigael González Valencia, a high-ranking leader of the \"Los Cuinis\" organization that helped finance and grow the cartel Jalisco New Generation (CJNG), and another is the brother-in-law of CJNG leader Nemesio Rubén \"El Menche\" Oseguera Cervantes. The US government is offering $15 million for information leading to Valencia's capture or conviction. This is part of a larger effort by the US to curb drug trafficking and smuggling across the US-Mexico border.",
  "shortSummary": "Mexico has extradited 26 cartel members to the US for prosecution, including leaders and managers of several Mexican cartels, under a deal with the Trump administration.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9a421eb1dfbf487db06a23f677298faa",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/12/us-news/wild-daylight-brawl-breaks-out-among-swimsuit-clad-boaters-at-florida-lake-in-front-of-families-kids-video/",
      "text": "Warning graphic content\nWild daylight brawl breaks out among swimsuit-clad boaters at Florida lake in front of families, kids: video\nA wild brawl broke out among a group of swimsuit-clad boaters at a Florida lake over the weekend — in which one man was knocked unconscious and left floating face down in the water, shocking video shows.\nThe unruly fight happened at Lake Winterset in Polk County, in front of young children relaxing on the lakeside with their families, the Polk County Sheriff’s Office said.\nSeven men and a 17-year-old boy were arrested, Sheriff Grady Judd announced Tuesday, as he vowed to make an example out of the hooligans.\nThe dramatic footage starts when one of the men is slugged twice by another before he flops to the ground and appears to be unconscious. Once he went face down, the others started swinging.\nPunches fly seemingly at random as a woman in a pink bikini attempts CPR on the knocked-out man, the clip played by the sheriff shows.\nThe chaos stilled for a moment as one of the taller men wearing a gigantic gold chain tried to hold back another man who thrashed wildly in his arms.\nThe two tripped over a ledge and into the lake before the man who threw the first punch dove in out of nowhere and started walloping another man, who was also knocked unconscious face down in the lake.\nMason Land, Nate Land, Payton Ely, Timothy Gooding, Richard Carden, Garrett Ore, Garrett Hiltabidel and an unidentified 17-year-old have since been arrested for the violence and all face charges for rioting, affray, trespassing and disorderly conduct, according to the sheriff’s office.\nAll of the men were in their late teens and early 20s, except for Carden, who is 40 years old.\nThe fed-up sheriff promised an unflinching crackdown on delinquency throughout the county, specifically on properties like the Winterset sandbar.\n“You can knucklebust and create brain injuries to each other on your own property without creating a disturbance to your neighbors. It’s over, folks. I think I’ve said that enough,” Judd said.\n“The conduct is reprehensible and, obviously, you don’t believe us when we try to warn you. So you have unleashed the teeth of the dog, and now we’re going to start biting you, just like we bit these guys here.”\nRabble-rousing young people tend to crop up near the Winterset sandbar for all types of criminality, including public displays of indecency and sexual activity captured by neighboring property owners, the sheriff said.\nIn May, the Polk County Commission passed an ordinance that would keep boaters away from the shoreline at specific lakes, including the sandbar on Lake Winterset. It has just reached the final stages of state approval by early August, Judd said, but it hasn’t gone into effect yet.\nIn the wake of the fight, Judd added that the sheriff’s office will be meeting with the county attorneys to explore imposing an extra noise ordinance at the lake.\nLake Winterset is just 2 miles away from LEGOLAND Florida, a theme park resort based on the popular children’s toy."
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/martha-nolan-oslatarras-tragic-cause-of-death-on-montauk-boat-eyed-as-suspected-accidental-drug-overdose-sources/",
      "text": "NYC designer Martha Nolan-O’Slatarra’s tragic death on Montauk boat eyed as suspected accidental drug overdose: sources\nThe mysterious death of Manhattan swimwear designer Martha Nolan-O’Slatarra at the upscale Montauk Yacht Club is being eyed as a possible accidental overdose, sources said Tuesday.\nThe 33-year-old Irish beauty was found unconscious at the ritzy club at around midnight on Aug. 5 aboard a boat named “Ripple” – one of at least two Grateful Dead-themed crafts owned by insurance mogul Christopher Durnan, sources tell The Post.\nAn autopsy is pending to determine Nolan-O’Slatarra’s official cause of death – although sources said it was a suspected drug overdose.\nQuestions have been swirling since the tragic night when Nolan-O’Slatarra was discovered on the “Ripple,” which was docked at the Yacht Club. Members reported hearing screams and called 911, before trying to resuscitate the young designer – who was later pronounced dead.\nThe good Samaritans told The Post they were woken by a naked man throwing sunscreen at their boat and saw him running down the dock screaming, “Do something!”\nDurnan, 60, a familiar figure at the club, owns the Durnan Group in Rockville Centre, which manages the “largest, most successful Workers Compensation Safety Group for Real Estate” on the company’s website.\nHe owns “Ripple” and a second boat, “Hell in a Bucket,” which was docked alongside and is also a shout-out to the Grateful Dead, several club members confirmed.\nDurnan did not return several requests for comment.\nSuffolk County cops have not filed charges or identified any suspects in the case. But authorities have also not publicly ruled out foul play, despite revealing that there was no evidence of violence to the body.\nNolan-O’Slatarra’s death is also being investigated by Suffolk County’s East End Drug Task Force, according to a Tuesday report by Newsday.\n“Until you start ruling stuff out, everything is in play,” a source familiar with the investigation told the outlet.\nNolan-O’Slatarra, a native of the tiny Irish town of Carlow, migrated to the US, where she started as a bottle service girl in SoHo before co-founding East x East, a swimwear label.\n“I always knew I wanted to be successful, that I was money-driven, business-driven, and that fashion is a tough industry and it would be a slow road,” she told the Irish Independent last year.\nHer partner in the East x East, Dylan Grace, posted a moving tribute on Instagram following her death.\n“We dreamed big together, laughed harder than anyone else could understand and built so much from nothing,” he wrote. “I’m truly blessed and grateful to have had you in my life.”\nNolan-O’Slatarra summered in the Hamptons, where she hosted successful pop-up shows and fashion exhibits for wealthy clientele in Montauk and the surrounding area.\nShe had finalized her divorce to ex-Sam Ryan just months before her death, according to court records reviewed by The Post.\n“I represented Mr. Ryan in a matrimonial proceeding. The final papers had been submitted to the court, and before the Judgment of Divorce was issued, I became aware of Ms. Nolan-O’slatarra’s passing and promptly notified the court,” his attorney, David Centeno, said in a statement. “Out of respect for the privacy of those involved and my ethical restraints, I cannot discuss whether there was a prenuptial agreement, mediation, or other private arrangements.”\nNolan-O’Slatarra’s heartbroken mother, Elma Nolan, told the Irish Independent on Aug. 7 that her daughter was planning a trip home to Carlow before her death.\n“I don’t know what happened to my daughter,” she told the outlet. “I feel numb and in shock.”\n— Additional reporting by Brandon Cruz, Joe Marino and Peter Senzamici"
    },
    {
      "url": "https://www.justice.gov/opa/pr/26-fugitives-wanted-violent-and-serious-crimes-returned-united-states-mexico-including-0",
      "text": "Related Content\nPress Release\nThe United States announced today that it has taken into custody 26 fugitives from Mexico facing a range of federal and state criminal charges from around the country, including charges relating to drug-trafficking, hostage-taking, kidnapping, illegal use of firearms, human smuggling, money laundering, the murder of a sheriffs’ deputy, and other crimes. Among the fugitives taken into U.S. custody today are leaders and managers of dangerous drug cartels, such as those designated as Foreign Terrorist Organizations and Specially Designated Global Terrorists, including the Sinaloa Cartel, Cártel de Jalisco Nueva Generación (CJNG), and Cártel del Noreste (formerly Los Zetas). These fugitives are collectively alleged to have imported into the United States tonnage quantities of dangerous drugs, including cocaine, methamphetamine, fentanyl, and heroin.\n“Today is the latest example of the Trump administration's historic efforts to dismantle cartels and foreign terrorist organizations,” said Attorney General Pamela Bondi. “These 26 men have all played a role in bringing violence and drugs to American shores -- under this Department of Justice, they will face severe consequences for their crimes against this country. We are grateful to Mexico’s National Security team for their collaboration in this matter.”\nIncluded in today’s transfer are the following fugitives:\nBelow is a complete list of fugitives, as well as the districts in which they are charged and will appear in federal court in the coming days:\n| Fugitive | Arraignment Jurisdiction | Statutory Maximum |\n| Enrique Arballo Talamantes | District of New Mexico | Up to life imprisonment |\n| Benito Barrios Maldonado | District of Arizona | Up to life imprisonment |\n| Luis Raul Castro Valenzuela | District of Delaware | Up to life imprisonment |\n| Francisco Chavez | District of Colorado | Up to life imprisonment |\n| Abdul Karim Conteh | Southern District of California | 45 years’ imprisonment |\n| Baldomero Fernandez Beltran | District of Arizona | Up to life imprisonment |\n| Ismael Enrique Fernandez Vazquez | Eastern District of Texas | Up to life imprisonment |\n| Leobardo Garcia Corrales | Southern District of New York | Up to life imprisonment |\n| Abigael Gonzalez Valencia | District of Columbia | Up to life imprisonment |\n| Jose Carlos Guzman Bernal | District of Alaska | Up to life imprisonment |\n| Anton Petrov Kulkin | District of Massachusetts | Up to life imprisonment |\n| Roberto Omar Lopez | Northern District of Georgia | Up to life imprisonment |\n| Jose Francisco Mendoza Gomez | Eastern District of Virginia | Up to life imprisonment |\n| Hernan Domingo Ojeda Lopez | District of Columbia |\nUp to life imprisonment |\n| Daniel Perez Rojas | District of Columbia | Up to life imprisonment |\n| Juan Carlos Sanchez Gaytan | Southern District of Texas | Up to life imprisonment |\n| David Fernando Vasquez Bejarano | Eastern District of Virginia | Up to life imprisonment |\n| Jose Antonio Vivanco Hernandez | Northern District of Illinois | Up to life imprisonment |\n| Mauro Alberto Nunez Ojeda | District of Columbia | Up to life imprisonment |\n| Juan Carlos Felix Gastelum | Southern District of California | Up to life imprisonment |\n| Jesus Guzman Castro | Eastern District of New York and District of South Carolina | Up to life imprisonment |\n| Pablo Edwin Huerta Nuno | Southern District of California | Up to life imprisonment |\n| Servando Gomez Martinez | Southern District of New York | Up to life imprisonment |\n| Kevin Gil Acosta | Southern District of New York | Up to life imprisonment |\n| Roberto Salazar | CA: Los Angeles County | Up to life imprisonment |\n| Martin Zazueta Perez | Southern District of New York | Up to life imprisonment |\nAttorney General Pamela Bondi thanked the law enforcement officers of the Drug Enforcement Administration, FBI, U.S. Marshal’s Service, and U.S. Immigration and Customs Enforcement Homeland Security Investigations, the Los Angeles County Sheriff’s Department, and the Los Angeles County Police Department for their valuable contributions to these investigations.\nThe Attorney General also thanked the Justice Department Criminal Division’s Narcotic and Dangerous Drug Section, as well as the U.S. Attorneys’ Offices for the District of Alaska, District of Arizona, Southern District of California, District of Columbia, District of Colorado, Middle District of North Carolina, District of Delaware, Northern District of Georgia, Northern District of Illinois, District of Massachusetts, District of New Mexico, Eastern District of New York, Southern District of New York, District of South Carolina, Eastern District of Virginia, Northern District of Texas, Eastern District of Texas, Southern District of Texas, and Western District of Texas and Los Angeles County for handling the prosecutions of these cases. The Attorney General also thanked the Justice Department’s Office of International Affairs which provided critical assistance in securing the transfer of these fugitives to the United States to face justice.\nAn indictment is merely an allegation. All defendants are presumed innocent until proven guilty beyond a reasonable doubt in a court of law."
    },
    {
      "url": "https://nypost.com/2025/02/19/us-news/tren-de-aragua-ms-13-mexican-cartel-gangs-designated-as-foreign-terror-groups-by-trump-state-department/",
      "text": "Tren de Aragua, MS-13, Mexican cartel gangs designated as foreign terror groups by Trump State Department\nThe notorious Venezuelan gang Tren de Aragua, the brutal MS-13 organization, and half a dozen Mexican cartels have been designated as foreign terrorist organizations by the State Department.\nThe announcement, dated Feb. 6 and published in the Federal Register on Wednesday, prohibits Americans from providing “material support or resources” to the organizations — and allows the US to deport those involved in the gangs.\nIn addition to Tren de Aragua and MS-13, the cartels given the designations include Cartel de Sinaloa, formerly led by notorious drug lord “El Chapo“; Cartel de Jalisco Nueva Generacion, Carteles Unidos, Cartel del Noreste, Cartel del Golfo and La Nueva Familia Michoacana.\nStay up to date on the notorious MS-13 gang:\n- Top MS-13 leader described as ‘worst of the worst’ arrested in Virginia during major Trump-backed operation: FBI\n- Long Island DA reveals 3 twisted ‘rules’ that made MS-13 a plague in the suburbs — ‘biggest, baddest, most violent gang’\n- MS-13 boss ‘Old Saint’ ran sinister US murder, drug network from a South American jail: prosecutors\n- Tren de Aragua, MS-13, Mexican cartel gangs designated as foreign terror groups by Trump State Department\nPresident Trump had vowed to crack down on criminal drug organizations and violent gangs of illegal immigrants when he assumed office. He specifically called out Tren de Aragua, which had established a presence in more than a dozen US states as of late 2024\n“I will rescue Aurora and every town that has been invaded and conquered,” Trump told supporters in suburban Denver this past October, promising his administration will either “put these vicious and bloodthirsty criminals in jail” or “get them the hell out of our country.”\nJose Ibarra, the convicted killer of Georgia nursing student Laken Riley, was a member of Tren de Aragua.\nTrump has also said he would invoke the Alien Enemies Act of 1798 to deport illegal gang members without court appearances — but he has yet to make that announcement.\nTrump has continued to crack down on illegal migrants coming across the southern and northern borders, directing border czar Tom Homan, the Department of Homeland Security, and Immigration and Customs Enforcement to work to deport the migrants.\nThe president has also pressured world leaders to accept thousands of their citizens who were illegally in the US, and has threatened Canada and Mexico with 25% tariffs if they don’t shut down their borders to illegal migration."
    },
    {
      "url": "https://nypost.com/2022/02/09/mexican-cartel-borrows-middle-east-terrorists-brutal-tactics/",
      "text": "Mexican cartel borrows brutal new tactics from Middle East terrorists\nMexico’s most powerful drug cartel has turned to al Qaeda- and Taliban-inspired guerrilla tactics in a bloody new phase of its battle to wipe out its rivals.\nThe Jalisco New Generation Cartel, known by its Spanish-language acronym, CJNG, is using landmines and explosives-laden drones to kill other gang members, cops and soldiers in a savage campaign of murder. The gang is also working with Middle Eastern jihadi “technical advisers,” according to Mexican law enforcement and security sources.\n“Their philosophy is basically if you are not with us, you are against us,” said Robert Almonte, a Texas-based security consultant and expert on Mexican cartels.\n“That includes the police that refuse to be on their payroll, local communities and their rivals. It doesn’t surprise me that they are consulting with terrorists because what they are engaging in are acts of terrorism.”\nThe Mexican army defused 12 handmade landmines last week in Tepalcatepec, in Michoacan state, where the CJNG is dominant, according to Milenio, a national newspaper based in Monterrey. One powerful explosive damaged an armored vehicle and injured 10 soldiers, the paper said.\nThe state is heavily controlled by the Jalisco cartel and is among the most dangerous areas in the country, with 200 homicides reported this year. Last year, the state recorded more than 2,700 murders, according to law enforcement data.\nMexican security experts cited by Milenio described most of the CJNG explosives as metal pipes filled with gunpowder and attached to a battery and detonator. The devices are buried underground and explode upon contact with a vehicle.\n“Jalisco Nueva Generacion was the first to use drones with explosives attached to them, so it doesn’t surprise me that they are now using landmines and taking a page from al Qaeda,” Almonte told The Post.\n“The mines are something new for them,” he said. “They appear to be similar to the ones used against US forces in Iraq and Afghanistan.”\nLast month, the Jalisco cartel used a drone to drop explosives on an encampment of displaced people in a Michoacan forest, according to El Universal newspaper. The video footage, taken from the drone, shows dozens of people running for their lives as the explosives ignite trees in a fiery blaze near the municipality of Tepalcatepec.\nThe municipality is at the crossroads where the CJNG is fighting a turf war against its main rival, the Carteles Unidos, a criminal organization made up of gangs, including Cartel de Tepalcatepec, Los Viagras and other groups bent on destroying the CJNG, according to InSight Crime.\n“We’ve now had four months of insecurity,” said Tepalcatepec Mayor Martha Laura Mendoza last month. “But nobody turns around to see [what’s happening]. This is the only municipality where there are more than 3,000 displaced people. Four months and no one provides a solution.”\nIn September 2021, five men who were guarding a checkpoint to keep cartel members out of the region were decapitated by CJNG, according to reports. The Jalisco cartel also warned local residents in audio recordings to keep out of their way.\nLed by Nemesio Ruben Oseguera Cervantes (aka El Mencho), CJNG is among Mexico’s most violent cartels, according to the US Drug Enforcement Administration.\nThe cartel is particularly known for its bold attacks on Mexican security forces. A 2015 ambush by the cartel left 15 officers dead. The group was also behind an assassination attempt on Mexico City’s police chief Omar Garcia Harfuch in 2020, when the top cop was shot at 414 times but wasn’t hit, though two bodyguards and one passerby were killed.\nEl Mencho is the most wanted man in Mexico and among the most wanted in the US, with a DEA bounty of $10 million for information leading to his capture.\nIn November, Mexican security forces arrested El Mencho’s wife, Rosalinda Gonzalez, who headed up the criminal organization’s finances. She was released on $78,000 bail."
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/bryan-kohberger-kept-up-at-night-by-relentless-inmate-taunts-in-prison-report/",
      "text": "Bryan Kohberger whines about being kept up at night by ‘relentless’ inmate taunts at maximum security lockup: report\nConvicted killer Bryan Kohberger has whined that he’s “extremely annoyed” and losing sleep at the maximum security prison he now calls home — thanks to fellow inmates who constantly yell through vents into his cell in a “relentless” taunting campaign, according to a report.\nKohberger, who was hit with four life sentences last month for slaying four University of Idaho students, was transferred from jail to the only maximum security prison in the state and is now being held there in solitary confinement.\nAnd the prisoners at Kohberger’s new digs at Idaho Maximum Security Institution in Kuna have had it out for the convicted criminology student — taking turns shouting into the vent that leads into his cell most hours of the day, a law enforcement source told the Daily Mail.\nKohberger, 28, has made multiple complaints to prison guards that he’s been unable to sleep, according to Chris McDonough, a retired homicide detective who works for the Cold Case Foundation.\n“It’s driving him crazy,” McDonough told the outlet. “The inmates are tormenting him at night and almost all hours of the day — taunting him through the vents in his cell.”\n“They are literally getting up into the grate and yelling at him. The inmates are taking turns doing it. It’s relentless,” McDonough continued. “He’s extremely annoyed and frustrated. He’s complaining to the authorities that he can’t sleep because of them.”\nKohberger is being housed in the prison’s restricted unit in the facility’s J block, away from the general prison population.\nHe’s kept in a cell by himself at all times, except for one-hour a day when he’s let into “the cage” outside for recreation, while he wears restraints. And he’s only allotted one shower every other day.\nThe high-profile nature of Kohberger’s case and the fact he copped to such abhorrent crimes makes him a target for other inmates who would want to harm him “just to make a name for themselves,” McDonough explained.\nAnd since the other inmates don’t pose a physical threat to Kohberger while he’s in solitary, prison staff aren’t likely to intervene, the former cop said.\nStill, as attention moves away from Kohberger over time, prison staff may eventually be willing to move him back to the general population, McDonough explained.\nAt the jail that Kohberger was previously kept in while he awaited trial, other defendants said he did unusual things like spending hours on the phone with his mom MaryAnn, washing his hands compulsively, taking showers upwards of an hour long and staying awake at night only to nap during the day.\nOnce, he confronted another defendant who yelled “you suck” at a sports player on the TV because he thought the man was insulting Kohberger and his mom as they spoke on the phone.\nLast month, Kohberger took a surprise plea deal just weeks before his highly anticipated trial was set to kick off. The deal saw him skirt the possibility of facing the death penalty, enraging some of the families of his victims and leaving loved ones with no explanation for why he committed the heinous murders.\nHe admitted to killing Xana Kernodle, Kaylee Goncalves, Madison Mogen, and Ethan Chapin on Nov. 13, 2022 in their off-campus house in Moscow."
    },
    {
      "url": "https://nypost.com/2025/02/27/us-news/deas-most-wanted-drug-lord-rafael-caro-quintero-arrives-in-nyc-to-face-charges-after-mexico-hands-him-over-to-us/",
      "text": "DEA’s most wanted drug lord Rafael Caro Quintero arrives in NYC to face charges after Mexico hands him over to US\nA drug cartel kingpin, known as the US Drug Enforcement Administration’s top target for his role in the killing of a DEA agent, was moved from Mexico to New York City on Thursday and is expected to face a judge on Friday, according to officials and sources.\nRafael Caro Quintero was among 29 cartel members the Mexican government released into US custody as President Trump has threatened to slap imports from Mexico with a 25% tariff on March 4 if the country doesn’t do more to crackdown on illegal immigration drug smuggling.\n“Obviously, this is one of the biggest days in decades for DEA agents,” Ray Donovan, the former head of New York’s DEA office, told The Post. “This is very near and dear to every DEA agent.”\n“This is bigger than Chapo for me and every other DEA Agent,” Donovan added, referring to Joaquin “El Chapo” Guzman, whom he’s credited with capturing. “This was personal.”\nDEA Acting Administrator Derek Maltz said there is “one name” in the group of 29 cartel members “that stands above the rest for the men and women” of his agency – Quintero.\nQuintero, 72, arrived in the Big Apple Thursday night and will likely be moved to the Metropolitan Detention Center in Brooklyn, Donovan said.\nThe cartel kingpin is expected to arraigned on Friday in Brooklyn Federal Court on drug-trafficking charges, sources said.\nQuintero was convicted in Mexico for being the mastermind of the 1985 killing of US DEA agent Enrique “Kiki” Camarena and for the last two years has been sitting in a Guadalajara prison, sources said.\nHe was sent to New York while some of the other cartel members were flown to other US cities.\n“The defendants taken into US custody today include leaders and managers of drug cartels recently designated as Foreign Terrorist Organizations and Specially Designated Global Terrorists,” the Justice Department said in a statement.\nThe DOJ noted that many of the many of the defendants had longstanding extradition requests that “were not honored” during the Biden administration and that the Mexican government complied as a direct result of Trump ordering drug cartels to be designated Foreign Terrorist Organizations.\n“They are no longer just criminals,” Donovan said. “They are terrorists.”\n“I do think that drug trafficking as we know it will change,” he said.\n“This action is part of the work of coordination, cooperation and bilateral reciprocity within the framework of respect for the sovereignty of both nations,” the Mexican government said.\nDonovan noted the transfer of custody of a Mexican drug lord is easier if they’re labeled a terrorist since they don’t have the legal protections of someone being extradited.\nThe Justice Department said it will evaluate whether terrorism charges are appropriate for the 29 individuals.\nQuintero is following the same path as “El Chapo,” who was moved to the US and held in 2017 at the maximum-security wing of the Metropolitan Correctional Center in Manhattan. He was sentenced in US District Court to life in prison.\nDonovan said he sees the parallels between “El Chapo” and Quintero’s path to US custody.\nThe arrest of RCQ could bring some closure to the slain DEA agent’s wife who is still alive and son who is a San Diego-based judge, sources said.\nThere are pending charges in New York, Texas and California against Quintero but none are for murder, sources said.\n“When he goes to trial the Kiki homicide will come out and the fact he ordered the killing will be revealed,” Donovan said.\n“As President Trump has made clear, cartels are terrorist groups, and this Department of Justice is devoted to destroying cartels and transnational gangs,” Attorney General Pam Bondi said in a statement.\n“We will prosecute these criminals to the fullest extent of the law in honor of the brave law enforcement agents who have dedicated their careers — and in some cases, given their lives — to protect innocent people from the scourge of violent cartels. We will not rest until we secure justice for the American people.”\nThe transfer of custody of the cartel members was announced by both the US and Mexican government on the same day Trump announced that he plans to impose a 25% tariff on Mexican goods on March 4.\n“Drugs are still pouring into our Country from Mexico and Canada at very high and unacceptable levels,” Trump wrote on Truth Social Thursday.\n“We cannot allow this scourge to continue to harm the USA, and therefore, until it stops, or is seriously limited, the proposed TARIFFS scheduled to go into effect on MARCH FOURTH will, indeed, go into effect, as scheduled,” the president added."
    },
    {
      "url": "https://nypost.com/2025/08/08/us-news/trump-secretly-authorized-military-force-against-latin-american-drug-cartels-classified-as-foreign-terrorist-organizations/",
      "text": "Trump secretly authorized military force against Latin American drug cartels classified as foreign terrorist organizations\nWASHINGTON — President Trump has secretly authorized the military to use force against Latin American drug cartels classified as foreign terrorist organizations, The Post has learned.\nThe move is the most aggressive action Trump has yet taken against gangs trafficking drugs like fentanyl across the US-Mexico border, the activities of which were previously the purview of federal law enforcement.\nThe order, first reported Friday by the New York Times, gives US forces official permission to engage cartels on land and sea.\n“The president is determined to not just dismantle – but completely destroy – [Venezuelan dictator Nicolas] Maduro’s Cartel de Los Soles and obliterate their operations in the Western Hemisphere,” a source close to the White House said.\nThe State Department’s list of foreign terrorist organizations involved in drug trafficking include Venezuela’s Tren de Aragua and Cartel de Los Soles, as well as El Salvador-rooted Mara Salvatrucha, known as MS-13.\nTrump, 79, publicly mulled authorizing the military to target drug cartels inside Mexico on the 2024 campaign trail.\nSince taking office, the president has upped tariffs on Canada and Mexico, citing their inability to shut down drug and people smuggling into the US — and directing immigration agents to go after new arrivals with gang ties.\nTrump has also hosted families impacted by gang violence at the White House and has vowed to strip cartels of their assets to give to families impacted by “migrant crime.”\nMaduro, Venezuela’s president since 2013, has been a particular focus of the administration.\nThe Justice and State departments announced Thursday they would award $50 million to anyone providing details leading to his arrest for violating US drug laws.\nThe anti-cartel effort is being coordinated among several departments, including the Department of Defense, Justice Department, Department of Homeland Security, Office of the Director of National Intelligence and the Treasury, the source added.\n“President Trump’s top priority is protecting the homeland,” deputy White House press secretary Anna Kelly said in a statement, “which is why he took the bold step to designate several cartels and gangs as foreign terrorist organizations.”"
    },
    {
      "url": "https://nypost.com/2025/02/28/us-news/mexican-drug-kingpin-narco-of-narcos-faces-judge-in-cuffs-of-dea-agent-he-killed-in-1985/",
      "text": "Mexican drug kingpin ‘Narco of Narcos’ faces judge wearing cuffs of DEA agent he tortured, killed in 1985\nA Mexican drug kingpin who was depicted in Netflix’s gritty crime drama “Narcos” was hauled into Brooklyn court Friday — wearing the handcuffs that belonged to the DEA agent he was convicted of kidnapping, torturing and murdering in 1985.\nRafael Caro Quintero, a founding member of the Guadalajara cartel, pleaded not guilty to drug trafficking charges in federal court in front of a packed room of more than 100 Drug Enforcement Administration agents and other members of law enforcement.\nThe white-haired Quintero, 72, who wore tan pants and a blue and orange shirt, was brought into the courtroom with his hands cuffed behind his back and answered questions in Spanish.\nA source confirmed to The Post that the cuffs he wore belonged to DEA agent Enrique “Kiki” Camarena, whose kidnapping, torture and murder Caro Quintero was convicted for.\n“For 14,631 days, we held on to hope — hope that this moment would come. Hope that we would live to see accountability. And now, that hope has finally turned into reality. While no amount of time can erase the pain or bring back what we lost, today marks a step toward justice,” Camarena’s family said in a statement.\n“We want to thank President Trump for using the weight of this country to accomplish what we thought would never occur. Thank you to everyone who has worked on this case for 40 years. We don’t know all of you but please know that you have our family’s deepest thanks and appreciation.\nCaro Quintero’s men abducted Camarena and tortured and interrogated him for approximately two days, after which Caro Quintero and his men killed Camarena, officials said.\nCamarena’s son, Enrique Camarena, who is a judge in the San Diego area, posed in a photo with DEA Agent Steve Paris, who was proudly holding the iconic cuffs before they were used to arrest Caro Quintero.\nCaro Quintero spent 28 years in prison in Mexico for orchestrating Camarena’s death, a scene that was dramatized in the first season of the series “Narcos: Mexico.”\nHe continued operating his drug trafficking organization from behind bars with the help of family members and associates on the outside, according to prosecutors.\nCaro Quintero was known as the “Narco of Narcos,” and founded one of the largest drug organizations in the world, US Attorney John J. Durham said at a press conference Friday.\nCaro Quintero and his partners pioneered drug-trafficking routes through Colombia, Mexico, and into the US to “build one of the largest drug organizations in the world.”\n“Having built this lucrative business, Caro Quintero used extreme violence to protect the cartel’s operations, beating and killing anyone who got in his way,” Durham said.\nThe violent organization trafficked heroin, methamphetamine, cocaine and marijuana, and partnered with the Sinaloa cartel to shuttle four tons of drugs that were season in New York, Durham said.\nCaro Quintero, previously among the FBI’s most wanted fugitives, was among 29 cartel members released into US custody by the Mexican government Thursday.\nDurham called the arrival of Caro Quintero at JFK airport Thursday a “historic moment.”\n“It demonstrated the tenacity of countless members of the criminal justice system who work hard and risk their lives to protect our communities from drug traffickers regardless of where they are from,” he said.\n“But most importantly, it demonstrated you can never kill a DEA agent, and you will never get away with it,” Durham added.\nCaro Quintero faces a mandatory life sentence or possibly the death penalty if convicted.\nHe was charged with leading a criminal enterprise, international narcotics distribution and unlawful use of firearms in drug trafficking.\nQuintero being transferred to US custody was personal for DEA agents, even bigger than the capture of Joaquin “El Chapo” Guzman.\nGuzmán was arraigned in January 2017, also in Brooklyn federal court, after being extradited to the US from Mexico.\n“This was personal,” Ray Donovan, the former head of New York’s DEA office, previously told The Post.\nThough Caro Quintero’s charges don’t include murder, Donovan said he believes the kingpin’s role in Camarena’s murder will be revealed during the trial.\n“They are no longer just criminals,” Donovan also said. “They are terrorists.”\nPresident Trump ordered the cartel members be designated as terrorists, which sped up their transfer.\nPrevious requests to the Mexican government by the Biden administration were not honored, according to the US Department of Justice.\n“The Trump Administration is declaring these thugs as terrorists, because that is what they are, and demanding justice for the American people,” White House press secretary Karoline Leavitt said in a statement.\nShe slammed the previous administration for allowing the criminals to “run free and commit crimes all over the world” and credited Attorney General Pam Bondi and Secretary of State Marco Rubio for doing a “tremendous job” in getting the transfer done.\n“President Trump and I are committed to holding every member of the cartels accountable for their crimes and to bring justice to the family of each and every victim,” Bondi said in a statement.\n“It was truly an honor to speak with Judge Camarena to express my sincere condolences for the loss of his father and assure him that we will be relentless in our pursuit of justice in this case.”\nVicente Castillo Fuentes of the Juarez Cartel also pleaded not guilty Friday.\n“This is a significant case and a dangerous criminal,” US Attorney Erik Paulsen said at the hearing.\nPaulsen argues that Fuentes was “directly responsible” for actions taken by the drug cartel that he “led for nearly 20 years.”\n“He is dangerous of extraordinary violence left in his wake,” he added.\nFuentes and Caro Quintero are both due back in court at the end of March, according to the US Attorney’s Office."
    }
  ],
  "argos_summary": "Mexico has extradited 26 cartel members to the U.S. as part of a deal with the Trump administration, including leaders of major drug cartels facing serious charges such as murder and human trafficking. Notable among them is Abigael González Valencia, linked to the Jalisco New Generation Cartel (CJNG), whose leader is a top target for U.S. authorities. This transfer is part of ongoing efforts to combat drug trafficking and violence along the U.S.-Mexico border, with the U.S. government emphasizing the need for severe consequences for these criminals.",
  "argos_id": "8PRNMULLT"
}