{
  "url": "https://finance.yahoo.com/news/thermo-fisher-icu-medical-conmed-182040308.html",
  "authorsByline": "Radek Strnad",
  "articleId": "f0b8841455984635aae3bdd12ca1227b",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/CgtRwsXlG61VySf8WuEl9w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/stockstory_922/a737e16c66c2727c7cdfa5d8d212cbf8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:20:40+00:00",
  "addDate": "2025-08-12T18:35:32.798637+00:00",
  "refreshDate": "2025-08-12T18:35:32.798638+00:00",
  "score": 1.0,
  "title": "Thermo Fisher, ICU Medical, CONMED, Pediatrix Medical Group, and IQVIA Stocks Trade Up, What You Need To Know",
  "description": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower inte",
  "content": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower interest rates. Lower rates typically reduce borrowing costs for businesses and make stocks more attractive relative to bonds, contributing to widespread gains across sectors like healthcare.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\n\nAmong others, the following stocks were impacted:\n• Research Tools & Consumables company Thermo Fisher (NYSE:TMO) jumped 3%. Is now the time to buy Thermo Fisher? Access our full analysis report here, it’s free.\n• Medical Devices & Supplies - Cardiology, Neurology, Vascular company ICU Medical (NASDAQ:ICUI) jumped 3.4%. Is now the time to buy ICU Medical? Access our full analysis report here, it’s free.\n• Surgical Equipment & Consumables - Diversified company CONMED (NYSE:CNMD) jumped 3.1%. Is now the time to buy CONMED? Access our full analysis report here, it’s free.\n• Specialized Medical & Nursing Services company Pediatrix Medical Group (NYSE:MD) jumped 4.1%. Is now the time to buy Pediatrix Medical Group? Access our full analysis report here, it’s free.\n• Drug Development Inputs & Services company IQVIA (NYSE:IQV) jumped 3%. Is now the time to buy IQVIA? Access our full analysis report here, it’s free.\n\nPediatrix Medical Group’s shares are somewhat volatile and have had 14 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe biggest move we wrote about over the last year was 4 months ago when the stock dropped 6.7% on the news that President Trump announced \"reciprocal tariffs\" on all US imports, set at a minimum rate of 10%. Markets reacted negatively to the announcement, reflecting deep concerns among investors about the broader economic implications. The tariffs were likely seen as a significant threat to global trade flows, with the potential to slow economic growth, drive up consumer prices, and spark retaliatory measures. Wedbush analyst Dan Ives captured the prevailing market anxiety, stating, \"We would characterize this slate of tariffs as 'worse than the worst case scenario' the Street was fearing.\" His comment highlighted how the scope and severity of the tariffs far exceeded Wall Street's expectations, adding a new layer of uncertainty for businesses and investors.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nasdaq/icui?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
    "https://stockstory.org/us/stocks/nyse/md?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
    "https://stockstory.org/us/stocks/nyse/tmo?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
    "https://stockstory.org/us/stocks/nyse/iqv?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_4&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
    "https://stockstory.org/us/stocks/nyse/cnmd?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Pediatrix Medical Group",
      "weight": 0.081099465
    },
    {
      "name": "IQVIA Stocks",
      "weight": 0.078306824
    },
    {
      "name": "ICU Medical",
      "weight": 0.0736749
    },
    {
      "name": "stocks",
      "weight": 0.07024984
    },
    {
      "name": "Specialized Medical & Nursing Services company Pediatrix Medical Group",
      "weight": 0.06706911
    },
    {
      "name": "positive inflation data",
      "weight": 0.06643511
    },
    {
      "name": "interest rates",
      "weight": 0.065890394
    },
    {
      "name": "Markets",
      "weight": 0.06510667
    },
    {
      "name": "tariffs",
      "weight": 0.060929365
    },
    {
      "name": "big price drops",
      "weight": 0.060154304
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.990234375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.9658203125
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.5810546875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.481201171875
    }
  ],
  "sentiment": {
    "positive": 0.48303005,
    "negative": 0.1458486,
    "neutral": 0.37112132
  },
  "summary": "A number of stocks saw a surge in the afternoon session following positive inflation data, fuelling hopes for an interest rate cut by the Federal Reserve. The Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This led to a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing. The prevailing view is that easing inflation gives the central bank room to lower interest rates. Lower rates typically reduce borrowing costs for businesses and make stocks more attractive relative to bonds. However, recent developments have not significantly impacted these stocks.",
  "shortSummary": "A positive inflation data boosted stocks like Thermo Fisher, ICU Medical, ConMED, and IQVIA, amid high investor optimism, despite potential price drops and global trade tariffs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "4af2c7211f444266acd4c2927a6b225d",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nyse/md?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
      "text": "Pediatrix Medical Group (MD)\nPediatrix Medical Group is in for a bumpy ride. Its weak sales growth and low returns on capital show it struggled to generate demand and profits.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Pediatrix Medical Group Will Underperform\nWith a network of approximately 2,620 affiliated physicians caring for some of the most vulnerable patients, Pediatrix Medical Group (NYSE:MD) provides specialized physician services focused on neonatal, maternal-fetal, pediatric cardiology and other pediatric subspecialty care across 37 states.\n- Annual sales declines of 1.4% for the past two years show its products and services struggled to connect with the market during this cycle\n- Sales are expected to decline once again over the next 12 months as it continues working through a challenging demand environment\n- Below-average returns on capital indicate management struggled to find compelling investment opportunities, and its decreasing returns suggest its historical profit centers are aging\nWhy There Are Better Opportunities Than Pediatrix Medical Group\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Pediatrix Medical Group\nPediatrix Medical Group’s stock price of $14.12 implies a valuation ratio of 8.5x forward P/E. Pediatrix Medical Group’s valuation may seem like a great deal, but we think there are valid reasons why it’s so cheap.\nCheap stocks can look like great bargains at first glance, but you often get what you pay for. These mediocre businesses often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. Pediatrix Medical Group (MD) Research Report: Q2 CY2025 Update\nPediatric healthcare provider Pediatrix Medical Group (NYSE:MD) reported Q2 CY2025 results exceeding the market’s revenue expectations, but sales fell by 7% year on year to $468.8 million. Its non-GAAP profit of $0.53 per share was 24.9% above analysts’ consensus estimates.\nPediatrix Medical Group (MD) Q2 CY2025 Highlights:\n- Revenue: $468.8 million vs analyst estimates of $464.4 million (7% year-on-year decline, 1% beat)\n- Adjusted EPS: $0.53 vs analyst estimates of $0.42 (24.9% beat)\n- Adjusted EBITDA: $73.25 million vs analyst estimates of $59.67 million (15.6% margin, 22.7% beat)\n- EBITDA guidance for the full year is $250 million at the midpoint, above analyst estimates of $232.8 million\n- Operating Margin: 12.8%, up from -31.3% in the same quarter last year\n- Same-Store Sales rose 6.4% year on year (2.8% in the same quarter last year)\n- Market Capitalization: $1.04 billion\nCompany Overview\nWith a network of approximately 2,620 affiliated physicians caring for some of the most vulnerable patients, Pediatrix Medical Group (NYSE:MD) provides specialized physician services focused on neonatal, maternal-fetal, pediatric cardiology and other pediatric subspecialty care across 37 states.\nPediatrix operates through a network of affiliated physicians who primarily work in hospital settings, with neonatal intensive care units (NICUs) forming the core of their practice. The company's neonatologists provide round-the-clock care for premature and medically complex newborns, while maternal-fetal medicine specialists manage high-risk pregnancies. This coordinated approach creates a continuum of care from pregnancy through delivery and newborn treatment.\nThe company's business model centers on staffing and managing clinical activities within specific hospital-based units. When a hospital partners with Pediatrix, the company typically assumes responsibility for physician staffing, scheduling, and clinical management of specialized units like NICUs. For example, a hospital might contract with Pediatrix to ensure 24/7 neonatologist coverage in its NICU, providing immediate specialized care for any premature infant born at that facility.\nBeyond neonatal and maternal care, Pediatrix has expanded into multiple pediatric subspecialties including cardiology, intensive care, hospital medicine, surgery, urology, ENT, and ophthalmology. The company also operates pediatric urgent care clinics and provides newborn hearing screening services, having screened over 795,000 babies in 2023 alone.\nPediatrix generates revenue primarily through billing patients and insurance companies for physician services. The company also receives administrative fees from hospital partners for services like medical directorships, which accounted for approximately 14% of net revenue in 2023. Hospital contracts typically run for one to three years with automatic renewal provisions.\nThe company maintains extensive clinical data systems, including its proprietary BabySteps Cloud platform, which enables documentation of patient care and supports clinical research initiatives. This research focus has allowed Pediatrix to develop evidence-based protocols that aim to improve patient outcomes while reducing healthcare costs.\n4. Specialized Medical & Nursing Services\nThe skilled nursing services industry provides specialized care for patients requiring medical or rehabilitative support after hospital stays or for chronic conditions. These companies benefit from stable demand driven by an aging population and recurring revenue from Medicare, Medicaid, and private insurance. However, the industry faces challenges such as thin margins due to high labor costs and stringent regulatory requirements. Looking ahead, the industry is supported by tailwinds from an aging population, which means higher chronic disease prevalence. Advances in medical technology, including using AI to better predict, diagnose, and treat illnesses, may reduce hospital readmissions and improve outcomes. However, headwinds such as labor shortages, wage inflation, and potential government reimbursement cuts pose challenges. Adapting to value-based care models may further squeeze margins by requiring investments in training, technology, and compliance.\nPediatrix Medical Group competes with other physician services organizations like TeamHealth, Envision Healthcare, and Sound Physicians, as well as hospital-employed physician groups and academic medical centers that directly employ specialists in neonatal, maternal-fetal, and pediatric subspecialty care.\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $1.94 billion in revenue over the past 12 months, Pediatrix Medical Group is a small company in an industry where scale matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nReviewing a company’s long-term sales performance reveals insights into its quality. Any business can experience short-term success, but top-performing ones enjoy sustained growth for years. Regrettably, Pediatrix Medical Group’s sales grew at a tepid 1.9% compounded annual growth rate over the last five years. This was below our standards and is a rough starting point for our analysis.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Pediatrix Medical Group’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 1.4% annually.\nWe can better understand the company’s revenue dynamics by analyzing its same-store sales, which show how much revenue its established locations generate. Over the last two years, Pediatrix Medical Group’s same-store sales averaged 4.3% year-on-year growth. Because this number is better than its revenue growth, we can see its sales from existing locations are performing better than its sales from new locations.\nThis quarter, Pediatrix Medical Group’s revenue fell by 7% year on year to $468.8 million but beat Wall Street’s estimates by 1%.\nLooking ahead, sell-side analysts expect revenue to decline by 1.9% over the next 12 months, similar to its two-year rate. This projection is underwhelming and suggests its newer products and services will not accelerate its top-line performance yet.\n7. Operating Margin\nOperating margin is an important measure of profitability as it shows the portion of revenue left after accounting for all core expenses – everything from the cost of goods sold to advertising and wages. It’s also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\nPediatrix Medical Group was profitable over the last five years but held back by its large cost base. Its average operating margin of 4.7% was weak for a healthcare business.\nOn the plus side, Pediatrix Medical Group’s operating margin rose by 1.3 percentage points over the last five years, as its sales growth gave it operating leverage.\nThis quarter, Pediatrix Medical Group generated an operating margin profit margin of 12.8%, up 44 percentage points year on year. This increase was a welcome development, especially since its revenue fell, showing it was more efficient because it scaled down its expenses.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nPediatrix Medical Group’s EPS grew at a remarkable 9.7% compounded annual growth rate over the last five years, higher than its 1.9% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nDiving into Pediatrix Medical Group’s quality of earnings can give us a better understanding of its performance. As we mentioned earlier, Pediatrix Medical Group’s operating margin expanded by 1.3 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its higher earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nIn Q2, Pediatrix Medical Group reported adjusted EPS at $0.53, up from $0.34 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Pediatrix Medical Group’s full-year EPS of $1.81 to shrink by 8.5%.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nPediatrix Medical Group has shown decent cash profitability, giving it some flexibility to reinvest or return capital to investors. The company’s free cash flow margin averaged 5.4% over the last five years, slightly better than the broader healthcare sector.\nTaking a step back, we can see that Pediatrix Medical Group’s margin expanded by 2.3 percentage points during that time. This is encouraging because it gives the company more optionality.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nPediatrix Medical Group historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 3.6%, lower than the typical cost of capital (how much it costs to raise money) for healthcare companies.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Pediatrix Medical Group’s ROIC has unfortunately decreased significantly. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Assessment\nPediatrix Medical Group reported $348.3 million of cash and $649.6 million of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $251.4 million of EBITDA over the last 12 months, we view Pediatrix Medical Group’s 1.2× net-debt-to-EBITDA ratio as safe. We also see its $29.46 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Pediatrix Medical Group’s Q2 Results\nWe were impressed by how significantly Pediatrix Medical Group blew past analysts’ same-store sales expectations this quarter. We were also glad its EPS outperformed Wall Street’s estimates. Zooming out, we think this was a good print with some key areas of upside. The stock traded up 1.1% to $12.44 immediately after reporting.\n13. Is Now The Time To Buy Pediatrix Medical Group?\nUpdated: August 11, 2025 at 11:56 PM EDT\nWe think that the latest earnings result is only one piece of the bigger puzzle. If you’re deciding whether to own Pediatrix Medical Group, you should also grasp the company’s longer-term business quality and valuation.\nPediatrix Medical Group doesn’t pass our quality test. To begin with, its revenue growth was uninspiring over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its rising cash profitability gives it more optionality, the downside is its diminishing returns show management's prior bets haven't worked out. On top of that, its mediocre ROIC lags the market and is a headwind for its stock price.\nPediatrix Medical Group’s P/E ratio based on the next 12 months is 8.5x. While this valuation is optically cheap, the potential downside is huge given its shaky fundamentals. There are better stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $16.64 on the company (compared to the current share price of $14.12).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/icui?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
      "text": "ICU Medical (ICUI)\nICU Medical keeps us up at night. Its weak sales growth and low returns on capital show it struggled to generate demand and profits.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think ICU Medical Will Underperform\nFounded in 1984 and named for its initial focus on intensive care units, ICU Medical (NASDAQ:ICUI) develops and manufactures medical products for infusion therapy, vascular access, and vital care applications used in hospitals and other healthcare settings.\n- Incremental sales over the last five years were much less profitable as its earnings per share fell by 19.1% annually while its revenue grew\n- Estimated sales decline of 10.9% for the next 12 months implies a challenging demand environment\n- Below-average returns on capital indicate management struggled to find compelling investment opportunities, and its decreasing returns suggest its historical profit centers are aging\nWhy There Are Better Opportunities Than ICU Medical\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than ICU Medical\nICU Medical’s stock price of $110 implies a valuation ratio of 14.6x forward P/E. Yes, this valuation multiple is lower than that of other healthcare peers, but we’ll remind you that you often get what you pay for.\nCheap stocks can look like great bargains at first glance, but you often get what you pay for. These mediocre businesses often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. ICU Medical (ICUI) Research Report: Q2 CY2025 Update\nMedical device company ICU Medical (NASDAQ:ICUI) reported revenue ahead of Wall Street’s expectations in Q2 CY2025, but sales fell by 8% year on year to $548.9 million. Its GAAP profit of $1.43 per share was significantly above analysts’ consensus estimates.\nICU Medical (ICUI) Q2 CY2025 Highlights:\n- Revenue: $548.9 million vs analyst estimates of $539.7 million (8% year-on-year decline, 1.7% beat)\n- EPS (GAAP): $1.43 vs analyst estimates of -$0.47 (significant beat)\n- Adjusted EBITDA: $100.3 million vs analyst estimates of $90.8 million (18.3% margin, 10.5% beat)\n- EPS (GAAP) guidance for the full year is $7 at the midpoint, beating analyst estimates by 443%\n- EBITDA guidance for the full year is $392.5 million at the midpoint, above analyst estimates of $387.5 million\n- Operating Margin: 1.9%, down from 4.1% in the same quarter last year\n- Free Cash Flow was -$8.49 million, down from $62.67 million in the same quarter last year\n- Market Capitalization: $3.2 billion\nCompany Overview\nFounded in 1984 and named for its initial focus on intensive care units, ICU Medical (NASDAQ:ICUI) develops and manufactures medical products for infusion therapy, vascular access, and vital care applications used in hospitals and other healthcare settings.\nICU Medical's business is organized into three main segments: Consumables, Infusion Systems, and Vital Care. The Consumables division includes products like needlefree connectors, infusion sets, and closed system transfer devices that help healthcare providers safely deliver medications and fluids to patients. These products are designed to reduce the risk of needlestick injuries and prevent exposure to hazardous drugs during preparation and administration.\nThe Infusion Systems segment features various infusion pumps that precisely control the delivery of medications and fluids. For example, a hospital might use ICU Medical's Plum 360 infusion pump to deliver antibiotics to a patient at an exact rate over a specific time period. This division also includes specialized software that connects with electronic health records to help prevent medication errors.\nIn the Vital Care segment, ICU Medical offers IV solutions, hemodynamic monitoring systems, and temperature management products. A surgical team might use the company's Level 1 fluid warming system to maintain a patient's body temperature during a lengthy procedure, while critical care nurses might rely on its hemodynamic monitoring systems to track a patient's cardiac output and oxygen delivery.\nICU Medical generates revenue by selling its products to acute care hospitals, ambulatory clinics, and alternate site facilities like home healthcare providers. The company maintains distribution centers across the United States and serves customers in over 100 countries, either through its direct sales force or independent distributors. Beyond simply selling devices, ICU Medical provides implementation and data analytics services to help healthcare facilities optimize their infusion systems.\n4. Medical Devices & Supplies - Cardiology, Neurology, Vascular\nThe medical devices and supplies industry, particularly in the fields of cardiology, neurology, and vascular care, benefits from a business model that balances innovation with relatively predictable revenue streams. These companies focus on developing life-saving devices such as stents, pacemakers, neurostimulation implants, and vascular access tools, which address critical and often chronic conditions. The recurring need for these devices, coupled with growing global demand for advanced treatments, provides stability and opportunities for long-term growth. However, the industry faces hurdles such as high research and development costs, rigorous regulatory approval processes, and reliance on reimbursement from healthcare systems, which can exert downward pressure on pricing. Looking ahead, the industry is positioned to benefit from tailwinds such as aging populations (which tend to have higher rates of disease) and technological advancements like minimally invasive procedures and connected devices that improve patient monitoring and outcomes. Innovations in robotic-assisted surgery and AI-driven diagnostics are also expected to accelerate adoption and expand treatment capabilities. However, potential headwinds include pricing pressures stemming from value-based care models and continued complexity changing from navigating regulatory frameworks that may prioritize further lowering healthcare costs.\nICU Medical's primary competitors include Becton Dickinson (NYSE:BDX), Baxter International (NYSE:BAX), and B. Braun Medical in the consumables and infusion systems markets. In the vital care segment, the company competes with Edwards Lifesciences (NYSE:EW) and Fresenius (ETR:FRE).\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $2.36 billion in revenue over the past 12 months, ICU Medical lacks scale in an industry where it matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance can indicate its overall quality. Any business can put up a good quarter or two, but many enduring ones grow for years. Luckily, ICU Medical’s sales grew at a solid 14.2% compounded annual growth rate over the last five years. Its growth beat the average healthcare company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. ICU Medical’s recent performance shows its demand has slowed as its annualized revenue growth of 1.4% over the last two years was below its five-year trend.\nThis quarter, ICU Medical’s revenue fell by 8% year on year to $548.9 million but beat Wall Street’s estimates by 1.7%.\nLooking ahead, sell-side analysts expect revenue to decline by 10.4% over the next 12 months, a deceleration versus the last two years. This projection is underwhelming and indicates its products and services will see some demand headwinds.\n7. Operating Margin\nICU Medical was profitable over the last five years but held back by its large cost base. Its average operating margin of 3% was weak for a healthcare business.\nAnalyzing the trend in its profitability, ICU Medical’s operating margin decreased by 4.6 percentage points over the last five years, but it rose by 4.1 percentage points on a two-year basis. Still, shareholders will want to see ICU Medical become more profitable in the future.\nIn Q2, ICU Medical generated an operating margin profit margin of 1.9%, down 2.2 percentage points year on year. This contraction shows it was less efficient because its expenses increased relative to its revenue.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nSadly for ICU Medical, its EPS declined by 19.1% annually over the last five years while its revenue grew by 14.2%. This tells us the company became less profitable on a per-share basis as it expanded.\nDiving into the nuances of ICU Medical’s earnings can give us a better understanding of its performance. As we mentioned earlier, ICU Medical’s operating margin declined by 4.6 percentage points over the last five years. Its share count also grew by 14.9%, meaning the company not only became less efficient with its operating expenses but also diluted its shareholders.\nIn Q2, ICU Medical reported EPS at $1.43, up from negative $0.88 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects ICU Medical to improve its earnings losses. Analysts forecast its full-year EPS of negative $1.52 will advance to negative $1.02.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nICU Medical has shown mediocre cash profitability over the last five years, giving the company limited opportunities to return capital to shareholders. Its free cash flow margin averaged 3.9%, subpar for a healthcare business.\nTaking a step back, we can see that ICU Medical’s margin dropped by 11.9 percentage points during that time. This along with its unexciting margin put the company in a tough spot, and shareholders are likely hoping it can reverse course. If the trend continues, it could signal it’s becoming a more capital-intensive business.\nICU Medical burned through $8.49 million of cash in Q2, equivalent to a negative 1.5% margin. The company’s cash flow turned negative after being positive in the same quarter last year, suggesting its historical struggles have dragged on.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nICU Medical historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 1.9%, lower than the typical cost of capital (how much it costs to raise money) for healthcare companies.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, ICU Medical’s ROIC averaged 2 percentage point decreases each year. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Assessment\nICU Medical reported $300 million of cash and $1.34 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $400.1 million of EBITDA over the last 12 months, we view ICU Medical’s 2.6× net-debt-to-EBITDA ratio as safe. We also see its $90.72 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from ICU Medical’s Q2 Results\nWe were impressed by how significantly ICU Medical blew past analysts’ EPS expectations this quarter. We were also excited its full-year EPS guidance outperformed Wall Street’s estimates by a wide margin. Zooming out, we think this quarter featured some important positives. Investors were likely hoping for more, and shares traded down 1.7% to $128 immediately after reporting.\n13. Is Now The Time To Buy ICU Medical?\nUpdated: August 12, 2025 at 12:04 AM EDT\nWe think that the latest earnings result is only one piece of the bigger puzzle. If you’re deciding whether to own ICU Medical, you should also grasp the company’s longer-term business quality and valuation.\nICU Medical falls short of our quality standards. Although its revenue growth was solid over the last five years, it’s expected to deteriorate over the next 12 months and its declining EPS over the last five years makes it a less attractive asset to the public markets. And while the company’s operating margins are in line with the overall healthcare sector, the downside is its cash profitability fell over the last five years.\nICU Medical’s P/E ratio based on the next 12 months is 14.6x. This multiple tells us a lot of good news is priced in - we think other companies feature superior fundamentals at the moment.\nWall Street analysts have a consensus one-year price target of $182.80 on the company (compared to the current share price of $110).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/tmo?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
      "text": "Thermo Fisher (TMO)\nWe aren’t fans of Thermo Fisher. Its weak sales growth and declining returns on capital show its demand and profits are shrinking.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Thermo Fisher Is Not Exciting\nWith over 14,000 sales personnel and a portfolio spanning more than 2,500 technology manufacturers, Thermo Fisher Scientific (NYSE:TMO) provides scientific equipment, reagents, consumables, software, and laboratory services to pharmaceutical, biotech, academic, and healthcare customers worldwide.\n- Organic sales performance over the past two years indicates the company may need to make strategic adjustments or rely on M&A to catalyze faster growth\n- Anticipated sales growth of 3.6% for the next year implies demand will be shaky\n- A silver lining is that its scale advantages are evident in its $43.21 billion revenue base, which provides operating leverage when demand is strong\nWhy There Are Better Opportunities Than Thermo Fisher\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Thermo Fisher\nThermo Fisher’s stock price of $462.39 implies a valuation ratio of 19.8x forward P/E. While valuation is appropriate for the quality you get, we’re still not buyers.\nThere are stocks out there similarly priced with better business quality. We prefer owning these.\n3. Thermo Fisher (TMO) Research Report: Q2 CY2025 Update\nLife sciences company Thermo Fisher (NYSE:TMO) reported revenue ahead of Wall Street’s expectations in Q2 CY2025, with sales up 3% year on year to $10.86 billion. Its non-GAAP profit of $5.36 per share was 2.3% above analysts’ consensus estimates.\nThermo Fisher (TMO) Q2 CY2025 Highlights:\n- Revenue: $10.86 billion vs analyst estimates of $10.69 billion (3% year-on-year growth, 1.6% beat)\n- Adjusted EPS: $5.36 vs analyst estimates of $5.24 (2.3% beat)\n- Operating Margin: 16.9%, in line with the same quarter last year\n- Free Cash Flow Margin: 10.2%, down from 15.7% in the same quarter last year\n- Organic Revenue rose 2% year on year (-1% in the same quarter last year)\n- Market Capitalization: $161.4 billion\nCompany Overview\nWith over 14,000 sales personnel and a portfolio spanning more than 2,500 technology manufacturers, Thermo Fisher Scientific (NYSE:TMO) provides scientific equipment, reagents, consumables, software, and laboratory services to pharmaceutical, biotech, academic, and healthcare customers worldwide.\nThermo Fisher operates through four main segments that collectively serve as a comprehensive supplier to the scientific community. The Life Sciences Solutions segment offers reagents, instruments, and consumables for biological research, drug discovery, and vaccine development. This includes tools for molecular and protein biology, genomics, and cell culture products essential for developing biological therapeutics.\nThe Analytical Instruments segment provides sophisticated equipment for sample analysis across pharmaceutical, environmental, and industrial applications. This includes chromatography and mass spectrometry systems that can detect minute quantities of substances, electron microscopes that visualize structures at the atomic level, and chemical analysis tools used in environmental monitoring.\nThe Specialty Diagnostics segment delivers diagnostic test kits, reagents, and instruments to healthcare and clinical laboratories. These products help medical professionals diagnose conditions ranging from infectious diseases to autoimmune disorders, perform drug testing, and support organ transplantation through tissue typing.\nThe Laboratory Products and Biopharma Services segment offers both everyday laboratory supplies and specialized outsourced pharmaceutical services. A researcher might order basic lab equipment like pipettes and centrifuges through Thermo Fisher's Fisher Scientific channel, while a pharmaceutical company might engage their Patheon division to manufacture clinical trial materials or commercial drugs.\nThermo Fisher's business model combines manufacturing proprietary products with distributing third-party items, creating a one-stop shop for scientific needs. The company maintains global manufacturing facilities and distribution centers to serve customers across North America, Europe, and Asia-Pacific regions.\nBeyond product sales, Thermo Fisher provides critical services including laboratory design, equipment maintenance, clinical trials management, and pharmaceutical manufacturing. This integrated approach allows customers to outsource portions of their research, development, or manufacturing processes to Thermo Fisher's specialized teams.\n4. Research Tools & Consumables\nThe life sciences subsector specializing in research tools and consumables enables scientific discoveries across academia, biotechnology, and pharmaceuticals. These firms supply a wide range of essential laboratory products, ensuring a recurring revenue stream through repeat purchases and replenishment. Their business models benefit from strong customer loyalty, a diversified product portfolio, and exposure to both the research and clinical markets. However, challenges include high R&D investment to maintain technological leadership, pricing pressures from budget-conscious institutions, and vulnerability to fluctuations in research funding cycles. Looking ahead, this subsector stands to benefit from tailwinds such as growing demand for tools supporting emerging fields like synthetic biology and personalized medicine. There is also a rise in automation and AI-driven solutions in laboratories that could create new opportunities to sell tools and consumables. Nevertheless, headwinds exist. These companies tend to be at the mercy of supply chain disruptions and sensitivity to macroeconomic conditions that impact funding for research initiatives.\nThermo Fisher Scientific competes with other life sciences and laboratory equipment providers including Danaher Corporation (NYSE:DHR), Agilent Technologies (NYSE:A), PerkinElmer (NYSE:PKI), and Becton, Dickinson and Company (NYSE:BDX), as well as specialized competitors in specific market segments.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $43.21 billion in revenue over the past 12 months, Thermo Fisher boasts impressive economies of scale. It may not be as large as heavyweights such as UnitedHealth Group and The Cigna Group from a topline perspective, but its heft is still an important advantage in a healthcare industry that is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance can indicate its overall quality. Any business can have short-term success, but a top-tier one grows for years. Over the last five years, Thermo Fisher grew its sales at a decent 10.5% compounded annual growth rate. Its growth was slightly above the average healthcare company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. Thermo Fisher’s recent performance shows its demand has slowed as its revenue was flat over the last two years.\nThermo Fisher also reports organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Thermo Fisher’s organic revenue averaged 1% year-on-year declines. Because this number aligns with its normal revenue growth, we can see the company’s core operations (not acquisitions and divestitures) drove most of its results.\nThis quarter, Thermo Fisher reported modest year-on-year revenue growth of 3% but beat Wall Street’s estimates by 1.6%.\nLooking ahead, sell-side analysts expect revenue to grow 3.9% over the next 12 months. While this projection suggests its newer products and services will spur better top-line performance, it is still below average for the sector.\n7. Operating Margin\nThermo Fisher has managed its cost base well over the last five years. It demonstrated solid profitability for a healthcare business, producing an average operating margin of 19.8%.\nAnalyzing the trend in its profitability, Thermo Fisher’s operating margin decreased by 10.9 percentage points over the last five years, but it rose by 1.7 percentage points on a two-year basis. Still, shareholders will want to see Thermo Fisher become more profitable in the future.\nThis quarter, Thermo Fisher generated an operating margin profit margin of 16.9%, in line with the same quarter last year. This indicates the company’s overall cost structure has been relatively stable.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nThermo Fisher’s remarkable 10.4% annual EPS growth over the last five years aligns with its revenue performance. This tells us it maintained its per-share profitability as it expanded.\nIn Q2, Thermo Fisher reported EPS at $5.36, down from $5.37 in the same quarter last year. Despite falling year on year, this print beat analysts’ estimates by 2.3%. Over the next 12 months, Wall Street expects Thermo Fisher’s full-year EPS of $21.89 to grow 6.9%.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nThermo Fisher has shown robust cash profitability, giving it an edge over its competitors and the ability to reinvest or return capital to investors. The company’s free cash flow margin averaged 16.4% over the last five years, quite impressive for a healthcare business.\nTaking a step back, we can see that Thermo Fisher’s margin dropped by 7 percentage points during that time. Continued declines could signal it is in the middle of an investment cycle.\nThermo Fisher’s free cash flow clocked in at $1.11 billion in Q2, equivalent to a 10.2% margin. The company’s cash profitability regressed as it was 5.6 percentage points lower than in the same quarter last year, suggesting its historical struggles have dragged on.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nAlthough Thermo Fisher hasn’t been the highest-quality company lately, it historically found a few growth initiatives that worked. Its five-year average ROIC was 11.5%, higher than most healthcare businesses.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Unfortunately, Thermo Fisher’s ROIC has decreased over the last few years. We like what management has done in the past, but its declining returns are perhaps a symptom of fewer profitable growth opportunities.\n11. Balance Sheet Assessment\nThermo Fisher reported $6.39 billion of cash and $35.23 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $10.67 billion of EBITDA over the last 12 months, we view Thermo Fisher’s 2.7× net-debt-to-EBITDA ratio as safe. We also see its $162 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Thermo Fisher’s Q2 Results\nIt was good to see Thermo Fisher narrowly top analysts’ organic revenue expectations this quarter. We were also happy its revenue and EPS outperformed Wall Street’s estimates. Overall, this print had some key positives. The stock traded up 1.8% to $434.68 immediately following the results.\n13. Is Now The Time To Buy Thermo Fisher?\nUpdated: August 11, 2025 at 11:53 PM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in Thermo Fisher.\nThermo Fisher has some positive attributes, but it isn’t one of our picks. First off, its revenue growth was good over the last five years. And while Thermo Fisher’s declining adjusted operating margin shows the business has become less efficient, its scale makes it a trusted partner with negotiating leverage.\nThermo Fisher’s P/E ratio based on the next 12 months is 19.8x. Investors with a higher risk tolerance might like the company, but we think the potential downside is too great. We're pretty confident there are superior stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $551.81 on the company (compared to the current share price of $462.39)."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/iqv?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_4&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
      "text": "IQVIA (IQV)\nWe aren’t fans of IQVIA. Its growth has been lacking and its free cash flow margin has caved, suggesting it’s struggling to adapt.― StockStory Analyst Team\n1. News\n2. Summary\nWhy IQVIA Is Not Exciting\nCreated from the 2016 merger of Quintiles (a clinical research organization) and IMS Health (a healthcare data specialist), IQVIA (NYSE:IQV) provides clinical research services, data analytics, and technology solutions to help pharmaceutical companies develop and market medications more effectively.\n- Annual sales growth of 7.5% over the last five years lagged behind its healthcare peers as its large revenue base made it difficult to generate incremental demand\n- On the bright side, its earnings per share have outperformed its peers over the last five years, increasing by 13.7% annually\nWhy There Are Better Opportunities Than IQVIA\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than IQVIA\nIQVIA’s stock price of $180.09 implies a valuation ratio of 14.6x forward P/E. This multiple is cheaper than most healthcare peers, but we think this is justified.\nOur advice is to pay up for elite businesses whose advantages are tailwinds to earnings growth. Don’t get sucked into lower-quality businesses just because they seem like bargains. These mediocre businesses often never achieve a higher multiple as hoped, a phenomenon known as a “value trap”.\n3. IQVIA (IQV) Research Report: Q2 CY2025 Update\nClinical research company IQVIA (NYSE: IQV) reported Q2 CY2025 results beating Wall Street’s revenue expectations, with sales up 5.3% year on year to $4.02 billion. The company’s full-year revenue guidance of $16.2 billion at the midpoint came in 0.8% above analysts’ estimates. Its non-GAAP profit of $2.81 per share was 1.4% above analysts’ consensus estimates.\nIQVIA (IQV) Q2 CY2025 Highlights:\n- Revenue: $4.02 billion vs analyst estimates of $3.97 billion (5.3% year-on-year growth, 1.2% beat)\n- Adjusted EPS: $2.81 vs analyst estimates of $2.77 (1.4% beat)\n- Adjusted EBITDA: $910 million vs analyst estimates of $905.4 million (22.7% margin, 0.5% beat)\n- The company reconfirmed its revenue guidance for the full year of $16.2 billion at the midpoint\n- Management slightly raised its full-year Adjusted EPS guidance to $11.90 at the midpoint\n- EBITDA guidance for the full year is $3.79 billion at the midpoint, in line with analyst expectations\n- Operating Margin: 12.6%, down from 13.6% in the same quarter last year\n- Free Cash Flow Margin: 11%, similar to the same quarter last year\n- Constant Currency Revenue rose 3.6% year on year, in line with the same quarter last year\n- Market Capitalization: $27.5 billion\nCompany Overview\nCreated from the 2016 merger of Quintiles (a clinical research organization) and IMS Health (a healthcare data specialist), IQVIA (NYSE:IQV) provides clinical research services, data analytics, and technology solutions to help pharmaceutical companies develop and market medications more effectively.\nIQVIA sits at the intersection of healthcare data, technology, and clinical expertise. The company maintains one of the world's largest healthcare information repositories, containing over 1.2 billion non-identified patient records spanning medical claims, prescriptions, electronic medical records, and other healthcare data. This massive dataset—approximately 64 petabytes—covers about 90% of the world's pharmaceuticals by sales.\nThe company operates through three main segments. The Technology & Analytics Solutions segment provides cloud-based applications, real-world evidence platforms, and analytics services that help pharmaceutical companies optimize their commercial strategies and understand market dynamics. The Research & Development Solutions segment offers clinical trial management services, including patient recruitment, site monitoring, laboratory testing, and regulatory support. The Contract Sales & Medical Solutions segment provides healthcare provider engagement services and patient support programs.\nFor example, a pharmaceutical company developing a new cancer drug might engage IQVIA to design and manage clinical trials, analyze real-world data to identify potential patients, and later help launch the drug with specialized sales representatives and patient support programs.\nIQVIA's business model generates revenue through long-term contracts with pharmaceutical companies, biotechnology firms, medical device manufacturers, and other healthcare organizations. The company employs approximately 88,000 people across more than 100 countries, allowing it to support global clinical trials and provide localized commercial insights.\nThe company places significant emphasis on privacy protection, employing various technologies and safeguards to protect patient data while still enabling valuable healthcare research. IQVIA has also invested heavily in artificial intelligence capabilities, developing healthcare-specific AI tools that help clients analyze complex datasets and improve decision-making throughout the drug development and commercialization process.\n4. Drug Development Inputs & Services\nCompanies specializing in drug development inputs and services play a crucial role in the pharmaceutical and biotechnology value chain. Essential support for drug discovery, preclinical testing, and manufacturing means stable demand, as pharmaceutical companies often outsource non-core functions with medium to long-term contracts. However, the business model faces high capital requirements, customer concentration, and vulnerability to shifts in biopharma R&D budgets or regulatory frameworks. Looking ahead, the industry will likely enjoy tailwinds such as increasing investment in biologics, cell and gene therapies, and advancements in precision medicine, which drive demand for sophisticated tools and services. There is a growing trend of outsourcing in drug development for nimbleness and cost efficiency, which benefits the industry. On the flip side, potential headwinds include pricing pressures as efforts to contain healthcare costs are always top of mind. An evolving regulatory backdrop could also slow innovation or client activity.\nIQVIA's competitors include clinical research organizations like ICON plc, Parexel International, and Pharmaceutical Product Development (part of Thermo Fisher Scientific), as well as healthcare analytics and technology providers such as Optum Insight (UnitedHealth Group), Clarivate, and Veeva Systems.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $15.7 billion in revenue over the past 12 months, IQVIA has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nA company’s long-term performance is an indicator of its overall quality. Any business can experience short-term success, but top-performing ones enjoy sustained growth for years. Over the last five years, IQVIA grew its sales at a mediocre 7.5% compounded annual growth rate. This fell short of our benchmark for the healthcare sector and is a tough starting point for our analysis.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. IQVIA’s recent performance shows its demand has slowed as its annualized revenue growth of 3.4% over the last two years was below its five-year trend.\nWe can better understand the company’s sales dynamics by analyzing its constant currency revenue, which excludes currency movements that are outside their control and not indicative of demand. Over the last two years, its constant currency sales averaged 3.4% year-on-year growth. Because this number aligns with its normal revenue growth, we can see that IQVIA has properly hedged its foreign currency exposure.\nThis quarter, IQVIA reported year-on-year revenue growth of 5.3%, and its $4.02 billion of revenue exceeded Wall Street’s estimates by 1.2%.\nLooking ahead, sell-side analysts expect revenue to grow 4.9% over the next 12 months, similar to its two-year rate. Although this projection implies its newer products and services will catalyze better top-line performance, it is still below average for the sector.\n7. Operating Margin\nIQVIA has done a decent job managing its cost base over the last five years. The company has produced an average operating margin of 12.2%, higher than the broader healthcare sector.\nAnalyzing the trend in its profitability, IQVIA’s operating margin rose by 5.3 percentage points over the last five years, as its sales growth gave it operating leverage. Zooming in on its more recent performance, we can see the company’s trajectory is intact as its margin has also increased by 1.3 percentage points on a two-year basis.\nThis quarter, IQVIA generated an operating margin profit margin of 12.6%, down 1 percentage points year on year. This reduction is quite minuscule and indicates the company’s overall cost structure has been relatively stable.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nIQVIA’s EPS grew at a spectacular 13.7% compounded annual growth rate over the last five years, higher than its 7.5% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nDiving into the nuances of IQVIA’s earnings can give us a better understanding of its performance. As we mentioned earlier, IQVIA’s operating margin declined this quarter but expanded by 5.3 percentage points over the last five years. Its share count also shrank by 9.3%, and these factors together are positive signs for shareholders because improving profitability and share buybacks turbocharge EPS growth relative to revenue growth.\nIn Q2, IQVIA reported EPS at $2.81, up from $2.64 in the same quarter last year. This print beat analysts’ estimates by 1.4%. Over the next 12 months, Wall Street expects IQVIA’s full-year EPS of $11.47 to grow 7.9%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nIQVIA has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 12.9% over the last five years, better than the broader healthcare sector.\nTaking a step back, we can see that IQVIA’s margin dropped by 2.5 percentage points during that time. If its declines continue, it could signal increasing investment needs and capital intensity.\nIQVIA’s free cash flow clocked in at $443 million in Q2, equivalent to a 11% margin. This cash profitability was in line with the comparable period last year but below its five-year average. In a silo, this isn’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nIQVIA’s management team makes decent investment decisions and generates value for shareholders. Its five-year average ROIC was 7.6%, slightly better than typical healthcare business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Fortunately, IQVIA’s ROIC averaged 3.4 percentage point increases over the last few years. This is a good sign, and if its returns keep rising, there’s a chance it could evolve into an investable business.\n11. Balance Sheet Assessment\nIQVIA reported $2.19 billion of cash and $15.7 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $3.73 billion of EBITDA over the last 12 months, we view IQVIA’s 3.6× net-debt-to-EBITDA ratio as safe. We also see its $299 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from IQVIA’s Q2 Results\nIt was good to see IQVIA provide full-year revenue and EPS guidance that slightly beat analysts’ expectations. We were also happy this quarter's revenue and EPS narrowly outperformed Wall Street’s estimates. Overall, this print had some key positives. The stock traded up 8.4% to $172.24 immediately following the results.\n13. Is Now The Time To Buy IQVIA?\nUpdated: August 12, 2025 at 12:07 AM EDT\nBefore deciding whether to buy IQVIA or pass, we urge investors to consider business quality, valuation, and the latest quarterly results.\nIQVIA’s business quality ultimately falls short of our standards. First off, its revenue growth was mediocre over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its spectacular EPS growth over the last five years shows its profits are trickling down to shareholders, the downside is its cash profitability fell over the last five years. On top of that, its constant currency growth has disappointed.\nIQVIA’s P/E ratio based on the next 12 months is 14.6x. Investors with a higher risk tolerance might like the company, but we don’t really see a big opportunity at the moment. We're fairly confident there are better investments elsewhere.\nWall Street analysts have a consensus one-year price target of $213.05 on the company (compared to the current share price of $180.09).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nyse/cnmd?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0Eb0Y%3D&utm_ticker=TMO",
      "text": "CONMED (CNMD)\nWe’re wary of CONMED. Its underwhelming returns on capital show it struggled to generate meaningful profits for shareholders.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think CONMED Will Underperform\nWith over five decades of experience in surgical innovation since its founding in 1970, CONMED (NYSE:CNMD) develops and manufactures medical devices and equipment for surgical procedures, specializing in orthopedic and general surgery products.\n- Modest revenue base of $1.33 billion gives it less fixed cost leverage and fewer distribution channels than larger companies\n- ROIC of 5.5% reflects management’s challenges in identifying attractive investment opportunities\n- A positive is that its incremental sales significantly boosted profitability as its annual earnings per share growth of 18% over the last five years outstripped its revenue performance\nWhy There Are Better Opportunities Than CONMED\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than CONMED\nAt $52.48 per share, CONMED trades at 11.6x forward P/E. CONMED’s valuation may seem like a bargain, especially when stacked up against other healthcare companies. We remind you that you often get what you pay for, though.\nCheap stocks can look like a great deal at first glance, but they can be value traps. They often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. CONMED (CNMD) Research Report: Q2 CY2025 Update\nMedical tech company CONMED (NYSE:CNMD) reported Q2 CY2025 results beating Wall Street’s revenue expectations, with sales up 3.1% year on year to $342.3 million. The company expects the full year’s revenue to be around $1.37 billion, close to analysts’ estimates. Its non-GAAP profit of $1.15 per share was 2.4% above analysts’ consensus estimates.\nCONMED (CNMD) Q2 CY2025 Highlights:\n- Revenue: $342.3 million vs analyst estimates of $338.3 million (3.1% year-on-year growth, 1.2% beat)\n- Adjusted EPS: $1.15 vs analyst estimates of $1.12 (2.4% beat)\n- Adjusted EBITDA: $68.6 million vs analyst estimates of $70.33 million (20% margin, 2.5% miss)\n- The company slightly lifted its revenue guidance for the full year to $1.37 billion at the midpoint from $1.36 billion\n- Management lowered its full-year Adjusted EPS guidance to $4.48 at the midpoint, a 1.1% decrease\n- Operating Margin: 11.1%, down from 14.2% in the same quarter last year\n- Constant Currency Revenue rose 2.9% year on year (5.2% in the same quarter last year)\n- Market Capitalization: $1.56 billion\nCompany Overview\nWith over five decades of experience in surgical innovation since its founding in 1970, CONMED (NYSE:CNMD) develops and manufactures medical devices and equipment for surgical procedures, specializing in orthopedic and general surgery products.\nCONMED's product portfolio spans two main categories: orthopedic surgery and general surgery. In orthopedics, the company offers implants like the BioBrace and Y-Knot All-Suture Anchors for soft tissue repair, powered resection instruments, and systems for foot and ankle surgery such as the Quantum Total Ankle System. The company also provides battery-powered bone tool systems under the Hall surgical brand for various bone-related procedures.\nThe general surgery division features advanced surgical and endoscopic technologies. A flagship product is the AirSeal insufflation system with valveless access ports that enhance minimally invasive and robotic surgeries. Through its Buffalo Filter acquisition, CONMED offers comprehensive smoke evacuation products for surgical procedures. The division also includes electrosurgical generators, endomechanical instruments for minimally invasive surgery, and specialized devices for gastroenterology procedures.\nA surgeon might use CONMED's AirSeal system during a laparoscopic gallbladder removal to maintain stable pneumoperitoneum (abdominal inflation), while simultaneously using the company's smoke evacuation technology to clear the surgical field of smoke generated during tissue cauterization.\nCONMED generates revenue by selling its products directly to hospitals and surgery centers, through medical specialty distributors, and via contracts with group purchasing organizations (GPOs) and integrated delivery networks (IDNs). The company maintains a global presence, distributing products in over 100 countries through both direct sales subsidiaries and independent distributors.\nResearch and development is a significant focus, with the company investing substantially to develop new products and enhance existing ones. CONMED's manufacturing and distribution processes must comply with strict FDA regulations and international standards for medical devices.\n4. Surgical Equipment & Consumables - Diversified\nThe surgical equipment and consumables industry provides tools, devices, and disposable products essential for surgeries and medical procedures. These companies therefore benefit from relatively consistent demand, driven by the ongoing need for medical interventions, recurring revenue from consumables, and long-term contracts with hospitals and healthcare providers. However, the high costs of R&D and regulatory compliance, coupled with intense competition and pricing pressures from cost-conscious customers, can constrain profitability. Over the next few years, tailwinds include aging populations, which tend to need surgical interventions at higher rates. The increasing integration of AI and robotics into surgical procedures could also create opportunities for differentiation and innovation. However, the industry faces headwinds including potential supply chain vulnerabilities, evolving regulatory requirements, and more widespread efforts to make healthcare less costly.\nCONMED's competitors in the orthopedic space include Smith & Nephew, Arthrex, Stryker Corporation, Johnson & Johnson's DePuy Mitek, and Zimmer Biomet. In general surgery products, the company competes with Medtronic, Johnson & Johnson's Ethicon Endo-Surgery, Stryker Endoscopy, Olympus, and Boston Scientific.\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $1.33 billion in revenue over the past 12 months, CONMED is a small company in an industry where scale matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term performance is an indicator of its overall quality. Any business can have short-term success, but a top-tier one grows for years. Thankfully, CONMED’s 8.8% annualized revenue growth over the last five years was decent. Its growth was slightly above the average healthcare company and shows its offerings resonate with customers.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. CONMED’s annualized revenue growth of 7.9% over the last two years aligns with its five-year trend, suggesting its demand was stable.\nCONMED also reports sales performance excluding currency movements, which are outside the company’s control and not indicative of demand. Over the last two years, its constant currency sales averaged 8.9% year-on-year growth. Because this number aligns with its normal revenue growth, we can see that CONMED has properly hedged its foreign currency exposure.\nThis quarter, CONMED reported modest year-on-year revenue growth of 3.1% but beat Wall Street’s estimates by 1.2%.\nLooking ahead, sell-side analysts expect revenue to grow 5.5% over the next 12 months, a slight deceleration versus the last two years. Despite the slowdown, this projection is above average for the sector and suggests the market is baking in some success for its newer products and services.\n7. Operating Margin\nCONMED has done a decent job managing its cost base over the last five years. The company has produced an average operating margin of 10.6%, higher than the broader healthcare sector.\nAnalyzing the trend in its profitability, CONMED’s operating margin rose by 2.8 percentage points over the last five years, as its sales growth gave it operating leverage. This performance was mostly driven by its recent improvements as the company’s margin has increased by 7.4 percentage points on a two-year basis.\nThis quarter, CONMED generated an operating margin profit margin of 11.1%, down 3 percentage points year on year. This contraction shows it was less efficient because its expenses grew faster than its revenue.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nCONMED’s EPS grew at an astounding 18% compounded annual growth rate over the last five years, higher than its 8.8% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nWe can take a deeper look into CONMED’s earnings to better understand the drivers of its performance. As we mentioned earlier, CONMED’s operating margin declined this quarter but expanded by 2.8 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its higher earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nIn Q2, CONMED reported adjusted EPS at $1.15, up from $0.98 in the same quarter last year. This print beat analysts’ estimates by 2.4%. Over the next 12 months, Wall Street expects CONMED’s full-year EPS of $4.49 to stay about the same.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nCONMED has shown decent cash profitability, giving it some flexibility to reinvest or return capital to investors. The company’s free cash flow margin averaged 8.4% over the last five years, slightly better than the broader healthcare sector.\nTaking a step back, we can see that CONMED’s margin expanded by 3.3 percentage points during that time. This is encouraging because it gives the company more optionality.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nCONMED historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 5.2%, somewhat low compared to the best healthcare companies that consistently pump out 20%+.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Unfortunately, CONMED’s ROIC averaged 1.1 percentage point decreases over the last few years. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Assessment\nCONMED reported $0 of cash and $0 of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $274.6 million of EBITDA over the last 12 months, we view CONMED’s 0.0× net-debt-to-EBITDA ratio as safe. We also see its $18.57 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from CONMED’s Q2 Results\nIt was encouraging to see CONMED beat analysts’ full-year EPS guidance expectations this quarter. We were also happy its revenue narrowly outperformed Wall Street’s estimates. Overall, this print had some key positives. The stock remained flat at $50.14 immediately following the results.\n13. Is Now The Time To Buy CONMED?\nUpdated: August 12, 2025 at 12:27 AM EDT\nWhen considering an investment in CONMED, investors should account for its valuation and business qualities as well as what’s happened in the latest quarter.\nCONMED’s business quality ultimately falls short of our standards. Although its revenue growth was decent over the last five years, it’s expected to deteriorate over the next 12 months and its subscale operations give it fewer distribution channels than its larger rivals. And while the company’s astounding EPS growth over the last five years shows its profits are trickling down to shareholders, the downside is its mediocre ROIC lags the market and is a headwind for its stock price.\nCONMED’s P/E ratio based on the next 12 months is 11.6x. Investors with a higher risk tolerance might like the company, but we don’t really see a big opportunity at the moment. We're pretty confident there are more exciting stocks to buy at the moment.\nWall Street analysts have a consensus one-year price target of $61 on the company (compared to the current share price of $52.48).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    }
  ],
  "argos_summary": "Positive inflation data led to a market rally, with major indices like the S&P 500, Dow, and Nasdaq rising as investors anticipated potential interest rate cuts by the Federal Reserve. Stocks in the healthcare sector, including Thermo Fisher, ICU Medical, CONMED, Pediatrix Medical Group, and IQVIA, experienced notable gains, although analysts express caution regarding their long-term growth prospects and financial health. Despite some companies reporting better-than-expected earnings, concerns about weak sales growth and declining returns on capital persist, suggesting that investors should be selective in their stock choices.",
  "argos_id": "8R1EDX6F3"
}