{
  "url": "https://www.yahoo.com/entertainment/articles/south-park-guys-share-alternate-230852882.html",
  "authorsByline": "Tom Tapp",
  "articleId": "74683bbe1dbb4c9286feb7cacf588ebd",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/771f3d46a634ac30baae62d3131fb7825ff4fcdcee705110d96a9cf0a06ee7aa/ynews/resizefill_w1200/https://media.zenfs.com/en/deadline.com/8b78794b5897c7aabc452ca2ec3a2540",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:08:52+00:00",
  "addDate": "2025-08-12T23:45:58.025678+00:00",
  "refreshDate": "2025-08-12T23:45:58.025679+00:00",
  "score": 1.0,
  "title": "The ‘South Park’ Guys Share Alternate Ending For Kristi Noem Episode",
  "description": "Department of Homeland Security Secretary Kristi Noem didn’t much like how she was portrayed in last week’s episode of South Park. Especially biting was the scene at the end in which Noem’s heavily made-up face falls off and runs away as if it were alive. If she didn’t appreciate that, Noem probably won’t be too …",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nDepartment of Homeland Security Secretary Kristi Noem didn’t much like how she was portrayed in last week’s episode of South Park. Especially biting was the scene at the end in which Noem’s heavily made-up face falls off and runs away as if it were alive.\n\nIf she didn’t appreciate that, Noem probably won’t be too thrilled with an alternate credits sequence posted to the South Park social media accounts today. In it, the gun-toting DHS Secretary enters a pet store and, through frosted glass, is seen shooting the dogs therein. (The scene references Noem’s admission in her memoir that she killed her own family dog because she considered the pet “untrainable.”) The post calls it “the Paramount+ version of the end credits scene.”\n• None ‘South Park’ Production To Be Overseen By George Cheeks In Post-Merger Paramount Structure\n\nBefore last week’s episode — titled “Got a Nut” — aired, Noem condemned the portrayal after the South Park crew teased stills of the show.\n\n“It never ends, but it’s so lazy, to make fun of women and how they look. Only the liberals and the extremists do that. If they wanted to criticize my job, go ahead and do that. But clearly they can’t. They pick something petty like that,” she said.\n\nLikely in response, the profile pictures on the show’s social media accounts were later changed to show Noem’s melting face in animated form.\n• None Everything We Know About Prime Video's ‘Legally Blonde’ Prequel Series ‘Elle’\n• None Everything We Know About 'Only Murders In The Building' Season 5 So Far\n• None Everything We Know About ‘The Love Hypothesis’ Movie So Far\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
  "medium": "Article",
  "links": [
    "https://deadline.com/2025/08/south-park-takes-shot-kristi-noem-season-27-episode-got-a-nut-1236479293/",
    "https://www.yahoo.com/entertainment/articles/everything-know-prime-video-legally-215807596.html",
    "https://www.yahoo.com/entertainment/articles/everything-know-love-hypothesis-movie-182044967.html",
    "https://deadline.com/2025/08/south-park-trolls-kristi-noem-changing-profile-picture-1236482491/",
    "https://www.yahoo.com/entertainment/articles/south-park-production-overseen-george-221513835.html",
    "https://www.yahoo.com/entertainment/articles/everything-know-only-murders-building-194018068.html",
    "https://www.yahoo.com/news/gov-kristi-noem-reveals-she-185602475.html",
    "https://cloud.email.deadline.com/signup/",
    "http://bit.ly/31XsHSx",
    "http://bit.ly/2TntOHq",
    "http://bit.ly/2TkcoeG",
    "https://www.yahoo.com/entertainment/articles/south-park-lets-loose-trump-030800187.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Kristi Noem Episode",
      "weight": 0.10022725
    },
    {
      "name": "Kristi Noem",
      "weight": 0.09713974
    },
    {
      "name": "South Park",
      "weight": 0.094199
    },
    {
      "name": "Noem",
      "weight": 0.08973319
    },
    {
      "name": "Post-Merger Paramount Structure",
      "weight": 0.06617945
    },
    {
      "name": "the South Park social media accounts",
      "weight": 0.064749405
    },
    {
      "name": "Alternate Ending",
      "weight": 0.059471697
    },
    {
      "name": "Legally Blonde",
      "weight": 0.058519825
    },
    {
      "name": "Noem’s melting face",
      "weight": 0.057260256
    },
    {
      "name": "frosted glass",
      "weight": 0.0561333
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.97265625
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.8701171875
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.71728515625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5361328125
    }
  ],
  "sentiment": {
    "positive": 0.07073959,
    "negative": 0.6479731,
    "neutral": 0.28128728
  },
  "summary": "Yahoo is using AI to generate takeaways from this article, which may not always match what's in the article. This is in response to criticism of Department of Homeland Security Secretary Kristi Noem's portrayal in an episode of South Park. The alternate credits sequence depicts Noem entering a pet store and shooting dogs, a scene Noem has previously admitted to killing her own dog. Noem had previously condemned the portrayal, calling it \"cynical\".",
  "shortSummary": "Yahoo's AI generated alternate credits for a South Park episode featuring Kristi Noem, which she criticized as sexist, but ended up being the “Parliament” version of the end credits.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6a012bf91d2c4776be0027c0ee5b01d2",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://deadline.com/2025/08/south-park-takes-shot-kristi-noem-season-27-episode-got-a-nut-1236479293/",
      "text": "South Park is not done taking shots at the Donald Trump administration, and its latest target is Homeland Security Secretary Kristi Noem.\nThe official social media accounts for the animated series shared photos of this week’s episode titled “Got a Nut,” in which an animated version of Noem appears fully stylized and fully glammed, posing with a gun in front of a Border Patrol van.\nIn the episode, Mr. Mackey loses his job and “desperately tries to find a way to make a living,” reads the logline.\nMackey is the school counselor at South Park Elementary and is seen in the preview photo with a vest portraying an ICE agent next to Noem.\nThe second episode of Season 27 is set to premiere at 10 p.m. ET Wednesday on Comedy Central.\nWatch on Deadline\nAnother still from the episode shows Cartman in bed watching a video on his laptop and looking surprised:\nNoem is the former governor of South Dakota and a faithful Trump supporter, who got national attention when she published a memoir in which she confessed to having shot and killed her family dog for being “untrainable.” Although for many, this would have been the end of her political career, in the Trump administration, that doesn’t apply, and MAGA loyalist Noem found herself on the national stage again.\nNoem was nominated by then-President-Elect Trump to serve in his cabinet as DHS Secretary and was confirmed by the Senate in January. Since serving in that role, Noem has carried out Trump’s immigration policies in deporting undocumented immigrants. Noem is often referred to as “ICE Barbie” or “Homeland Barbie” for appearing glammed up and never missing a photo opportunity.\nSouth Park premiered Season 27 on July 23, mocking Trump in bed with Satan, which seemingly offended the White House resident. Despite the President of the United States lashing out at the long-running animated series, other areas of his administration embraced the parody. The official DHS X account used a still of the upcoming episode to promote a job opening:\nThe new South Park episode mocks Trump once again, getting a little touchy with Satan:\nExcellent 👍\nYup going so political is going to do the show wonders. Just as Colbert how that ended up.\nEr, have you ever seen South Park? It’s been political for nearly 30 years.\nThe SP guys just reupped their contract for $1.5B. They still get paid either way and they own their IP so they can still make the show and put it own their platform. They have one of the best deals in the business. They’ll keep ripping 47 more and more viciously until he sues them. They’re playing the long game here.\nYep, once they start shooting one way, instead of both ways, they start shooting themselves in the foot.\nThe president will enforce its cancellation, so they will take off the gloves for the rest of the run?\nI think the fact that the 1st & 2nd episode both aired is such an accomplishment that if they do get cancelled, it is still job well done!\nLOL, bro at this point SP is one of the most successful shows in history. Twenty eight years. 329 episodes. More money for those guys than they could ever spend. They’ve destroyed absolutely anyone and everyone that they’ve ever wanted to go after.\nThey can do anything they want–there’s really no way for them to be significantly more successful than they already are.\nSo, ssssshhhhhhhhh.\nClearly they don’t get Comedy Central in your Siberian Trollbot call center.\nMaybe you missed the huge numbers South Park is doing and the $1.5 billion dollar streaming deal they just signed, even the President is raving about the show, it’s on the right track.\nYou really think politics is what’s behind the collapse of late night tv talk shows?\nFascist says what?\nYou only enjoy trolling the government when it’s a democrat in office, snowflake?\nYou’re right. We should all preemptively relinquish our first amendment out of fear of offending the Complainer in Chief.\nYou’ve never seen this goddamn show in the last 25 years and have no clue as to what it’s about"
    },
    {
      "url": "https://deadline.com/2025/08/south-park-trolls-kristi-noem-changing-profile-picture-1236482491/",
      "text": "South Park has seemingly reacted to Kristi Noem‘s criticism of the animated series after the Comedy Central show spoofed her.\nOn the most recent episode of South Park, Noem is portrayed as someone heavily invested in her looks, with a whole glam team prepping her hair and makeup.\nThe animated series pokes fun at this melting off her made-up face after a while, forcing her to call in a makeup crew to help her get back together.\nAhead of the “Got a Nut” episode airing, which featured Noem, South Park teased stills of the show with her portrayel.\nRELATED: “Well, I Finally Made It”: JD Vance Responds To His Blistering ‘South Park’ Debut\nWatch on Deadline\nDuring an appearance on Glenn Beck’s podcast, Noem shared her thoughts about the show mocking her looks.\n“It never ends, but it’s so lazy, to make fun of women and how they look. Only the liberals and the extremists do that. If they wanted to criticize my job, go ahead and do that. But clearly they can’t. They pick something petty like that,” she said.\nTo continue to highlight the work of South Park’s animators, the social media accounts recently changed the profile pictures (PFP) to show Noem’s melting face. Both Facebook and X (formerly Twitter) now feature Noem in animated form.\nRELATED: ‘South Park’ Trolls Donald Trump’s DHS Ahead Of ICE Barbie Episode: “Wait, So We ARE Relevant?”\nThe South Park episode also featured Noem shooting puppies, including Superman’s Krypto dog, which referenced the DHS Secretary admitting in her memoir to killing her own family dog due to them being “untrainable.”\nIf only South Park would do her justice…killing her dog is the least of her vileness. She is a petrological liar. She lied about he father’s death being the cause of her quitting college…she quit to get married and have a baby BEFORE he died in a farm accident…but used it to get the sympathy vote to win her election. In congress she voted more liberal than John McCain and Mitt Romney. She hates Trump…but uses him for his money. She shut down South Dakota just like Newsom did but lied about it. SD got MORE money for covid per capita than most states. Check out her Executive order 2020-12. She stopped the use of HCQ…she used the National guard for contact tracing and quarantined South Dakotans…BUT LIED ABBOUT IT ALL….but because she was a siren you all believed her.\nYes, sociopaths often start demonstrating their depravity by abusing animals\nIt’s Not only liberals that mock women’s appearance. Trump has often mocked women’s appearance.\nIt’s what she deserves for killing her own dog. She’s the worst of the worst.\nI sure hope she doesn’t have dogs, cats or other animals right now. Those poor creatures are not safe with that psychopath.\nLAZY?!\nKnow what’s LAZY?\nShooting a puppy instead of training it."
    }
  ],
  "argos_summary": "Homeland Security Secretary Kristi Noem criticized her portrayal in a recent episode of South Park, particularly a scene where her heavily made-up face falls off. The episode, titled 'Got a Nut,' features Noem in a glamorized light, and includes a controversial scene referencing her admission of killing her own dog. In response to her complaints, South Park's social media accounts changed their profile pictures to depict her melting face, further mocking her appearance.",
  "argos_id": "93C4TU970"
}