{
  "url": "https://www.nytimes.com/athletic/6548280/2025/08/13/barcelona-la-liga-new-season-preview-yamal-rashford/",
  "authorsByline": "Pol Ballús",
  "articleId": "95b64b02f6de480297be8dd66a34e4b8",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12080037/GettyImages-2229436061-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:30:43+00:00",
  "addDate": "2025-08-13T04:47:27.475678+00:00",
  "refreshDate": "2025-08-13T04:47:27.475681+00:00",
  "score": 1.0,
  "title": "Barcelona 2025-26 season preview: Next-level Yamal, high-line worries and Rashford’s new role",
  "description": "Barca get their La Liga title defence up and running on Saturday night when they visit Mallorca",
  "content": "La Liga’s return is upon us, with Barcelona to start their title defence on Saturday away against Mallorca.\n\nHansi Flick’s side celebrated a domestic treble last season — having also won the Supercopa de Espana and Copa del Rey — and seem to have strengthened again this summer with the signings of Joan Garcia and Marcus Rashford especially.\n\nWhat will the new term bring? Barcelona correspondent Pol Ballus previews the upcoming campaign.\n\nWhat are the club’s expectations for this season?\n\nBarcelona expect to end the season with more silverware, that is for sure.\n\nThe belief inside the club is that the squad has improved from last term. Important players are returning from injury (such as Marc Bernal and Marc Casado in midfield) and the whole team now know what it’s like to play under Flick, who was appointed last summer. The system is perfectly established, and the dressing room filled with desire to achieve big things — as Barca feel they have all the potential to.\n\nLa Liga will be the competition that obviously sets the tone for them, one where they will compete principally against a Real Madrid side reinforced under new head coach Xabi Alonso. But there is no trophy that lifts the spirits in Catalonia like the Champions League. Fine margins kept them out of its final last season, and this is where the players want to improve now.\n\nEuropean-level success is what sees a great squad become one for the ages in Barcelona.\n\nWho have they signed?\n\nGoalkeeper Joan Garcia arrived from city neighbours Espanyol for his €25million (£21.6m; $29.2m) release clause, England forward Marcus Rashford has come in on a season’s loan from Manchester United and 19-year-old winger Roony Bardghji was signed for €2m from Danish side Copenhagen. Wojciech Szczesny also re-signed to be the backup ’keeper after his emergency arrival early last season after injuries struck.\n\nThose first two names were brought in to cover two areas Barcelona wanted to improve on. Garcia provides a long-term replacement for Marc-Andre ter Stegen, who at age 33 and having now gone through two surgeries in the past 11 months, is seen at the club to be past his best.\n\n\n\n With Rashford, Barca have the attacking reinforcement they were looking for on the left wing, as well as a versatile player who can operate centrally, too. Flick believed he was short of options up front in key moments last season and adding Rashford gives players such as Raphinha and a 36-year-old Robert Lewandowski some more breathing space.\n\nBardghji is a personal bet from sporting director Deco, a market opportunity signing which, in the worst-case scenario, should at least bring in some profit from selling him on. For now, the Sweden Under-21 international has impressed Flick in pre-season and is expected to stay with the first team rather than Barcelona’s reserves.\n\nNico Williams and Luis Diaz were both targets Barcelona initially preferred for that left-winger spot since filled by Rashford.\n\nNegotiations were very advanced in Williams’ case, but talks fell apart at the very last minute due to the Athletic Club player’s concerns about Barca’s capacity to actually register him. With Diaz, Barcelona were essentially unable to match Liverpool’s demands. As soon as Bayern Munich showed interest too, Barca were aware they did not have the financial power to compete (the 28-year-old Colombian eventually joined Bayern in a deal worth €70million up front plus a further €5m in potential add-ons).\n\nWhat else is new?\n\nLamine Yamal’s shirt number. Barcelona’s new No 10 seems ready to take on the new responsibility. The 18-year-old shone on the biggest stages last season and looks ready to step up his game even more in this one, now wearing the iconic jersey that not so long ago belonged to Lionel Messi.\n\nPotentially, the stadium Barcelona play their home matches in this season will be new, too. They expect to finally be back at a refurbished Camp Nou next month. Their iconic ground has been undergoing major renovations since June 2023, and Barca’s initial plan was to re-open at reduced capacity in November last year.\n\nEven now, nine months on from that missed target date, when they’ll finally return home is not absolutely confirmed. The city council has approved a plan for Camp Nou to be in action again, with a limited capacity of just 27,000, as soon as certain works are finished. For now, this has not happened.\n\nBarca sources say they still hope to be back by September 14 — their fourth La Liga game, against Valencia. The competition body approved a request from the club to play their first three league matches on the road.\n\nWho’s been the best player in pre-season?\n\nGavi was the top scorer on the tour to Japan and South Korea with three goals in the three games. The 21-year-old has clearly left his knee injury problems in the past and, after a full pre-season under Flick, seems closer than ever to his old best.\n\nNow the manager is going to have the good problem of finding space for him in a midfield where Pedri and Frenkie de Jong seem to have guaranteed spots.\n\nYamal has been outstanding as well. Four goals in four games, and the feeling he looks bigger, stronger and quicker than he was a year ago — which should worry any full-back in world football.\n\nWhat should fans be excited about?\n\nThe return of Bernal. The teenager’s breakthrough in the holding midfield role was cut brutally short early last season because of an anterior cruciate ligament (ACL) knee injury he suffered in just Barca’s third La Liga game.\n\nNow 18, he has completed a full pre-season but is yet to make his return on the pitch — Barca do not want to take any risks with rushing him back. He is, however, expected to be in contention for the start of the new La Liga season.\n\nWhat should fans be worried about?\n\nWhether the team can improve their defensive record. Barcelona were conceding too many goals by the end of last season — the seven Inter scored against them over the two legs of a Champions League semi-final still loom as the major reason why they did not go through to face Paris Saint-Germain.\n\nBarca’s relentless pressure up front and crazily high defensive line also brought plenty of rewards over Flick’s debut season, but once opponents figured out what they were doing, they were able to find more ways to unfold it.\n\nLosing Inigo Martinez on a free transfer the week before the start of the new season is not great news, either.\n\nVery happy. Barcelona have addressed the weaknesses Flick identified at the start of the summer, and the players who stayed at the club are delighted to keep working under him.\n\nHe has had a bit of a mess to navigate through with the club’s handling of the Ter Stegen situation. The relationship between the goalkeeper and Barca’s board reached a dramatic flashpoint with the German stripped of the club captaincy last week. The tension centred on Ter Stegen’s decision not to sign medical documents Barcelona wanted to send to La Liga in order to take advantage of a rule that would have helped their struggle to register players.\n\nWith Ter Stegen’s statement on Friday, the situation now seems to have been resolved, and he has been reinstated as skipper.\n\nWhat’s the percentage chance of Flick seeing out the season?\n\nFlick’s stock is very high after a really successful first year in charge in which the former Bayern and Germany boss dramatically turned the team around with minimal fuss. Satisfaction was so great in all departments at Barcelona that he signed a new contract in May, getting a salary upgrade and committing himself until 2027 at least.\n\nIt would take a very drastic change of fortunes to see him removed from his role during the coming season.\n\nLewandowski is not a guaranteed starter all season.\n\nThe Polish striker turns 37 next week and is into the last year of his contract.\n\nGiven the club’s planning for their future, as well as the physical demands Flick has for whoever plays as his striker, especially off the ball, it would not come as a shock to see Ferran Torres start as the No 9 more often than last season, with Rashford also capable of playing there. Torres, 25, had a decent pre-season, scoring two goals in the two games he played.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6542233/2025/08/09/inigo-martinez-barcelona-exit-al-nassr/",
    "https://www.nytimes.com/athletic/6540217/2025/08/07/barcelona-marc-andre-ter-stegen-injury-dispute/",
    "https://www.nytimes.com/athletic/6546344/2025/08/12/barcelona-marc-bernal-breakout-injury/",
    "https://www.nytimes.com/athletic/6462296/2025/07/16/lamine-yamal-lionel-messi-ansu-fati-no-10/",
    "https://twitter.com/FCBarcelona_es/status/1954883283398906235?ref_src=twsrc%5Etfw",
    "https://t.co/HV6cdtOYXc",
    "https://www.nytimes.com/athletic/6473318/2025/07/04/barcelona-nico-williams-athletic-club-transfer-collapsed/",
    "https://www.nytimes.com/athletic/6468756/2025/07/08/barcelona-camp-nou-stadium-return-joan-gamper/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last season",
      "weight": 0.09510747
    },
    {
      "name": "season",
      "weight": 0.07761933
    },
    {
      "name": "November last year",
      "weight": 0.07223388
    },
    {
      "name": "last term",
      "weight": 0.06699499
    },
    {
      "name": "last summer",
      "weight": 0.06679664
    },
    {
      "name": "last week",
      "weight": 0.06673357
    },
    {
      "name": "Barcelona",
      "weight": 0.060764264
    },
    {
      "name": "Barcelona correspondent Pol Ballus",
      "weight": 0.057530027
    },
    {
      "name": "first year",
      "weight": 0.057299353
    },
    {
      "name": "the new La Liga season",
      "weight": 0.054602597
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9892578125
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97802734375
    }
  ],
  "sentiment": {
    "positive": 0.50279063,
    "negative": 0.07361046,
    "neutral": 0.4235989
  },
  "summary": "Barcelona is set to defend its title in La Liga, starting their season against Mallorca. The club's recent signings include Joan Garcia from Espanyol, Marcus Rashford from Manchester United, Roony Bardghji from Copenhagen, and Wojciech Szczesny from Barcelona. The team believes they have improved from last season, with important players returning from injury and the team now know what it's like to play under new manager Hansi Flick. Barcelona also plans to play their home matches at the refurbished Camp Nou next month. The city council has approved a plan for the Camp Nou to be in action again, with a capacity of just 27,000.",
  "shortSummary": "Barcelona's season begins with La Liga title defense, bolstered by signings like Joan Garcia and Marcus Rashford, aiming for more trophies and revenue.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "49116556366144fb89417b7ba51f1405",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6546344/2025/08/12/barcelona-marc-bernal-breakout-injury/",
      "text": "When Marc Bernal fell to the ground in the 94th minute of Barcelona’s visit to Rayo Vallecano last August, he knew it was bad.\nThat was why Pau Cubarsi and Dani Olmo covered their faces as soon as they came over to their team-mate. The then 17-year-old midfielder’s dream was over for that season before it had even really begun — he had torn the anterior cruciate ligament in his left knee and suffered an associated injury to his outer meniscus, ruling him out for the campaign in just its third game.\nAdvertisement\nWhen Hansi Flick was appointed as Barcelona coach in May last year, Bernal had spent the previous season with their second team, Barca Atletic, in Spain’s third division. The German arrived with a good knowledge of all the club’s young players and had asked for references on all of them. He had been told that one starlet had shown potential to be the first team’s defensive midfielder for some time to come. He’d been labelled a ‘new Sergio Busquets’, something Barca had been looking for since the Spain international’s departure at age 34 after the previous campaign.\nThat summer of 2024 featured two international tournaments, the European Championship and the Copa America, meaning many key Barcelona players returned later than usual from their holidays after being on duty with their country. Flick therefore had to start his first pre-season in charge with a very young group and then also take some of them on the club’s pre-season tour to the United States.\nThat gave those youngsters a chance to get to know their new manager and gain some valuable minutes with the first team. Several stood out, but one of them totally kicked down the doors: Bernal.\nFlick loved the defensive midfielder’s style of play. With Frenkie de Jong suffering from an ankle injury and the club having looked to sign someone in that position for some time anyway, the answer appeared to be right there at home, particularly given Barca’s delicate financial situation.\nPrevious coach Xavi had wanted Martin Zubimendi, then at Real Sociedad, in 2023, while the club were keen on Joshua Kimmich of Bayern Munich. But when Flick saw the youth-team pairing of Bernal and Marc Casado, now 21, he decided there was no need to sign anyone else. The search for a defensive midfielder was halted.\nForming a double pivot with Casado at the base of midfield in that pre-season, Bernal’s talent did not go unnoticed. After a friendly against his Manchester City side, Pep Guardiola said, “Marc Bernal has impressed me, the way he controls the ball, the way he plays.”\nBernal is a player who is reminiscent of Busquets in many ways. Though he now stands at 6ft 4in (193cm), four centimetres taller than the Barca and Spain legend, he resembles him in terms of his intelligence on the ball, control and ability to start moves from the back. As was the case with the now Inter Miami midfielder, dressing-room sources — who, like all those cited in this article, asked to remain anonymous to protect relationships — say Bernal’s attitude is impeccable.\nAdvertisement\nThe confidence Flick showed in him was not only evident in conversations, but also his decision to name him in the starting line-up for the first few games of last season. Bernal was caught out for one of the goals Monaco scored in the pre-season Joan Gamper friendly match, which Barcelona lost 3-0, but Flick kept him in the starting line-up when the season officially started.\nBernal and Casado started the first La Liga match of the season together against Valencia, but Flick’s choice between the two was clear when Pedri returned to the starting XI after a rest following his triumph with Spain at the Euros, with Bernal given the nod. He continued in defensive midfield against Athletic Club and Rayo before his injury in the latter game on August 27.\nCasado stepped up in Bernal’s absence, even staying in the line-up when De Jong was available again. But the Dutchman eventually regained his place and went on to show some of his best form in his six seasons at Barca. Even so, Flick’s second choice in the position is still Bernal.\nHe has made this clear to the player himself, while also saying he wants to be patient with him and avoid any risk of an injury relapse. Bernal was finally medically discharged from his injury on Friday — 346 days after it happened — although Barca doctors advise that players under 20 who suffer that kind of knee issue generally take around a year before they are available for selection again (August 27 would be after Barca’s first two La Liga matches against Real Mallorca and Levante).\nSources close to the player say Flick has spoken to him a lot since his injury.\nOnce Bernal underwent surgery, he even went to see him in hospital, giving him a self-improvement book called Supera Tus Limites (Overcome Your Limits) by psychologist Jordi Gil Martin. The German wrote a dedication to Bernal at the front of the book, which went beyond a “get well soon” message, according to sources close to the player, reminding him he was still very young and had his whole career ahead of him, which Bernal was amazed by.\nAdvertisement\nDuring his time away from the pitch, he has trained hard and gained muscle mass, especially in his upper body. He has also grown two centimetres in height. Voices close to him say it was possibly the hardest time of his life; in an interview with club channel Barca One, Bernal said sometimes he wanted to spend whole days sleeping.\nHe lived at the club’s La Masia youth facilities during his recovery, although he had to spend the first month and a half in a hotel opposite. The club offered him that option so he could be with his mother, as he needed help with everything in the first month after his operation, including washing himself, dressing, walking and cooking. Having turned 18 in May, he will leave La Masia to live independently elsewhere.\nThose close to Bernal are confident he has developed the tools to deal with any more tough times that might come his way in the future. He was also helped by seeing a coach he has worked with since the age of 14 on a weekly basis.\nWhile he was injured, the club renewed his contract until 2026, inserting a €500million release clause.\nBernal’s return to action will be gradual, and he is expected to start playing more from mid-September onwards.\nAs fate would have it, his return could happen on the very pitch where he was injured: Barca’s third league game of the season is away against Rayo on August 31. However, club sources say it may be delayed until a few weeks later, with the midweek Champions League fixtures coming into the picture from September 16. He could also step up to the plate when De Jong needs a rest or suffers an injury.\nA year on from his lowest point, everything is going Bernal’s way.\n(Top photo: Jose Breton/Pics Action/NurPhoto via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6468756/2025/07/08/barcelona-camp-nou-stadium-return-joan-gamper/",
      "text": "In just over a month, Barcelona will return to the Camp Nou for the first time since starting a €1.5billion (£1.3bn; $1.8bn) refurbishment project two years ago.\nAt least, that’s what the club is hoping.\nWork on Barca’s stadium has already suffered several setbacks, with an original return date of November 2024 long since passed. Now the club is targeting August 10 — when Barca play their traditional season-opening friendly match, the Joan Gamper Trophy — for the big day.\nAdvertisement\nThat date represents a fifth rescheduling of the team’s expected return. Delays to the project have already forced Barca to play at the city’s Estadi Olimpic Lluis Companys much longer than expected, but the option of starting a third consecutive season there appears to have been ruled out. They no longer have permission to play at the ground, nor do they intend to apply for it.\nBarca sources — who, like all those consulted for this article, preferred to contribute anonymously in order to speak freely — insist the club has no Plan B. They are confident the 2025-26 campaign will be spent back at the Camp Nou.\nBut even with such little time left before their return, question marks remain over exactly when they can be expected back there, and under what kind of circumstances.\nWhen were Barca supposed to be back?\nWork on the Camp Nou began in June 2023, with the aim of modernising the ground while increasing its capacity to 105,000, which would be the largest in European football.\nThe stadium was initially scheduled to reopen at about 60 per cent capacity in time for Barca’s 125th anniversary in November 2024 (with full completion in June 2026), but that date has been put back several times.\nThe November 2024 target was mentioned by Ebru Ozdemir, president of Limak, the construction company in charge of the works, in an interview with El Periodico in March 2023.\nBut in July 2024 came the first public signs of slippage. Barca vice-president Elena Fort said in an interview with the EFE news agency that work was “going according to plan”, but added: “As of today, we can confirm that the stadium will be ready for play by the end of the year.”\nThe following September, Barca president Joan Laporta said the club “didn’t want to set dates” for a return “because it might happen later or it might even happen earlier”.\nAdvertisement\n“I believe that by the end of the year, we will be able to come back,” he added, speaking at a news conference.\nThat was still the message a month later in October. At another press conference, Fort repeated that construction was “on the right track”, but a Barcelona statement released a week earlier said the team was now expected to return “in the second half” of the 2024-2025 season.\nThen, in an interview with Catalan radio station RAC1 in January 2025, Fort said: “There is no exact date, but we will return this season. It will be when we can, but before the end of this season.”\nA bird’s-eye view of heaven on earth: Spotify Camp Nou. 🚁 pic.twitter.com/qrOsKTnG6C\n— FC Barcelona (@FCBarcelona) May 28, 2025\nWhile work on the Camp Nou went on, Barca made a temporary home at the Estadi Olimpic Lluis Companys across the city on Montjuic, a ground that has about 40,000 fewer seats than the old Camp Nou.\nBarca had always planned to spend the entirety of the 2023-24 season there, but in early 2025, they had to apply to the local authorities to allow them to finish the 2024-25 campaign in the stadium.\nThat change of plan meant a Clasico with Real Madrid was now set for the same weekend as a Rolling Stones concert scheduled at their temporary home. Barca sources at the time said they considered the Camp Nou as a potential option for the May 11 fixture. In the event, the Rolling Stones cancelled plans for a European tour, leaving Barca free to play at Montjuic.\nIn 2023, the club estimated that playing one season at Montjuic would cost them about €90m (£77m; $106m at current rates) in lost revenue. They ended up staying for two.\nCargando: Spotify Camp Nou pic.twitter.com/XUcxp9bXJ7\n— FC Barcelona (@FCBarcelona_es) July 4, 2025\nLast week, Barca announced they would return to the Camp Nou just over a month from now for the Joan Gamper Trophy on August 10, an annual friendly match that kicks off the new season. Speaking in early June, before the fixture was arranged, club sources said they expected the capacity for Barca’s Camp Nou return to be limited to 25,000.\nAdvertisement\nHowever, as things stand, they do not have the necessary permits to do so, according to Barcelona’s deputy mayor, Laia Bonet.\n“The work must be completed on time and in the proper manner in order to apply for the provisional first occupancy licence for the opening of the first and second stands,” she said at a news conference last week.\n“We are not there yet and we need time to check that the stadium is in a condition to welcome spectators.”\nIn an interview with La Vanguardia published on Wednesday, Fort said the club remained “focused” on obtaining the required permits.\nAs for when the stadium is scheduled to be completely finished, she said: “I think we’ll be able to say the stadium is finished by the summer of 2026. Visually, it won’t be 100 per cent finished; the roof will still need to be closed. But everything will be there.”\nLaporta said when announcing the Limak deal that there were “guarantees” the team would be back playing at the stadium in November 2024. He said these could include penalty charges of €1m that Limak would have to pay for each day past the November 2024 deadline. However, no such penalty charges have been made, and in January this year, Fort said any potential penalty charges could only be assessed after construction was completed in 2026.\nWill Barca start this season at Camp Nou?\nBarca sources say the club has not made any alternative plans to playing the Joan Gamper at the Camp Nou.\nHowever, in her interview with La Vanguardia, in reply to a question about whether there was a Plan B and whether that might see the Joan Gamper played at the club’s Johan Cruyff stadium near the training ground instead, Fort replied: “Yes. Life isn’t 100 per cent predictable, there’s always the possibility of something happening.”\nFort also mentioned a “load test” the club plans to carry out and said its results would determine the capacity at which the Camp Nou could re-open. She said this would be conducted without any spectators, with “suppliers, the media and the city council, which obviously has to give its approval” attending instead. Local police and emergency services will also have to check access, while validation from UEFA and La Liga will be needed.\n“The first half of July, or the first 10 days of July, will determine everything,” Fort added.\nIn terms of the new La Liga season, Barca asked for their first matches to be scheduled away from home and the competition body has granted this. Barca’s first three games are away trips, with their first home fixture scheduled for the weekend of Saturday, September 14, when they host Valencia (the exact date will be confirmed closer to the time). The first round of the Champions League league phase is due to be played from September 16.\nAdvertisement\nWith so many issues still up in the air, though — including the missing permits and the uncertainty around what capacity the ground can open at — Barca have not been able to start any ticket sales for matches. Usually, season ticket sales begin in the first weeks of June, but the process has still not started. Nor have any tickets gone on sale for the Joan Gamper friendly next month.\nBarca sources remain confident all will be well, but in terms of alternatives, Barcelona city council sources say it would not be possible for Barca to return to playing at Montjuic because a series of concerts are already scheduled there that cannot be cancelled.\nCity council sources also confirmed that Barca have made no request to further use the stadium, but added that the stadium could, in theory, be re-adapted to football use within a week, so long as it did not mean disruption to concert dates.\nAs for the Johan Cruyff stadium mentioned in Fort’s La Vanguardia interview, this is the 6,000-capacity stadium used by Barcelona’s women’s team and the men’s reserves team. It is difficult to see how the ground could be used by the senior men’s side.\nMedia reports suggest Italian side Como, managed by former club midfielder Cesc Fabregas and with Sergi Roberto among their number, will be Barca’s opponents for the Joan Gamper. The Athletic approached Como for confirmation, but they declined to comment.\nWhy have there been so many delays?\nThe initial November 2024 return date — at reduced capacity — held huge symbolic value for Barca, but several problems have contributed to the delays seen since.\nSenior figures at the club have tended to explain these by referring to “unforeseeable circumstances” — Laporta being the most recent to do so at a May press conference.\nBarca have pointed to the discovery of an unknown high-voltage line on the site, the company that was set to supply the iron for the stadium going bankrupt, bureaucratic problems in bringing in skilled labour from outside the European Union, and various problems that Limak had with several suppliers trying to increase raw material costs. Limak, in a June press release, said the Camp Nou project was “progressing on schedule, with completion expected in 2026”.\nComplaints from local residents about noise and light also restricted the working patterns constructors had planned to follow. A timetable of permitted works was agreed upon at a meeting between the Camp Nou neighbours’ association, Barcelona city council, and FC Barcelona. It allowed work to continue until midnight as long as it did not involve the most disruptive aspects in terms of noise and light.\nAccording to residents, there were several breaches of this, and after several incidents in which the police were called, the timetable was altered so that work had to stop by 10pm. Then it was agreed that work could continue until midnight, but only if it was internal work that did not involve noise or light pollution. In March, the city council granted special permission allowing work to continue 24 hours a day (except for weekends), which is currently valid until August 2.\nAdvertisement\nMeanwhile, a report published in April by local media outlet Ara claimed further delays had been caused by a decision to prioritise the construction of a section of VIP seats, which had important implications for the club’s finances, as further explained below.\nWhat does this mean for Barca’s finances?\nHaving the Camp Nou ready to host games won’t just provide the club with a bigger source of income and put an end to the rent they pay to play at Montjuic, it will also have a direct impact on their capacity to sign and register new players.\nThe Catalans are currently above the salary limit that La Liga set for them, which means the competition forces them to offload current salaries before registering new ones.\nA major reason they are above their salary cap is that Barcelona’s latest asset sale — VIP seating at the revamped Camp Nou — could not be included in their current budget.\nCrowe, an audit company that currently works with Barcelona, assessed that the €100m the Catalans received from Middle Eastern investors for the sale of the VIP seats can’t be counted as an asset because the actual seats had not been built yet.\nClub sources say that builders at the Camp Nou are focused on building all of those VIP seats before the end of summer.\nThey believe that as soon as the VIP seats are built, auditors will allow the inclusion of that €100m in the club’s accounting, and that would enable Barcelona to return to a stable financial position regarding their salary limit.\nThe budget for the entire Espai Barca — the name for the extensive renovation project, which also includes the Palau Blaugrana multi-sport arena, the campus and the urban development of the area — is €1.5bn.\nThe price that Limak committed to complete the new Camp Nou was €990m, but during the process, a green light was given for the construction of a Skywalk, a viewing platform from which the whole of Barcelona will be visible. The cost of this was not included in the agreed budget and will be added as an extra.\nAdvertisement\nOn Wednesday last week, Fort told La Vanguardia that the original budget would be met, and that “there’s no red line that makes us think it will become more expensive”.\nShe added: “This year we already have some advance payments, but everything is under control. Furthermore, we’ve secured the debt refinancing we wanted because people believe so strongly in the project. The estimates are that we’ll triple the operating income we had at the previous Camp Nou.”\n(Top photo: Josep Lago/AFP via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6542233/2025/08/09/inigo-martinez-barcelona-exit-al-nassr/",
      "text": "Inigo Martinez drove out of Barcelona’s Joan Gamper training facilities for one last time on Friday morning.\nHe had checked in about an hour earlier to bid farewell to his team-mates and all the coaching staff in Barca’s first-team unit. Among those also present was club president Joan Laporta, who wanted to say goodbye to one of the team’s most trusted lieutenants, now leaving to join Saudi Arabian side Al Nassr on a free transfer.\nAdvertisement\nThis is a painful loss for Barca. Financially, they get nothing for one of the best performers in a team that won the Spanish domestic treble last term.\nMartinez is 34, had only one year remaining on his contract and, last season aside, had a slightly concerning injury record. But as he is leaving for a club that was willing to splash €30million (£26m; $34.9m) on the signing of Joao Felix (add-ons could bring the deal to €50m), you wonder whether Barcelona could have done better business.\nIn the end, the Spanish champions agreed to honour an agreement they made with Martinez when he signed his contract extension in March. This allowed him to leave for free if a big offer came in from the Middle East. Al Nassr have tempted him with a two-year contract and a financial package he could not have found elsewhere.\nBarca dressing room sources — who, like all those cited here, asked to speak anonymously to protect their position — told The Athletic that Martinez had a big offer from a club in the Saudi league last summer. He decided to refuse it and stay after speaking with Hansi Flick, who wanted to make him a key part of his defence.\nOff the pitch, it’s worth mentioning what Martinez has done for Barca. First, he was willing to join them on a free from Athletic Club (as a result, he has been jeered on his every return to San Mames), then he spent the past two summers with worries over whether his registration would be sorted, with a resolution only coming just before the deadline each time.\nLaporta and Deco, therefore, agreed to insert the requested clause in Martinez’s contract.\nBarca’s sporting director said at the start of the summer, in an interview with La Vanguardia, that he wanted one centre-back to leave this window as they had too many options. Martinez, however, was certainly not his choice. Deco would have preferred to sell Andreas Christensen or Ronald Araujo.\nAdvertisement\nBarca sources claim the upside of this transfer is that they remove €14m from their wage bill. Given their struggles to stay on the right side of La Liga’s salary limit — and the uncertainty this means for new signings Joan Garcia and Marcus Rashford — that would be a positive to take.\nClub sources also say Martinez’s departure is still not enough to register Garcia, which is their main priority right now. They are still waiting for their VIP seating money (Barca sold the future proceeds from executive boxes at the Camp Nou for €100m in December) to be approved by auditors and counted in their budget. It is unclear when, or indeed if, this will eventually happen.\nFrom a purely footballing perspective, Martinez will be a big loss, as he was such a unique piece in Flick’s Barcelona side; the only naturally left-footed centre-back, which, combined with his polished technique, made him a key asset in the build-up.\nMartinez was fundamental in boosting Barca’s ball circulation down the left of their attack, usually in tandem with Alejandro Balde and Raphinha, as well as punching the ball into midfield in the left half-space. The graphic below shows his most common line-breaking passes in La Liga last season.\nBut he also found great success with what became something of a trademark long-range switch out to Lamine Yamal on the right wing — a move that was especially effective in stretching out teams from a low-block. Only Real Madrid’s Federico Valverde (43) completed more than his 31 switches of play last season in La Liga.\nThe fact Martinez was a perfect complement to Pau Cubarsi should not go unmentioned, either. He didn’t just allow the 18-year-old to play on his strong side, it was also that Martinez’s trademark long-range switch of play combined perfectly with Cubarsi’s ability to spot the best passing line through to midfielders in the inside pockets.\nAdvertisement\nHe was a leader, too. In a team filled with youngsters (Cubarsi is almost half his age), Martinez brought a sense of accountability. He was there with a roar when it was needed. He was a living example of not taking anything for granted, because football does not tend to give you an easy path. He was seen as captain material, and that’s not easy to find.\nMartinez became a fan favourite, last term especially. In part, this was because nobody expected him to become the player he turned out to be, nor for him to defend the badge as he did, given the hard times he went through registration-wise. But really, it was about what he did.\nIt was the display he put in against Real Madrid at the Bernabeu, leading the defence when Barcelona won 4-0 and Kylian Mbappe was caught offside eight times.\nIt was the last-ditch tackle he made at Leganes to deny an equaliser in a must-win match in April.\nIt was the bus ride around the city when Barca paraded the three titles they won last year, with Martinez having himself a proper celebration on the top deck, a beer in one hand and an Estelada — a flag linked to the Catalan independence movement — in the other.\nBarcelona sources say they won’t sign anyone to replace Martinez — not that it would be advisable to, given the registration problems they still have, now just one week from the start of La Liga.\nChristensen and Araujo, who has now temporarily been promoted to captain following Marc-Andre ter Stegen’s dramatic demotion, are expected to be the ones to fill the void he leaves behind.\nIn a way, it throws a lifeline to their Barca careers. But right now, it is hard to envisage how they can compensate for everything Martinez gave Barcelona in a 2024-2025 season that will never be forgotten.\n(Top photo: Jose Breton/Pics Action/NurPhoto via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6540217/2025/08/07/barcelona-marc-andre-ter-stegen-injury-dispute/",
      "text": "The dispute between Barcelona and Marc-Andre ter Stegen escalated on Thursday, with the Spanish champions stripping the goalkeeper of the captaincy and opening disciplinary action against him.\nTensions between Barca and Ter Stegen have been rising all summer, but they reached a high point this week in an argument about the severity of his back injury that has now seen the club take unprecedented action.\nAdvertisement\nWhy is Ter Stegen’s back injury such a big deal? Essentially because it has consequences for Barcelona’s ability to register the new players they have already signed this summer. It’s a complex situation that has deeply shocked the Barca dressing room with just over a week to go before they begin their La Liga title defence.\nHere, informed by sources on both sides of the dispute, who were granted anonymity so they could speak freely, The Athletic explains what’s going on…\nWhat’s the background to this?\nBarca still need to bring themselves in line with La Liga’s salary limit, the set of rules that dictate how much a club can spend on wages. Because they have been spending more than their limit allows (it is calculated according to each club’s revenue), Ter Stegen’s injury offers them an opportunity they do not want to pass up.\nThere is a La Liga rule that allows clubs to replace an injured player’s registration with that of a new player, so long as their wage counts for less than 80 per cent of the injured player’s. That same rule helped Barca temporarily register last year’s big arrival, Dani Olmo, following an injury to Andreas Christensen.\nTo qualify for this, the injury has to be deemed a long-term one, with a recovery time of at least four months. This has to be decided by La Liga’s independent medical panel.\nAfter Ter Stegen had surgery on a back injury last week, Barcelona this week were preparing to file his medical report to La Liga. The club expected that Ter Stegen’s injury would be deemed a long-term one and that, crucially, this would allow them to register the signing they want to promote ahead of Ter Stegen as Barca’s new No 1: Joan Garcia, bought from Espanyol for his €25million (£21.6m; $29m) release clause this summer.\nHowever, Barca need Ter Stegen’s consent before sharing his medical details with third parties, including La Liga. The goalkeeper decided not to allow this.\nAdvertisement\nWhat’s Barcelona’s view?\nBarca believe Ter Stegen is aiming to harm the club with his decision not to sign the medical documents they want to send to La Liga. Sources close to Ter Stegen refute that. They say he is not willing to do so because they do not consider his injury a long-term problem.\nBarca sources say they are baffled by how the situation has escalated since Ter Stegen’s social media post on July 24, in which he said he would be back in three months’ time. Club president Joan Laporta and sporting director Deco were especially angered by the message the German wrote, which was posted before he had surgery and without the club being aware of it.\nSome board members favoured stripping him of the captaincy because of that alone.\nDear Culers,\nI wear the colors and jersey of FC Barcelona with great pride, whether on or off the pitch, in moments of success and in difficult times. Today is a personally difficult day for me.\nPhysically and athletically, I feel in very good shape, although unfortunately I…\n— Marc ter Stegen (@mterstegen1) July 24, 2025\nOn the eve of every season, a vote is held among the players to elect the team’s group of captains. Four are chosen, in order of seniority. But before the dressing room had a chance to decide this year, Barca acted to remove Ter Stegen as captain, as they no longer view him as a valid option.\nBarca sources say they are convinced Ter Stegen has decided to take a stand around his injury, using it as a way of defending himself and his current contract. They see his decision not to sign as a selfish one, one that damages the prospects of a colleague in the dressing room.\nFor that reason, they decided to act, with the club’s legal department now assessing the request for a disciplinary case to be opened. Barca’s statement on Thursday said the measure of removing Ter Stegen as captain was “temporary”.\nWhat about Ter Stegen’s view?\nTer Stegen’s camp confirmed to The Athletic that he refused to sign off on his consent to send the surgery reports to La Liga. The 33-year-old is entitled to do so and he has the support of Spanish football’s players’ union on the subject.\nAdvertisement\nThose close to the ’keeper said they view the action of sending his medical documents to La Liga as effectively agreeing to label his injury as a long-term problem, when they believe it is not. They underlined Ter Stegen’s desire to recover from his back issue as quickly as possible and challenge to be Barca’s No 1.\nTer Stegen feels he has plenty of reasons to be angry at Barca, dating back to before this issue of his missing signature (and even before the signing of Garcia). This includes an effort to discredit his position as captain and standing with fans through a series of articles in local media that were seen as a concerted effort to create a narrative that he was now expendable following Garcia’s signing, thus applying pressure on him to leave.\nHowever, boardroom sources at Barca say that after the start of pre-season on July 13, the club assumed Ter Stegen would most likely stay this summer and that a transfer would be ruled out.\nTer Stegen has three years remaining on his latest Barca contract, which was signed two years ago under Laporta, and the player is determined to stay.\nWith Garcia set to start the season in goal for Barca — so long as his registration can be arranged — Ter Stegen is confident he can eventually earn his place back. The source close to him pointed out that many other players have gone through the situation he is now facing, emerging as important figures in the side.\nFrenkie de Jong — who was threatened with legal action by Barca as the club sought to move him on in 2022 — is a clear example of that. Raphinha also found himself under pressure to leave last year but stayed and was a key player as the team won the domestic treble in 2024-25.\nTer Stegen does not believe he can be blamed for Barcelona’s registration problems. Barca were already spending above their salary limit set by La Liga before the start of the summer, and since then they have added Garcia, Wojciech Szczesny and Marcus Rashford to the first team. They all still need to be registered. On top of that, the club pursued the signing of Nico Williams, who had a €58million release clause with Athletic Club.\nAdvertisement\nIt should also be noted that in the last two contract extensions he signed, in 2021 and 2023, Ter Stegen agreed to defer his salary in order to facilitate things for the club when it came to registrations.\nWhat’s the mood in the dressing room?\nThe news that Ter Stegen was being stripped of the captaincy caused shock in the Barca dressing room. Sources consulted for this article said players and backroom staff were not consulted and they found out on social media. Nobody in the first team unit was notified about any potential vote on next season’s captains taking place any time soon, either. Barca’s statement on Thursday said Ronald Araujo would be promoted to captain.\nBarca’s players arrived at the training facilities on Thursday morning ready to face a day of double sessions. Ter Stegen also drove to the training ground before heading out an hour later without taking part in any sessions, as he is still recovering from last week’s surgery.\nBefore the morning session, no vote on the captaincy was held and the team conducted training as normal. Players went home after that to rest ahead of the afternoon session. It was during that break that the vast majority of the squad found out about the news.\nTer Stegen, however, does feel satisfied and reassured by seeing the support of his team-mates during the pre-season tour. His camp believes the Barca dressing room is used to seeing situations like this in recent years, and that this won’t impact his relationship with the team.\n“For me, Ter Stegen is the captain of this team,” said De Jong last week in the mixed zone after Barcelona beat FC Seoul 7-3.\n“Ter Stegen is a Barca legend and he has to be respected. He is our first captain and was chosen because of the way he is,” added Gavi in an interview with the radio station RAC1.\n“For me, Ter Stegen should be the captain,” said Raphinha, speaking to Mundo Deportivo. “But in the end, it might not depend on us, I don’t know.”\n(Top photo: Joan Valls/Urbanandsport/NurPhoto via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6462296/2025/07/16/lamine-yamal-lionel-messi-ansu-fati-no-10/",
      "text": "Barcelona have finally confirmed that Lamine Yamal will take up the club’s iconic No 10 shirt — another landmark moment in his brilliant, burgeoning career.\nYamal, who turned 18 on Sunday, inherits the number from his good friend Ansu Fati, who had it for the last three years but left it behind on July 1 when joining Monaco on loan. There’s no prize for knowing who had it before Fati: Lionel Messi.\nAdvertisement\nIt is a symbolic moment sure to be greeted with excitement by Barca fans, and the process has been carefully managed. The decision has been a mutual one between Yamal and Barcelona, with both parties feeling this was the right moment.\nFrom Yamal’s side, it’s fair to say he’s felt like the household name at Barca for a while now. However, he requested not to be handed the No 10 with Fati still at the club. The two have been close since Yamal’s days at La Masia, and as long as Fati, 22, represented Barca, he did not want to take his number.\nThen came another request from the Yamal camp for Barca to wait until his 18th birthday before revealing his new number officially. Barca’s original plan was to announce it when launching the sale of their new kit for 2025-26. Instead, Yamal’s new shirt was only available to pre-order when that happened, with delivery to follow once the “mystery” of his number for the season was made known.\nBarca will expect a considerable boost in kit sales to follow. They have their best player linked to their most iconic shirt number, just after signing a new long-term contract. Having secured arguably the game’s most exciting talent for the foreseeable future, they want to celebrate it and reap the rewards.\nDespite all the waiting, this has felt inevitable for some time. After Yamal’s breakout performances at the European Championship with winners Spain last summer, when he was named young player of the tournament, his dizzying progress has shown no signs of slowing.\nHe won La Liga and the Copa del Rey this season, he shone on the biggest stage in the Champions League semi-finals against Inter, he signed a new contract to become one of Barca’s highest earners and he has become a Ballon d’Or contender.\nNow he is taking the shirt that Messi wore. There’s a weight that comes with that. It means inevitable comparisons with the player who scored 709 goals in 837 games for Barca. It is a blessing and a curse.\n“I don’t want to compare myself with anyone and even less with Messi,” said Yamal at a pre-match press conference back in April, when he also revealed he was yet to meet the Argentinian in person since his Barca breakout.\n“I try to follow my own path,” he added. “Obviously, I look up to him as the best footballer ever, but I don’t make the comparison.”\nThe pressure at Barcelona is, and always will be, off the charts, no matter what state the club are in and regardless of the number on your back. Messi is, by a distance, the most iconic bearer of Barcelona’s No 10, but even for him there was weight to take on.\nAdvertisement\nJust before Messi there was Ronaldinho. The Brazilian followed illustrious countrymen Rivaldo and Romario. Before them, Diego Maradona wore it. We are talking about a sort of football royalty here, but most importantly in Barcelona’s case, these are players with an important thing in common. They all lifted the mood at every level of the club.\nSince Messi’s traumatic departure in 2021, nobody has raised the spirits at Barca like Yamal.\nThat doesn’t mean there’s no concern around the situation. Those who believe Yamal should remain protected from further demands — be they emotional, mental or physical — only have to point to what happened with Fati, even if there are key differences.\nWhen Fati was handed the No 10 shirt in 2021, he had played just 31 league games across two seasons after coming through La Masia. He was only 18 but a series of impressive performances showed the potential of a world-class talent. Four years, four surgeries and multiple injuries later, he has left Barca on his second loan spell in three seasons. He departed, hoping to feel like an elite player again.\nPurely in footballing terms, Yamal has achieved levels beyond what Fati managed in his early days with the first team. Since his debut two years ago, he’s already played 106 matches. With Barca, he’s won three major titles — and he’s an established star with Spain.\nWhen Messi left Barcelona, there was a huge gap to fill. You could easily make the case that Fati was taking that shirt on at the worst possible time. The circumstances are different for Yamal. Parallels will still be drawn, but at a certain distance.\nThe comparisons with Messi are on the whole not helpful but also standing in Yamal’s favour is this: the handling of his rise bears several similarities to how Barcelona managed Messi’s breakthrough back in the day. It is quite different to the Fati case.\nAdvertisement\nMessi made his first-team debut aged 17 in October 2004, but it wasn’t until the year after that he spent his first full season with Frank Rijkaard’s squad. He spent two further campaigns with the first team wearing Nos 30 and 19, while growing under the wing of Ronaldinho. When, in summer 2008, Pep Guardiola landed as manager and Ronaldinho left to join Milan, Messi was given the No 10. Aged 21, he had made 110 appearances.\nYamal has featured in four fewer games for Barca — but his playing time in those matches amounts to about 200 more minutes. The difference in age is what makes his case so frighteningly impressive. He was 15 years and 290 days old when he made his debut in April 2023 — becoming the club’s youngest player in La Liga history. Once the new season starts, he will be taking on Messi’s mantle aged 18.\nIndividually, he’s achieved and shown arguably more than what Barca had seen of Messi in 2008. Wearing the No 10 had to happen sooner than later and he has already shown he can thrive under the pressure.\nNow begins another new chapter in the long-term mission the teenager has set for himself.\n“I want Barca to win and to be among the best in business,” Yamal said at that press conference back in April.\n“You can see that feeling in our team, it’s a dream for us and it has a lot to do with our performance this season. We remember when the club won the Champions League in 2015 and we don’t only play because that’s our job — we also feel the colours of this football club.\n“Fear while playing the game? I left all my fears in the park of my neighbourhood, back in Mataro, a while ago.”\n(Top image: Joan Gosa/Xinhua via Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6473318/2025/07/04/barcelona-nico-williams-athletic-club-transfer-collapsed/",
      "text": "Nico Williams’ transfer to Barcelona broke down because the player wanted an exit clause inserted into his contract in case they could not register him — and the Catalan club refused.\nWith key personal terms already verbally agreed, the deal was sunk when the 22-year-old’s representatives made the request and Barcelona’s sporting director Deco said the club would not sanction it, despite having done so with other signings in the recent past, including Dani Olmo.\nAdvertisement\nWilliams’ camp wanted a guarantee that Barca would be able to register him to be eligible to play by August 20, just after the first La Liga matchday of 2025-26. Barca have often struggled to register new signings in time for the season start in recent years — with Olmo’s only secured thanks to a court ruling last term.\nThis development, late on Thursday, was just one of several twists in a long-running transfer saga, one that significantly raised the temperature in an already tense relationship between Barca and Athletic Club. Williams himself, meanwhile, faced personal abuse and recrimination as negotiations brought him to the brink of a €58million move (£50m; $68.3m) — before it ultimately all collapsed.\nWhen news emerged of Williams’ decision to commit to a new 10-year contract at Athletic on Friday morning, with a higher release clause, it caused shock among several members of the Barca first team, some of whom are among Williams’ best friends in the game. Club senior executives found out about the news through social media, with Athletic’s video announcing the deal hastily filmed with Williams the night before.\nIt was a truly dramatic turnaround that appeared to many to come out of nowhere.\nHere, informed by sources at Athletic and Barca, as well as those close to the player (all of whom requested to contribute anonymously so they could speak freely), is the full story behind what happened.\nBarcelona first came in for Williams last summer. Athletic were unhappy with their interest.\nWilliams had that €58million release clause in his contract so, after starring in Spain’s European Championship victory, there would always be suitors but the Basque club could not get their heads around how Barca, with their troubled finances, could be in a position to take away their most precious talent.\nAdvertisement\nUltimately, Williams stayed at Athletic. Barcelona signed Dani Olmo in a €60million deal with RB Leipzig. And the complications they had getting Olmo registered would play a key part in what happened between Williams and Barca this week.\nLast season, Olmo was only registered in time to play in La Liga over 2024-25 because Barca took advantage of a loophole in the rules.\nBecause Barca were spending more than they were allowed to on wages (they were breaking La Liga’s salary limit, which are calculated for each club according to their income) the competition body restricted their registration of new signings.\nHowever, Barca managed to get Olmo registered because of a regulation that allows clubs cover for injured players. With Andreas Christensen ruled out, they replaced his registration with Olmo’s — temporarily.\nThat emergency measure was valid only until January, when more drama unfolded. When Christensen returned, with Barca still in breach of La Liga’s salary rules, La Liga de-registered Olmo.\nAn unprecedented move then followed. Barca had the situation overturned via a Spanish government intervention. It did not escape Athletic’s attention.\nOn January 8, Athletic and Barca were about to face each other in the Supercopa de Espana semi-final in Saudi Arabia when Joan Laporta and his team received confirmation that Olmo (and Pau Victor, who was in the same boat) would now be eligible to play.\nSeeing the Barca president boasting and celebrating that decision in the executive box during the game is a scene that has been stuck in the minds of several members of Athletic’s board.\nWhen Olmo joined Barca, a clause was inserted into his contract allowing him to leave for free if Barca failed to register him. When he was de-registered by La Liga in early January, he could have decided to activate it. He could have left for nothing.\nAdvertisement\nHe decided to stay, and Barca were ultimately able to get him back into the squad. Because of the government ruling, made by Spain’s Higher Sports Council (Consejo Superior de Deportes), Olmo is now registered for the duration of his contract, which runs until 2030.\nOther players signed by Barcelona in recent years have had a similar clause included in their contracts. They include Ilkay Gundogan when he arrived shortly before Olmo in 2024, and Jules Kounde, who transferred from Sevilla in 2022.\nBarcelona’s summer transfer windows have been beset with problems over the registration of new players since that year, and La Liga president Javier Tebas said on Tuesday that Barca are still not compliant with their spending rules. New signing Joan Garcia has not yet been registered.\nThis is where we come back to Williams.\nAt the start of June, Barcelona approached Liverpool to discuss the signing of Luis Diaz. Their interest was rebuffed, but news of that move encouraged the Williams camp to reach Barca and ask if they were willing to discuss his signing instead.\nThe Catalans agreed to put Williams as their top priority, as senior figures including president Laporta saw it as a humbling gesture from the 22-year-old winger. Before that, Laporta had been against the idea of trying again for Williams because he believed he did not show enough commitment last summer when Barca were keen.\nWilliams’ agent met with Barcelona officials on June 13 to communicate that the winger would be willing to join them, assuming registration in La Liga could be guaranteed. Ten days later, Deco said in an interview with La Vanguardia they were interested in Williams, and that they would try to complete his signing.\nBy June 23, Williams himself told Athletic of his intentions to join Barca. Athletic reacted by releasing a club statement on June 26, complaining about Barca officials openly speaking about signing their player. It detailed how Jon Uriarte, the Athletic president, met with La Liga counterpart Tebas to request that the competition body scrutinise Barca’s standing with the salary limit rules.\nAdvertisement\n“Athletic Club want to thank La Liga for their availability and clarity shown in a meeting that took place yesterday,” the statement read.\n“Among the subjects discussed was Barcelona’s capacity for signing new players. Athletic Club had a legitimate interest after sporting director Deco publicly recognised they will try to sign one of our players who is under contract until 2027.”\nBarcelona didn’t appreciate that, and Laporta spoke at a public event that same week, urging Athletic to “respectfully, take care of their own business and not look into others”.\nIn this tense atmosphere, negotiations between Williams and Barca continued.\nThe €58million release clause, to be paid in one instalment, was not a problem according to Barca sources. They said the money was prepared but the fee would not be paid after June 30 — when the financial year ends in Spain.\nBarca planned to count Williams’ signing on next season’s budget, but before paying his release clause they needed the player’s full consent. In Spain, the procedure with the payment of release clauses forces the player in question, or their representatives, to deposit the money at La Liga’s headquarters in Madrid.\nWilliams and Barcelona have been in talks over the past week to reach this point and they failed to do so, ultimately because of the exit clause. The player’s camp insisted on including one, and stressed that they had other clubs such as Bayern Munich, Arsenal and Athletic Club willing to offer a suitable deal.\nDeco rejected the request. He promised Williams’ representatives, on his word, that the winger would be successfully registered by the end of the summer transfer window, but he did not want to risk the disaster of losing a €58million asset for free.\nSources with knowledge of the situation said Deco suffered a lot last season with the Olmo registration saga and it was something he was not willing to go through with the Williams deal. Further to this, Barcelona sources said they felt the club had already shown good grace by returning to speak with Williams after their experience last summer.\nAdvertisement\nStill, on Wednesday night, Barca’s board members were still confident the deal would go through. They believed Williams’ wish to join them would smooth the issues being discussed.\nThey were wrong.\nLo que más pesa es el corazón ❤️#AthleticWIN #AthleticClub 🦁 pic.twitter.com/do1QvtqYbP\n— Athletic Club (@AthleticClub) July 4, 2025\nOn Thursday evening, Williams was back in Bilbao, having returned from holiday. There, he was filmed for the social media content that would announce his contract extension with Athletic.\nLate that night, the club prepared a trip to a mural of the Williams brothers in the city. Nico’s portrait had been defaced three times over the last three weeks — with Athletic having it redone each time. In the footage, Williams writes the word ‘WIN 2035’ in spray paint on a wall that was recently vandalised with insults. Athletic had it removed straight after the recording so as not to hint at any developments before their public announcement.\nBarcelona executives learnt about Williams’ decision to stay at Athletic through this video on social media. So too did the vast majority of their players. Some of them could not understand what had happened, as Williams’ imminent arrival was taken for granted — conversations about what shirt number he would take had already been held.\nAthletic had been sounding Williams out over an extension for months. With this new contract, he becomes the best-paid player in their history — with a salary in the region of €10million a year, after tax. That is significantly more than what Barcelona offered, although Athletic have a favourable platform in that regard.\nThe Basque Country, and specifically the Bizkaia province of which Bilbao is the capital, has its own rules when it comes to taxation on footballer’s salaries. Athletes benefit from a reduced rate as the local government considers their working years shorter than any other regular worker.\nEduard Romeu, a former financial vice president at Barcelona under Laporta, spoke about it last week in an interview with local radio station RAC1: “With their taxation rules compared to the ones in Catalonia, Nico Williams would be 40 per cent more expensive for Barcelona than he is for Athletic Club,” he said.\nAdvertisement\nBut the Williams transfer saga is now over, and Barca must think about what to do next. Club figures expect them to return to their initial plan for bolstering the left-wing role: Diaz and Marcus Rashford set to be discussed.\nDiaz is Deco’s preferred option and will surely become a top priority for the sporting director — although the financial dimension, among other elements, can be expected to be difficult.\nRashford would be a more affordable option, with Manchester United looking to offload him. The 27-year-old also favours a move abroad and Barca sources believe he’d be willing to join either on loan and on a reduced salary, potentially.\nEither way, significant action can be expected from Barcelona soon. They need to find new momentum after this latest setback.\n(Top photos: Getty Images; design: Eamonn Dalton/The Athletic)"
    }
  ],
  "argos_summary": "Barcelona is set to begin their La Liga title defense against Mallorca, with high expectations for the season following a domestic treble last year. The club has strengthened its squad with new signings, including goalkeeper Joan Garcia and forward Marcus Rashford, while also hoping for the return of key players from injury. However, concerns remain about their defensive record and the ongoing situation with goalkeeper Marc-André ter Stegen, who was stripped of his captaincy amid a dispute over his injury status, complicating the registration of new players.",
  "argos_id": "949D8EZLH"
}