{
  "url": "https://www.techrepublic.com/article/news-google-chrome-purchase-offer-perplexity/",
  "authorsByline": "Aminu Abdullahi",
  "articleId": "95defb5315ce47e9af2ec4dbd24fe3d9",
  "source": {
    "domain": "techrepublic.com",
    "location": {
      "country": "us",
      "state": "KY",
      "county": "Jefferson County",
      "city": "Louisville",
      "coordinates": {
        "lat": 38.2542376,
        "lon": -85.759407
      }
    }
  },
  "imageUrl": "https://assets.techrepublic.com/uploads/2025/04/tr_20240802-google-lens-ai-chrome-desktop.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T03:57:52+00:00",
  "addDate": "2025-08-13T04:05:03.607616+00:00",
  "refreshDate": "2025-08-13T04:05:03.607617+00:00",
  "score": 1.0,
  "title": "$34.5B Google Chrome Purchase Offer Shocker From AI Startup",
  "description": "Many see Perplexity’s bid to buy Google’s Chrome browser as a strategic statement rather than a likely transaction.",
  "content": "AI-powered search startup Perplexity has made an audacious $34.5 billion offer to buy Google’s Chrome browser, a bid that far exceeds the company’s own $18 billion valuation.\n\nThe unsolicited proposal comes as Google faces mounting pressure from US regulators to loosen its grip on the search market. Last year, a federal judge ruled that Google illegally monopolized online search, and the US Department of Justice (DOJ) has suggested that selling Chrome could help level the playing field.\n\nPerplexity confirmed to The Wall Street Journal that multiple large venture capital funds have agreed to finance the deal in full. The startup said the proposal is “designed to satisfy an antitrust remedy in highest public interest by placing Chrome with a capable, independent operator,” per The Journal’s report.\n\nEstimates of Chrome’s market value range between $20 billion and $50 billion, making Perplexity’s $34.5 billion bid a competitive, though still ambitious, offer.\n\nThe offer lands at a delicate time for Google. US District Judge Amit Mehta is reviewing potential remedies after ruling last year that the search giant illegally monopolized the online search market. One option under consideration is forcing Google to divest Chrome.\n\nIn a filing, the DOJ said divesting Chrome would “permanently stop Google’s control of this critical search access point and allow rival search engines the ability to access the browser that for many users is a gateway to the internet.”\n\nChrome is no small asset; the browser has roughly 3.5 billion users and dominates more than 60% of the global market, according to industry estimates. Judge Mehta is expected to announce his decision this month.\n\nBrowsers have become key battlegrounds in the AI era; they not only control access to search traffic but also generate valuable user data for advertising and personalization. Both OpenAI and Yahoo have reportedly expressed interest in Chrome should it hit the market.\n\nGoogle has given no indication it’s willing to sell Chrome. In earlier testimony, Google CEO Sundar Pichai argued that being forced to divest the browser or share data with rivals would “harm Google’s business” and pose “security risks.”\n\n“It’s very possible that [Judge Mehta] would hold off on requiring a sale until the appeals process is worked out,” Herbert Hovenkamp, a professor at the University of Pennsylvania Carey Law School, told Reuters.\n\nMany see Perplexity’s bid as a strategic statement rather than a likely transaction, aimed at signaling to the court and the public that a motivated buyer exists if regulators demand a sale. Such a public offer also keeps Perplexity in the spotlight at a time when AI firms are vying for influence, partnerships, and market share.\n\nThis isn’t the first time Perplexity has made a high-profile acquisition attempt. Earlier this year, the startup reportedly explored a merger with TikTok amid concerns over the app’s Chinese ownership.\n\nPerplexity has also been expanding its own products, recently launching an AI-powered browser called Comet. But acquiring Chrome would instantly give it access to billions of users, something that could supercharge its competition with AI rivals like OpenAI.\n\nDuring Google’s antitrust trial, ChatGPT product lead Nick Turley stated OpenAI would be interested in buying Chrome and creating an “AI-first” browsing experience.",
  "medium": "Article",
  "links": [
    "https://technologyadvice.com/privacy-policy/",
    "https://www.wsj.com/tech/perplexity-ai-google-chrome-offer-5ddb7a22?mod=tech_lead_story",
    "https://www.reuters.com/business/media-telecom/ai-startup-perplexity-makes-bold-345-billion-bid-googles-chrome-browser-2025-08-12/",
    "https://www.techrepublic.com/article/news-google-chrome-buyers/",
    "https://technologyadvice.com/terms-conditions/",
    "https://www.techrepublic.com/article/news-openai-interest-buying-google-chrome/",
    "https://www.techrepublic.com/article/news-perplexity-ai-browser-comet/",
    "https://www.courtlistener.com/docket/18552824/1062/united-states-of-america-v-google-llc/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Chrome",
      "weight": 0.083634056
    },
    {
      "name": "Google",
      "weight": 0.07832391
    },
    {
      "name": "Google CEO Sundar Pichai",
      "weight": 0.075929604
    },
    {
      "name": "online search",
      "weight": 0.07047113
    },
    {
      "name": "search traffic",
      "weight": 0.06833693
    },
    {
      "name": "rival search engines",
      "weight": 0.068060614
    },
    {
      "name": "AI Startup",
      "weight": 0.06776297
    },
    {
      "name": "Google’s Chrome browser",
      "weight": 0.06707633
    },
    {
      "name": "US District Judge Amit Mehta",
      "weight": 0.06681003
    },
    {
      "name": "valuable user data",
      "weight": 0.064688206
    }
  ],
  "topics": [
    {
      "name": "AI"
    },
    {
      "name": "Startups"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98193359375
    },
    {
      "name": "/News/Technology News",
      "score": 0.955078125
    },
    {
      "name": "/Science/Computer Science/Machine Learning & Artificial Intelligence",
      "score": 0.451416015625
    }
  ],
  "sentiment": {
    "positive": 0.11261806,
    "negative": 0.44011635,
    "neutral": 0.44726554
  },
  "summary": "AI-powered search startup Perplexity has made an offer to buy Google's Chrome browser for $34.5 billion, exceeding the company's $18 billion valuation. This comes as Google faces pressure from US regulators to loosen its grip on the search market. The Department of Justice has suggested that selling Chrome could help level the playing field. Perplexic confirmed that multiple large venture capital funds have agreed to finance the deal in full. The company's proposal is designed to satisfy an antitrust remedy by placing Chrome with a capable, independent operator. Chrome, which has roughly 3.5 million users and dominates over 60% of the global market, is estimated to be worth between $20 billion and $50 billion.",
  "shortSummary": "Perplexity offers $34.5 billion to buy Google Chrome, aiming to satisfy antitrust demands and boost competition with AI rivals like OpenAI.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "efb3b913cf7145e9826bf77becd8441c",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.courtlistener.com/docket/18552824/1062/united-states-of-america-v-google-llc/",
      "text": "UNITED STATES OF AMERICA v. GOOGLE LLC\nNotice (Other) — Document #1062\nDistrict Court, District of Columbia\nDescription\nNOTICE of Plaintiffs' Initial Proposed Final Judgment by UNITED STATES OF AMERICA (Attachments: # 1 Text of Proposed Order)(Herrmann, Karl) (Entered: 11/20/2024)\nCase 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 1 of 23 IN THE UNITED STATES DISTRICT COURT FOR THE DISTRICT OF COLUMBIA UNITED STATES OF AMERICA, et al., Plaintiffs, Case No. 1:20-cv-03010-APM v. HON. AMIT P. MEHTA GOOGLE LLC, Defendant. STATE OF COLORADO, et al., Plaintiffs, Case No. 1:20-cv-03715-APM v. HON. AMIT P. MEHTA GOOGLE LLC, Defendant. EXECUTIVE SUMMARY OF PLAINTIFFS’ PROPOSED FINAL JUDGMENT Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 2 of 23 I. Introduction For more than a decade, Google has unlawfully maintained its monopolies in general search services and search text advertising through a web of anticompetitive practices. As this Court found after a lengthy trial, “Google is a monopolist, and it has acted as one to maintain its monopoly” over both the general search services and search text advertising markets. See Mem. Op., United States et al. v. Google LLC, 20-cv-3010 (APM), ECF No. 1032 (“Op.”), at 4. Google has manipulated its control of Chrome and Android to benefit itself, while sharing monopoly profits under conditions to induce third parties across the ecosystem to help Google maintain its monopolies. Google’s exclusionary conduct has, among other things, made Google the near- universal default for search and ensured that virtually all search access points route users’ valuable queries and interaction data to Google. Google’s unlawful behavior has deprived rivals not only of critical distribution channels but also distribution partners who could otherwise enable entry into these markets by competitors in new and innovative ways. Google’s conduct has resulted in significant anticompetitive effects—causing “market foreclosure,” “preventing rivals from achieving scale,” and “diminishing the incentives of rivals to invest and innovate.” Op. at 216. The Court’s opinion describes the decade-long harm Google inflicted on the markets for general search and search text advertising and the depths of that harm. At the same time, it also provides a roadmap to the components necessary to restore competition to these markets that have “revolutionized how we live” and how search advertisers reach potential customers. Id. at 1. While following that map requires a comprehensive remedy, making those changes would unleash a significant opportunity for existing competitors and innovative technologies to offer consumers who use general search services and the advertisers who sell to them meaningful choices and competitive rates for the first time in over a decade. Plaintiffs’ proposed remedy is 1 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 3 of 23 grounded in longstanding precedent demanding robust remedies for monopolization. Having found a violation of the law, courts are empowered to “prevent future violations and eradicate existing evils.” United States v. Microsoft Corp., 253 F.3d 34, 101 (D.C. Cir. 2001) (quoting United States v. Ward Baking Co., 376 U.S. 327, 330–31 (1964)). Any remedy requires a “comprehensive” and “unitary framework” to restore competition with provisions “intended to complement and reinforce each other.” See New York v. Microsoft Corp., 531 F. Supp. 2d 141, 170 (D.D.C. 2008). And a remedy for Google’s unlawful monopolization must simultaneously (1) unfetter these markets from Google’s exclusionary conduct, (2) pry them open to competition, (3) deny Google the fruits of its statutory violations, and (4) prevent Google from monopolizing these and related markets in the future. See Microsoft, 253 F.3d at 103 (quoting Ford Motor Co. v. United States, 405 U.S. 562, 577 (1972) and United States v. United Shoe Mach. Corp., 391 U.S. 244, 250–51 (1968)); see also Zenith Radio Corp. v. Hazeltine Rsch., Inc., 395 U.S. 100, 132–33 (1969) (antitrust remedies can extend to related markets); Int’l Boxing Club of N.Y., Inc. v. United States, 358 U.S. 242, 262 (1959) (same). The Proposed Final Judgment serves all of these ends. Plaintiffs’ proposed remedy is also grounded in the market realities of general search services and search text advertising as we find them today. As the Court found, Google’s illegal conduct contributes to a significant (and growing) scale gap that continues to exacerbate the harms found by the Court. Op. at 34. Search engines rely on user data to improve search quality—an outcome that drives more users to a search engine. Id. at 35. Users attract advertisers, and advertising dollars fund general search engines, creating a perpetual feedback loop that further entrenches Google. Id. at 230–31. Thus, Google’s exclusionary conduct has ensured not only that rivals are denied distribution but also that rivals are unlawfully 2 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 4 of 23 disadvantaged with respect to quality. Id. The playing field is not level because of Google’s conduct, and Google’s quality reflects the ill-gotten gains of an advantage illegally acquired. The remedy must close this gap and deprive Google of these advantages. Restoring competition to the markets for general search and search text advertising as they exist today will require reactivating the competitive process that Google has long stifled: The remedy must enable and encourage the development of an unfettered search ecosystem that induces entry, competition, and innovation as rivals vie to win the business of consumers and advertisers. To reach this goal, the remedy must address each of the ingredients necessary to create opportunities for competition to emerge. The promise of new technologies, including advances in artificial intelligence (“AI”), may present an opportunity for fresh competition. But only a comprehensive set of remedies can thaw the ecosystem and finally reverse years of anticompetitive effects. A successful remedy requires that Google: stop third-party payments that exclude rivals by advantaging Google and discouraging procompetitive partnerships that would offer entrants access to efficient and effective distribution; disclose data sufficient to level the scale-based playing field it has illegally slanted, including, at the outset, licensing syndicated search results that provide potential competitors a chance to offer greater innovation and more effective competition; and reduce Google’s ability to control incentives across the broader ecosystem via ownership and control of products and data complementary to search. Google’s ownership and control of Chrome and Android—key methods for the distribution of search engines to consumers—poses a significant challenge to effectuate a remedy that aims to “unfetter [these] market[s] from anticompetitive conduct” and “ensure that there remain no practices likely to result in monopolization in the future.” Microsoft, 253 F.3d at 103. To address these challenges, Google must divest Chrome, which has “fortified [Google’s] 3 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 5 of 23 dominance,” Op. at 33, so that rivals may pursue distribution partnerships that this “realit[y] of control,” id. at 159 (citations omitted), today prevents. As to Android—a critical platform on which search competitors rely and for which Google has myriad obvious and not-so-obvious ways to favor its own search products—there are two options: one that swiftly, efficiently, and decisively strikes at the locus of some anticompetitive conduct at issue here, and a second option that invites Court and Plaintiff oversight into longer-term behavioral remedies that may be more protracted and less certain due to Google’s conduct. The most straightforward solution—the first option—would be to divest Android, which would prevent Google from using Android to exclude rival search providers. But Plaintiffs recognize that such divestiture may draw significant objections from Google or other market participants. As an alternative to the divestiture of Android, Plaintiffs have presented behavioral remedies that would blunt Google’s ability to use its control of the Android ecosystem to favor its general search services and search text ad monopolies as well as limit Google’s ability to discriminate in favor of its own search and ads businesses. This alternative option would require vigilance and oversight by the Court and Plaintiffs; if such efforts ultimately fail to achieve the high standards for meaningful relief in these critical markets, the Court could require return to the first option. Google is further prohibited from owning or acquiring any interests in search rivals, potential entrants, and rival search or search ads-related AI products, and it must immediately divest any such interests it owns. Plaintiffs’ remedy proposal also ensures efficacy, efficiency, and administrability by deploying a Technical Committee to investigate and examine the issues that will invariably arise relating to Google’s implementation of the remedies, similar to the approach approved by the D.C. Circuit in United States v. Microsoft. See Massachusetts v. Microsoft Corp., 373 F.3d 1199, 4 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 6 of 23 1243–44 (D.C. Cir. 2004) (“[T]he Government’s ability to enforce the decree is clearly strengthened, not diminished, by the existence and composition of the Technical Committee”). Plaintiffs’ proposal also provides a streamlined path for the regular evaluation and modification often required of monopolization remedies, including the eventual divestiture of Android if Google chooses to retain ownership but persists in exploiting its control to the detriment of competition. United Shoe, 391 U.S. at 250–51. Moreover, the remedy must restore incentives for innovation and disruptive entry that Google’s conduct has—for over a decade—diminished. For example, in recent years “[t]he integration of generative AI is perhaps the clearest example of competition advancing search quality.” Op. at 41. AI has the ability to affect market dynamics in these industries today as well as tomorrow. The remedy must prevent Google from frustrating or circumventing the Court’s Final Judgment by manipulating the development and deployment of new technologies like query-based AI solutions that provide the most likely long-term path for a new generation of search competitors, who will depend on the absence of anticompetitive constraints to evolve into full-fledged competitors and competitive threats. II. The Proposed Final Judgment Guided by governing case law, and with these market realities and dynamics in mind, Plaintiffs respectfully submit the Initial Proposed Final Judgment (“PFJ”), which provides the Court with a comprehensive and unitary remedy to address the harms in the general search services and search text advertising markets, ensure that Google cannot further cement its monopolies by engaging in anticompetitive conduct, and prevent Google from circumventing the Court’s judgment. To that end, Plaintiffs propose a variety of interconnected and self-reinforcing remedies to: (1) stop and prevent exclusionary agreements with third parties; (2) prevent Google from self-preferencing through its ownership and control of search-related products; (3) prevent 5 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 7 of 23 Google from stifling or eliminating emerging competitive threats through acquisitions, minority investments, or partnerships; (4) disclose data critical to restoring competition; (5) increase transparency and control for advertisers; (6) end Google’s unlawful distribution; and (7) allow for the enforcement of the PFJ while preventing circumvention. Those remedies are summarized below for the Court’s convenience. Further, and to correct for the fact that Google’s unchecked monopolies have frozen the general search ecosystem for more than a decade, Plaintiffs’ proposed remedies run for a period of 10 years, with some exceptions as detailed below and in the PFJ. A. Stopping and Preventing Exclusionary Agreements with Third Parties An effective remedy must prevent Google from entering into contracts that foreclose or otherwise exclude competing general search engines and potential entrants, including by raising their costs, discouraging their distribution, or depriving them of competitive access to inputs. As detailed in Section IV, the PFJ prohibits Google from providing third parties something of value (including financial payments) in order to make Google the default general search engine or otherwise discouraging those third parties from offering competing search products. See Op. at 216 (finding “Google’s distribution agreements are exclusionary contracts that violate Section 2” and “clearly have a significant effect in preserving [Google’s] monopoly.”) (citations omitted). The PFJ also prohibits Google from entering exclusive agreements with content publishers; bundling, tying, or comingling its general search engine or search access points with any other Google product; entering revenue share agreements related to the distribution of general search services; or participating in investments in, collaborations with, or acquisitions of its competitors or potential competitors in the general search services or search text ads markets without prior approval of the United States. The proposed remedies are designed to end Google’s unlawful practices and open up the market for rivals and new entrants to emerge. 6 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 8 of 23 B. Prohibited Ownership And Control That Enables Self-Preferencing In order to safeguard against the possibility of further foreclosure and exclusion of rivals and potential entrants including via self-preferencing, the PFJ requires Google to divest Chrome. As the Court recognized, “Google’s near-complete control of the most efficient search distribution channels is a major barrier to entry,” and the Chrome default is “a market reality that significantly narrows the available channels of distribution and thus disincentivizes the emergence of new competition.” Op. at 159. Plaintiffs’ PFJ addresses this “realit[y] of control,” id., and will restore incentives to rivals and potential entrants to compete. Plaintiffs’ PFJ further provides that Google is prohibited from owning not only a browser—following its divestiture of Chrome it may not reenter the browser market for five years—but also from owning or acquiring any investment or interest in any search or search text ad rival, search distributor, or rival query-based AI product or ads technology. Google’s financial entanglements with current or future rivals risk compromising the proposed remedy. Investments in or acquisitions of potential rivals would stifle emerging competition or reduce their incentives to challenge Google. Such arrangements frustrate the PFJ’s remedial goals of fostering innovation and transforming the general search and search text ads markets over the next decade. Google must disclose any such investments it owns, immediately refrain from using these interests to discourage or disincentivize competing products, and must divest these holdings within six months. Plaintiffs’ PFJ also provides for further contingent structural relief—the divestiture of Android—if Plaintiffs’ proposed conduct remedies are not effective in preventing Google from improperly leveraging its control of the Android ecosystem to its advantage, or if Google 7 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 9 of 23 attempts to circumvent the remedy package. See, e.g., United Shoe, 391 U.S. at 249–51.1 Similar to United Shoe, Plaintiffs propose with respect to Android “that relatively mild remedies should be tried as a first resort, and that the possibility of more drastic measures should be held in abeyance.” Id. at 249. Indeed, in United Shoe, when the initially imposed behavioral remedies failed to establish the decree’s goal of “workable competition,” the Supreme Court ordered the district court to consider the government’s subsequent request to break the defendant into “two fully competing companies.” Id. at 247, 251–52 (“the time has come to prescribe other, and if necessary more definitive, means to achieve the result”). Alternatively, Google may also choose to divest Android at the outset in lieu of adhering to the requirements of Section V as they relate to Android. C. Conduct Remedies That Prevent Self-Preferencing An effective remedy must also ensure that Google cannot circumvent the Court’s remedy by providing its search products preferential access to related products or services that it owns or controls, including mobile operating systems (e.g., Android), apps (e.g., YouTube), or AI products (e.g. Gemini) or related data. As noted in Section V, the PFJ prohibits, among other things, Google from using any owned or operated asset to preference its general search engine or search text ad products. The PFJ further prohibits Google from engaging in conduct that undermines, frustrates, interferes with, or in any way lessens the ability of a user to discover a rival general search engine, limits the competitive capabilities of rivals, or otherwise impedes user discovery of products or services that are competitive threats to Google in the general search services or search text ads markets. Op. at 119–21, 210 (finding that Google’s contractual 1 As the Court in Microsoft recognized, “conduct remedies may be unavailing” in cases such as this, where “years have passed since [Google] engaged in the first conduct.” Microsoft, 253 F.3d at 49. 8 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 10 of 23 requirements that Chrome be preinstalled and the Google Search widget be placed on the home screen of all Android devices was an unlawful exclusive agreement). D. Restoring Competition Through Syndication And Data Access Data at scale is the “essential raw material” for “building, improving and sustaining” a competitive general search engine. Op. at 226 (finding that “Google’s exclusive agreements…deny rivals access to use queries, or scale, needed to effectively compete.”). Through its unlawful behavior, Google has accumulated a staggering amount of data over many years, at the expense of its rivals. Id. Plaintiffs’ PFJ aims to remedy this anticompetitively acquired advantage. As set forth in Section VI, the PFJ requires Google, among other things, to make its search index available at marginal cost, and on an ongoing basis, to rivals and potential rivals; and also requires Google to provide rivals and potential rivals both user-side and ads data for a period of ten years, at no cost, on a non-discriminatory basis, and with proper privacy safeguards in place. Section VI further requires that Google provide publishers, websites, and content creators with data crawling rights (such as the ability to opt out of having their content crawled for the index or training of large language models or displayed as AI-generated content). To remove barriers to entry and erode Google’s unlawfully gained scale advantages, Section VII requires Google to syndicate (subject to certain restrictions) its search results, ranking signals, and query understanding information for ten years. The PFJ only requires Google to syndicate queries that originate in the United States. Section VII also requires Google to syndicate its search text ads for terms of one year subject to certain restrictions. E. Restoring Competition By Improving Transparency And Reduction Of Switching Costs Google’s unlawful maintenance of its search text advertising monopoly has undermined advertisers’ choice of search providers, as well as rivals’ ability to monetize search advertising, 9 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 11 of 23 and has enabled “Google to profitably charge supracompetitive prices for search text advertisements” while “degrad[ing] the quality of its text advertisements” and the related services and reporting. Op. at 258–65 (finding “Google’s text ads products has degraded” and “advertisers receive less information in search query reports.”). As set forth in Section VIII, Plaintiffs’ PFJ will remedy these harms by providing advertisers with the information, options, and visibility into the performance and cost of Google Text Ads necessary to optimize their advertising across Google and its rivals. In particular, the PFJ requires Google to include fulsome and necessary real-time performance information about ad performance and costs in its search query reports to advertisers, and further requires Google to increase advertiser control by improving keyword matching options to advertisers. Op. at 263–64 (finding Google degraded SQR content and reduced control over keyword matching). The PFJ also prohibits Google from limiting the ability of advertisers to export search text ad data and information for which the advertiser bids on keywords, and further requires that Google provide to the Technical Committee and Plaintiffs a monthly report outlining any changes to its search text ads auction and its public disclosure of those changes. F. Limitations On Distribution And User Notifications To Restore Competition A comprehensive and unitary remedy in this case must also undo the effects on search distribution. See Op. at 3 (“[M]ost devices in the United States come preloaded exclusively with Google. These distribution deals have forced Google’s rivals to find other ways to reach users.”). To remedy these harms, the PFJ requires Google to divest Chrome, which will permanently stop Google’s control of this critical search access point and allow rival search engines the ability to access the browser that for many users is a gateway to the internet. In addition, the PFJ contains multiple provisions that will limit Google’s distribution of general search services by contract with third-party devices and search access points (e.g., Samsung 10 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 12 of 23 devices, Safari, Firefox) and via self-distribution on Google devices and search access points (e.g., Pixel) which will facilitate competition in the markets for general search services and search text advertising. These provisions are designed to end Google’s unlawful distribution agreements, ensure that Google cannot approximate its unlawful practices with updated contracts, and eliminate anticompetitive payments to distributors, including Apple. As set forth in Section IV, the PFJ prohibits Google from offering Apple anything of value for any form of default, placement, or preinstallation distribution (including choice screens) related to general search or a search access point. See Op. at 238, 240–44 (“Apple, a fierce potential competitor, remains on the sidelines due to the large revenue share payments it receives from Google”). As set forth in Section IX, for non-Apple distributors and third-party devices, the PFJ similarly prohibits—with limited exceptions—Google from offering anything of value for any form of default, placement, or preinstallation distribution (including choice screens) related to general search or a search access point. The PFJ further prohibits Google from preinstalling any search access point on any new Google device, and requires it to display a choice screen on every new and existing instance of a Google browser where the user has not previously affirmatively selected a default general search engine. The choice screens must be designed not to preference Google and to be accessible, easy to use, and minimize choice friction, based on empirical evidence of consumer behavior, among other requirements. User choice will be improved when consumers better understand the benefits that Google’s rivals can provide. For that reason, Colorado Plaintiff States have included a provision requiring Google to fund a nationwide advertising and education program. The fund’s purpose is to enhance the effectiveness of distribution remedies by informing users of the outcome of this 11 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 13 of 23 litigation and the remedies in the Final Judgment designed to increase user choice. The program may include short-term incentive payments to individual users as a further incentive to choosing a non-Google default on a choice screen. G. Administration, Anti-circumvention, and Anti-retaliation A remedy that prevents and restrains monopoly maintenance will require administration as well as protections against circumvention and retaliation, including through novel paths to preserving dominance in the monopolized markets. This is especially important in the types of markets implicated here. As set forth in Section X, Plaintiffs’ PFJ requires Google to appoint an internal Compliance Officer and establishes a Technical Committee to assist Plaintiffs and the Court in monitoring Google’s compliance. See United States v. Microsoft Corp., Civ. No. 98- 1232 (CKK), 2002 U.S. Dist. LEXIS 22864, at *22 (D.D.C. Nov. 12, 2002) (establishing a Technical Committee “to assist in enforcement of and compliance with this Final Judgment.”). This section of the PFJ provides Plaintiffs tools to investigate complaints about Google’s compliance and prohibits Google from taking retaliatory or circumventing actions. ⁕ ⁕ ⁕ Plaintiffs’ PFJ reflects extensive efforts to engage with market participants, utilize formal discovery, and collaborate with experts. Given that third-party outreach and discovery on Google are ongoing, Plaintiffs will continue to investigate and evaluate the remedies necessary to restore competition to the affected markets. Plaintiffs reserve the right to add, remove, or modify provisions of the PFJ as needed following further engagement with market participants and additional remedies discovery. Consistent with the Court’s scheduling order governing remedy proceedings, Plaintiffs will file a Revised PFJ on March 7, 2025. See ECF 1043 at 2. 12 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 14 of 23 Dated: November 20, 2024 Respectfully submitted, /s/ Karl E. Herrmann David E. Dahlquist Adam T. Severt Veronica N. Onyema (D.C. Bar #979040) Diana A. Aguilar Aldape Sarah M. Bartels (D.C. Bar #1029505) Travis R. Chapman Grant M. Fergusson (D.C. Bar #90004882) Meagan M. Glynn (D.C. Bar #1738267) R. Cameron Gower Karl E. Herrmann (D.C. Bar #1022464) Ian D. Hoffman Elizabeth S. Jensen Ryan T. Karr Claire M. Maddox (D.C. Bar #498356) Michael G. McLellan (D.C. Bar #489217) Ryan S. Struve (D.C. Bar #495406) Sara Trent Jennifer A. Wamsley (D.C. Bar #486540) Catharine S. Wright (D.C. Bar #1019454) U.S. Department of Justice Antitrust Division Technology & Digital Platforms Section 450 Fifth Street NW, Suite 7100 Washington, DC 20530 Telephone: (202) 805-8563 David.Dahlquist@usdoj.gov Adam.Severt@usdoj.gov Counsel for Plaintiff United States of America Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 15 of 23 By: /s/ Christoper A. Knight Brian Wang, Deputy Attorney General Ashley Moody, Attorney General Carolyn D. Jeffries, Deputy Attorney R. Scott Palmer, Special Counsel, Complex General (DC Bar No. 1600843) Enforcement Chief, Antitrust Division Office of the Attorney General Lee Istrail, Assistant Attorney General California Department of Justice Christopher A. Knight, Assistant Attorney 455 Golden Gate Avenue, Suite 11000 General San Francisco, California 94102 Office of the Attorney General, State of Cari.Jeffries@doj.ca.gov Florida PL-01 The Capitol Counsel for Plaintiff State of California Tallahassee, Florida 32399 Lee.Istrail@myfloridalegal.com Matthew M. Ford Scott.Palmer@myfloridalegal.com Arkansas Bar No. 2013180 Christopher.Knight@myfloridalegal.com Senior Assistant Attorney General Office of the Arkansas Attorney General Counsel for Plaintiff State of Florida Tim Griffin 323 Center Street, Suite 200 By: /s/ Diamante Smith Little Rock, AR 72201 Ken Paxton, Attorney General Matthew.Ford@arkansasag.gov Brent Webster, First Assistant Attorney General Counsel for Plaintiff State of Arkansas Ralph Molina, Deputy First Assistant Attorney General Christopher Carr, Attorney General James Lloyd, Deputy Attorney General for Logan B. Winkles, Deputy Attorney General Civil Litigation Ronald J. Stay, Jr., Senior Assistant Attorney Ryan Baasch, Associate Deputy Attorney General General for Civil Litigation Charles Thimmesch, Senior Assistant Trevor Young, Deputy Chief, Antitrust Attorney General Division Office of the Attorney General, State of Diamante Smith, Assistant Attorney Georgia General, Antitrust Division 40 Capitol Square, SW Office of the Attorney General, State of Atlanta, Georgia 30334-1300 Texas cthimmesch@law.georgia.gov 300 West 15th Street Austin, Texas 78701 Counsel for Plaintiff State of Georgia Diamante.Smith@oag.texas.gov Theodore Edward Rokita, Attorney General Counsel for Plaintiff State of Texas Scott L. Barnhart, Chief Counsel and Director, Consumer Protection Division By: /s/ Carolyn D. Jeffries Jesse Moore, Deputy Attorney General Rob Bonta, Attorney General Christi Foust, Deputy Attorney General Paula Blizzard, Senior Assistant Attorney Office of the Attorney General, State of General Indiana Michael Jorgenson, Supervising Deputy Indiana Government Center South, Fifth Attorney General Floor Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 16 of 23 302 West Washington Street Consumer Protection Section Indianapolis, Indiana 46204 Missouri Attorney General's Office Jesse.Moore@atg.in.gov 815 Olive Street | Suite 200 Saint Louis, Missouri 63101 Counsel for Plaintiff State of Indiana michael.schwalbert@ago.mo.gov Phone: 314-340-7888 Russell Coleman, Attorney General Fax: 314-340-7981 J. Christian Lewis, Commissioner of the Office of Consumer Protection Counsel for Plaintiff State of Missouri Philip R. Heleringer, Executive Director of the Office of Consumer Protection Lynn Fitch, Attorney General Jonathan E. Farmer, Deputy Executive Crystal Utley Secoy, Assistant Attorney Director of the Office of Consumer General Protection Office of the Attorney General, State of Office of the Attorney General, Mississippi Commonwealth of Kentucky P.O. Box 220 1024 Capital Center Drive, Suite 200 Jackson, Mississippi 39205 Frankfort, Kentucky 40601 Crystal.Utley@ago.ms.gov Philip.Heleringer@ky.gov Counsel for Plaintiff State of Mississippi Counsel for Plaintiff Commonwealth of Kentucky Anna Schneider Bureau Chief Liz Murrill, Attorney General Montana Office of Consumer Protection Patrick Voelker, Assistant Attorney General P.O. Box 200151 Office of the Attorney General, State of Helena, MT. 59602-0150 Louisiana Phone: (406) 444-4500 Public Protection Division Fax: 406-442-1894 1885 North Third St. Anna.schneider@mt.gov Baton Rouge, Louisiana 70802 voelkerp@ag.louisiana.gov Counsel for Plaintiff State of Montana Counsel for Plaintiff State of Louisiana Alan Wilson, Attorney General W. Jeffrey Young, Chief Deputy Attorney Dana Nessel, Attorney General General Scott Mertens, Assistant Attorney General C. Havird Jones, Jr., Senior Assistant Deputy Michigan Department of Attorney General Attorney General P.O. Box 30736 Mary Frances Jowers, Assistant Deputy Lansing, Michigan 48909 Attorney General MertensS@michigan.gov Office of the Attorney General, State of South Carolina Counsel for Plaintiff State of Michigan 1000 Assembly Street Rembert C. Dennis Building Michael Schwalbert P.O. Box 11549 Missouri Bar No. 63229 Columbia, South Carolina 29211-1549 Assistant Attorney General mfjowers@scag.gov Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 17 of 23 Counsel for Plaintiff State of South Carolina Joshua L. Kaul, Attorney General Laura E. McFarlane, Assistant Attorney General Wisconsin Department of Justice 17 W. Main St. Madison, Wisconsin 53701 mcfarlanele@doj.state.wi.us Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 18 of 23 PHILIP WEISER Attorney General of Colorado Counsel for Plaintiff State of Nebraska /s/ Jonathan B. Sallet KRISTIN K. MAYES Jonathan B. Sallet, DC Bar No. 336198 Attorney General of Arizona Steven M. Kaufmann Elizabeth W. Hereford Robert A. Bernheim, Unit Chief Counsel Conor J. May Jayme Weber, Senior Litigation Counsel Colorado Office of the Attorney General Arizona Office of the Attorney General 1300 Broadway, 7th Floor 400 West Congress, Ste. S-215 Denver, CO 80203 Tucson, Arizona 85701 Telephone: (720) 508-6000 Telephone: (520) 628-6507 E-Mail: Jon.Sallet@coag.gov E-Mail: Robert.bernheim@azag.gov Steve.Kaufmann@coag.gov Jayme.Weber@azag.gov Elizabeth.Hereford@coag.gov Conor.May@coag.gov Counsel for Plaintiff State of Arizona William F. Cavanaugh, Jr. BRENNA BIRD PATTERSON BELKNAP WEBB & Attorney General of Iowa TYLER LLP 1133 Avenue of the Americas Noah Goerlitz, Assistant Attorney General New York, NY 10036 Office of the Attorney General of Iowa Telephone: (212) 336-2793 1305 E. Walnut St., 2nd Floor E-Mail: wfcavanaugh@pbwt.com Des Moines, IA 50319 Telephone: (515) 725-1018 Counsel for Plaintiff State of Colorado E-Mail: Noah.goerlitz@ag.iowa.gov MIKE HILGERS Counsel for Plaintiff State of Iowa Attorney General of Nebraska LETITIA JAMES Colin P. Snider, Assistant Attorney Attorney General of New York General Nebraska Department of Justice Elinor R. Hoffmann Office of the Attorney General Morgan J. Feder 2115 State Capitol Michael D. Schwartz Lincoln, NE 68509 Office of the Attorney General of New Telephone: (402) 471-3840 York E-Mail: Colin.Snider@nebraska.gov 28 Liberty Street New York, NY 10005 William F. Cavanaugh, Jr. Telephone: (212) 416-8513 PATTERSON BELKNAP WEBB & E-Mail: Elinor.hoffmann@ag.ny.gov TYLER LLP Morgan.feder@ag.ny.gov 1133 Avenue of the Americas Michael.schwartz@ag.ny.gov New York, NY 10036 Telephone: (212) 336-2793 Counsel for Plaintiff State of New York E-Mail: wfcavanaugh@pbwt.com Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 19 of 23 JOSHUA STEIN Attorney General of North Carolina Counsel for Plaintiff State of Utah Kunal Janak Choksi TREGARRICK TAYLOR Joshua Daniel Abram Attorney General of Alaska Jessica Vance Sutton North Carolina Department of Justice Jeff Pickett 114 W. Edenton St. State of Alaska, Department of Law Raleigh, NC 27603 Office of the Attorney General Telephone: (919) 716-6000 1031 W. Fourth Avenue, Suite 200 E-Mail: kchoksi@ncdoj.gov Anchorage, Alaska 99501 jabram@ncdoj.gov Telephone: (907) 269-5100 jsutton2@ncdoj.gov E-Mail: Jeff.pickett@alaska.gov Counsel for Plaintiff State of North Counsel for Plaintiff State of Alaska Carolina WILLIAM TONG JONATHAN SKRMETTI Attorney General of Connecticut Attorney General of Tennessee Nicole Demers J. David McDowell Office of the Attorney General of Austin Ostiguy Connecticut Tyler Corcoran 165 Capitol Avenue, Suite 5000 Office of the Attorney General and Hartford, CT 06106 Reporter Telephone: (860) 808-5202 P.O. Box 20207 E-Mail: Nicole.demers@ct.gov Nashville, TN 37202 Telephone: (615) 741-8722 Counsel for Plaintiff State of Connecticut E-Mail: David.McDowell@ag.tn.gov austin.ostiguy@ag.tn.gov KATHLEEN JENNINGS Tyler.Corcoran@ag.tn.gov Attorney General of Delaware Counsel for Plaintiff State of Tennessee Michael Andrew Undorf Delaware Department of Justice SEAN REYES Fraud and Consumer Protection Division Attorney General of Utah 820 N. French St., 5th Floor Wilmington, DE 19801 Matthew Michaloski Telephone: (302) 683-8816 Marie W.L. Martin E-Mail: Michael.undorf@delaware.gov Utah Office of Attorney General 160 E 300 S, 5th Floor Counsel for Plaintiff State of Delaware P.O. Box 140830 Salt Lake City, Utah 84114 BRIAN SCHWALB Telephone: (801) 440-9825 Attorney General of the District of E-Mail: mmichaloski@agutah.gov Columbia mwmartin@agutah.gov Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 20 of 23 Elizabeth Gentry Arthur Office of the Attorney General for the Counsel for Plaintiff State of Idaho District of Columbia 400 6th Street NW KWAME RAOUL Washington, DC 20001 Attorney General of Illinois Telephone: (202) 724-6514 E-Mail: Elizabeth.arthur@dc.gov Elizabeth Maxeiner Brian Yost Counsel for Plaintiff District of Columbia Jennifer Coronel Office of the Attorney General of Illinois DOUGLAS MOYLAN 100 W. Randolph St. Attorney General of Guam Chicago, IL 60601 Telephone: (773) 590-7935 Fred Nishihira E-Mail: Elizabeth.maxeiner@ilag.gov Office of the Attorney General of Guam Brian.yost@ilag.gov 590 S. Marine Corps Drive, Suite 901 Jennifer.coronel@ilag.gov Tamuning, Guam 96913 Telephone: (671) 475-3324 Counsel for Plaintiff State of Illinois E-Mail: fnishihira@oagguam.org KRIS W. KOBACH Counsel for Plaintiff Territory Guam Attorney General of Kansas ANNE E. LOPEZ Lynette R. Bakker Attorney General of Hawai‘i Kansas Office of the Attorney General 120 S.W. 10th Avenue, 2nd Floor Rodney I. Kimura Topeka, KS 66612 Department of the Attorney General, State Telephone: (785) 296-3751 of Hawai‘i E-Mail: Lynette.bakker@ag.ks.gov 425 Queen Street Honolulu, HI 96813 Counsel for Plaintiff State of Kansas Telephone (808) 586-1180 E-Mail: Rodney.i.kimura@hawaii.gov AARON M. FREY Attorney General of Maine Counsel for Plaintiff State of Hawai‘i Christina M. Moylan RAÚL LABRADOR Office of the Attorney General of Maine Attorney General of Idaho 6 State House Station August, ME 04333 John K. Olson Telephone: (207) 626-8800 Office of the Idaho Attorney General E-Mail: Christina.moylan@maine.gov Consumer Protection Division 954 W. State St., 2nd Floor Counsel for Plaintiff State of Maine P.O. Box 83720 Boise, ID 83720 ANTHONY G. BROWN Telephone: (208) 332-3549 Attorney General of Maryland E-Mail: John.olson@ag.idaho.gov Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 21 of 23 Schonette J. Walker Nevada Office of the Attorney General Gary Honick 100 N. Carson Street Office of the Attorney General of Carson City, NV 89701 Maryland Telephone: (775) 684-1164 200 St. Paul Place, 19th Floor E-Mail: mbadorine@ag.nv.gov Baltimore, MD 21202 ltucker@ag.nv.gov Telephone: (410) 576-6480 E-Mail: swalker@oag.state.md.us Counsel for Plaintiff State of Nevada ghonick@oag.state.md.us JOHN FORMELLA Counsel for Plaintiff State of Maryland Attorney General of New Hampshire ANDREA CAMPBELL Brandon Garod Attorney General of Massachusetts Office of Attorney General of New Hampshire William T. Matlack 33 Capitol Street Office of the Attorney General of Concord, NH 03301 Massachusetts Telephone: (603) 271-1217 One Ashburton Place, 18th Floor E-Mail: Brandon.h.garod@doj.nh.gov Boston, MA 02108 Telephone: (617) 727-2200 Counsel for Plaintiff State of New E-Mail: William.matlack@mass.gov Hampshire Counsel for Plaintiff Commonwealth of MATTHEW PLATKIN Massachusetts Attorney General of New Jersey KEITH ELLISON Isabella R. Pitt Attorney General of Minnesota Deputy Attorney General New Jersey Attorney General’s Office Zach Biesanz 124 Halsey Street, 5th Floor Senior Enforcement Counsel Newark, NJ 07102 Office of the Minnesota Attorney General Telephone: (973) 648-7819 Antitrust Division E-Mail: Isabella.Pitt@law.njoag.gov 445 Minnesota Street, Suite 600 St. Paul, MN 55101 Counsel for Plaintiff State of New Jersey Telephone: (651) 757-1257 E-Mail: Zach.biesanz@ag.state.mn.us RAÚL TORREZ Attorney General of New Mexico Counsel for Plaintiff State of Minnesota Judith E. Paquin Cholla Khoury Assistant Attorney General AARON D. FORD New Mexico Office of the Attorney Attorney General of Nevada General 408 Galisteo St. Michelle C. Badorine Santa Fe, NM 87504 Lucas J. Tucker Telephone: (505) 490-4885 Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 22 of 23 E-Mail: jpaquin@nmag.gov Telephone: (405) 522-1014 ckhoury@nmag.gov E-Mail: Robert.carlson@oag.ok.gov Counsel for Plaintiff State of New Mexico Counsel for Plaintiff State of Oklahoma DREW WRIGLEY ELLEN ROSENBLUM Attorney General of North Dakota Attorney General of Oregon Elin S. Alm Cheryl Hiemstra Assistant Attorney General Oregon Department of Justice Consumer Protection and Antitrust 1162 Court St. NE Division Salem, OR 97301 Office of the Attorney General of North Telephone: (503) 934-4400 Dakota E-Mail: Cheryl.hiemstra@doj.state.or.us 1720 Burlington Drive, Suite C Bismarck, ND 58504 Counsel for Plaintiff State of Oregon Telephone: (701) 328-5570 E-Mail: ealm@nd.gov MICHELLE HENRY Attorney General of Pennsylvania Counsel for Plaintiff State of North Dakota Tracy W. Wertz Joseph S. Betsko DAVID YOST Pennsylvania Office of Attorney General Attorney General of Ohio Strawberry Square Harrisburg, PA 17120 Jennifer Pratt Telephone: (717) 787-4530 Beth Ann Finnerty E-Mail: jbetsko@attorneygeneral.gov Mark Kittel twertz@attorneygeneral.gov Office of the Attorney General of Ohio 30 E Broad Street, 26th Floor Counsel for Plaintiff Commonwealth of Columbus, OH 43215 Pennsylvania Telephone: (614) 466-4328 E-Mail: DOMINGO EMANUELLI Jennifer.pratt@ohioattorneygeneral.gov HERNANDEZ Beth.finnerty@ohioattorneygeneral.gov Attorney General of Puerto Rico Mark.kittel@ohioattorneygeneral.gov Guarionex Diaz Martinez Assistant Attorney General Antitrust Counsel for Plaintiff State of Ohio Division Puerto Rico Department of Justice GENTNER DRUMMOND P.O. Box 9020192 Attorney General of Oklahoma San Juan, Puerto Rico 00902 Telephone: (787) 721-2900, Ext. 1201 Robert J. Carlson E-Mail: gdiaz@justicia.pr.gov Office of the Oklahoma Attorney General 313 NE 21st Street Counsel for Plaintiff Territory Puerto Oklahoma City, OK 73105 Rico Case 1:20-cv-03010-APM Document 1062 Filed 11/20/24 Page 23 of 23 Richmond, VA 23219 PETER NERONHA Telephone: (804) 692-0485 Attorney General of Rhode Island E-Mail: thenry@oag.state.va.us Stephen Provazza Counsel for Plaintiff State of Virginia Rhode Island Office of the Attorney General ROBERT FERGUSON 150 South Main Street Attorney General of Washington Providence, RI 02903 Telephone: (401) 274-4400 Amy Hanson E-Mail: SProvazza@riag.ri.gov Senior Assistant Attorney General 800 Fifth Avenue, Suite 2000 Counsel for Plaintiff State of Rhode Island Seattle, WA 98104 Telephone: (206) 464-5419 MARTIN J. JACKLEY E-Mail: Amy.hanson@atg.wa.gov Attorney General of South Dakota Counsel for Plaintiff State of Washington Yvette K. Lafrentz Office of the Attorney General of South PATRICK MORRISEY Dakota Attorney General of West Virginia 1302 E. Hwy 14, Suite 1 Pierre, SD 57501 Douglas Lee Davis Telephone: (605) 773-3215 Office of the Attorney General, State of E-Mail: Yvette.lafrentz@state.sd.us West Virginia 1900 Kanawha Boulevard Counsel for Plaintiff State of South East Building 6, Suite 401 Dakota P.O. Box 1789 Charleston, WV 25305 CHARITY R. CLARK Telephone: (304) 558-8986 Attorney General of Vermont E-Mail: Douglas.l.davis@wvago.gov Christopher J. Curtis, Assistant Attorney Counsel for Plaintiff State of West Virginia General Office of the Attorney General of Vermont BRIDGET HILL 109 State St. Attorney General of Wyoming Montpelier, VT 05609 Telephone: (802) 828-3170 Amy Pauli E-Mail: christopher.curtis@vermont.gov Wyoming Attorney General’s Office Counsel for Plaintiff State of Vermont 2320 Capitol Avenue Kendrick Building JASON S. MIYARES Cheyenne, WY 82002 Attorney General of Virginia Telephone: (307) 777-6397 E-Mail: amy.pauli@wyo.gov Tyler T. Henry Office of the Attorney General of Virginia Counsel for Plaintiff State of 202 N. 9th Street Wyoming"
    }
  ],
  "argos_summary": "AI startup Perplexity has proposed a $34.5 billion bid to acquire Google's Chrome browser, significantly surpassing its estimated market value of $20 to $50 billion. This move comes amid ongoing antitrust scrutiny of Google, with regulators suggesting that divesting Chrome could enhance competition in the search market. Perplexity's offer is seen as a strategic statement to demonstrate a viable buyer exists if regulators mandate a sale, while Google has not indicated any willingness to sell.",
  "argos_id": "9ER6IEHVO"
}