{
  "url": "https://nypost.com/2025/08/12/real-estate/harlem-mansion-on-idyllic-block-featured-in-the-royal-tenenbaums-hits-the-market-for-5-5m/",
  "authorsByline": "Emily Davis",
  "articleId": "9badfd3307d3436899d55de547d494ce",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/1899-townhouse-filled-modern-upgrades-109506631.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:27:29+00:00",
  "addDate": "2025-08-12T17:29:35.372114+00:00",
  "refreshDate": "2025-08-12T17:29:35.372115+00:00",
  "score": 1.0,
  "title": "Harlem mansion on idyllic block featured in ‘The Royal Tenenbaums’ hits the market for $5.5M",
  "description": "It’s a five-story, $5.5 million townhouse fit for a Wes Anderson film.",
  "content": "A 25-foot-wide mansion on coveted Convent Avenue in Hamilton Heights has been listed for sale — and it’s just across the street from the beloved brownstone that appeared in Anderson’s 2001 twee tragicomedy “The Royal Tenenbaums.”\n\nThanks to its largely cohesive appearance and historic architecture, Convent Avenue, located between West 143rd and 144th Streets is regarded as one of the most beautiful streets in Manhattan.\n\nBuilt in 1899, the Romanesque Revival townhouse spans a comfortable 6,400 square feet of interiors and 2,175 square feet of outdoor space. Its gated garden leads into a marble entry foyer with detailed moldings and light wood paneling.\n\nMany of the home’s original details, including pocket doors between rooms and stained glass windows, have been well-maintained throughout the decades.\n\nThe property last changed hands for $2.2 million in 2006, according to city records. Douglas Elliman agents Jessica Chestler and Ben Jacobs currently hold the uptown listing.\n\nLike the “Tenenbaum” home across the way, this townhouse isn’t afraid of color. Bright living spaces span the home’s five floors, including a golden yellow great room and a floral, 20-seat dining room.\n\nSeveral of the public rooms boast bespoke fireplaces, including Victorian-era and antique French caved mantels.\n\nThe home’s neighborhood of Hamilton Heights, nestled in Northwestern Harlem, is rich in local history. Public figures like Alexander Hamilton, Duke Ellington, George Gershwin and Norman Rockwell once called the area home.\n\nDespite the abundance of interior details that hearken back to the home’s 19th-century roots, the residence hosts plenty of modern amenities. Its eat-in kitchen features granite countertops and upgraded appliances.\n\nUpper floors, accessed by a skylit staircase, include seven bedrooms, as well as a lacquer-red library with custom bookshelves and a period fireplace. The property also comes with the potential for some passive income, with a privately accessed studio apartment on the premises.",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/11/real-estate/jim-carrey-finds-buyer-for-longtime-la-estate-12m-price-cut/",
    "https://nypost.com/2025/08/11/real-estate/best-states-to-live-in-annual-ranking/",
    "https://nypost.com/2025/08/11/real-estate/mark-zuckerberg-angers-silicon-valley-locals-over-11-home-110m-compound/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "home",
      "weight": 0.07358578
    },
    {
      "name": "Hamilton Heights",
      "weight": 0.0735562
    },
    {
      "name": "coveted Convent Avenue",
      "weight": 0.069367655
    },
    {
      "name": "Convent Avenue",
      "weight": 0.067300834
    },
    {
      "name": "Alexander Hamilton",
      "weight": 0.06530825
    },
    {
      "name": "Harlem mansion",
      "weight": 0.061474804
    },
    {
      "name": "rooms",
      "weight": 0.061141934
    },
    {
      "name": "stained glass windows",
      "weight": 0.057249796
    },
    {
      "name": "Ben Jacobs",
      "weight": 0.057224516
    },
    {
      "name": "Jessica Chestler",
      "weight": 0.057224516
    }
  ],
  "topics": [
    {
      "name": "Real Estate"
    }
  ],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Real Estate/Real Estate Listings/Residential Sales",
      "score": 0.8271484375
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.78955078125
    }
  ],
  "sentiment": {
    "positive": 0.4698039,
    "negative": 0.039286073,
    "neutral": 0.49090993
  },
  "summary": "A 25-foot-wide Romanesque Revival townhouse on Convent Avenue in Hamilton Heights, New York, has been listed for $5.5M. The property was built in 1899 and spans 6,400 square feet of interiors and 2,175 sq. yards of outdoor space. The home is located across the street from the brownstone featured in Anderson's 2001 film \"The Royal Tenenbaums.\" Despite its historic appearance and historic architecture, the property has been well-maintained throughout its decades. The listing is currently held by Douglas Elliman agents Jessica Chestler and Ben Jacobs.",
  "shortSummary": "A historic 19th-Century mansion on Convent Avenue in Hamilton Heights, near to where \"The Royal Tenenbaums” was filmed, is up for sale for $5.5m.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f15f4d5e6cd5428aafce06bfba54211c",
  "places": [
    {
      "osmId": "195743160",
      "road": "Convent Avenue",
      "suburb": "Manhattan",
      "city": "New York",
      "county": "New York County",
      "state": "New York",
      "postcode": "10031",
      "country": "United States",
      "countryCode": "us",
      "neighbourhood": "Hamilton Heights",
      "coordinates": {
        "lat": 40.8190609,
        "lon": -73.9503066
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/11/real-estate/best-states-to-live-in-annual-ranking/",
      "text": "New Jersey beat out New York in ‘best state to live in’ ranking — here’s who else made the list\nFrom housing costs to hospital quality, this annual list did the math to rank the most and least desirable states to call home.\nWalletHub‘s “Best States to Live In” ranking of 2025 set all 50 states against a lengthy list of 51 indicators — giving a numerical value to the livability of each proud state.\nSome things stayed the same in this annual ranking — Massachusetts reigned supreme for the second year in a row, and New York held on to its precarious slot in the top ten. While New Jersey earned itself a spot in the top 5, other states were knocked down a peg.\nMassachusetts won thanks to its strong health care system and high-quality education, according to WalletHub. The Northeastern state put up strong numbers for 2025, boasting the lowest premature death rate in the country and a 90% high school graduation rate.\nThis year’s silver medal traded hands from Florida to Idaho — the Sunshine State dropped several slots from last year, down to sixth place, partially due to high housing costs.\nNew Jersey remained squarely in third place, thanks to factors like high median household income and low food insecurity. It’s not called the Garden State for nothing.\nBig year-to-year shake-ups included Wisconsin earning a No.4 place, as well as Minnesota climbing from 13th to 5th place.\nThe Empire State remained in ninth place from last year. New York, as any New Yorker will tell you, has plenty to brag about. It ranked first in overall quality of life — a bucket of indicators that included commute times, museums per capita and average weekly hours — and seventh in safety.\nTo round out the top 10 list — Pennsylvania came in tenth, scoring high on affordability and economy ranking.\nWhen it came to which states have the most restaurants per capita — New York tied with California, Florida and Texas. The high cost of calling New York home, however, remains a drag on the state’s reputation. WalletHub ranked it 47th out of 50 states for affordability.\nWalletHub’s ranking, of course, is not the final word on where to call home. The high proportion of renters to owners in New York City, for example, weighs down the state’s overall showing.\nNew York ranked 50th for its low rate of homeownership — a heavily weighted WalletHub indicator.\nNew Mexico found itself at the very bottom of the 2025 “Best and Worst” list. The Southwestern home state, known for snowy mountain peaks and inspiring desert landscapes, suffered from the country’s highest crime rate — although Washington ranked 50th in the overall safety category — and one of its highest poverty rates.\nLouisiana, Arkansas, Mississippi and Alaska took up the rest of the bottom five slots, all hindered by variously poor performances in key indicators like income growth, crime and poverty rates."
    },
    {
      "url": "https://nypost.com/2025/08/11/real-estate/jim-carrey-finds-buyer-for-longtime-la-estate-12m-price-cut/",
      "text": "Jim Carrey finally finds a buyer for his longtime LA estate — after slashing price by $12M\nJim Carrey offloaded his sprawling Brentwood home at a major discount.\nThe 63-year-old actor’s home of more than two decades finally left the market last week at $17 million, the Real Deal reported. The deal came after more than two years of million-dollar price cuts and one failed sale during California’s most recent wildfire season.\nCarrey’s compound was first listed for $28.9 million in early 2023. The “Dumb and Dumber” star previously said he no longer spent much time at the 2-acre residence.\nThe final $17 million sale marks a 41% discount from the ranch home’s original listing price.\nDespite the steep price cuts and losses incurred by Los Angeles’ steep “mansion tax,” Carrey still made a nice profit on his longtime home. The comedic actor dropped $3.8 million on the property in 1994. His purchase came on the heels of his breakout success in “Ace Ventura: Pet Detective,” along with “Dumb & Dumber” and “The Mask” — all released that same year. And hits like “Liar Liar” and “The Truman Show” would soon follow.\nThe 1950s-era home is located in Brentwood, one of Los Angeles’ most desirable neighborhoods. It boasts a mid-century style with modernized amenities, including a tennis court, a waterfall pool, a yoga and meditation area and an Art Deco movie theater — popcorn concession included.\nThe 11,000-square-foot abode encompasses a total of five bedrooms and nine bathrooms, as well as six fireplaces\nThe richly appointed property nearly left the market in December. The home went under contract at an already-discounted $19.8 million asking price, but the deal didn’t pan out. It is possible that negotiations were affected by the growing threat of wildfires at the time.\nCarrey’s Brentwood home narrowly avoided a direct hit from the fires that blazed through Los Angeles in January.\nThe roughly two-and-a-half-year sale comes at an uncertain period for Carrey’s career. The actor recently starred as Dr. Robotnik in “Sonic the Hedgehog 3,” but has been open about his tentative plans for retirement from Hollywood.\nGraham Larson of Sotheby’s International Realty represented Carrey in the sale, the Real Deal reported. The as-yet unknown buyer was repped by Sam Collins, David Parnes and James Harris and Carolwood."
    },
    {
      "url": "https://nypost.com/2025/08/11/real-estate/mark-zuckerberg-angers-silicon-valley-locals-over-11-home-110m-compound/",
      "text": "Mark Zuckerberg angers locals in tony Silicon Valley enclave over 11-home, $110M compound: ‘They’ve occupied our neighborhood’\nFor years, Palo Alto’s Crescent Park was a postcard of California suburban bliss — leafy streets, neighborly block parties and children coasting on bikes. Now, residents say their once-idyllic enclave has been transformed into a real-life game of Monopoly, with Meta CEO Mark Zuckerberg buying up the board.\nSince arriving in 2011, the billionaire and his wife, Priscilla Chan, have amassed at least 11 properties along Edgewood Drive and Hamilton Avenue, spending more than $110 million.\nFive homes were folded into an expansive private compound for the couple and their three daughters, outfitted with guest houses, lush gardens, a pickleball court and a pool with a hydrofloor cover, according to the New York Times.\nNearby structures serve as an entertainment hub, staging area for outdoor events, and — controversially — a private school for 14 children, an unpermitted use under city code.\nIn the middle of the compound stands a 7-foot silver statue of Chan, commissioned by Zuckerberg, while beneath it lies 7,000 square feet of underground space that permits describe as basements — but neighbors call bunkers or “a billionaire’s bat cave.”\nThe eight years of ongoing construction have clogged streets with heavy equipment, blocked driveways, and, residents say, knocked mirrors off parked cars, according to the Times.\nSurveillance is another sore point. Neighbors report cameras trained toward their yards and security guards stationed in vehicles, filming visitors and questioning pedestrians on public sidewalks.\n“No neighborhood wants to be occupied,” Michael Kieschnick, whose Hamilton Avenue home is bordered on three sides by Zuckerberg’s holdings, told the Times. “But that’s exactly what they’ve done. They’ve occupied our neighborhood.”\nCity records show 56 permits approved for Zuckerberg-owned properties since his move-in.\nCritics accuse officials of bending to the tech titan. In one instance, police created a tow-away zone for several hours so the family could host a barbecue.\nFrustrations date to 2016, when Zuckerberg sought to demolish four adjacent homes and replace them with smaller houses and large basements.\nThe Architectural Review Board rejected the proposal, but construction proceeded piecemeal, avoiding another public hearing.\nFormer board member Peter Baltay recalled visiting the site during the review process: “I said ‘I’m standing on the sidewalk looking at this project for review.’ He said, ‘Well, we’d appreciate it if you could move on.’ I was pretty shocked by that.”\nGreer Stone, a Palo Alto City Council member, said the billionaire has “been finding loopholes around our local laws and zoning ordinances,” adding, “We should never be a gated, gilded city on a hill where people don’t know their neighbors.”\nThe Zuckerbergs’ spokesman, Aaron McLear, told The Post in a statement that the couple has “taken a number of steps above and beyond any local requirements to avoid disruption in the neighborhood.”\nHe cited credible security threats as the reason for the protective measures and denied that cameras target neighbors.\n“Mark, Priscilla and their children have made Palo Alto their home for more than a decade,” he said. “They value being members of the community.”\nNot all interactions are frosty.\nSecurity guards now use quiet electric cars, and while Zuckerberg skips the annual block party, last year he sent over an ice cream cart. Before big events, staff have delivered goodwill gifts ranging from sparkling wine and chocolates to Krispy Kreme doughnuts and noise-canceling headphones.\nStill, for residents like Kieschnick, the sense of community has been hard to salvage.\n“Billionaires everywhere are used to just making their own rules — Zuckerberg and Chan are not unique, except that they’re our neighbors,” he said. “But it’s a mystery why the city has been so feckless.”"
    }
  ],
  "argos_summary": "A 25-foot-wide mansion on Convent Avenue in Hamilton Heights, Manhattan, has been listed for sale, featuring historic architecture and modern amenities. Built in 1899, the 6,400-square-foot townhouse includes original details like stained glass windows and pocket doors, along with vibrant living spaces and a studio apartment for potential income. Meanwhile, Mark Zuckerberg has faced backlash from Palo Alto residents over his extensive property acquisitions, which have transformed the neighborhood and raised concerns about privacy and community disruption.",
  "argos_id": "9GBBU9KD4"
}