{
  "url": "https://finance.yahoo.com/news/united-states-antimony-corporation-reports-200000842.html?.tsrc=rss",
  "authorsByline": "United States Antimony Corp.",
  "articleId": "60d00aaa86f74340826c7e6be4879a2e",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/cv/apiv2/cv/apiv2/social/images/yahoo-finance-default-logo.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:00:00+00:00",
  "addDate": "2025-08-12T20:23:58.271704+00:00",
  "refreshDate": "2025-08-12T20:23:58.271705+00:00",
  "score": 1.0,
  "title": "United States Antimony Corporation Reports Second Quarter and Six Months Ended June 30, 2025 Financial and Operating Results",
  "description": "Revenues Up 160% YOY Gross Profit Up 183% YOY Net Income Up 707% YOY \"The Critical Minerals and ZEO Company\" ~ Antimony, Cobalt, Tungsten, and Zeolite ~ DALLAS, TEXAS / ACCESS Newswire / August 12, 2025 / United States Antimony Corporation (\"USAC,\" ...",
  "content": "USAC's current antimony inventory that has been acquired from international third-party suppliers is at record levels. As of June 30, 2025, inventory totaled 201 tons of antimony (both processed and unprocessed). The value of this inventory at today's Rotterdam market price is approximately $10.4 million at June 30, 2025, compared to $858K last year at this time, and $4.0 million at year end of 2024. With the recent completion of the refurbishment of four furnaces located in Thompson Falls, Montana, and the hiring of five new furnace operator employees, our goal is to work this inventory down significantly over the remainder of the year in order to create additional sales. This is a top priority for management. Management maintains its previous revenue guidance for fiscal year 2025 of $40 to $50 million.\n\nThe combination of the Company's cash position, along with its investment in securities (federal bonds) totaled $15.8 million at June 30, 2025 compared to $18.2 million of cash only at year-end 2024. USAC spent $5 million of its cash in the second quarter on a Tungsten mining acquisition located in Canada completed on June 26, 2025 ( See Press Release dated June 27, 2025 ).\n\nOur zeolite sales were $1.98 million for the first six months of 2025, which is up $386k, or 24%, over the same period last year.\n\nOur antimony sales were $15.56 million for the first six months of 2025, which is up $10.43 million, or 203%, over last year. This improvement was predominately due to the increase in the average sales price per pound over the two six-month reporting periods.\n\nThe Company reported net income of $728.1K for the six months ended June 30, 2025, as compared to a loss of $120.0K for the similar six-month period last year.\n\nRevenues for the first six months of 2025 increased to $17.53 million or a 160% increase of $10.79 million, compared to the first six months of 2024 of $6.74 million. During the same period, cost of revenues increased 152% or $7.42 million. This in-turn allowed the Company's gross profit to almost double and increase 183%, or $3.37 million to $5.21 million as compared to $1.84 million during the same six-month period in 2024. Gross margin increased to 30% during the first six months of 2025 from a 27% margin experienced during the same period of last year. Operating expenses increased $2.58 million, or 114%, for the first six months of 2025 to $4.83 million.\n\nDALLAS, TEXAS / ACCESS Newswire / August 12, 2025 / United States Antimony Corporation (\"USAC,\" \"US Antimony Corporation,\" or the \"Company\"), (NYSE:UAMY) (NYSE Texas:UAMY) reported today its second quarter and six months ended June 30, 2025 financial and operational results.\n\nAccording to the U.S. Geological Survey, the National Defense Stockpile currently holds 1,100 metric tons (1,212 tons) of antimony, a reserve of only about 5% of annual U.S. consumption. More importantly, as of April 2025, the US National Defense Stockpile maintains antimony reserves sufficient for only ~42 days of critical defense applications (Zadeh, J., 2025: https://discoveryalert.com.au/news/antimony-exemption-us-tariffs-strategic-implications-2025/?utm source-chatgpt.com)\n\nCommenting on the Second Quarter and Six Months Ended June 30, 2025 financial and operational results, Mr. Gary C. Evans, Chairman and CEO of US Antimony Corporation stated, \"While we reported today another record quarter and first six months financial results, it could have been a lot better. Two issues plagued us during this reporting period. First, suboptimum antimony ore from an Australian supplier along with Chinese embargo of our product, all destined for our Madero antimony smelter. Second, a lack of operating personnel at our Thompson Falls antimony smelter. Fortunately, those events are behind us and have been resolved. We should see further improvements in overall operating and financial results during the second half of this year. Our current antimony international inventories are at record levels as can be seen on our balance sheet. We successfully retrofitted four existing furnaces in Thompson Falls at a cost of approximately $300K over the last few months. This will enable us to begin doubling production output of antimony products now that we have the necessary plant personnel in place. Construction is on schedule for us to complete our expansion efforts underway at Thompson Falls by year-end. We continue our efforts in procuring additional international antimony shipments from foreign sources (See Press Release dated July 14, 2025). These new supplies are destined for both of our smelters located in the US and Mexico. Additionally, once final mining permits are approved by the appropriate agencies in both Alaska and Montana at our company owned mining projects, our control over future antimony supplies greatly improves along with our gross margins.\n\nIn an effort to provide a comparison to the value of antimony versus gold, 6.5% of antimony bearing rock has approximately the same value as one ounce per ton of gold at 2025 metal prices. In its geological environment of ore deposition, a ton of antimony rock can be mined and processed to product $3,250, whereas at the Fort Knox gold mine located near Fairbanks, Alaska (the largest operating gold mine in Alaska), it requires between 117 and 210 tons of rock, depending on current operations. Antimony is truly the \"New Gold!\"\n\nUS Antimony management will host a conference call on Tuesday, August 12, 2025, at 4:15 p.m. Eastern time to discuss its full financial results for the Second Quarter and Six Months Ended June 30, 2025, followed by a question-and-answer period. The conference call details are as follows:\n\nThe conference call will also be available for replay in the Investors section of the Company's website, along with the transcript, at https://www.usantimony.com/investors.\n\nUnited States Antimony Corporation and its subsidiaries in the U.S., Mexico, and Canada (\"USAC,\" \"U.S. Antimony,\" the \"Company,\" \"Our,\" \"Us,\" or \"We\") sell antimony, zeolite, and precious metals primarily in the U.S. and Canada. The Company processes third party ore primarily into antimony oxide, antimony metal, antimony trisulfide, and precious metals at its facilities located in Montana and Mexico. Antimony oxide is used to form a flame-retardant system for plastics, rubber, fiberglass, textile goods, paints, coatings, and paper, as a color fastener in paint, and as a phosphorescent agent in fluorescent light bulbs. Antimony metal is used in bearings, storage batteries, and ordnance. Antimony trisulfide is used as a primer in ammunition. The Company also recovers precious metals, primarily gold and silver, at its Montana facility from third party ore. At its Bear River Zeolite (\"BRZ\") facility located in Idaho, the Company mines and processes zeolite, a group of industrial minerals used in water filtration, sewage treatment, nuclear waste and other environmental cleanup, odor control, gas separation, animal nutrition, soil amendment and fertilizer, and other miscellaneous applications. During 2024 and 2025, the Company leased a metals concentration facility located in Montana and began acquiring mining claims and leases located in Montana, Alaska and Ontario, Canada in an effort to expand its operations as well as its product offerings.\n\nThis press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, without limitation, statements regarding the Company's future operations, production levels, financial performance, business strategy, market conditions, demand for antimony, zeolite, other critical minerals, and precious metals, expected costs, and other statements that are not historical facts. These statements are based on current expectations, estimates, forecasts, and projections about the industries in which the Company operates, as well as management's beliefs and assumptions. Words such as \"anticipates,\" \"expects,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"may,\" \"will,\" \"should,\" \"could,\" and variations of these words or similar expressions are intended to identify such forward-looking statements.\n\nForward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those indicated in such statements, including, but not limited to: fluctuations in the market prices and demand for antimony and zeolite; changes in domestic and global economic conditions; operational risks inherent in mining and mineral processing; geological or metallurgical conditions; availability and cost of energy, equipment, transportation, and labor; the Company's ability to maintain or obtain permits, licenses, and regulatory approvals; changes in environmental and mining laws or regulations; competitive factors; the impact of geopolitical developments; and the effects of weather, natural disasters, or health pandemics on operations and supply chains. Additional information regarding risk factors that could cause actual results to differ materially is included in the Company's filings with the U.S. Securities and Exchange Commission, including the most recent Annual Report on Form 10-K and subsequent Quarterly Reports on Form 10-Q.\n\nThe Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof.",
  "medium": "Article",
  "links": [
    "https://pr.report/d7cl",
    "https://pr.report/d7cm",
    "https://pr.report/d7cn",
    "https://pr.report/d7ck",
    "https://www.accessnewswire.com/newsroom/en/metals-and-mining/united-states-antimony-corporation-reports-second-quarter-and-six-months-ended-ju-1059619"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Antimony metal",
      "weight": 0.078533344
    },
    {
      "name": "antimony metal",
      "weight": 0.078533344
    },
    {
      "name": "antimony products",
      "weight": 0.07599738
    },
    {
      "name": "antimony rock",
      "weight": 0.0744644
    },
    {
      "name": "future antimony supplies",
      "weight": 0.07317806
    },
    {
      "name": "antimony reserves",
      "weight": 0.073051155
    },
    {
      "name": "Antimony",
      "weight": 0.073001534
    },
    {
      "name": "antimony",
      "weight": 0.073001534
    },
    {
      "name": "Antimony trisulfide",
      "weight": 0.07228376
    },
    {
      "name": "antimony trisulfide",
      "weight": 0.07228376
    }
  ],
  "topics": [
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97314453125
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.79052734375
    },
    {
      "name": "/Business & Industrial/Metals & Mining/Other",
      "score": 0.63134765625
    },
    {
      "name": "/Business & Industrial/Manufacturing/Other",
      "score": 0.464599609375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.423095703125
    }
  ],
  "sentiment": {
    "positive": 0.6165017,
    "negative": 0.19830053,
    "neutral": 0.18519777
  },
  "summary": "The United States Antimony Corporation (USAC) has reported its second quarter and six months ended June 30, 2025 financial and operating results. The company's current antimony inventory, acquired from international third-party suppliers, is at record levels with an inventory of 201 tons of antimony as of June 30 2025. The value of this inventory at today's Rotterdam market price is approximately $10.4 million at June 30. The Company's current revenue guidance for fiscal 2025 is unchanged at $40 to $50 million. The cash position, along with its investment in federal bonds, was $15.8 million at the end of June 2025 compared to $18.2 million of cash only at year-end 2024. USAC spent $5 million of its cash in the second quarter on a Tungsten mining acquisition in Canada. Revenues for the first six months of 2025 increased to $17.53 million or a 160% increase of $1079 million, compared to the previous year's total of $6.74 million. However, cost of revenues increased 152% or $7.42 million, allowing gross profit to almost double and increase 183% or increase 183%. The company reported net income of $728.1K for the six months ending June 2025, as compared to a loss of $120.0K for this period last year.",
  "shortSummary": "US Antimony Corporation reported record inventory levels and increased revenue, despite ongoing operational challenges and increased costs.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "6425a37fbce344faa2317e7162aa90ed",
  "places": [
    {
      "osmId": "142539",
      "town": "Thompson Falls",
      "county": "Sanders County",
      "state": "Montana",
      "postcode": "59873",
      "country": "United States",
      "countryCode": "us",
      "coordinates": {
        "lat": 47.5971287,
        "lon": -115.344309
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://pr.report/d7ck",
      "text": "Understanding the Antimony Exemption in US Tariffs: Strategic Implications for Mining Companies\nThe recent exemption of antimony from US tariffs under President Donald Trump's executive order marks a pivotal shift in global critical mineral policy. This decision, effective since April 5, 2025, reflects the metal's strategic importance for defense, energy, and industrial sectors, particularly given China, Russia, Tajikistan, and Myanmar's control over 94% of global supply. With antimony prices surging nearly 300% from US$13,000 per tonne in early 2024 to a record US$51,500 in February 2025, mining companies across Australia and North America are accelerating exploration and development projects. This report analyzes the geopolitical, economic, and industrial ramifications of the exemption, examining how firms like Trigg Minerals, Cosmo Metals, and Military Metals are positioning themselves in a rapidly evolving market.\nWhat is Antimony and Why is it Important?\nAntimony (Sb) is a silvery, lustrous grey metalloid with poor heat and electrical conductivity, measuring 3.25 on Moh's scale of hardness. Known as \"stibium\" in classical Latin (hence its chemical symbol Sb), this element belongs to the arsenic group and possesses unique properties that make it valuable across multiple industries.\nUnlike many metals, antimony rarely occurs in its pure state in nature. It most commonly appears as the sulphide mineral stibnite (Sb₂S₃), which features a distinctive metallic luster and needle-like crystal formation. Geologically, antimony deposits frequently associate with gold mineralization, creating valuable co-product opportunities for mining operations. This association extends to certain silver-lead-zinc deposits, particularly in hydrothermal vein systems.\nThe element's brittleness and poor conductivity might seem like disadvantages, but these very properties enable its critical applications in flame retardants, ammunition, and battery technology. When alloyed with lead, antimony significantly increases hardness and mechanical strength – properties essential for lead-acid battery grids and military applications.\nWhy is Antimony Considered a Critical Mineral?\nAntimony's classification as a critical mineral stems from its irreplaceable role in multiple strategic applications. The element serves as an essential component for battery technology, particularly in grid-scale energy storage systems where antimony-lead alloys provide superior performance and longevity. Advanced military systems rely heavily on antimony for hardening ammunition, creating infrared detection devices, and manufacturing various specialized components for defense platforms.\nGlobal recognition of antimony's strategic importance is evident in its inclusion on critical mineral lists across multiple jurisdictions. China, the US, Canada, and Australia have all designated antimony as a critical resource requiring special attention and supply chain security measures. This consensus among diverse economies underscores the universal importance of this relatively obscure element.\nPerhaps most concerning from a strategic perspective is the extreme concentration of global antimony supply. Approximately 94% of worldwide antimony production is controlled by just four countries: China, Russia, Tajikistan, and Myanmar. This supply concentration creates significant vulnerability for Western industrial bases, particularly during periods of geopolitical tension.\nThis vulnerability translates directly into import dependence for Western nations. The United States, despite its technological leadership, remains heavily reliant on antimony imports to meet domestic demand across defense and civilian sectors. This dependence has created urgency around developing alternative supply sources within friendly jurisdictions.\nDetails of the US Tariff Exemption\nThe antimony tariff exemption stems from an Executive Order signed by President Donald Trump, formally titled 'Regulating Imports with a Reciprocal Tariff to Rectify Trade Practices that Contribute to Large and Persistent Annual United States Goods Trade Deficits.' This policy initiative represents a targeted approach to addressing both trade imbalances and critical mineral security simultaneously.\nImplementation of this policy took effect on April 5, 2025, marking a significant shift in the US approach to strategic resource acquisition. The timing coincides with increased defense appropriations and renewed focus on domestic manufacturing capacity, particularly for advanced technology sectors.\nThe exemption's legal foundation rests on antimony's inclusion in the US Geological Survey's 2022 Critical Minerals List. This official designation provided the necessary framework for excluding antimony from broader tariff increases, creating a preferential lane for imports of this strategic resource while maintaining pressure on other trade categories.\nFrom a policy perspective, the exemption reflects a coherent US government strategy recognizing antimony's fundamental importance to both US and global security frameworks. By facilitating antimony imports while developing domestic alternatives, policymakers have created a balanced approach to immediate needs and long-term security.\nHow are Mining Companies Responding to the Exemption?\nAustralian Exploration Projects\nThe tariff exemption has catalyzed significant activity among Australian mining companies positioned in the antimony space. These firms see dual opportunities in supplying the US market while benefiting from Australia's status as a preferred trading partner with strong environmental and governance standards.\nTrigg Minerals (ASX:TMG) has emerged as a leader in Australian antimony development, focusing on its promising Wild Cattle Creek deposit. This project represents a substantial resource, with estimates indicating 1.52 million tonnes containing approximately 29,900 tonnes of antimony. What makes this deposit particularly valuable is its classification as \"Australia's highest grade undeveloped primary antimony resource,\" providing competitive advantage in a market increasingly sensitive to ore quality.\nThe company's Executive Chairman Timothy Morrison has publicly described the current market conditions as a \"remarkable time\" to develop an antimony project in Australia. This enthusiasm reflects both the record high prices and the favorable policy environment created by the US tariff exemption, which effectively increases the addressable market for Australian production.\nCosmo Metals (ASX:CMO) has taken a different approach by recently acquiring the Bingara and Nundle gold-antimony and copper projects in New South Wales. These assets represent large, camp-scale exploration opportunities with demonstrated high-grade multi-commodity mineralization. The company's strategy leverages antimony's frequent association with gold, creating potential for dual-revenue streams.\nTo enhance exploration efficiency, Cosmo Metals is deploying advanced technologies including LiDAR and high-resolution imagery capture surveys. These techniques allow for more precise targeting of mineralized zones while minimizing environmental impact during the exploration phase – an increasingly important consideration for mining projects globally.\nNorth American Projects\nNorth American mining companies have also moved aggressively to capitalize on the tariff exemption, with proximity to US markets providing obvious logistical advantages. These companies are particularly focused on revitalizing historic antimony districts that were previously uneconomic under lower price regimes.\nEV Resources (ASX:EVR) has secured 49 unpatented claims over the Coyote Creek Antimony Project in Garfield County, Utah. This strategic acquisition is located just 11 kilometers east of a town aptly named Antimony, highlighting the historical significance of this mineral in the region. The company's North American focus extends beyond US borders with their acquisition of a 70% interest in Los Lirios, an open pit antimony mine in Mexico's Oaxaca state.\nEV Resources has articulated a clear strategy focused on developing an Americas antimony division based primarily on open pit mining opportunities. This approach minimizes capital intensity while accelerating potential production timelines – a crucial consideration given current high antimony prices and anticipated demand growth.\nMilitary Metals (CSE:MILI) has pursued a portfolio approach, amassing a collection of brownfield antimony projects characterized by high-antimony-to-gold ratios. The company recently purchased additional claims surrounding the West Gore Antimony Project in Nova Scotia, Canada, expanding their footprint in this historically productive district.\nTechnical innovation is evident in Military Metals' approach, with the company conducting detailed LiDAR surveys of underground workings at their Trojárová antimony-gold project. This technology enables precise mapping of historical mining areas, facilitating more efficient resource targeting and development planning.\nWhat's Happening with Antimony Prices?\nThe antimony market has experienced extraordinary price volatility, culminating in an all-time high of US$51,500 per tonne in February 2025. This record represents a dramatic increase from the US$13,000 per tonne price recorded at the beginning of 2024 – a nearly 300% appreciation within approximately 13 months.\nThis remarkable performance has positioned antimony among the top-performing commodities of 2024, outpacing even traditional safe-haven metals like gold and silver. The magnitude of the price increase reflects both fundamental supply-demand dynamics and increased speculative interest as market participants recognize antimony's strategic importance.\nLooking forward, market sentiment appears increasingly bullish, with some analysts suggesting prices could potentially reach US$100,000 per tonne in extreme supply disruption scenarios. While such projections remain speculative, they highlight the market's recognition of structural supply constraints facing this critical mineral.\nFor Australian producers, the current price environment is particularly favorable. At current exchange rates, the international antimony price translates to approximately AU$86,123 per tonne – creating compelling economics for domestic projects even when accounting for higher Australian operating costs compared to some competing jurisdictions.\nHow Does the Exemption Impact Investment in Antimony Projects?\nThe US tariff exemption works synergistically with other government initiatives, notably the Australian federal and New South Wales government Critical Mineral incentives. This policy alignment creates a supportive ecosystem for antimony project development, reducing regulatory friction while enhancing access to both capital and markets.\nThe current record high prices for antimony create an exceptionally favorable development context. Projects that might have been marginal at historical price levels now demonstrate robust economics, attracting investment capital that previously overlooked this niche sector. This economic transformation has accelerated development timelines across multiple projects.\nBeyond immediate price considerations, investors increasingly recognize antimony's fundamental importance to global market insights. This recognition translates into longer-term capital commitments, with investors willing to support development through potential price cycles given the structural supply deficit and growing applications for the metal.\nCompanies like Military Metals are actively pursuing de-risking opportunities, seeking to minimize technical and geological uncertainties while capturing value from rising antimony prices. This balanced approach allows for measured development while positioning shareholders for potential windfall returns if the more bullish price forecasts materialize.\nFAQ About Antimony Mining and Markets\nWhat are the main uses of antimony?\nAntimony serves as a critical component across multiple industries. In battery technology, it strengthens lead-acid batteries used in conventional vehicles and grid storage applications. Advanced military systems utilize antimony in night vision equipment, ammunition hardening, and specialized alloys for defense platforms. Industrial applications include flame retardants for building materials, plastics, and textiles, which collectively account for approximately 60% of global antimony consumption. The element's unique properties make it difficult to substitute in many of these applications, reinforcing its strategic importance.\nWhy is the US exempting antimony from tariffs?\nThe US tariff exemption for antimony reflects critical strategic considerations rather than purely economic factors. The exemption aligns with the US Geological Survey's 2022 Critical Minerals List, which identifies resources essential for economic and national security. Given that 94% of global antimony supply is controlled by China, Russia, Tajikistan, and Myanmar, the exemption represents a pragmatic approach to securing necessary imports while simultaneously encouraging development of friendly-nation alternatives. This policy coherence demonstrates recognition of antimony's fundamental importance to both civilian technology and defense applications.\nHow has the antimony price performed recently?\nAntimony has demonstrated exceptional price performance, emerging as one of the top-performing commodities in 2024. Starting the year at approximately US$13,000 per tonne, prices surged to an unprecedented US$51,500 per tonne by February 2025, representing nearly 300% appreciation. This dramatic increase reflects both fundamental supply constraints and growing recognition of antimony's strategic importance. Market speculation has become increasingly bullish, with some analysts suggesting potential for prices to reach US$100,000 per tonne if current supply limitations persist alongside growing demand from battery and defense sectors.\nWhich companies are developing antimony projects?\nSeveral companies have positioned themselves at the forefront of antimony development. Trigg Minerals (ASX:TMG) is advancing its Wild Cattle Creek deposit in Australia, which contains an estimated 29,900 tonnes of antimony within 1.52 million tonnes of resource. Cosmo Metals (ASX:CMO) has acquired promising projects in New South Wales featuring multi-commodity mineralization including antimony. In North America, EV Resources (ASX:EVR) is developing the Coyote Creek project in Utah alongside Mexican assets, while Military Metals (CSE:MILI) pursues projects across Canada and Europe. These companies represent a diverse approach to antimony production, ranging from pure-play developers to multi-commodity strategies leveraging antimony's geological associations.\nTechnological Innovations in Antimony Processing\nRecent technological breakthroughs have significantly improved antimony processing efficiency. Advanced flotation techniques using specialized collectors have increased recovery rates from complex ores by up to 15%, while reducing reagent consumption. These innovations are particularly relevant for mixed antimony-gold deposits where traditional processing methods often struggled with refractory mineralization.\nEnvironmental considerations have driven development of closed-loop hydrometallurgical processes that eliminate atmospheric antimony trioxide emissions – historically a major concern with traditional smelting. These systems not only reduce environmental impact but also capture valuable by-products that improve overall project economics.\nThe growing antimony recycling sector now recovers approximately 20% of annual consumption, primarily from lead-acid batteries and flame-retardant materials. This secondary supply source provides partial insulation from primary production disruptions while reducing overall environmental footprint.\nGeopolitical Dimensions of Antimony Security\nChina's dominance in antimony processing represents perhaps the clearest example of strategic mineral concentration globally. Since consolidating the sector in the early 2000s, Chinese authorities have implemented export quotas and production restrictions that directly influence global pricing and availability. This control creates significant leverage in broader trade negotiations.\nThe US National Defense Stockpile currently maintains antimony reserves sufficient for only 42 days of critical defense applications – well below the strategic objective of one year's supply. This shortfall has prompted increased congressional scrutiny and funding for antimony-specific security initiatives.\nRussia's position as the second-largest antimony producer creates additional complexity given current geopolitical tensions. Western sanctions have not yet directly targeted Russian antimony exports, creating a challenging policy dilemma between security needs and broader diplomatic objectives.\nThe intensifying critical minerals race between global powers has placed antimony at the center of resource nationalism concerns. Investors interested in this sector would benefit from consulting a comprehensive guide to mining stocks that addresses these complexities, especially considering how Trump's commodity policies continue to reshape markets with strategic exemptions like the one for antimony.\nWant to Spot the Next Major Antimony Discovery Before the Market?\nDiscover promising antimony investment opportunities before they make headlines with Discovery Alert's proprietary Discovery IQ model, which analyses ASX announcements in real-time to identify significant mineral discoveries. Explore historic returns from major discoveries and gain your market advantage by visiting the Discovery Alert discoveries page."
    }
  ],
  "argos_summary": "United States Antimony Corporation (USAC) reported record antimony inventory levels of 201 tons valued at approximately $10.4 million as of June 30, 2025, a significant increase from previous years. The company achieved a 203% rise in antimony sales, totaling $15.56 million for the first half of 2025, contributing to a net income of $728.1K compared to a loss last year. USAC aims to reduce its inventory through increased production following the refurbishment of furnaces and hiring of new staff, while maintaining a revenue guidance of $40 to $50 million for fiscal year 2025.",
  "argos_id": "9VY71WFYI"
}