{
  "url": "https://www.fastcompany.com/91384497/companies-banks-stablecoins-new-law-hurdles",
  "authorsByline": "Reuters",
  "articleId": "7a2d1797a19a4d638db8cafa3cd3f227",
  "source": {
    "domain": "fastcompany.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://images.fastcompany.com/image/upload/f_webp,q_auto,c_fit/wp-cms-2/2025/08/2025-08-12T101014Z_2_LYNXMPEL7B0EG_RTROPTP_4_FINTECH-CRYPTO-STABLECOINS.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:15:18+00:00",
  "addDate": "2025-08-12T17:27:01.898396+00:00",
  "refreshDate": "2025-08-12T17:27:01.898400+00:00",
  "score": 1.0,
  "title": "Companies explore their own stablecoins under new law, but hurdles remain",
  "description": "Walmart, Amazon, and more companies are entertaining their own stablecoin strategies to capitalize on them.",
  "content": "U.S. President Donald Trump on July 18 signed the GENIUS Act into law, setting federal rules and guidelines for cryptocurrency tokens pegged to the U.S. dollar known as stablecoins. This U.S. law, the first designed to facilitate crypto usage, could pave the way for the digital assets to become an everyday way to make payments and move money, experts said. The use of stablecoins, designed to maintain a constant value, usually a 1:1 U.S. dollar peg, has exploded in recent years, notably among crypto traders moving funds to and from other tokens, such as bitcoin and ether. Now, a slate of companies are entertaining their own stablecoin strategies to capitalize on the promise of instant payments and settlement that stablecoins offer. Payments on traditional banking rails can take several days to arrive, or take even longer across international borders.\n\nAmong the companies considering stablecoins are Walmart and Amazon, the Wall Street Journal reported in June. Walmart and Amazon did not immediately respond to requests for comment. However, the new law will not immediately open the floodgates, experts said. The newfound opportunity to dabble in stablecoins can lead to numerous tricky considerations for firms, both strategic and technical. Companies have to embark on a lengthy process to deploy their own stablecoins, or decide whether it makes more sense to integrate existing stablecoins, like issuer Circle’s USDC, into their business.\n\nCompanies first have to decide the purpose of their stablecoins. For example, a retail platform could make a stablecoin available to customers to buy goods, which could appeal to crypto-savvy users. Some companies could use them internally for cross-border payments, given that stablecoins can enable near-instant payments, often with lower fees. How a company plans to use a stablecoin could affect whether it creates a stablecoin or works with a partner. “The intended use is going to matter a lot,” said Stephen Aschettino, a partner at Steptoe. “Is this something really designed to drive customers to engage with the issuer, or is the issuer’s primary motivation to have a stablecoin that is more ubiquitous?”\n\nFor nonbanks, stablecoins will bring new compliance costs and oversight requirements, given that the GENIUS Act requires issuers to comply with anti-money laundering and “know your customer” (KYC) requirements. “Those that already have robust KYC risk management and regulatory change management programs or working towards implementing these program elements may have a competitive advantage,” said Jill DeWitt, senior director of compliance and third-party risk management solutions at Moody’s. One group likely to enjoy that advantage is banks, which are no strangers to screening for sanctions-related risks and verifying the identities of their customers.\n\nBank of America and Citigroup are actively considering issuing their own stablecoins, the CEOs of both banks said in earnings calls last month. Others like Morgan Stanley are closely monitoring stablecoin developments. JPMorgan Chase CEO Jamie Dimon said the bank will be involved in stablecoins, without giving details. Banks need to weigh several factors before going live with stablecoins, including how holding the tokens might affect liquidity requirements, said Julia Demidova, head of digital currencies product and strategy at FIS. Banks holding assets like stablecoins on their balance sheets might be required to hold more capital under current U.S. bank rules.\n\n“The GENIUS Act is great, but if the bank is treating their stablecoin on the balance sheet under prudential banking regulation, you still need to look at the risk weight of the asset,” she said. Another crucial question is how to issue stablecoins. Like other cryptocurrencies, stablecoins are created on a blockchain, a digital ledger that records transactions. Hundreds of blockchain networks exist today, two of the most popular being ethereum and solana. Both are considered public or “permissionless” blockchains because all transactions on those networks are available for anyone to see.\n\nStill, it is unclear which attribute companies issuing stablecoins would prioritize. Banks, in particular, could opt for their own private, or “permissioned,” blockchains instead, Demidova said. “The banks would desire and demand that very clear governance and structure,” she said. “In that permissionless environment, you don’t have the governance and controls in place.” Others like said Nassim Eddequiouaq, CEO of Bastion, a provider of infrastructure for companies to issue their own stablecoins, see merits to permissionless blockchains.\n\n“We’ve seen a tremendous amount of interest for existing blockchains that have seen user adoption, that have been battle tested at scale, including during activity spikes,” he said. Although the GENIUS Act has been signed into law, its effective date is potentially several years off, with federal banking regulators expected to issue rules in the meantime to fill in certain gaps. The Office of the Comptroller of the Currency, for instance, is expected to issue rules to outline several risk management and compliance requirements. Under the new U.S. framework, the Treasury Department will have to issue a rule on foreign stablecoin regulatory regimes and their compatibility with the new U.S. framework.",
  "medium": "Article",
  "links": [
    "https://www.fastcompany.com/section/stablecoins",
    "https://www.fastcompany.com/91383030/trump-crypto-401k-retirement-account-executive-order-risks-who-benefits-most-what-to-know",
    "https://www.fastcompany.com/apply/most-innovative-companies",
    "https://www.fastcompany.com/91369013/genius-act-update-crypto-vote-happening-circle-stock-reacts"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "existing stablecoins",
      "weight": 0.1071593
    },
    {
      "name": "stablecoins",
      "weight": 0.10591213
    },
    {
      "name": "stablecoin developments",
      "weight": 0.10171187
    },
    {
      "name": "foreign stablecoin regulatory regimes",
      "weight": 0.092689216
    },
    {
      "name": "current U.S. bank rules",
      "weight": 0.07619981
    },
    {
      "name": "their own stablecoin strategies",
      "weight": 0.06306827
    },
    {
      "name": "existing blockchains",
      "weight": 0.061870508
    },
    {
      "name": "new law",
      "weight": 0.061288975
    },
    {
      "name": "their own stablecoins",
      "weight": 0.059568014
    },
    {
      "name": "Banks",
      "weight": 0.058179602
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Finance/Investing/Currencies & Foreign Exchange",
      "score": 0.970703125
    }
  ],
  "sentiment": {
    "positive": 0.16065426,
    "negative": 0.2982425,
    "neutral": 0.54110324
  },
  "summary": "The U.S. President Donald Trump signed the GENIUS Act, which sets federal rules and guidelines for cryptocurrency tokens pegged to the US dollar. This law could pave the way for stablecoins to become an everyday way to make payments and move money. Companies are exploring these strategies to capitalise on the promise of instant payments and settlement that stablecoins offer. However, the new law will not immediately open the floodgates, leading to lengthy process for companies to deploy their own stablecoins or integrate existing stablecoins into their businesses. Nonbanks will face new compliance costs and oversight requirements, including anti-money laundering and KYC requirements for issuers. Banks may also need to consider the risk weight of the asset under current US. bank rules.",
  "shortSummary": "The new GENIUS Act, allowing stablecoins to be pegged to the dollar, faces challenges in enabling stablecoins for instant payments and transactions.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "eaf4d657e1c0410a92060aa153f18abc",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "On July 18, U.S. President Donald Trump signed the GENIUS Act, establishing federal guidelines for stablecoins, which are cryptocurrency tokens pegged to the U.S. dollar. This law aims to facilitate the use of stablecoins for everyday transactions, potentially transforming payment systems. Major companies like Walmart and Amazon are exploring stablecoin strategies, while banks such as Bank of America and Citigroup are considering issuing their own. However, compliance with new regulations and the choice between public and private blockchain networks present challenges for firms entering the stablecoin market.",
  "argos_id": "A6MHSRZ3V"
}