{
  "url": "https://nypost.com/2025/08/12/us-news/dc-homeless-will-go-to-shelter-or-jail-as-part-of-crime-crackdown/",
  "authorsByline": "Steven Nelson",
  "articleId": "2de6b2607b094090a3cbac6b5203eebe",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/newspress-collage-gs6vabc8o-1755030129211.jpg?quality=75&strip=all&1755015738&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:13:06+00:00",
  "addDate": "2025-08-12T21:14:32.754188+00:00",
  "refreshDate": "2025-08-12T21:14:32.754189+00:00",
  "score": 1.0,
  "title": "DC homeless will be given option of shelter or jail as part of Trump’s crime crackdown",
  "description": "“While we are targeting criminals and trying to remove criminals off of the streets, we also want to make DC safe and beautiful,” Leavitt said Tuesday.",
  "content": "WASHINGTON — Homeless people in DC will be given the option of going to a shelter — or, if they refuse, jail — as part of President Trump’s sweeping crime crackdown in the capital, White House press secretary Karoline Leavitt said Tuesday.\n\n“The new federal agencies who have been surging on the streets of the District of Columbia are going to enforce the laws that are already on the books here in Washington, DC,” Leavitt said.\n\n“For far too long, these laws have been completely ignored and the homelessness problem has ravaged the city. So DC Code 22-1307 and DC Municipal Regulation 24-100 give the Metropolitan Police Department the authority to take action when it comes to homeless encampments.”\n\nLeavitt said that “homeless individuals will be given the option to leave their encampment, to be taken to a homeless shelter to be offered addiction or mental health services, and if they refuse, they will be susceptible to fines or to jail time again.”\n\nTrump on Monday asserted federal control over the 3,400-officer DC Metropolitan Police Department and ordered the DC National Guard and hundreds of federal agents onto the streets to address crime.\n\nThe president cited many high-profile recent crimes in DC, including the Aug. 3 attack on former Department of Government Efficiency staffer Edward Coristine, 19, during an alleged attempted carjacking and the June 30 murder of congressional intern Eric Tarpinian-Jachym, 21, in a drive-by shooting.\n\n“While we are targeting criminals and trying to remove criminals off of the streets, we also want to make DC safe and beautiful,” Leavitt said Tuesday.\n\n“That involves removing mentally disturbed individuals and homeless encampments as well. So we will be using these regulations and codes that already exist to clean up our streets.”\n\nLeavitt said that US Park Police, which has jurisdiction over most of DC’s major traffic circles and triangles, will work alongside MPD to house or incarcerate the homeless, who during Mayor Muriel Bowser’s prior cleanup attempts have migrated in response to crackdowns.\n\n“The United States Park Police has actually done remarkable work in terms of removing homeless encampments from the city,” she said.\n\nSince March, “70 homeless encampments have been removed by the US Park Police,” Leavitt said.\n\n“There are only two homeless encampments remaining in DC federal parks under the National Park Service’s jurisdiction, and the removal of those two remaining camps is scheduled for this week.”",
  "medium": "Article",
  "links": [
    "https://nypost.com/2025/08/12/us-news/ashley-biden-divorcing-husband-howard-krein-after-13-years-of-marriage/",
    "https://nypost.com/2025/08/12/us-news/texas-target-shooting-suspect-ethan-nienekers-mugshot-after-3-dead-including-a-child/",
    "https://nypost.com/2025/08/12/us-news/dc-police-chief-mayor-pledge-support-to-trump-takeover-we-are-here-to-work-together/",
    "https://nypost.com/2025/08/12/us-news/martha-nolan-oslatarras-tragic-cause-of-death-on-montauk-boat-eyed-as-suspected-accidental-drug-overdose-sources/",
    "https://nypost.com/2025/08/05/us-news/ex-doge-staffer-nicknamed-big-balls-left-bloodied-after-savage-dc-carjacking-attempt-by-10-juveniles/",
    "https://nypost.com/2025/08/08/us-news/grieving-mother-of-slain-dc-intern-eric-tarpinian-jachym-speaks-out-as-crime-surges/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "DC Metropolitan Police Department",
      "weight": 0.10986742
    },
    {
      "name": "DC federal parks",
      "weight": 0.10228148
    },
    {
      "name": "DC",
      "weight": 0.09421037
    },
    {
      "name": "homeless encampments",
      "weight": 0.09256577
    },
    {
      "name": "DC Code",
      "weight": 0.09246911
    },
    {
      "name": "DC Municipal Regulation",
      "weight": 0.09213686
    },
    {
      "name": "US Park Police",
      "weight": 0.087207556
    },
    {
      "name": "homeless individuals",
      "weight": 0.08208537
    },
    {
      "name": "Homeless people",
      "weight": 0.07641676
    },
    {
      "name": "White House press secretary Karoline Leavitt",
      "weight": 0.07220282
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    },
    {
      "name": "Homelessness"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.89892578125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.890625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Charity & Philanthropy",
      "score": 0.734375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.70166015625
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Housing & Development",
      "score": 0.63525390625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.583984375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Poverty & Hunger",
      "score": 0.49365234375
    },
    {
      "name": "/News/Local News",
      "score": 0.46337890625
    }
  ],
  "sentiment": {
    "positive": 0.046898622,
    "negative": 0.7296881,
    "neutral": 0.2234133
  },
  "summary": "The homeless in Washington, DC, will be given the option of going to a shelter or facing fines or jail as part of President Trump's comprehensive crime crackdown. The move comes as federal agencies are set to enforce existing laws in the city, DC Code 22-1307 and DC Municipal Regulation 24-100, which allow the Metropolitan Police Department to take action against homeless encampments. If individuals refuse to leave their encampment, they will be subject to fines or prison time. The US Park Police will assist in housing or imprisoning the homeless. The crackdown follows several high-profile recent crimes in DC, including the murder of congressional intern Eric Tarpinian-Jachym.",
  "shortSummary": "President Trump's crackdown on crime in Washington DC will require homeless people to accept shelter, or face jail, if they refuse.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f5d3e0debdbf41e0af7139de68459d86",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://nypost.com/2025/08/12/us-news/texas-target-shooting-suspect-ethan-nienekers-mugshot-after-3-dead-including-a-child/",
      "text": "Texas Target shooting suspect Ethan Nieneker seen bloodied, bruised in mugshot after gunfire left 3 dead, including a child\nThe maniac arrested for allegedly opening fire in the parking lot of a Target in Texas, killing two adults and a child, was identified Tuesday — as cops released his bruised and bloodied mugshot.\nEthan Nieneker, 32, is accused of gunning down the victims in Austin on Monday afternoon before making a dramatic getaway that involved two stolen cars and a police chase.\nNieneker, whom cops had earlier described as having a “mental health history,” ended up being detained with the help of a Taser on the other side of the city.\nHis mugshot showed blood oozing from a gash beside one of his eyes, as well as several scratches across his face.\nNieneker is being held in the Travis County Jail on a slew of murder charges.\nHe already has a lengthy rap sheet in Travis and Williamson counties — including for assault — family violence, criminal mischief, DWI and possession, Fox7 Austin reported.\nThe deadly saga unfolded when Nieneker allegedly stormed the Target parking lot just north of Austin around 2:15 p.m. Monday, cops said.\nAn adult and the child were pronounced dead at the scene, while the second adult died at the hospital, according to police.\nA fourth victim, who suffered unrelated injuries, was treated at the scene.\nNieneker is accused of fleeing in one of the slain victims’ cars and crashing it soon after.\nHe allegedly hijacked another vehicle from a Volkswagen dealership before he ended up being detained some 20 miles away in the city’s south end, cops said.\nPolice haven’t released any details on the victims.\nInvestigators are also still probing a motive for the bloodshed and are planning to hold a news conference later Tuesday to provide an update.\n“This is a very sad day for Austin. It’s a very sad day for us all and my condolences go out to the families,” Austin Police Chief Lisa Davis said on Monday.\nTarget, meanwhile, said it was “devastated” by the tragedy and would be providing grief counseling to its team.\n“Our hearts are with the families and loved ones of those who lost their lives, our team in Austin and all those impacted by this tragedy,” the company said in a statement."
    },
    {
      "url": "https://nypost.com/2025/08/08/us-news/grieving-mother-of-slain-dc-intern-eric-tarpinian-jachym-speaks-out-as-crime-surges/",
      "text": "Grieving mom of DC congressional intern killed in drive-by shooting has message for officials as crime spirals out of control\nThe mother of a congressional intern killed in a Washington, DC, drive-by delivered a heartbreaking plea Thursday, condemning the city’s crime surge while sharing the pain her family continues to endure.\n“Our lives will never be the same,” said Tamara Tarpinian-Jachym, whose 21-year-old son, Eric, was shot multiple times on June 30 and died at a hospital the following day.\n“My husband says he wishes it was him who took the bullets for his son. That’s how bad it is.”\nIn a gut-wrenching interview with “Fox & Friends First,” Tamara described the moment she heard the news and her world shattered.\n“You don’t expect to find out that your son gets brutally murdered, not with one gunshot wound, but riddled with them. And my son was a good boy, and he didn’t deserve this. Nobody does. No innocent victim deserves what we’re going through, and there’s a lot of us out there,” she said tearfully.\nEric was in Washington, DC, serving as an intern for Rep. Ron Estes (R-Kan.) at the time of the incident.\nThe shooting, which authorities say didn’t target Eric, also left a 16-year-old male and an adult female injured.\nTamara told Fox News’ Carley Shimkus that no suspects have yet been apprehended to her knowledge and that the 16-year-old male was allegedly the target.\nShe called on city officials to stop “coddl[ing]” criminals and adopt tough-on-crime policies that will prioritize the best interests of DC’s constituents, visitors and workers.\nPresident Trump has threatened to address leadership lapses via a federal takeover of the nation’s capital unless something changes.\nTamara, reacting to that prospect, said something needs to change for the better.\n“Until this [DC] council can get their act together, which … maybe it will never happen, I don’t know — but I believe that it should happen and they should work. And they should not put contingencies on any of this — the council. The crime needs to go away. These gangs need to go, and people will just keep getting assaulted and murdered …\n“This is our nation’s capital,” she continued. “It should be the safest in the country and then everybody else, all the other states, should be following suit on how to make their city safe. It’s really scary in America.”\nTrump also sent a letter to the Tarpinian-Jachym family after the incident. Tamara said the gesture “meant a lot” to her, and that Estes’ office has also been kind in the aftermath of the shooting."
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/martha-nolan-oslatarras-tragic-cause-of-death-on-montauk-boat-eyed-as-suspected-accidental-drug-overdose-sources/",
      "text": "NYC designer Martha Nolan-O’Slatarra’s tragic death on Montauk boat eyed as suspected accidental drug overdose: sources\nThe mysterious death of Manhattan swimwear designer Martha Nolan-O’Slatarra at the upscale Montauk Yacht Club is being eyed as a possible accidental overdose, sources said Tuesday.\nThe 33-year-old Irish beauty was found unconscious at the ritzy club at around midnight on Aug. 5 aboard a boat named “Ripple” – one of at least two Grateful Dead-themed crafts owned by insurance mogul Christopher Durnan, sources tell The Post.\nAn autopsy is pending to determine Nolan-O’Slatarra’s official cause of death – although sources said it was a suspected drug overdose.\nQuestions have been swirling since the tragic night when Nolan-O’Slatarra was discovered on the “Ripple,” which was docked at the Yacht Club. Members reported hearing screams and called 911, before trying to resuscitate the young designer – who was later pronounced dead.\nThe good Samaritans told The Post they were woken by a naked man throwing sunscreen at their boat and saw him running down the dock screaming, “Do something!”\nDurnan, 60, a familiar figure at the club, owns the Durnan Group in Rockville Center, which manages the “largest, most successful Workers Compensation Safety Group for Real Estate” on the company’s website.\nHe owns “Ripple” and a second boat, “Hell in a Bucket,” which was docked alongside and is also a shout-out to the Grateful Dead, several club members confirmed.\nDurnan did not return several requests for comment.\nSuffolk County cops have not filed charges or identified any suspects in the case. But authorities have also not publicly ruled out foul play, despite revealing that there was no evidence of violence to the body.\nNolan-O’Slatarra’s death is also being investigated by Suffolk County’s East End Drug Task Force, according to a Tuesday report by Newsday.\n“Until you start ruling stuff out, everything is in play,” a source familiar with the investigation told the outlet.\nNolan-O’Slatarra, a native of the tiny Irish town of Carlow, migrated to the US, where she started as a bottle service girl in SoHo before co-founding East x East, a swimwear label.\n“I always knew I wanted to be successful, that I was money-driven, business-driven, and that fashion is a tough industry and it would be a slow road,” she told the Irish Independent last year.\nHer partner in the East x East, Dylan Grace, posted a moving tribute on Instagram following her death.\n“We dreamed big together, laughed harder than anyone else could understand and built so much from nothing,” he wrote. “I’m truly blessed and grateful to have had you in my life.”\nNolan-O’Slatarra summered in the Hamptons, where she hosted successful pop-up shows and fashion exhibits for wealthy clientele in Montauk and the surrounding area.\nShe had finalized her divorce to ex-Sam Ryan just months before her death, according to court records reviewed by The Post.\n“I represented Mr. Ryan in a matrimonial proceeding. The final papers had been submitted to the court, and before the Judgment of Divorce was issued, I became aware of Ms. Nolan-O’slatarra’s passing and promptly notified the court,” his attorney, David Centeno, said in a statement. “Out of respect for the privacy of those involved and my ethical restraints, I cannot discuss whether there was a prenuptial agreement, mediation, or other private arrangements.”\nNolan-O’Slatarra’s heartbroken mother, Elma Nolan, told the Irish Independent on Aug. 7 that her daughter was planning a trip home to Carlow before her death.\n“I don’t know what happened to my daughter,” she told the outlet. “I feel numb and in shock.”\n— Additional reporting by Brandon Cruz, Joe Marino and Peter Senzamici"
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/ashley-biden-divorcing-husband-howard-krein-after-13-years-of-marriage/",
      "text": "Ex-first daughter Ashley Biden files for divorce from husband, Dr. Howard Krein — alongside snarky Instagram message\nFormer President Joe Biden’s daughter, Ashley Biden, has filed for divorce from her plastic surgeon husband, Dr. Howard Krein, after more than 13 years of marriage, court records show.\nThe 44-year-old ex-first daughter filed the papers in the Philadelphia Court of Common Pleas on Monday, The Post confirmed.\nBiden’s Instagram Story on the same day featured a photo of her walking through a park and flashing a thumbs-up, and was set to the song “Freedom” by Beyoncé, according to the Philadelphia Inquirer, which first reported the divorce filings.\nShe also posted a quote that read: “New life, new beginnings means new boundaries. New ways of being that won’t look or sound like they did before.”\nDetails on what caused the split weren’t immediately clear. Divorce records aren’t made public in Philadelphia.\nBiden and Krein had tied the knot in Greenville, Delaware, back in June 2012 — two years after being set up by her late older brother, Beau Biden.\nHe popped the question on a cliff in Big Sur, California, in late 2011 after getting “Pop’s” permission, People reported at the time.\n“This is the right guy,” said Biden, who was vice president at the time. “And he’s getting a helluva woman.”\nThe couple went on to wed at the St. Joseph on the Brandywine Roman Catholic Church, which is where Ashley was baptized, in front of some 200 guests.\nAshley briefly mentioned her nuptials on the public stage when she was introducing her dad at the Democratic National Convention last year.\n“At the time, my dad was vice president, but he was also that dad who literally set up the entire reception,” she told the crowd.\n“He was riding around in his John Deere 4-wheeler, fixing the place settings, arranging the plants, and by the way, he was very emotional.”\nKrein, 59, is an otolaryngologist and plastic surgeon at Thomas Jefferson University Hospitals in Philadelphia.\nPrior to their split, the couple had been living in Philly.\nThey don’t have children.\nThe Post has reached out to Ashley Biden’s lawyer but didn’t hear back immediately."
    },
    {
      "url": "https://nypost.com/2025/08/05/us-news/ex-doge-staffer-nicknamed-big-balls-left-bloodied-after-savage-dc-carjacking-attempt-by-10-juveniles/",
      "text": "Ex-DOGE staffer nicknamed ‘Big Balls’ left bloodied after savage DC carjacking attempt by 10 juveniles\nA 19-year-old former Department of Government Efficiency (DOGE) staffer was beaten and bloodied by a mob of 10 minors early Sunday as he thwarted a carjacking attempt in the nation’s capital, according to DC police.\nEdward Coristine, whose LinkedIn handle earned him the nickname “Big Balls” at DOGE, was with a woman near downtown DC when he saw the group of juveniles approach their car and “make a comment about taking the vehicle,” according to a Metropolitan Police Department incident report obtained by The Post.\n“At that point, for her safety, [Coristine] pushed his significant other … into the vehicle and turned to deal with the suspects,” the dramatic report continues.\n“The suspects then began to assault [Coristine],” the ex-DOGE staffer told officers, who rolled up on the scene at the same time he was being attacked.\nOfficers patrolling the 1400 block of Swann Street NW — a popular area with several shops, bars and restaurants about a mile north of the White House — noticed “a group of approximately ten juveniles surrounding the complainants’ vehicle and assaulting [Coristine],” the report states.\n“The officers immediately exited their vehicle, and the juveniles began fleeing on foot,” police said.\nDC police were able to nab only two of the young suspects, who were later positively identified by Coristine as being among his attackers.\nA 15-year-old male and a 15-year-old female, both from nearby Hyattsville, Md., were arrested and charged with unarmed carjacking.\nCoristine was treated on scene by DC Fire and EMS for injuries sustained in the assault, according to DC police.\nHe is recovering from a broken nose, concussion and black eye, according to a source familiar with the matter.\nThe group of teenagers “shouted about taking the woman’s car, and then ran across the street,” just before they started to beat Coristine, a source said.\nCoristine then pushed his female companion into the driver’s seat and slammed the door.\n“The gang tried to open the closed doors and slammed [Coristine] against the car extremely loudly while attacking him,” the source added, noting that the woman called 911 from inside the vehicle while Coristine was being beaten.\nThe software whiz also had his iPhone 16, valued at $1,000, stolen during the attack.\nPresident Trump shared a photograph of the aftermath of the assault on Coristine early Tuesday afternoon, showing the former DOGE staffer sitting on the ground, bloodied and with his ripped shirt barely hanging on his body.\nTrump, 79, raged that “crime in Washington, D.C., is totally out of control” in the post, where he also threatened a federal takeover of the district.\nMarko Elez, a one-time colleague of Coristine’s at DOGE, claimed in a social media post that he snapped the photo of his friend shortly after the assault, and described his actions as heroic.\n“My friend Big Balls … is a hero,” Elez wrote on X. “I took this photo after Edward protected a young woman from an attempted carjacking by 8 thugs near Dupont Circle.”\n“Violence like this in the heart of DC is completely unacceptable.”\nFormer DOGE chief Elon Musk also posted about the incident on X, without naming Coristine as the victim.\nCoristine resigned from DOGE in June, according to Fox News, less than a month after Musk departed from the agency."
    },
    {
      "url": "https://nypost.com/2025/08/12/us-news/dc-police-chief-mayor-pledge-support-to-trump-takeover-we-are-here-to-work-together/",
      "text": "DC police chief pledges to support Trump takeover — after 850 feds flood streets on first night\nWASHINGTON — DC Metropolitan Police Chief Pamela Smith said Tuesday that she wants to “work together” to implement President Trump’s directive federalizing her 3,400-officer force — hours after 850 federal agents patrolled the streets of the capital Monday night.\nSmith and DC Mayor Muriel Bowser, an elected Democrat, visited the Justice Department Tuesday morning for meetings with their new law enforcement supervisors, including Drug Enforcement Administration chief Terry Cole, who will oversee the MPD.\nBowser told reporters she too wanted to see “how to make the most of the additional officer support” — as the White House supplements MPD officers with a surge in personnel from federal agencies including the Border Patrol, the FBI, the DEA and US Park Police.\nNational Guard members will also have a presence on the streets of the capital, despite not being empowered to make arrests.\nWhite House press secretary Karoline Leavitt told reporters Tuesday afternoon that “last night, approximately 850 officers and agents were surged across the city,” adding that “they made a total of 23 arrests.”\n“These arrests consisted of homicide, firearms offenses, possession with intent to distribute narcotics, fare evasion, lewd acts, stalking, possession of a high-capacity magazine, fleeing to elude in a vehicle, no permits, driving under the influence, reckless driving and a bench warrant.”\nLeavitt also noted that six “illegal handguns” were confiscated and promised that “this is only the beginning.”\n“Over the course of the next month, the Trump administration will relentlessly pursue and arrest every violent criminal in the district who breaks the law, undermines public safety and endangers law-abiding Americans,” she said.\n“He is going to make our nation’s capital the most beautiful and safe city on Earth, just like he promised on the campaign trail.”\nAlthough Bowser clashed with Trump during his first term over policing matters, she said Tuesday that she wants to make sure that National Guard members and federal law enforcement are “being well used … to drive down crime.”\n“We have more police, and we want to make sure we use them,” the mayor said.\nSmith was optimistic after the meeting with Cole, saying outside the Justice Department that “I think this is going to be a good effort.”\nThe police chief said she was particularly interested in federal help to get “illegal guns” off the streets.\n“We are here to work together with our federal partners,” she added, mentioning too that federal help could be used for “pockets of crime we would like to address.”\nTrump’s Monday announcement federalizing the MPD is allowed for up to 30 days under the Home Rule Act of 1973, which allowed the district limited self-governance.\nCongress must act to extend the federalization of the DC police force beyond 30 days.\nIn his Monday announcement, Trump cited a string of high-profile local crimes and scoffed at Bowser’s insistence that official data show violent crime is at 30-year lows, pointing to a local scandal that erupted last month over alleged pressure from MPD leaders on local district commanders to falsify crime data."
    }
  ],
  "argos_summary": "In Washington, D.C., President Trump's administration has initiated a controversial approach to address homelessness by offering individuals the choice between shelter or jail, as part of a broader crime crackdown. This move follows a surge in federal law enforcement presence in the city, aimed at tackling rising crime rates, highlighted by recent violent incidents. The D.C. police chief has expressed willingness to collaborate with federal authorities to enhance public safety, while local officials are under pressure to implement effective crime reduction strategies.",
  "argos_id": "AEYONY50W"
}