{
  "url": "https://www.nytimes.com/athletic/6546878/2025/08/12/fantasy-football-draft-wrs-scoring/",
  "authorsByline": "KC Joyner",
  "articleId": "cf05fe8e18e24f44926b82c7a672814a",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/11122310/GettyImages-2174052690-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T09:05:25+00:00",
  "addDate": "2025-08-12T09:20:43.972943+00:00",
  "refreshDate": "2025-08-12T09:20:43.972945+00:00",
  "score": 1.0,
  "title": "Cheap fantasy football wide receivers with the best point-scoring floors",
  "description": "These low-cost pass-catchers can protect your fantasy football team from posting a goose egg. Go get 'em.",
  "content": "Football coaches often say that in order to win a game, you first have to not lose it. The same advice applies to fantasy football teams. The early-round picks are essential to notching victories, but it is also imperative that your team avoid low scores or goose eggs (otherwise known as zero-point performances) that can crush a team’s chances at winning.\n\nThese low scores are prevalent at the wide receiver position, where 30 or so targets are split among many players. Add in bye weeks and injuries and filling your lineup can become particularly fraught.\n\nWhat fantasy managers need during those times are reliable, low-cost wide receivers. These pass catchers may have relatively low ceilings, but they provide a consistently high floor that can keep a fantasy team in contention for a win. I call these very valuable prospects lunch pail wide receivers.\n\nLunch pail wide receivers are wideouts with well-defined roles in their offenses. They also need to meet one of two qualifications. The first is to be rostered by less than 60 percent of teams on at least one of the major fantasy football platforms. The other is to have a consensus positional ADP of 42 or lower. This ADP level indicates that these wide receivers aren’t generally considered starters in a 12-team league with three wide receivers and a flex position (assuming roughly half of the flex starters are wide receivers).\n\nUsing those criteria as a guideline, here are this year’s lunch pail wide receivers, starting with someone who is vastly underrated.\n\nNote: All metrics per TruMedia/PFF or Stathead.\n\nColeman was heavily utilized on stretch vertical targets (passes of 20+ air yards) last season, ranking second on the Bills with 18. With Amari Cooper vacating nine stretch vertical targets for this offense, Coleman could see even more downfield usage. That can help set a strong floor, but what earns Coleman a spot on this list is a 9.2 yards per target (YPT) mark on short passes (10 or fewer air yards) that was tops among wide receivers with 25+ short targets. Add in Coleman ranking second on the team in red zone and inside the 10-yard line targets and it trends him towards being a go-to wideout in one of the best offenses in the NFL.\n\nPearsall racked up an impressive 47.6 PPR points in Weeks 17-18 last year. This may have been part of Kyle Shanahan’s plan to prime Pearsall for a larger role in this offense in the 2025 campaign. Available targets shouldn’t be an issue with Deebo Samuel gone and Brandon Aiyuk looking like he will miss at least a few weeks of the regular season while returning from injury. Add in what might be the most favorable cornerback schedule at this position (Pearsall earns a 97 grade out of 100 in my matchup points category) and it should make Pearsall a very good high-floor candidate.\n\nPittman is one of only 10 players to post 110 or more targets in each of the past four seasons. That trend should continue regardless of whether Anthony Richardson or Daniel Jones (or a combination of both) is under center for the Colts this season. Pittman led Indianapolis in receptions inside the 5-yard line last year and was tied for the red zone reception lead. Both of those marks are within his reach this year as well. Pittman is only a season removed from ranking fourth in short PPR PPG, so he has proven to be a quality possession receiver. Merge these factors and Pittman should see enough targets on a weekly basis to set the desired high floor.\n\nHiggins gets some prime pass-catching real estate by taking over the Tank Dell role in the Texans offense. His draft profile says Higgins should be up to that task. Dane Brugler’s The Beast NFL Draft Guide indicates that Higgins has all-around receiving skills that bring to mind his Houston teammate, Nico Collins. Few offenses have two wideouts with three-level skills (short, vertical and stretch vertical), so Higgins can be utilized in ways that should send him 100+ targets. He’s proven to be up to the task of a high workload, having racked up 87 receptions last season for Iowa State. Combine this with Higgins’ 60 receptions of 10+ yards last year (best in the Power 4) and a Big 12-high in red zone catches and it shows why Higgins is a reliable backup who may end up in starting lineups more often than not. With a consensus ADP in the 50s in every league scoring type, Higgins should provide solid value.\n\nAs noted in my Top 25 QB rankings, Jim Harbaugh is a run-first coach but even he wants to throw the ball more than the Chargers did last year. Los Angeles brought in a lot of young pass-catching talent to help, but they also returned Allen to their roster after a year in Chicago. Allen is one of only five players to post seven or more seasons with 100+ targets since 2017. He worked with Justin Herbert for four seasons, so getting in sync should not be an issue. Allen was very good on short passes last year, ranking 24th in short PPR PPG. He was also solid on vertical (48th in PPR PPG) and stretch vertical (43rd) passes, thus providing Herbert with multiple production avenues. It may be best to lean on Allen earlier in the year than later as an age-related precaution, but unless he hits the wall, he should give fantasy managers plenty of solid point totals.\n\nIt may have seemed like Father Time was catching up to Thielen for a spell last year, but the veteran proved that wasn’t the case in the final third of the season. From Weeks 13-18, Thielen ranked 12th among wide receivers in both standard and PPR points. That’s part of why Thielen had some incredible PPR PPG numbers last season. He ranked 28th in short, 15th in vertical and seventh in stretch vertical PPR PPG in 2024. It was a major factor in Bryce Young’s late season production burst. Head coach Dave Canales isn’t about to move production of that caliber out of a lineup that needs all of the big-play production it can get. And he certainly wants Thielen’s veteran presence to help Carolina’s young wide receivers develop more quickly. It should be a recipe for a very low-cost, high-floor roster addition.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6434875/2025/07/29/fantasy-football-2025-draft-kit-rankings-cheat-sheet-player-projections-sleepers-and-more/",
    "https://www.nytimes.com/athletic/6506574/2025/07/23/fantasy-football-2025-qb-rankings-burrow-mahomes-jackson/",
    "https://www.nytimes.com/athletic/the-beast/2025/player/jayden_higgins-wide_receiver-THkpc7pfDaXTZn6w/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "fantasy football wide receivers",
      "weight": 0.087866604
    },
    {
      "name": "wide receivers",
      "weight": 0.08636544
    },
    {
      "name": "lunch pail wide receivers",
      "weight": 0.083274476
    },
    {
      "name": "last season",
      "weight": 0.07854141
    },
    {
      "name": "last year",
      "weight": 0.077349514
    },
    {
      "name": "stretch vertical targets",
      "weight": 0.071502686
    },
    {
      "name": "fantasy football teams",
      "weight": 0.069349214
    },
    {
      "name": "Lunch pail wide receivers",
      "weight": 0.06794451
    },
    {
      "name": "short passes",
      "weight": 0.067508824
    },
    {
      "name": "stretch vertical PPR PPG",
      "weight": 0.06359477
    }
  ],
  "topics": [
    {
      "name": "Football"
    },
    {
      "name": "Fantasy Sports"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.98388671875
    },
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97412109375
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.701171875
    },
    {
      "name": "/Sports/Fantasy Sports",
      "score": 0.64697265625
    },
    {
      "name": "/Games/Gambling/Sports Betting",
      "score": 0.369873046875
    }
  ],
  "sentiment": {
    "positive": 0.32576424,
    "negative": 0.16460633,
    "neutral": 0.5096294
  },
  "summary": "Fantasy football players need reliable, low-cost wide receivers with high point-scoring floors in order to avoid low scores or goose eggs (otherwise known as zero-point performances) that can severely impact their team's chances at winning. These low scores are particularly prevalent at the wide receiver position, where 30 or so targets are split among many players. The list includes wideouts with well-defined roles in their offenses and a consensus positional ADP of 42 or lower. They must meet criteria such as being rostered by less than 60 percent of teams on at least one of the major fantasy football platforms. These players are considered lunch pail wide receivers, with their low ceilings but high floor that can keep a fantasy team in contention for a win. Coleman was heavily used on stretch vertical targets last season, ranking second on the Bills with 18.5 points. Pearsall, Pittman, Higgins, and Pittman are considered high-floor candidates for fantasy football.",
  "shortSummary": "Fantasy football teams need reliable, low-cost wide receivers with high-scoring floors to avoid low scores and injuries, particularly in the face of schedule challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "98d36896f9e4416d98a60bf1e5d6a385",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6506574/2025/07/23/fantasy-football-2025-qb-rankings-burrow-mahomes-jackson/",
      "text": "Every year, the quarterback position becomes more important in fantasy football. Last season, 12 quarterbacks scored 282 or more fantasy points, marking the fourth time in the past five seasons that 10 or more quarterbacks reached 282+ points. While a longer schedule contributes to some of the increase in scoring, before 2018, there was only one season with 10+ QBs reaching 282 points, and no other season with seven or more QBs at that scoring level — so, there’s more to the increase than one additional game.\nAdvertisement\nThis scoring largesse means fantasy managers must get the most out of the quarterback position. For the second consecutive season, I’m providing The Athletic’s readers access to my annual deep dive write-ups on QBs. I have been writing these for my fantasy football draft guide for the past 22 seasons (the 2025 edition can be found here).\nThe downloadable chart below provides quarterback grades, described here:\nThere are also matchup points, fireworks points and pass rush points totals for each player. Matchup points show expectations for how favorable or unfavorable the overall opposing pass coverage will be in 2025. Fireworks points indicate how likely the quarterback’s team will get into high-scoring games this year. The pass rush points total shows the relative amount of pass rush pressure the quarterback is slated to face this year.\nAll three are graded on a 1 to 100 scale, with 100 being most beneficial to the quarterback.\nThe chart concludes with a suggested draft round and auction dollar value for each player ($200 format). The draft round is based on 12-team leagues with only one starting quarterback and will need to be adjusted for fantasy managers in 2QB or SuperFlex leagues.\nThe write-ups also sometimes include references to a color-coded system regarding individual matchups, which detail whether a player has a high volume of green-rated (favorable) or red-rated (unfavorable) matchups on the 2025 schedule. For example, Patrick Mahomes has five green-rated fireworks matchups in Weeks 1-9, meaning five contests in that span could turn into scoreboard shootouts.\nFinally, the draft strategy is based on consensus ADPs at FantasyPros.\nNow that the preliminaries are out of the way, let’s dive into a synopsis of the top 25 quarterbacks!\n1. Josh Allen, Buffalo Bills\nUpside: Allen is on arguably the greatest quarterback scoring streak in NFL history. He has finished first or second in QB fantasy scoring in each of the past five years, which has happened only once before (Aaron Rodgers in 2008-12). That Allen finished ninth in the league in red zone rushing touchdowns despite placing second on his team illustrates the potential of Buffalo’s potent offense. He finished first on the team in rushing touchdowns inside the 5-yard line, so his goal-line talents are still highly utilized. While Allen’s rushing prowess helps his fantasy numbers, he also finished eighth in red zone touchdown passes, eighth in short-pass fantasy points per game (FPPG) and eighth in passing FPPG. He had only eight giveaways last year, protecting the ball as well as any quarterback, and Buffalo returns all five offensive line starters.\nAdvertisement\nDownside: Allen’s production is far too reliant on short passes and rushing. He placed 17th in vertical pass FPPG and 25th in stretch-vertical FPPG. James Cook led the team in rushes inside the 10- and 5-yard lines, indicating Buffalo doesn’t want Allen to continue to take the wear and tear of those hits. The Bills could also rely more on 220-pound Ray Davis for goal-line rushes. The receiving corps is similar to last year’s pass-catching group, so Allen won’t have new personnel to help with those subpar aerial numbers. The low fireworks points total suggests high-scoring games could be at a minimum this year.\nOverall: There isn’t a more consistent elite player at any position in fantasy football. That is more than enough to tie Allen with Lamar Jackson for the top spot on the QB draft board.\nDraft strategy: He will be a mid- to late-second round pick in most draft rooms.\n2. Lamar Jackson, Baltimore Ravens\nUpside: Jackson was the best fantasy QB last year, ranking first in overall fantasy points and FPPG. His FPPG total was over 3 points higher than second place. Jackson is no longer heavily reliant on rush production. He finished second in pass FPPG, sixth in short-pass FPPG, first in vertical FPPG and seventh in stretch-vertical FPPG. Jackson led the league in red zone touchdown passes even with Derrick Henry in the backfield. Nine Baltimore players caught at least one red zone touchdown pass in 2024, so this pass-centric red zone approach is by design and not happenstance. The Ravens return four offensive line starters. Baltimore has a high passing matchup points total versus a middling rush matchup points mark, so there is a matchup lean to throw the ball this season.\nDownside: Jackson’s fantasy scoring track record isn’t as strong as generally thought. Last year was only the second time Jackson has finished as the top-scoring QB, and the first time was a half-decade ago (2019). His highest season-ending rank outside of that was fourth in 2023, and Jackson never placed higher than ninth in any other season. Part of this is due to durability, as Jackson missed five games in the 2021 and 2022 campaigns. His passing production is currently a one-year trend. He was 15th in pass FPPG in 2023. Those aerial numbers could regress with defenses having a full offseason to adjust. Jackson had zero rushes inside the 5-yard line, so Baltimore looks to have taken him out of the rush offense on goal-line plays. That’s why he was sixth in QB rush FPPG despite leading his position in rush yards.\nAdvertisement\nOverall: Jackson is tied with Josh Allen for the top fantasy quarterback honor this year.\nDraft strategy: He’s worthy of a second-round pick, but going any higher than that is ill-advised given the potential for even a marginal scoring downgrade.\n3. Jalen Hurts, Philadelphia Eagles\nUpside: Hurts makes leading all quarterbacks in rushing points look easy. He did it in the 2024 season for the third time in four years (and he finished second in the other season). He achieves this mainly due to goal-line success. Hurts led the Eagles in carries inside the 5-yard line and tied for second in the league in that category. The tush push is still a legal play, so look for new offensive coordinator Kevin Patullo to use it as often as possible. The combination of A.J. Brown and DeVonta Smith could allow Hurts to improve upon his No. 25 rank in passing FPPG if head coach Nick Sirianni and Patullo decide to throw more to take advantage of a really favorable matchup points total.\nDownside: His league-leading quarterback rush point total usually leads Hurts to a top-three overall ranking, but last year it resulted in an eighth-place finish in QB points. Part of the lower finish was due to missed time, but Hurts throwing only 361 passes was another key factor. Low passing volume directly resulted from Saquon Barkley being the offense’s focal point. Since Barkley wants a second straight season with 2,000+ rushing yards, Hurts may find throwing much more than 400-450 passes challenging. Hurts has played in 15 games in three of the past four years, indicating he’s apt to miss a game here or there. Losing OC Kellen Moore could be a huge play-calling downgrade. The pass rush schedule points total is the lowest in the category.\nOverall: Hurts doesn’t throw often enough to contend for the top quarterback spot, but he does rush enough to earn a place in the top three.\nDraft strategy: Since quarterbacks typically don’t start getting selected until the end of Round 2, Hurts should be on most draft boards in Round 4.\n4. Joe Burrow, Cincinnati Bengals\nUpside: No team gets more utilization out of its best player than the Bengals, which is how Burrow led all QBs in pass FPPG, short-pass FPPG, red zone targets and inside-the-10 targets in 2024. He insisted that Cincinnati’s frugal ownership pony up the cash to keep Ja’Marr Chase and Tee Higgins, so Burrow still has the best 1-2 wide receiver combination in the NFL. The Bengals had to pass as often as they did last year in large part because their defense was beyond atrocious, and it may not be much better this season, so Burrow may once again have to try to win plenty of shootouts. Burrow consistently adds a reasonable number of fantasy points on the ground.\nAdvertisement\nDownside: HC Zac Taylor knows that shootouts are 50/50 propositions, at best, even when a team has the caliber of offense Cincinnati has. That’s why Taylor hired DC Al Golden, whose primary goal will be to limit the number of high-scoring games the Bengals have this year. That dovetails nicely with a midrange fireworks points total and a schedule with only two red-rated fireworks matchups in Weeks 1-12. Burrow has dealt with myriad injuries in his college and pro careers, so he has a low rushing production ceiling and had only three carries inside the 5-yard line last year.\nOverall: Cincinnati had to lean on Burrow quite heavily last year, and he responded with a lights-out performance, yet it only resulted in a No. 3 ranking in QB points. The Bengals’ defensive changes should result in a marginal reduction in production, which moves Burrow just outside of the top three at his position.\nDraft strategy: The fantasy community knows a great passer who doesn’t run the ball will usually rate behind superb dual-threat quarterbacks, so Burrow will be generally (and properly) valued as a third-round pick in most draft rooms. While I have him behind Hurts, his ADP on FantasyPros puts him ahead of Hurts, which is why I have Burrow going in Round 3, while I suggest taking Hurts in Round 4.\n5. Jayden Daniels, Washington Commanders\nUpside: Winning the Offensive Rookie of the Year award is impressive, but don’t forget that Daniels was also one of the NFL MVP front-runners for a good portion of last season. He scored as many rushing FPPG as Josh Allen despite having half as many rushing touchdowns. Daniels should have better passing numbers this season with the addition of Deebo Samuel and what may be the most improved offensive line personnel in the league. Daniels had nearly as many goal-line carries (10) as team leader Brian Robinson (11). Those resulted in only four scores, which could increase this year. Daniels and the Washington coaching staff are working hard to increase Daniels’ playbook capabilities beyond his rookie season limitations.\nDownside: Daniels wasn’t very productive on long passes last year. He ranked 21st in vertical FPPG and 20th in stretch-vertical FPPG. Samuel was 46th in stretch-vertical PPR PPG and 71st in vertical PPR PPG last year. He must improve in both departments to help Daniels reach new FPPG heights on those distant aerials. There is little quality receiving depth behind Samuel and Terry McLaurin. If Samuel doesn’t pan out and McLaurin misses any time due to injury, Daniels’ pass production could be hamstrung by what would be one of the worst pass-catching groups, and all of the schedule elements appear unfavorable.\nOverall: Daniels scored 355.8 points last year. It was the 34th time a quarterback has reached that point total. Only three quarterbacks have tallied back-to-back seasons of that nature. Unfortunately for Daniels, those three are Josh Allen (2020-24), Jalen Hurts (2022-23) and Patrick Mahomes (2020-22). Add in Joe Burrow (372.8 points last year), and at least four other quarterbacks can reach or top that point total. That’s why, even though this year’s projection has Daniels posting a campaign equal to 2024, he’s only my QB5 in fantasy.\nDraft strategy: Daniels won’t make it past the third round in nearly all drafts.\n6. Patrick Mahomes, Kansas City Chiefs\nUpside: Mahomes started slow last season, but turned things around in Week 8 with an 18.18-point performance. That was the beginning of a stretch that ended with Mahomes ranking eighth in QB FPPG from Weeks 8-17 and finishing less than 3 points away from a top-six showing. With Hollywood Brown (coming back from injury), Xavier Worthy and Rashee Rice (who played in only four games last year and will likely face a suspension due to his involvement in a 2024 vehicle accident), the Chiefs have the talent to upgrade their subpar vertical passing production significantly. Kansas City has shored up its offensive line to emphasize downfield passing. Mahomes is extraordinarily durable, having missed only two games in seven seasons. There are five green-rated fireworks matchups in Weeks 1-9.\nAdvertisement\nDownside: The Chiefs’ downfield passing attack needs more than a nominal upgrade, given the dismal long pass numbers this offense posted. Mahomes ranked 27th in vertical FPPG and 28th in stretch-vertical FPPG in 2024 — the second consecutive season Mahomes posted horrible numbers on downfield throws. Andy Reid worked just as hard to fix the problem then as now. Travis Kelce’s regression isn’t helping, nor is the consistent lack of quality pass blocking at offensive tackle. Rice is all but certain to be suspended for two to six games. Mahomes has one of the most difficult schedules from pass rush and pass coverage perspectives.\nOverall: Mahomes may no longer contend for the top overall fantasy QB spot, but he still has a well-defined path to be a top-six fantasy quarterback.\nDraft strategy: Fantasy managers who want upper-tier production without paying the draft premium for one of the top five quarterbacks should look to draft Mahomes in Round 5.\n7. Jared Goff, Detroit Lions\nUpside: Goff proves that a fantasy quarterback doesn’t need a huge pass volume to produce strong fantasy numbers. He was third in pass FPPG, second in short-pass FPPG and in the top 10 in vertical and stretch-vertical FPPG — which led to a career high No. 6 ranking in QB points. This year, he could have an even higher ceiling. New OC John Morton may be more aggressive with the vertical passing game than Ben Johnson. Morton has indicated he will send as many long passes as possible to Jameson Williams, who Morton said is in line for a breakout season. Goff has missed only six games in the past eight seasons. The combined total of matchup and fireworks points is the highest at his position.\nDownside: Will Morton be a play-calling downgrade from Johnson? Any decline here could have a notable impact, given the relatively low pass volume. Goff has thrown 12+ interceptions in five of the past seven seasons. He adds almost nothing via the ground, with only four quarterbacks having a lower rush FPPG mark in 2024. The Lions saw the downside of shootouts late last year, so HC Dan Campbell may decide to be judicious in passing aggressiveness to prevent them. Center Frank Ragnow’s retirement and the low pass rush points could be a hindrance.\nOverall: Goff was a mid-tier QB1 last year, without Williams’s potential full breakout season. Factor in the general green light of a schedule, and Goff should have another mid-tier QB1 point total.\nDraft strategy: Goff could generate one of the best returns on investment at quarterback. He’ll be available as a Round 7-8 pick and should generate at least fifth-round value.\nAdvertisement\n8. Caleb Williams, Chicago Bears\nUpside: Williams displayed his dual-threat skills on many occasions last year. He rushed for just short of 500 yards, which played into his ranking tied for eighth among QBs in games of 22+ points. Surprisingly, he did not record a rushing touchdown, so the yards led to a middling No. 14 ranking in rush FPPG, which Williams should easily be able to top this season. The Bears’ offense ought to be much better with HC Ben Johnson calling plays. Chicago made multiple investments to upgrade their abysmal offensive line and added rookies Luther Burden and Colston Loveland to the passing game. Being in the NFC North leads to a high fireworks points total.\nDownside: The head coach change means another adjustment to a new system. The Lions were third in rush attempts and 16th in pass attempts last season. That’s Johnson’s run/pass ratio goal, so this won’t be a pass-centric offense. There were times when Williams seemed to play it safe last year, which led to his throwing only six picks, thus preventing an issue where he forced passes into coverage like in college, but it is also why Williams had seven games with fewer than 10 points in 2024. If he is more aggressive on throws this year, it could result in more picks.\nOverall: The combination of the coaching change and personnel upgrades should give Williams at least as many big games as last year and reduce the number of single-digit scores. These paths to additional points project Williams to move into the middle of the QB1 tier.\nDraft strategy: Williams is the perfect prospect for fantasy managers looking for a relatively low-cost quarterback with the potential for 300+ points. That value proposition justifies a pick in Round 7, yet you may be able to draft Williams as late as Round 9.\n9. Baker Mayfield, Tampa Bay Buccaneers\nUpside: Mayfield proved that his 2023 QB1 performance was no fluke. He ranked fourth in overall FPPG, fourth in pass FPPG, third in short-pass FPPG and ninth in vertical pass FPPG. Tampa Bay returns every offensive starter from last year, and it added another aerial weapon in Ohio State wide receiver Emeka Egbuka. Mayfield didn’t skip a beat despite a change in offensive coordinators last season, so the move to new OC Josh Grizzard (the Buccaneers’ pass game coordinator in 2024) should be smooth. Mayfield isn’t an impact rusher, but he was one of only 12 quarterbacks to average 3+ FPPG on the ground. The pass rush schedule is a cakewalk. There are eight green-rated matchups all year, including four straight in Weeks 14-17, and only one red-rated matchup.\nDownside: Tampa Bay’s offense will likely be an All-Pro short to start the season. Left tackle Tristan Wirfs had late offseason knee surgery and is slated to begin the year on the PUP list. Mayfield and Lamar Jackson were the only quarterbacks with two streaks of four or more games with 20+ points. Since Jackson has done that five times in his career, and these were Mayfield’s only ones, the Bucs’ QB is a regression candidate. The 373-rush yard total he posted last year was more than double his previous single-season high, suggesting a drop-off is coming.\nOverall: There is a lot to like here, but that’s not enough to dissipate the cloud of regression uncertainty. Even so, Mayfield should have a high floor that keeps him near the middle of the QB1 tier.\nAdvertisement\nDraft strategy: Mayfield will be a popular pick in Rounds 4-5 but should be selected in Rounds 7-8.\n10. Kyler Murray, Arizona Cardinals\nUpside: Murray has a strong track record of solid or better production in many areas. Last year, he was sixth in rush FPPG, 13th in short-pass FPPG, and 12th in overall FPPG. The addition of Marvin Harrison led to a notable improvement in Murray’s vertical FPPG. Murray was ninth in pass attempts inside the 10-yard line, which indicates OC Drew Petzing trusts Murray to throw in that area of the field. Harrison and Trey McBride give Murray one of the league’s top WR/TE combinations. Murray is now two years removed from knee surgery and may get back to his former top-flight rushing form. He also has one of the most favorable matchup points totals at his position.\nDownside: The vertical pass improvement with Harrison’s addition was relative. Murray went from dead last in vertical FPPG in 2022 and 2023 to 26th in 2024. Murray also had the fifth-lowest stretch-vertical FPPG mark. Last year was only the third time in six NFL seasons Murray played in every game. Arizona has a new offensive line coach in his first year as an NFL coach at any level, and the Cardinals have two new offensive line starters. Murray’s rush production includes almost no goal-line carries (only one in 2024). The Cardinals may not want to risk injury with those types of rushes. Arizona has seven red-rated vertical pass defense matchups in an eight-game span from Weeks 3-11. The Cardinals have a very favorable rush defense schedule that could put a low ceiling on the team’s pass attempts.\nOverall: Murray has been a QB1 on four occasions but ranked higher than eighth in only one of those campaigns (third in 2020). There is enough to suggest that Murray has QB1 value in 2025, but he also has the same limited ceiling as his historical trends indicate. Add it up and he’s a low-end QB1.\nDraft strategy: Murray’s value level is well known, so he’ll move off draft boards sometime in Rounds 7-9.\n11. Bo Nix, Denver Broncos\nUpside: It took a few weeks for the world to see what Sean Payton saw in Nix, but by the end of the year, it was clear that Nix is a franchise quarterback. Fantasy managers also saw this, with Nix finishing between seventh and ninth in overall, pass, rush and short-pass FPPG. Nix was superb in the red zone, placing tied for fifth in touchdown passes despite ranking 11th in red zone pass attempts. Denver returns all five starting offensive linemen, a group that ranked second in pass pressure rate allowed last year. The improvements to the ground game should augment the Broncos’ passing prowess. Payton will get very creative with Evan Engram’s usage in this offense, thus providing Nix with a potential matchup advantage on many occasions.\nDownside: The receiving corps outside of Courtland Sutton and Engram is unproven. Relying too heavily on those two could be a big issue if Engram has another injury-shortened season. Denver’s rushing attack is a work in progress. Most of Nix’s rushing production occurred on scramble plays, so defenses that spy him can limit his rushing yardage total, which is partially why Nix rushed for fewer than 10 yards on seven occasions last year. The three matchup categories don’t offer much in terms of upside potential.\nAdvertisement\nOverall: Nix has proven he is capable of QB1 production. The issue is that the competition at the QB position is incredibly fierce, and Nix has downside elements that hurt his relative value. Rate him as a reliable low-end QB1.\nDraft strategy: He’s a seventh- or eighth-round value who will go earlier than that in many drafts.\n12. Brock Purdy, San Francisco 49ers\nUpside: Purdy didn’t quite live up to the excellence of the 2023 season, where he led the league in eight standard or advanced metric categories, but he still achieved some success. He was a top 11 quarterback in total FPPG, rush FPPG and vertical FPPG. To do that in a season where the 49ers’ offense dealt with major injuries is a testament to Purdy’s talents. Getting Christian McCaffrey back at full strength (as early reports indicate) is a massive upgrade for this offense. The re-signing of George Kittle keeps the 49ers’ pass-catching talent at a very high level. The matchup points total is unmatched.\nDownside: The past two years make it clear that Purdy will be hard-pressed to obtain 500 pass attempts in this offense. The same players injured last year have durability concerns that could lead to missed time this year (Brandon Aiyuk could start the season on the PUP list). The offensive line depth is lacking, so any injury could hamper this group. Purdy is one of the most interception-prone quarterbacks in the NFL. Outside of Aiyuk, the wide receivers are talented yet inconsistent. There is only one green-rated fireworks matchup all season long.\nOverall: When everything went well for Purdy in 2023, he ended up with a No. 6 ranking. When things didn’t go so well for the 49ers in 2024, Purdy ranked 13th. This year’s ranking splits the difference and places him at the border of the QB1/QB2 level.\nDraft strategy: The tail end of QB1s come off draft boards in Round 8.\n13. Jordan Love, Green Bay Packers\nUpside: Love was one of only four QBs in the top six in vertical and stretch-vertical FPPG last year. He did this despite suffering through injuries to his knee and groin, which speaks well to his grit. The Packers’ long passing could be even better this year with the addition of first-round speedster Matthew Golden. Green Bay already had the deepest roster of WR/TE talent before drafting Golden and third-round wideout Savion Williams. A healthy Love should vastly improve upon last year’s dismal No. 27 ranking in QB run FPPG and a No. 16 ranking in short-pass FPPG. The vaulted matchup and fireworks points totals augur for the Packers to have many high-scoring games this year.\nAdvertisement\nDownside: The free-agent signing of 325-pound Aaron Banks and drafting of 335-pound Anthony Belton show the Packers are building an offensive line to avoid those high-scoring games. A greater emphasis on power rushing could reduce Love’s short-yardage passing chances, making improving upon a No. 18 ranking for passes inside the 10 more difficult. Green Bay may scale back Love’s rushing ambitions to preserve his health. He’s thrown 22 interceptions the past two seasons. There are five red-rated pass rush matchups on the 2025 schedule.\nOverall: These elements don’t suggest Love will return to his No. 5 ranking from the 2023 season. However, they indicate a likely improvement over last year’s No. 17 rankings in both FPPG and overall QB points, earning Love a low-end QB1 rating.\nDraft strategy: The fantasy community is viewing Love through a 2024 prism and thus predicting another mid-tier QB2 showing, which doesn’t match his low-end QB1 ranking here, so Love can be an excellent value pick in Rounds 9-10.\n14. Dak Prescott, Dallas Cowboys\nUpside: Prescott has a track record of fantasy scoring success, having finished in the top 10 in QB scoring in three of the past six seasons. He’s only one season removed from arguably the best passing campaign of his career. The combination of CeeDee Lamb, George Pickens and Jake Ferguson gives the Cowboys one of the best starting WR/TE trios in the business. The improvements in the running game should help take some coverage pressure away. HC Brian Schottenheimer indicates the Dallas offense will have a lot more motion, shifts and play-action plays, all of which can help Prescott’s per-play production.\nDownside: Schottenheimer’s dad was a run-first coach. Schottenheimer’s mentor (Pete Carroll) was a run-first coach. Schottenheimer’s OC (Klayton Adams) has a run-centric background. Combine that with Jerry Jones noting that Schottenheimer bit his lip regarding the Cowboys’ pass-centric approach under Mike McCarthy and Dallas revamping its entire RB corps, and it overwhelmingly suggests this will be a ground-based offense. Prescott had mediocre FPPG totals in overall passing, short passing and the run game last year. Prescott has missed 26 games due to injury over the past five years, and the schedule is largely unfavorable.\nOverall: The Dallas management and coaching staff are wise to use a run-first approach to maximize Prescott’s production while limiting his wear and tear. That’s great for the team, but not fantasy managers. It drops Prescott to the high end of the QB2 tier.\nDraft strategy: Prescott is a prime candidate to be drafted above his projected fantasy value. He should be selected in Rounds 9-10, but will be selected earlier quite often.\nAdvertisement\n15. Justin Fields, New York Jets\nUpside: Fields is one of the best rushing quarterbacks in fantasy football. Consider that his 8.9 rush FPPG mark would have ranked second at QB had he posted enough games to be listed as a qualifier. The Jets will be one of the most run-heavy teams in the NFL this year. RPOs will be a big part of that, so Fields could end up with a lot of carries this year. There is even talk that New York will use Fields on the tush push play, which could result in a spike in rushing touchdowns. Garrett Wilson and rookie Mason Taylor will provide maximum production on as many as half of Fields’ pass attempts. Only one quarterback has a higher matchup points total.\nDownside: He couldn’t keep the Pittsburgh starting job because his passing prowess is unacceptable. Fields would have ranked 29th in short-pass FPPG, 30th in vertical FPPG and 34th in stretch-vertical FPPG had he played enough games to qualify. It’s not as if Pittsburgh had terrible downfield targets, because Russell Wilson ranked in the top four in vertical and stretch-vertical FPPG after replacing Fields. The Jets’ new offensive coordinator, Tanner Engstrand, is in his first year as an NFL OC. New York’s offensive line can run block, but it leaves something to be desired in pass blocking. The receiving corps behind Wilson and Taylor is mediocre or worse.\nOverall: When a quarterback can post nearly 9 fantasy points per game on the ground, he doesn’t need much passing production to be a QB1. Fields’ aerial talents don’t quite get him to that level, but he’s just a step or so behind it.\nDraft strategy: The QB1 class and top of the QB2 class won’t be cleared off draft boards until at least Round 9. Consider taking Fields at any point after that.\n16. J.J. McCarthy, Minnesota Vikings\nUpside: Michigan has had its share of quality quarterbacks (including Tom Brady) over the years. Keep that in mind when noting McCarthy is the Wolverines’ career leader in interception rate, completion percentage, pass efficiency and TD-to-INT ratio. HC Kevin O’Connell knows how to build game plans to get the most out of his quarterback’s talents. The Vikings may have the most improved offensive line in the league. Few, if any, teams have a receiving trio the equal of Justin Jefferson, Jordan Addison and T.J. Hockenson. McCarthy showcased some planned rush and scramble ability at Michigan, both of which will be needed in Minnesota. No team has a better fireworks point total, with nearly half of the season comprising green-rated matchups.\nDownside: He’s essentially a rookie starter. The upgraded offensive line could be used for run blocking, considering that Minnesota now has the makings of a platoon backfield with Aaron Jones and Jordan Mason. O’Connell may also decide to rely on the run to help avoid what could be a considerable amount of scoreboard shootouts versus those high-octane offenses. Considering the entire interior was revamped, the offensive line could take some time to gel. Addison could end up missing time due to a possible suspension.\nOverall: A Minnesota quarterback has finished in the top nine in QB points in two of the past three seasons (Sam Darnold ranked ninth in 2024; Kirk Cousins ranked eighth in 2022). Since those were veterans and McCarthy is a first-year starter, this projection doesn’t quite generate QB1 value, but McCarthy is just outside that tier.\nAdvertisement\nDraft strategy: McCarthy could be one of the best QB value picks. He’s apt to post borderline QB1 value for what should be a Round 10-11 draft pick.\n18. Drake Maye, New England Patriots\nUpside: He didn’t get on the field much until Week 6 last year, but after that, Maye showed why he was the third overall pick in the 2024 NFL Draft. Maye ranked 13th in FPPG in Weeks 6-17 and was only 27 points away from a top-10 finish in that time frame, and he did it with a lousy offense. New England tried to make improvements this offseason. The Patriots added rookies TreVeyon Henderson and Kyle Williams, veteran receivers Stefon Diggs and Mack Hollins, and a ton of offensive line talent (including a great left tackle in rookie Will Campbell). Last year’s numbers show Maye can rush for over 500 yards in a full season. Josh McDaniels returning as OC is an upgrade, and the schedule is generally helpful.\nDownside: Maye had some of the worst fantasy passing numbers in 2024. He ranked 27th in short-pass FPPG, 32nd in vertical FPPG and 23rd in stretch-vertical FPPG. Diggs is coming off an injury and has already had a notable off-field issue. Williams is a rookie, and Hollins has caught more than 31 passes only once in seven NFL seasons. The offensive line could be in flux early on, given the personnel overhaul. HC Mike Vrabel’s Tennessee teams finished higher than 30th in pass attempts once — and even then, it was 25th. This team could go the run-heavy route with Henderson and Rhamondre Stevenson.\nOverall: Maye’s fantasy value will tend to go as his rushing value goes. Vrabel and McDaniels will get full utilization of that skill set. Add that to what should be improved passing numbers (even if “improved” is a relative term in this case), and Maye gets a mid-tier QB2 ranking.\nDraft strategy: He will be one of the many mid-tier QB2s taken in Rounds 10-11.\n18. Justin Herbert, Los Angeles Chargers\nUpside: Jim Harbaugh is a run-first coach, but even he wants to throw the ball more than the Chargers did last year. That’s why Los Angeles drafted Tre Harris and Oronde Gadsden. The vertical game doesn’t need much improvement, given that Herbert ranked second in stretch-vertical FPPG and fifth in vertical FPPG. There is developmental receiving upside on the roster with Ladd McConkey, who was good as a rookie and can be better this year, and Quentin Johnston. This offensive system helped Herbert set career lows in interceptions and interception rate. Herbert has tallied 200+ rush yards and 2+ rush touchdowns in all but one of his five NFL seasons.\nDownside: Harbaugh may want to call more pass plays, but he will never operate a pass-heavy offense. Even with the additions of Harris and Gadsden, this receiving corps needs a lot of improvement to get to par. The offensive line was mediocre last season and could be a work in progress this year. There are only two green-rated fireworks matchups all season, and the campaign begins with three red-rated pass rush matchups in Weeks 1-5.\nAdvertisement\nOverall: A Harbaugh offense will never get a quarterback to post substantial fantasy numbers on quantity alone. Quality is required, and this offense doesn’t have enough of it, so Herbert rates as a mid-tier QB2.\nDraft strategy: Herbert is in the ninth-to-tenth-round range this year.\n19. Trevor Lawrence, Jacksonville Jaguars\nUpside: The Jaguars’ new coaching staff is looking for a reset for Lawrence. They’ve got a lot to work with. Before last year, Lawrence had missed only one game in his NFL career. He’s posted top-12 vertical and stretch-vertical numbers before and was just outside of those ranges in last year’s debacle of a season. This offense won’t use him on many planned rushes, but Lawrence is still a productive scrambler and doesn’t shy away from goal-line work. Few teams can match the pass-catching talents of Brian Thomas and rookie Travis Hunter. The offensive line additions could turn a weakness into a strength (or at least no longer a weakness).\nDownside: Adjusting to a new offensive system requires time. Depending on how the preseason plays out, the offensive line will likely have at least two new starters and could have more changes. Hunter and Thomas have one combined NFL season between them. New OC Grant Udinski is only 29 years old and has never been a full-time OC. Lawrence has dealt with injuries for two straight years, which could be a big issue behind a revolving door offensive line. There is only one green-rated fireworks matchup all year, and the season ends with five red-rated vertical coverage matchups in Weeks 12-17.\nOverall: The Jaguars are going all out to build a strong offense around Lawrence. That’s a long-term plus, but fantasy managers can’t count on that upgrade occurring in the short term, leading to a mid-tier QB2 ranking for Lawrence.\nDraft strategy: There won’t be much clamoring to select Lawrence, so he should be available as late as Rounds 10-11.\n20. Michael Penix, Atlanta Falcons\nUpside: The 24.98-point total Penix posted in Week 18 shows there is a high ceiling here if things go well. Penix was the most prolific passer in college football in his 2023 campaign at Washington, leading the nation in passing yards and passing yards per game. Penix also scored seven rushing touchdowns in two years as the Huskies quarterback, so he has a path to marginal rush production. The Falcons have above-average talent at WR/TE and return four offensive line starters, which could lead to an aerial boon since stopping Bijan Robinson will be the primary goal of most defensive coordinators. The passing matchup points total is near the league’s top, giving Penix ample favorable matchup opportunities.\nAdvertisement\nDownside: Kirk Cousins had these top-flight pass-catching talents last year, and he ranked 27th in stretch-vertical FPPG and 23rd in short-pass FPPG. Robinson was second in rushes inside the 10-yard line last season and is on track to mimic that trend in 2025, so Penix isn’t likely to get many goal-line passing opportunities. Penix did next to nothing on the ground outside of the rushing touchdowns in college. This offense will take a similar hands-off rushing approach. Cousins is still on the roster, so he could be a relief pitcher if Penix struggles. Atlanta has the highest rush defense matchup points total, a factor that could reduce the Falcons’ passing volume.\nOverall: He can be a high-volume passer, but this is a Bijan Robinson-centric offense. Combine that with this being Penix’s first full year as a starter and the limited rush volume, and Penix is a midrange QB2.\nDraft strategy: Penix is rated higher here than at most outlets and is a potentially good ROI pick in Rounds 12-13.\n21. Tua Tagovailoa, Miami Dolphins\nUpside: Few fantasy quarterbacks were more productive in the passing game last year. Tagovailoa ranked sixth in overall FPPG and fourth in short-pass FPPG. He has tallied strong vertical and stretch-vertical numbers in the past, making a turnaround from last year’s horrible downfield passing pace (30th in vertical FPPG) possible. There may not be a more talented wide receiver combination than Tyreek Hill and Jaylen Waddle. New Miami tight end Darren Waller provides even more downfield receiving skills. HC Mike McDaniel is one of the most innovative play callers around. The high pass rush points could help Tagovailoa stretch the field vertically, as will the very high matchup points total.\nDownside: McDaniel switched this offense from a vertical scheme to a horizontal one because he wanted to keep Tagovailoa healthy — a major emphasis given the breadth and severity of Tua’s many head injuries over the years. The Miami offensive line has as many question marks this year as last, so short passing may again be the modus operandi. The injury issue has another downside: eliminating almost all of Tagovailoa’s rush value (30th in rush FPPG in 2024). Tagovailoa is one of the most fumble-prone quarterbacks. This team could fire McDaniel during the season if things go south.\nOverall: Unless or until Tagovailoa returns to being the great vertical passer he’s been in past seasons, his fantasy value simply cannot go much higher than mid-tier QB2.\nDraft strategy: He’ll generally move off draft boards in Rounds 11-12.\nAdvertisement\n22. C.J. Stroud, Houston Texans\nUpside: Stroud led the league in stretch-vertical FPPG in his 2023 rookie season and was third in vertical FPPG that year. Getting back to that level will be the goal for new OC Nick Caley. Stroud won’t lack for a receiving corps to do this. Nico Collins was fourth in vertical PPR PPG in 2024, and Dane Brugler’s ‘The Beast’ NFL Draft Guide indicates second-round pick Jayden Higgins’ game is “similar to what Nico Collins put on tape at Michigan.” Houston also added Christian Kirk to upgrade at slot wide receiver. Stroud will never be a great rusher, but he is capable of much more than his 1.14 rush FPPG from last season.\nDownside: Houston is basically starting from scratch at offensive line. There are only two returning starters in that group, and one of those players is changing positions. The Texans also have an offensive line coach whose NFL experience is limited to being a co- or assistant offensive line coach. Add that to the OC change, and this offense could take some time to get in sync. Higgins is a work in progress. Stroud didn’t regress last year; he collapsed. He had the fourth-lowest stretch-vertical FPPG and was 25th in vertical FPPG. The schedule is an impediment.\nOverall: If the Texans were as good at the offensive line as they are at receiver, it would be easy to grant Stroud a QB1 grade. With that group in flux (or even worse), Stroud has to be rated as a low-end QB2.\nDraft strategy: The quality depth at the quarterback position means fantasy managers don’t have to reach here. It’s why Stroud should not be taken any earlier than Round 11.\n23. Matthew Stafford, Los Angeles Rams\nUpside: If the move from Cooper Kupp to Davante Adams provides the expected upgrade, the Rams’ passing attack will greatly improve, maybe even enough to shift Stafford back into the top 10 in passing FPPG, a must for his fantasy starter viability. Los Angeles had quality pass-blocking numbers last year and will bring back four starters and a former starter. Sean McVay will get the most out of Puka Nacua and Adams, but he will also dial up creative plays to vertical threat Tutu Atwell and a talented tight end tandem of Tyler Higbee and rookie Terrance Ferguson. Stafford has an incredible ability to fight through injury, and the pass rush matchup points total is a notable plus.\nDownside: Stafford is 37 years old and has taken more than his share of hits. That wear and tear will eventually overcome his moxie to keep playing. Adams may not be much of an upgrade over Kupp. If the passing game doesn’t upgrade notably, Stafford may end up with the same No. 18 ranking in pass FPPG that he had last year. That’s a huge problem since he essentially adds zero on the ground. Stafford has rushed for fewer than 75 yards in six of the past seven seasons and has scored one rushing touchdown since 2016. If those pass and rush trends repeat in 2025, it could lead to another No. 27 ranking in QB FPPG for Stafford, and the matchup points total is about as low as it can get.\nOverall: His upside path can get to mid-tier QB2 status, but that is so reliant on the passing game that it puts Stafford at a disadvantage compared to other QB2 candidates, which is one of the main reasons Stafford ends up near the bottom of this tier.\nAdvertisement\nDraft strategy: The turn from QB2 to QB3 usually hits around Rounds 11-12.\n24. Bryce Young, Carolina Panthers\nUpside: Young was on a tear in the final third of the 2024 season, ranking ninth in QB FPPG in Weeks 12-18. He had three games with 23+ points during that span and five games with 16.5+ points. A big part of the late-season production surge occurred on the ground, with Young scoring five rushing touchdowns in those seven games. That ground prowess led to a No. 7 ranking in rush FPPG and echoed his Alabama rushing numbers. Getting Tetairoa McMillan, the highest-rated WR prospect in the 2025 draft, could provide an immediate pass upgrade. The offensive line returns all five starters, boding well for quality pass blocking when combined with the favorable pass rush points total.\nDownside: Young is one of the smallest quarterbacks in the NFL, listed at 5-foot-10 and 204 pounds. Last year was the second consecutive season that Young had dismal passing numbers. He ranked 33rd in short-pass FPPG, 26th in stretch-vertical FPPG and 22nd in vertical FPPG. McMillan is a rookie, Xavier Legette looks like a bust, and Adam Thielen is old. Combine that with Carolina not possessing a quality tight end, and the Panthers’ receiving corps could be mediocre or worse. There are only three green-rated fireworks matchups on the schedule.\nOverall: It’s tough to bank on a third of a season, but Young has done enough to warrant inclusion at the bottom of the QB2 tier.\nDraft strategy: The end of the QB2 tier usually leaves draft boards in Rounds 11-12.\n25. Aaron Rodgers, Pittsburgh Steelers\nUpside: One area that stood out for Rodgers last year was his stretch-vertical numbers. He ranked ninth in stretch-vertical FPPG and had as many touchdowns at that level as Joe Burrow and Baker Mayfield. With the Steelers adding DK Metcalf to the receiving mix, Rodgers should be able to replicate that downfield success. Rodgers was also ninth in short-pass FPPG, showing he still has mastery of percentage passes. The combination of Jonnu Smith and Pat Freiermuth may give Rodgers the best tight end group he’s ever played with. Pittsburgh has a superb offensive line. The fireworks points total is advantageous, featuring six green-rated matchups in Weeks 7-16.\nDownside: The stretch-vertical production did not prevent Rodgers from tallying a No. 23 ranking in vertical FPPG, a weakness that led to Rodgers finishing outside of the top 10 in pass FPPG for the second consecutive season that he played in (No. 11 in 2024, No. 15 in 2022). His rushing production has dwindled to next to nothing. Rodgers has now posted a double-digit interception mark for consecutive seasons for the first time in his career. He’s 42 and could hit the age wall at any time. This run-centric offense may give Rodgers a low pass attempts ceiling. Three red-rated fireworks matchups and a bye are in Weeks 1-6.\nAdvertisement\nOverall: Rodgers tallied a high-end QB2 season last year due to New York focusing its offense on his passing skills. Mike Tomlin won’t rely on his new QB for various reasons, dropping Rodgers’ fantasy value to the border of the QB2/QB3 tier.\nDraft strategy: Do not draft outside of 2QB/SuperFlex leagues.\n(Photo of Joe Burrow: Dylan Buell / Getty Images)"
    },
    {
      "url": "https://www.nytimes.com/athletic/6434875/2025/07/29/fantasy-football-2025-draft-kit-rankings-cheat-sheet-player-projections-sleepers-and-more/",
      "text": "After what feels like a long wait, the 2025 fantasy football season is finally near. Are you prepared? Do you know the settings of each league you’re in? If there are any holes in your plans or you want to level up this year, we’re here and ready to help you start the season on the right foot.\nThe Athletic’s draft kit has everything you need to come ready on draft (or auction) day, from rankings and player projections to sleepers and dynasty advice to training camp reports from our NFL writers. And of course, there’s the penultimate Cheat Sheet, a fully customizable tool where you can input our league settings and receive a set of rankings and point projections unique to your team — all from the mind of the one and only, award-winning Jake Ciely, who is among the most accurate prognosticators in the game.\nAdvertisement\nWhile we offer a lot upon the original publication of this kit, it will continue to expand with new columns and insights as the first regular-season game inches closer and closer. Be sure to check back often to see what’s new. Last year, we published over 110 articles, so please read, enjoy, invest, and let us know how you feel in the comments below.\nFrom the mind of Jake Ciely\nFantasy football 2025 cheat sheet generator: Customizable rankings and projections tool\nCiely’s customizable rankings and projections will help you dominate your 2025 fantasy football league(s).\n2025 breakouts: quarterback | running back | wide receiver | tight end\nCiely details his breakout candidates for 2025, broken down by position.\n“Draft Chasms of Doom” series: quarterback | running back | wide receiver | tight end | explainer\nCiely illustrates his fantasy football strategy to maximize value at skill positions by locating value drop-offs, and Mike Hume explains the series.\n2025 dynasty and rookie-only fantasy football rankings: Training camp update\nWith training camp underway, Ciely updated his dynasty and rookie-only rookie rankings.\nThe players I can’t stop drafting in 2025 fantasy football… so far\nCiely shares the most commonly found players on his fantasy rosters, including potential Seattle bell cow Kenneth Walker.\nStaff picks for fantasy football 2025 sleepers, including Tank Bigsby, Ricky Pearsall\nWho will be this year’s fantasy football sleepers? Ciely and company give their hot takes.\nScoop City\nSign up for the Scoop City newsletter with Diana Russini and Jacob Robinson, which focuses on fantasy every Tuesday.\nAFC Divisional previews: AFC East | AFC North | AFC South | AFC West\nThe Athletic’s ‘Scoop City’ crew previews each NFL AFC division with answers to outstanding questions for each team, fantasy sleepers and more.\nNFC Divisional Previews: NFC East | NFC North | NFC South | NFC West\nThe Athletic’s ‘Scoop City’ crew previews each NFL NFC division with answers to outstanding questions for each team, fantasy sleepers and more.\nRedraft\nFantasy football draft steals include ADP afterthoughts Trevor Lawrence, Jaylen Warren\nMichael Salfino identifies the players who can beat their consensus draft price, starting with the ideally situated Jaguars QB.\nWhy you need to make ‘shooting for the stars’ your go-to fantasy football draft strategy\nSalfino suggests targeting players with tier-busting upside.\nAdvertisement\nJustin Jefferson, Christian McCaffrey and more 2025 fantasy football early ADP traps\nJustin Jefferson has been an elite fantasy receiver, but Salfino says his QB situation in 2025 could slow his roll.\nWhere do Joe Burrow, Patrick Mahomes fall in 2025 fantasy football QB rankings?\nKC Joyner considers everything from offensive line quality to matchup ratings in his rankings of the top 25 fantasy quarterbacks for 2025.\nReviewing the best quarterback options to stack for fantasy football success in 2025\nSalfino talks “stacking,” a fantasy football strategy where you draft players from the same NFL team, often QBs, WRs, TEs.\nFantasy football drafts feature four new first-rounders. Are they worthy?\nSalfino evaluates Malik Nabers, Ashton Jeanty, Puka Nacua and Brian Thomas as first-rounders, along with who they replaced.\nDavante Adams, Travis Hunter and more best buys on the cusp of fantasy football draft season\nSalfino thinks new Ram Davante Adams isn’t showing signs of decline and should be targeted in fantasy drafts.\nOne-man, first-round PPR fantasy football 2025 mock draft: Who to prioritize?\nGary Davenport details who he would take with each first-round pick, beginning with Ja’Marr Chase.\nFantasy football 2025 strategy mock draft: From Hoard RB to Zero RB, and everything between\nThe Athletic’s fantasy football staff reveals results from their mock draft in which they were required to use a particular draft strategy.4\nFantasy football 2025 backup running back rankings, from David Montgomery to Nick Chubb\nKC Joyner gives his opinions on the best backup running backs ahead of the 2025 fantasy football season.\nShould you prioritize wide receivers or running backs in fantasy football? Here’s the answer\nWhen is a wide receiver more valuable than a running back and vice versa? Salfino tells all.\nAdvertisement\nForget the No. 1 slot in 2025 fantasy football drafts, the sweet spot comes later\nMike Vorkunov explains why the fourth pick is the best place to draft in fantasy football this season.\nFantasy football 2025 All-Undervalued team featuring Dak Prescott, Chris Olave, Mike Evans\nDavenport reveals his 2025 fantasy All-Undervalued team.\nCaleb Williams trolls, Anthony Richardson injury and other fantasy football news\nAndy Behrens details the latest fantasy-relevant news around the league, including some rookie hype.\nDeveloping fantasy football trends include De’Von Achane goal-line usage, Emeka Egbuka praise\nJacob Robinson identifies three potentially fantasy-altering situations to watch, including a Bucs rookie receiver who is turning heads.\nRadar speed, tight-window throw conversion rate and more stats to know for fantasy football\nSalfino details the metrics he likes to use in his annual player evaluations for fantasy football.\nDynasty\nDynasty rankings: quarterback | running back | wide receiver | tight end\nJeff Haverlack’s 2025 dynasty rankings for skill position players.\nBreece Hall, Bucky Irving and more fantasy football dynasty league buys and sells\nThe top players to buy or sell in dynasty leagues ahead of the 2025 fantasy football campaign.\nDynasty league SuperFlex rookie mock draft, starting with the ‘Magnificent Seven’\nHaverlack assembles a consensus rookie mock draft based on his observations and those of analysts and other top fantasy players.\nTwo running backs top the 2025 dynasty league SuperFlex Top 30 rookie rankings\nHaverlack ranks the top 30 rookies for dynasty fantasy football.\nIDP\nPatriots, Giants, Seahawks among 5 defenses primed to break out\nThe Cardinals and Buccaneers round out Ted Nguyen’s lists of defenses that could improve in 2025.\nTravis Hunter’s fantasy football dual eligibility is a cheat code\nTravis Hunter could be a game-changer in IDP leagues across the various fantasy football game providers.\nPlayer analysis\nIs Tyreek Hill a top fantasy football rebound candidate, or has age caught up with him?\nSalfino examines Tyreek Hill closer to determine whether his 2024 slide was anomalous or a sign of age-based decline.\nWhat makes new Steelers RB Kaleb Johnson special? Instincts, physicality and explosive plays\nMike DeFabo details how Johnson’s patience and vision fit perfectly in Arthur Smith’s offense.\nAdvertisement\nPatriots’ Drake Maye has potential to be a fantasy sleeper, if things break just right\nMaye could take a step forward this season with better receivers and a better-run offense.\nFalcons still believe in Kyle Pitts. Can he be trusted in fantasy this season?\nPitts has had three quiet seasons after a promising rookie campaign. Could he finally break out this season? The fantasy world is skeptical.\nBears Rookie Colston Loveland making an impact for up-and-down offense\nAlong with Loveland’s impact, DJ Moore gets handoffs out of the backfield, and Rome Odunze continues to impress Ben Johnson in training camp.\nRookie RJ Harvey’s growth on display in Broncos’ padded workouts\nThe rookie RB had a run in Tuesday’s practice “that was something,” according to head coach Sean Payton.\nGiants rookie roundup: Jaxson Dart a quick study; Cam Skattebo boasts ‘elite awareness’\nAbdul Carter isn’t the only Giants rookie showing promise in training camp.\nWith uncertainty in the 49ers’ receiver room, Ricky Pearsall could hold fantasy value\nPearsall had 14 catches — on 18 targets — for 210 yards and two touchdowns over San Francisco’s final two games last season.\nColts’ breakout camp star AD Mitchell torches Ravens in joint practice\nMitchell backed up his trash talk on Tuesday, and QB Anthony Richardson continues to impress.\nVikings WR Jordan Addison suspended 3 games for violating NFL’s substance abuse policy\nThe 23-year-old wide receiver will miss the Vikings’ first three games against the Bears, Falcons and Bengals.\nWhy Packers QB Jordan Love will run more in 2025\nLove ranked tied for 30th in rushing attempts among quarterbacks last season.\n(Illustration: Kelsea Peterson / The Athletic; Photos: Mitchell Leff, Ric Tapia, Candice Ward via Getty Images)"
    }
  ],
  "argos_summary": "Fantasy football success hinges on avoiding low scores, particularly at the wide receiver position, where reliable, low-cost options are essential. These 'lunch pail wide receivers' provide consistent performance despite not being top-tier picks, helping teams maintain competitive scores. The article highlights several such players, including Coleman, Pearsall, and Pittman, who are expected to deliver solid contributions in the upcoming season, alongside insights into quarterback rankings and strategies for the 2025 fantasy football season.",
  "argos_id": "AFDV7YJGO"
}