{
  "url": "https://www.washingtonexaminer.com/news/3498164/study-affordable-housing-act-generates-gains-real-friction/",
  "authorsByline": "David Beasley | The Center Square contributor",
  "articleId": "759929ed5d7240d4800a8118792f8ea5",
  "source": {
    "domain": "washingtonexaminer.com",
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://www.washingtonexaminer.com/wp-content/uploads/2025/08/ron-desantis-florida-governor.webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T22:51:50+00:00",
  "addDate": "2025-08-12T23:17:21.629839+00:00",
  "refreshDate": "2025-08-12T23:17:21.629840+00:00",
  "score": 1.0,
  "title": "Study: Affordable housing act generates gains, ‘real friction’",
  "description": "Although the law has been amended by the legislature to strengthen the law, more changes are needed, TaxWatch concluded.",
  "content": "(The Center Square) – A 2023 Florida law designed to generate more affordable housing has produced “real gains but also real friction,” according to a nonprofit taxpayer group.\n\nThe Live Local Act was designed to increase the number of affordable housing units through property tax incentives and streamlined approval of construction projects, according to a new report by Florida TaxWatch.\n\n“The law requires that at least 40% of units in eligible projects remain affordable for 30 years, and it allows multifamily development in commercial, industrial, or mixed-use zones without rezoning, subject to administrative review,” the report states.\n\nSo far the law has helped builders construct 3,171 affordable housing units, says the nonprofit taxpayer research institute bills itself an independent, nonpartisan government watchdog.\n\nHowever, some local governments have opted out of the property tax incentives and financing for the some projects has been difficult for developers to obtain, according to the report.\n\nAlthough the law has been amended by the legislature to strengthen the law, more changes are needed, TaxWatch concluded.\n\n“Bottom line: the Act is moving units, but opt-outs, financing friction, and uneven local execution are limiting scale,” TaxWatch said. “Sustained collaboration and targeted state incentives can convert early progress into a durable pipeline.”\n\nIn order for local governments to opt out of property tax incentives, the project has to be located in a county where there is a surplus of affordable housing. The number of available housing units for households at or below 120% of the Area Median Income has to be greater than number of residents in that income category in order to opt out of the tax breaks.\n\n“A great many of the taxing authorities that can opt out have, in fact, opted out,” TaxWatch said.\n\nAlso, some developers are not taking advantage of the tax breaks even in counties offering them. The report cites Citrus County as an example.\n\n“The county is already facing a shortage of affordable housing based on its current population,” the report states. “Although this property tax exemption incentive is available to development companies, so far Citrus County has yet to receive and approve an application for the property tax exemption authorized under the Act. “\n\nTaxWatch recommends that the Florida legislature consider creating statewide tax credits, a corporate income tax homebuilders to encourage developers to build more affordable single-family homes and a state low-income tax credit for rental properties.",
  "medium": "Article",
  "links": [
    "https://www.washingtonexaminer.com/policy/finance-and-economy/3497178/florida-doge-ron-desantis-slashing-property-taxes/",
    "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.thecentersquare.com%2Fflorida%2Farticle_7e35896d-e9a1-44b8-a399-cfa9e89a0128.html%3Futm_medium%3Dsocial%26utm_source%3Dfacebook%26utm_campaign%3Duser-share"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "affordable housing units",
      "weight": 0.118438795
    },
    {
      "name": "property tax incentives",
      "weight": 0.11363888
    },
    {
      "name": "affordable housing",
      "weight": 0.11022818
    },
    {
      "name": "more affordable housing",
      "weight": 0.10950727
    },
    {
      "name": "Affordable housing act",
      "weight": 0.10566765
    },
    {
      "name": "available housing units",
      "weight": 0.09889963
    },
    {
      "name": "statewide tax credits",
      "weight": 0.08950447
    },
    {
      "name": "targeted state incentives",
      "weight": 0.082757875
    },
    {
      "name": "units",
      "weight": 0.07095513
    },
    {
      "name": "this property tax exemption incentive",
      "weight": 0.07046313
    }
  ],
  "topics": [
    {
      "name": "Data"
    },
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.96533203125
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.92919921875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.88037109375
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Housing & Development",
      "score": 0.80322265625
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.66845703125
    },
    {
      "name": "/News/Local News",
      "score": 0.64794921875
    },
    {
      "name": "/Law & Government/Legal/Real Estate Law",
      "score": 0.50830078125
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.472412109375
    },
    {
      "name": "/Finance/Accounting & Auditing/Tax Preparation & Planning",
      "score": 0.31201171875
    }
  ],
  "sentiment": {
    "positive": 0.18990502,
    "negative": 0.35609093,
    "neutral": 0.45400402
  },
  "summary": "A report by Florida TaxWatch has found that the Live Local Act, designed to increase the number of affordable housing units, has resulted in \"real gains but also friction\". The law requires that at least 40% of units in eligible projects remain affordable for 30 years and allows multifamily development in commercial, industrial, or mixed-use zones without rezoning, subject to administrative review. However, some local governments have opted out of the property tax incentives and financing for some projects has been difficult for developers. TaxWatch recommends creating statewide tax credits and a state low-income tax credit for rental properties.",
  "shortSummary": "The 2023 Florida law, the Live Local Act, generates gains for affordable housing but faces challenges with local government opt-outs and funding challenges, according to a report by TaxWatch.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "46753b876f5146429b48469b16b7db5b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.washingtonexaminer.com/policy/finance-and-economy/3497178/florida-doge-ron-desantis-slashing-property-taxes/",
      "text": "Gov. Ron DeSantis (R-FL) is seeking to use Florida’s Department of Government Efficiency to further his goal of cutting property taxes after the state legislature failed to do so earlier this year.\nIn June, the Florida legislature declined to include DeSantis’s proposal to cut $5 billion in property taxes and hand Florida homeowners each $1,000 in savings in the state’s $115 billion 2025-26 budget. The final budget came after the governor engaged in a monthslong feud with Florida House Speaker Daniel Perez, a Republican, over whether to prioritize cutting property or sales taxes.\nHowever, on Monday, Florida chief financial officer Blaise Ingoglia, who oversees the state DOGE, reiterated hopes that the bureaucracy-slashing task force can help accomplish the governor’s effort to cut property taxes. Ingoglia’s comments this week came as he launched a DOGE audit into Hillsborough County, which includes Tampa, one of Florida’s largest cities, as part of a statewide effort to uncover “waste, fraud, and abuse” and bring down property taxes.\n“This is all as a precursor and a pretext to reducing property taxes,” Ingoglia said. “Here in the state of Florida, property taxes have skyrocketed over the past five years … between 60 to 120%.”\nIngoglia’s remarks come as DeSantis has said the audits will set the stage for property tax reform on the 2026 ballot, when voters will decide whether to approve a constitutional amendment seeking to abolish property taxes altogether. The audits are meant to show that these local governments can reduce spending and absorb any property tax reduction, the governor has suggested, amid concerns from Perez that slashing the taxes could cripple local governments’ ability to cover certain public services.\n“I really believe you can do the things at the local level we all agree on, education, first responders, all that, and still be able to provide meaningful property tax relief, but not if the spending is not kept in check on these other items,” DeSantis said turing a press conference alongside Ingoglia in July as the pair announced DOGE audits of the city of Gainesville and Broward County.\n“It’s one thing for the state of Florida to do what we’ve done, and we’re proud of that,” the governor continued. “But if you’re a Floridian, whether it’s city or county government, taxpayers should be put first. Taxpayers should be respected.”\nIngoglia has launched audits into multiple municipalities across Florida since DeSantis announced Florida’s DOGE task force in February. At the time, the governor said the task force would review the state’s education system and state and local governments.\nIn March, DeSantis specifically identified local property taxes as an area where DOGE could scrutinize taxes for reductions, warning senior citizens were being “pinched” by the annual tax on their properties as values increased.\n“Now they’re being told it’s worth so much more, and they have to pony up more and more money,” the governor said. “It’s almost like they have to pay rent to the government just to be able to enjoy their property, and that’s wrong.”\nOn Monday, Orlando, one of the cities currently undergoing review, handed over 27,000 documents to the Florida DOGE. The city’s $9 billion budget, specifically, finances related to its property taxes, are likewise audited by the state.\n“We have a lot of work to do with the counties,” Ingoglia said at a news conference that day. “We have a lot of work to do with the cities. But what I can tell you is that I’m not going away. Cities and counties should not be mistaken that this is a short-term thing. This is a long-term thing.”\n“We are finding pretty egregious examples of waste, fraud, and abuse,” he continued. “I believe that if taxpayers fully understood what local governments are spending their money on, they would have an issue with it.”\nFLORIDA LAWMAKERS PASS $115 BILLION BUDGET LEAVING OUT KEY PRIORITIES AFTER DESANTIS-PEREZ FEUD\nOrlando turned over the files after Ingoglia sent a letter to city officials expressing concern that property tax collections surged 55% since 2020, even as the city’s property tax rate remained stagnant.\n“Although Orlando has kept its millage rates constant in recent years, rising property values pushed budgeted annual property tax collections up by over $120 million between 2020 and 2025 — a 55% increase,” the letter reads. “This growing burden on property owners significantly outpaces inflation and the growth in population reported in your budget over that time period.”"
    }
  ],
  "argos_summary": "A 2023 Florida law, the Live Local Act, aims to boost affordable housing through property tax incentives and streamlined construction approvals, resulting in the creation of 3,171 affordable units. However, challenges such as local governments opting out of tax incentives and financing difficulties for developers have limited its effectiveness. Recommendations for improvement include statewide tax credits and incentives to encourage more affordable housing development. Concurrently, Governor Ron DeSantis is pursuing property tax cuts amid rising property values, with audits of local governments to identify potential savings.",
  "argos_id": "AQMD2URZT"
}