{
  "url": "https://www.cnn.com/2025/08/12/business/china-evergrande-delist-intl-hnk",
  "authorsByline": "",
  "articleId": "77acfdaf49e04a8793e35c809e6ddb0d",
  "source": {
    "domain": "cnn.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://media.cnn.com/api/v1/images/stellar/prod/ap25224429536333.jpg?c=16x9&q=w_800,c_fill",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:48:04.759000+00:00",
  "addDate": "2025-08-13T01:52:28.920624+00:00",
  "refreshDate": "2025-08-13T01:52:28.920626+00:00",
  "score": 1.0,
  "title": "China’s property crisis icon Evergrande will delist following debt woes",
  "description": "The severely indebted real estate developer China Evergrande, already in the process of liquidation, said on Tuesday it will be delisted from Hong Kong’s stock exchange on Aug. 25, another setback to mainland China’s property sector.",
  "content": "The severely indebted real estate developer China Evergrande, already in the process of liquidation, said on Tuesday it will be delisted from Hong Kong’s stock exchange on Aug. 25, another setback to mainland China’s property sector.\n\nEvergrande was the world’s most heavily indebted real estate developer, with over $300 billion owed to banks and bondholders, when the court handed down a liquidation order in January 2024. The court had ruled that the company had failed to provide a viable restructuring plan for its debts, which fueled fears about China’s rising debt burden, and trading of its shares has been halted since the ruling.\n\nThe city’s rules stipulate that the listing of companies may be canceled if trading in their securities has remained suspended for 18 months consecutively.\n\nChina Evergrande Group received a letter Aug. 8 from the city’s stock exchange notifying the firm of its decision to cancel the listing as trading had not resumed by Jul. 28. The last day of the listing will be Aug. 22 and Evergrande will not apply for a review of the decision, the company said in a statement.\n\n“All shareholders, investors and potential investors of the company should note that after the last listing date, whilst the share certificates of the shares will remain valid, the shares will not be listed on, and will not be tradeable on the Stock Exchange,” the statement said.\n\nEvergrande is among scores of developers that defaulted on debts after Chinese regulators cracked down on excessive borrowing in the property industry in 2020. Unable to obtain financing, their vast obligations to creditors and customers became unsustainable.\n\nThe crackdown also tipped the property industry into crisis, dragging down the world’s second-largest economy and rattling financial systems in and outside China. Once among the nation’s strongest growth engines, the industry is struggling to exit a prolonged downturn. Home prices in China have continued to fall even after the introduction of supportive measures by policymakers.\n\nThe Hong Kong court system has been dealing with liquidation petitions against some Chinese property developers, including one of the largest Chinese real estate companies, Country Garden, which is expected to have another hearing in January.\n\nChina South City Holdings, a smaller property developer, was also ordered to liquidate on Monday.\n\nEvergrande, founded in the mid-1990s by Hui Ka Yan, also known as Xu Jiayin, had over 90% of its assets on the Chinese mainland, according to the 2024 ruling. The firm was listed in Hong Kong in 2009 as “Evergrande Real Estate Group” and suspended its share trading on Jan. 29, 2024, at 0.16 Hong Kong dollars ($0.02).\n\nIts liquidators said in a progress report that they received debt claims totalling $45 billion as of Jul. 31, much higher than the some $27.5 billion of liabilities disclosed in December 2022, and that the new figure was not final.\n\nThe liquidators said they have assumed control of over 100 companies within the group and entities under their direct management control with collective assets valued at $3.5 billion as of Jan. 29, 2024. They said an estimate of the amounts that may ultimately be realized from these entities wasn’t available yet.\n\nAbout $255 million worth of assets have been sold, the liquidators said, calling the realization “modest.” Of this amount, $244 million was derived from subsidiaries’ assets, and not all of them will be available to the company, given the complex ownership structures of the assets.\n\n“The liquidators believe that a holistic restructuring will prove out of reach, but they will, of course, explore any credible possibilities in this regard that may present themselves,” they said.\n\nHui, Evergrande’s founder, was detained in China in September 2023 on suspicion of committing crimes, adding to the company’s woes.\n\nIn 2024, the China Securities Regulatory Commission issued a fine of 4.2 billion yuan (about $584 million) against the firm’s subsidiary, Hengda Real Estate Group Company, over violations including falsifying financial records. Hui was fined 47 million yuan ($6.5 million) and barred from China’s securities markets for life. Some other executives were also penalised.\n\nChinese authorities in September 2024 banned the accounting firm PwC for six months and fined the company more than 400 million yuan ($56.4 million) over its involvement in the audit of the collapsed property developer.",
  "medium": "Article",
  "links": [
    "https://www.cnn.com/2024/01/29/business/evergrande-ordered-to-liquidate-intl-hnk",
    "https://www.cnn.com/follow",
    "https://www.cnn.com/2024/05/17/economy/china-rescue-measures-housing-market-intl-hnk",
    "https://www.cnn.com/2023/09/29/economy/china-evergrande-chairman-detention-intl-hnk",
    "https://www.cnn.com/2021/09/24/investing/china-evergrande-group-debt-explainer-intl-hnk",
    "https://www.cnn.com/2024/03/19/business/china-evergrande-fraud-csrc-investigation-hnk-intl",
    "https://www.cnn.com/2024/05/21/economy/china-property-crisis-stimulus-challenges-intl-hnk",
    "https://www.cnn.com/2024/09/13/business/china-fines-pwc-evergrande-collapse"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "China Evergrande Group",
      "weight": 0.094326876
    },
    {
      "name": "China Evergrande",
      "weight": 0.09400334
    },
    {
      "name": "China",
      "weight": 0.07596891
    },
    {
      "name": "Evergrande Real Estate Group",
      "weight": 0.07472638
    },
    {
      "name": "companies",
      "weight": 0.07417732
    },
    {
      "name": "China South City Holdings",
      "weight": 0.07150073
    },
    {
      "name": "Evergrande",
      "weight": 0.064575
    },
    {
      "name": "China’s property crisis icon Evergrande",
      "weight": 0.063656256
    },
    {
      "name": "Hong Kong",
      "weight": 0.06047284
    },
    {
      "name": "debt claims",
      "weight": 0.058702677
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Other",
      "score": 0.966796875
    },
    {
      "name": "/News/Business News/Economy News",
      "score": 0.9541015625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.88671875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.88037109375
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.61767578125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.41162109375
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.381591796875
    }
  ],
  "sentiment": {
    "positive": 0.024635576,
    "negative": 0.8533019,
    "neutral": 0.12206253
  },
  "summary": "China Evergrande, the world's most heavily indebted real estate developer, will be delisted from Hong Kong's stock exchange on Aug. 25 due to debt woes. The company, which was handed down a liquidation order in January 2024, owes over $300 billion to banks and bondholders and had not provided a viable restructuring plan for its debts. The decision comes as another setback to China's property sector, which is struggling to recover from a prolonged downturn. The Hong Kong court system has been dealing with liquidation petitions against some Chinese property developers, including Country Garden and China South City Holdings. The liquidators have taken control of over 100 companies within the group and entities under their direct management control with collective assets valued at $3.5 billion as of Jan. 29, 2024.",
  "shortSummary": "China Evergrande will delist from Hong Kong’s stock exchange on Aug. 25 due to massive debt and market issues, impacting mainland China's property sector.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b95a242bc5704e15aef90560504f3c62",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.cnn.com/2024/09/13/business/china-fines-pwc-evergrande-collapse",
      "text": "Chinese regulators have hit PwC’s auditing unit in mainland China with a six-month business suspension and a record fine of 441 million yuan ($62 million) over the firm’s audit of troubled property developer China Evergrande Group.\nDelivering a strong rebuke to the Big Four firm, China’s securities regulator said Friday that its investigation found that PwC Zhong Tian LLP helped cover up and “even condone” Evergrande’s fraud while auditing the annual results of the developer’s onshore flagship unit — Hengda Real Estate — in 2019 and 2020.\n“PwC has seriously eroded the basis of law and good faith, and damaged investors’ interest,” said the China Securities Regulatory Commission in a statement.\nChinese authorities have been examining PwC’s role in the accounting of Hengda Real Estate since the CSRC accused the developer in March of a $78-billion fraud over a period of two years through 2020.\nThe business suspension and fines are the toughest ever penalty received by a Big Four accounting firm in China and come against the backdrop of an exodus of clientele and layoffs at the firm in recent months.\nThe move is set to cloud PwC’s prospects in the world’s no. 2 economy. PwC Zhong Tian, the registered accounting entity and the main onshore arm of PwC in China, was the country’s top-earning auditor in 2022, according to the latest official data.\n“We are disappointed by PwC Zhong Tian’s audit work of Hengda, which fell unacceptably below the standards we expect of member firms of the PwC network,” PwC network, the alliance of PwC’s global member units, said in a statement.\nThe firm said that, as part of its “accountability and remedial actions,” PwC China’s territory senior partner Daniel Li had stepped down and Hemione Hudson, the firm’s global risk and regulatory leader, had taken over from him.\nThe six-month business suspension was imposed by China’s Ministry of Finance. The ministry also imposed a fine of 116 million yuan ($16 million) on PwC Zhong Tian for its auditing failure of Hengda in 2018, according to an MOF statement.\nThe CSRC said in a separate statement that it had confiscated PwC Zhong Tian’s revenue involved in the Evergrande case totalling 27.7 million yuan and fined the unit 297 million yuan.\n“PwC has, to a certain extent, covered up and even condoned Evergrande’s financial fraud and fraudulent issuance of corporate bonds,” said the CSRC statement.\n“It (PwC) has to be severely punished according to law.”\nOver the past few months, a growing number of Chinese clients, mainly state-owned enterprises and financial institutions, has been leaving PwC, following the launch of the regulatory investigation into the firm.\nThe firm had about 400 Chinese clients, listed at home or in offshore markets such as Hong Kong or New York, in March this year, including tech behemoths Alibaba and Tencent.\nA Reuters calculation based on filings showed more than 50 Chinese firms, including PwC’s largest mainland China-listed client Bank of China, have either dropped PwC as their auditor or canceled their plans to hire it."
    },
    {
      "url": "https://www.cnn.com/2023/09/29/economy/china-evergrande-chairman-detention-intl-hnk",
      "text": "After defaulting on its debt two years ago, Chinese real estate developer Evergrande was meant to be restructured and allowed to get back on its feet. But that plan now looks to be in peril, after police detained its chairman as well as staff at a financing subsidiary.\nXu Jiayin, also known as Hui Ka Yan in Cantonese, has been subject to “mandatory measures” on suspicion of crimes, Evergrande said Thursday in a filing to the Hong Kong stock exchange.\nThe company didn’t elaborate on Xu’s location or the nature of the alleged crimes. Under the Chinese legal system, “mandatory” or “compulsory” measures can include detention and formal arrest.\nXu founded Evergrande in 1996. His detention casts further serious uncertainty on the future of the embattled property giant, which was hoping to finalize a massive government-supervised debt restructuring plan in the coming weeks to stave off collapse.\nEvergrande, which still has $300 billion in liabilities and continues to bleed money, had already warned Sunday that the restructuring plan may be in trouble because of a regulatory probe into its main property development subsidiary in mainland China. Meetings with creditors were postponed.\n“[Beijing] has certainly changed its posture [towards Evergrande] because what was a debt restructuring story has now taken on the mantle, albeit not yet fact, of a criminal case,” said George Magnus, research associate at Oxford University’s China Centre and SOAS University of London.\nEvergrande could go the way of other failed businesses, such as HNA Group or Anbang, he added. Ten years ago, they were among China’s largest private conglomerates, having gone on a global buying spree. But their chairmen were detained in 2017 and 2021, and both companies were eventually liquidated and taken over by the government.\n“My guess is that this is going to bury the company as it is, though it could be acquired or broken up,” Magnus said. “The company will be taken over, parceled out to, or otherwise run by, some [combination] of local government, state developer and banks.”\nBut Chinese authorities will need to tread carefully, cautioned Tyran Kam, Fitch Ratings’ head of China Properties, to prevent a “messy” collapse.\n“It’s unclear what will happen next for the company. But I don’t think the government is deliberately forcing a liquidation,” he said.\nThe chairman’s detention might be partly related to its wealth management unit, Kam said. The unit had been raising funds for its parent firm from individual and corporate investors as part of China’s “shadow banking” sector since 2015.\nEarlier this month, the police in Shenzhen, where Evergrande is headquartered, detained some staff at the unit. It was suspected of “illegal fundraising,” the Shenzhen government’s press office said in an article on its social media account\nAs part of a wider investigation into the company, several other Evergrande executives, including Xu’s son and a former chief financial officer, were also detained, state-owned Yicai reported Thursday, citing unnamed sources familiar with the matter. The report was widely cited by other Chinese media before being deleted.\nEvergrande has not responded to a CNN request for comment.\nWhat’s next?\nPreviously China’s second biggest real estate company, Evergrande’s default in 2021 ignited a crisis in the property sector that continues to weigh on the wider economy.\nEvergrande unveiled a $19 billion dollar proposal to make peace with its international creditors in March. In August, it filed for bankruptcy protection in the United States as part of the process.\nBut last Friday, Evergrande canceled meetings with overseas investors scheduled for this week. It said it needed to reassess the terms of the restructuring plan, in part because sales had been weaker than expected.\nTaken together, the detention of its chairman, the criminal and regulatory probes, and its inability to issue new debt means the company’s restructuring could fail. Trading in its shares has been halted until further notice, after plunging more than 80% since they resumed trading in August following a previous 17-month suspension.\n“The debt restructuring can’t really happen if Evergrade can’t issue new debt or equity, and it doesn’t seem like it can,” Magnus said.\n“So unless there’s a last minute solution to allow new issuance, the plan looks to be toast. Quite whether there will be such a last minute solution depends on what the government and the regulators have in mind for Evergrande.”\nIf the restructuring fails, and Evergrande can’t strike a new deal with its creditors, it could face liquidation.\nAn investor in the company has already filed a petition in Hong Kong to force the winding up of the business. A growing number of investors are reportedly seeking to join the action if it is unable to come up with a new survival plan soon.\nWhether it will liquidate depends on how the bondholders plan to move forward with their proposal, Kam said.\nHowever, a liquidation will be a “messy process” for all creditors, he added. When a company liquidates, its assets are frozen, and it stops operations.\nToo many homes\nThat could have far reaching consequences.\nEvergrande still had more than 100,000 employees at the end of 2022 and nearly 800 unfinished real estate projects to build about 700,0000 apartments in more than 200 cities across China. The market is already awash with vacant properties that by one recent estimate could house the country’s entire population.\nIts employees, investors and home buyers have held a number of protests over the past two years to demand unpaid salaries, reimbursement for investment losses or compensation for unfinished homes.\nThere are also implications for thousands of home buyers who have prepaid for their units, the wider economy and domestic and international financial markets.\n“The government doesn’t want the fabled middle class to suffer financially, or to lose their homes, but the company is becoming more and more an embarrassment for the authorities,” Magnus said.\nWhile the government may be willing to let Evergrande fall, the impact on households and on confidence in the battered real estate market might be “too much,” he said, adding that officials may take steps to soften the blow to home buyers and investors.\nKam, at Fitch, believes the government will study how to stabilize the market after Evergrande falls, including how to continue its operations and complete and deliver its projects.\nAs for Magnus, he believes Evergrande’s time as an independent company is over.\n“They’ll try to keep its pulse beating for long enough to deliver the properties promised or manage the properties that already exist, but to all intents and purposes, Evergrande is slowly being deconstructed, I would say.”"
    },
    {
      "url": "https://www.cnn.com/2024/01/29/business/evergrande-ordered-to-liquidate-intl-hnk",
      "text": "A court in Hong Kong has ordered the winding up of Evergrande Group, the world’s most indebted property developer, dealing another blow to investor confidence as China’s ailing real estate sector continues to weigh on its economy.\nThe liquidation order, made by the city’s High Court on Monday, comes after the embattled Chinese real estate giant and its overseas creditors failed to agree on how to restructure the company’s massive debt during talks that lasted for 19 months.\n“It seems to me that the interests of the creditors will be better protected if the company is wound up by the court, so that independent liquidators can take control over the company,” Judge Linda Chan said in the ruling published Monday.\nEvergrande defaulted on its debt in 2021, sparking a property crisis in China’s economy, which continues to feel the effects. The Shenzhen-based developer, with total liabilities of 2.39 trillion yuan ($333 billion) at the end of June last year, filed for bankruptcy in New York in 2023.\nOverseas creditors are owed $25 billion, the Hong Kong court document showed, and one of them — Top Shine Global — filed the winding up petition against Evergrande in Hong Kong in June 2022 in a bid to recover part of its losses.\nThe court has appointed Alvarez and Marsal as liquidator to manage the company, Evergrande said in a filing to the Hong Kong stock exchange. It will have powers to seize Evergrande assets in Hong Kong — such as the group’s office tower located in the commercial district of Wan Chai — and sell them to raise funds, but the implications for the company’s vast business in mainland China are unclear.\nEvergrande CEO Xiao En told state media on Monday that the liquidation order doesn’t affect the operations of subsidies that are “independent legal entities,” including its main property development business, Hengda Real Estate Group, which has most of its assets in mainland China.\n“At present, the management and operation systems of Hengda Real Estate Group and other domestic and overseas subsidiaries as independent legal entities remain unchanged,” he told the 21st Century Business Herald.\nThat’s because the legal systems of Hong Kong and China remain distinct, despite Beijing’s growing control over the former British colony in recent years.\n“Today’s liquidation order will have very limited immediate impact on Evergrande’s onshore operations or assets,” said Brock Silvers, chief investment officer for Hong Kong-based Kaiyuan Capital.\nHong Kong and the mainland city of Shenzhen — where Evergrande is based — have a mutual insolvency recognition agreement, but it’s “effectively inoperative” and courts in the city are “extremely unlikely” to recognize the offshore liquidator, Silvers said.\n“To do so would threaten the availability of Evergrande’s onshore assets to resolve its onshore obligations. Onshore, Evergrande tomorrow will be much like Evergrande yesterday,” he said.\nAnother blow to investor confidence\nChinese markets were mixed on Monday in the wake of the liquidation order, with Hong Kong stocks rising but indexes in Shanghai and Shenzhen falling again, after a brief respite last week from a protracted rout.\nSince their recent peaks in February 2021, about $6 trillion — equivalent to roughly twice Britain’s annual economic output — has been wiped off the value of Chinese and Hong Kong stocks.\nWhile the fate of the wider company may still be unclear, Evergrande’s winding-up order is another blow to investor sentiment. If mainland China doesn’t recognize the liquidation order, international creditors are likely to suffer heavy losses on their exposure to Evergrande.\n“Evergrande’s offshore liquidation was mostly expected, but it’s still a significant setback for an already troubled onshore real estate sector, one which will further decay investor sentiment,” Silvers said.\nChinese developers face $100 billion in maturing obligations this year and local governments’ financing arms also have $650 billion worth of debt due. Meanwhile, the real estate crisis has started to spill over into the wider financial system because of the exposure of shadow banks to the sector.\n“Given all of these impending solvency issues, Evergrande’s creditors will likely face a near wipe-out. All of which contributes to the current crisis of confidence in China’s capital markets,” Silvers added.\nApart from the record downturn in real estate, investors are also concerned about Chinese deflation, debt, a falling birthrate and shrinking work force, as well as Beijing’s shift towards ideology-driven policies.\nEvergrande, the poster child for China’s property crisis, unveiled a multi-billion-dollar restructuring plan last March.\nBut that plan was derailed in September after Chinese authorities said the company’s founder and chairman Xu Jiayin was suspected of “crimes” and detained by the police.\nThe spiralling property crisis has struck a hard blow to the Chinese economy.\nFor decades, China’s robust growth had been propelled by a housing boom fuelled by a growing population and rapid urbanisation. The industry accounted for as much as 30% of the country’s GDP, and more than two-thirds of Chinese household wealth is tied up in real estates.\nBut the sector fell into trouble after the government clamped down on excessive borrowing by developers in 2020 in an attempt to cool the property bubble. Since then, dozens of Chinese developers have defaulted on their debts.\nThe industry has since become a drag on the broader economy, which is grappling with a slow recovery from three years of pandemic lockdowns and a series of headwinds, from record high youth unemployment to mounting financial stress at local governments.\nIn December, new home prices fell by the highest amount in nearly nine years, and property investment slumped 9.6% in 2023 from the previous year, marking a second straight year of declines.\nLucas Lilieholm contributed to reporting.\nThis story has been updated with new information."
    },
    {
      "url": "https://www.cnn.com/2024/03/19/business/china-evergrande-fraud-csrc-investigation-hnk-intl",
      "text": "Editor’s Note: Sign up for CNN’s Meanwhile in China newsletter which explores what you need to know about the country’s rise and how it impacts the world.\nChinese regulators have accused Evergrande and its founder of inflating revenues by $78 billion, putting the insolvent property developer at the heart of the country’s biggest ever financial fraud case.\nThe China Securities Regulatory Commission (CSRC) slapped a penalty of 4.175 billion yuan ($580 million) on Hengda Real Estate, the group’s main Chinese unit, the company said in filings to the Shenzhen Stock Exchange on Monday.\nXu Jiayin, founder and chairman of the Evergrande Group, was fined 47 million yuan ($6.5 million) for the overstatement and other alleged violations. Formerly China’s richest man, he was also barred from the securities markets for life.\nThe findings were revealed after an eight-month-long investigation by the CSRC.\nThe investigation had previously derailed Evergrande’s debt restructuring talks with its overseas bondholders in the fall, because the company couldn’t issue new notes, according to a company statement issued in September.\nDays later, Evergrande said its chairman had been detained by Chinese authorities on suspicion of “crimes.” In January 2024, a Hong Kong court ordered Evergrande to liquidate.\nIn Monday’s filing, Hengda said the CSRC accused the company of several violations, including inflating sales in its financial reports, relying on these allegedly falsified figures to sell bonds and failing to disclose relevant information as required.\nThe regulator said Hengda had fabricated 214 billion yuan ($30 billion) in sales for 2019, which accounted for half of that year’s revenue. Another 350 billion yuan ($48.6 billion) in sales for 2020, accounting for 78% of revenue, were also falsified.\nAs a result, 2019’s net profit was inflated by 63% and 2020’s net profit by 87%, it said.\nThe alleged fraud, amounting to a total of 564.1 billion yuan ($78 billion) over two years, is the largest ever financial fraud case in mainland China’s securities markets, according to previous regulatory statements and state media reports.\nIn addition to the penalties levied on Hengda and Xu, six other executives were fined by the CSRC for being “directly responsible.”\nLike Xu, Xia Haijun, the former vice chairman and CEO of Evergrande Group, was banned from the nation’s securities markets for life.\n“Xu Jiayin had made decisions, organized, and implemented the financial fraud … Xia Haijun had organized, arranged and prepared the falsified financial reports… their means were really bad and the circumstances were grave,” the regulator said."
    },
    {
      "url": "https://www.cnn.com/2021/09/24/investing/china-evergrande-group-debt-explainer-intl-hnk",
      "text": "The world is still waiting to find out what will happen to troubled Chinese conglomerate Evergrande and its enormous mountain of debt.\nThe property developer’s debt crisis is a major test for Beijing. Some analysts fear it could even turn into China’s Lehman Brothers moment, sending shockwaves across the world’s second biggest economy. Real estate — and related industries — account for as much as 30% of Chinese GDP.\nLast week, investors experienced whiplash as the firm met one crucial debt deadline, but then failed to address another. Shares shot up one day, and down the next.\nThe coming days and weeks will be critical. So far, Evergrande has failed to publicly address two interest payments on bonds over the past week.\nThat’s fueling speculation over what could happen next, with potential outcomes including a Beijing-backed bailout, restructuring or default.\nHere’s what you need to know about Evergrande, and how it got to where it is now.\nWhat is Evergrande?\nEvergrande is one of China’s largest real estate developers. The company is part of the Global 500 — meaning that it’s also one of the world’s biggest businesses by revenue.\nListed in Hong Kong and based in the southern Chinese city of Shenzhen, it employs about 200,000 people. It also indirectly helps sustain more than 3.8 million jobs each year.\nThe group was founded by Chinese billionaire Xu Jiayin, also known as Hui Ka Yan in Cantonese, who was once the country’s richest man.\nEvergrande made its name in residential property — it boasts that it “owns more than 1,300 projects in more than 280 cities” across China — but its interests extend far beyond that.\nOutside housing, the group has invested in electric vehicles, sports and theme parks. It even owns a food and beverage business, selling bottled water, groceries, dairy products and other goods across China.\nIn 2010, the company bought a soccer team, which is now known as Guangzhou Evergrande. That team has since built what is believed to be the world’s biggest soccer school, at a cost of $185 million to Evergrande.\nGuangzhou Evergrande continues to reach for new records: It’s currently working on creating the world’s biggest soccer stadium, assuming that construction is completed next year as expected. The $1.7 billion site is shaped as a giant lotus flower, and will eventually be able to seat 100,000 spectators.\nEvergrande also caters to tourists through its theme park division, Evergrande Fairyland. Its claim to fame is a massive undertaking called Ocean Flower Island in Hainan, the tropical province in China commonly referred to as the “Chinese Hawaii.”\nThe project includes an artificial island with malls, museums and amusement parks. According to the group’s most recent annual report, it started taking customers on a trial basis earlier this year, with plans for a full opening “at the end of 2021.”\nHow did it run into trouble?\nIn recent years, Evergrande’s debts ballooned as it borrowed to finance its various pursuits.\nThe group has gained infamy for becoming China’s most indebted developer, with more than $300 billion worth of liabilities. Over the last few weeks, it’s warned investors of cash flow issues, saying that it could default if it’s unable to raise money quickly.\nThat warning was underscored this month, when Evergrande disclosed in a stock exchange filing that it was having trouble finding buyers for some of its assets.\nIn some ways, the company’s aggressive ambitions are what landed it in hot water, according to experts. The group “strayed far from its core business, which is part of how it got into this mess,” said Mattie Bekink, China director of the Economist Intelligence Unit.\nGoldman Sachs analysts say the company’s structure has also made it “difficult to ascertain a more precise picture of [its] recovery.” In a recent note, they pointed to “the complexity of Evergrande Group, and the lack of sufficient information on the company’s assets and liabilities.”\nBut the group’s struggles are also emblematic of underlying risks in China.\n“The story of Evergrande is the story of the deep [and] structural challenges to China’s economy related to debt,” said Bekink.\nThe issue isn’t entirely new. Last year, a slew of Chinese state-owned companies defaulted on their loans, raising fears about China’s reliance on debt-fueled investments to support growth.\nAnd in 2018, billionaire Wang Jianlin was forced to downsize his conglomerate, Dalian Wanda, as Beijing clamped down on firms borrowing heavily to push overseas.\nIn a recent note, Mark Williams, Capital Economics’ chief Asia economist, said that Evergrande’s collapse “would be the biggest test that China’s financial system has faced in years.”\n“The root of Evergrande’s troubles — and those of other highly-leveraged developers — is that residential property demand in China is entering an era of sustained decline,” he wrote. “Evergrande’s ongoing collapse has focused attention on the impact a wave of property developer defaults would have on China’s growth.”\nHow is it trying to move forward?\nThe company somewhat placated investors last week after saying that issues regarding a payment on a domestic yuan bond had been “settled through negotiations.”\nThe amount of interest it owed on the bond is about 232 million yuan ($36 million), according to data from Refinitiv.\nBut many questions still remain unanswered. Evergrande did not elaborate on the terms of the payment, and interest worth $83.5 million on a dollar-denominated bond also fell due last Thursday. That deadline came and went without an update from the company.\nThe firm also announced Wednesday that it would sell part of its stake in a local bank for roughly $1.5 billion, raising some much needed cash.\nBut instead of going toward its outstanding bond interest payments, the money will likely be used to settle its debts with that lender, Shengjing Bank. The conglomerate said it would still hang on to a 14.75% stake after the deal closes.\nEvergrande faced another bond interest payment of nearly $50 million Wednesday, though as of noon local time on Thursday it had stayed silent on the status of that debt.\nOn September 14, Evergrande announced that it had brought on financial advisers to help assess the situation.\nWhile those firms are tasked with exploring “all feasible solutions” as quickly as possible, Evergrande has cautioned that nothing is guaranteed.\nSo far, the conglomerate has struggled to stem the bleeding, and has failed to find buyers for parts of its electric vehicle and property services businesses.\nAs of that filing, it had made “no material progress” in its search for investors, and “it is uncertain as to whether the group will be able to consummate any such sale,” it said.\nThe electric car company has addressed how those challenges have trickled down, with a disclosure this week that it was having trouble paying suppliers. It also called off plans to sell new shares in Shanghai.\nOn top of that, the group has been trying to sell off its office tower in Hong Kong, which it bought for about $1.6 billion in 2015. But that has “not been completed within the expected timetable,” it said in mid-September.\nHow are investors reacting?\nEvergrande’s problems spilled onto the streets this month when protests broke out at its headquarters in Shenzhen. Footage from Reuters showed scores of demonstrators at the site last week, accosting someone identified to be a company representative.\nBut shareholders have been wary for months: The stock has shed nearly 85% of its value this year.\nEarlier this month, Fitch and Moody’s Investors Services both downgraded Evergrande’s credit ratings, citing its liquidity issues. “We view a default of some kind as probable,” Fitch wrote in a recent note.\nFitch doubled down on that view with a further downgrade on Tuesday, saying that the group was “likely to have missed [an] interest payment on its senior unsecured notes.”\nThe situation also appears to be spooking investors in China more broadly, at a time when they’re already reeling from Beijing’s crackdown on private sector companies, particularly in the tech sector. Stocks in Hong Kong, New York and other major markets have been swayed by fears of contagion from Evergrande and a slowdown in Chinese growth.\n“In our opinion, how Evergrande credit stresses will be resolved will drive market sentiment,” Goldman Sachs analysts wrote recently, referring to the credit market and the broader economy. They added that the Chinese bond market could be hit and a loss of confidence could “spill over to the broader property sector.”\nWhat could happen next?\nThe Chinese government appears to be starting to intervene.\nOver the past few days, the People’s Bank of China has injected some cash into the financial system, to help settle nerves. On Tuesday alone, it added 100 billion yuan (approximately $15.5 billion), saying it was to keep liquidity going.\nIn a statement this week, the central bank also vowed to “maintain the healthy development of the real estate market, and safeguard the legitimate rights and interests of housing consumers.”\nIt doubled down on that message Wednesday in a meeting jointly held with regulators, where authorities emphasized the need to not use “real estate as a short-term [tool for] economic stimulus,” according to a central bank statement.\nOfficials also directed the financial sector to focus on stabilizing land and housing prices, adding that institutions should work with “local governments to jointly maintain the steady and healthy development of the real estate market.”\nAuthorities are clearly watching closely, while attempting to project calm.\nThis month, Fu Linghui, a spokesperson for China’s National Bureau of Statistics, acknowledged the difficulties of “some large real estate companies,” according to state media.\nWithout naming Evergrande directly, Fu said that China’s real estate market had remained stable this year but the impact of recent events “on the development of the whole industry needs to be observed.”\nEarlier this month, Bloomberg also cited anonymous sources as saying that regulators had enlisted international law firm King & Wood Mallesons, among other advisers, to examine the conglomerate’s finances. King & Wood Mallesons declined to comment.\nAccording to the report, officials in Evergrande’s home province of Guangdong have already rejected a bailout request from its founder. Guangdong authorities and Evergrande did not respond to a request for comment.\nBeijing has few good choices. It will want to protect the thousands of people who have bought unfinished apartments, as well as construction workers, suppliers and small investors.\nIn China, real estate, and its related industries, account for as much as 20% of the urban workforce, according to Christina Zhu, an economist at Moody’s Analytics.\nAuthorities will also likely aim to limit the risk of other real estate firms going under. But at the same time, they have long been trying to rein in excessive borrowing by developers — and won’t want to dilute that message.\nEven with cash infusions, some suggest it may already be too late to save the company.\nEvergrande’s financial problems have been widely dubbed by Chinese media as “a huge black hole,” implying that no amount of money can resolve the issue.\n“China has really been trying to clean up its bad corporate debt for years. And although they made some progress before the pandemic, the task often seems interminable, and that’s what you’re certainly seeing here,” said Bekink.\n“The impacts from a large default by Evergrande would be remarkable.”\n— Kristie Lu Stout, Julia Horowitz, Laura He and CNN’s Beijing bureau contributed to this report."
    }
  ],
  "argos_summary": "China Evergrande, the world's most indebted real estate developer, is set to be delisted from Hong Kong's stock exchange on August 25 after a court ordered its liquidation due to failed debt restructuring efforts. With over $300 billion in liabilities, the company has faced significant setbacks, including the detention of its founder and ongoing investigations into financial fraud. The liquidation order is expected to further destabilize China's struggling property sector, which has already been impacted by a crackdown on excessive borrowing and a decline in home prices.",
  "argos_id": "AX94LE814"
}