{
  "url": "https://www.foxnews.com/entertainment/shanna-moakler-serves-wild-west-bikini-photos-purple-cowboy-hat",
  "authorsByline": "Lori Bashian",
  "articleId": "d45abc604e1741fca9f4c3a0de5c3600",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/shanna-moakler-pink-dress.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:18:16-04:00",
  "addDate": "2025-08-12T22:25:48.727000+00:00",
  "refreshDate": "2025-08-12T22:25:48.727001+00:00",
  "score": 1.0,
  "title": "Shanna Moakler serves Wild West with bikini photos and purple cowboy hat",
  "description": "Shanna Moakler posed for Instagram photos in a bikini and purple cowboy hat, saying she is \"serving Wild West\" and that she has \"found my perfect\" hat.",
  "content": "Shanna Moakler is not afraid to show off her curves.\n\nThe 50-year-old actress and model took to Instagram on Tuesday, sharing a photo of herself in a black and white bikini, which she accessorized with a purple cowboy hat.\n\n\"Finally found my perfect cowboy hat — and in the color I’ve been dreaming about. 🤠 Serving Wild West with a side of ‘bless your heart,'\" she captioned the post.\n\nIn the photo, Moakler can be seen posing outside in front of a pool with her hand on her har as she gives the camera a sultry look, as her long blond hair can be seen flowing over her shoulder.\n\n\"Looking beautiful as always Shanna,\" one fan wrote in the comments section.\n\nAnother added, \"It looks PERFECT on you baby! And it looks like you've found the PERFECT bikini,\" while a third chimed in with, \"You're still a tremendous Playboy sweetheart.\"\n\nShe previously shared a couple of photos of her in a black and white one-piece bathing suit with a plunging neckline, captioning the post, \"'It’s no better to be safe than sorry.' 🖤 \"\n\nIn one of the photos, Moakler can be seen giving the camera a sultry look as she posed with her arms up above her head. She accessorized with a bold makeup look, featuring bold lashes and dark eye makeup, and nude lipstick.\n\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\nMoakler posted the swimsuit photos a year after she admitted to taking the popular weight-loss drug Mounjaro after a series of tragic events in her life led her to \"eat the pain away.\"\n\nHer mother, Gail, died in January 2023 and while still mourning that loss, her father, John, died just seven months later. When speaking with people in April 2024, Moakler explained, \"I was in a very, very dark place. I stopped dieting. I stopped exercising. I just ate like s---.\"\n\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\nIn addition to dealing with the loss of her parents, Moakler explained that \"paparazzi were at my front door from the Kardashian media circus\" due to Kourtney Kardashian's relationship with her ex-husband, Travis Barker, noting \"was on another level, and I didn't know how to deal.\"\n\nThe former Playboy model was married to the Blink-182 drummer from 2004 to 2008, and they have two children together: Landon and Alabama. Moakler is also a mother to her daughter Atiana, whom she shares with her ex-partner, Oscar de la Hoya.\n\nCLICK HERE TO GET THE FOX NEWS APP",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/entertainment/shanna-moakler-accuses-ex-travis-barker-kourtney-kardashian-destroying-family",
    "https://www.foxnews.com/newsletters",
    "https://www.foxnews.com/entertainment",
    "https://www.instagram.com/p/DNQ_lMhu817/",
    "https://www.foxnews.com/entertainment/shanna-moakler-reveals-body-transformation",
    "https://www.foxnews.com/video/6318616559112",
    "https://www.foxnews.com/entertainment/playboy-model-shanna-moakler-shows-off-plastic-surgery",
    "https://www.foxnews.com/entertainment/shanna-moakler-body-transformation-bikini",
    "https://www.foxnews.com/entertainment/brooks-nader-heats-up-saint-tropez-leopard-print-swimsuit-sheer-dresses",
    "https://www.foxnews.com/apps-products?pid=AppArticleLink",
    "https://www.instagram.com/p/DNQ_lMhu817/?utm_source=ig_embed&utm_campaign=loading"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Shanna Moakler",
      "weight": 0.09367647
    },
    {
      "name": "Moakler",
      "weight": 0.08585734
    },
    {
      "name": "bikini photos",
      "weight": 0.0858192
    },
    {
      "name": "photos",
      "weight": 0.07191225
    },
    {
      "name": "purple cowboy hat",
      "weight": 0.06631186
    },
    {
      "name": "dark eye makeup",
      "weight": 0.065626
    },
    {
      "name": "MORE ENTERTAINMENT NEWS",
      "weight": 0.06421428
    },
    {
      "name": "Wild West",
      "weight": 0.0630796
    },
    {
      "name": "FOX NEWS APP",
      "weight": 0.058646075
    },
    {
      "name": "Oscar de la Hoya",
      "weight": 0.057026245
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.994140625
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.85205078125
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.69873046875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.6708984375
    },
    {
      "name": "/People & Society/Other",
      "score": 0.34716796875
    }
  ],
  "sentiment": {
    "positive": 0.19379875,
    "negative": 0.36864185,
    "neutral": 0.43755937
  },
  "summary": "Shanna Moakler, a 50-year-old actress and model, has shared a photo of herself in a black and white bikini and a purple cowboy hat on Instagram. This follows a year after she admitted to using the popular weight-loss drug Mounjaro after a series of tragic events led her to \"eat the pain away.\" The former Playboy model was married to Blink-182 drummer Oscar de la Hoya and has two children with him.",
  "shortSummary": "Shanna Moakler, 50, celebrated her birthday in a bikini with a purple cowboy hat, highlighting her body image and struggles with loss.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ec079cbb3fc24b3683b1eca79671bb6a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/entertainment/shanna-moakler-accuses-ex-travis-barker-kourtney-kardashian-destroying-family",
      "text": "Shanna Moakler is putting ex-husband Travis Barker and new girlfriend, Kourtney Kardashian through the wringer, accusing the couple of destroying her relationship with her children.\nDuring a quick Q&A with TMZ, Moakler, 46, claimed that recent accusations from her children Landon, 17, and Alabama, 15, that she’s been an absentee mother didn’t begin until \"my ex started dating a certain person.\"\nShe also doubled-down on claims that Travis had an affair with Kourtney’s sister, Kim during their marriage, which she claims ultimately led to their separation.\n\"My family’s broken because of this family and now my kids and I are alienated from each other because of another sister in the family,\" she said. \"So, yay for me.\"\nSHANNA MOAKLER CLAIMS TRAVIS BARKER HAD 'AFFAIR' WITH KIM KARDASHIAN DURING THEIR MARRIAGE\nWhen asked about her hopes for the Blink-182 drummer, 45, and the Poosh founder, 42, she said she doesn’t care about them \"in any capacity,\" and is more concerned with, \"mending and healing my relationship with my children and moving forward.\"\nCLICK HERE TO SIGN UP FOR OUR ENTERTAINMENT NEWSLETTER\nShe also addressed those who feel she’s spoken on her ex’s relationship too much, saying fans of the Kardashians have \"bullied\" her into speaking out.\nWhen asked if she had any last words for Kourtney and Kim, Moakler replied, \"Thanks for destroying my family… twice,\" before walking off.\nCLICK HERE TO GET THE FOX NEWS APP\nTravis and Kourtney have been going strong since January, recently taking a family trip to Disneyland.\nBarker has also called the \"Keeping Up With the Kardashians\" star \"the love of my life.\""
    },
    {
      "url": "https://www.foxnews.com/entertainment/shanna-moakler-body-transformation-bikini",
      "text": "Shanna Moakler is proud of her body and showed off her transformation on social media.\nThe 45-year-old former Playboy model posed poolside for the camera at her Calabasas, Calif., home in a light blue ruffled bikini. She said the picture was taken by her 14-year-old daughter Alabama Barker, whom she shares with ex-husband Travis Barker.\n\"Good things happen to babes who hustle,\" Moakler captioned the snap.\nPLAYBOY MODEL SHANNA MOAKLER, 43, STILL FITS INTO HER 1995 MISS USA BIKINI\nIn April, the former Miss USA winner opened up on Instagram about feeling unhappy with her weight, while also revealing her dramatic weight loss and the various changes she made to achieve her goal.\nThe photo shared online was a classic before-and-after picture, showing the transformation she went through, dropping noticeable weight over the course of her journey.\nPLAYBOY MODEL SHANNA MOAKLER SAYS TUMMY TUCK MADE HER MORE ‘CONFIDENT’ IN BIKINI SELFIE\n\"Ok ignore how absolutely awful I look in these photos but I wanted to post my progress over a year,\" Moakler wrote in the caption. \"Now I know people are gonna say you look fine on the photo on the left ( and that’s sweet) I hid my weight pretty well but I wasn’t fine, I was super unhappy, miserable and I was working out like an animal with no results for a couple reasons...\"\nThe model explained that a doctor prescribed her unneeded hormones that caused her to gain 40 pounds, alleging that they did so to earn extra money.\n\"Even though I was working out I ate like s--t because I was in a completely unhealthy relationship...\" she continued.\nPLAYBOY MODEL SHANNA MOAKLER SHARES BODY TRANSFORMATION\nFirst, Moakler said she underwent a \"mommy make over\" to \"fix [her] muscles,\" noting that it \"was probably the best thing [she] ever did in my life.\"\nThe \"Wedding Singer\" actress also said that she \"conquered\" her fear of weights, and took another big step in her personal life -- ending a toxic relationship.\n\"[I] finally got out of a relationship that didn’t empower me,\" Moakler wrote. \"There was no easy fix, there was no overnight plan ... but i had an awesome team and I now just workout daily, I still eat healthy but allow myself some good stuff and I’ve learned soooo much from the whole experience the last two years!\"\nCLICK HERE TO GET THE FOX NEWS APP\nMoakler also has a 16-year-old son, Landon, with Barker, and a 21-year-old daughter Atiana with her ex Oscar De La Hoya.\nFox News' Nate Day contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/entertainment/brooks-nader-heats-up-saint-tropez-leopard-print-swimsuit-sheer-dresses",
      "text": "Brooks Nader is serving looks in Saint-Tropez.\nThe 28-year-old model posted a series of photos on Instagram from her summer getaway on the French Riviera, including a number of revealing looks, captioning the post, \"Some fave fits and views as of lately.\"\nOne of the photos featured Nader walking outdoors in a leopard-print one-piece swimsuit, which she paired with black sunglasses and a drink in her hand. In another photo, she can be seen in the back of a car wearing a low-cut black sleeveless shirt which she accessorized with a chunky gold necklace.\nNader also shared a photo of herself sitting on the bed of a truck in a white bikini, which she paired with sweatshorts, black sandals, sunglasses and a baseball cap.\nEMILY RATAJKOWSKI FLAUNTS SUMMER BODY DURING POOLSIDE FASHION MOMENT\nNader shared many other snippets from her trip, including footage from a helicopter ride, the view of the ocean from the pool where she was staying and the many other outfits she put together.\nThe looks included a sheer black and white polka dot dress, a white crop top with a sheer white skirt, a sheer backless dress which she paired with diamonds, and a white dress with a thigh-high slit and cutouts.\nFans in the comments section were quick to share how much they loved her looks, with one writing \"It’s really unfair that anyone be this perfect,\" and another adding, \"You look insane!\"\nA third fan chimed in with, \"st tropez looks good on you,\" while a fourth wrote, \"Those abs will not be denied.\"\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\nJust last month, Nader made headlines when she suffered a wardrobe malfunction while on the red carpet at the ESPYs. The model walked the red carpet in a cream silk slip dress with a plunging neckline, which drifted too far to one side at one point, resulting in a nip-slip.\nNader quickly readjusted her dress and continued to pose for photos on the carpet with confidence.\nThe model can often be seen sporting daring and often risqué looks on the red carpet, telling Fox News Digital in December 2021 she has loved to experiment with fashion since she was a kid and was always confident in her style.\nWhile she was always confident, Nader explained that working with \"Sports Illustrated helped my confidence a lot\" because not only was she surrounded by models who are physically beautiful, but who \"also have beautiful hearts\" and built a \"very spirit-lifting community.\" While confident, her daring style has led to \"so many near mishaps.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"It took a lot of figuring out when it came to my love of sheer dresses and how to perfectly conceal everything,\" she explained at the time. \"I had one sheer dress moment where I wore this high-rise underwear that was way too light. And it showed through the dress. But you live and learn from experience.\""
    },
    {
      "url": "https://www.foxnews.com/apps-products?pid=AppArticleLink",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.foxnews.com/entertainment/shanna-moakler-reveals-body-transformation",
      "text": "Shanna Moakler recently opened up on Instagram about feeling unhappy with her weight, while also revealing her dramatic weight loss and the various changes she made to achieve her goal.\nThe photo shared by the former Playboy model, 45, on Monday was a classic before-and-after picture, showing the transformation she went through, dropping noticeable weight over the course of her journey.\n'BACHELOR' ALUM JUELIA KINNEY REVEALS SHE LOST HER HOME TO AN ELECTRICAL FIRE NEARLY TWO MONTHS AGO\n\"Ok ignore how absolutely awful I look in these photos but I wanted to post my progress over a year,\" Moakler wrote in the caption. \"Now I know people are gonna say you look fine on the photo on the left ( and that’s sweet) I hid my weight pretty well but I wasn’t fine, I was super unhappy, miserable and I was working out like an animal with no results for a couple reasons...\"\nThe model explained that a doctor prescribed her unneeded hormones that caused her to gain 40 pounds, alleging that they did so to earn extra money.\n\"Even though I was working out I ate like s--t because I was in a completely unhealthy relationship...\" she continued.\nAMY SCHUMER SHARES REASON WHY SHE HAD TO CHANGE HER SON'S NAME\nFirst, Moakler said she underwent a \"mommy make over\" to \"fix [her] muscles,\" noting that it \"was probably the best thing [she] ever did in my life.\"\n\"I started working with @davidallennutrition who finally got the hormones out of my system and got me eating properly,\" Moakler recounted. \"He custom makes plans to your bloodwork!! It’s epic! I stopped eating for emotional pleasure and started eating to fuel my body.\"\nThe \"Wedding Singer\" actress also said that she \"conquered\" her fear of weights, and took another big step in her personal life.\n\"[I] finally got out of a relationship that didn’t empower me,\" Moakler wrote. \"There was no easy fix, there was no overnight plan ... but i had an awesome team and I now just workout daily, I still eat healthy but allow myself some good stuff and I’ve learned soooo much from the whole experience the last two years!\"\nCLICK HERE TO GET THE FOX NEWS APP\nMoakler said that she often hears from mothers and newly divorced women and hoped to prove that \"if I can do it, I know you can too!\""
    }
  ],
  "argos_summary": "Shanna Moakler, 50, recently showcased her body confidence on Instagram, sharing photos in a bikini and discussing her weight loss journey after personal struggles, including the deaths of her parents. She revealed that she had previously gained weight due to unnecessary hormone prescriptions and emotional eating, but has since transformed her lifestyle through proper nutrition and exercise. Moakler also addressed her complicated relationship with her ex-husband Travis Barker and his new partner Kourtney Kardashian, claiming their relationship has affected her bond with her children.",
  "argos_id": "BA6782OUQ"
}