{
  "url": "https://www.forbes.com/sites/ywang/2025/08/12/ai-boom-makes-softbanks-masayoshi-son-richest-person-in-japan-again/",
  "authorsByline": "Anthony Spaeth",
  "articleId": "0866bb30e66044938cb52f9b485fd168",
  "source": {
    "domain": "forbes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NJ",
      "county": "Hudson County",
      "city": "Jersey City",
      "coordinates": {
        "lat": 40.7215682,
        "lon": -74.047455
      }
    }
  },
  "imageUrl": "https://imageio.forbes.com/specials-images/imageserve/689af778a3d8d7175a961eff/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:47:34+00:00",
  "addDate": "2025-08-12T08:52:42.831275+00:00",
  "refreshDate": "2025-08-12T08:52:42.831278+00:00",
  "score": 1.0,
  "title": "AI Boom Makes SoftBank’s Masayoshi Son Richest Person In Japan Again",
  "description": "SoftBank Group founder Masayoshi Son reclaimed the crown as Japan’s richest person with shares of his Tokyo-listed investment conglomerate surging over 60% this year.",
  "content": "SoftBank Group founder Masayoshi Son reclaimed the crown as Japan’s richest person after a four-year gap, with shares of his Tokyo-listed investment conglomerate surging over 60% this year amid investor optimism over its AI prospects.\n\nThe 68-year-old mogul, who is SoftBank’s chairman and CEO, has a net worth of $50.5 billion largely based on a company stake, according to Forbes estimates. That amount surpasses his previous peak wealth of $45.4 billion in 2021. He is now richer than Uniqlo parent Fast Retailing founder Tadashi Yanai, who has a fortune of $46.8 billion, according to The Real-Time Billionaires List.\n\nSon ceded the crown to Yanai in 2022 as Softbank shares plunged after record losses racked up by its giant Vision Funds investment units. Now, the conglomerate’s investments in AI-related companies—notably ChatGPT creator OpenAI—are perceived as positioning the company for growth.\n\n“Softbank offers a way for public investors to get exposure to the AI theme,” Dan Baker, a Melbourne-based senior equity analyst at research firm Morningstar, says by email.\n\nInvestors are piling into SoftBank because OpenAI is privately held, preventing them from acquiring a piece of a company that has come to symbolize the AI boom. SoftBank and OpenAI have formed strategic partnerships such as the $500 billion Stargate AI infrastructure project and investment agreements. SoftBank is the lead investor in OpenAI’s recently announced $40 billion funding round that values the ChatGPT creator at $300 billion. It plans to put as much as $30 billion into the American company, with the remaining $10 billion being syndicated out to undisclosed co-investors.\n\nSoftBank has made other AI-related bets as Son pursues the goal of artificial super intelligence (ASI), or AI that he describes as “ten thousand times more intelligent than human wisdom.” SoftBank recently raised its Nvidia stake and acquired shares worth hundreds of millions of dollars in Oracle and Taiwan Semiconductor Manufacturing Company (TSMC).\n\nMeanwhile, Arm Holdings, the Nasdaq-listed chip design firm about 90% owned by SoftBank, announced this year plans to make its own semiconductors, a significant change to its business model of selling software only. It is attempting to exploit rising demand for semiconductors that can process data faster for various AI services.\n\nSoftBank, which also wants to spend $6.5 billion to acquire U.S. chip design firm Ampere Computing, announced last week net income of 421.82 billion yen ($2.9 billion) for the three months that ended in June compared with a loss of 174.3 billion yen a year earlier, and much higher than the 127. 6 billion yen in profits forecast by analysts. Its revenues rose 7% year-over-year to 1.8 trillion yen.\n\nBut over the past few years, SoftBank has been trading at a significant discount to its net asset value. Investors have concerns over the firm’s financial leverage and what is often perceived as an aggressive investment style.\n\nThat discount has narrowed to about 40% from 50% earlier in the year as people start to realize SoftBank’s direction is “correct,” Chief Financial Officer Yoshimitsu Goto said during an analyst call last Thursday. He conceded in the call that Stargate’s progress was slower than expected, as it took time to select sites and put together financing for data centers.\n\nIf SoftBank continues to sink money into Stargate, debt risk could heighten, says Morningstar’s Baker. SoftBank currently has a loan-to-value ratio of 17%, below the company’s self-imposed cap of 25%. This metric measures SoftBank’s debt against the value of its equity holdings to gauge its financial health.\n\nPeter Milliken, a Hong Kong-based analyst at Deutsche Bank, wrote in a Monday research note that SoftBank may sell assets to fund its investments in OpenAI and Stargate. The company already sold in June $4.8 billion worth of T-Mobile shares to fund its AI investments.\n\nBaker says SoftBank may sell more T-Mobile shares or shares in Arm for investment purposes. But he also maintains that the Japanese conglomerate probably wants to retain control of Arm, or pledge its shares as collateral for financing.",
  "medium": "Article",
  "links": [
    "https://www.bloomberg.com/news/articles/2025-08-05/softbank-builds-nvidia-tsmc-stakes-under-son-s-focus-on-ai-gear",
    "https://www.forbes.com/profile/masayoshi-son/",
    "https://www.reuters.com/business/retail-consumer/arm-shares-drop-outlook-disappoints-company-looks-invest-make-own-chips-2025-07-30/",
    "https://openai.com/index/march-funding-updates/",
    "https://group.softbank/en/philosophy/message",
    "https://www.forbes.com/real-time-billionaires/#2cfcf57b3d78",
    "https://www.reuters.com/business/media-telecom/softbank-raises-48-billion-t-mobile-block-trade-term-sheet-shows-2025-06-17/",
    "https://www.forbes.com/profile/tadashi-yanai/?list=rtb/",
    "https://group.softbank/en/news/press/20250401",
    "https://group.softbank/en/news/press/20250320_0"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "SoftBank",
      "weight": 0.084465064
    },
    {
      "name": "SoftBank Group founder Masayoshi Son",
      "weight": 0.08308557
    },
    {
      "name": "SoftBank Group",
      "weight": 0.08245627
    },
    {
      "name": "AI Boom",
      "weight": 0.0674008
    },
    {
      "name": "year",
      "weight": 0.06700329
    },
    {
      "name": "Softbank shares",
      "weight": 0.06594185
    },
    {
      "name": "AI",
      "weight": 0.06559673
    },
    {
      "name": "shares",
      "weight": 0.061459526
    },
    {
      "name": "research firm Morningstar",
      "weight": 0.059728734
    },
    {
      "name": "U.S. chip design firm Ampere Computing",
      "weight": 0.059491932
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    },
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.99609375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95068359375
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.88671875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.88037109375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.53759765625
    },
    {
      "name": "/News/Technology News",
      "score": 0.53125
    },
    {
      "name": "/Business & Industrial/Business Finance/Venture Capital",
      "score": 0.330810546875
    }
  ],
  "sentiment": {
    "positive": 0.4442026,
    "negative": 0.06912588,
    "neutral": 0.4866715
  },
  "summary": "SoftBank Group founder, Masayoshi Son, has regained the title of Japan's richest person after a four-year gap, with shares of his company rising by over 60% due to investor optimism over its AI prospects. The 68-year-old mogul, who is also the chairman and CEO of SoftBank, has a net worth of $50.5 billion, surpassing his previous peak wealth of $45.4 billion. He is now wealthier than Fast Retailing founder Tadashi Yanai, who has a fortune of $46.8 billion. Investors are buying SoftBank as its investments in AI-related companies, such as ChatGPT creator OpenAI, are perceived as positioning the company for growth. However, concerns have been raised over SoftBank's financial leverage and aggressive investment style.",
  "shortSummary": "SoftBank's Masayoshi Son became Japan’s richest person again with a $50.5 billion net worth, driven by strong investor confidence in AI-related investments and strategic partnerships.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e5211a9a313c4bbc8921bce127995acb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://group.softbank/en/news/press/20250401",
      "text": "Announcement Regarding Follow-on Investments in OpenAI\nSoftBank Group Corp. (“SBG”) today announced that, on March 31, 2025 (U.S. time), it entered into a definitive agreement with OpenAI Global, LLC (“OpenAI Global”) and its affiliates (collectively, “OpenAI”), a U.S.-based artificial intelligence research and development company, to make follow-on investments of up to USD 40.0 billion (approximately JPY 5.98 trillion*1)(the “Transaction”), as detailed below. SBG is planning to syndicate out USD 10.0 billion of the up to USD 40.0 billion investment to co-investors. Accordingly, SBG’s effective investment amount is expected to be up to USD 30.0 billion (approximately JPY 4.49 trillion*1).\nSBG’s financial policies*2 regarding LTV (Loan-to-Value: calculated as adjusted net interest- bearing debt ÷ equity value of holdings) and cash position remain unchanged.\n（*1）Converted at USD = JPY149.52\n（*2）SBG manages LTV below 25% in normal times in financial markets, with an upper threshold of 35% even in times of emergency. Concurrently, SBG secures a cash position sufficient to cover bond redemptions for at least the next two years.\n1. Rationale for the Transaction\nWith the center of the “Information Revolution” having evolved from personal computers, the Internet, and broadband to smartphones, it has now entered a new phase led by artificial intelligence (AI). In this context, SBG has declared its mission to realize Artificial Super Intelligence (ASI) for the advancement of humanity.\nRecognizing OpenAI as the partner closest to achieving Artificial General Intelligence (AGI), a key milestone on the path to ASI, and its mission of ensuring AGI benefits all of humanity, SBG has positioned OpenAI as its most important partner and invested USD 2.2 billion in total through SoftBank Vision Fund 2 since September 2024.\nThe advancement of OpenAI’s AI models is key to achieving AGI and ASI, and massive computing power is essential. To that end, SBG has announced the “Stargate Project” together with OpenAI on January 21, 2025, to build dedicated AI infrastructure for OpenAI in the United States.\nIn alignment with this initiative, and to both further support OpenAI’s growth and capture the benefits of that growth in SBG’s NAV (Net Asset Value: calculated as equity value of holdings – adjusted net interest-bearing debt), SBG has decided to make follow-on investments in OpenAI.\n2. Details of the Transaction\n| First Closing | Second Closing | |\n|---|---|---|\n| Pre-Money Valuation | USD 260.0 billion | |\n| Investment Amount | USD 10.0 billion |\n1. Up to USD 30.0 billion if OpenAI Global, the for-profit subsidiary of OpenAI, Inc., completes a recapitalization of its economic waterfall (the “Funding Conditions”) by the end of 2025, or in certain circumstances, early 2026. 2. USD 10.0 billion if the Funding Conditions have not been met by the end of 2025, or in certain circumstances, early 2026. |\n| Syndication | Up to USD 10.0 billion of the investment amount may be syndicated out to co-investors. However, in the case of 2 above, syndication of USD 10.0 billion for the second closing will not reduce SBG’s USD 10.0 billion commitment for the Second Closing. | |\n| Investment Timing | April 2025 | December 2025 |\n| Investing Entity | SBG or its subsidiary | |\n| Investment Target | OpenAI Global | OpenAI Global or a new entity following the satisfaction of the Funding Conditions |\n| Type of Securities to be Acquired | Convertible Interest Rights, which are convertible into:\n・Convertible Preferred Shares of a new entity with 1x liquidation preference once the Funding Conditions are met ・Convertible Preferred Shares will automatically convert into common stock in connection with an IPO / go-public transaction |\n3. Overview of OpenAI Global\n| (1) Name | OpenAI Global, LLC |\n|---|---|\n| (2) Address | San Francisco, California, USA |\n| (3) Name and title of representative | Sam Altman, CEO |\n| (4) Business Description | To build safe and beneficial artificial general intelligence (AGI) that benefits all of humanity |\n| (5) Founded | December 2015 (OpenAI, Inc., the controlling entity of OpenAI Global) |\n4. Timeline\n| SBG Board resolution regarding the Transaction*3 | March 27, 2025 (Japan time) |\n|---|---|\n| Execution of the agreement for investment of up to USD 40.0 billion by SBG and OpenAI Global | March 31, 2025 (U.S. time) |\n| Completion of investment of USD 10.0 billion | Mid-April, 2025 (Planned) |\n| Completion of investment of up to USD 30.0 billion | December 2025 (Planned) |\n（*3）The final decision with respect to the final terms of the Transaction and the agreements thereof was delegated to Mr. Masayoshi Son, Representative Director, Corporate Officer, Chairman & CEO of SBG, and Mr. Yoshimitsu Goto, Board Director, Corporate Officer, Senior Vice President, CFO & CISO of SBG, to the extent not inconsistent with the contents of the SBG Board resolution.\n5. Syndication\nSBG and OpenAI have initiated discussions with major institutional investors regarding syndication, and up to USD 10.0 billion of the up to USD 40.0 billion investment is expected to be syndicated out to co-investors.\n6. Financing\nAs part of the Transaction, the payment of USD 10.0 billion to OpenAI Global scheduled for April 2025 is expected to be financed through borrowings from Mizuho Bank, Ltd., among other financial institutions (excluding the syndicated amount).\n7. Impact on Consolidated Financial Results\nIn SBG’s consolidated financial statements, the Convertible Interest Rights in OpenAI Global or the new entity following the satisfaction of the Funding Conditions will be classified as financial assets measured at fair value through profit or loss (FVTPL). They will be measured at fair value on a quarterly basis, with any changes in fair value recognized in the consolidated statement of profit or loss as gains and losses on investments.\n-\nReleases, announcements, presentations and other information available from this page and elsewhere on this website were prepared based on information available and views held at the time of preparation and speak only as of the respective dates on which they are filed or used by SoftBank Group Corp. or the applicable group company, as the case may be. Such information is subject to change and may become out-of-date. Such information may also contain forward-looking statements which are by their nature subject to various risks and uncertainties that may cause actual results and future developments to differ materially from those expressed or implied by such statements. Please read legal notices in its entirety prior to viewing any information available on this website."
    },
    {
      "url": "https://group.softbank/en/philosophy/message",
      "text": "Vision & Strategy\nMessage from Chairman & CEO\nRealizing Artificial Super Intelligence (ASI)\nfor the Evolution of Humanity\nOur primary objective at SBG is to maximize net asset value (NAV). NAV represents shareholder value, calculated as the equity value of holdings minus net interest-bearing debt. How do we achieve this? We focus on two key strategies: evolution and multiplication. Evolution involves continuously refining our business model to offer something unique. Multiplication refers to leveraging our sales capability to effectively market and distribute this unique value. Throughout our history since its foundation, SBG has experienced cycles of evolution and multiplication. What a journey it has been, and how the time has flown. The process of evolution and multiplication involves a succession of challenges. While we have made missteps along the way, we have persevered and increased our shareholder value.\nWhile evolution and multiplication are vital for business growth, it is the concept of evolution that holds particular importance for the future of humanity. I am more energized than ever because I have realized our ultimate mission: the evolution of humanity. This mission will be accomplished through the realization of artificial super intelligence (ASI)—AI that is ten thousand times more intelligent than human wisdom.\nIt has been 200,000 years since the birth of humans. Unlike other species, we invented tools and technologies that drove progress. Until now, the evolution of humanity has been driven by our own hands. Every now and then, geniuses such as Leonardo da Vinci and Albert Einstein emerged, sparking new ways of thinking and driving the evolution of humanity. Currently, leading tech companies are working to develop artificial general intelligence (AGI) —a form of AI with generalized intelligence that enables it to autonomously perform a wide range of learning and problem-solving tasks. In less than ten years, AGI will be realized and drive the accelerated evolution of humanity. However, AGI will only be as great as any human genius. Moreover, as long as AGI operates within the norms and boundaries of humans, it will bring no dramatic changes in our way of life or in society’s rules and systems.\nASI is completely different. ASI will be the culmination of a network of AGI models stimulating each other to rapidly accelerate their evolution. My view is that ASI will be ten thousand times more intelligent than humans and realized in about ten years. The realization of ASI, which will far surpass human wisdom, will mark a turning point in human history. ASI transcends the digital world. One day, ASI-powered smart robots will perform all kinds of physical tasks on our behalf, including manufacturing, transportation, construction, and housework.\nArm provides the foundational technology for ASI. As great as Arm is, no single company can realize ASI on its own. Critically, while all of the SoftBank Group will be working as one to achieve this goal, we will not be acting alone. In both technological and financial aspects, we will seek to collaborate with partners who share our aspirations.\nSome people say that SBG changes its core business too often, but in reality, our core business has remained unchanged all these years. Everything we do is inspired by our corporate philosophy, “Information Revolution — Happiness for everyone.” All that has changed is the means to achieve this end. As technology evolves, so too must our methods. ASI is the latest means by which we fulfill our mission to drive the evolution of humanity forward.\nMasayoshi Son\nSoftBank Group Representative"
    }
  ],
  "argos_summary": "Masayoshi Son, founder of SoftBank Group, has regained his status as Japan's richest person with a net worth of $50.5 billion, driven by a 60% surge in SoftBank's shares this year due to optimism surrounding its AI investments. The company is heavily investing in AI-related ventures, including a significant partnership with OpenAI, which involves a planned $40 billion investment to support the development of artificial super intelligence. Despite past financial struggles, SoftBank's recent performance shows a recovery, with a net income of $2.9 billion for the last quarter, and analysts believe its strategic direction is becoming more favorable.",
  "argos_id": "BBMY3SSRF"
}