{
  "url": "https://www.businessinsider.com/ukraine-studied-drug-cartels-smuggle-drones-russia-operation-spiderweb-2025-8",
  "authorsByline": "Matthew Loh",
  "articleId": "301e8e3e77cd4d6eb8a6e0cc38f55ecc",
  "source": {
    "domain": "businessinsider.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://i.insider.com/689c11c5a17a8c5b4052c3a2?width=1200&format=jpeg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:43:24+00:00",
  "addDate": "2025-08-13T04:46:44.686911+00:00",
  "refreshDate": "2025-08-13T04:46:44.686938+00:00",
  "score": 1.0,
  "title": "Ukraine studied drug cartels to learn how to sneak drones into Russia for its 'Operation Spiderweb' attack",
  "description": "Vasyl Malyuk, head of Ukraine's internal security service, said his team relied on corrupt customs officials to smuggle the drones into Russia.",
  "content": "The architects behind Ukraine's audacious \"Operation Spiderweb\" attack studied drug cartels to plan how to smuggle drones into Russia, Kyiv's security service chief said.Vasyl Malyuk, head of Ukraine's internal security service and widely hailed as a driving force in the June attack, said in an interview aired on Tuesday that his team leveraged its experience battling international crime for the complex strike.\"Operation Spiderweb\" involved Ukraine sneaking hundreds of military quadcopters deep behind Russian lines, transporting the drones via wooden house-like structures mounted on trucks. These trucks were brought to four airbases, where the drones were then launched to wreak destruction on strategic bombers and early warning and control planes there.\"Speaking of logistics,\" Malyuk told Ukrainian TV channel My-Ukrainia, \"I should note that we drew on our experience in fighting transnational crime, when we studied in detail how international drug cartels secretly deliver various prohibited substances to different corners of the world without detection by customs and border authorities.\"The security service head alluded to an earlier covert attack that Ukraine carried out in October 2022, when its forces severely damaged a Russian-controlled bridge in Crimea with a truck filled with explosives.\"If you read between the lines and look at it professionally, I think many have noticed certain parallels between the first strike on the Crimea bridge,\" Malyuk said.He said that in both situations, Ukraine didn't employ smugglers but relied on customs officials in Russia.\"Who are, by their nature, very corrupt,\" Malyuk said. \"At a certain stage, they actually played to our advantage in delivering the cabins I mentioned.\"Malyuk said that Ukraine, through its agents in Russia, created a logistics company that purchased five vehicles and rented warehouse space for the operation.One of these warehouses was even in the same city block as Russia's Federal Security Service headquarters in the Chelyabinsk region, the security service chief said.Malyuk added that the shell logistics company hired Russian citizens as truck drivers, sending them on multiple regular delivery jobs to avoid suspicion before springing the attack.The security service chief said these drivers were only told to deliver the cabins near the airbases, whereupon a customer was meant to arrive and pay for them.The drivers themselves were left in the dark, Malyuk added.The security chief said that when one of the drivers inadvertently saw the drones inside one cabin, Ukrainian agents told him the systems were hunting tools for observing animals.\"In reality, they committed no illegal acts, and there was no intent in their actions,\" Malyuk said.The SBU chief also said that his team wanted to launch the attack in May but hit several delays, including the drivers getting drunk during the Easter holiday season.According to Malyuk, each truck-mounted cabin included solar panels and a battery to keep the drones charged and ready for deployment in cold weather; the quadcopters were launched in temperatures as low as 104 degrees Fahrenheit.\"But at the same time, it created additional difficulties in bringing these cabins into the territory of the Russian Federation, because these types of goods simply can't be taken there, since Russia is under sanctions,\" Malyuk.The security service chief declined to share further details about the smuggling process, but said his team went \"through seven circles of hell.\"He added that Ukraine had designed attack drones specifically for \"Operation Spiderweb\" and that each could carry a payload of 1.6 kg.Ukrainian officials have said that the attack hit about a third of Russia's strategic bomber capacity, inflicting damage on roughly $7 billion worth of equipment.Since the attack, satellite images show that Russia has begun constructing hardened shelters for its bombers. Ukraine has, in recent months, simultaneously stepped up long-range drone assaults via fixed-wing uncrewed systems.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "attack drones",
      "weight": 0.0916021
    },
    {
      "name": "drones",
      "weight": 0.07268407
    },
    {
      "name": "truck drivers",
      "weight": 0.07025193
    },
    {
      "name": "Russia",
      "weight": 0.06963393
    },
    {
      "name": "Ukraine",
      "weight": 0.06795239
    },
    {
      "name": "international drug cartels",
      "weight": 0.06152537
    },
    {
      "name": "Malyuk",
      "weight": 0.06084848
    },
    {
      "name": "Vasyl Malyuk",
      "weight": 0.060760252
    },
    {
      "name": "drug cartels",
      "weight": 0.057675116
    },
    {
      "name": "Operation Spiderweb",
      "weight": 0.05650808
    }
  ],
  "topics": [
    {
      "name": "Russia-Ukraine War"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.96337890625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.87744140625
    },
    {
      "name": "/News/Other",
      "score": 0.87451171875
    },
    {
      "name": "/News/World News",
      "score": 0.87353515625
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.81005859375
    },
    {
      "name": "/Law & Government/Military/Other",
      "score": 0.79541015625
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.61083984375
    },
    {
      "name": "/Sensitive Subjects/Firearms & Weapons",
      "score": 0.56005859375
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Other",
      "score": 0.52392578125
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.5146484375
    },
    {
      "name": "/Law & Government/Government/Intelligence & Counterterrorism",
      "score": 0.32275390625
    }
  ],
  "sentiment": {
    "positive": 0.06832191,
    "negative": 0.58992314,
    "neutral": 0.3417549
  },
  "summary": "Ukraine's security service chief, Vasyl Malyuk, revealed that his team used their experience in fighting international crime to plan how to smuggle drones into Russia for its June attack, \"Operation Spiderweb\". The operation involved Ukraine sneaking hundreds of military quadcopters behind Russian lines and transporting them via wooden structures mounted on trucks. The trucks were brought to four airbases, where the drones were launched to destroy strategic bombers and early warning and control planes. The logistics company hired Russian citizens as truck drivers to avoid suspicion and evade detection. The attack destroyed about a third of Russia's strategic bomber capacity and damaged $7 billion worth of equipment.",
  "shortSummary": "Ukraine's security service developed techniques from drug cartels to smuggle drones into Russia, causing extensive damage to strategic bombers and early warning systems.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "d0a390f896fb4ed9a247c8f7c31c06c9",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ukraine's \"Operation Spiderweb\" involved a complex drone attack on Russian airbases, utilizing tactics inspired by drug cartels to smuggle military quadcopters into Russia. The operation, led by Vasyl Malyuk, utilized wooden structures on trucks to transport the drones, which were launched to target strategic bombers. Malyuk noted that the logistics relied on corrupt customs officials in Russia and that the operation inflicted significant damage on Russia's military capabilities, prompting them to construct hardened shelters for their bombers.",
  "argos_id": "BEXRZPT7D"
}