{
  "url": "https://finance.yahoo.com/news/bruker-viatris-sotera-health-company-182054104.html",
  "authorsByline": "Adam Hejl",
  "articleId": "34a9c3947bc945c6b0443ed3ede4a7d6",
  "source": {
    "domain": "finance.yahoo.com",
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://s.yimg.com/ny/api/res/1.2/NUqIJsR4ILkxCIbYEr7E8Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/6cee819fa1916b67603e477410fa6bda",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T18:20:54+00:00",
  "addDate": "2025-08-12T18:35:32.774006+00:00",
  "refreshDate": "2025-08-12T18:35:32.774008+00:00",
  "score": 1.0,
  "title": "Bruker, Viatris, Sotera Health Company, Align Technology, and Omnicell Stocks Trade Up, What You Need To Know",
  "description": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower inte",
  "content": "A number of stocks jumped in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The latest Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This cooler-than-expected data prompted a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing as investors grew more optimistic. The prevailing view is that easing inflation gives the central bank room to lower interest rates. Lower rates typically reduce borrowing costs for businesses and make stocks more attractive relative to bonds, contributing to widespread gains across sectors like healthcare.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks.\n\nAmong others, the following stocks were impacted:\n• Research Tools & Consumables company Bruker (NASDAQ:BRKR) jumped 3.7%. Is now the time to buy Bruker? Access our full analysis report here, it’s free.\n• Generic Pharmaceuticals company Viatris (NASDAQ:VTRS) jumped 3.1%. Is now the time to buy Viatris? Access our full analysis report here, it’s free.\n• Research Tools & Consumables company Sotera Health Company (NASDAQ:SHC) jumped 3.1%. Is now the time to buy Sotera Health Company? Access our full analysis report here, it’s free.\n• Dental Equipment & Technology company Align Technology (NASDAQ:ALGN) jumped 3.3%. Is now the time to buy Align Technology? Access our full analysis report here, it’s free.\n• Healthcare Technology for Providers company Omnicell (NASDAQ:OMCL) jumped 3.1%. Is now the time to buy Omnicell? Access our full analysis report here, it’s free.\n\nBruker’s shares are very volatile and have had 20 moves greater than 5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 8 days ago when the stock dropped 7.4% on the news that the company reported disappointing second-quarter results and lowered its full-year financial forecast, citing challenging market demand. The company’s revenue for the quarter landed at $797.4 million, which missed analyst expectations. A key metric, organic revenue, which measures sales growth from a company's core operations, fell by 7.0%. Earnings per share (EPS), a measure of profitability, came in at $0.32, significantly below the consensus estimate of $0.42. In response to the weak performance, Bruker cut its full-year guidance, and now projected an organic revenue decline between 2% and 4%. Management pointed to decreased demand for life-science research instruments, especially from U.S. academic and biopharma customers, as the primary cause. The company also announced a cost-saving plan intended to reduce annual expenses.",
  "medium": "Article",
  "links": [
    "https://stockstory.org/us/stocks/nasdaq/algn?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
    "https://stockstory.org/us/stocks/nasdaq/brkr?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
    "https://stockstory.org/us/stocks/nasdaq/omcl?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_4&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
    "https://stockstory.org/us/stocks/nasdaq/shc?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
    "https://stockstory.org/us/stocks/nasdaq/vtrs?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Omnicell Stocks",
      "weight": 0.079821974
    },
    {
      "name": "Generic Pharmaceuticals company Viatris",
      "weight": 0.07755944
    },
    {
      "name": "stocks",
      "weight": 0.07182068
    },
    {
      "name": "challenging market demand",
      "weight": 0.06955246
    },
    {
      "name": "positive inflation data",
      "weight": 0.06817895
    },
    {
      "name": "Sotera Health Company",
      "weight": 0.06663816
    },
    {
      "name": "organic revenue",
      "weight": 0.062199477
    },
    {
      "name": "NASDAQ",
      "weight": 0.062083814
    },
    {
      "name": "interest rates",
      "weight": 0.061952695
    },
    {
      "name": "Align Technology",
      "weight": 0.061324514
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.994140625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.97802734375
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.9658203125
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.416259765625
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.408935546875
    }
  ],
  "sentiment": {
    "positive": 0.2210388,
    "negative": 0.5188474,
    "neutral": 0.26011378
  },
  "summary": "A number of stocks saw a surge in the afternoon session after positive inflation data fueled hopes for an interest rate cut by the Federal Reserve. The Consumer Price Index (CPI) report showed inflation rose by a modest 0.2% in July and 2.7% over the last year. This led to a significant market rally, with the S&P 500, Dow, and Nasdaq all climbing. The prevailing view is that easing inflation gives the central bank room to lower interest rates, which typically reduce borrowing costs for businesses and make stocks more attractive relative to bonds. Among other stocks affected by this were Bruker (NASDAQ:BRKR), Viatris, Sotera Health Company, Align Technology, and Omnicell.",
  "shortSummary": "The stock market surged as positive inflation data boosted investor confidence, leading to gains in key stocks like Bruker, Viatris, Sotera Health Company, and Omnicell.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "55ead79146c6451693a44f6179f34434",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/algn?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_3&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
      "text": "Align Technology (ALGN)\nWe’re cautious of Align Technology. Its poor sales growth and falling returns on capital suggest its growth opportunities are shrinking.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Align Technology Is Not Exciting\nPioneering an alternative to traditional metal braces with nearly invisible plastic aligners, Align Technology (NASDAQ:ALGN) designs and manufactures Invisalign clear aligners, iTero intraoral scanners, and dental CAD/CAM software for orthodontic and restorative treatments.\n- Demand will likely be soft over the next 12 months as Wall Street’s estimates imply tepid growth of 2.7%\n- A positive is that its earnings per share have outperformed its peers over the last five years, increasing by 21% annually\nWhy There Are Better Opportunities Than Align Technology\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Align Technology\nAlign Technology’s stock price of $134.76 implies a valuation ratio of 12.5x forward P/E. This multiple is cheaper than most healthcare peers, but we think this is justified.\nOur advice is to pay up for elite businesses whose advantages are tailwinds to earnings growth. Don’t get sucked into lower-quality businesses just because they seem like bargains. These mediocre businesses often never achieve a higher multiple as hoped, a phenomenon known as a “value trap”.\n3. Align Technology (ALGN) Research Report: Q2 CY2025 Update\nDental technology company Align Technology (NASDAQ:ALGN) fell short of the market’s revenue expectations in Q2 CY2025, with sales falling 1.6% year on year to $1.01 billion. Next quarter’s revenue guidance of $975 million underwhelmed, coming in 6.4% below analysts’ estimates. Its non-GAAP profit of $2.49 per share was 3.3% below analysts’ consensus estimates.\nAlign Technology (ALGN) Q2 CY2025 Highlights:\n- Revenue: $1.01 billion vs analyst estimates of $1.06 billion (1.6% year-on-year decline, 4.8% miss)\n- Adjusted EPS: $2.49 vs analyst expectations of $2.57 (3.3% miss)\n- Adjusted Operating Income: $215.9 million vs analyst estimates of $234.4 million (21.3% margin, 7.9% miss)\n- Revenue Guidance for Q3 CY2025 is $975 million at the midpoint, below analyst estimates of $1.04 billion\n- Operating Margin: 16.1%, up from 14.3% in the same quarter last year\n- Free Cash Flow Margin: 11%, similar to the same quarter last year\n- Sales Volumes were flat year on year (3.2% in the same quarter last year)\n- Market Capitalization: $14.92 billion\nCompany Overview\nPioneering an alternative to traditional metal braces with nearly invisible plastic aligners, Align Technology (NASDAQ:ALGN) designs and manufactures Invisalign clear aligners, iTero intraoral scanners, and dental CAD/CAM software for orthodontic and restorative treatments.\nAlign Technology's flagship product is the Invisalign system, a series of custom-manufactured clear polymer removable aligners that straighten teeth without metal brackets or wires. When orthodontists or general dentists want to treat a patient with Invisalign, they capture a digital scan of the patient's teeth (often using Align's own iTero scanner), then work with Align's proprietary ClinCheck software to create a customized treatment plan. Align then manufactures and ships the prescribed series of aligners, which patients wear sequentially to gradually move their teeth to the desired position.\nThe company serves two main customer groups: orthodontists who specialize in teeth straightening, and general dental practitioners who offer Invisalign as part of their broader services. Align has treated approximately 17 million patients worldwide with its Invisalign system, which ranges from comprehensive packages for complex cases to limited treatment options for simpler alignment needs.\nBeyond clear aligners, Align's digital ecosystem includes the iTero intraoral scanners, which create 3D digital models of patients' teeth. These scanners offer additional diagnostic capabilities such as near-infrared imaging to detect cavities between teeth without radiation. The company's 2020 acquisition of exocad expanded its offerings to include CAD/CAM software that dental laboratories use to design and manufacture restorations like crowns and bridges.\nAlign generates revenue primarily through the sale of Invisalign treatment packages, which vary in price depending on case complexity. Additional revenue streams include the sale of iTero scanners and related services, exocad software licenses, and complementary products like Vivera retainers that help maintain teeth position after treatment.\nThe company operates globally with a direct sales force in major markets and distribution partners in others. Align invests significantly in consumer marketing to build awareness and drive patients to Invisalign-trained doctors, with approximately 125,800 active trained doctors worldwide as of the end of 2023.\n4. Dental Equipment & Technology\nThe dental equipment and technology industry encompasses companies that manufacture orthodontic products, dental implants, imaging systems, and digital tools for dental professionals. These companies benefit from recurring revenue streams tied to consumables, ongoing maintenance, and growing demand for aesthetic and restorative dentistry. However, high R&D costs, significant capital investment requirements, and reliance on discretionary spending make them vulnerable to economic cycles. Over the next few years, tailwinds for the sector include innovation in digital workflows, such as 3D printing and AI-driven diagnostics, which enhance the efficiency and precision of dental care. However, headwinds include economic uncertainty, which could reduce patient spending on elective procedures, regulatory challenges, and potential pricing pressures from consolidated dental service organizations (DSOs).\nAlign Technology's competitors include 3M's Clarity aligners, Dentsply Sirona's SureSmile, Straumann's ClearCorrect, and SmileDirectClub in the clear aligner market. In the intraoral scanner space, they compete with Dentsply Sirona's CEREC, 3Shape TRIOS, and Carestream Dental scanners.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $3.96 billion in revenue over the past 12 months, Align Technology has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nExamining a company’s long-term performance can provide clues about its quality. Any business can have short-term success, but a top-tier one grows for years. Over the last five years, Align Technology grew its sales at a solid 12.9% compounded annual growth rate. Its growth beat the average healthcare company and shows its offerings resonate with customers.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Align Technology’s recent performance shows its demand has slowed as its annualized revenue growth of 3% over the last two years was below its five-year trend.\nWe can better understand the company’s revenue dynamics by analyzing its number of clear aligner shipments, which reached 644,370 in the latest quarter. Over the last two years, Align Technology’s clear aligner shipments averaged 2.8% year-on-year growth. Because this number is in line with its revenue growth, we can see the company kept its prices fairly consistent.\nThis quarter, Align Technology missed Wall Street’s estimates and reported a rather uninspiring 1.6% year-on-year revenue decline, generating $1.01 billion of revenue. Company management is currently guiding for flat sales next quarter.\nLooking further ahead, sell-side analysts expect revenue to grow 7.6% over the next 12 months, an improvement versus the last two years. This projection is above average for the sector and indicates its newer products and services will fuel better top-line performance.\n7. Adjusted Operating Margin\nAdjusted operating margin is a key measure of profitability. Think of it as net income (the bottom line) excluding the impact of non-recurring expenses, taxes, and interest on debt - metrics less connected to business fundamentals.\nAlign Technology has been an efficient company over the last five years. It was one of the more profitable businesses in the healthcare sector, boasting an average adjusted operating margin of 23.3%.\nAnalyzing the trend in its profitability, Align Technology’s adjusted operating margin decreased by 7.5 percentage points over the last five years, but it rose by 1.8 percentage points on a two-year basis. Still, shareholders will want to see Align Technology become more profitable in the future.\nThis quarter, Align Technology generated an adjusted operating margin profit margin of 21.3%, in line with the same quarter last year. This indicates the company’s overall cost structure has been relatively stable.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nAlign Technology’s EPS grew at an astounding 21% compounded annual growth rate over the last five years, higher than its 12.9% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nDiving into the nuances of Align Technology’s earnings can give us a better understanding of its performance. A five-year view shows that Align Technology has repurchased its stock, shrinking its share count by 7.8%. This tells us its EPS outperformed its revenue not because of increased operational efficiency but financial engineering, as buybacks boost per share earnings.\nIn Q2, Align Technology reported adjusted EPS at $2.49, up from $2.41 in the same quarter last year. Despite growing year on year, this print missed analysts’ estimates, but we care more about long-term adjusted EPS growth than short-term movements. Over the next 12 months, Wall Street expects Align Technology’s full-year EPS of $9.41 to grow 15.2%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nAlign Technology has shown robust cash profitability, giving it an edge over its competitors and the ability to reinvest or return capital to investors. The company’s free cash flow margin averaged 15.6% over the last five years, quite impressive for a healthcare business.\nTaking a step back, we can see that Align Technology’s margin dropped by 8.7 percentage points during that time. It may have ticked higher more recently, but shareholders are likely hoping for its margin to at least revert to its historical level. If the longer-term trend returns, it could signal increasing investment needs and capital intensity.\nAlign Technology’s free cash flow clocked in at $111.4 million in Q2, equivalent to a 11% margin. This cash profitability was in line with the comparable period last year but below its five-year average. In a silo, this isn’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nAlthough Align Technology hasn’t been the highest-quality company lately, it historically found a few growth initiatives that worked out well. Its five-year average ROIC was 20.8%, impressive for a healthcare business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Align Technology’s ROIC has unfortunately decreased significantly. We like what management has done in the past, but its declining returns are perhaps a symptom of fewer profitable growth opportunities.\n11. Balance Sheet Assessment\nBusinesses that maintain a cash surplus face reduced bankruptcy risk.\nAlign Technology is a profitable, well-capitalized company with $901.2 million of cash and $90.47 million of debt on its balance sheet. This $810.7 million net cash position is 8.7% of its market cap and gives it the freedom to borrow money, return capital to shareholders, or invest in growth initiatives. Leverage is not an issue here.\n12. Key Takeaways from Align Technology’s Q2 Results\nWe struggled to find many positives in these results. Its revenue guidance for next quarter missed and its revenue fell short of Wall Street’s estimates. Overall, this was a very weak quarter. The stock traded down 33.4% to $136.14 immediately after reporting.\n13. Is Now The Time To Buy Align Technology?\nUpdated: August 12, 2025 at 12:03 AM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in Align Technology.\nAlign Technology isn’t a terrible business, but it doesn’t pass our bar. Although its revenue growth was solid over the last five years, it’s expected to deteriorate over the next 12 months and its diminishing returns show management's prior bets haven't worked out. And while the company’s astounding EPS growth over the last five years shows its profits are trickling down to shareholders, the downside is its declining adjusted operating margin shows the business has become less efficient.\nAlign Technology’s P/E ratio based on the next 12 months is 12.5x. Beauty is in the eye of the beholder, but we don’t really see a big opportunity at the moment. We're fairly confident there are better stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $186.36 on the company (compared to the current share price of $134.76).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/shc?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_2&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
      "text": "Sotera Health Company (SHC)\nWe’re skeptical of Sotera Health Company. Its sales have underperformed and its low returns on capital show it has few growth opportunities.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Sotera Health Company Will Underperform\nWith a critical role in ensuring the safety of millions of patients worldwide, Sotera Health (NASDAQGS:SHC) provides sterilization services, lab testing, and advisory services to ensure medical devices, pharmaceuticals, and food products are safe for use.\n- Smaller revenue base of $1.12 billion means it hasn’t achieved the economies of scale that some industry juggernauts enjoy\n- Low free cash flow margin gives it little breathing room, constraining its ability to self-fund growth or return capital to shareholders\n- A consolation is that its excellent adjusted operating margin highlights the strength of its business model\nWhy There Are Better Opportunities Than Sotera Health Company\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Sotera Health Company\nAt $14.03 per share, Sotera Health Company trades at 17.8x forward P/E. This multiple is high given its weaker fundamentals.\nIt’s better to pay up for high-quality businesses with strong long-term earnings potential rather than to buy lower-quality companies with open questions and big downside risks.\n3. Sotera Health Company (SHC) Research Report: Q2 CY2025 Update\nHealthcare services company Sotera Health (NASDAQ:) reported Q2 CY2025 results exceeding the market’s revenue expectations, with sales up 6.4% year on year to $294.3 million. Its non-GAAP profit of $0.20 per share was 15.9% above analysts’ consensus estimates.\nSotera Health Company (SHC) Q2 CY2025 Highlights:\n- Revenue: $294.3 million vs analyst estimates of $275.6 million (6.4% year-on-year growth, 6.8% beat)\n- Adjusted EPS: $0.20 vs analyst estimates of $0.17 (15.9% beat)\n- Adjusted EBITDA: $150.7 million vs analyst estimates of $137.2 million (51.2% margin, 9.8% beat)\n- Management raised its full-year Adjusted EPS guidance to $0.78 at the midpoint, a 7.5% increase\n- Operating Margin: 33.2%, up from 27.8% in the same quarter last year\n- Free Cash Flow Margin: 8.9%, up from 7% in the same quarter last year\n- Organic Revenue rose 6% year on year (8.6% in the same quarter last year)\n- Market Capitalization: $3.18 billion\nCompany Overview\nWith a critical role in ensuring the safety of millions of patients worldwide, Sotera Health (NASDAQGS:SHC) provides sterilization services, lab testing, and advisory services to ensure medical devices, pharmaceuticals, and food products are safe for use.\nSotera Health operates through three main business segments: Sterigenics, Nordion, and Nelson Labs. Each plays a distinct role in the healthcare product safety ecosystem.\nSterigenics, with 48 facilities across 13 countries, provides terminal sterilization services using three primary technologies: gamma irradiation, ethylene oxide (EO) processing, and electron beam (E-beam) irradiation. Terminal sterilization is the critical final step in manufacturing medical products before they reach healthcare providers and patients. The company sterilizes items like surgical kits, implants, syringes, catheters, wound care products, and personal protective equipment.\nNordion is the leading global provider of Cobalt-60 (Co-60), a radioactive isotope essential for gamma sterilization processes. Co-60 naturally decays at approximately 12% annually, creating recurring demand as customers must regularly purchase new supply. Nordion sources Co-60 through long-term contracts with nuclear reactor operators in several countries and designs, installs, and maintains gamma irradiation systems that house the Co-60 sources.\nNelson Labs provides over 900 different microbiological and analytical chemistry tests for medical device and pharmaceutical manufacturers. These services span the entire product lifecycle, from development and validation testing to ongoing quality control. The company employs approximately 600 scientists, technicians, and specialists who help customers navigate complex regulatory requirements.\nSotera Health's services represent a small fraction of customers' end-product costs but are essential for regulatory compliance and patient safety. This dynamic has helped the company build long-term relationships with approximately 5,000 customers in over 50 countries, including 40 of the top 50 medical device companies and nine of the top ten global pharmaceutical companies.\nThe company's business model benefits from high switching costs, as customers must often re-register with regulatory authorities like the FDA if they change sterilization facilities. This contributes to Sotera Health's high customer retention rates, with 100% renewal among its top ten Sterigenics customers for more than five consecutive years.\n4. Research Tools & Consumables\nThe life sciences subsector specializing in research tools and consumables enables scientific discoveries across academia, biotechnology, and pharmaceuticals. These firms supply a wide range of essential laboratory products, ensuring a recurring revenue stream through repeat purchases and replenishment. Their business models benefit from strong customer loyalty, a diversified product portfolio, and exposure to both the research and clinical markets. However, challenges include high R&D investment to maintain technological leadership, pricing pressures from budget-conscious institutions, and vulnerability to fluctuations in research funding cycles. Looking ahead, this subsector stands to benefit from tailwinds such as growing demand for tools supporting emerging fields like synthetic biology and personalized medicine. There is also a rise in automation and AI-driven solutions in laboratories that could create new opportunities to sell tools and consumables. Nevertheless, headwinds exist. These companies tend to be at the mercy of supply chain disruptions and sensitivity to macroeconomic conditions that impact funding for research initiatives.\nSotera Health's main competitor in the sterilization services market is STERIS plc's Applied Sterilization Technologies segment. In the laboratory testing space, Nelson Labs competes with various testing laboratories including Eurofins Scientific, WuXi AppTec, and SGS. For Nordion's Co-60 supply business, competitors include other nuclear reactor operators and isotope suppliers.\n5. Revenue Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith just $1.12 billion in revenue over the past 12 months, Sotera Health Company is a small company in an industry where scale matters. This makes it difficult to build trust with customers because healthcare is heavily regulated, complex, and resource-intensive.\n6. Revenue Growth\nA company’s long-term performance is an indicator of its overall quality. Any business can have short-term success, but a top-tier one grows for years. Over the last five years, Sotera Health Company grew its sales at a mediocre 7.3% compounded annual growth rate. This fell short of our benchmark for the healthcare sector and is a poor baseline for our analysis.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Sotera Health Company’s annualized revenue growth of 7.3% over the last two years aligns with its five-year trend, suggesting its demand was consistently weak.\nWe can better understand the company’s sales dynamics by analyzing its organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Sotera Health Company’s organic revenue averaged 7.6% year-on-year growth. Because this number aligns with its two-year revenue growth, we can see the company’s core operations (not acquisitions and divestitures) drove most of its results.\nThis quarter, Sotera Health Company reported year-on-year revenue growth of 6.4%, and its $294.3 million of revenue exceeded Wall Street’s estimates by 6.8%.\nLooking ahead, sell-side analysts expect revenue to grow 4.5% over the next 12 months, a slight deceleration versus the last two years. This projection doesn't excite us and implies its products and services will face some demand challenges.\n7. Operating Margin\nSotera Health Company has been an efficient company over the last five years. It was one of the more profitable businesses in the healthcare sector, boasting an average operating margin of 26.4%.\nAnalyzing the trend in its profitability, Sotera Health Company’s operating margin rose by 3.2 percentage points over the last five years, as its sales growth gave it operating leverage. This performance was mostly driven by its recent improvements as the company’s margin has increased by 6.1 percentage points on a two-year basis.\nIn Q2, Sotera Health Company generated an operating margin profit margin of 33.2%, up 5.4 percentage points year on year. This increase was a welcome development and shows it was more efficient.\n8. Earnings Per Share\nWe track the long-term change in earnings per share (EPS) for the same reason as long-term revenue growth. Compared to revenue, however, EPS highlights whether a company’s growth is profitable.\nSotera Health Company’s EPS grew at a remarkable 11% compounded annual growth rate over the last five years, higher than its 7.3% annualized revenue growth. This tells us the company became more profitable on a per-share basis as it expanded.\nWe can take a deeper look into Sotera Health Company’s earnings quality to better understand the drivers of its performance. As we mentioned earlier, Sotera Health Company’s operating margin expanded by 3.2 percentage points over the last five years. This was the most relevant factor (aside from the revenue impact) behind its higher earnings; interest expenses and taxes can also affect EPS but don’t tell us as much about a company’s fundamentals.\nIn Q2, Sotera Health Company reported adjusted EPS at $0.20, up from $0.19 in the same quarter last year. This print easily cleared analysts’ estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Sotera Health Company’s full-year EPS of $0.72 to grow 9.6%.\n9. Cash Is King\nFree cash flow isn't a prominently featured metric in company financials and earnings releases, but we think it's telling because it accounts for all operating and capital expenses, making it tough to manipulate. Cash is king.\nSotera Health Company has shown mediocre cash profitability over the last five years, giving the company limited opportunities to return capital to shareholders. Its free cash flow margin averaged 1.1%, subpar for a healthcare business. The divergence from its good operating margin stems from its capital-intensive business model, which requires Sotera Health Company to make large cash investments in working capital and capital expenditures.\nTaking a step back, we can see that Sotera Health Company’s margin dropped by 4.4 percentage points during that time. It may have ticked higher more recently, but shareholders are likely hoping for its margin to at least revert to its historical level. Almost any movement in the wrong direction is undesirable because of its already low cash conversion. If the longer-term trend returns, it could signal it’s becoming a more capital-intensive business.\nSotera Health Company’s free cash flow clocked in at $26.19 million in Q2, equivalent to a 8.9% margin. This result was good as its margin was 1.9 percentage points higher than in the same quarter last year, but we wouldn’t put too much weight on the short term because investment needs can be seasonal, causing temporary swings. Long-term trends are more important.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nSotera Health Company historically did a mediocre job investing in profitable growth initiatives. Its five-year average ROIC was 7.4%, somewhat low compared to the best healthcare companies that consistently pump out 20%+.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Sotera Health Company’s ROIC averaged 1.5 percentage point increases each year. This is a good sign, and we hope the company can continue improving.\n11. Balance Sheet Assessment\nSotera Health Company reported $334.3 million of cash and $2.22 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $571.9 million of EBITDA over the last 12 months, we view Sotera Health Company’s 3.3× net-debt-to-EBITDA ratio as safe. We also see its $82.76 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Sotera Health Company’s Q2 Results\nWe were impressed by how significantly Sotera Health Company blew past analysts’ organic revenue expectations this quarter. We were also excited its revenue outperformed Wall Street’s estimates by a wide margin. Zooming out, we think this was a good print with some key areas of upside. The stock traded up 2.5% to $11.52 immediately after reporting.\n13. Is Now The Time To Buy Sotera Health Company?\nUpdated: August 11, 2025 at 10:53 PM EDT\nBefore making an investment decision, investors should account for Sotera Health Company’s business fundamentals and valuation in addition to what happened in the latest quarter.\nSotera Health Company isn’t a terrible business, but it doesn’t pass our quality test. To kick things off, its revenue growth was mediocre over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its impressive operating margins show it has a highly efficient business model, the downside is its subscale operations give it fewer distribution channels than its larger rivals. On top of that, its low free cash flow margins give it little breathing room.\nSotera Health Company’s P/E ratio based on the next 12 months is 17.8x. This valuation tells us a lot of optimism is priced in - we think other companies feature superior fundamentals at the moment.\nWall Street analysts have a consensus one-year price target of $16 on the company (compared to the current share price of $14.03)."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/brkr?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_0&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
      "text": "Bruker (BRKR)\nWe’re wary of Bruker. Its weak sales growth and declining returns on capital show its demand and profits are shrinking.― StockStory Analyst Team\n1. News\n2. Summary\nWhy Bruker Is Not Exciting\nWith roots dating back to the pioneering days of nuclear magnetic resonance technology, Bruker (NASDAQ:BRKR) develops and manufactures high-performance scientific instruments that enable researchers and industrial analysts to explore materials at microscopic, molecular, and cellular levels.\n- Demand will likely fall over the next 12 months as Wall Street expects flat revenue\n- Absence of organic revenue growth over the past two years suggests it may have to lean into acquisitions to drive its expansion\n- A consolation is that its earnings growth has topped the peer group average over the last five years as its EPS has compounded at 10.4% annually\nWhy There Are Better Opportunities Than Bruker\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Bruker\nBruker is trading at $31 per share, or 11.6x forward P/E. Yes, this valuation multiple is lower than that of other healthcare peers, but we’ll remind you that you often get what you pay for.\nCheap stocks can look like a great deal at first glance, but they can be value traps. They often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. Bruker (BRKR) Research Report: Q2 CY2025 Update\nScientific instrument company Bruker (NASDAQ:BRKR). fell short of the market’s revenue expectations in Q2 CY2025, with sales flat year on year at $797.4 million. The company’s full-year revenue guidance of $3.47 billion at the midpoint came in 1.5% below analysts’ estimates. Its non-GAAP profit of $0.32 per share was 23.4% below analysts’ consensus estimates.\nBruker (BRKR) Q2 CY2025 Highlights:\n- Revenue: $797.4 million vs analyst estimates of $809.2 million (flat year on year, 1.5% miss)\n- Adjusted EPS: $0.32 vs analyst expectations of $0.42 (23.4% miss)\n- Adjusted EBITDA: $68 million vs analyst estimates of $123.6 million (8.5% margin, 45% miss)\n- The company dropped its revenue guidance for the full year to $3.47 billion at the midpoint from $3.52 billion, a 1.4% decrease\n- Management lowered its full-year Adjusted EPS guidance to $2 at the midpoint, a 18% decrease\n- Operating Margin: 1.5%, down from 6% in the same quarter last year\n- Free Cash Flow was -$148.8 million compared to -$25.1 million in the same quarter last year\n- Organic Revenue fell 7% year on year (7.4% in the same quarter last year)\n- Market Capitalization: $5.76 billion\nCompany Overview\nWith roots dating back to the pioneering days of nuclear magnetic resonance technology, Bruker (NASDAQ:BRKR) develops and manufactures high-performance scientific instruments that enable researchers and industrial analysts to explore materials at microscopic, molecular, and cellular levels.\nBruker's product portfolio spans four main business segments, each addressing different scientific and industrial needs. The BSI BioSpin segment focuses on magnetic resonance technologies, including nuclear magnetic resonance (NMR) and electron paramagnetic resonance (EPR) systems that help scientists determine molecular structures and dynamics. These instruments are crucial for pharmaceutical research, allowing scientists to understand how drugs interact with target molecules.\nThe BSI CALID segment specializes in mass spectrometry and molecular spectroscopy instruments. Its MALDI Biotyper system has revolutionized clinical microbiology by enabling rapid identification of bacteria and fungi from patient samples, significantly reducing the time needed for diagnosis. The segment also offers molecular diagnostic solutions for infectious diseases, including tuberculosis and viral hepatitis.\nIn the BSI Nano segment, Bruker provides X-ray analysis instruments, atomic force microscopes, and optical metrology systems. These tools allow researchers to visualize and analyze materials at nanometer resolution, critical for semiconductor manufacturing, materials science, and nanotechnology development. For example, a semiconductor manufacturer might use Bruker's X-ray diffraction systems to analyze the crystalline structure of silicon wafers.\nThe BEST segment produces superconducting materials and devices primarily used in magnetic resonance imaging (MRI) machines, nuclear magnetic resonance systems, and fusion energy research. These specialized materials enable the powerful magnetic fields required for advanced imaging and research applications.\nBruker maintains manufacturing facilities across North America, Europe, and Asia, with a global sales and service network. The company invests significantly in research and development to maintain technological leadership, often collaborating with academic institutions and research centers to develop new analytical techniques and applications.\nThe company's customers span a diverse range of fields, including pharmaceutical and biotechnology companies using Bruker's instruments for drug discovery; clinical laboratories employing its diagnostic systems; semiconductor manufacturers utilizing its metrology tools; and academic and government research institutions applying its technologies across various scientific disciplines.\n4. Research Tools & Consumables\nThe life sciences subsector specializing in research tools and consumables enables scientific discoveries across academia, biotechnology, and pharmaceuticals. These firms supply a wide range of essential laboratory products, ensuring a recurring revenue stream through repeat purchases and replenishment. Their business models benefit from strong customer loyalty, a diversified product portfolio, and exposure to both the research and clinical markets. However, challenges include high R&D investment to maintain technological leadership, pricing pressures from budget-conscious institutions, and vulnerability to fluctuations in research funding cycles. Looking ahead, this subsector stands to benefit from tailwinds such as growing demand for tools supporting emerging fields like synthetic biology and personalized medicine. There is also a rise in automation and AI-driven solutions in laboratories that could create new opportunities to sell tools and consumables. Nevertheless, headwinds exist. These companies tend to be at the mercy of supply chain disruptions and sensitivity to macroeconomic conditions that impact funding for research initiatives.\nBruker's competitors vary across its business segments. In magnetic resonance technology, it competes with JEOL, Oxford Instruments, and Nanalysis. In mass spectrometry and analytical instruments, major competitors include Thermo Fisher Scientific, Agilent Technologies, Waters Corporation, and Shimadzu. In the microbiology and diagnostics space, Bruker faces competition from bioMérieux and various molecular diagnostics companies.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $3.44 billion in revenue over the past 12 months, Bruker has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Luckily, Bruker’s sales grew at a decent 11.8% compounded annual growth rate over the last five years. Its growth was slightly above the average healthcare company and shows its offerings resonate with customers.\nLong-term growth is the most important, but within healthcare, a half-decade historical view may miss new innovations or demand cycles. Bruker’s annualized revenue growth of 12.6% over the last two years aligns with its five-year trend, suggesting its demand was stable.\nWe can dig further into the company’s sales dynamics by analyzing its organic revenue, which strips out one-time events like acquisitions and currency fluctuations that don’t accurately reflect its fundamentals. Over the last two years, Bruker’s organic revenue averaged 4.8% year-on-year growth. Because this number is lower than its two-year revenue growth, we can see that some mixture of acquisitions and foreign exchange rates boosted its headline results.\nThis quarter, Bruker missed Wall Street’s estimates and reported a rather uninspiring 0.4% year-on-year revenue decline, generating $797.4 million of revenue.\nLooking ahead, sell-side analysts expect revenue to grow 3.2% over the next 12 months, a deceleration versus the last two years. This projection is underwhelming and suggests its products and services will see some demand headwinds.\n7. Operating Margin\nOperating margin is one of the best measures of profitability because it tells us how much money a company takes home after subtracting all core expenses, like marketing and R&D.\nBruker has done a decent job managing its cost base over the last five years. The company has produced an average operating margin of 12.7%, higher than the broader healthcare sector.\nAnalyzing the trend in its profitability, Bruker’s operating margin decreased by 10.9 percentage points over the last five years. This performance was caused by more recent speed bumps as the company’s margin fell by 12 percentage points on a two-year basis. We’re disappointed in these results because it shows its expenses were rising and it couldn’t pass those costs onto its customers.\nThis quarter, Bruker generated an operating margin profit margin of 1.5%, down 4.5 percentage points year on year. This contraction shows it was less efficient because its expenses increased relative to its revenue.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nBruker’s remarkable 10.4% annual EPS growth over the last five years aligns with its revenue performance. This tells us it maintained its per-share profitability as it expanded.\nIn Q2, Bruker reported adjusted EPS at $0.32, down from $0.52 in the same quarter last year. This print missed analysts’ estimates, but we care more about long-term adjusted EPS growth than short-term movements. Over the next 12 months, Wall Street expects Bruker’s full-year EPS of $2.15 to grow 23%.\n9. Cash Is King\nIf you’ve followed StockStory for a while, you know we emphasize free cash flow. Why, you ask? We believe that in the end, cash is king, and you can’t use accounting profits to pay the bills.\nBruker has shown decent cash profitability, giving it some flexibility to reinvest or return capital to investors. The company’s free cash flow margin averaged 6% over the last five years, slightly better than the broader healthcare sector.\nTaking a step back, we can see that Bruker’s margin dropped by 12.4 percentage points during that time. If its declines continue, it could signal increasing investment needs and capital intensity.\nBruker burned through $148.8 million of cash in Q2, equivalent to a negative 18.7% margin. The company’s cash burn increased from $25.1 million of lost cash in the same quarter last year. These numbers deviate from its longer-term margin, indicating it is a seasonal business that must build up inventory during certain quarters.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? Enter ROIC, a metric showing how much operating profit a company generates relative to the money it has raised (debt and equity).\nAlthough Bruker hasn’t been the highest-quality company lately, it historically found a few growth initiatives that worked out well. Its five-year average ROIC was 14.9%, impressive for a healthcare business.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Bruker’s ROIC has unfortunately decreased significantly. We like what management has done in the past, but its declining returns are perhaps a symptom of fewer profitable growth opportunities.\n11. Balance Sheet Assessment\nBruker reported $92 million of cash and $2.44 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $545.4 million of EBITDA over the last 12 months, we view Bruker’s 4.3× net-debt-to-EBITDA ratio as safe. We also see its $44.3 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Bruker’s Q2 Results\nWe struggled to find many positives in these results. Its full-year EPS guidance missed and its EPS fell short of Wall Street’s estimates. Overall, this was a softer quarter. The stock traded down 3.9% to $36.48 immediately after reporting.\n13. Is Now The Time To Buy Bruker?\nUpdated: August 11, 2025 at 11:57 PM EDT\nThe latest quarterly earnings matters, sure, but we actually think longer-term fundamentals and valuation matter more. Investors should consider all these pieces before deciding whether or not to invest in Bruker.\nBruker’s business quality ultimately falls short of our standards. Although its revenue growth was good over the last five years, it’s expected to deteriorate over the next 12 months and its diminishing returns show management's prior bets haven't worked out. And while the company’s remarkable EPS growth over the last five years shows its profits are trickling down to shareholders, the downside is its cash profitability fell over the last five years.\nBruker’s P/E ratio based on the next 12 months is 11.6x. Beauty is in the eye of the beholder, but we don’t really see a big opportunity at the moment. We're fairly confident there are better stocks to buy right now.\nWall Street analysts have a consensus one-year price target of $46.73 on the company (compared to the current share price of $31).\nAlthough the price target is bullish, readers should exercise caution because analysts tend to be overly optimistic. The firms they work for, often big banks, have relationships with companies that extend into fundraising, M&A advisory, and other rewarding business lines. As a result, they typically hesitate to say bad things for fear they will lose out. We at StockStory do not suffer from such conflicts of interest, so we’ll always tell it like it is."
    },
    {
      "url": "https://stockstory.org/us/stocks/nasdaq/vtrs?utm_source=whyItMovesArticle&utm_medium=yahoo&utm_campaign=GROUP_1&utm_article=CF12aG0DYkA%3D&utm_ticker=BRKR",
      "text": "Viatris (VTRS)\nWe wouldn’t recommend Viatris. Its poor sales growth shows demand is soft and its negative returns on capital suggest it destroyed value.― StockStory Analyst Team\n1. News\n2. Summary\nWhy We Think Viatris Will Underperform\nCreated through the 2020 merger of Mylan and Pfizer's Upjohn division, Viatris (NASDAQ:VTRS) is a healthcare company that develops, manufactures, and distributes branded and generic medicines across more than 165 countries worldwide.\n- Falling earnings per share over the last five years has some investors worried as stock prices ultimately follow EPS over the long term\n- Negative returns on capital show that some of its growth strategies have backfired, and its shrinking returns suggest its past profit sources are losing steam\n- Annual sales declines of 4.9% for the past two years show its products and services struggled to connect with the market during this cycle\nWhy There Are Better Opportunities Than Viatris\nHigh Quality\nInvestable\nUnderperform\nWhy There Are Better Opportunities Than Viatris\nAt $9.98 per share, Viatris trades at 4.3x forward P/E. This certainly seems like a cheap stock, but we think there are valid reasons why it trades this way.\nCheap stocks can look like a great deal at first glance, but they can be value traps. They often have less earnings power, meaning there is more reliance on a re-rating to generate good returns - an unlikely scenario for low-quality companies.\n3. Viatris (VTRS) Research Report: Q2 CY2025 Update\nMedication company Viatris (NASDAQ:VTRS) reported Q2 CY2025 results exceeding the market’s revenue expectations, but sales fell by 5.6% year on year to $3.58 billion. The company expects the full year’s revenue to be around $13.75 billion, close to analysts’ estimates. Its non-GAAP profit of $0.62 per share was 11.6% above analysts’ consensus estimates.\nViatris (VTRS) Q2 CY2025 Highlights:\n- Revenue: $3.58 billion vs analyst estimates of $3.44 billion (5.6% year-on-year decline, 4.2% beat)\n- Adjusted EPS: $0.62 vs analyst estimates of $0.56 (11.6% beat)\n- Adjusted EBITDA: $1.08 billion vs analyst estimates of $1.04 billion (30.1% margin, 3.7% beat)\n- The company reconfirmed its revenue guidance for the full year of $13.75 billion at the midpoint\n- Management reiterated its full-year Adjusted EPS guidance of $2.23 at the midpoint\n- EBITDA guidance for the full year is $4.04 billion at the midpoint, in line with analyst expectations\n- Operating Margin: 6.5%, up from -6.3% in the same quarter last year\n- Free Cash Flow Margin: 4.7%, down from 8.4% in the same quarter last year\n- Market Capitalization: $10.27 billion\nCompany Overview\nCreated through the 2020 merger of Mylan and Pfizer's Upjohn division, Viatris (NASDAQ:VTRS) is a healthcare company that develops, manufactures, and distributes branded and generic medicines across more than 165 countries worldwide.\nViatris operates at the intersection of traditional pharmaceuticals and healthcare access, with a portfolio of over 1,400 approved molecules spanning major therapeutic areas including cardiovascular, infectious diseases, oncology, and central nervous system disorders. The company's offerings range from well-known branded medications to complex generics and over-the-counter products.\nThe company serves diverse customers including retail pharmacies, wholesalers, hospitals, and government health programs. When a hospital needs to stock its pharmacy with reliable medications, or when a retail pharmacy chain requires consistent supply of common prescriptions, Viatris provides these essential medicines through its global distribution network.\nViatris generates revenue through multiple channels. In substitution markets like France and Australia, pharmacists can substitute Viatris' products for prescribed brands. In tender markets such as Sweden and Germany, the company competes for government contracts to be the exclusive supplier of certain medications. In distribution markets like the U.S., Viatris sells directly to major wholesalers and pharmacy chains.\nThe company operates approximately 40 manufacturing facilities worldwide producing various dosage forms from oral tablets to injectables and complex delivery systems. Its global research and development platform focuses on both extending existing product lifecycles and developing new complex generics and biosimilars.\nThrough its \"Global Healthcare Gateway,\" Viatris partners with other pharmaceutical companies to expand access to their products using Viatris' established regulatory expertise and distribution channels. This allows smaller innovators to reach global markets they couldn't access independently.\nThe company has structured its operations into four geographic segments: Developed Markets (North America and Europe), Greater China, JANZ (Japan, Australia, and New Zealand), and Emerging Markets covering over 125 developing countries.\n4. Generic Pharmaceuticals\nThe generic pharmaceutical industry operates on a volume-driven, low-cost business model, producing bioequivalent versions of branded drugs once their patents expire. These companies benefit from consistent demand for affordable medications, as they are critical to reducing healthcare costs. Generics typically face lower R&D expenses and shorter regulatory approval timelines compared to branded drug makers, enabling cost efficiencies. However, the industry is highly competitive, with intense pricing pressures, thin margins, and frequent legal challenges from branded pharmaceutical companies over patent disputes. Looking ahead, the industry is supported by tailwinds such as the role of AI in streamlining drug development (reverse engineering complex formulations) and manufacturing efficiency (optimize processes and remove inefficiencies). Governments and insurers' focus on reducing drug costs can also boost generics' adoption. However, headwinds include escalating pricing pressure from large buyers like pharmacy chains and healthcare distributors as well as evolving regulatory hurdles.\nViatris competes with major pharmaceutical companies including Teva Pharmaceutical Industries (NYSE:TEVA), Novartis' Sandoz division (NYSE:NVS), Pfizer (NYSE:PFE), and Sun Pharmaceutical Industries (NSE:SUNPHARMA) in the global generic and branded generic medication markets.\n5. Economies of Scale\nLarger companies benefit from economies of scale, where fixed costs like infrastructure, technology, and administration are spread over a higher volume of goods or services, reducing the cost per unit. Scale can also lead to bargaining power with suppliers, greater brand recognition, and more investment firepower. A virtuous cycle can ensue if a scaled company plays its cards right.\nWith $14.12 billion in revenue over the past 12 months, Viatris has decent scale. This is important as it gives the company more leverage in a heavily regulated, competitive environment that is complex and resource-intensive.\n6. Revenue Growth\nA company’s long-term sales performance is one signal of its overall quality. Any business can experience short-term success, but top-performing ones enjoy sustained growth for years. Over the last five years, Viatris grew its sales at a mediocre 4.2% compounded annual growth rate. This was below our standard for the healthcare sector and is a rough starting point for our analysis.\nWe at StockStory place the most emphasis on long-term growth, but within healthcare, a half-decade historical view may miss recent innovations or disruptive industry trends. Viatris’s performance shows it grew in the past but relinquished its gains over the last two years, as its revenue fell by 4.9% annually.\nThis quarter, Viatris’s revenue fell by 5.6% year on year to $3.58 billion but beat Wall Street’s estimates by 4.2%.\nLooking ahead, sell-side analysts expect revenue to decline by 1.5% over the next 12 months. Although this projection is better than its two-year trend, it’s hard to get excited about a company that is struggling with demand.\n7. Adjusted Operating Margin\nViatris has been a well-oiled machine over the last five years. It demonstrated elite profitability for a healthcare business, boasting an average adjusted operating margin of 31%.\nAnalyzing the trend in its profitability, Viatris’s adjusted operating margin decreased by 4.9 percentage points over the last five years. The company’s two-year trajectory also shows it failed to get its profitability back to the peak as its margin fell by 4.9 percentage points. This performance was poor no matter how you look at it - it shows its expenses were rising and it couldn’t pass those costs onto its customers.\nThis quarter, Viatris generated an adjusted operating margin profit margin of 27.7%, down 1.7 percentage points year on year. This reduction is quite minuscule and indicates the company’s overall cost structure has been relatively stable.\n8. Earnings Per Share\nRevenue trends explain a company’s historical growth, but the long-term change in earnings per share (EPS) points to the profitability of that growth – for example, a company could inflate its sales through excessive spending on advertising and promotions.\nSadly for Viatris, its EPS declined by 12% annually over the last five years while its revenue grew by 4.2%. This tells us the company became less profitable on a per-share basis as it expanded.\nDiving into the nuances of Viatris’s earnings can give us a better understanding of its performance. As we mentioned earlier, Viatris’s adjusted operating margin declined by 4.9 percentage points over the last five years. Its share count also grew by 127%, meaning the company not only became less efficient with its operating expenses but also diluted its shareholders.\nIn Q2, Viatris reported adjusted EPS at $0.62, down from $0.69 in the same quarter last year. Despite falling year on year, this print easily cleared analysts’ estimates. Over the next 12 months, Wall Street expects Viatris’s full-year EPS of $2.42 to shrink by 4.5%.\n9. Cash Is King\nAlthough earnings are undoubtedly valuable for assessing company performance, we believe cash is king because you can’t use accounting profits to pay the bills.\nViatris has shown impressive cash profitability, giving it the option to reinvest or return capital to investors. The company’s free cash flow margin averaged 13.8% over the last five years, better than the broader healthcare sector.\nTaking a step back, we can see that Viatris’s margin expanded by 1.7 percentage points during that time. This shows the company is heading in the right direction, and we can see it became a less capital-intensive business because its free cash flow profitability rose while its operating profitability fell.\nViatris’s free cash flow clocked in at $166.8 million in Q2, equivalent to a 4.7% margin. The company’s cash profitability regressed as it was 3.8 percentage points lower than in the same quarter last year, prompting us to pay closer attention. Short-term fluctuations typically aren’t a big deal because investment needs can be seasonal, but we’ll be watching to see if the trend extrapolates into future quarters.\n10. Return on Invested Capital (ROIC)\nEPS and free cash flow tell us whether a company was profitable while growing its revenue. But was it capital-efficient? A company’s ROIC explains this by showing how much operating profit it makes compared to the money it has raised (debt and equity).\nViatris’s five-year average ROIC was negative 2.8%, meaning management lost money while trying to expand the business. Its returns were among the worst in the healthcare sector.\nWe like to invest in businesses with high returns, but the trend in a company’s ROIC is what often surprises the market and moves the stock price. Over the last few years, Viatris’s ROIC averaged 4.8 percentage point decreases each year. Paired with its already low returns, these declines suggest its profitable growth opportunities are few and far between.\n11. Balance Sheet Assessment\nViatris reported $566.4 million of cash and $14.47 billion of debt on its balance sheet in the most recent quarter. As investors in high-quality companies, we primarily focus on two things: 1) that a company’s debt level isn’t too high and 2) that its interest payments are not excessively burdening the business.\nWith $4.27 billion of EBITDA over the last 12 months, we view Viatris’s 3.3× net-debt-to-EBITDA ratio as safe. We also see its $258.6 million of annual interest expenses as appropriate. The company’s profits give it plenty of breathing room, allowing it to continue investing in growth initiatives.\n12. Key Takeaways from Viatris’s Q2 Results\nWe enjoyed seeing Viatris beat analysts’ revenue expectations this quarter. We were also happy its EPS outperformed Wall Street’s estimates. On the other hand, its full-year revenue guidance was in line. Overall, this print had some key positives. The stock traded up 6.4% to $9.30 immediately following the results.\n13. Is Now The Time To Buy Viatris?\nUpdated: August 12, 2025 at 12:10 AM EDT\nA common mistake we notice when investors are deciding whether to buy a stock or not is that they simply look at the latest earnings results. Business quality and valuation matter more, so we urge you to understand these dynamics as well.\nWe cheer for all companies helping people live better, but in the case of Viatris, we’ll be cheering from the sidelines. First off, its revenue growth was mediocre over the last five years, and analysts expect its demand to deteriorate over the next 12 months. And while its impressive operating margins show it has a highly efficient business model, the downside is its declining EPS over the last five years makes it a less attractive asset to the public markets. On top of that, its relatively low ROIC suggests management has struggled to find compelling investment opportunities.\nViatris’s P/E ratio based on the next 12 months is 4.3x. While this valuation is optically cheap, the potential downside is huge given its shaky fundamentals. There are better investments elsewhere.\nWall Street analysts have a consensus one-year price target of $11.29 on the company (compared to the current share price of $9.98)."
    }
  ],
  "argos_summary": "Positive inflation data led to a stock market rally, with the S&P 500, Dow, and Nasdaq rising as investors anticipated potential interest rate cuts by the Federal Reserve. Notable stock movements included Bruker, Viatris, and Align Technology, each experiencing significant price changes due to recent earnings reports and market sentiment. However, concerns linger regarding the long-term growth prospects and profitability of these companies, particularly for Align Technology and Viatris, which have shown signs of declining returns and sales growth.",
  "argos_id": "BHLI7WMK0"
}