{
  "url": "https://www.yahoo.com/news/videos/indonesias-us-tariff-deal-may-072703195.html",
  "authorsByline": "Reuters Videos",
  "articleId": "e4deba4d41d74909ac96b0a7c38e0810",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/video.reutersnews.com/6fb1b405ca3ee490854c4de94ce7ce42",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:27:03+00:00",
  "addDate": "2025-08-12T07:52:07.891818+00:00",
  "refreshDate": "2025-08-12T07:52:07.891820+00:00",
  "score": 1.0,
  "title": "Indonesia's US tariff deal may fuel an instant noodle boom",
  "description": "STORY: In the suburbs outside Indonesia's capital Jakarta, Sindi Noviyani is making lunch for her son with a staple you’d find in any Indonesian kitchen:Indomie.It's the country's largest instant noodle brand and the second best-selling in Asia after Japan's Nissin.And thanks to the Trump administration’s trade policies, it could become even more affordable for Noviyani and her family.Each month, she says they eat over 20 packets of Indomie, and they aren't alone.The noodles are a daily favorite for millions of Indonesians.:: FileNow, wheat from the US, a key ingredient in instant noodles is going to be tariff-free.In July a trade deal between the US and Indonesia eliminated tariffs on over 99% of US goods coming in, including wheat.That's likely to make it cheaper for Indomie and other instant noodles.It's also good news for Jakarta's vibrant street food scene.Roadside noodle stands thrive on its bustling corners.Fourty-four-year old Mulyana runs a stall he says goes through more than a hundred packets when it's busy.Cheaper noodles are a boost for him and could give Indonesia's noodle makers a leg up on the world stage, too.That's according to Andry Satrio, an economics and finance researcher in Jakarta.\"We hope the industry will also benefit, especially since the food and beverage industry has not yet returned to its pre-pandemic levels, where growth was in the double digits. We hope that with lower input costs for the final product, these wheat flour-based processed products will be more competitive in the global and international markets.\":: FileThe new policy is likely to heat up competition among US wheat competitors.Right now, Indonesia's main source of wheat, Australia, still faces tariffs.",
  "content": "STORY: In the suburbs outside Indonesia's capital Jakarta, Sindi Noviyani is making lunch for her son with a staple you’d find in any Indonesian kitchen:\n\nIt's the country's largest instant noodle brand and the second best-selling in Asia after Japan's Nissin.\n\nAnd thanks to the Trump administration’s trade policies, it could become even more affordable for Noviyani and her family.\n\nEach month, she says they eat over 20 packets of Indomie, and they aren't alone.\n\nThe noodles are a daily favorite for millions of Indonesians.\n\nNow, wheat from the US, a key ingredient in instant noodles is going to be tariff-free.\n\nIn July a trade deal between the US and Indonesia eliminated tariffs on over 99% of US goods coming in, including wheat.\n\nThat's likely to make it cheaper for Indomie and other instant noodles.\n\nIt's also good news for Jakarta's vibrant street food scene.\n\nFourty-four-year old Mulyana runs a stall he says goes through more than a hundred packets when it's busy.\n\nCheaper noodles are a boost for him and could give Indonesia's noodle makers a leg up on the world stage, too.\n\nThat's according to Andry Satrio, an economics and finance researcher in Jakarta.\n\n\"We hope the industry will also benefit, especially since the food and beverage industry has not yet returned to its pre-pandemic levels, where growth was in the double digits. We hope that with lower input costs for the final product, these wheat flour-based processed products will be more competitive in the global and international markets.\"\n\nThe new policy is likely to heat up competition among US wheat competitors.\n\nRight now, Indonesia's main source of wheat, Australia, still faces tariffs.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "instant noodles",
      "weight": 0.11233117
    },
    {
      "name": "other instant noodles",
      "weight": 0.108834945
    },
    {
      "name": "Cheaper noodles",
      "weight": 0.09883918
    },
    {
      "name": "US wheat competitors",
      "weight": 0.097518526
    },
    {
      "name": "US goods",
      "weight": 0.08059992
    },
    {
      "name": "wheat",
      "weight": 0.078604124
    },
    {
      "name": "Indonesia",
      "weight": 0.07472916
    },
    {
      "name": "US",
      "weight": 0.07356736
    },
    {
      "name": "Jakarta",
      "weight": 0.06921092
    },
    {
      "name": "Indonesias US tariff deal",
      "weight": 0.06838348
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.93603515625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.79638671875
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.72705078125
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.5908203125
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.5263671875
    },
    {
      "name": "/Business & Industrial/Agriculture & Forestry/Other",
      "score": 0.40625
    }
  ],
  "sentiment": {
    "positive": 0.37603596,
    "negative": 0.23722081,
    "neutral": 0.38674322
  },
  "summary": "The US trade deal between the US and Indonesia has resulted in the elimination of tariffs on over 99% of US goods, including wheat, which is a key ingredient in instant noodles. This could make instant noodles more affordable for Indonesians, particularly those of Sindi Noviyani and her family who regularly consume over 20 packets of Indomie each month. The deal is also good news for Jakarta's street food scene, where street food vendors see the cheaper noodles as a boost for their business. The new policy is likely to increase competition among US wheat competitors, particularly Australia's main source of wheat.",
  "shortSummary": "A trade deal with the US will significantly reduce the cost of instant noodles, boosting Jakarta's street food scene and boosting global competitiveness.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5406f2b65fea4f9b8908d0fa6f4decaf",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "In Indonesia, the elimination of tariffs on US wheat due to a trade deal with the Trump administration is expected to lower the cost of instant noodles, particularly the popular brand Indomie. This change could benefit millions of Indonesians who consume these noodles regularly and support local street food vendors. Economists believe that cheaper wheat will enhance the competitiveness of Indonesia's noodle industry on a global scale, especially as it recovers from pandemic-related downturns.",
  "argos_id": "CB24USBZK"
}