{
  "url": "https://www.nasdaq.com/articles/nexgel-revenue-jumps-100-fiscal-q2",
  "authorsByline": "The Motley Fool",
  "articleId": "27d9e767d0c54afe9a6650ed79620d87",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T02:04:39+00:00",
  "addDate": "2025-08-13T02:38:31.309754+00:00",
  "refreshDate": "2025-08-13T02:38:31.309755+00:00",
  "score": 1.0,
  "title": "Nexgel Revenue Jumps 100% in Fiscal Q2",
  "description": "Key PointsGAAP revenue rose 100.3% year over year to $2.88 million in Q2 2025 but missed analyst expectations by 6.5% (GAAP).",
  "content": "Key Points\n• None GAAP revenue rose 100.3% year over year to $2.88 million in Q2 2025 but missed analyst expectations by 6.5% (GAAP).\n• None Gross margin (GAAP) improved significantly to 43.6%, reflecting the impact of branded consumer products and higher utilization.\n• None Management maintained full-year 2025 revenue guidance of $13 million and positive EBITDA (non-GAAP) despite continued net losses and declining cash.\n• These 10 stocks could mint the next wave of millionaires ›\n\nNexgel (NASDAQ:NXGL), a maker of hydrogel-based wound care and beauty products, released its second quarter results for fiscal 2025 on August 12, 2025. The key news from the release was strong year-over-year growth in both revenue and profit margins, though results fell short of analyst estimates on both sales (GAAP revenue of $2.88 million vs. $3.08 million estimate) and earnings (non-GAAP EPS of -0.42 vs. -0.07 estimate). The company reported $2.88 million in GAAP revenue, up 100.3% from the prior year but missing the $3.08 million GAAP average forecast. Gross margin (GAAP) improved to 43.6% from 20.3% in Q2 2024. However, it recorded a GAAP net loss of $0.09 per share and a Non-GAAP adjusted EBITDA loss of $0.42 million. Management reaffirmed its yearly targets for $13 million in revenue and positive EBITDA, though achieving these will require acceleration in the second half. Overall, the period showed progress in business diversification and margin improvement, but ongoing net losses (GAAP) and slow sequential revenue growth ($2.88 million, up from $2.81 million in Q1 2025) pose challenges ahead.\n\nNexgel produces hydrogel-based products for both the medical and beauty markets. Its business includes contract manufacturing for external brands and the sale of its own consumer brands, such as Kenkoderm (for psoriasis relief), Medagel (wound care), and Silly George (beauty accessories). The company's core technology uses electron-beam cross-linking for hydrogels, providing a skin-friendly, high-water content material suitable for medical and cosmetic uses.\n\nRecently, Nexgel has focused on expanding beyond contract manufacturing by acquiring and developing its own branded products. The acquisition of Silly George and the introduction of new product lines illustrate an effort to create more diversified, higher-margin revenue streams. Success in these areas relies on achieving strong demand for branded offerings, efficient use of its advanced manufacturing facility, and the ability to bring new products to market while maintaining regulatory compliance.\n\nDuring Q2 2025, Nexgel's GAAP revenue more than doubled compared to Q2 2024. Growth was driven by increased sales in both its branded consumer products and contract manufacturing businesses. Integration of the Silly George beauty accessories brand made a notable contribution, particularly as management continues optimizing its profitability. According to the company, Silly George's performance supports expansion in margin and validates the roll-up approach to branded products.\n\nContract manufacturing remained a solid contributor, with new partnerships and customer onboardings. Notably, Nexgel extended its partnership with STADA, a European pharmaceutical company, which included a $1 million advance to facilitate several upcoming product launches and marketing efforts. The first STADA product, Histasolv, reportedly exceeded expectations, with additional launches planned for late 2025 and into 2026. Other new products under development include additional offerings for Medagel wound care and new beauty and skincare items for Kenkoderm and Silly George, scheduled for release in the second half of the year.\n\nProfitability metrics improved substantially, as gross profit margin increased to 43.6% (GAAP) from 20.3% in Q2 2024, and Adjusted EBITDA (non-GAAP) loss narrowed to ($0.42) million from ($0.79) million in Q2 2024. Gross profit (GAAP) increased by 334.5% from $0.29 million in Q2 2024, and gross margin (GAAP) rose by 23.3 percentage points year-over-year. The company attributes this improvement primarily to growth in both contract manufacturing and consumer branded products. Selling, general, and administrative expenses (GAAP) also grew (up 49.1% year-over-year to $1.89 million), reflecting higher investment in personnel, marketing, and support for new business lines.\n\nDespite the progress in top-line and margin, the company continued to report negative EBITDA (non-GAAP) and net loss, though net losses narrowed compared to previous quarters, with net loss attributable to NEXGEL stockholders of $0.67 million, compared to $0.71 million in Q1 2025 and $0.89 million in Q2 2024 (GAAP). Sequential revenue growth was limited, with GAAP net revenue only $0.07 million higher than in Q1 2025, Sequential revenue growth was limited, with sales only $0.07 million higher than the prior quarter, leaving significant room for further revenue scale without major new investment.\n\nNexgel continues to target full-year revenue of $13 million and expects to turn positive on an EBITDA (non-GAAP) basis. This implies substantial acceleration in the latter half of the year, since first-half GAAP revenue reached $5.69 million for the six months ended June 30, 2025, and over $7 million in GAAP revenue is needed in only two quarters (Q3 and Q4 2025) to achieve the $13 million annual target. Management points to a \"seasonally strong\" second half, new product launches, and new contract manufacturing customers as the primary sources of this expected ramp.\n\nWhile cash at the end of Q2 2025 stood at $0.73 million, subsequent advances and financings after Q2 2025 brought in $2.05 million, which the company says will support upcoming growth initiatives. However, there was no new detail or revision to forward guidance, and operating expenses remain high. Investors will likely focus on the pace of product launches, conversion of the company's sales pipeline, cash usage, and whether margin trends can be sustained as the business scales.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,060%* — a market-crushing outperformance compared to 182% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=7909ff22-1478-409f-8a86-10225d9a5c77&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=870b84f6-60ff-4dba-bc06-456eb9648d22&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=25f55fbf-c339-40a4-a6d9-e16b4abaf65b",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=870b84f6-60ff-4dba-bc06-456eb9648d22&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=25f55fbf-c339-40a4-a6d9-e16b4abaf65b"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "GAAP net revenue",
      "weight": 0.09383033
    },
    {
      "name": "GAAP revenue",
      "weight": 0.0924679
    },
    {
      "name": "new product launches",
      "weight": 0.08378991
    },
    {
      "name": "new products",
      "weight": 0.08344978
    },
    {
      "name": "new product lines",
      "weight": 0.08167135
    },
    {
      "name": "Other new products",
      "weight": 0.07816324
    },
    {
      "name": "Sequential revenue growth",
      "weight": 0.07649234
    },
    {
      "name": "Nexgel Revenue",
      "weight": 0.076104246
    },
    {
      "name": "branded consumer products",
      "weight": 0.07546097
    },
    {
      "name": "consumer branded products",
      "weight": 0.07546097
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.96875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.95947265625
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.8984375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.33740234375
    }
  ],
  "sentiment": {
    "positive": 0.85883814,
    "negative": 0.06545493,
    "neutral": 0.075706914
  },
  "summary": "Nexgel (NASDAQ:NXGL), a maker of hydrogel-based wound care and beauty products, saw a 100% increase in Q2 2025 revenue of $2.88 million compared to $3.08 million in Q1 2025, but missed analyst expectations by 6.5% (GAAP). The company's gross margin improved significantly to 43.6%, reflecting the impact of branded consumer products and increased utilization. Despite this, Nexgel has maintained its full-year 2025 revenue guidance of $13 million and positive EBITDA (non-GAAP), despite continued net losses and declining cash. The company has focused on expanding beyond contract manufacturing by acquiring and developing its own branded products. The acquisition of Silly George and the introduction of new product lines illustrate an effort to create more diversified revenue streams.",
  "shortSummary": "Nexgel's Q2 revenue rose 100.3% to $2.88 million, driven by branded consumer products, but missed analyst estimates despite improved margins and increased product use.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "a3cdc01d69474391902b1cbc537c09cb",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "Nexgel reported a 100.3% year-over-year increase in GAAP revenue to $2.88 million for Q2 2025, although this fell short of analyst expectations. The company's gross margin improved significantly to 43.6%, driven by growth in branded consumer products and contract manufacturing. Despite ongoing net losses and high operating expenses, management maintained its full-year revenue guidance of $13 million and positive EBITDA, indicating a need for accelerated growth in the latter half of the year.",
  "argos_id": "CFJZS9U4K"
}