{
  "url": "https://www.latimes.com/companion-animals/cats/story/catcon-founder-susan-michals-interview",
  "authorsByline": "By Kevin SpencerSenior Content Strategist  Contact",
  "articleId": "a4309a643c724f63a0de2afc5f5a4461",
  "source": {
    "domain": "latimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "city": "Los Angeles",
      "coordinates": {
        "lat": 34.0536909,
        "lon": -118.242766
      }
    }
  },
  "imageUrl": "https://ca-times.brightspotcdn.com/dims4/default/8ef3028/2147483647/strip/true/crop/1196x628+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F58%2Ffa%2F51537f684733b6f577d190e4d118%2Fcatcon-founder-susan-michals.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T17:39:07.387000+00:00",
  "addDate": "2025-08-12T18:21:55.686726+00:00",
  "refreshDate": "2025-08-12T18:21:55.686727+00:00",
  "score": 1.0,
  "title": "Pet Projects: Q&A with CatCon Founder Susan Michals",
  "description": "At CatCon, journalist Susan Michals brings together artists, influencers, rescue organizations, and cat lovers to celebrate modern feline culture and reshape what it means to be a “cat person.”",
  "content": "Every summer, thousands of cat lovers, artists, and feline celebrities descend on Pasadena for CatCon, a one-of-a-kind convention that’s part art show, part adoption fair, and part community celebration of all things cat. Founded by journalist and producer Susan Michals, CatCon has grown in ten years from niche event into the country’s biggest gathering for fans of felines.\n\nWe talked with Susan to talk about the evolution of CatCon, the changing image of the “cat person,” and why supporting small businesses and animal welfare is at the heart of it all. This interview has been edited and condensed for clarity.\n\nQ: Can you share a bit about your background and how you went from being a journalist to launching CatCon and other cat-focused projects?\n\nSure, I worked for years at E on shows like Keeping Up With The Kardashians and Live from the Red Carpet. I was lead producer for promos for 160 countries outside of the US. At the same time, I like to say you know this is LA, everybody has kind of a side hustle these days, two or three jobs. I really wanted to be a journalist, and I worked for Wall Street Journal, Vanity Fair, Huffington Post. But it wasn’t my ticket out of my day job, because, as a freelance journalist it doesn’t really pay that well.\n\nSo I moved from celebrity into the art world because I have an art background. And the first show I created was Cat Art Show. That debuted in 2014 with established artists—my headliners were Shepard Fairey, Mark Wright and Gary Baseman, all LA-based artists. And then I had emerging artists as well. 4000 people showed up at that show, and I realized that this was a demographic of cat lovers that was not being represented.\n\nQ: What made you realize there was a need for something like CatCon, and how did it get started?\n\nAt that point, the only thing on the feline landscape was really the breeder shows, sort of the best of breed, the Westminster Dog Show kind of thing. But regular cat fans were not being represented. Many of these fans were a younger demographic. And so I thought, you know what? I want to do a bigger show, like a convention that would appeal to them, and I needed to curate it like an art show.\n\nI decided I wanted to do information, education and entertainment. Because what I found is that people really wanted to learn a lot about their animals, and you can make even a topic like “clipping your cat’s nails” sexy if you have the right speaker, the right title, and a dynamic person on stage to talk about what this means.\n\nQ: How did the first CatCon come together, and what did you learn from that initial experience?\n\nThe first year, there was only three of us working on this. I curated all the exhibitors. I had people apply. I put together a workshop schedule, a celebri-cat schedule. I wanted it to be immersive as well, and so I thought up activations and I pitched sponsors and sort of brought it all together.\n\nI will say is that my experience working in production and as a journalist really lent itself to putting on a convention, because it is a production in its own right. I brought on people that had done trade shows and worked Comic Con and the Toy Fair to really help me build this show from the ground up, and they are still with me to this day.\n\nQ: Supporting artists and small businesses seems like a major part of CatCon. Why is that important to you, and how does the event help local communities?\n\nIt’s very important for me to offer opportunity to small businesses. Very, very important. It goes back to the Cat Art Show of emerging and established artists. Big sponsors help to support us and finance the show, but it’s very important to me in this curatorial process of picking exhibitors to support those that are on Etsy. Those that are small businesses and give them the opportunity to showcase their wares and their talents.\n\nAnd it was also very important for us to give back to the city of Pasadena and Altadena. We have been, as a community, ravaged by the recent fires, and Pasadena Humane is still boarding animals that their owners have not found a place to live. They’re continuing to board and support the people of this community by taking care of their animals. Pasadena Humane and the city of Pasadena have been so good to us. Los Angeles in general for the past 10 years, but specifically Pasadena since 2017.\n\nQ: Cat ownership has a lot of stereotypes. How have you seen CatCon help shift those perceptions?\n\nThere’s this—and it’s still very present—this negative association with cat ownership, the crazy cat lady. Cat ladies are 60 plus, hoarders, spinsters, Grey Gardens, Dickensian characters. They live with 1000 cats, smell like cat pee, and are unmarried, right?\n\nI will tell you that through the years I get asked two questions every time I say I run a cat convention. The first question is, “How many cats do you have?” And I say one, and people are shocked. I have one cat and one dog.\n\nAnd a second question that I get asked, which I think is really actually rude, but it’s what I get asked, is, “Are you married?” Every time I say I am between husbands at the moment, but that’s not what defines me.\n\nAnd what I found is that, over the years, with CatCon, I think we’ve made a significant dent in what it means to be a cat person. It’s when you put the word crazy in front of cat lady that has the negative connotation.\n\nWhen you say Catwoman versus cat lady, what do you think of? Catwoman—strong and fierce and independent, right? Sexy, right? When you look at the word cat lady, it’s the exact opposite—somebody that you don’t want to be with, somebody that isn’t empowered. What we’ve seen over the years with CatCon is the rise of a different cat lady. It is a combination of empowerment, passion, enthusiasm, and independence.\n\nOur convention is not just cat food and cat litter. We had Petfinder there talking about adoptions. We have people that are bringing the latest in cat tech in water fountains and smart litter boxes and AI and all these different things. We have people that are creating clothing for humans that is cat-centric. We had a fashion show on Saturday called Project Catwalk, where people were given the idea of elevating the cat lady.\n\nQ: The event draws an impressive range of attendees. Can you share more about the community and celebrities involved?\n\nWhat I love about CatCon is: there’s no dog park for the cat person, right? There’s no place to commune, and it’s a community of people that come together to share one single purpose: that they love kitties. Animals give us such wonderful unconditional love and it’s my job to create something year after year that people want to come back for.\n\nThere are so many celebrities that are cat lovers and we’re right here in Los Angeles so we get a lot of visits from the stars. We had Jake Johnson there. Matt Groening from The Simpsons was there. Lisa Loeb was there. Alexandra Shipp, Seth Green. David Dastmalchian was there from MurderBot and Dexter. He came with his family, and Gilles Marini comes all the time. It’s amazing to see them show up and support the event, to help raise our profile and get the word out.\n\nQ: In recent years, we’ve seen the “adventure cat” phenomenon take off. Has this also changed the perception of cats and cat owners?\n\nWith the advent of the adventure cat, of which we had a number at CatCon, it’s no longer that cats are just indoor creatures. Now, I would say the majority of them are still very much indoor creatures, but we are seeing this definitive shift.You will see hotels that say pet friendly and you have to see if they take cats specifically but a lot more have started to. Hyatt, Sheraton, case by case, they’re starting to accept cats, because we are seeing this uptick in people taking their cats with them when they travel.\n\nThe adventure cats that come to CatCon are like Hollywood child stars. They’ve been doing this since they were little, so they’re used to this sort of thing, the crowds and the attention. We have all these kitties this year who did meet and greets, and they average 100 meet and greets per hour.\n\nWe had two cats, Sponge Cake and Buttercream. They travel with their owners all over the world in a backpack. They just got back from Venice and they’ve got 2 million followers.\n\nQ: What keeps you motivated year after year to keep growing and evolving CatCon?\n\nWhat I know about Hollywood and sort of the way we live now is you can do a phenomenal job, but every year you’ve got to up the ante. And I welcome that challenge, because I want to keep it fresh. And that’s why I work on CatCon all year round, because I’m looking for what’s going to make this audience come back. What’s going to make them happy, and what’s going to help them make a better life for them and their pets.\n\nQ: Tell us about your latest project, The Meow Factor. What is it, and where do you see it going?\n\nI spoke at South by Southwest in 2019, and I really loved it. And I would really love to do a TED Talk eventually. I love public speaking. And I thought, you know, there’s really nothing out there for cat people in—I mean, sure you can watch TikTok videos, you can watch a YouTube video, but how do I continue to bring the community together in person? So what I decided to do was to create this sort of salon environment called The Meow Factor.\n\nWe did something about my—basically, my cat’s a celebrity, and how I’m dealing with that. We did something on cat portraiture. And then we did something with Nathan the Cat Lady and Sterling the Trap King about trap neuter return. I’m creating more of a salon setting. It’s not 300 people, it’s 50 people so there’s better engagement and opportunity to ask more questions.\n\nI’ve already done it at Annenberg Pet Space, and it’s something that I’m looking at branching out across the country. Once I get a little bit of rest after CatCon, I’m definitely going to continue on my kitty trajectory.\n\nQ: And finally, when can we expect the next Cat Art Show?\n\nIt’s going to be sometime next year. January 2024 was 10 years, and I do it every two, so at some point next year. I don’t know where it’ll be or precisely when, but stay tuned!",
  "medium": "Article",
  "links": [
    "https://www.latimes.com/companion-animals/advice/story/service-animal-rights-laws-explained",
    "https://www.latimes.com/companion-animals/advice/care/story/pet-travel-guide",
    "https://www.linkedin.com/posts/susannmichals_introducing-the-meow-factor-a-new-lecture-activity-7322382081899081729-1evG/",
    "https://www.latimes.com/companion-animals/cats/story/cat-grooming-guide",
    "https://www.latimes.com/companion-animals/dogs/breeds",
    "https://www.latimes.com/companion-animals/dogs/breeds/story/hypoallergenic-no-shed-dog-breeds",
    "https://pasadenahumane.org/",
    "https://www.instagram.com/spongecake_thescottishfold/?hl=en",
    "https://www.instagram.com/the_original_trapking/?hl=en",
    "https://www.latimes.com/companion-animals/cats/breeds/story/friendliest-cat-breeds",
    "https://www.instagram.com/nathanthecatlady/?hl=en",
    "https://www.latimes.com/companion-animals/advice/care",
    "https://www.latimes.com/companion-animals/advice",
    "https://www.latimes.com/companion-animals/advice/care/story/pet-microchipping-guide",
    "https://annenbergpetspace.org/",
    "https://www.latimes.com/companion-animals/cats",
    "https://www.latimes.com/companion-animals/cats/story/indoor-outdoor-cat-how-to-decide",
    "https://www.latimes.com/companion-animals/dogs/care",
    "https://www.latimes.com/companion-animals/cats/story/cat-scratching-solutions-guide",
    "https://www.catconworldwide.com/",
    "https://www.latimes.com/companion-animals/dogs/care/story/how-to-choose-the-right-dog",
    "https://www.latimes.com/companion-animals/advice/story/is-pet-insurance-worth-it",
    "https://www.latimes.com/companion-animals/dogs/care/story/dogs-summer-heat-sun-safety-tips",
    "https://www.latimes.com/companion-animals/dogs/care/story/safe-dog-chew-teeth-and-health-guide",
    "https://membership.latimes.com/newsletters#la-times-studios",
    "https://www.latimes.com/companion-animals/cats/breeds",
    "https://www.petfinder.com/",
    "https://www.latimes.com/lifestyle/story/2024-01-16/cats-on-display-at-whimsical-la-cat-art-show"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cat people",
      "weight": 0.102068014
    },
    {
      "name": "Cat ladies",
      "weight": 0.09562308
    },
    {
      "name": "cat lady",
      "weight": 0.09562308
    },
    {
      "name": "cat",
      "weight": 0.092636935
    },
    {
      "name": "cats",
      "weight": 0.092636935
    },
    {
      "name": "cat lovers",
      "weight": 0.09187535
    },
    {
      "name": "cat owners",
      "weight": 0.091060504
    },
    {
      "name": "cat litter",
      "weight": 0.090527974
    },
    {
      "name": "Cat ownership",
      "weight": 0.08995377
    },
    {
      "name": "cat ownership",
      "weight": 0.08995377
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Pets & Animals/Animal Products & Services/Animal Welfare",
      "score": 0.4013671875
    },
    {
      "name": "/Pets & Animals/Pets/Dogs",
      "score": 0.375732421875
    },
    {
      "name": "/Arts & Entertainment/Events & Listings/Other",
      "score": 0.34228515625
    }
  ],
  "sentiment": {
    "positive": 0.19472295,
    "negative": 0.44290495,
    "neutral": 0.36237207
  },
  "summary": "CatCon, a convention for cat lovers and celebrities, has been founded by journalist and producer Susan Michals. The event is part art show, part adoption fair, and part celebration of all things cat. It has grown from a niche event to become the country's biggest gathering for fans of felines. Michals credits her background in television and art to creating the first show, Cat Art Show, featuring established artists and emerging artists. She also emphasizes the importance of supporting small businesses and animal welfare. The first CatCon event was held in 2004 with three working members. The founder also highlighted the shift in perceptions about cat ownership and the city of Pasadena.",
  "shortSummary": "CatCon, founded by journalist Susan Michals, has grown from a niche event to a major support for small businesses and animal welfare.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "2ac5a242127c43d3817e5102496dba72",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.latimes.com/companion-animals/dogs/care/story/how-to-choose-the-right-dog",
      "text": "How to Ensure the Perfect Match With Your New Dog: Expert Tips from Trainer Michael Hill\n- Share via\nMany people consider the act of bringing a dog into their home to be a fun and exciting milestone in their lives. While it can very much be both of those things, it is also a long-term commitment that can shape your family’s life for years to come.\nChoosing the right dog means understanding how a dog’s background, their energy level, and their needs align with your household’s lifestyle and abilities. When you get that wrong it can lead to stress and disappointment. The right match, though? That’s what fosters a bond that lasts a lifetime.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nFirst Things First: Assess Your Family’s Lifestyle\nThe first step to finding the right dog is taking an honest look at your day-to-day life. The needs of a dog go beyond just love. They need structure. They need attention. They need consistency. Daily care, training, exercise and socialization are all critical, especially in the early months.\nSo you have to ask yourself:\nDo we have the time and patience for a puppy’s demands? Or would an adult or senior dog be a better fit?\nAre we equipped to navigate behavioral challenges like separation anxiety or leash reactivity?\nAre we prepared for potential health and grooming needs, with the right support systems in place?\nEnergy Levels of You and Your Pet Matter\nYou have to match a dog’s activity needs to your own. High-drive working breeds like Doberman Pinschers need a lot of stimulation and space, while many companion dog breeds are content with a leisurely walk and a nap.\nBe Mindful of Your Living Situation\nDo you live in an apartment or a home with a yard? If you have an active dog breed and no yard, you have to make sure you can still provide the necessary exercise and engaging activity for that dog.\nAre there children in the household? If so, you have to prioritize breeds who tend to enjoy kids and consider adult dogs who have a proven track record of being reliable with children. Nervous and fragile dogs, for example, may have a difficult time being comfortable around kids.\nAre there other pets already in the household? Size, energy, and behavior differences can all play into harmony and safety in a multi-pet home.\nUse Knowledgeable Experts to Help With Your Dog Search\nWhether you’re enlisting the help of a rescue organization or a responsible breeder, informed guidance is essential. Be honest about your experience level and consider professional resources that can help you make a well-informed decision.\nProfessional dog trainers and veterinarians offer years of experience interacting with many different dog breeds in their respective fields. Even dog-savvy friends and family can offer unbiased evaluation and advice relative to your personality and lifestyle that can be valuable in your matchmaking journey.\nUnderstand Temperament\nIf possible, consider visiting a potential litter and observing the interactions in person. A reputable breeder or experienced foster can give insights into each pup’s personality tendencies, rather than just relying on what you see during a short visit.\nWhen you’re evaluating adoptable dogs, ask the shelter staff about the dog’s behavior, their triggers, and their history. The stress of rehoming can dramatically impact a dog’s behavior, so they will need time and support during the acclimation process in their new home.\nThink about what stage of life you’re in so that you can be fair to the dog. Young professionals, older adults, or families with kids all have different needs when it comes to temperament and energy levels.\nHealth Considerations\nAlways request vet records for your new dog, and make sure to also bring them to visit your personal veterinarian right after adoption. If purchasing from a breeder, ask about breed-specific health tests recommended by the OFA (Orthopedic Foundation for Animals) and spend time educating yourself on the family health history. Knowing what to expect can save you heartbreak and money down the line.\nBreed Characteristics vs. Individual Traits\nGeneral Tendencies Among Specific Breeds\nBreeds and families of dogs have genetic predispositions. Some are eager to work, while others are bred for calm companionship. But you have to remember that every dog is an individual. Each puppy should be assessed for their specific personality profile. We’re talking about the core temperament and behavioral traits that define a dog’s unique disposition, communication style, and interaction with its environment.\nThe Importance of a Behavioral Assessment\nDon’t choose based on looks alone. Talk to the breeders or the rescue staff about the dog’s behavior. Ask them: Is the dog eager to engage or more reserved? How does the dog respond to new environments or people? Are there any notable stressors that the dog does not enjoy?\nAvoid These Common Matching Mistakes\nLooks Aren’t Everything When Selecting a Breed\nI know, a fluffy puppy or Instagram-trendy breed can be irresistible. But you have to focus on personality and lifestyle fit for the long term. When expectations are misaligned, that’s what often leads to rehoming.\nShould You Adopt a Rescue or Purchase a Dog Through a Breeder?\nThere’s no one right way to bring a dog into your life. Adopting saves lives and can be deeply rewarding, but reputable breeders provide helpful data for transparency and predictability and will stand by their dogs for life. The key is to avoid unvetted sources that prioritize profit over welfare.\nI always tell families who find using a reputable breeder to be the right pathway for finding their dog that they can still support rescue work by volunteering time, donating needed supplies and pledging financial support.\nRed Flags to Watch For\nLook out for breeders or adopters who don’t provide health records or dodge questions. It’s also a red flag if someone is pressuring you into a quick decision, or if you’re choosing a dog purely on the “cute” factor without considering your lifestyle. If it feels too good to be true, you have to trust your intuition. Look for honesty and integrity in your matchmaking inquiries.\nPlan Accordingly for the Future\nTraining Is an Investment For Life\nTraining isn’t just for the early days. It’s a lifelong process that builds confidence and communication. It can prevent future issues and deepen your bond.\nRemember That Family Dynamics Change\nYou have to think ahead: How might your family grow or change? Will a dog that thrives with young children still fit when the kids are teens? Will your routine shift with a career change or a move?\nBringing Your Dog Home\nPreparation\nBefore bringing your new dog home there are some key things that should be taken care of. Puppy-proof your space, gather supplies and book a first vet appointment right away. Creating a safe and calm environment sets the tone for success.\nEarly Integration\nStart simple routines and training right away. Give your new dog time to adjust, and use those early weeks to build trust and introduce new experiences with plenty of quality bonding time.\nA Lifelong Bond Worth Building\nGoing through a thoughtful and deliberative dog matchmaking process is the foundation to successful dog ownership. Putting in the effort when it comes to research, preparation, and training will help make your new dog an integral part of your family, bringing joy, comfort and connection for years to come."
    },
    {
      "url": "https://www.latimes.com/companion-animals/cats/breeds",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/companion-animals/dogs/care",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/companion-animals/dogs/breeds",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/lifestyle/story/2024-01-16/cats-on-display-at-whimsical-la-cat-art-show",
      "text": "- Share via\n1\nSince 2014, a recurring art show dedicated to cats has captured common feline actions (commandeering a pet parent’s lap, unflinchingly staring down an onlooker, shredding upholstered furniture and sweetly nuzzling) and just as many fantastical ones.\nThe Cat Art Show returns this week to celebrate a milestone. Starting Friday, the “Cat Art Show: The Tenth Anniversary” event will bring works from about 50 artists to Wallis Annenberg PetSpace in Playa Vista. From oil paintings to sculptures and tile mosaics, cats in all of their glory will have the run of the walls for three days. Also, for the first time, there will be a live pet adoption running concurrently with the show — paws and whiskers upstairs, cat-inspired art downstairs.\nPlanning your weekend?\nStay up to date on the best things to do, see and eat in L.A.\nDuring the last decade, this group exhibition has become a must-see for gallery hoppers who have flocked to view the works of such boldface art-world names as Mark Ryden, Tracey Emin and Jill Greenberg. Likewise, cat lovers have often lined up at the art event, donning all manner of cat-covered paraphernalia to show their devotion to the animals of the hour. The Cat Art Show delivers just the right amount of camp but holds enough cool-kid appeal (think graphic artists Yusuke Hanai and Eric Haze) to attract those who don’t consider themselves furball fans.\nFor the record:\n4:42 p.m. Jan. 16, 2024A previous version of this story described L.A. artist Rabi’s multimedia artwork as photographic.\n“It’s grown to be a bit of everything — a lot more big collectors but a lot more of the general population too,” said Susan Michals, the Cat Art Show’s founder and head curator.\n‘Miss Pitch and Furl,’ by Annie Montgomerie, and ‘Une Chat,’ by Léo Forest. (Annie Montgomerie; Léo Forest)\nCreating an event that celebrates Michals’ two great loves was a no-brainer. She’s had cat companions her whole life, and she grew up with gallerist parents and has covered visual art extensively as a freelance journalist.\n“I wanted to do a show that focused on emerging and established artists,” Michals said, “so I needed some great names to give validity … that this was a serious art show.”\nWhether you want to try candle making, Jaipur block printing, glass blowing, neon bending or woodworking, L.A. has a space for that.\nTo start, she approached artists she’d interviewed professionally or knew personally. The prompt she gave them was: “Cats as muse.” Shepard Fairey was among the first artists tapped for the inaugural show along with Gary Baseman and Tim Biskup.\nMultimedia artist Britt Ehringer was another Angeleno who Michals approached back in 2014 and he eagerly agreed, enticed by the opportunity to raise funds for different animal charities. (Proceeds from the art sales benefit animal charities; this year’s is Wallis Annenberg PetSpace’s Extraordinary Care Fund.) Each year since, he’s submitted pieces that pair pop culture figures such as Scarface, Frida Kahlo and Tupac Shakur with clusters of cats.\n“My other work’s not so pop art-y, so this is my space to play,” Ehringer said, speaking of his cat-related contributions.\nThis year’s entry, “Kobe Entering the Kingdom of Kittens,” depicts Kobe Bryant soaring through the heavens as a coterie of cuties gaze at him (though, of course, a few appear aloof). The Lakers legend is joined by one of the artist’s two cats, Tofu, seen floating in the piece’s upper right-hand corner.\n“There’s lots of different subcultures in the art world. I like how [the show] mashes up all those subcultures,” Ehringer said, noting that, over the years, the Cat Art Show has enabled him to establish friendships with artists he wouldn’t have otherwise met.\n“Almost all of the art that I got in the first year was domestic. It’s definitely become more global in scope,” said Michals.\nThe 2024 collection of art is expected to include a comically disfigured painting by Vienna-based artist Eva Beresin, motion-filled sketches by Parisian Léo Forest, work by Korean Australian graphic artist YeahYeahChloe, and from the U.K., Annie Montgomerie’s handcrafted vintage toy-style kitties dressed in darling play clothes made from upcycled fabrics.\nSocial media makes taking your feline family member on outdoor adventures look easy, but the reality is that it takes planning — and a cat that’s cool with it.\n“News of the Cat Art Show has traveled around the world and was known to me here in Scotland,” said collage artist Lola Dupre, who’s based outside of Glasgow and is participating for the second time. “These shows include some of the greatest artists making work today, so it is an honor and privilege to include my work.”\nFeline portraiture is a common part of her distortion-heavy cut-paper practice, and she frequently takes inspiration from her own companion, Charlie. This year’s entry, “Squits,” was inspired by a specimen she encountered while visiting a cat colony in Granada, Spain.\n“Since I was young, I have known many cats, each one an individual,” Dupre said. “Their independence, energy and wildness I find fascinating.”\nWhat makes the Cat Art Show compelling is that each artist views the muse in their own personal way, from impish to serene. Whatever way an attendee feels about cats, they’re likely to see that emotion reflected in various forms including glass sculpture, wooden figurine or porcelain candy dish.\n“They are evil but they’re also awesome. And people have held that contradiction about cats since the dawn of time,” said L.A. street artist Rabi whose “Good Luck” artwork will be featured in the Cat Art Show. “People have thought cats were their gods and then demons and devils.”\nL.A. street artist Rabi’s artwork, ‘Good Luck,’ was inspired by the duality and contradictions surrounding cats. ‘People have thought cats were their gods and then demons and devils,’ Rabi says. In one photo, his black cat, Sea Beast, looks at a mirrored section of Rabi’s artwork. (Rabi)\nDrawn to exploring the concepts of duality and contradiction, he feels that cats are the perfect case study. His artwork for the show — two multimedia triptychs — combines images of broken mirrors, black cats and the number 13. “I loved the idea of challenging these bad luck archetypes and then calling it good luck,” he said.\nRabi tipped his hat to Michals for capturing and amplifying the dopamine rush a person gets from watching, and re-watching, the perfect cat video on social media.\n“I think Susan does a really good job of bringing that culture to a tangible environment where we can all see things in real time, in real life, together,” he said.\nAt these coffee shops, restaurant patios, markets, galleries and more, canine companions are greeted with excitement — and maybe even some special treats.\nIn addition to showing all the ways in which cats are “an art form in themselves,” Michals aims for the Cat Art Show to dash stereotypes about what it means to fancy cats.\n“What I saw with the first show was that the people that came did not fit the model of the hoarder, spinster, crazy cat lady,” she said. “I saw that audience and I was like, ‘These people are severely underrepresented and underserved as consumers and art appreciators.’\n“Really, part of what these shows are about is to showcase my audience and say: ‘Look at these people. They love their animals and they love art,’” she said. “They do not represent the negative connotations associated at all.”\nThings to do\nCat Art Show\n11 a.m.-5 p.m. Jan. 19-21\nWallis Annenberg PetSpace, 12005 Bluff Creek Drive, Playa Vista, CA 90094\nEvent is free but ticketed by day"
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice/story/is-pet-insurance-worth-it",
      "text": "Pet Insurance: Is It Worth It for Healthy Pets?\n- Share via\nOne moment your dog is having the time of their life at the beach. The next, you’re at the vet discussing a cruciate ligament injury, emergency surgery and a bill that could cost thousands. Or your cat, who is usually bright-eyed and demanding breakfast, is suddenly lethargic with tests pointing to a serious illness. These moments are stressful enough without the added weight of a huge vet bill.\nPet ownership is pure joy, but it’s also full of financial surprises, from broken bones to serious illnesses. In fact, more than half of all pet owners in the U.S. say they’ve delayed or skipped care because of the cost.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nPet insurance is designed to change that. You pay a monthly premium, and when something happens, whether it’s an accident, a chronic condition or a sudden diagnosis, the insurance company pays a chunk of the cost so you can focus on your pet’s treatment, not your bank account. But is pet insurance really a smart move? Or another way for the industry to make money off of pet owners? The answer, as usual, is complicated.\nThe All-Important Question Of Cost\nHow much you pay for pet insurance depends on your pet. Factors like their age, breed and health all influence the cost. Dogs and cats with higher medical risks, like purebreds or those prone to specific health issues, often cost more to insure than a mixed-breed dog. According to the North American Pet Health Insurance Association, the average accident and illness policy runs about $500 a year for dogs and $300 a year for cats. For a cheaper, accident-only policy, you’ll pay around $150 a year for a dog and $100 for a cat.\nBut remember, this type of policy leaves you completely uncovered for health issues like dental disease, skin allergies or a serious illness. Your monthly premium is also influenced by the insurance company you choose, your deductible, your chosen annual limit and whether you add a separate wellness plan for routine preventive care. Many pet insurers also offer optional coverage for prescription medications.\nWhat Pet Insurance Covers\nMost policies fall into three main buckets: Accident-only policy This covers injuries like broken bones, cuts and swallowed objects. Accident and illness policy This adds coverage for illnesses, chronic conditions and hereditary problems. Wellness plan add-ons These help with preventive care, such as checkups, dental cleanings and flea prevention. Most pet insurance plans cover the big stuff, like emergency surgery, chronic conditions and expensive treatments such as for cancer. But most policies won’t cover pre-existing conditions, cosmetic procedures or have certain waiting periods before coverage begins.\nChoosing the Best Plan for Your Pet\nThe right pet insurance depends on personal finances and your pet’s needs. Consider your monthly premium and annual cost, the reimbursement rate and annual limit, and whether the plan includes preventive care or requires a separate wellness plan. It’s also wise to check if a plan covers common health problems your pet’s breed is prone to. Can you afford the deductible if a big, unexpected expense comes up? Comparing quotes from several pet insurance companies is key to finding the right fit.\nAdditional Special Considerations\nFor active dogs at higher risk of injury or breeds prone to health issues, an accident and illness plan can be a crucial financial safety net. Pet parents with older pets may pay more for pet insurance, but it can still help afford treatment for costly medical bills. Indoor cats might have fewer accidents but can still face serious illnesses or chronic health problems later in life. For some pet owners, the right pet insurance policy makes it easier to budget for vet expenses over the course of their pet’s life.\nAlternatives to Pet Insurance\nSome people choose to self-insure by building a dedicated emergency fund for vet costs. Other alternatives include using vet payment plans or financing like CareCredit or seeking charitable help from animal welfare groups. While these approaches work for some, they lack the built-in financial safety net that pet insurance provides when you’re hit with a huge and sudden vet bill.\nWhat’s Behind Rising Vet Costs\nThanks to advances in veterinary care, your pet can get the same level of attention as in human health insurance. MRIs, orthopedic surgery or advanced cancer treatment. It can all be covered. Those capabilities do mean higher costs. It’s not unusual for a single visit involving diagnostics and treatment to cost thousands.\nSo, Is Pet Insurance Worth It?\nFor some, the answer is a clear yes. Pet insurance is worth it if a sudden vet bill of a few thousand dollars would be a hardship. For others, especially those who can self-insure through savings, it might not be necessary. The key is understanding pet insurance costs, reading the fine print of any plan and choosing coverage that fits your pet’s health risks and your financial comfort zone.\nIf you decide to buy pet insurance, do it early. The younger your pet, the fewer pre-existing conditions you’ll have to worry about and the more likely you’ll have coverage in place when unexpected expenses arrive."
    },
    {
      "url": "https://www.linkedin.com/posts/susannmichals_introducing-the-meow-factor-a-new-lecture-activity-7322382081899081729-1evG/",
      "text": "Introducing \"The Meow Factor\"... a new lecture series brought to you by the team behind CatCon. Think 'like Ted Talks for the cat set', these conversations are designed to inform pet parents on various aspects of life with cats. These lectures are free to the public but ticketed and limited! We kick off at Wallis Annenberg PetSpace on May 7th at 7PM: Purrmission Granted: Photographing Cats with Care and Respect: Pet photographer Danielle Spires (@catpartypetportraits) reveals what it really takes to photograph our feline friends. Capturing cats takes more than talent behind the camera—it’s about tuning into their moods, respecting their space, and earning their trust. + The Movie Star on My Couch: Join Molly O'Neill and a Cat Named Squirrel for a behind-the-scenes look at life with a feline star. From on-set antics to the surprising world of animal casting, Molly shares what it’s really like to live with a famous cat (or two). This event is in partnership with Wallis Annenberg PetSpace and graciously sponsored in part by Liquid Death. Tix: https://lnkd.in/gNWeB3Xn\nStoryline Strategist | Original Content Specialist & Writer | Journalist | Copywriter | Audio/Video Producer | and Voice Over Talent, who is nice. Together, we'll produce content with clout.\n3moCan't wait to attend. Thanks for such a great idea for the evening, at such a remarkable place."
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice/care",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice/care/story/pet-travel-guide",
      "text": "Pet Travel Has Evolved. Here’s What to Know Before You and Fido Take Flight.\n- Share via\nIt feels like everyone’s bringing their dog, cat or even pet pig on vacation these days. Flexible work schedules, rising pet adoptions and a shift toward slower and more intentional travel. It all means more people are inviting their animals along for the ride.\nWhether you’re flying to Paris with your miniature poodle or road-tripping up the California coast with your rescue mutt, pet travel is more doable, if not a little more complicated, than ever. Airlines are adapting. Hotels are, too. But planning a trip with a pet still comes with its own set of pitfalls to navigate.\nFrom paperwork to crate requirements to how to keep your animal calm in a crowded terminal. These are the things to know before hitting the road with your four-legged bestie.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nKnow Before You Go: What’s Changed\nFlying with pets used to be a pretty niche flex. Now that it’s much more common, the rules have changed. Airlines are stricter about how many animals can fly in the cabin. Some routes don’t allow them at all.\nIf you’re flying internationally, expect more prep. For Europe-bound dogs, you’ll need an ISO-compliant microchip, a current rabies vaccination, and a health certificate signed by a USDA-accredited vet. Headed to Japan or Australia? You might need to start the paperwork six months in advance.\nNot sure where to begin? The USDA APHIS pet travel portal and European Commission’s pet movement guide both break things down country by country.\nFinding the Right Airline—and the Right Carrier\nStart with your airline. Some, like JetBlue, offer pet perks and loyalty points. Others are more hands-off. All have different size limits for carriers, so check that first—most require a soft-sided carrier that fits under the seat.\nBook early. Really early. In-cabin spots are limited and often fill up weeks ahead.\nFor large dogs flying cargo, things get trickier. Airlines follow the IATA Live Animals Regulations, which means your crate needs to be ventilated, leakproof, and lockable. Some airlines won’t fly pets in cargo at all during summer due to heat risks.\nDouble-check the fine print. Then check it again.\nCar vs. Plane: It’s Not Always Simpler on the Ground\nDriving gives you control over the schedule but long hours on the road come with their own challenges. Use a harness or secured crate and take breaks every 2 to 3 hours. Keep pets in the back seat. Never leave them alone in the car. And bring printed vet records just in case.\nWhat to Pack When Traveling With Your Pet\nYou don’t need to pack too much luggage, but there are a few key pieces of pet travel gear that will ensure a smooth trip. A soft carrier that meets airline specs. Collapsible bowls. Calming spray (Adaptil for dogs, Feliway for cats). A favorite blanket or toy. And don’t forget something that smells like home.\nIf your pet tends to get anxious, schedule a vet visit a couple of weeks before your trip. Ask about motion sickness meds like Cerenia or calming chews with ingredients like L-theanine.\nBring two copies of your paperwork—one in your bag, one with your pet. It’s a small thing that can save you a lot of stress.\nSmall Surprises (That Happen All the Time)\nEven with the best prep, travel throws curveballs. Flights change. You get rebooked on a plane that doesn’t allow pets. Your “pet-friendly” hotel turns out to only accept dogs under 20 pounds.\nIf your trip has multiple connections or international stops, consider working with a pet relocation service like PetRelocation or Happy Tails Travel. They handle everything from customs paperwork to crate fitting so you can focus on the part where you actually enjoy the trip.\nInternational Travel? Give Yourself More Time Than You Think\nSome countries require blood tests, microchip scans and paperwork submitted months in advance. It’s not difficult, it’s just detailed. Even one typo on a health certificate can derail the best laid plans.\nAlso worth knowing: certain breeds like French bulldogs and Persians may not be allowed to fly in cargo due to respiratory risks. And some airlines won’t allow animals in the cabin at all on long-haul routes.\nWhen It’s Not a Vacation\nSometimes travel isn’t optional. You’re relocating. Bringing a rescue home. Visiting family. In those cases, emotional support animal (ESA) and service dog rules matter more.\nMost airlines have retired ESA policies and now only accept trained service animals with documentation. The Department of Transportation’s latest rule explains exactly what counts.\nEnsuring a Smooth Flight Ahead\nTraveling with pets is absolutely possible for the owner on the go. It just requires smart and thorough research and planning. The more you know up front, the less you’ll have to troubleshoot on the go.\nStart early. Bring backup copies. Ask questions. Stay flexible. And remember, your dog doesn’t care about flight delays or middle seats. They just want to be near you."
    },
    {
      "url": "https://www.latimes.com/companion-animals/cats",
      "text": "LA Times Studios does not involve the Los Angeles Times editorial staff and produces content developed through collaboration with licensed veterinary professionals and external contributors, including text, graphics, images, and other material contained on the website, apps, newsletter, and products (“Content”), is general in nature and for informational purposes only and does not constitute medical advice; the Content is not intended to be a substitute for professional animal advice, diagnosis, or treatment. The content provided is intended for informational and educational purposes only and should not be construed as medical or nutritional advice. If your pet is facing a medical emergency, call your local animal emergency services immediately, or visit the nearest vet or animal urgent care center. Always consult with a qualified veterinarian before making any decisions related to your pet’s physical or mental well-being. LA Times Studios does not recommend or endorse any specific test, clinician, clinical care provider, product, procedure, opinion, service, or other information mentioned in LA Times Studios Content nor make any guarantees about the efficacy or safety of products or treatments. Health conditions and drug information contained are subject to change and are not intended to cover all possible uses, directions, precautions, warnings, drug interactions, allergic reactions, or adverse effects. Questions? Please email studios@latimes.com."
    },
    {
      "url": "https://www.latimes.com/companion-animals/cats/story/cat-scratching-solutions-guide",
      "text": "Cat Scratching Solutions: Expert Advice to Save Your Sofa\n- Share via\nCat scratching. It’s as natural to felines as purring or chasing a toy. It’s not misbehavior. It’s an instinct that’s essential for their physical and emotional well-being.\nBut when your sofa arms start looking like shredded wheat it’s hard not to get frustrated. Hannah McCoy, owner of Hannah’s Cat Training in Los Angeles, has over 20 years experience in the field. She says scratching is not just necessary for the physical health of your cat but also for mental and emotional well-being. She explains, “Cats need to be able to frequently scratch objects in their environment to feel safe in their own territory. It helps them know they are ‘home’ and it boosts their confidence.”\nScratching lets cats keep their nails healthy, stretch their bodies and leave scent marks. Many cats pick high-traffic spots or sturdy surfaces like couch corners because these are ideal for scent marking and a good stretch. Once a cat starts scratching a particular item it becomes a familiar place and almost a ritual.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nProactive Cat Training: The Key to Preventing Unwanted Scratching\nMcCoy emphasizes that scratching is very much a pattern. Like dogs who revisit the same trees on walks, cats return to favorite scratching spots throughout the day. She says, “Once your cat has started scratching an object, it has their scent deposited. This makes it more difficult to switch them over to the right objects than just preventing it from the get go.” So don’t wait for damage to happen. You need to anticipate your cat’s need to scratch and offer suitable alternatives from the beginning.\nHow to Choose and Place the Best Cat Scratching Posts\nMost cats prefer sisal rope or corrugated cardboard for scratching, but style and placement matter just as much as the material. McCoy points out a common mistake of putting scratching posts far away from furniture in hopes cats will ignore the couch and find the post. She says your cat is naturally going to decide where in your house they want to scratch and if the scratchers you provide are nowhere near there, they will ignore the scratchers and continue scratching the wrong items.\nShe suggests instead placing posts directly beside furniture or areas that your cat will likely want to or have already begun to scratch. These items need to be out in social areas and there need to be several on each level of the house. Ideally at least one in each main room that the cat will spend time in.\nVariety matters too. Some cats prefer vertical posts for a full-body stretch while others like horizontal pads or ramps. Offering multiple styles and making sure each is sturdy and accessible greatly increases your success.\nRedirecting Cat Scratching: How to Train Cats to Use Scratching Posts\nDon’t panic if your cat has already started scratching the wrong spot. Block access to the damaged area using a plastic barrier, furniture cover or rearranging items and immediately place a scratching post or mat nearby. McCoy recommends setting up enticing and desirable scratching items nearby where your cat has shown they already want to do this behavior. Reward them with a treat and praise every time you catch them doing it.\nAdding catnip spray, treats or toys to the new scratcher can make it more appealing. Sticky tape or foil can discourage your cat from returning to the old spot since the texture is unpleasant for their claws.\nTraining Mistakes to Avoid: What Not to Do When Cats Scratch Furniture\nPunishing cats for scratching by yelling, spraying water or clapping doesn’t work and often makes things worse McCoy warns. “They are not just filing their nails, scratching is actually a very nuanced behavior. When you suddenly get angry and begin chastising them, this is very confusing for them and creates stress and conflict.” In some cases, the attention, even negative, can reinforce the behavior. Instead, focus on positive reinforcement and making the right choices easy for your cat.\nCat Scratching and Stress: Helping Anxious Cats Feel Secure\nIf your cat’s scratching seems excessive or destructive, stress could be the root cause. Scratching is a stress-relieving behavior, McCoy explains. A cat with increased stress absolutely will have a desire to scratch more in an effort to blow off some steam and increase their sense of safety and confidence in their home. Look for changes in the household, new pets or routine disruptions and provide safe quiet zones and consistent routines to help your cat feel secure.\nEssential Tools and Tips to Protect Furniture From Cat Scratching\nNail Trimming: Regularly trimming your cat’s claws as part of the grooming process can minimize damage during the training process.\nNail Caps: Temporary, humane vinyl nail caps are available to help protect surfaces.\nAvoid Declawing: Never declaw. It’s inhumane and in some states illegal. It leads to severe short-term and long-term pain plus behavioral problems.\nMcCoy is clear that it’s a biological and instinctive need and your cat is going to do it. It is up to you to anticipate it and to prevent them from doing it in unwanted areas. Also to proactively ensure they do it in the right areas from the day they arrive in your home. Addressing scratching early and positively can prevent bigger problems like rehoming or surrender for something that was entirely preventable."
    },
    {
      "url": "https://www.latimes.com/companion-animals/dogs/breeds/story/hypoallergenic-no-shed-dog-breeds",
      "text": "Hypoallergenic Large Dogs: Big Breeds That Won’t Cover Your Couch in Fur\n- Share via\nFor pet parents who love big dog breeds but want to avoid constant cleanup, low-shedding dogs can be a perfect match. Whether you suffer from allergies or just prefer a cleaner home, choosing a hypoallergenic dog breed with minimal shedding means less dog hair on your clothes, furniture, and floors.\nWhile no dog is truly 100% hypoallergenic, several large dog breeds come close. These breeds often produce less pet dander and shed very little loose fur, making them ideal for allergy sufferers.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nStill, these large hypoallergenic dogs require regular grooming and frequent brushing to keep their coats clean and tangle-free. Let’s dive into the best options for no shed large breed dogs, including details about temperament, grooming needs, and suitability for different households.\nGiant Schnauzer\nThe Giant Schnauzer is one of the most iconic schnauzer breeds and a favorite among those looking for non shedding breeds. With its dense wiry coat, this breed sheds very little but requires regular brushing and occasional trips to a professional groomer to maintain its shape.\nOriginally bred as a guard dog and cattle herder in Germany, the Giant Schnauzer is strong-willed, intelligent, and protective. They’re best suited for active families who can offer consistent training and ample physical activity. This breed thrives on structure and loves a job to do. While affectionate with their families, they may be reserved around strangers. Common health concerns include hip dysplasia and eye issues.\nWith their loyal nature and hypoallergenic coat, Giant Schnauzers are an excellent choice for experienced owners looking for large dogs that don’t shed.\nPortuguese Water Dog\nAs a classic water dog breed, the Portuguese Water Dog has a dense curly coat that’s both hypoallergenic and low shedding. These dogs need frequent brushing and professional grooming every few weeks to prevent mats and tangles, but they’re among the best dogs that don’t shed excessively.\nOriginally bred to assist Portuguese fishermen, this breed is active, intelligent, and eager to please. They love swimming, hiking, and anything that involves bonding with their humans. Portuguese Water Dogs are fantastic with kids and make excellent family pets, but their high energy levels demand regular exercise.\nBecause they’re a hypoallergenic dog, they’re ideal for households looking to minimize pet dander without sacrificing personality or companionship.\nIrish Water Spaniel\nThe Irish Water Spaniel is an ancient dog breed and one of the rarest spaniels recognized by the American Kennel Club. With a tight, waterproof coat of ringlets, this hypoallergenic breed sheds very little and is often considered one of the top breeds that don’t shed. Like others on this list, however, it benefits from weekly brushing and professional grooming to maintain coat health.\nSpirited, eager to work, and a little mischievous, Irish Water Spaniels are best suited for active individuals or families. They’re smart, trainable, and naturally protective, but they can be aloof with strangers. They’re happiest when mentally stimulated and given tasks to complete. Health concerns include potential thyroid issues and hip dysplasia.\nIf you’re drawn to a unique large hypoallergenic dog with personality and charm, the Irish Water Spaniel is a worthy contender.\nAfghan Hound\nElegant and independent, the Afghan Hound boasts a silky long coat that surprisingly qualifies it as one of the low shedding dogs. Though its luxurious appearance might suggest high maintenance, this ancient breed sheds minimally and produces little pet dander. However, keeping that flowing silky hair free of mats requires frequent brushing and grooming.\nAfghan Hounds have a quiet dignity and are known for their aloof yet loyal personalities. They aren’t typically “eager to please,” which can make training a bit of a challenge for first-time dog owners. That said, their gentle nature and striking appearance make them a favorite among enthusiasts of more refined dog breeds. They benefit from daily walks and space to stretch their legs.\nIf you’re looking for a hypoallergenic dog with a dramatic flair and little shedding, the Afghan Hound is hard to beat.\nKomondor\nThe Komondor is unmistakable with its signature corded coat, resembling long dreadlocks. While this coat may appear heavy, it actually sheds very little—making the Komondor one of the more unusual no shed large breed dogs. Maintaining the cords, however, is a unique commitment, requiring special care and drying time after baths.\nOriginally bred to guard livestock, the Komondor has a calm, independent temperament and a natural protective instinct. They’re incredibly loyal but can be wary of strangers and other animals without early socialization. Daily exercise and training are important to balance their instincts.\nAlthough their grooming requirements are complex, Komondors are great for those looking for a one-of-a-kind large hypoallergenic dog with a strong work ethic.\nBlack Russian Terrier\nDeveloped in the mid-20th century for military purposes, the Black Russian Terrier is a powerful, confident breed with a thick double coat that sheds minimally. This breed benefits from weekly brushing to remove loose fur and prevent mats.\nThese dogs are intelligent, reserved, and deeply devoted to their families. While their guard dog roots make them protective, they’re generally calm and easygoing at home. Early training and socialization are key to bringing out their best qualities. Common health issues include hip and elbow dysplasia.\nIf you’re looking for a loyal, low-shedding giant with presence and brains, the Black Russian Terrier is a standout among large dog breeds.\nBonus Mentions\nOther terrier breeds worth noting include the Airedale Terrier and Kerry Blue Terrier, both medium-to-large dogs with wiry coats that shed very little. While not as large as others on this list, they are bigger than most small hypoallergenic dogs and still offer a robust, energetic presence.\nHairless breeds like the Mexican Hairless Dog (Xoloitzcuintli) and Peruvian Hairless Dog (Peruvian Inca Orchid) also appeal to those looking for dogs that don’t shed. These hairless and coated varieties require very little grooming, though they do need skin care and sun protection.\nHow to Choose the Best Large Dog That Doesn’t Shed\nChoosing from the many low shedding dog breeds available doesn’t mean giving up your dream of owning a large dog. Whether you’re drawn to the Giant Schnauzer’s protective instincts, the Portuguese Water Dog’s athleticism, or the Afghan Hound’s graceful stride, there’s a hypoallergenic dog that fits your home and heart.\nJust remember: less shedding doesn’t mean no upkeep. Most of these breeds need regular brushing, exercise, and socialization to thrive. But for those who can commit, no shed large breed dogs offer the best of both worlds—big love, low mess."
    },
    {
      "url": "https://www.latimes.com/companion-animals/cats/story/indoor-outdoor-cat-how-to-decide",
      "text": "The Outdoor vs. Indoor Cat Debate: How to Decide What’s Best for Your Cat\n- Share via\nDeciding whether to let your cat outside is a tough and personal choice faced by every new cat owner. You might like to picture your feline friend frolicking freely in the great outdoors, true to his curious explorer instincts. You might feel guilty as he stares out the window or tries in vain to slip out the front door with you. But the reality is that a cat’s life outside comes with its own complicated set of risks and rewards.\nWhen considering which option to choose, the difference in lifespans is pretty stark. Researchers at the University of California-Davis estimate that while an indoor cat might live a long, happy life of 10 to 15 years, the life expectancy for outdoor cats can be cut dramatically short, often to just 2 to 5 years. That’s a massive difference, and it’s largely due to a cat’s exposure to danger when they’re roaming free.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nThe Case for Staying In\nThere’s a reason organizations like the Animal Humane Society advocate for keeping cats indoors. A house cat is shielded from the nasty diseases that other cats might carry, like feline AIDS or feline distemper. They’re also less likely to have a run-in with a wild animal, like a raccoon or a snake. And, of course, they’re safe from the terrifying reality of car traffic. One study from the UK found that nearly half of all cats that die before the age of nine do so because of a road accident.\nYou can still give your indoor cat a wild, exciting life. Cat trees, puzzle toys and a cozy window seat overlooking a bird feeder can provide endless entertainment. With a good setup, your cat can thrive both physically and emotionally indoors.\nThe Risks to Consider from Wild World Outside\nLetting your cat outdoors might seem natural, but it comes with a higher risk of injury, illness and even death. Outdoor cats face threats from cars, aggressive dogs, other cats and wild animals. They’re also much more likely to contract diseases through fighting or just interacting with infected animals.\nAnd while the natural world can be dangerous for your cat, your cat can also be dangerous to the natural world. According to estimates from the Cornell Lab of Ornithology, cats kill somewhere between 1.3 to 4 billion birds and 6.3 to 22.3 billion small mammals every single year in the U.S. alone.\nAnd then there’s the heartbreak of a missing cat. Lost cats can be mistaken for strays, picked up by animal control or, or never to be found again.\nFinding a Happy Medium\nIf you do decide to let your cat explore outside, you can take precautions. A microchip and a collar with an ID tag are non-negotiable. Spayed or neutered cats are also less likely to roam far or get into fights.\nConsider installing a cat door that leads to a secure outdoor enclosure—a catio—to give your kitty access to fresh air without the risks. Supervised time outdoors is another option, especially if you live in a rural area. Some cat parents even train their cats to walk on a leash, letting them enjoy the outdoors without the dangers. And of course, keep those vaccinations up to date. Your vet can advise on the right extra protection for indoor-outdoor cats.\nA Word on Community Cats\nNot all cats have homes. Feral and stray cats live outdoors full-time and are at the highest risk for illness and injury. They also reproduce unchecked, leading to overpopulation. Trap-neuter-return (TNR) programs are a humane way to manage community cat colonies by stabilizing their populations and improving their health.\nMaking an Informed Decision\nThere’s no universal answer to whether you should let your cat outside. A young kitten in a busy city faces different challenges than an older cat in a quiet rural area. Talk to your vet about the risks and benefits. They can help you determine whether your cat is better off as a full-time indoor cat or an outdoor cat with some supervision.\nLetting your cat outside might seem like a natural part of owning a cat. But it’s a decision that requires thoughtful consideration. With the right balance of safety, enrichment and care your cat can live a full and contented life."
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice/story/service-animal-rights-laws-explained",
      "text": "Service Dog Rights: What the Law Actually Says (and What It Doesn’t)\n- Share via\nService animals are amazing, right? They’re MVPs that they help people with disabilities live life with confidence and independence. We’re not talking about a handful of dogs, either. It’s estimated by Share America that there are around 500,000 service dogs working in the U.S. Thanks to federal laws like the Americans with Disabilities Act (ADA) these incredible dogs and their handlers are protected. It means they have the right to be in all sorts of public places, from stores and restaurants to public buildings and schools.\nWhether you’re a business owner, a landlord or the owner of a service animal yourself, understanding these laws is crucial. It’s the only way to avoid confusion, prevent awkward situations and make sure everyone gets treated fairly.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nWhat Exactly Counts as a Service Animal?\nSo what’s the difference between a service dog and a pet? The ADA is pretty specific about this. A service animal is a dog that is individually trained to perform specific, disability-related tasks. We’re talking about things like guiding someone who is blind, retrieving dropped items or even interrupting an anxiety attack. The dog’s job has to be directly linked to the person’s disability, whether that’s a physical or mental impairment.\nDog breeds aren’t restricted. You could have a tiny terrier or a great dane. The key is the training. Not the breed. Even a miniature horse might also qualify under certain conditions. But just providing comfort or companionship isn’t enough. Emotional support animals or therapy animals don’t count as service animals under the ADA unless they’ve been specifically trained to perform those key tasks. It’s all about the job, not just the emotional support.\nWhere Can Service Dogs Go?\nA service dog can go pretty much anywhere the public is allowed. That includes restaurants, schools, and hotels. Businesses can’t deny access because of a “no pets” policy or because they have a breed restriction. In fact, there are only two questions they are legally allowed to ask you: Is the dog a service animal required because of a disability? What tasks is the dog trained to perform?\nThat’s it. They can’t ask for any paperwork, certification or proof. They also can’t treat the handler differently unless the service dog is misbehaving (like being aggressive or not housebroken).\nYour Service Dog and Your Rights in Housing and Work\nIn a professional setting, the ADA says employers must make a reasonable accommodation for a service animal. If it’s a psychiatric service animal or an emotional support animal, an employer can ask for medical documentation that confirms the need for the animal. But they can’t ask for any kind of official certification or registration for the animal itself.\nIn housing, the Fair Housing Act has your back. Landlords have to accept assistance animals—including emotional support animals—even if their policy says “no pets.” They can’t charge you extra fees or deposits for the service dog and the animal is allowed in all areas used by tenants.\nNavigating Schools and Transportation\nWhen it comes to education, the Individuals with Disabilities Education Act (IDEA) and the ADA ensure that service dogs can go to school with their person. Public schools and universities have to make reasonable modifications to accommodate them.\nFor transportation, federal law is clear: service animals are allowed on public transit, in airports and on ride-share services.\nFlying with a Service Dog\nUnder the Air Carrier Access Act, flying with a service animal is allowed without pet fees or advanced notice. Psychiatric service animals that are trained to perform tasks related to a mental disability also qualify. You can take your service animal’s safe equipment with you and they are allowed in all areas of the airport, from check-in to security.\nCosts and Resources\nYes owning a service dog comes with costs. Just like owning a non-service dog there is food, training, and healthcare to worry about. But the financial commitment can be steep. A professionally trained service dog can cost a person between $10,000 and $20,000 on average, according to the US Service Animals. Because of the high demand and rigorous training there can even be a wait time of one to five years for a trained dog. That said, there are organizations that offer grants or tax deductions to help. Local disability groups are also a fantastic resource for everything from legal help to finding housing.\nYou can file a complaint with the Department of Justice if you’re ever denied access or treated unfairly. Also, you can reach out to local disability advocacy groups for legal assistance.\nFrequently Asked Questions About Service Dog Laws\nDoes a Service Dog Need to be Certified?\nThis is a big one: the ADA does not require certification. Handlers can even train their own dogs. So all those online sites selling “official” certificates or ID cards? They’re not legally recognized by federal law. It’s all about the dog’s training and behavior, and its ability to perform tasks related to its handler’s needs.\nDo I need paperwork for my service dog?\nNo. The ADA doesn’t require it. All those ‘official’ credentials you see online are not legally valid.\nCan emotional support animals be service animals?\nOnly if they are trained to perform specific tasks. Providing comfort alone is not enough to be considered a service animal under the ADA.\nWhat breeds can be service dogs?\nAny breed can be a service animal as long as it has the required training.\nWhat questions can a business legally ask?\nThey can only ask if the dog is a service animal and what tasks it performs. They can’t ask for documentation or ID.\nAre there protections for service animals in training?\nNot under the ADA but some state or local laws might provide access rights during training.\nDo landlords have to allow emotional support animals?\nYes. Under the Fair Housing Act, they have to make reasonable accommodations for assistance animals. This is true even if they aren’t trained to perform tasks."
    },
    {
      "url": "https://www.latimes.com/companion-animals/advice/care/story/pet-microchipping-guide",
      "text": "Why Microchipping Might Be the Most Important Thing You Do for Your Pet\n- Share via\n- A microchip is a permanent form of pet ID that can’t fall off or wear out—and helps reunite lost pets with their families.\n- Registration is key: without updated contact info in the registry, the chip can’t help bring your pet home.\n- The procedure is quick, safe, and affordable—and complements (not replaces) collars and ID tags.\nIf your dog slips out the front door on the 4th of July or your cat goes missing during a move, there’s one tiny thing that could bring them home: a microchip. It’s about the size of a grain of rice, but it can make a world of difference. Implanted just beneath the skin, a microchip gives your pet a permanent form of ID—one that won’t fall off, get lost, or wear out.\nMicrochipping isn’t new, but it’s still one of the most effective yet underutilized tools we have for reuniting lost pets with their families. The American Animal Hospital Association recommends it, and most shelters and vets rely on it every day.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nA microchip is a tiny glass capsule with a radio frequency ID inside—no battery, no GPS, nothing fancy. It gets injected under your pet’s skin (usually between the shoulder blades) during a quick vet visit. The chip itself doesn’t store your name or phone number; it just holds a unique ID number.\nIf your pet is found and taken to a shelter or vet, they’ll scan them with a handheld reader. That brings up the microchip number, which is then used to pull your contact info from a registry database. No personal info lives in the chip itself—just that one number.\nWhy Microchipping Your Dog or Cat Is Worth It\nHere’s the thing about collars and tags: they’re great, but they come off. A microchip doesn’t. It’s there for life, and if it’s registered properly, it gives shelters and vets a fast way to get your pet back to you.\nA few more reasons to consider it:\n- It works. Microchipped dogs are more than twice as likely to be reunited with their owners.\n- It’s low-maintenance. No batteries, no upgrades, no fuss.\n- It’s cost-effective. Most vets and shelters offer the service at a reasonable price.\n- It plays well with others. Universal scanners can read most chips, even if they’re from different manufacturers.\nHow the Microchipping Procedure Works, Step by Step\nGetting your pet chipped is about as simple as getting a vaccine. It’s done with a needle—just a quick pinch, and it’s over. After the chip is implanted, your vet will scan it to make sure it’s working. Then comes the part that gets skipped more often than it should: registration.\nYou’ll need to register the chip number with your contact info through the manufacturer’s registry. Most let you do it online in just a few minutes. And if your phone number or address ever changes? Update the registry. It’s the only way the chip can actually help if your pet goes missing.\nHow to Register Your Pet’s Microchip—and Why It Matters\nRegistering your pet’s microchip is what connects their ID number to your contact information. Without registration, a chip is essentially useless. Most manufacturers make the process simple, allowing you to register online. Don’t forget to update your info anytime you move or change phone numbers.\nTrusted Microchip Registries for Pets\nThere are a few different chip makers and registries out there. Some offer extra features like travel support, lost pet alerts, or even GPS add-ons (though GPS isn’t part of the chip itself). Others stick to the basics.\nHere are a few trusted registries:\nNot sure which registry your pet’s chip is connected to? The AAHA microchip lookup tool can help.\nAre There Any Risks to Microchipping Your Pet?\nIt’s rare, but like any procedure, microchipping does come with minor risks. Some pets might have a little swelling or tenderness at the injection site. In very rare cases, a chip can migrate or cause a lump. Serious complications like infection or tumor formation are extremely uncommon.\nMost pets don’t even notice it’s there.\nWhy Microchipping Is Just One Part of a Complete Pet Safety Plan\nA microchip is one piece of a larger safety net. Your pet should still wear a collar with ID tags. You should still keep them indoors or supervised outside. And if you travel with them, especially internationally, you’ll need to make sure their chip is ISO-compliant and registered with the appropriate authority.\nBut having that chip in place gives you a backup if something goes wrong—and that backup can bring your pet home.\nThe Bottom Line\nFor something so small, a microchip can have a huge impact. It’s fast, affordable, and could be the reason your pet finds their way back to you. Just don’t forget the most important part: keeping your registration info up to date.\nFAQs\nWhat is a microchip and how does it help reunite lost pets with their owners?\nA microchip is a small implant that stores a unique ID number. If your pet is lost, shelters and vets scan the chip to retrieve your contact info from a registry.\nDoes a microchip replace a collar and ID tags?\nNo. A microchip is a permanent backup, but pets should still wear collars and ID tags for visible identification.\nHow do I register my pet’s microchip?\nRegister your pet’s chip through the manufacturer’s online registry. Keep your contact information current to ensure the chip can help.\nAre there any risks to microchipping my pet?\nMinor risks include swelling or tenderness. Serious complications are very rare. Most pets don’t notice the chip after implantation.\nHow much does microchipping cost and is it worth it?\nIt’s typically affordable and requires no ongoing maintenance. Microchipped pets are more than twice as likely to be returned home."
    },
    {
      "url": "https://www.latimes.com/companion-animals/dogs/care/story/safe-dog-chew-teeth-and-health-guide",
      "text": "Ditch the Sticks: A Safe, Healthy Chew Guide for Dog Owners\n- Share via\nIf your dog loves to chew on sticks in the yard, you’re not alone. It’s a classic dog thing, but it’s also a surprisingly risky habit. Vets warn that dogs who eat sticks are risking splinters in the mouth, intestinal blockages or worse. Plus, some types of wood are toxic or coated in chemicals. Despite their appealing woodsy smell, sticks are simply not a safe chew option.\nThe good news is that there are many healthier, safer alternatives in stores that are designed specifically for your dog’s chewing instincts. Whether you’re looking for a long-lasting chew for a tough-jawed adult or a softer option for a new puppy or a senior pet, the information below can help you find the perfect match.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nThe Chewing Instinct More Than Just a Hobby\nChewing is vital for a dog’s well-being. A good dog chew promotes dental health by helping to reduce tartar buildup and keeps their mouth clean. Chewing also satisfies behavioral needs and is a fantastic way to relieve boredom, stress and anxiety.\nFor aggressive chewers especially, finding the right chew is critical to saving your furniture and avoiding the ingestion of dangerous objects. A chew tailored to your dog’s size, chewing style and preferences can make all the difference.\nThe Health Benefits of Chewing\nThe right chew can do more then protect your belongings. It’s also a powerful tool for your dog’s overall health. A good chew can scrape plaque from your dog’s teeth and support healthy gums. It can also provide mental stimulation, which helps reduce boredom and keep your dog busy. For nervous pups the act of chewing can help them stay calm. And for puppies, softer chews are great for soothing sore gums and protecting their new teeth.\nThe Great Chew Buffet\nWith no one-size-fits-all chew, there are many great options to consider based on your needs:\nBully Sticks\nA perennial favorite among dog owners, these are made from natural ingredients and offer a satisfying texture for aggressive chewers.\nYak Cheese Chews\nSourced from traditional Himalayan recipes, yak cheese is known for being both long-lasting and easily digestible.\nDental Chews\nThese specially designed treats help remove plaque and tartar and leave your dog’s breath smelling fresh.\nRawhide\nPopular but controversial, rawhide can break into large chunks and pose a choking hazard or digestive risk. It’s often best to avoid.\nHuman-Made Edible Bones\nThese are formulated to break down safely and often come fortified with added nutrients for joint or dental health.\nOther Animal Parts\nChews made from antlers or hooves are natural, but they may be too hard for some dogs, especially those with dental issues.\nWhat Makes the Perfect Chew?\nThe best chew for your dog meets a few key criteria. It should be made from natural ingredients, with no artificial additives or fillers. It needs to be the right size for your dog. A chew that’s too small is a choking risk. It should also be suited to their chewing style. Some dogs nibble gently. Others will tear through anything put in front of them. The perfect chew is easily digestible (especially for dogs with sensitive stomachs) and durable, helping to manage energy and destructive behavior.\nHow to Choose the Right Chew\nTo choose the right chew you must understand your dog’s specific needs. A puppy needs softer chew toys, while an adult dog might prefer something more durable. If your dog has a medical issue or a condition like pica (eating non-food objects), your vet will have specific recommendations. And of course every dog has its own preferences. Some love a smoky bone smell. Others prefer something with less scent. Consult with your vet who can give you advice when introducing new chews.\nGolden Rules For Safe Chewing\nNo matter how safe a chew seems, always supervise your dog, especially when giving them a new product. Discard chews that are small enough to swallow or show signs of breaking. Remember to never let your dog chew on real sticks, bones or anything not made for dogs. Always watch for signs of distress, like vomiting, diarrhea or difficulty chewing.\nCreative Chew Alternatives & Life Stages\nFor dogs with dietary restrictions or picky tastes, there are some great alternatives. A frozen Kong stuffed with peanut butter or other dog-safe foods is a fantastic cooling chew option. You can also make your own treats like dried sweet potato slices or carrot sticks. Durable rubber or puzzle toys can also offer mental stimulation and oral benefits."
    },
    {
      "url": "https://www.latimes.com/companion-animals/dogs/care/story/dogs-summer-heat-sun-safety-tips",
      "text": "How Hot Is Too Hot? Recognizing and Responding to Heat Stress in Dogs\n- Share via\nIt’s easy to forget that while we’re enjoying the sun, our dogs are experiencing heat in a completely different and more dangerous way. They can’t tell us when they’re too hot, so it’s our job to recognize the warning signs and make sure they stay safe. Overheating can escalate from heat exhaustion to full-blown heat stroke in a flash. It’s something every dog owner needs to be on the lookout for.\nSo how hot is too hot? A simple rule of thumb: if it feels uncomfortably hot to you, it’s likely already crossed the danger zone for your dog.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nWhat To Understand About A Dog’s Cooling System\nUnlike us, dogs don’t cool down by sweating. Instead, they rely on panting and tiny sweat glands in their paws to regulate their body temperature. A healthy dog’s temperature is naturally a little higher than ours, sitting between 100.5°F and 102.5°F. But if it climbs much higher, especially during exercise, it can trigger a chain reaction of internal stress that leads to heat exhaustion. Left unchecked, this can quickly become heat stroke.\nSome dogs are at an even higher risk. Small dogs, senior pups, flat-faced breeds (like Bulldogs and Pugs), and young puppies can overheat much faster. Humidity also plays a huge role because it makes it harder for a dog’s panting to do its job.\nThe Unseen Dangers of Summer\nIt’s not just the air temperature you have to worry about. Pavement, asphalt and even sand can absorb heat and become hot enough to burn a dog’s paws in seconds. According to the Journal of the American Medical Association, when the air temperature is just 87°F, asphalt can be a scorching 143°F. That’s more than enough to cause second-degree burns.\nSo before you head out you should use the “7-second rule”: if you can’t comfortably hold the back of your hand on the pavement for seven seconds, it’s too hot for your dog’s paws. To avoid injury, stick to grassy areas and shaded trails. Or if you need to hit the pavement, schedule your walks for early in the morning or after the sun has gone down.\nPerhaps the most dangerous summer mistake of all? Leaving a dog in a car. Even with the windows cracked, temperatures inside a car can jump by 20 degrees in just 10 minutes. That turns a vehicle into a deadly trap in no time.\nHow to Be a Cool Dog Owner\nKeeping your dog safe is all about being proactive. Always have fresh, cool water on hand—in the house, in the backyard and on the go. Provide plenty of shade when you’re outside. And during the hottest part of the day, keep your pup indoors with a fan or the air conditioning on.\nYou can also use some cool tools to help. A dog cooling mat gives them a great place to rest, especially if you don’t have AC. You can get dog cooling vests or offer some frozen chew toys for a fun way to beat the heat. And remember to give your dog a little shade in the backyard. Even a short break from the sun can make a world of difference.\nThe Red Flags: Recognizing Heat Stroke\nRecognizing the symptoms of overheating is critical. Watch for early signs like excessive panting, drooling, glazed eyes, red or pale gums and rapid breathing. In a more serious case, your dog may become unsteady, vomit, collapse or even lose consciousness.\nDo not ignore these warnings. If you see any of these signs, move your dog immediately to a shaded or air-conditioned space. Offer small amounts of cool water and apply damp towels to their body. The key is cool but not ice-cold. That can cause shock. Most importantly you need to call your veterinarian or an emergency animal hospital right away.\nHeat Exhaustion vs. Heat Stroke\nHeat exhaustion and heat stroke are two stages of the same dangerous problem. Heat exhaustion is the early stage with heavy panting, fatigue and some disorientation.\nCaught early you can often treat it with rest, water and a cool environment. But if you let it go it can quickly escalate into full-blown heat stroke, which is a medical emergency that requires immediate professional help. It’s always better to err on the side of caution. When in doubt go to the vet.\nStaying Safe in the Heat\nSo, how hot is too hot for dogs? If you’re sweating and uncomfortable, your dog probably is too—and they may not have the tools to cool themselves down. Summer safety isn’t complicated, but it does require awareness and some planning. With the right routine, some smart tools and a watchful eye, you can enjoy the summer with your dog safely by your side."
    },
    {
      "url": "https://www.latimes.com/companion-animals/cats/breeds/story/friendliest-cat-breeds",
      "text": "The Friendliest Cat Breeds for Families and First-Time Owners\n- Share via\nThe feline world is filled with variety, beauty, and companionship. With over 70 recognized cat breeds, each offers a distinct mix of personality, temperament, and care needs. While some are known for their independent streaks, others are famous for their affectionate nature and deep bonds with their human family.\nWhether you’re drawn to the most affectionate cat breeds or curious about the oldest cat breeds, understanding the personalities behind the fur helps cat owners choose the best furry friend for their lifestyle. From lap cats to playful companions, there’s a feline friend out there patiently waiting to join your home.\nNEWSLETTER\nLooking to adopt or raise a pet? Get expert tips and tricks right in your mailbox.\nWhat Makes a Friendly Cat?\nThe friendliest cat breeds are typically affectionate, social, and thrive on human interaction. These cats often enjoy petting sessions, follow their human owners around the house, and even play fetch or perform tricks.\nBreeds with a gentle and sweet nature, or playful streak tend to do well with children, other animals, and visitors. If you’re looking for a loyal companion or best friend, consider breeds that are both emotionally tuned-in and adaptable to family life.\nMaine Coon – The Gentle Giant\nMaine Coon cats are often referred to as the gentle giant of the cat world, and for good reason. These big, fluffy felines have a loving disposition and are among the most popular cat breeds for families. They’re friendly, sociable, and known for their ability to get along with other pets, making them great family pets.\nTheir long, shaggy coats give them that ultimate lap cat fluffy appeal, but they also have a spirited side—many Maine Coons love to play fetch or explore like wild cats on a mission. Their balanced mix of playfulness and affection makes them a top choice for cat lovers everywhere.\nRagdoll – The Laid-Back Cuddle Buddy\nThe Ragdoll cat is famous for going limp in your arms, living up to its name in both posture and personality. These laid-back felines are one of the most affectionate cat breeds, often following their humans from room to room and curling up in your lap for hours.\nTheir striking blue eyes, gentle demeanor, and affectionate behavior make them a favorite among families with children and other cats. Known as one of the friendliest cat breeds, Ragdolls are affectionate without being demanding—perfect for those looking for a calm and loving feline friend.\nSiamese – Chatty and Charming\nSiamese cats are intelligent, sleek, and famously vocal. They love conversation and attention, forming tight bonds with their human family. Known for their elegant look and beautiful blue eyes, Siamese are among the most popular cat breeds thanks to their lively energy and playful cat nature.\nThey’re also fiercely loyal, often forming a one-on-one connection with a preferred human. While they thrive in interactive households, their talkative personalities mean they’re best for owners who appreciate a cat that acts like a tiny person in human form.\nBurmese – The Playful Companion\nBurmese cats are all about affection, fun, and connection. These smaller-sized cats are known for their curiosity and intelligence, often seeking out playtime and cuddles. They’re among the most affectionate cat breeds and are great with kids and other pets.\nThanks to their affectionate nature, Burmese are especially good for smaller homes or apartments. Their short coat is easy to maintain, and their personalities shine through in every game, cuddle, or sleepy moment. If you’re looking for a playful companion who also loves to nap on your lap, the Burmese is a wonderful choice.\nPersian – The Ultimate Lap Cat\nThe Persian cat is the picture of luxury with its long, flowing coat and regal posture. Known as the ultimate lap cat, Persians are relaxed and enjoy calm, predictable environments. Their sweet nature and gentle demeanor make them perfect for older families or anyone looking for a quiet, affectionate pet.\nThey are among the affectionate cats that don’t demand constant play but will stay by your side and soak up attention. Daily grooming is essential, but Persians return the effort with serene companionship and long, soothing cuddle sessions.\nAbyssinian – The Athletic Explorer\nThe Abyssinian cat is one of the oldest known breeds and one of the most energetic. They are athletic, intelligent, and adventurous—ideal for families who want a playful cat that thrives on engagement.\nThough not traditional lap cats, Abyssinians love to play and interact with their people, forming close bonds. They’re great in households with other animals and do well in homes where they’re free to roam and explore.\nSphynx – The Hairless Lovebug\nThe Sphynx cat may lack fur, but it more than makes up for it with affection. These warm, social cats are known for their quirky looks and extroverted personalities. They love to be close, whether it’s snuggling under blankets or perching on your shoulder.\nTheir affectionate nature and constant need for warmth make them among the friendliest cat breeds. While they don’t need brushing, they do need regular skin care and warmth. The Sphynx cat is ideal for cat owners looking for a companion that acts more like a clingy best friend than an aloof pet.\nScottish Fold – The Sweet One with Folded Ears\nThe Scottish Fold, with its signature folded ears, is known for its sweet nature and calm demeanor. These cats are affectionate without being overly active, and they adapt well to a variety of home settings.\nTheir round faces and plush bodies make them irresistibly cute, and their chill temperament means they’re great with children, other cats, and even dogs. If you’re seeking a cat friend who’s both adorable and composed, the Scottish Fold fits the bill.\nBirman – The Friendly Fluffball\nBirman cats are often overlooked but deserve a place among the friendliest cat breeds. With their silky coats, gentle blue eyes, and affectionate cat personalities, Birmans are patient and easy to love.\nThey’re great for families and known for their friendly, calm demeanor. Like the Ragdoll, they enjoy being close but aren’t needy. If you’re looking for a mellow, friendly feline with a luxurious look, Birmans offer beauty and heart in equal measure.\nChoosing the Best Cat for You\nWhen choosing among the friendliest cat breeds, consider your lifestyle, living space, and how much time you can devote to your pet. Some breeds like the Maine Coon need room to roam, while Persians thrive in quiet, cozy homes. Think about energy level, grooming needs, and how the cat’s other personality traits will fit with other pets or family members.\nConsulting with a behavior specialist, breeder, or even your local shelter can help you identify a breed that fits your life and welcomes you into theirs.\nBuilding a Loving Home with Your Feline Friend\nWhether you choose a gentle giant like the Maine Coon, a cuddly lap cat like the Persian, or a quirky companion like the Sphynx, your bond with your cat will grow with time and care. A happy cat means a peaceful, connected home.\nProvide love, structure, and enrichment, and you’ll find that your feline friend becomes more than just a pet—they’ll be a lifelong best friend."
    }
  ],
  "argos_summary": "CatCon, founded by Susan Michals, has evolved over ten years into the largest convention for cat enthusiasts in the U.S., blending art, education, and community support. The event emphasizes the changing perceptions of cat ownership, showcasing a diverse range of attendees and activities, including art shows and celebrity appearances. Michals aims to support small businesses and animal welfare, while also addressing stereotypes associated with cat lovers, promoting a more empowered image of cat ownership.",
  "argos_id": "CS4UNAEN4"
}