{
  "url": "https://www.bbc.com/news/articles/c04rql923kdo?at_medium=RSS&at_campaign=rss",
  "authorsByline": "Ruth Comerford",
  "articleId": "3679e478f62a4994bd48043fc71efff4",
  "source": {
    "domain": "bbc.com",
    "paywall": false,
    "location": {
      "country": "gb",
      "state": "",
      "county": "",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://ichef.bbci.co.uk/news/1024/branded_news/0eb4/live/bbc325b0-7746-11f0-abe9-9dbc4fadc5ac.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:12:06.652000+00:00",
  "addDate": "2025-08-12T08:22:25.442240+00:00",
  "refreshDate": "2025-08-12T08:22:25.442243+00:00",
  "score": 1.0,
  "title": "Charges dropped against teen pilot detained in Antarctica",
  "description": "Ethan Guo must leave the island and pay $30,000 dollars to charity for illegally landing on Chilean territory, a judge says.",
  "content": "King George island is the largest of the South Shetland Islands, located off the coast of Antarctica\n\nA judge has ordered him to leave the area, pay a $30,000 (£22,332) donation to a children's cancer foundation and is banned from re-entering Chilean territory for three years.\n\nThey accused him of providing false flight plan information to officials who detained him and opened an investigation.\n\nEthan Guo, 19, is alleged to have illegally landed his plane in Chilean territory after embarking on a solo trip to all seven continents to raise money for cancer research, according to local authorities.\n\nCharges against an American influencer and teen pilot who has been stranded on a remote island in the Antarctic since June have been dropped.\n\nMr Guo made headlines last year when he began an attempt to become the youngest person to fly solo to all seven continents and collect donations for research into childhood cancer.\n\nHaving already visited six of seven continents, in June he flew his small Cessna 182Q aircraft from the city of Punta Arenas, near the southernmost point of Chile, to King George island off the Atlantic coast, which is claimed by Chile and named after the UK's King George III.\n\nHe was taken into custody after landing on the island, which is home to a number of international research stations and their staff.\n\nAuthorities said he submitted a plan to fly over Punta Arenas, but not beyond that, according to CBS News, the BBC's US partner.\n\nHe was charged on 29 June with allegedly handing false information to ground control and landing without authorisation, but these were dropped by a judge on Monday.\n\n\"I remain in Antarctica awaiting approval for my departure flight,\" Mr Guo told the Associated Press (AP) news agency following the judge's ruling on Monday. \"I sincerely hope they give it to me soon so that I and my plane can continue with my original mission.\"\n\nMr Guo has been staying at a military base on the island for the last six weeks, AP reported. He was told he could travel to other parts of Chile but because of frigid temperatures was unable to leave the island, it added.\n\nMr Guo is hoping to become the first pilot to complete solo flights across all seven continents in the Cessna aircraft, and has already spent 140 days in the air on his travels.\n\nHe decided to raise money for cancer research after his cousin was diagnosed with cancer.\n\nHe is aiming to raise $1m for cancer research at St Jude Children's Research Hospital in Memphis, Tennessee.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "cancer research",
      "weight": 0.09419725
    },
    {
      "name": "King George island",
      "weight": 0.09349504
    },
    {
      "name": "false flight plan information",
      "weight": 0.08131701
    },
    {
      "name": "Mr Guo",
      "weight": 0.079389
    },
    {
      "name": "international research stations",
      "weight": 0.074953675
    },
    {
      "name": "childhood cancer",
      "weight": 0.07398242
    },
    {
      "name": "research",
      "weight": 0.071120806
    },
    {
      "name": "cancer",
      "weight": 0.07017188
    },
    {
      "name": "teen pilot",
      "weight": 0.070027396
    },
    {
      "name": "King George",
      "weight": 0.06911932
    }
  ],
  "topics": [
    {
      "name": "Antarctica"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.97705078125
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.8017578125
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.70849609375
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.4580078125
    },
    {
      "name": "/News/Local News",
      "score": 0.301025390625
    }
  ],
  "sentiment": {
    "positive": 0.06973961,
    "negative": 0.6104534,
    "neutral": 0.31980696
  },
  "summary": "Ethan Guo, a 19-year-old American who attempted to become the youngest person to fly solo to all seven continents and raise funds for childhood cancer research, has been detained on King George island off the coast of Chile. A judge has ordered him to leave the area, pay a $30,000 donation to a children's cancer foundation and is barred from re-entering Chilean territory for three years. Guo was accused of providing false flight plan information to officials who detained him and opened an investigation. He has been staying at a military base on the island for six weeks and is awaiting approval for his departure flight.",
  "shortSummary": "Ethan Guo, a 19-year-old American pilot stranded on Antarctica's King George island for nearly six weeks, was ordered to pay $30,000 for a cancer research donation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "979b28030f274dd9bbc67491c1f5f2f8",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Ethan Guo, a 19-year-old American influencer and pilot, was detained after illegally landing his plane on King George Island while attempting to become the youngest person to fly solo to all seven continents and raise funds for cancer research. Although initially charged with providing false flight plan information, the charges were dropped by a judge, who ordered him to leave the area and donate $30,000 to a children's cancer foundation. Guo has been stranded on the island for six weeks and hopes to continue his mission to raise $1 million for St Jude Children's Research Hospital.",
  "argos_id": "CX8011429"
}