{
  "url": "https://www.nytimes.com/interactive/2025/08/12/nyregion/zohran-mamdani-aides-family-staff.html",
  "authorsByline": "Nicholas Fandos, Emma G. Fitzsimmons, Lily Boyce",
  "articleId": "ad566135217b4369a0803fb6e72fba96",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/08/11/multimedia/2025-07-29-mamdani-circles-index/2025-07-29-mamdani-circles-index-facebookJumbo-v4.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:00:00.916000+00:00",
  "addDate": "2025-08-12T07:11:03.855077+00:00",
  "refreshDate": "2025-08-12T07:11:03.855081+00:00",
  "score": 1.0,
  "title": "Meet Zohran Mamdani's Inner Circle",
  "description": "A guide to the close advisers and loyal aides who could shape his mayoralty.",
  "content": "For the very biggest decisions in his run for mayor of New York City, Zohran Mamdani typically relies on just two trusted advisers. One is 28. The other is 34.\n\nHis plans for free buses and policing were written with the help of other policy aides who, like him, cut their teeth in the Democratic Socialists of America.\n\nAnd until recently, few of the people closest to him had ever worked in city government.\n\nIf a politician’s inner circle reflects the kind of government he or she would create if elected, then the group around Mr. Mamdani, a 33-year-old assemblyman and the Democratic nominee, foreshadows a very different City Hall from previous mayors.\n\nLike Mr. Mamdani, his aides are notably younger and farther left than advisers in rival campaigns. Few hail from the Democratic establishment; many have spent years fighting it. Several advisers bring long track records working on affordability and the concerns of growing immigrant groups. And as he seeks to make history as the city's first Muslim mayor, Mr. Mamdani has surrounded himself with both Muslim advisers and Jewish aides.\n\nBut to an unusual degree, Mr. Mamdani’s orbit is still in flux. While youth may have been a feature of his success to date, the Democrat has been blunt that building an administration to run a city of eight million will require new expertise and a larger coalition. He has already begun seeking the counsel of more seasoned city hands, and has asked Elle Bisgaard-Church, his top adviser, to oversee a hiring spree.\n\nHere is a guide to the insiders who could shape his mayoralty.\n• Ms. Bisgaard-Church, 34, served as campaign manager during the primary. Since then, she has been been responsible for laying the groundwork for a mayoral administration. A California native and a D.S.A. member, Ms. Bisgaard-Church was new to politics when she took a job as Mr. Mamdani's chief of staff straight out of graduate school. Now, she is widely seen as his right hand and expected to play a major role in City Hall if he wins.\n• An ad maker and political strategist, Mr. Katz, 28, has said he was skeptical of Mr. Mamdani's long-shot campaign when they first met last summer. But he quickly became indispensable to the assemblyman's political rise. Recently, Mr. Katz has also helped serve as an emissary to Jewish leaders who remain uneasy with Mr. Mamdani's pro-Palestinian views. His clients also include Dan Osborn, a union steamfitter, who ran a surprisingly close race for Senate in right-leaning Nebraska.\n• Mr. Mamdani has said he owes his parents everything, “not simply the person that I am, but the thoughts that I have.” His mother, Ms. Nair, is an Oscar-nominated filmmaker whose movies include “Monsoon Wedding,” “Salaam Bombay!” and “Mississippi Masala.” She hired her son out of college as a music supervisor. Mr. Mamdani has an endowed professorship at Columbia, where he is a leading scholar of post-colonialism.\n• Ms. Duwaji, a 27-year-old animator and illustrator of Syrian descent, married Mr. Mamdani earlier this year. Ms. Duwaji has avoided public attention, although she contributed to some of her husband's campaign's videos. The couple met on the dating app Hinge and traveled to Uganda in July to belatedly celebrate their marriage.\n• Ms. Rahim, a well-connected communications specialist, has helped build Mr. Mamdani's cachet with the city's cool set. A veteran of Vogue, Uber and Hillary Clinton's presidential campaign, she has connected Mr. Mamdani with celebrities and honed his media profile. Ms. Rahim is also an important pro-Palestinian voice in campaign discussions about Gaza.\n• Mr. Epstein, a former chief of staff in the State Assembly, served as the campaign's main spokesman during the primary and oversaw the production of a series of viral videos that helped Mr. Mamdani elevate his profile. Mr. Epstein, 38, is now the campaign's creative director, working full time with a team of video producers. They include Donald Borenstein, Debbie Saslaw, Olivia Becker and Anthony DiMieri, who captured Mr. Mamdani's policy proposals in videos that received millions of views.\n• Mr. Gerson, 28, served as Mr. Mamdani's political director during the primary. A former aide to Representative Jerrold Nadler of New York and Gov. Kathy Hochul, he has shifted to be the campaign's chief speechwriter, giving voice to Mr. Mamdani's distinctive policy platform.\n• Ms. Van Auken built Mr. Mamdani's field operation. The campaign amassed a staggering 50,000 volunteers, who helped drive a sharp increase in turnout among younger voters in the primary. She is a veteran organizer affiliated with D.S.A. and once worked for Blue Man Group, a musical performance art company.\n• Mr. Najmi is a close friend of the candidate and was the campaign's lawyer during the primary. With Mr. Mamdani, he was a leader of the Muslim Democratic Club of New York. Mr. Najmi is a criminal defense lawyer whose unsuccessful 2015 campaign for City Council was the first time Mr. Mamdani got involved in city politics.\n• A state assemblywoman from the Bronx, Ms. Septimo did not endorse in the primary, but she is another key behind-the-scenes gut-check for Mr. Mamdani on political and policy questions. The two are around the same age and both threw themselves into a 2021 campaign to help taxi drivers secure a debt relief program.\n• Ms. Weaver, a tenant organizer and D.S.A. member, advised Mr. Mamdani on housing policy, including his push to freeze rents on stabilized apartments. She is the director of the New York State Tenant Bloc, a nonprofit group that has pushed for tenant protections in Albany.\n• Ms. Ali is longtime ally who worked with Mr. Mamdani as a leader of the Muslim Democratic Club of New York, a progressive group. She works for the City Council and previously was at the Council on American-Islamic Relations.\n• Mr. Singh is the political director of a group called DRUM Beats, which works with the South Asian and Indo-Caribbean communities and was one of the first groups to endorse Mr. Mamdani for mayor. He worked with Mr. Mamdani at Chhaya, a community development group that helps families facing foreclosure, and he worked with Mr. Mamdani on securing debt relief for taxi drivers.\n• Mr. Awawdeh, the president and chief executive of the New York Immigration Coalition, serves as a regular late-night sounding board for Mr. Mamdani. He helped shape the campaign's policy platform and build its novel coalition of young voters, South Asians and other immigrant groups.\n• Mr. Gaspard, a former Obama aide and City Hall veteran, has served as an informal adviser and emissary to New York power players. He helped broker a cross-endorsement with Brad Lander, the city comptroller, and has accompanied the candidate to key meetings with business titans, Black New Yorkers and party leaders, like Ms. Hochul.\n• Ms. Handa only joined the campaign in late July, after managing State Senator Zellnor Myrie's losing mayoral bid. She has a track record of managing progressive campaigns, and worked with Mr. Mamdani during his time in the Assembly. Ms. Atta-Mensah joined the campaign around the same time with a mandate to help Mr. Mamdani expand his support among Black New Yorkers. She came from the progressive advocacy group Community Change. Mr. Lerner, a seasoned Washington operative who once worked for Mr. Gaspard, took over the campaign's communications team after the primary.\n• Mr. Fuleihan, a de Blasio administration alumnus, serves as a behind-the-scenes adviser to Mr. Mamdani and Ms. Bisgaard-Church as they prepare for a potential transition to office. He is viewed as an experienced City Hall veteran who understands the ins and outs of governing. He was Mr. de Blasio's first deputy mayor and served in other high-level positions in city and state government.\n• In many ways, Ms. Ocasio-Cortez's upset primary victory in 2018 was a template for Mr. Mamdani. Both are members of D.S.A. and represent overlapping districts. The congresswoman's well-timed endorsement helped push the left to consolidate around Mr. Mamdani. She has been a personal sounding board since, coaching him through the pressures of achieving political stardom at a young age and introducing him to fellow Democrats in Washington.\n• Mr. Lander, the city comptroller, made a critical cross-endorsement with Mr. Mamdani that helped boost him in the homestretch of the primary. The city's highest-ranking Jewish official, he has defended Mr. Mamdani from accusations of antisemitism and served as an attack dog criticizing Mr. Cuomo. Mr. Lander is widely expected to be considered for a high-level position in a Mamdani administration.\n• Ms. Velázquez, the first Puerto Rican woman in Congress, played a key role in validating Mr. Mamdani as a serious candidate in the primary and expanding his outreach among Latinos. Ms. James, the state attorney general, appeared with Mr. Mamdani at a rally during the final days of the primary, comparing him to Barack Obama, and has emerged as one of his most important emissaries to skeptical Democrats and Black voters. She is also advising him to keep Jessica Tisch as police commissioner.\n• Many of Mr. Mamdani's biggest plans will only come to fruition with support from the State Legislature. A circle of state lawmakers could be key to securing it. Mr. Brisport, a state senator from Brooklyn and fellow democratic socialist, is perhaps Mr. Mamdani's closest friend in Albany; the two were roommates there for years. But Mr. Gianaris, the deputy Senate majority leader, may be his most powerful ally; the two represent overlapping districts and have collaborated on legislation including a pilot for free buses. Mr. Lasher, an assemblyman from Manhattan, has become a liaison to Jewish New Yorkers and brings connections from his days as Ms. Hochul's policy adviser.\n• Ms. Archila, a co-director of the left-leaning Working Families Party in New York, helped run a campaign to defeat Mr. Cuomo in the primary. The group will be central to both Mr. Mamdani's general election and governing coalitions, should he be elected. Mr. Mamdani's success has also elevated the D.S.A. to a level of influence it has not previously seen. Its city leaders, Mr. Gordillo and Ms. Mausser, are key political advisers and can be expected to fight for many of Mr. Mamdani's leftist policy proposals as he broadens his coalition.\n• Mr. Garrido, the executive director of District Council 37, has been an emissary for Mr. Mamdani among the city's powerful labor leaders and will be a key negotiating partner if Mr. Mamdani becomes mayor. His group is the city’s largest municipal union. The union ranked Mr. Mamdani second on its slate in the primary, helping give his campaign legitimacy in a crowded field.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/2025/07/03/nyregion/new-york-mamdani-free-bus.html",
    "https://www.nytimes.com/news-event/nyc-mayor-race",
    "https://www.nytimes.com/2025/07/08/us/politics/dan-osborn-to-seek-pete-rickettss-nebraska-senate-seat-stressing-class-issues.html",
    "https://www.nytimes.com/2025/07/09/nyregion/mamdani-jessica-tisch-nypd.html",
    "https://www.nytimes.com/2025/06/12/nyregion/zohran-mamdani-muslim-mayor.html",
    "https://www.nytimes.com/2025/06/25/nyregion/rama-duwaji-zohran-mamdani-wife.html",
    "https://www.nytimes.com/2025/06/26/nyregion/zohran-mamdani-parents-mira-nair.html",
    "https://www.nytimes.com/2025/06/05/nyregion/aoc-endorse-mamdani-mayor.html",
    "https://www.nytimes.com/2025/04/01/nyregion/zohran-mamdani-crime-plan.html",
    "https://www.nytimes.com/2025/04/23/nyregion/adrienne-adams-endorsements-nyc-mayor.html",
    "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-voters-strategy.html",
    "https://www.nytimes.com/2025/07/09/nyregion/mamdani-communications-jeffrey-lerner.html",
    "https://www.nytimes.com/2017/11/30/nyregion/de-blasio-shakeup-feud-cuomo.html",
    "https://www.ramaduwaji.com/",
    "https://www.nytimes.com/2025/05/17/style/zohran-mamdani-campaign-downtown-clout.html"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Mamdani",
      "weight": 0.13293865
    },
    {
      "name": "Mr. Lander",
      "weight": 0.1006978
    },
    {
      "name": "Mr. Gaspard",
      "weight": 0.100000285
    },
    {
      "name": "Mr. Najmi",
      "weight": 0.09974179
    },
    {
      "name": "Mr. Katz",
      "weight": 0.099729784
    },
    {
      "name": "Mr. Epstein",
      "weight": 0.09968794
    },
    {
      "name": "Mr. Cuomo",
      "weight": 0.09957538
    },
    {
      "name": "Mr. Gordillo",
      "weight": 0.09933508
    },
    {
      "name": "Mr. Gianaris",
      "weight": 0.09912822
    },
    {
      "name": "Mr. Brisport",
      "weight": 0.09911574
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.97509765625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.97509765625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.91650390625
    }
  ],
  "sentiment": {
    "positive": 0.18896574,
    "negative": 0.3367856,
    "neutral": 0.47424865
  },
  "summary": "Zohran Mamdani, the Democratic nominee for New York City, is surrounded by a diverse inner circle of advisers. His aides, including 28-year-old assemblyman and 34-year old policy aides, are younger and more left-leaning than advisers in rival campaigns. Few of these advisers have worked in city government and some have long track records working on affordability and immigrant groups. Mamdana, who is seeking to become the city's first Muslim mayor, has surrounded himself with both Muslim advisers and Jewish aides. He has begun seeking the advice of more seasoned city hands and has asked Elle Bisgaard-Church, his top adviser, to oversee a hiring spree.",
  "shortSummary": "Zohran Mamdani's inner circle, led by 28-year-olds, represents a diverse mix of diverse voices, diverse interests, and a potential future for New York City.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "150a13d3065f4374a711d7081b90f379",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/news-event/nyc-mayor-race",
      "text": "As His Rivals Attack, Mamdani Focuses on a Different Enemy: Trump\nZohran Mamdani began a Five Boroughs Against Trump tour to draw attention to the ways he believes the president’s agenda is hurting New York City.\nBy\nZohran Mamdani began a Five Boroughs Against Trump tour to draw attention to the ways he believes the president’s agenda is hurting New York City.\nBy\nZohran Mamdani’s win in the Democratic primary has challenged traditional assumptions about New York City’s Black electorate and its influence in city politics.\nBy Maya KingJeffery C. Mays and\nThe former governor’s post, written on X on Friday, reflected how he has adopted a stance of more aggressive, personal jabs.\nBy\nZohran Mamdani has not released a detailed plan for public education, but his biggest proposal centers on weakening mayoral control and giving power to teachers and parents.\nBy\nCuomo and Trump, Two ‘Queens Boys,’ Go Way Back\nPresident Trump has urged Andrew Cuomo to stay in the New York City mayor’s race. Here are seven moments when their paths crossed over the years.\nBy\nMapping How Mamdani’s Ranked-Choice Strategy Beat Cuomo\nNew data provides the clearest picture yet of how Zohran Mamdani pulled off his primary election upset.\nBy Elena ShaoSaurabh DatarKeith Collins and\nNew York City Mayoral Primary Election Results\nGet live results and maps from the 2025 New York City primary election.\nThe Most Detailed Map of the N.Y.C. Mayoral Primary\nSee neighborhood-level election results from the first round of the mayoral race.\nBy Martín González GómezSaurabh DatarMatthew BlochAndrew Fischer and\nWho’s Running for Mayor of New York City?\nThe general election in November is expected to be more contentious than usual, with five candidates running for mayor.\nBy\nAdvertisement\nA guide to the close advisers and loyal aides who could shape his mayoralty.\nBy Nicholas Fandos, Emma G. Fitzsimmons and Lily Boyce\nMayor Adams cast the upswing as evidence of efforts to improve instruction, while rivals in the mayoral race argued that teachers need better training.\nBy Troy Closson\nAndrew M. Cuomo’s decisive loss to Zohran Mamdani in the New York City mayoral primary has led to a campaign rebranding that includes a fresh social media persona.\nBy Dana Rubinstein\nFormer Gov. Andrew M. Cuomo’s remarks about President Trump came just before The Times’s disclosure that he had spoken to Mr. Trump about the race.\nBy Nicholas Fandos, Emma G. Fitzsimmons and Lauren Hirsch\nThe Delacorte, renovated for $85 million, welcomes back audiences for Shakespeare in the Park. It echoes the park’s ethos, our architecture critic says.\nBy James Barron\nFormer Gov. Andrew M. Cuomo acknowledged that he had not run an effective race in the mayoral primary and asked for executives’ help to defeat Zohran Mamdani.\nBy Lauren Hirsch and Emma G. Fitzsimmons\nMayor Eric Adams of New York was dealt another setback in his long-shot campaign for re-election when he was denied millions of dollars in public matching funds.\nBy Emma G. Fitzsimmons\nThe possibility that the president will seek to intercede could inject an element of unpredictability into an already fractious contest.\nBy Nicholas Fandos, Jeremy W. Peters, Maggie Haberman and Katherine Rosman\nNew Yorkers of various faiths heaped praise on the incumbent mayor, whose path to re-election appears steep, and compared him to biblical figures.\nBy Dana Rubinstein\nThe primary results show that voters and campaigns are becoming more sophisticated in how they use ranked-choice voting.\nBy Meghan Morris, Eden Weingart and Emma G. Fitzsimmons\nAdvertisement\nAdvertisement"
    }
  ],
  "argos_summary": "Zohran Mamdani, the 33-year-old Democratic nominee for mayor of New York City, is surrounded by a notably young and progressive team of advisers, many of whom have backgrounds in the Democratic Socialists of America. His inner circle includes individuals with diverse expertise in policy areas such as housing, immigrant rights, and communications, reflecting a shift from traditional city governance. As he prepares for a potential mayoralty, Mamdani is seeking to expand his coalition by incorporating more experienced city officials to effectively manage the city's complexities.",
  "argos_id": "D0FWIO339"
}