{
  "url": "https://www.foxnews.com/sports/jon-gruden-says-hes-looking-forward-having-truth-come-out-damaging-emails-lawsuit-proceeds",
  "authorsByline": "Jackson Thompson",
  "articleId": "0ea16f0d13a74c18880938f5d0f4d398",
  "source": {
    "domain": "foxnews.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://static.foxnews.com/foxnews.com/content/uploads/2023/11/Jon-Gruden.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T20:33:24-04:00",
  "addDate": "2025-08-13T00:46:48.503366+00:00",
  "refreshDate": "2025-08-13T00:46:48.503368+00:00",
  "score": 1.0,
  "title": "Jon Gruden says he's 'looking forward to having the truth come out' as damaging emails lawsuit proceeds",
  "description": "Jon Gruden said he wants the truth to come out about leaked emails after a Nevada Supreme Court ruling allowing his NFL lawsuit to proceed in court.",
  "content": "Former NFL coach Jon Gruden spoke about his lawsuit against the league after a Nevada Supreme Court determined that his case could proceed in court instead of arbitration on Monday.\n\n\"I'm looking forward to having the truth come out and I want to make sure what happened to me doesn't happen to anyone else,\" he said in a statement to ESPN.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nGruden sued the NFL in 2021 after he parted ways with the when leaked emails revealed \"racist, sexist and homophobic\" language. He filed a lawsuit against the league and commissioner Roger Goodell, alleging that a \"malicious and orchestrated campaign\" was used to destroy his career by leaking the emails.\n\nGruden told ESPN that the release of the emails affected the Raiders' season.\n\n\"The league's actions disrupted the whole season,\" Gruden said. \"We were leading the division at the time, and they completely blindsided me and the team.\n\n\"What happened wasn't right and I'm glad the court didn't let the NFL cover it up.\"\n\nThe Nevada Supreme Court ruled in a 5-2 decision that \"the arbitration clause in the NFL Constitution is unconscionable and does not apply to Gruden as a former employee.\"\n\nGruden’s lawyers applauded the ruling in a statement to .\n\n\"We’re very pleased with the Nevada Supreme Court’s decision, not just for Coach Gruden but for all employees facing an employer’s unfair arbitration process,\" Adam Hosmer-Henner of McDonald Carano LLP told the outlet. \"This victory further vindicates Coach Gruden’s reputation, and it clears the way to swiftly bringing him full justice and holding the NFL accountable.\"\n\nGruden expressed hope for in July when visiting the Lions.\n\n\"Hopefully I’m not done,\" Gruden told reporters, via the . \"I’m about to make a comeback. I’m working hard to maybe get one more shot, but hopefully some of these guys that fell off my branch, if you say it that way, maybe they can hire me cause I’m looking for a job.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I don’t care if I coach at Jones Junior High,\" he added. \"I’m going to coach again. I’m still coaching. I’m just not on a team officially, but I do have some private assignments I work on, and I wear some gear when I’m watching the games that nobody knows about who I’m pulling for.\"\n\nThe Associated Press contributed to this report.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/sports",
    "https://www.espn.com/nfl/story/_/id/45960156/jon-gruden-eager-discover-truth-nfl-emails-lawsuit",
    "https://www.foxnews.com/video/6367192913112",
    "https://www.freep.com/story/sports/nfl/lions/2025/07/28/jon-gruden-lions-jared-goff-joe-montana-nfl/85406951007/",
    "https://www.foxnews.com/sports/jon-gruden-wins-key-ruling-nevada-case-against-nfl",
    "https://www.foxnews.com/sports/chiefs-legend-derrick-johnson-warns-the-devil-weakening-american-children-parents-must-fight-back",
    "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
    "https://www.foxnews.com/sports/jon-gruden-expresses-hope-nfl-return-he-visits-lions-training-camp",
    "https://www.foxnews.com/category/sports/nfl/las-vegas-raiders",
    "https://twitter.com/FoxNewsSports_",
    "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jon-grudens-lawyers-ruling-paves-way-for-holding-the-nfl-accountable",
    "https://www.foxnews.com/newsletters"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Coach Gruden",
      "weight": 0.10389086
    },
    {
      "name": "Former NFL coach Jon Gruden",
      "weight": 0.10319867
    },
    {
      "name": "Jon Gruden",
      "weight": 0.10189296
    },
    {
      "name": "Gruden",
      "weight": 0.09909109
    },
    {
      "name": "damaging emails lawsuit",
      "weight": 0.07919555
    },
    {
      "name": "leaked emails",
      "weight": 0.076000676
    },
    {
      "name": "NFL",
      "weight": 0.06916545
    },
    {
      "name": "Jones Junior High",
      "weight": 0.06818811
    },
    {
      "name": "ways",
      "weight": 0.061661124
    },
    {
      "name": "arbitration",
      "weight": 0.060069237
    }
  ],
  "topics": [
    {
      "name": "Lawsuits"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sports/Team Sports/American Football",
      "score": 0.97265625
    },
    {
      "name": "/News/Sports News",
      "score": 0.96142578125
    },
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.90234375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.73486328125
    },
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.58935546875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.5146484375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.413818359375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.39208984375
    }
  ],
  "sentiment": {
    "positive": 0.059329238,
    "negative": 0.76080096,
    "neutral": 0.17986977
  },
  "summary": "Former NFL coach Jon Gruden's lawsuit against the league is progressing after the Nevada Supreme Court ruled that it could proceed in court instead of arbitration. Gruden is suing the NFL in 2021 after he parted ways with the team following the release of racist, sexist and homophobic emails. He alleges that a \"malicious and orchestrated campaign\" was used to destroy his career. The court's decision to dismiss the arbitration clause in the NFL Constitution does not apply to Gruden as a former employee.",
  "shortSummary": "Former NFL coach Jon Gruden's lawsuit against the league over leaked emails can proceed in court, allowing a broader investigation.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "e8be3be0b230425e931fad0b36f15ace",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.espn.com/nfl/story/_/id/45960156/jon-gruden-eager-discover-truth-nfl-emails-lawsuit",
      "text": "Jon Gruden said Tuesday that he is eager to discover the truth in a Nevada courtroom about whether commissioner Roger Goodell and the NFL leaked emails to the media before Gruden was forced to resign as Raiders head coach in 2021.\n\"I'm looking forward to having the truth come out and I want to make sure what happened to me doesn't happen to anyone else,\" he said in a statement provided to ESPN.\nGruden said he blames the NFL for leaking the emails, which led the league to pressure the Raiders to force him out when the team was 3-1.\n\"The league's actions disrupted the whole season,\" Gruden said. \"We were leading the division at the time, and they completely blindsided me and the team.\"\nHe added, \"What happened wasn't right and I'm glad the court didn't let the NFL cover it up.\"\nGruden's comments came a day after the Nevada Supreme Court sided with him in his lawsuit alleging the NFL leaked damaging emails to the media before he was forced to resign in October 2021.\nIn a 5-2 ruling, the justices did not determine whether the league had leaked Gruden's racist, sexist and anti-gay emails to The Wall Street Journal and The New York Times at the time. But they found the league's decision to force Gruden's complaint into closed-door arbitration proceedings overseen by Goodell -- the target of Gruden's civil lawsuit -- was \"unconscionable.\"\nAn NFL spokesperson said Tuesday that the league would petition the Nevada Supreme Court for a rehearing. If that fails, the most likely next venue will be an appeal to the U.S. Supreme Court.\nNeither Gruden, nor his lawyer, Adam Hosmer-Henner, would say whether they were inclined to settle the case with the NFL.\nGruden declined to address his coaching future Tuesday. He said last week that he was eager to return to coaching and added: \"I'd die to coach in the SEC.\"\nHosmer-Henner said he was gratified that the Nevada Supreme Court blocked Goodell from overseeing an arbitration proceeding when he is a defendant in a lawsuit.\n\"The NFL's legal position is absurd and will continue to be rejected by every court,\" Hosmer-Henner told ESPN. \"Obviously, the NFL should not be allowed to be the judge of claims against the NFL or force people to comply with contracts that the NFL can unilaterally change any time it wants without notice.\"\nThe five justices of the Nevada Supreme Court ruled Monday that as a former employee, Gruden should not have been bound by an NFL constitution provision mandating arbitration for such complaints. Gruden's leaked emails were sent in 2011 while he was working for ESPN as a \"Monday Night Football\" analyst.\n\"By its own unambiguous language, the NFL Constitution no longer applies to Gruden,\" the five justices wrote. \"If the NFL Constitution were to bind former employees, the Commissioner could essentially pick and choose which disputes to arbitrate.\"\nOn Monday, Hosmer-Henner lauded the Nevada Supreme Court decision, saying it was a victory not just for Gruden but for all employees facing \"an employer's unfair arbitration process.\"\n\"This victory further vindicates Coach Gruden's reputation, and it clears the way to swiftly bringing him full justice and holding the NFL accountable,\" Hosmer-Henner said.\nGruden's lawsuit alleges that Goodell and the league pressured Raiders owner Mark Davis to fire the coach by leaking emails containing offensive comments that Gruden sent about the commissioner and others in the NFL. Gruden resigned from the Raiders in October 2021.\nGruden won at the district court level. The NFL appealed to Nevada's high court after a state judge in Las Vegas in May 2022 rejected league bids to dismiss Gruden's claim outright or to order out-of-court settlement talks that could be overseen by Goodell.\nA year ago, a three-judge panel of the Nevada Supreme Court decided the league could move Gruden's civil case into arbitration that might be overseen by Goodell. Two justices said Gruden knew when he signed a 10-year contract with the Raiders in 2018 that the NFL used arbitration to resolve disputes. The dissenting justice wrote that it would be \"outrageous\" for Goodell to arbitrate a dispute in which he is named as a defendant.\nGruden's lawyers were granted an en banc hearing of all seven Nevada Supreme Court justices, who heard oral arguments last year. All four justices who heard the case for the first time sided with Gruden against the NFL."
    },
    {
      "url": "https://www.foxnews.com/sports/chiefs-legend-derrick-johnson-warns-the-devil-weakening-american-children-parents-must-fight-back",
      "text": "Seven years after playing his final NFL game, former Kansas City Chiefs star Derrick Johnson is turning his attention to educating the youth of America.\nJohnson, who published his first children's book Thursday, felt compelled to join the effort to encourage children to stand up for themselves against bullies after witnessing a negative influence on American youth in recent years.\nHe blames \"the devil\" for this influence.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"The enemy really loves to get our kids in a corner to say, 'Hey, don’t tell nobody about nothing, just internalize it,'\" Johnson told Fox News Digital. \"The enemy is the devil. I'm a big believer in Jesus Christ, and the enemy is always at work, especially for kids that have potential.\n\"And if kids don't have mentors around them, the enemy can manipulate them at times and make things seem more than what it is and make it seem like they don't have a way out. And that's when you get into kids really isolating themselves.\"\nJohnson encouraged parents to instill the teachings of Jesus Christ in their children to help counter these \"harmful\" elements.\n\"If you're a child of God, nobody can dim that light. So, you were bought at a high price, by the blood of Jesus Christ, so that allows you to be here,\" Johnson said of the effect of Christianity on parenting. \"Being able to have that identity in Christ is everything. It allows them to stay grounded, not that life is going to be perfect if you got church … but at least you have the proper tools to make things happen.\"\nFALCONS QUARTERBACK KIRK COUSINS REVEALS VERY RELATABLE HAIRCUT EXPERIENCE WITH ONE EXCEPTION\nJohnson cited modern digital devices as a channel for how this negative influence has been imposed on children and prevented them from speaking up and pushing back against \"harmful\" forces in their lives.\n\"The digital devices are making us less personable,\" Johnson said. \"Kids get on those iPhones, and you never know what they see on there. And they don't even purposely have to do it, it's just an attention-getter. … Now, there's cyberbullying, there's a lot of different ways you can bully somebody and really kill their confidence through social media and whatnot.\"\nCLICK HERE TO GET THE FOX NEWS APP\nAs the son of a veteran teacher, the former linebacker also pointed to a decline in the quality of public education in America.\n\"It's getting worse. And that's why I'm in this fight,\" Johnson said of American public education. \"My mom being a teacher for over 40 years, I know what it means to serve the youth at a high level. … And, a lot of times, they just need more help and more resources so they can really push the mission.\n\"Public schools are at a standstill. … We have to put more attention on them, more resources, pumping more money into there and using it the right way, obviously. Not just a dollar amount, but using it in a strategic way.\"\nJohnson is doing his part to try and contribute his experience to American education with his new book \"Super DJ Saves Field Day.\" Johnson said he is already planning to write sequels and create a series.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    },
    {
      "url": "https://foxnews.onelink.me/xLDS?pid=AppArticleLink&af_dp=foxnewsaf%3A%2F%2F&af_web_dp=https%3A%2F%2Fwww.foxnews.com%2Fapps-products",
      "text": "Fox News is Everywhere.\nWatch Fox News Channel on all of your devices to keep up to date with the latest in news, politics, entertainment and more. On phones, tablets, wearables and TV, it's easy to stay connected anywhere.\niOS Devices\nAndroid Devices\nApple TV\nRoku\nChromecast\nAndroid TV\nAmazon Fire\nFubo TV\nApple Watch\nAmazon Echo\nGoogle Home\nFox News Go\nApple News\nAT&T TV Now\nYouTube TV\nHulu\nFacebook\nInstagram\nSamsung Devices\nSling TV\nVidgo\nSpotify\niHeartRadio\nFlipboard\nLinkedIn\nGoogle Newsstand\nNewsletters\nYouTube\nFAQ\nHow much data does Fox News Go use?\nFox News Go uses about 2GB per hour of SD viewing and 4GB per hour of HD viewing. This can vary depending on your device and internet connection. If you are concerned about your data usage we recommend not streaming over a cellular network and contacting your Internet or Cellular Service Provider.\nWhat broadcast quality will I get while streaming on my device?\nFox News will stream at the highest quality possible based on your device and internet connection quality. For the best quality we recommend streaming via Wi-Fi or 4G.\nWhat channels are available on Fox News Go?\nYou can Watch Fox News Channel on Fox News Go and Fox Business Channel on Fox Business Go"
    },
    {
      "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/jon-grudens-lawyers-ruling-paves-way-for-holding-the-nfl-accountable",
      "text": "The NFL has not provided a comment in response to the finding by the Nevada Supreme Court that the arbitration clause in the NFL’s Constitution and Bylaws is “unconscionable” — and thus unenforceable — as to former Raiders coach Jon Gruden.\nGruden’s lawyers have issued a statement to PFT.\n“We’re very pleased with the Nevada Supreme Court’s decision, not just for Coach Gruden but for all employees facing an employer’s unfair arbitration process,” said Adam Hosmer-Henner of McDonald Carano LLP, the firm representing Gruden. “This victory further vindicates Coach Gruden’s reputation, and it clears the way to swiftly bringing him full justice and holding the NFL accountable.”\nIt’s likely if not inevitable that the NFL will file a petition for appeal to the United States Supreme Court. If the Supreme Court doesn’t take the case (or if it does and the NFL loses), it will be time for the case to proceed to discovery. And that’s when the NFL may throw money at Gruden in an effort to settle his claim that the league and Commissioner Roger Goodell leaked emails he had sent while working for ESPN to multiple media outlets.\nHere’s the most important question: Will he reject any offer the league makes? A July 2023 ESPN.com article about the leaked emails that forced Gruden to resign asserted that Gruden hopes “to burn the house down.”\nThat can happen only if he first proves who, from a fairly tight circles of people who had access to the supposedly secret emails from the Washington investigation, leaked some to the Wall Street Journal for publication on a Friday and then, when that didn’t do the trick, leaked more to the New York Times on a Monday. At that point, things could get very interesting."
    },
    {
      "url": "https://www.freep.com/story/sports/nfl/lions/2025/07/28/jon-gruden-lions-jared-goff-joe-montana-nfl/85406951007/",
      "text": "Jon Gruden compares Lions' Jared Goff to Joe Montana, wants to coach again in NFL\nJon Gruden isn't done coaching.\nFour years after he resigned in controversy from his job with the Las Vegas Raiders, he's making his rounds again in the NFL.\nGruden visited Detroit Lions training camp Monday in Allen Park, where his good friend and protege John Morton is the team's new offensive coordinator. Gruden reiterated his desire to return to the sidelines as a coach.\n\"Hopefully I'm not done,\" Gruden said. \"I'm about to make a comeback. I'm working hard to maybe get one more shot, but hopefully some of these guys that fell off my branch, if you say it that way, maybe they can hire me cause I'm looking for a job.\"\nAsked how realistic he thinks it is that he'll coach again in the NFL, Gruden said, \"Oh, I don't care about that.\"\n\"I don't care if I coach at Jones Junior High,\" he said. \"I'm going to coach again. I'm still coaching. I'm just not on a team officially, but I do have some private assignments I work on and I wear some gear when I'm watching the games that nobody knows about who I'm pulling for.\"\nGruden resigned as coach of the Raiders in October of 2021 after private emails between him and then Washington general manager Bruce Allen were leaked from Gruden's time as a broadcaster.\nThe emails included homophobic and misogynistic language and were critical of NFL commissioner Roger Goodell and others.\nAt least one NFL team reportedly did research on Gruden during its coaching search this offseason, and Gruden worked as a consultant with the New Orleans Saints in 2023. He currently works for Barstool Sports, and said Monday he was grateful coach Dan Campbell allowed him to attend Lions practice.\n\"I just like to see how they operate, honestly,\" Gruden said. \"Watch how they practice. I can learn different drills. I see things that they're doing and it just gets me going. I mean, I wake up in July and August and I get the shakes, you know what I mean? It's just awesome to hear the (pads) popping and the snap count and see the guys struggling physically, fighting through stuff. It's just really, really a great time in my life. I spent most of my life doing this and just really honorable to be back here.\"\nGruden and Morton have a relationship that dates to Morton's playing days in the 1990s, when Morton signed with the Green Bay Packers after being released by the Raiders as a rookie.\nGruden later coached Morton with the Raiders and gave Morton his first coaching job in 1998, when Morton was working in the Raiders' personnel department.\nFellow Lions assistants David Shaw, Mark Brunell, Bruce Gradkowski and Marques Tuiasosopo also played for or worked under Gruden, and Morton, who worked under Gruden with the Raiders in 2019-21, considers Gruden one of his mentors in coaching.\n\"Jon was like the West Coast offense, the Bill Walsh and the Mike Holmgrens on the world, he’s the first one that kind of ventured off, still running the West Coast type of principles, but different formations, shifts, and motions and things like that,\" Morton said. \"So it just opens your eyes to the whole aspect of everything. I thought I knew football but, man, when you — I mean, he just put me in a room, ‘Go do this, go do that.’ It was projects one after another, and all of a sudden you start learning football, so it was really cool.”\nMorton spent the 2022 season as a senior offensive assistant with the Lions and helped then-offensive coordinator Ben Johnson build the Lions' playbook.\nHe is calling plays this year for the first time since the 2017 season with the New York Jets. He said Monday he will do so from the coach's box and feels \"very confident\" about that part of the job.\nGruden said he expects the Lions' new offense to include many of the West Coast staples he learned years ago, including lots of condensed formations and pre-snap movement.\n\"He helped put the offense in initially, so Jared (Goff is) going to do a lot at the line of scrimmage,\" Gruden said. \"You're going to hear 'RCE' a lot. I used to have hats made, recognition leads to communication, and if we can do that, we're going to execute at a high level. But I think RCE is the slogan that you're going to hear a lot around here and probably feel like you're seeing a lot.\"\nAs for Goff, Gruden, who spent time talking with Goff and his parents after practice Monday, threw a lofty Joe Montana comparison on the quarterback, and indicated he sees Goff having another big year.\n\"The continuous movement that he plays with, he always reminded me of Montana from the days I was with the 49ers and my dad coached at Notre Dame with Joe,\" Gruden said. \"But there's a similar personality, a similar playing style. He is one tough cat in the pocket. I love Goff.\"\nDave Birkett will appear at the Buy Michigan Now author showcase from 3-8 p.m. Aug. 2 in downtown South Lyon with his book, \"Detroit Lions: An Illustrated Timeline.\" He covers the Lions for the Detroit Free Press. Contact him at dbirkett@freepress.com. Follow him on Bluesky, X and Instagram at @davebirkett."
    },
    {
      "url": "https://www.foxnews.com/sports/jon-gruden-wins-key-ruling-nevada-case-against-nfl",
      "text": "Former NFL head coach Jon Gruden was the beneficiary of a key ruling in his case against the league on Monday as the Nevada Supreme Court determined that his case could proceed in court instead of arbitration.\nGruden sued the NFL in 2021 after he parted ways with the Las Vegas Raiders when leaked emails revealed racist, sexist and homophobic language.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\nThe former head coach and longtime football personality filed a lawsuit against the league and Commissioner Roger Goodell, alleging that a \"malicious and orchestrated campaign\" was used to destroy his career by leaking the emails. The leaked messages were from when he was an ESPN analyst and \"Monday Night Football\" broadcaster.\nThe NFL appealed to Nevada’s high court in 2022 after a judge in Las Vegas rejected the league’s bids to dismiss Gruden’s claim outright or to order the out-of-court talks through an arbitration process that could be overseen by Goodell.\nOn Monday, the Nevada Supreme Court ruled in a 5-2 decision that \"the arbitration clause in the NFL Constitution is unconscionable and does not apply to Gruden as a former employee.\"\nThe NFL declined to comment on the ruling, according to The Associated Press.\nGruden’s lawyers applauded the ruling in a statement to Pro Football Talk.\n\"We’re very pleased with the Nevada Supreme Court’s decision, not just for Coach Gruden but for all employees facing an employer’s unfair arbitration process,\" Adam Hosmer-Henner of McDonald Carano LLP told the outlet. \"This victory further vindicates Coach Gruden’s reputation, and it clears the way to swiftly bringing him full justice and holding the NFL accountable.\"\nGruden was the head coach of the Raiders when the team moved from Oakland to Las Vegas. He is seeking monetary damages, alleging that the selective disclosure of the emails ruing his career and endorsement deals.\nSince he left the Raiders, Gruden has worked his way back into the NFL unofficially. He’s been seen on the sidelines working with players from the New Orleans Saints and, most recently, the Detroit Lions and Jacksonville Jaguars. He’s also a part-owner and consultant for the Arena Football One League’s Nashville Kats.\nHe expressed hope for an NFL return in July when visiting the Lions.\n\"Hopefully I’m not done,\" Gruden told reporters, via the Detroit Free Press. \"I’m about to make a comeback. I’m working hard to maybe get one more shot, but hopefully some of these guys that fell off my branch, if you say it that way, maybe they can hire me cause I’m looking for a job.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I don’t care if I coach at Jones Junior High,\" he added. \"I’m going to coach again. I’m still coaching. I’m just not on a team officially, but I do have some private assignments I work on, and I wear some gear when I’m watching the games that nobody knows about who I’m pulling for.\"\nThe Associated Press contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/sports/jon-gruden-expresses-hope-nfl-return-he-visits-lions-training-camp",
      "text": "Jon Gruden has remained out of the NFL since his time with the Las Vegas Raiders came to a crashing end following a leaked email scandal.\nHowever, Gruden has been seen around NFL sidelines in recent years, including on Monday when he was seen visiting the Detroit Lions. He expressed some optimism he would be back coaching in the league in some capacity soon.\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\"Hopefully I’m not done,\" Gruden told reporters, via the Detroit Free Press. \"I’m about to make a comeback. I’m working hard to maybe get one more shot, but hopefully some of these guys that fell off my branch, if you say it that way, maybe they can hire me cause I’m looking for a job.\n\"I don’t care if I coach at Jones Junior High,\" he added. \"I’m going to coach again. I’m still coaching. I’m just not on a team officially, but I do have some private assignments I work on, and I wear some gear when I’m watching the games that nobody knows about who I’m pulling for.\"\nCHRISTIAN WILKINS TRIED TO 'PLAYFUL' KISS RAIDERS TEAMMATE ON FOREHEAD BEFORE BEING CUT: REPORT\nGruden split from the Raiders during the 2021season after emails with racist, homophobic and misogynistic language came out in multiple reports.\nSince then, he has been seen with the New Orleans Saints helping to consult Derek Carr when he was the team’s quarterback. He was also reinstated to the Tampa Bay Buccaneers’ Ring of Honor.\nAs a member of Barstool Sports, he hosted \"Gruden’s QB Class\" with incoming rookie quarterbacks ahead of the draft.\nCLICK HERE TO GET THE FOX NEWS APP\nIt’s unclear if he will ever get another official coaching job in the NFL. He is 117-112 with a Super Bowl title.\nFollow Fox News Digital’s sports coverage on X, and subscribe to the Fox News Sports Huddle newsletter."
    }
  ],
  "argos_summary": "Former NFL coach Jon Gruden's lawsuit against the league can proceed in court after the Nevada Supreme Court ruled that the arbitration clause in the NFL Constitution is unconscionable. Gruden, who resigned from the Raiders in 2021 following the leak of emails containing offensive language, alleges that the NFL orchestrated a campaign to damage his career. He expressed hope for a coaching comeback, stating he is still involved in football and eager to return to the sidelines.",
  "argos_id": "DAZ6VR083"
}