{
  "url": "https://www.nytimes.com/video/opinion/100000010245386/clemency-prison-documentaries-new-york.html",
  "authorsByline": "",
  "articleId": "1880a6a2220c4a3d88b3ecd906ed9579",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/07/21/arts/op-clemency-thumb/op-clemency-thumb-facebookJumbo.jpg?video-overlay",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:55:00.654000+00:00",
  "addDate": "2025-08-12T09:18:12.331394+00:00",
  "refreshDate": "2025-08-12T09:18:12.331396+00:00",
  "score": 1.0,
  "title": " An Unlikely Last Resort for Getting Out of Prison",
  "description": "One filmmaker’s playbook for helping people get clemency.",
  "content": "“That is a wall.” I have a job that should not exist. “Here it comes.” Every few weeks, I drive about four hours to a prison in upstate New York. Then, using my lights and camera, I try to break someone out. [MUSIC PLAYING] “I think I’m starting with tea today.” “In 2019, this lawyer I knew called me to tell me about this client named Skye Williamson. And he had applied twice for clemency, which is where the governor reduces your sentence. But his application hadn’t gained any traction.” Clemency was designed to give second chances to people who really turned their lives around in prison. But in recent years, clemency cases have plummeted. Clemency is a broken system. And that brokenness keeps me employed. Lawyers actually hire filmmakers like me to use the tools of cinema to tug on the governor’s heartstrings. That’s what I did for Skye. “You can’t be fully prepared to engage in the world in a courageous and bold, transformative way if you’re just running in denial.” He spoke on camera about his transformation over the years. And his loved ones told me of their fears. “Skye was afraid and spoke of it pretty directly, that he was afraid that he would die in prison.” “I put it all together into this shoddy little documentary. And we waited. And waited and waited. And it was about a year later that I got the call from his lawyer.” “Hey, Matt. I just got off the phone with Skye, and the governor has granted clemency. And it wouldn’t have happened without you, so thanks so much.” “I was just like, whoa, these videos really have some power.” “Oh, my god.” [LAUGHS] After Skye’s release, I started getting more and more calls. I’ve made about two dozen films for people like Skye. It’s absurd. I’m basically Netflix-ing them out of prison. But it works. My playbook is simple. And it goes like this. “I went to about maybe 13 different foster homes.” “His mother was treating him badly. She would go away for a weekend and leave him, a 4-year-old boy.” The goal of Chapter 1 is simple — “This is my mother and father.” — to show the governor that my clients were not born criminals. Most were dealt really difficult hands. “He was a very abusive father. Punches, kicks, verbal.” I use every old photo or video clip that I can get my hands on to show the governor how long it’s been. “It was a bad place for me to be. But I didn’t recognize it at the time. And it still resonates with me now.” Next up. “Call from —” “John.” “— an incarcerated individual.” “Back in December of 2001, I shot and killed a man. And it’s a decision that I’ll always regret.” Chapter 2, the crime, is the story the governor really cares about. “We went inside, and I had the gun, just to scare him so we could have money to buy drugs.” No euphemisms, no passive voice. I tell my clients to own their crimes. “When he came towards me, took a step, I fired.” “I pulled the gun out of his hand. I was crying. I was angry.” “I just reacted. But it was a bad reaction.” “I’m in shock. It’s an out-of-body experience. There’s no way for me to describe it. Thirty years later, and I think about it every day.” The apology is delicate. It’s my job to make my client’s remorse feel palpable and authentic. “I took away everything they had, man, their whole life, every moment with their family. So I don’t know what I can say to make up for that.” This is where I fade up the piano music. [MUSIC PLAYING] “I have to say that I’m sorry.” To be clear, their apologies are heartfelt. “I would beg for forgiveness because the drugs took me somewhere where I didn’t want to go.” But there’s also a particular feeling the governor’s office wants to feel. And it’s my job to engineer that feeling. “It’s the ultimate crime, taking somebody’s life. My mother died. Somebody killed my mother. And I can tell you, I went through hell just thinking about it.” A feeling of weightiness, clarity. “I am truly, truly, truly sorry inside with every beat of my heart. Every day, I think about them.” An almost superhuman level of empathy. “Even the police officers. I’m accountable for my actions, so my actions that day that caused them hardships.” “Anybody that I’ve hurt or even inconvenienced, I owe a debt to society. I owe my community for the destruction that I’ve caused in my community.” The final act, the transformation, is where my clients really get to shine. “Crocheting, for me, is very therapeutic.” “This is a scarf he made. My favorite color is purple.” “I’m not a gangster no more. I crochet.” “The kids in here call me Mama Lolly. They come to me for advice.” Many speak with pride about helping others. “A high percentage of guys come to prison functionally illiterate. So I look at it like if they could read, they wouldn’t be involved in robbing. They wouldn’t be involved in killing somebody. That’s why I chose to be a teacher.” The truth is, the prison system didn’t actually rehabilitate most of my clients. They rehabilitated themselves, despite prison. Nevertheless, Chapter 4 has to send the governor a clear message of subservience. The system has worked on me. “It does feel like I’ve kind of got lucky and I found my calling.” They all end with a similar resolution, the denouement, if you will. “I am not the person that I was 30 years ago.” “I am no longer that person I was 25 years ago.” “I’m not the same person. I have a different outlook on life. I want more.” “So I’m just going to have you look right into the lens of the camera.” For people serving long sentences, winning a second chance has never been easy. “Have a safe trip.” “Really good to see you.” But for most of our history — “Thank you.” “Have a good one.” — it wasn’t nearly as hard as it is now. For decades, governors granted clemency pretty frequently. But since the tough-on-crime era of the 1980s — “Attorney General William French Smith said today that violent crime had become a national problem.” — second chances for prisoners have declined dramatically. A major reason for this is fear. “Bush supports the death penalty. Dukakis allowed murderers to have weekend passes from prison. One was Willie Horton. Horton fled, kidnapped a young couple, stabbing the man and repeatedly raping his girlfriend.” Governors are afraid that the people they release will re-offend — “Pennsylvania gubernatorial candidate Mark Singel is doing some explaining tonight.” “— says he should never have voted to commute the life sentence of Reginald McFadden, under suspicion of kidnapping, rape and murder.” — and the governors will suffer the political consequences. “It was clear to me that that would be the end of the campaign.” There’s mounting evidence that people who get clemency rarely return to prison. But politicians still feel pressure to appear tough on crime. “The cops know that this governor doesn’t back them up. She catches them and releases them.” “Jeff Landry knows criminals should serve their time.” “I voted against the early release of violent criminals.” I understand a cautious approach to clemency. But some years, New York’s governor hasn’t granted clemency to a single prisoner. That isn’t caution. It’s cowardice. “It feels very dystopian that I have to go there and do this like this. It feels like I’m trying to hack a broken system.” If our prison system really is about rehabilitation, second chances should be part of how it functions without relying on road trips, or piano tracks, or getting the lighting just right. In 2021, Governor Kathy Hochul vowed to overhaul New York’s clemency system. But in 2023, she only commuted the sentences of nine people, and in 2024, only three people. “What’d you get?” “Cheddar Pringles.” “It’s beautiful when it happens. But it should happen way more.” “OK, OK, all right.” “Yay!” “I’m going home. Yeah, yeah.” So Governor Hochul and other governors across the country — “I’m free at last.” [CHEERING] — this is my plea. Put me out of business. I’m not asking you to break from tradition. I’m asking you to return to it. Until you do, I’ll keep filming. [MUSIC PLAYING]",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Governors",
      "weight": 0.07500739
    },
    {
      "name": "governors",
      "weight": 0.07500739
    },
    {
      "name": "other governors",
      "weight": 0.074022435
    },
    {
      "name": "second chances",
      "weight": 0.05714938
    },
    {
      "name": "Prison",
      "weight": 0.0566703
    },
    {
      "name": "prison",
      "weight": 0.0566703
    },
    {
      "name": "clemency cases",
      "weight": 0.055658557
    },
    {
      "name": "Clemency",
      "weight": 0.055088744
    },
    {
      "name": "clemency",
      "weight": 0.055088744
    },
    {
      "name": "violent crime",
      "weight": 0.0521325
    }
  ],
  "topics": [],
  "categories": [],
  "taxonomies": [
    {
      "name": "/Law & Government/Legal/Other",
      "score": 0.95263671875
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.8505859375
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.64404296875
    }
  ],
  "sentiment": {
    "positive": 0.07214951,
    "negative": 0.68353343,
    "neutral": 0.2443171
  },
  "summary": "Matt Kohn, a filmmaker known for using the tools of cinema to break people out of prison who have turned their lives around in prison, is often referred to as \"clemency,\" a system that allows for reduced sentences for individuals who have made a significant transformation in their lives. Kohn's work allows him to use these tools to draw the governor's attention to these individuals' transformation and gain second chances. Despite this, Clemency cases have decreased in recent years due to a decrease in the number of successful cases. Koon's approach to clemency has been successful, with calls from clients like Skye Williamson who had applied twice for clemable being granted. Kookmann's method involves a documentary showing the transformation of a man who was imprisoned for 30 years and was afraid to die in prison. He uses these films to convey the story of his transformation and personal experiences with clients, including murder, drug possession, violence, and drug use.",
  "shortSummary": "Awarding filmmakers like Matt Linton's job is a unique tool for breaking down prison walls, focusing on real-life transformation and personal stories to persuade governors to grant clemency.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8389931a41a24e0b8b5bb8154c962bcb",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The article discusses the role of a filmmaker who creates documentaries to help prisoners like Skye Williamson secure clemency from governors, highlighting the broken clemency system that has seen a significant decline in granted applications. Through personal stories and heartfelt apologies, the filmmaker aims to humanize inmates and demonstrate their transformations, despite the prison system's failures in rehabilitation. The piece critiques the political pressures that hinder clemency decisions and calls for a return to more compassionate practices in the justice system.",
  "argos_id": "DL74NCQCW"
}