{
  "url": "https://www.nasdaq.com/articles/stock-market-today-intel-rallies-after-trump-signals-support-ceo-amid-us-chip-strategy",
  "authorsByline": "The Motley Fool",
  "articleId": "8e111e1e85dd4d5c83f1badf3ecdce55",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T21:45:00+00:00",
  "addDate": "2025-08-12T22:30:40.075041+00:00",
  "refreshDate": "2025-08-12T22:30:40.075043+00:00",
  "score": 1.0,
  "title": "Stock Market Today: Intel Rallies After Trump Signals Support for CEO Amid U.S. Chip Strategy Talks",
  "description": "Intel (NASDAQ: INTC) climbed 5.5% on Tuesday to close at $21.81, fueled by renewed political momentum and heightened investor interest. Trading volume surged to 131.5 million shares -- over 55% above the 3-month average -- as traders responded positively to reports of a White Ho",
  "content": "Intel (NASDAQ: INTC) climbed 5.5% on Tuesday to close at $21.81, fueled by renewed political momentum and heightened investor interest. Trading volume surged to 131.5 million shares -- over 55% above the 3-month average -- as traders responded positively to reports of a White House meeting between Intel CEO Lip-Bu Tan and President Donald Trump.\n\nThe tech-heavy Nasdaq Composite rose 1.4%, while the S&P 500 added 1.1%. Semiconductors broadly benefited from a combination of bullish sentiment, favorable inflation reports, and speculation around new U.S. industrial policy.\n\nDespite continued competition from Taiwan Semiconductor Manufacturing (NYSE: TSM), which rose 0.9%, and Nvidia (NASDAQ: NVDA), up 0.5%, Intel's political tailwind provided a unique catalyst. Still, investors are watching closely for signs of execution on its manufacturing roadmaps and commitments from major U.S. customers.\n\n\n\nTan's meeting with Trump marks a reversal in tone from just days earlier, when the president publicly called for Tan's resignation over alleged ties to the Chinese Communist Party. Following Monday's sit-down, the two are expected to meet again next week, with analysts suggesting Intel may now be positioned as a strategic partner in Trump's push for expanded domestic chip manufacturing.\n\nShould you invest $1,000 in Intel right now?\n\nBefore you buy stock in Intel, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Intel wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $653,427!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,119,863!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,060% — a market-crushing outperformance compared to 182% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nDaily Stock News has no position in any of the stocks mentioned. This article was generated with GPT-4o, OpenAI's large-scale language generation model and has been reviewed by The Motley Fool's AI quality control systems. The Motley Fool has positions in and recommends Intel, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends the following options: short August 2025 $24 calls on Intel. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=20c399e6-d290-454d-a382-d6845ddfa380&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17514%26ftm_veh%3Darticle_pitch_feed_partners%26company%3DIntel&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=9ad00ec0-74a4-4aeb-92c0-7842fdbd0415",
    "https://www.fool.com/author/20661/",
    "https://www.nasdaq.com/market-activity/stocks/intc",
    "https://www.nasdaq.com/market-activity/stocks/nvda",
    "https://www.nasdaq.com/market-activity/stocks/tsm",
    "https://www.fool.com/legal/fool-disclosure-policy/",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=20c399e6-d290-454d-a382-d6845ddfa380&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001093%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17514&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=9ad00ec0-74a4-4aeb-92c0-7842fdbd0415"
  ],
  "labels": [
    {
      "name": "Non-news"
    },
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Motley Fool Stock Advisor",
      "weight": 0.0954133
    },
    {
      "name": "Intel",
      "weight": 0.08325182
    },
    {
      "name": "Stock Advisor",
      "weight": 0.077554375
    },
    {
      "name": "U.S. Chip Strategy Talks",
      "weight": 0.065768786
    },
    {
      "name": "The Motley Fool Stock Advisor analyst team",
      "weight": 0.065734625
    },
    {
      "name": "Daily Stock News",
      "weight": 0.065517485
    },
    {
      "name": "new U.S. industrial policy",
      "weight": 0.06496771
    },
    {
      "name": "President Donald Trump",
      "weight": 0.06434894
    },
    {
      "name": "Taiwan Semiconductor Manufacturing",
      "weight": 0.06334727
    },
    {
      "name": "Stock Market Today",
      "weight": 0.063341305
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Business Leaders"
    },
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    },
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.984375
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.94384765625
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.92431640625
    },
    {
      "name": "/News/Technology News",
      "score": 0.69482421875
    }
  ],
  "sentiment": {
    "positive": 0.7048905,
    "negative": 0.052734453,
    "neutral": 0.24237502
  },
  "summary": "Intel (NASDAQ: INTC) rose by 5.5% to close at $21.81 on Tuesday, driven by renewed political momentum and increased investor interest. The Nasdaq Composite rose 1.4%, while the S&P 500 added 1.1%. The news led to a surge in trading volume, with reports of a White House meeting between Intel CEO Lip-Bu Tan and President Donald Trump, indicating that Intel may be positioned as a strategic partner in Trump's push for expanded domestic chip manufacturing. Despite continued competition from Taiwan Semiconductor Manufacturing (TSM) and Nvidia, Intel's political momentum provided a unique catalyst. The Motley Fool Stock Advisor analyst team identified the 10 best stocks for investors to buy now, with an average return of 1,060%.",
  "shortSummary": "Intel shares rose 5.5% amid renewed political momentum and investor interest, with a White House meeting between CEO Lip-Bu Tan and President Donald Trump providing a significant political boost.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "5742c2bd2f794a3b8ca0902dcd2f116f",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "Intel's stock rose 5.5% to $21.81 following a meeting between CEO Lip-Bu Tan and President Trump, which has sparked renewed investor interest and speculation about Intel's role in U.S. chip manufacturing policy. The surge in trading volume, exceeding the three-month average, reflects positive sentiment in the semiconductor sector, aided by favorable inflation reports. Despite competition from companies like TSMC and Nvidia, Intel's political backing may enhance its market position.",
  "argos_id": "DNLKJA6D3"
}