{
  "url": "https://www.bloomberg.com/news/videos/2025-06-10/balance-of-power-late-edition-6-09-25-video",
  "authorsByline": "bn",
  "articleId": "a4d726b5fbca4701974e7cfb71c11576",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i6N4uEhVCtvw/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-06-10T00:16:44.563000+00:00",
  "addDate": "2025-06-10T00:41:33.880483+00:00",
  "refreshDate": "2025-06-10T00:41:33.880485+00:00",
  "score": 1.0,
  "title": "LA Clashes Escalate as Trump, Newsom Spar",
  "description": "\"Balance of Power: Late Edition\" focuses on the intersection of politics and global business. On today's show, David Leopold, Former President of the American Immigration Lawyers Association, discusses the legal implications of the Los Angeles protests escalation. Rep. Darrell Issa (R) California discusses why he believes the Trump Administration having the National Guard and Marines deployed in Los Angeles to put a stop to the protests is not an encroachment on state's rights. Melanie Hart, Senior Director at the Atlantic Council's Global China Hub, weighs in on what to expect from a second day of trading talks between the United States and China. (Source: Bloomberg)",
  "content": "> > THIS IS \"BALANCE OF POWER,\" LIVE FROM WASHINGTON, D.C. KAILEY: FROM BLOOMBERG'S WASHINGTON, D.C. STUDIOS TO OUR TV AND RADIO AUDIENCES WORLDWIDE, WELCOME TO \"BALANCE OF POWER.\" KAILEY: TONIGHT, THE STANDOFF IN LOS ANGELES. THE STATE OF UPHEAVAL IN L.A. AFTER WEEKEND DEMONSTRATIONS -- > > VERY CLEAR THAT AFRAID'S HAPPEN HERE THAT THE COMMUNITY WAS GOING TO RESPOND IN A VERY NEGATIVE WAY. JOE: THE STATE OF UPHEAVAL IN L.A. AFTER WEEKEND DEMONSTRATIONS OVER A SERIES OF FEDERAL IMMIGRATION RAIDS DETERIORATED INTO CLASHES WITH ICE OFFICERS. THE PRESIDENT OVERWRITING LOCAL OFFICIALS BY SENDING IN 2000 NATIONAL GUARD TROOPS. NOW THE PENTAGON MOBILIZING ABOUT 700 ACTIVE-DUTY MARINES TO PROVIDE REINFORCEMENTS TO THOSE TROOPS. WE WILL HAVE A REPORT FROM THE GROUND. KAILEY: PLUS IN LONDON AND HOPING TO MAKE A DEAL. U.S. AND CHINESE NEGOTIATORS SPENT HOURS IN TRADE TALKS IS THE U.S. SIGNALED A WILLINGNESS TO MOVE ON SOME KEY ISSUES. JOE: REPUBLICANS WAVE GOODBYE TO ELON MUSK. HIS STRONG AND VOCAL OPPOSITION TO THE TRUMP TAX PACKAGE DOES NOT APPEAR TO BE THREATENING THE BILL AS REPUBLICAN LAWMAKERS RACED TO GET IT DONE BY THEIR JULY 4 DEADLINE. REPUBLICAN CONGRESSMAN DARRELL ISSA WILL JOIN US WITH MORE. A FOURTH DAY OF PROTESTS AGAINST THE ADMINISTRATION'S IMMIGRATION CRACKDOWN AS DEMONSTRATORS FACE-OFF WITH LAW ENFORCEMENT, INCLUDING MORE THAN 2000 NATIONAL GUARD TROOPS. PRESIDENT TRUMP PLOY THEM OVER OPPOSITION FROM THE GOVERNOR OF CALIFORNIA, GAVIN NEWSOM WHO IS DEMANDING THE REMOVAL, CALLING IT A SERIOUS BREACH OF STATE SOVEREIGNTY. PRESIDENT TRUMP RESPONDING THIS AFTERNOON. > > IT'S LUCKY FOR THE PEOPLE IN LOS ANGELES AND CALIFORNIA THAT WE DID WHAT WE DID. WE GOT IT JUST IN TIME. IT IS STILL SIMMERING A LITTLE BIT BUT NOT VERY MUCH. KAILEY: THE PRESIDENT'S WORDS RUNNING COUNTER TO THE ACTION THE ADMINISTRATION IS NOW TAKING, SENDING ABOUT 700 ACTIVE-DUTY MARINES TO HELP QUELL PROTESTS. IT IS AN EXPLOSIVE MOMENT THAT SEEMINGLY ERUPTED OVERNIGHT BUT WAS MONTHS IN THE MAKING AFTER COMMUNITY LEADERS RAILED AGAINST ICE RAIDS AND DEPORTATIONS WITH MORE THAN 7000 ARRESTS MADE BY ICE SINCE INAUGURATION DAY. LEADING TO SCENES LIKE THE ONE YOU ARE SEEING ON TV. DEMOCRATIC LAWMAKERS GETTING ARRESTED, THEMSELVES IN SOME INSTANCES AS THEY DEMONSTRATE AGAINST THE MOVES. ADMINISTRATION LOOKING TO MAKE GOOD ON ITS PROMISE TO CARRY OUT MASS DEPORTATIONS. LET'S GO ON THE GROUND TO LOS ANGELES WERE REFINED ALICIA CALDWELL FOR THE LATEST DEVELOPMENTS. -- WHERE WE FIND ALICIA CALDWELL FOR THE LATEST OF ELEMENTS. WHAT IS LIKE ME TO HAPPEN FROM HERE? ALICIA: IT IS UNCLEAR WHAT IS NEXT. A FEW HUNDRED NATIONAL GUARDSMEN ARE ON THE GROUND IN LOS ANGELES. THEY BEEN PRIMARILY FOCUSED AROUND FEDERAL BUILDINGS IN THE DOWNTOWN AREA. WHERE THOSE MARINES ARE HEADING IS UNCLEAR. IT APPEARS THEY WILL BACK UP THE NATIONAL GUARD AND BOLSTER THOSE GUARDSMEN BUT IT IS HIGHLY UNUSUAL FOR ACTIVE-DUTY TROOPS. I'M NOT SURE THIS HAS MUCH PRECEDENCE. NATIONAL GUARD TROOPS ARE ACTIVATED NOT ROUTINELY BUT WHEN NEEDED BY STATE GOVERNMENTS. WE SAW HERE IN LOS ANGELES AFTER THE WILDFIRES IN JANUARY. THE UNUSUAL PART IS THE FEDERALIZED NATURE OF THIS AND THE ACTIVE-DUTY MARINES. JOE: THE ACTIVE-DUTY MARINES, THE MOST RECENT DEVELOPMENT FOLLOWING NEWS THAT THE GOVERNOR'S FILING SUIT OVER THIS, SUING THE ADMINISTRATION OVER THE INITIAL DEPLOYMENT OF NATIONAL GUARD TROOPS. I PRESUME THAT COVERS ANY MILITARY THAT'S GOING TO BE ON THE STREETS OF LOS ANGELES. WHAT DO WE KNOW ABOUT THIS? ALICIA: THAT IS MY UNDERSTANDING AS WELL, THAT THE GOVERNOR HAS SAID THIS IS IN VIOLATION OF STATES RIGHTS, AND IS CHALLENGING THIS DEPLOYMENT ALTOGETHER. MILITARY AS A RULE, ACTIVE-DUTY MILITARY IS PROHIBITED FROM PARTICIPATING IN CIVIL LAW ENFORCEMENT. WE WILL SEE WHAT THEIR ROLE IS BUT WHAT WE ARE SEEING ACROSS L.A. RIGHT NOW IS REPORTS OF CONTINUED ARRESTS BY BORDER PATROL AND ICE AND OTHERS WHO ARE WORKING WITH THOSE AGENCIES. WE HAVE CONTRACTORS DRIVING VEHICLES LOADED WITH FOLKS WHO HAD BEEN ARRESTED IN HOME DEPOT PARKING LOTS AND OTHER INCIDENTS OR OTHER LOCATIONS. WE ARE SEEING THE ICE ACTIVITY CONTINUE WHICH THE AGENCY PROMISED OVER THE WEEKEND, THAT PEOPLE IN THE CITY WOULD SEE THAT ACTIVITY CONTINUE. PROTESTS HAVE CONTINUED AS WELL. THERE IS A GATHERING IN DOWNTOWN LOS ANGELES RIGHT NOW THAT APPEARS LARGELY PEACEFUL. WE WILL SEE HOW THE DAY PROGRESSES. THINGS START SMALL AND PEACEFUL, OCCASIONAL SKIRMISHES BUT AS THE DAY PROGRESSES, WE SEE MORE AND MORE VIOLENCE AS WE DID OVER THE WEEKEND, AND LAST NIGHT. CONFRONTATIONS BETWEEN DEMONSTRATORS AND THE LOS ANGELES POLICE DEPARTMENT. JOE: IT IS GREAT TO HAVE YOU WITH US HERE. ALICIA CALDWELL FROM OUR LOS ANGELES BUREAU. FOR MORE ON THE LEGAL IMPLICATIONS OF THIS ESCALATION, WE TURN TO THE FORMER PRESIDENT OF THE AMERICAN IMMIGRATION LAWYERS ASSOCIATION, PARTNER AND GROUP LEADER NOW -- IT IS GREAT TO HAVE YOU BACK WITH US. I'M WONDERING YOUR THOUGHTS ON THE LEGAL GROUNDS THAT THIS WHITE HOUSE IS HINGING ALL OF THIS ON, WITH THE IDEA OF SQUELCHING A REBELLION IN THE STREETS OF L.A.. THAT WAS THE JUSTIFICATION FOR SENDING IN THE NATIONAL GUARD. DID YOU SEE REBELLION ON THE STREETS LAST NIGHT? DAVID: NO, I HAD NOT SEEN A REBELLION, NOR HAS ANYONE ELSE. WHAT WE'VE SEEN IS PEOPLE EXERCISING THEIR FIRST AMENDMENT RIGHTS, THE RIGHT TO REDRESS THE GOVERNMENT, PROTEST. THAT IS IN THE CONSTITUTION. THAT IS WHAT THESE TROOPS ARE BEING SENT OUT TO SUPPRESS. THAT IS NOT AMERICAN. THAT IS NOT PART OF OUR CORE VALUES AND WHEN YOU THINK ABOUT IT, WHO ARE THEY TARGETING, THESE ICE PERSONNEL IN FULL MILITARY GARB? THEY ARE TARGETING ESSENTIAL WORKERS. PEOPLE WHO PUT THE FOOD ON THE TABLE, THE PEOPLE WHO WORK HARD. GAVIN NEWSOM PUT IT VARIES DISTINCTLY WHEN HE WAS INTERVIEWED. THESE ARE PEOPLE WHO ARE HARD-WORKING FOLKS. TO SEND FULL MILITARY GARB DRESSED NATIONAL GUARD AND NOW TO CALL IN MARINES? THIS IS SHOCKING. KAILEY: TO THAT POINT, HOW MUCH OF AN ESCALATION IS THE DEPLOYMENT OF ACTIVE-DUTY MEMBERS OF THE UNITED STATES MILITARY? WHAT IS THE LEGAL JUSTIFICATION FOR SUCH A MOVE? HOW DOES A CONTRAST WITH THE NATIONAL GUARD? DAVID: I SUSPECT THEY WILL SAY THEY ARE NOT THERE TO ENFORCE CIVIL LAW BUT THAT IS EXCEPT THE WHAT THEY ARE THEREFORE. I THINK WE ARE GOING TO SEE GOVERNOR NEWSOM AND OTHERS GO TO FEDERAL COURT TO STOP THIS. THIS IS A DELIBERATE SPREADING OF CHAOS, CONFUSION AND FEAR BY THE ADMINISTRATION, TO WHAT END? THEY WANT TO GET THIS BILL THROUGH CONGRESS WITH BILLIONS FOR IMMIGRATION ENFORCEMENT. THEY HAVE A PROBLEM WITH FORMER FRIEND ELON MUSK TRASHING THAT BILL. DON'T TAKE MY WORD FOR IT, THAT IS WHAT THE PRESIDENT'S DEPUTY CHIEF OF STAFF, STEPHEN MILLER TWEETED THE OTHER DAY OR EARLIER TODAY. THERE ARE OTHER MOTIVATIONS HERE. THIS IS REALLY DANGEROUS STUFF. IMMIGRATION IS THE SPEAR -- THE TIP OF THE SPEAR AIMED AT THE HEART OF DUE PROCESS, AT CIVIL LIBERTIES IN THIS COUNTRY AND WE ARE SADLY SEEING IT COME TO FRUITION. JOE: YOU WONDER IF IT LANDS IN GAVIN NEWSOM'S LAP, PER THE THREATS FROM THE BORDER CZAR TO ARREST THE GOVERNOR OF CALIFORNIA AND HE DID TALK ABOUT THIS LAST EVENING ON CABLE NEWS, ADDRESSING THAT THREAT ON MSNBC. LET'S LISTEN. > > HE IS A TOUGH GUY. HE KNOWS WHERE TO FIND ME. YOU KNOW WHAT? GET YOUR HANDS OFF OF THE FOUR-YEAR-OLD GIRLS TRYING TO GET EDUCATED. GET YOUR HANDS OFF THESE PEOPLE TRYING TO LIVE THEIR LIVES, PAYING THEIR TAXES. THEY'VE BEEN HERE 10 YEARS. THE FEAR, THE HORROR, COME AFTER ME. LET'S GET IT OVER WITH. JOE: HE HASN'T BEEN ARRESTED YET BUT EVEN DONALD TRUMP SAID TODAY IF HE WAS TOM, HE WOULD ARREST GAVIN NEWSOM AND SUGGESTED GAVIN NEWSOM MIGHT ENJOY IT FOR THE PUBLICITY. DOES THE WHITE HOUSE HAVE THE LEGAL STANDING TO ARREST THE SITTING GOVERNOR? DAVID: IT'S NOT EVEN A QUESTION. ABSOLUTELY NOT. IF THIS WASN'T SOME TERRIFYING MOMENT WHERE THE PRESIDENT OF THE UNITED STATES AND HIS CHIEF IMMIGRATION CZAR ARE THREATENING THE SITTING GOVERNOR OF THE LARGEST STATE IN THE UNION OR ANY STATE IN THE UNION WITH ARREST BECAUSE HE IS DOING HIS JOB. HE IS PROTECTING THE PEOPLE OF CALIFORNIA. AND HE'S RIGHT, IF THEY ARE SO TOUGH, STOP ARRESTING FOUR-YEAR-OLD GIRLS AND DISHWASHERS AND PEOPLE WHO ARE PUTTING FOOD ON OUR TABLES, TAXPAYERS. THIS IS REALLY APPALLING. I COMMEND GOVERNOR NEWSOM FOR STANDING UP FOR WHAT'S RIGHT, FOR DOING HIS JOB. THEY ARE GOING TO ARREST NEWSOM. THE PRESIDENT OF THE UNITED STATES OR TOM HOMAN, THEY HAVE NO GROUNDS. THIS THUGGISH TALK HAS NO PLACE IN AMERICAN POLITICS OR DISCOURSE, LET ALONE COMING FROM THE MOUTH OF THE PRESIDENT AND HIS TOP AIDES. KAILEY: WHEN WE CONSIDER WHAT STARTED ALL OF THIS, THE IDEA THAT THERE IS GREAT UPSET ABOUT THE ACTION OF ICE AND IMMIGRATION AUTHORITIES AND RAID S THEY WERE CONDUCTING IN LOS ANGELES, THAT IS WHY WE WERE SEEING PROTESTS CONTINUE, WHICH WE CAN SHOW YOU. WHEN WE CONSIDER THE ACTUAL ACTION IMMIGRATION AUTHORITIES ARE TAKING, DO WE HAVE ANY EVIDENCE OF THEM OPERATING OUTSIDE LEGAL BOUNDS? WE KNOW FOR CERTAIN THAT ALL OF THESE PEOPLE THEY ARE LOOKING TO ARREST ARE BEING GIVEN ADEQUATE DUE PROCESS? DAVID: THAT'S THE WHOLE POINT. THEY'VE STOPPED TRYING -- THEY HAVE ATTEMPTED TO KNOCK DOWN DUE PROCESS FROM THE DAY THE PRESIDENT WAS SWORN IN. YOU SAW WHAT HAPPENED TO THOSE WHO WERE SENT OFF WITHOUT TRIAL OR HEARINGS, TO EL SALVADOR UNDER THE ALIEN ENEMIES ACT. YOU TALK ABOUT REBELLION, NOW GOING ON IN CALIFORNIA WHICH IS NOT HAPPENING. THERE WAS NO REBELLION BY ANY VENEZUELANS, NO INVASION BY VENEZUELA TO JUSTIFY THE ALIEN ENEMIES ACT. THERE IS NO JUSTIFICATION FOR THE ATTEMPT TO STOP BIRTHRIGHT CITIZENSHIP. MOST OF THE THINGS OR ALL OF THE THINGS THEY HAVE NO JUSTIFICATION AND HERE'S THE THING. THE PRESIDENT OF THE UNITED STATES RAN ON A PLATFORM OF SECURING THE BORDER. THAT'S WHAT HE RAN ON AND THAT IS WHAT HE WON ON. THAT'S BEEN DONE. THE BORDER IS QUIET. MOST AMERICANS, MOST OF THEM WHO VOTED FOR HIM ARE GOING TO BE STUNNED AND SURPRISED THAT WHAT THEY VOTED FOR OR WHAT THEY ARE SEEING NOW IS A PRESIDENT AND A GROUP OF ENABLERS WHO ARE TRYING TO SHUT DOWN DUE PROCESS AND THROW OUT AND SHRED THE CONSTITUTION. KAILEY: DAVID LEOPOLD, WE APPRECIATE YOUR TIME. FORMER PRESIDENT OF THE AMERICAN IMMIGRATION LAWYERS ASSOCIATION AND GROUP LEADER IN IMMIGRATION AT GREENS FELDER. COMING UP, WE HAVE A STATUS UPDATE ON TODAY'S TRADE TALKS IN LONDON BETWEEN THE U.S. AND CHINA. WE WILL DIVE INTO WHAT IS NEXT WITH MELANIE HART, SENIOR DIRECTOR AT THE ATLANTIC COUNCIL GLOBAL CHINA HUB AND SPEAK WITH REPUBLICAN CONGRESSMAN DARRELL ISSA OF CALIFORNIA, COMING UP ON \"BALANCE OF POWER.\" > > THE PEOPLE CAUSING THE PROBLEM ARE PROFESSIONAL AGITATORS, INSURRECTIONISTS, THEY ARE BAD PEOPLE AND SHOULD BE IN JAIL. KAILEY: PRESIDENT TRUMP EARLIER TODAY REACTING TO PROTESTS IN LOS ANGELES WHERE THE NATIONAL GUARD AND NOW ACTIVE-DUTY MARINES HAVE BEEN DEPLOYED. FOR MORE ON BLOOMBERG TV AND RADIO WE TURN TO CAPITOL HILL WHERE REPUBLICAN IRISHMAN DARRELL ISSA OF CALIFORNIA IS JOINING US LIVE. WELCOME TO \"BALANCE OF POWER.\" WHEN WE CONSIDER THE ACTIONS OF THE ADMINISTRATION, WHY SHOULD THIS NOT BE SEEN AS AN ENCROACHMENT ON STATE SOVEREIGNTY OR STATES RIGHTS? REP. ISSA: BECAUSE IT IS NOT ABOUT STATES RIGHTS. IT'S ABOUT SUPREMACY. IT WAS ABOUT SUPREMACY WHEN EISENHOWER SENT TROOPS IN TO ALABAMA. IT WAS ABOUT SUPREMACY WHEN LYNDON JOHNSON DID IT. WHEN CITIZENS ARE NOT BEING PROTECTED BY THEIR STATE, THEY HAVE EVERY RIGHT TO BE PROTECTED. IN THIS CASE, LAW ENFORCEMENT WAS OVERWHELMED BY INSURRECTIONISTS. THE PRESIDENT SAW THAT. ICE AGENTS CALLED FOR SUPPORT AND WAITED TWO HOURS BEFORE THEY GOT ANY RELIEF. NO QUESTION AT ALL. THERE WAS A VALID REASON THE PRESIDENT DID IT. KAILEY: IS THERE A DIFFERENCE IN YOUR MIND BETWEEN DEPLOYING NATIONAL GUARDSMEN AND ACTIVE-DUTY UNITED STATES MARINES, ACTIVE-DUTY U.S. MILITARY MEMBERS ON U.S. SOIL? REP. ISSA: ABSOLUTELY THERE IS A DIFFERENCE. THOSE NATIONAL GUARDSMEN ARE REGULARLY DEPLOYED AS AN EXTENSION OF LAW ENFORCEMENT, WHICH THEY HAVE BEEN. THE MARINES HAVE BEEN DEPLOYED TO PROTECT FEDERAL PROPERTY, WHICH THEY HAVE EVERY RIGHT TO DO AND WILL DO. THE PRESIDENT IS APPROPRIATELY USING EACH OF THEM IN A WAY THAT COMPLIES WITH FEDERAL LAW, PASSED BY CONGRESS. JOE: WANT TO ASK YOU ABOUT CONGRESS AND THE POSSE COMITATUS ACT IF WE ARE GOING TO PUT MILITARY TROOPS ON THE GROUND, SHOULDN'T YOU AND YOUR COLLEAGUES HAVE A SAY? REP. ISSA: WE DID HAVE A SAY. WE PASSED THAT LAW AND IN ADDITION TO THE INSURRECTION ACT. EACH OF THEM DEFINES WHEN AND HOW YOU CAN USE THOSE FORCES BUT UNDERSTAND THE NATIONAL GUARD ACTIVATED BY THE FEDERAL GOVERNMENT DOES IN FACT HAVE THE RIGHT TO DO EXACTLY WHAT THEY ARE DOING. LET'S UNDERSTAND YOU CAN SEE THOSE FORCES. ARE THEY MAKING ARRESTS? FOR THE MOST PART THEY ARE NOT. THEY ARE GIVING THE POLICE THE ABILITY TO MAKE THOSE ARRESTS. OUT OF 100 ARRESTS, 47 WERE DONE BY CALIFORNIA BADGED LAW ENFORCEMENT. THE REST WERE DONE BY ICE, TAKING INTO CUSTODY PEOPLE THEY HAD WARRANTS FOR. THEY ARE DOING EXACTLY WHAT THEY ARE SUPPOSED TO DO. WHEN YOU HEAR DIFFERENTLY, YOU ARE NOT HEARING FROM THE POLICE DIFFERENTLY, YOUR HEARING FROM THE VARYING PEOPLE -- THE VERY PEOPLE SUPPORTING THIS LAWLESSNESS, THE BURNING OF VEHICLES, THE BRICKING OF LAW ENFORCEMENT, TRYING TO DO THEIR JOB. KAILEY: WHEN WE CONSIDER ICE, ADMINISTRATION OFFICIALS INCLUDING THE WHITE HOUSE PRESS SECRETARY ARE POINTING TO THE BILL THAT JUST PASSED YOUR CHAMBER THAT WOULD HIRE 10,000 NEW ICE PERSONNEL, 5000 NEW CUSTOMS OFFICERS, NEW BORDER PATROL AGENTS. TO THE SCENES AT A LOS ANGELES MAKE IT HARDER FOR ANY OF YOUR REPUBLICAN COLLEAGUES IN THE HOUSE TO VOTE NO IF THIS PACKAGE IS TO RETURN TO THE HOUSE, CHANGED IN SOME WAY BY THE SENATE? REP. ISSA: I VOTED YES, ALMOST EVERY REPUBLICAN VOTED YES. I EXPECT IT TO COME BACK FROM THE SENATE WITH SOME CHANGES BUT ONE OF THE IMPORTANT THINGS IS THAT WE DO NEED TO BACK -- NOT JUST THE MEN AND WOMEN IN BLUE LOCALLY BUT THOSE WHO BEAR THAT SAME RESPONSE ABILITY FEDERALLY -- RESPONSIBILITY FEDERALLY. THE ADMINISTRATION -- THE LAST ADMINISTRATION LET 10 MILLION PEOPLE INTO THE COUNTRY ILLEGALLY. THERE IS GOING TO BE A HUGE JOB AND WE WILL NEED THE RESOURCES TO DO IT AND PRESIDENT TRUMP RAN ON MAKING THIS CHANGE AND HE IS MAKING THIS CHANGE AND HE IS DOING IT PURSUANT TO THE CONSTITUTION AND THERE HAVE BEEN COURT CHALLENGES AND HE HAS RESPECT OF THE OUTCOME OF THE COURTS. BUT HE WAS ELECTED TO DO THIS. I WAS ELECTED, REELECTED TO DO THIS, AND I EXPECT THAT WE ARE GOING TO BRING SAFETY. IN THE MIDTERM ELECTIONS COMING UP IN JUST A MATTER OF MONTHS AGAIN, WE ARE GOING TO BE ASKED A QUESTION, ARE AMERICANS SAFER NOW THAN TWO YEARS AGO? WE HAVE TO BE ABLE TO ANSWER YES THEY ARE BECAUSE DONALD TRUMP DID AND CONGRESS BACKED HIM. JOE: GREAT TO HAVE YOU WITH US, REPUBLICAN CONGRESSMAN DARRELL ISSA OF CALIFORNIA. ANOTHER DAY OF TRADE TALKS IN LONDON ON THE SCHEDULE BETWEEN THE U.S. AND CHINA. HERE IS THE PRESIDENT EARLIER TODAY. TREASURY SECRETARY SCOTT BESSENT AND HOWARD LUTNICK AND JAMIESON GREER WERE ALL IN THE SAME ROOM AND AT THE TABLE. ANNE-MARIE HORN DERN HAS MORE FROM LONDON. ANNMARIE: THE U.S. AND CHINESE DELEGATIONS HAVE LEFT WITHOUT AN AGREEMENT, BUT THEY DID AGREE TO MEET AGAIN TOMORROW, SO POSITIVE SIGNALS THAT POTENTIALLY THEY COULD COME TO AN UNDERSTANDING. WHAT WE ARE HEARING IS POTENTIALLY THE UNITED STATES IS WILLING TO EASE EXPORT CONTROLS. THAT WAS UNDERSCORED BY THE FACT THAT THE COMMERCE SECRETARY JOINED THE DELEGATION. HE WAS NOT PRESENT FOR THE GENEVA TALKS FOUR WEEKS AGO. IN EXCHANGE, WHAT WASHINGTON WANTS TO SEE OUT OF BEIJING IS AN ADVANCED PACE OF THOSE RARE EARTH LICENSES AND MAGNETS. THIS IS CRITICAL TO THE U.S. DEFENSE AND TECH INDUSTRY, ESPECIALLY FOR THINGS LIKE MOBILE PHONES. LEAVING THE MEETINGS IN LONDON, SECRETARY BESSENT SAID IT WAS A GOOD MEETING. THE COMMERCE SECRETARY SAID THEY WERE FRUITFUL. WE WILL SEE IF THEY BEAR RESULTS TOMORROW. KAILEY: REPORTING FROM THE GROUND IN LONDON. FOR MORE ON THESE TRADE TALKS WE TURN NOW TO MELANIE HART, SENIOR DIRECTOR AT THE ATLANTIC COUNCIL MOBILE CHINA HUB. WHERE SHOULD WE BE SETTING THE BAR OF THE OUTCOME OF A SECOND DAY OF TALKS? IS IT ENOUGH IF THEY JUST WALK AWAY WITH A HANDSHAKE AND WE AGREE NOT TO ESCALATE? MELANIE: THE BAR SHOULD BE PRETTY LOW. THE GOAL IS TO GET BACK TO WHERE WE WERE A COUPLE OF WEEKS AGO WHEN THE U.S. AND CHINA NEGOTIATED A TARIFFS CEASE FIRE TO CREATE A 90 DAY PROCESS TO HAVE DEEPER DISCUSSIONS. JOE: YOU MADE A GREAT POINT. THIS ISN'T EXACT HE PROGRESS OF WE ARE JUST TRYING TO GET BACK TO A POINT THAT FOLLOWED SO-CALLED LIBERATION DAY. THERE IS THIS IDEA OF RELIEF IF RARE EARTH AND BATTERIES COME THROUGH ON THE CHINA SIDE, IF EXPORT CONTROLS ARE LOOSENED ON THE U.S. SIDE, MAYBE WE HAVE A DEAL. WHY IS THE U.S. GIVING UP MORE NOW? MELANIE: I WOULDN'T CALL IT A DEAL. IT IS AN AGREEMENT TO GET BACK TO DEALMAKING. WE HAVE A MISALIGNMENT BETWEEN THE U.S. AND CHINA AND UNDERSTANDING COMING AT THE SWITZERLAND MEETINGS ON WHAT THE 90 DAYS WAS SUPPOSED TO LOOK LIKE. THE U.S. EXPECT TO CHINA WOULD BE EXPORTING AND GRANTING LICENSES FOR RARE EARTH MAGNETS THAT -- AT A PRETTY GOOD CLIP BUT THE LICENSES WERE SLOW AND THAT RESULTED IN FORD HAVING TO SHUT DOWN PRODUCTION. CHINA WAS EXPECTING THE UNITED STATES TO WITHHOLD ANY NEW MEASURES ON CHIP CONTROLS BUT THE U.S. PUT OUT NEW EXPORT CONTROL MEASURES ON MAY 15. THIS IS AN AIM TO UNRAVEL SOME OF THE THINGS THAT AGITATED THE TWO SIDES OVER THE PAST COUPLE OF WEEKS. KAILEY: WHEN WE CONSIDER THOSE EXPORT CONTROLS, THIS ADMINISTRATION IS CONTINUING POLICY WE SAW IN THE LAST, A CONCERTED EFFORT TO RESTRAIN CHINA'S TECHNOLOGICAL CAPABILITIES. WHAT POSITION DOES THAT PUT U.S. NATIONAL SECURITY AND? MELANIE: THIS IS PROBLEMATIC BECAUSE WHEN I'M SITTING ACROSS THE TABLE FROM MY CHINESE COUNTERPARTS, THE ARGUMENT I ALWAYS MAKE IS WE PUT EXPORT CONTROLS IN PLACE, IT'S FOR SOLID NATIONAL SECURITY PURPOSES AND THAT'S WHY WE DON'T USE THEM AS LEVERAGE. WHEN YOU DO IT IN RARE EARTHS, IT IS CLEARLY A MOVE TO EXERT LEVERAGE OTHER CASH OVER OTHER COUNTRIES BECAUSE YOU TURN THEM OFF AND ON AT WILL AND THIS IS UNPRECEDENTED, IT IS MOVING THE U.S. INTO A POSITION WHERE WE TURN OUR CHIP EXPORT CONTROLS OFF AND ON AT WILL IF THAT IS ON THE NEGOTIATION TABLE. JOE: WHAT KIND OF CHIPS ARE WE TALKING ABOUT? THESE AREN'T H20 CHIPS COMING FROM NVIDIA. THESE ARE LOWER-LEVEL SEMICONDUCTORS. MELANIE: THE PARTICULAR MEASURE THAT BEIJING IS FOCUSED ON IS A MAY 15 ANNOUNCEMENT FROM THE UNITED STATES THAT IS A WARNING TO OTHER NATIONS THAT IF THEY ARE PURCHASING HUAWEI AI CHIPS, THE U.S. CONSIDERS THOSE CHIPS TO LIKELY CONTAIN EXPORT CONTROLLED MATERIAL THAT WAS NOT LICENSED AND THE THIRD COUNTRY COULD FACE U.S. ENFORCEMENT MEASURES. IT IS REALLY A WARNING TO OTHER COUNTRIES AROUND THE WORLD NOT TO BUY HUAWEI AI CHIPS. KAILEY: WE CONSIDER THESE MEETINGS ARE HAPPENING AFTER A PHONE CALL BETWEEN PRESIDENT TRUMP AND XI JINGPING LAST WEEK, ARE THERE INCENTIVES FOR XI JINGPING TO MEET PERSONALLY WITH PRESIDENT TRUMP TO SHOW ANY KIND OF FALTERING IN CHINA'S STANCE OR IS IT TRUMP THAT HAS THE WEAKER HAND? MELANIE: CHINA HAS MORE LEVERAGE AT THIS POINT. BEIJING HAS BEEN WORKING FOR AT LEAST A DECADE TO BUILD UP THAT LEVERAGE. IT IS NO ACCIDENT THAT THEY CONTROLLED AROUND 99% OF THESE RARE EARTH MAGNETS. THEY BUILT THAT CONTROL ON PURPOSE FOR THIS MOMENT AND NOW THEY ARE USING IT. THAT IS WHY IT IS IMPORTANT THAT WHENEVER WE APPLY TRADE POLICY OR EXPORT CONTROL MEASURES ON CHINA, THAT THEY BE POLICIES WE ARE INTERESTED TO LIVE WITH AND IN OUR OWN NATIONAL INTEREST. JOE: I WANT TO GET BACK TO THE ORIGINAL PREMISE BECAUSE IT SOUNDS LIKE WE ARE NIBBLING AROUND THE EDGES. WE HAVE AN AUGUST DEADLINE FOR SOMETHING BIGGER. SHOULD WE BE TALKING ABOUT A COMPREHENSIVE TRADE DEAL OR IS THAT YEARS AWAY? MELANIE: I DON'T SEE A COMPREHENSIVE TRADE DEAL THAT WOULD BE IN U.S. NATIONAL INTEREST. THERE ARE OTHER THINGS WE CAN DO. CHINA HAS TO MR. DID THEY ARE VERY GOOD AT EXPORT CONTROL REGIMES FOR RARE EARTH AND THEY CAN DO THE SAME THING FOR FENTANYL. THERE WERE THINGS LIKE THAT THAT SHOULD BE ON THE TABLE THAT WE COULD DEFINITELY AGREE TO. JOE: I GUESS WE WILL CHECK BACK IN A COUPLE OF WEEKS. GREAT CONVERSATION WITH MELANIE HART, SENIOR DIRECTOR AT THE ATLANTIC COUNCIL GLOBAL HUB FOR CHINA. WE TURNED BACK TO THE LATEST COMING FROM THE PROTESTS IN L.A. WE ASSEMBLE OUR POLITICAL PANEL. MUCH MORE TO FOLLOW, FOLLOWING A WEEKEND OF CLASHES. WE BRING YOU A LIVE VIEW OF DOWNTOWN L.A. ON DAY FOUR, WHERE WE ARE WATCHING CONTINUED PROTESTS WITH NATIONAL GUARD AND NOW MARINE TROOPS BEING MOBILIZED BY THE WHITE HOUSE. ♪ > > HAD A PROBLEM WITH TIM COOK YESTERDAY. I SAID I'VE TREATED YOU VERY GOOD. NOW YOU ARE BUILDING ALL OVER INDIA. I DON'T WANT YOU BUILDING IN INDIA. KAILEY: PRESIDENT TRUMP LAST MONTH ON APPLE'S PLAN TO MOVE MORE OF ITS PRODUCTION IN INDIA. THE PRESIDENT OF COURSE LATER THREATENED A 25% TARIFF ON ALL SMARTPHONES UNLESS THEY ARE MADE IN THE U.S., A DEMAND NEARLY IMPOSSIBLE FOR LOGISTIC AND ECONOMIC REASONS. AS APPLE NAVIGATES THAT UNCERTAINTY, THE COMPANY IS ALSO HOLDING ITS ANNUAL DEVELOPERS CONFERENCE, UNVEILING THE MOST SWEEPING SOFTWARE REDESIGN IN ITS HISTORY. FOR THE DETAILS WE TURN NOW TO ED LUDLOW, HOST OF BLOOMBERG TECH WHO IS LIVE ON APPLE'S CAMPUS IN CALIFORNIA. TALK TO US ABOUT THIS REDESIGN. HOW DRAMATIC IS IT? ED: AS YOU SAID, APPLE WOULD POSITION THIS AS THE MOST DRAMATIC REDESIGN IN ITS HISTORY BUT AT THE END OF THE DAY IT IS JUST A NEW INTERFACE FOR ITS OPERATING SYSTEMS ACROSS THE FULL SUITE OF HARDWARE PRODUCTS IT OFFERS. IT IS INTERESTING TO HEAR THAT CLIP BECAUSE THAT'S BEEN THE STORY SO FAR IN 2025. APPLE IS DOWN 19% SO FAR IN THE YEAR AND TRAILING SOME OF THEIR PEERS BUT ALL OF THAT TRADING WAS BASICALLY FOCUSED AROUND TRADE RISK. THE TARIFF RISK AND THE SUPPLY CHAIN RISK THAT THE PRESIDENT HAS BEEN ALLUDING TO BUT SOMETHING VERY SHORTLY AFTER 1:00 P.M. EASTERN HAPPENED THAT REFRAMED THIS ABOUT AI. APPLE EXECUTIVE SAID WE HAVE NOTHING TO SAY ABOUT SIRI RIGHT NOW. IT IS JUST A VERY INTERESTING FOCUS OF THE MOMENTUM SHIFTS. WE GOT A LOT ON THE SOFTWARE SIDE BUT NOT ON THE AI SIDE AND THAT IS IN LINE WITH WHAT WE WERE EXPECTING. JOE: YOU JUST ANSWERED MY QUESTION I THINK WHICH IS WHO IS ASKING FOR THE REFRESH? EVERYONE IS ASKING ABOUT AI. WITH REGARD TO WHAT WE JUST HEARD FROM TRUMP, DO WE HAVE ANY INDICATION THAT APPLE PLANS TO MOVE ANY SUPPLY CHAINS OR WILL THE COMPANY EAT THE TARIFF? ED: IT IS NEAR IMPOSSIBLE TO ANSWER. TO GET A REAL SENSE OF THE SUPPLY CHAIN FOR ANY OF APPLE'S HARDWARE AND NOT JUST THE IPHONE, YOU HAVE TO PUT YOURSELF INTO MAINLAND CHINA AND STAND OUTSIDE OF THE FOXCONN FACILITY. FOXCONN ASSEMBLES THE FINAL IPHONE PRODUCTS. YOU HAVE THE ASSEMBLY PLANT AND ADJACENT TO IT, YOU HAVE ALL OF THE CRITICAL COMPONENT SUPPLIERS. TIM SAID IN 2017, AND CHINA YOU COULD FILL A SPORTS STADIUM WITH ALL OF THE SPECIALISTS AND ENGINEERS PART OF THAT PROCESS. IN AMERICA YOU COULDN'T EVEN FILL A MEETING ROOM WITH THE NUMBER OF SPECIALISTS WE HAVE IN THIS COUNTRY SO IT SEEMS DISTANT AND EVEN THE COSTS IS INCALCULABLE AT THIS STAGE, WHICH IS WHY THEY ARE FOCUSED ON MAKING THEIR SOFTWARE MORE COMPETITIVE, TO KEEP THIS PLACE IN THIS MARKET. KAILEY: WHEN WE ARE CONSIDERING THEIR PLACE IN THE MARKET, WHAT KIND OF DEMAND ENVIRONMENT IS APPLE CONTENDING WITH RIGHT NOW? FOR ALL THE CONVERSATION WE'VE HAD ABOUT TARIFFS RAISING COSTS OR SLOWING DOWN CONSUMPTION, IS APPLE STARTING TO FEEL THAT IN TERMS OF WHAT IS COMING IN? ED: THE THIRD PARTY DATA WOULD SUGGEST NO. SMARTPHONE SHIPMENTS AT LEAST IN THE FIRST CALENDAR QUARTER OF THE YEAR, SOME EVIDENT INTO THE SECOND QUARTER AS WELL WAS STRONG. A COUNTER TO THAT WOULD BE CONSUMERS AND INDEED THE COMPANIES THAT ARE MOVING ACROSS BORDERS DID SO IN ANTICIPATION OF TARIFFS. THEY KNEW THEY WERE COMING BECAUSE PRIOR TO NOVEMBER'S ELECTION, TRUMP TOLD US THEY WOULD COME. IF YOU KNOW THOSE ARE COMING, WHY NOT BUY A HANDSET BEFORE THE TAKE EFFECT? BUT BRING IT BACK TO D.C. AND AT THE END OF THE DAY, APPLE HAS GONE THROUGH PERIODS OF UNCERTAINTY, BOTH POLITICAL AND ECONOMIC BEFORE. IT HAS AN ENTRENCHED POSITION. IT SERVES A PARTICULAR DEMOGRAPHIC OF AND CONNIE'S -- OF ECONOMIES, WHERE THE QUALITY OF THE PRODUCT MATTERS. WHEN YOU ARE SELLING A HANDSET FOR $1000, THAT MORE PREMIUM SEGMENT. THEY WILL HOPE THAT TODAY RESONATED WITH THAT BUYER IRRESPECTIVE OF THE MACROENVIRONMENT WE FACE. JOE: WITH US FROM CUPERTINO, ED LUDLOW. GREAT TO HAVE YOU BACK ON \"BALANCE OF POWER.\" SOME OF THE OTHER STORIES WE ARE FOLLOWING. THE DEPARTMENT OF HEALTH AND HUMAN SERVICES IS RETIRING THE 17 MEMBERS OF A COMMITTEE OF GOVERNMENT TAXING ADVISORS. SECRETARY ROBERT F. KENNEDY, JR. SAYING IN A WALL STREET JOURNAL EDITORIAL QUOTE, A CLEAN SWEEP IS NEEDED TO REESTABLISH PUBLIC CONFIDENCE IN VACCINE SCIENCE. THE GROUP KNOWN AS THE ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES HAS BEEN REVIEWING DATA AND MAKING RECOMMENDATIONS CENTERING ON IMMUNIZATIONS FOR OVER 61 YEARS. TO THE MIDDLE EAST AFTER ISRAEL INTERCEPTED A HUMANITARIAN AID SHIP CARRYING ACTIVIST INCLUDING CREDIT TUMOR. THEY WILL SEND THOSE ONBOARD BACK TO THEIR HOME NATIONS. KAILEY: THE SHIP WAS CARRYING FOOD, BABY FORMULA AND MEDICAL SUPPLIES WHICH WERE CONFISCATED BY ISRAEL, INTERCEPTED 200 KILOMETERS FROM GAZA. JOE: ISRAEL HAS BEEN AT WAR WITH HAMAS SINCE 2023 AND HAS BEEN CONTROLLING THE DELIVERY OF HUMAN TO TEARING ASSISTANCE TO GAZA'S POPULATION. KAILEY: IN SOUTH AMERICA, THE COLOMBIAN PRESIDENT CANDIDATE IS IN CRITICAL CONDITION AFTER AN ASSASSINATION ATTEMPT ON SATURDAY IN WHICH HE WAS SHOT TWICE IN THE HEAD AND ONCE IN THE LEG. JOE: A 15-YEAR-OLD YOUTH ARRESTED IN RELATION TO THAT SHOOTING AND AUTHORITIES ARE TRYING TO ESTABLISH WHO ORDERED THE ATTACK AND WHAT THE MOTIVE WAS. KAILEY: THE ATTACK HAS SPARKED WIDESPREAD CONCERN AND PROTESTS WITH HUNDREDS OF PEOPLE MARCHING PAST THE HOSPITAL WHERE HE IS BEING TREATED, TO SHOW THEIR SUPPORT OF PRESIDENTIAL HOPEFUL. AS WE CONSIDER PROTESTS IN COLUMBIA, WE ARE WATCHING PROTESTS IN LOS ANGELES, SOMETHING THAT WAS DISCUSSED THIS MORNING ON BLOOMBERG RADIO WITH ANDREW CUOMO, THE FRONTRUNNER IN THE NEW YORK MAYORAL PRIMARY AND FORMER GOVERNOR. WE DISCUSSED LOS ANGELES AND THE TRUMP ADMINISTRATION'S RESPONSE. > > LET'S REMEMBER HOW EXTRAORDINARY THESE ISSUES, WHAT IS HAPPENING IN L.A. THIS IS THE EXACT REVERSE OF WHAT NORMALLY HAPPENS. NORMALLY IT IS THE LOCAL GOVERNMENT THAT MAKES THE DECISION ON HOW TO HANDLE AN EMERGENCY AND CALLS ON THE FEDERAL GOVERNMENT. SO A MAYOR OR A GOVERNOR WOULD CALL ON THE FEDERAL GOVERNMENT AND SAY I NEED HELP. PLEASE SEND THE NATIONAL GUARD. OR PLEASE SEND ADDITIONAL FEDERAL HELP. I DON'T BELIEVE THERE'S BEEN A TIME WHERE THE PRESIDENT HAS SENT IN FEDERAL TROOPS -- YOU WOULD HAVE TO GO BACK TO THE 1960'S. PRESIDENT JOHNSON AND WALLACE. THAT IS HOW FAR YOU HAVE TO GO BACK. THIS IS TRUMP BEING TRUMP. THIS IS TRUMP ON THIS ISSUE OF IMMIGRATION, ON MUSCLE, THESE CITIES, THESE DEMOCRATS. THEY ARE FILLED WITH ILLEGALS AND I'M GOING TO COME IN AND I'M GOING TO COME IN HOT AND HEAVY. HE STARTED IN L.A. IT WILL HAPPEN IN NEW YORK. HE KNOWS THE FORMULA. IT HAPPENED IN NEW JERSEY. TOM: IS HIS FORMULA TO GO AFTER YOU? ANDREW: HIS FORMULA IS TO CREATE CHAOS IN THE CITIES, AND HE IS THE VOICE OF LAW AND ORDER AND YOU KNOW CITIES, ALL OF THOSE DEMOCRATS, THAT'S WHERE ALL THOSE ILLEGAL IMMIGRANTS ARE, AND HE'S GOING TO COME IN AND CLEAN UP. THE FLIPSIDE IS OK, CREATE CHAOS IN L.A., NEW YORK, CHICAGO. PRETTY SOON, YOU CREATE CHAOS IN THE NATION AND THAT'S BAD FOR THE ECONOMY. JOE: YOU CAN FIND BLOOMBERG'S CONVERSATION WITH ANDREW CUOMO ONLINE OR ON THE TERMINAL, A DEEP DIVE WITH TOM KEENE AND PAUL SWEENEY. COMING UP, TENSIONS CONTINUE IN LOS ANGELES AS CALIFORNIA SUES THE TRUMP ADMINISTRATION OVER THE DEPLOYMENT OF THE NATIONAL GUARD AND NOW THE MARINE CORPS. WE WILL CONTINUE THE DISCUSSION WITH OUR POLITICAL PANEL NEXT. ♪ KAILEY: THIS IS \"BALANCE OF POWER.\" WE ARE BACK WITH OUR TOP STORY AS WE ARE NOW IN THE FOURTH DAY OF PROTESTS AGAINST THE ADMINISTRATION IMMIGRATION CRACKDOWN. DEMONSTRATORS FACING OFF WITH LAW ENFORCEMENT. JOE: INCLUDING MORE THAN 2000 NATIONAL GUARD TROOPS. TRUMP DEPLOYED THEM OVER OPPOSITION FROM CALIFORNIA GOVERNOR GAVIN NEWSOM WHO IS NOW DEMANDING THE REMOVAL CALLING IT A QUOTE, SERIOUS BREACH OF STATE SOVEREIGNTY. THE STATE NOW SUING FOR THEIR REMOVAL. THE ADMINISTRATION SENDING ON TOP OF IT ABOUT 700 MARINES TO LOS ANGELES. THE GOVERNOR POSTING ON TWITTER, U.S. MARINES HAVE SERVED HONORABLY ACROSS MULTIPLE WARS IN DEFENSE OF DEMOCRACY, THEY ARE HEROES. THEY SHOULD NOT BE DEPLOYED ON AMERICAN SOIL FACING THEIR OWN COUNTRYMEN TO FILL THE DERANGED FANTASY OF A DICTATORIAL PRESIDENT. HE WRITES THIS IS AN AMERICAN. JOINING US NOW IS RETIRED ARMY COLONEL WAYNE SANDERS. IT IS GREAT TO HAVE YOU WITH US ON \"BALANCE OF POWER.\" ON WHAT GROUNDS CAN THE PRESIDENT DEPLOY NOT NECESSARILY NATIONAL GUARD TROOPS BUT ACTIVE-DUTY U.S. MARINES? WAYNE: UNDER TITLE X, WHICH IS THE ABILITY FOR -- ONE OF THE BIGGEST THINGS THEY CAN DO, THAT IS THE FEDERAL FORCE. THAT IS LOOKING AT THE U.S. MILITARY. IT IS THE DEPARTMENT OF DEFENSE. THE DOD UNDER SECT OF TO BE ABLE TO DEPLOY TROOPS IN THAT CASE. IN THIS SPECIFIC ONE, THERE ARE SEVERAL DIFFERENT TITLES, TITLE 32 WHICH IS THE NATIONAL GUARD PIECE OF IT WHICH NORMALLY UNLESS IT IS FEDERALIZED, NORMALLY IT STAYS UNDERNEATH THE GOVERNOR BUT THIS IS A TITLE X AUTHORITY THAT THE PRESIDENT HAS TO BE ABLE TO DEPLOY, REALLY IN THIS CASE TRYING TO BE ABLE TO USE IT FOR PROTECTION OF FEDERAL FACILITIES AND PERSONNEL. THAT IS REALLY WHERE IT IS. IT IS A SUPPORT ROLE TO LOCAL LAW ENFORCEMENT, TO BE ABLE TO PROVIDE WHATEVER THEY CAN TO BE ABLE TO QUELL ANY CONCERNS THAT MIGHT BE OUT THERE. THAT IS WHAT THEY ARE GOING TO DO. KAILEY: CONSIDERING HOW THIS IN SOME WAYS IS A DEPARTURE FROM THE TYPICAL ROLE THESE SERVICE MEMBERS ARE USED TO BEING IN, IS THIS SOMETHING THEY RECEIVE TRAINING FOR? WAYNE: IN SOME ASPECTS, YES. IF YOU LOOK AT THE WAY SOLDIERS AND MARINES ARE TRAINED FOR COUNTERINSURGENCY OPERATIONS, A LOT OF FOLKS HAVE EXPERIENCE BASED OFF OF THAT. NO MATTER WHAT MEMBER OF THE MILITARY YOU ARE AS YOU LOOK AT THINGS INSIDE THE RULES OF ENGAGEMENT, YOU ALSO LOOK AT THINGS LIKE ESCALATION OF FORCE. BASED OFF OF THAT, THIS IS ONE OF THOSE AREAS WHERE YOU WILL SEE THAT TRAINING THEY HAVE IS SPECIFICALLY GOING TO BE FAIRLY RESTRICTIVE IN TERMS OF WHAT THEY SHOULD BE DOING. THEY ARE ALSO GOING TO BE IN A SUPPORT ROLE FIRST AND FOREMOST. THAT TRAINING THEY HAVE IS STILL GOING TO BE BASED OFF OF YOU DON'T MAKE A MOVE UNLESS SOMEONE ELSE MAKES THAT MOVE. YOU ARE HERE UNDER SPECIFIC AUTHORITIES WHICH THEY WILL BE GRANTED. THEY WILL BE GOING OVER AND TRAINING ON ALL OF THOSE THINGS LIKE THE SEPARATION OF THE TITLES FROM TITLE 32 FOR THE STATE SPONSOR FOR THE NATIONAL GUARD, TITLE 18 FOR LOCAL LAW ENFORCEMENT. THESE ARE THE THINGS THAT THEY ARE TRAINED TO BE ABLE TO DO. KAILEY: -- JOE: WHEN YOU TALK ABOUT TITLE X, IT ALLOWS FOR THE FEDERAL DEPLOYMENT OF TROOPS IN THIS CASE IF THERE IS A REBELLION OR DANGER OF REBELLION AGAINST THE AUTHORITY OF THE GOVERNMENT OF THE UNITED STATES. I'M NOT SURE HOW WE ARE QUALIFYING REBELLION HERE BUT STEPHEN MILLER CALLED THIS AN INSURRECTION AGAINST THE LAWS AND SOVEREIGNTY OF THE U.S.. WHEN PRESIDENT TRUMP WAS ASKED TODAY, HE SAID HE DIDN'T THINK IT WAS AN INSURRECTION, SO HOW CAN ANY OF THIS STAND UP IN COURT? WAYNE: IF YOU ARE TRYING TO USE THE MARINES, TRYING TO USE THE TITLE X TO GO OUT AND DO ARRESTS WHICH THEY ARE NOT ASKING THEM TO DO IT THIS TIME, THAT WOULD HAVE TO CALL UPON THE INSURRECTION ACT ITSELF. THAT HAS NOT HAPPENED YET, SO IT IS STILL BELOW THAT LEVEL, SO I THINK A LOT OF THE TYPES OF ARRESTS THAT WOULD TAKE PLACE WOULD HAVE TO BE DONE UNDER LOCAL LAW ENFORCEMENT, UNDER TITLE 18 OR NATIONAL GUARD. THOSE OF THE PIECES THAT ARE ALREADY OUT THERE. BUT THE INSURRECTION ACT IS THE ONE KEY PIECE THAT WOULD CAUSE IT TO GO BEYOND THAT AND IT HASN'T MET THAT YET. KAILEY: FINALLY, IF YOU WERE IN COMMAND AND SENDING U.S. MARINES INTO THIS SITUATION, IS THERE A RISK TO THE SAFETY OF THE ADMINISTRATION SAYING THIS BECAUSE PROTESTERS ARE VIOLENTLY ? WHAT HAPPENS IF A U.S. MARINE IS CONFRONTED BY SOMEONE WHO MAY NOT BE EQUIPPED WITH THE KIND OF WEAPONRY OR SKILLS THAT THAT MARINE HAS? WAYNE: ONE OF THE BIGGEST THINGS THAT EVERY U.S. MILITARY MEMBER HAS ALWAYS SAID IS YOU ALWAYS HAVE THE RIGHT TO SELF-DEFENSE. YOU WILL NOT ALLOW SOMEONE TO THROW SOMETHING AT YOU, WHATEVER, THAT WOULD PUT YOUR LIFE IN DANGER BUT ONE THING EVERYONE IS TRAINED ON IS WHATEVER THE LOWEST LEVEL OF FORCE TO QUELL THE SITUATION IS WHAT THEY WOULD BE GOING FOR. AS A PREVIOUS COMMANDER, IF I WAS IN THAT SITUATION, THERE ARE TWO THINGS I WOULD REMIND EVERYONE. WE ARE HERE TO SUPPORT LOCAL LAW ENFORCEMENT. OUR GOAL IS TO REDUCE TENSIONS. SECOND IS TO LEAVE YOUR PERSONAL FEELINGS AT HOME. THESE ARE HUMAN BEINGS AND WE ARE HERE TO PROTECT EVERYONE. THE CITIZENS IN L.A. MAY BE ANGRY BUT NEVER FORGET WHO YOU ARE AND WHO YOU REPRESENT. YOU REPRESENT THE UNITED STATES MILITARY AND IN THIS CASE THE MARINE CORPS AND HOW YOU ACT WILL ECHO THROUGH HISTORY IF YOU ARE NOT CAREFUL. THESE ARE THINGS THAT I BELIEVE THAT THEY WOULD TRAIN FOR, THIS IS WHAT THEY WOULD PREPARE FOR BEFORE BEING PUT IN PROTECTION OF A BUILDING. JOE: GOOD TO HAVE YOU WITH US, WAYNE, PART OF THE GREAT TEAM AT NUMBER INTELLIGENCE. AS WE ASSEMBLE OUR POLITICAL PANEL FOR THEIR REACTION. LESTER MUNSON IS HERE, MANAGING DIRECTOR OF THE INTERNATIONAL PRACTICE AT BGR GROUP ALONGSIDE POLITICS CONTRIBUTOR JEANNE SHEEHAN ZAINO. GREAT TO HAVE BOTH OF YOU WITH US. LESTER, YOU HOLD THE -- YOU HEARD THE WHOLE LEGAL ARGUMENT. WHAT THIS MEANS FOR THE COURTS. WHAT ABOUT RAW POLITICS? LESTER: IT IS PLAYING WELL FOR DONALD TRUMP AND ALSO PLAYING WELL FOR GOVERNOR NEWSOM. THEY ARE BOTH ROOTING FOR SOMETHING EVEN MORE DRAMATIC TO HAPPEN EVERY SINGLE DAY. JOE: DOES THAT MAKE YOU WORRY ABOUT WHAT THEY ARE GOING TO DO NEXT? LESTER: THIS IS THE POLITICS WE HAVE TODAY. IT IS PERFORMATIVE. PEOPLE ARE LOOKING FOR EVERY LITTLE THING TO MAKE THE MAJOR POINT TO THEIR CONSTITUENCY. GOVERNOR NEWSOM, IT IS NOT IMPLAUSIBLE HE IS OUR NEXT PRESIDENT. HE SEES THIS AS AN OPPORTUNITY TO TAKE ON THE CURRENT ONE. THEY ARE BOTH USING MACHO LANGUAGE, AND SO ARE THERE MINIONS AND HERE WE GO. KAILEY: SHOULD WE READ THAT AS NEITHER SIDE HAS THE POLITICAL INCENTIVE TO DE-ESCALATE? JEANNE: THEY DON'T SEEM TO AT THIS POINT. THERE IS A DANGER FOR DONALD TRUMP. PEOPLE ARE GLAD HE CLOSED THE BORDERS. THE CBS POLL ON SUNDAY SHOWS ABOUT 54% SUPPORT HIS AGENDA. THEY SUPPORT HIM GOING AFTER CRIMINALS AND REMOVING THEM FROM THE COUNTRY BUT WHEN YOU START REMOVING PEOPLE FROM HOME DEPOT AND BUSBOYS FROM LOCAL RESTAURANTS, GOING AFTER KIDS IN SCHOOL. THAT IS WHEN PEOPLE IN NEIGHBORHOODS START TO SAY THIS IS NOT WHAT WE SIGNED UP FOR. I THINK DONALD TRUMP KNOWS THAT. LET'S NOT FORGET, A COUPLE MONTHS AGO HE WAS ON MEET THE PRESS AND HE SAID THESE PICTURES COULD GET VERY VIOLENT AND VERY UGLY AND THEY MAY NOT PLAY WELL. THAT IS A POLITICAL DANGER FOR DONALD TRUMP BUT I THINK THE REALITY IS THIS DOES NOT SERVE ANYONE FROM THE DEMOCRAT OR REPUBLICAN SIDE. THE ONLY WAY TO SOLVE THE IMMIGRATION CRISIS IS THROUGH CONGRESSIONAL LEGISLATION. IT IS A POX ON BOTH OF THEIR HOUSES. THIS MAN ON MAN IS NOT GOING TO GET US A POLICY WE NEED TO SOLVE THE IMMIGRATION POLICY. JOE: MANY OF THESE ARRESTS THAT WE ARE SEEING PROTESTED WERE BASED ON VIOLENT CRIMINAL HISTORY FROM SOME OF THESE YOUNG MEN. REALIZING THAT THIS LED TO A CASCADE OF EVENTS HERE, GETTING BACK TO THE INITIAL ACTION, WAS THAT THE RIGHT THING TO DO, TO PULL THESE PEOPLE OUT OF WORK AND ARREST THEM? THE PRESIDENT WOULD SAY IT IS PROMISES MADE, PROMISES KEPT. LESTER: WE WILL SEE THAT ON A CASE-BY-CASE BASIS. WE SAW THAT WITH THE EL SALVADOR EXAMPLE. ONE MAN GOING DOWN THERE WHO SHOULD NOT HAVE IN THAT GROUP THAT DEFINED THE ISSUE, ARE WE GOING TO FIND ONE PERSON THAT THEY SHOULD NOT HAVE GONE AFTER AND RECALIBRATE THE NARRATIVE AROUND ALL OF THIS? I THINK OVERALL, PRESIDENT TRUMP IS ON PRETTY GOOD GROUND POLITICALLY TO PURSUE THESE ISSUES. PRESIDENT OBAMA DEPORTED 3 MILLION PEOPLE DURING HIS EIGHT YEARS IN THE WHITE HOUSE SO IT IS NOT UNPRECEDENTED. ON THE OTHER HAND, IF WE ARE SENDING FEDERAL TROOPS TO A SCHOOL AND SUDDENLY THERE IS SOME KID COMING OUT WHO LOOKS VERY SYNTHETIC, THAT COULD CHANGE THE DYNAMIC IN A HEARTBEAT AND I THINK AGAIN, WE ARE SEEING BOTH TRUMP AND NEWSOME AND OTHER FOLKS TRYING TO POSITION THEMSELVES TO USE THIS CONTROVERSY TO MAXIMUM POLITICAL ADVANTAGE. KAILEY: DOESN'T THAT COUNT FOR THE PRESIDENT'S LEGISLATIVE AGENDA? ADMINISTRATION OFFICIALS ACROSS THE BOARD SAY THE BIG BILL ADDS ICE AGENTS, CUSTOMS AGENTS, BORDER PATROL. LESTER: I NOTICE WE ARE NOT TALKING ABOUT ELON MUSK ANYMORE. HE'S BEEN OFF THE NEWS FOR A LITTLE BIT. WE CAN KIND OF GET BACK TO SOME OF THE ISSUES THAT ARE MORE BENEFICIAL TO PRESIDENT TRUMP. HE POLLS VERY WELL ON IMMIGRATION. JOE: LOOK AT THESE IMAGES ON BLOOMBERG TV. WE HAVE A PRETTY MASSIVE CROWD THAT IS BEGINNING TO GROW IN DOWNTOWN L.A. WE HEARD EARLIER FROM ANDREW CUOMO, WHO ASKED WHAT HAPPENS IF THIS SPILLS INTO THE STREETS OF NEW YORK OR CHICAGO? YOU HAVE AN ANSWER? JEANNE: I DON'T THINK IT IS A MATTER OF IF. IT IS A MATTER OF WHEN. IT WAS SUCH A GOOD INTERVIEW WITH ANDREW CUOMO, TALKING ABOUT THESE ISSUES. DONALD TRUMP PROMISED ON THE CAMPAIGN TRAIL THAT WHETHER THE NATIONAL GUARD WAS REQUEST BY THE GOVERNORS OR NOT, IF PROTESTS BROKE OUT, HE WASN'T IN LINE WITH, HE WOULD SEND THEM IN AND WOULD ALSO SEND IN THE MILITARY. HE IS DOING BOTH OF THOSE THINGS IN L.A. AND THEY WILL DO IT IN OTHER SANCTUARY CITIES INCLUDING CHICAGO, NEW YORK AND OTHERS. THERE IS A HOUSE OVERSIGHT COMMITTEE HEARING ON THURSDAY THAT'S GOING TO BE FASCINATING. IT IS ON SANCTUARY STATES AND THEY HAVE THREE DEMOCRATIC GOVERNORS APPEARING. HOCUL FROM NEW YORK, WALZ FROM MINNESOTA AND -- VERY STRONG OPINIONS ON THIS ISSUE AS LEADERS OF SANCTUARY STATES. KAILEY: WHEN WE CONSIDER THE VOICES OF THOSE DEMOCRATS OR ANY ELECTED DEMOCRAT, HOW COMPLICATED IS THE MESSAGING AROUND THIS? HOW DO YOU SIMULTANEOUSLY CONDEMNED THE VIOLENCE THAT HAS BEEN SEEN WHILE ALSO CONDEMNING THE ADMINISTRATION, KNOWING THAT A MAJORITY OF AMERICANS ARE WITH THE PRESIDENT ON THESE POLICIES? JEANNE: A MAJORITY ARE WITH HIM WHEN IT CUT -- EXCEPT WHEN IT COMES TO TRYING TO REMOVE PEOPLE AND DISRUPT THE LIVES OF PEOPLE WHO HAVE JUST BEEN LIVING. THERE ARE 12 MILLION PLUS PEOPLE IN THIS COUNTRY, MANY OF WHOM CAME SIX -- MANY OF WHOM CAME AS CHILDREN AND ARE PAYING TAXES AND LIVING. THAT IS SOMETHING PEOPLE DO NOT ABIDE BY AND IS NOT SOMETHING THAT THEY THOUGHT PRESIDENT TRUMP WAS GOING TO DO. THAT IS A DANGER FOR THE TRUMP ADMINISTRATION, PURSUING THIS POLICY. WHY ARE THEY PURSUING IT? BECAUSE STEPHEN MILLER SAID 2000 TO 3000 PICKUPS OR DEPORTATIONS TODAY -- A DAY OR WE START FIRING OFFICIALS. THAT IS WHY THEY ARE GOING AFTER LOW HANGING FRUIT, PEOPLE ABIDING BY THE LAW AND CHECKING IN WITH FEDERAL AUTHORITIES AND PAYING TAXES. THIS CAN ALSO HURT OUR ECONOMY. PEOPLE WILL NOT ABIDE BY THAT. DEMOCRATS HAVE TO SAY LAW-ABIDING NONVIOLENT PROTESTS YES, BUT WE DON'T DO WHAT DONALD TRUMP IS DOING AND SEND THE NATIONAL GUARD AND THE MILITARY WITHOUT REQUEST AND WE DON'T ATTACK CHILDREN IN SCHOOLS AND BUSBOYS AND RESTAURANTS THAT ARE WORKING AND PAYING TAXES. JOE: LOOKS LIKE THIS CROWD IN LOS ANGELES IS SHIFTING AS POLICE TRY AND MOVE LINES AROUND. THIS COULD BE ANOTHER BAD NIGHT. IF THIS CONTINUES AND PEOPLE AT HOME ARE WATCHING THESE IMAGES, DO THE POLITICAL LIABILITIES SHIFT? LESTER: I'M NOT SURE THEY DO. SOME OF THE IMAGES FROM THE PROTEST THAT SOME PEOPLE ARE CALLING RIOTS, MAYBE NOT WRONGLY ON OCCASION, ARE PRETTY BAD. YOU'RE SEEING FOLKS THROWING THINGS AT LAW ENFORCEMENT OFFICIALS, ATTACKS ON FEDERAL BUILDINGS. THERE IS MORE THAN A NUGGET OF TRUTH IN THE IDEA THAT SOME OF THIS NEEDS TO BE STOPPED. IT'S GOING TO DEPEND ON THE DETAILS. IF THE WHITE HOUSE TAKES THIS TOO FAR, THEY ARE GOING TO HAVE A RISK BUT IF IT IS TO DEAL WITH VIOLENCE ON THE STREETS OF L.A. OR CHICAGO OR NEW YORK, I THINK THE PRESIDENT WILL BE IN GOOD STEAD BUT IF HE GOES TOO FAR AND IS DEPORTING PEOPLE WHO ARE MORE SOME PATHETIC -- MORE SYMPATHETIC, IT DOES SHIFT. KAILEY: LESTER MUNSON AND JEANNE SHEEHAN ZAINO THANK YOU SO MUCH. THERE IS ALSO THE QUESTION OF HOW THE COURTS COULD FACTOR IN AS GOVERNOR NEWSOM HAS FILED SUIT OVER THE DEPLOYMENT OF NATIONAL GUARD TROOPS AND WE HAVE SEEN COURTS ACT VERY QUICKLY WITH THIS ADMINISTRATION. JOE: WE MAY WELL HAVE HEADLINES ON THIS BEFORE WE MEET AGAIN AND CHECK BACK WITH US TOMORROW. THE WASHINGTON EDITION NEWSLETTER ON THE TERMINAL AND ONLINE. THANKS FOR JOINING US ON \"BALANCE OF POWER.\" THIS IS BLOOMBERG.",
  "medium": "Video",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.98095703125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.91259765625
    },
    {
      "name": "/News/Politics/Campaigns & Elections",
      "score": 0.73876953125
    },
    {
      "name": "/News/Other",
      "score": 0.50146484375
    }
  ],
  "sentiment": {
    "positive": 0.0513916,
    "negative": 0.78027344,
    "neutral": 0.16772461
  },
  "summary": "The situation in Los Angeles has escalated as President Trump and California's Governor Newsom Newsom Spar intensifies tensions. After weekend protests, the state of Los Angeles escalated into clashes with ICE officers following a series of FEDERAL IMMIGRATION RAIDS. The President has sent in 2000 NATIONAL GUERT TROOPS and is now mobilising about 700 ACTIVE-DUTY MARINES to assist with reining in the troops. Meanwhile, Republican lawmakers are meeting with Congressman DARRELL ISSA and Republican National Guard leader ELON MUSK for a fourth day of protests against the ADMINISTRATION's IMMigRation crackdown. The ADMigrration is now looking to carry out massive de-orders and arrest arrests. The U.S. and Chinese leaders have been in talks to resolve key issues, including the removal of the Trump tax bill.",
  "shortSummary": "As tensions rise in LOS Angeles amid escalating tensions over immigration, the BBC's KAILEY reports on the escalating conflict, with President Trump and Newsom facing off.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "22eb19c2b49645cda05b920a94752fc4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Protests in Los Angeles have escalated following federal immigration raids, leading to clashes with law enforcement and the deployment of 2,000 National Guard troops and 700 active-duty Marines by President Trump. California Governor Gavin Newsom has condemned this move as a breach of state sovereignty and is suing the administration for the removal of troops. The situation reflects deepening tensions over immigration policy, with both sides leveraging the unrest for political gain, while concerns grow over the potential for violence and civil rights violations.",
  "argos_id": "DXISQXISJ"
}