{
  "url": "https://www.nytimes.com/live/2025/08/05/us/trump-news/trump-blocked-fema-disaster-prep-funds",
  "authorsByline": "Zach Montague",
  "articleId": "32b0ecf082d2467096b574099f0cdc39",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/images/2025/05/26/multimedia/05trump-news-natural-disasters-grants1/05trump-news-natural-disasters-grants1-mediumSquareAt3X.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-05T11:45:31+00:00",
  "addDate": "2025-08-05T23:53:44.471521+00:00",
  "refreshDate": "2025-08-05T23:53:44.471526+00:00",
  "score": 1.0,
  "title": "A judge blocks FEMA from repurposing disaster mitigation funding.",
  "description": "A federal judge in Massachusetts said the Trump administration’s move to redirect $4 billion left states exposed to damage from natural disasters.",
  "content": "Damaged homes after a tornado tore through Cave City, Ark., in March. Houston Cofield for The New York Times A federal judge in Massachusetts blocked the Trump administration on Tuesday from ending a multibillion-dollar disaster mitigation program, prohibiting funding for the program from being diverted and spent elsewhere until the court can rule on the case’s merits. Judge Richard G. Stearns wrote that a plan to suspend the program, which helps states build safe rooms and shelters and fund flood reduction and wildfire management, among many other mitigation projects, left the states exposed to considerable disaster risk. A coalition of 20 Democratic-led states had sued in response to announcements in April by the Federal Emergency Management Agency that it would repurpose funds previously available to states under the Building Resilient Infrastructure and Communities program. The announcements informed states to prepare to do without more than $4 billion that Congress had set aside for grants, asserting without citing evidence that the program had not “increased the level of hazard mitigation as much as desired.” Since 2000, Congress has allocated billions of dollars in funding to help states prepare for large-scale disasters. According to the states’ complaint, by conservative estimates, every dollar spent on disaster mitigation projects “saves an average of $6 in post-disaster costs.” The program, known as BRIC, was launched in 2020 during President Trump’s first term, replacing the pre-disaster mitigation program that preceded it. FEMA approved around $4.5 billion in grants for nearly 2,000 projects since then, much of it allocated for coastal storm preparedness and other projects connected to threats exacerbated by climate change. But in April, the agency moved to end the program, describing it as “wasteful” and “more concerned with political agendas than helping Americans affected by natural disasters.” Critics of the Trump administration called the move an ideologically driven effort to shutter federal programs that acknowledge climate change. “The BRIC program is designed to protect against natural disasters and save lives,” Judge Stearns wrote. “The potential hardship to the Government, in contrast, is minimal.” In court filings in July, the government denied that it had actually terminated the program or stopped approving grants. But Judge Stearns concluded that the program was clearly in jeopardy, pointing to a June report by FEMA showing that the remaining $4 billion in the BRIC account had been transferred to another pool of general disaster relief funding. “Although the Government equivocates about whether it has, in fact, ended the BRIC program, the States’ evidence of steps taken by FEMA to implement the announced termination portend the conclusion that a determination has in fact been made and that FEMA is inching towards a fait accompli,” Judge Stearns wrote. He nonetheless noted that the agency did not appear to have canceled any grants or denied any requests for extensions so far, and described his decision in granting an injunction as designed to maintain the status quo for now. His order on Wednesday blocked the government from spending the funds allocated to BRIC for “non-BRIC purposes” for the duration of the lawsuit. Still, he stressed that the government remained free to ask that the court release funds for actual disaster relief in the event of an emergency.\n\nThe decision by Attorney General Pam Bondi to investigate the “Russia Hoax” comes at a time of increasing pressure on the Trump administration to produce more information about the F.B.I.’s files on Jeffrey Epstein. Eric Lee for The New York Times President Trump has urged and browbeaten supporters to shift their obsession from the Jeffrey Epstein files to the investigation and potential prosecution of Democratic officials he accuses of persecuting him, a cardinal grievance that bonds him to his base. The Justice Department under Mr. Trump, reeling from the angry backlash over its handling of the Epstein case, is now taking its most concrete — if still murky — investigative steps against Trump targets, starting with officials he blames for what he sees as the plot against him: the investigation of his 2016 campaign’s connections to Russia. Attorney General Pam Bondi this week authorized prosecutors to investigate the inquiry the president calls the “Russia hoax” and present a case to a grand jury in South Florida if the evidence warrants it, according to people briefed on the move who spoke on the condition of anonymity to discuss ongoing investigations. Details are scant, including whether prosecutors have taken action. But Trump appointees are reluctant to present evidence to a grand jury in the District of Columbia where key decisions in the Russia investigation were made nearly a decade ago. They believe it would be nearly impossible to find sympathetic jurors in a courthouse overseen by a federal judge, James E. Boasberg, whom the Trump team regards as an enemy. Fox News on Monday reported that Ms. Bondi had made the order, which comes after a referral from Tulsi Gabbard, the director of national intelligence. A Justice Department spokesman did not immediately respond to a request for comment. The decision to authorize a grand jury investigation, which could include subpoenas, into the statements and testimony by government officials surrounding the 2016 election suggests the Trump administration has begun turning its rhetoric of revenge into action. Still, there are a number of legal and practical hurdles that any such inquiry would have to overcome, chief among them the statute of limitations that would seemingly bar criminal charges based on conduct that is more than five years old. Such concerns, however significant, have been swept aside, at least for now, by the eagerness to appease an impatient president demanding to use the vast powers of federal law enforcement to exact vengeance — and the political imperative of making the Epstein fiasco disappear. Even in the absence of a legal success, such as an indictment or conviction, the effort itself accomplishes political objectives in a department that considers investigations largely intended to name and shame a legitimate use of its authority. Many Trump advisers and allies also view the Russia investigation as a gross abuse of power, while some were personally affected by the inquiry and forced to hire lawyers to defend themselves. Mr. Trump has privately carped about the slow pace of Justice Department action to his political enemies, according to people in his orbit, and made it unmistakably known what he wanted. “Scum” was how Mr. Trump described those who investigated him during a speech in the department’s Great Hall in March, as Ms. Bondi and Todd Blanche, the deputy attorney general, looked on. Mr. Trump described those who investigated him as “scum” during a speech in the Department of Justice’s Great Hall in March. Mr. Trump has repeatedly urged his backers to drop a fierce pressure campaign to release undisclosed Epstein files and rally under the “weaponization” banner. On Tuesday, he told CNBC that he had “nothing” to do with Ms. Bondi’s order — then celebrated the move to investigate Obama administration national security officials, saying “they deserve it.” The decision also comes as the Trump administration faces increasing pressure to produce more information about the F.B.I.’s files on Mr. Epstein, the financier who was awaiting trial on sex-trafficking charges before he hanged himself in a jail cell in 2019. Last month, Mr. Blanche, a former Trump defense lawyer, interviewed Ghislaine Maxwell, Mr. Epstein’s convicted co-conspirator. Law enforcement officials have privately talked about releasing at least some of the information she provided, although they are still discussing the extent of what they will disclose, according to several people familiar with the conversations. The emergence of the grand jury inquiry was unusual in several ways — not least, because its existence was revealed to right-leaning media outlets like Fox News before any actual investigative steps had apparently been taken. Moreover, it remains unclear who the grand jury might investigate and for what, if any, crimes. Thus far, the Justice Department has moved more slowly to scrutinize Biden-era officials who participated in the two unsuccessful criminal prosecutions of Mr. Trump. Last week, an obscure agency that scrutinizes potential misconduct by or against federal employees, the Office of Special Counsel, took a step in that direction, confirming it was investigating Jack Smith, the former federal prosecutor who oversaw the criminal cases against Mr. Trump. The agency is trying to determine if Mr. Smith may have violated the Hatch Act, which bars federal workers from using their government jobs to promote political candidates. It is unclear how that investigation could result in any substantive consequences for Mr. Smith, given that the most severe punishment allowed under the Hatch Act is dismissal, and Mr. Smith resigned his government position many months ago. It is not clear whether Mr. Trump, who is marking his first six months in office, would have pushed quite so forcefully for the department to act against his perceived foes if the Epstein case was not still smoldering political fire. But it has certainly added to the urgency, administration officials said. Politicians and influencers on the right flank of the Republican Party — who have demanded a full accounting of Mr. Epstein’s interactions with wealthy and powerful friends — are equally if not more enthusiastic about deploying the Justice Department, F.B.I., and intelligence services to uncover what they claim to be a vast decade-long, Democratic-led conspiracy to destroy Mr. Trump. A few of Mr. Trump’s key congressional allies and some of the most vocal members of his base have been beating the drums for arrests almost from the moment that the bureau and intelligence officials started releasing documents on the Russia investigation last month. On Monday, Representative Marjorie Taylor Greene, Republican of Georgia, posted a message on social media with a “scorecard” showing that no one had been arrested yet for popular MAGA-world bugbears like the “Russia Collusion Hoax,” “Jan. 6” and the “2020 Election.” “Don’t talk about it if you aren’t going to do it,” Ms. Greene wrote. Among the most fervid Trump supporters calling for arrests are the rioters who were charged in connection with — and then granted clemency for — the storming of the Capitol on Jan. 6, 2021. Many of them have demanded retribution against Mr. Trump’s enemies, citing their own grievances as federally prosecuted defendants. “Dear God, has anyone been arrested yet?” wrote one pardoned rioter, Benjamin Martin, who was initially sentenced to 13 months in prison for holding open a door at the Capitol so that others could spray chemicals at the police. Few of those calling for the investigation have been as maximalist as Mr. Trump himself. He recently wrote on social media that President Obama should be arrested as a traitor for treason. In late July, Ms. Gabbard blindsided Ms. Bondi by referring the investigation of the Russian investigation to the Justice Department, claiming a cache of documents she released proved Obama administration officials engaged in a “treasonous conspiracy.” In response, Ms. Bondi announced the creation of a multiagency “strike force” to investigate the charges. Her subsequent grand jury order was made as part of that process, according to an official briefed on the move. The claims by Trump supporters that Obama-era officials engaged in a far-reaching conspiracy to undermine his 2016 campaign have already been exhaustively investigated by a special counsel, John Durham, with little to show for it. Mr. Durham filed two criminal indictments based on that investigation, one against a private practice lawyer on charges of lying to the F.B.I., and another against a Russia analyst for essentially the same offense. Each case ended in acquittals. A new investigation would face a potentially steeper challenge, relying on the years-old statements and the recollection of senior intelligence and law enforcement officials about an election held nearly nine years ago. But not every investigation of Mr. Trump’s perceived enemies has led to meaningful consequences. In November 2017, Attorney General Jeff Sessions tapped a U.S. attorney in Utah to review a number of issues related to Hillary Clinton, as well as the 2016 election. That effort lasted about two years before quietly ending with no substantive action or public findings.\n\nMembers of ICE arresting a man from Mexico in Miami Beach, Fla., in May. On Tuesday morning, Immigration and Customs Enforcement announced in an internal email that it would offer cash bonuses to agents for deporting people quickly, an incentive meant to motivate the staff to speed up President Trump’s mass deportation campaign. Less than four hours later, the agency abruptly canceled what was supposed to be a 30-day pilot program. “PLEASE DISREGARD,” Liana J. Castano, an official in ICE’s field operations division, said in a follow-up email to agency offices around the country. Tricia McLaughlin, a Department of Homeland Security spokeswoman, said the program had not been enacted, adding that “no such policy is in effect or has ever been in effect.” The email canceling the program was sent shortly after The New York Times inquired about its existence. But the short-lived effort underscored the mounting pressure on ICE to meet Mr. Trump’s aggressive deportation targets. The agency has offered signing bonuses of up to $50,000, promised to hire as many as 10,000 agents and initiated a vigorous recruiting push on social media. The Trump administration is seeking to transform ICE, infusing it with an enthusiasm for the president’s project of carrying out deportations on an unprecedented scale. Under Mr. Trump’s signature domestic policy bill, which he signed into law early last month, ICE’s annual budget will grow from about $8 billion to roughly $28 billion, making it the highest-funded law enforcement agency in the federal government. Stephen Miller, one of Mr. Trump’s top advisers and the architect of his immigration policy, has promoted ICE’s hiring drive in ideological terms. “Want to mass deport illegals from Los Angeles?” he wrote on social media last week. “JOIN.ICE.GOV today and get a 50K signing/retention bonus. Make your family proud and be the hero America needs.” Last week, the agency said it had issued more than 1,000 tentative job offers. The bonus program that ended on Tuesday almost as quickly as it began had been described as a 30-day pilot, according to documents reviewed by The Times. Under its terms, ICE would hand out $200 bonuses for each immigrant deported within seven days of being arrested and $100 for those deported within two weeks, according to an initial memo signed by Ms. Castano that was sent to the directors and deputy directors of ICE’s field offices across the country. It was meant to motivate officers to reduce a backlog of people awaiting deportation, “reducing overall removal costs and decreasing strain” on the agency’s detention resources, the memo stated. To “maximize” their bonuses, the memo instructed ICE agents to deport eligible immigrants through a fast-track process known as expedited removal, which allows immigrants without legal status to be deported without court proceedings. It also said that agents could offer detainees the option of leaving the country voluntarily. Ms. Castano did not immediately respond to a request for comment. Efforts to speed the pace of deportations — like the bonus program — could endanger the due process rights of immigrants by encouraging ICE agents to cut corners, immigration experts and former government officials said. “That is so ungodly unethical,” said Scott Shuchart, a former senior homeland security official. “You can’t incentivize government agents to short circuit people’s procedural rights. Would you pay a bonus to judges for wrapping up trials faster?” Kathleen Bush-Joseph, a policy analyst at the Migration Policy Institute, said the incident appeared to reflect how quickly ICE was moving to meet Mr. Trump’s goals. “They’re willing to try so many different things to see what sticks,” she said. ICE has already sped up deportations, according to a New York Times analysis of ICE data obtained via the Deportation Data Project. The share of people booked into ICE detention who were deported within 14 days increased to 30 percent in May, from 21 percent in January, the analysis showed. And the number of deportations by ICE reached a new high in July, averaging almost 1,300 daily removals in the two weeks ending July 26. Removals averaged fewer than 800 per day in the last year of the Biden administration.\n\nThe National Institutes of Health headquarters in Bethesda, Md. Michael A. McCoy for The New York Times The Trump administration broke the law when it terminated about 1,800 grants and interrupted funding for the National Institutes of Health, a federal watchdog said on Tuesday. It was the fifth time that the Government Accountability Office, a nonpartisan legislative agency, faulted President Trump and his top aides for rearranging the budget in defiance of Congress. From February to June, investigators estimated, the N.I.H. awarded $8 billion less for research and other grants than it had a year earlier. The findings underscored the real stakes in the growing clash between the Trump administration and Congress over the power of the purse. Since returning to office, Mr. Trump has adopted an expansive view of his authority to recalibrate the federal ledger as he sees fit, even though the Constitution gives lawmakers the power to tax and spend. In recent weeks, Democrats and Republicans alike had expressed discomfort over the ways in which Mr. Trump’s budgetary maneuvers may have affected vital public health research into cancer and other diseases. Some in Congress have also objected to the severe budget cuts that the president has proposed for the N.I.H. and other major health and research agencies next year. The Trump administration on Tuesday defended some of its actions, releasing a letter that described elements of the funding delay as part of the “transition” between presidents. Officials did not respond on Tuesday to more detailed questions about canceled grants. Some congressional lawmakers have also pressed the administration about more recent interruptions to N.I.H. funds. Russell T. Vought, the director of the White House Office of Management and Budget, previously acknowledged that the administration had conducted a “review” into N.I.H. spending. He also faulted the health agency for what he described as years of “waste” while claiming it had been “weaponized against the American people.” “We have an agency that needs dramatic overhaul,” Mr. Vought added in an interview with CBS’s “Face the Nation” in July. “Thankfully, we have a great new head of it, but we’re going to have to go line by line to make sure the N.I.H. is funded properly.” The trouble began soon after Mr. Trump took office when he signed a slew of executive orders meant to halt federal spending on diversity, equity and inclusion. The cuts deeply affected health programs, including the N.I.H., the largest source of biomedical funding in the United States, which canceled more than 1,800 grants between February and June, the Government Accountability Office found. For about two months, the N.I.H. also ceased publishing notices for grant reviews. That interrupted a key step in the federal award process, which delayed the delivery of public health funds to hospitals, laboratories, universities and other research organizations, according to congressional investigators. In a letter shared with The New York Times, officials at the Department of Health and Human Services told the watchdog that they had “moved rapidly to reschedule and hold meetings impacted by the short pause, and to process grant applications.” But ethics officials concluded on Tuesday that the Trump administration had violated federal law, which prohibits the president from withholding authorized money, a practice known as impoundment. The office said it was also “aware” of more recent reports that White House officials had asked the health agency to “pause the issuing of grants, research contracts and training,” and “later reversed” that decision. But the watchdog said it could not confirm that money had resumed flowing, as even some Republican lawmakers had requested in recent days. Top Democratic lawmakers immediately urged the White House to cease interrupting the flow of money at the N.I.H. and other research agencies, warning that the administration was threatening to undermine work on new cures and emerging diseases. “Cutting off investments Congress has made into research that saves millions of lives is as backward and as inexcusable as it gets,” said Senator Patty Murray of Washington, the top Democrat on the Senate Appropriations Committee. The accountability office has opened 40 similar investigations to determine if the Trump administration has impounded funds, The Times previously reported. Earlier, the watchdog concluded that administration officials had wrongly interrupted approved money for programs ranging from early childhood education to electric vehicle charging stations. The White House has strenuously denied those charges. It has also sharply attacked the accountability office, while signaling that the administration would cease cooperating with some of its investigations. The office has the power to sue to force the release of impounded funds, and recently has retained legal counsel in case it needs to take such rare action. But Gene Dodaro, the comptroller general in charge of the watchdog, previously said in an interview that filing lawsuits would be a last resort.\n\nThe House Oversight Committee issues subpoenas for the Epstein files. Several Republicans joined Democrats to force a House committee to issue a subpoena to the Justice Department for the Epstein files. Michael A. McCoy for The New York Times The House Oversight Committee issued a subpoena on Tuesday to the Justice Department for its files related to Jeffrey Epstein, the disgraced financier who died in federal prison awaiting trial on sex-trafficking charges, and Ghislaine Maxwell, his longtime associate. The Republican-run committee also sent subpoenas to 10 former Democratic and Republican government officials it said it was seeking to depose in relation to Mr. Epstein and Ms. Maxwell, who is serving a 20-year sentence for sex trafficking and other crimes. The move comes as the battle over the Epstein investigation and the Republican rift it ripped open continues to loom over the House during its five-week recess that Speaker Mike Johnson began a day earlier than scheduled. Representative James R. Comer of Kentucky, the committee’s Republican chairman, requested that the documents be delivered by Aug. 19. He was required to issue the 11 subpoenas after Democrats forced a vote on the matter in a key House subcommittee last month. Should the Justice Department fail to meet that deadline, it could set up a high-profile clash between the Trump administration and Congress over an issue that has sharply divided Republicans and effectively paralyzed the House. A spokesman for the Justice Department said it had received the subpoena, but he declined to comment further. The Trump administration’s decision to close its investigation into Mr. Epstein without releasing additional files, a reversal from previous promises, has widened a rift in the Republican Party. Many lawmakers now find themselves positioned between far-right constituents who are eager for the release of the files and President Trump, who after years of questioning the legitimacy of government institutions has urged his supporters to move on from the investigation. Democrats have seized on the disagreement. Their move to require Mr. Comer to issue a subpoena was one of several efforts by lawmakers to force Republicans to record politically tricky votes on the matter. “Today was an important step forward in our fight for transparency regarding the Epstein files and our dedication to seeking justice for the victims,” Representatives Robert Garcia of California and Summer Lee of Pennsylvania, the Democrats who led the push for the subpoena, said in a statement on Tuesday. “Now, we must continue putting pressure on the Department of Justice until we actually receive every document.” Three Republicans broke from Mr. Trump to back the subpoena for the Epstein files. But they also expanded the request to include subpoenas for prominent figures who held their positions during the lengthy investigation into Mr. Epstein and have frequently been targets of the president. They included former President Bill Clinton, who was acquainted with Mr. Epstein, and Hillary Clinton, the former secretary of state who ran for president against Mr. Trump in 2016. The Oversight Committee also issued subpoenas to Robert S. Mueller III, the special counsel who investigated Russian interference in the 2016 election, and James B. Comey, the former F.B.I. director. Both men have been frequent targets of Mr. Trump’s broadsides. The committee also sent subpoenas to former attorneys general who were overseeing the Justice Department when it was grappling with legal matters related to Mr. Epstein. The officials, who served under Democratic and Republican presidents: Merrick B. Garland, who was President Joseph R. Biden Jr.’s attorney general; William P. Barr and Jeff Sessions, who were both appointed by Mr. Trump during his first term; Loretta Lynch and Eric H. Holder Jr., who were appointed by President Barack Obama; and Alberto R. Gonzales, who served under President George W. Bush.\n\nTrump says Treasury’s Bessent rules out replacing Powell as the Fed chair. President Trump said Treasury Secretary Scott Bessent doesn’t want to run the Federal Reserve. President Trump said on Tuesday that Treasury Secretary Scott Bessent has told him he does not want to be Federal Reserve chair, taking him off the shortlist of contenders to replace Jerome Powell. Mr. Trump said that has narrowed his list of replacements to four people, a group that includes a former Fed governor, Kevin Warsh, and the director of the White House National Economic Council, Kevin Hassett. Mr. Trump said Mr. Bessent had told him as recently as Monday that he did not want the job. “I love Scott, but he wants to stay where he is,” Mr. Trump said in an interview with CNBC. “I’ll take him off, because I asked him just last night, ‘Is this something you want?’ ‘Nope, I want to stay where I am.’” Mr. Trump has relentlessly criticized Mr. Powell for not lowering interest rates according to the president’s demands, but he has repeatedly backed away from trying to remove him before his term as chair expires in May 2026. Pressed on the names of other candidates who might serve as a replacement, Mr. Trump confirmed only that Mr. Warsh and Mr. Hassett were leading contenders. “I think the two Kevins are doing well,” Mr. Trump said. “And I have two other people who are doing well.” His caution may be a reflection of his persistent unhappiness with Mr. Powell, whom he nominated to lead the Federal Reserve in 2017. “Sometimes they’re all very good until you put ’em in there, and then they don’t do so good,” Mr. Trump said. Mr. Trump said he would make a decision on a replacement for Mr. Powell “soon.” One option, he said, was to initially place his choice on the Federal Reserve Board as a replacement for Adriana D. Kugler, who announced suddenly that she would step down this week from her position as a governor. Her term was set to expire in January, but her early resignation gives Mr. Trump an opportunity to more quickly appoint someone who could eventually replace Mr. Powell as chair.\n\nTrump airs his personal financial grievances ahead of a ‘debanking’ crackdown. President Trump at the White House last week. President Trump said on Tuesday that he was a victim of discrimination by two of the nation’s largest banks, and suggested that his personal experience was fueling his animus with Wall Street. Mr. Trump, in an interview on CNBC, said both JPMorgan Chase — the nation’s largest bank — and Bank of America refused to accept more than $1 billion in deposits from the Trump Organization after his first term. He said he had made personal appeals to the chief executives of both banks but had been rejected. “The banks discriminated against me very badly,” Mr. Trump said. Mr. Trump’s remarks couldn’t immediately be confirmed. A JPMorgan spokesman did not address Mr. Trump’s charge, instead sending a statement saying the bank would not comment on clients. Bank of America declined to comment. The Trump Organization earlier sued Capital One for closing its accounts in the wake of the Jan 6., 2021, attack on the Capitol. The president’s commentary on Tuesday carries significant weight on Wall Street because his administration has been preparing a crackdown, in the form of an executive order and other proposed regulatory changes, on so-called debanking practices. Many right-leaning organizations have claimed that the financial system has locked them out because of their political positions. Bank executives and lobbying groups have broadly pushed back against that assertion, although they have said that beginning with the Obama administration — and during Mr. Trump’s first term — regulators required them to apply close scrutiny to certain categories of deposits, including payday lenders and gun-related businesses. Mr. Trump, asked during the CNBC interview if he would sign an executive order on debanking, did not explicitly comment on his plans. Rather, he responded by describing his company’s experience with Chase and Bank of America. He said that after his first term, the Trump Organization was given 20 days to withdraw more than $1 billion from Chase. He said he had appealed directly to JPMorgan’s chief executive, Jamie Dimon. “You could ask him,” Mr. Trump said. “Maybe he’s not going to admit it.” Asked about Mr. Trump’s statement, the JPMorgan spokesman said that as a rule the bank did not close accounts for political reasons. After his Chase accounts were closed, Mr. Trump said, he tried Bank of America. That bank’s chief executive, Brian Moynihan, “was kissing my ass when I was president,” but wouldn’t accept the deposits after his first term ended, Mr. Trump said. Eventually, the Trump Organization spread its money across a number of smaller banks, Mr. Trump said. “$10 million here, $10 million there,” he said. “It’s lucky I even had them. They were doing me a favor.”\n\nRwanda agrees to accept 250 migrants as part of Trump’s deportation plan. President Trump with Foreign Minister Olivier Nduhungirehe of Rwanda in the Oval Office in June. Pete Marovich for The New York Times Rwanda has agreed to accept 250 deportees from the United States, a Rwandan government spokeswoman said on Tuesday, making the east African nation the latest country to work with the Trump administration as it seeks to expel tens of thousands of migrants in American custody. “Rwanda has agreed with the United States to accept up to 250 migrants, in part because nearly every Rwandan family has experienced the hardships of displacement,” said the government spokesman, Yolande Makolo. Rwanda isn’t the only African nation to strike a deal with the United States to accept deportees. In July, the U.S. Supreme Court approved the deportation of eight men to South Sudan. The kingdom of Eswatini also accepted five deportees from the United States that same month, though it soon announced plans to repatriate them to their home countries. Unlike Eswatini, Rwanda said it planned to integrate the deportees. They will be resettled and provided with job training, health care and places to stay in order to “jump start their lives in Rwanda,” Ms. Makolo said. She said Rwanda had approval power over which U.S. deportees to accept. In April, the Trump administration paid Rwanda $100,000 to take an Iraqi man, according to a U.S. cable. Talks about Rwanda’s accepting more migrants began as early as May, Rwanda’s foreign minister, Olivier Nduhungirehe, told Rwanda TV, the state broadcaster. The plan, reported earlier on Tuesday by Reuters, is reminiscent of a failed migrant deal struck between Britain and Rwanda. In 2022, Britain signed an agreement to resettle asylum seekers in Rwanda, and then spent years and hundreds of millions of pounds in futile attempts to make it happen. The British government said it would look into recovering the money, but Rwandan officials said they were not required to pay it back. Rwanda once also accepted deportees from Israel for years under a secretive 2013 deal. A British court found that Rwanda had quietly moved those asylum seekers out of the country. The small, landlocked country earned a reputation as an example of recovery and resilience after a 1994 genocide that left about 800,000 people dead. But more recently, critics have called its human rights record into question.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/by/alan-rappeport",
    "https://www.reuters.com/legal/litigation/trump-administration-formally-axe-elon-musks-five-things-email-2025-08-05/",
    "https://www.nytimes.com/2025/02/28/us/politics/federal-workers-email.html",
    "https://www.nytimes.com/2025/05/22/us/politics/trump-federal-funds-gao.html",
    "https://www.ice.gov/news/releases/ice-issues-over-1000-tentative-job-offers-shore-agencys-enforcement-efforts",
    "https://www.nytimes.com/2025/07/28/business/media/trump-rupert-murdoch-libel-epstein.html",
    "https://www.nytimes.com/by/tony-romm",
    "https://storage.courtlistener.com/recap/gov.uscourts.mad.286918/gov.uscourts.mad.286918.1.0.pdf",
    "https://www.nytimes.com/by/zach-montague",
    "https://www.nytimes.com/by/eileen-sullivan",
    "https://www.reuters.com/world/us/trump-accuses-obama-treason-escalating-attacks-over-2016-russia-probe-2025-07-23/",
    "https://www.nytimes.com/2025/05/21/us/politics/trump-justice-department-ed-martin-weaponization.html",
    "https://www.nytimes.com/2025/08/01/business/economy/fed-governor-kugler-resigns-trump.html",
    "https://www.nytimes.com/article/jeffrey-epstein-files-trump.html",
    "https://www.nytimes.com/2025/07/23/us/politics/trump-head-start-government-accountability-office.html",
    "https://www.nytimes.com/2025/03/14/us/politics/trump-speech-justice-department.html",
    "https://www.nytimes.com/2025/07/23/us/politics/epstein-trump-republicans.html",
    "https://www.nytimes.com/by/eve-sampson",
    "https://www.nytimes.com/2025/07/07/us/politics/trump-administration-jeffrey-epstein-client-list-suicide.html",
    "https://x.com/StephenM/status/1951652465281011850",
    "http://cbsnews.com/news/russ-vought-office-of-management-and-budget-face-the-nation-07-27-2025/",
    "https://www.nytimes.com/2025/08/02/us/politics/jack-smith-osc-trump.html",
    "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html",
    "https://www.nytimes.com/by/hamed-aleaziz",
    "https://www.c-span.org/clip/white-house-event/president-trump-calls-doj-outreach-to-ghislaine-maxwell-appropriate-accuses-obama-of-treason/5168316",
    "https://t.co/V85TxpXaTG",
    "https://www.nytimes.com/by/nicholas-nehamas",
    "https://www.youtube.com/live/xQN8_PFNt7M",
    "https://www.nytimes.com/2024/07/22/world/europe/uk-rwanda-deportation-plan.html",
    "https://www.nytimes.com/2025/01/21/us/politics/trump-deportations-immigration.html",
    "https://www.nytimes.com/2025/07/22/us/politics/trump-spending-government-accountability-office.html",
    "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations-source",
    "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html",
    "https://www.politifact.com/factchecks/2025/jul/11/jon-favreau/ICE-FBI-bill-Donald-Trump-largest/",
    "https://www.nytimes.com/by/katie-robertson",
    "https://www.nytimes.com/by/michael-gold",
    "https://www.nytimes.com/2025/06/25/us/politics/trump-immigrants-deportations.html",
    "https://www.gao.gov/products/b-337203",
    "https://x.com/OneRealPOV/status/1952417538790572170",
    "https://www.nytimes.com/2025/05/05/us/politics/trump-immigrant-deportation-payments.html",
    "https://www.nytimes.com/2022/06/24/world/africa/rwanda-commonwealth-human-rights.html",
    "https://www.nytimes.com/2025/07/15/us/politics/trump-deportation-flights-eswatini.html",
    "https://www.nytimes.com/by/glenn-thrush",
    "https://www.nytimes.com/2025/05/07/world/europe/trump-migrants-rwanda-us-uk.html",
    "https://x.com/mtgreenee/status/1952339589881860535?s=51&t=fPtHymA_LwUFKhdSgZcFsw",
    "https://www.nytimes.com/2025/07/23/us/politics/house-subpoena-justice-dept-epstein-files.html",
    "https://www.fema.gov/sites/default/files/documents/fema_ocfo_june-2025-disaster-relief-fund-report_06302025.pdf?utm_source=chatgpt.com",
    "https://www.nytimes.com/2025/07/16/us/politics/trump-lawsuit-fema-disaster-funding.html",
    "https://www.nytimes.com/2025/05/15/business/trump-debanking-crypto.html",
    "https://www.nytimes.com/2025/07/16/world/africa/eswatini-trump-migrants-deportation.html",
    "https://www.nytimes.com/2025/07/24/us/politics/trump-obama-gabbard-bondi.html",
    "https://www.nytimes.com/by/rob-copeland",
    "https://storage.courtlistener.com/recap/gov.uscourts.mad.286918/gov.uscourts.mad.286918.59.0.pdf",
    "https://www.nytimes.com/2024/07/10/world/africa/rwanda-plan-uk-migrants-money.html",
    "https://www.nytimes.com/by/devlin-barrett",
    "https://www.nytimes.com/2025/07/23/us/politics/trump-russia-obama-gabbard.html",
    "https://www.nytimes.com/2025/03/07/us/politics/trump-organization-capital-one-lawsuit.html",
    "https://www.nytimes.com/by/alan-feuer",
    "https://storage.courtlistener.com/recap/gov.uscourts.mad.286918/gov.uscourts.mad.286918.79.0.pdf",
    "https://www.nytimes.com/2025/07/18/business/media/trump-sues-wall-street-journal-epstein.html"
  ],
  "labels": [
    {
      "name": "Feed"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Mr. Trump",
      "weight": 0.080814086
    },
    {
      "name": "President Trump",
      "weight": 0.066919155
    },
    {
      "name": "Mr. Epstein",
      "weight": 0.06521211
    },
    {
      "name": "Trump",
      "weight": 0.06331521
    },
    {
      "name": "Trump supporters",
      "weight": 0.062096477
    },
    {
      "name": "Trump targets",
      "weight": 0.06146508
    },
    {
      "name": "Trump appointees",
      "weight": 0.060334217
    },
    {
      "name": "Many Trump advisers",
      "weight": 0.05962547
    },
    {
      "name": "Mr. Powell",
      "weight": 0.05781581
    },
    {
      "name": "Mr. Smith",
      "weight": 0.057228517
    }
  ],
  "topics": [
    {
      "name": "FEMA"
    },
    {
      "name": "Environment-ESG"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    },
    {
      "name": "Environment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.97802734375
    },
    {
      "name": "/Sensitive Subjects/Accidents & Disasters",
      "score": 0.91259765625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.85546875
    },
    {
      "name": "/News/Local News",
      "score": 0.58837890625
    },
    {
      "name": "/Law & Government/Public Safety/Emergency Services",
      "score": 0.465576171875
    },
    {
      "name": "/Law & Government/Government/Courts & Judiciary",
      "score": 0.395751953125
    }
  ],
  "sentiment": {
    "positive": 0.046539307,
    "negative": 0.7558594,
    "neutral": 0.19799805
  },
  "summary": "A federal judge in Massachusetts has blocked the Trump administration from ending a multibillion-dollar disaster mitigation program, the Building Resilient Infrastructure and Communities program, by stopping it from being diverted and spent elsewhere until the court can rule on the case's merits. The program, which helps states build safe rooms and shelters, funds flood reduction and wildfire management, was launched in 2020 and was replaced by the pre-disaster mitigation program that preceded it. A coalition of 20 Democratic-led states had sued after FEMA announced it would repurpose funds previously available to states under the program. Critics of the Trump Administration have accused the move as an attempt to shut federal programs that acknowledge climate change. Judge Richard G. Stearns concluded that the program was clearly in jeopardy, noting that FEMA had transferred $4 billion from the BRIC account to another pool of general disaster relief funding. However, he also allowed the government to use funds allocated to BRIC for non-BRIC purposes for the duration of the lawsuit.",
  "shortSummary": "A federal judge blocked the Trump administration from disusing disaster mitigation funds, citing safety concerns and political agendas.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "fc8b6d3babb148c283642bfa48ec21bd",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.youtube.com/live/xQN8_PFNt7M",
      "text": "- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\n- Svenska\n- Deutsch\n- English\n- Español\n- Français\n- Italiano\n- Alla språk\n- Afrikaans\n- azərbaycan\n- bosanski\n- català\n- Čeština\n- Cymraeg\n- Dansk\n- Deutsch\n- eesti\n- EnglishUnited Kingdom\n- EnglishUnited States\n- EspañolEspaña\n- EspañolLatinoamérica\n- euskara\n- Filipino\n- FrançaisCanada\n- FrançaisFrance\n- Gaeilge\n- galego\n- Hrvatski\n- Indonesia\n- isiZulu\n- íslenska\n- Italiano\n- Kiswahili\n- latviešu\n- lietuvių\n- magyar\n- Melayu\n- Nederlands\n- norsk\n- o‘zbek\n- polski\n- PortuguêsBrasil\n- PortuguêsPortugal\n- română\n- shqip\n- Slovenčina\n- slovenščina\n- srpski (latinica)\n- Suomi\n- Tiếng Việt\n- Türkçe\n- Ελληνικά\n- беларуская\n- български\n- кыргызча\n- қазақ тілі\n- македонски\n- монгол\n- Русский\n- српски\n- Українська\n- ქართული\n- հայերեն\n- עברית\n- اردو\n- العربية\n- فارسی\n- አማርኛ\n- नेपाली\n- मराठी\n- हिन्दी\n- অসমীয়া\n- বাংলা\n- ਪੰਜਾਬੀ\n- ગુજરાતી\n- ଓଡ଼ିଆ\n- தமிழ்\n- తెలుగు\n- ಕನ್ನಡ\n- മലയാളം\n- සිංහල\n- ไทย\n- ລາວ\n- မြန်မာ\n- ខ្មែរ\n- 한국어\n- 日本語\n- 简体中文\n- 繁體中文\n- 繁體中文香港\nInnan du fortsätter till YouTube\nVi använder cookies och data för att\n- leverera och underhålla Googles tjänster\n- spåra avbrott och skydda mot spam, bedrägeri och otillåten användning\n- mäta målgruppsengagemang och webbplatsstatistik så att vi kan analysera hur våra tjänster används och förbättra tjänsternas kvalitet.\nOm du väljer knappen Godkänn alla använder vi även cookies och data för att\n- utveckla och förbättra nya tjänster\n- leverera annonser och mäta hur effektiva de är\n- visa anpassat innehåll utifrån dina inställningar\n- visa anpassade annonser utifrån dina inställningar\nOm du väljer knappen Avvisa alla använder vi inte cookies i dessa ytterligare syften.\nInnehåll och annonser utan anpassning påverkas bland annat av vad du tittar på för tillfället och din plats (annonser visas utifrån din ungefärliga plats). Innehåll och annonser med anpassning kan även omfatta sådant som videorekommendationer, en anpassad YouTube Hem-sida och anpassade annonser utifrån tidigare aktivitet, till exempel vad du tittar på och söker efter på YouTube. Vi använder även cookies och data för att anpassa upplevelsen efter lämplighet för din målgrupp, om tillämpligt.\nVälj knappen Fler alternativ för mer information, till exempel om hur du hanterar dina integritetsinställningar. Du kan även besöka g.co/privacytools när som helst."
    },
    {
      "url": "https://www.ice.gov/news/releases/ice-issues-over-1000-tentative-job-offers-shore-agencys-enforcement-efforts",
      "text": "ICE issues over 1,000 tentative job offers to shore up agency’s enforcement efforts\nWASHINGTON, D.C. — U.S. Immigration and Customs Enforcement is proud to announce that it has issued over 1,000 tentative job offers since July 4, marking a significant milestone in its ongoing recruitment efforts. This achievement comes as ICE, under President Donald J. Trump and Department of Homeland Security Secretary Kristi Noem’s strong leadership, intensifies its mission to protect American communities and uphold the rule of law.\n\"We’re excited to welcome patriots who want to serve their country and make a difference in people’s daily lives,\" said acting ICE Director Todd M. Lyons. “People who have received tentative offers will qualify for the incredible benefits we’re offering under this unprecedented initiative — including $50,000 bonuses and student loan forgiveness.”\nICE extended first-round job offers to several former ICE officers and agents who retired under the previous administration.\n“People were frustrated under the Biden administration,” said Lyons. “They couldn’t do the jobs they signed up to do. Now, people are lining up to work with us because they know our officers and agents are allowed to enforce immigration law fairly and across the board, and that’s a cause people really believe in.”\nFor media inquiries about ICE activities, operations or policies, contact ICE’s Office of Public Affairs at ICEMedia@ICE.dhs.gov."
    },
    {
      "url": "https://www.nytimes.com/by/hamed-aleaziz",
      "text": "Over 60,000 Are in Immigration Detention, a Modern High, Records Show\nThe numbers reflect the significant effort the Trump administration has put into its escalating immigration crackdown.\nBy Chris Cameron and Hamed Aleaziz\nI am most interested in the policies that impact the lives of immigrants as well as migrants coming to the United States, and the debates within the agencies charged with carrying out these policies. I also cover the outcomes of their decisions, with a focus on the people whose lives have been changed as a result.\nI first began covering immigration as a reporter for The San Francisco Chronicle in 2017. I continued covering the beat at BuzzFeed News, The Los Angeles Times, and now at The Times. I have also covered criminal justice policy and prisons.\nI grew up in Oregon and went to school at the University of Oregon, where I studied journalism.\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. My focus is for all of my work to be fair and accurate. I do not get involved in politics and I want to hear from every side on an issue. I always strive to protect my sources.\nPlease email me to get my Signal number.\nEmail: hamed.aleaziz@nytimes.com\nX: @haleaziz\nThreads: @haleaziz\nSignal: Email me for the number.\nAnonymous tips: nytimes.com/tips\nThe numbers reflect the significant effort the Trump administration has put into its escalating immigration crackdown.\nBy Chris Cameron and Hamed Aleaziz\nThe practice caused a global outcry in President Trump’s first term.\nBy Michael Barbaro, Hamed Aleaziz, Carlos Prieto, Clare Toeniskoetter, Shannon M. Lin, Rachel Quester, Devon Taylor, Elisheba Ittoop, Dan Powell, Pat McCusker, Rowan Niemisto and Alyssa Moxley\nPresident Trump has revived his first-term policy of separating migrant children from their parents, and the more targeted version is happening far from the border.\nBy Jess Bidgood and Hamed Aleaziz\nPlus, the shark bite club.\nBy Tracy Mumford, Will Jarvis, Ian Stewart, Jessica Metzger and Emily Steel\nThe short-lived effort underscored the mounting pressure on ICE to meet President Trump’s aggressive deportation targets.\nBy Hamed Aleaziz and Nicholas Nehamas\nThe practice appears to be a more targeted version of the mass separation of migrant children from their parents from President Trump’s first term, which caused a global outcry.\nBy Hamed Aleaziz\nThe decision to free an American convicted of murder in a prisoner swap with Venezuela threatened to undercut President Trump’s claims of keeping the worst of the worst out of the United States.\nBy Hamed Aleaziz, Julie Turkewitz and José Bautista\nAn Immigration and Customs Enforcement memo said that National Guard troops would assist in the deportation process for migrants in their custody.\nBy Chris Cameron, Hamed Aleaziz and Eric Schmitt\nTo help us report upcoming stories about immigration enforcement under the Trump administration, we’d like to hear about the experiences of employees of ICE and other agencies.\nBy Hamed Aleaziz and Nicholas Nehamas\nIn an interview with The New York Times, the new director of U.S. Citizenship and Immigration Services said the test to become a U.S. citizen was too easy.\nBy Hamed Aleaziz"
    },
    {
      "url": "https://www.nytimes.com/by/tony-romm",
      "text": "I am a reporter covering economic policy and the Trump administration for The New York Times, based in Washington.\nWhat I Cover\nI write about the economic proposals President Trump is considering and implementing, and I trace the impact of that agenda on Americans’ daily lives. I am particularly interested in the annual ebb and flow of the budget, the reach of government regulation and the future of the federal safety net, including Social Security, Medicare and Medicaid.\nMy Background\nI have reported in Washington for more than a dozen years. I began my career covering the political rise of major technology companies, including Apple, Amazon, Facebook and Google, before becoming an economic policy reporter in 2020.\nBefore coming to The Times in 2025, I worked at The Washington Post. I chronicled President Biden’s economic agenda on Capitol Hill, where Democrats ultimately enacted trillions of dollars in new climate, health, infrastructure and social initiatives. I also piloted a yearlong investigation that identified billions of dollars in waste, fraud and abuse throughout the nation’s historic financial response to the Covid pandemic.\nI graduated from American University with a bachelor’s degree in journalism. I am a Philadelphia-area native with a deep, unapologetic passion for Eagles football.\nJournalistic Ethics\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in our Ethical Journalism Handbook.\nI want all of my work to be accurate and fair. I protect my sources. I do not accept gifts, money or favors from anyone who might figure into my reporting.\nI do not participate in political causes, donate to political campaigns or engage in public or private advocacy on any political issue. I make every effort to understand issues from multiple angles, and I seek in all my work to reflect a diverse range of viewpoints and perspectives. When I am working, I identify myself as a reporter for The Times.\nContact Me\nFor sensitive story tips, please contact me on Signal. Otherwise, email me."
    },
    {
      "url": "http://cbsnews.com/news/russ-vought-office-of-management-and-budget-face-the-nation-07-27-2025/",
      "text": "Transcript: Russell Vought on \"Face the Nation with Margaret Brennan,\" July 27, 2025\nThe following is the transcript of an interview with Russell Vought, director of the White House Office of Management and Budget, that aired on \"Face the Nation with Margaret Brennan\" on July 27, 2025.\nMARGARET BRENNAN: We begin today with the director of the White House Office of Management and Budget, Russell Vought, welcome to 'Face The Nation.'\nDIRECTOR OF THE OFFICE OF MANAGEMENT AND BUDGET RUSSELL VOUGHT: Thanks for having me.\nMARGARET BRENNAN: There's so much to get to with you. Let's start on what's going on with the Federal Reserve. If you take the president at his word, he does not intend to fire the Federal Reserve Chair, Jerome Powell- though he's still criticizing him. What is the President seeking in a successor when his term ends in May 2026?\nVOUGHT: Well, I think he's looking for a chairman that's not continually too late to the developments in the economic marketplace. And I think what we've seen with Chairman Powell, he was very late in the Biden administration to raise rates, to articulate the concern with regard to the Biden administration's spending. We all knew on the outside- even Larry Summers knew that we were going to have an issue with regard to inflation. And we saw, you know, recent, historical inflationary levels that we hadn't seen before. And now he is too late to lower inflation rates and so that is the kind of thing that we want to see in the next chairman of the Federal Reserve. And one of the reasons why is--\nMARGARET BRENNAN: --More of a focus on inflation?\nVOUGHT: --want an ability to recognize the developments in the economic marketplace. In this case, we want to be able to see lower rates and to have an ability to get the economy going. And one of the things we saw with Powell is that one of the reasons he was so late was because he didn't understand that inflation is largely a monetary phenomenon. He kept saying that inflation was transitory. He didn't tackle the problem, and now he's, again, too late, and you marry that with fiscal mismanagement at the Fed. It's a huge problem that we're trying to raise the country's awareness level with.\nMARGARET BRENNAN: But as you know, the Fed is structured in a way where he doesn't have unilateral control. There's a governing board. Others weigh in. You did work on Project 2025, and we went back and looked at what they said in there about the Fed. As people may know, that's a Heritage Foundation product that got a lot of scrutiny during the campaign. the chapter on the Fed called for Congress to overhaul the Fed's focus and powers. Is that what you're looking to do in 2026?\nVOUGHT: I don't even know what that chapter says. All I know, in terms of the President, the President has run on an agenda. He's been very clear about that. All that we're doing is- in this administration is running on- is implementing his agenda.\nMARGARET BRENNAN: You don't want to overhaul the Fed?\nVOUGHT: We want an economic system that works for the American people, that includes the Fed. And the President has been very clear that all he's asking from the Fed is lower interest rates, because he thinks it's important. When you look at across the across the globe, and you have countries lowering rates, and yet we don't see that in this country, given all of the positive economic indicators that we're seeing. And then we have fiscal mismanagement at the Fed with regard to this building renovation that I'm sure you will ask me about. Those are the kinds of things that we want to see from the Fed. This is not part of an existential issue with regard to the Federal Reserve.\nMARGARET BRENNAN: Well, the Fed is indicating that they are trending towards a rate cut, though probably not as soon as this week. We mentioned those renovations at the top of the program, but I do want to ask about spending, or lack thereof, that the Trump administration is trying to direct. The White House said they will actually release the remaining $5 billion in education, funds that had been withheld from public schools until recently. There were 10 Republican senators very worried about this, and came out and said, your claim that the money goes to radical left wing programs was wrong. What changed your mind? What made you release this money?\nVOUGHT: Well, we had been going through a programmatic review with these funds. These are programs that, as an administration, we don't support. We've called for the elimination of them in the President's budget for precisely the reasons of which they flow to often left wing organizations. Thankfully, the President came into office, put an executive order that said it can't- these funds can't go to these types of initiatives. I'll just give you one example, English language acquisition was flowing to the New York school public education system to go into illegal immigration advocacy organizations. Preschool development grants doesn't actually go to preschoolers. It goes to the curriculum for putting CRT into the school system for people as young- children as young as four years old.\nMARGARET BRENNAN: Well, these senators said it goes to adult learners working to gain employment skills and after school programs.\nVOUGHT: And what we--\nMARGARET BRENNAN: So you deemed it is necessary?\nVOUGHT: We believe that it's important to get the money out right now, but we have taken an extended time frame to be able to make sure it doesn't go to the types of things that we saw under the Biden administration.\nMARGARET BRENNAN: Because, you know, Senator Lindsey Graham told the Washington Post, the administration is looking at considering clawbacks from the Department of Education. This, you know, rescissions process. Is that the plan? Are you seeking to claw back education funds in a rescissions package? And if so, when are you sending that up?\nVOUGHT: We may be, we're always looking at potential rescission options. This is an- this is a set of funding that we wanted to make sure it got out. We did our programmatic review. We wanted to make sure it got out before the school year, even though it's multi-year funding. This is not funding that would expire at the end of this year. We are looking to do rescissions package. We're always gauging the extent to which the Congress is willing to participate in that process, and we're- be looking at a lot of different options along those lines, but certainly have nothing to announce here today. But we're thrilled that we had the first rescissions package in decades, and we've got the process moving again.\nMARGARET BRENNAN: So no rescissions package before September?\nVOUGHT: Not here to say that. We're looking at all of our options, we will look at it and assess where the Hill is, what are the particular funding opportunities that we have, but nothing that we're going to announce today,\nMARGARET BRENNAN: Because some of the funds that do expire in September have also been held up on the health front. Senator Katie Britt of Alabama, 13 other Republicans, came out with a letter saying that you've been slow in releasing funds for the National Institute of Health for research into cardiovascular disease, cancer. Are those funds going to be released?\nVOUGHT: Again, we're going through the same process with the NIH that we did with the education. I mean--\nMARGARET BRENNAN: But there's a time cost here.\nVOUGHT: --$2 million for injecting dogs with cocaine that the NIH spent money on, $75,000 for Harvard to study blowing lizards off of trees with leaf blowers. That's the kind of waste that we've seen at the NIH. And that's not even getting to the extent to which the NIH was weaponized against the American people over the last several years, with regard to funding gain of function research that caused the pandemic. We have a- we have an agency that needs dramatic overhaul. Thankfully, we have a great new head of it, but we're going to have to go line by line to make sure the NIH is funded properly.\nMARGARET BRENNAN: Are you going to release the cancer funding research? And the cardiovascular disease research funding?\nVOUGHT: We're going to continue- we're going to continue to go to the same process that we have gone through with regard to the Department of Education, that every one of these agencies--\nMARGARET BRENNAN: Before September, that money will be released?\nVOUGHT: --and we will release that funding when we are done with that review.\nMARGARET BRENNAN: Because, as you know, there's concern that you're withholding the money, hoping it just won't be spent. I mean, if you look at the White House budget, it does call for a 26% cut to HHS, $18 billion cut to NIH. Is this just a backdoor way to make those cuts happen?\nVOUGHT: Well, I don't want to speak to any specific program with regard to what we might do with regard to rescissions throughout the end of this fiscal year, but we certainly recognize that we have the ability and the executive tools to fund less than what Congress appropriated, and to use the tools that the Impoundment Control Act, a bill we're not- a law that we're not entirely thrilled with, gives us to- to send up rescissions towards the end of the fiscal year.\nMARGARET BRENNAN: So just for our viewers, the Impoundment Control Act is the legal mechanism for the President to use to delay or avoid spending funds appropriated by Congress. You seem to want to have an argument, or Democrats think you want to have an argument, over the power of the purse and who holds it. Do you want that to go to the Supreme Court?\nVOUGHT: Well, look, for 200 years, presidents have the ability to spend less than the congressional appropriations. No one would ever dispute, and our founders didn't dispute that Congress has the ability to set the appropriation ceiling. But 200 years of presidents, up until the 1970s had the ability to spend less, if they could find efficiencies, or if they could find waste that an agency was doing.\nMARGARET BRENNAN: -- That sounds like a yes?--\nVOUGHT:-- We lost that ability in the 1970s. The president ran on restoring that funding authority to the presidency, and it's vital. If you look at when we started to lose control fiscally, it was right around the time of the 1970s.\nMARGARET BRENNAN: Well, many senators, Republican senators, are very uncomfortable with the tactics that you are using. Senator Murkowski, Senator Collins, that chair of the appropriations committee that is really running this- this funding process. And Senator Collins said you're pushing the limits of what the executive can do without the consent of the- of the legislative branch. You need to work with her to get your budget through. And in fact, you need to also be able to get Democrats on board to get to that 60-vote threshold to pass any kind of government funding to avoid a government shutdown at the end of September.\nVOUGHT: I have a great relationship with Senator Collins. I appreciate the work she does. She is the chairman of the Appropriations Committee, so obviously we're going to have differences of opinion as to the extent to which these tools should be used. I mean, she had concerns with the rescissions package. The rescissions package was a vote that Congress had to make these cuts permanent--\nMARGARET BRENNAN: -- Under- on a party line vote, she says, you want to go do these clawbacks. You do it through regular order, and you can put- you can put rescissions into an appropriations bill--\nVOUGHT: --But that was in fact, under regular order. That's the challenge, is the appropriators want to use all the rescissions, they want to put them in their bills, and then they want to spend higher on other programs. We act- we're $37 trillion in debt, Margaret. We actually need to reduce the deficit and have a dollar of cut go to $1 a deficit reduction. That's not what the appropriators want, and it's not news that the Trump administration is going to bring a paradigm shift to this town in terms of the business of spending.\nMARGARET BRENNAN: You would acknowledge that you just added to the debt and to the deficit with this--\nVOUGHT: -- No, I would not acknowledge that. We reduced--\nMARGARET BRENNAN: -- The spending and tax bill that just passed?\nVOUGHT: Correct.\nMARGARET BRENNAN: Where you lifted the debt ceiling.\nVOUGHT: The debt ceiling is an extension of the cap on what's needed to pay your previous bills. In terms of the bill itself, it is $400 billion in deficit reduction, $1.5 trillion in mandatory savings reforms, the biggest we've seen in history.\nMARGARET BRENNAN: Well, I want to make sure I get to the rest of this before I let you go here, because we're running out of time. You said, a few weeks ago, that the appropriations process needs to be less bipartisan. You only have 53 Republicans. You do need Democrats to get on board, here. Is saying something like that intended to undermine negotiations? Do you actually want a government shutdown?\nVOUGHT: No, of course not. We want to extend the funding at the end of this fiscal year. We understand, from a math perspective, we're going to need Democrats to do that--\nMARGARET BRENNAN: Well, what does less bipartisan mean?\nVOUGHT: Well, Margaret, the whole week, the Democrats were making the argument that if you pass the rescission bill, that you were undermining the bipartisan appropriations process. So, if Brian Schatz and every other appropriator is making that argument for a week--\nMARGARET BRENNAN: --The chair of the Senate Appropriations Committee is who said that--\nVOUGHT: --you have to be able to respond and say, if you're going to call a rescissions package that you told us during the month of January and February that we should use to do less spending, if you're going to say that is undermining the bipartisan appropriations process, then maybe we should have a conversation about that. That is all it was meant to convey.\nMARGARET BRENNAN: But, the alternative to this process is another continuing resolution, these stop-gap measures. Are you open to that, because that would lock in Biden-era funding? What is your alternative here? If you want a less bipartisan process, how do you solve for this? Because it sounds like you're laying the predicate for a shutdown.\nVOUGHT: We are not laying the predicate for a shutdown. We are laying the predicate for the fact that the only thing that has worked in this town- the bipartisan appropriations process is broken. It leads to omnibus bills. We want to prevent an omnibus bill, and all options are on the table to be able to do that.\nMARGARET BRENNAN: All options are on the table?\nVOUGHT: We need an appropriations process that functions. We're going to go through the process. We're going to work with them, and we're going to do everything we possibly can to use that process to have cheaper results for the American taxpayer.\nMARGARET BRENNAN: I'm told we're out of time. Russell Vought, thank you for your time today."
    },
    {
      "url": "https://www.nytimes.com/by/eve-sampson",
      "text": "‘Bad Things Happen in Darkness’: Sudan’s Civil War Shifts West\nSince the Sudanese Army drove its paramilitary rival from the capital in March, the two sides are battling for territorial gains in the Kordofan region.\nBy Eve Sampson\nI cover international breaking news, including explanatory coverage of major world events and issues. I am particularly interested in Syria, Iraq and the Levant.\nI served in the U.S. Army as an engineer officer after graduating from the United States Military Academy at West Point in 2016. I left the Army to pursue a master's degree at the University of Maryland in 2021. Since graduating, I’ve written for The Washington Post, The Associated Press and most recently the International Consortium of Investigative Journalists.\nAll Times journalists are committed to upholding a set of comprehensive ethical standards. I strive to be accurate and nuanced in my coverage of complex issues and events across the world. It is important to me that everyone I talk with for a story feels respected, heard and understood.\nSince the Sudanese Army drove its paramilitary rival from the capital in March, the two sides are battling for territorial gains in the Kordofan region.\nBy Eve Sampson\nThe African nation is the latest country to strike a deal to take in deportees from the United States.\nBy Eve Sampson\nEight people were reported dead after Ugandan soldiers crossed the border into South Sudan and skirmished with troops there.\nBy Eve Sampson\nThe move by a paramilitary-led coalition may make it even harder for the African country to hold together.\nBy Eve Sampson\nThe group accused Ethiopia’s government of failing to properly investigate the deaths, which took place in the Tigray region.\nBy Eve Sampson and Declan Walsh\nThe International Criminal Court has “reasonable grounds to believe” war crimes and crimes against humanity were committed, the court’s deputy prosecutor said.\nBy Eve Sampson\nSimmering anger against President William Ruto’s government has boiled over into clashes between protesters and the police, who have deployed live rounds, tear gas and water cannons.\nBy Eve Sampson\nAt the funeral for Albert Ojwang, protesters in Kenya said his death was a call to action for the country’s youth.\nBy Eve Sampson and Brian Otieno\nThousands of people turned out across Kenya on Wednesday to protest government corruption and police brutality.\nBy Eve Sampson\nThousands demonstrated on Wednesday to express their anger over government corruption and police brutality.\nBy Pranav Baskar"
    },
    {
      "url": "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html",
      "text": "In his first months in office, President Trump has slashed funding for medical research, threatening a longstanding alliance between the federal government and universities that helped make the United States the world leader in medical science.\nSome changes have been starkly visible, but the country’s medical grant-making machinery has also radically transformed outside the public eye, a New York Times analysis found. To understand the cuts, The Times trawled through detailed grant data from the National Institutes of Health, interviewed dozens of affected researchers and spoke to agency insiders who said that their government jobs have become unrecognizable.\nIn all, the N.I.H., the world’s premier public funder of medical research, has ended 1,389 awards and delayed sending funding to more than 1,000 additional projects, The Times found. From the day Mr. Trump was inaugurated through April, the agency awarded $1.6 billion less compared with the same period last year, a reduction of one-fifth. (N.I.H. records for May are not yet comparable.)\nThe impacts extend far beyond studies on politically disfavored topics and Ivy League universities like Columbia or Harvard. The disruptions are affecting research on Alzheimer’s, cancer and substance use, to name just a few, and studies at public institutions across the country, including in red states that backed Mr. Trump.\n“I think people should know that research that they probably would support is being canceled,” said Eden Tanner, a chemist at the University of Mississippi, who had been working with a colleague at Ohio State University to develop a novel approach for treating glioblastoma, an aggressive form of brain cancer. Their grant had been awarded through a program designed to diversify the biomedical workforce; in April, they were notified that it was being terminated.\n“I would like to cure brain cancer,” Dr. Tanner said. “I think that's not particularly controversial.”\nMr. Trump’s campaign against medical research has been carried out without congressional approval, and the legality is unclear. Lawsuits have challenged the slashing or delaying of funding.\nFederal officials, who have accused the N.I.H. of wasteful spending, have attributed the cuts to changing scientific priorities.\nThe N.I.H. “regularly examines its research portfolio” to determine which projects are “the most meritorious,” Andrew Nixon, a spokesman for the U.S. Department of Health and Human Services, said in an email. “Regular reviews of ongoing activities will help us determine the most strategic balance of projects to support and the best way to manage them going forward, especially as we need to be responsive to the often-changing nature of biomedical scientific progress.”\nScientists fear that the sweeping cuts could do long-term damage to U.S. scientific research, which has long driven medical and financial progress for the nation. “The country is going to be mourning the loss of this enterprise for decades,” said Dr. Harold Varmus, a Nobel Prize-winning cancer biologist who served as the director of the N.I.H. during the Clinton administration and the director of the National Cancer Institute under President Barack Obama.\nN.I.H. grants, awarded in a competitive process, are typically paid out in installments. A researcher with a $1 million four-year grant, for instance, will get about $250,000 a year. Scientists can use this money to buy equipment and supplies and to pay the salaries of the researchers who work in their labs, among other things.\nFrom 2015 to 2024, there have been fewer than 20 terminations a year, on average, according to Jeremy M. Berg, former director of the National Institute of General Medical Sciences at the N.I.H. from 2003 to 2011. They were generally for extenuating circumstances, such as illness or research misconduct.\nBut since late February, the government has publicly announced the cancellation of 1,389 N.I.H. awards. The agency scoured grants for key words and phrases like “transgender,” “misinformation,” “vaccine hesitancy” and “equity,” ending those focused on certain topics or populations, according to a current N.I.H. program officer, who asked not to be identified for fear of retribution.\nStudies focused on sexual and gender minority groups were among the first on the chopping block.\nKatherine Bogen, a doctoral student at the University of Nebraska-Lincoln, had been studying post-traumatic stress, alcohol use and intimate partner violence against bisexual women. The termination notice she received assailed studies “based primarily on artificial and nonscientific categories,” calling such research “antithetical to the scientific inquiry” and alleging that it was “often used to support unlawful discrimination on the basis of race and other protected characteristics, which harms the health of Americans.”\nThe language was “very insulting,” she said. “I get this letter that tells me, ‘Your research is not science. Not only is it ascientific, it’s a useless drain on resources, and, in fact, your research could be used to discriminate against ‘actual’ Americans or ‘regular’ Americans,’ or whatever they mean.”\nThe cuts spread to grants on health equity and racial and ethnic groups. Affected projects sought to improve access to mental health care for Latino, low-income and rural communities; to reduce maternal mortality among Black women; and to prevent gun violence in Asian American communities.\nTsu-Yin Wu, a researcher at Eastern Michigan University who led the gun violence project, said that community leaders and study participants were “greatly disappointed” by the grant cancellation. “Some felt betrayed that their voices and engagement no longer matter.”\nThe agency cut grants for research on vaccine hesitancy, disinformation and misinformation, including a Northeastern University study on cancer misinformation on social media.\nIt also axed research on Covid-19, including studies that could have helped the nation respond to many infectious disease threats. Among them: a grant to Emory University and Georgia State University, where researchers had developed three potential drugs that showed promise against many RNA-based viruses, including coronaviruses, Ebola, avian influenza and measles, said George Painter, a pharmacologist at Emory who was co-leading the research.\nIn April, the agency terminated, in part or in whole, more than 350 grants meant to support students, early-career scientists or researchers from groups underrepresented in science. Among these terminations were F31 diversity grants, awarded to Ph.D. students who were members of certain racial or ethnic groups, disabled or from disadvantaged backgrounds.\nAt the University of Pittsburgh, Luzmariel Medina-Sanchez, who was born and raised in Puerto Rico, and Sierra Wilson, a first-generation college student from Utah, both had their grants canceled. “It’s not even about the work I’m doing,” said Ms. Wilson, who studies how liver cells respond to drug overdoses. “It feels like it’s about me.”\nMs. Medina-Sanchez, who studies how a microbe can help treat celiac disease, said she may leave science altogether. “I feel racially targeted,” she said. “I feel like I’m not going to be a professional in the field of science in America, because obviously my name is Luzmariel.”\n(Ms. Wilson and Ms. Medina-Sanchez stressed that they spoke only for themselves and not for the university.)\nBesides outright canceling projects, N.I.H. failed to distribute annual payments to more than 1,000 grants, The Times found.\nThe delays have stifled research on drug discovery, blood vessel health and injury response. In some cases, scientists have cut staff, paused hiring, trimmed back supplies or delayed experiments. Health officials have not explained which projects have been held up, why or for how long.\nThe Times compiled a list of the delayed grants by searching N.I.H. databases as of June 2 for ones that were funded in 2024 and expected to last beyond 2025, but have not gotten disbursements on schedule.\nIn the past, annual renewals were routine. Scientists submitted progress reports; the N.I.H. reviewed them and usually continued funding them, occasionally with a week or two of delays. But longer delays have become much more common since Mr. Trump took office.\nJoshua Kritzer, a professor of chemistry at Tufts University, investigates the basic science behind potential drug candidates, laying the groundwork for future medications. Most of his lab work is supported by a five-year N.I.H. grant that received $1.4 million over the past two years. But since February, he had been waiting for the third year of expected funding to come in. He slashed purchases of essential supplies and contemplated laying off crucial researchers on his team.\nOn Tuesday, Kritzer finally received word that his funding had been released, several days after The Times asked federal officials about his and other delayed awards.\n“Every week that’s delayed, it’s easily probably three to four weeks to get that research back to where it was,” said Dr. Kritzer, who noted that he was speaking for himself and not for his institution.\nMr. Nixon, the Department of Health spokesman, said that the agency would not discuss deliberations about specific awards but encouraged grant recipients to “speak with the designated N.I.H. officials on their award notice when questions arise.”\nIn some cases, delays have lasted so long that scientists wondered whether their grants were subject to a “shadow termination.”\nThe delays stem in part from additional screening for whether the grants align with Trump administration priorities, N.I.H. officials said. Other renewals have been delayed as overstretched N.I.H. staff members work through backlogs in funding. And political appointees are now vetting some projects, too, slowing the process further.\nN.I.H. officials said they feared being fired if they processed a grant renewal that the administration disfavored.\nIn early May, Jon Lorsch, a longtime N.I.H. institute director who was recently promoted to acting deputy director of the agency’s external funding arm, emailed staff members denouncing the renewal of grants “that focused on topics that are not supported under N.I.H./H.H.S.'s priorities,” according to a copy of the email seen by The Times.\n“The consequences of approving an award that should not have been approved could be very serious,” he wrote.\nBut Courtney Griffin, who leads a lab at the Oklahoma Medical Research Foundation and studies blood vessel development and disease, including complications due to diabetes, expressed confusion as to why her expected funding is not coming through. She and her colleagues were making contingency plans and looking for other sources of funding.\n“It’s, ironically, a really inefficient use of people’s time to be in this guessing game,” she said, adding that the time could be better spent on biomedical research.\nMonths-long delays are also affecting new grants that were being vetted when the Trump administration cracked down on grant reviews.\nA number of major Alzheimer's Disease Research Centers, some of which have operated for decades, have waited months for the Trump administration to decide whether to award them fresh five-year grants. The funding gaps have set back ongoing studies and curtailed efforts to take images of patients' brains, though the N.I.H. has recently told some centers that they would soon receive funding.\n“These centers have become a safety valve for people who can’t get a neurology appointment at a private center,” said Dr. Ann Cohen, a co-director of the University of Pittsburgh Alzheimer’s center. Now, she said, things have changed. “There are fewer clinic appointments, fewer opportunities for these individuals to get brain imaging.”\nThe N.I.H. has also said that it will no longer fund projects in which U.S. researchers distribute some of their money to international partners, throwing the future of many global health projects into question and creating funding delays for ongoing research.\nBeyond the disruption of individual projects, other proposed changes could undermine scientific research across the board, experts said. One would sharply curb funding for indirect research costs, such as building maintenance and administrative staff. And then there is Mr. Trump’s proposal to slash the N.I.H.’s total budget by about $18 billion, a cut of almost 40 percent.\nA budget cut of that scale would be “truly draconian,” said Dr. Varmus, the former N.I.H. director, who said he hoped Congress would not approve such a sharp reduction. It could leave the agency without enough money to fund promising new work, drive some scientists overseas and prompt some up-and-coming researchers to leave science altogether, he said. “You can completely destroy the system in just a couple of years,” Dr. Varmus said."
    },
    {
      "url": "https://www.nytimes.com/by/glenn-thrush",
      "text": "I report on the Justice Department for The New York Times. I also write frequently about gun violence, civil rights and conditions in the country’s jails and prisons.\nWhat I Cover\nThe Justice Department plays a central role in nearly every important political, legal and constitutional conflict. It’s also my assignment desk.\nOne of the greatest challenges of covering a vast and complex department is simply deciding what to write about, and how that coverage can best serve the public interest.\nMy Background\nI was born and raised in Brooklyn, N.Y. — in Sheepshead Bay and Brighton Beach — where my parents ran an ice cream store under the Ocean Parkway stop of the elevated Q line.\nAfter graduating Brooklyn College, I took a job at the weekly Downtown Express in Lower Manhattan, where I was schooled in my trade by Jan Hodenfield, a brilliant and generous editor who had been one of Rolling Stone’s first staff writers.\nI’ve worked at many places subsequently: The Birmingham Post-Herald, City Limits, The Daily News, Bloomberg, Newsday and Politico.\nIn 2017, I joined The Times, where I’ve covered the White House, Congress, politics, poverty, housing, trade, and, now, the Justice Department. My most fulfilling assignment, however, was writing obituaries about some of the extraordinary, if lesser known, people who died during the pandemic.\nJournalistic Ethics\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. I strive to be scrupulous about accuracy, context and confidentiality.\nContact Me\nI respond quickly to emails."
    },
    {
      "url": "https://www.nytimes.com/by/devlin-barrett",
      "text": "I’m a New York Times reporter covering the Justice Department and the F.B.I.\nWhat I Cover\nI write about the Justice Department and the F.B.I., explaining how decisions are made inside these powerful and often secretive agencies that have played an ever-growing role in American politics.\nMy Background\nI joined The Times in 2024 after covering federal law enforcement for more than two decades. I started my journalism career as a copy boy at The New York Post, and have worked at The Associated Press, The Wall Street Journal and The Washington Post.\nMy book “October Surprise: How the FBI Tried to Save Itself and Crashed an Election” recounts the enormously consequential role of the Justice Department and F.B.I. in the 2016 presidential election.\nI was part of reporting teams that won Pulitzer Prizes in 2018 and 2022. In 2017 I was a co-finalist for both the Pulitzer for feature writing and the Pulitzer for international reporting.\nI grew up in Troy, N.Y., graduated from McGill University in Montreal and now live in Virginia.\nJournalistic Ethics\nGood reporting never pulls punches or takes cheap shots. The Times has extensive ethics guidelines, which I follow carefully. But ethical reporting is more than just a set of rules; it’s an unwavering commitment to honesty, accuracy and careful consideration of people’s perspectives. In my work, covering sensitive law enforcement and national security cases often involves getting information from people who speak anonymously. Any reporting that relies on anonymous sources carries extra responsibility for the reporter to understand people’s motives, attention to detail and candor.\nContact Me"
    },
    {
      "url": "https://www.nytimes.com/by/zach-montague",
      "text": "I am a reporter for The New York Times covering the federal courts. I am based in Washington.\nWhat I Cover\nMy reporting focuses on the legal disputes over the Trump administration’s agenda and the hundreds of federal lawsuits filed since January 2025 challenging various policies and actions. That work often touches on the tension between executive power, state and civil society interests, and the evolving interpretation of law across the district and circuit courts levels.\nMy Background\nI joined The Times in 2015 as a news assistant based in New York, after a short stint in policy research. I joined the paper’s Washington bureau in 2019.\nI previously covered the Education Department during the Biden administration, including its efforts on student debt, Title IX reform and the campus protests against violence in Gaza. Before that, I helped cover the prosecutions of dozens of individuals in connection with the Jan. 6 attack on the Capitol, including two seditious conspiracy trials, in Federal District Court in Washington.\nI graduated summa cum laude from Cornell University in 2013 with a degree in government and China and Asia Pacific studies. My research after college examined U.S.-China relations and Chinese land and real estate markets.\nI grew up in the Finger Lakes region of upstate New York.\nJournalistic Ethics\nBefore moving to reporting, I spent two years working in The Times’s Standards department, which oversees our ethical guidelines and works to maintain the overall quality of our journalism. All Times journalists are committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook, and I am a strong believer in those values.\nI do not participate in politics, nor do I make political contributions. I always identify myself as a reporter for The Times while working, and I strive to understand the issues I cover comprehensively and present them fairly.\nContact Me\nI respond most quickly to emails."
    },
    {
      "url": "https://www.nytimes.com/by/michael-gold",
      "text": "I am a congressional correspondent for The New York Times, based in Washington.\nWhat I Cover\nI cover Congress, with a particular focus on immigration policy and on lawmakers’ oversight over federal agencies and the White House.\nMy Background\nMost recently, I covered the 2024 election, following President Donald J. Trump’s campaign across 21 states and speaking to American voters about the issues and policy positions that mattered to them.\nBefore that, I reported on the New York City area, including assignments covering transit and local politics. In 2023, I was one of the reporters who uncovered many of the lies and exaggerations of former Representative George Santos of New York. I have also written about mayoral, governor and congressional elections in New York, and I contributed to The Times’s coverage of the 2016 and 2020 elections.\nJournalistic Ethics\nIn accordance with The Times’s ethical standards, I do not make political donations, nor do I take part in political causes or activity. I strive for rigorous, fair reporting, and I aim to reflect perspectives from across the political spectrum in order to fairly and accurately represent the issues and people I cover.\nContact Me\nIt is important to me to keep my sources protected when it comes to sensitive stories. If you’d like to tell me something securely, I encourage you to use the NYT’s secure tip line.\nX: @migold\nWhatsApp: Send me an email or DM, or contact NYT tips for my number.\nSignal: Send me an email or DM, or contact NYT tips for my number.\nAnonymous tips: nytimes.com/tips"
    },
    {
      "url": "https://www.nytimes.com/by/rob-copeland",
      "text": "Trump Orders Clampdown on ‘Debanking,’ a Personal Gripe\nMostly right-leaning groups have complained of forced bank account closures. The evidence is spotty.\nBy Rob Copeland\nI often tell sources that I write about success: Those who have achieved it, those striving toward it and those who have fallen short. More specifically, I focus on binge-worthy narratives and profiles of some of the biggest names in business.\nAs The Times’s primary reporter on banks, I am especially plugged into that sector. Banks are central to nearly everyone’s economic life. My interests run the gamut from corporate deal makers to ordinary depositors to the regulators and policymakers tasked with overseeing it all.\nThe best journalism surprises, informs and delights; I am always on the hunt for the most illustrative nugget to make a piece come alive.\nI’ve been a business reporter for virtually my entire career since graduating from Duke University with a bachelor’s degree in economics and history.\nFor nearly a decade until late 2022, I was an investigative reporter for The Wall Street Journal, where I wrote front-page stories and features while based in New York, San Francisco and Austin, Texas. Before that, I wrote for the hedge-fund trade publication Absolute Return. I am the author of the New York Times best-selling book “The Fund: Ray Dalio, Bridgewater Associates and the Unraveling of a Wall Street Legend,” published in November 2023.\nAs the youngest of five children, I often say I developed a thick skin for punishment. My siblings dispute that; they say I’m still a brat.\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. There’s nothing more important to me than fairness. That means being fair to the subjects of stories and to our readers, who should be able to understand the purpose, meaning and joy of our work without the distraction of legalese or jargon. My retirement funds and personal savings are invested solely in index funds and rebalanced on a set schedule. Outside of those broad funds, I do not invest in any of the companies or industries I cover.\nMy career relies on my reputation, and I strive to protect sources. I can be reached via any of the ways listed below.\nEmail: rob.copeland@nytimes.com\nLinkedIn: Rob Copeland\nAnonymous tips: nytimes.com/tips\nMostly right-leaning groups have complained of forced bank account closures. The evidence is spotty.\nBy Rob Copeland\nJPMorgan and Bank of America rejected Trump Organization deposits, the president said, fueling his displeasure with Wall Street.\nBy Rob Copeland\nA police officer. A security guard. An executive. An associate. They were remembered for their “light,” for their passion and commitment.\nBy Sarah Maslin Nir\nWesley LePatner, a senior executive at Blackstone, was among the four victims of a gunman who opened fire on Monday in a Park Avenue office tower.\nBy Dionne Searcey and Maureen Farrell\nA new generation of meme stocks are soaring and falling again.\nBy Rob Copeland and Kailyn Rhone\nGoldman and other investment banks are feeding off a Trump boom.\nBy Rob Copeland\nThe C.E.O. of JPMorgan Chase, who has rarely taken on President Trump during his second term, wades into the argument over the Federal Reserve chair.\nBy Rob Copeland\nJPMorgan’s chief, Jamie Dimon, lauded the “resilient” U.S. economy as his bank reported bumper quarterly earnings.\nBy Rob Copeland and Stacy Cowley\nThere is a degree of political agreement over so-called debanking, but no easy answers to the hot topic in Washington.\nBy Rob Copeland, Peter Eavis and Colby Smith\nBilly Evans has two children with the Theranos founder, who is in prison for fraud. He’s now trying to raise money for a testing company that promises “human health optimization.”\nBy Rob Copeland"
    },
    {
      "url": "https://www.politifact.com/factchecks/2025/jul/11/jon-favreau/ICE-FBI-bill-Donald-Trump-largest/",
      "text": "Get PolitiFact in your inbox.\nDoes Trump’s new law make ICE the largest federal law enforcement agency?\nIf Your Time is short\n-\nPresident Donald Trump’s signature law includes about $75 billion for ICE over four years, including $45 billion for new immigration detention beds and $30 billion to hire 10,000 ICE employees, upgrade facilities and more.\n-\nICE becomes the highest-funded federal law enforcement agency under Trump’s law compared with the FBI and DEA’s existing budgets. But base budgets for all three agencies could change.\n-\nICE still trails the FBI in terms of overall staffing, but ICE’s number of staff with arrest authority could surpass the FBI in coming years, depending on the breakdown of its new 10,000 hires.\nAs news of immigration raids permeate Americans’ social media feeds, news broadcasts and neighborhood meetings, critics of President Donald Trump’s tactics are warning his federal immigration force is gaining unprecedented strength.\nTrump’s tax and spending law awards U.S. Immigration and Customs Enforcement, the federal agency charged with detaining and deporting people in the U.S. illegally, billions of dollars over the next four years.\n\"ICE will now become the country’s largest federal law enforcement agency, bigger than the FBI, bigger than the DEA,\" former Obama speechwriter Jon Favreau said on the July 8 Pod Save America podcast he co-hosts.\nOther left leaning groups and people have made similar statements, including Sen. Alex Padilla, D-Calif., the Brennan Center for Justice at NYU school of law and Aaron Reichlin-Melnick, senior fellow at the American Immigration Council, an immigrant advocacy group.\nThe new law clearly includes an enormous increase in spending for ICE, but does it make ICE the \"largest\" federal law enforcement agency? Favreau didn’t explain his metric for \"largest\" on the show, but he mentioned that the new law includes money to hire 10,000 ICE employees and build immigration detention beds.\nSign up for PolitiFact texts\nWe examined how ICE compares with the FBI and the U.S. Drug Enforcement Agency in terms of funding and staffing. Favreau is right about the DEA. As to the FBI, we found that Favreau’s statement tracks based on some calculations about spending in the new law and ICE’s likely annual budget. But it is less certain when comparing ICE and FBI staffing numbers.\nHere’s a wrinkle in these comparisons: We don’t yet know the future years’ annual base budget for ICE or the FBI. Congress will set the fiscal 2026 base budgets by Sept. 30.\nHow ICE compares to the FBI in size is significant because it shows how federal officials are prioritizing the nation’s enforcement needs. The FBI investigates a broad range of crimes including terrorism, cyber crimes, violent and white collar crime and although some of those offenders could be immigrants, it includes a lot of crime committed by U.S. citizens.\nSeveral emails to Crooked Media, home of Pod Save America, did not get a response.\nICE’s new funding makes its overall budget appear larger that FBI’s\nICE is one of nine agencies within the Department of Homeland Security — and it’s worth noting that DHS itself touts on its website that all agencies combined make DHS \"the largest federal law enforcement agency with approximately 80,000 officers across nine agencies and offices.\"\nThe law Trump signed provides about $165 billion for Homeland Security, including $46.5 billion to finish building a wall along the U.S.-Mexico border. Its ICE-specific budgetary provisions add up to about $75 billion over four years.\nThe FBI and the DEA are part of the Justice Department. The DEA has a budget of about $2.6 billion and employs about 10,000 people throughout the world, making it easily smaller than both the FBI and ICE, no matter how you look at it.\nReichlin-Melnick told us he based his own ICE comparisons on funding.\n\"I’ve been saying that ICE will become the nation’s highest-funded federal law enforcement agency, with a budget larger than the combined budget of the FBI, ATF, DEA, U.S. Marshals Service, and Bureau of Prisons,\" Reichlin-Melnick wrote to PolitiFact.\nOf the $75 billion going to ICE through September 2029, $45 billion is for 80,000 new detention beds. The remaining $30 billion will go toward hiring 10,000 new employees, removal operations and facility and information technology upgrades.\nThat works out to about $17.7 billion more per year through September 2029, bringing the total annual budget to about $27.7 billion. (ICE’s current annual budget is about $10 billion.)\nThat total amount for ICE adds up to more than the current annual budgets of the FBI, DEA and other law enforcement agencies including the Bureau of Prisons, according to the Justice Department.\nStaffing comparison is more murky\nIf you look at the three agencies by staffing, the comparison is less certain.\nAs of April, the FBI had about 38,000 employees, 13,000 of whom are special agents authorized to make arrests.\nICE has about 20,000 employees, including 6,100 deportation officers and 6,500 special agents authorized to make arrests. Under the new law, ICE’s force will grow to 30,000 within four years — 10,000 of them officers, agents, investigators and support staff.\nSo although the FBI overall is larger than ICE now, ICE could surpass the FBI in the number of agents with authority to make arrests, depending on how hiring breaks down for the new 10,000 positions.\nAgencies’ base budgets are not yet set\nOne caveat: ICE’s future annual budgets are unclear because the administration could spend the $75 billion sooner rather than later — meaning, not in equal measure across the four years, Migration Policy Institute spokesperson Michelle Mittelstadt said.\n\"Also, Congress is currently working on (fiscal year) 2026 appropriations, so they could change ICE’s annual budget then, too,\" Mittelstadt said.\nThe new law that Trump signed includes extra funding for ICE; it does not mention the annual base budget for ICE or the FBI for the next fiscal year, which starts Oct. 1.\nTrump proposed that Congress provide $11.3 billion for ICE, an increase over its current $10 billion. The FBI’s budget request is $10.1 billion; a reduction of $545 million and of at least 1,500 positions, including about 700 that are vacant, according to a June Justice Department budget and performance summary.\nFeatured Fact-check\nICE’s expanded work will also involve outside contractors, other agencies\nOther experts on ICE or the federal budget noted additional caveats.\nJohn Sandweg, who served as acting director of ICE during part of Obama’s administration, told PolitiFact that more than one-third of ICE’s detention beds are operated by private prison companies.\n\"If you consider the guards and other facility personnel (most of whom technically work for the detention provider) as ICE employees, the agency is likely to be larger than the FBI,\" Sandweg said.\nThe Trump administration has also allowed federal officials in other agencies, such as the DEA, the Bureau of Alcohol, Tobacco, Firearms and Explosives, and the U.S. Marshals Service to enforce immigration law.\nICE has hundreds of agreements delegating some immigration authorities to state and local police.\n\"None of those would be counted as personnel in the ICE budget justification, but it would vastly increase the number of law enforcement personnel acting on behalf of ICE,\" said Joshua Sewell, Taxpayers for Common Sense director of research and policy.\nAn example: Florida cooperates with ICE and in July opened Alligator Alcatraz, an immigration detention facility. The state will incur the upfront costs and seek reimbursement from the Federal Emergency Management Agency’s Shelter and Services Program.\nRELATED: Fact-checking Trump at Florida’s Alligator Alcatraz about immigration, One Big Beautiful Bill\nOur ruling\nFavreau said, \"ICE will now become the country’s largest federal law enforcement agency, bigger than the FBI, bigger than the DEA.\"\nHe’s right about ICE being bigger than DEA.\nAnd ICE becomes the highest-funded federal law enforcement agency under Trump’s law compared with the FBI’s existing budget. But there are some unknowns: We don’t know if the $75 billion newly allocated to ICE will be spent evenly over four years or as a huge infusion in the first year, making the annual budget comparison tricky. We also don’t know what will happen with the FBI’s annual budget over the next four years.\nIf the new ICE funds are allocated evenly over four years and based on current budget levels, that adds up to $27.7 billion annually for ICE, more than the FBI’s annual budget of about $10 billion and DEA’s $2.6 billion.\nAs to agency staffing, the FBI’s 38,000 workforce is greater than ICE’s 20,000 plus the expected 10,000 new hires. But ICE could surpass the FBI in the number of agents with authority to make arrests, depending on how the new hires shake out.\nThe statement is accurate but needs clarification or additional information. We rate it Mostly True.\nRELATED: Permanent tax breaks for billionaires, temporary for everyone else? That’s exaggerated\nRELATED: Trump says 'no tax on Social Security' with reconciliation bill. That's not true for everyone.\nOur Sources\nPod Save America, Clip, July 8, 2025\nTranscript, MSNBC interview with Sen. Alex Padilla, July 8, 2025\nHomeland Security, Secretary Noem Commends President Trump and One Big Beautiful Bill Signing into Law: Historic Win for the American People and the Rule of Law, July 4, 2025\nCongressional Research Service, The Federal Bureau of Investigation, May 5, 2025\nJustice Department, Fiscal year 2026 budget and performance summary, June 13, 2025\nU.S. Immigration and Customs Enforcement, FAQ, March 10, 2025\nU.S. Customs and Border Protection, Website, Accessed July 9, 2025\nU.S. Immigration and Customs Enforcement, Delegation of Immigration Authority Section 287(g) Immigration and Nationality Act, July 10, 2025\nDepartment of Homeland Security, U.S. Immigration and Customs Enforcement Budget Overview, 2025\nFBI director Kash Patel, Federal Bureau of Investigation Budget Request to U.S. House for Fiscal Year 2026, May 7, 2025\nCongress.gov, H.R.1 - To provide for reconciliation pursuant to title II of H. Con. Res. 14. July 2025\nBrennan Center for Justice at NYU school of law, Budget Bill Massively Increases Funding for Immigration Detention, July 3, 2025\nNational Immigration Law Center, The Anti-Immigrant Policies in Trump’s Final \"Big Beautiful Bill,\" Explained, July 8, 2025\nNewsweek, ICE Budget Now Bigger Than Most of the World's Militaries, July 3, 2025\nNPR, How Trump's tax cut and policy bill aims to 'supercharge' immigration enforcement, July 3, 2025\nPBS News Hour, GOP gives ICE massive budget increase to expand Trump’s deportation effort, July 8, 2025\nMSNBC, The Briefing with Jen Psaki, July 8, 2025\nABC News, DHS allows US Marshals, DEA and ATF to carry out immigration enforcement, Jan. 23, 2025\nU.S. District Court Southern District of Florida, Federal defendants’ motion in Friends of the Everglades v Kristi Noem, July 3, 2025\nPolitiFact, Trump makes progress on border wall with projects to add over 80 miles of new barriers, June 25, 2025\nEmail interview, Theresa Cardinal Brown, Homeland Security official under the George W. Bush and Barack Obama administrations, July 9, 2025\nEmail interview, John Sandweg, acting director of ICE for part of 2013-14, July 9, 2025\nEmail interview, Joshua Sewell, director of research and policy at Taxpayers for Common Sense, July 9, 2025\nEmail interview, Michelle Mittelstadt, spokesperson at the Migration Policy Institute, July 9, 2025\nEmail interview, Aaron Reichlin-Melnick, senior fellow at the American Immigration Council, July 9, 2025\nBrowse the Truth-O-Meter\nMore by Amy Sherman\nDoes Trump’s new law make ICE the largest federal law enforcement agency?\nSupport independent fact-checking.\nBecome a member!\nIn a world of wild talk and fake news, help us stand up for the facts."
    },
    {
      "url": "https://www.nytimes.com/by/nicholas-nehamas",
      "text": "I am a Washington correspondent for The New York Times, focusing on the Trump administration and its efforts to transform the federal government.\nWhat I Cover\nMy job is to document how President Trump and his allies are reshaping the U.S. government through policy changes, spending cuts, deregulation and the disassembling of the federal bureaucracy. I focus particularly on the billionaire Elon Musk and his government overhaul task force, known as the Department of Government Efficiency. I seek to reveal the impact that these changes have on American life, as well as to hold the administration and the federal bureaucracy to account.\nMy Background\nI joined The Times’s political desk in 2023, covering the presidential campaigns of Ron DeSantis, Joe Biden and Kamala Harris across 19 states over nearly two years.\nBefore that, I worked for nine years at The Miami Herald, mainly as an investigative reporter.\nAt The Herald, I shared in a Pulitzer Prize for coverage of the Panama Papers, a trove of leaked documents that exposed the stream of dirty money fueling Miami’s real estate boom. I also shared a Polk Award for a series on Mr. DeSantis’s efforts to transport migrants from the Mexican border to Martha’s Vineyard. And my colleagues and I were Pulitzer finalists for an investigation into international gold smuggling. I am the co-author of two books: “Dirty Gold: The Rise and Fall of an International Smuggling Ring” and “The Grifter’s Club: Trump, Mar-a-Lago, and the Selling of the Presidency.”\nI grew up in New Jersey, attended Harvard College and earned a master’s degree at the Toni Stabile Center for Investigative Journalism at Columbia Journalism School.\nJournalistic Ethics\nIn my work, I uphold the standards of integrity outlined in our Ethical Journalism Handbook, which states that our reporters may not accept gifts, money or favors from anyone who might figure into our reporting. I do not contribute to political campaigns. I also ensure that all of my stories are accurate and fair. I protect my sources. These are reasonable expectations for any reader to have of our journalists, and I strive to live up to them every day.\nContact Me"
    },
    {
      "url": "https://www.nytimes.com/by/alan-rappeport",
      "text": "Trump Extends China Tariff Truce by Three Months\nPresident Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.\nBy Alan Rappeport\nI cover the Treasury Department and write about taxes, trade and fiscal matters. I regularly travel around the world with the Treasury secretary to international summits. I write about the Biden administration’s efforts at economic diplomacy and about how its policies are unfolding in the United States economy. I have covered this beat since the start of the Trump administration in 2017.\nI joined The Times in 2014 to help launch a new political newsletter and blog that was used to help drive coverage of the 2016 presidential election. Previously, I worked for five years as a reporter at The Financial Times in New York. I also worked in London at The Economist, where I was a Marjorie Deane Financial Journalism Foundation fellow. I have a bachelor’s degree in philosophy and journalism from Emory University and master’s degrees from the Columbia University Graduate School of Journalism and the London School of Economics. I grew up in the Philadelphia area.\nLike all Times journalists, I am committed to upholding the standards of integrity outlined in our Ethical Journalism Handbook. I want all of my work to be accurate and fair. I protect my sources. I do not accept gifts, money or favors from anyone who might figure into my reporting. I do not participate in politics, nor do I make political donations. I make every effort to understand issues from multiple angles. When I am working, I always identify myself as a reporter for The Times.\nEmail: alan.rappeport@nytimes.com\nX: @arappeport\nAnonymous tips: nytimes.com/tips\nPresident Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.\nBy Alan Rappeport\nBilly Long, a former Republican congressman, will no longer serve as the tax agency’s head. Treasury Secretary Scott Bessent will oversee the agency as acting commissioner.\nBy Andrew Duehren, Alan Rappeport and Maggie Haberman\nSome of the most widely used types of gold bars would be subject to U.S. tariffs, customs agency officials ruled, a particular blow to Switzerland’s large gold refining industry.\nBy Liz Alderman and Alan Rappeport\nWith Treasury Secretary Scott Bessent not in the running, President Trump said that he has narrowed his list of replacements to four people.\nBy Alan Rappeport\nPresident Trump is using an “Art of the Deal” approach to get other nations to hand over cash to lower their tariffs.\nBy Alan Rappeport\nThe resignation comes as President Trump has openly pressured the central bank to lower interest rates and called for Jerome H. Powell, the chair, to step down.\nBy Alan Rappeport and Colby Smith\nTreasury Secretary Scott Bessent’s comments about the safety net program ventured onto the so-called third rail of American politics.\nBy Alan Rappeport and Andrew Duehren\nThe president said Wednesday that imports from India would be subject to a 25 percent tariff as of Friday, as trade talks between the countries hit a stumbling block.\nBy Ana Swanson and Alex Travelli\nAfter a “constructive” round of talks ahead of an Aug. 12 deadline, Treasury Secretary Scott Bessent said, “Nothing is agreed until we speak with President Trump.”\nBy Melissa Eddy and Alan Rappeport\nThe International Monetary Fund warned that trade tension continued to be a risk for the global economy.\nBy Alan Rappeport"
    },
    {
      "url": "https://www.nytimes.com/by/eileen-sullivan",
      "text": "Military Raised Water Level of River in Ohio for JD Vance’s Family Boating Trip\nThe Secret Service said the boats the agency uses for security are usually motorized and need deeper waters to operate.\nBy Lisa Friedman and Eileen Sullivan\nMost of my stories focus on the reshaping of the federal government and its impact.\nI have been a reporter in Washington for more than 20 years and across four administrations. During that time, I’ve covered the federal government’s response to the Sept. 11 attacks and the terrorism threats to the country in the decade that followed. I have also covered the federal response to natural disasters, national security and public safety issues. For the first three years of the Biden administration, I wrote about immigration policy. Then I covered a range of issues at the Justice Department and high-profile federal cases and trials. The intersection of the law, security and politics is an area I’ve explored for most of my career.\nBefore I joined The Times in 2017, I worked at The Associated Press, where I won the Pulitzer Prize for investigative reporting in 2012 for work I did with three A.P. colleagues revealing the New York Police Department’s Muslim spying programs designed to root out terrorists. I also worked at Congressional Quarterly and Federal Times. My first newspaper job out of college was at The Courier-Post in South Jersey. I have a bachelor’s in English from Villanova University. I was born and raised in Alexandria, Va., and now live in Washington.\nAs a Times journalist, I share the values and adhere to the standards of integrity outlined in The Times’s Ethical Journalism handbook. In my reporting I strive for accuracy and balance, and I always fight to protect my sources. I do not participate in political causes or make political contributions. And I do not accept gifts, money or favors from anyone that might influence my work. When I am working, I identify myself as a reporter for The Times.\nEmail: eileen.sullivan@nytimes.com\nX: @esullivannyt (DMs open)\nWhatsApp: email or DM to get my number\nSignal: email or DM to get my number\nLinkedIn: Eileen Sullivan\nAnonymous tips: nytimes.com/tips\nThe Secret Service said the boats the agency uses for security are usually motorized and need deeper waters to operate.\nBy Lisa Friedman and Eileen Sullivan\nThis was featured in live coverage.\nBy Eileen Sullivan\nThe Washington Litigation Group is the latest nonprofit group to join the legal challenges against the president, with a strategy of focusing on appeals early in the case.\nBy Eileen Sullivan\nThe U.S. government has lost 84,000 jobs since January as the Trump administration aggressively reduces the work force.\nBy Sydney Ember and Eileen Sullivan\nA new government estimate, along with a study by the nonprofit Partnership for Public Service, provides a long-awaited window into the scale of the departures.\nBy Eileen Sullivan\nThe guidance protects employees and supervisors seeking to recruit fellow federal workers to their religion. The Clinton White House issued similar guidelines in 1997, though with more caveats.\nBy Eileen Sullivan\nFired employees have struggled to get a judge to hear their cases because Congress set up a separate system to referee such employment disputes.\nBy Eileen Sullivan\nMore than 750 workers have resigned with incentives, and more than 150 others have resigned without. The agency has also laid off 129 people.\nBy Eileen Sullivan\nOne thing is clear from a reporter’s conversations with laid-off federal workers this year: The cuts have been anything but straightforward and efficient.\nBy Eileen Sullivan\nFormer government employees are finding that perhaps the only thing harder than getting laid off from the federal government is staying that way.\nBy Eileen Sullivan"
    },
    {
      "url": "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations-source",
      "text": "EXCLUSIVE: Attorney General Pam Bondi directed her staff Monday to act on the criminal referral from Director of National Intelligence Tulsi Gabbard related to the alleged conspiracy to tie President Donald Trump to Russia, and the Department of Justice is now opening a grand jury investigation into the matter, Fox News Digital has learned.\nBondi personally ordered an unnamed federal prosecutor to initiate legal proceedings and the prosecutor is expected to present department evidence to a grand jury, which would allow the department to secure a potential indictment, according to a letter from Bondi reviewed by Fox News Digital and a source familiar with the investigation.\nA DOJ spokesperson declined to comment on the report of an investigation but said Bondi is taking the referral from Gabbard \"very seriously.\" The spokesperson said Bondi believed there is \"clear cause for deep concern\" and a need for next steps.\nThe DOJ confirmed two weeks ago it received a criminal referral from Gabbard. The referral included a memorandum titled \"Intelligence Community suppression of intelligence showing ‘Russian and criminal actors did not impact’ the 2016 presidential election via cyber-attacks on infrastructure\" and asked that the DOJ open an investigation.\nNo charges have been brought at this stage of the investigation against any potential defendants.\nThe revelation that the DOJ is moving forward with a grand jury probe comes after Gabbard declassified intelligence in July that shed new light on the Obama administration’s alleged determination that Russia sought to help Trump in the 2016 election.\nFormer President Barack Obama and his intelligence officials allegedly promoted a \"contrived narrative that Russia interfered in the 2016 election to help President Trump win, selling it to the American people as though it were true. It wasn't,\" Gabbard said during a press briefing of the intelligence.\nAmong the declassified material was a meeting record revealing how Obama allegedly requested his deputies prepare an intelligence assessment in December 2016, after Trump had won the election, that allegedly detailed the \"tools Moscow used and actions it took to influence the 2016 election.\"\nThat intelligence assessment stressed that Russia's actions did not affect the outcome of the election but rather were intended to sow distrust in the democratic process.\nGabbard has alleged that Obama and his national security officials laid the \"groundwork\" for a narrative that then-candidate Trump and his campaign colluded to help him win the 2016 election. An FBI investigation and two special counsel investigations loomed over much of Trump's first administration.\nCLICK HERE TO GET THE FOX NEWS APP\nIt is unclear whom the grand jury is expected to target and what charges could be in play given the statutes of limitations for much of the activity from nearly a decade ago have lapsed.\nFormer Obama intelligence officials, including John Brennan, James Clapper and James Comey, have drawn scrutiny from Trump officials for their alleged involvement in developing intelligence that undermined Trump's 2016 victory.\nThis is a developing story. Check back for updates."
    }
  ],
  "argos_summary": "A federal judge in Massachusetts has temporarily blocked the Trump administration from ending a disaster mitigation program, which provides funding for projects like safe rooms and flood management. The ruling came after a coalition of 20 Democratic-led states sued the administration, arguing that the suspension of the program would expose states to increased disaster risks. The judge's decision prevents the diversion of over $4 billion allocated for the program until the case is resolved.",
  "argos_id": "DYMR9THJZ"
}