{
  "url": "https://www.seattletimes.com/nation-world/nation/trump-administration-calls-out-human-rights-records-of-some-nations-accepting-deported-migrants/",
  "authorsByline": "MATTHEW LEE",
  "articleId": "ef97f97b6b654576800bb8d50e116b64",
  "source": {
    "domain": "seattletimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "WA",
      "county": "King County",
      "city": "Seattle",
      "coordinates": {
        "lat": 47.6038321,
        "lon": -122.330062
      }
    }
  },
  "imageUrl": "https://images.seattletimes.com/wp-content/uploads/2025/08/urnpublicidap.orgd28ae08a0134a8ca7a6bf77c14bfd289Trump_77621.jpg?d=1200x630",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T12:01:28-07:00",
  "addDate": "2025-08-12T19:22:59.423835+00:00",
  "refreshDate": "2025-08-12T19:22:59.423838+00:00",
  "score": 1.0,
  "title": "Trump administration calls out human rights records of some nations accepting deported migrants",
  "description": "The Trump administration's new human rights reports for countries worldwide eliminate mentions of discrimination faced by LGBTQ people and reduce a previous focus on reproductive rights.",
  "content": "WASHINGTON (AP) — The Trump administration on Tuesday released human rights reports for countries worldwide, which eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians.\n\nThe reports, which cover 2024 before President Donald Trump took office, reflect his administration’s focus on free speech and protecting the lives of the unborn. However, the reports also offer a glimpse into the administration’s view of dire human rights conditions in some countries that have agreed to accept migrants deported from the United States under Trump’s immigration crackdown.\n\n“This year’s reports were streamlined for better utility and accessibility in the field and by partners,” the State Department said.\n\nThe congressionally mandated reports in the past have been frequently used for reference and cited by lawmakers, policymakers, academic researchers and others investigating potential asylum claims or looking into conditions in specific countries.\n\nThe reports were delayed by the Trump administration’s changes\n\nThe reports had been due to be released in March. The State Department said in an overview that the delay occurred because the Trump administration decided in March to “adjust” the reports, which had been compiled during the Biden administration. Among other deletions, the reports do not include accounts from individual abuse survivors or witnesses.\n\n“Frequently, eyewitnesses are intimidated or prevented from reporting what they know,” the overview said. “On the other hand, individuals and groups opposed to a government may have incentive to exaggerate or fabricate abuses. In similar fashion, some governments may distort or exaggerate abuses attributed to opposition groups.”\n\nHuman rights groups decried the changes in focus and omissions of certain categories of discrimination and potential abuse.\n\nThe new reports “reveal a disturbing effort by the Trump administration to purposefully fail to fully capture the alarming and growing attacks on human rights in certain countries around the globe,” Amnesty International said in a statement.\n\nThe reports do follow previous practices in criticizing widespread human rights abuses in China, Iran, North Korea and Russia.\n\nLaying out the poor human rights records of countries accepting migrant deportees\n\nAlthough such deportations did not begin until after Trump took office, the reports, with one notable exception, detail general poor human rights conditions in many of the countries that have agreed to accept migrants, even if they are not citizens of that nation.\n\nThe exception is El Salvador, which was the first of several countries in Latin America and Africa to agree to accept non-citizen migrant deportees from the U.S. Despite claims from rights advocates to the contrary, the report about the country says “there were no credible reports of significant human rights abuses” in El Salvador in 2024 and that “the government took credible steps to identify and punish officials who committed human rights abuses.”\n\nHuman rights groups have accused authorities of abuses, including at a notorious prison where many migrants are sent.\n\nHowever, for Eswatini — a small country in Africa formerly known as Swaziland — South Sudan and Rwanda, the reports paint a grimmer picture. All have agreed to accept third-country deportees from the United States.\n\nIn all three countries, the reports noted “significant human rights issues included credible reports of arbitrary or unlawful killings, torture and cruel, inhuman, or degrading treatment or punishment … serious restrictions on freedom of expression and media freedom, prohibiting independent trade unions or significant or systematic restrictions on workers’ freedom of association.”\n\nThose governments “did not take credible steps or action to identify and punish officials who committed human rights abuses,” the reports said.\n\nSingling out the treatment of white South Africans\n\nSouth Africa was also singled out for its human rights situation “significantly worsening.” The report pointed to unfair treatment of white Afrikaners following the signing of major land reforms that the Trump administration has said discriminate against that minority, which ran the country’s apartheid government.\n\nThat system brutally enforced racial segregation, which oppressed the Black majority, for 50 years before ending in 1994.\n\nWith the signing of that law in December, the report said that “South Africa took a substantially worrying step towards land expropriation of Afrikaners and further abuses against racial minorities in the country.”\n\nIt also said the government “did not take credible steps to investigate, prosecute and punish officials who committed human rights abuses, including inflammatory racial rhetoric against Afrikaners and other racial minorities, or violence against racial minorities.”\n\nThis year, the administration admitted as refugees some groups of white Afrikaners.\n\nThe reports take issue with what the Trump administration believes are restrictions on free speech imposed against generally right-wing voices in the United Kingdom, France and Germany. The reports use identical language to say that human rights conditions in each of the three NATO allies “worsened during the year.”\n\nThe executive summaries for each of the three reports say “significant human rights issues included credible reports of serious restrictions on freedom of expression, including enforcement of or threat of criminal or civil laws in order to limit expression; and crimes, violence, or threats of violence motivated by antisemitism.”\n\nThese governments have rejected such assertions that have been made by senior U.S. officials, including Trump, Vice President JD Vance and Secretary of State Marco Rubio.\n\nSimilar freedom-of-speech issues were raised in Brazil, which has more recently provoked Trump’s ire by prosecuting his ally — former right-wing President Jair Bolsonaro — and led to the imposition of massive U.S. tariffs and sanctions against Brazil’s Supreme Court chief justice.\n\n“The human rights situation in Brazil declined during the year,” the report said. “The courts took broad and disproportionate action to undermine freedom of speech and internet freedom by blocking millions of users’ access to information on a major social media platform in response to a case of harassment.”\n\nIt added that the government “undermined democratic debate by restricting access to online content deemed to undermine democracy” and specifically mentioned suppressing the speech of Bolsonaro and his supporters.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "human rights reports",
      "weight": 0.11868571
    },
    {
      "name": "human rights abuses",
      "weight": 0.108968
    },
    {
      "name": "significant human rights abuses",
      "weight": 0.10555042
    },
    {
      "name": "human rights",
      "weight": 0.10483974
    },
    {
      "name": "Human rights groups",
      "weight": 0.102449
    },
    {
      "name": "widespread human rights abuses",
      "weight": 0.102150165
    },
    {
      "name": "human rights conditions",
      "weight": 0.101924114
    },
    {
      "name": "human rights records",
      "weight": 0.09934136
    },
    {
      "name": "significant human rights issues",
      "weight": 0.09885907
    },
    {
      "name": "dire human rights conditions",
      "weight": 0.095762864
    }
  ],
  "topics": [
    {
      "name": "Social Issues"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.970703125
    },
    {
      "name": "/People & Society/Social Issues & Advocacy/Other",
      "score": 0.93408203125
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.91845703125
    },
    {
      "name": "/Law & Government/Government/Visa & Immigration",
      "score": 0.73583984375
    },
    {
      "name": "/Sensitive Subjects/Other",
      "score": 0.4990234375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.368408203125
    },
    {
      "name": "/People & Society/Other",
      "score": 0.309814453125
    }
  ],
  "sentiment": {
    "positive": 0.056725524,
    "negative": 0.6913959,
    "neutral": 0.25187853
  },
  "summary": "The Trump administration has released human rights reports for countries worldwide, which cover 2024 before President Donald Trump took office. The reports eliminate mentions of discrimination faced by LGBTQ people, reduce a previous focus on reproductive rights, and criticize restrictions on political speech by U.S. allies in Europe that American officials believe target right-wing politicians. However, they also highlight dire human rights conditions in some countries that have agreed to accept migrants from the United States. The State Department stated that these reports were streamlined for better utility and accessibility. Amnesty International criticized the changes, accusing the administration of failing to fully capture the attacks on human rights in certain countries.",
  "shortSummary": "The Trump administration’s human rights reports omit discrimination and political restrictions, highlighting poor conditions in some countries and urging action against abuses.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "3c442d6f995e45f7ab95c5d3af17cb60",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Trump administration's recently released human rights reports for 2024 have drawn criticism for omitting references to LGBTQ discrimination and reproductive rights, while emphasizing free speech and the treatment of right-wing politicians in Europe. The reports highlight poor human rights conditions in countries accepting U.S. migrant deportees, with notable exceptions like El Salvador, which was reported to have no significant abuses. Additionally, the reports criticize the worsening human rights situation in South Africa regarding the treatment of white Afrikaners and express concerns over free speech restrictions in several NATO allies and Brazil.",
  "argos_id": "E27MOK4BF"
}