{
  "url": "https://www.marketwatch.com/story/bellway-expects-volume-output-cash-generation-growth-in-year-ahead-20932195",
  "authorsByline": "",
  "articleId": "134d32c036b84dbfa514a0e6e6ea6b0f",
  "source": {
    "domain": "marketwatch.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T06:31:00+00:00",
  "addDate": "2025-08-12T06:36:33.271340+00:00",
  "refreshDate": "2025-08-12T06:36:33.271343+00:00",
  "score": 1.0,
  "title": "Bellway Expects Volume Output, Cash Generation Growth in Year Ahead",
  "description": "Bellway Expects Volume Output, Cash Generation Growth in Year Ahead",
  "content": "Bellway said it is well-placed to grow its volume output and increase cash generation for shareholder returns in fiscal 2026 after a good start to the year on the back of a solid performance for fiscal 2025.\n\nThe London-listed house builder on Tuesday said housing revenue for the year ended July 31 rose 17% to more than 2.76 billion pounds ($3.71 billion), in line with its previous guidance, with its operating margin expected to near 11%, up from 10%.\n\nDue to growth in private output, housing completions increased 14% to 8,749 homes at an overall average selling price of around 316,000 pounds, it added.\n\nGood volume output growth and an improvement in its underlying margin should drive a strong rise in fiscal 2025 profits, it said.\n\nThe group's forward order book at the end of the period stood at 5,307 homes, compared with 5,759 homes at June 1 and 5,144 a year prior, given the high level of private reservations during the year.\n\n\"We have entered the new financial year with a healthy forward order book and outlet opening program and, if market conditions remain stable, we are well-positioned to deliver further growth in FY26,\" Chief Executive Jason Honeyman said. Bellway plans to grow its volume output to around 9,200 homes in the new fiscal year and expects to maintain broadly flat average outlet numbers.\n\nThe group will give an update on its capital allocation framework and targets when it publishes its fiscal 2025 results on Oct. 14.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Good volume output growth",
      "weight": 0.11565086
    },
    {
      "name": "Volume Output",
      "weight": 0.10524416
    },
    {
      "name": "Year",
      "weight": 0.100156344
    },
    {
      "name": "private output",
      "weight": 0.09553763
    },
    {
      "name": "Cash Generation Growth",
      "weight": 0.0949305
    },
    {
      "name": "further growth",
      "weight": 0.08427133
    },
    {
      "name": "outlet opening program",
      "weight": 0.076615706
    },
    {
      "name": "growth",
      "weight": 0.07577734
    },
    {
      "name": "cash generation",
      "weight": 0.07467576
    },
    {
      "name": "the new fiscal year",
      "weight": 0.073298894
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97265625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.85400390625
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.83642578125
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.7685546875
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.74072265625
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.6064453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.53662109375
    },
    {
      "name": "/Business & Industrial/Construction & Maintenance/Other",
      "score": 0.3759765625
    }
  ],
  "sentiment": {
    "positive": 0.8972778,
    "negative": 0.029069165,
    "neutral": 0.07365306
  },
  "summary": "London-based house builder, Bellway, expects to grow its volume output and increase its cash generation for fiscal 2026. The company reported a 17% increase in housing revenue for the year ending July 31, with its operating margin expected to near 11%, up from 10%. Housing completions increased by 14% to around 8,749 homes at an average selling price of around 316,000 pounds. The forward order book at the end of the period stood at 5,307 homes, compared to 5,759 homes the previous year.",
  "shortSummary": "Bellway expects strong volume output and cash generation in fiscal 2026, driven by strong housing revenue growth and improved operating margins, with plans for future growth outlined.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "ae83ee42f5cc455782bd730ffe29c96c",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Bellway reported a 17% increase in housing revenue for the fiscal year ending July 31, reaching over £2.76 billion, with an expected operating margin of nearly 11%. Housing completions rose by 14% to 8,749 homes, driven by growth in private output. The company aims to increase its volume output to approximately 9,200 homes in fiscal 2026, supported by a healthy forward order book and stable market conditions.",
  "argos_id": "E9Z3J4IQX"
}