{
  "url": "https://www.macrumors.com/2025/08/12/iphone-17-price-rumors/",
  "authorsByline": "Juli Clover",
  "articleId": "7db4680e0b8a4871b0376d892a240873",
  "source": {
    "domain": "macrumors.com",
    "paywall": false,
    "location": null
  },
  "imageUrl": "https://images.macrumors.com/t/Ufsb9z04_Vo8xRPg8_Z9ZtHQuyE=/2500x/article-new/2025/07/iPhone-17-Pro-Dark-Blue-and-Orange.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T13:42:11-07:00",
  "addDate": "2025-08-12T20:52:21.519971+00:00",
  "refreshDate": "2025-08-12T20:52:21.519974+00:00",
  "score": 1.0,
  "title": "Will the iPhone 17 Cost More? All the Rumors About a Price Increase",
  "description": "With Apple paying tariffs on imports from many of the countries where it sources devices and device components, there have been multiple rumors about...",
  "content": "With Apple paying tariffs on imports from many of the countries where it sources devices and device components, there have been multiple rumors about possible price increases for the iPhone 17 models.\n\n\n\nThe tariff situation has been in flux for most of the year, leading to a lot of uncertainty. We've rounded up the pricing rumors we've heard so far, and provided context on the latest tariff situation.\n• Jeff Pu (GF Securities), August 2025 - Prices are \"likely\" to go up, no specific numbers provided.\n• Instant Digital (Weibo), August 2025 - iPhone 17 Pro to be $50 more expensive, but start with 256GB of storage instead of 128GB.\n• Edison Lee (Jefferies), July 2025 - Prices will go up $50 across the ‌iPhone 17‌ lineup.\n• WSJ, May 2025 - Apple considering increasing ‌iPhone 17‌ prices. No specific numbers provided.\n• Reuters, April 2025 - iPhone could cost up to $2,300 with tariffs.\n• CNBC, April 2025 - Apple would need to raise prices by 17 to 18 percent to offset tariffs.\n• Counterpoint Research, April 2025 - Apple would need to raise prices 30 percent to offset tariffs.\n\nMost speculation about a potential price increase is outdated at this point, or analysts have shied away from providing specific numbers. The most concrete recent rumor we've seen is the July Jefferies prediction suggesting a $50 increase across the lineup.\n\n\n\nWhen high reciprocal tariffs were first announced against countries like China, India, Vietnam, and Malaysia in April, there were fears that Apple could be hit with huge fees. Tariffs were pushed back, negotiated, and Apple CEO Tim Cook was at work behind the scenes negotiating, and at this point, Apple is going to be subject to minimal tariffs.\n\nShortly after the tariffs were announced, the Trump administration exempted a long list of products from being subject to tariffs, and that list included almost all of Apple's devices. The ‌iPhone‌, iPad, Mac, Apple Watch, and other Apple devices are exempt from reciprocal tariffs, which were the highest tariffs that were put in place.\n\nThe upcoming 50 percent tariff on imported goods from India is a reciprocal tariff, which Apple does not have to pay at the current time. Apple also does not pay the current 25 percent fee. The high reciprocal tariffs on China are paused again, but Apple wouldn't need to pay that anyway.\n\nWhen semiconductors and related products were exempted from reciprocal tariffs in April, Trump promised that there was a semiconductor-specific tariff in the works that could be applicable to Apple.\n\nEarlier this month, Trump claimed there would be a 100 percent tariff on chips and semiconductors imported into the United States, but he said that companies that are building in the United States or that have committed to building in the U.S. will not have to pay those tariffs.\n\nApple has pledged to spend $600 billion on U.S. manufacturing, and won't have to pay that semiconductor tariff. That tariff isn't in place yet, and the terms are unknown, so it's still just talk at this point.\n\n\n\nWhile Apple is exempt from the reciprocal tariff fees on semiconductors and related devices, it does have to pay other tariffs that are in place. That includes the 20 percent \"Fentanyl Tariff\" on goods imported from China that Trump enacted earlier this year, and tariffs on products that are not exempt.\n\nDuring Apple's July earnings call, Apple CEO ‌Tim Cook‌ said that Apple paid $800 million in tariff related costs in the June quarter, and that it is expecting $1.1 billion in tariff costs in the September quarter. That estimate assumes the current tariff situation remains unchanged and no additional tariffs are added.\n\n\n\nSo Will Prices Go Up?\n\nIn Q4 2024, ‌iPhone‌ revenue was $46 billion. If we use that number and the $1.1 billion estimate from Apple, tariffs would eat up around 2.4 percent of ‌iPhone‌ revenue. Apple could make that up by increasing costs around $20 per ‌iPhone‌. Increasing costs of one model by $50 (as rumored for the ‌iPhone 17 Pro‌) could also help offset the cost without Apple having to raise prices on all devices.\n\nThe $1.1 billion is not only applicable to the ‌iPhone‌ and applies to all products, so the iPhone-specific impact would be lower.\n\nOf course, that assumes the tariffs are not changing, and it also doesn't take into account any potential component cost increases. Apple's exemption from some tariffs does not mean that the company's suppliers aren't seeing an effect from tariffs and other related pressures.\n\nApple hasn't raised the $799 price of the base ‌iPhone‌ model for the last five years, so price increases on some models while keeping the base price intact seems like a possibility.\n\nApple also has a wild card slot with the iPhone 17 Air, because it's an all-new device and we don't have an existing model to compare it to. Right now, rumors suggest it'll be $899, which is the same starting price as the iPhone 16 Plus.\n\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.",
  "medium": "Article",
  "links": [
    "https://www.macrumors.com/roundup/iphone-17/",
    "https://www.macrumors.com/2025/08/09/iphone-17-higher-prices-likely-says-analyst/",
    "https://forums.macrumors.com/forums/political-news.218/",
    "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
    "https://www.macrumors.com/roundup/iphone-16/",
    "https://www.macrumors.com/2025/07/30/iphone-17-price-increase-expected/",
    "https://www.macrumors.com/2025/08/08/iphone-17-pro-minimum-256gb-storage-up-from-128gb/",
    "https://www.macrumors.com/guide/iphone/",
    "https://www.reuters.com/technology/will-trump-tariffs-make-apple-iphones-more-expensive-2025-04-03/",
    "https://forums.macrumors.com/forums/iphone.99",
    "https://www.macrumors.com/guide/tim-cook/",
    "https://www.macrumors.com/2025/04/04/2300-dollar-iphone/",
    "https://www.macrumors.com/2025/08/06/apple-india-tariff-increase-no-impact/",
    "https://www.macrumors.com/2025/05/12/apple-considering-price-increases-iphone-17/",
    "https://www.macrumors.com/2025/04/14/trump-semiconductor-tariffs-apple/",
    "https://www.macrumors.com/roundup/iphone-17-air/",
    "https://www.cnbc.com/2025/04/03/trump-tariffs-will-impact-apples-non-china-supply-chains.html",
    "https://www.macrumors.com/roundup/iphone-17-pro/",
    "https://www.macrumors.com/roundup/ipad/",
    "https://www.macrumors.com/2025/08/06/trump-100-percent-tariff-chips/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "reciprocal tariffs",
      "weight": 0.1172207
    },
    {
      "name": "tariff costs",
      "weight": 0.11709409
    },
    {
      "name": "Tariffs",
      "weight": 0.11334015
    },
    {
      "name": "tariffs",
      "weight": 0.11334015
    },
    {
      "name": "other tariffs",
      "weight": 0.11272659
    },
    {
      "name": "high reciprocal tariffs",
      "weight": 0.110647134
    },
    {
      "name": "tariff related costs",
      "weight": 0.11026187
    },
    {
      "name": "minimal tariffs",
      "weight": 0.109151594
    },
    {
      "name": "other Apple devices",
      "weight": 0.10516602
    },
    {
      "name": "Apple CEO",
      "weight": 0.10099486
    }
  ],
  "topics": [
    {
      "name": "Electronics"
    },
    {
      "name": "iPhone"
    }
  ],
  "categories": [
    {
      "name": "Tech"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Technology News",
      "score": 0.9072265625
    },
    {
      "name": "/Computers & Electronics/Software/Operating Systems",
      "score": 0.8505859375
    },
    {
      "name": "/Internet & Telecom/Mobile & Wireless/Mobile Phones",
      "score": 0.73583984375
    },
    {
      "name": "/Shopping/Consumer Resources/Product Reviews & Price Comparisons",
      "score": 0.70068359375
    }
  ],
  "sentiment": {
    "positive": 0.19159047,
    "negative": 0.30535823,
    "neutral": 0.50305134
  },
  "summary": "Apple is reportedly considering increasing prices for the iPhone 17 models due to tariffs paid to imports from countries where it sources devices and components. The company is exempt from the reciprocal tariff fees on semiconductors and related devices, but it does have to pay other tariffs, including the 20 percent \"Fentanyl Tariff\" on goods imported from China and tariffs on products that are not exempt. The most recent rumor suggests a $50 increase across the ‌iPhone 17‌ lineup. However, tariffs could eat up around 2.4 percent of  iPhone  revenue. Apple's CEO, Tim Cook, stated that during Q4 2024,  Apple received $800 million in tariff related costs in the June quarter and expects $1.1 billion in tariff costs in Q1 2019.",
  "shortSummary": "Apple may raise the iPhone 17 models due to tariffs on imports, despite being exempt from certain tariffs and ongoing negotiations to avoid fees.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "f770e9739b1b41b2916a82214322f0d1",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.macrumors.com/2025/08/06/trump-100-percent-tariff-chips/",
      "text": "Trump Announces 100% Tariff on Semiconductors, With Exemptions for Companies Building in the U.S.\nU.S. President Donald Trump today said that there will be a 100 percent tariff on chips and semiconductors imported into the United States, but with a major exception.\nCompanies that are building in the United States, or that have made a commitment to build in the U.S., will not have to pay the tariffs. Since Apple pledged to spend $600 billion on U.S. manufacturing, the company will presumably be exempted from the planned chip tariffs.\n\"If you're building in the United States, or made a commitment to build or are in the process, there's no charge,\" Trump said. He added that if companies promise to bring manufacturing to the U.S. and don't follow through, tariffs will be \"added up\" and \"charged at a later date.\"\nThe Trump administration exempted semiconductors and derivative products like the iPhone from reciprocal tariffs in countries like China and India, but Trump has been promising to levy high fees on chip imports.\nApple sources its chips from Taiwan Semiconductor Manufacturing Company (TSMC), and there were fears that chip tariffs could have a significant impact on Apple's costs as a result. For now, it looks like Apple is going to avoid any additional tariffs on the chips that it uses for its devices. Trump made the announcement during a White House press event with Apple CEO Tim Cook, where Cook announced an additional U.S. manufacturing investment. There is no word on when semiconductor tariffs will be put in place.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.cnbc.com/2025/04/03/trump-tariffs-will-impact-apples-non-china-supply-chains.html",
      "text": "In the past few years, Apple has sold Americans iPhones made in India, AirPods from Vietnam and Mac desktops assembled in Malaysia. It was part of a strategy by Apple to diversify its manufacturing from China.\nApple employed the strategy as a hedge for its supply chain after the company dealt with tariffs by the first Trump administration, supply chain issues tied to Covid and chip shortages that revealed the risk the company was at by primarily producing out of China.\nIt seemed like a solid strategy. Until President Donald Trump's \"reciprocal tariffs\" this week hit those countries, too.\nNow, Apple is leading the decline among technology stocks on Thursday after the company's secondary production locations were all included in the round of tariffs announced by Trump on Wednesday.\nThe company's shares fell over 9% on Thursday versus a 6% decline for the Nasdaq. That wiped out over $300 billion in market cap for the iPhone maker and was the worst one-day performance for the stock since March 2020.\n\"When you look at the reciprocal tariff to countries like markets like Vietnam, India, and Thailand, where Apple diversified its supply chain to, there's nowhere to escape,\" Morgan Stanley analyst Erik Woodring told CNBC's \"Closing Bell.\"\nTo offset the price of the tariffs, Apple may have to raise prices across its product lines by 17% to 18% in the U.S., Woodring estimates. But there's still a lot of uncertainty about what Apple will do and how China might retaliate against the United States, Woodring said.\n\"In this type of environment, you have to think worst-case scenario,\" he said. \"It seems like each side in this geopolitical scenario is kind of digging in.\"\nApple didn't respond to a request for comment on Thursday on its reaction to the Trump tariffs or if it might raise prices in the U.S. It also hasn't commented on CEO Tim Cook's reported meetings with Trump this year or what they've discussed.\n\"We are monitoring the situation and don't have anything more to add than that,\" Cook told analysts on an earnings call in January.\nApple could still get product exemptions on U.S. tariffs, similar to how it navigated tariffs on China during the first Trump administration. But if it doesn't, tariffs will threaten its business.\n\"Substantially all\" of Apple's manufacturing is done in China, India, Japan, South Korea, Taiwan and Vietnam, according to a financial filing in November. Apple warned investors that tariffs could hurt its business, prompt it to increase its prices and even force it to stop offering certain products altogether.\nApple's official list of suppliers – representing 98% of its spending on materials, manufacturing, and assembly – is heavily weighted to countries disproportionately affected by Trump tariffs.\nIndia has a 26% tariff, Japan got a 24% duty, South Korea is at 25%, Taiwan is 32%, Vietnam got 46% tariffs placed and Malaysia received a 24% tariff. China, meanwhile, is now at a 54% tariff rate after Wednesday's 34% bump to its existing 20% tariffs.\n\"The impact can be particularly significant if these restrictive measures apply to countries and regions where the Company derives a significant portion of its revenues and/or has significant supply chain operations,\" Apple wrote in the filing.\nThe tariffs are intended to bring manufacturing back to the U.S., Trump has said. He specifically cited Apple during his announcement, saying \"they're going to build their plants here.\" Apple has manufactured a high-end desktop computer called Mac Pro in Texas, but the vast majority of its final assembly takes place overseas.\nApple's $500 billion U.S. investment, touted by Trump on Wednesday, includes planned purchases of parts and chips from U.S. suppliers, but the company hasn't committed to manufacturing its high-volume products on American shores.\nThe company's resistance to doing final manufacturing in the U.S. is a long-running stance for the company. In 2011, late Apple founder Steve Jobs told former president Barack Obama that \"those jobs aren't coming back\" when asked about made-in-USA iPhones.\nAnalysts agree that's unlikely as it would be expensive for Apple to bring its supply chain to the U.S.\n\"The reality is it would take 3 years and $30 billion dollars in our estimation to move even 10% of its supply chain from Asia to the US with major disruption in the process,\" Wedbush analyst Dan Ives wrote in a Thursday note.\nApple investors will want to know how much Trump's tariffs will hurt the company's earnings.\nEarlier this year, several analysts forecast relatively small declines in the company's earnings-per-share under a new trade regime, partially based on the assumption that Apple could use its secondary production locations to avoid tariffs on U.S. goods imported from China.\nNow, analysts are trying to model how Apple could balance price increases to its products versus eating the extra costs itself. Apple doesn't often raise prices outside of a new product introduction, and it's expected to release new phones in September.\n\"No doubt that if the tariffs stick, it will have a negative impact on Apple's fundamentals, with downside to margin and earnings expectations,\" CFRA Research analyst Angelo Zino wrote in a Thursday note.\nWATCH: Which Megacaps are best positioned to weather Trump tariffs"
    },
    {
      "url": "https://www.macrumors.com/2025/08/09/iphone-17-higher-prices-likely-says-analyst/",
      "text": "iPhone 17 Models 'Likely' to Have Higher Prices, Another Analyst Says\niPhone 17 models will \"likely\" be more expensive than iPhone 16 models in the U.S., according to Jeff Pu, an analyst at investment firm GF Securities.\nIn a research note this week, Pu attributed the potential iPhone 17 price increases to the U.S. imposing tariffs on products imported from countries where the iPhone is assembled, including China and India. Apple is currently paying a 20% tariff on iPhones imported from China, but none on iPhones imported from India, according to The Wall Street Journal. However, the Trump administration's tariff policies frequently change.\nOn an earnings call last week, Apple CEO Tim Cook said the majority of the iPhones sold in the U.S. are imported from India currently.\nWall Street analysts have estimated that iPhone 17 models could be $50 to $100 more expensive than the equivalent iPhone 16 models, but this is likely guesswork. Even if prices do increase, Apple could find clever ways to spin the situation, such as by raising the iPhone 17 Pro's minimum storage capacity from 128GB to 256GB. That would bring the Pro model in line with the Pro Max model, which has started at the 256GB mark for a few years now.\nIn the U.S., Apple has maintained a $999 starting price for the Pro model or equivalent since the iPhone X was released all the way back in 2017, despite rumors about potential price increases year after year. So, Apple has earned the benefit of the doubt on pricing until proven otherwise. On the other hand, nothing lasts forever.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/roundup/ipad/",
      "text": "iPad\nApple's 11-inch iPad with Apple Pencil and Magic Keyboard Folio support, starting at $349.\nShould You Buy an Entry-Level iPad?\nThe iPad is Apple's most affordable and most popular tablet. The 11th-generation model includes an A16 chip, a design with flat sides and a range of color options, an 11-inch display, a USB-C port, and more, with prices that start at $349.\nIntroduced in March 2025, the 11th-generation iPad is at the beginning of its product cycle, which means now is a good time to buy. A new model isn't expected until March 2026 at the earliest.\nThe iPad is Apple's most inexpensive iPad model for those who want a balance of features and affordability, but users looking for a smaller iPad with better specifications should consider the iPad mini, which starts at $499 and has a faster A17 Pro chip. On the other hand, for an iPad with better specifications, there is the $599 iPad Air, which offers a faster M3 chip, features like Stage Manager, and improved display technologies.\nApple's 2025 iPad\nContents\nApple introduced the latest low-cost iPad in March 2025, adding an upgraded A16 chip, 128GB of starting storage, and a few other minor tweaks, but no major changes or design updates. Unlike many of Apple's other recently updated devices, the iPad 11 does not support Apple Intelligence.\nThe 11th-generation iPad has the same squared-off all-display design of the iPad mini and iPad Air and it comes in Silver, Blue, Pink, and Yellow. Instead of a Home button, there is a Touch ID Top button of the iPad, and a front-facing camera at the landscape edge of the device for video calls while the iPad is in landscape mode.\nThe 11th-generation iPad offers an 11-inch Liquid Retina display with a resolution of 2360 by 1640 pixels, 500 nits of brightness, and True Tone technology, but it does not have some of the bells and whistles of other iPad displays such as an anti-reflective coating.\nThe iPad now features Apple's A16 chip with a 5-core CPU and a 4-core GPU. The A16 chip does not support Apple Intelligence, but it is faster than the prior-generation A14 chip that was in the iPad 10.\nThe iPad features a 12-megapixel camera with support for 4K video recording and upgraded Smart HDR 4, Wi-Fi 6 support, Bluetooth 5.3, and 5G connectivity on cellular models.\nThe iPad supports the USB-C Apple Pencil and the the first-generation Apple Pencil with an adapter to charge and pair it. The 11th-generation iPad also works with the Magic Keyboard Folio, which offers full-size keys with 1 mm of travel, a multi-touch trackpad, a function row, a two-piece design, and a kickstand back cover.\nThe iPad starts at $349 for 128GB of storage and is available for preorder from the Apple online store and Apple retail stores. The original Apple Pencil is available separately for $99, as is the USB-C Apple Pencil, priced at $79. The Magic Keyboard Folio is sold separately too for $249.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nHow to Buy\nThe 11-inch 11th-generation iPad can be ordered from the online Apple Store and the retailers starting at $349.\nDesign\nWith the launch of the 10th-generation iPad, Apple overhauled the design, introducing a look similar to the iPad Pro and the iPad Air with an all-display design and no Home button, and there have been no changes to that design with the 11th-generation iPad.\nThere is an edge-to-edge display with slim bezels and an aluminum chassis with flat, rounded edges, much like the iPad Air. The iPad 11 comes in four colors, including blue, pink, silver, and yellow.\nThe iPad measures in at 9.79 inches (248.6 mm) long, 7.07 inches (179.5 mm) wide, and 0.28 inches (7 mm) thick. It is just a bit bigger than the iPad Air, but a good deal thicker than its 6.1-mm sibling. It weighs in at 1.05 pounds (477 grams) with cellular models weighing just a few grams more.\nThough there is an all-display design, the iPad does not use Face ID. Like the iPad Air and the iPad mini, it has a Touch ID fingerprint sensor built into the power button. The fingerprint sensor scans the finger much like a Touch ID Home button, but it is smaller and more compact. Touch ID can be used to unlock the iPad, access apps, make purchases with Apple Pay, and more.\nThere is a single-lens camera at the back of the iPad, a front-facing camera on the right side of the front, along with speakers at the top and bottom, a microphone at the back, volume up and down buttons at the side, a USB-C port for charging, and a Smart Connector along the side edge for accessories.\nDisplay\nThe iPad has an 11-inch Retina LED display with a resolution of 2360 x 1640 at 264 pixels per inch. It is the least advanced display compared to the iPad Pro, iPad Air, and iPad mini models, which is how Apple keeps the iPad affordable.\nNote that Apple says the iPad 11 has an 11-inch display while the iPad 10 had a 10.9-inch display, but the display has not changed at all, and the difference comes from the way that Apple has decided to round the display size.\nThe display features 500 nits of brightness, and it supports True Tone. True Tone allows the temperature of the display to change to be warmer or cooler, matching the lighting in the room that you're in so there's not a stark difference between the color of the display and the ambient light.\nThe display is also equipped with a touch sensor that allows it to work with the Apple Pencil, and it has a fingerprint-resistant oleophobic coating.\nA16 Chip\nThe iPad is equipped with an A16 chip that was first used in the iPhone 14 Pro models, but it is worth noting that the A16 chip in the iPad 11 has a 5-core CPU, 4-core GPU, and a 16-core Neural Engine.\nThe A16 chip is up to 30 percent faster than the A14 Bionic chip from the prior-generation iPad. Apple says that the A16 is up to 6x faster than the best-selling Android tablet.\nAs the iPad has an A16 and not an A17 Pro or better, it does not support Apple Intelligence. The A16 is capable of running Final Cut Pro for iPad, though, and it is an affordable way to access professional video editing capabilities.\nStorage\nThe iPad starts with 128GB of storage, a new minimum in 2025. There are also 256GB and 512GB upgrade options, and the 512GB option is new this year.\nRAM\nThe iPad 11 has 6GB RAM, up from 4GB in the prior-generation model.\nBattery Life\nThe iPad is equipped with a 28.6-watt-hour lithium-polymer battery, and it continues to offer up to 10 hours of battery life when surfing the web or watching video.\nRear Camera\nThe iPad 11 uses a 12-megapixel Wide camera, which is the same camera that's in the iPad Air. It has an ƒ/1.8 aperture, Smart HDR 4 support, Burst mode, Live Photos with stabilization, autofocus with Focus Pixels, wide color capture, exposure control, auto image stabilization, noise reduction, and more.\n4K video recording is supported at 20, 30, or 60 frames per second, as is slo-mo video at 120 or 240 frames per second. The iPad can also record in 1080p at 30 or 60 frames per second, and it supports continuous autofocus, cinematic video stabilization, and the option to take 8-megapixel still photos when recording 4K video.\nFaceTime Camera\nThough there's no TrueDepth camera system to support Face ID in the iPad Air, there is a 12-megapixel Ultra Wide front facing camera with a 122 degree field of view and an ƒ/2.4 aperture. The camera supports Center Stage, designed to keep users perfectly framed on screen during video calls. With the wider field of view, the camera can zoom in as appropriate and follow people around the room as they move.\nWhen other people join in on a call, the camera is able to detect them, and it zooms out to fit everyone into the view. Center Stage is designed for FaceTime, but it also works with third-party video apps like Zoom and Skype.\nThe camera is positioned on the side of the iPad so that it is upright when in a landscape orientation, similar to the camera on a MacBook. This is the first time that Apple has used this particular camera orientation.\nOther Features\n5G\nCellular models of the 11th-generation iPad have a 5G chip that allows them to connect to 5G networks, but it does not support the fastest mmWave 5G networks and is limited to the slower but more widespread Sub-6GHz networks.\nmmWave 5G networks are the fastest 5G networks, but mmWave is short-range and can be obscured by buildings, trees, and other obstacles, so its use is limited to major cities and urban areas along with venues like stadiums, arenas, airports, and other places where a lot of people congregate. Sub-6GHz 5G is much more widely available and available in urban, suburban, and rural areas across the United States and other countries.\nThe prior-generation iPad 10 supported eSIM and had a physical SIM slot, but the new iPad 11 only has eSIM for selecting a cellular network.\nWi-Fi, Bluetooth, and Sensors\nThe iPad supports 802.11ax Wi-Fi 6 and Bluetooth 5.3. The iPad includes a three-axis gyro, an accelerometer, an ambient light sensor, and a barometer.\nUSB-C Port\nThe iPad is equipped with a USB-C charging port. The USB-C port in the 11th-generation iPad is slower than the USB-C port available in the iPad Pro, iPad Air, and iPad mini models. It is limited to USB 2.0 speeds of up to 480Mb/s for data transfer.\nAccessories\nApple Pencil\nThe iPad is compatible with both the $99 original Apple Pencil and the $79 USB-C Apple Pencil that Apple announced in October 2023.\nThe Apple Pencil is a stylus that's designed to offer unparalleled precision and integration with the iPad while also offering a natural feel that's similar to the sensation of using a pen or pencil on paper.\nThere are pressure and positioning sensors built into the original Apple Pencil to allow it to detect a range of forces for pressure-sensitive drawing and writing, but this feature is not available in the USB-C Apple Pencil. Two tilt sensors in the tip of the Apple Pencil determine the orientation and angle of the hand holding it, enabling shading techniques.\nThe Apple Pencil offers a 12-hour battery life and it charges through the built-in Lightning connector at the bottom of the device. A 15-second charge delivers a half-hour of power, so it's always going to have juice when needed.\nBecause the first-generation Apple Pencil charges using an integrated Lightning connector, to charge it with the iPad, a Lightning to USB-C adapter is required. The USB-C Apple Pencil has a hidden USB-C port so it needs a USB-C cable to charge.\nMagic Keyboard\nApple sells a $249 Magic Keyboard Folio alongside the iPad, with the accessory able to turn the iPad into a mini notebook. It is a full-size keyboard with a built-in trackpad and a 14-key function row.\nThe keyboard features two pieces, so a cover and kickstand can be used separately from the detachable keyboard. Both pieces magnetically attach to the iPad.\nWhat's Next for the iPad\nApple is working on a next-generation low-cost iPad with an updated chip, and it is expected to come out in early 2026."
    },
    {
      "url": "https://www.cnbc.com/2025/08/11/trump-china-tariffs-deadline-extended.html",
      "text": "President Donald Trump on Monday delayed high U.S. tariffs on Chinese goods from snapping back into place for another 90 days, a White House official told CNBC.\nThose tariffs were set to resume Tuesday. But Trump signed an executive order hours beforehand that extends the deadline until mid-November, according to the official.\nThe delay was the expected outcome from the latest round of talks between U.S. trade negotiators and their Chinese counterparts, which took place in Stockholm in late July.\nIf the deadline were not extended, then U.S. duties on China would have shot back up to where they stood in April, when the tariff war between the world's largest trading nations was at its peak.\nAt that time, Trump had cranked up blanket tariffs on Chinese imports to 145%, and China had retaliated with 125% duties on U.S. goods.\nBut the two sides agreed to pause most of those tariffs in May, after negotiators met for the first time in Geneva. The U.S. pared its tariffs back to 30%, and China dropped its levies to 10%.\nMonday's extension is the latest example of how Trump's on-again, off-again tariffs have shifted with little prior notice, a dynamic that has made U.S. trade policy unpredictable for many businesses.\nTrump has previously announced steep tariffs on countries or specific sectors, only to scale them back, tweak them or pause them days or weeks later.\nThe \"reciprocal tariffs\" he initially rolled out in early April, for instance, were quickly paused and then delayed multiple times before taking effect in an altered form last week.\nOn Sunday, Trump said he wanted China to \"quickly quadruple\" its orders of U.S. soybeans.\n\"This is also a way of substantially reducing China's Trade Deficit with the USA,\" Trump wrote in a Truth Social post.\nChicago soybean prices rose Monday. It was not immediately clear if China has agreed to step up its soybean purchases in response to Trump's post."
    },
    {
      "url": "https://www.macrumors.com/roundup/iphone-17-pro/",
      "text": "Apple's iPhone 17 Pro Models\nContents\nThis September, Apple will introduce the iPhone 17 Pro and the iPhone 17 Pro Max, two new high-end flagship devices that will be sold alongside the iPhone 17 and the all-new ultra-thin iPhone 17 \"Air\" that's replacing the iPhone 17 Plus.\nWe have under two months to go until the new 2025 iPhones come out, but leakers, analysts, and others with insider information about Apple's plans have shared details on what we can expect from the new devices, and so we have quite a bit of insight into the changes that Apple has in store.\nThe iPhone 17 Pro models will get a refreshed design for the rear casing and the camera area. Rumors suggest Apple could go with a part glass, part aluminum build, which would increase durability. The glass would allow wireless charging to continue to be available, but a partial aluminum frame would be less prone to breakage.\nWe're also expecting an update to the rear camera, with some rumors suggesting Apple is working on a horizontal camera bump that would be a major deviation from the current square-shaped camera arrangement. With this setup, there would be a centered, horizontal camera bump at the back of the iPhone, with the three lenses arranged in either a horizontal orientation or the standard triangle orientation, just with a larger bump.\n120Hz ProMotion refresh rates are rumored for all models, so better refresh rates may no longer be a Pro iPhone exclusive Apple is also rumored to be adding a more resilient anti-reflective display that's able to better hold up against drops and scratches.\nThere won't be size changes, because Apple increased the size of the iPhone 16 Pro and iPhone 16 Pro Max last year, and there are no rumors of an updated size. The iPhone 17 Pro will continue to measure in at 6.3 inches, and the iPhone 17 Pro Max will be 6.9 inches.\nApple is developing new A-series chips for the iPhone 17 Pro models, built on the latest 3-nanometer node. We could see some improvements to efficiency and performance, with Apple set to use A19 Pro chips for the higher-end 2025 iPhones.\nThis roundup focuses on the iPhone 17 Pro and iPhone 17 Pro Max. For an overview of all iPhone 17 models, we have a separate iPhone 17 roundup, and we also have specifics on the super thin iPhone 17 Air in that roundup.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nDesign\nThere will be two separate Pro iPhone models, the iPhone 17 Pro and iPhone 17 Pro Max. Apple increased the size of the Pro lineup last year, and we're expecting those same screen sizes with no further changes in 2025. The iPhone 17 Pro will measure in at 6.3 inches, while the iPhone 17 Pro Max will measure in at 6.9 inches. Overall size isn't going to change, but rumors suggest we could see some \"significant\" design updates, specifically to the rear of the device.\nApple could eliminate the titanium frame that it's used for the last several years, instead transitioning back to using aluminum. The iPhone 17 Pro models might have an aluminum frame and a back that's half glass and half aluminum instead of all glass. The half-and-half design would improve durability at the top where there's aluminum, while still allowing for wireless charging with the glass at the bottom.\nWhile some rumors have said the iPhone 17 Pro will have a two-tone design with a camera bump that's a different color than the rest of the device, Bloomberg's Mark Gurman says that the camera area will be the same color as the rest of the iPhone, the same as the iPhone 16 models are now.\nThe iPhone 17 Pro could be thicker in order to accommodate a larger battery, with the thickness coming in at 8.725mm, up from 8.25mm.\nRumors suggest that Apple might redesign the camera bump. Rather than a square bump, Apple could adopt a larger \"rectangular\" camera bump that's made from aluminum instead of glass and that spans across the back of the device. A horizontal camera bump would be a major design change, and suggests that the lenses of the camera would be arranged horizontally.\nThere is said to be a \"glass section\" around the logo that's integrated into an \"overall metal chassis,\" which has previously been described as a half aluminum, half glass build. The glass section of the iPhone will accommodate wireless charging, while the rest could be made from aluminum to improve durability.\niPhone 17 Pro dummy models and CAD Renders have an outlined area on the back that ranges from the camera module to the bottom of the chassis, mirroring the rumored half aluminum, half glass design that we've heard about.\nLeaked iPhone 17 Pro cases provide a look at just how large the rear camera bump might be. There is an oversized rectangular cutout that spans the entire back of the case.\nA test version of the iPhone 17 Pro may have been spotted in the wild, with the device confirming the updated rear camera design.\nColors\nLeaked iPhone 17 Pro components suggest that the iPhone 17 Pro models could be available in a copper-like orange color, along with black, gray, silver, and a dark blue shade. If the parts are accurate, these could be the colors that Apple will offer.\nOne leaker has suggested that one of the iPhone 17 Pro colors could somehow reflect the Liquid Glass design language in the iOS 26 update. Instant Digital said that there is a \"special\" color that is \"connected to the iOS 26 Liquid Glass design.\nThe leaker believes that the color that prior leaks refer to as white actually looks different depending on the light, perhaps with more of an iridescent look.\nMagSafe\nApple may relocate the Apple logo on the back of the iPhone 17 Pro models, possibly because of the redesigned camera module. Rumors suggest that Apple will move the logo lower on the device, and it could be located inside a break in the MagSafe ring.\nTo accommodate the relocated logo, Apple may also tweak the MagSafe magnet layout compared to existing iPhone models. Leaked images of the alleged iPhone 17 Pro magnet array feature a design with an open bottom for the Apple logo.\niPhone 17 Cases\nApple's iPhone 17 cases could include a cutout for attaching a lanyard, which would be a new feature.\nDisplay\nAll iPhone 17 models could get 120Hz ProMotion technology in 2025, which would mean ProMotion would no longer be a Pro-only feature.\nWhile multiple rumors have suggested ProMotion display capabilities will expand to the entire iPhone 17 lineup, a Chinese leaker believes that's partially inaccurate. The leaker says that the iPhone 17 and iPhone 17 Air will get 120Hz displays, but that the displays will not support adaptive refresh rates down to 1Hz.\nA 120Hz panel would allow for smoother scrolling, animations, and UI transitions, but it would not allow for always-on display functionality.\nThe iPhone 17 Pro models were going to be updated with a scratch resistant anti-reflective display coating, but it sounds like that might not happen this year after all. Apple ran into issues scaling up its display coating process, and it was too slow when taking into account millions of devices, so the coating plan was scrapped.\nThere have been mixed rumors about the size of the Dynamic Island. Analyst Jeff Pu claims that Apple is using metalens technology for Face ID that will allow for a narrower Dynamic Island across the iPhone 17 lineup, but Apple analyst Ming-Chi Kuo does not expect notable changes to the Dynamic Island and he believes it will be the same size.\nA-Series Chip\nThe iPhone 17 Pro models will adopt Apple's next-generation A19 Pro chip. The A19 Pro will be built on an upgraded N3P 3-nanometer process that should bring modest efficiency and speed improvements compared to the A18 Pro.\nRAM\nThe iPhone 17 Pro models are expected to have 12GB RAM, up from 8GB in the iPhone 16 Pro models.\nThermal Improvements\nThe iPhone 17 Pro could use a vapor chamber cooling technology for improved thermal performance. Vapor chamber technology disperses heat across a larger surface area to prevent thermal throttling and to keep performance stable, and it could be a benefit for Apple's high-powered A19 chip.\nA copper thermal plate said to be for the vapor cooling system surfaced in June.\nCamera\nAll four 2025 iPhone models are rumored to have an upgraded 24-megapixel front-facing camera, which is an improvement over the 12-megapixel front-facing camera in the iPhone 16 models. The camera will notably improve image quality, and allow for more cropping in without a loss of quality.\nApple is expected to upgrade the Telephoto lens to 48 megapixels, a major improvement over the current 12-megapixel Telephoto lens. The iPhone 17 Pro models will be the first iPhones with three 48-megapixel lenses, as the Wide and Ultra Wide lenses have already been upgraded to 48 megapixels.\nOne leaker has suggested the new 48-megapixel Telephoto lens will offer 3.5x optical zoom (85mm equivalent) instead of the 5x zoom (120mm equivalent) that is currently available. 3.5x optical zoom could be better suited for portraits, and the higher resolution allows for more cropping in, allowing Apple to also simulate 5x optical zoom. Apple already uses this method for the Fusion camera in the iPhone 16 and 16 Plus, as the Wide lens enables a 2x digital crop that is the only \"telephoto\" option for Apple's more affordable iPhones.\nThe iPhone 17 Pro could support shooting 8K video, up from the current 4K recording maximum.\nThe iPhone 17 Pro models might offer dual video recording, a feature that would allow users to record video with the front and rear cameras simultaneously. Some apps already support this functionality, which is useful for content creators, but the built-in camera does not.\nThe iPhone 17 Pro's Wide camera could have a mechanical aperture that lets users adjust the size of the aperture to tweak the amount of light that reaches the lens. Current iPhones have fixed apertures, but a variable aperture will allow for more control over the depth of field.\nOne tipster claims that the iPhone 17 Pro will feature a Telephoto lens that supports up to 8x optical zoom, up from 5x optical zoom on the 16 Pro models. There may also be a second Camera Control button for accessing camera settings.\nBattery and Charging\nThe iPhone 17 Pro Max could have Apple's biggest iPhone battery to date, with a battery capacity of 5,000mAh. The iPhone 16 Pro Max has a 4,676mAh battery, so the 17 Pro Max could last longer than the 33 hour maximum that the 16 Pro Max features. The A19 Pro and new Qualcomm Snapdragon X80 modem could also increase battery life.\nWith the iPhone 16 and 16 Plus, Apple introduced a new battery adhesive that can be loosened with a low-voltage electrical current, making the batteries easier to remove and replace. That same technology could be used in the iPhone 17 Pro models this year.\nApple apparently tested a 7.5W reverse wireless charging feature for the iPhone 17 Pro, which would allow the iPhone to provide wireless power to other Apple devices like AirPods and Apple Watch. Current iPhones are able to provide 4.5W of power to the Apple Watch and AirPods over USB-C, but there is no option for reverse wireless charging.\nThe iPhone 17 models could support 25W wireless charging with third-party wireless chargers that support the next-generation Qi 2.2 wireless charging standard. Right now, iPhones are limited to 15W wireless charging with third-party chargers, but the new Qi standard supports up to 25W charging.\nThe iPhone 17 models are expected to feature 35W wired charging speeds, which means there would be no change from the current charging maximum.\nAn image of the alleged iPhone 17 Pro battery suggests it will have a metal cover and a slight L-shape. Apple could also use the removable adhesive that it used for the standard iPhone 16 models, which would make repair simpler.\nConnectivity\nWhile the iPhone 17 Air will have Apple's C1 5G modem, the iPhone 17 Pro models will continue to use 5G modems from Qualcomm. Qualcomm modems support both 6GHz and mmWave 5G, while the C1 is limited to 6GHz 5G.\nAll four iPhone 17 models that are coming in 2025 will have Apple's first custom-designed Wi-Fi chip with Wi-Fi 7 support. Wi-Fi 7 is already used in the iPhone 16 models, but Apple's chip design could bring additional efficiency and connectivity improvements, and it paves the way for a future all-in-one SoC.\nApple is aiming to create a wireless setup where the components are tightly integrated and more energy efficient, which will let the company cut down on the battery use of cellular, Wi-Fi, and Bluetooth technologies.\nWi-Fi 7 supports data transmission over 2.4GHz, 5GHz, and 6GHz band simultaneously for faster speeds and lower latency with a supported router. Wi-Fi 7 supports peak speeds of more than 40Gb/s. Bluetooth 5.3 is also expected.\niPhone 17 Ultra?\nOne rumor has suggested the largest of Apple's iPhones in 2025 will be called the \"iPhone 17 Ultra\" instead of \"iPhone 17 Pro Max,\" but this is a rumor that we've heard twice before during the iPhone 15 and iPhone 16 rumor cycles, so there is a good chance that this information is not accurate.\nPricing\nThe iPhone 17 models could see a price hike, as Apple's component costs are increasing due to tariffs. Apple will pair the potential price increase with new features and camera design changes to justify the price to consumers, rather than blaming tariffs.\nThe iPhone 17 Pro could be $50 more expensive than the prior-generation iPhone 16 Pro, but it might start with 256GB of storage rather than 128GB of storage, which would raise the price.\nLaunch Date\nThe iPhone event could take place on Tuesday, September 9, according to leaked information sourced from a German carrier. If that's the case, pre-orders could take place on September 12, and a launch could follow on September 19.\nWhat's Next for the iPhone Lineup\nStarting in 2026, Apple will split its iPhone lineup between fall and spring launches. The iPhone 18 Air, iPhone 18 Pro, iPhone 18 Pro Max, and a foldable iPhone will launch in the second half of 2026, while the standard iPhone 18 and the iPhone 18e won't launch until spring 2027.\nThe iPhone 18 Pro models that are coming in 2026 could have under-display Face ID, which would cut down on the size of the Dynamic Island. There might just be a single camera hole for the front-facing camera, with the camera cutout located in the top left corner. Later, in 2027, Apple could release an iPhone with an all-screen design, featuring an edge-to-edge display with no cutouts. Apple is essentially planning iPhone design updates every year through 2027.\nApple's first foldable iPhone is expected in fall 2026, and rumors suggest it will launch alongside the iPhone 18 Air and iPhone 18 Pro models. It is expected to have a \"nearly invisible\" crease when it's folded, thanks to a high-quality hinge.\nMore on the iPhone 18 lineup with Apple's first foldable iPhone can be found in our dedicated iPhone 18 roundup."
    },
    {
      "url": "https://www.macrumors.com/roundup/iphone-16/",
      "text": "Should You Buy an iPhone 16?\nIntroduced in September 2024, the iPhone 16 and iPhone 16 Plus are Apple's current flagship phones, sold alongside the higher-end iPhone 16 Pro and iPhone 16 Pro Max.\nThe iPhone 16 and iPhone 16 Plus are the right iPhones for most people, and it's still a good time to buy, but be aware there is a new model coming in September. The iPhone 16 models feature an upgraded A18 chip that supports Apple Intelligence, a dual-lens camera system that takes great photos, a Camera Control button for quick camera access, and a customizable Action button.\nPricing starts at $799, and the iPhone 16 offers a good balance between functionality and price. If you're looking for a step up, Apple has the iPhone 16 Pro models with upgraded A18 Pro chip, bigger displays, ProMotion display technology, and triple-lens camera system.\nIf you're coming from an iPhone 13 or earlier, the iPhone 16 is an excellent upgrade because you get the new super fast chip and Apple Intelligence support, but you also get prior model features like Crash Detection and Emergency SOS via satellite.\nFor those who want a more affordable device, Apple also offers the $429 iPhone SE with older technology, the prior-generation iPhone 15 and iPhone 15 Plus with prices starting at $699, and the iPhone 14 and iPhone 14 Plus with pricing starting at $599.\n- iPhone 16 vs. iPhone 16 Pro Buyer's Guide: All Differences Compared\n- iPhone 16e vs. iPhone 16 Buyer's Guide: 25+ Differences Compared\nChoosing an iPhone is a major decision, so we have some buyer's guides that walk you through choosing the best device for you, and you'll also want to check out our iPhone deals post to get the best prices.\nThe 2024 iPhone 16 Lineup\nContents\n- Should You Buy an iPhone 16?\n- The 2024 iPhone 16 Lineup\n- How to Buy\n- Reviews\n- Design\n- Display\n- A18 Chip\n- Camera Control\n- Dual-Lens Rear Camera\n- Battery Life\n- 5G Connectivity\n- Emergency SOS via Satellite\n- Crash Detection\n- Bluetooth, Wi-Fi, NFC, GPS, and Ultra Wideband\n- iPhone 16 Pro and Pro Max\n- What's Next for the iPhone\n- iPhone 16 Roundup Changelog\n- iPhone 16 Timeline\nThe iPhone 16 and iPhone 16 Plus are Apple's consumer-focused flagship devices with prices starting at $799. They are joined by the pro-focused iPhone 16 Pro and iPhone 16 Pro Max, which come with additional capabilities and features and start at $999.\nAs with the iPhone 15 lineup last year, the iPhone 16 family includes a total of four models. There's the 6.1-inch iPhone 16, the 6.7-inch iPhone 16 Plus, the 6.3-inch iPhone 16 Pro, and the 6.9-inch iPhone 16 Pro Max. The Pro and Pro Max have larger display sizes this year, but the standard iPhone sizing has not changed. Apple's iPhone 16 and iPhone 16 Plus start at $799 and are more affordable than the higher-end iPhone 16 Pro and iPhone 16 Pro Max.\nWhile some of the best features are reserved for the iPhone 16 Pro models to make the extra cost worth it for consumers, the iPhone 16 and iPhone 16 Plus are incredibly capable devices that are going to last for years to come.\nDesign wise, the iPhone 16 models look almost identical to the iPhone 15 models with an aluminum frame, frosted glass back, and Dynamic Island. The Dynamic Island houses the front-facing TrueDepth camera and other sensors for Face ID authentication. The Super Retina XDR OLED display is protected by a next-generation Ceramic Shield that's 50 percent tougher.\nThe overall look hasn't changed, but Apple introduced a new vertical rear camera that replaces the prior diagonal camera, and there are also two new buttons: the Action button and the Camera Control button.\nThe iPhone 16 and 16 Plus are each available in five color options: ultramarine, teal, pink, white, and black. There is a USB-C port for charging, but data transfers on these models remain at the same USB 2.0 speeds that were available last year.\nApple introduced a new 3-nanometer next-generation A18 chip that supports all of the iOS 18 Apple Intelligence features like Writing Tools, the revamped Siri, Genmoji, Image Playground, and more. It has a 6-core CPU and 5-core GPU.\nThe 16-core Neural Engine runs machine learning models up to 2x faster than the A16 chip, while the CPU is 30 percent faster and the GPU is 40 percent faster and 35 percent more efficient with support for hardware-based ray tracing.\nThe internal design was rearchitected to improve heat dissipation and chip performance. With the new thermal design and the A18 chip improvements, the A18 supports up to 30 percent higher sustained performance for gaming.\nApple brought the iPhone 15 Pro Action button to the entire lineup this year, so iPhone 16 users can access a variety of customizable functions like flashlight, camera, Shazam, Translate, and more.\nThere's an all-new Camera Control button that's like an Action button for the Camera. It is touch and pressure sensitive and can be used to launch the camera and take a photo, capture a video, and adjust all kinds of camera settings. Apple modeled it after the shutter button of a DSLR camera, and it works in much the same way. Third-party apps can also take advantage of the Camera Control button.\nAs of iOS 18.2, Camera Control can be used for visual intelligence, a new AI feature that can tell users about objects and places. Point the camera at an object and click and hold on Camera Control to get more info about it. For a restaurant, visual intelligence shows information like hours and menu.\nTo accompany the Camera Control button, Apple added a 48-megapixel Fusion camera with a 2x optical-quality Telephoto zoom that's cropped from the full camera capture. Apple says is it's like having two cameras in one. There's also a new 12-megapixel Ultra Wide camera with autofocus and support for macro photography. The Ultra Wide gathers up to 2.6x more light for better image quality in low light conditions. The vertical camera arrangement supports capturing spatial photos and videos that can be viewed on the Apple Vision Pro.\nThere are a range of next-generation Photographic Styles that let users adjust color, highlights, and shadows in real time. Adjustments can be applied to specific colors rather than the entire image, and Apple allows granular control over the intensity and tone of effects. Styles can be rendered during live preview or added after a photo is taken.\nVideos are captured with Spatial Audio for more immersive sound with AirPods or Vision Pro, and there's a new Audio Mix feature for adjusting sound after capture to focus on the voice of the person on camera, make it sound like a video was recorded in a professional studio, or position vocal tracks in front and environmental noises in surround sound. A wind noise reduction tool cuts down on unwanted noise for improved audio quality.\nBattery size has been increased, and with efficiency improvements, the battery lasts for up to two hours longer than the iPhone 15 battery. The iPhone 16 Plus supports up to 27 hours of video playback, while the iPhone 16 supports up to 22 hours of video playback.\nApple added faster 25W MagSafe charging to the new iPhone 16 models, though a new MagSafe Charger that supports the faster charging is required. With 25W MagSafe charging, an iPhone 16 can charge to 50 percent in 30 minutes. 15W Qi2 charging is also supported.\nAs with the last several generations, the iPhone 16 models support 5G connectivity (both sub-6GHz and mmWave in the United States). In the United States, iPhone models again ship without a physical SIM card as carriers now use eSIM. Faster and more efficient Wi-Fi 7 connectivity is supported, as is Bluetooth 5.3.\nPricing on the iPhone 16 starts at $799, and pricing on the iPhone 16 Plus starts at $899. The iPhone 16 models are available in 128GB, 256GB, and 512GB storage capacities. Pre-orders began on Friday, September 13, at 5:00 a.m. Pacific Time, and a launch followed on Friday, September 20.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nHow to Buy\niPhone 16 pricing starts at $799 for the base model with 128GB of storage, while the iPhone 16 Plus has a starting price of $899 for the 128GB storage option. If you need more storage space, there are options to upgrade to higher storage capacities at an additional cost.\nThe iPhone 16 and iPhone 16 Plus can be ordered from the online Apple Store, Apple retail stores, carriers, and other authorized third-party retailers. The new models launched on Friday, September 20.\nReviews\nThe iPhone 16 and 16 Plus have been well-received, thanks to features such as longer battery life, the Action Button, and the all-new Camera Control, a first for both the standard and Pro models, which allows for easier access to camera settings like zoom and exposure while capturing photos or videos. In addition, the introduction of Apple’s A18 chip brings a performance boost, making everyday tasks smoother and ensuring readiness for Apple Intelligence features set to arrive starting with iOS 18.1.\nThe dual-camera system sees upgrades too, including improved low-light performance, revamped photographic styles, and macro capabilities, which reviewers highlight as making these models versatile photography tools. The vibrant new color options also add to the appeal, making this year’s iPhones more stylish than previous iterations.\nHowever, some limitations, like the continued use of a 60Hz display, have left some critics disappointed, especially given the competition offering higher refresh rates at similar price points. Additionally, while the design is sleek and colorful, the slower USB 2.0 speeds, absence of an always-on display, and lack of a dedicated telephoto camera remain points of compromise for users looking at higher-end features.\nRead our iPhone 16 review roundup for more information.\nDesign\nThe iPhone 16 measures in at 6.1 inches and the iPhone 16 Plus measures in at 6.7 inches, with those measurements taken diagonally at the display. The 2024 iPhones have almost the same design as the prior-generation iPhone 15 models, with small changes to the camera and buttons.\nDimensions have changed little, with only some very minor shifts in weight. The iPhone 16 is 5.81 inches (147.6 mm) tall and 2.82 inches (71.6 mm) wide, while the iPhone 16 Plus is 6.33 inches (160.9 mm) tall and 3.06 inches (77.8 mm) wide. Both models are 0.31 inches (7.80 mm) thick, with the iPhone 16 weighing 6.00 ounces (170 grams) and the iPhone 16 Plus weighing 7.03 ounces (199 grams).\nThe iPhone 16 models have an all-glass front and a colorful matte glass back that's framed by a color-matched aluminum frame. Colors this year include black, white, teal, pink, and ultramarine, and the latter three are unique, vivid shades. At the front of the iPhone 16, there is a Dynamic Island that houses the front-facing camera and TrueDepth camera system for Face ID.\nThere are antenna bands at the top and sides of the phone, with a power button on the right side and volume buttons and the Action button on the left. The Action button is the same button that Apple first introduced with the iPhone 15 Pro models last year, and now it is also available for the iPhone 16. Also new is a Camera Control button that is located below the power button on the right side, and it is used for capturing photos and videos. Apple removed the distinct 5G mmWave antenna, and it is now built into the frame in the United States. Other countries do not have the mmWave antenna.\nSpeaker holes, a microphone, and a USB-C charging port are located at the bottom of the iPhone 16 models. In some countries, there is a SIM slot, but the physical SIM has not been included in U.S. iPhones for several years now.\nApple redesigned the rear camera bump, and the iPhone 16 has a two-lens pill-shaped vertical setup rather than a diagonally positioned lens. Apple made this change to enable spatial photo and video recording.\nUSB-C Port\nThe iPhone 16 models have a USB-C port and they can be charged with a USB-C cable. The iPhone 16 lineup can charge at up to 45W with a proper power adapter, a significant increase over previous generations that were limited to 25–30W.\nUSB-C allows an iPhone to directly charge AirPods or an Apple Watch using a USB-C cable, and the iPhone is able to provide up to 4.5W.\nOn the iPhone 16 models, the USB-C port is limited to USB 2 transfer speeds of 480 Mb/s, the same as Lightning, and there has been no upgrade since last year.\nWater and Dust Resistance\nThe iPhone 16 and 16 Plus have an IP68 rating for resistance to water and dust intrusion. The smartphones are able to withstand a depth of up to six meters (19.7 feet) for up to 30 minutes.\nIn the IP68 number, the 6 refers to dust resistance (and means the iPhone 16 can hold up to dirt, dust, and other particulates), while the 8 pertains to water resistance. IP6x is the highest dust resistance rating that exists. With the IP68 rating, the iPhone 16 can withstand splashes, rain, and accidental water exposure, but intentional water exposure should be avoided.\nWater and dust resistance are not permanent conditions, according to Apple, and can deteriorate over time as a result of normal wear. Apple's standard warranty does not cover liquid damage, which means it's best to use caution when it comes to liquid exposure.\nAction Button\nThe Action button on the iPhone 16 models replaces the Ring/Silent switch above the volume buttons on the left side. Apple designed the Action button to be customizable, and it can be set to perform one of several different actions in the Settings app.\n- Focus: Activate or deactivate a Focus mode (Do Not Disturb is the default).\n- Camera: Take a photo (the default), a selfie, video, portrait, or portrait selfie.\n- Flashlight: Turn the flashlight on or off.\n- Voice Memos: Start or stop recording a voice memo with the Voice Memos app.\n- Magnifier: Activate the Magnifier app to use the iPhone's camera as a magnifying glass to zoom in on small text or objects.\n- Shortcuts: Open your favorite app, or run a shortcut created in or downloaded from the Shortcuts app, such as sending a message, playing a playlist, or controlling smart home devices.\n- Control Center: In iOS 18, several Control Center controls can be assigned to the Action button.\n- Accessibility: Access to various Vision settings (Classic Invert, Color Filters, Detection Mode, Increase Contrast, Reduce Motion, Reduce Transparency, Reduce White Point, Smart Invert, VoiceOver, Zoom) Motor settings (Switch Control, Voice Control, Full Keyboard Access, AssistiveTouch, Apple Watch Mirroring, Control Nearby Devices) Hearing settings (Background Sounds, Left/Right Balance, Live Captions) and General settings (Guided Access, Live Speech).\n- Silent Mode: Like the Ring/Silent switch on existing iPhone models, toggle silent mode on or off, which mutes or unmutes the ringer and alerts.\n- Translate: The Translate action launches the Translate app and start a text or conversation translation.\n- No Action.\nActivating the Action button is done with a long press, which limits it from being hit accidentally.\nDisplay\nApple didn't make notable changes to display technology, with the iPhone 16 and 16 Plus continuing to have Super Retina XDR OLED displays with the Dynamic Island. The iPhone 16 has a resolution of 2556 by 1179 with 460 pixels per inch, while the iPhone 16 Plus has a resolution of 2796 by 1290 with 460 pixels per inch.\nTypical maximum brightness is 1000 nits, while peak HDR brightness is 1600 nits. Apple also says that the iPhone 15 models can reach 2000 nits peak brightness outdoors. New this year is a 1 nit minimum brightness.\nThere is a 2,000,000:1 contrast ratio, and wide color support offers vivid, true-to-life colors, while True Tone matches the white balance of the display to the ambient lighting for a paper-like viewing experience that's easier on the eyes. There's also a fingerprint-resistant oleophobic coating and support for Haptic Touch, which provides haptic feedback when interacting with the display.\nThe iPhone 16 and 16 Plus do not support the ProMotion 120Hz refresh rate or the Always-On display technologies available on the iPhone 16 Pro and Pro Max.\nThe display is protected by a next-generation Ceramic Shield material made by infusing nano-ceramic crystals into glass. The new Ceramic Shield is stronger than the prior version, and Apple says it is \"2x tougher\" than any other smartphone glass. Despite the new Ceramic Shield, the iPhone 16 models are still vulnerable to damage when dropped.\nDynamic Island\nThe Dynamic Island includes the TrueDepth camera sensor for Face ID and the front-facing camera. The display has a small circular cutout on the right side that's for the camera, and a pill-shaped cutout on the left side for the TrueDepth system for Face ID. Apple uses software to combine the two cutouts into one pill-shaped cutout that makes up the Dynamic Island.\nApple turned the Dynamic Island into part of the iPhone's interface, and it is used as a front-and-center information hub for notifications and other at-a-glance information from apps and services. When you make an Apple Pay payment, for example, Dynamic Island expands into a square shape to confirm your Face ID scan, and when on a phone call, it expands so you have phone controls at your fingertips.\nThe Dynamic Island can display everything from Maps directions to Apple Music, and it integrates with Live Activities. There are no changes to the Dynamic Island with the iPhone 16 models.\nTrueDepth Camera and Face ID\nThe iPhone 16 models continue to use Face ID, Apple's facial recognition system that is baked into the Dynamic Island.\nFace ID is used across iOS for unlocking the iPhone, allowing access to passcode-protected apps, confirming app purchases, authenticating Apple Pay payments, and more.\nFace ID works through a set of sensors and cameras. A Dot Projector projects tens of thousands of invisible infrared dots onto the surface of the skin to create a 3D facial scan that maps the curves and planes of each face, with the scan read by an infrared camera.\nThe facial depth map is relayed to the A18 chip where it is transformed into a mathematical model that the iPhone uses to authenticate identity. Face ID works in low light and in the dark, and with hats, beards, glasses, sunglasses, scarves, masks, and other accessories that partially obscure the face.\nFront-Facing Camera\nThe Dynamic Island also houses the front-facing camera, and Apple is using the same 12-megapixel front-facing camera with an ƒ/1.9 aperture that's been in iPhones for the last several years.\nThe front-facing camera supports Night mode, Smart HDR 5 integration, Dolby Vision HDR recording, Deep Fusion to bring out fine details, a Photonic Engine that improves low-light performance, and a portrait feature that lets you take images and turn them into portrait shots later.\n4K video recording, QuickTake video, slo-mo video, Portrait mode, Portrait Lighting, and the Photographic Styles feature for selectively applying edits are also supported on the front-facing camera.\nA18 Chip\nThe A18 chip is built using a second-generation 3-nanometer process, so it is more efficient and faster than the A16 Bionic chip used in the iPhone 15 models. The A18 chip is capable of handling Apple Intelligence tasks, and it runs the Apple Intelligence features in iOS 18.\nThere's a 6-core CPU with four performance cores and two efficiency cores, along with a 5-core GPU and an upgraded 16-core Neural Engine optimized for running large generative models. Apple has also upgraded the memory subsystem with 17 percent more memory bandwidth.\nCompared to the A16 Bionic chip, the A18 has a 30 percent faster CPU, and it offers the same performance while using 30 percent less power. The GPU is 40 percent faster, offering the same performance while using 35 percent less power. The updated GPU also enables hardware-accelerated ray tracing. Ray tracing is useful for gaming, and the iPhone 16 models can run all of the console-quality games that Apple touted for the iPhone 15 Pro models last year.\nNew Thermal Design\nApple revamped the internal design of the iPhone 16 model to improve heat dissipation. The main logic board was updated, with Apple adding centralized chip placement while also optimizing the surrounding structure. A recycled aluminum substructure dissipates heat for 30 percent higher sustained performance for gaming.\nThe new Neural Engine is 2x faster for machine learning than the Neural Engine in the A16 Bionic chip.\nMemory\nThe iPhone 16 and 16 Plus have 8GB RAM, the minimum needed for Apple Intelligence.\nStorage Space\nEntry-level iPhone 16 models start with 128GB of storage, but there are 256GB and 512GB options available for additional money.\nCamera Control\nThe iPhone 16 models have a Camera Control button on the right side that's designed specifically for capturing images. The multi-function button has a force sensor and a touch sensor for gesture support, and Apple designed it to work in either portrait or landscape mode.\nThere's a sapphire crystal covering with a smooth texture covering the Camera Control button, and it is surrounded by stainless steel trim. It is inset into the iPhone's frame just a bit, and the force sensor has haptic feedback to make it feel like a DSLR camera shutter.\nCamera Control can be used to take a photo with two quick clicks, but there are many more capabilities.\n- Single click - Open up the Camera app (or a third-party app).\n- Single click, Camera open - Take a photo.\n- Click and hold - Open Camera app, start a video recording.\n- Light press - Open up controls like zoom or lock focus and exposure for reframing shots without losing focus.\n- Double light press - Bring up the camera preview menu to choose different controls like exposure or depth of field.\n- Swipe - Swap through available adjustment options, and also change parameters like zoom, exposure, or depth of field when a control is selected.\nThe button has deep software support, so you can also swap between Camera Control functions without having to adjust settings in the Camera app.\n- Adjust zoom\n- Adjust exposure\n- Adjust depth of field\n- Swipe through different stylistic options\nThird-party developers can to take advantage of the Camera Control for their apps for adjusting settings, and it works in social media apps like Snapchat.\nVisual Intelligence\nAs of iOS 18.2, Camera Control works with a new visual intelligence feature. Users can open the Camera app and point it at an object to get information about that object with a click and hold gesture. Pointing it at a restaurant, for example, brings up hours and ratings, while pointing it at a plant identifies the plant. Using visual intelligence with something that has a date, such as a flyer, adds the date to the Calendar app.\nCamera Control also works as a gateway to third-party tools, such as when users want to search Google for an item to buy or use ChatGPT to solve a problem.\nDual-Lens Rear Camera\nThe camera system is largely the same as the iPhone 15 models, but Apple is now calling the 48-megapixel Wide-Angle lens a \"Fusion\" lens because of its ability to be used for both standard photos and cropped-in 2x zoom photos.\nThe camera features a 26 mm focal length with ƒ/1.6 aperture that lets in plenty of light for situations where lighting is not optimal. Sensor-shift optical image stabilization cuts down on movement for crisper photos and videos, with the lens supporting both 24-megapixel and 48-megapixel high-resolution images.\nWith the 24-megapixel option, every two pixels are combined into one pixel, allowing for high-resolution images that have impressive detail and low-light performance without too large of a file size. 48-megapixel images are also supported and can be saved in either RAW or HEIF format.\nAs mentioned, the 2x Telephoto option uses the middle 12 megapixels on the sensor for full-resolution 2x photos with no digital zoom.\nAlong with the 48-megapixel Fusion camera, the iPhone 16 models have a new 12-megapixel Ultra Wide camera with an ƒ/2.2 aperture and 120º field of view. The lower aperture lets in more light and enables a new macro mode for taking close-up shots.\nApple says that the dual-lens system's multiple capabilities mean it's actually like having four cameras: wide angle, telephoto, macro, and ultra wide. The camera also supports spatial videos and photos for Vision Pro.\nNew Photographic Styles\nPhotographic Styles have been an option for some time, but Apple overhauled the feature this year. There are new, more subtle styles to choose from, and Apple is enabling far more control over the way the style is applied.\nPhotographic Styles can be previewed live before you make a change. You can shift the way a style looks with the control pad that lets you adjust tone and color. The intensity of specific colors and the tone can be changed, so you can make adjustments that don't affect the entire color scheme of an image.\nApple says that skin tone rendering is more advanced than before, so you can also create a style for dialing in your favorite look and then add it across all of the images that you take. You can also change the Photographic Style after an image is captured, which wasn't an option with prior models.\nVideo Capabilities\nThe iPhone 16 models support up to 4K video recording at 24, 25, 30, or 60 frames per second. HDR recording, ProRes video, Cinematic mode, Action mode, slo-mo video, and time-lapse are all supported.\nQuickTake mode, which allows you to capture video by holding down the camera button, now supports 4K at 60 fps in Dolby Vision.\nSpatial Audio sound recording is available for more dynamic, immersive sound for videos, and wind noise reduction cuts down on wind sound when recording.\nAudio Mix\nAudio Mix is a video feature that takes advantage of Spatial Audio capture. You can use it to adjust the way that voices sound in videos, and there are three different options.\n- In-frame - Only captures the voices of people on camera, even if people off camera are talking.\n- Studio - Makes voices sound like the recording was done in a professional studio with sound-dampening walls. A recording sounds like the mic was close to the subject's mouth.\n- Cinematic - Captures all voices and consolidates them to the front of the screen, which is how sound is formatted for movies.\nOther Camera Features\nThere are several other camera bells and whistles that Apple has been adding to the iPhones over the years.\n- Portrait Features - You don't need to choose Portrait mode before capturing an image to get a portrait shot. You can just snap a photo, and if there's a person or a pet, depth information is collected and Portrait mode is enabled automatically with a blurred background. This year, the feature works for Night mode shots and it supports Portrait Lighting.\n- Smart HDR 5 - Recognizes one or more people in a scene and optimizes contrast, lighting, and even skin tones for each person so everyone looks their best.\n- Photonic Engine - The Photonic Engine combines the best pixels from a high-resolution image and an image optimized for light capture, leading to a 24-megapixel image with detail drawn from an image twice the resolution.\n- Night mode - Takes a series of images over a few seconds and aggregates them to allow for photography in extreme low lighting situations.\n- Deep Fusion - Works in mid to low lighting conditions and brings out the texture and detail in the image.\n- Portrait Lighting - Changes the lighting of Portrait mode photos with effects that include Natural, Studio, Contour, Stage, Stage Mono, and High-Key Mono.\n- True Tone flash - True Tone flash is the built-in flash, and it is designed to match the ambient lighting so it doesn't throw off the white balance of the photo when used.\n- Cinematic mode - A video mode that keeps the focus on the main subject that you're filming even as you move.\n- Action mode - Enhances image stabilization to improve shaky handheld video.\n- Panorama - Captures panoramic shots up to 63 megapixels.\n- Burst mode - Allows a series of images to be captured all at once, which is good for high-action shots.\nBattery Life\nWith efficiency improvements brought by the A18 chip, the iPhone 16 and 16 Plus have longer battery life than the prior-generation models, gaining at least an hour.\n- iPhone 16 - 22 hours video playback, 18 hours streaming video, 80 hours audio.\n- iPhone 16 Plus - 27 hours video playback, 24 hours streaming video, 100 hours audio.\n- iPhone 15 - 20 hours video playback, 16 hours streaming video, 80 hours audio.\n- iPhone 15 Plus - 26 hours video playback, 20 hours streaming video, 100 hours audio.\nThe iPhone 16 has a 3,561 mAh battery, a 6.3 percent increase over the iPhone 15, while the iPhone 16 Plus has a 4,674 mAh battery, up 6.6 percent compared to the iPhone 15 Plus.\nApple made the iPhone 16 batteries easier to remove, using an adhesive that can be loosened using a low-voltage electrical current, like that from a 9V battery. The streamlined repair process allows for easier battery replacements.\nMagSafe Charging\nThe iPhone 16 models support faster 25W MagSafe charging with one of Apple's new MagSafe chargers and a 30W power adapter or higher. It is the first time that fast charging has been available when charging wirelessly, and iPhone 16 users can expect to see a 50 percent charge in 30 minutes.\nQi2 charging is also supported, but that is limited to 15W, the same as the prior-generation MagSafe charging.\n5G Connectivity\nThe iPhone 16 models offer 5G connectivity with Apple using Qualcomm modems.\nIn the United States, iPhone owners can connect to both mmWave and sub-6GHz networks, while other countries are limited to sub-6GHz. mmWave 5G networks are the fastest 5G networks, but mmWave is short-range and can be obscured by buildings, trees, and other obstacles, so its use is limited to major cities and urban areas along with venues like stadiums, airports, and other places where a lot of people congregate.\nSub-6GHz 5G is more widespread and available in urban, suburban, and rural areas across the United States and other countries. For the most part, when you use a 5G network, you'll be using sub-6GHz 5G. Sub-6GHz 5G is typically faster than LTE, especially when mid-band spectrum is used, but it isn't always the blazing fast 5G that you expect.\n5G Bands\nThe iPhone 16 models in the United States support more than 20 5G bands. The following bands are supported:\n- Sub-6GHz 5G - High band FDD-5G NR (n1, n2, n3, n5, n7, n8, n12, n14, n20, n25, n26, n28, n29, n30, n66, n70, n71, n75, n76) and low band TDD-5G NR (n38, n40, n41, n48, n53, n77, n78, n79)\n- mmWave 5G - n258, n260, n261\nLTE Bands\nThe iPhone 16 models continue to offer Gigabit LTE with 4x4 MIMO for connecting to LTE networks when 5G is unavailable. The following bands are supported.\n- FDD-LTE - Bands 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 17, 18, 19, 20, 25, 26, 28, 29, 30, 32, 66, 71\n- TDD‑LTE - Bands 34, 38, 39, 40, 41, 42, 48, 53\nEmergency SOS via Satellite\nAll iPhone 16 models can connect to satellites in emergency situations when cellular and Wi-Fi connections are not available. Apple has designed the Emergency SOS via satellite feature to allow the iPhone's antennas to connect to satellites operated by Globalstar.\nSatellite communications are available in emergency situations where you can't connect to Wi-Fi or a cellular tower, and the feature is designed to be used in open spaces with few trees so the iPhone can connect to a satellite that's in the sky.\nApple has a walkthrough interface that instructs you how to hold the iPhone to connect to a satellite, and the company has developed a compressed messaging protocol because sending data via satellite can take minutes. In an area with no trees, a short message to emergency services can send in as little as 15 seconds.\nEmergency SOS via satellite provides a series of important questions that you answer when it is activated, with these questions aimed at getting necessary details to emergency personnel as quickly as possible. The answers that you provide are sent directly to emergency services if text communication is supported in your area, or sent to relay centers staffed by Apple-trained specialists who can call emergency services on the user's behalf.\nSatellite connectivity is mainly designed to allow users to contact emergency services in dire situations, but it can also be used to update your Find My location if you're camping or hiking off the grid, giving your family and friends peace of mind about where you are.\nEmergency SOS via satellite is free for all iPhone 16 users for two years, and Apple has not yet provided details on what it will cost in the future.\nThe iPhone 16 models also support Messages via satellite with iOS 18, and Roadside Assistance via satellite, which allows iPhone users to contact local service providers for help if they have car trouble in an area without cellular or Wi-Fi connectivity. There is no charge for the satellite usage with Roadside Assistance, though there may be a fee charged by the roadside service provider.\nCrash Detection\nThere's a high dynamic range gyroscope and a dual-core accelerometer capable of detecting G-force measurements of up to 256Gs in the iPhone 16 models, and paired with other iPhone sensors like a barometer that can detect cabin pressure changes caused by deployed airbags, this hardware enables a Crash Detection feature.\nThe iPhone 16 models can detect a severe car crash and automatically dial emergency services when the car's occupants are seriously injured or unable to reach their phones. The GPS in the iPhone is able to detect speed changes, and the microphone is able to recognize loud sounds associated with severe car crashes. Crash Detection is also available on the Apple Watch, and the iPhone and Apple Watch work together to contact emergency services when an accident occurs.\nBluetooth, Wi-Fi, NFC, GPS, and Ultra Wideband\nThe iPhone 16 and 16 Plus support Wi-Fi 7 (802.11be) with 2x2 MIMO, and Bluetooth 5.3. Wi-Fi 7 adds support for 6GHz bands on supported Wi-Fi 6E and Wi-Fi 7 routers. Compared to prior Wi-Fi standards, Wi-Fi 7 is faster and supports more connections.\nThere's an NFC chip with reader mode, and a second-generation Ultra Wideband chip. The Ultra Wideband chip provides improved spatial awareness, allowing iPhone 16 models to more precisely locate other Apple devices with an Ultra Wideband chip. The chip allows two iPhones to connect to each other at three times the range as before.\nThe Ultra Wideband chip can be used for precision tracking, such as when locating AirTags. It is also used for directional AirDrop and for interactions with the HomePod mini, plus Apple has added a Precision Finding feature for locating friends with an iPhone 16 in a crowded area.\nAs for GPS, the iPhone 16 models support GPS, GLONASS, Galileo, QZSS, and BeiDou location services.\niPhone 16 Pro and Pro Max\nApple is selling the iPhone 16 and 16 Plus alongside the more expensive iPhone 16 Pro and iPhone 16 Pro Max, which are aimed at those who want higher-quality displays and more versatile cameras.\nCompared to the iPhone 16 models, the iPhone 16 Pro and Pro Max feature a lighter, more durable titanium frame, larger display sizes, a faster A18 Pro chip, ProMotion display technology, an Always-On display, a 48-megapixel Ultra Wide lens, and 5x Telephoto camera lens.\nMore information about the iPhone 16 Pro and iPhone 16 Pro Max can be found in our roundup.\nWhat's Next for the iPhone\nFor 2025, Apple is working on the iPhone 17, iPhone 17 Air, iPhone 17 Pro, and iPhone 17 Pro Max. The iPhone 17 Air will be an all-new super thin device that replaces the \"Plus\" iPhone, offering a compromise between a high-end feature set and a slick design.\nAll of the iPhone 17 models will feature A19 or A19 Pro chips, a 24-megapixel front-facing camera, 120Hz ProMotion refresh rates, and a new anti-reflective display that's more scratch resistant. More information on the new models can be found in our roundups:\niPhone 16 Roundup Changelog\n- June 27 - General refresh and updated buyer's guide info.\n- November 14 - Updated new guides on photographic styles and fast charging.\n- September 27 - Added camera video, drop test details.\n- September 23 - Updated with new buyer's guide info.\n- September 20 - Added new video, updated with launch info.\n- September 19 - Added battery info.\n- September 13 - Filled out with additional details.\n- September 10 - Official introduction revamp!"
    },
    {
      "url": "https://www.macrumors.com/2025/04/14/trump-semiconductor-tariffs-apple/",
      "text": "Trump Planning Semiconductor Tariffs That Will Impact Apple, No One 'Getting Off the Hook'\nApple will not be exempt from tariffs after all, with U.S. President Donald Trump working on new semiconductor levies that will likely impact Apple devices, chips from companies like Nvidia, and other electronics.\nOver the weekend, the U.S. Customers and Border Protection agency shared a long list of electronic devices excluded from the current tariffs, including iPhones, iPads, Macs, the Apple Watch, and more. Apple scored a reprieve from the 145 percent tariff impacting goods imported from China and the 10 percent tariff on goods imported from other countries, but it doesn't sound like it's going to last.\nOn his Truth Social network, Trump said that no one is \"getting off the hook\" and there \"was no tariff exception.\" Apple and other tech companies are \"just moving to a different tariff bucket,\" with the 20 percent \"Fentanyl Tariffs\" still in place, and additional tariffs coming.\nTrump said that his administration will be \"taking a look\" at semiconductors and the electronics supply chain in the National Security Tariff Investigations. He also reiterated that \"we need to make products in the United States.\" Trump is expected to announce some kind of semiconductor tariff in the coming days.\nTrump has suggested that Apple could manufacture the iPhone and other products in the United States, but even if such a move were not wildly expensive, Apple would not be able to find enough people with the necessary skillset to assemble devices in the quantities needed. U.S. manufacturing would also drive the cost of the iPhone up significantly.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/guide/iphone/",
      "text": "In 2007, Apple launched the original iPhone, kickstarting the modern smartphone era which is now dominated by iPhone and Android devices. We've had 18 generations of iPhones so far, with the latest models, the iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max, introduced in September 2024, and the iPhone 16e released in February 2025. Apple follows an annual update cycle, introducing new flagship models while discounting prior-year models and selling them at more affordable price points.\niPhone vs Android\nOver the years, Android and iPhone smartphones have evolved to the point where feature-wise, they're similar in function and capability. Android smartphones are made by multiple manufacturers, but the core operating system is provided by Google, which leads to a wider variety of phones and price points to choose from, but weaker integration between software and hardware.\nApple's control of both the iPhone and the operating system (iOS) provides a more consistent experience along with ongoing support. With iOS 18, Apple supports all iPhones that were introduced in the last four years, so the majority of active iPhone owners can and do upgrade to the newest version of iOS that Apple rolls out each year.\nAndroid updates are often more inconsistent and often don't make it to all Android-based smartphones because each manufacturer has to implement support on an individual basis. So while Google also does yearly Android updates, the reality is that a lot of older Android smartphones don't get the new software.\nWith Apple's control and curation of the iPhone experience, the iPhone is largely considered to be the more secure platform, and Apple has made it a point to focus heavily on privacy. Apple's iOS is less customizable than Android, though, so for individuals who prefer flexibility and customization options, the Android operating system may be worth looking at.\nHow Do iPhone Updates Work?\nHere are the basics you should know about how Apple updates the iPhone and the iOS operating system.\nEach fall, typically in September, Apple releases a new series of flagship smartphones. These often come at high prices and feature the latest technologies, with Apple offering high-end models and still high-end but more affordable models. Prior-year iPhones often stick around with lower price points as cheaper alternatives to the latest and greatest technology, and occasionally, Apple launches a lower-cost iPhone outside of the normal fall timeline.\nAt the current time, Apple's iPhone lineup includes the iPhone 15 (2023), iPhone 15 Plus (2023), iPhone 16 (2024), iPhone 16 Plus (2024), iPhone 16 Pro (2024), iPhone 16 Pro Max (2024), and iPhone 16e (2025).\nApple also debuts an updated version of iOS at the same time that new iPhones launch, but new versions of iOS are pre-introduced every year at Apple's annual Worldwide Developers Conference to give developers time to incorporate new features and technologies into their apps ahead of when the software becomes available to the public. The current iPhones run iOS 18.\nIn this guide, we go over all of the iPhones that are in the current Apple lineup, offer up some buying suggestions, and provide tips and resources for both new and existing iPhone owners.\niPhone 16 Pro and iPhone 16 Pro Max ($999+)\nThe iPhone 16 Pro and iPhone 16 Pro Max are Apple's current high-end flagship devices with all of the top-of-the-line features and the most bells and whistles. The Pro models are for those who want to get the most out of their iPhones with the latest feature set.\nPricing on the iPhone 16 Pro starts at $999, while pricing on the iPhone 16 Pro Max starts at $1,199. The two iPhones are nearly identical when it comes to feature set, and it's only display size and battery capacity that set the two devices apart.\nApple introduced larger screen sizes and slimmed down bezels for the Pro lineup in 2024, so the iPhone 16 Pro Max has a larger 6.9-inch display (up from 6.7 inches), and the iPhone 16 Pro has a 6.3 inch display (up from 6.1 inches). Both models feature the same design with a glass front and back, a lightweight but durable titanium frame, and squircle edges. Colors this year include natural titanium, white titanium, black titanium, and desert titanium, which is a shade of gold.\nThe iPhone 16 Pro and Pro Max feature edge-to-edge OLED displays with the slimmest bezels we've seen in an iPhone to date. There's a second-generation \"Ceramic Shield\" that offers superior scratch resistance, and a pill-shaped Dynamic Island continues to house the front-facing camera and hardware used for Face ID authentication.\nThe customizable Action button is still available, and it now does more thanks to Control Center integration. This year, Apple also added a Camera Control button that can be used to activate the camera with a press. Camera Control makes it quicker to capture photos and videos, and it is also pressure and touch sensitive so you can change controls and adjust settings without touching the screen.\nThe Dynamic Island has been incorporated into the iPhone's interface and it is able to show various notifications and app information for phone calls, timers, Face ID, Bluetooth connections, and more.\nApple added a new A18 Pro chip to the iPhone 16 Pro and Pro Max, with a 6-core CPU, a 6-core GPU, and a 16-core Neural Engine. It is up to 20 percent faster than the A17 Pro from the iPhone 15 Pro models, and it is the fastest iPhone for Apple Intelligence.\nThere continues to be a three-lens camera setup with a 48-megapixel Main camera that offers improved low-light performance, a 12-megapixel 5x Telephoto lens, and a new 48-megapixel Ultra Wide camera. The 5x Telephoto is available for both Pro models, which is new this year, and the 48-megapixel Ultra Wide camera takes improved wide-angle and macro shots when lighting is poor.\nCrash Detection is able to determine if you've been in a serious car accident, alerting emergency services, and there's also an Emergency SOS via satellite feature for getting help if you're out of range of Wi-Fi and cellular. With iOS 18, the satellite connectivity can be used to send messages too.\nBoth iPhone 16 Pro models offer improvements to battery life, and they have a USB-C port and support for up to 25W MagSafe charging.\nOther features include IP68 water resistance, 8GB RAM, ProMotion 120Hz refresh rate for the display, faster 5G, a second-generation Ultra Wideband chip, faster USB-C charging, and Wi-Fi 7.\nKey Features:\n- Highest end, highest price\n- Triple-lens camera: Main (Wide), Ultra Wide, and Telephoto (5x for the Max)\n- 48-megapixel Main lens with ProRAW support\n- 48-megapixel Ultra Wide lens with macro capability\n- Camera Control button\n- A18 Pro chip\n- Action button\n- Always-On Display\n- Titanium frame\nBottom Line: The iPhone 16 Pro and iPhone 16 Pro Max are the iPhones to choose if you want the absolute best camera capabilities that you can get in an iPhone, with the Pro Max being the top-of-the-line model due to its increased display size, and longer battery life. In terms of performance, there isn't much of a difference between the iPhone 16 Pro models and the standard iPhone 16 models, with screen size, display quality, and chassis material differentiating the two iPhone lines.\niPhone 16 and iPhone 16 Plus ($799+)\nSold alongside the iPhone 16 Pro and iPhone 16 Pro Max, the iPhone 16 and iPhone 16 Plus are Apple's more affordable flagship devices. The iPhone 16 and 16 Plus feature many of the same capabilities as the Pro models, but they are missing some of the higher-end features to keep the price lower. The 6.1-inch iPhone 16 is priced starting at $799, while the 6.7-inch iPhone 16 Plus is priced starting at $899.\nDespite the difference in screen size, the iPhone 16 and 16 Plus are essentially identical, featuring a flat-edged design with a glass body and an aluminum frame. They do not offer ProMotion display technology and thus do not support an always-on display, but they do have the same Dynamic Island, front-facing camera, and Face ID authentication functionality.\nApple brought the Action button to the iPhone 16 lineup this year, so that is no longer a Pro-only feature. The Action button replaces the Ring/Silent switch, and it is customizable, so you can set it to bring up whatever is most convenient for you. It can mute/unmute your iPhone, activate the flashlight, open a favorite app, activate a Control Center control, turn on a Focus mode, and more.\nLike the iPhone 16 Pro models, the iPhone 16 and iPhone 16 Plus have a new Camera Control button below the power button. Pressing the button activates the camera, and a double press snaps a photo, so it makes it much quicker to get the shot that you want. The button is capacitive and pressure sensitive, so it can be used for changing various camera settings and swapping between tools. It works much like a DSLR shutter for autofocus with a half press, and you can adjust exposure, style, zoom, aperture, and more without ever touching the iPhone's display.\nWhile the iPhone 16 Pro models have an A18 Pro chip, the iPhone 16 models have an almost-as-capable A18 chip that also works with Apple Intelligence. The A18 has the same 6-core CPU and 16-core Neural Engine, but it has a 5-core GPU instead of a 6-core GPU. The chip is built using the same 3-nanometer technology, and it enables support for ray tracing and console-quality games, a feature that was previously limited to the Pro models. Battery life has improved compared to the prior iPhone 15 models thanks to the new chip technology.\nThere is a dual camera system that features 12-megapixel Ultra Wide and 48-megapixel Fusion (Wide) lenses with no Telephoto lens. The primary camera can be cropped in to a 2x zoom, so 0.5, 1x, and 2x options are supported. Some of the same photography and videography capabilities that are in the Pro models are also in the standard iPhone 16 models, including the new Photographic Styles for customizing your images and Audio Mix for adjusting the sound in your videos, plus support for shooting spatial videos and images.\nCapturing video in 4K at 120 frames per second is a Pro-only feature, as is support for shooting in ProRAW and ProRes, so if those are capabilities you need, you'll want to look at the Pro models.\nThe iPhone 16 models have support for mmWave (U.S. only) and Sub-6GHz 5G, and they also have a USB-C port and offer MagSafe charging at up to 25W, a new, faster speed this year. Crash Detection, Emergency SOS via satellite, and Messages via satellite are available as well. Compared to the Pro models, the standard models lack the titanium chassis, the Telephoto camera lens, and the A18 Pro chip.\nKey Features:\n- Dual-lens camera: Fusion (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Action button\n- Camera Control\n- A18 chip\nBottom Line: The iPhone 16 and 16 Plus offer many of the same features as the iPhone 16 Pro and 16 Pro Max at a more affordable price, and these are the iPhones that we recommend for most people. The differences are limited primarily to the camera and the display, and may not be of interest for those who are not heavily invested in iPhone photography, making the $200+ savings worth it for most. Older iPhones are another option to save money, but be aware that only the four iPhone 16 models and the prior-generation iPhone 15 Pro and Pro Max support Apple Intelligence.\niPhone 16e ($599+)\nPriced starting at $599, the iPhone 16e is similar in design to the iPhone 16, but it is actually modeled after the iPhone 14. It has an all-display design with Face ID, but it has an older-style notch rather than a Dynamic Island.\nThe iPhone 16e has a 6.1-inch OLED display like the iPhone 16, and it has the same 8GB RAM and A18 chip that supports Apple Intelligence, though there is one less GPU core. It is the first iPhone with Apple's new C1 modem, which is more efficient than Qualcomm's comparable X71 modem in the iPhone 16. While there is no mmWave 5G support, there seems to be no compromise to the more widespread sub-6GHz Wi-Fi speeds.\nThere is a single-lens rear camera in the iPhone 16e, and it is the same as the 48-megapixel Wide camera in the iPhone 16. It can take 1x and 2x photos, but there is no 0.5x option and no 5x zoom as there is in the iPhone 16 Pro models.\nThe iPhone 16e has the longest battery life of any 6.1-inch iPhone, and the battery lasts for up to 26 hours when watching video. It charges via USB-C, but it does not support MagSafe and wireless charging is limited to 7.5W. Not being able to use MagSafe is one of the main downsides to the iPhone 16e.\nIt is also worth noting that there is no Ultra Wideband chip for Precision Finding in the Find My app, and it is limited to Wi-Fi 6, so it will not connect to the 6GHz networks available with Wi-Fi 6E and Wi-Fi 7 routers.\nOther features include Crash Detection, Emergency SOS via Satellite, and Messages via Satellite, but these are also features available with other iPhone 16 models.\nKey Features:\n- Face ID\n- A18 chip\n- Lower price\nBottom Line: The iPhone 16e is now Apple's lowest-price iPhone, and it is worthwhile if you can live without a dual-lens camera system, faster Wi-Fi connectivity, and MagSafe. It has many of the same features as the iPhone 16 at a $200 lower price point.\niPhone 15 and iPhone 15 Plus ($699+)\nThe iPhone 15 and iPhone 15 Plus are Apple's prior-generation flagship devices that are now being sold at a discount. They have older technology and are lacking some of the new features that Apple introduced with the iPhone 16 models, including the Camera Control button, the faster A-series chip, the Action button, and, most importantly, support for Apple Intelligence. The iPhone 15 and iPhone 15 Plus cannot run the new Apple Intelligence features in iOS 18, so only consider Apple's prior-generation iPhones if that is not important to you.\nThe iPhone 15 models don't look notably different from the iPhone 16 models, except for the color options. Apple did not make major design changes, but the iPhone 15 models do not have a Camera Control button and they have a Ring/Silent switch instead of an Action button. There's also a diagonal rear camera setup that does not offer some of the newer camera capabilities like Photographic Styles for customizing the look of your images or Audio Mix for tweaking the sound in your videos.\nWhile the iPhone 15 and 15 Plus don't support some of the newer software-based camera features, the hardware is largely the same. There's a Main (Wide) lens that supports 1x and 2x zoom, and an Ultra Wide lens. There is no dedicated Telephoto lens.\nThe iPhone 15 measures in at 6.1 inches, while the iPhone 15 Plus is 6.7 inches. The two devices are essentially identical, with a Dynamic Island for Face ID, aluminum frames, and OLED screen technology. The iPhone 15 and iPhone 15 Plus have an older A16 chip that is two generations behind the newer chips in the current flagship models.\nThe iPhone 15 models have support for mmWave (U.S. only) and Sub-6GHz 5G and use the X70 Qualcomm chip, one generation behind the Qualcomm chip in the new iPhones. Battery life is a little shorter, but the iPhone 15 models do support MagSafe and USB-C. There is no support for the faster 25W MagSafe charging, though, with the iPhone 15 models limited to 15W MagSafe charging.\nBetween the iPhone 15 and 15 Plus, the features are identical with the exception of screen size and battery, as the iPhone 15 Plus can accommodate a larger battery size.\nKey Features:\n- Diagonal dual-lens camera: Main (Wide), Ultra Wide\n- Crash Detection\n- USB-C port\n- Dynamic Island\n- 5G support\n- A16 chip\nBottom Line: The iPhone 15 and 15 Plus are solid devices that will perform well at an affordable price, but keep in mind that the iPhone 16 is such a notable upgrade that it may be worth paying $100 more for the iPhone 16 this year. The iPhone 15 models do not have an Action button or a Camera Control button, and they cannot run the Apple Intelligence features in iOS 18, so you'd be missing out on the more capable Siri, customizable emoji, Writing Tools, and other Apple Intelligence functions. A prior-generation iPhone is usually a good way to save money, but this year, we don't recommend it.\nFrequently Asked Questions\nThere's no one single iPhone that's best for everyone, and picking the right smartphone needs to take into account factors like budget, desired battery life, preferred feature set, and more.\nIf you want the absolute best photographic capabilities for example, you're going to want the iPhone 16 Pro or iPhone 16 Pro Max, and if you want something that has a solid feature set at a great price, the iPhone 16e is what you'll want to look at.\nBelow, we've outlined some of the best iPhone choices based on different scenarios or features that you might be looking for.\nWhich iPhone Has the Best Battery Life?\nWith the efficient A18 Pro chip, the iPhone 16 Pro Max has the longest battery life for any iPhone to date at up to 33 hours when watching videos. The iPhone 16 Pro and iPhone 16 Plus are second and will last up to 27 hours when watching videos. The iPhone 16e lasts for up to 26 hours when watching videos, and it is the smallest of the bunch at 6.1 inches.\nWhich iPhone Has the Best Camera?\nWith their updated triple-lens camera systems, 48-megapixel Fusion lens, 5x Telephoto lens, 48-megapixel Ultra Wide lens, and LiDAR Scanners, the iPhone 16 Pro and iPhone 16 Pro Max have the best iPhone cameras that you can get. Both of the new iPhones include a three-lens camera system with the same feature set. This year, the Ultra Wide lens has been upgraded to 48 megapixels, allowing for more detailed wide-angle and macro shots.\nThe Fusion lens supports 24-megapixel and 48-megapixel high-resolution photos through the Photonic Engine, and the Ultra Wide lens supports 12-megapixel images that have the detail from the combined pixels of the 48-megapixel resolution. Using computational photography, the Fusion camera can be set to 24mm, 28mm, and 35mm focal lengths to better mirror what's possible with DSLRs.\nAll four iPhone 16 models have a new Camera Control button that makes it easier to capture a photo or a video with just a couple of button presses, and the Camera Control button is also capacitive and pressure sensitive so it can be used for changing photography modes and adjusting settings, which makes your iPhone feel more like a camera.\nWhich iPhone Has Touch ID?\nUnfortunately, none of Apple's iPhones have Touch ID. It has been phased out, and Face ID is the only option.\nWhich iPhone is Best For One-Handed Use?\nThe iPhone 16 and the iPhone 16e both measure in at 6.1 inches, and they are the smallest iPhones that Apple makes. They won't work for one-handed use for everyone, but they are a better option than the 16 Plus and 16 Pro Max.\nWhich iPhone is the Best Value?\nWith Apple Intelligence support, a 48-megapixel camera, OLED display, and 5G connectivity for $599, the iPhone 16e is the best deal that Apple offers. If you need faster mmWave 5G speeds, Wi-Fi 7 connectivity, MagSafe, and an Ultra Wide camera, the $799 iPhone 16 is the upgrade option.\nIf you don't need the latest bells and whistles like Apple Intelligence and don't mind losing out on a bit of performance and battery life, the iPhone 15 and 15 Plus, which are $100 cheaper than than their iPhone 16 counterparts, could be worth considering.\nFor many people, the iPhone 16 and iPhone 16e are the iPhones to get this year with their lower price point and modern feature set.\nWhich iPhone Has the Most Features?\nIf you want the iPhone with the most bells and whistles, that's the iPhone 16 Pro and iPhone 16 Pro Max. These iPhones offer OLED displays, triple-lens cameras, glass bodies with titanium steel frames, larger maximum storage capacities, and longer battery life.\nCompared to the iPhone 16 models, the iPhone 16 Pro and Pro Max have better camera capabilities. The absolute best would be the iPhone 16 Pro Max because of its larger display and bigger battery.\nIn More Detail\nStill not sure? We have deeper dives comparing the iPhone 16 models to each other and to the prior-generation iPhone models, and the standard iPhone 16 to the Pro.\n- iPhone 16 vs. iPhone 16 Pro Buyer's Guide: All Differences Compared\n- iPhone 15 vs. iPhone 16 Buyer's Guide: 30+ Upgrades Compared\n- iPhone 15 Pro vs. iPhone 16 Pro Buyer's Guide: 45+ Upgrades Compared\n- iPhone 15 vs. iPhone 16e Buyer's Guide: 25+ Differences Compared\n- iPhone 16e vs. iPhone 16 Buyer's Guide: 25+ Differences Compared\nFor full details on each phone, explore our roundups:\nUpcoming iPhone Rumors\nApple is working on new iPhone 17 models that will come out in the fall of 2025. This lineup will do away with the \"Plus\" iPhone, with Apple instead planning to release an \"Air\" or \"Slim\" model that is thinner and more expensive. It will be sold alongside the standard iPhone 17, the iPhone 17 Pro, and the iPhone 17 Pro Max. For more information, check out our roundups:\nGuide Feedback\nHave questions about choosing an iPhone, notice something we left out, or want to offer feedback on this guide? Send us an email here."
    },
    {
      "url": "https://www.macrumors.com/roundup/iphone-17-air/",
      "text": "The 2025 iPhone 17 Air\nContents\nWith the September 2025 iPhone launch, Apple will introduce an ultra thin \"iPhone 17 Air,\" marking the first notable redesign to the iPhone's form factor in several years. iPhone 17 Air is just a placeholder name, and we don't know what Apple will call the new device, but multiple rumors have confirmed Apple's work on a super thin iPhone.\nThe iPhone 17 Air is expected to be around 5.5mm thick, and at 5.5mm, it will be the thinnest iPhone released to date. That measurement doesn't include the area with the camera bump, which could be thicker to accommodate the single 48-megapixel rear camera rumored for the device.\nApple will sell the iPhone 17 Air alongside the standard iPhone 17, the iPhone 17 Pro, and the iPhone 17 Pro Max. We are not expecting an iPhone 17 Plus this year, with the iPhone 17 Air effectively replacing it in the lineup. Early rumors suggested the iPhone 17 Air could be as expensive or more expensive than the iPhone 17 Pro, but more recent information suggests it will cost more than the iPhone 17 but won't be as expensive as the iPhone 17 Pro and iPhone 17 Pro Max. That suggests we could see a price point around $899, similar to the current iPhone 16 Plus.\nIn terms of size, rumors suggest the iPhone 17 Air will have a 6.6-inch display, which will put it in between the iPhone 17 and the iPhone 17 Pro Max in size. As mentioned, it will have a single-lens rear camera, and Apple could be planning for a horizontal bar-like camera bump at the back, a design feature that's also rumored for the Pro iPhones.\nThe iPhone 17 Air is expected to feature a 120Hz ProMotion display, and it will be equipped with Apple's C1 5G modem. Other features will include an A19 chip, Wi-Fi 7, and a more advanced display material that can better hold up to drops and scratches. There will be some small design changes to accommodate the device's thin chassis, such as a USB-C port that's not entirely centered, and fewer speaker holes.\nApple plans to market the iPhone 17 Air with a focus on design rather than internal specs. It won't have the top-of-the-line components or the fastest chip like the iPhone 17 Pro models, but the fresh design may be appealing to customers.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nDesign\nWith the 2024 iPad Pro launch, Apple slimmed down the chassis, and the 12.9-inch model is just 5.1mm thick. It's Apple's thinnest device ever, and now Apple is aiming to follow it up with a super thin and light iPhone.\nWe've heard several rumors about the iPhone 17 Air, and thickness estimates have ranged from 5mm to a little over 6mm. Bloomberg's Mark Gurman, for example, thinks that the iPhone 17 Air will be around two millimeters thinner than the iPhone 16 Pro.\nThe iPhone 16 Pro is 8.25mm thick, so an iPhone 17 that's 2mm thinner would come in at around 6.25mm. 6.25mm would make the iPhone 17 Air the thinnest iPhone to date, but some rumors think it will be even thinner.\nThe Information believes the iPhone 17 Air will be around 6mm thick, while Jeff Pu thinks it will be 6mm thick. Apple analyst Ming-Chi Kuo believes the iPhone 17 Air will be 5.5mm thick at its thinnest point, which likely means it will have a 5.5mm chassis with a thicker area for the rear camera bump. Dummy models that have surfaced are approximately 5.5mm thick.\nThe thinnest iPhone to date was the iPhone 6, which measured in at 6.9mm. iPhones got thicker with the iPhone X and beyond, because Apple changed device thickness to provide more space for the battery, camera lenses, Face ID hardware, and more. The iPhone 17 Air could be 9.5mm thick at the camera bump end, which means we can expect the camera bump to be notably thicker than the rest of the device.\nApple might use a titanium-aluminum frame for the iPhone 17 Air, with the device using more titanium than the current Pro iPhones. Rumors suggest that the iPhone 17 Air will weigh in at 145 grams. That would make it similar in weight to the iPhone SE 2 or the iPhone 13 mini, which are 148 grams and 141 grams, respectively. Titanium could help ensure that the iPhone frame resists bending while also keeping the device lightweight.\nConceptual renderings of the iPhone 17 Air provide insight into what the device is expected to look like. Mockups, renders, and dummy models feature a device with a slim, 5.5mm profile and a thicker rear camera bar with single-lens camera. Apple hasn't implemented a horizontal camera bar before, so this will be a significant design change. The iPhone 17 Pro models are also expected to have a camera bar.\nThe iPhone 17 Air will have a 6.6-inch display, which Apple chose because it was worried anything larger might be susceptible to bending. Apple initially planned on a 6.9-inch screen size for the device, but it was sized down to prevent any potential bending issues.\nRumors suggest the iPhone 17 Air will feature a \"glass section\" around the logo that's integrated into an \"overall metal chassis,\" which has previously been described as a half aluminum, half glass build. The design can be seen in some renderings and iPhone 17 Air dummy models.\nThe iPhone 17 Air will have some subtle design changes so that all of the internal components can fit despite the thinness of the chassis. Dummy models suggest that the USB-C port on the bottom edge won't be centered front to back, and will instead be shifted closer to the rear of the device.\nThe speaker grilles have also been simplified, with just two holes on either side of the port rather than the typical five.\nThe iPhone 17 Air will include MagSafe charging, a Camera Control button, and an Action Button, based on dummy models of the device that have been circulating.\nA closer look at the thin design of the iPhone 17 Air can be seen in a video that shows off an iPhone 17 Air dummy model. Dummy models are often an accurate representation of what we can expect, as they are created for case makers based on leaked information from Apple's suppliers.\nA screen protector designed for the iPhone 17 Air based on leaked design dimensions suggests that the front camera of the device might be located on the left of the Dynamic Island, rather than on the right like the iPhone 16 models.\nColors\nThe iPhone 17 Air could be available in black, white, light gold, and light blue. The blue shade is rumored to be a very light blue similar to the blue that Apple used for the MacBook Air.\niPhone 17 Cases\nApple's iPhone 17 cases could include a cutout for attaching a lanyard, which would be a new feature.\nDisplay\nThe iPhone 17 Air is rumored to have a 6.6-inch display, which means it will be larger than the iPhone 17 but smaller than the iPhone 17 Pro Max. There have been mixed rumors about the size of the Dynamic Island. Analyst Jeff Pu claims that Apple is using metalens technology for Face ID that will allow for a narrower Dynamic Island, but Apple analyst Ming-Chi Kuo does not expect notable changes to the Dynamic Island and he believes it will be the same size.\nThe iPhone 17 Air is expected to use the same OLED panel as the current iPhone 16 Pro models, which is sourced from Samsung. The panel has a 30 percent increase in brightness and improved longevity compared to the prior-generation iPhone 16 display.\nThe entire iPhone 17 lineup is could get 120Hz ProMotion display technology, which means it will no longer be a feature limited to the Pro lineup. ProMotion displays will be enabled by the low-temperature polycrystalline oxide (LTPO) panels that Apple plans to use for all of the iPhone 17 models. LTPO allows for 1Hz to 120Hz refresh rates, and adds always-on display support.\nWhile multiple rumors have suggested ProMotion display capabilities will expand to the entire iPhone 17 lineup, a Chinese leaker believes that's partially inaccurate. The leaker says that the iPhone 17 and iPhone 17 Air will get 120Hz displays, but that the displays will not support adaptive refresh rates down to 1Hz.\nA 120Hz panel would allow for smoother scrolling, animations, and UI transitions, but it would not allow for always-on display functionality.\nThere were rumors that some iPhone 17 models were going to be updated with a scratch resistant anti-reflective display coating, but it sounds like that might not happen this year after all. Apple ran into issues scaling up its display coating process, and it was too slow when taking into account millions of devices, so the coating plan was scrapped.\nHints of the iPhone 17 Air were found in the iOS 26 beta. There is a wallpaper for a display that has a 1260 x 2736 resolution, but that doesn't correspond to any existing iPhone models. It is, however, a resolution that would work for a 6.6-inch display.\nNaming\nWe don't know what Apple is going to call its ultra thin iPhone. Rumors have referred to it as the \"iPhone 17 Slim\" or the \"iPhone 17 Air,\" but neither name is official.\nGiven that Apple has an iPad Air and an iPad Pro and a MacBook Air and a MacBook Pro, the iPhone \"Air\" naming might make the most sense to Apple customers.\nA-Series Chip\nApple is working on A19 and A19 Pro chips for the iPhone 17 lineup, and the iPhone 17 Air will get one of those two options. Some rumors suggest it will get the A19 alongside the iPhone 17, but it could also feature the A19 Pro with one fewer GPU core than the A19 Pro used in the iPhone 17 Pro.\nRumors suggest that all iPhone 17 models will have a vapor chamber heatsink to improve thermal performance. Vapor chambers work by spreading head evenly across a larger area, reducing thermal throttling and ensuring consistent performance.\nThe iPhone 17 Air is expected to have 12GB RAM, which would put it on par with the iPhone 17 Pro models. Current iPhone 16 models have 8GB RAM, the minimum for Apple Intelligence.\nCamera\nWith limited internal space due to the slimmed down design, the iPhone 17 Air will get just a single-lens rear camera. Rumors suggest it will use the same 48-megapixel Wide camera that's in the iPhone 16 models. If the iPhone 17 Air only has a single-lens rear camera, it will not be capable of capturing spatial video or spatial photos unless Apple has a new technique in mind for capturing this kind of content.\nAll iPhone models coming in 2025 are rumored to have an upgraded 24-megapixel front-facing camera, which is an improvement over the 12-megapixel front-facing camera in the iPhone 16 models. The camera will notably improve image quality, and allow for more cropping in without a loss of quality.\nConnectivity\nApple-Designed 5G Modem Chip\nThe iPhone 17 Air is expected to be one of the first iPhones that will use an Apple-designed 5G modem chip. Apple's modem will be capable of theoretical 5G download speeds of up to 4Gb/s, which is slower than Qualcomm modems in current iPhones. The chip also won't support the fastest mmWave 5G, and it will be limited to sub-6GHz speeds.\nFor other iPhone 17 models, Apple plans to continue to use Qualcomm chips. It's just the iPhone 17 Air that will get the Apple chip.\nSIM Tray\nApple will remove the physical SIM slot in iPhones sold in more countries next year, though it is not yet clear which countries. U.S. iPhone models haven't included a SIM tray since the iPhone 14, but Apple has continued using it in other countries.\nThe iPhone 17 Air may be too thin to support a SIM tray.\nBluetooth and Wi-Fi\nAll four iPhone 17 models that are coming in 2025 will have Apple's first custom-designed Wi-Fi chip with Wi-Fi 7 support. Wi-Fi 7 is already used in the iPhone 16 models, but Apple's chip design could bring additional efficiency and connectivity improvements, and it paves the way for a future all-in-one SoC.\nApple is aiming to create a wireless setup where the components are tightly integrated and more energy efficient, which will let the company cut down on the battery use of cellular, Wi-Fi, and Bluetooth technologies.\nWi-Fi 7 supports data transmission over 2.4GHz, 5GHz, and 6GHz band simultaneously for faster speeds and lower latency with a supported router. Wi-Fi 7 supports peak speeds of more than 40Gb/s. Bluetooth 5.3 is also expected.\nBattery\nWith the iPhone Air featuring a chassis that's just 5.5mm thick, there will be less room for the battery. Apple is optimizing battery life with the more efficient C1 modem, processor improvements, and a higher-density battery that could use silicon-anode battery technology, but there could still be a hit to battery life.\nAccording to The Information, the iPhone 17 Air will have \"worse\" battery life compared to other iPhones. Apple's internal testing has apparently found that 60 to 70 percent of iPhone 17 Air users will be able to go a full day without charging, while that number is 80 to 90 percent for other iPhone models.\nThe iPhone 17 Air could have a 2,800mAh battery, which would be similar to the battery that Apple used in the iPhone 12. A second rumor says the battery will be under 3,000mAh, and a third suggests Apple will use a 2,900mAh battery.\nAlleged images of the iPhone 17 Air's battery suggest that it will be half as thin as the battery designed for the iPhone 17 Pro. It supposedly measures in at 2.49mm thick, which would take up just under half the thickness of the device if the iPhone 17 Air is 5.5mm thick as rumored.\nCharging\nApple is planning to release an iPhone battery case alongside the iPhone 17 Air that will add extra battery capacity, but it will mean that iPhone 17 Air users who need more battery will have to compromise on thickness.\nThe iPhone 17 models are expected to support up to 35W wired charging speeds, which means there would be no change from the current charging maximum.\nThe iPhone 17 models could support 25W wireless charging with third-party wireless chargers that support the next-generation Qi 2.2 wireless charging standard. Right now, iPhones are limited to 15W wireless charging with third-party chargers, but the new Qi standard supports up to 25W charging.\nPricing\nThe iPhone 17 Air could be priced at $899, which is the current price for the iPhone 16 Plus. At $899, the iPhone 17 Air would be more expensive than the iPhone 17, but less expensive than the iPhone 17 Pro.\nThe iPhone 17 models could see a price hike, as Apple's component costs are increasing due to tariffs. Apple will pair the potential price increase with new features and design changes to justify the price to consumers, rather than blaming tariffs.\niPhone 17 Air Launch Date\nThe iPhone event could take place on Tuesday, September 9, according to leaked information sourced from a German carrier. If that's the case, pre-orders could take place on September 12, and a launch could follow on September 19.\nWhat's Next for the iPhone Air\nApple is already planning for the next few iPhone Air models, and the company plans to introduce an iPhone 19 Air with a larger display in the second half of 2027. The iPhone 18 Air coming in 2026 will be the same size as the iPhone 17 Air coming in September.\nA future version of the iPhone Air could use an upgraded LTPO3 OLED display that uses far less battery power. Apple could introduce this technology by 2027, resulting in iPhones that have longer battery life."
    },
    {
      "url": "https://www.macrumors.com/2025/05/12/apple-considering-price-increases-iphone-17/",
      "text": "WSJ: Apple Weighing Price Hikes for iPhone 17 Lineup Without Blaming Tariffs\nApple is considering raising prices for its upcoming iPhone 17 models set to release this fall, according to people familiar with the matter cited by The Wall Street Journal.\nThe company reportedly aims to pair the potential price hikes with new features and design changes to justify the increased cost to consumers, rather than attributing them to U.S. tariffs on goods from China.\nThe U.S. and China recently agreed to suspend most tariffs imposed during their trade dispute, but a 20% tariff implemented by President Trump on Chinese goods remains in place and covers smartphones.\nThe WSJ report notes that Apple is particularly concerned about avoiding any appearance that price increases are directly related to tariffs. From the report:\nThe people familiar with the supply chain said Apple would have trouble making up for China tariff costs solely by seeking further savings from its suppliers, meaning a hit to its profit margin was likely unless it could raise prices.\nAt the same time, company executives are wary of blaming increases on tariffs. When a news report in April said Amazon might show the impact of tariffs to its shoppers, the White House called it a hostile act and Amazon quickly said the idea \"was never approved and is not going to happen.\"\nThese circumstances have led Apple to look at what supply-chain insiders described as the least-bad choice: raising prices on the new iPhones to preserve profit and finding reasons other than tariffs to explain the move. It couldn't be determined what new features Apple may offer to help justify price increases.\nAmid growing pressure over U.S.-China trade tensions, Apple has built up inventory and shifted manufacturing for the U.S. market to India. Apple CEO Tim Cook stated earlier this month that a majority of iPhones shipped to the U.S. in the April-June quarter would come from India.\nHowever, Chinese factories will continue to handle most production for Apple's high-end Pro and Pro Max models, as India's infrastructure and technical capabilities aren't yet sufficient to support mass production at China's scale.\nThe upcoming iPhone lineup, expected to be called iPhone 17, is expected to include an all-new ultra-thin iPhone 17 Air, which replaces the Plus model in Apple's lineup. Current iPhone models range from the base iPhone 16 starting at $799 to the iPhone 16 Pro Max at $1,199.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/2025/07/30/iphone-17-price-increase-expected/",
      "text": "iPhone 17 Models May See $50 Price Hike, Says Jefferies\nApple is expected to implement a $50 price increase across its iPhone 17 lineup when the new models launch in September as a way to offset rising component costs and China tariffs, according to a new investor note by Jefferies analyst Edison Lee.\nThe price hike is expected across all iPhone 17 models, including the regular iPhone 17, iPhone 17 Air (replacing the Plus model), iPhone 17 Pro, and iPhone 17 Pro Max. Current iPhone models range from the base iPhone 16 starting at $799 to the iPhone 16 Pro Max at $1,199.\nThe analyst's prediction came as it gave AAPL stock a Hold rating, citing strong iPhone sales in the second quarter of 2025. U.S. telecommunications companies reported a 22% year-on-year equipment growth, their highest in six quarters, according to the analyst's note.\nThe Wall Street Journal reported in May that Apple was considering raising prices for its upcoming iPhone 17 models. The company reportedly aims to pair the potential price hikes with new features and design changes to justify the increased cost to consumers, rather than attributing them to U.S. tariffs on goods from China.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/2025/08/06/apple-india-tariff-increase-no-impact/",
      "text": "Apple Won't Be Impacted by India Tariff Increase\nU.S. President Donald Trump is increasing the tariff on goods from India to 50 percent starting on August 27, but Apple's manufacturing in the country won't be affected.\nSemiconductors and derivative products like iPhones are already exempt from the existing 25 percent reciprocal tariffs that are in place. According to CNBC, the executive order increasing the tariff rate doubles the 25 percent reciprocal tariff rate to 50 percent, and semiconductors will continue to be exempt.\nApple is already unaffected by the 25 percent reciprocal tariffs in India that were put in place on August 1, and it looks like that's not going to change if and when tariffs increase to the 50 percent mark later in August.\nApple has been shifting a significant portion of its manufacturing from China to India for supply chain diversification and because of U.S.-China trade tensions. Apple partners like Foxconn and Pegatron have established factories in India for assembling the iPhone, and all five iPhone 16 models are assembled in the country for Indian customers and for export to countries like the U.S.\nThe order that exempts Apple from paying reciprocal tariffs is temporary, and exemptions could change at Trump's whim. Trump has said that no one is \"getting off the hook,\" and that his administration is working on specific semiconductor levies that could impact Apple devices.\nApple is working hard to convince Trump not to subject it to additional tariffs. The company promised to invest $500 billion in U.S. manufacturing earlier this year, and today, Trump is announcing another $100 billion Apple investment in the form of a new U.S.-based Apple manufacturing program. Apple CEO Tim Cook will be present for the announcement.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/2025/08/08/iphone-17-pro-minimum-256gb-storage-up-from-128gb/",
      "text": "iPhone 17 Pro to Get Minimum 256GB Storage, Up From 128GB\nApple's upcoming iPhone 17 Pro will reportedly launch with a minimum 256GB of storage, doubling the base capacity of the current iPhone 16 Pro. The information comes from Chinese leaker Instant Digital, posting on Weibo.\nCurrently, the iPhone 16 Pro starts at 128GB for $999, while the 256GB version costs $1,099. By contrast, the larger iPhone 16 Pro Max already begins at 256GB for $1,199. Both Pro models offer up to 1TB of storage.\nBefore the launch of the iPhone 15 series in 2023, there were rumors that the iPhone 15 Pro Max would drop the 128GB tier and start at $1,199, up from $1,099 for the iPhone 14 Pro Max. The rumor proved accurate, but only because Apple eliminated the lower storage option, effectively raising the entry price.\nApple may be preparing a similar shift for the iPhone 17 Pro. A new 256GB base model could be priced at $1,049, replacing the 128GB model at $999. Rather than a straightforward $50 price hike, this move could be perceived by customers as better value, offering more storage for only a modest increase – and simplifying the lineup in the process.\nIn July, Jefferies reported that Apple plans to raise prices across the iPhone 17 lineup by $50, citing higher component costs and tariffs related to China. Instant Digital echoed this expectation in a previous post. The Wall Street Journal has also reported that Apple is considering raising prices for its upcoming iPhone 17 models.\nWe'll know for sure soon enough. Apple is rumored to unveil the iPhone 17 lineup on September 9, with a potential launch date of September 19.\nPopular Stories\nWith iOS 26, Apple is bringing several new features to the AirPods, making them more useful than before. The added functionality will be available this fall when Apple releases iOS 26 and updated AirPods firmware, but you can test everything new right now.\nCamera Remote\nThe AirPods can be used as a camera remote for the Camera app or third-party iOS camera apps. You'll need to enable the...\nThe iPhone 17 series is now just weeks away. Apple's iPhone 17 event this year is rumored to be scheduled for Tuesday, September 9. If Apple follows the traditional pattern, iPhone 17 pre-orders would begin on the Friday, September 12. The new devices would then likely reach customers and retail stores the following Friday, September 19.\nIf you're in the market for a new iPhone this year, or ...\nThere's just about a month to go until Apple unveils the Apple Watch Series 11 models at its September event. Last year we got display upgrades, and this year, there could be new health features. We've recapped all of the current Apple Watch Series 11 rumors for a quick preview of what might be coming.\nFaster Chip\nApple is likely planning to introduce an updated S11 chip that offers a more...\nApple is continuing to tweak the way that the Liquid Glass design looks ahead of the iOS 26 launch, and the latest beta makes a change to the Lock Screen.\nThe Lock Screen clock has been updated with additional transparency, allowing more of the background to peek through.\nBeta 6 on left, beta 5 on right\nThe clock also has more of a 3D, floating look, which is in line with the rest of the ...\nApple's rumored new more affordable MacBook could have a starting price as low as $599 and launch as soon as this year, according to a new report out of Asia.\nWe first learned of Apple's low-cost MacBook plans in late June, when analyst Ming-Chi Kuo said the company was developing a \"more affordable\" 13-inch laptop that would compete with Chromebooks and drive MacBook purchases, though he...\nAs previously announced, this Saturday will be the final day of business for Apple Bristol in Bristol, England and Apple Parkland in Dalian, China.\nThe relocated Apple Touchwood Centre near Birmingham\nBoth of the stores will be permanently closing tomorrow, for landlord-related reasons. Apple Bristol is closing due to the landlord's redevelopment plans at the Cabot Circus Shopping Centre, and ...\nDespite being over two years old, Apple's AirPods Pro 2 still dominate the premium wireless‑earbud space, thanks to a potent mix of top‑tier audio, class‑leading noise cancellation, and Apple's habit of delivering major new features through software updates. Rumors suggest AirPods Pro 3 could arrive as soon as September 2025 alongside the iPhone 17 lineup, giving prospective AirPods...\nThe calendar has turned to August, and that means the iPhone 17 series is just one month away. Apple has yet to officially announce an event, but it has been rumored that the devices will be announced on Tuesday, September 9.\nSubscribe to the MacRumors YouTube channel for more videos.\nBelow is the August 2025 edition of our iPhone 17 Pro rumor recap, for an up-to-date overview of what to..."
    },
    {
      "url": "https://www.macrumors.com/roundup/iphone-17/",
      "text": "The 2025 iPhone 17\nContents\nWe're still a few months away from the debut of the iPhone 17 models, but rumors about the new devices have been circulating since before the iPhone 16 models even launched. We know quite a bit about what's coming in 2025, and it should be an exciting year.\n2025 may bring one of the biggest updates to the iPhone's design that we've seen since the 2017 iPhone X, with Apple rumored to be planning for an all-new iPhone 17 \"Air\" that has a thinner design, a new display size, a different look for the camera, and more.\nWe are expecting four total models in 2025: the iPhone 17, the iPhone 17 Pro, the iPhone 17 Pro Max, and the new iPhone 17 \"Air.\" There will be no iPhone 17 Plus, with Apple doing away with the \"Plus\" lineup because it has not proven popular with customers. The slimmed down iPhone 17 Air won't be a direct replacement for the iPhone 17 Plus, instead making a debut as a new device option in the lineup. Rumors suggest that the upcoming iPhone 17 Air will have a display that's around 6.6 inches, and a chassis that's 6mm thick or less.\nIf we compare the iPhone lineup to the Mac and iPad lineups, the iPhone 17 Air will be comparable to the MacBook Air or the iPad Air, while the iPhone 17 Pro is the equivalent of the MacBook Pro or the iPad Pro.\nBecause the iPhone 17 Pro and Pro Max will have 6.3-inch and 6.9-inch display sizes like the current 16 Pro models, the iPhone 17 Air will be right in the middle of those two devices in terms of size. Apple is also expected to increase the overall size of the standard iPhone 17 to 6.3 inches to match the size of the iPhone 17 Pro.\nSome early rumors suggested the slimmer iPhone 17 Air could be a high-end device that's more expensive than the iPhone 17 Pro Max, but it's actually going to be a mid-tier device that's less expensive than the iPhone 17 Pro and Pro Max, but more expensive than the iPhone 17. In that way, it will replace the \"Plus\" iPhone in the lineup as a middle ground in price between the 17 and the 17 Pro.\nAll four iPhones released in 2025 are expected to get ProMotion display technology with a 120Hz maximum refresh rate for smoother scrolling and video playback, which means that ProMotion will no longer be a feature limited to the Pro iPhone models. The change will be enabled by LTPO OLED displays that Apple is rumored to be using for all of the iPhone 17 models. Always-on display technology is also enabled by LTPO display technology, but it's not yet clear if always-on will come to all models or remain exclusive to the Pro iPhone models.\nFor the Pro models, Apple could swap out titanium for aluminum, and part of the glass frame could transition to aluminum for better durability. We've heard rumors indicating that the iPhone 17 Pro models will have a half-glass half-aluminum exterior, with the glass portion still allowing for MagSafe charging. This update could come alongside a camera design change, with Apple perhaps opting for a horizontal pill-shaped camera bump rather than the traditional square camera bump. We've also heard that the iPhone 17 Air could have a horizontal camera bump, so this is likely to be a design change that we'll see for multiple iPhones in the lineup.\nAs for camera updates, Apple is said to be working on an updated 24-megapixel front-facing camera with a six-element lens, and the iPhone 17 Pro Max could include an upgraded 48-megapixel Telephoto camera, which would be an improvement over the current 12-megapixel sensor. The iPhone 17 is expected to have the same Wide and Ultra Wide cameras, while the iPhone 17 Air is expected to get a single-lens 48-megapixel rear camera.\nAt least one iPhone 17 model next year will get an Apple-designed Wi-Fi 7 chip rather than a chip manufactured by Broadcom, and it's likely to be the iPhone 17 Air. Apple is also expected to use its own modem chip in the device, testing it instead of a Qualcomm chip. The standard iPhone 17 and the iPhone 17 Pro models are likely to continue to use Qualcomm chips.\nNote: See an error in this roundup or want to offer feedback? Send us an email here.\nDesign\niPhone 17\nThis year, Apple is planning for an iPhone 17, an iPhone 17 Air, an iPhone 17 Pro, and an iPhone 17 Pro Max, but there will be no iPhone 17 Plus in the lineup. Apple is nixing the \"Plus\" iPhone due to subpar sales and limited customer interest in the device.\nThe standard iPhone 17 will look a lot like the current iPhone 16, with most rumors focusing on the iPhone 17 Air and the iPhone 17 Pro models. So far, we haven't heard a lot that's specific to the iPhone 17, and it will be the iPhone that gets the fewest new features in terms of design.\nWe are expecting a larger display size. Rumors suggest the iPhone 17 display will be 6.3 inches, up from 6.1 inches. At 6.3 inches, it'll be the same size as the iPhone 16 Pro, which is also the size that Apple plans to use for the iPhone 17 Pro. Apple is eliminating the Plus model entirely, so there's just going to be the one lower-priced standard iPhone 17. Display sizes across the lineup will be 6.3 inches for the iPhone 17 and 17 Pro, 6.6 inches for the iPhone 17 Air, and 6.9 inches for the iPhone 17 Pro Max.\nThe iPhone 17 Air and iPhone 17 Pro models are rumored to have a new rectangular camera bar with rounded corners, with the bar spanning the back of the iPhone. The standard iPhone 17 model is not expected to feature the same design change, and it will continue to look like the iPhone 16 with two vertical rear cameras positioned in a pill-shaped camera bump.\nApple is said to be testing new green and purple shades for the upcoming iPhone 17 models. The iPhone 17 models could come in black, white, steel gray, light blue, green, and purple.\nBased on CAD renders, mockups, and dummy models, there is no change to the design of the iPhone 17 camera, while the iPhone 17 Air has a single lens rear camera with an elongated bump. The iPhone 17 Pro and Pro Max feature a wide bump that houses three lenses in the same arrangement as the current design, but with a horizontal bump that adds more space between the lenses and the LiDAR and flash.\nAll of the iPhone 17 models coming in 2025 could feature slimmed down bezels, with the smaller bezels of the 16 Pro and Pro Max expanding to the iPhone 17.\nThere have been mixed rumors about the size of the Dynamic Island for the iPhone 17 models. Analyst Jeff Pu claims that Apple is using metalens technology for Face ID that will allow for a narrower Dynamic Island on all four models, but Apple analyst Ming-Chi Kuo does not expect notable changes to the Dynamic Island and he believes it will be the same size as the iPhone 16 Dynamic Island.\niPhone 17 'Air'\nMultiple rumors have suggested that Apple is working on an all-new version of the iPhone for 2025, with the device expected to have a \"significantly thinner\" design than current iPhone models. It won't be a direct replacement for the \"Plus\" iPhone that Apple has released for the last several years, but we aren't getting an iPhone 17 Plus this year in order to make room for the new iPhone 17 Air.\nWe've heard Apple's new super thin iPhone referred to as the \"iPhone 17 Slim\" or the \"iPhone 17 Air,\" but we don't know what Apple will actually call the new iPhone when it launches in 2025. iPhone 17 Air seems to make the most sense given that Apple already has a MacBook Air and an iPad Air and uses the name to distinguish those devices from higher-end Pro models.\nThe placeholder names reference the sleeker, thinner design of the device. Rumors have not exactly agreed on size, and we've heard everything from 5mm thick to a bit over 6mm thick. Bloomberg's Mark Gurman believes the iPhone 17 Air will be about two millimeters thinner than the current iPhone 16 Pro. The iPhone 16 Pro is 8.25mm thick, so an iPhone 17 that is 2mm thinner would come in at around 6.25mm. Apple analyst Ming-Chi Kuo believes that the iPhone 17 Air will be 5.5mm thick at its thinnest point, and his wording suggests that it would have a thicker rear camera bump area that exceeds the size of the 5.5mm chassis.\nAnalyst Jeff Pu has also suggested that the upcoming iPhone will be around 6mm thick, but The Information has said it will be between 5mm and 6mm thick. Dummy models are 5.5mm thick, so the iPhone 17 Air will be Apple's thinnest iPhone to date. The iPhone 6, which measured in at 6.9mm, is the thinnest iPhone Apple has released so far. iPhones actually got thicker with the iPhone X and beyond, as Apple needed more space for the battery, camera lenses, Face ID hardware, and more.\nAs for overall display size, the iPhone 17 Air is expected to fall somewhere between the iPhone 17 Pro and 17 Pro Max in size. Separate rumors have targeted 6.55 inches, 6.6 inches, and 6.65 inches as the diagonal display size that Apple has settled on, which would make it smaller than the iPhone 17 Pro Max, but larger than the 17 Pro.\nRumors suggest that the iPhone 17 Air will weigh in at 145 grams. That would make it similar in weight to the iPhone SE 2 or the iPhone 13 mini, which are 148 grams and 141 grams, respectively.\nThe Information claims the rear camera of the device will be relocated from the upper left side of the iPhone to the center of the device. The camera setup was described as a \"large, centered camera bump\" on the back of the device. Such a design has been seen in an alleged component leak and in dummy models, plus we've heard similar rumors about the iPhone 17 Pro.\nThe iPhone 17 Air will have some subtle design changes so that all of the internal components can fit despite the thinness of the chassis. Dummy models suggest that the USB-C port on the bottom edge won't be centered front to back, and will instead be shifted closer to the rear of the device. Colors could include black, silver, gold, and a very light blue.\nThe speaker grilles have also been simplified, with just two holes on either side of the port rather than the typical five. The device will include MagSafe charging, a Camera Control button, and an Action Button.\nA closer look at the thin design of the iPhone 17 Air can be seen in a video that shows off an iPhone 17 Air dummy model. Dummy models are often an accurate representation of what we can expect, as they are created for case makers based on leaked information from Apple's suppliers.\nFor more information on the upcoming iPhone 17 Air, we have a dedicated iPhone 17 Air roundup.\niPhone 17 Pro and iPhone 17 Pro Max\nThe iPhone 17 Pro and iPhone 17 Pro Max are going to have some significant design changes. Apple is allegedly planning to eliminate the titanium frame, instead going back to aluminum. Apple has not used aluminum for a higher-end iPhone since the stainless steel iPhone X was introduced in 2017.\nAlong with an aluminum frame, the iPhone 17 Pro models are rumored to include a half-aluminum half-glass backing rather than an all-glass back. The top half of the back could be made from aluminum, while the bottom half will continue to be made from glass to support wireless charging functionality. A partial aluminum back would potentially make the iPhone 17 Pro models more durable to drops.\nApple is planning for a larger \"rectangular\" horizontal camera bump that is made from aluminum rather than glass. Current camera bumps are square, so a rectangular camera bump would be a notable design change. Though the rear camera design is changing, the lenses themselves are expected to still be arranged in a triangle shape.\nLeaked iPhone 17 Pro cases provide a look at just how large the rear camera bump might be. There is an oversized rectangular cutout that spans the entire back of the case.\nApple may relocate the Apple logo on the back of the iPhone 17 Pro models, possibly because of the redesigned camera module. Rumors suggest that Apple will move the logo lower on the device, and it could be located inside a break in the MagSafe ring.\nTo accommodate the relocated logo, Apple may also tweak the MagSafe magnet layout compared to existing iPhone models. Leaked images of the alleged iPhone 17 Pro magnet array feature a design with an open bottom for the Apple logo.\nLeaked iPhone 17 Pro components suggest that the iPhone 17 Pro models could be available in a copper-like orange color, along with black, gray, silver, and dark blue. If the parts are accurate, these could be the colors that Apple will offer.\nAdditional rumors about the iPhone 17 Pro can be found in the iPhone 17 Pro roundup.\nOne leaker has suggested that one of the iPhone 17 Pro colors could somehow reflect the Liquid Glass design language in the iOS 26 update. Instant Digital said that there is a \"special\" color that is \"connected to the iOS 26 Liquid Glass design.\nThe leaker believes that the color that prior leaks refer to as white actually looks different depending on the light, perhaps with more of an iridescent look.\niPhone 17 Cases\nApple's iPhone 17 cases could include a cutout for attaching a lanyard, which would be a new feature.\nThermal Upgrades\nThe iPhone 17 Pro models will reportedly use vapor chamber cooling technology for improved thermal performance. Vapor chamber technology disperses heat across a larger surface area to prevent thermal throttling and to keep performance stable, and it could be a benefit for Apple's high-powered A19 chip.\nWhile this could be a feature limited to the iPhone 17 Pro, there has been a rumor suggesting that Apple will use a vapor chamber heatsink to improve thermal performance across all iPhone 17 models.\nDisplay\nThere are a few enhancements coming to the iPhone 17's display, with Apple adding a new coating and planning to bring Pro features to standard models.\nThe iPhone 17 and iPhone 17 Air are expected to use the same OLED panel as the current iPhone 16 Pro models, which is sourced from Samsung. The panel has a 30 percent increase in brightness and improved longevity compared to the prior-generation iPhone 16 display.\nThe iPhone 17 Pro models were going to be updated with a scratch resistant anti-reflective display coating, but it sounds like that might not happen this year after all. Apple ran into issues scaling up its display coating process, and it was too slow when taking into account millions of devices, so the coating plan was scrapped.\nProMotion and Always-On\nThe 120Hz \"ProMotion\" refresh rate has been limited to the Pro versions of the iPhone for several years, but in 2025, it is expected to expand to the entire iPhone lineup. Multiple rumors suggest that the iPhone 17 and iPhone 17 Air models will include ProMotion support in addition to the iPhone 17 Pro models. ProMotion refresh rates would potentially allow for always-on display functionality, but it is not clear if Apple plans to expand always-on to the entire lineup.\nApple will use low-temperature polycrystalline oxide (LTPO) panels for all iPhone 17 models, which is what enables ProMotion thanks to better power efficiency. ProMotion enables refresh rates ranging from 1Hz to 120Hz, and at the high end, the 120Hz refresh rate provides smoother scrolling and video content.\nWith all four iPhones slated to get ProMotion displays in 2025, ProMotion refresh rates will no longer be a feature that sets the Pro iPhone models apart.\nA-Series Chip\nThe iPhone 17 series won't get TSMC's next-generation 2-nanometer chips, but we are expecting A19 chip technology that's likely built on an upgraded 3-nanometer process. Apple typically upgrades iPhones with faster and more efficient chip technology each year.\nThe iPhone 17 Pro and iPhone 17 Pro Max are expected to include an A19 Pro chip, while the iPhone 17 and the iPhone 17 Air could have the standard A19 chip. There's also a chance that the iPhone 17 Air will have an A19 Pro with one fewer GPU core than the A19 Pro used for the iPhone 17 Pro models.\nThe A19 chips will be built on TSMC's 3NP process. Compared to earlier versions of 3nm chips, the N3P chips offer increased performance efficiency and increased transistor density.\nRAM\nThe iPhone 17 Pro, iPhone 17 Pro Max, and iPhone 17 Air are expected to include 12GB RAM, an improvement over the 8GB RAM in the current high-end iPhone 16 models. Rumors suggest the standard iPhone 17 will only have 8GB RAM.\nApple-Designed 5G Modem Chip\nThe iPhone 17 Air is expected to be one of the first iPhones to get an Apple-designed 5G modem, with Apple continuing to use Qualcomm modems for the other iPhone 17 models.\nApple's modem chip will be capable of theoretical 5G download speeds of up to 4Gb/s, which is slower than Qualcomm's modems in current phones. The chip will not support the fastest mmWave 5G, and will instead be limited to sub-6GHz 5G.\nSIM Tray\nApple will remove the physical SIM slot on iPhones in more countries next year, though it is not yet clear which countries. Apple did away with the SIM card tray in the United States with the iPhone 14 models, but a physical SIM has so far been present on iPhones sold outside of the United States.\nThe iPhone 17 Air is expected to lack a SIM tray entirely because of how thin it is.\nBluetooth and Wi-Fi Chip\nAll four iPhone 17 models that are coming in 2025 will have Apple's first custom-designed Wi-Fi chip with Wi-Fi 7 support. Wi-Fi 7 is already used in the iPhone 16 models, but Apple's chip design could bring additional efficiency and connectivity improvements, and it paves the way for a future all-in-one SoC.\nApple is aiming to create a wireless setup where the components are tightly integrated and more energy efficient, which will let the company cut down on the battery use of cellular, Wi-Fi, and Bluetooth technologies.\nWi-Fi 7 supports data transmission over 2.4GHz, 5GHz, and 6GHz band simultaneously for faster speeds and lower latency with a supported router. Wi-Fi 7 supports peak speeds of more than 40Gb/s. Bluetooth 5.3 is also expected.\nBattery and Charging\nThe upcoming iPhone 17 Pro and iPhone 17 Pro Max could have batteries that are easier to remove, adopting the same technology Apple introduced in the iPhone 16 and 16 Plus. The iPhone 16 and 16 Plus use a type of adhesive that can be loosened with a low-voltage electrical current, but the 16 Pro and Pro Max have standard adhesive.\nNext year, all iPhone 17 models might have the new, easier to remove adhesive, which makes battery replacements simpler.\nThe iPhone 17 models are expected to support up to 35W wired charging speeds, which means there would be no change from the current charging maximum.\nThe iPhone 17 models could support 25W wireless charging with third-party wireless chargers that support the next-generation Qi 2.2 wireless charging standard. Right now, iPhones are limited to 15W wireless charging with third-party chargers, but the new Qi standard supports up to 25W charging.\nCamera Updates\nAll iPhone models coming in 2025 are rumored to have an upgraded 24-megapixel front-facing camera, which is an improvement over the 12-megapixel front-facing camera in the iPhone 16 models. The camera will notably improve image quality, and allow for more cropping in without a loss of quality.\nThe iPhone 17 Pro Max is expected to feature a 48-megapixel Wide camera, a 48-megapixel Ultra Wide camera, and a 48-megapixel Tetraprism Telephoto camera, which will make it the first iPhone to feature three 48-megapixel cameras, and it is also expected to support 8K video recording for the first time.\nThe iPhone 17 Air will have a single-lens 48-megapixel rear camera, while the standard iPhone 17 will have a dual-lens camera system with a Wide camera and an Ultra Wide camera.\nThe iPhone 17 Pro models could feature a mechanical aperture that will let users adjust the size of the camera aperture, changing the amount of light reaching the lens. Current iPhone models have fixed apertures, but a variable aperture will let images be captured with shallow depth-of-field.\nThe iPhone 17 Pro models might also support dual video recording, a feature that would allow users to record video with the front and rear cameras simultaneously. Some apps already support this functionality, which is useful for content creators, but the built-in camera does not.\nThe iPhone 17 Pro and iPhone 17 Pro Max will continue to include a 5x Telephoto optical zoom lens, and it will still be a Pro-exclusive feature. The standard iPhone 17 and the iPhone 17 Air will not have the 5x zoom option and will have no Telephoto lenses.\nPricing\nThe iPhone 17 Air could be priced at $899, which is the current price for the iPhone 16 Plus. At $899, the iPhone 17 Air would be more expensive than the iPhone 17, but less expensive than the iPhone 17 Pro.\nThe iPhone 17 models may see a price hike, as Apple's component costs are increasing due to tariffs. Apple will pair the potential price increase with new features and design changes to justify the price to consumers, rather than blaming tariffs.\nThe iPhone 17 models could see a $50 price increase compared to the iPhone 16 models, according to Jeffries analyst Edison Lee. The price increase would mean the base iPhone 17 would start at $850.\niPhone 17 Launch Date\nThe iPhone event could take place on Tuesday, September 9, according to leaked information sourced from a German carrier. If that's the case, pre-orders could take place on September 12, and a launch could follow on September 19.\nAfter the iPhone 17\nStarting in 2026, Apple will split its iPhone lineup between fall and spring launches. The iPhone 18 Air, iPhone 18 Pro, iPhone 18 Pro Max, and a foldable iPhone will launch in the second half of 2026, while the standard iPhone 18 and the iPhone 18e won't launch until spring 2027.\nThe iPhone 18 Pro models that are coming in 2026 could have under-display Face ID, which would cut down on the size of the Dynamic Island. There might just be a single camera hole for the front-facing camera, with the camera cutout located in the top left corner. Later, in 2027, Apple could release an iPhone with an all-screen design, featuring an edge-to-edge display with no cutouts.\nApple's first foldable iPhone is expected in fall 2026, and it will launch alongside the iPhone 18 Air and iPhone 18 Pro models. It is expected to have a \"nearly invisible\" crease when it's folded, thanks to a high-quality hinge.\nThe iPhone 18 Pro expected in 2026 could have a main rear camera with a variable aperture. A variable aperture lens would allow the iPhone to perform more like a DSLR camera, providing users with more manual control over the amount of light entering the lens.\nA variable aperture lens would be able to better adjust to different lighting conditions, and it would also allow for more control over depth of field for sharper focus on subjects and smoother background blur.\nThe iPhone 18 Pro models may include the C2 chip, an upgraded version of Apple's C1 modem. The C2 is expected to feature improved power consumption and transmission speed, and it will include mmWave 5G support.\nApple's iPhone 18 models will use Apple's A20 chip, which could be manufactured on the next-generation 2-nanometer process. The 2nm process will ensure that the A19 has notable speed and performance improvements over the 3nm A19 chip that's coming in the iPhone 17 lineup.\nA future version of the iPhone could have a 200-megapixel camera, which would match technology that Samsung has made available in its Galaxy line. The 200-megapixel camera would likely be for the rear Main lens, and a higher megapixel option would allow the iPhone to shoot photos with more detail. Images would be higher resolution, and would able to be cropped in further without loss of image quality."
    },
    {
      "url": "https://www.macrumors.com/2025/04/04/2300-dollar-iphone/",
      "text": "U.S. President Donald Trump on Wednesday announced that steep tariffs will be applied to imports from many countries, starting April 9. The tariffs could have a significant impact on Apple, as the company assembles the majority of iPhones in China, and products imported to the U.S. from China will be subject to a 54% tariff.\niPhone prices could increase by up to 43% in the U.S. due to the tariffs, according to analysts at equity research firm Rosenblatt Securities (via Reuters).\nBased on that prediction, the top-of-the-line iPhone 16 Pro Max model with 1TB of storage could rise from $1,599 to nearly $2,300 in the U.S., should Apple actually follow through with raising prices by 43% to offset the cost of tariffs.\nAt the other end of the iPhone lineup, the most affordable iPhone 16e model would increase from $599 to just over $850 with a 43% price increase.\nAn iPhone 16 Pro with 256GB of storage could rise from $999 to more than $1,400.\nApple would need to raise its prices by at least 30% on average, in order to offset the tariffs, according to Counterpoint Research's Neil Shah.\nApple has yet to publicly comment on the tariffs, so it is unclear if the company will actually raise prices, or if it will get creative and find alternative ways to offset the impact. It is also unclear if iPhone 16 models would increase in price, or if Apple would simply set higher prices on iPhone 17 models from the get-go later this year.\nApple's stock price is down nearly 15% since Trump announced the planned tariffs.\nNote: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts."
    }
  ],
  "argos_summary": "Apple is facing potential price increases for its upcoming iPhone 17 models due to ongoing tariffs on imports from countries like China and India. Analysts predict a $50 hike across the lineup, with the iPhone 17 Pro starting at 256GB storage instead of 128GB. Despite some products being exempt from tariffs, Apple has incurred significant costs, leading to speculation that prices could rise by 30% to offset these expenses.",
  "argos_id": "EAV9A2DCX"
}