{
  "url": "https://www.usatoday.com/story/news/nation/2025/08/12/austin-texas-target-shooting-ethan-nieneker-investigation/85633049007/",
  "authorsByline": "Amanda Lee Myers",
  "articleId": "cefd8dde65714c66ab8d960a075205c0",
  "source": {
    "domain": "usatoday.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "VA",
      "county": "Fairfax County",
      "city": "McLean",
      "coordinates": {
        "lat": 38.9342888,
        "lon": -77.1776327
      }
    }
  },
  "imageUrl": "https://www.usatoday.com/gcdn/authoring/authoring-images/2025/08/12/USAT/85634670007-2229626124.jpg?crop=8666,4875,x0,y446&width=3200&height=1801&format=pjpg&auto=webp",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T23:47:13+00:00",
  "addDate": "2025-08-12T23:51:05.778242+00:00",
  "refreshDate": "2025-08-12T23:51:05.778244+00:00",
  "score": 1.0,
  "title": "'He said that he was Jesus': Police release details on deadly Texas Target shooting",
  "description": "The three people killed outside a Target in Austin, Texas, on Aug. 11 were identified, including a 4-year-old and a store employee.",
  "content": "The man suspected of fatally shooting three people, including a child, in a Target parking lot in Austin, Texas, told police that he was Jesus and obtained a firearm through a family member despite a history of mental health issues, authorities said.\n\nPolice identified the shooter as Ethan Nieneker, 32, and said that he began his attack by fatally shooting Target employee Hector Leopoldo Martinez Machuca as he collected shopping carts on Aug. 11. Nieneker then ran up to a gray Toyota 4-Runner, and fatally shot Adam Chow and his 4-year-old granddaughter before pushing Chow's wife from the vehicle, police said in a news release. Chow's wife survived with minor injuries.\n\n\"What happened yesterday was an unprovoked and deliberate attack, a deliberate act of violence,\" Austin Police Chief Lisa Davis said on Aug. 12. \"Innocent lives were taken in broad daylight, in a place where people should feel safe to run their everyday errands and to live their everyday lives.\"\n\nUSA TODAY is working to reach an attorney or family member who can speak on Nieneker's behalf.\n\nFollowing the killings at 2:15 p.m. CT, police say that Nieneker stole Chow's car and made a chaotic getaway, assaulting multiple people and stealing cars along the way. Here's a timeline released by authorities:\n• 2:20 p.m.: Driving the 4-Runner, police said Nieneker came across a parked water truck, opened the driver's door, assaulted the driver, and threw him out of the vehicle before trying to drive it. Unable to figure out how to operate the truck, authorities said he then chased a man, pistol in hand, before returning to the 4-Runner and driving off.\n• 2:25 p.m.: Police said Nieneker crashed the 4-Runner into a Volkswagen and landed on top of an SUV. He then jumped out of the 4-Runner, assaulted the Volkswagen's driver, pushed her out of the car, and drove off.\n• 2:34 p.m.: According to police, Nieneker ran up to a Waymo vehicle and unsuccessfully tried to break in before he got back in the Volkswagen and drove away.\n• 2:37 p.m.: Police said Nieneker threw a brick through a window of the home of someone he knew through Bible study.\n• 2:58 p.m.: Austin police received a call from a South Austin resident who reported seeing a man run into a porta potty and then leave naked.\n• 3:06 p.m.: Police found Nieneker, naked and holding a Bible. They said he failed to comply with their commands, so they used a Taser stun gun on him and arrested him. They found clothing inside the porta potty matching the Target shooting suspect's attire, including a Hawaiian shirt.\n\nCharges, motive, and what we know about Ethan Nieneker\n\nDavis said Nieneker worked at a local restaurant and lived alone. He's been charged with two counts of capital murder and first-degree felony murder. Police said he will face more charges related to the subsequent assaults and carjackings.\n\nAs for a motive, police Sgt. Nathan Sexton said there was \"really no reason whatsoever given.\"\n\n\"He said that he was Jesus,\" Sexton said. \"It was a completely random choosing of the victims.\"\n\nSexton said the handgun used in the attack was \"acquired through family\" and that the department was investigating possible charges against the family member.\n\nDavis said Nieneker's history with Austin police included assault causing bodily injury to a family member, driving under the influence, violation of a protective order, marijuana possession, and two mental health reports.\n\n\"This man had some serious issues, and I think about the systems that failed in a way, as we move forward,\" she said. \"We're looking at this background, and again, this is going to be things that are going to be coming up in the months and the years ahead. There were some serious failures here.\"\n\n'Pain caused will be felt by our community for years to come'\n\nDavis declined to detail who failed Nieneker or exactly how, and said she did not know if he had been officially diagnosed.\n\n\"What help are they getting when you're dealing with someone with these issues?\" Davis asked. \"Where does someone with this capacity to do this get a weapon? And when does a family member feel comfortable giving someone with these issues a weapon?\"\n\nShe called the case \"a heartbreaking and deeply painful time for our city.\"\n\n\"The actions of the suspect showed a complete disregard for human life,\" she added. \"The pain caused will be felt by our community for years to come.\"\n\nAmanda Lee Myers is a senior crime reporter for USA TODAY. Reach her at amanda.myers@usatoday.com and follow her on X at @AmandaLeeUSAT",
  "medium": "Article",
  "links": [
    "https://www.usatoday.com/story/news/crime/2025/08/12/suspect-shooting-target-austin-texas/85622362007/",
    "https://www.usatoday.com/story/news/nation/2025/08/11/austin-texas-target-shooting-victims-authorities-investigation/85617969007/",
    "https://www.usatoday.com/picture-gallery/news/nation/2025/08/11/target-parking-lot-shooting-in-austin-leaves-at-least-3-dead/85618698007/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Ethan Nieneker",
      "weight": 0.080729164
    },
    {
      "name": "Nieneker",
      "weight": 0.077830926
    },
    {
      "name": "Austin police",
      "weight": 0.07692271
    },
    {
      "name": "family member",
      "weight": 0.07364034
    },
    {
      "name": "Austin Police Chief Lisa Davis",
      "weight": 0.06406615
    },
    {
      "name": "police Sgt. Nathan Sexton",
      "weight": 0.06369773
    },
    {
      "name": "police",
      "weight": 0.06296983
    },
    {
      "name": "mental health issues",
      "weight": 0.059772298
    },
    {
      "name": "deadly Texas Target shooting",
      "weight": 0.05944782
    },
    {
      "name": "Target employee Hector Leopoldo Martinez Machuca",
      "weight": 0.057833966
    }
  ],
  "topics": [
    {
      "name": "Law Enforcement"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.9853515625
    },
    {
      "name": "/News/Local News",
      "score": 0.96875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.9560546875
    },
    {
      "name": "/Law & Government/Public Safety/Law Enforcement",
      "score": 0.88427734375
    },
    {
      "name": "/Law & Government/Public Safety/Crime & Justice",
      "score": 0.70361328125
    },
    {
      "name": "/News/Other",
      "score": 0.638671875
    },
    {
      "name": "/People & Society/Religion & Belief",
      "score": 0.435302734375
    }
  ],
  "sentiment": {
    "positive": 0.06233787,
    "negative": 0.65498996,
    "neutral": 0.2826722
  },
  "summary": "Ethan Nieneker, suspected of murdering three people, including a child, in a Target parking lot in Austin, Texas, told police he was Jesus and obtained a firearm through a family member, despite a history of mental health issues. The suspect, identified as 32-year-old Nienker, began his attack by fatally shooting Target employee Hector Leopoldo Martinez Machuca as he collected shopping carts. He then ran up to a Toyota 4-Runner and fatally shot Adam Chow and his 4-granddaughter, before pushing Chow's wife from the vehicle. Following the killings, Nienek stole Chow's car and made a chaotic getaway, assaulting multiple people and stealing cars. He has been charged with capital murder and first-degree felony murder and is expected to face more charges related to subsequent assaults and carjackings.",
  "shortSummary": "Ethan Nieneker, 32, killed three people in a Texas Target parking lot, allegedly claiming to be Jesus, before carrying out multiple attacks.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "4e780339087d45bc86246b1f2f97dd0a",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.usatoday.com/story/news/crime/2025/08/12/suspect-shooting-target-austin-texas/85622362007/",
      "text": "Police identify suspect after 3 people killed in shooting in Target parking lot in Texas\nPolice in Austin, Texas, have identified the 32-year-old man taken into custody in connection with the deadly shooting outside of a Target store on Monday, Aug. 11.\nThe Austin Police Department announced on Aug. 12 that Ethan Nieneker was arrested following the shooting in the retailer's parking lot.\nIn a statement to media outlets including KVUE and CBS News Texas, Target said it is working with authorities on the ongoing investigation.\n\"Our hearts are with the families and loved ones of those who lost their lives, our team in Austin and all those impacted by this tragedy,\" the statement said. \"In the days ahead, we will continue partnering with law enforcement and will be providing support resources, including grief counseling, to our team.”\nHere's what we know so far.\nWhat we know about the suspect\nOfficers responded to the Target at 2:15 p.m. on Aug. 11. By then, the suspected shooter, later identified as Nieneker, had fled in a stolen car, crashed it soon after and stole another vehicle, Chief Lisa Davis said at a news conference.\nPolice then tracked the suspect down, used a Taser stun gun on him and arrested him, Davis said. The suspect is believed to have a history of mental health challenges, authorities noted.\nAccording to CNN and KEYE, citing jail records, Nieneker was charged with first-degree murder, capital murder by terror threat and capital murder of a person under 10.\nLocal officials plan to hold a press conference at 2 p.m. on Aug. 12.\nWhat we know so far about the victims\nTwo of the victims were declared dead on the scene, while the third died at a local hospital, Austin-Travis County EMS Chief Robert Luckritz said at the news conference.\nThe victims were not publicly named, but according to CNN and local news outlet KXAN, officials identified them as two adults and one child.\n'Cowardly act'\nIn a social media post on Aug.11, Austin Mayor Kirk Watson called the shooting a \"cowardly act of gun violence.\"\n\"This is a devastating situation, and my heart is with the victims and their families,\" Watson said. \"While this remains an active and ongoing investigation, what I’ll say is that this was a sickening, cowardly act of gun violence.\"\n\"I am grateful for the quick response of our APD officers and other first responders and want to thank them for their actions to apprehend the suspect.\"\nTaylor Ardrey is a news reporter for USA TODAY. You can reach her at tardrey@gannett.com."
    },
    {
      "url": "https://www.usatoday.com/story/news/nation/2025/08/11/austin-texas-target-shooting-victims-authorities-investigation/85617969007/",
      "text": "3 people fatally shot at Target parking lot in Austin, Texas; suspect arrested\nA 32-year-old man with a history of mental health problems opened fire outside a Target store on Aug. 11 in Austin, Texas, killing three people, authorities said.\nAustin Police Department responded to the scene within four minutes of the shooting at 2:15 p.m. CT, Chief Lisa Davis said during a news briefing. By then, the shooter had fled in a stolen car, crashed it soon after, and then stole another vehicle, Davis said.\nPolice then tracked the suspect down, used a Taser stun gun on him, and arrested him, Davis said.\nDavis did not release his name and said a motive wasn't immediately known. She said he does have a \"rap sheet\" with the department, but did not elaborate.\nTwo of the victims were declared dead in the parking lot, while the third person died at a local hospital, Austin-Travis County EMS Chief Robert Luckritz said at the news conference.\nInformation about the victims was not immediately known.\n\"This is a very sad day for Austin. It's a very sad day for us all,\" Davis said. \"Our thoughts are with the families. This is a tragic time.\"\nIn a social media post, Austin Mayor Kirk Watson called the shooting a \"cowardly act of gun violence.\"\n\"This is a devastating situation, and my heart is with the victims and their families,\" Watson said. \"While this remains an active and ongoing investigation, what I’ll say is that this was a sickening, cowardly act of gun violence. I am grateful for the quick response of our APD officers and other first responders and want to thank them for their actions to apprehend the suspect.\"\nFernando Cervantes Jr. is a trending news reporter for USA TODAY. Reach him at fernando.cervantes@gannett.com and follow him on X @fern_cerv_. Amanda Lee Myers is a senior crime reporter for USA TODAY. Reach her at amanda.myers@usatoday.com and follow her on X at @AmandaLeeUSAT"
    }
  ],
  "argos_summary": "Ethan Nieneker, a 32-year-old man with a history of mental health issues, is accused of fatally shooting three people, including a child, in a Target parking lot in Austin, Texas, on August 11. After the shooting, he fled in a stolen vehicle, assaulted multiple individuals, and was eventually apprehended by police while naked and holding a Bible. Authorities are investigating how he obtained the firearm and the circumstances surrounding his mental health history, as the attack appeared to be random and unprovoked.",
  "argos_id": "ENSOFT22F"
}