{
  "url": "https://www.benzinga.com/trading-ideas/movers/25/08/47072066/why-american-airlines-aal-stock-is-seeing-blue-skies-tuesday",
  "authorsByline": "Henry Khederian",
  "articleId": "90fce6d1482149d398c8c10c81602dfe",
  "source": {
    "domain": "benzinga.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "MI",
      "county": "Wayne County",
      "city": "Detroit",
      "coordinates": {
        "lat": 42.3315509,
        "lon": -83.0466403
      }
    }
  },
  "imageUrl": "https://cdn.benzinga.com/files/images/story/2025/08/12/Phoenix--Az---December-7--2019-Photo-Of-.jpeg?width=1200&height=800&fit=crop",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T15:20:01-04:00",
  "addDate": "2025-08-12T19:26:25.175330+00:00",
  "refreshDate": "2025-08-12T19:26:25.175333+00:00",
  "score": 1.0,
  "title": "Why American Airlines (AAL) Stock Is Seeing Blue Skies Tuesday - U.S. Global Jets ETF (ARCA:JETS), American Airlines Group (NASDAQ:AAL)",
  "description": "American Airlines shares are soaring Tuesday afternoon. The surge followed the release of July's inflation data, which brought welcome news for the airline sector.",
  "content": "American Airlines Group Inc AAL shares are soaring Tuesday afternoon, part of a broader rally among airline carriers.\n\nWhat To Know: The surge followed the release of July’s inflation data, which brought welcome news for the sector. Investors were buoyed by a significant drop in gasoline prices, a major operating expense for airlines, which fell 1.5% during the month.\n\nSimultaneously, airline ticket prices jumped by a healthy 4.1%, signaling robust demand and increased revenue potential for carriers like American. This combination of lower costs and higher fares creates a favorable environment for improved profit margins.\n\nThe positive economic data provided a significant lift for American Airlines, whose stock has recently been trading near its 52-week low. The company last month reported better-than-expected second-quarter earnings of 95 cents per share, beating analyst consensus, but had projected a weaker third-quarter.\n\nThe rally was felt across the industry, with the US Global Jets ETF JETS, a key barometer for the airline sector, climbing over 6%.\n\nThe favorable inflation numbers, coupled with a strong overall market that saw the S&P 500 and Nasdaq-100 reach new highs, has put major airline stocks, and American Airlines in particular, on a strong upward trajectory for the day.\n\nBenzinga Edge Rankings: According to Benzinga Edge proprietary stock rankings, American Airlines shows a mixed but generally weak fundamental profile. The stock’s Momentum score is a low 29.48, reflecting its poor price performance leading up to today’s rally.\n\nIts scores for Growth at 48.75 and Value at 44.89 are both in the middle of the range, suggesting that on these metrics, the company is neither outperforming nor significantly underperforming its peers.\n\nOverall, this data paints a picture of a stock that has been struggling with price momentum and shows average fundamentals, providing a broader context for its sharp single-day rally.\n\nPrice Action: According to data from Benzinga Pro, AAL shares are trading higher by 11.01% to $12.86 Tuesday afternoon. The stock has a 52-week high of $19.10 and a 52-week low of $8.50.\n\nBy now you're likely curious about how to participate in the market for American Airlines Group – be it to purchase shares, or even attempt to bet against the company.\n\nBuying shares is typically done through a brokerage account. You can find a list of possible trading platforms here. Many will allow you to buy “fractional shares,” which allows you to own portions of stock without buying an entire share.\n\nIf you're looking to bet against a company, the process is more complex. You'll need access to an options trading platform, or a broker who will allow you to “go short” a share of stock by lending you the shares to sell. The process of shorting a stock can be found at this resource. Otherwise, if your broker allows you to trade options, you can either buy a put option, or sell a call option at a strike price above where shares are currently trading – either way it allows you to profit off of the share price decline.",
  "medium": "Article",
  "links": [
    "http://benzinga.grsm.io/register174",
    "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/07/46657092/can-american-airlines-navigate-financial-turbulence-ahead",
    "https://www.benzinga.com/markets/equities/25/08/47065403/july-inflation-report-airline-fares-stocks-transportation-dow-jones",
    "https://www.benzinga.com/markets/economic-data/25/08/47057291/us-inflation-july-tariffs",
    "https://www.benzinga.com/money/how-to-short-a-stock",
    "https://www.benzinga.com/money/best-stock-trading-platforms",
    "https://benzinga.grsm.io/register174",
    "https://www.benzinga.com/markets/market-summary/25/08/47068641/nasdaq-100-sp-500-hit-new-all-time-highs-airlines-jump-whats-moving-markets-tuesday"
  ],
  "labels": [
    {
      "name": "Opinion"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "American Airlines Group Inc AAL shares",
      "weight": 0.105595864
    },
    {
      "name": "major airline stocks",
      "weight": 0.09546121
    },
    {
      "name": "American Airlines Group",
      "weight": 0.09495653
    },
    {
      "name": "American Airlines",
      "weight": 0.09356148
    },
    {
      "name": "AAL shares",
      "weight": 0.093464285
    },
    {
      "name": "American Airlines Group Inc",
      "weight": 0.09099647
    },
    {
      "name": "airline ticket prices",
      "weight": 0.085939124
    },
    {
      "name": "share",
      "weight": 0.0844248
    },
    {
      "name": "shares",
      "weight": 0.0844248
    },
    {
      "name": "stock",
      "weight": 0.08159646
    }
  ],
  "topics": [
    {
      "name": "Stocks"
    },
    {
      "name": "Markets"
    },
    {
      "name": "Aviation"
    },
    {
      "name": "Airlines"
    }
  ],
  "categories": [
    {
      "name": "Travel"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.9853515625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.94189453125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.91357421875
    },
    {
      "name": "/Travel & Transportation/Transportation/Air Travel",
      "score": 0.77685546875
    },
    {
      "name": "/Business & Industrial/Aerospace & Defense/Aviation Industry",
      "score": 0.4169921875
    }
  ],
  "sentiment": {
    "positive": 0.6931097,
    "negative": 0.088420704,
    "neutral": 0.21846968
  },
  "summary": "American Airlines Group (AAL) shares are soaring, part of a broader rally among airline carriers following the release of July's inflation data. The drop in gasoline prices and increase in airline ticket prices led to a 4.1% increase in profit margins for American Airlines. The company reported better-than-expected second-quarter earnings of 95 cents per share, beating analyst consensus, but had projected a weaker third-quarter. The rally was felt across the industry, with the US Global Jets ETF JETS, a key barometer for the airline sector, climbing over 6%. The strong overall market also contributed to the rise in American Airlines' shares. However, Benzinga Edge's proprietary stock rankings suggest that American Airlines shows a mixed but generally weak fundamental profile.",
  "shortSummary": "American Airlines Group shares surged 11.01% following positive inflation data, boosting investor confidence in airline stocks amid strong demand and profitability prospects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8e0c1b28cc364d67bd7028d5925f077b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.benzinga.com/money/best-stock-trading-platforms",
      "text": "Online stock trading platforms have revolutionized how investors access and participate in the markets. With just a few clicks, you can execute trades, monitor portfolios and conduct in-depth research from anywhere.\nBut with so many options, how do you choose the right platform for your financial goals? This guide will explore the best online stock trading platforms available, highlighting their features, fees and who they’re best suited for to help you get started on your investing journey.\nBest Online Stock Trading Platforms\n- Charles Schwab — Best for All-Around Value\n- Fidelity — Best for Research\n- E*Trade — Best User-Friendly Platform\n- Interactive Brokers — Best for Global Trading\n- Webull — Best for Advanced Charting\nHow We Chose the Best Online Stock Trading Platforms\nTo choose the best online stock trading platforms, we evaluated their fees, investment product variety, platform usability and quality of research and educational tools.\nBest Online Stock Trading Platforms\nCharles Schwab — Best for All-Around Value\n- Best For:Fund InvestingVIEW PROS & CONS:securely through Charles Schwab's website\nCharles Schwab offers a well-rounded experience for all types of investors. Its acquisition and integration of TD Ameritrade’s thinkorswim platform have cemented its position as a top choice for active traders, while its commitment to commission-free trading, extensive research and broad range of investment products make it equally appealing to long-term investors and beginners. Schwab provides robust tools, comprehensive education and strong customer support.\nKey Features:\n- Fees: Charles Schwab offers commission-free trading of U.S.-listed stocks, exchange-traded funds (ETFs) and options. Options incur a $0.65 per-contract fee. There are generally no account minimums for opening a standard brokerage account. While most online trades are free, some exceptions apply, such as over-the-counter (OTC) equities and certain transaction-fee mutual funds.\n- Investment Access: Schwab provides access to a variety of investment products, including stocks, ETFs, no-transaction fee mutual funds, bonds, certificates of deposit (CDs), options, futures and forex. It also offers robo advisory services and full-service financial advising.\n- Platform Experience: Schwab’s multiple platforms include the main Schwab.com website, which is user-friendly and great for general investing and research; thinkorswim, available as a desktop platform, web platform or mobile app for active traders; and the Schwab Mobile app for on-the-go trading and account management.\n- Tools/Education Highlights: Schwab’s research and educational resources include third-party analysis, stock and ETF screeners, market commentary, and news feeds. Its educational content covers everything from investing basics to advanced trading strategies, delivered through articles, videos, podcasts, live coaching and webcasts. The paperMoney virtual trading environment in thinkorswim allows users to practice strategies risk-free.\n- Drawbacks: Thinkorswim can be overwhelming for beginners. Schwab does not offer direct cryptocurrency trading, though it provides indirect access through crypto-related ETFs and mutual funds. Basic trades are free, but some fees apply to less common transactions or broker-assisted trades.\nWho It’s Best For: Beginners looking for low-cost investing and educational support and active traders who want sophisticated tools and extensive market access through the thinkorswim platform.\nFidelity — Best for Long-Term Growth\n- Best For:Stock ResearchVIEW PROS & CONS:securely through Fidelity Investments's website\nFidelity’s robust and user-friendly investment app makes it an excellent choice for investors focused on long-term wealth accumulation. It combines commission-free trading with a wealth of educational resources, top-tier research and exceptional customer service, providing a secure and supportive environment for investors who want to build a diversified portfolio and achieve their long-range financial goals.\nKey Features:\n- Fees: Fidelity offers commission-free trading for online U.S. stocks, ETFs and options. Options incur a $0.65 per contract fee. There are no account minimums to open an account, and Fidelity’s own index funds often have a zero expense ratio. Most non-trading fees, like account maintenance or electronic transfers, are also free.\n- Investment Access: Investors can choose from a variety of investments, including U.S. and international stocks, more than 3,700 no-transaction fee mutual funds, a wide selection of ETFs, options, bonds and CDs. Fidelity also offers fractional shares on most U.S. stocks and ETFs, enabling beginners to invest with as little as $1 and build diversified portfolios.\n- Platform Experience: The intuitive interface balances simplicity with powerful functionality. Beginners can easily navigate to buy and sell securities, track portfolio performance, and access research. The app supports mobile check deposit, bill pay and customizable watchlists. The Active Trader Pro is a desktop platform with advanced charting, real-time data and customizable layouts. The Fidelity mobile app is easy to use for managing portfolios, research and trading on the go. The Trading Dashboard offers a consolidated view of market data, research and trading directly on the web.\n- Tools/Education Highlights: Fidelity provides free, independent research from more than 20 third-party providers; advanced screeners for stocks, ETFs and mutual funds; and powerful charting tools with various indicators. The platform has news feeds, market commentary and alerts. Educational content covers everything from investment basics to advanced trading strategies through articles, videos and interactive coaching sessions.\n- Drawbacks: The breadth of Fidelity’s offerings and research may be overwhelming for someone seeking the absolute simplest interface. The platform may not cater to extremely niche or highly specialized trading needs.\nWho It’s Best For: Beginners and serious long-term investors who want a reputable, full-service broker with a user-friendly mobile app, educational resources, commission-free trading and excellent customer support.\nE*Trade — Best User-Friendly Platform\nE*Trade offers a combination of easy-to-use platforms and tools catering to both new investors and active traders. Its emphasis on commission-free trading for stocks and ETFs, coupled with competitive pricing for options and futures, makes it a good choice for traders at all levels. Its well-designed mobile apps and Power E*Trade platform provide advanced features for investors who want more control over their trades.\nKey Features:\n- Fees: E*Trade offers commission-free trading on stocks, options, mutual funds and ETFs. Options contacts incur a $0.65 per trade fee.\n- Investment Access: E*Trade provides a range of investment choices, including stocks, ETFs, no-transaction-fee mutual funds, bonds, CDs and options. It also offers access to futures, and various retirement and managed portfolio solutions. Direct cryptocurrency trading is not available, but crypto-related ETFs and futures can be traded.\n- Platform Experience: E*Trade offers two web platforms and corresponding mobile apps: the standard E*Trade Web and the more advanced Power E*Trade. E*Trade Web is easy to navigate and ideal for beginners or people with simpler investing needs. Power E*Trade is designed for active traders and features advanced charting, analytical tools, customizable dashboards and complex order types.\n- Tools/Education Highlights: E*Trade’s research and educational content include proprietary insights from Morgan Stanley, third-party research from providers like Thomson Reuters and Morningstar, advanced screeners for various asset classes, and real-time market data. Its library covers topics for all skill levels, from investing fundamentals to options strategies, delivered through articles, videos and webinars.\n- Drawbacks: E*Trade does not offer direct access to international stock exchanges. Fractional share trading is primarily for dividend reinvestment or through its robo-adviser, not for direct purchases of all stocks. Interest rates on uninvested cash in default sweep programs are lower than dedicated high-yield savings accounts.\nWho It’s Best For: New investors who want an easy-to-use platform with comprehensive investment options and active traders who are focused on options and futures.\nInteractive Brokers — Best for Global Trading\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\nInteractive Brokers (IBKR) is renowned for its advanced trading tools, low costs and access to global markets. Its desktop platform, Trader Workstation, is powerful, but its mobile app brings much of that sophistication to your fingertips. It’s a good choice for active traders who want advanced order types, extensive research and the ability to trade a variety of assets across numerous international exchanges.\nKey Features:\n- Fees: IBKR’s competitive pricing includes the Lite plan with zero commission on U.S. exchange-listed stocks and ETFs. For more active traders on the Pro tier, trades range from $0.0005 to $0.0035. Per share. There are no account minimums.\n- Investment Access: Provides access to more than 160 markets in 33 countries, allowing trading in stocks, options, futures, currencies, bonds and funds. It also offers fractional share trading.\n- Platform Experience: IBKR offers different platforms to suit different experience levels. The feature-rich desktop Trader Workstation platform is suitable for advanced and active traders. IBKR Desktop combines popular TWS tools with even more features. For traders on the go, there’s IBKR Mobile and IBKR GlobalTrader. The Client Portal is an easy-to-use web platform for account management and basic trading.\n- Tools and Education: Offers tools like IBKR GlobalAnalyst for international portfolio diversification, a Bond Marketplace and a Mutual Fund Marketplace. It provides educational resources and webinars..\n- Drawbacks: The breadth of features and platforms can be overwhelming for beginners.\nWho It’s Best For: Experienced and active traders who want extensive market access, advanced tools and competitive pricing for international investments.\nWebull — Best for Advanced Charting\nWebull's commission-free trading platform targets tech-savvy and active retail traders, offering a sleek mobile-first experience combined with robust charting and analytical tools. This design appeals to users who appreciate a modern interface and seek in-depth market data and customizable analysis features.\nKey Features:\n- Fees: Webull offers commission-free trading for online U.S. stocks, ETFs and options, which incur a regulatory fee but no per-contract commission. There are no account minimums and no inactivity or maintenance fees.\n- Investment Access: Webull focuses on U.S. exchange-listed stocks, ETFs and options. It also offers cryptocurrency and futures trading. Fractional shares are available for a range of U.S. stocks and ETFs.\n- Platform Experience: Webull’s mobile app is a major draw for younger investors and people who want to manage their investments on the go. The desktop and web platforms mirror much of the app’s functionality, providing advanced charting capabilities, technical indicators and customizable layouts. The interface is designed for easy use.\n- Tools/Education Highlights: Webull provides real-time market data, charting tools with many technical indicators and screeners to identify trading opportunities. It offers access to news feeds, analyst ratings and community features where traders can share ideas.\n- Drawbacks: The research offerings may not be as in-depth as those found on platforms like Fidelity or Schwab, which integrate third-party professional research.\nWho It’s Best For: Active retail traders who prefer a mobile-first experience, value commission-free trading and want advanced charting and analytical tools without the complexity of traditional professional platforms.\nChoosing the Best Online Stock Trading Platform\nThe best platform for you will align with your investing goals and trading style, whether you’re a beginner seeking education or an active trader needing advanced tools and global reach.\nFor all around-value, Charles Schwab is a great choice, while Fidelity stands out for in-depth research. E*Trade offers user-friendly access, and Interactive Brokers is a standout for global trading. Webull excels for investors who want advanced charting tools.\nFrequently Asked Questions\nWhat is the cheapest online trading platform for stocks?\nMany platforms now offer commission-free trading on U.S. stocks and ETFs, but Webull, Fidelity and Charles Schwab are standouts for low costs. They provide free trades with no account minimums, making them ideal for budget-conscious investors.\nWhat platform is best for beginner investors?\nFidelity and Charles Schwab are excellent choices for beginners. They offer intuitive interfaces, extensive educational resources and access to commission-free trades. These features help new investors learn the ropes while keeping costs low.\nWhich trading platform is best for active traders?\nInteractive Brokers and Charles Schwab’s thinkorswim platform are top options for active traders. They provide advanced charting, customizable order types and tools to execute complex strategies, along with competitive pricing for high-volume trading."
    },
    {
      "url": "https://www.benzinga.com/markets/equities/25/08/47065403/july-inflation-report-airline-fares-stocks-transportation-dow-jones",
      "text": "- JETS ETF jumped 5.7%, its third-biggest daily gain since 2022, as major airline stocks surged between 7% and 8%.\n- Transportation and medical care services climbed 0.8% monthly; gasoline prices dropped 9.5% from last year.\n- This simple system has nailed 1,000+ post-earnings winners. Get in before Q3 trades take off →\nAirline stocks rallied Tuesday after July's inflation report showed ticket prices jumping while gasoline costs — a key industry expense — dropped sharply. This gave carriers a rare double boost.\n- JETS ETF is moving fast. Check the chart here.\nAirline fares jumped 4% from June, while gasoline prices dropped 1.9% over the month and are now 9% lower than a year ago.\nThe dual move means carriers can charge more while paying less for one of their biggest operating costs, a setup that sent airline shares sharply higher.\nBy late morning in New York, Alaska Air Group Inc. ALK, American Airlines Group Inc. AAL, Delta Air Lines Inc. DAL and United Airlines Holdings Inc. UAL were each up between 7% and 8%.\nThe U.S. Global JETS ETF JETS — a key benchmark for the industry — soared 5.7%, the largest gain in over a month and the third biggest since October 2022.\nThe Dow Jones Transportation Index jumped 2.8%, outpacing the broader market's gains and eyeing its best performance since May.\nWhat's Getting Cheaper, What's Getting More Expensive\nThe CPI report showed mixed news for U.S. consumers. While gasoline provided relief at the pump, several everyday expenses moved higher.\nA notable price jump was recorded in transportation services, which climbed 0.8% for the month and remain 3.5% higher than a year ago.\nMedical care services also accelerated, rising 0.8% in July and 4.3% year-over-year, with dental services and hospital care driving much of the increase.\nUsed car prices rose 0.5% in the month and 4.8% from last year. Transportation services increased 0.8% month-over-month and are up 3.5% compared to the same period last year.\nGasoline prices fell by 1.9%, or 9% on an annual basis, helping to contain headline inflation. Meanwhile, energy services posted a 0.3% monthly decline, though their annual gain remains steep at 7.2%, led by utility gas service's 13.8% jump from July 2024.\nGrocery prices, classified as \"food at home,” were flat in July but still 2.9% higher than last year, while dining out — \"food away from home\" — rose 0.3% in the month and is up 3.9% over the past year.\nShelter costs — the largest component of CPI — were up 0.2% for the month and 3.7% over the year.\n| Category | MoM Change (Jul 2025) | YoY Change (Jul 2025) |\n|---|---|---|\n| All Items | +0.2% | +2.7% |\n| Food | 0.0% | +2.9% |\n| Food at Home | -0.1% | +2.2% |\n| Food Away from Home | +0.3% | +3.9% |\n| Energy | -1.1% | -2.2% |\n| Energy Commodities | -1.6% | -9.0% |\n| Gasoline (All Types) | -1.9% | -9.5% |\n| Fuel Oil | +1.8% | -2.9% |\n| Energy Services | -0.3% | +7.2% |\n| Electricity | -0.1% | +5.5% |\n| Utility (Piped) Gas Service | -0.9% | +13.8% |\n| All Items Less Food & Energy | +0.3% | +3.1% |\n| Commodities Less Food & Energy | +0.2% | +1.2% |\n| New Vehicles | 0.0% | +0.4% |\n| Used Cars & Trucks | +0.5% | +4.8% |\n| Apparel | +0.1% | -0.2% |\n| Medical Care Commodities | +0.1% | +0.1% |\n| Services Less Energy Services | +0.4% | +3.6% |\n| Shelter | +0.2% | +3.7% |\n| Transportation Services | +0.8% | +3.5% |\n| Medical Care Services | +0.8% | +4.3% |\nMarket Reactions: Investors Flock Into Transportation Stocks, Healthcare Giants\nThe travel-related rally spilled over into cruise lines, with Carnival Corp. CCL up 2.7%, Royal Caribbean Group RCL gaining 2.2% and Norwegian Cruise Line Holdings Ltd. NCLH rising 1.6%.\nShipping and logistics stocks climbed too, with Old Dominion Freight Line Inc. ODFL up 3.8% and FedEx Corp. FDX adding 3.3%. Uber Technologies Inc. UBER rose 1.7%.\nHealthcare stocks benefited from the uptick in medical costs, with UnitedHealth Group Inc. UNH up 3.7%.\nNow Read\nImage: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/analyst-stock-ratings/reiteration/25/07/46657092/can-american-airlines-navigate-financial-turbulence-ahead",
      "text": "- American Airlines reports Q2 EPS of 95 cents, topping consensus of 78 cents.\n- The company projected a loss of 10-60 cents per share for Q3.\n- This simple system has nailed 1,000+ post-earnings winners. Get in before Q3 trades take off →\nAs the airline industry navigates turbulent skies marked by fluctuating demand and operational challenges, major carriers are striving to stabilize their financial footing. This backdrop set the stage for American Airlines Group Inc.’s AAL earnings report on July 24, which highlighted both achievements and ongoing hurdles.\nAmerican Airlines reported an earnings beat on the back of better-than-expected revenues and non-fuel costs, according to Goldman Sachs.\n- AAL is showing weakness near its 52-week low. See the chart here.\nThe American Airlines Inc Analyst: Analyst Catherine O’Brien maintained a Sell rating and price target of $8.\nThe American Airlines Thesis: The company reported adjusted earnings of 95 cents per share, beating the consensus of 78 cents per share, O'Brien said in the note.\nCheck out other analyst stock ratings.\nAmerican Airlines projected a loss of 10 cents to 60 cents per share for the September quarter, with the midpoint coming in worse than the consensus of a profit of 3 cents per share, she added.\n\"Management notes that if domestic trends continue to improve they expect to come in at the high end of Sep Q EPS guidance, with the bottom end only likely if the macro backdrop weakens from current trends,\" the analyst wrote.\nAmerican Airlines reinstated its full-year guidance following its suspension in April, projecting a loss of 20 cents per share to earnings of 80 cents per share, with the midpoint falling short of the consensus of 72 cents per share, she further stated.\nAAL Price Action: American Airlines Group shares were up 0.43% at $11.54 during premarket trading on Monday, according to Benzinga Pro.\nRead Next:\nPhoto: Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/markets/market-summary/25/08/47068641/nasdaq-100-sp-500-hit-new-all-time-highs-airlines-jump-whats-moving-markets-tuesday",
      "text": "- Wall Street rallies after inflation data eases tariff pressure, fueling rate cut speculation.\n- Airline stocks surge as JETS ETF jumps 6%, with United and Delta leading.\n- This simple system has nailed 1,000+ post-earnings winners. Get in before Q3 trades take off →\nWall Street is in full rally mode after July’s inflation data eased fears that tariff-related cost pressures were widespread. The headline Consumer Price Index (CPI) came in below expectations, holding steady at 2.7% year-over-year and fueling speculation of upcoming interest rate cuts.\n- JETS ETF is moving fast. Check the chart here.\nHowever, the core CPI – which excludes energy and food – jumped from 2.9% to 3.1% annually, topping estimates of 3%.\nBoth the S&P 500 and the Nasdaq 100 indices broke past new record highs at 6,430 and 23,780 points, respectively. The Dow Jones gained nearly 500 points, or 1%, while small-cap stocks stole the show, with the Russell 2000 jumping 2.2%.\nWhile gasoline continued to slump and provided a negative contribution to the headline reading, other consumer expenses, such as transportation, medical care services, and used cars, showed the highest monthly increase.\nAirline fares, in particular, jumped 4% on a month-over-month basis, causing a rally in airline stocks. The U.S. Global JETS ETF JETS soared 6%, with United Airlines Holdings Inc. UAL and Delta Air Lines Inc. DAL both up by 9%, making them the strongest performers in the S&P 500.\nPresident Donald Trump renewed public pressure on Fed Chair Jerome Powell, announcing that he was considering a major lawsuit against Powell over the Fed building renovation expenses.\nTrump also defended tariffs and reiterated that consumers are not the ones paying them. The president also named E.J. Antoni, an economist at the Heritage Foundation, as the new Commissioner of the Bureau of Labor Statistics, who is reportedly considering discontinuing the publication of monthly jobs reports and instead releasing data only quarterly.\nInvestors are now almost fully pricing in a 25-basis-point interest rate cut in September, followed by another one in December, which caused renewed weakness in the U.S. dollar.\nGold rebounded 0.2% above $3,350 per ounce, silver rose 0.5% to $37.95, while crude oil remained under pressure, down 1% to $63 a barrel. Bitcoin BTC/USD remained relatively unchanged, trading around $119,000.\nTuesday’s Performance In Major US Indices, ETFs\n| Major Indices | Price | 1-day % |\n| Russell 2000 | 2,264.34 | 2.2% |\n| Dow Jones | 44,470.29 | 1.1% |\n| Nasdaq 100 | 23,780.09 | 1.1 % |\n| S&P 500 | 6,432.83 | 0.9% |\nAccording to Benzinga Pro data:\n- The Vanguard S&P 500 ETF VOO rose 0.8% to $589.30.\n- The SPDR Dow Jones Industrial Average DIA gained 1.0% to $444.49.\n- The tech-heavy Invesco QQQ Trust Series QQQ rose 1% to $578.59.\n- The iShares Russell 2000 ETF IWM rallied 2.2% to $225.05.\n- The Communication Services Select Sector SPDR Fund XLC outperformed, up 1.9%; the Real Estate Select Sector SPDR Fund XLRE lagged, down 0.6%.\nTuesday’s Stock Movers\n- American Airlines Group Inc. AAL and United Airlines Holdings Inc. UAL jumped 11% and 10%, respectively, as the July inflation data revealed a price spike in airline fares.\n- Nvidia Corp.‘s NVDA stock remained flat despite a broader market rally, following reports that the Chinese government is discouraging its local companies from buying the company’s AI chips.\n- Stocks moving on earnings reports included ON Holding AG ONON up 7%, and Cardinal Health Inc. CAH down 7%.\n- Intel Corp. INTC saw its stock rise 3.5% after a 3.2% gain the previous day, as CEO Lip-Bu Tan‘s meeting with President Trump appeared to ease recent tensions.\n- Earnings are expected from Alico Inc. ALCO, Anterix Inc. ATEX, CAE Inc. CAE, Everus Construction Group Inc. ECG, H&R Block Inc. HRB, Intapp Inc. INTA, KinderCare Learning Companies Inc. KLC, Luminar Technologies Inc. LAZR, Lumentum Holdings Inc. LITE, and Mineralys Therapeutics Inc. MLYS after the market closes.\nRead Next:\nImage created using artificial intelligence via Midjourney.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "http://benzinga.grsm.io/register174",
      "text": "Benzinga Pro\nJoin 6,000+ traders who get up to a 30-minute head start on market-moving events with tools, insights, and an active community to back you up\nJoin Benzinga Pro FREE for 14 days. You'll get lightning-fast alerts, expert tools, and live trainings without risking a penny.\nBenzinga Pro delivers the tools, insights, and speed you need to make profitable trades alongside your schedule. It's the best-value solution available for all types of traders.\ncharge thousands for personalized advice that may not be as timely or actionable as Benzinga Pro's insights.\ncost hundreds or even thousands of dollars, but they lack the real-time news and community aspect that Benzinga Pro offers.\nlike scanners, calendars, and news feeds can easily add up to a monthly cost exceeding the price of Benzinga Pro.\nYet, you get all of this and more for a full year at a fraction of the cost! And the best part?\nYou can try it for 14 days with our no-risk guarantee.\nAt Benzinga, we're committed to your trading success.\nThat’s why we're giving you three choices today to join Benzinga Pro in the way that fits you best.\nMost traders see the difference within days. Some may see it sooner, others might take a bit longer. Everyone's trading journey is different. That's why we encourage you to give Benzinga Pro a try. If you don't feel like you're making smarter, faster trading decisions, simply reach out and get your money back. Ready to Experience the Benzinga Pro Advantage?\nBenzinga Pro delivers the tools, insights, and speed you need to\nmake profitable trades alongside your schedule\nBenzinga Pro analysts use historical context related to news items to help anticipate the direction or degree of a price move.\nCommunity\nThe chatroom is for traders of any level—whether you have decades of experience or just starting out. Ask questions, find trading ideas, share news and developments, and more!\n7 Channels Total:\nIncluding special lounges for crypto traders and day traders!\nWith a Pro membership you get exclusive access to Anne-Marie's trading room. See what she's trading in real time, her market insights, and technical analysis. This trading room alone can help you pay for your Pro membership!\nLive Q&A Sessions with Anne-Marie Baiynd\nGet direct access to the mind of a trading master. Join live Zoom calls with Anne-Marie Baiynd, a 20-year veteran trader renowned for her unique blend of mathematical prowess and deep understanding of trading psychology.\nExclusive News\nBe the FIRST to know about market-moving events. We work directly with insiders to deliver exclusive news on earnings, M&A deals, drug trials, and more. While others react, you profit.\nProven Results:\nMembers received an exclusive news release for Vivani Medical (VANI)…\n30 minutes before it doubled!\n\"What was most important wasn't knowing the future - it was knowing how to react appropriately to the information available at each point in time.\"\nRay Dalio\nFounder of Bridgewater Associates, the largest hedge fund in the world.\nAudio Squawk\nOur LIVE Audio Squawk keeps you informed, no matter where you are. It’s multitasking for maximum profits. Get breaking news read aloud, freeing your eyes for charts and analysis.\nPlease click below to listen to a sample\nReal Success Story\nRyan Faloona was in another room, and he had just bought Apple. Then the price moved down from his buy. He thought maybe he should sell and wait to get back in at a better price.\nThen, he heard the squawk\n“Apple to join the Dow!”\nHe felt better about his hold…\nand hasn't sold it since!\n“I can be on the beach and I can use Benzinga Pro to set alerts to find what I’m going to trade on Monday morning.\nI mean, it’s just, it’s just incredible. It really is.\nYou don’t find this kind of information as a retail trader or a guy learning to get into the market anywhere else.”\n“You need live feed! And I was getting delayed information [with other companies].\nEven though I was well informed I was still not able to trade as well as I should until I got Benzinga Pro.”\n“[…] Benzinga Pro is a great tool to sharpen a beginner.”\n“[…] if I wanted to know the things first, this [Benzinga Pro] was the place to be.”\n“It really comes down to the community in Benzinga Pro.\nOne first things I noticed was the intelligence level in the small chat window that comes with Benzinga Pro.”\nMovers\nNo more scrambling to figure out what's hot. With a few clicks, you’ll have a shortlist of potential plays. When a stock sees dramatic price action over a selected duration, the stock will automatically appear on Movers.\nExpert Tip:\nYou can have more than 1 Movers tool. Some users set one for gainers and the other for losers.\nThis gives you TWICE as many results.\nCalendar\nThis is the easiest way to see what’s going to happen to stocks you’re watching. Find crucial dividend dates, analyst upgrades, earnings, historical data, and more with just a quick glance!\nChoose From Over 12 Calendars:\nSeparate the noise and find exactly what you want.\nScanner & Screener\nUse filters like price, market cap, volume, float, relative volume, and short interest to fit your trading style. Freeze your stock list or choose a refresh rate. Plus, export your list to a CSV file!\nPresets Included:\nOverall Gainers, 5-Minute Movers, Mid-Cap Movers From Open, Real-Time After Hours Gainers, and Large-Cap Gainers\nSignals\nThe fastest way to know about price spikes, options activity, block trades, halt/resumes, opening gaps, or highs and lows. Fine-tune your alerts even more by choosing your own filters.\nCustom Notifications:\nReceive a browser pop-up, a sound alert, or a synthesized voice.\nDiscover Benzinga Pro’s simple system for generating triple-digit trading ideas\nJoin thousands of satisfied members and harness the power and speed of Benzinga Pro Today!\nThe most amazing...\nHonestly, the most amazing platform I’ve been using since I’ve started day trading. I love how fast the news gets updated so i don’t have to go searching for more sources. Kept me out of GNUS when it dropped from 1.40 to .70 due to reverse split. Would def reccomend.\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nA MUST HAVE...\nby LKTrader\nRated 4.5/5 | 155 reviews\nHow is it so fast?!...\nBenzinga Pro is hands down the BEST tool for day traders, option traders and anyone who is looking to profit from the market! The platform is easy to use, so many customizable feautures, and the newsfeed is FAST and ACCURATE! THANK YOU SO MUCH to everyone that works at Benzinga!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nBest of the Best...\nVery high quality service for trading. This is likely a must-have as far as I can tell after sampling about 8 different platforms in depth.\nby Serena Bernstein\nRated 4.5/5 | 155 reviews\nI Can't Go Back...\n“I would not want to trade without Benzinga Pro. The SQWAUK, the instant news availability, the level of detail you can access quickly, and continuous updating of features are all excellent.”\nby Emily\nRated 4.5/5 | 155 reviews\nThe most amazing...\nCan’t do without it. Benzinga and a cup of coffee are your friends in the early morning of the premarket as you get ready for battle!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews"
    },
    {
      "url": "https://www.benzinga.com/markets/economic-data/25/08/47057291/us-inflation-july-tariffs",
      "text": "- July CPI rose 2.7% annually, below forecasts, with monthly growth slowing to 0.2%.\n- Core CPI climbed to 3.1% annually, topping expectations, with a 0.3% monthly gain.\n- This simple system has nailed 1,000+ post-earnings winners. Get in before Q3 trades take off →\nInflation data for July delivered a split message for markets — headline price growth cooled, but underlying inflation came in hotter than expected, suggesting President Donald Trump's tariff wave has yet to create a broad price shock in the economy.\n- QQQ ETF is moving fast in premarket trading. Check live prices here.\nThe Consumer Price Index rose 2.7% year-over-year in July, unchanged from June and falling short of economists’ forecasts of 2.8%, while the monthly rate decelerated from 0.3% to 0.2%, in line with expectations.\nCore inflation — which strips out volatile food and energy prices — delivered the upside surprise. The annual core rate climbed from 2.9% to 3.1%, the highest since February and overshooting expectations for 3%. Core CPI rose 0.3% on the month, up from June's 0.2% gain.\nPrice increases were led by medical care, airline fares, recreation, household furnishings and operations, and used cars and trucks. Declines were seen in lodging away from home and communication.\nEconomists had warned that tariffs on a wide range of imported goods — from household furnishings to recreational equipment — would filter through to consumer prices in the second half of the year.\nMarkets Keep Betting On Rate Cuts\nDespite the hotter core print, traders held firm to their rate-cut expectations. Futures pricing from CME data shows a 90% chance of a 25-basis-point cut in September, a 61% probability of another cut in October, and near-full pricing for a second cut by December.\nNasdaq 100 futures rose 0.8% after the data, S&P 500 futures gained 0.6%, and the small-cap Russell 2000 jumped 1.5%.\nU.S. short-term bond yields dipped as investors stuck to the view that the Fed will ease policy this fall.\nOn Monday, the S&P 500 as tracked by the Vanguard S&P 500 ETF VOO closed 0.2% lower.\nRead Next:\nImage created using artificial intelligence via Midjourney.\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "url": "https://www.benzinga.com/money/how-to-short-a-stock",
      "text": "If you're interested in learning how to short stocks, get an edge over other traders with Benzinga Pro while we're currently offering a 14-day trial.\nIt’s easy to understand that you make money after buying a stock when the stock price increases. Traders who want to profit from a declining market can use a strategy called shorting stock. Continue reading to find out how you short a stock.\nQuick Look at How to Short a Stock:\n- Research: Identify a stock that you believe will decrease in value.\n- Borrow Shares: Borrow shares of the stock from your broker through a margin account.\n- Sell Shares: Sell the borrowed shares on the open market at the current market price.\n- Wait for Price to Drop: Monitor the stock’s price and wait for it to decrease.\n- Buy Back Shares: Once the price drops to your desired level, buy back the shares from the market.\n- Return Shares: Return the shares to your broker to close out the short position.\n- Profit/Loss: The difference between the price at which you sold the shares and the price at which you bought them back determines your profit or loss.\n- What Does it Mean to Short a Stock?\n- How Do You Do It?\n- An Example\n- See All 13 Items\nWhat Does it Mean to Short a Stock?\nTraders called short sellers use a short selling strategy to speculate on a future market fall of a particular share price.\n- Shorting a stock first involves borrowing the stock you wish to sell at a market-determined interest rate and then selling the borrowed equities to take advantage of a future market decline.\n- You profit by selling the borrowed stock at a higher price and subsequently buying it back at a lower price if the stock price falls. The profit consists of the difference between the price at which the trader sold the stock and the price they buy it back at less any borrowing and transaction costs.\nYou can also lose money if the market rises instead of declines as you expected when you initiated the position. This can be particularly problematic and cause something called a “short squeeze” if a large short position accumulates in a stock and significant buying interest subsequently emerges. Retail investors can take action here if they feel comfortable, and they will simply wait as the price declines further.\nStockbrokers generally have a stock loan arrangement with other clients and brokers where the broker pays a certain amount to borrow requested stock, if available. This arrangement allows the broker to use its customer’s stock held in margin accounts or to borrow stock from other brokers to facilitate its other clients’ short sales.\nSome market participants feel that this is a form of market manipulation, but it’s akin to seizing on an opportunity. Stocks often don’t fall into a position where shorting will make sense, and that’s it’s not a popular investment strategy.\nTypically, the fee for a stock loan on a liquid exchange traded stock is 0.30% per annum. If the stock is difficult to borrow, the stock loan fee could go up substantially.\nIn 2010, the U.S. Securities and Exchange Commission (SEC) implemented its alternative uptick rule, known as Rule 201, that lets investors in a stock exit their long positions before any short selling can legally occur. The rule becomes active if a stock’s price falls more than 10% in a single day. Short selling is then only allowed “if the price of the security is above the current national best bid.” The goal of this rule is to preserve investor confidence and promote market stability during times of high volatility and extreme selling pressure in a stock.\nHow Do You Do It?\nWhile it may sound complicated because of the borrowing aspect, the process of shorting a stock is actually pretty easy to put into practice. Shorting a stock can be explained in four simple steps:\n- The short seller asks their broker to borrow the stock they intend to sell from a holder willing to loan out their stock. They will need to pay a certain interest rate to the stockholder known as the broker loan rate.\n- They then either sell the stock they borrowed at the current market price or they place a limit order to sell it at a specific price and await execution of that order.\n- Once the short seller has successfully established a short position in the stock, they can close out that position by buying back the stock in the market, ideally at a lower price. This is known as “buying to cover.”\n- The borrowed stock is then returned to the owner with interest via the short seller’s brokerage account along with any dividends earned while the stock was borrowed.\nAn Example\nThe following example illustrates the concept of shorting stock using a specific company that had dropped significantly in January 2021.\nThe Company\nAcelRx Pharmaceuticals Inc. (NASDAQ:ACRX) is a specialty pharmaceutical company that saw its shares drop by over 16% in late January of 2021. The decline was attributed in large part to the company’s announcement of a secondary stock offering of 14.5 million new shares that would generate an additional $27.5 million for the company. This created quite a lot of downside risk.\nBeginning the Short Selling Process\nA short seller might expect that AcelRx’s stock price would decline after the stock offering was announced. To take advantage of this anticipated drop, the short seller would contact their broker to borrow the shares they need. As an example, they might ask for a loan of 1,000 shares of AcelRx. The short seller then places an order to sell the borrowed shares at a desired sell price.\nThe short seller could have sold the borrowed AcelRX stock at $2.80 on January 20 and bought back their short stock the next day for $2 per share. Had they done that, they would have realized a profit of $0.80 per share or $800 on a 1,000 share position.\nThe Result of Shorting a Stock\nAfter the announcement of the secondary offering, AcelRX stock declined significantly. This gave the short seller the opportunity to cash in their profits the very next day. If the short seller had not covered their short position quickly, the stock’s subsequent rebound may have cost the short seller money instead of allowing them to realize a profit.\nKeep in mind that the short seller is liable to pay any dividends received from the borrowed stock to the lender of the stock being shorted. The formula used for calculating the rate of return on a shorted security is as follows:\nRate of Return = (Sales proceeds from the short sale - dividends paid to stock lender - purchase price of the stock) / Initial margin requirement\nIn the above equation, the initial margin requirement is the proportion of the total market value of the securities that the short seller has to put up in cash to hold their short position.\nA margin account holder can borrow up to 50% of the equity in their trading account for the purchase of new securities or for short sales on normally traded stocks. A margin account also stipulates a maintenance margin that is typically 30% of the equity value. If the account’s equity falls below this maintenance margin level, the broker will issue a margin call to ask the client to take steps to bring the equity back to 50% within a given time frame. If that is not done promptly, then the client’s positions can be liquidated by the broker.\nMargin trading accounts have their own set of rules and minimum deposits depending on the broker and the stock you plan on shorting. Remember to check with your broker for information about how much of a particular stock you can sell short in your margin account and what your account’s maintenance margin level is.\nBest Online Brokers\nTake a look at these recommended stock brokers for your shorting needs.\n- Best For:Active and Global TradersVIEW PROS & CONS:Securely through Interactive Brokers’ website\n- Best For:Momentum tradersVIEW PROS & CONS:securely through Centerpoint Securities's website\n- Best For:Day Traders and ScalpersVIEW PROS & CONS:securely through Guardian Trading's website\n- Best For:Active Short Sellers With Modest CapitalVIEW PROS & CONS:securely through TradeZero's website\n- Best For:High-Capital Short SellersVIEW PROS & CONS:securely through Cobra Trading's website\nWhat to Know Before Short Selling\nIf you’re considering shorting a stock, make sure you’re informed about your broker’s requirements before you borrow stock to short. You should also be aware of any special circumstances that could make the stock rally before you cover your short position. The following list includes some things you should keep in mind before selling a stock short.\n- The security used for shorting should be liquid since illiquid stocks tend to be harder for brokers to borrow.\n- A trader who intends to short a stock should maintain a funded margin account with their broker, since margin is needed for shorting a stock.\n- Shorting is done by borrowing stock, so the broker will charge interest on that loan to pay to the stockholder. A short seller’s profit earned will be trimmed to that extent.\n- Short selling may be restricted on some stocks due to a low supply of available stock.\n- Stock borrowing costs can rise significantly under certain market conditions.\n- Shorting stocks is not allowed in your IRA account or in any other tax-deferred account.\nUsing Put Options\nShorting could lead to staggering losses if the shorted stock continues to move higher. A safer alternative to shorting a stock is buying a put option that gives you the right, but not the obligation, to sell the underlying security at the strike price on or before the expiration of the option.\nFor example, if you buy one $50 strike put option on ABC stock for $1.50 when it is “at the money” so that the underlying stock’s price is equal to the put option’s strike price, then that gives you the right to sell 100 shares of ABC stock at $50 up until the option’s expiration. You stand to make a profit on that option if the price of the stock drops below $48.50 by expiration since you paid $1.50 to purchase the put option.\nWhen you exercise the put option, you sell the stock at the strike price. You can then pocket the difference between the strike price minus the $1.50 you paid for it and the sale price of the stock.\nAlternatively, you can sell the put option contract before it expires. If the market has since declined, you might make a profit on your initial investment. This can sometimes fetch you better returns than what you might gain by shorting the stock, especially if relatively little time has passed and volatility in the stock has risen.\nRisks\nBefore you begin shorting stocks, it’s important to understand all the risks associated with this type of trade.\nBeware of a Short Squeeze\nOne of the key risks associated with shorting stocks is known as a “short squeeze.” This can occur when unexpected positive news concerning the company or the market triggers a notable upward move in a stock that has attracted considerable short interest. This can then send shorts sellers scurrying to cover their positions to minimize their losses.\nA perfect example of a short squeeze can currently be seen in the stock of GameStop. Some analysts estimate that the stock has a short interest of almost 140% of the total float of the company’s stock. When short sellers chase the security higher to cover their short positions, demand perks up from technical traders, which can trigger a further sharp rise in the price of a stock.\nAnother risk that can fuel a short squeeze comes from something called buy-ins. This occurs when a broker is forced to close out a short position in a highly non-liquid stock since the lender demands their security back, perhaps because they want to close out their long position.\nBuy-ins and short sellers rushing to cover their positions have thus far pushed the price of GameStop stock to dizzying heights well beyond its fundamental valuation as a company. The massive short squeeze has also bankrupted professional hedge funds that have been short the stock for years.\nDespite such pitfalls, shorting as a trading strategy is here to stay, primarily because it offers traders the opportunity to make money even in a downward trending stock market.\nIs Shorting Stock Right for You?\nAlthough shorting stocks has its associated risks, the trading strategy can show high returns if done correctly and at the right times. Make sure to carefully perform your research on any stock before initiating a short position. If you’re ready to start selling stocks short, check out Benzinga’s list of the best online stock brokers for shorting.\nFrequently Asked Questions\nCan I short any stock?\nNot all stocks can be shorted; it depends on the brokerage and market conditions. Some stocks may be hard to borrow or have restrictions.\nWhat fees or costs are associated with short selling?\nShort sellers may incur borrowing fees, margin interest and any dividends paid if the stock pays them while you are short.\nIs short selling recommended for beginner investors?\nShort selling is generally considered risky and may not be recommended for beginners due to its complexity and potential for significant losses.\nAbout Ryan Peterson\nRyan Peterson is a seasoned personal finance writer with a Bachelor’s Degree in Business from Indiana University. With over five years of experience, Ryan has crafted insightful content for multiple finance websites, including MoneyLion At Benzinga, he brings his expertise and passion for helping readers navigate the complex world of personal finance and investing, empowering them to make informed financial decisions."
    },
    {
      "url": "https://benzinga.grsm.io/register174",
      "text": "Benzinga Pro\nJoin 6,000+ traders who get up to a 30-minute head start on market-moving events with tools, insights, and an active community to back you up\nJoin Benzinga Pro FREE for 14 days. You'll get lightning-fast alerts, expert tools, and live trainings without risking a penny.\nBenzinga Pro delivers the tools, insights, and speed you need to make profitable trades alongside your schedule. It's the best-value solution available for all types of traders.\ncharge thousands for personalized advice that may not be as timely or actionable as Benzinga Pro's insights.\ncost hundreds or even thousands of dollars, but they lack the real-time news and community aspect that Benzinga Pro offers.\nlike scanners, calendars, and news feeds can easily add up to a monthly cost exceeding the price of Benzinga Pro.\nYet, you get all of this and more for a full year at a fraction of the cost! And the best part?\nYou can try it for 14 days with our no-risk guarantee.\nAt Benzinga, we're committed to your trading success.\nThat’s why we're giving you three choices today to join Benzinga Pro in the way that fits you best.\nMost traders see the difference within days. Some may see it sooner, others might take a bit longer. Everyone's trading journey is different. That's why we encourage you to give Benzinga Pro a try. If you don't feel like you're making smarter, faster trading decisions, simply reach out and get your money back. Ready to Experience the Benzinga Pro Advantage?\nBenzinga Pro delivers the tools, insights, and speed you need to\nmake profitable trades alongside your schedule\nBenzinga Pro analysts use historical context related to news items to help anticipate the direction or degree of a price move.\nCommunity\nThe chatroom is for traders of any level—whether you have decades of experience or just starting out. Ask questions, find trading ideas, share news and developments, and more!\n7 Channels Total:\nIncluding special lounges for crypto traders and day traders!\nWith a Pro membership you get exclusive access to Anne-Marie's trading room. See what she's trading in real time, her market insights, and technical analysis. This trading room alone can help you pay for your Pro membership!\nLive Q&A Sessions with Anne-Marie Baiynd\nGet direct access to the mind of a trading master. Join live Zoom calls with Anne-Marie Baiynd, a 20-year veteran trader renowned for her unique blend of mathematical prowess and deep understanding of trading psychology.\nExclusive News\nBe the FIRST to know about market-moving events. We work directly with insiders to deliver exclusive news on earnings, M&A deals, drug trials, and more. While others react, you profit.\nProven Results:\nMembers received an exclusive news release for Vivani Medical (VANI)…\n30 minutes before it doubled!\n\"What was most important wasn't knowing the future - it was knowing how to react appropriately to the information available at each point in time.\"\nRay Dalio\nFounder of Bridgewater Associates, the largest hedge fund in the world.\nAudio Squawk\nOur LIVE Audio Squawk keeps you informed, no matter where you are. It’s multitasking for maximum profits. Get breaking news read aloud, freeing your eyes for charts and analysis.\nPlease click below to listen to a sample\nReal Success Story\nRyan Faloona was in another room, and he had just bought Apple. Then the price moved down from his buy. He thought maybe he should sell and wait to get back in at a better price.\nThen, he heard the squawk\n“Apple to join the Dow!”\nHe felt better about his hold…\nand hasn't sold it since!\n“I can be on the beach and I can use Benzinga Pro to set alerts to find what I’m going to trade on Monday morning.\nI mean, it’s just, it’s just incredible. It really is.\nYou don’t find this kind of information as a retail trader or a guy learning to get into the market anywhere else.”\n“You need live feed! And I was getting delayed information [with other companies].\nEven though I was well informed I was still not able to trade as well as I should until I got Benzinga Pro.”\n“[…] Benzinga Pro is a great tool to sharpen a beginner.”\n“[…] if I wanted to know the things first, this [Benzinga Pro] was the place to be.”\n“It really comes down to the community in Benzinga Pro.\nOne first things I noticed was the intelligence level in the small chat window that comes with Benzinga Pro.”\nMovers\nNo more scrambling to figure out what's hot. With a few clicks, you’ll have a shortlist of potential plays. When a stock sees dramatic price action over a selected duration, the stock will automatically appear on Movers.\nExpert Tip:\nYou can have more than 1 Movers tool. Some users set one for gainers and the other for losers.\nThis gives you TWICE as many results.\nCalendar\nThis is the easiest way to see what’s going to happen to stocks you’re watching. Find crucial dividend dates, analyst upgrades, earnings, historical data, and more with just a quick glance!\nChoose From Over 12 Calendars:\nSeparate the noise and find exactly what you want.\nScanner & Screener\nUse filters like price, market cap, volume, float, relative volume, and short interest to fit your trading style. Freeze your stock list or choose a refresh rate. Plus, export your list to a CSV file!\nPresets Included:\nOverall Gainers, 5-Minute Movers, Mid-Cap Movers From Open, Real-Time After Hours Gainers, and Large-Cap Gainers\nSignals\nThe fastest way to know about price spikes, options activity, block trades, halt/resumes, opening gaps, or highs and lows. Fine-tune your alerts even more by choosing your own filters.\nCustom Notifications:\nReceive a browser pop-up, a sound alert, or a synthesized voice.\nDiscover Benzinga Pro’s simple system for generating triple-digit trading ideas\nJoin thousands of satisfied members and harness the power and speed of Benzinga Pro Today!\nThe most amazing...\nHonestly, the most amazing platform I’ve been using since I’ve started day trading. I love how fast the news gets updated so i don’t have to go searching for more sources. Kept me out of GNUS when it dropped from 1.40 to .70 due to reverse split. Would def reccomend.\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nA MUST HAVE...\nby LKTrader\nRated 4.5/5 | 155 reviews\nHow is it so fast?!...\nBenzinga Pro is hands down the BEST tool for day traders, option traders and anyone who is looking to profit from the market! The platform is easy to use, so many customizable feautures, and the newsfeed is FAST and ACCURATE! THANK YOU SO MUCH to everyone that works at Benzinga!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews\nBest of the Best...\nVery high quality service for trading. This is likely a must-have as far as I can tell after sampling about 8 different platforms in depth.\nby Serena Bernstein\nRated 4.5/5 | 155 reviews\nI Can't Go Back...\n“I would not want to trade without Benzinga Pro. The SQWAUK, the instant news availability, the level of detail you can access quickly, and continuous updating of features are all excellent.”\nby Emily\nRated 4.5/5 | 155 reviews\nThe most amazing...\nCan’t do without it. Benzinga and a cup of coffee are your friends in the early morning of the premarket as you get ready for battle!\nby Jason Mcneir\nRated 4.5/5 | 155 reviews"
    }
  ],
  "argos_summary": "American Airlines Group Inc. (AAL) shares surged over 11% following positive inflation data for July, which showed a drop in gasoline prices and a rise in airline ticket prices, indicating strong demand. This favorable economic backdrop contributed to a broader rally in the airline sector, with the US Global Jets ETF (JETS) climbing over 6%. Despite recent struggles, American Airlines reported better-than-expected second-quarter earnings, although it projected a weaker third quarter, reflecting mixed fundamentals.",
  "argos_id": "EUKZZIZPC"
}