{
  "url": "https://www.nytimes.com/athletic/6547382/2025/08/13/chelsea-colwill-maresca-pedro-season-preview/",
  "authorsByline": "Liam Twomey",
  "articleId": "75ab2f07b3174e98845203fefd146b66",
  "source": {
    "domain": "nytimes.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://static01.nyt.com/athletic/uploads/wp/2025/08/12071210/GettyImages-2229405704-scaled.jpg?width=1200&height=630&fit=cover",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T04:20:08+00:00",
  "addDate": "2025-08-13T04:35:37.846284+00:00",
  "refreshDate": "2025-08-13T04:35:37.846286+00:00",
  "score": 1.0,
  "title": "Chelsea 2025-26 season preview: Added firepower, Colwill loss but continuity to be celebrated",
  "description": "Enzo Maresca's side are stepping into the unknown after playing competitive football through the bulk of the summer at the Club World Cup",
  "content": "If their only two pre-season games, against Bayer Leverkusen and Milan last weekend, are any guide, Chelsea are in fine form and fitness heading into the new season.\n\nThis is, in many ways, something of an experiment: what happens when you play competitive football through the bulk of the summer, then rest while your rivals are working hard in pre-season, before returning in time for the competitive football to start again?\n\nReinforcing the squad in the transfer market helps, and Chelsea have been characteristically active with incomings and outgoings. They should be every bit as compelling on the pitch.\n\nWhat are the expectations inside the club for this season?\n\nChelsea may go into the new Premier League campaign wearing a gold badge on their shirts that marks them out as reigning world champions after their triumph in the United States last month but, internally, the message from the club hierarchy is to stay humble and keep working.\n\nEnzo Maresca’s young team are trending in a very positive direction and there is confidence they will continue to do so, buoyed by the belief generated in lifting the UEFA Conference League and Club World Cup trophies within the space of six weeks. All in all, Chelsea won 14 of their final 16 games across all competitions to end the 2024-25 season.\n\nBut expectations that they will now make a Premier League title challenge in 2025-26 are primarily external noise. The immediate priority is to consolidate the top-four status they regained last season while adapting to the return of Champions League football to Stamford Bridge.\n\nWho have they signed?\n\nTwo of the most urgent positions of need — up front and left-winger — have been addressed in this summer’s market, with impressive early returns.\n\nLiam Delap showed immediate promise as their new No 9 at the Club World Cup after his move from Ipswich Town, while Joao Pedro made a huge impact leading Maresca’s attack in the decisive matches of a tournament he was signed from Brighton & Hove Albion partway through.\n\nJamie Gittens was not acquired from Borussia Dortmund in time to contribute to Chelsea’s success in America, but is expected to play a significant role on the left flank this season. On the right, Brazilian prodigy Estevao has finally completed his highly anticipated transfer from Palmeiras and could provide an X factor in what will be his first season in England.\n\nIn defence, Jorrel Hato’s arrival from Ajax helps soften the blow of Levi Colwill tearing his ACL in a training session at Cobham. The 19-year-old Dutchman is more experienced than his age would suggest and is equally adept at playing left-back or centre-back.\n\nTowards the fringes of the first-team squad, Moises Caicedo finally has a specialist defensive midfield understudy in the form of Dario Essugo, signed from Sporting CP this summer after a season on loan at Las Palmas.\n\nMamadou Sarr has been loaned back to Strasbourg after being acquired from Chelsea’s fellow BlueCo club, and summer signings Kendry Paez and Mike Penders have also made temporary moves to the same French side.\n\nChelsea took a long, hard look at experienced goalkeeper Mike Maignan before ultimately deciding not to meet Milan’s asking price for the Frenchman.\n\nHugo Ekitike was also on the summer wish list, but Chelsea had moved on long before Liverpool agreed a deal for the Eintracht Frankfurt forward and are very happy with their acquisitions of Delap and Joao Pedro.\n\nMoves for Alejandro Garnacho, RB Leipzig forward Xavi Simons and Aston Villa midfielder Morgan Rogers have not yet materialised, but Chelsea remain interested in all three, and stepped up talks to sign the Manchester United winger last week.\n\nWhat else is new?\n\nContinuity! A degree of player churn is baked into Chelsea’s recruitment model under this ownership group, but the core of this squad have been together for some time — and Maresca is the first coach of the Clearlake Capital/Todd Boehly ownership era to get as far as a second season in charge.\n\nWho’s been their best player in pre-season?\n\nThough the sample size is perilously small, those victories over Leverkusen and Milan yielded several candidates.\n\nJoao Pedro continued a spectacularly clinical start to his career at the tip of Maresca’s attack with a goal in each game, and Gittens showcased some sharp skills and explosive speed on the left flank. But it was Estevao who truly captured the imagination of Stamford Bridge against Leverkusen, thrilling both in combination with Cole Palmer and as a solo performer.\n\nWhat are people excited about?\n\nThe convincing manner of that 3-0 victory over Paris Saint-Germain in the Club World Cup final has understandably raised hopes that this young Chelsea team are on a trajectory to compete more consistently with the very best teams in England and continental Europe.\n\nOn an individual level, Palmer looked more like his superstar self as that tournament went along, and Joao Pedro has made a stunningly impressive start. There is also plenty of anticipation about what Estevao could become.\n\nIn general, the squad looks considerably stronger in almost every department than it did at this time last year.\n\nWhat are they worried about?\n\nColwill’s long-term knee injury has removed the only consistent presence from the heart of Maresca’s defence.\n\nChelsea’s abbreviated summer rest and pre-season may yet leave them at a significant physical disadvantage relative to their Premier League rivals, even if it does not manifest immediately.\n\nEight games of Champions League football will also be a more exacting midweek test than last season’s six Conference League mismatches. Maresca’s squad management is going to matter more than ever.\n\nMaresca looks refreshed from the three weeks off he was so looking forward to when interviewed on the MetLife Stadium pitch during the Club World Cup victory celebrations a month ago to the day. He should also be more confident in the capabilities of his squad and in his own ability to maximise the tools at his disposal through a long season.\n\nWhat’s the percentage chance of him seeing out the season?\n\nVery high. Maresca achieved Chelsea’s primary objectives for his debut season of a top-four finish and winning the Conference League, then exceeded expectations by also lifting the Club World Cup.\n\nHis position has been strengthened and while perceptions in football can change with lightning speed, the upcoming campaign would have to go very badly for his immediate future to come under question before next summer.\n\nThe Brazilian’s well-rounded skill set should qualify him to play any of the midfield roles in Maresca’s system at least competently, and his physicality seems suited to the intensity of Premier League football.",
  "medium": "Article",
  "links": [
    "https://www.nytimes.com/athletic/6542226/2025/08/11/premier-league-predictions-2025-2026/"
  ],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "last season",
      "weight": 0.08038337
    },
    {
      "name": "season",
      "weight": 0.07135312
    },
    {
      "name": "Premier League football",
      "weight": 0.06988901
    },
    {
      "name": "Chelsea",
      "weight": 0.06931046
    },
    {
      "name": "Champions League football",
      "weight": 0.065473296
    },
    {
      "name": "Club World Cup",
      "weight": 0.06413031
    },
    {
      "name": "Premier League",
      "weight": 0.06308446
    },
    {
      "name": "Conference League",
      "weight": 0.06048097
    },
    {
      "name": "UEFA Conference League",
      "weight": 0.05859154
    },
    {
      "name": "Champions League",
      "weight": 0.05719474
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Lifestyle"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9970703125
    },
    {
      "name": "/Sports/Team Sports/Soccer",
      "score": 0.97998046875
    },
    {
      "name": "/Sports/Sport Scores & Statistics",
      "score": 0.340087890625
    }
  ],
  "sentiment": {
    "positive": 0.62678593,
    "negative": 0.05881483,
    "neutral": 0.31439927
  },
  "summary": "Chelsea is set to begin their 2025-26 season with a strong start to the season, with a confident start and fitness ahead of the new season. The club has been active in the transfer market, with significant additions to key positions such as up front and left-winger. The team's immediate priority is to maintain their top-four status and adapt to the return of Champions League football at Stamford Bridge. Chelsea won 14 of their final 16 games across all competitions to end the 2024-25 season. However, expectations for a title challenge are largely external noise. Key players include Liam Delap, Joao Pedro, Jamie Gittens, and Dario Essugo, and Jorrel Hato from Ajax to help with Levi Colwill's injury. Chelsea's ownership model is also consistent, with the core of this squad being together for some time.",
  "shortSummary": "Chelsea's upcoming season promises enhanced firepower, defensive solidity, and continued player churn, despite the loss of key player Levi Colwill.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "9d3ffa3f97ba467383ef0269e475c6fc",
  "places": [
    {
      "osmId": "5986169",
      "road": "Britannia Gate",
      "suburb": "Walham Green",
      "city": "London",
      "stateDistrict": "Greater London",
      "state": "England",
      "postcode": "SW6 1HD",
      "country": "United Kingdom",
      "countryCode": "gb",
      "neighbourhood": "Wandon Estate",
      "coordinates": {
        "lat": 51.481686499999995,
        "lon": -0.19103517666346065
      }
    }
  ],
  "scraped_sources": [
    {
      "url": "https://www.nytimes.com/athletic/6542226/2025/08/11/premier-league-predictions-2025-2026/",
      "text": "Will the return of Rodri propel Manchester City back to the top of the table? Is this the year Manchester United finally regain their status as a genuine Premier League power? How will a tragic summer affect Liverpool on the pitch? Can the promoted teams break the pattern of recent seasons and stay up?\nAdvertisement\nThe 2025-26 season kicks off on Friday and what better way to start the week than by looking ahead to what might be in store over the coming months.\nWe asked all of our writers to submit their predicted Premier League table — you can see that a little further down this article. (We won’t name the person who had Manchester United finishing in the relegation places — for now, at least.)\nWe also asked Oliver Kay, Adam Crafton, Tim Spiers, Nick Miller, Simon Hughes, Stuart James, The Athletic FC podcast host Ayo Akinwolere and Cerys Jones to gaze into their crystal balls and go a little deeper on some of the key topics.\nLet us know if you agree in the comments and we definitely won’t be holding the writers to their predictions come May. Honest.\nWho will be much better than last season?\nKay: Manchester United simply have to be, but I’ll look across the city and say Phil Foden, who had such a difficult time last season. I’m always wary of that “class is permanent” maxim because there are so many cases that suggest the opposite, but I hope and believe Foden will be energised by a summer’s break, even if it was shorter than would have been ideal.\nCrafton: Strange to say about a team who finished second, but I found Arsenal frustratingly sloppy at times last season. They look a much more complete squad this time around, with additions in key positions, and perhaps Eberechi Eze still to come. There really doesn’t look to be a gap in their armour, so Mikel Arteta must have his team firing from the very start to secure the silverware his reign merits.\nSpiers: Manchester City’s biggest problems last season were rooted in their creaky, Rodri-less midfield. With Rodri back and the dynamic Tijjani Reijnders on board, plus some fine additions in the two Rayans — Cherki and Ait-Nouri — it’s hard to imagine they won’t be much improved.\nAdvertisement\nMiller: Tottenham. Which admittedly isn’t saying much, considering they lost more than half their games and finished 17th last season. But if any team needs a manager who will fashion some square holes for their square pegs, rather than trying to ram them into round ones, it’s Spurs: hello, Thomas Frank.\nHughes: Spurs. Otherwise, they might be relegated.\nJames: The bar’s not set very high for Manchester United and Spurs to be “much better” than last season. The temptation is to say that Spurs, under Frank, will be the biggest climber. But I’m going to roll the dice and suggest United, with no European football, will be around the top six.\nAkinwolere: Crystal Palace, assuming they’re able to keep Eze. I really like Oliver Glasner as a coach. I’ve watched some of their pre-season games and they have been impressive.\nJones: Manchester United, surely, if only because the bar is so low. I have been saying this since I was studying for my GCSEs and should probably know better by now. Joking aside, this Europe-less season and the new-look front line feel like fertile ground for a rebuild.\nWho will be worse than last season?\nKay: Newcastle United, Nottingham Forest and Brentford could all be excused a slight drop-off after exceeding expectations last season, particularly as the first two will have European commitments to contend with. Brentford are the ones at risk of a steep drop-off. Frank is such a hard act to follow for Keith Andrews.\nCrafton: I am a little worried about Bournemouth, who have lost Kepa Arrizabalaga, Milos Kerkez, Dean Huijsen, and seem to be losing Illia Zabarnyi and Dango Ouattara. Andoni Iraola is a super coach, but that’s a hefty rebuild and replacements may not be through the door until the season starts. I’d also expect a substantial drop-off at Nottingham Forest towards mid-table.\nAdvertisement\nSpiers: Recent history tells us Manchester United take very good/promising players and turn them into disasters (Antony, Rasmus Hojlund, Jadon Sancho, Andre Onana, Mason Mount etc). All the best, then, to xG overachievers Matheus Cunha and Bryan Mbeumo. Team-wise, it has to be PSR botherers Aston Villa, who look chaotic.\nMiller: Newcastle. At the time of writing, they don’t have a striker who actually wants to play for them, have strengthened in a couple of positions they were already fine in, and their transfer targets are all picking other teams. Not ideal when you have the Champions League to deal with, too.\nHughes: Brentford. Yes, they’re a well-run club, but they’ve replaced the manager who got them into the Premier League for the first time and kept them there for years with someone who, not so long ago, was a talking head on Sky’s EFL coverage. He has made a huge jump.\nJames: Nottingham Forest (seventh) and Chris Wood (20 Premier League goals) have got their work cut out to maintain the same level. But it’s hard to look beyond Brentford, who have lost their manager, their top goalscorer, and their captain. Fair play to Andrews if he proves us all wrong.\nAkinwolere: You have to worry for Brentford, with many key components missing in the team. Frank, Mbuemo, Christian Norgaard and possibly Yoane Wissa. It feels like an uphill struggle if they’re not able to replace the quality they’ve lost.\nJones: Brentford, for all the reasons mentioned above. If Wissa leaves, too, their attack will look very thin and a top-half finish could be tough.\nWho will win the title?\nKay: The least controversial answer is Liverpool, but there are various unknowns: how the new signings will adapt, whether they’re light in certain areas, and, of course, how the loss of Diogo Jota in such tragic circumstances might affect them.\nI’ll say Liverpool, cautiously, but I wouldn’t discount Arsenal, Manchester City, or — if they can somehow harden up a bit — Chelsea, all of whom should be stronger.\nCrafton: Arsenal. It’s about time. He’s almost been forgotten in the blur of the summer, but Trent Alexander-Arnold’s departure to Real Madrid will be big for Liverpool.\nSpiers: Manchester City had a disastrous 2024-25 season and still only finished 13 points behind Liverpool. They undoubtedly have the best manager, striker and possibly squad in the league, and I think they’ll probably overhaul Liverpool again.\nMiller: Oh god, I’m falling for it again: Arsenal. Broadly because they seem to have actually addressed their problems this summer, rather than Arteta looking at their squad and saying “No, we just need one more beefy centre-half to play at full-back”.\nAdvertisement\nHughes: Liverpool. I’m not convinced their eye-catching summer in the transfer market results in eye-catching performances straight away because it will probably take time for the team to gel, but they have recruited proven quality and upgrades in most positions.\nJames: It’s been such a traumatic summer for Liverpool that nobody can be quite sure how they will respond. But my instinct tells me that Arne Slot and his players will develop an even closer bond in the wake of the Jota tragedy and, with the help of some outstanding signings, retain the title.\nAkinwolere: I really want to say Arsenal! Oh, go on then… Arsenal. As you can tell, I’m not fully convinced, but I have to believe all the pain of consecutive second-place finishes has shown Arteta what he needs to add to this team.\nJones: Liverpool. Arsenal and City’s problems helped them last season, but they have not stood still at the top. Slot’s squad has got even stronger and I don’t feel anyone else has added enough to keep up.\nResults in full: Where our writers think teams will finish\n| Team | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 |\n|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|\n45% | 38% | 14% | 3% | |||||||||||||||||\n31% | 31% | 31% | 7% | |||||||||||||||||\n21% | 21% | 45% | 13% | |||||||||||||||||\n3% | 10% | 10% | 74% | 3% | ||||||||||||||||\n3% | 45% | 17% | 24% | 10% | ||||||||||||||||\n28% | 41% | 14% | 7% | 10% | ||||||||||||||||\n24% | 21% | 41% | 10% | 3% | ||||||||||||||||\n18% | 14% | 18% | 17% | 10% | 3% | 10% | 3% | 3% | 3% | |||||||||||\n3% | 28% | 31% | 10% | 10% | 7% | 3% | 7% | |||||||||||||\n3% | 10% | 14% | 17% | 21% | 7% | 17% | 7% | 3% | ||||||||||||\n7% | 3% | 21% | 17% | 17% | 21% | 3% | 7% | 3% | ||||||||||||\n3% | 3% | 3% | 21% | 21% | 10% | 7% | 28% | 3% | ||||||||||||\n3% | 10% | 10% | 21% | 24% | 14% | 7% | 10% | |||||||||||||\n3% | 7% | 3% | 7% | 21% | 17% | 17% | 17% | 7% | ||||||||||||\n7% | 7% | 7% | 17% | 21% | 24% | 10% | 7% | |||||||||||||\n3% | 3% | 7% | 24% | 14% | 28% | 17% | 3% | |||||||||||||\n7% | 3% | 10% | 21% | 24% | 34% | |||||||||||||||\n3% | 7% | 10% | 17% | 7% | 34% | 21% | ||||||||||||||\n3% | 7% | 14% | 21% | 28% | 24% | 3% | ||||||||||||||\n7% | 7% | 10% | 76% |\nWho is the best signing so far?\nKay: I’ve been less than enthusiastic about Chelsea’s approach in the transfer market in recent years, but looking at Jorrel Hato for £35m and an initial £29.1m for Estevao — and possibly a £40m deal for Alejandro Garnacho — the potential upside of those deals is enormous (I stress potential because there are still aspects of Chelsea’s approach that leave me sceptical).\nCrafton: There have been some great signings by big Premier League clubs plucking from the middle class of the top flight. Joao Pedro to Chelsea and Kerkez to Liverpool seem surefire bets.\nSpiers: You can have your flair players, your tricky flickers and your goalscorers all you like, but the best hairy-arsed tackler in the Premier League in recent seasons was Fulham’s Joao Palhinha — and Tottenham have brought him back to England for peanuts. He could transform their team at both ends of the pitch. Shoutout for Sunderland signing Granit Xhaka, too.\nAdvertisement\nMiller: Fair play to whoever is persuading players to join Sunderland, because Xhaka is a hell of a get. Viktor Gyokeres is very ‘final piece in the jigsaw puzzle’ at Arsenal. Florian Wirtz could turn out to be a sort of super deluxe utility man for Liverpool, and wherever he plays, I think he’ll be magic.\nHughes: Joao Pedro. Chelsea needed a top-class striker and now they have one.\nJames: Wirtz would be an obvious answer. But I’ll throw a left-field name into the mix, purely because I said at the Copa America last summer that Colombia’s Jhon Arias “must surely be on the radar of top European teams”. It disappoints me that Wolves, 12 months later, haven’t even offered a word of thanks.\nAkinwolere: Gyokeres — is he really the elite striker Arsenal have been looking for? How will he fit their system? His hunger for goals and his tireless work rate should bode well for a team that struggled to bury key chances last season. I’m not expecting 40 goals, but I am expecting some top-bins bangers.\nJones: Gyokeres. 54 goals in one season speaks for itself. He might need a bit of time to slot into Arsenal and the Premier League, but once he does, he can be the focal point they sorely need. Considering what strikers seem to cost these days, an initial £55m isn’t bad either.\nWhich player are you most looking forward to watching?\nKay: In addition to Wirtz, who is mesmerising, there’s Arias, who enthralled me during the Club World Cup, Cherki at Manchester City, Estevao at Chelsea, and, if the opportunity arises and they’ve done their homework on time, the precocious Max Dowman at Arsenal and Rio Ngumoha at Liverpool.\nCrafton: Cunha at Manchester United. Some players grow a few inches in that jersey, and many more are weighed down by the history and scrutiny. He strikes me as someone who will relish the expectation.\nSpiers: It’ll be fascinating to see if Gyokeres solves Arsenal’s striker conundrum. His uncontrollable, lusty desire for scoring goals is tangible and his numbers are ridiculous, but most of the Portuguese league would be the equivalent of Championship standard and below. Also, Arias at Wolves promises to be high on the fun scale.\nAdvertisement\nMiller: Wirtz. I don’t especially care how many goals he scores or assists he gets or chances he makes. He just moves in such a slinky, elegant way that I’ll be paying attention to him and only him when Liverpool play. I also like the cut of El Hadji Malick Diouf’s gib, although West Ham will probably ruin him somehow.\nHughes: Wirtz. No Liverpool signing has excited me more since the arrival of Fernando Torres.\nJames: Players (plural), if you don’t mind. Wirtz — what a signing. The incredibly gifted Cherki — intrigued as to how Pep Guardiola uses him (and, in particular, how much the City manager trusts him off the ball). Last but not least, 15-year-old Dowman. A sensational talent.\nAkinwolere: Joao Pedro in this Chelsea setup looks tasty. If the Club World Cup appearances are anything to go by, £50m could be money well spent.\nJones: I’m always wary of overhyping teenage ‘prodigies’, but Chelsea’s Estevao is very exciting. He is an unapologetic entertainer and his dribbling, especially for someone so young, is ludicrous. Romantic or naive as it sounds, it’s always intriguing to hear an incoming player describe football as a “spectacle”.\nWhich manager is under the most pressure?\nKay: Not to say his job is under immediate threat, but the pressure on Ruben Amorim to show he can turn Manchester United around is huge nonetheless. They won just seven of his 27 Premier League games last season. The pressure will lift very quickly if his new-look team can hit the ground running. But if they don’t — and it is far from a gentle start fixture-wise — it’s going to intensify.\nCrafton: The answer to this is always the Manchester United manager, but Daniel Farke has plenty to prove at the highest level at Leeds, while Eddie Howe is coming through a turbulent summer, and I’m curious to see how and if the dynamics at St James’ Park resolve themselves. Oh, and England head coach Thomas Tuchel. There’s a pretty big tournament coming up.\nAdvertisement\nSpiers: Not necessarily to save his job, but there will be pressure on Frank in what is, after 12 years in management, a huge step up for his first big job. Patience may be in short supply on the back of the enormous high of Spurs ending their trophy drought.\nMiller: No need to overthink this: it’s Amorim. That said, Brentford promoting Andrews from set-piece coach to top man in a summer when they’ve lost two of their best players and a third might go is enough to cause a ‘mechanic regarding a leaky engine’ sharp intake of breath.\nHughes: Amorim. If United are occupying roughly the same position they finished in last season come November, he’ll be gone.\nJames: Farke could be gone very early in the season — I don’t see Leeds hanging around if they start poorly. There’s potential for Brentford to make a quick change, too. But, realistically, Amorim goes straight in at No 1. It can’t go on like this, Ruben.\nAkinwolere: Amorim. The buffer of arriving mid-season can only last so long. They have spent a lot of money in attacking areas, but there is still a fair amount of work to do. The fans are impatient and rightly so.\nJones: Amorim. Last season, he had the caveat of arriving earlier than he wanted, and Manchester United’s top brass and supporters have shown him a lot of goodwill. In a campaign with no European football, after being backed so heavily, he has to deliver European qualification at least.\nWho will be top and bottom at Christmas?\nKay: I’m struggling with this one. I know Crystal Palace will finish somewhere between 10th and 15th, but I couldn’t tell you where they or anyone else will be at Christmas. I wouldn’t have predicted this time last year that Liverpool would be four points clear at Christmas with a game in hand. It’s a less predictable league right now and it’s more appealing for that.\nAdvertisement\nCrafton: Arsenal top, Burnley bottom. Burnley’s opening seven games are brutal and threaten to immediately undermine whatever Scott Parker is seeking to build.\nSpiers: Liverpool have the best XI but it may take some time for their signings to gel, so Manchester City will be top. Burnley’s promotion was built on an insanely good defensive record but they’ve lost a couple of key players and — call me crazy — but Armando Broja (two goals in 43 Premier League appearances) might not fire them to safety.\nMiller: Arsenal top, Brentford bottom. Gyokeres has quite a ‘hit the ground running’ vibe to him, so I think Arsenal will be strong in the first half at least. Brentford will have sacked Andrews in around November, but the revival under Sean Dyche won’t have quite started by Christmas.\nHughes: Arsenal (I don’t think they’ll win it) and Leeds, who will have a new manager by that point if this is the case.\nJames: I’ll answer this in reverse order because I feel slightly more confident of that part of the prediction: Burnley. Top? Realistically, it’s one of four: Liverpool, Arsenal, Manchester City and Donald Trump’s Chelsea. Liverpool it is.\nAkinwolere: Liverpool have done a lot of their business early and I think Arsenal and Manchester City will take time to find their flow this time around. It’s hard to look past the newly promoted teams at the bottom. But I’ll go for Brentford.\nJones: Liverpool have given themselves plenty of time to bed in new signings, so they should start strongly; I agree with Ayo that Arsenal and Manchester City will need longer to settle. Sunderland have spent a lot, but not on their defence, which could see them fall behind the pack quickly.\nWill any of the three promoted teams survive?\nKay: Yes. It’s been alarming to see the three promoted clubs go straight back down again in the past two seasons, but I’ll be the cheery voice for once and say I can see two or perhaps even all three of Burnley, Leeds and Sunderland surviving this time. How — and at whose expense — I’m less confident about. Unlike some, I think it’s a dauntingly strong league.\nAdvertisement\nCrafton: I do think the Premier League is better with Leeds and Sunderland in it — and more clubs from the north in general — so I would love to see it. But it’s such a big gap. The promoted clubs should remember that teams like Brentford, Brighton and Bournemouth began their Premier League journeys playing very pragmatic football to earn their right to stay in the division.\nSpiers: Sunderland have done the best summer business, although they also had the most ground to make up. Leeds probably have the best chance and there are obvious vulnerable prey to catch, including Brentford post-Frank and also Wolves, who have been circling the drain for three years and not done much about it.\nMiller: I would have said Burnley, on the basis of their extraordinary defence last season, but selling James Trafford will kick a hole in that. Sunderland have spent a fair bit, but they need essentially all of those moves to go right for them. Leeds are interesting, but at the time of writing, probably don’t have quite enough. That said, Brentford and Wolves will probably be bad, and I think Fulham could regress, so one of the new lot will probably stay up… I’m just not going to commit to one! Sorry!\nHughes: No, but Burnley have the best chance if they are able to defend as they did last season and perform generally as uncompromisingly as they did when Dyche was there.\nJames: Leeds and Sunderland have the potential to be more competitive than Ipswich Town, Leicester City and Southampton last season. Leeds on the basis of… well, just being Leeds and making Elland Road a bit of a fortress. Sunderland, on the face of it, have done some very good transfer business. If I had to pick one… see my final answer, mate.\nAkinwolere: Sunderland have spent a lot of money, but that often doesn’t equal survival. I’m excited by the signings of Simon Adingra and Xhaka, though. Parker struggled at the helm with both Fulham and Bournemouth last time he managed in the Premier League, as did Farke with Norwich City. With Manchester United and Tottenham having such bad seasons and still surviving last time out, you worry about the financial and quality gap already created by the established teams.\nJones: Leeds and Burnley haven’t added enough quality, and while I would love to believe Sunderland’s record spending could save them, the jump in quality after eight years away feels insurmountable and they haven’t reinforced their defence enough. A Cunha-less Wolves could fall far enough to give one side a lifeline, though.\nThe Manchester City case has still not been resolved. What does that mean for the season?\nKay: I don’t know what it means for the season. I think the repercussions are felt more widely in the sense that people doubt English football’s ability and authority to implement its rules and regulate its clubs. That’s not a new story, but it’s a worrying one because, whether you like the rules or not, the alternative is anarchy.\nAdvertisement\nCrafton: The players who may have benefited from some of the earliest alleged breaches have now retired, while the charges begin to feel so drawn-out, so historic, that anyone who continues to bang on about City or scrutinise the club is depicted as being very boring or having a vendetta. But when this thing ever gets resolved, in whichever direction, it will be humongous.\nSpiers: Well, certainly nothing for City, who have spent money in 2025 like it’s going out of fashion. It’ll hang over the season like a Manchester raincloud and, frankly, it’s ludicrous that it’s gone on this long.\nMiller: That we’ll have even more weak banter centred around the number 115, and news stories roughly every three weeks that say ‘Manchester City’s case could be resolved this week’. I suggest nobody engages with this until it’s actually done: your life will be much more pleasant.\nHughes: Nothing. Life will continue as it has ever since the investigation started.\nJames: More regular questions over the fence from my (lovely and retired) Manchester City-supporting neighbour as to whether I’ve heard anything. The whole saga is tiresome (the case, that is, not talking to my neighbour).\nAkinwolere: That I’ll try my best to show enthusiasm for the subject on the podcast, and Matt Slater will try his best to be enthused by the fact that nothing has changed.\nJones: That we will be answering ‘The outcome of Manchester City’s case is still under appeal, so what does that mean for the season?’ this time next year — that is, if it’s even got that far.\nWhich game in the opening weeks will tell us a lot about the season to come?\nKay: There are some big games early on, but Liverpool versus Arsenal on August 31 jumps out. Both will have had a tough-looking away game by then (at Newcastle and Manchester United respectively), so either of them could come out of that game looking like champions-elect or seeming vulnerable, whether that is fair or (as I suspect) not.\nAdvertisement\nCrafton: Newcastle versus Liverpool in the second week. And, sorry Eddie, I am not available to play up front.\nSpiers: August 24, Everton versus Brighton. Will Hill Dickinson Stadium be a shiny modern fortress for Everton, or was it the tight, thunderously atmospheric Goodison Park that was keeping them afloat all these years? More importantly, will the acoustics at the new stadium reverberate boos like Goodison did?\nMiller: There have been plenty of positive noises coming from those who have watched Manchester United in pre-season, and a front three of Cunha, Mbeumo, and Benjamin Sesko is potentially quite sexy. But if they get bulldozed by Arsenal on the first weekend… cue the beleaguered Portuguese man in the hoodie declaring they should just be relegated now.\nHughes: It will be interesting to see how the Club World Cup impacts the performances and results of the teams that competed in it. On one hand, they might be better prepared at the start and tire later. On the other, they might not be as fresh.\nJames: Opening weekend, never mind opening weeks. Manchester United versus Arsenal. Mbeumo, Sesko and Cunha — let’s see what you’ve got. As for Arsenal, are they finally going to win the title again, and is Gyokeres the missing piece? (A sentence I never thought I’d type when I watched him score a long overdue first Swansea goal in January 2021).\nAkinwolere: It all starts on the opening weekend for me, and Manchester United versus Arsenal is big for both clubs. Arteta needs to win big this season, as does Amorim. These two need to hit the ground running and both have fanbases that want to see improvement.\nJones: Week five looks fun: Manchester United versus Chelsea will test Champions League ambitions and Wolves versus Leeds hints at whether we can expect a proper relegation battle. Most of all, Arsenal versus Manchester City helps establish if either will emerge as a clear challenger to Liverpool, or if they will just fight each other for second.\nThe thing we’ll all be saying in May is…\nKay: What next for Marcus Rashford/Jack Grealish/Raheem Sterling as he heads back to Manchester United/Manchester City/Chelsea after his loan spell?\nCrafton: The tickets for the World Cup are HOW MUCH?\nSpiers: Will Manchester City’s 115 charges case be resolved this week?\nMiller: I wish I hadn’t fallen for the Arsenal thing, again…\nHughes: Time to put your feet up, Pep.\nAdvertisement\nJames: Fair play to you, Ange Postecoglou, for keeping Leeds up.\nAkinwolere: Chelsea have got their eye on another 10 players to bolster the squad ahead of next season, with more outgoings still to come.\nJones: With Premier League Golden Boot winner Harry Maguire up front, nothing can stop England. It’s coming home.\n(Top photos: Getty Images; design: Dan Goldfarb)"
    }
  ],
  "argos_summary": "Chelsea is entering the new Premier League season with strong momentum after a successful pre-season, including victories against Bayer Leverkusen and Milan. The club has made significant signings, addressing key positions, and is optimistic about consolidating their top-four status while adapting to the return of Champions League football. Despite external expectations for a title challenge, the focus remains on continued development and maintaining a humble approach after recent successes.",
  "argos_id": "FCL5V66LD"
}