{
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-14989057/Max-Verstappen-Kelly-Piquet-Sardinian-sunshine-family.html",
  "authorsByline": "Amelia Wynne",
  "articleId": "60e94405edf2499a9899ed9097686bf2",
  "source": {
    "domain": "dailymail.co.uk",
    "paywall": false,
    "location": {
      "country": "gb",
      "city": "London",
      "coordinates": {
        "lat": 51.5073219,
        "lon": -0.1276474
      }
    }
  },
  "imageUrl": "https://i.dailymail.co.uk/1s/2025/08/11/09/101098603-0-image-m-36_1754901460372.jpg",
  "country": "gb",
  "language": "en",
  "pubDate": "2025-08-12T07:24:36+01:00",
  "addDate": "2025-08-12T06:29:20.278285+00:00",
  "refreshDate": "2025-08-12T06:29:20.278287+00:00",
  "score": 1.0,
  "title": "Max Verstappen and girlfriend Kelly Piquet step out in Sardinia",
  "description": "Max Verstappen and his stylish girlfriend Kelly Piquet stepped out in the Sardinian sunshine with their kids on a family trip this weekend.",
  "content": "Max Verstappen and his stylish girlfriend Kelly Piquet stepped out in the Sardinian sunshine with their kids on a family trip this weekend.\n\nThe F1 star, 27, and model Kelly, 36, were enjoying some quality time together in the upmarket Porto Cervo area of the Italian island.\n\nMax welcomed his first child - a girl called Lily - with girlfriend Kelly in May this year.\n\nWhile Lily is Max's first child, Kelly already has a daughter, Penelope, born in 2019, from her previous relationship with Formula One driver Daniil Kvyat, 30.\n\nBoth children joined them on the trip as they all stepped out together for a stroll in the picturesque port town.\n\nKelly looked summer chic in a white and beige striped dress which she teamed with brown sliders as she pushed Lily's pram.\n\nMeanwhile Max cut a casual figure in a navy T-shirt and white shorts as he carried some shopping bags.\n\nTheir family holiday in Sardinia comes after the pair purchased a plot of land at the luxury development Pinheirinho Comporta in Portugal.\n\nDaily Mail understands that the couple are planning to build a property there, after spending plenty of time in the sunny holiday destination.\n\nMax's jet was recently spotted at the airport nearby, and he spent time playing golf with his friends and relaxing on the beach at the exclusive UltraLuxe Pinheirinho Comporta resort.\n\nThis is the second year in a row the couple have spent part of their summer in the area, with Kelly often sharing holiday snaps with her social media followers.\n\nPinheirinho is a large coastal estate near Comporta, Portugal, known for its natural beauty and high-end development.\n\nIt features a blend of luxury residences, a championship golf course, and a resort and spa.\n\nBeyond golf, the area offers opportunities for surfing, horseback riding, tennis, and other outdoor activities.\n\nOther celebrity residents include Christian Louboutin, Princess Eugenie and visitors include Claudia Schiffer, Madonna and Harrison Ford.\n\nDaily Mail has contacted Max and Kelly's representatives for comment.\n\nMax welcomed his first child with girlfriend Kelly in May this year.\n\nHe announced the news on Instagram, sharing a slew of black and white snaps of their baby girl, whom he called the 'greatest gift' and revealed they had named her Lily.\n\nAlongside the adorable pictures, he wrote: 'Welcome to the world, sweet Lily. Our hearts are fuller than ever - you are our greatest gift. We love you so much.'\n\nWhen talking about having his first child, Max previously explained he is already somewhat prepared thanks to Penelope.\n\nThe Dutchman said in the Talking Bull podcast : 'Luckily I did get a little bit of training with Penelope, seeing her grow up already for like four years. Which has been also really, really nice.\n\n'But yes, for sure, when it's like, also going be fully your own [kid]... Yes, it's going to be a different challenge. But I'm looking forward to it'.\n\nThe couple began dating in October 2020, and announced that they were expecting their first child together last December.\n\nDespite having a nine-year age gap, Kelly previously said that her relationship with Max is thriving because of the mutual understanding they have for each other.\n\nKelly, said: 'I think we have a very healthy relationship, easygoing, we have a lot of understanding and support for each other.\n\n'You would think the age difference could be a challenge, but so far things are going really well.\n\n'I also really appreciate how he treats Penelope. It's so sweet to see.'\n\nThe subject of marriage has been publicly addressed by Max, who said that only 'time will tell' if he and Kelly decide to tie the knot.\n\nKelly is the daughter of F1 legend Nelson Piquet, who won three Drivers' Championships himself in the 1980s, though he was also embroiled in a racism scandal with Lewis Hamilton.",
  "medium": "Article",
  "links": [
    "https://www.dailymail.co.uk/tvshowbiz/article-11879735/Vanderpump-Rules-star-Kristina-Kelly-welcomes-child-baby-boy-beau-Max-Ville.html",
    "https://www.dailymail.co.uk/sport/max-verstappen/index.html",
    "https://www.dailymail.co.uk/femail/article-10284233/Max-Verstappens-secret-weapon-Driver-24-supportive-model-girlfriend-Kelly-33.html",
    "https://www.dailymail.co.uk/tvshowbiz/article-14980019/Max-Verstappen-girlfriend-Kelly-Piquet-purchase-plot-land-luxury-development-Pinheirinho-Comporta-Portugal.html"
  ],
  "labels": [
    {
      "name": "Pop Culture"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "girlfriend Kelly Piquet",
      "weight": 0.093184866
    },
    {
      "name": "girlfriend Kelly",
      "weight": 0.091335304
    },
    {
      "name": "Kelly Piquet",
      "weight": 0.08912175
    },
    {
      "name": "model Kelly",
      "weight": 0.08240788
    },
    {
      "name": "Kelly",
      "weight": 0.08211294
    },
    {
      "name": "Max Verstappen",
      "weight": 0.0705368
    },
    {
      "name": "Max",
      "weight": 0.06773548
    },
    {
      "name": "UltraLuxe Pinheirinho Comporta",
      "weight": 0.062136058
    },
    {
      "name": "Pinheirinho Comporta",
      "weight": 0.061143257
    },
    {
      "name": "F1 legend Nelson Piquet",
      "weight": 0.058561895
    }
  ],
  "topics": [
    {
      "name": "Sports Figures"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    },
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.9951171875
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.87353515625
    },
    {
      "name": "/Arts & Entertainment/Online Media/Online Image Galleries",
      "score": 0.55859375
    },
    {
      "name": "/News/Sports News",
      "score": 0.433837890625
    },
    {
      "name": "/Beauty & Fitness/Fashion & Style/Other",
      "score": 0.32373046875
    }
  ],
  "sentiment": {
    "positive": 0.42337608,
    "negative": 0.0926408,
    "neutral": 0.4839831
  },
  "summary": "F1 star Max Verstappen and his girlfriend Kelly Piquet have taken their children, Lily and Penelope, on a family trip to Sardinia. The couple were enjoying time together in the Porto Cervo area of the Italian island. This comes after the pair purchased a plot of land at the luxury development Pinheirinho Comporta in Portugal, where they are reportedly planning to build a property there. This is the second year in a row the couple have spent part of their summer in the area. Despite a nine-year age gap, Kelly has expressed satisfaction in her relationship with Max and their mutual understanding.",
  "shortSummary": "Max Verstappen and Kelly Piquet enjoyed a family holiday in Sardinia, where they also discussed plans to build a property there.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "5923ffbc112a4a6b89a8960a6e9fed3b",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.dailymail.co.uk/sport/max-verstappen/index.html",
      "text": "Advertisement\nMax Verstappen\nMax Verstappen, born September 30, 1997, is a Dutch Formula 1 driver for Red Bull Racing. Known for his aggressive driving style, Verstappen became the youngest F1 race winner at 18. He has secured four World Championships (2021-2024). Verstappen continues to break records and dominate the sport\nRELATED TOPICS FOR Max Verstappen\nMax Verstappen News, Stats and Updates\nPage\nMax Verstappen and his stylish girlfriend Kelly Piquet step out in the Sardinian sunshine with their kids on family trip - after buying plot of land in Portugal\n12/08/25 06:24\nMax Verstappen and his stylish girlfriend Kelly Piquet stepped out in the Sardinian sunshine with their kids on a family trip this weekend. The F1 star, 27, and model Kelly, 36, were enjoying some quality time together in the upmarket Porto Cervo area of the Italian island. Max welcomed his first child - a girl called Lily - with girlfriend Kelly in May this year....read\nMax Verstappen and girlfriend Kelly Piquet purchase plot of land at luxury development Pinheirinho Comporta in Portugal\n08/08/25 01:42Daily Mail understands that the F1 star, 27, and model Kelly, 36, are planning to build a property here, after spending plenty of time in the sunny holiday destination.Lewis Hamilton refuses to back down from his explosive 'change the driver' comment as he gives cryptic interview after dismal showing in Hungary\n03/08/25 17:19JONATHAN McEVOY: It was another dismal day for the seven-time world champion at the Hungaroring after his mind-scrambling Saturday, when he qualified 12thMax Verstappen discovers his punishment for bizarre towel-throwing incident during Hungarian Grand Prix practice session\n02/08/25 13:56The reigning world champion was seen discarding a white rag from his cockpit on the exit of turn three, only for it to land on track, triggering a formal summons from race officials.Max Verstappen makes huge decision over his Red Bull future after Christian Horner's sudden sacking\n31/07/25 15:07Verstappen, 27, spoke to the press ahead of this weekend's Hungarian Grand Prix, and amid rising speculation about his future with Red Bull.George Russell nears £30m-a-year Mercedes deal - with bosses accelerating talks amid Max Verstappen's Red Bull stance\n28/07/25 09:05EXCLUSIVE BY JONATHAN MCEVOY: Mercedes have pushed for a conclusion ahead of the summer break that follows this weekend's Hungarian Grand Prix.Jos Verstappen squirms after being hit with awkward Christian Horner question as father of Red Bull star Max is grilled on rift with ex-team boss following his Formula One sacking\n28/07/25 00:02Horner was dismissed this month after 20 years with Red Bull, having overseen the team's transformation from upstart on the grid to winner of six constructors' championships and eight drivers' championships.Lewis Hamilton and Max Verstappen moan at F1 bosses for 'silly' Belgian GP delay... accusing them of being 'way too cautious' in the rain\n27/07/25 18:07JONATHAN MCEVOY AT SPA-FRANCORCHAMPS: Of the initial red flag, Verstappen said to his Red Bull team over the radio: 'That's a bit silly. We should just run. Like chillax. Jesus.'Lando Norris blinked to hand advantage to Oscar Piastri in race for the F1 title - it's back to the drawing board for the Brit after Belgian Grand Prix, writes JONATHAN MCEVOY\n27/07/25 16:48JONATHAN MCEVOY AT SPA-FRANCORCHAMPS: Just when you detect a smidgeon of a stiffening to his approach, another reminder comes around the corner that McLaren have a Jackal in their teamF1 farce as Belgian GP is hit by red flag before the start of the race - despite the rain stopping - leaving Max Verstappen fuming\n27/07/25 13:41JONATHAN MCEVOY AT SPA-FRANCORCHAMPS: F1 was engulfed by farce at the Belgian Grand Prix today as the race was red-flagged after just the formation lap - despite rain having stopped.Lando Norris claims pole position at Belgian Grand Prix as McLaren star keeps world championship hopes alive\n26/07/25 15:36JONATHAN MCEVOY AT SPA-FRANCORCHAMPS: Norris, watched by mum Cisca, put himself ahead of Piastri in qualifying by 0.085sec, the two McLarens on the front row.Max Verstappen wins the first race since Christian Horner's sacking as Red Bull star secures sprint victory at Spa\n26/07/25 11:14Verstappen showed his timeless class to claim the team's maiden win of any sort since Imola in May, writes JONATHAN MCEVOY AT SPA FRANCORCHAMPS.Oscar Piastri secures sprint race pole at Belgium Grand Prix\n26/07/25 03:14Australia's Formula One leader Oscar Piastri took pole position for the Saturday sprint by nearly half a second at the Belgian Grand Prix while McLaren teammate Lando Norris qualified thirdLewis Hamilton gives BLUNT verdict on Christian Horner sacking - as Red Bull prepare for first race since dismissing Geri Halliwell's husband\n25/07/25 15:58The Red Bull boss was relieved of his duties earlier this month after 20 years in charge of the constructor, which under his leadership won eight drivers' championships.The truth about how the plot to sack Christian Horner unfolded as JONATHAN MCEVOY goes inside the Red Bull camp at the first Grand Prix since team principal's brutal dismissal\n25/07/25 01:00A strange, though not unexpected, thing is happening in Spa this weekend with Christian Horner not showing up as he has done on the last 405 occasions a grand prix has been staged.Revealed: How Christian Horner was informed of his shock sacking as Red Bull team principal, one year on from sexting scandal - 'as clay pigeon shoot exposed his crumbling relationship with bosses'\n13/07/25 13:11Horner was dismissed after 20 years as team principal, having overseen Red Bull's transformation from upstart on the grid to winner of six constructors' championships and eight drivers' championships.Max Verstappen and Toto Wolff are holding 'SECRET TALKS in Sardinia' over Mercedes move, claims Ralf Schumacher\n11/07/25 16:10The four-time world champion is contracted to Red Bull until 2028 but has been the subject of interest by Mercedes. If he were to complete a switch it would create a partnership with George Russell .I've known Christian Horner for 20 years - this is the inside story of his sacking, the startling comment he made to me just days beforehand... and what he and Geri will do next: JONATHAN McEVOY\n10/07/25 11:26EXCLUSIVE BY JONATHAN McEVOY: It had all seemed so perfect only a week before. It was Clay Day at the Horner's manor in Oxfordshire. A shoot. The sun was shining.Jos Verstappen was Christian Horner's main rival during the sexting scandal that caused a split at Red Bull: Father of F1 champion Max, once assaulted a man at go-kart track, was accused of attacking an ex and has been arrested for attempted murder\n09/07/25 21:00The F1 world was left in shock on Wednesday morning when Christian Horner was released from his operational duties as Red Bull boss.Max Verstappen breaks his silence on Christian Horner's Red Bull sacking with 26-word statement - after spending a decade together at the team\n09/07/25 15:41Horner helped Verstappen land his first F1 drive with Toro Rosso in 2015, gave him his winning Red Bull debut in 2016, and oversaw his four drivers' title victories.The men who brought down Christian Horner: How Max Verstappen's VERY outspoken father and Red Bull revolters won F1 civil war over £12m-a-year reign of Geri Halliwell's husband\n09/07/25 13:00Horner's departure from the team he spent 20 years leading came on Wednesday, with Red Bull confirming they had released him from his contract with immediate effect.Meet Christian Horner's replacement at Red Bull: Goatee-sporting Laurent Mekies, 48, has a 24-year link with Max Verstappen's dad - and now has the mega-job he never really wanted\n09/07/25 11:09With his distinctive grey locks, moustache, goatee, and soul patch, Mekies brings an air of Albert Einstein about him - and you need some of his intellect to survive in this sport.Christian Horner thought he was untouchable at the top of F1 after brushing off THAT scandal - now he finally knows what comeuppance looks like... but there's still another stain hanging over him: IAN HERBERT\n09/07/25 11:07IAN HERBERT: To the very end, the vastly self-confident Christian Horner clearly considered himself cock of the walk, a big shot and master of all he surveyed.Fuming Oscar Piastri breaks silence on the 10-second penalty that cost him victory at the British Grand Prix\n06/07/25 16:10A fuming Oscar Piastri has broken his silence after he was slapped with a 10-second penalty during the British Grand Prix.CHAOS in the British Grand Prix: Five drivers are forced to retire in opening laps and safety car is deployed twice after crash at treacherous Silverstone\n06/07/25 14:20Liam Lawson, Franco Colapinto, Gabriel Bortoleto, Isack Hadjar and Kimi Antontelli were forced out of the rain-sodden race.British Grand Prix - Formula One: Live leaderboard and lap-by-lap updates as home favourite Lando Norris wins chaotic race to close gap on Oscar Piastri\n06/07/25 13:30Follow Mail Sport's live blog for the latest leaderboard standings and lap-by-lap updates from the 2025 British Grand Prix.Spice Girl Mel C visits wet and windy Silverstone in first appearance since missing Mel B's wedding as she joins Holly and Gordon Ramsay for the British Grand Prix\n06/07/25 13:18Even the the threat of constant rain couldn't keep celebrity fans away as Silverstone hosted the British Grand Prix on Sunday.Red Bull boss Christian Horner names Aussie Oscar Piastri as Max Verstappen successor\n06/07/25 06:10Christian Horner named Oscar Piastri as a target for Red Bull should four-time world champion Max Verstappen leave, as F1 rumours swirl.Max Verstappen produces stunning lap to claim pole for British Grand Prix with home hero Lewis Hamilton fifth and Lando Norris on the second row\n05/07/25 15:46JONATHAN MCEVOY AT SILVERSONE: In the end, the half-evoked memories of Silverstone past came to nothing, Hamilton's brief period on top ended, running wide at the final bend.Max Verstappen interview: Why I'm staying at Red Bull for ever, what I really think of George Russell and how long I've got left in Formula One\n04/07/25 16:00EXCLUSIVE INTERVIEW BY JONATHAN McEVOY: Speculation has raged for months that the quadruple world champion might jump ship to Mercedes, most likely partnering George Russell.Max Verstappen 'is open to HUGE Mercedes move', as 'talks intensify' between Red Bull superstar and rivals - and key clause in his contract could avoid £100m payout\n02/07/25 12:14Max Verstappen could be on the cusp of a seismic move to Mercedes from next season. The Dutchman, who has won four world championships with Red Bull, is reportedly open to leaving the team.Red Bull boss Christian Horner admits Max Verstappen won't win world title after disastrous day in Austria\n29/06/25 21:30Red Bull boss Christian Horner conceded Max Verstappen would not win a fifth consecutive world title after a disastrous day for the team at their home track in Austria.Lando Norris wins Austrian Grand Prix in style to close gap on Oscar Piastri\n29/06/25 15:09JONATHAN MCEVOY AT THE RED BULL RING: In an old incarnation as the Osterrichring, this track could have been called the prettiest graveyard. But on Sunday it was the scene of rebirth for Lando Norris.Max Verstappen hits out at 'f***ing idiot' rival after pair crash out of Austrian Grand Prix on the first lap\n29/06/25 13:44Max Verstappen was left fuming with Kimi Antonelli after the Mercedes driver collided with his Red Bull on the first lap of the Austrian Grand Prix, putting them both out of the race.Revealed: Why Max Verstappen SNUBBED Lewis Hamilton's F1 film after he 'refused' to take part in nightclub scene with Brad Pitt\n28/06/25 09:11Lewis Hamilton's production company Dawn Apollo features in the opening credits and has been credited with playing a decisive role as he helped train Pitt and Idris in Formula 2 cars.Mercedes chief Toto Wolff refuses to rule out poaching Max Verstappen as a partner for fierce rival George Russell\n27/06/25 17:47JONATHAN MCEVOY IN SPIELBERG: In Austria ahead of this weekend's race, Wolff publicly left open the possibility of a Verstappen-Russell pairing despite their collision in Spain earlier in the month.Fuming Max Verstappen asks 'is this a trap?' in frosty press conference ahead of the Austrian Grand Prix - after making 'p***ed off' admission\n27/06/25 08:52Speaking to the media on Thursday, the world champion took exception to one particular line of questioning around his penalty points tightrope.Revealed: Max Verstappen 'REFUSED to film nightclub scene with Brad Pitt' in new Formula One movie\n26/06/25 09:38Pitt, Damson Idris and Javier Bardem star in the new movie, which tells the story of a former driver as he makes a comeback to partner new team mate Joshua Pearce at the fictional APXGP team.Christian Horner REGRETS axing Sergio Perez as replacements struggle - with former Red Bull driver claiming the team 'gradually fell apart'\n25/06/25 12:42Red Bull took the decision to part ways with Perez at the end of last season amid a loss of form for the 35-year-old, who ultimately finished down in eighth place, 224 points behind Verstappen.Toto Wolff tears into Red Bull's 'petty' and 'embarrassing' protest against George Russell - after Mercedes star won race following Max Verstappen incident\n17/06/25 12:17Red Bull accused Russell of driving erratically and displaying unsportsmanlike conduct towards Max Verstappen during a late safety car incident.Max Verstappen snaps at 'childish' reporters and claims talk of potential F1 race ban is a 'waste of time': 'It's p***ing me off'\n14/06/25 22:03BEN NAGLE IN MONTREAL: A 'p***ed off' Max Verstappen snapped at reporters and claimed more talk of a potential F1 race ban is a 'waste of time' after he qualified second in Canada.George Russell snatches pole from Max Verstappen in Canada: Mercedes star produces stunning lap to pip rival - before issuing savage challenge to Red Bull ace after chaos in Spain\n14/06/25 22:03JONATHAN McEVOY IN MONTREAL: Intriguingly, Russell - so impressive here - lines up on the front row alongside Max Verstappen , setting up a potential explosion between the two.FIA suspend key figure ahead of the Canadian Grand Prix after his 'unauthorised comments' on Max Verstappen and George Russell\n14/06/25 14:56The figure has been stood down by the FIA after delivering his verdict on an incident between Max Verstappen and George Russell during the Spanish Grand Prix.Christian Horner opens up on Max Verstappen's future at Red Bull amid doubts - and sends warning to star's father Jos after feud\n14/06/25 10:28Verstappen is contracted with Red Bull until 2028 but their key advisor Helmut Marko, who is also a mentor to the Dutchman, admitted the team had 'great concerns' over whether he would stay.George Russell reignites war of words with nemesis Max Verstappen as he claims Red Bull star tried to 'run me off the road' in Spanish GP crash\n12/06/25 17:43JONATHAN McEVOY IN MONTREAL: Verstappen was handed a 10-second penalty and three penalty points for his hot-headed move into the British driver at 140mph.Formula One AXE season launch show at the O2 Arena for 2026 after just one year - with Max Verstappen and Christian Horner targeted by booing fans at London event\n11/06/25 11:18Formula One bosses have elected to axe a season launch show for the 2026 campaign after it was held just once before being given the boot.Max Verstappen will quit F1 THIS YEAR on one condition, claims former Red Bull mechanic - with Dutch driver chasing record held by Michael Schumacher\n10/06/25 05:59Verstappen is looking to match Michael Schumacher 's record of a fifth title in a row, though he faces an uphill task trying to make up the ground to Lando Norris and Oscar Piastri .Lewis Hamilton reaching 'critical' point of underwhelming debut season with Ferrari - as F1 expert warns of 'growing concerns' in the Scuderia\n09/06/25 15:40The seven-time world champion is still waiting for his first podium since joining the Scuderia from Mercedes, with his sixth-place finish at the Spanish GP providing the latest example of his travails.Christian Horner attacks Ralf Schumacher over his Max Verstappen conspiracy theory\n02/06/25 13:24Following Sunday's Grand Prix Ralf Schumacher made the baseless claim that the Dutchman has been intentionally sabotaging his performances.Max Verstappen takes the blame for 'deliberate' collision with George Russell in dramatic Spanish Grand Prix as F1 champion issues veiled apology\n02/06/25 10:30The incident occurred with just three laps to go, after Verstappen was instructed via team radio to let Russell through, having gained an advantage earlier in the race.Fans label Max Verstappen the 'funniest Driver of the Day ever' as Red Bull star wins vote before 10-second penalty at the Spanish Grand Prix after collision with George Russell\n01/06/25 20:14Fans couldn't help but see the funny side as Max Verstappen was named the Driver of the Day before a 10-second penalty which saw the Red Bull man finish 10th in the Spanish Grand Prix.Max Verstappen accused of 'DELIBERATE' crash into nemesis George Russell, who makes pointed comments about his driving before plummeting champion gives a VERY spiky interview\n01/06/25 14:53JONATHAN McEVOY IN BARCELONA: George Russell argued that Max Verstappen should have been disqualified from the Spanish Grand Prix for deliberately driving into him at 140mph.Oscar Piastri sees off McLaren team-mate Lando Norris to claim his FIFTH victory of the F1 season at the Spanish Grand Prix - as Max Verstappen and George Russell reignite fiery feud\n01/06/25 14:47JONATHAN McEVOY IN BARCELONA: There is only one flaw in the greatest driver in the world.Max Verstappen's dad, 53, suffers nasty crash as his car flips over during rally - with health update revealed after he drove 'too quick'\n31/05/25 16:56Disaster struck for the former F1 driver, 53, as he was competing in the Royal Rally of Scandinavia in Sweden - part of the FIA European Rally Championship.Oscar Piastri claims pole at the Spanish Grand Prix after dominant display in major blow to McLaren star Lando Norris\n31/05/25 15:29JONATHAN MCEVOY IN BARCELONA: Piastri denied Lando Norris a second successive pole position with a dominant display in qualifying for the Spanish Grand Prix.How a royal dinner set up a 'restorative' Monaco win for Lando Norris as he bids to catch Oscar Piastri atop the F1 leaderboard\n30/05/25 21:30JONATHAN MCEVOY: It's crunch time for Lando Norris. Just as it was after his fine win in Australia eight races ago, when we waited to see if he had turned a corner.PETER HOSKIN reviews F1 25: Perfectly recreated F1 cars gliding around perfect recreations of F1 tracks...AND Brad Pitt? Now that's what I call a formula for success!\n29/05/25 23:56PETER HOSKIN: The best sports-simulation game is always Codemasters' latest F1 release, and that's been the case for some years now.Inside the ultra-luxury lives of Formula One stars as drivers head 'home' for the Monaco Grand Prix\n25/05/25 09:00The illustrious and glamorous Monaco Grand Prix is set to take centre stage this weekend - one of the most eye-catching races on the F1 calendar, witb the event always the focus of attention.Max Verstappen launches x-rated rant at Lewis Hamilton after they narrowly avoided a crash during Monaco GP qualifying\n24/05/25 15:52The reigning champion had to abandon his final flying lap in Q1 after a matter of seconds as Hamilton's Ferrari was awkwardly placed at the apex of turn three.Max Verstappen joining Aston Martin is just a 'PIPE DREAM', admits Adrian Newey as revered F1 designer urges his new team to up their game\n23/05/25 21:30JONATHAN McEVOY IN MONACO: Max Verstappen joining Aston Martin is no more than a pipe dream, according to the guru who designed his world championship-winning cars.Max Verstappen storms to Imola Grand Prix victory as fast start catches out Oscar Piastri - while Lewis Hamilton bounces back from disappointing qualifying to finish fourth\n18/05/25 15:52JONATHAN MCEVOY AT IMOLA: Turn One. Verstappen, from second on the grid, braked so late he was nearly in the 22nd Century. He then wriggled in front of Piastri.Oscar Piastri lets fly after qualifying incident as Aussie delivers pole at Italian Grand Prix: 'Lose my s***'\n17/05/25 23:05In a chaotic qualifying at Imola, Oscar Piastri almost lost his cool as he roared to pole position again at the Emilia-Romagna Grand Prix.FIA announce major change to controversial swearing rules after mounting pressure from drivers\n14/05/25 19:58JONATHAN McEVOY: F1 drivers no longer face race bans or exorbitant fines for swearing, after the sport's ruler Mohammed Ben Sulayem relented in the face of widespread opposition.Lewis Hamilton UNFOLLOWS Ferrari on social media as his first season with the Italian team keeps sliding towards disaster\n14/05/25 10:59It is the latest social media detox that the Formula One star has undertaken, with the 40-year-old having previously unfollowed everyone on his account back in 2021.Christian Horner 'on the verge of being SACKED by Red Bull', report claims - but sources say he's NOT at risk\n12/05/25 08:39With Horner at the helm, Red Bull have won six Formula One Constructors' Championships, with the team's drivers winning the World Championship on six occasions since 2005.Red Bull star Max Verstappen uses fake name to drive for rival team as he takes part in shock test session\n09/05/25 19:15Red Bull star Max Verstappen used a fake name as he took part in an unexpected test session for a rival team. Verstappen took part in the session at the Nurburgring Nordschleife on Friday,F1 fans can't get enough of Oscar Piastri's cringeworthy dancing celebration after Miami Grand Prix win\n04/05/25 23:28Australia's F1 world championship leader Oscar Piastri has won the Miami Grand Prix, besting pole-sitter Max Verstappen to lead a McLaren one-two finish - but it wasn't just his drive that stole the show.Lando Norris left screaming at Max Verstappen as Oscar Piastri fends off his McLaren team-mate to win again in Miami and open up gap in title fight - while Lewis Hamilton rages at Ferrari\n04/05/25 21:36JONATHAN McEVOY IN MIAMI: Lando Norris was left screaming at Max Verstappen, and howling at the moon. Nothing can quite click for the British driver as he tries to recover his title hopes.Lewis Hamilton admits he's 'struggling big time' at Ferrari after yet more qualifying woe in Miami as he fails to reach Q3\n04/05/25 09:28The seven-time world champion chased his dream in the off-season as he swapped Mercedes for Ferrari, aiming to win an eighth world championship and move clear of Michael Schumacher.He's the daddy! Max Verstappen celebrates becoming new father by taking stunning pole position at the Miami GP, just one day after girlfriend Kelly Piquet gave birth to daughter Lily\n03/05/25 22:08JONATHAN MCEVOY IN MIAMI: The Dutchman arrived in Florida late after his girlfriend Kelly Piquet gave birth to baby Lily, but he put sentiment aside to pip McLaren's Lando Norris.Lando Norris wins Miami Grand Prix sprint race in pouring rain after timely safety car - as Max Verstappen misses out after 10-second penalty\n03/05/25 17:44JONATHAN McEVOY IN MIAMI: The British driver pit for new tyres when Fernando Alonso pranged his Aston Martin. With racing suspended, he emerged with a lead across the final four laps.Who is the tallest Formula One driver? Our unique chart shows who towers over the rest of the paddock and who is smallest - with Lewis Hamilton left in the shade\n03/05/25 08:54Formula One drivers are required to keep in peak physical condition due to the huge toll their bodies take during a Grand Prix weekend. Drivers are subjected of forces up to 5G and extreme heat.GEORGE RUSSELL INTERVIEW: Why I'm paying my parents back £1.5m for their tough love\n03/05/25 01:00EXCLUSIVE INTERVIEW BY JONATHAN McEVOY IN MIAMI: It's poolside at the Ritz-Carlton, South Beach, Miami, and a sun from central casting beams down.Oscar Piastri sets the pace again as Miami showdown against McLaren teammate Lando Norris heats up\n02/05/25 22:20Oscar Piastri has shown no signs of letting up in his bid to become Australia's first F1 drivers' world champion in 45 years as he led the timesheets in the sole practice session for the Miami Grand PrixKimi Antonelli takes SHOCK pole for Miami GP sprint race - as Mercedes rookie, 18, edges out Lando Norris and Oscar Piastri after superb display\n02/05/25 21:44JONATHAN McEVOY IN MIAMI: The Mercedes rookie edged out the two fancied McLarens - a remarkable feat at the age of 18 and on only his sixth grand-prix weekend.F1 star Max Verstappen arrives in Miami just HOURS after announcing the birth of his first daughter - with driver dashing from France in private jet before preparing to take to the track tonight\n02/05/25 14:31The Dutch driver missed media duty yesterday after welcoming his daughter in Monaco, with Red Bull announcing his absence hours before he was supposed to appear.George Russell demands 'action' from FIA over swearing ban and says 'words don't mean anything' after F1 drivers called to be treated like adults\n02/05/25 13:15George Russell has called for action from the FIA regarding the swearing ban imposed on drivers. FIA president Mohammed Ben Sulayem stated this week that he will revisit the ban.F1 CONFIDENTIAL: Lewis Hamilton risks becoming a great who carried on too long... he must turn the corner fast or his Ferrari farewell will fizzle out\n02/05/25 01:00JONATHAN MCEVOY: Speaking in Miami after a few days in Maranello poring over data and taking to the simulator, Hamilton offered no guarantees of a quick remedy.Max Verstappen to miss Miami Grand Prix media day to stay with his girlfriend ahead of imminent birth of his first child - but is still set to race this weekend\n01/05/25 16:13Max Verstappen has been withdrawn from his scheduled media commitments for this weekend's Miami Grand Prix ahead of the birth of his first child.Aussie F1 legend slaps Lando Norris with brutal two-word insult as he predicts Oscar Piastri will win the world championship\n30/04/25 09:16Norris had been the favourite to finally end Max Verstappen's run of having won four consecutive Drivers' Championships at the start of the season.\nPage\nStars of sport\n-\nMats Hummels' ex-wife complains their son, 7, 'wasn't invited' to his farewell match - while he celebrated with model girlfriend 10 years his junior\n-\nEmma Raducanu calls for crying child to be EJECTED from stadium, sparking tense row with umpire in narrow defeat by Aryna Sabalenka\n-\nMan United star REFUSES to sign for expectant fans... but here's why some supporters say he's RIGHT to dish out a snub\n-\nNew TV footage analysis appears to reveal TRUTH behind Hannah Hampton's water bottle claims after Spain's goalkeeper accused her of LYING\n- Luke Littler opens up on trolls targeting his beautician girlfriend - as darts sensation reveals why she is just what he 'needed' in his life Completed Triple Crown\nmore stars of sport\n-\nPictured: Match of the Day's new line-up pose together ahead of debut season as presenter of first post-Gary Lineker show is revealed\n- NFL rookie is deemed TOO FAT to play and forced to watch from the sideline until he loses weight Heaviest player in NFL history at 464 pounds.\n- Rio Ferdinand lands 'surprise new Man United role' - as Premier League icon prepares to replace him on TNT Stepped away from his punditry role in May\n-\nMan United outcast Alejandro Garnacho appears to clutch a VAPE while getting a new tattoo - two years after fans caught him in deleted Instagram post\n-\nBillionaire tennis nepo baby suffers shock defeat at Cincinnati Open - after her tycoon father's near £100m investment in 'insane' upgrades\n-\nMarcus Rashford produces early contender for miss of the season in Barcelona's 5-0 demolition of Cesc Fabregas' Como\n- Crystal Palace goalkeeper Dean Henderson spotted using 'cheat sheet' during heroic penalty shootout displayl Palace beat Liverpool\n- Eagle-eyed Man City fans spot shirt printing gaffe during Palermo friendly... as many joke they keep 'making the same mistake' A second look needed\n-\nMeet the new Queen of the Formula One paddock: Lando Norris' stunning on-off actress girlfriend previously dated Premier League flop\n-\nDean Henderson delights punters 'by putting £1,000 behind the bar at local pub' after his heroics in Crystal Palace's win over Liverpool\n-\nAnthony Joshua is in talks to stage the most LUCRATIVE fight of his career to take on former YouTube star Jake Paul, reveals his promoter Eddie Hearn\n- Watch: Everton's innovative way to pay for a pint at new Hill-Dickinson stadium but Toffees fans blast 'greedy' prices Welcome to the future\n-\nTennis' richest prize fund, influencers galore and even a reality dating show on YouTube... why this year's US Open promises to be the wildest and wackiest yet\n-\nGetting shirty, lads! Mason Greenwood has jhis ersey RIPPED by Tyrone Mings as pair clash in pre-season match between Marseille and Aston Villa\n-\nEx-Manchester United star David de Gea finally honoured as he returns to Old Trafford with Fiorentina two years after goalkeeper's exit\n-\nFans spot Liam Delap's telling reaction and say the same thing after Chelsea striker watched Joao Pedro's goal in win over Bayer Leverkusen\n-\nTer Stegen is REINSTATED as Barca captain just a day after being stripped of it - as he reaches an agreement with club over medical saga\n-\nHowe says there is currently NO chance of Isak playing in Newcastle's opening game of the Premier League season as he lifts lid on private talks\n-\nShocking moment football thug tries to FIGHT opposition players during ugly brawl on opening game of the season - before flatlined by security\n- Riyad Mahrez makes surprise return to Man City training as Rodri compares former star to new club signing Fan favourite got a warm reception back at the club\n-\nSky Sports presenter and WAG of Championship manager returns to work after cancer battle and a brain infection which left her in a coma\n-\nFoden criticised after City star IGNORES fans asking for his autograph in footage - but TikTok users point out one key reason why he was RIGHT\n-\nHannah Hampton reveals she launched rival keeper's cheat sheet into the CROWD during Euros final shootout in bid to help Lionesses team-mates\n-\nFormer Man United man appeals for help after being burgled during house move as thieves steal car full of valuables in overnight raid\n-\nCristiano Ronaldo marks 'landmark anniversary' with stunning hat-trick in thumping Al-Nassr win - as £26m signing Joao Felix dazzles\n-\nUFC legend Michael Bisping appeals for information on serial killer after claiming man broke into his house and attempted to attack him with a hammer\n-\nHarry Kane SKIES his penalty against Tottenham after scoring the opener in Bayern Munich's pre-season clash against his former club\n-\nMan United fan sets up GoFundMe page to try and raise money for Red Devils to sign Carlos Baleba after they 'made contact with Brighton to enquire about move'\n-\nFormer Man City and European Championship-winning goalkeeper 'sentenced to TWO YEARS in prison for more than 100 cases of fraud'\n-\nCesc Fabregas' Como players involved in mass brawl with Real Betis stars in pre-season clash- with ex-Premier League hero appearing to PUNCH opponent\n- Son Heung-min says goodbye to Tottenham as club legend reads emotional letter to fans after completing record-breaking move to LAFC End of a special era\n-\nRevealed: Record-breaking amount Emma Raducanu will bank if she regains her US Open title - with prize money having more than doubled since 2021 win\n-\nFurious Villarreal fans sign petition in last-ditch attempt to STOP Spanish club signing Thomas Partey after UK court opened door to move amid rape case\n-\nJose Mourinho fights back tears during tribute to his Champions League winning Porto captain Jorge Costa following shock death at 53\n-\nBarcelona give update on registration of six players - with Marcus Rashford among stars sweating on being available for start of LaLiga season\n-\nEx-Arsenal star reveals he squared up to Henry and used to get BLACK EYES from his team-mates as he lifts the lid on fighting culture under Wenger\n- Fans are convinced they know who Jamie Vardy's next club will be after his wife Rebekah's latest social media post The internet has been set ablaze with playful post\n-\nWelcome to Chelsea, finally! Estevao arrives ONE YEAR on from signing for the Blues - and after scoring against them at Club World Cup\n-\nEx-UFC star Michael Bisping claims to have been target of hammer-wielding arsonist serial killer who terrorised north England for more than a decade\n- Liverpool fans declare 16-year-old wonderkid is ready NOW after stunning solo goal just two minutes into his Anfield bow Sensational effort\n- UFC legend drops YouTube fighter with BRUTAL head kick after becoming enraged by opponent taunting him Mighty Mouse lost his cool during video\n-\nWatch the moment furious Roberto De Zerbi is pulled apart from a Marseille player in training - as the furious Italian tells star to 'call your agent'\n-\nTom Brady accused of showing 'ZERO class' after NFL legend's scathing opinion of Wayne Rooney's 'work ethic' made the final cut of new documentary\n- Lamine Yamal mural is vandalised with brutal dwarf slur after Barcelona star's controversial 18th birthday party antics Star made headlines\n- Chris Woakes put into bat for England with ONE ARM as injured hero wears sling for dramatic final stand against India But it was all in vain\n-\nEXCLUSIVE\nJude Bellingham reveals nasty-looking shoulder scar after England star went under the knife following TWO-YEAR ordeal with secret issue\n- Lewis Hamilton refuses to back down from his explosive 'change the driver' comment as he gives cryptic interview\n- Thomas Partey 'set to join LaLiga side' as free agent - despite ex-Arsenal star facing rape charges\n- EXCLUSIVE Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n- Rebecca Loos says it was 'unjust that her life became hell' after David Beckham scandal as she returns to the spotlight for Celebrity SAS\n-\n7ft 2in South Korean MMA star BICEP CURLS Tottenham star Son Heung-min - as the Spurs captain prepares to bow out in front of his home country\n- Sir Chris Hoy explains why he feels 'lucky' after cancer diagnosis granted him 'the time to really appreciate life' He gave three reasons\n- Cristiano Ronaldo defended from 'immense injustice' over his absence from Diogo Jota's funeral The Portuguese FA chief has issued a statement\n-\nRed Bull's Max Verstappen discovers his punishment for bizarre towel-throwing incident during Hungarian Grand Prix practice session\n-\nSon Heung-min bids tearful farewell to Tottenham after telling the club he wants to LEAVE - as he the decision 'one of the hardest of my career'\n-\nHow long Real Madrid defender Raul Asencio could face in prison as prosecutors seek sentence - after he allegedly shared explicit video involving a minor\n-\nChinese schoolgirl becomes the youngest-ever World Swimming Championships medallist after picking up relay bronze aged 12 years and 9 months\n- Anthony Joshua drops hint over new venture with Eddie Hearn after praising his promoter's family for 'conquering' sport A new sport?\n-\nMoment South Korean Tottenham fan bursts into tears after meeting James Maddison - as he and team-mates receive rapturous welcome\n- Olympic champion Laura Dahlmeier's body 'to be left on the mountain' following tragic accident in Pakistan As per her request\n-\nEngland pay emotional tribute to legendary batsman Graham Thorpe at the Oval - as hosts mark 56th birthday almost a year on from his death\n-\nDon't look back in anger, Christian! Sacked Red Bull boss Horner enjoys Oasis gig at Wembley while wife Geri rubs shoulders with Lioness heroes\n-\nEngland hero Toone reveals hidden family heartbreak she suffered just hours before the Lionesses won the Euro 2025 final as she pens emotional message\n-\nJadon Sancho 'tells Dortmund he will chop his staggering Man United salary in HALF' - as £73m exile looks to escape bomb squad with summer move\n-\nJoao Felix's £26m Al-Nassr move makes him the fourth-most expensive star of all-time in combined transfer fees - but who tops the list?\n- Tiger Woods' son Charlie, 16, explodes into form with stunning round that echoes his legendary dad Put in an impressive performance\n- Former Premier League star found guilty after bombarding his ex-girlfriend with calls, emails and LinkedIn requests - as well as going to her home\n-\nEXCLUSIVE\nBurnley to show first ever football match in VIRTUAL REALITY: Fans offered chance to watch Lazio friendly from own home with live commentary\n- Forgotten Liverpool player stars in professional footgolf tournament... as he shares footage of stunning putt Reds cult hero\n-\nLuis Diaz completes £65.5m transfer from Liverpool to Bayern Munich - as forward pens lucrative four-year deal with the German giants\n-\nClattenburg accuses ex-Chelsea star Mikel of 'swinging PUNCHES' at him in new revelations about clash - and claims Blues wanted 'payback' for Terry race row\n- Why former Arsenal star Thomas Partey will still feature on Premier League trading cards this season despite facing rape charges Raising eyebrows\n-\nEXCLUSIVE\nPremier League could come under pressure to SCRAP Summer Series amid club anger - as major reason for frustration is revealed\n-\nInside the Lionesses' jubilant Euro 2025 victory parade: How Wiegman let her mask slip, Kelly's iconic f-bomb, and Williamson's touching message\n-\nMan City complete signing of Trafford in British record deal for goalkeeper as Pep Guardiola becomes first manager in history to spend €2bn\n-\nLionesses arrive at No 10 to meet with Angela Rayner after touching down in the UK to heroes' welcome after their history-making second Euros victory\n-\nMary Earps and Millie Bright break their silence on England's Euro 2025 triumph - after dropping out of selection pre-tournament\n-\nLuke Littler celebrates making darts history on stage with his girlfriend... after confirming relationship with subtle gesture on live TV\n-\nVictorious Lionesses land back in the UK as fans flock to see their Euros heroes ahead of trip to Downing Street - despite being told to STAY AWAY\n- Pep Guardiola compared by fans to Ted Lasso as Man City boss debuts surprise new look ahead of pre-season return Strong facial hair\n-\nInside the Lionesses' all-night party after winning the Women's Euros: Players down wine and sing Sweet Caroline as they celebrate until 4.10am\n- Marcus Rashford, 27, 'is BACK with ex-fiancee' Lucia, 26, two years after split - as she 'joins him in Barcelona to help him settle' after Man United exit\n- UFC fighter left completely disfigured by gruesome injuries as fans call for referee to be fired over brutal bout Ugly scenes inside the Octagon\n-\nThe Lionesses are on the brink of glory at the Euros... and so is their market value! How women's team are entering their 'influencer' era\n-\nLoris Karius bares all on his relationship with TV presenter wife Diletta Leotta - as he reveals her honest thoughts on living apart in Germany and Italy\n-\nMan United 'scout 6ft 5in centre back compared to Rodri as Harry Maguire's long-term successor' - but Red Devils 'face competition'\n- Lewis Hamilton gives BLUNT verdict on Christian Horner sacking - as Red Bull prepare for first race since dismissing Geri Halliwell's husband\n- EXCLUSIVE Wrexham make shock move to sign Christian Eriksen, weeks after he left Man United: Agent confirms talks over shock transfer"
    },
    {
      "url": "https://www.dailymail.co.uk/femail/article-10284233/Max-Verstappens-secret-weapon-Driver-24-supportive-model-girlfriend-Kelly-33.html",
      "text": "Max Verstappen's secret weapon! Driver, 24, has one over on rival Lewis Hamilton thanks to his supportive model girlfriend Kelly, 33, who's the daughter of Nelson Piquet\n- Formula One fans are gearing up for clash between Hamilton and Verstappen\n- Max Verstappen's glamorous model girlfriend Kelly Piquet, 33, will cheer him on\n- Mother-of-one is the daughter of three-time F1 world champion Nelson Piquet\n- Shares daughter Penelope with her ex-boyfriend, Russian driver Daniil Kvyat\nFormula One fans are gearing up for the concluding of 22 rounds of the world championship in Abu Dhabi this Sunday, which will see Max Verstappen taking on Lewis Hamilton.\nAfter Sunday's toxic and chaotic race in Saudi Arabia, won by Hamilton with Verstappen in second place, the two best drivers in motor racing are level on points, though the Dutchman edges it 9-8 on race victories.\nIf neither should finish the dusk-into-night race down the road in Yas Marina, Verstappen would win his first title on countback.\nCheering Max on is his glamorous Brazilian model girlfriend Kelly Piquet, 33, who is somewhat considered F1 royalty and a familiar face on the circuit.\nShe is the daughter of three-time F1 world champion Nelson Piquet and previously dated Daniil Kvyat for three years, with whom she shares a two-year-old daughter, Penelope.\nCheering Max Verstappen on this weekend at the finale of the world championship in Abu Dhabi is his glamorous Brazilian model girlfriend Kelly Piquet, 33, (pictured together)\nThe blogger and model is the daughter of three-time F1 world champion Nelson Piquet and previously dated Daniil Kvyat for three years, with whom she shares a two-year-old daughter Penelope\nSince his retirement, Piquet - married to Viviane de Souza Leão - has been ranked among the greatest Formula One drivers in various motorsport polls.\nKelly is the daughter of Nelson and Sylvia Tamsma, a Dutch international model who shares two other children with the racer.\nPiquet made his Formula One debut with the Ensign team and drove for McLaren and Brabham.\nHe moved to the Williams team in 1986 where he took his third and final championship in 1987 during a heated battle with teammate Nigel Mansell.\nKelly is the daughter of Nelson and Sylvia Tamsma, a Dutch international model who shares two other children with the racer (pictured, Kelly with Nelson)\nThe stunning brunette, who works in motorsport PR, has also posed for PatBO and Lucas Boccalão, and walked the catwalk in a number of fashion shows\nKelly's father Piquet made his Formula One debut with the Ensign team and drove for McLaren and Brabham (pictured in 1982)\nThe Brazilian subsequently moved to Lotus for 1988–89 and eventually went to the Benetton team for 1990–91 where he managed to win three races before retiring, at which point he tried his hand at the Indianapolis 500 for two years.\nThe father-of-seven now manages his sons Nelson Piquet Jr. and Pedro Piquet, who are also professional racing drivers.\nMeanwhile Kelly, who is is nine years older than 24-year-old Verstappen, was born in Germany in 1988.\nShe spent most of her childhood living in the South of France before the family moved to Brazil when she was just 12.\nThe 33-year-old grew up with a jet-setting lifestyle, living in France, Brazil and England before heading to the US for college\nMeanwhile the stunning model welcomed her first child Penelope with ex-boyfriend Kvyat in 2019 (pictured left, together at Disneyland and right, Kelly)\nAt the age of 15, she returned to France, and lived there for another year before moving to England to study at a boarding school.\nJust two years later, she returned to Brazil to attend her senior year of school.\nIt wasn't long before she moved to the US, attending Marymount Manhattan College in New York and majoring in International Relations.\nDuring college, she took an internship in fashion and picking up work at Vogue Latinoamerica, Bergdorf Goodman, KCD PR agency, in addition to being a columnist for Marie Claire magazine.\nThe mother-of-one regularly shares snaps with her beau (right) and of her bikini body (left) on Instagram, delighting her 500,000 social media followers\nSpeaking to Glamour Russia, she explained: 'Growing up in this world and seeing from very close what it takes for someone to reach such a high level, I can only associate racing to passion, perseverance, dedication, discipline, and adrenaline.'\nKelly clearly has a thing for Formula One drivers; the stunner previously dated Russian racer Daniil Kvyat, with whom she shares a two-year-old daughter, Penelope Kyvat.\nThe couple were together from January 2017 until December 2019.\nMeanwhile Kelly is believed to have been dating the Red Bull driver Max since late 2020, and regularly shares snaps of her adventures around the world on Instagram.\nMax went public with their relationship on New Year's Day this year, sharing a romantic snap of them together on a beach in Brazil, though it's thought they've been an item since October 2020.\nAnnouncing the news online, Max posted: 'Happy New Year everyone. Let's make 2021 a year to remember in many ways. Wishing you all success, love and happiness just as I found mine.'\nMeanwhile Kelly wrote: 'Love is what makes the world go round. Happy new year and much love #2021.'\nKelly is a familiar face in the pitlane, having worked in motorsport PR and social media for Formula-E since 2015.\nIn 2016, she told the website e-racing.net she was 'working full time for Formula E as social media strategist and content creator.'\nShe explained: 'I focus on Instagram and Twitter, and do all Snapchat content.'\nMeanwhile she added she loved travelling the world because she gets to see so many different cultures, meet different people.'\nShe continued: 'Although the most exciting thing to me is being part of such an innovative concept, and introducing this new sport to different cities and cultures.\n“My favourite race locations so far have been Berlin, Monaco, Buenos Aires and Paris.'\nAs a model she's posed for PatBO and Lucas Boccalão, and walked the catwalk in a number of fashion shows.\nHer ultra glamorous Instagram is filled with modelling shots as well as snaps of her lavish holidays jetsetting across the world.\nMeanwhile her daughter Penelope can often be seen by her side as the duo snuggle up in various luxurious destinations.\nAnd the mother-of-one regularly shares snaps of her bikini body on Instagram, delighting her 500,000 social media followers.\nCheering Max on is his glamorous Brazilian model girlfriend Kelly (pictured together), who previously dated Daniil Kvyat for three years\nMax went public with their relationship on New Year's Day this year, sharing a romantic snap of them together on a beach in Brazil, though it's thought they've been an item since October 2020 (pictured left and right)\nWithin the last few months, she has shared snaps from Brazil, Monte Carlo, Russia, Milan and Amsterdam.\nOther snaps show her gushing over Max, with her birthday tribute to her boyfriend reading: 'Happy Birthday to the love of my life.\n'I love everything about you, about us and I am beyond proud of you. I can’t wait for all that is to come.'\nIt is believed Max only met his father-in-law Nelson a month ago, when the model shared a snap on her Instagram stories of the pair, writing: 'Finally they meet.'\nKelly with her father, three-time F1 world champion Nelson Piquet (right) and fellow F1 legend Niki Lauda\nAnd earlier this year she spoke of her fears for her boyfriend when he takes part in races.\nShe explained: 'It’s of course mixed emotions. I’m always super excited to support him but I always am nervous that everything goes well and that he doesn’t get hurt in an accident.\n'The danger is normally not the first thing that comes to my mind but after his two big accidents this year, I’m much more nervous.'\nShe also revealed how she dreams of 'building a beautiful, strong and united happy family.'\nKelly is a familiar face in the pitlane, having worked in motorsport PR and social media for Formula-E since 2015 (pictured with Max in Monaco)\nDays ago, Martin Bundle warned Max risks tarnishing his legacy and could be labelled an 'unfair driver' should his tactics in his tumultuous F1 world title battle with Lewis continue.\nThe two drivers head into the final race of the season in Abu Dhabi this Sunday level on points after a Saudi Arabian Grand Prix which saw Hamilton win and Verstappen given two time penalties following clashes between the two of them.\nYet Sky Sports F1 expert Brundle - while praising the Dutchman's 'driving skills and racing nous' - explained his concern that a continuation of these controversial tactics could damage his legacy as he hunts his first world championship.\nKelly is a familiar face in the pitlane, having worked in motorsport PR and social media for Formula-E since 2015\n'Such is Max's car control and cunning, he's sometimes able to pull off the audacious moves and leave a margin of doubt as to whether it's hard racing or simply a professional foul outside of the regulations,' Brundle said in his Sky Sports column.\nBy virtue of having more race wins than seven-time world champion Hamilton - nine to eight - Verstappen would win the title if neither driver finished the race in Abu Dhabi this Sunday.\nThis has led to speculation that Verstappen could resort to ramming his rival off the track, while his dad Jos admitted that his son would do 'everything' to win the world title.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Hawaii ferry is tossed by strong waves before being run aground\n- Nat Barr's tough message to Albo after recognising Palestine state\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Jennifer Lopez has an unexpected guest during her concert"
    },
    {
      "url": "https://www.dailymail.co.uk/tvshowbiz/article-11879735/Vanderpump-Rules-star-Kristina-Kelly-welcomes-child-baby-boy-beau-Max-Ville.html",
      "text": "Vanderpump Rules star Kristina Kelly, 35, welcomes first child — a baby boy named River — with beau Max Ville\nVanderpump Rules star Kristina Kelly took to Instagram on Sunday to announce she's a new mother.\nThe 35-year-old reality star and her boyfriend, Max Ville, 36, welcomed a baby boy named River.\nKristina announced the good news with a sweet photo of her newborn wrapped in a white blanket, sleeping on a green pillow with a groove in the middle to keep him from rolling over.\nThe proud mom captioned the post, 'You’re more than I could have ever dreamed of, welcome to the world River.'\nVanderpump Rules alumna Stassi Schroeder, who is expecting her second child with her husband Beau Clark, took to the comments section to write, 'The most perfect little angel boy I have ever seen and I'm not being dramatic.'\nWelcome to the world: Kristina Kelly announced she's a new mom with a precious shot of her newborn baby wrapped up in his crib\nSo excited: The 35-year-old Vanderpump Rules star and her boyfriend, Max Ville, 36, welcomed a baby boy named River\nIn February, Kelly spoke with Entertainment Tonight alongside her costar Scheana Shay, about how excited she was to become a mother.\n'I've wanted to be a mom forever,' she said. 'I feel like my entire life, literally, like even when I was little, my mom said I would take care of the other kids at daycare and stuff, try to change diapers.\n'I’ve always been the voice of reason and the person who's always like, \"Guys, could we just all get along?\" Kelly added.\n'I feel like I've always tried to be a little bit of a mom, so there's so many things to look forward to,' she said.\nThis comes after her costar Scheana declared that she is 'fully intending' to be at the reunion in person despite Raquel Leviss' temporary restraining order against her.\nThe 37-year-old reality star — who was recently defended by her costar Kristen Doute — took to her podcast Sheananigans on Saturday and addressed rampant fan speculation that she would not be able to attend the reunion.\nShay proclaimed: 'As far as I know, I’m fully intending on being there in person. I have no say over how this logistically works out — if it’s Zoom.\n'We also have another COVID test we have to do before the reunion. So that is not up to me whatsoever. I just wanna make that very clear,' said Shay.\nThe upcoming VPR reunion was thrown into chaos after Leviss, 28, secured a temporary restraining order against Shay this week, accusing her of assault, which Scheana has vehemently denied.\n(L-R) Reality TV Personalities Lala Kent, Kelly, and Scheana Shay attend the Give Them Lala & Friends VIP launch and viewing party at Shopify LA - pictured February 2023\nReady to rumble: Shay, 37, has declared that she is 'fully intending' to be at the Vanderpump Rules reunion in person. Shay's attendance at the reunion has been thrown into question after her costar Raquel Leviss, 28, secured a temporary restraining order against her this week\nCant keep her away: The reality star took to her podcast Sheananigans on Saturday and addressed rampant fan speculation that she would not be able to attend the reunion. Shay proclaimed, 'As far as I know, I’m fully intending on being there in person. I have no say over how this logistically works out — if it’s Zoom'\nYikes: Leviss filed for the restraining order after claiming that Shay had punched her in the face, giving her a black eye. She also said Shay had shoved her into a break wall, which allegedly injured the back of her head\nMajor betrayal: Raquel Leviss (right) has been accused of carrying on an affair with her costar Tom Sandoval, 39, who had been in a nine-year relationship with fellow Vanderpump Rules star Ariana Madix, 37 (Sandoval, Madix and Leviss pictured in November)\nMessy: The upcoming VPR reunion was thrown into chaos after Leviss, 28, secured a temporary restraining order against Shay this week after she accused her of assault, which Scheana has vehemently denied - (L-R) Shay, Raquel Leviss\nLeviss filed for the restraining order after claiming that Shay punched her in the face, giving her a black eye, before shoving her into a wall, which allegedly injured the back of her head.\nLeviss has been accused of carrying on an affair with her costar Tom Sandoval, who had been in a nine-year relationship with fellow Vanderpump Rules star Ariana Madix.\nThe bombshell cheating scandal is what drove Shay to allegedly punch Leviss, adding more fuel to the fire of VPR's explosive 10th season.\nThe reunion is currently scheduled to tape on March 23, nearly a week before a court hearing on Leviss' restraining order.\nMost watched News videos\n- Moment passengers 'stop' man who pulled down trousers on tube\n- Shocking moment man is gored to death after charging at bull\n- Moment Cycling Mikey pushes bike into a car after furious row\n- Shocking moment woman strikes flight attendant before being removed\n- Chinese Navy ship collides with own vessel while chasing boat\n- Chinese navy vessel collides with one of its own chasing Philippine boat\n- Florida man knocks out kayakers while attempting a DAREDEVIL leap\n- Father of children mowed down in Oatlands tragedy confronts killer\n- Hawaii ferry is tossed by strong waves before being run aground\n- Nat Barr's tough message to Albo after recognising Palestine state\n- Family-friendly restaurant Cracker Barrel unveils bold new look\n- Jennifer Lopez has an unexpected guest during her concert"
    }
  ],
  "argos_summary": "Max Verstappen and his girlfriend Kelly Piquet enjoyed a family trip in Sardinia with their children, including their newborn daughter Lily, born in May. The couple, who have been together since late 2020, are also planning to build a property in Portugal after purchasing land in a luxury development. Kelly, a model and daughter of F1 legend Nelson Piquet, expressed her excitement about supporting Max in his racing career while also managing her own professional endeavors.",
  "argos_id": "FRENMAELS"
}