{
  "url": "https://nypost.com/2025/08/12/media/dean-cain-fires-back-after-john-oliver-insults-ice-criticism/",
  "authorsByline": "Fox News",
  "articleId": "dbb91b2a12144f9e90cf926c374eba62",
  "source": {
    "domain": "nypost.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://nypost.com/wp-content/uploads/sites/2/2025/08/actor-dean-cain-attends-red-109524915.jpg?quality=75&strip=all&w=1024",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:54:55+00:00",
  "addDate": "2025-08-13T02:08:05.465720+00:00",
  "refreshDate": "2025-08-13T02:08:05.465721+00:00",
  "score": 1.0,
  "title": "Dean Cain rips John Oliver over controversial ICE monologue, insults thrown at ex-superman actor",
  "description": "Former “Superman” actor Dean Cain took a shot at “Last Week Tonight” host John Oliver after he mocked him and Immigration and Customs Enforcement (ICE) in a segment on his s…",
  "content": "Former “Superman” actor Dean Cain ridiculed “Last Week Tonight” host John Oliver on Monday over his monologue claiming Immigration and Customs Enforcement (ICE) was “f—ed” if they let the actor join its ranks.\n\nNear the end of his show on Sunday, Oliver mocked both ICE and Cain over news that ICE had removed its age limits and would be swearing in the “Lois & Clark: The New Adventures of Superman” star as an “honorary ICE officer.”\n\n“You know, there’s an old saying in Hollywood: ‘If all you can get is Dean Cain, you are f—ed,’” Oliver said on his show.\n\n“Now, I’m not saying that ICE isn’t finding people. I’m just saying, when you are reduced to pinning a badge on the 59-year-old star of ‘The Dog Who Saved Christmas,’ ‘The Dog Who Saved Christmas Vacation,’ ‘The Dog Who Saved the Holidays,’ ‘The Dog Who Saved Halloween,’ ‘The Dog Who Saved Easter,’ and ‘The Dog Who Saved Summer,’ maybe you are in trouble.”\n\nHe added, “Although, on the plus side, no need for that guy to wear a mask because the chances of anyone recognizing him are f—ing zero.”\n\nCain mocked the HBO host in kind on X the next morning.\n\n“He stole that mask joke from the internet — and he also laughed hysterically when Trump said he was going to run for President. Case closed. (and those movies were sweet, by the way!),” Cain wrote.\n\nDuring the show, Oliver also gave advice to viewers on how to interact with ICE agents, telling them to only say “Am I free to leave?” and “I want to speak to a lawyer.”\n\n“And I recognize that in some cases you may be unable to help yourself from saying, ‘Didn’t you used to be Superman? I thought you died. I can’t believe I’m meeting a filmmaker,’ but that really is it,” Oliver joked.\n\nCain will be sworn in as an honorary officer in the coming month, assistant secretary Tricia McLaughlin, the Department of Homeland Security’s spokesperson, said. Although it wasn’t immediately clear what his duties as an honorary officer would entail.\n\nIn an interview with Fox News Digital, Cain described joining ICE as a way to show support for the officers that he believes were being “vilified” for doing their jobs.\n\n“If you’re a legal citizen here in this country, no worries, you’re great, but if you’re here illegally, you’ve broken the law to begin with, whatever the circumstances are. You had multiple opportunities to self-deport, and the fact that these men and women who are doing their jobs are getting vilified, I had to stand up with them and for them, because I think it takes people standing up to change the culture,” Cain said.\n\nCain also defended joining ICE during a heated debate with anti-Trump The Bulwark host Tim Miller on “Piers Morgan Uncensored” on Monday.\n\n“Now we’ve got ICE agents — and, apparently, former ‘Superman’ actors — who are going to jump out of vans and nab them and hold them in deportation cells. That’s insane. Like, that’s not how you act in a free country,” Miller mocked.\n\n“I’m not untrained,” Cain shot back, bringing up how he became a deputy sheriff and a reserve police officer nearly a decade ago.\n\n“So, I don’t know why you’re saying untrained. And by the way, when you join ICE, they train you. So, to say that and try to denigrate because I’m an actor, I shouldn’t be able to be concerned about what’s going on with our borders or with our law enforcement agencies is denigrating. It’s ridiculous. Should I say because you’re a former Republican strategist, you have no say on anything? That’s baloney,” he added.",
  "medium": "Article",
  "links": [
    "https://www.foxnews.com/entertainment/dean-cain-exposes-sexual-harassment-plagued-him-during-lois-clark",
    "https://x.com/RealDeanCain/status/1954771461765505523",
    "https://www.youtube.com/watch?v=7S9Dg9cPMbE&t=165s",
    "https://www.youtube.com/watch?v=DfTBhrkae74&t=1200s",
    "https://www.foxnews.com/media/john-leguizamo-torches-dean-cain-loser-joining-ice-superman-actor-offers-gentle-reply",
    "https://www.foxnews.com/entertainment/superman-actor-dean-cain-becomes-ice-agent-support-vilified-officers-enforcing-immigration-law",
    "http://foxnews.com",
    "https://www.foxnews.com/media/dean-cain-fires-back-after-john-oliver-insults-ice-criticism"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "ICE agents",
      "weight": 0.08675556
    },
    {
      "name": "Dean Cain",
      "weight": 0.0864219
    },
    {
      "name": "controversial ICE monologue",
      "weight": 0.083908334
    },
    {
      "name": "ICE",
      "weight": 0.082471475
    },
    {
      "name": "Cain",
      "weight": 0.07991759
    },
    {
      "name": "John Oliver",
      "weight": 0.06930351
    },
    {
      "name": "ex-superman actor",
      "weight": 0.066278845
    },
    {
      "name": "Oliver",
      "weight": 0.061377924
    },
    {
      "name": "assistant secretary Tricia McLaughlin",
      "weight": 0.053512327
    },
    {
      "name": "Superman",
      "weight": 0.050051235
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.98095703125
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Shows & Programs",
      "score": 0.93603515625
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.71240234375
    },
    {
      "name": "/Arts & Entertainment/TV & Video/TV Guides & Reference",
      "score": 0.363037109375
    }
  ],
  "sentiment": {
    "positive": 0.07015474,
    "negative": 0.65561044,
    "neutral": 0.2742348
  },
  "summary": "Former Superman actor Dean Cain, former \"Superman\" actor, has criticized \"Last Week Tonight\" host John Oliver for his controversial monologue about Immigration and Customs Enforcement (ICE) and suggested that the agency was \"f—ed\" if Cain joined its ranks. Oliver also suggested that Cain's age limit was too high and that ICE had removed its age limits. Cain defended his joining ICE as a way to support the officers who he believes are being \"vilified\" for their jobs. The former Superman actor will be sworn in as an honorary officer in the coming month and is being advised by the Department of Homeland Security.",
  "shortSummary": "Former Superman actor Dean Cain criticized John Oliver’s ICE monologue, then defended the officers' actions, and was sworn in as an honorary officer.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "276ed599f9a14bb890e1d40649a80c29",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.foxnews.com/entertainment/superman-actor-dean-cain-becomes-ice-agent-support-vilified-officers-enforcing-immigration-law",
      "text": "Dean Cain has great respect for ICE agents, so he's decided to become one.\nDuring an interview with Fox News Digital, the \"Superman\" actor explained that his motive to join ICE is the same as when he decided to get involved in law enforcement nearly a decade ago — to protect and serve the American people.\nThe \"Lois & Clark: The New Adventures of Superman\" star is a deputy sheriff and a reserve police officer and encourages other Americans to get involved if they can.\nTRUMP ADMINISTRATION ENDS AGE CAP FOR ICE POSITIONS IN MAJOR RECRUITMENT DRIVE\n\"Our ICE agents, who are amazing men and women, are incredible. And they're black, and they are brown and green and yellow and Japanese and whatever. They're a cross-section of Americans,\" he told Fox News Digital. \"They are doing their job, the job that Congress wrote the laws for them to support and uphold, and they're doing the job of deporting people who are here illegally.\n\"If you're a legal citizen here in this country, no worries, you're great, but if you're here illegally, you've broken the law to begin with, whatever the circumstances are. You had multiple opportunities to self-deport, and the fact that these men and women who are doing their jobs are getting vilified, I had to stand up with them and for them because I think it takes people standing up to change the culture,\" Cain said.\n\"I had to stand up with them and for them because I think it takes people standing up to change the culture.\"\nCain said he considers Daniel Penny, the former Marine acquitted of negligent homicide in the death of Jordan Neely on a New York subway in 2023, and Dan Bongino, United States deputy director of the FBI, to be American heroes.\nHe was inspired by their stories and decided to film a recruitment video for ICE since it was looking for agents, and he \"supports it.\"\nWATCH: 'SUPERMAN' ACTOR DEAN CAIN BECOMES ICE AGENT TO SUPPORT 'VILIFIED' OFFICERS ENFORCING IMMIGRATION LAW\n\"I know it's controversial, but I support what they're doing. It's controversial because people look at it emotionally as opposed to what the law is and what we're trying to do here. And then they don't look at it critically and think, you know, ‘What does allowing 20 million people into this country illegally do to voting, to our services, our health support services, our social services?’ It destroys it,\" he said.\n\"Social Security, Medicaid, it just destroys everything that we have worked for and built in this country for American citizens. As compassionate as we wanna be, we can't take in everybody.\"\nWATCH: DEAN CAIN 'PROUD' TO BE AMONG THE 'PATRIOTS' WHO STEPPED UP TO JOIN ICE\nCain will be sworn in as an \"honorary ICE Officer\" in the coming month, Assistant Secretary Tricia McLaughlin, the Department of Homeland Security’s spokesperson, said Thursday. It wasn’t immediately clear what his duties as an honorary officer would entail.\nCain told Fox News Digital he's just happy to be showing his support to the \"brave\" men and women tackling immigration issues in America.\nThe actor has his own opinions on how he wants to see the immigration system in America evolve.\n\"So, first of all, we can expand the number of people who come in. We have a million people who are allowed in every year. We could expand that number and change the criteria,\" he said.\nCain pointed out that America's current immigration system is full of \"weird programs,\" including a lottery, and praised President Donald Trump's $5 million gold card that streamlines American citizenship as a good option for the country.\nWATCH: DEAN CAIN SHARES WHAT HE WANTS TO SEE CHANGE IN IMMIGRATION POLICY\n\"I think merit is a huge part of it. What do you bring to the United States? How do you make this country better? What are you going to bring? What are you going to do? It's like that $5 million gold card or whatever that is that President Trump put through.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"Those people will contribute to everybody, and that does flow to everybody. When that money is here in the United States and those jobs are here in the United States, that flows to everybody. So, I would like to see that open up, that meritocracy open up, and I would like to see a more streamlined process where it doesn't take someone seven years to come over legally,\" Cain said.\nCain noted that a major point in Trump's presidential campaign was immigration. He ran on deporting illegal immigrants, and Cain is pleased with how his administration has been handling the issue, but he would like to see legislation passed.\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\n\"I'm very happy with what's going on in this administration. I'd like to see them fix the immigration situation. That would be great if someone introduced legislation to change our immigration system, to fix it. I would love to see that. I don't see that.\nCLICK HERE TO GET THE FOX NEWS APP\n\"All I hear is, I see people running away from Congress, getting on a plane so they don't have to vote, screaming at this, screaming at that, but not doing anything. So, I'd like to see some immigration reform take place,\" Cain said.\nThe Associated Press contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/media/dean-cain-fires-back-after-john-oliver-insults-ice-criticism",
      "text": "Former \"Superman\" actor Dean Cain ridiculed \"Last Week Tonight\" host John Oliver on Monday over his monologue claiming Immigration and Customs Enforcement (ICE) was \"f---ed\" if they let the actor join its ranks.\nNear the end of his show on Sunday, Oliver mocked both ICE and Cain over news that ICE had removed its age limits and would be swearing in the \"Lois & Clark: The New Adventures of Superman\" star as an \"honorary ICE officer.\"\n\"You know, there's an old saying in Hollywood: ‘If all you can get is Dean Cain, you are f---ed,’\" Oliver said on his show.\n\"Now, I'm not saying that ICE isn't finding people. I'm just saying, when you are reduced to pinning a badge on the 59-year-old star of 'The Dog Who Saved Christmas,' 'The Dog Who Saved Christmas Vacation,' 'The Dog Who Saved the Holidays,' 'The Dog Who Saved Halloween,' 'The Dog Who Saved Easter,' and 'The Dog Who Saved Summer,' maybe you are in trouble.\"\nHe added, \"Although, on the plus side, no need for that guy to wear a mask because the chances of anyone recognizing him are f---ing zero.\"\nCain mocked the HBO host in kind on X the next morning.\n\"He stole that mask joke from the internet -- and he also laughed hysterically when Trump said he was going to run for President. Case closed. (and those movies were sweet, by the way!),\" Cain wrote.\nDuring the show, Oliver also gave advice to viewers on how to interact with ICE agents, telling them to only say \"Am I free to leave?\" and \"I want to speak to a lawyer.\"\n\"And I recognize that in some cases you may be unable to help yourself from saying, 'Didn’t you used to be Superman? I thought you died. I can’t believe I’m meeting a filmmaker,’ but that really is it,\" Oliver joked.\nFORMER SUPERMAN ACTOR DEAN CAIN SWORN IN AS RESERVE POLICE OFFICER\nCain will be sworn in as an honorary officer in the coming month, assistant secretary Tricia McLaughlin, the Department of Homeland Security’s spokesperson, said. Although it wasn’t immediately clear what his duties as an honorary officer would entail.\nIn an interview with Fox News Digital, Cain described joining ICE as a way to show support for the officers that he believes were being \"vilified\" for doing their jobs.\n\"If you're a legal citizen here in this country, no worries, you're great, but if you're here illegally, you've broken the law to begin with, whatever the circumstances are. You had multiple opportunities to self-deport, and the fact that these men and women who are doing their jobs are getting vilified, I had to stand up with them and for them, because I think it takes people standing up to change the culture,\" Cain said.\nCain also defended joining ICE during a heated debate with anti-Trump The Bulwark host Tim Miller on \"Piers Morgan Uncensored\" on Monday.\n\"Now we've got ICE agents — and, apparently, former ‘Superman’ actors — who are going to jump out of vans and nab them and hold them in deportation cells. That's insane. Like, that's not how you act in a free country,\" Miller mocked.\nCLICK HERE TO GET THE FOX NEWS APP\n\"I'm not untrained,\" Cain shot back, bringing up how he became a deputy sheriff and a reserve police officer nearly a decade ago.\n\"So, I don't know why you're saying untrained. And by the way, when you join ICE, they train you. So, to say that and try to denigrate because I'm an actor, I shouldn't be able to be concerned about what's going on with our borders or with our law enforcement agencies is denigrating. It's ridiculous. Should I say because you're a former Republican strategist, you have no say on anything? That's baloney,\" he added.\nFox News' Janelle Ash and Larry Fink contributed to this report."
    },
    {
      "url": "http://foxnews.com",
      "text": "COMMAND CONFUSION DC police chief ripped for 'mind-blowing' response to basic policing question 5 min read\nMIC CHECK entertainment Singer halts show to call a mom out over 'irresponsible' act with baby at concert 3 min read\nGEAR GRIPES sports 'Looks like a damn spaceship': Aaron Rodgers battles NFL helmet rules before season 3 min read\nPUBLIC PRESSURE Cincinnati officials demand charges for White man in viral downtown assault 4 min read\nDOUBLE BLOW sports Heartbreak for NFL receiver as second consecutive season lost to knee injury 3 min read\nDEADLY DELUSION Father's guns used in deadly CDC rampage as shooter's manifesto reveals motive 6 min read\n'FREEDOM TIME' Former first daughter ends marriage with social media post about 'new beginnings' 3 min read\nOUTKICK RILEY GAINES: Trump's 'Saving College Sports' executive order is exactly what America's athletes need\nZelenskyy not invited to Trump-Putin talks — White House says this was the reason WHITE HOUSE 2 min read\nTexas Dems crack, confirm return to state after fleeing to block redistricting: report TEXAS 3 min read\n'Morning Joe' host reveals what liberal reporters say about DC crime behind closed doors MEDIA 4 min read\nWhite House reacts to Dem whistleblower’s ‘bombshell’ claim Schiff leaked to hit Trump DONALD TRUMP 5 min read\nWoman 'kicked the s---' out of knife-wielding intruder miles from Idaho murders BRYAN KOHBERGER 7 min read\n‘Unfit and unlawful’: ICE detention center hit with emergency restraining order IMMIGRATION 4 min read\nNewly released video shows Uvalde parents pleading with police as gunman opened fire CRIME 4 min read\nentertainment Country star taken to hospital in ambulance after food prep goes terribly wrong COUNTRY 4 min read\nentertainment Former Playboy model Shanna Moakler wows fans with cowgirl-inspired bikini photos ENTERTAINMENT 3 min read\nfood Bronze jars from ancient Greek settlement reveal surprising food preservation FOOD-DRINK 5 min read\nhealth The skin cancer that killed Kelly Clarkson’s ex can strike quietly and spread fast HEALTH 5 min read\nhealth Father makes son do push-ups for disrespecting mom as expert warns of 'red flag' PARENTING 5 min read\nentertainment Angelina Jolie reportedly ready to flee California once her youngest children turn 18 ENTERTAINMENT 4 min read\nsports Ex-Astros star Alex Bregman crushes historic homer in first at-bat back in Houston MLB 3 min read\nControversial past of activist leading charge against Trump's DC crime plan revealed POLITICS 6 min read\nANTISEMITISM EXPOSED Trump administration closing in on massive Harvard payout after antisemitism battle\nentertainment Nicola Peltz Beckham honors mother at vow renewal while David and Victoria miss ceremony CELEBRITY MARRIAGES 6 min read\nsports Mets slugger crushes his way into franchise history with 253rd career home run NEW YORK METS 4 min read\nopinion Girl wearing American flag shirt confronted at summer camp. This shouldn’t be happening OPINION 3 min read\nFOX Nation debuts series exploring John Dillinger and America’s infamous outlaws FOX NATION 4 min read\nBiohacker warns America is ‘micro-poisoning’ itself despite spending $5 trillion on healthcare every year\nDEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC\nNew poll exposes trouble for rivals in heated NYC mayoral race as one candidate takes commanding lead\nMAGA-ousted Dem senator from key swing state launches comeback campaign after losing seat in 2024: report\nAs Trump intervenes in DC's crime crisis, another violent city's DA gets a challenger from inside the tent\nFounding Father’s historic property in Boston tourist district hits market with one intriguing secret\nThe next big tax threat, Sydney Sweeney makes advertising great again, and more from Fox News Opinion\nDEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC\nSurveillance video captures moment heroic stranger saves 6-year-old Florida boy sinking to bottom of pool\nCountry star Zac Brown credits military with providing 'American dream' as he's honored for work with veterans\nWho is Quornelius Radford? The Army sergeant accused of shooting 5 soldiers at Fort Stewart in Georgia\nPentagon drawing up quick reaction force of National Guard ready to quell civil unrest at any moment: report\nVictoria, David Beckham appear to be absent from Brooklyn, Nicola Peltz’s vow renewal as rift rumors persist\nRed Sox's Alex Bregman makes history in return to Astros home ballpark, drawing cheers and jeers from fans\nTikTok influencer's husband placed sports bet just before 3-year-old son drowned in family pool: police\nVictoria, David Beckham appear to be absent from Brooklyn, Nicola Peltz’s vow renewal as rift rumors persist\nAngelina Jolie planning to sell LA home and move abroad after Brad Pitt custody restrictions lift: report\nHostility against churches a 'growing trend,' as study finds hundreds of attacks on U.S. churches in 2024\nArchaeologists uncover ancient blade factory tied to major group in the Bible: 'Exceptional individuals'\nDisaster declared in Alaska's capital due to 'catastrophic flooding' threat from glacial lake outburst\nEx-Harris aide argues more police won’t make streets safer, citing experience as a ‘Black woman in America’\nDEA head says phone calls are coming from 'all over the country’ from fed agents wanting to help in DC\nJohn Oliver has renewed 'anxiety' as an immigrant with Trump return to office, despite US citizenship\nJohn Oliver has renewed 'anxiety' as an immigrant with Trump return to office, despite US citizenship"
    },
    {
      "url": "https://www.foxnews.com/media/john-leguizamo-torches-dean-cain-loser-joining-ice-superman-actor-offers-gentle-reply",
      "text": "Actor John Leguizamo slammed former Superman actor Dean Cain as a \"loser\" after Cain announced that he is planning on becoming an Immigration and Customs Enforcement (ICE) agent on Fox News's \"Jesse Watters Primetime\" on Wednesday.\nThe \"Moulin Rouge!\" actor posted a video to his Instagram account on Friday, torching Cain's decision to join ICE and calling the former \"Superman\" star a \"moron.\"\n\"What kind of loser volunteers to be an ICE officer?\" Leguizamo questioned. \"What a moron. Dean Cain, your pronouns are has/been.\"\nThe actor responded to Leguizamo's criticisms of him on X, issuing a gentle reply to the \"Ice Age\" actor's harsh words.\n\"He’s a good actor— I like his stuff,\" Cain posted in response to an article from The Hollywood Reporter detailing Leguizamo's criticisms of him.\nCain rose to fame in the 1990s with his performance as Clark Kent on the TV show \"Lois & Clark: The New Adventures of Superman.\"\nDuring an interview with Fox News Digital, the \"Superman\" actor explained that his motive to join ICE is the same as when he decided to get involved in law enforcement nearly a decade ago — to protect and serve the American people.\n\"Our ICE agents, who are amazing men and women, are incredible. And they're black, and they are brown and green and yellow and Japanese and whatever. They're a cross-section of Americans,\" he told Fox News Digital. \"They are doing their job, the job that Congress wrote the laws for them to support and uphold, and they're doing the job of deporting people who are here illegally.\n\"If you're a legal citizen here in this country, no worries, you're great, but if you're here illegally, you've broken the law to begin with, whatever the circumstances are. You had multiple opportunities to self-deport, and the fact that these men and women who are doing their jobs are getting vilified, I had to stand up with them and for them because I think it takes people standing up to change the culture,\" Cain said.\nCLICK HERE FOR MORE COVERAGE OF MEDIA AND CULTURE\nAs noted by The Hollywood Reporter, Cain recently made headlines for his critical take on James Gunn's adaptation of \"Superman,\" expressing concern over the director's comments claiming that \"Superman is the story of America … an immigrant that came from other places and populated the country.\"\n\"How woke is Hollywood going to make this character?\" Cain asked during an interview with TMZ. \"How much is Disney going to change their Snow White? Why are they going to change these characters to exist for the times?\"\nCLICK HERE TO GET THE FOX NEWS APP\nFox News' Janelle Ash and Larry Fink contributed to this report."
    },
    {
      "url": "https://www.foxnews.com/entertainment/dean-cain-exposes-sexual-harassment-plagued-him-during-lois-clark",
      "text": "Dean Cain, this week, claimed that he once faced serious sexual harassment on the set of \"Lois & Clark: The New Adventures of Superman.\"\nThe 58-year-old, who played Superman in the 1990s series, told Variety: \"I could have had the biggest sexual harassment lawsuit in Hollywood history.\"\nCain didn’t elaborate on the alleged harassment, but Variety reported that it took a toll on his relationship with his then-volleyball star girlfriend Gabrielle Reece.\n\"There were always murmurs,\" Variety added of the harassment allegations, noting that the show ended abruptly after the fourth season on a cliffhanger when Cain was set to direct several episodes, which \"evaporated.\"\nTYLER PERRY SUED FOR $260M BY ACTOR CLAIMING SEXUAL HARASSMENT AND ASSAULT\nCain added that \"Lois & Clark\" was quite risqué, but he loved working with co-star Teri Hatcher.\n\"Teri Hatcher and I were making out all the time in beds, half clothes on, half off,\" he said of working with Hatcher, who played Lois Lane in the 1993 to 1997 series.\n\"Teri was the best Lois Lane of all time, in my opinion,\" he added. \"She just drove the show.\"\nCLICK HERE TO SIGN UP FOR THE ENTERTAINMENT NEWSLETTER\nCain said, though, that he didn’t mind being focused on as a sex symbol.\n\"Any guy who tells you he feels bad being objectified, I mean, really? Come on,\" he said. \"It’s a wonderful compliment.\"\nThe actor, who once had a brief foray into professional football before his acting days, said \"Lois & Clark\" was \"more money than I had ever seen in my life.\"\n\"My entire contract for the Buffalo Bills was equal to a couple episodes of ‘Lois & Clark,’\" he added.\nBut the work week was exhausting, beginning at 6 a.m. on Monday and finishing at 7 a.m. on Saturday, he said.\nLIKE WHAT YOU’RE READING? CLICK HERE FOR MORE ENTERTAINMENT NEWS\n\"We called it Fraturday!\" Cain joked. \"There was no time to work out, because they couldn’t give me a workout clause, because then they’d have to for every other star and then it sets precedent for Warner Bros. That’s why I haven’t done a series since. It feels like suffocating. You feel claustrophobic.\"\nHe also said he didn’t get all the pay he deserved.\n\"I didn’t know enough back then about residuals,\" he explained, before alleging: \"Warner Bros. buries the bodies deep and makes it look like it’s lost money. There’s no possible way. But I should have sued.\n\"George Clooney did it. He sued on ‘ER’ and got a big payout for his participation. I was advised not to because ‘You don’t want to bite the hand that feeds you.’\"\nCLICK HERE TO GET THE FOX NEWS APP\nFox News Digital has reached out to Warner Brothers and Cain for comment."
    }
  ],
  "argos_summary": "Dean Cain, the former 'Superman' actor, faced ridicule from John Oliver after it was announced he would become an honorary ICE officer, with Oliver joking about Cain's career and recognition. In response, Cain defended his decision to join ICE, stating it was to support officers he believes are vilified for their work enforcing immigration laws. Cain also expressed his views on immigration reform and criticized Hollywood's portrayal of characters, while facing backlash from fellow actor John Leguizamo, who called him a 'loser' for his choice.",
  "argos_id": "FRH6YCCKZ"
}