{
  "url": "https://www.marketwatch.com/story/u-k-s-labor-market-continues-to-loosen-2nd-update-97bc21e9",
  "authorsByline": "",
  "articleId": "7f713f2c879646869466243ecf457f2b",
  "source": {
    "domain": "marketwatch.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "San Francisco",
      "city": "San Francisco",
      "coordinates": {
        "lat": 37.7790262,
        "lon": -122.419906
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:51:00+00:00",
  "addDate": "2025-08-12T07:58:29.599186+00:00",
  "refreshDate": "2025-08-12T07:58:29.599188+00:00",
  "score": 1.0,
  "title": "U.K.'s Labor Market Continues to Loosen -- 2nd Update",
  "description": "U.K.'s Labor Market Continues to Loosen -- 2nd Update",
  "content": "The U.K.'s jobs market continued to cool in the second quarter as businesses grappled with an increase in employment taxes, uncertainty about the outlook for trade, and cautious consumers.\n\nThe unemployment rate rose to 4.7% in the three months to June, from 4.5% in January to March, while the number of workers on payrolls fell by 26,000 between May and June, the Office for National Statistics said Tuesday.\n\nEarly estimates showed payrolls fell by another 8,000 in July, it added, a smaller decline but nevertheless marking an eighth monthly fall in the past nine months. Vacancies fell by 5.8% to around 718,000.\n\nThe latest data reinforces concerns that higher labor costs prompted by new payroll taxes introduced by the government in April have dented the jobs market.\n\nThis came after a separate report published Monday by KPMG and the Recruitment & Employment Confederation showed the availability of staff rose at the quickest pace since the survey began in 1997 and starting salaries rose at the weakest rate in nearly four-and-a-half years.\n\nRecruiters mentioned that hiring activity had fallen due to weak confidence around the economic outlook and greater pressure on budgets due to recent increases in payroll costs, the report said.\n\n\"Global uncertainty, tax increases and new employment legislation are all having an impact on hiring intentions, with firms now much more cautious about creating new jobs or backfilling roles when somebody leaves,\" said Matthew Percival, a director at the Confederation of British Industry.\n\nThe Bank of England noted at its monetary-policy meeting last week that underlying wage pressures were continuing to ease, although a recent rise in inflation could push wages higher.\n\nAverage weekly earnings excluding bonuses rose 5.0% on year in the three months to June, the same rate as in May, matching consensus expectations of economists polled by The Wall Street Journal.\n\nThe central bank cut its key rate by a quarter-point at the meeting, although more policymakers voted to keep rates on hold than had been expected, putting a further rate cut later this year in the balance.\n\nPrivate-sector wage growth is still set to ease later this year, which will offer the BOE the chance to cut rates again in November, ING economist James Smith said in a note to clients.\n\n\"That remains our base case, though after last week's surprisingly hawkish meeting, were we to get a combination of better jobs data and hotter-than-expected inflation data, the bank may well prefer to remain on hold until the new year,\" he added.\n\nHowever, the BOE has complained that it is sometimes flying blind when it comes to assessing the labor market, given the ONS has struggled in the past to give accurate data on how many people are active in the workforce. In common with the U.S.'s Bureau of Labor Statistics, response rates to the ONS's jobs surveys declined sharply after the pandemic.\n\nBOE Gov. Andrew Bailey said last week there was no substitute for the ONS's Labour Force Survey, which includes the headline unemployment rate, on participation rates. \"It's the one area where you can't easily substitute with other things,\" he said.\n\nLooking ahead, economic uncertainty over international trade could hinder hiring, despite the U.K. agreeing on a relatively favorable tariff deal with the U.S. Second-quarter GDP data due to be published Thursday is expected to show a sharp slowdown from the fast clip of the early part of 2025, dragged by lower exports.\n\nBritish businesses are also contending with rising energy costs, and consumers who remain wary about spending, contributing to the U.K.'s high savings rate. New taxes as part of a government budget in the fall could also add to hiring caution among firms.\n\nOnly a quarter of firms expect to boost their workforce over the next three months, the British Chamber of Commerce said in its quarterly recruitment outlook in July.",
  "medium": "Article",
  "links": [],
  "labels": [
    {
      "name": "Roundup"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "response rates",
      "weight": 0.07530124
    },
    {
      "name": "rates",
      "weight": 0.074584335
    },
    {
      "name": "participation rates",
      "weight": 0.07325035
    },
    {
      "name": "new payroll taxes",
      "weight": 0.07218894
    },
    {
      "name": "new jobs",
      "weight": 0.07105993
    },
    {
      "name": "better jobs data",
      "weight": 0.06974895
    },
    {
      "name": "rising energy costs",
      "weight": 0.06523504
    },
    {
      "name": "New taxes",
      "weight": 0.063052855
    },
    {
      "name": "payroll costs",
      "weight": 0.06147366
    },
    {
      "name": "higher labor costs",
      "weight": 0.06084198
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.97998046875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.64208984375
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.63525390625
    }
  ],
  "sentiment": {
    "positive": 0.04934415,
    "negative": 0.8725132,
    "neutral": 0.07814264
  },
  "summary": "The UK's job market continued to cool in Q2, with the unemployment rate rising to 4.7% from 4.5% and the number of workers on payrolls fell by 26,000 between May and June. This is the eighth monthly fall in the past nine months, according to the Office for National Statistics. The data reinforces concerns that higher labor costs from new payroll taxes introduced by the government in April have negatively impacted the jobs market. The Bank of England noted that underlying wage pressures were continuing to lessen, but a recent rise in inflation could push wages higher. Private-sector wage growth is expected to ease later this year, allowing the BOE the chance to cut rates again in November. Looking ahead, uncertainty over international trade could hinder hiring, despite agreeing a relatively favorable tariff deal with the U.S.",
  "shortSummary": "The U.K's job market continues to cool due to higher employment costs, economic uncertainty, and consumer cautiousness, with potential rate cuts expected later.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "81a9312aa55c448b8db8fbc606464b59",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The U.K. job market is experiencing a slowdown, with the unemployment rate rising to 4.7% and payrolls decreasing by 26,000 from May to June, continuing a trend of declining employment. Factors contributing to this trend include increased employment taxes, economic uncertainty, and cautious consumer behavior. Despite a rise in average weekly earnings, hiring activity is down, with only a quarter of firms anticipating workforce growth in the coming months, as businesses face pressures from rising costs and a challenging economic outlook.",
  "argos_id": "FXV2NGOYV"
}