{
  "url": "https://www.washingtontimes.com/news/2025/aug/12/little-league-world-series-teams-share-drama-road-williamsport/",
  "authorsByline": "Amanda Vogt, The Washington Times https://www.washingtontimes.com",
  "articleId": "054a681b8e794fd7a7f090f435a58f7f",
  "source": {
    "domain": "washingtontimes.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "DC",
      "city": "Washington",
      "coordinates": {
        "lat": 38.8949924,
        "lon": -77.0365581
      }
    }
  },
  "imageUrl": "https://twt-thumbs.washtimes.com/media/image/2025/08/12/Little_League_World_Series_Baseball_07112_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T01:47:26+00:00",
  "addDate": "2025-08-13T02:01:58.935978+00:00",
  "refreshDate": "2025-08-13T02:01:58.935980+00:00",
  "score": 1.0,
  "title": "Little League World Series teams have had their share of drama on road to Williamsport",
  "description": "The road to Williamsport was filled with more drama than usual for a couple of Little League World Series participants this year, including a Venezuelan team that needed visa exemptions to make the trip and an American club that narrowly knocked off a defending champ.",
  "content": "SOUTH WILLIAMSPORT, Pa. — The road to Williamsport was filled with more drama than usual for a couple of Little League World Series participants this year, including a Venezuelan team that needed visa exemptions to make the trip and an American club that narrowly knocked off a defending champ.\n\nBaseball’s preeminent youth baseball tournament resumes Wednesday in central Pennsylvania. The festivities begin with a look at what makes the 20-team event special.\n\nESPN aired a documentary called “Big Dreams: Little League World Series 2024” on Tuesday night. The filmmakers had great raw material. Lake Mary, Florida, defeated Taiwan 2-1 in eight tense innings last August to win the title. But director Rudy Valdez wanted to go deeper than wins and losses.\n\n“These are kids, you know, I want you to remember that,” Valdez said. “We’re showing them how to navigate life, and we’re showing them how to take wins and take losses and be good sports and how to get back up when you fall.\n\n“We have to give them the space to learn and I wanted that to be the feeling of this, that you were really navigating this year of the Little League World Series through the eyes and experiences of them.”\n\nThe film was set to premiere Tuesday at 9:30 p.m. on ESPN and is available for streaming through ESPN+.\n\nVenezuela travels to Williamsport on an exemption from travel ban\n\nCardenales Little League from Barquimesto, Venezuela, will represent Latin America for the second straight year, but this time the team required a special exemption from President Donald Trump’s travel ban. The team only learned of the exemption less than a week before its opening game Wednesday at 1 p.m. against Puerto Rico.\n\nCardenales’ exemption came after a different Venezuelan team was denied entry into the United States for the Senior Baseball World Series last month.\n\nThis year’s Cardenales team has a different roster and coaching staff from the 2024 group. Last year’s team survived two rounds in the elimination bracket to advance to the international final. It lost 4-1 to Taiwan but beat Texas for third place.\n\nVenezuela only has two Little League World Series titles, the last 25 years ago.\n\nThe path to Williamsport includes a notable U.S. upset\n\nDefending champion Lake Mary was one out away from making its return to central Pennsylvania, but there will be a different team representing the Southeast Region this year: South Carolina’s Irmo Little League.\n\nIn the regional final, Irmo trailed 4-0 in the bottom of the sixth — the last inning in Little League ball — with the bottom of their lineup headed to the plate and the goal of getting Joe Giulietti, the team’s best hitter, to bat.\n\nIrmo succeeded, but Joe never swung at a pitch. Lake Mary intentionally walked him with the bases loaded to make the score 4-2. Brady Westbrooks was up next and, down to his last strike, he found the fastball he was looking for, hammering a three-run double.\n\nPlayers were running around the stadium, carrying the Southeast Region champions banner, while their manager, Dave Bogan, was brought to tears.\n\n“While we had confidence, we were the underdog,” Bogan said. “When this team was forming, there was a lot of local excitement about our potential and our possibilities. But with that excitement comes pressure and it was a sense of relief that we did it.”\n\nLake Mary previously defeated Irmo 14-0, and before the regional final, Bogan told his players they needed to believe they were “going to shock the Little League baseball world.”\n\nIrmo is only the fourth South Carolina team, and second since 1950, to play in South Williamsport. It’ll play Braintree American Little League, the Massachusetts team representing the New England region, on Thursday.\n\n“Our motto is nothing is given, everything is earned and they really work hard to earn everything through this process,” Bogan said. “They absolutely love to grind.”\n\nTaiwan tries to return to LLWS glory\n\nTaiwan’s 17 Little League World Series championships are the most by any country other than the United States, which always gets a team in the championship because of the way the LLWS brackets are set up.\n\nBut it has been nearly 30 years since Taiwan won its most recent title in 1996.\n\nTen years ago, current manager Min-Nan Lai’s club went 2-2 in the tournament, losing its second game in the double-elimination tournament to Mexico.\n\nNow, Lai is back with the Tung-Yuan Little League team after defeating South Korea in the Asia-Pacific regional final. The 2025 LLWS marks Taiwan’s fourth consecutive and 33rd appearance in tournament history, and its first game will be against Mexico on Thursday.\n\nThe Little League World Series first-round bracket matchups were announced not long before the Asia-Pacific regional tournament, something Lai and his team noted. They wanted to get another chance at the team that ended Taiwan’s chances 10 years ago.\n\n“A famous Taiwanese saying is you always want to do hard work for 10 years for one minute to shine,” Lai said through an interpreter.\n\nTung-Yuan brings strong pitching to South Williamsport and Lai believes this is one of the best teams to represent Taiwan in recent history. Unlike last year’s Taiwan club, his team doesn’t seem to have any issues hitting. In the regional tournament, Taiwan outscored opponents 60-1 in the six games the team won.\n\nTaiwan also boasts five pitchers capable of reaching over 70 mph and Chin-Tse Lin throws at 80 mph, which looks much faster to the hitter because of how close the mound is to home plate. There are pitch count rules in Little League, requiring a certain amount of days rest depending on how many pitches a player throws.\n\nThe Kuei-Shan Little League team from Taoyuan reached the final of the international bracket the past two years but wasn’t able to win it all. Lai hopes for a different result for Tung-Yuan — he wants to bring Taiwan that 18th championship.\n\n“That’s the number one expectation,” Lai said.",
  "medium": "Article",
  "links": [
    "https://www.washingtontimes.com/topics/taiwan/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Little League World Series teams",
      "weight": 0.117402345
    },
    {
      "name": "Little League World Series",
      "weight": 0.10472826
    },
    {
      "name": "Little League",
      "weight": 0.099114366
    },
    {
      "name": "Little League World Series participants",
      "weight": 0.09899977
    },
    {
      "name": "Irmo Little League",
      "weight": 0.096533604
    },
    {
      "name": "Cardenales Little League",
      "weight": 0.09482721
    },
    {
      "name": "Little League ball",
      "weight": 0.093243256
    },
    {
      "name": "Braintree American Little League",
      "weight": 0.08729652
    },
    {
      "name": "two Little League World Series titles",
      "weight": 0.06782327
    },
    {
      "name": "the Little League World Series",
      "weight": 0.06680489
    }
  ],
  "topics": [
    {
      "name": "World Series"
    }
  ],
  "categories": [
    {
      "name": "Sports"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Sports News",
      "score": 0.9912109375
    },
    {
      "name": "/Sports/Team Sports/Baseball",
      "score": 0.84765625
    }
  ],
  "sentiment": {
    "positive": 0.15016048,
    "negative": 0.43695042,
    "neutral": 0.41288915
  },
  "summary": "The road to Williamsport, the Little League World Series, saw more drama this year, including a Venezuelan team that required visa exemptions to make the trip and an American club that narrowly defeated defending champion Lake Mary. The 20-team event, which is the most by any other country other than the United States, resumes in central Pennsylvania on Wednesday. ESPN aired a documentary called \"Big Dreams: Little LeagueWorld Series 2024\" about the unique challenges of the event. The Venezuelan team, Cardenales Little League, required a special exemption from President Donald Trump’s travel ban to make their trip, which was only revealed a week before its opening game against Puerto Rico. South Carolina's Irmo Little League will represent the Southeast Region this year. The defending champion, Lake Mary, defeated Taiwan 2-1 in August.",
  "shortSummary": "The Little League World Series returns in South Williamsport, with notable teams like Venezuela's Cardenales and Irmo from South Carolina making the journey.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "f4f0de10caaa4b26ab443a015b3b38ed",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "The Little League World Series in Williamsport, Pennsylvania, features dramatic stories this year, including a Venezuelan team that received a special visa exemption to participate and an American team, Irmo Little League from South Carolina, that upset the defending champions, Lake Mary, to earn their spot. A documentary titled \"Big Dreams: Little League World Series 2024\" aired on ESPN, highlighting the personal growth and sportsmanship of the young players. Taiwan, with a strong history in the tournament, aims to reclaim its glory after nearly 30 years without a title, bringing a powerful team to compete.",
  "argos_id": "FZQLLT4ZB"
}