{
  "url": "https://www.nasdaq.com/articles/american-integrity-eps-jumps-q2",
  "authorsByline": "The Motley Fool",
  "articleId": "3a8cd21a650b42eca189621ceb62dd5d",
  "source": {
    "domain": "nasdaq.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-13T03:23:00+00:00",
  "addDate": "2025-08-13T04:11:00.926998+00:00",
  "refreshDate": "2025-08-13T04:11:00.926999+00:00",
  "score": 1.0,
  "title": "American Integrity EPS Jumps in Q2",
  "description": "Key PointsNon-GAAP earnings per share of $1.84 exceeded analyst estimates by 9.5% in Q2 2025, driven by strong policy and premium growth.",
  "content": "Key Points\n• None Non-GAAP earnings per share of $1.84 exceeded analyst estimates by 9.5% in Q2 2025, driven by strong policy and premium growth.\n• None GAAP revenue of $74.5 million in Q2 2025 fell well short of the $287.3 million consensus primarily due to extensive use of reinsurance.\n• None The combined ratio rose to 72.9%, reflecting one-time public offering expenses, while policy count surged 49.8% year over year.\n• These 10 stocks could mint the next wave of millionaires ›\n\nAmerican Integrity Insurance Group (NYSE:AII), a Florida-focused property and casualty insurer, released its second-quarter 2025 results on August 12, 2025. The company reported non-GAAP earnings per share of $1.84, beating analyst expectations of $1.68 (non-GAAP), while GAAP revenue of $74.5 million missed the consensus estimate of $287.3 million by a wide margin. This pattern reflects the firm’s business model, which heavily relies on reinsurance. The quarter was marked by surging policy and premium growth, substantial expansion into new Florida markets, and notable one-time expenses tied to its initial public offering. Despite the revenue miss, the company delivered solid growth and underlying profitability (non-GAAP), though adjusted performance metrics provide a clearer view of operations than the headline revenue figure.\n\nAmerican Integrity is a specialist in Florida property insurance, providing homeowners with coverage for risks such as hurricanes and severe weather. Its core business is rooted in writing residential insurance and managing risk through extensive reinsurance arrangements. The company operates almost exclusively in Florida, making it highly sensitive to regulatory changes, weather events, and developments in the state’s insurance market.\n\nRecently, its focus has been on rapid expansion, both organically and by assuming policies from Citizens Property Insurance Corporation—a state-backed insurer. A key to success is maintaining disciplined underwriting, especially as it enters Miami-Dade and Broward counties for the first time in over a decade.\n\nThe second quarter showed a sharp rise in premium volume. Gross premiums written increased 29.5% compared to Q2 2024, and Net premiums earned (GAAP) jumped 63.3%. The surge was driven by growth in both new and renewal business, along with strategic policy take-outs from Citizens. American Integrity assumed 7,372 policies from Citizens, contributing to the strong gain in policies in-force, which reached 399,138—a 49.8% increase over the same period last year. The company highlighted that regulatory approval allowed it to begin writing voluntary insurance in Miami-Dade and Broward, opening up access to a region representing more than a quarter of Florida households.\n\nAcross its insurance operations, the loss ratio, which measures claims paid as a percentage of net premiums earned plus policy fees, was 30.6%. The combined ratio, a critical industry benchmark summing both loss and expense ratios, increased to 72.9%. This rise was due chiefly to $16.5 million in non-recurring expenses connected to the company’s public offering, including stock-based compensation and management buyout costs.\n\nNet investment income increased 40.0% compared to Q2 2024. This improvement was primarily driven by an increase in the size of the investment portfolio, resulting from higher cash and fixed-maturity securities balances. Meanwhile, the purchase of additional reinsurance mirrored the increase in policies and insured values, supporting the company’s risk transfer strategy. Management noted that there were no major insurance claims from catastrophes during the period, a positive for Florida-exposed insurers.\n\nA significant one-time aspect in this quarter was the impact of the IPO, which closed in May 2025. This event led to a $100 million capital injection and a tax status change, which resulted in a deferred tax asset gain of approximately $9.7 million and lowered the reported tax rate to negative 14.1%. Equity nearly doubled compared to the prior year, rising from $162.4 million as of December 31, 2024, to $301.9 million as of June 30, 2025 (GAAP, calendar year basis), strengthening the firm’s capital position as it embarks on further growth in new and existing markets.\n\nForward Outlook and What to Watch Ahead\n\nManagement did not provide explicit financial guidance for upcoming quarters or for fiscal 2025 as a whole. It did, however, stress confidence in continued policy and premium growth, highlighting that the number of policies in-force had already surpassed 400,000 following Q2 2025 thanks to ongoing expansion in high-population Florida counties. Statements acknowledged risks from potential catastrophic events and the importance of maintaining prudent underwriting as growth accelerates.\n\nLooking forward, investors should pay close attention to normalization of expense ratios following the IPO, further clarity on how reinsurance usage will continue to affect GAAP revenue recognition, and the company’s ability to manage loss costs as it scales its presence in recently entered markets. Expansion into hurricane-prone regions presents both significant opportunity and risk. American Integrity Insurance Group does not currently pay a dividend.\n\nRevenue and net income presented using U.S. generally accepted accounting principles (GAAP) unless otherwise noted.\n\nWhere to invest $1,000 right now\n\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 1,060%* — a market-crushing outperformance compared to 182% for the S&P 500.\n\nThey just revealed what they believe are the 10 best stocks for investors to buy right now, available when you join Stock Advisor.\n\nJesterAI is a Foolish AI, based on a variety of Large Language Models (LLMs) and proprietary Motley Fool systems. All articles published by JesterAI are reviewed by our editorial team, and The Motley Fool takes ultimate responsibility for the content of this article. JesterAI cannot own stocks and so it has no positions in any stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.",
  "medium": "Article",
  "links": [
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d0f64b7c-2696-4c47-b418-627efaa5ac28&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Darticle_pitch_feed_partners%26ftm_pit%3D17187&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=6bb5a4d8-040d-4984-84a2-b661e2a46adb",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=d0f64b7c-2696-4c47-b418-627efaa5ac28&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-bbn-bn%3Faid%3D8867%26source%3Disaeditxt0001039%26ftm_cam%3Dsa-bbn-evergreen%26ftm_pit%3D17187%26ftm_veh%3Darticle_pitch_feed_partners&utm_source=nasdaq&utm_medium=feed&utm_campaign=article&referring_guid=6bb5a4d8-040d-4984-84a2-b661e2a46adb",
    "https://api.fool.com/infotron/infotrack/click?apikey=35527423-a535-4519-a07f-20014582e03e&impression=de6808a7-03f8-4dc3-8864-0c210fa69fae&url=https%3A%2F%2Fwww.fool.com%2Fmms%2Fmark%2Fe-sa-nonbbn-kp%3Faid%3D10969%26source%3Disaedikp0000070%26ftm_cam%3Dsa-bbn-evergreen%26ftm_veh%3Dkeypoints_pitch_feed_partner%26ftm_pit%3D17996",
    "https://www.fool.com/legal/fool-disclosure-policy/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Florida property insurance",
      "weight": 0.06779163
    },
    {
      "name": "new Florida markets",
      "weight": 0.06523435
    },
    {
      "name": "policies",
      "weight": 0.06478971
    },
    {
      "name": "policy count",
      "weight": 0.064568385
    },
    {
      "name": "policy fees",
      "weight": 0.063641705
    },
    {
      "name": "non-recurring expenses",
      "weight": 0.063370675
    },
    {
      "name": "Non-GAAP earnings",
      "weight": 0.0629858
    },
    {
      "name": "non-GAAP earnings",
      "weight": 0.0629858
    },
    {
      "name": "GAAP revenue",
      "weight": 0.060752466
    },
    {
      "name": "expense ratios",
      "weight": 0.059454314
    }
  ],
  "topics": [
    {
      "name": "Markets"
    }
  ],
  "categories": [
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.98291015625
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.9248046875
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.84814453125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.63916015625
    },
    {
      "name": "/Finance/Insurance/Other",
      "score": 0.5322265625
    }
  ],
  "sentiment": {
    "positive": 0.86097443,
    "negative": 0.03467957,
    "neutral": 0.10434609
  },
  "summary": "American Integrity Insurance Group (NYSE:AII), a Florida-focused property and casualty insurer, reported a 9.5% increase in Q2 2025 earnings per share, exceeding analyst forecasts. The company's revenue of $74.5 million fell short of the $287.3 million consensus due to the extensive use of reinsurance. The combined ratio rose to 72.9%, reflecting one-time public offering expenses, while policy count surged 49.8% year over year. Despite this revenue miss, the company delivered solid growth and underlying profitability (non-GAAP). The company’s net investment income increased 40.0% compared to Q2 2024, driven by an increase in the size of the investment portfolio and increased insurance premiums. The impact of the IPO, which closed in May 2025, led to a $100 million capital injection and a tax status change, resulting in a deferred tax asset gain of approximately $9.7 million and lowered the reported tax rate to negative 14.1%.",
  "shortSummary": "American Integrity Insurance Group's Q2 earnings surged 9.5% to $1.84, driven by strong policy growth and increased reinsurance coverage, despite a revenue miss.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "42c0ad652729470aa5400255c6f55856",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.fool.com/legal/fool-disclosure-policy/",
      "text": "Here at The Motley Fool, when it comes to matters of money, we believe in transparency and accountability. Day in and day out, we dedicate ourselves to delivering responsible investing ideas and sound financial education. That's why, when it comes to talking about stocks, we think it's important that you know exactly where we're coming from. With this in mind, we have developed a company-wide disclosure policy to guide our business and communications. We call it Fool Disclosure. We invite you to take some time to read through it, and hope it helps inform your experience here in Fooldom.\nInvestors Communicating With Investors\nThe Motley Fool is a company that represents investors teaching and learning from other investors. Many financial publications do not permit their writers and editors to own stocks. The Motley Fool not only permits, but also encourages its staff to invest in common stock. Why? Two reasons.\nFirst, we strongly believe the most effective way to create wealth is through the long-term ownership of stocks. The stock market has compounded 10% average annual returns over the last century. We believe in using the stock market as a savings bank, and we strongly encourage treating money management as a lifelong endeavor. Therefore, we think it'd be downright mean of us to close that avenue of investment to our employees.\nSecond, and more important, we don't consider our employees to be journalists, but rather communicators and teachers of financial matters. It's a subtle but critical difference that affects our entire service -- from our online site at Fool.com, to our investment books, to our nationally syndicated newspaper column, to our newsletters and portfolio services. As a company, we utilize every available medium to teach people of all ages, all income levels, all backgrounds, and all genetic codes about money and its applications in modern life. Therefore, we believe our staff's involvement in managing their own money is critical to their learning more about the subject and their succeeding in their own lives. And who better to write about investing than those who do it themselves?\nThe Motley Fool writes about stocks in both free and paid content. We make stock recommendations in our various premium newsletter services and actually hold some of these shares in our portfolio services. We will disclose our recommendation or ownership until we cease to recommend the stock, or we sell our entire position. Of course, in both free and paid content we will continue to disclose whether the author has an interest in the stocks mentioned.\nInternally, the Fool has always strived to operate with the highest levels of integrity and transparency. As such, here are the key components of The Motley Fool's disclosure policy:\nDisclosure\n- When a writer writes about a stock that he or she has a position or beneficial interest in, that fact is disclosed at the end of the article.\n- If The Motley Fool recommends or holds a position in a stock, that fact is also disclosed at the end of the article.\n- All Fool employees and contractors -- that's anyone with a TMF prefix on their screen names -- are required to disclose their current positions, including stocks, mutual funds, and cryptocurrencies. We aggregate and display these positions for the entire company here. (We do not disclose the individual stocks that might be in a Fool's mutual funds.)\n- Affiliates of The Motley Fool provide individualized investment advice and investment products. These companies may recommend or hold securities mentioned in our publications. Editorial personnel have no knowledge of any affiliates' holdings and/or specific recommendations, and the affiliates' personnel have no knowledge of any editorial content before it is published. Our affiliate companies may also have their own disclosure policies, which they may make available on their respective sites.\nTrading Restrictions\nIn addition to the above disclosure requirements, Fool employees work under additional trading restrictions and guidelines. These restrictions require that they:\n- Must hold any stock they own for at least 10 days. (No day trading allowed -- as if we'd want to!)\n- Cannot write about a stock in the period of 2 market days before to 2 market days after purchasing or selling the stock.\n- Must clear trades with our compliance department prior to any transaction.\n- Must notify our compliance department every time they buy or sell a stock, regardless of whether they have written about it.\nInvestors in The Motley Fool\nThe Motley Fool is grateful to the people that have invested in us. The Fool's founders and some family members have invested in the company, and full-time employees receive stock options and/or stock in the company.\nBusiness and Technology Partners\nWe have business relationships with an ever-changing assortment of companies, including technology vendors, leasing companies, data providers, banks, distribution channels, advertisers, landlords, accountants, and the restaurants up the street from Fool HQ. Many of these companies are public companies operating in industries that we follow. There may be instances in which one of our newsletters recommends a company with whom we have a business relationship, or we may write an article about such a company on Fool.com. These occurrences are unintentional and coincidental, as the business end of The Motley Fool has no input or influence on the editorial side of things.\nIt would take too much space to list all the companies that we do business with, and we'd probably forget some anyway, but below are some of our major partners. (This list is most subject to change. We'll update it periodically, but we will not be able to keep pace with the rate of change.)\nInvesting Advertisers\nAs a general rule, if you see ads from a company on our site and emails, that company is paying us for such placement. Some of the major ones include E*Trade, Fidelity, Scottrade, OptionsHouse, and ShareBuilder. Additionally, companies pay us for inclusion in specific areas of our site (e.g., Registration Page, Broker Center).\nMotley Fool Money\nA portion of our site, branded as Motley Fool Money, writes reviews of personal finance products, including credit cards, mortgage offers, and brokerage accounts. We may receive compensation for offers that appear on Motley Fool Money, including compensation related to placement.\nWe may issue recommendations for preferred partners that we believe in and/or use ourselves. But keep in mind, this site may not include all available offers from our partners. For example, there are thousands of credit cards available. We’ll highlight a fraction of them. All picks are made at the editorial discretion of Motley Fool Money editorial team.\nFor a list of major advertisers on Motley Fool Money, click here.\nDistribution Partners\nSome of our major distribution partners include Yahoo! Finance, MSN Money, USA Today, AOL, Nasdaq, and CNN Money.\nNews, Quotes, Data, and Content Providers\nOur major providers include Xignite SIX Financial.\nMajor Service Providers or Other Partners\nSilicon Valley Bank, Slack, Namely, Charles Schwab, Interactive Brokers, Worldpay/Vantiv, and Jones Lang LaSalle.\nIn Conclusion\nWe have designed our disclosure and trading guidelines to serve our community, our customers, and our employees fairly. As always, though, you should remember to consider every piece of investment information you receive, here at the Fool or elsewhere, not as a de facto recommendation, but as an idea for further consideration. Even the strongest disclosure policy in the world does not excuse individuals from taking responsibility for their own decisions. Due diligence, critical thought, and use of the most extraordinary device in the world (the human brain) are crucial to your financial success.\nLast updated November 11th, 2024."
    }
  ],
  "argos_summary": "American Integrity Insurance Group reported strong non-GAAP earnings per share of $1.84 for Q2 2025, surpassing analyst expectations, despite a significant GAAP revenue miss of $74.5 million due to heavy reliance on reinsurance. The company experienced a 49.8% increase in policy count year-over-year, driven by expansion into new Florida markets and strategic policy take-outs from Citizens Property Insurance Corporation. While the combined ratio rose to 72.9% due to one-time IPO expenses, management remains optimistic about continued growth in policies and premiums.",
  "argos_id": "G0H4TX45A"
}