{
  "url": "https://www.yahoo.com/entertainment/articles/jack-osbourne-spotted-public-first-073703734.html",
  "authorsByline": "Devon Forward",
  "articleId": "70770edf7fdc433cb2032bd58eedf05a",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://edgecast-img.yahoo.net/mysterio/api/a3ee0d7c6e06b87b05abee136da3eb636f0f4d5637596a478ef7e84beb6601d2/ynews/resizefill_w1200/https://media.zenfs.com/en/parade_250/9773c02afd0533d78b4bbc8cb74f32db",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T07:37:03+00:00",
  "addDate": "2025-08-12T08:20:34.870444+00:00",
  "refreshDate": "2025-08-12T08:20:34.870446+00:00",
  "score": 1.0,
  "title": "Jack Osbourne Spotted in Public for First Time Since Ozzy Osbourne’s Death",
  "description": "The 39-year-old recently broke his silence following his rocker father's death in July.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nJack Osbourne Spotted in Public for First Time Since Ozzy Osbourne’s Death originally appeared on Parade.\n\nJack Osbourne, the son of the late Ozzy Osbourne and his widow Sharon, was spotted out and about in public for the first time since his father died on July 22.\n\nThe 39-year-old, who finally broke his silence after his father's death on Aug. 6 with a touching tribute to the late rocker, was seen running errands in West Hollywood, Calif.\n\nThe celebrity news agency Backgrid shared a few photos taken during Jack's outing in the sunny California weather, with the father of four wearing a Hawaiian shirt, tan-colored pants, a black baseball cap and sunglasses.\n\nIn a couple of the photos, Jack carried a big bag of dog food. The agency reported that Jack stopped at the Petit Ermitage Hotel before taking his vehicle to Santa Palm Auto Detail. He then reportedly stopped by a liquor store before visiting a pet store, where he likely purchased the food.\n\nThis is the first time Jack has been seen publicly since Ozzy's funeral, and the first casual outing since his death.\n\nRelated: Fans Flood Social Media With \"Wildest\" Moments From Ozzy Osbourne’s Iconic Reality Show After His Death\n\nIn his special tribute to Ozzy shared with fans, Jack opened up about his love for his father, writing, \"He was so many things to so many people, but I was so lucky and blessed to be apart of a very small group that got to call him 'Dad'. My heart is full of so much sadness and sorrow, but also so much love and gratitude.\" He included a video showcasing some of their precious moments together over the years.\n\nAlong with Jack, Ozzy had five other children. He shares Louis, Jessica, and Elliot with his first wife, Thelma Riley, and he welcomed Aimee, Kelly, and Jack with Sharon.\n\nNext: Sharon Osbourne Reveals Ozzy Osbourne’s Final Message About His Fans\n\nJack Osbourne Spotted in Public for First Time Since Ozzy Osbourne’s Death first appeared on Parade on Aug 12, 2025\n\nThis story was originally reported by Parade on Aug 12, 2025, where it first appeared.",
  "medium": "Article",
  "links": [
    "https://www.yahoo.com/entertainment/articles/ozzy-osbournes-rarely-seen-children-182357510.html",
    "https://parade.com/news/jack-osbourne-spotted-public-first-time-since-ozzy-osbourne-death",
    "https://www.yahoo.com/entertainment/articles/sharon-osbourne-reveals-ozzy-osbournes-082933405.html",
    "https://www.yahoo.com/entertainment/articles/ozzy-osbourne-fans-revisit-wildest-210242637.html",
    "https://www.instagram.com/p/DNPCxKBI_Ao/?img_index=1",
    "https://parade.com/celebrities/ozzy-osbourne-children",
    "https://www.yahoo.com/entertainment/articles/80s-hair-metal-icon-sends-083215645.html",
    "https://parade.com",
    "https://www.yahoo.com/entertainment/fans-think-kelly-osbourne-looks-153411228.html",
    "https://www.yahoo.com/entertainment/articles/ozzy-osbournes-final-resting-place-183206620.html"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Jack Osbourne",
      "weight": 0.113822795
    },
    {
      "name": "Ozzy Osbourne",
      "weight": 0.10418449
    },
    {
      "name": "First Time",
      "weight": 0.09225998
    },
    {
      "name": "Jack",
      "weight": 0.09191287
    },
    {
      "name": "Sharon Osbourne",
      "weight": 0.08413138
    },
    {
      "name": "Ozzy",
      "weight": 0.07800067
    },
    {
      "name": "First",
      "weight": 0.07226677
    },
    {
      "name": "first",
      "weight": 0.07226677
    },
    {
      "name": "Ozzy Osbourne’s Death",
      "weight": 0.06518057
    },
    {
      "name": "Ozzy Osbourne’s Iconic Reality Show",
      "weight": 0.06359788
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Entertainment"
    }
  ],
  "taxonomies": [
    {
      "name": "/Arts & Entertainment/Celebrities & Entertainment News",
      "score": 0.990234375
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.927734375
    },
    {
      "name": "/News/Gossip & Tabloid News/Other",
      "score": 0.591796875
    }
  ],
  "sentiment": {
    "positive": 0.2967174,
    "negative": 0.26078355,
    "neutral": 0.44249907
  },
  "summary": "Jack Osbourne, the son of late rocker Ozzy Osbourne and his widow Sharon, was spotted out running errands in West Hollywood, California. This is the first time Jack has been seen publicly since Ozzy's funeral and the first casual outing since his death. Yahoo is using AI to generate takeaways from this article, which may not always match what's in the article. This information may help improve the user's experience.",
  "shortSummary": "Jack Osbourne, son of late Ozzy, was spotted in public for the first time since his death, praising his legacy and highlighting his love for his father.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "60c82d8aefdf42498925ab4e6e0df1c4",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Jack Osbourne was seen in public for the first time since the death of his father, Ozzy Osbourne, on July 22. The 39-year-old was spotted running errands in West Hollywood, wearing casual attire and carrying dog food. Jack had previously shared a heartfelt tribute to his father, expressing his love and gratitude, and this outing marks his first public appearance since Ozzy's funeral.",
  "argos_id": "GAYEPE2BC"
}