{
  "url": "https://www.yahoo.com/news/articles/protests-held-worldwide-over-israel-083555871.html",
  "authorsByline": "Al Jazeera",
  "articleId": "b621f2b1c7ba477caf27bbdcba466e9d",
  "source": {
    "domain": "yahoo.com",
    "paywall": false,
    "location": {
      "country": "us",
      "state": "CA",
      "county": "Santa Clara County",
      "city": "Sunnyvale",
      "coordinates": {
        "lat": 37.3688301,
        "lon": -122.036349
      }
    }
  },
  "imageUrl": "https://media.zenfs.com/en/al_jazeera_289/21aa71b094e12822f7a050b843a7b5a8",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T08:35:55+00:00",
  "addDate": "2025-08-12T09:32:32.252173+00:00",
  "refreshDate": "2025-08-12T09:32:32.252174+00:00",
  "score": 1.0,
  "title": "Protests held worldwide over Israel’s murder of Al Jazeera Gaza journalists",
  "description": "Global protests target Israel and media outlets who have ‘made excuses’ after killing of five Al Jazeera staff in Gaza.",
  "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\n\nYahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience. Generate Key Takeaways\n\nProtests and memorials have erupted worldwide, and calls for accountability are growing after five Al Jazeera staff were assassinated in an Israeli strike on Gaza.\n\nLate on Sunday, an Israeli attack hit a media tent outside the main gate of al-Shifa Hospital in Gaza City, killing Al Jazeera correspondent Anas al-Sharif, 28, along with colleagues Mohammed Qreiqeh, 33, Ibrahim Zaher, 25, Mohammed Noufal, 29, and Moamen Aliwa, 23.\n\nTwo other Palestinians were also killed, bringing the total death toll from the strike to seven.\n\nGaza’s Government Media Office says at least 238 journalists have been killed since Israel’s war on Gaza began in late 2023.\n\nThe latest killings have prompted outrage around the world. In Ramallah in the occupied West Bank, Palestinians filled the streets, waving flags and carrying photographs of the slain reporters.\n\nHundreds rallied in Tunisia, demanding accountability for the attacks. Protests took place in Northern Ireland’s capital, Belfast and Republic of Ireland’s capital, Dublin, while vigils were held in Berlin, Germany and the Netherlands. Earlier demonstrations took place in Washington, DC, as well as London, Oslo and Stockholm.\n\nIn the US capital, Washington, DC, protesters gathered outside a building housing NBC, Fox News, ITN and The Guardian.\n\nDemonstrators were “banging pots and pans, making as much noise as possible” to disrupt live broadcasts happening inside, said Al Jazeera’s Shihab Rattansi, reporting from the scene.\n\n“The demonstrators say their coverage of the genocide in Gaza has given Israel room to kill so many Palestinians and, notably, so many journalists,” he said.\n\n“Their message is: You are no longer the gatekeepers. We know what’s happening in Gaza. We know about the genocide despite your best efforts,” he added.\n\nRattansi said candles were lit for each journalist killed in Gaza, with particular attention given to al-Sharif.\n\nHazami Barmada, one of the organisers of the Washington, DC protest, told Al Jazeera the media organisations had helped to create “public consent for the murder of these journalists … by making excuses for the Israeli government to target and kill them”.\n\nShe added: “After their death, [the media organisations] continue to justify the illegal death, shooting, bombing and murdering journalists, which is a crime against humanity and a war crime.”\n\nPress freedom group PEN America said the killing of the five journalists in Gaza “raises grave concerns” and “could amount to a war crime”.\n\n“This attack not only wiped out an entire team of journalists – at a time when there are fewer and fewer voices able to report from Gaza – but also took six more Palestinian lives in an onslaught that has already claimed thousands of lives,” said Liesl Gerntholtz, managing director of its PEN/Barbey Freedom to Write Center.\n\n“The fact that [Anas] al-Sharif’s family, friends, and colleagues must now defend him from unsupported accusations rather than being able to mourn him and honour his legacy as a journalist adds to the disgraceful nature of this crime,” Gerntholtz added.\n\nPEN America noted that al-Sharif was previously part of a Reuters team that won a Pulitzer Prize in 2024.\n\nElsewhere, an Australian journalists’ union released a statement condemning the “targeted killing of the five Palestinian media workers and the killing of nearly 200 others”.\n\nThe Media, Entertainment and Arts Alliance (MEAA), the largest organisation representing journalists in Australia, said al-Sharif’s “reports brought to the world the reality of the horrors being inflicted by the Israeli Government on the civilians in Gaza”.\n\n“The targeting of journalists is a blatant attack on press freedom, and it is also a war crime. It must stop,” MEAA said, also calling for Israel’s ban preventing international journalists from reporting from Gaza to be lifted.\n\nSeparately, the United Nations condemned the killings, with UN Secretary-General Antonio Guterres calling for an “independent and impartial investigation”, his spokesperson said.\n\nThe killings come as Israel’s Security Cabinet has approved Israeli Prime Minister Benjamin Netanyahu’s plan to expand military operations and occupy Gaza City.\n\nIn November 2024, the International Criminal Court issued arrest warrants for Netanyahu and former Defense Minister Yoav Gallant over alleged war crimes and crimes against humanity in Gaza.",
  "medium": "Article",
  "links": [],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Al Jazeera Gaza journalists",
      "weight": 0.10173573
    },
    {
      "name": "journalists",
      "weight": 0.077296704
    },
    {
      "name": "international journalists",
      "weight": 0.07658594
    },
    {
      "name": "Gaza City",
      "weight": 0.07271918
    },
    {
      "name": "Gaza",
      "weight": 0.071015865
    },
    {
      "name": "Al Jazeera",
      "weight": 0.06768615
    },
    {
      "name": "alleged war crimes",
      "weight": 0.057577446
    },
    {
      "name": "Al Jazeera correspondent Anas al-Sharif",
      "weight": 0.05564941
    },
    {
      "name": "Press freedom group PEN America",
      "weight": 0.052842923
    },
    {
      "name": "Israeli",
      "weight": 0.051362477
    }
  ],
  "topics": [
    {
      "name": "Crime"
    },
    {
      "name": "Social Issues"
    },
    {
      "name": "Protests"
    },
    {
      "name": "Media"
    },
    {
      "name": "Murder"
    }
  ],
  "categories": [
    {
      "name": "General"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Other",
      "score": 0.97509765625
    },
    {
      "name": "/Sensitive Subjects/War & Conflict",
      "score": 0.9716796875
    },
    {
      "name": "/Sensitive Subjects/Death & Tragedy",
      "score": 0.927734375
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.85888671875
    },
    {
      "name": "/News/World News",
      "score": 0.82958984375
    },
    {
      "name": "/Sensitive Subjects/Violence & Abuse",
      "score": 0.498046875
    }
  ],
  "sentiment": {
    "positive": 0.050406393,
    "negative": 0.7653496,
    "neutral": 0.18424392
  },
  "summary": "Protests and memorials have been held worldwide over Israel's murder of five Al Jazeera Gaza journalists, five of whom were assassinated in an Israeli strike on Gaza. The attack targeted a media tent outside the main gate of al-Shifa Hospital in Gaza City, killing Al Jazeera correspondent Anas al-Sharif, along with colleagues Mohammed Qreiqeh, Ibrahim Zaher, 25, Mohammed Noufal, 29, and Moamen Aliwa, 23. The total death toll from the strike, which killed seven journalists, is now seven. Gaza's Government Media Office estimates that at least 238 journalists have been killed since Israel’s war on Gaza began in late 2023. Protests, including demonstrations in the US capital, Washington, DC, and London, Oslo and Stockholm, have taken place. Press freedom group PEN America has criticised the killing of the journalists, stating it could amount to a war crime and could lead to a ban on international journalists from reporting from Gaza.",
  "shortSummary": "Global protests and memorials have been held for five Al Jazeera journalists killed by Israel in Gaza, amid calls for accountability and war crimes.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "7142437d5ca1434eb56a5b62fdc0c7c5",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "Protests and memorials have erupted globally following the assassination of five Al Jazeera journalists in an Israeli strike on Gaza, which has raised calls for accountability and highlighted concerns over press freedom. The attack, which also killed two other Palestinians, has drawn outrage from various organizations and led to demonstrations in cities like Washington, DC, and Dublin, where protesters criticized media coverage that they believe has enabled violence against journalists. PEN America and other groups have condemned the killings as potential war crimes, urging for an independent investigation and emphasizing the need to protect journalists in conflict zones.",
  "argos_id": "GD8NSL1V6"
}