{
  "url": "https://qz.com/tariffs-inflation-cpi-data-trump-goldman-sachs",
  "authorsByline": "Shannon Carroll",
  "articleId": "3a52f4019edd4eaca02916f69eae5649",
  "source": {
    "domain": "qz.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "AZ",
      "county": "Pima County",
      "city": "Tucson",
      "coordinates": {
        "lat": 32.1988848,
        "lon": -110.8218543
      }
    }
  },
  "imageUrl": "https://qz.com/cdn-cgi/image/width=300,quality=85,format=auto/https://assets.qz.com/media/GettyImages-2229644388.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T19:21:39.718000+00:00",
  "addDate": "2025-08-12T19:28:18.053090+00:00",
  "refreshDate": "2025-08-12T19:28:18.053091+00:00",
  "score": 1.0,
  "title": "Why Trump’s tariffs haven’t shown up for consumers — yet",
  "description": "There haven't been sudden spikes at the register, but economists and Fed officials expect prices to rise soon",
  "content": "For months, tariffs have sounded like a distant thunderclap: constant rumbling, no downpour. Prices at the supermarket haven’t jumped in a way that maps neatly onto the headlines; despite all the drama, the economy hasn’t buckled. If anything, the economic story since “Liberation Day” has felt weirdly muted. But the data — and the people who parse it for a living — are still saying that the quiet is the setup. Tariffs are taxes, and taxes don’t stay hidden forever. They work through ports, contracts, and production runs before they hit a cash register. And the experts still think the lag will end. Soon.\n\nThe calm before the storm Goldman Sachs recently did the math on how long the quiet will last. Its economists estimated that, through June, U.S. companies have absorbed a hefty 64% of tariff costs, leaving consumers with a mere 22% and foreign exporters with the remainder. But Goldman’s analysts don’t think the tariff cushion will last. By the end of the year, Goldman predicted, about two-thirds of the tariff cost will be passed to consumers, nudging core PCE inflation toward 3.2%. This smokescreen isn’t accidental. Companies largely front-loaded inventory before tariff changes arrived, building a buffer to hide structural cost shifts.\n\nStill, all summer, policymakers have started talking about tariffs not as a headline, but as a pipeline. “Overall, I expect tariffs to boost inflation by about 1 percentage point over the second half of this year and the first part of next year,” New York Fed President John Williams said in mid-July, adding that the aggregate data so far shows only the “initial effects.” Richmond Fed President Thomas Barkin was blunter: “I do believe we will see pressure on prices,” he said in late June, while noting that earlier readings had shown only “modest effects” from new levies.\n\nThe Fed’s Williams laid out the mechanics: Price increases are already running “well above” trend in tariff-exposed items such as household appliances, luggage, and tableware, and tariff receipts jumped to about 8% of import value by May as earlier stockpiles cleared. He also pointed to a New York Fed survey that found that nearly a third of manufacturers and roughly 45% of service firms fully passed on tariff-related cost increases. The effects, he said, are still early — “but I expect those effects to increase in coming months.”\n\nWhat does that that slow-motion reality look like in practice? First, more visible increases in tariff-exposed goods that had been cushioned by earlier shipments — appliances and household furnishings are the textbook categories, but think broader: travel gear, tableware, certain electronics, select auto parts. The more a category is exposed to higher tariffs, the higher its prices have risen relative to the trend this year. Second, fewer workarounds. Some companies have successfully rerouted supply chains or leaned on alternative suppliers to mute the impact. As those channels crowd and exemptions fade, the price umbrella lifts. Third, psychology. Retailers can only stagger increases for so long before they reset list prices (rather than relying on half-measures such as shrinkflation).\n\nOne tell over the next few months will be the composition of inflation. The July report’s stability at the headline level gave everyone relief; the uptick in core CPI was the rain cloud. Tariffs may not be showing up in a single headline number, but they’re already rewriting the script. As tariff-sensitive goods broaden, the core’s center of gravity can shift in a way that is hard for the Fed to dismiss, especially if a slower job market starts to amplify consumer sensitivity. The historical record says households will pay eventually; Goldman is waving a flag that “eventually” is on the calendar, not the horizon. If core prices start climbing the way history and data suggest, the Fed may have to choose between two losing plays: fighting inflation with politically unpalatable hikes or pretending this is just another blip.",
  "medium": "Article",
  "links": [
    "https://www.aeaweb.org/articles?id=10.1257%2Fjep.33.4.187",
    "https://budgetlab.yale.edu/research/state-us-tariffs-july-23-2025",
    "https://www.reuters.com/business/feds-musalem-there-are-risks-now-both-inflation-jobs-goals-2025-08-08/",
    "https://www.goldmansachs.com/insights/articles/us-earnings-will-start-to-show-the-impact-of-trumps-tariffs",
    "https://qz.com/cpi-report-july-inflation-tariffs-trump-bls",
    "https://www.newyorkfed.org/newsevents/speeches/2025/wil250716",
    "https://qz.com/us-consumers-to-absorb-most-tariff-costs-goldman-sachs",
    "https://www.richmondfed.org/publications/research/economic_brief/2025/eb_25-29",
    "https://truthsocial.com/@realDonaldTrump/posts/115016246479417087",
    "https://www.reuters.com/business/feds-barkin-says-tariffs-will-start-pushing-up-inflation-2025-06-26",
    "https://qz.com/july-job-report-warning-sign-73000-jobs-added",
    "https://www.bls.gov/news.release/cpi.nr0.htm?utm_source=chatgpt.com"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "tariff costs",
      "weight": 0.09606402
    },
    {
      "name": "higher tariffs",
      "weight": 0.09052774
    },
    {
      "name": "Tariffs",
      "weight": 0.09018682
    },
    {
      "name": "tariffs",
      "weight": 0.09018682
    },
    {
      "name": "tariff changes",
      "weight": 0.08944447
    },
    {
      "name": "tariff receipts",
      "weight": 0.08905642
    },
    {
      "name": "core prices",
      "weight": 0.07510224
    },
    {
      "name": "Price increases",
      "weight": 0.07505679
    },
    {
      "name": "New York Fed President John Williams",
      "weight": 0.06858351
    },
    {
      "name": "New York Fed",
      "weight": 0.06834669
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Economy News",
      "score": 0.994140625
    },
    {
      "name": "/News/Politics/Other",
      "score": 0.853515625
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.7763671875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.76123046875
    },
    {
      "name": "/People & Society/Social Sciences/Economics",
      "score": 0.7431640625
    },
    {
      "name": "/Business & Industrial/Shipping & Logistics/Import & Export",
      "score": 0.7021484375
    },
    {
      "name": "/News/Business News/Fiscal Policy News",
      "score": 0.38427734375
    },
    {
      "name": "/People & Society/Social Sciences/Political Science",
      "score": 0.361083984375
    },
    {
      "name": "/Law & Government/Government/Other",
      "score": 0.3369140625
    }
  ],
  "sentiment": {
    "positive": 0.3241577,
    "negative": 0.34882542,
    "neutral": 0.32701683
  },
  "summary": "The economic impact of President Donald Trump's tariffs on the U.S. has been felt muted, with prices at the supermarket not significantly increasing. Goldman Sachs estimates that by the end of the year, about two-thirds of the tariff cost will be passed to consumers, pushing core PCE inflation toward 3.2%. The company's economists estimate that through June, U.K. companies have absorbed 64% of tariff costs, leaving consumers with only 22% and foreign exporters with the remainder. Goldman's analysts believe this will last, and the Fed may have to choose between fighting inflation with politically motivated measures. The New York Fed President, John Williams, expects tariffs to boost inflation by about 1 percentage point over the second half of this year and the first half of next year. However, Richmond Fed President Thomas Barkin expects pressure on prices, while others believe inflation will increase. The composition of inflation will determine the future of inflation over the next few months.",
  "shortSummary": "Despite the Trump administration’s tariffs, consumer prices haven’t surged due to early impacts, with gradual increases expected, despite initial signs of inflationary effects.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "8ab8aa07d96940d38d6f205bc281cb37",
  "places": [],
  "scraped_sources": [
    {
      "url": "https://www.aeaweb.org/articles?id=10.1257%2Fjep.33.4.187",
      "text": "Journal of Economic Perspectives\nISSN 0895-3309 (Print) | ISSN 1944-7965 (Online)\nThe Impact of the 2018 Tariffs on Prices and Welfare\nJournal of Economic Perspectives\n(pp. 187–210)\n(Complimentary)\nAbstract\nWe examine conventional approaches to evaluating the economic impact of protectionist trade policies. We illustrate these conventional approaches by applying them to the tariffs introduced by the Trump administration during 2018. In the wake of this increase in trade protection, the United States experienced substantial increases in the prices of intermediates and final goods, dramatic changes to its supply-chain network, reductions in availability of imported varieties, and the complete pass-through of the tariffs into domestic prices of imported goods. Therefore, the full incidence of the tariffs has fallen on domestic consumers and importers so far, and our estimates imply a reduction in aggregate US real income of $1.4 billion per month by the end of 2018. We see similar patterns for foreign countries that have retaliated with their own tariffs against the United States, which suggests that the trade war has also reduced the real income of these other countries.Citation\nAmiti, Mary, Stephen J. Redding, and David E. Weinstein. 2019. \"The Impact of the 2018 Tariffs on Prices and Welfare.\" Journal of Economic Perspectives 33 (4): 187–210. DOI: 10.1257/jep.33.4.187Additional Materials\nJEL Classification\n- D72 Political Processes: Rent-seeking, Lobbying, Elections, Legislatures, and Voting Behavior\n- E23 Macroeconomics: Production\n- E31 Price Level; Inflation; Deflation\n- F13 Trade Policy; International Trade Organizations\n- L14 Transactional Relationships; Contracts and Reputation; Networks"
    },
    {
      "url": "https://www.richmondfed.org/publications/research/economic_brief/2025/eb_25-29",
      "text": "Why Predicted and Actual Tariff Rates Diverged in May 2025\nKey Takeaways\n- The predicted average effective tariff rate (AETR) for May 2025 was 17.5 percent, but the actual AETR was only 8.7 percent. This large gap motivated a systematic decomposition of the sources of divergence.\n- Shifts in importer behavior — such as changes in sourcing strategies and product composition — account for part of the gap. In particular, imports from China and other high-tariff countries fell sharply, while imports from lower-tariff countries like Vietnam increased.\n- The largest factor seems to be implementation frictions. Many country-product pairs that were expected to be tariffed either generated no duties or much lower-than-expected collections, likely due to legacy exemptions, shipping timing and delays in customs system updates.\nIn May, the average effective tariff rate (AETR) implied by announced tariff policies — which I call the \"predicted AETR\" — stood at 17.5 percent. Yet, the actual AETR calculated from the Census Bureau's May trade data was just 8.7 percent. This 8.8-percentage-point gap raises important questions about how tariffs are implemented and how businesses respond to policy changes. This article uses detailed product-level and country-level trade and tariff data to unpack the sources of this discrepancy.\nI find that part of the gap reflects real shifts in importer behavior, including changes in sourcing strategies and product composition. For instance, importers moved away from heavily tariffed goods, or they switched to suppliers in lower-tariff countries, such as Vietnam.\nYet, the dominant factor behind the gap was implementation frictions. Many goods that were expected to face high tariffs either generated no duties or yielded much lower-than-anticipated collections. These shortfalls likely reflect a mix of legacy exemptions, shipment timing issues, deferred payments and delays in customs systems adapting to the new tariff schedule.\nA deeper look at industry-level patterns further confirms that these frictions were both widespread and economically significant. A sectoral decomposition reveals particularly large implementation frictions in high-import industries such as electronics, electrical equipment and machinery. In these sectors, predicted tariffs were high, but most imported products failed to generate commensurate duty payments. These two factors amplified the sectors' contribution to the overall AETR gap. In contrast, sectors such as transportation equipment — where tariffs were implemented more promptly — show little to no discrepancy.\nUnderstanding these operational gaps is essential for forecasting tariff revenues, assessing near-term price effects and evaluating the broader economic impact of trade policy changes. If the discrepancies observed in May reflect only temporary lags in enforcement, we would expect the realized AETR to rise in the coming months, potentially converging toward 14 percent given the May import mix. Continued monitoring will be necessary to track this adjustment and gauge the effectiveness of tariff policy implementation going forward.\nComputing Predicted and Actual AETRs\nTo generate the predicted AETR, I apply country-product specific tariffs that were both announced and in effect as of May 2025 to detailed 2024 trade data. For example, if the product \"Aluminum bars, rods and profiles: of aluminum, not alloyed\" — which as of May 2025 was subject to a 25 percent tariff under Section 232 — is imported from a country that faced a 2 percent tariff in 2024, the predicted tariff rate for that product-country pair would be 27 percent. This is because the executive order specified that the new tariff should be applied in addition to the Most Favored Nation rate already in place for that subheading (thus, \"stacking\" the tariff rates).1\nI then aggregate across goods and countries using 2024 country-level import shares and 2024 within-country product composition to construct a single economy-wide AETR estimate. Since the predicted AETR uses tariff announcements in real time, I refer to it as a forward-looking measure representing our \"best guess\" of what average tariffs will be. I compute in this manner because there is a two-month lag between the period in which I need to use the data and the period in which I can collect it from the Census Bureau. For example, the latest import and tariff data release I currently have is from May.\nThe actual AETR was computed directly as the ratio of total duties collected to the total value of imports, providing a straightforward, backward-looking measure. As of May, this realized AETR was 8.7 percent, despite minimal policy changes during the month.\nUnderstanding the Gap: Three Hypotheses\nGiven the structure of these measures, the predicted/actual AETR discrepancy can arise from three main sources:\n- Within-country changes in the product mix: This may be due to importers reducing (or eliminating) volumes of highly tariffed goods, moving up purchases before the tariffs take effect or renegotiating prices with providers (thus, \"sharing\" the tariff burden).\n- Shifts across country import shares: This may be especially true for firms moving away from high-tariff countries such as China and toward lower-tariff sources like Vietnam or toward domestic alternatives or foreign alternatives not subject to tariffs.\n- Tariff collection dynamics: This includes the timing of shipments, exemptions not captured in announced-policy data, ongoing litigation on which goods could be subject to tariffs, or other mechanisms preventing full tariff implementation.\nI will refer to these sources as \"hypotheses\" and try to tease out which one of these is the most likely cause of the gap. Evidence for hypothesis 1 comes from the most recent CFO Survey, where 24.6 percent of respondents said they would \"move up purchases\" and 12.4 percent said they would \"scale down businesses.\" The survey also provides some evidence for hypothesis 2, as respondents reported that the number of goods purchased from the U.S. increased and the number purchased from outside the U.S. declined. This indicates substitution to domestic alternatives.\nFigure 1 compares country-level import shares in 2024 to those observed in May 2025. The data reveal a marked decline in imports from high-tariff countries such as China and Canada — which have reductions of 45 percent and 14 percent, respectively, relative to 2024 — alongside a notable increase in imports from Vietnam, the European Union (EU) and the rest of the world (ROW) category.\nThese shifts are consistent with cross-country substitution, where importers reallocated sourcing toward countries less affected by the 2025 tariff actions. In particular, the rise in Vietnam's share of imports (from 4 percent to over 6 percent) likely reflects its position as a lower-tariff alternative to China in many product categories. Likewise, the expansion of EU and ROW shares suggests broader diversification in sourcing strategies. Among respondents in the CFO Survey, 27 percent claimed that they would likely diversify their supply chains later in the year. These compositional changes contributed to a measurable reduction in the predicted AETR when I reweighted using updated 2025 import shares, as I will show later.\nHypothesis 3 considers possible delays in tariff collection due to the following:\nShipment Delays\nSince goods that had already been shipped were exempt from the new tariffs — and shipping from countries such as China typically takes about a month — the tariff increases likely only began affecting imports that arrived in mid-May.\nDelayed Payments\nU.S. Customs and Border Protection allows importers enrolled in the automated clearinghouse (ACH) payment system to defer tariff payments by up to six weeks. As a result, many shipments that arrived in May would not have triggered tariff payments until June, delaying the fiscal impact of newly imposed duties.\nOngoing Litigation\nIn mid-May, five U.S. small businesses filed a case in the U.S. Court of International Trade seeking to block the April 2 \"Liberation Day\" tariffs.2 These businesses argued that the unilateral presidential action exceeded statutory authority. On May 28, the Court of International Trade ruled that the broad tariffs imposed under the International Emergency Economic Powers Act (including the \"Liberation Day\" tariffs) exceeded the President's constitutional authority.3 These may have caused pauses or confusion in the implementation of tariffs at the border.\nDecomposition Analysis\nTo quantify the impact of each of the three hypotheses described above, I conduct the following decomposition, illustrated in Figure 2:\nWithin-Country Changes in the Product Mix\nUpdating the product-level weights within each country using May 2025 trade flows (instead of 2024 levels) resulted in a modest reduction of 0.6 percentage points in the AETR.4 This suggests that product substitution is present but played a relatively minor role in explaining the overall gap.\nAcross Country Import Share Shifts\nReplacing 2024 country weights with those from May 2025 had a larger effect than replacing product-level weights, reducing the AETR by 2.7 percentage points. Most notably, U.S. imports from China declined, while imports from Vietnam and the EU increased. This substitution away from heavily tariffed countries had a noticeable impact but is still insufficient to explain the full gap.\nTariff Collection Dynamics\nTo account for legacy exemptions or treaties as well as delays in tariff implementation, I flag any country-product pair that met the following criteria:\n- It had positive import values in May 2025.\n- It was exempt from tariffs in 2024.\n- It showed a discrepancy greater than 0.5 percentage points between predicted and actual tariff rates per product-country pair in May 2025.\nFor these items, I adjust the applied tariff to zero. Incorporating these partial or missed collections brings the predicted AETR for May (adjusted for implementation gaps) to 9.7 percent, reducing the gap considerably.\nAdditional Considerations\nThe remaining unexplained residual is now about 1 percentage point, suggesting that most of the divergence can be attributed to legacy exemptions and implementation lags rather than errors in the underlying tariff predictions.\nIf instead of assigning a zero tariff in this third experiment I had assigned the actual collected tariff rates observed in May 2025 for the relevant items, the resulting AETR would have been 10.1 percent. This suggests that, for many of these goods, tariff collections were minimal, likely due to implementation delays, administrative issues or incomplete updates to customs systems. In fact, a significant number of country-product pairs that were expected to be tariffed at high rates had zero recorded tariff collections in May. This pattern indicates that the tariff schedule may not have been fully integrated into operational procedures, leading to lags in enforcement rather than strategic payment deferrals by importers.\nFigure 2 displays the breakdown of the contributions of these hypotheses.\nCase Study: Canada\nTo better understand these discrepancies, I took a closer look at Canada. While the predicted AETR for Canadian imports was 10.4 percent, the actual rate recorded in May 2025 was just 1.9 percent. To investigate why, I examine the universe of imported items from Canada and identify those with positive predicted tariffs but no corresponding duty collections despite having positive import volumes that month.\nThe analysis revealed that 1,254 out of 5,284 imported product lines (roughly 31 percent) fell into this category. In other words, nearly one-third of Canadian imports that were expected to be subject to tariffs generated zero tariff revenue in May, suggesting either legacy exemptions, delayed implementation or administrative gaps in enforcement.\nSetting the AETR to zero on the imports that went untariffed would raise the adjusted AETR to 5 percent. However, including undercollected but nonzero items results in a more realistic adjustment of 2.5 percent, closer to the observed 1.9 percent.\nWas this discrepancy due to incorrect predictions, or did it stem from issues with tariff implementation? To explore this, Table 1 shows the top Canadian imports by value in May 2025, comparing predicted and actual tariff collections. The evidence points strongly toward implementation challenges as a key driver of the gap in tariff revenue.\nTake, for example, the item highlighted in red: aircraft between 2,000 and 15,000 kilograms. According to the U.S. tariff lookup tool available through Canada's official trade portal, this product was not covered by the United States-Mexico-Canada Agreement and was subject to the general 25 percent tariff on nonexempt Canadian goods.\n| HTS6 | Commodity | Imports (Millions) | Duties (Millions) | Weight in CA Imports | Actual AETR | Predicted AETR |\n|---|---|---|---|---|---|---|\n| 940320 | Metal Furniture Nesoi | $26.04 | $2.55 | 0.1% | 10% | 25% |\n| 030612 | Lobsters, Including in Shell, Frozen | $76.31 | $0.00 | 0.3% | 0% | 25% |\n| 940199 | Parts of Seats, Nesoi | $57.18 | $2.39 | 0.2% | 4% | 25% |\n| 281410 | Anhydrous Ammonia | $63.44 | $0.00 | 0.2% | 0% | 25% |\n| 480261 | Paper & Paperboard, Uncoated, 10% Mech.fib.,rolls | $49.04 | $0.00 | 0.2% | 0% | 25% |\n| 750210 | Nickel, Unwrought, Not Alloyed | $50.99 | $0.00 | 0.2% | 0% | 25% |\n| 760200 | Aluminum Waste and Scrap | $88.08 | $0.08 | 0.3% | 0% | 25% |\n| 851762 | Mach for Recp/convr/trans/regn of Voice/image/data | $60.78 | $4.24 | 0.2% | 7% | 25% |\n| 330499 | Beauty & Skin Care Preparation, Nesoi | $64.66 | $0.20 | 0.2% | 0% | 25% |\n| 290110 | Acyclic Hydrocarbons, Saturated | $40.78 | $0.00 | 0.1% | 0% | 25% |\n| 880730 | Parts of Planes or Helicopters, Nesoi | $122.93 | $9.89 | 0.4% | 8% | 25% |\n| 841191 | Turbojet and Turboproller Parts | $121.83 | $9.99 | 0.4% | 8% | 25% |\n| 470321 | Chemical Woodpulp, Soda Etc. N Dis S Bl & Bl Conif | $105.89 | $0.00 | 0.4% | 0% | 25% |\n| 880230 | Airplane & A/c Unladen Wght > 2000, Nov 15000 Kg | $74.08 | $0.00 | 0.2% | 0% | 25% |\n| 841112 | Turbojets of a Thrust Exceeding 25 Kn | $360.95 | $0.00 | 1.2% | 0% | 25% |\n| 880240 | Airplane & Ot A/c, Unladen Weight > 15,000 Kg | $186.02 | $0.00 | 0.6% | 0% | 25% |\nBased on those parameters, the predicted AETR for this item was 25 percent. However, actual duty collections were zero, despite over $74 million in imports recorded for May. This suggests that — at least for a significant subset of high-value imports — the problem was not in the prediction model but rather in how (or whether) the tariffs were applied at the border.\nShipment Timing and Deferred Tariff Payments\nTo further investigate whether the gap between predicted and actual AETRs stemmed from shipment timing or deferred tariff payments, I conduct a second experiment. Specifically, I focus on products that met three criteria:\n- They were not subject to tariffs in 2024.\n- They had positive import values and nonzero duty collections in May 2025.\n- The actual tariffs collected were significantly below expectations, defined here as more than 5 percentage points lower than the predicted rate.\nRoughly 26 percent of products fell into this category. One illustrative example from Table 1 is the beauty and skin care preparation category. Although products in this category were expected to face a 25 percent tariff in May, the actual rate based on collections was only 0.2 percent.\nIncluding these undercollected items alongside the fully uncollected ones from the earlier analysis, the adjusted AETR for Canada rises to approximately 2.5 percent — closer to the observed value of 1.9 percent. This suggests that delays in enforcement or deferred payments may have played a substantial role in the observed discrepancy.\nIndustry Analysis\nTo better understand which sectors drove the gap between predicted and actual tariff rates, I conduct an industry-level decomposition using NAICS-3 sector classifications. For each industry, I calculate its share of total U.S. imports in May 2025 and measure the difference between the predicted and actual AETR. This approach helps identify which sectors contributed most to the aggregate AETR gap, either because they represent a large share of imports or because they experienced unusually large discrepancies between expected and realized tariff payments.\nFigure 3 plots the difference between predicted and actual AETRs by industry, with the horizontal axis capturing each industry's import share and the vertical axis showing the predicted-minus-actual AETR gap. Each circle represents an industry, and its size is proportional to the industry's import share. This visualization highlights not only which sectors experienced large tariff discrepancies but also which were most consequential in aggregate.\nThree of the largest importing industries stand out for having substantial enforcement gaps: electronics (19 percentage points); electrical equipment, appliances and components (10 percentage points); and machinery (7 percentage points). These gaps appear to be broad based within each sector. In both electronics and machinery, more than 60 percent of the imported product lines had individual AETR gaps exceeding 5 percentage points. Another telling case is the oil and gas industry, where key products such as liquefied natural gas, propane and butane (primarily imported from Canada) should have faced 10 percent tariffs but registered zero duty collections in May 2025.\nBy contrast, the transportation equipment industry shows almost no discrepancy between predicted and actual AETRs despite its large import share, suggesting that tariffs were implemented more completely in this sector.\nSeveral smaller industries — such as furniture, beverages and tobacco, wood products, paper, and textiles — also exhibit sizable tariff gaps. While these industries individually account for smaller shares of total imports, their consistent undercollection across products signals broader implementation frictions.\nTaken together, the evidence points to widespread but uneven enforcement issues, with particularly pronounced gaps in high-volume industries like electronics and machinery. These implementation shortfalls likely account for a significant portion of the overall divergence between predicted and realized trade costs.\nConclusion\nThe sizable gap between the predicted and actual AETRs in May 2025 — 17.5 percent versus 8.7 percent — can be largely attributed to a combination of importer adjustments and, more importantly, delays in translating announced tariffs into actual collections. While shifts in sourcing strategies and product composition played a role, the decomposition analysis points to implementation frictions — such as legacy exemptions, deferred payments and customs system delays — as the dominant causes of the shortfall. These frictions are not visible in published tariff schedules but materially affected collections in May.\nIf May was a transitional month — reflecting administrative lags, payment deferrals or shipments in transit prior to the policy's effective date — then the data from June 2025 will provide a more accurate picture of the true fiscal impact of the new tariff regime. Based on the observed May import mix, the realized AETR could plausibly rise to 10 to 14 percent once enforcement aligns with announced policy. Continued monitoring will be critical in determining whether this convergence occurs and in gauging the durability and macroeconomic significance of the current trade policy.\nMarina Azzimonti is a senior economist and research advisor in the Research Department at the Federal Reserve Bank of Richmond.\nThe computation is actually more complicated than this example, since subsequent executive orders specified that not all 2025 tariffs would stack up. For example, a car part that uses aluminum is not subject to the 25 percent aluminum plus the 25 percent car part tariffs. These exemptions were incorporated into our calculations to our best interpretation of the law.\nFor more information, see the May 2025 article \"Small Businesses Press US Trade Court to Block Trump Tariffs\" by Dietrich Knauth and Blake Brittain.\nFor more information, see the May 2025 article \"US Court Blocks Most Trump Tariffs, Says President Exceeded His Authority\" by Dietrich Knauth and Daniel Wiessner.\nIn this exercise, the import shares are kept constant at 2024 levels. Only the import mix within each country is updated to May 2025.\nTo cite this Economic Brief, please use the following format: Azzimonti, Marina. (August 2025) \"Why Predicted and Actual Tariff Rates Diverged in May 2025.\" Federal Reserve Bank of Richmond Economic Brief, No. 25-29.\nThis article may be photocopied or reprinted in its entirety. Please credit the author, source, and the Federal Reserve Bank of Richmond and include the italicized statement below.\nViews expressed in this article are those of the author and not necessarily those of the Federal Reserve Bank of Richmond or the Federal Reserve System.\nReceive a notification when Economic Brief is posted online."
    },
    {
      "url": "https://www.goldmansachs.com/insights/articles/us-earnings-will-start-to-show-the-impact-of-trumps-tariffs",
      "text": "After a sharp rally in the S&P 500 to a record high, investors are turning their attention to upcoming corporate earnings announcements, which may offer some important clues on how President Trump’s tariff policies are filtering through to the corporate bottom line.\nS&P 500 companies will start reporting their earnings for the second quarter of the financial year on July 15, beginning with some large financial services companies.\nBased on announced policies, the effective US tariff rate has risen by roughly 10 percentage points to 13%. Economists in Goldman Sachs Research estimate the effective tariff rate will eventually be increased by an additional 4 percentage points to 17%.\nPresident Trump first announced increased tariffs in February this year, but investors are still trying to work out exactly how the increased taxes are affecting US companies. “Clients have been keenly focused on who will ultimately shoulder the cost of tariffs,” writes David Kostin, chief US equity strategist at Goldman Sachs, in a recent report.\nHow will tariffs affect S&P 500 stocks?\nEconomists at Goldman Sachs Research assume that companies will pass on 70% of the direct cost of tariffs to consumers through higher prices. But the core measurement for US consumer prices increased less than expected in May. Some recent business surveys have indicated lower pass-through of tariff costs to consumers.\n“Early earnings results offer conflicting messages on the margin outlook,” Kostin writes. “Companies have so far only announced modest price increases this year, although increases have been larger among firms most exposed to tariffs.”\nOn the other hand, if companies themselves have to absorb a larger-than-expected share of the cost of tariffs, their profit margins will come under pressure. Revisions to analysts’ consensus estimates of corporate margins suggest that some companies may not be able to fully offset the impact of tariffs.\nSome companies will be able to tap into built-up inventories to minimize the hit to their margins from tariffs. The aggregate S&P 500 inventory-to-sales ratio was largely unchanged in the first quarter of 2025, but some companies built up their inventories before tariffs were implemented\nHow are US tariffs impacting corporate earnings and profitability?\nAnalysts also expect the growth in earnings-per-share, a key measurement of companies’ profitability, to drop off this quarter. The consensus estimate among analysts sees S&P 500 companies’ earnings-per-share growth decelerating to 4% this quarter relative to the same quarter last year—down from 12% in the first quarter. On a sequential basis, consensus forecasts imply that margins contracted by 50 basis points to 11.6% from 12.1%.\n“We expect the S&P 500 in aggregate will beat the low bar set for the second quarter,” Kostin writes.\nThe outlook for demand, meanwhile, still appears solid. Goldman Sachs Research expects nominal GDP in the US to grow at an average rate of 4.5% year-on-year in 2025. It also forecasts positive real income and spending growth for companies across all income cohorts. And sales revision breadth, which measures the difference between the number of companies with upward and downward revisions to their future sales estimates, has jumped back into positive territory after a sharp decline in April.\nHow are tariffs impacting capital expenditures and investment?\nTariffs and policy uncertainty don’t appear to have substantially dampened companies’ investment spending plans. Goldman Sachs economists found in a recent report that analysts raised capital spending expectations overall, when measured by weighted average.\nHowever, those estimates for capital spending vary widely by company. Revisions to companies’ spending plans have been greatest for the sectors and stocks most exposed to the continuing development of AI, such as utilities (which provide power for data centers) and information technology. By contrast, analysts have cut capital expenditure estimates in most other sectors. Economists at Goldman Sachs Research found that capital expenditure estimates have been lowered for companies more affected by policy uncertainty, tariffs, and potential retaliatory tariffs.\nWhat is the forecast for the S&P 500?\nIn total, Goldman Sachs Research forecasts that S&P 500 earnings-per-share will grow 7% in 2025 to $262. That’s slightly above the median strategist 2025 forecast for a 6% increase to $260.\nThe team’s estimate incorporates a modest drag on economic growth and a one-time boost to inflation from tariffs, which is likely to weigh on some sectors. But this is expected to be offset by growth in certain sectors such as information technology, communication services, and healthcare.\nKostin’s team forecasts that the S&P 500 will return 3.5% over the next 12 months (as of July 7), reaching 6500.\nThis material is provided in conjunction with the associated video/audio content for convenience. The content of this material may differ from the associated video/audio and Goldman Sachs is not responsible for any errors in the material. The views expressed in this material are not necessarily those of Goldman Sachs or its affiliates. This material should not be copied, distributed, published, or reproduced, in whole or in part, or disclosed by any recipient to any other person. The information contained in this material does not constitute a recommendation from any Goldman Sachs entity to the recipient, and Goldman Sachs is not providing any financial, economic, legal, investment, accounting, or tax advice through this program or to its recipient. Neither Goldman Sachs nor any of its affiliates makes any representation or warranty, express or implied, as to the accuracy or completeness of the statements or any information contained in this material and any liability therefore (including in respect of direct, indirect, or consequential loss or damage) is expressly disclaimed.\n© 2025 Goldman Sachs. All rights reserved.\nOur signature newsletter with insights and analysis from across the firm\nBy submitting this information, you agree that the information you are providing is subject to Goldman Sachs’ privacy policy and Terms of Use. You consent to receive our newletter via email."
    },
    {
      "url": "https://www.newyorkfed.org/newsevents/speeches/2025/wil250716",
      "text": "Introduction\nGood evening. I’m pleased to see my fellow economists and colleagues enjoying a long summer evening in the city in the best way possible—indoors and prepared for a robust discussion on the economic outlook.\nI’ve been looking forward to this conversation for some time. But before we turn to the discussion and Q&A, I’d like to take a few minutes at the start of the program to share my assessment of recent economic data and how it’s informing my outlook for the economy. Particularly, I’ll explain what the data are telling us in light of economic uncertainty, and how I expect the effects of tariffs to take shape.\nNow is when I must give the standard Fed disclaimer that the views I express today are mine alone and do not necessarily reflect those of the Federal Open Market Committee (FOMC) or others in the Federal Reserve System.\nSoft Data/Hard Data\nYou all read the news and are familiar with the facts and figures. The changing landscape around trade policy has heightened economic uncertainty among households, businesses, and financial market participants. The response to these developments and the associated uncertainty has led to interesting and sometimes contrasting dynamics in both the soft data and hard data.\nSoft data, such as the regional business surveys conducted by the New York Fed, have highlighted an elevated degree of uncertainty about the economic outlook over the past few months. All told, concerns about tariffs have been widespread, resulting in a reported pullback on capital spending.\nSimilarly, our national Survey of Consumer Expectations (SCE) shows that consumers’ uncertainty along a number of dimensions remains elevated as well, leading many households to scale back on their expected spending growth on nonessential items.1 In addition, survey respondents report that their uncertainty about future inflation remains elevated.\nBut some soft data have provided more encouraging news. For example, in the SCE, longer-run inflation expectations have remained stable, while short- and medium-term inflation expectations have returned to their pre-pandemic ranges. This is critically important, because well-anchored inflation expectations are essential for sustained price stability.\nNow I’ll turn to some hard data. And by these measures, the U.S. economy remains in a good place.\nReal GDP growth data have been unusually noisy, largely reflecting effects from the front-running of tariffs earlier this year. That said, the data are suggesting that economic growth has slowed relative to last year’s pace.\nAll of this data—both hard and soft—feed into my assessment of how the economy is faring with regard to the Fed’s dual mandate goals of maximum employment and price stability.\nOn the employment front, the most recent data show a solid labor market, as demonstrated by measures of unemployment, employment, vacancies, hiring, and quits. Job growth is slowing, but so is labor supply, owing to lower immigration. Overall, labor supply and demand are well balanced and there are no signs that the labor market is adding inflationary pressures.\nWith regard to price stability, inflation has continued on a gradual, albeit bumpy downward path toward our 2 percent longer-run goal. Based on my reading of the June CPI and PPI data, I estimate that the 12-month percent change in headline PCE inflation in June will be about 2-1/2 percent, and core inflation will be about 2-3/4 percent.\nThe Effects of Tariffs\nI often say that I look at the totality of the data to track underlying trends and evolving conditions. So, in addition to closely watching the data and trends that I just mentioned, I’ve been keenly watching the effects of tariffs on the prices of goods and services.\nOne question comes up a lot these days: “All we hear about is tariffs, tariffs, tariffs. But then why hasn’t inflation gone up?”\nTo answer this question, you need to dig into the details of how tariffs affect prices, and that means getting into the data at a more granular level.\nWe are seeing initial effects of tariff increases on core goods prices. Specifically, for items that are more exposed to higher tariffs—household appliances, musical instruments, luggage, tableware—price increases so far this year have been well above what one would expect based on past trends. Using granular import price data and linkages measured through input-output tables, we can see if these patterns occur broadly across categories of goods and services.2 And in fact, there is a positive relationship between a category’s exposure to tariffs and its price increase to date this year relative to its prior trend.\nIt's important to note that it’s still early days for the effects of tariffs, which take time to come into full force. Combining enacted and announced tariffs, estimates of the resulting average effective tariff rate range somewhere between 15 and 20 percent. But actual tariffs in effect in recent months were much smaller than that, as seen by the amount of tariff revenue collected each month. Net tariff receipts as a share of imports rose from about 2-1/4 percent in the first three months of the year to about 8 percent in May.\nOn top of that, it takes time for the tariff increases to pass through to domestic prices. In particular, businesses and consumers bought imported goods in droves in anticipation of the higher tariff rates, likely delaying their effects on domestic prices.\nNonetheless, businesses are very focused on tariffs and say that they expect to respond by increasing prices. A special New York Fed survey of businesses indicates that firms passed on at least some of the higher tariffs to their customers, with nearly a third of manufacturers and about 45 percent of service firms fully passing along all tariff-induced cost increases by raising their prices.3\nAll in all, although we are only seeing relatively modest effects of tariffs in the hard aggregate data so far, I expect those effects to increase in coming months. Overall, I expect tariffs to boost inflation by about 1 percentage point over the second half of this year and the first part of next year.\nAnother element to the inflation outlook is that the lower foreign exchange value of the dollar we have seen this year likely will add somewhat to inflationary pressure going forward.\nWe won’t know exactly the magnitude or timing of how these various factors will play out until we see more data. That’s why I’ll continue to be vigilant and monitor prices and broad movements over time to best assess evolving conditions.\nMonetary Policy\nThe combination of continued uncertainty, a solid labor market, and inflation still above our 2 percent goal led the FOMC to decide to leave the target range for the federal funds rate unchanged at 4-1/4 to 4-1/2 percent at its most recent meeting last month.4\nMaintaining this modestly restrictive stance of monetary policy is entirely appropriate to achieve our maximum employment and price stability goals. It allows for time to closely analyze incoming data, assess the evolving outlook, and evaluate the balance of risks to achieving our dual mandate goals.\nIn addition, the FOMC continues to reduce its holdings of Treasury securities and agency debt and agency mortgage-backed securities. That process continues to go very smoothly.\nThe Economic Outlook\nI’ll conclude my remarks with the question that likely brought you all here this evening. What is my outlook for the economy?\nGiven all the uncertainty, a number of outcomes are possible. But based on what the data tell us today, I expect uncertainty and tariffs to restrain spending and reduced immigration to slow labor force growth. As a result, I expect real GDP growth this year to be about 1 percent.\nWith this slowdown in growth, I expect the unemployment rate to rise to around 4-1/2 percent by the end of this year. I anticipate inflation will come in between 3 and 3-1/2 percent in 2025, and then fall back to about 2-1/2 percent next year before reaching 2 percent in 2027.\nConclusion\nAs the summer progresses and we look toward the remainder of the year and beyond, I’ll remain focused on all of the data—the soft data from surveys, the hard data we see in the real GDP growth and consumer spending, and tariffs’ effects on goods and services—and what it ultimately means for the achievement of our dual mandate goals.\nThere’s definitively heightened uncertainty about the path of the economy, but it’s too early to say what the trajectory of the hard data will be. No matter what the future holds, I am committed to supporting maximum employment and returning inflation to our 2 percent longer-run goal.\nThank you for hosting me this evening. I look forward to your questions."
    }
  ],
  "argos_summary": "Despite ongoing tariff discussions, the U.S. economy has not yet felt significant inflationary impacts, as companies have absorbed much of the tariff costs. However, experts predict that this will change, with expectations that two-thirds of tariff costs will be passed on to consumers by the end of the year, potentially increasing core inflation. The Federal Reserve anticipates that tariffs could boost inflation by about 1 percentage point in the latter half of the year, with visible price increases in tariff-exposed goods already occurring.",
  "argos_id": "GKIJXE59I"
}