{
  "url": "https://www.bloomberg.com/news/videos/2025-08-06/bloomberg-brief-8-6-2025-video",
  "authorsByline": "bn",
  "articleId": "2d0190619f0f4d73b8d812312d05bb1d",
  "source": {
    "domain": "bloomberg.com",
    "paywall": true,
    "location": {
      "country": "us",
      "state": "NY",
      "city": "New York",
      "coordinates": {
        "lat": 40.7127281,
        "lon": -74.0060152
      }
    }
  },
  "imageUrl": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i7xwxh8krBBw/v3/-1x-1.jpg",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-06T10:39:28.138000+00:00",
  "addDate": "2025-08-06T11:37:44.030370+00:00",
  "refreshDate": "2025-08-06T11:37:44.030376+00:00",
  "score": 1.0,
  "title": "OpenAI in Share Sale Talks; Trump to Announce Chip, Pharma Tariffs Soon",
  "description": "US equity futures post modest gains as investors prepare for a rush of earnings. OpenAI is said to be in early talks about a potential sale of stock at a valuation of $500 billion. President Trump says tariffs on chips and pharmaceutical imports will come in the \"next week or so.\" Sharon Bell of Goldman Sachs believes the US economy is growing below potential and will also do so in the second half. Neil Dutta of Renaissance Macro thinks President Trump's eventual Fed appointee will have some convincing to do of their new colleagues. “Bloomberg Brief” delivers the market news, data and analysis you need to set your agenda. (Source: Bloomberg)",
  "content": "DANI: IT'S 5:00 A.M. IN NEW YORK CITY. GOOD MORNING. I AM DANI BURGER WITH YOUR BLOOMBERG BRIEF. THE CHIPMAKER'S PLUNGE. AND HE SAYS THAT ITS RETURN TO CHINA IS STILL UNKNOWN. SUPERMICRO SALES A DIVE AFTER CUTTING ITS FORECAST. OPENAI IS SET TO FETCH AN EYE WATERING $500 BILLION VALUATION IN ITS LATEST SHARE SALE. PRESIDENT TRUMP SAYS ANNOUNCEMENTS ON CHIPS AND PHARMA LEVIES ARE COMING SOON. ANOTHER DAY OF LOSSES FOR THE S & P 500 YESTERDAY. WE ATTEMPT TO REBOUND THIS MORNING. AN EXPLANATION BEING THROWN OUT, THERE WAS A WEAK SERVICES ISM. FUTURES UP BY ABOUT ONE THIRD. FOR THE BOND MARKET, PERHAPS THE WORRYING THING FOR THE SERVICES ISM'S YESTERDAY WAS THAT PRICE PAID WAS HIGHER AND YOU SAW A TICK UP IN YIELDS AND THAT CONTINUES UP THIS MORNING. ABOUT 1.5 BASIS POINTS FOR THE TWO-YEAR YIELD, THE 10-YEAR YIELD IS 4.2414. WE WILL GET A 10-YEAR AUCTION TODAY. VALERIE: GOOD MORNING. LET'S START WITH AMD, THE WORLD'S SECOND-LARGEST CHIPMAKER FALLING OVER 5% IN PREMARKET. THE COMPANY WAS VERY HESITANT TO TALK ABOUT ANY CHINA REVENUE. IT SEEMS THEY AREN'T CONVINCED THEY WILL GET EXPORT LICENSES TO SELL THE CHINA SPECIFICALLY HAVE MADE CHIP INTO THE MARKET. THE MARKET DID NOT LIKE THAT NEWS AND WE ARE TRADING DOWN 5%. AMD IS THE OUTPERFORMER WHEN IT COMES TO CHIP STOCKS THIS YEAR, SO A LOT WAS BAKED INTO THE EARNINGS LAST NIGHT. SUPERMICRO IS A MAKER OF AI SERVERS THAT SELL TO COMPANIES LIKE AN NVIDIA. THE STOCK IS BEING PUMMELED IN THE PREMARKET, DOWN OVER 16%. THEY HAVE CONTINUED TO REIN IN THEIR SALES GUIDANCE AFTER IN FEBRUARY THEY GAVE A SALES NUMBER THAT WAS NEARLY TWICE THE ANALYSTS' ESTIMATES. THE BULLISH FIGURE AT THE START OF THE YEAR IS BEING WASHED BACK AND INVESTORS SEEM TO NOT LIKE THAT NARRATIVE. MAYBE SUPERMICRO ISN'T IN THE BEST PLACE TO CAPITALIZE ON THAT EXTRA CAPEX SPENDING. LET'S LOOK AT WHAT'S TO COME. WE ARE HEARING FROM DISNEY AND UBER BEFORE THE BELL IT. DISNEY ALREADY TRADING STRONGLY COME UP TO PERCENT. THERE WAS NEWS OVERNIGHT THE DISNEY'S ESPN IS HAVING A TIED UP WITH THE NFL MEDIA ASSETS. IT SEEMS THE STOCK IS LIKING THAT NEWS. HUBER IS THE FIRST OF THE GIG ECONOMY TO REPORT THIS SEASON WITH A LOT OF ATTENTION ON THEIR TIE UP WITHOUT FOR THAT' IS WAYMO AND HOW THAT'S GOING. -- FOR GOOGLE'S WAYMO AND HOW THAT'S GOING. DANI: WE WILL CATCH HIM ON THE U.S. ECONOMY AND ALL THINGS FEDERAL RESERVE. FIRMS HAVE SHRUGGED OFF PRESIDENT TRUMP' IS REWIRING OF GLOBAL TRADE. \"WHILE U.S. COMPANIES ARE DISPLAYING CONFIDENCE REGARDING THEIR ABILITY TO WHETHER TARIFF IMPACTS ON PROFITS AND EARNINGS CALLS, COST PRESSURES COULD INCREASE THE SECOND HALF OF 2020 FIVE, INTRODUCING DOWNSIDE RISK TO REAL REVENUE GROWTH.\" SHARON JOINS US NOW. WHERE DO YOU EXPECT -- GOOD MORNING. WHERE DO YOU EXPECT THOSE PRESSURES TO SHOW UP THE MOST ACUTELY IN THE SECOND HALF OF THIS YEAR? SHARON: COMPANY SO FAR HAVE BEEN PRETTY CONFIDENT, AND THE U.S. EARNINGS SEASON FIRST AND SECOND QUARTER HAVE BEEN STRONG. THE SECOND QUARTER DELIVERING A VERY, GOOD BEAT PARTICULARLY AMONGST THE BIGGEST CAP TECH COMPANIES THAT ARE PERHAPS NOT TOTALLY IMMUNE BUT MORE IMMUNE TO THE CONCERN OF GROWTH AND TARIFFS. INTO THE SECOND HALF, IF COMPANIES PULLED FORWARD A LOT OF INVENTORY IMPORTED ALREADY IN THE FIRST QUARTER OF THIS YEAR, THEY HAVE ALREADY STARTED TO USE ALL OF THOSE. YES, YOU MAY SEE A LITTLE MORE PRESSURE ON MARGINS. DANI: SOCGEN NOTED AT THE END OF LAST WEEK TWO THIRDS OF THE S & P THAT REPORTED WERE SHOWING DECLINING PROFIT MARGINS ALREADY. THE IDEA THAT FOR NOW THEY ARE EATING THE COST, BUT HOW LONG CAN THAT CONTINUE AND WHAT HAPPENS WHEN FROM START TO RAISE PRICES? ARE CONSUMERS GOING TO BE WILLING TO PAY MORE? SHARON: THE U.S. ECONOMY AT THE MOMENT WE DESCRIBE AS BEING AT STALL SPEED. IT IS GROWING BELOW POTENTIAL, AND WE THINK THAT WILL BE THE CASE IN THE SECOND HALF OF THIS YEAR, AND WE THINK PART OF THAT IS BECAUSE OF CONSUMER REAL INCOMES BEING SO WEAK GIVEN PASS-THROUGH AND HYPERINFLATION DUE TO TARIFFS. WE THINK THE FEDERAL RESPONDED SEPTEMBER. WE THINK THE ECONOMY IS ON THE WEAKER SIDE AT THE MOMENT. THE U.S. EARNINGS SEASON PERHAPS DISGUISES THAT A LITTLE, PARTLY BECAUSE THE WEAKER DOLLAR IS HELPING THE U.S., BUT PARTLY BECAUSE OF THE BIGGER CAP TECH STOCKS THAT ARE DOING WELL AND ARE MORE IMMUNE. BUT THE REST OF THE MARKET, THE 493, ARE SEEING ISSUES. SMALLER CAPS UNDERPERFORMING IN THE U.S. ALL RELATED, I THINK, TO SOME OF THESE PRESSURES. DANI: IF YOU LOOK AT THE BOTTOM FROM APRIL EVENT HOW THE SECTORS HAVE BEEN DOING, ALL HAVE ADVANCED, SAFE HEALTH CARE WHICH HAS SOME OF ITS OWN IDIOSYNCRATIC AND PERHAPS TARIFF THINGS GOING ON IN IT. DOES THAT MAKE CENTS FOR A CONSUMER DISCRETIONARY UP 24% FROM THE BOTTOM? CAN THAT LAST? SHARON: THE MARKET HAS RALLIED A LOT SINCE THE LIBERATION DAY -RELATED LOWS. TARIFFS WILL BE A LOT HIGHER THAN WE ARE SEEING COME THROUGH NOW AND THERE IS A LOT OF EVIDENCE THAT HAS COME THROUGH SINCE THAN THAT THERE'S A LOT OF PRAGMATISM WHEN IT COMES TO TARIFFS. A LOT OF THE RALLY, YES, THAT BIT IS JUSTIFIED, BUT TO THE EXTENT THAT THE RALLY IS SUGGESTING THAT GROWTH WILL BE FINE, WE DON'T AGREE. THE SECOND HALF OF THIS YEAR I THINK GROWTH WILL BE ON THE WEAKER SIDE. THERE'S A BIG CHUNK OF THE U.S. MARKET, THE BIGGEST CAP TECH COMPANIES THAT HAVE GOOD BALANCE SHEETS THAT AREN'T EXPOSED TO THESE TRENDS THAT CAN CONTINUE TO DEFY SOME OF THESE TRENDS. IT'S A MIXED PICTURE. INTEREST RATES COMING DOWN HELPS EVEN IF GROWTH IS RELATIVELY WEAK. INTEREST RATES COMING DOWN COME ON THE OTHER HAND, SUPPORTS INVESTORS AND MARKETS AS WELL. DANI: THAT IS PERHAPS WHY THERE IS A DISCONNECT OF THE BOND MARKET THAT HAS STARTED TO PRICE IN SOME OF THE INTEREST RATES AND EQUITIES THAT HAVE HELD UP. YOU SAY PRAGMATISM IN TARIFFS BUT THERE HAVE BEEN THREATS FROM TRUMP, THE MOST RECENT FROM YESTERDAY WHEN HE SAID YOU COULD SEE 150% OR TWO HUNDRED PERCENT TARIFFS ON PHARMACEUTICALS. HOW ARE YOU THINKING ABOUT THAT SECTOR AND PHARMACEUTICALS IN EUROPE IF THIS IS THE PRESSURE THAT THEY COULD FACE IF THEY DON'T CUT COSTS IN THE U.S.? SHARON: THERE IS STILL UNCERTAINTY. I SAY THAT THERE'S PRAGMATISM, BUT THERE IS STILL A LACK OF CERTAINTY. THE EU HAS DONE A FRAMEWORK DEAL WITH THE U.S. BUT THERE IS STILL A LITTLE UNCERTAINTY WITH RESPECT TO THE DETAILS AND DEFINITE UNCERTAINTY WHEN IT COMES TO PHARMACEUTICALS GLOBALLY. THE TARIFFS THEY MAY FACE GIVEN THE INVESTIGATION STILL UNDERWAY. I THINK THAT THAT IS THE OVERHANG ON THE SECTOR THAT CONTINUES TO PENALIZE THE SECTOR. IN THE NEAR TERM I DON'T SEE THAT GOING AWAY. THE OTHER THING FOR EUROPEAN PHARMACEUTICALS AS THEY MAKE A LOT OF DOLLAR EARNINGS. TO THE EXTENT THAT THE DOLLAR HAS BEEN WEAKER, THAT IS A HIT ON THEIR PROFITABILITY AS WELL. DANI: IT'S INTERESTING WHERE THAT IS SHOWING UP. PFIZER YESTERDAY BASICALLY SAID, OUR EARNINGS THEMSELVES WERE WEAK, BUT WE WERE CUTTING COSTS, WE HAVE THE BENEFIT OF A WEAKER DOLLAR, AND WE HAVE TAX BENEFITS . YOU TALK ABOUT HOW SOME PRESSURES WILL SHOW UP IN 2025, BUT THEY COULD THE BOOST FROM THE FED CUTS. WHAT ABOUT TAXES? A MORE FRIENDLY TAX REGIME STARTING 2026. HOW BIG OF A BOOST COULD THAT BE THE CORPORATE PROFITS? SHARON: A MARGINAL BOOST, I THINK. WE HAVE 7% EARNINGS GROWTH FOR U.S. COMPANIES NEXT YEAR, WHICH WOULD BE ABOVE NOMINAL GDP GROWTH. A LITTLE OF THAT IS THE IMPACT OF THE BIGGEST TECH STOCKS GROWING QUITE NICELY, BUT A LITTLE IS TAX IMPACT, ETC. I THINK U.S. EARNINGS CAN CONTINUE TO GROW, AND A LITTLE IS RELATED TO DE-REGULATION. SOME CONTINUATION OF TAX CUTS AND SOME DE-REGULATION IN THE MIX AND PERHAPS BETTER U.S. EARNINGS PERFORMANCE AND A SLIGHTLY WEAKER DOLLAR. WITH THE FED CUTTING RATES WE STILL BELIEVE THAT THE DOLLAR WILL CONTINUE TO FALL AND THAT WILL BE A NICE TAILWIND FOR U.S. PROFITS, TOO. DANI: THANK YOU FOR JOINING US THIS MORNING. LET'S GET YOU SOME OTHER TOP STORIES THAT ARE TRENDING ON THE TERMINAL. AS WE HAVE BEEN DISCUSSING, PRESIDENT TRUMP SAID HE WOULD IMPOSE MORE LEVEES, HIGHER LEVIES ON COUNTRIES BUYING ENERGY FROM RUSSIA. THE PRESIDENT SAID THAT DECISIONS ON CHIPS AND PHARMA IMPORTS WOULD COME WITHIN THE NEXT WEEK OR SO. THIS WAS PRESIDENT HAS BEEN SET TO HOLD TALKS IN WASHINGTON TODAY ON TRADE. PRESIDENT TRUMP HAS ALSO MADE COMMENTS ON HIS PICK FOR THE UPCOMING VACANCY AT THE FED. PRES. TRUMP: FED GOVERNOR? I WILL BE MAKING THAT DECISION BEFORE THE END OF THE WEEK AND WE WILL EITHER DECIDE ON ONE FOR PERMANENTS OR FOUR-MONTH PERIOD, THE TERM. THERE IS A TERM OF ABOUT THE NUMBER OF MONTHS. WE HAVE A COUPLE OF CANDIDATES. EVERYONE WANTS IT, IT'S NOT A COUPLE, BUT WE HAVE NARROWED IT TO A COUPLE OF CANDIDATES. WE ARE ALSO LOOKING AT THE FED CHAIR, AND THAT IS DOWN TO FOUR PEOPLE RIGHT NOW. DANI: GLENCORE CANCELED ITS PLANS TO MOVE ITS PRIMARY LISTING TO NEW YORK, INSTEAD KEEPING ITS LONDON LISTING. THE CEO GARY NAGEL SAID GLENCORE WAS UNLIKELY TO HAVE GONE INTO THE S & P 500, A MOVE THAT WOULD HAVE BEEN A BLOW TO LONDON WHICH HAS LOST A QUARTER OF ITS COMPANIES IN THE PAST DECADE. AMD AND SUPERMICRO SHARES TAKE A HIT POST EARNINGS. WE WILL HAVE MORE ON THAT COMING UP ON YOUR BRIEF. ♪ > > EARLIER THIS QUARTER WE WERE NOTIFIED BY THE DEPARTMENT OF COMMERCE THAT IT IS MOVING FORWARD WITH THE REVIEW OF OUR LICENSE APPLICATIONS TO EXPORT MI308 TO CHINA. WE ARE NOT INCLUDING ANY MI308 AND OUR THIRD QUARTER GUIDANCE. DANI: LET'S UNPACK THOSE EARNINGS AND MORE WITH THE BLOOMBERG EXECUTIVE EDITOR FOR BLOOMBERG TECH. IT IS GREAT TO SEE YOU THIS MORNING. THIS IS SOMETHING THAT FOR AMD AND NVIDIA IT WAS SUPPOSED TO BE A BIG BOOST. THAT THEY WOULD GET THE LICENSE IS TO START SELLING IN CHINA AGAIN. HOW BIG OF A BLOW IS IT THAT THEY DON'T HAVE THAT CERTAINTY? PETER: LET'S START WITH EARNINGS. AMD CAME OUT WITH EARNINGS AND IT IS A REFLECTION OF HOW HIGH THE EXPECTATIONS ARE FOR AI. THEY CAME OUT AND THE NUMBERS WERE PRETTY GOOD. REVENUE GREW MORE THAN 30% TO $7.7 BILLION AND THEY HANDILY BEAT ESTIMATES FOR THE SECOND QUARTER AND GAVE A FORECAST FOR THE THIRD QUARTER THAT WAS AHEAD OF ESTIMATES TOO. PRETTY STRONG GROWTH. BUT THE CEO TALKED ABOUT THEIR CHALLENGES IN CHINA. THEY TOOK IT DOWN WHEN THE TRUMP ADMINISTRATION PUT RESTRICTIONS ON EXPORTS TO CHINA. NOW LISA SUE IS SAYING THAT THE CHIP THEY DESIGNED FOR THE CHINA MARKET WILL BE SOLD INTO THE MARKET AT SOME POINT BUT THEY HAVEN'T GOTTEN LICENSES FROM WASHINGTON SO FAR TO SELL THE CHIP SO THEY ARE INCLUDING THAT REVENUE FOR THE FUTURE. IT SOUNDS LIKE THERE IS UPSIDE. MAYBE THE REVENUE FORECAST WOULD GO HIGHER, BUT THE PESSIMISM AROUND NOT BEING ABLE TO GET THOSE LICENSES WAIT ON THE STOCK AND WE ARE SEEING THAT IN EARLY TRADING TODAY. DANI: MAYBE THAT IS SOME OF WHAT SUPERMICRO IS SUFFERING FROM, HIGH EXPECTATIONS OF 88%. I WANT TO ASK ABOUT OPENAI. A 500 BILLION DOLLARS VALUATION, DEFINITELY MAKING IT ONE OF THE MOST RICHLY VALUED COMPANIES THAT ARE PRIVATE IN THIS WORLD. THIS IS A BIG UPTICK. IT SEEMS THERE IS NO STOPPING OPENAI AND ITS MAMMOTH AMOUNTS OF GROWTH. PETER: THERE IS AN IMPORTANT ASTERISK. THEY ARE NOT SELLING NEW SHARES TO NEW INVESTORS. IT IS A SECONDARY SHARE SALE. SO EXISTING AND FORMER EMPLOYEES WOULD BE ABLE TO SELL SOME OF THEIR SHARES AND IT SOME MONEY OFF THE TABLE. IN THE OLD DAYS OF SILICON VALLEY THIS NEVER HAPPENED. VENTURE CAPITALISTS DID NOT WANT TO GIVE THEM HUNDREDS OR BILLIONS OF DOLLARS BECAUSE THEY WANTED THEM TO STAY MOTIVATED AND WANTED THEM TO HAVE ALL OF THEIR FINANCIAL INTERESTS IN MAKING THIS A SUCCESS. THESE DAYS ARE LITTLE DIFFERENT FOR A COUPLE OF REASONS. ONE, COMPANIES ARE STAYING PRIVATE FOR LONGER SO YOU NEED TO GIVE THEM SOME CASH. TWO, A BIGGER ISSUE, THERE IS A FIERCE WAR FOR TALENT IN AI IN SILICON VALLEY. COMPANIES LIKE META, WHO PERCEIVE THEMSELVES AS A LITTLE BEHIND IN AI, ARE AGGRESSIVELY RECRUITING AI ENGINEERS. WE TALKED ABOUT THIS A FEW TIMES BEFORE. THEY ARE SUPER INTELLIGENCE GROUP IS OFFERING MILLIONS PER YEAR, BILLION PER YEAR WAS REPORTEDLY REJECTED. THEY'RE PUTTING CASH IN THE HANDS OF THEIR EMPLOYEES AND WILL HOPEFULLY BE ABLE TO RETAIN A BUNCH MORE OF THEIR EMPLOYEES. THEY LOST A COUPLE OF PEOPLE TO META IN PARTICULAR, SO THIS IS AN EFFORT TO REWARD SOME OF THE WORKFORCE SO THEY WILL BE ABLE TO STICK AROUND AND BUILD A BUSINESS THAT SAM ALTMAN IN THE CREW WANT TO BE ABLE TO BUILD. DANI: IF YOU ARE A PRIVATE COMPANY LIKE OPENAI AND CAN INCREASE THE CASH ON HAND TO RECRUIT TALENT, IS THERE ANY HOPE FOR SOMEONE LIKE APPLE, WHO CONTINUES TO LAG BEHIND IN THEIR SHARE PRICE? THEY HAD A BETTER PERFORMANCE IN THEIR EARNINGS, BUT HOW DO THEY CATCH UP WITH THE AI TALENT RACE WHEN SOMEONE LIKE OPENAI KEN HOOVER ALL OF IT UP ALONGSIDE META? PETER: YOU'RE TOUCHING ON ONE OF THE BIG QUESTIONS OVERHANGING SILICON VALLEY. APPLE IS A TREMENDOUSLY WELL-RESPECTED COMPANY AND HAS FALLEN BEHIND IN AI, TALKING ABOUT COMPANIES THAT PERCEIVE THEMSELVES AS BEHIND IN AI. THEY NEED TO DO SOMETHING AGGRESSIVE. TIM COOK TALKED ABOUT THE OPPORTUNITIES. THEY WANT TO BE A PLAYER AND ARE DETERMINED TO BE A PLAYER. IT'S UNCLEAR HOW THAT HAPPENS. CAN THEY RECRUIT ENOUGH TALENT FROM THE OUTSIDE? DO THEY PERHAPS NEED TO MAKE AN ACQUISITION? THERE ARE A LOT OF AI STARTUPS THEY CAN LOOK TO BUY. THEY HAVE A HUGE MARKET CAP TO RECRUIT EMPLOYEES AND THEY HAVE A GREAT REPUTATION. IF APPLE WANTS TO BE A PLAYER THEY HAVE TO MAKE BIG MOVES. DANI: WE WILL CATCH UP WITH YOU LATER. THAT'S PETER ELSTROM. BANK OF AMERICA TELLS JUNIOR BANKERS, IF YOU TAKE A JOB SOMEWHERE ELSE YOU WILL BE REASSIGNED. WE WILL TELL YOU THE DETAILS ON THAT WORK FOR TALENT COMING UP NEXT ON YOUR BRIEF. ♪ YOU ARE WATCHING BLOOMBERG BRIEF. I'M DANI BURGER IN NEW YORK. LET'S LOOK AT THE FRONT PAGES. THE TOP PUBLICATIONS, THIS ONE ON THE BLOOMBERG, OPENAI IS AN EARLY TALKS ABOUT A POTENTIAL STOCK SALE FOR CURRENT AND FORMER EMPLOYEES THAT WILL GIVE THE COMPANY EVALUATION OF ABOUT 500 BILLION DOLLARS. OPENAI DECLINED TO COMMENT. THE FT IS LEADING WITH SHARES OF BERKSHIRE HATHAWAY ARE UNDERPERFORMING THE BROADER MARKET BY ONE OF THE BIGGEST MARGINS IN DECADES. BERKSHIRE'S CLASS A SHARES HAVE TUMBLED 14% SINCE THE LAST TRADING DAY SINCE WARREN BUFFETT ANNOUNCED HIS RETIREMENT. BERKSHIRE HATHAWAY DID NOT RESPOND TO REQUESTS FOR COMMENTS. PRESIDENT TRUMP THREATENING A FEDERAL TAKEOVER OF D.C. AFTER A FORMER DOGE WORKER WAS ATTACKED. THE ELON MUSK PROTEGE WAS INJURED IN AN ATTEMPTED CARJACKING LAST WEEKEND. THE PRESIDENT SAID THAT IF D.C. DOESN'T GET ITS ACT TOGETHER THE FEDERAL GOVERNMENT WILL RUN THE CITY. LET'S TURN TO THE TALENT WAR ON WALL STREET. LENDERS ARE PUSHING BACK ON AGGRESSIVE EFFORTS TO LURE JUNIOR BANKERS. TELLING JUNIOR BANKERS TO DIVULGE ANY NEW EMPLOYMENT OPPORTUNITIES AND YOU MAY FACE REASSIGNMENT IF YOU ACCEPTED THAT OPPORTUNITY. JOINING US IS TOM METCALF. WHAT IS BANK OF AMERICA DOING? TOM: BASICALLY THEY ARE TRYING TO CLIMB DOWN ON CYCLE RECRUITMENT. JUNIOR BANKERS TO ATTEST THAT THEY DON'T HAVE ANY FUTURE OFFERS. AND IF THEY DO THEY PLAN TO REMOVE THEM TO PERHAPS A LESS HIGH PROFILE ROLES. DANI: WE HAVE SEEN THIS RAMP UP, BUT AT THE SAME TIME YOU'VE HEARD FROM SOME OF THE BIG PRIVATE CAPITAL PLAYERS THAT THEY WOULD WAIT TO START A RECRUITMENT CYCLE. IS IT NOT ENOUGH? ISN'T THE PRESSURE ON FOR BIG BANKS TO RETAIN THEIR EMPLOYEES? TOM: I THINK SO. IT SHOWS HOW EXTENSIVE THE ON CYCLE RECRUITMENT HAS BEEN AND HOW ANGRY THE BANKS ARE ABOUT IT. WE SEE VARIOUS LENDERS REACTING DIFFERENT WAYS. JP MORGAN SAYS THAT WE WILL FIRE PEOPLE WHO ACCEPTED OFFERS WITHIN 18 MONTHS OF JOINING US. SAYING WE DON'T HAVE ANY FUTURE OFFERS OUT THERE. IT IS A BIG PROBLEM, BECAUSE YOU CAN SEE WHY FIRMS ARE DOING IT. IT'S THE BEST WAY TO GET TALENT TRAIN FOR THE LEAST COST. THE BANKS ARE FIGHTING BACK. I THINK WE WILL CONTINUE TO SEE MORE MOVEMENT ON THIS FRONT AS THE BANKS TRY TO DISSUADE THEIR NEWEST EMPLOYEES FROM LITERALLY JUMPING SHIP AS SOON AS THEY CAN. DANI: THE BANKS HAVE ALWAYS SERVED AS A PIPELINE FOR JUNIOR BANKERS. MAYBE IN DECADES PAST IT WAS YOU WORK AT A BANK AND THEN GO TO A HEDGE FUND. THAT CHANGED AS PRIVATE CAPITAL BECAME THE HOT ASSET CLASS. IT HASN'T ALWAYS BEEN AN ISSUE BUT JUST THE FOCUS OF WHO IS THE IRE OF THE BANKS HAS CHANGED? TOM: I THINK IT JUST HAS BEEN MORE EGREGIOUS. ONE OF THE MOST EXTREME EXAMPLES OF PEOPLE WHO TWO TO THREE DAYS IN TO JOINING JOBS AT BANKS AND AGREEING TO JOIN THE PRIVATE EQUITY FIRMS AS SOON AS THEY'RE TRAINING IS DONE. THE SECOND IS, IT HAS PROBABLY ALWAYS BEEN THE CASE IN SOME WAY, BUT IT HAS BECOME MORE APPARENT HOW WIDESPREAD IT IS WITH THE GROWTH OF PRIVATE EQUITY AND PROBABLY REACH THE TIPPING POINT WHERE THE BANKS CAN BASICALLY TAKE IT NO MORE. EVEN THOUGH THE PRIVATE EQUITY FIRMS ARE GIGANTIC CLIENTS FOR THEM, THEY ARE SEEING THEIR OWN TALENT POOL AND FUNDAMENTALLY HOW THEY RUN THE FIRMS IMPACTED BY SUCH RECRUITMENT. DANI: THANK YOU. THAT IS TOM METCALF. A QUICK CHECK ON OIL, BECAUSE WE ARE REBOUNDING UP MORE THAN 1% FOR BRENT AND WTI. IT SEEMS THE THREAT TO RUSSIAN SUPPLIES, THE THREAT TO DONALD TRUMP HAS BEEN SLAPPING SECONDARY TARIFFS ON BUYERS OF RUSSIAN ENERGY. HE SAYS HE CAN IMPOSE THOSE HIGHER TARIFFS. INDIA HAS BEEN A PARTICULAR FOCUS FOR THE PRESIDENT. IT COULD POSSIBLY INCLUDE CHINA AS WELL. THERE IS YOUR OIL PRICE THIS MORNING. THE SEARCH FOR THE NEW FED GOVERNOR. TRUMP SAYS THAT HIS PIC WILL COME BY THE END OF THE WEEK. WE WILL DISCUSS THAT AND MORE WITH NEIL DUTTA OF RENAISSANCE MACRO. THAT IS COMING UP NEXT ON YOUR BLOOMBERG BRIEF. ♪ DANI: IT IS 5:30 A.M. IN NEW YORK CITY. I AM DANI BURGER WITH YOUR BLOOMBERG BRIEF. THE CHIPMAKER'S PLUNGE. AMD SAYS THAT ITS RETURN TO CHINA IS UNKNOWN. SUPERMICRO SHARES DIVE AFTER CUTTING ITS FORECAST. OPENAI IS SAID TO FETCH AN EYE WATERING 500 BILLION DOLLAR VALUATION IN ITS LATEST SHARE SALE. TRUMP SAYS ANNOUNCEMENTS ON CHIPS AND PHARMA LEVIES ARE COMING SOON. WE ARE REBOUNDING AFTER EDGING LOWER YESTERDAY. ONE EXPLANATION FLOATING AROUND IS A MISS ON JULY ISM SERVICES. WE ARE UP BY ONE THIRD. TECH UNDERPERFORMS WITH SOME CHIP STOCKS DOING WORSE. RUSSELL TWO THOUSAND FUTURES OUTPERFORM. YIELDS PUSH HIGHER FOR A SECOND DAY. WE ARE STILL 22 BASIS POINTS LOWER THAN WE WERE LAST THURSDAY. STILL, JUST UNDER 90% ODDS OF A FED CUT. PERHAPS ALSO PRESSURING THIS BOND MARKET WAS ISM DATA SHOWING HEIGHTENED PRICE PRESSURES. THE TWO-YEAR YIELD. THE 10-YEAR YIELD UP TWO BASIS POINTS. WE WILL GET A 10-YEAR AUCTION TODAY. LET'S LOOK AT STOCKS MOVING IN THE PREMARKET WITH VALERIE TYTEL. VALERIE: LET'S START WITH WHY PERHAPS THE NASDAQ FUTURES ARE UNDERPERFORMING BECAUSE OF WEAK RESULTS FROM AMD COME THE WORLD'S SECOND-LARGEST CHIPMAKER. REALLY RELUCTANT TO GIVE ANY GUIDANCE ON CHINA REVENUE. THEY ARE ASKED REPEATEDLY ON THE CONFERENCE CALL BUT THEY ARE UNWILLING TO PUT A NUMBER. IT SEEMS LIKE THEY ARE NOT CONVINCED THAT THEY WILL GET THESE EXPORT LICENSES TO SELL THE CHINA-SPECIFIC CHIP INTO THAT MARKET. AMD IS DOWN OVER 5% SO FAR IN PREMARKET TRADES. STAYING WITH TECH, SUPERMICRO, THEY SELL AI SERVERS AND HARDWARE TO THE LIKES OF NVIDIA. THIS STOCK IS GETTING TORCHED IN THE PREMARKET, DOWN OVER 16%. DANI, THEY'RE PULLING BACK THEIR SALES GUIDANCE AND ARE HAVING ISSUES WITH MARGINS BEING UNDER PRESSURE. SUPERMICRO GAVE A BULLISH OUTLOOK IN THE FIRST QUARTER WITH SALES GUIDANCE NEARLY TWICE WHAT ANALYSTS HAD ASSUMED, AND THEY ARE WALKING THAT BACK TO THE SHARE'S DEMISE. THINGS THAT WE CAN LOOK FORWARD TO, WE HAVE TWO BIG COMPANIES THAT ARE REPORTING BEFORE THE BELL IN AROUND AN HOUR AND A HALF. THE FIRST IS DISNEY. THE SHARES ARE UP 2.7 PERCENT IN PREMARKET. THERE WAS NEWS OVERNIGHT ABOUT A TIE UP WITH DISNEY' IS ESPN AND THE NFL MEDIA ASSETS. UBER IS REPORTING, THE FIRST OF THE GIG REPORT. DANI: PRESIDENT TRUMP IS RAMPING UP HIS TARIFF RHETORIC, WARNING OF HIGHER LEVIES FOR COMPANIES BUYING OIL FROM RUSSIA AND HITTING ON ANNOUNCEMENTS ON CHIPS AND PHARMACEUTICALS IN THE NEXT WEEK OR SO. JOINING US IS SUZANNE LYNCH. WHAT CAN WE EXPECT FROM THE PRESIDENT? SUZANNE: MORE RATCHETING UP BY THE PRESIDENT ON TARIFFS AND THERE ARE A COUPLE OF TRADING PARTNERS IN THE FIRING LINE. ONE IS INDIA. HE ALREADY THREATENED A 25% TARIFF ON INDIA AND IS NOW THREATENING MORE, ACCUSING INDIA OF FACILITATING THE PURCHASE OF RUSSIAN ENERGY EXPORTS. SWITZERLAND, NOT A MEMBER OF THE EUROPEAN UNION, BUT THE SWISS WERE HIT WITH A HUGE TARIFF OF 39%. WE HAVE SEEN THAT THE SWISS PRESIDENT IS NOW IN WASHINGTON DO MEET WITH THE SECRETARY OF STATE MARCO RUBIO TODAY. BUT NO NEWS OF ANY FURTHER MEETINGS WITH ANYONE MORE IN THE ECONOMIC OR TRADE SPACE. SO, A LOT OF NERVOUSNESS AROUND THE WORLD ABOUT THIS CONTINUOUSLY CHANGING AND DEVELOPING TRADE STRATEGY COMING FROM THE WHITE HOUSE. DANI: THE OTHER THING WE MIGHT GET THIS WEEK IS A FED REPLACEMENT FOR ADRIANA KUGLER. PRES. TRUMP: FED GOVERNOR? I WILL BE MAKING THAT DECISION BEFORE THE END OF THE WEEK, AND WE WILL EITHER DECIDE ON ONE FOR PERMANENTS OR THE FOUR-MONTH PERIOD, THE TERM. THERE IS A TERM OF ABOUT A NUMBER OF MONTHS. WE HAVE A COUPLE OF CANDIDATES. EVERYONE WANTS IT, IT'S NOT A COUPLE, BUT WE'VE NARROWED IT TO A COUPLE OF CANDIDATES. ALSO, WE ARE LOOKING AT THE FED CHAIR, AND THAT IS DOWN TO FOUR PEOPLE RIGHT NOW. DANI: WHAT ARE YOU LOOKING OUT FOR? SUZANNE: WHAT IS INTERESTING IS THAT THE WHITE HOUSE HAS ANNOUNCED, AN ANNOUNCEMENT BY PRESIDENT TRUMP AT 4:30 P.M. TODAY. WILL IT BE THAT OR SOMETHING ON TRADE? THE KEY QUESTION IS, WILL DONALD TRUMP APPOINT SOMEONE FOR THIS SURPRISE VACANCY? THAT IS A KEY THING TO WATCH. OBVIOUSLY, THE PRESIDENT HAS BEEN VERY CRITICAL OF THE CURRENT FED POLICY WHEN IT COMES TO INTEREST RATES AND HAS MADE NO SECRET OF THE FACT THAT HE ISN'T HAPPY WITH THE JEROME POWELL THERE. THAT WOULD BE ONE THING TO WATCH ON THAT. THEN, WE WOULD LOOK AT MARKET REACTION. ANYTHING THAT IS SEEN AS INTERFERING OR SHAPING THE INDEPENDENCE OF THE FED IS SOMETHING THAT THE MARKETS WILL BE WATCHING CLOSELY, EVEN THOUGH EXPECTATIONS OF AN INTEREST RATE CUT NEXT MONTH HAVE INCREASED SINCE LAST WEEK'S JOBS REPORT. DANI: EARLIER THIS WEEK I ASKED THE FORMER NEW YORK FED PRESIDENT BILL DUDLEY ABOUT THE POTENTIAL SURROUNDING TRUMP'S APPOINTMENTS AT THE FED. BILL : IF YOU HAVE FOUR GOVERNORS LINED UP ON ONE SIDE THAT GIVES THE CHAIR MOMENTUM TO GET HIS/HER WAY. I THINK THE PRESIDENTS WILL CONTINUE TO VOTE THEIR CONSCIENCE WHAT IS RIGHT FOR THE MACROECONOMY. DANI: JOINING US IS NEIL DUTTA, THE HEAD OF U.S. ECONOMIC RESEARCH AT RENAISSANCE MACRO. WONDERFUL TO SEE YOU. DUDLEY EARLIER SAYING THAT THE FED IS UNDER SIEGE, BUT IT WILL BE FINE. WHAT ARE YOU LOOKING OUT FOR WITH PRESIDENT TRUMP SAYING THAT HE WILL MAKE AN ANNOUNCEMENT OF KUGLER'S REPLACEMENT THIS WEEK? NEIL: WELL, I THINK -- YOU KNOW, IT'S INTERESTING THAT HE IS BASICALLY WILLING TO APPOINT SOMEONE FOR A MATTER OF MONTHS. I'M CURIOUS TO SEE IF THEY ARE ABLE TO SPEED UP THE PROCESS QUICKLY ENOUGH TO GET SOMEONE SEATED IN TIME FOR THE SEPTEMBER MEETING. IT'S IMPORTANT TO KNOW THAT THERE REMAINS A PRETTY STRONG WELL OF, YOU KNOW, PARTICIPANTS ON THE FOMC THAT ARE NOT LINED UP IN FAVOR OF A CUT. WHOEVER PRESIDENT TRUMP PUTS IN WILL HAVE A LOT OF CONVINCING TO DO HAVE THEIR NEW COLLEAGUES. THAT'S WHAT IS IMPORTANT. YOU CAN'T EXERT YOUR WILL, YOU HAVE TO PERSUADE PEOPLE TO YOUR SIDE. IT IS A CONSENSUS. IT IS IMPORTANT TO KNOW THAT JUST BECAUSE THE PRESIDENT IS ABLE TO FILL THE SEAT QUICKLY, IT'S NOT IMMEDIATELY CLEAR THAT THAT PERSON WILL BE ABLE TO EFFECT THE CHANGE THAT HE WANTS. DANI: DOES THE PERSON ITSELF MAKE A DIFFERENCE? IF IT IS ONE OF THE KEVINS, SOMEONE ELSE, SOMEONE OUTRIGHT POLITICAL, ARE YOU ABLE TO BRUSH IT OFF? NEIL: WE DON'T KNOW WHO THIS PERSON -- IS THIS PERSON GOING TO BE A KUGLER REPLACEMENT? THAT TERM IS UP IN JANUARY. SO, YOU HAVE TO GO THROUGH THIS PROCESS AGAIN. POWELL'S TERM IS UP IN MAY. HE MAY DECIDE TO STAY ON AND CONTINUE THE REMAINING TERM AS GOVERNOR. THAT'S SOMETHING THAT IS POSSIBLE. SO, THERE IS A LITTLE BIT OF A LOGISTICAL HURDLE. I WOULD SAY THAT IF IT LOOKS LIKE IT'S SOMEONE JUST GOING IN THERE TO DO THE PRESIDENT'S BIDDING, THAT PERSON WILL BE ABLE TO EFFECT THE CHANGE THAT HE WANTS, BECAUSE THAT PERSON WON'T BE ABLE TO CONVINCE ANYONE ABOUT THEIR POSITION. DANI: DO YOU ASSUME THE SAME RESILIENCE WILL HOLD TRUE WITH AN APPOINTMENT AT THE HEAD OF THE BLS TOO? NEIL: THIS IS PART OF THE CHALLENGE. THE TIMING WAS SOMEWHAT SUSPECT, AND AS A RESULT THE PERSON THEY END UP PUTTING IN -- WHAT IF, DANI, WHAT IF THE EMPLOYMENT NUMBERS DON'T IMPROVE? BELIEVE IT OR NOT JULY OVER THE LAST NUMBER OF YEARS, EXCLUDING THE PANDEMIC, JULY TENDS TO BE REVISED DOWN. WHAT IF YOU PUT SOMEONE IN AND THEY TELL YOU THE SAME THING ABOUT THE JOBS MARKET? THE PEOPLE ARE NOT ENTHUSIASTIC ABOUT THE JOBS MARKET WHEN YOU POLL CONSUMERS. NOW YOU HAVE YOUR OWN HAND-PICKED PERSON TELLING YOU THINGS ARE BAD? THAT OPENED YOU UP TO POLITICAL ATTACK FROM THE OTHER SIDE, IT MORE SALIENCE. THEY ARE TRYING TO PIVOT TO MAKING THIS ABOUT IMPROVING THE STATISTICS, IMPROVING THE COLLECTION. WE WILL SEE IF THAT LINE OF ARGUMENT CAN STICK. I DO THINK IT UNDERCUTS CONFIDENCE A LITTLE BIT. DANI: THEY HAVE BEEN TRYING TO CHANGE THEIR MESSAGE FROM WHAT PRESIDENT TRUMP SAID THOUGH HE DID SAY IT WAS RIGGED YESTERDAY ON CNBC. CONSIDERING THE DATA AND WE COULD GET ANOTHER DOWNWARD REVISION IN JULY, THERE IS A NARRATIVE THAT YOU HAVE PUSHED BACK ON. SOMETHING LIKE IT IS A POST LIBERATION DAY FALLOUT AND THE WEAKER JOB NUMBERS THAT WE'VE SEEN, AND CONSIDERING THINGS HAVE SETTLED DOWN IN TARIFF RATES WE WILL GET A REBOUND IN AUGUST. WHY ARE YOU PUSHING BACK? NEIL: THAT ASSUMES THE UNCERTAINTY AROUND THE TARIFFS AS OPPOSED TO THE TARIFFS THEMSELVES MATTER. THE UNCERTAINTY HAVE BEEN COMING DOWN AT THE MARGIN. YOUR OWN REPORTER JUST TALKED ABOUT HOW THERE ARE ADDITIONAL SKIRMISHES IN FRONT OF US WITH A NUMBER OF COUNTRIES. AGAIN, THAT ASSUMES THAT THE UNCERTAINTY AROUND THE TARIFFS RATHER THAN THE TARIFFS THEMSELVES ARE WHAT MATTER, AND WE KNOW THE EFFECT OF TARIFF RATE CONTINUES TO GO HIGHER OVER THE SUMMER AS THE CUSTOMS AGENCIES ALIGN COLLECTIONS TO WHAT HAS ACTUALLY BEEN ANNOUNCED BY THE PRESIDENT. THAT MEANS THERE IS MORE REVENUE GOING INTO THE TREASURY, WHICH ULTIMATELY MEANS THERE IS MORE POTENTIAL FOR PASS-THROUGH TO BUSINESSES AND CONSUMERS FROM TARIFFS. ULTIMATELY, IF THAT IS NOT PASSED ON TO CONSUMERS IT WILL MEAN A MARGIN SQUEEZE FOR THE COMPANYS AND COMPANIES WILL HAVE TO DEAL WITH THE MARGIN SQUEEZE SOMEHOW. DANI: IS THE LABOR MARKET DATA FOR ENOUGH, IS THE IMPACT ENOUGH TO LOOK THROUGH WHAT WE MAKE IT ON INFLATION? SOMETHING LIKE WE SAW IN THE ISM DATA WHERE WE SAW WEEK SERVICES BUT PRICES PAID WAS HIGHER? IS THE WEAKNESS IN TERMS OF THE LABOR MARKET ENOUGH TO LOOK THROUGH THE INFLATIONARY THREAT AND GET CUTS FROM THE FEDERAL RESERVE THIS YEAR? NEIL: I THINK SO. THAT'S WHY I'VE BEEN ADVOCATING FOR CUTS. TO ME IT IS JUST NOMINAL INCOME GROWTH, NOMINAL GROWTH IS SLOWING. IF YOU HAVE AN NOMINAL ENVIRONMENT OF BARELY 4% ON A GOOD DAY, THEN IT'S DIFFICULT TO SEE HOW COMPANIES CAN PASS ON PRICE INCREASES WITHOUT FINDING INCREASING RESISTANCE TO THE VOLUME OF GOODS THAT THEY ARE SELLING. THE RISK IS IF THEY END UP DECIDING TO PASS THE PRICE INCREASES ON BECAUSE THEY THINK THAT THE CONSUMER IS IN BETTER SHAPE THAN IT IS, YOU WILL SEE VOLUMES OF GOODS COME DOWN. WHATEVER GOES INTO PRICE BECAUSE OF TARIFFS WILL COME OUT OF QUANTITY, THAT WILL MEAN THAT REAL GROWTH COMES UNDER SIGNIFICANT PRESSURE IN THE BACK HALF OF THE YEAR. DANI: YOU HAVE BEEN EXCELLENT TALKING ABOUT SOME OF THE AI IMPACTS, SPECIFICALLY ON WHAT IT DOES TO UTILITIES, AND MOST PEOPLE IF THEY HAVE TO PAY MORE MONEY. I FIND THIS FASCINATING, BECAUSE IF THIS IS HAPPENING AT A TIME WITH A BOOMING STOCK MARKET AND AI BOOM, YOU HAVE NORMAL PEOPLE HAVING TO PAY MORE FOR ENERGY. IS THIS THE MOST REGRESSIVE ECONOMIC EVENT WE ARE ABOUT TO WITNESS? THIS AI BOOM? NEIL: SOME HAVE SAID THAT MAY WELL BE. THIS IS NOT LIKE THE 1990'S TECH BOOM. BACK THEN YOU HAD A BUNCH OF COMPANIES TRYING TO IPO, A LOT OF NEW COMPANIES. THEY BASICALLY HIRED A LOT OF PEOPLE TO SHOW WALL STREET. AND NOW YOU HAVE MORE MATURE COMPANY SPENDING A LOT OF MONEY ON AI AND NOT NECESSARILY HIRING THAT MUCH. IF INVESTMENT SPENDING IS GOING TO BE GOOD, IT IS ULTIMATELY GOING TO LIFT PRODUCTIVITY AND REAL WAGES WHICH WILL HELP CONSUMER SPENDING. THAT HASN'T HAPPENED AS OF YET. IN THE SHORT RUN, YOU JUST HAVE TO FOLLOW THE DATA. IN THE SHORT RUN THERE ARE SOME COSTS THAT ARE LIKELY TO GO UP AS A RESULT OF WHAT'S HAPPENING. ENERGY'S CHIEF AMONG THEM. PEOPLE HAVE TALKED ABOUT THIS, BUT IT IS KIND OF CARTING O -- CARDING OUT CERTAIN SECTORS OF THE ECONOMY. AI ACTUALLY ADDED MORE TO GDP GROWTH THAN CONSUMPTION IN THE FIRST HALF OF THE YEAR, A HIGHLY UNUSUAL SITUATION. DANI: I WANTED TO ASK ABOUT THE RISK OF CROWDING OUT, BUT ALSO THAT THE AI BOOM ITSELF COULD PREVENT THE FED FROM LOWERING INTEREST RATES GIVEN SOME OF THE FORCES THAT YOU ARE TALKING ABOUT AND SOME OF THE INFLATIONARY GROWTH THAT AI COULD HAVE GIVEN ITS BUILDOUT? NEIL: LOOK, THERE IS CLEARLY A WEALTH EFFECT ASSOCIATED WITH AI. EVERY TIME THAT A COMPANY ANNOUNCES THEY ARE SPENDING MORE ON AI THEIR STOCK POPS. BECAUSE THE TECH COMPANIES HAVE SUCH AN OUTSIZED IMPACT ON THE S & P, THE BENCHMARK INDEXES SURGE , SO THERE IS A WEALTH EFFECT. BUT GUESS WHAT. STOCK MARKETS HAVE BEEN GOING UP FOR A WHILE. THAT HASN'T STOPPED THE HOUSING MARKET FROM BEING VERY, VERY WEAK. THAT HASN'T STOPPED INCREASING SLACK IN THE JOB MARKET. PRIME AGE EMPLOYMENT RATES ARE DOWN. THAT HASN'T STOPPED COMMERCIAL REAL ESTATE OUTSIDE OF DATA CENTER CONSTRUCTION FROM CONTRACTING. WHY ARE ALL OF THESE AREAS OF THE ECONOMY THAT ARE SENSITIVE TO MONETARY AND FINANCIAL CONDITIONS SO WEAK? I THINK THAT THERE IS A DISTINCTION HERE BETWEEN FINANCIAL MARKET CONDITIONS AND THE FINANCIAL CONDITIONS THAT PEOPLE FEEL. IF YOU LOOK AT THE FEDERAL SENIOR LOAN OFFICER SURVEY RELEASED EARLIER THIS WEEK, ON NET BANKS CONTINUE TO REPORT THAT THEY ARE TIGHTENING LENDING STANDARDS MODESTLY ON SEE NI LOANS, CRE LOANS, CREDIT CARD LOANS, AND ARE NOTING THAT DEMAND FOR SOME OF THESE THINGS IS WEAKENING. I SORT OF REJECT THE IDEA THAT JUST BECAUSE STOCKS ARE HIGH FINANCIAL CONDITIONS ARE EASY. THAT IS JUST ONE PART OF IT. IT'S NOT -- IT'S NOT WIDELY SPREAD. IN TERMS OF THE EQUITY WEALTH GROWTH. DANI: IT IS A GREAT POINT AND MAY BE ONE OF MANY REASONS THAT YOUR NAME HAS BEEN FLOATED AROUND IN THE FED SPEAK. WILL WE HAVE TO ADDRESS YOU AS GOVERNOR DUTTA NEXT TIME WE TALK? NEIL: I REALLY DOUBT THAT. I WOULD TEND TO LEAN AGAINST THE POSSIBILITY, BUT STRANGER THINGS HAVE HAPPENED. DANI: NEIL, WE WOULD ALL BE SO LUCKY IF THAT IS THE FATE THAT THE CARDS HAD DEALT. LET'S GET YOU OTHER TOP STORIES TRENDING ON THE TERMINAL. U.S. SPECIAL ENVOY STEVE WITKOFF HAS ARRIVED IN MOSCOW FOR TALKS WITH OFFICIALS TODAY COMING AS THE WHITE HOUSE IS RACING TO BEAT ANOTHER SELF-IMPOSED DEADLINE OF AUGUST 8 TO RESOLVE RUSSIA'S WERE IN UKRAINE. BLOOMBERG SERVICES SAY THE KREMLIN MAY OFFER WASHINGTON CONCESSIONS THAT COULD INCLUDE STOPPING AIRSTRIKES IN A BID TO AVERT NEW ECONOMIC PENALTIES. SHARES OF NOVO NORDISK ARE DECLINING AFTER THE WEAKEST GROWTH IN FOUR YEARS. THE DANISH DRUGMAKER IS LOSING GROUND TO ELI LILLY IN THE U.S. MARKET FOR OBESITY MEDICINES. THE REVENUE GROWTH OF 13% IN THE SECOND QUARTER IS THE SMALLEST GAIN SINCE 2021. THE COMPANY POSTED A PROFIT MORNING LAST WEEK. GLENCORE HAS CANCELED ITS PLANS TO MOVE ITS PRIMARY LISTING TO NEW YORK, STAYING IN LONDON INSTEAD. THE CEO GARY NOW COLE SAID THAT GLENCORE WAS ON -- GARY NAGEL WAS UNABLE TO GO. IT WOULD HAVE BEEN A BLOW TO LONDON WHICH HAS LOST A QUARTER OF ITS COMPANIES IN THE LAST DECADE. HAVE A TRILLION DOLLARS WOULD BE THE VALUATION FOR OPENAI AFTER A POTENTIAL SHARE SALE. STAY WITH US. THIS IS BLOOMBERG. ♪ DANI: YOU ARE WATCHING BLOOMBERG BRIEF, I AM DANI BURGER IN NEW YORK. THE AI SECTOR IS CONTINUING TO HEAT UP. BLOOMBERG HAS LEARNED THAT OPENAI IS IN EARLY TALKS FOR SECONDARY SHARE SALE THAT COULD VALUE THE COMPANY AT AROUND 500 BILLION DOLLARS. LET'S BRING BACK OUR EXECUTIVE EDITOR FOR GLOBAL TECHNOLOGY. IT IS WILD GROWTH THAT CONTINUES AT OPENAI. PETER: A VERY INTERESTING STORY, BLOOMBERG EXCLUSIVE. THE COMPANY IS LOOKING AT DOING A SECONDARY SHARE SALE WHERE THEY WILL LET CURRENT AND FORMER EMPLOYEES SELL SOME OF THEIR STOCK. THE VALUATION THEY ARE TARGETING IS 500 BILLION DOLLARS UP FROM $300 BILLION IN MARCH/APRIL OF THIS YEAR WHEN THEY RAISED $40 BILLION IN THE RECORD FUNDRAISING ROUND THAT THEY HAD AT THE TIME. IT'S A SIGN THAT CERTAINLY INSIDE OF THE COMPANY THEY ARE ANTICIPATING THAT THAT VALUATION WILL CLIMB QUITE SHARPLY. WE HAVE SEEN THAT IN THE REST OF THE MARKET WITH SOME OF THE OTHER STARTUPS. IT'S A CHANCE FOR THEM TO REWARD SOME OF THESE EMPLOYEES WHO ARE IN THE MIDDLE OF A VERY SERIOUS TALENT WAR WHERE OTHER COMPANIES, LIKE META, ARE AGGRESSIVELY TRYING TO RECRUIT THEM. IT'S A WAY TO KEEP SOME EMPLOYEES INSIDE THE HOUSE. DANI: WE HAD EARNINGS AFTER THE BELL OF AMD, LOOKING AT SHARES FALLING. LISTEN TO WHAT LISA SU COME THE CEO OF AMD, SAID. > > EARLIER THIS QUARTER WE WERE NOTIFIED BY THE DEPARTMENT OF COMMERCE IT IS MOVING FORWARD WITH THE REVIEW OF OUR LICENSE APPLICATIONS TO EXPORT MI308 TO CHINA. AS OUR LICENSES ARE STILL UNDER REVIEW, WE ARE NOT INCLUDING ANY MI308 REVENUE IN OUR THIRD QUARTER GUIDANCE. DANI: TO WHAT DEGREE DID THAT OVERSHADOW OTHER RESULTS AT AMD? PETER: THAT WAS THE CONCERN FROM INVESTORS AFTER THE CALL YESTERDAY. WE WILL HAVE LISA SU ON LATER ON AND SHE CAN TALK MORE ABOUT THIS. THE NUMBERS WERE ACTUALLY VERY GOOD BEATING ESTIMATES IN REVENUE FOR THE SECOND QUARTER AND GIVING A FORECAST THAT WAS. VERY STRONG ON TOP OF THAT, LISA SU IS SAYING THAT THE MI308 DESIGNED FOR THE CHINA MARKET HAS NOT GOTTEN ANY LICENSES FROM WASHINGTON SO THEY DON'T WANT TO COUNT REVENUES BEFORE THEY FIND OUT EXACTLY IF THEY WILL BE ABLE TO SELL INTO THE CHINA MARKET. MOSTLY, I WOULD SAY THAT THAT SOUNDS LIKE UPSIDE FOR THE COMPANY. IF THEY ARE ABLE TO SELL CHIPS INTO CHINA THAT WOULD ADD TO THE REVENUES THEY'VE GOT. THIS IS SIMILAR TO THE SITUATION WITH NVIDIA WITH THE H-20 SHIP THAT WAS BANNED AND IS NOW ABLE TO BE SOLD INTO CHINA BUT YOU NEED TO GET A LICENSE FROM WASHINGTON. NVIDIA AND AMD ARE BOTH COMPETITORS IN THIS HOT AI TRIP MARKET AND NEED LICENSES FROM WASHINGTON BEFORE THEY CAN SELL INTO CHINA. THERE IS A CAVEAT. CHINA RAISED CONCERNS ABOUT WHETHER THEY WANT TO GET THOSE CHIPS, THE H20 WITH NVIDIA, BUT IT COULD ALSO AFFECT AMD. THEY SAY THEY AREN'T CRAZY ABOUT GETTING THE CHIPS IF THEY HAVE THE CONDITIONS WASHINGTON IS TALKING ABOUT WHERE YOU CAN TRACK THEM OR THERE MAY BE SOME SECURITY ISSUES WITH THE CHIPS. DANI: PETER ELSTROM ON THE CHIP MAKERS. SHARES OF DISNEY ARE RISING IN THE PREMARKET. ITS SUBSIDIARY ESPN HAS ANNOUNCED THAT IT WILL ACQUIRE THE NFL NETWORK AND OTHER MEDIA ASSETS IN EXCHANGE FOR A 10% EQUITY STAKE IN ESPN. DISNEY ALSO REPORTS TODAY. WHAT IS THE LOGIC BEHIND THIS ARRANGEMENT BETWEEN THE NFL NETWORK AND ESPN? > > THIS HAS BEEN, AS YOU SAID, GOING ON FOR A WHILE. WHAT THIS DOES AND WHY THIS IS SO GOOD STRATEGICALLY FROM DISNEY'S STANDPOINT IS THAT IT FUTURE PROOFS ESPN'S BUSINESS. THEY ARE THE DOMINANT SPORTS PROPERTY BUT THERE IS SO MUCH COMPETITION RIGHT NOW, NOT JUST FROM OTHER MEDIA HOUSES LIKE COMCAST AND NBC C, BUT FROM THE TECH PLAYERS LIKE AMAZON AND APPLE. THE NFL HAS MEDIA DEALS NOW WITH ALL OF THESE PLAYERS, INCLUDING DISNEY, CBS, AND FOX, BUT THEY HAVE AN OPT OUT CLAUSE THAT IS A HUGE OVERHANG THAT ALLOWS THEM TO GET OUT OF THEIR DEALS AFTER THE 2029-2030 SEASON. THIS ENSURES THAT ESPN WILL PROBABLY HAVE FIRST PICK -- IT DEFINITELY PROTECTS THEIR RIGHTS IN THE EVENT THAT THE NFL OPTS OUT OF DEALS WITH OTHER MEDIA PARTNERS. I THINK IT'S A GOOD WAY FOR DISNEY TO FUTURE PROOF THEIR BUSINESS WITH ONE OF THE MOST WELL-KNOWN AND POPULAR FRANCHISES IN TERMS OF SPORTS. DANI: ALL OF THAT AHEAD OF THEIR RESULTS BEFORE THE MARKET OPENED. WHAT ARE YOU LOOKING FOR? > > THERE HAS BEEN A TURN IN SENTIMENT. THE BIG THINGS WE ARE LOOKING FOR ARE THE PARKS SEGMENT. THERE HAS BEEN SOME CONCERN ABOUT MACRO FEARS. THE CONCERN IS THE OPENING OF COMCAST UNIVERSAL'S EPIC UNIVERSE IN FLORIDA AND IF THAT WOULD HAVE ANY ADVERSE IMPACT ON DISNEY THEME PARK ATTENDANCE. I THINK IT HAS BEEN LESS THAN FEARED. IF THERE WAS ANY DECLINE IN ATTENDANCE IT WAS MODEST. WHAT WE HAVE HEARD GENERALLY IS THAT IT HAS BEEN MORE ADDITIVE. MORE PEOPLE HAVE COME INTO FLORIDA AND IT HAS BEEN GOOD FOR DISNEY PARKS. WE ARE EXPECTING TO SEE HIGH SINGLE DIGITS. THE OTHER THING HAS BEEN THE STREAMING BUSINESS, THE NARRATIVE GOING AROUND ALL OVER THE MEDIA INDUSTRY, THE EMPHASIS ON STREAMING PROFITABILITY AND WE EXPECT DISNEY TO OUTPERFORM THEIR AS WELL GIVEN THAT THEY HAVE INTEGRATED HULU, COMPLETELY OWN HULU AFTER PURCHASING IT FROM COMCAST. DANI: GEETHA RANGANATHAN OF BLOOMBERG INTELLIGENCE. WE WILL GET MCDONALD'S AND OVER AND THEN FED SPEAK FROM GOVERNOR COOK, COLLINS, AND IT DAILY THROUGHOUT THE AFTERNOON. PRESIDENT TRUMP IS EXPECTED TO MAKE AN ANNOUNCEMENT AT FOUR: 30 PM FROM THE OVAL OFFICE. NO FURTHER DETAILS, BUT HE SAID THIS WEEK HE WOULD ANNOUNCE EVERYTHING FROM THE FED PICK TO THE BLS CHIEF. WILL WE GET THAT? A QUICK CHECK ON MARKETS AS WE GO TO THE END OF THE HOUR. HIGHER NYMEX CRUDE WITH TRUMP THREATENING SECONDARY SANCTIONS ON BUYERS OF RUSSIAN OIL. IS THAT PART OF SENDING YIELDS HIGHER BY 2.5 BASIS POINTS? 4.2355 IS WHERE YOUR 10-YEAR YIELD IS THIS MORNING. THAT IS IT FOR BLOOMBERG BRIEF. \"SURVEILLANCE\" WILL TAKE THINGS HERE. YOU ARE WATCHING BLOOMBERG TV. ♪",
  "medium": "Video",
  "links": [],
  "labels": [
    {
      "name": "Non-news"
    }
  ],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "U.S. COMPANIES",
      "weight": 0.054108493
    },
    {
      "name": "MORE MATURE COMPANY",
      "weight": 0.05371642
    },
    {
      "name": "STOCK MARKETS",
      "weight": 0.053531516
    },
    {
      "name": "OTHER COMPANIES",
      "weight": 0.052680872
    },
    {
      "name": "PRESIDENT TRUMP",
      "weight": 0.05206631
    },
    {
      "name": "NEW COMPANIES",
      "weight": 0.049140405
    },
    {
      "name": "MORE PEOPLE",
      "weight": 0.048211336
    },
    {
      "name": "FINANCIAL MARKET CONDITIONS",
      "weight": 0.046649355
    },
    {
      "name": "MARKETS",
      "weight": 0.04630458
    },
    {
      "name": "MORE REVENUE",
      "weight": 0.0457594
    }
  ],
  "topics": [
    {
      "name": "AI"
    }
  ],
  "categories": [
    {
      "name": "Politics"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Politics/Other",
      "score": 0.9375
    },
    {
      "name": "/Law & Government/Government/Executive Branch",
      "score": 0.91748046875
    },
    {
      "name": "/News/Business News/Company News",
      "score": 0.67333984375
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.65966796875
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.615234375
    },
    {
      "name": "/Business & Industrial/Pharmaceuticals & Biotech",
      "score": 0.334228515625
    }
  ],
  "sentiment": {
    "positive": 0.03503418,
    "negative": 0.84716797,
    "neutral": 0.11773682
  },
  "summary": "The World's second-LARGest ChIPMAKER, OpenAI (OpenAI), is in Share Sale Talks and is set to receive a $500 BILLION valuation in its latest share sale. The company's return to China is still uncertain as it seeks Exports Licensing Licenses to China. President Trump is expected to announce Tariffs on Chip, Pharma Tariffs soon. Meanwhile, AMD, the world’s second-largest chip manufacturer, fell over 5% in premarket, with the stock trading down 5%. Meanwhile, SUPERMICRO, a maker of AI software, saw a drop in its FORECAST following cutting its forecast for the second half of the year, causing a 16% drop in the pre-market market. The article also discusses a 10-year auction for OpenAI.",
  "shortSummary": "Openai shares plummet over $500 million amid plummeting prices, AMD shares plummet, and SUPERMICRO shares plummet as investors question the long-term prospects for future growth.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": false,
  "reprintGroupId": "b733d07c783047d0829da0e41d311299",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "AMD's shares fell over 5% in premarket trading due to uncertainty regarding export licenses for its chips to China, while Supermicro's stock plummeted over 16% after it cut its sales forecast. OpenAI is reportedly pursuing a secondary share sale that could value the company at $500 billion, reflecting its rapid growth amidst a competitive AI talent market. President Trump is expected to announce new tariffs on pharmaceutical imports and energy from Russia, contributing to market volatility.",
  "argos_id": "GL72QPMRU"
}