{
  "url": "https://www.morningstar.com/news/business-wire/20250812060553/dlp-capital-named-to-inc-5000-list-of-fastest-growing-companies-for-13th-consecutive-year",
  "authorsByline": "",
  "articleId": "91909a542adf4f6cb1e822bb8c61be6a",
  "source": {
    "domain": "morningstar.com",
    "location": {
      "country": "us",
      "state": "IL",
      "county": "Cook County",
      "city": "Chicago",
      "coordinates": {
        "lat": 41.8755616,
        "lon": -87.6244212
      }
    }
  },
  "imageUrl": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
  "country": "us",
  "language": "en",
  "pubDate": "2025-08-12T01:31:00-05:00",
  "addDate": "2025-08-12T07:13:06.645786+00:00",
  "refreshDate": "2025-08-12T07:13:06.645787+00:00",
  "score": 1.0,
  "title": "DLP Capital Named to Inc. 5000 List of Fastest Growing Companies for 13th Consecutive Year",
  "description": "DLP Capital Named to Inc. 5000 List of Fastest Growing Companies for 13th Consecutive Year",
  "content": "DLP Capital Named to Inc. 5000 List of Fastest Growing Companies for 13th Consecutive Year\n\nDLP Capital, a private real estate investment firm headquartered in Florida and Pennsylvania, announced today that it has been named to the Inc. 5000 list of America’s fastest-growing private companies for the 13th year in a row.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250812060553/en/\n\nThe Inc. 5000, published once per year by the New York City-headquartered Inc. Magazine, is an annual ranking of the nation’s fastest-growing companies as measured by cumulative revenue growth over the past three years. To be eligible for the 2025 Inc. 5000, companies must be “privately held, for profit, based in the U.S., and independent.” In addition, contenders must have generated no less than $100,000 in revenue in 2021 and at least $2 million in revenue in 2024 to qualify.\n\n“To be on the Inc. 5000 for 13 years is a rare and remarkable feat,” says Don Wenner, founder and CEO of DLP Capital. “It’s an affirmation of the resounding demand for attainable workforce housing across the country, and a testament to the lasting dedication and trust that our investors, sponsors, residents, and employees have put in us.”\n\nThis year, DLP ranked #3,821 on the Inc. 5000, #344 in Florida, and #86 in the real estate category. “Disciplined thought, disciplined people, and disciplined action have led us to where we are today,” says Wenner. “Looking ahead, we aim to multiply our impact on America’s housing crisis by bringing Thriving Communities to life across our expanding portfolio of multifamily, build-to-rent, manufactured, and short-term vacation rental homes.”\n\nDLP Capital joins an exclusive cohort of companies that have managed to grow despite inflationary headwinds, high interest rates, and mounting economic uncertainty. This year, the top 500 companies on the Inc. 5000 list achieved a median three-year revenue growth rate of 1,552% and collectively contributed over 48,000 jobs to the American economy during the same period.\n\nInc. magazine will honor this year’s awardees at the Inc. 5000 Conference & Gala, which will be held in Phoenix, Arizona from October 22–24, 2025. The Fall issue of Inc. magazine will feature the top 500 companies from the Inc. 5000 list.\n\nAbout DLP Capital: DLP Capital is a St. Augustine, FL and Bethlehem, PA-headquartered private real estate investment firm with over $5.25 billion in assets under management (AUM). Through its four sponsored funds, the firm invests, develops, finances, and operates attainable multifamily and single-family rental housing communities for America’s working families. Founded in 2006 by Don Wenner in Pennsylvania’s Lehigh Valley, DLP Capital is a thirteen-time Inc. 5000 honoree, most recently in 2025.",
  "medium": "Article",
  "links": [
    "https://www.businesswire.com/news/home/20250812060553/en/"
  ],
  "labels": [],
  "claim": "",
  "verdict": "",
  "keywords": [
    {
      "name": "Inc. magazine",
      "weight": 0.10348614
    },
    {
      "name": "Inc.",
      "weight": 0.09951629
    },
    {
      "name": "Inc. Magazine",
      "weight": 0.09903138
    },
    {
      "name": "DLP Capital",
      "weight": 0.09140106
    },
    {
      "name": "Fastest Growing Companies",
      "weight": 0.08794085
    },
    {
      "name": "13th Consecutive Year",
      "weight": 0.08359225
    },
    {
      "name": "attainable workforce housing",
      "weight": 0.07598984
    },
    {
      "name": "year",
      "weight": 0.07371614
    },
    {
      "name": "companies",
      "weight": 0.073167846
    },
    {
      "name": "cumulative revenue growth",
      "weight": 0.07089073
    }
  ],
  "topics": [],
  "categories": [
    {
      "name": "Business"
    },
    {
      "name": "Finance"
    }
  ],
  "taxonomies": [
    {
      "name": "/News/Business News/Company News",
      "score": 0.97705078125
    },
    {
      "name": "/Finance/Investing/Other",
      "score": 0.93701171875
    },
    {
      "name": "/News/Business News/Financial Markets News",
      "score": 0.7939453125
    },
    {
      "name": "/News/Business News/Other",
      "score": 0.7529296875
    },
    {
      "name": "/Real Estate/Other",
      "score": 0.48388671875
    },
    {
      "name": "/Real Estate/Property Development",
      "score": 0.4580078125
    },
    {
      "name": "/Finance/Investing/Stocks & Bonds",
      "score": 0.408935546875
    }
  ],
  "sentiment": {
    "positive": 0.86197764,
    "negative": 0.02019274,
    "neutral": 0.11782955
  },
  "summary": "DLP Capital, a private real estate investment firm in Florida and Pennsylvania, has been named to the Inc. 5000 list of America’s fastest-growing private companies for the 13th consecutive year. The list is published once per year by Inc. Magazine and is determined by cumulative revenue growth over the past three years. Companies must be “privately held, for profit, based in the U.S., and independent” to qualify. This year, DLP ranked at #3,821 on the list, #344 in Florida, and #86 in the real estate category. The company's founder and CEO, Don Wenner, credits his discipline and trust in investors, sponsors, residents, and employees.",
  "shortSummary": "DLP Capital, a Florida-based real estate investment firm, was named to the Inc. 5000 for the 13th year for achieving significant revenue growth despite economic challenges.",
  "translation": "",
  "translatedTitle": "",
  "translatedDescription": "",
  "translatedSummary": "",
  "reprint": true,
  "reprintGroupId": "e9991ba410484e31be28be310493669d",
  "places": [],
  "scraped_sources": [],
  "argos_summary": "DLP Capital has been recognized on the Inc. 5000 list of America’s fastest-growing private companies for the 13th consecutive year, ranking #3,821 overall and #86 in the real estate category. The firm, which specializes in attainable workforce housing, has demonstrated significant growth despite economic challenges, with a focus on expanding its portfolio of multifamily and rental properties. Founded in 2006, DLP Capital manages over $5.25 billion in assets and aims to address America’s housing crisis.",
  "argos_id": "GLMY4IE4Z"
}